{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":140850796,"authorName":"Rebecca DeLong","from":"Rebecca DeLong &lt;elfmama@...&gt;","profile":"elfmama_2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]tounge piercing kinda OT","postDate":"1051201221","msgId":65682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwNDI0MTYyMDIxLjY2MDY5LnFtYWlsQHdlYjgwMDA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDE0OC5mZWFjMzM5LjJiZDg0YWE0QGFvbC5jb20+"},"prevInTopic":65640,"nextInTopic":0,"prevInTime":65681,"nextInTime":65683,"topicId":65640,"numMessagesInTopic":0,"msgSnippet":"This may be a little gross, so be forwarned. :-)     I just have to say, It will most likely NEVER be an issue, but I tell everyone I know who has taken out","messageBody":"<div id=\"ygrps-yiv-1358014226\">This may be a little gross, so be forwarned. :-)     I just have to say, It will most likely NEVER be an issue, but I tell everyone I know who has taken out their tounge rings on their own. You can still get an infection. Because, if you had the ring in for a while the hole is still there, and is not closed all the way, because, when you took it out, healed tissue sealed to healed tissue - making an imperfect bond, food can still get in and may not be able to get out. This has happened too two people that I know, my brother - they caught the infection in time and he just got real sick. The other they didn&#39;t catch in time, the infection spread. But, I know of lots that have not had a problem. Most doctors will tell you that you should have the the hole surgically closed - re-coring the hole so that the tissue can can heal properly. At least that was what I was told, when I look into it, and that what they did to my brother, to keep infection from returning. Like I said, it most likely will never be an issue, but it&#39;s something that I tell anyone who has a tounge ring. Most people don&#39;t realize how dangerous a tounge piercing can be, and I think that you need to be informed. Rebecca<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rubyprincesstsg@...\">rubyprincesstsg@...</a> wrote:<br/>\n&lt;&lt;&lt;Oh, for the one who asked about my older daughter&#39;s tongue ring, she left it <br/>\nin about a year she said, she changed it several times on her own, the first <br/>\ntime after &quot;loosing&quot; a ball while out on the boat and panicking.  She said <br/>\nshe just out grew it and never put it back in.  She said she also thinks if <br/>\nshe wanted to put it back in it would go, it&#39;s been about five years since <br/>\nshe got it done I think and I guess four since it&#39;s been out.&gt;&gt;&gt;  <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] question possibly OT /THANKS","postDate":"1051127972","msgId":65640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OC5mZWFjMzM5LjJiZDg0YWE0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":65682,"prevInTime":65639,"nextInTime":65641,"topicId":65640,"numMessagesInTopic":0,"msgSnippet":"A BIG thanks to all who responded about the navel piercings.  It is DONE. Took just a couple minutes, not a drop of blood and so far all is well. One of my","messageBody":"<div id=\"ygrps-yiv-296814355\">A BIG thanks to all who responded about the navel piercings.  It is DONE.  <br/>\nTook just a couple minutes, not a drop of blood and so far all is well.<br/>\n<br/>\nOne of my son&#39;s girlfriends bled and bled when hers was done.<br/>\n<br/>\nThe place was nice and clean, they had their instruments in autoclaved <br/>\npackages, took their time, answered questions and were generally very nice.<br/>\n<br/>\nIt&#39;s not even red or swollen right now at all.  Probably helps that she <br/>\nhas/had a very thin &quot;lip&quot; of sorts at the top that they just stuck the <br/>\npiercing through and not up in the tummy area like some of the pictures we <br/>\nsaw.<br/>\n<br/>\nWe got good aftercare instructions ( just like the ones you all sent along) <br/>\nand she is THRILLED with herself.  She is typically a big baby when it comes <br/>\nto pain but not one grimace or tear from her.  It really must not have been <br/>\ntoo horribly bad.  The lady said sometimes it is, sometimes it isn&#39;t, <br/>\ndepending on the skin type, nerves that are pierced etc.<br/>\n<br/>\nShe had wanted to get it done in Myrtle Beach last month but her dad said <br/>\nabsolutely not.  Yesterday we told him &quot;we are listening&quot;  &quot;give us your <br/>\nobjections&quot;.  After the stammering and looking at the pictures she printed <br/>\noff and reading about them, the only thing he could come up with was &quot;it <br/>\nlooks trashy sometimes&quot;.  Well, that wasn&#39;t an argument, that&#39;s an <br/>\nobservation, so today he &quot;blessed&quot; the decision and even took her and showed <br/>\nit off at his office after it was done.<br/>\n<br/>\nI forwarded her the emails from you all so she knows how utterly important it <br/>\nis to keep it clean and dry and healing.<br/>\n<br/>\nThank you all so very much for your responses!<br/>\n<br/>\nOh, for the one who asked about my older daughter&#39;s tongue ring, she left it <br/>\nin about a year she said, she changed it several times on her own, the first <br/>\ntime after &quot;loosing&quot; a ball while out on the boat and panicking.  She said <br/>\nshe just out grew it and never put it back in.  She said she also thinks if <br/>\nshe wanted to put it back in it would go, it&#39;s been about five years since <br/>\nshe got it done I think and I guess four since it&#39;s been out.  She had no <br/>\ntrouble at all.  She talked kinda funny when she called me from school, but I <br/>\nthought she had a mouth full of food.  The dentist said there was a high <br/>\ninstance of tooth chipping with them but we never had that problem.<br/>\n<br/>\nThanks again to those who took the time to reassure me and pass along <br/>\ninformation!<br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":65680,"nextTopicId":65689}}