{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"pZ4NmPkluexWxRRK-pf7ytrRvn4x7rxaCme8mQ0ntBrgl3567E0TTORjHpikA3G4FoZiL-DyylxokgN3YdHRjdB9ow","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw:  Bush education &#39;miracle&#39; questioned","postDate":"972514660","msgId":13786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzEwMWMwM2VkOSQ1NzhmMmM0MCQ0NDVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13785,"nextInTime":13787,"topicId":13786,"numMessagesInTopic":0,"msgSnippet":"Very interesting.  Of course, the shrub crew was immediately out saying that the study was bought and paid for by the demos which is clearly contradicted by","messageBody":"<div id=\"ygrps-yiv-89717205\">Very interesting.  Of course, the shrub crew was immediately out saying that<br/>\nthe study was bought and paid for by the demos which is clearly contradicted<br/>\nby the fact that Rand has done several studies which were very critical of<br/>\nsome of the demo pushed agendas.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\n<br/>\n&gt; WASHINGTON, Oct. 24 -  The Texas education &quot;miracle,&quot; hailed by Republican<br/>\n&gt; presidential nominee George W. Bush as proof of his power in the<br/>\nclassroom,<br/>\n&gt; may well be a myth, according to a study to be released Tuesday.<br/>\n&gt;<br/>\n&gt;        THE STUDY BY the nonprofit RAND Corp., a private think tank, found<br/>\n&gt; that dramatic increases in tests administered by Texas are not reflected<br/>\nin<br/>\n&gt; national exams taken by the same youngsters.<br/>\n&gt;        In fact, while Texas found the gaps in achievement shrinking<br/>\nbetween<br/>\n&gt; white and non-white students, the national tests showed them actually<br/>\n&gt; increasing slightly in some areas.<br/>\n&gt;        Researchers offered no definitive explanation for the &quot;stark<br/>\n&gt; differences&quot; in results on the tests.<br/>\n&gt;        But they said it may be that Texas educators, who are awarded for<br/>\n&gt; student achievement, may coach youngsters to do well on state tests.<br/>\n&gt;<br/>\n&gt; &#39;THE &#39;TEXAS MIRACLE&#39; IS A MYTH&#39;<br/>\n&gt;        &quot;I think &#39;the Texas miracle&#39; is a myth,&quot; said Stephen Klein, a<br/>\nsenior<br/>\n&gt; RAND researcher who helped lead the study, &quot;What do Test Scores in Texas<br/>\n&gt; Tell Us?&quot;<br/>\n&gt;<br/>\n&gt;         &quot;There is nothing remarkable in Texas education,&quot; Klein told<br/>\n&gt; Reuters. &quot;With few exceptions, notably fourth-grade math, gains in Texas<br/>\nin<br/>\n&gt; recent years were about the same as in the (rest of the) United States.&quot;<br/>\n&gt;        Bush, Texas governor since 1995, has cited big increases in state<br/>\n&gt; test scores as evidence he has turned around his schools and can upgrade<br/>\nthe<br/>\n&gt; nation&#39;s classrooms.<br/>\n&gt;        Mark Fabiani, a deputy campaign manager for Democratic presidential<br/>\n&gt; nominee Al Gore, jumped on the RAND study, saying, &quot;The very foundation of<br/>\n&gt; the Bush campaign just crumbled.&quot;<br/>\n&gt;        &quot;This RAND report reveals serious questions about Mr. Bush&#39;s<br/>\nrepeated<br/>\n&gt; claims that his education reforms have worked,&quot; Fabiani said.<br/>\n&gt;        Gore&#39;s running mate, Joseph Lieberman, added, &quot;We all hope and pray<br/>\n&gt; for miracles, but they are not occurring in the Texas school system.&quot;<br/>\n&gt;<br/>\n&gt; HEAT FROM BUSH CAMPAIGN<br/>\n&gt;        The report immediately drew heat from the Bush campaign for its<br/>\n&gt; narrow focus on the state of Texas, its seeming contradiction with an<br/>\n&gt; earlier, more comprehensive Rand study praising the state&#39;s academic<br/>\n&gt; achievements and the timing of its release.<br/>\n&gt;        &quot;It&#39;s findings are erroneous,&quot; said Bush spokeswoman Karen Hughes.<br/>\n&gt; &quot;The timing is highly suspect.&quot;<br/>\n&gt;        Rand President James Thomson said timing of the paper&#39;s release was<br/>\n&gt; based only on completion of peer reviews and revision. &quot;We don&#39;t produce<br/>\n&gt; findings for political reasons,&quot; he said.<br/>\n&gt;        Klein said his research singled out Texas because its state test<br/>\n&gt; scores rose sharply and were widely publicized. The work began last spring<br/>\n&gt; and was funded by the think tank and not outside groups, he said.<br/>\n&gt;<br/>\n&gt; METHODOLOGY QUESTIONED<br/>\n&gt;        Bush spokesman Dan Bartlett said a number of other studies,<br/>\nincluding<br/>\n&gt; one released by the RAND Corp. in July, showed Texas among those leading<br/>\nthe<br/>\n&gt; nation in reducing the achievement gap between white and non-white<br/>\nstudents.<br/>\n&gt; He also questioned the methodology used by the researchers.<br/>\n&gt;        &quot;This new study is based on only 20 school districts out of 1,044<br/>\nin<br/>\n&gt; Texas,&quot; Bartlett said. &quot;It is not representative of Texas.&quot;<br/>\n&gt;        &quot;He obviously didn&#39;t read the study,&quot; Klein replied. &quot;We looked at<br/>\n&gt; schools in every district. This study has the latest data.&quot;<br/>\n&gt;        &quot;We started this project in April and it has nothing to do with the<br/>\n&gt; election,&quot; Klein said. &quot;We wanted to find out what was going on in Texas.&quot;<br/>\n&gt;        The report compares scores from Texas&#39; own test, the Texas<br/>\nAssessment<br/>\n&gt; of Academic Skills test, with Texas students&#39; performance on the National<br/>\n&gt; Assessment of Academic Progress, a national sampling test used voluntarily<br/>\n&gt; by 44 states.<br/>\n&gt;        Looking at how fourth- and eighth-graders scored in reading and<br/>\nmath<br/>\n&gt; from 1994 to 1998, it found that Texas children made higher gains on the<br/>\n&gt; state test than on the national test. For instance, Texas fourth-graders<br/>\n&gt; improved in reading from 1994 to 1998 at about the same rate as other<br/>\n&gt; children nationwide, but the state tests showed far greater gains in<br/>\n&gt; reading.<br/>\n&gt;        &quot;The large discrepancies between TAAS and NAEP results raise<br/>\nserious<br/>\n&gt; questions about the validity of the TAAS scores,&quot; RAND researchers wrote.<br/>\n&gt;        &quot;We do not know the sources of these differences,&quot; they said.<br/>\n&gt; &quot;However, one plausible explanation ... is that many schools are devoting<br/>\na<br/>\n&gt; great deal of class time to highly specific TAAS preparation.&quot;<br/>\n&gt;        The report said another factor can be that though the TAAS exam<br/>\n&gt; changes year to year, &quot;one version looks a lot like another.&quot;<br/>\n&gt;        &quot;Thus, giving students instruction and practice on how to answer<br/>\nthe<br/>\n&gt; specific types of questions ... could very well improve their scores,&quot; it<br/>\n&gt; said.<br/>\n&gt;        &quot;In an effort to improve their TAAS scores, some schools have<br/>\n&gt; retained outside contractors to work with teachers, students or both,&quot; it<br/>\n&gt; said.<br/>\n&gt;        The report said the starkest differences between Texas students&#39;<br/>\n&gt; performance on the state test and the national test were among the race<br/>\ngaps<br/>\n&gt; between white and minority children. On the national test, the race gap<br/>\nwas<br/>\n&gt; large and increased slightly. The Texas test showed a much smaller gap,<br/>\n&gt; decreasing slightly.<br/>\n&gt;        Klein said one possible explanation for the high number of students<br/>\n&gt; doing well in the Texas exam is that TAAS is not particularly tough, so<br/>\neven<br/>\n&gt; less skilled youngsters are able to score as well - or nearly as well - as<br/>\n&gt; more accomplished ones.<br/>\n&gt;        The Texas tests are used to decide whether children move to the<br/>\nnext<br/>\n&gt; grade or graduate - and to reward or punish their schools, mostly through<br/>\n&gt; funding.<br/>\n&gt;<br/>\n&gt;        The Associated Press and Reuters contributed to this report.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Freedom for Leonard Peltier<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.petitiononline.com/Clemency/petition.html\">http://www.petitiononline.com/Clemency/petition.html</a><br/>\n&gt; You help is appreciated<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ndn-aim-unsubscribe@egroups.com\">ndn-aim-unsubscribe@egroups.com</a><br/>\n&gt; To subscribe to this group,send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ndn-aim-subscribe@egroups.com\">ndn-aim-subscribe@egroups.com</a><br/>\n&gt; Archived on line at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.eScribe.com\">http://www.eScribe.com</a><br/>\n&gt; FREE LEONARD PELTIER<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":13784,"nextTopicId":13787}}