{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"braunville@aol.com","from":"braunville@...","replyTo":"LIST","senderId":"FCmmFQjOOzeqk4TUUdSanz5OcQ0Lld7uz8WodbSR3dRXp3xKjSyybGKsuESmR4tLwPXIyYsFwR7w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"AOL filter, reply function","postDate":"967500965","msgId":12239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwLjI4ZmY1MTguMjZkYzNlYTVAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":12238,"nextInTime":12240,"topicId":12239,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/28/2000 12:01:05 PM Pacific Daylight Time, ... AOL filter comes with AOL email/internet use.  He has his own screen name and email","messageBody":"<div id=\"ygrps-yiv-457191555\">In a message dated 8/28/2000 12:01:05 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starshine_lal@...\">starshine_lal@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, a question: WHAT IS &quot;AOL&#39;S FILTER&quot; FOR THE INTERNET AND HOW DO I GET <br/>\n&gt;  THAT AND HOW MUCH DOES IT COST? We just got our computer and have no <br/>\n&gt;  &quot;filter&quot;.<br/>\n<br/>\n </span></blockquote>AOL filter comes with AOL email/internet use.  He has his own screen name and <br/>\nemail address.  So, he enters the internet through his screen name, and the <br/>\nprogram won&#39;t allow him to visit certain sites.  Another important <br/>\nconsideration for AOL is that the filter is set to not allow his screen name <br/>\nto spend $$ online.  I&#39;ve known people who go to game sites and play games, <br/>\nhaving no idea there is a charge.  I really wanted to avoid that.<br/>\n<br/>\nWe do run into some problems where ds is looking something up that AOL <br/>\nfilters think is offensive.  An example would be that he can&#39;t get onto <br/>\nwebsites that have the word &#39;breast&#39;.  Even if it is a medical or educational <br/>\nusage.  For those times, I turn off the filter and help him find his way <br/>\naround.<br/>\n<br/>\nThere are different general age settings.  I quickly discovered that his <br/>\nneeded to be set for young adult.  The child settings were so restrictive <br/>\nthat he was locked out of all kinds of websites that I considered appropriate.<br/>\n<br/>\nOTOH, the filters are useful for his email, too.  I can set it so that he <br/>\ncannot receive any attachments or pictures.  This keeps porn off his email, <br/>\nfor instance.  <br/>\n<br/>\nThere are other filters you can get for your computer.  I haven&#39;t done <br/>\nresearch on it, just know they are available.  A problem I&#39;ve run into, <br/>\npersonally, is entering a .com name hoping find a particular website, only to <br/>\nfind it was a porn site using an innocent sounding name.  I can&#39;t think of an <br/>\nactual example at the moment, but it can be quite a shocker to enter &quot;go to <br/>\nthe beach.com&quot; and get a porn site!  Another good reason for a filter.  It&#39;s <br/>\nnot so much a matter of not trusting my son as much as not trusting the <br/>\nwebsite owners.  (Besides, he&#39;s smart enough it wouldn&#39;t take much for him to <br/>\nfigure out how to turn the filter off, if he decided he wanted to!)<br/>\n<br/>\nAs for using the &#39;reply&#39; feature.  It varies from list to list.  This list is <br/>\nset up so that &#39;reply&#39; automatically goes to the entire list.  I think the <br/>\ntheory is that we can all benefit from each other&#39;s responses.  (At least I <br/>\nfind that to be true!)<br/>\n<br/>\nIf there is a topic you want to discuss personally with someone, simply cut <br/>\nand paste their address into the &#39;send to&#39; box on your email form, deleting <br/>\nany extra addresses that find their way to the form, if needed.  For this <br/>\nlist, you&#39;ll find the address of the person who posted the message in the <br/>\n&#39;From:&#39; section of the header.  Typically, I highlight the part I&#39;m <br/>\nresponding to and use the forward key to transfer the text to a clean email <br/>\nform.  Then cut/paste the address, complete and send the email.  <br/>\n<br/>\nA word of caution, some people find it offensive to receive personal email <br/>\nfrom a list member.  I don&#39;t know how others here feel about it, but I&#39;ve <br/>\nbeen on a couple of lists where it is very offensive.  It is fine with me and <br/>\nI&#39;ve never received offensive personal responses or inappropriate spam.  So <br/>\nfar, no one has complained when I send a personal response, either.  Just be <br/>\naware and use common courtesy in your posts (like that&#39;s a problem, I&#39;m <br/>\nsure!).<br/>\n<br/>\nEiraul</div>","specialLinks":[]}],"prevTopicId":12236,"nextTopicId":12241}}