{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"an old thing I found while looking for the &quot;Holly in a Play/Late Reading&quot; post...","postDate":"1056555258","msgId":75473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjZS5jYWZkNTU3LjJjMmIxYWZhQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":75472,"nextInTime":75474,"topicId":75473,"numMessagesInTopic":0,"msgSnippet":"http://groups.yahoo.com/group/Unschooling-dotcom/message/65630 Okay.  Thanks to the finder of this!!  (Ang, thanks!)  I ll put it on the reading page so it","messageBody":"<div id=\"ygrps-yiv-1598658912\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom/message/65630\">http://groups.yahoo.com/group/Unschooling-dotcom/message/65630</a><br/>\n<br/>\nOkay.  Thanks to the finder of this!!  (Ang, thanks!)  I&#39;ll put it on the <br/>\nreading page so it will be easier to find next time (and if I find out it&#39;s <br/>\nalready there, I&#39;ll be truly embarrassed!).<br/>\n<br/>\n<br/>\nFrom here down is what I found while looking.  If I had read ALL my e-mail <br/>\nbefore looking, I wouldn&#39;t have found this.  That could be good, or that could <br/>\nbe bad. &lt;bwg&gt;<br/>\n<br/>\nThere are a couple of things below which have changed since it was written, <br/>\nboth about TV. &lt;g&gt;  One is we don&#39;t get TV Guide anymore, and people do channel <br/>\nsurf *kind of* (meaning I don&#39;t notice, and they usually know what&#39;s on, as I <br/>\ndid when I was a kid, concerning favorite shows).  Unless someone&#39;s sitting <br/>\ndown to do something with their hands and they want noise on, I don&#39;t see <br/>\nanyone just clicking through channels.  More often they put on a CD or a video/DVD <br/>\nif they want something just for background.<br/>\n<br/>\nI was looking for a clue to when it was written, and skimmed to find Holly <br/>\nwas four and Kirby hadn&#39;t started karate, so it was seven or eight years ago, <br/>\n1995ish.  It seems it was an e-mail for one worried person, based on an e-mail <br/>\nexchange with another one.<br/>\n<br/>\nQuote starts:<br/>\n<br/>\nThis was sent in response to a worried mom.   Take what you can use and <br/>\nforget the rest.<br/>\n<br/>\n<br/>\n&lt;&lt; If they&#39;re college-bound, don&#39;t they need to have studied history, <br/>\nmathematics, science, literature, etc.?&gt;&gt;<br/>\n&lt;&lt; Mine just wants to play and although I know play is valuable, I don&#39;t see <br/>\nwhat he has learned from it (academically).  What about higher math, <br/>\nchemistry, writing, etc.? &gt;&gt;<br/>\n<br/>\nYour kid is eleven years old!  Do you play with him?  Do you have pattern <br/>\nblocks or board games or card games or computer games you do together?  There are <br/>\nLOTS of opportunities to discuss things during play, to explain how things <br/>\nwork, why, what certain toys represent in the real world (playing Lego we&#39;ve <br/>\ntalked about real masonry, catapults, horses, armor, weapons---while messing with <br/>\nplastic representations).<br/>\n<br/>\n&lt;&lt;He forgot to capitalize, put periods, or quotation marks and his sentences <br/>\nwere incomplete.  Do you teach these things to your children? Perhaps you <br/>\ndon&#39;t use an actual program but gently show him how to punctuate or spell the <br/>\nwords?&gt;&gt;<br/>\n<br/>\nMine aren&#39;t writing, except in a rudimentary way yet.   They see me and my <br/>\nhusband write all the time, though. I&#39;m not worried.  We always answer their <br/>\nquestions, and they&#39;ll ask.<br/>\n<br/>\n&lt;&lt;Do you make them look up the words? &gt;&gt;<br/>\n<br/>\nI don&#39;t make ANYBODY look up words.  I&#39;ll look them up for them.  I&#39;m a <br/>\ndictionary fiend, and nobody--adults, friends, relatives, nobody--gets away from me <br/>\nwithout at least FAKING an appreciation for dictionaries. &lt;g&gt;<br/>\n<br/>\n&lt;&lt; As Adrienne said, even to help the kids find areas they are interested in, <br/>\nmeans work on her part.  She has to be aware that she needs to tell them to <br/>\ndo an art project, for ex..  She can&#39;t leave them totally alone or they would <br/>\ndo nothing productive.&gt;&gt;<br/>\n<br/>\nIf she did art in front of them they would want to do it too.  If she NEVER <br/>\ndoes art on her own, what makes her think her kids need to know how?<br/>\n<br/>\n&lt;&lt; For ex., unless she teaches them about composers or great artists or <br/>\nAncient Greece or latin, etc., she doesn&#39;t think they would ever willingly or <br/>\nknowingly learn about these things.  As for writing, how will they learn the fine <br/>\npoints of grammar unless they are taught?&gt;&gt;<br/>\n<br/>\nShe can &quot;expose&quot; them to those topics without &quot;TEACHING&quot; them in a <br/>\nstructured, scheduled way.    The fine points of grammar are not necessary to those who <br/>\ndon&#39;t want to write.  To those who DO like that sort of analytical stuff, she <br/>\njust needs to offer them the vocabulary and they&#39;ll figure out on their own.  <br/>\nThere are computer games, paper-games...<br/>\n<br/>\nI personally disagree with the limiting TV to 1.5 hours after 5:00.  Some of <br/>\nthe best stuff for kids is on PBS in the daytime.  After 5:00 things get iffy. <br/>\n Helen, on the other hand, doesn&#39;t have a TV.<br/>\n<br/>\n&lt;&lt;What if your child (like mine) has an interest in one area (Civil War), yet <br/>\nhardly reads about it and never shows an interest in other historical periods <br/>\n(mine does, luckily)?&gt;&gt;<br/>\n<br/>\nVideos.  Novels.  Ignore the periods he doesn&#39;t care about.  He&#39;ll care <br/>\nlater, or he won&#39;t, and the world will still turn, and he can learn what he wants <br/>\nWHEN he wants.  History is NEVER all learned.  It&#39;s all relative.  &quot;Knowing <br/>\nnothing&quot; is impossible in this culture.<br/>\n<br/>\n&lt;&lt; My son loves to read, but it&#39;s Berenstain Bears chapter books, Garfield <br/>\nbooks, Superman comics, or Hardy Boys.  All twaddle.  No classic books, and he <br/>\nhas them all&gt;&gt;<br/>\n<br/>\nHe&#39;s too young.  Fifth graders in school are not reading &quot;classic books&quot; <br/>\nunless forced, and then they&#39;re not very hard ones (with a few exceptions, which <br/>\nbeing exceptions don&#39;t count).   You should be reading to him, if you want him <br/>\nto &quot;know&quot; a certain book--&quot;classics&quot; are not easy, generally, and you could <br/>\nread to him.<br/>\n<br/>\n&lt;He says he loves science, but almost never looks at any of the many Usborne <br/>\nbooks we have or other science-type books.&gt;&gt;<br/>\n<br/>\nRead them to him, or pay him to read them aloud to you.<br/>\n<br/>\n&lt;&lt;He has a whole collection of civil war books, but only looks at the <br/>\npictures in the books.&gt;&gt;<br/>\n<br/>\nI have a huge collection of non-fiction books, mostly history, and some of <br/>\nthem I only look at the pictures in, but when I need to look up details I can <br/>\nusually remember by the pictures which books dealt with what subjects.<br/>\n<br/>\n&lt;&lt;Word problems are almost impossible for him; I have to hold his hand and <br/>\nguide him through them and basically do them for him. &gt;&gt;<br/>\n<br/>\nNo big deal.   He&#39;s young.<br/>\n<br/>\n&lt;&lt;Even in cooking, I don&#39;t think he can multiply fractions although he&#39;s <br/>\ndoing it on paper! &gt;&gt;<br/>\n<br/>\nNo big deal.   He&#39;s young.<br/>\n<br/>\n&lt;&lt; When we got 2 puppies this summer, he would not even read the books I got <br/>\nhim about puppy care and training! &gt;&gt;<br/>\n<br/>\nDid you read them?  Did you tell him what was in them?  Did you read any to <br/>\nhim?  Did you ask him to look something particular up?  (He&#39;d probably read <br/>\nother stuff on the side if he went hunting for a particular piece of information.)<br/>\n<br/>\n&lt;&lt;Do you teach (or attempt to) your kids anything formally?&gt;&gt;<br/>\n<br/>\nNo.<br/>\n<br/>\n&lt;&lt;She can&#39;t leave them totally alone or they would do nothing productive.&gt;&gt;<br/>\n<br/>\nShe thinks that but can&#39;t prove it, because she probably won&#39;t leave them <br/>\ntotally alone long enough to see what they would do.    At Halloween our kids can <br/>\neat all the candy they want, and if they don&#39;t like it we encourage them to <br/>\nchuck it in the trash.  Other families ration it out, it lasts a month and the <br/>\nkids eat every last crumb because it is VALUABLE.  Ours is cheap trash, and <br/>\nhalf goes in the trash.<br/>\n<br/>\nIt&#39;s a study in economics.  I have forced my kids to watch TV if they weren&#39;t <br/>\ngetting along, and they&#39;d beg to get up and play and I&#39;d say &quot;wait until this <br/>\nshow is over.&quot;  &quot;We don&#39;t like it.&quot;  &quot;I don&#39;t care.  Just sit.&quot;    I&#39;m <br/>\nserious.   A couple of times, but it was all it took.   If I use their room for <br/>\npunishment they&#39;ll see it as a prison.  <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n&lt;&lt;My dau. channel surfs, so she probably would choose cartoons over PBS. &gt;&gt;<br/>\n<br/>\nWe don&#39;t channel surf.  Even before we had kids, we subscribed to TV Guide <br/>\nand unless we know what&#39;s on and what we intend to watch, we don&#39;t turn it on.  <br/>\nKids have learned that from  us.<br/>\n<br/>\n&lt;&lt;Rescue 911, Unsolved Mysteries&gt;&gt;<br/>\n<br/>\nIt&#39;s interesting--we don&#39;t limit TV, but my kids have never seen either of <br/>\nthose shows. &lt;g&gt;   <br/>\n<br/>\nPBS has music, kid-shows, stories, science shows...<br/>\n<br/>\n&lt;&lt; My dh makes comments to him like, &quot;You know, Ricky, when I was your age I <br/>\nhad already read Robin Hood and King Arthur.  I have them here for you to <br/>\nread.&quot;  &gt;&gt;<br/>\n<br/>\nThat probably isn&#39;t helping.  Ricky probably just feels more self-conscious <br/>\nand might resist reading the books, feeling that when he does he&#39;s just <br/>\n&quot;finally&quot; doing what  his dad wanted him to do, instead of what HE wants to do.<br/>\n<br/>\n&lt;&lt;Science has never been an interest of mine.  I would fall asleep if he read <br/>\nthem aloud to me.  He likes science, though; I guess I&#39;ll have to lay them <br/>\nout attractively so he&#39;ll see them and want to read them! &gt;&gt;<br/>\n<br/>\nCould be a genetic thing, then.  You have no interest in geology, biology, <br/>\nmeteorology, chemistry, physics, oceanography, botany, entomology, astronomy, <br/>\nflight mechanics, electricity--NOTHING!?   Did school ruin your joy in knowing <br/>\nhow things work and what they are made of?   <br/>\n<br/>\n&lt;&lt; I guess I&#39;ll get them down and tell him to go to it.  I&#39;m just not <br/>\ninterested in getting involved in them.&gt;&gt;<br/>\n<br/>\nIf they&#39;re that boring and uninteresting, don&#39;t make him do them.   If you, <br/>\nknowing what they&#39;re good for, can&#39;t stand the thought of touching them, don&#39;t <br/>\nexpect him not to pick up on that.  Maybe it would be better to let him wait <br/>\nand get interested on his own than for him to sense that he&#39;s doing something <br/>\nyou think is odious.<br/>\n<br/>\n&lt;&lt; What would you do?  Just tell him to go ahead and read the books in his <br/>\nlibrary?  Plan a unit study?  Just read the novels together and rent videos?  <br/>\nGive him projects (excuse me, suggest projects) to do?  He obviously wants me <br/>\ninvolved since he could study it on his own any time he wanted to.  He wants me <br/>\nto direct him, I guess.&gt;&gt;<br/>\n<br/>\nAsk HIM what he wants.  Have you done the museum/bookstore/library circuit?  <br/>\nCostume books?  Foods of the period?  Architecture of the period?   Books on <br/>\nguns, cannons, bayonets--whatever of the period?  I wouldn&#39;t petrify it into &quot;a <br/>\nunit study,&quot; but be on the lookout for good stuff.<br/>\n<br/>\n&lt;&lt; I feel like I&#39;m the one home schooling.  I read so much, at least 2-3 h<br/>\nours a day, at least.  About all sorts of things.  I read instead of cleaning <br/>\nhouse, home schooling, paying bills, or whatever!  I want to learn italics so I <br/>\ngot me a book to learn how.  I wanted to learn about the Catholic religion; <br/>\nI&#39;ve been reading tons of books.  I wanted to learn about British History--I&#39;ve <br/>\nbeen reading biographies.  Will my kids ever do this?&gt;&gt;<br/>\n<br/>\nYES!<br/>\n<br/>\nNext level to work toward:   Forget about the concept of &quot;homeschooling&quot; and <br/>\ntry to move toward the idea that your home/life/family is involved in learning <br/>\nall the time, so that you don&#39;t feel foolish learning all the time, and your <br/>\nson can&#39;t think of any other way to live.<br/>\n<br/>\n&lt;&lt;So, what do you do in a day?  Or rather, what do the kids do? &gt;&gt;<br/>\n<br/>\nToday, support group meeting (I updated the list, which involved some phone <br/>\ncalls to get spellings of kid-names and verify some info), and I kept two kids <br/>\nfor moms who had stuff to do (surgery for ovarian cyst, in one case), and <br/>\npicked up a kid in our group whose mom&#39;s car wasn&#39;t running.  Took five kids to <br/>\nthe video store to rent games (dollar day) and a movie, brought them all to my <br/>\nhouse, counseled a depressed friend in Toronto, discussed history and <br/>\nphilosophy with a e-mail group from Ontario while the kids played video games, the <br/>\nlittle girls played with homemade playdough and watched their videos, played <br/>\nhouse, went back to the park hoping the jumpropes we left weren&#39;t stolen (they <br/>\nweren&#39;t), kids talked about adding numbers.  1+2+3+ (etc. and all the totals, as <br/>\nthey went).  I wasn&#39;t in that conversation, although I was overhearing it.   <br/>\nThere was a big tag game in the front yard for a while, and a battle of knights <br/>\nin the backyard, treehouse was a castle, kids had &quot;boffers&quot; (padded toy <br/>\nswords)...   My husband came home with some groceries, grabbed recorders and music <br/>\nand went to a Renaissance dance music practice.  There&#39;s another one here <br/>\ntomorrow night (rehearsal for some dancing in three weeks), and I need to have the <br/>\nliving room clean enough for that.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n&lt;&lt; I think I feel (for what reason?) that I need to be there to see what he&#39;s <br/>\nlearning.  Maybe I should just let him do them on his own and tell me about <br/>\nthem or ask for help if he needs it.&gt;&gt;&gt;<br/>\n<br/>\nBecause teachers document stuff.  You want to do your teacherly job and <br/>\nsupervise and document.   Even if he does them on his own and does NOT tell you <br/>\nabout them he&#39;s still learning.   You have to develop a faith and a trust which <br/>\nschool conditioned out of you.  You&#39;re not the only one.<br/>\n<br/>\n&lt;&lt;He&#39;s adopted!  I remember as a kid liking to collect rocks and bugs.  In <br/>\nhigh school biology was pretty cool.  Chemistry, meteorology, mechanics, <br/>\nelectricity and physics--ugh.  In college I took zoology--just okay.  I think as a <br/>\nkid I liked to learn about birds, too.  Oceanography--the creatures are pretty <br/>\n&lt;g&gt;, amazing, really.  I&#39;m more interested in the people of science, their <br/>\nlives.  You know, Madame Curie, Thos. Edison, Enrico Fermi, Louis Pasteur, A. <br/>\nBell, etc.  Don&#39;t really care about how things work or what they&#39;re made of.  I do <br/>\nlike math though--loved working out those trig proofs, doing Algebra <br/>\nproblems.   <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>AHA!!!!  Good.  There&#39;s hope for him not to inherit your problems.  &lt;g&gt;<br/>\nSo it&#39;s amazing.    You remember LIKING science but you said science was so <br/>\nboring you would fall asleep hearing your own child read to you.   That evil <br/>\nconditioning again!    Don&#39;t think of it as science--granulate it.  Think of it <br/>\nas &quot;a book about birds,&quot; and &quot;an article about volcanos&quot; and so forth. <br/>\n<br/>\nI don&#39;t even teach my kids the concepts of &quot;science&quot; and &quot;history&quot; and <br/>\n&quot;geography&quot;--we&#39;ll say &quot;let&#39;s read about Rome&quot; or &quot;let&#39;s read about stars.&quot;  They&#39;ll <br/>\nfigure it out but by then they&#39;ll know the parts.    School messes people up.<br/>\n<br/>\n&lt;&lt; His grandmother had a real union uniform custom made for him.  He has a <br/>\ncap, insignia, haversack, gun, canteen, etc.  He&#39;s been to the Gettysburg <br/>\nre-enactment. He&#39;s taking drumming lessons; specifically civil war drumming!   He <br/>\nplays civil war computer games.  He has a bunch of civil war movies.  He met the <br/>\ndirector of the movie &quot;Gettysburg&quot;.  But he wants me to &quot;study&quot; it with him!<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>Sounds wonderful!   I&#39;ll tell you what--I&#39;m the way he is but about the <br/>\nmiddle ages.  We&#39;ve been involved in the Society for Creative Anachronism 20 and 19 <br/>\nyears, my husband and I.   By knowing the minutest details of one period of <br/>\nhistory you get the idea that there are similar minute details about every <br/>\nother one.  When I talk to friends who do civil war reenactment, or Regency (they <br/>\ndance and play cards a lot &lt;g&gt;), I understand immediately that there are <br/>\ncertain foods, courtesies, superstitions, songs, etc. that they must have found out <br/>\nabout, and that they know WHY people were doing what they were doing (i.e. <br/>\nthat there are motivations out the wazoo concerning any historical period or <br/>\nevent), and it&#39;s more the concepts than the facts which are important.   <br/>\n<br/>\nWhat I&#39;m trying to say is if your kid wants to learn about the Napoleonic <br/>\nwars, it won&#39;t take him half a day to ask the important questions.  He already <br/>\nhas the grid in his head to fill out.   What were they eating?  How were <br/>\nregiments communicating with one another?  Did their uniforms work for or against <br/>\nthem?   What was the command structure and how dedicated to their cause were <br/>\nthey?  What were their beliefs about the motivations of the enemy?<br/>\n<br/>\n&lt;&lt;BTW, are your kids involved in activities like music lessons, sports, <br/>\ngymnastics, etc?  Do you do support group activities?  Our activities (and we&#39;ve <br/>\ncut back to one music lesson and one sports lesson a week, each, plus support <br/>\ngroup stuff) keep us pretty busy.&gt;&gt;<br/>\n<br/>\nNo, not yet.   The 4-yr-girl wants to take gymnastics and the boys were <br/>\nsigned up for a defense class which fell through and are kind of bugging us for <br/>\nkarate.  I have nothing particular against group activities except that I tend to <br/>\nget sucked into management, newsletters, etc. whenever I get near a group <br/>\nactivity and right now I&#39;m trying to avoid any more commitments on our time and <br/>\nenergy.  <br/>\n<br/>\n&lt;&lt; All is quiet and I want a thin mint girl scout cookie! &gt;&gt;<br/>\n<br/>\nYou can eat just one!?<br/>\n<br/>\n&lt;&lt; a friend and the county extension agent are coming over to discuss whether <br/>\nwe want to start a 4-H group.&gt;&gt;<br/>\n<br/>\nI was hit up about starting a 4-H group.  Sound AWFUL.   (I must really be in <br/>\na commitment avoidance phase &lt;g&gt;.)    I was in 4-H as a kid.   Learned to <br/>\narrange flowers and identify seeds, and sang songs.  That part I could <br/>\nhandle--leading songs.<br/>\n<br/>\n&lt;&lt; Is this all we need to do?  Sounds like fun!&gt;&gt;<br/>\n<br/>\nSounds like about six times as much as the best school in the country does <br/>\n&lt;g&gt;.<br/>\n<br/>\nI can&#39;t imagine having a husband who would threaten me that HE (yeah right) <br/>\nwould put OUR children in school against my wishes.   My husband knows I don&#39;t <br/>\ndo things lightly, and he trusts me.<br/>\n<br/>\nAs to having been a teacher, I was a radical teacher.  The things I believe <br/>\nabout how children learn were taught to me in college.  I was an English major, <br/>\nbut had the requisite 24 hrs of education classes, and had a psychology <br/>\nminor.  When I taught I was (as I can&#39;t help but be) very analytical about which <br/>\nteachers the kids liked and learned from and which were jokes.  It seems the <br/>\nmain factors are intelligence and enthusiasm, not method.  If there&#39;s that <br/>\nelectricity in the air of &quot;THIS STUFF IS COOL!&quot; then whether the kids are goofin&#39; or <br/>\nanswering questions at the end of the chapter, knowing that the teacher <br/>\nreally understands and enjoys the subject makes the kids believe there is actually <br/>\nsomething there worth knowing.<br/>\n<br/>\nI never used textbooks.  I used dictionaries and made up my own exercises.   <br/>\nI used a lot of humor.   I tried to make things memorable (appealing to <br/>\ndifferent learning styles, although I wasn&#39;t thinking of it in those terms in those <br/>\ndays--I just remembered having vivid memories of days/lessons in my youth when <br/>\nthere was an element of surprise).   I wasn&#39;t able to get out of <br/>\ngrading/scoring/comparing, and that was the worst heartbreak--&quot;giving F&#39;s&quot; and such.  I <br/>\nwill never, ever do that again.   My children don&#39;t fail.  I&#39;ll move the target <br/>\nto make them successes.<br/>\n<br/>\n&lt;&lt; He complains about their attitude, that school isn&#39;t everything, but some <br/>\nof it is in him still.  What can I do?&gt;&gt;<br/>\n<br/>\nWait.   Ignore.  Dodge.   When he sees your kids happy and enthusiastic about <br/>\nthings he&#39;ll know it&#39;s okay.  He NEEDS to see other homeschool families.   If <br/>\nhe won&#39;t read the books, read him the good parts in some natural fashion.   <br/>\nIf he complains don&#39;t defend yourself, but ask things like &quot;why does that <br/>\nconcern you?&quot; because he may talk himself into a corner and realize on his own that <br/>\nit&#39;s a kneejerk concern.   If he pushes you might say that as you&#39;ve read and <br/>\nstudied and he hasn&#39;t, you feel insulted that he thinks he knows more about <br/>\nit than you do, and you&#39;d be glad to discuss a particular book or article if <br/>\nhe&#39;s willing to read it.<br/>\n<br/>\n&lt;&lt;You are my hsing idol, oh great one! &gt;&gt;<br/>\n<br/>\nOH NO!!!   &lt;g&gt;<br/>\nAnd here I am looking at your descriptions and thinking your life sounds much <br/>\nmore interesting than mine!  &lt;g&gt;<br/>\n<br/>\n&lt;&lt;Ever been to Medieval Times in Orlando or in NJ?  About 1,000 people fit in <br/>\nthere and you watch knights jousting while you eat without utensils and root <br/>\nfor your knight.  It&#39;s neat.  In Orlando they have a medieval village outside <br/>\nwith a falcon show, torture chamber, people weaving, etc. etc.&gt;&gt;<br/>\n<br/>\nThere&#39;s one in California too.   I&#39;ve had friends who have been.  The bad <br/>\nthing is that the people eating are wearing modern clothes, and the food isn&#39;t <br/>\nperiod.  &lt;g&gt;<br/>\n<br/>\nWhen we have feasts the food is fancier and documentably medieval (usually), <br/>\nand everyone involved is garbed appropriately and we eat by candlelight.  They <br/>\ndon&#39;t do candlelit feasts around Virginia and Maryland, and the rest of the <br/>\ncountry thinks they&#39;re weirdos for eating by electric light &lt;g&gt;.<br/>\n<br/>\nI really like those things, but I&#39;m so tired of IT (the organization, the <br/>\namount of work I keep being expected to do to maintain it) that the magic fades <br/>\nand I take it for granted.   Nineteen years is a long, long time.  A lifetime!  <br/>\n(Ask any 19-yr-old &lt;g&gt;)<br/>\n<br/>\nSandra<br/>\n<br/>\n----------------------------------------<br/>\nend of the quote--<br/>\nI had forgotten making Marty and Kirby watch TV.     When they were little <br/>\npre-Holly sometimes I would get frazzled and we were in a very small house and <br/>\nthey were pinball boys sometimes.  They turned out okay, though Marty can still <br/>\nbe too loud too fast.</div>","specialLinks":[]}],"prevTopicId":75469,"nextTopicId":75474}}