{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sibling jeolousy and purchases","postDate":"1279898311","msgId":56346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1RjlDMDFGQzJERjRCQjRBRDJDMDkyMzkwRkIwNEI2QENvbm5pZVBDPg==","inReplyToHeader":"PGkyYzZlOCtwN2ZkQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyYzZlOCtwN2ZkQGVHcm91cHMuY29tPg=="},"prevInTopic":56345,"nextInTopic":0,"prevInTime":56345,"nextInTime":56347,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... One of the things that I have done is buy the toys from my oldest child so that the younger one could call the toys hers. My oldest didn t want to share","messageBody":"<div id=\"ygrps-yiv-689561421\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I&#39;d always put off buying stuff for my second son when we already had stacks for the older one, including plenty that was more age appropriate for the second one anyway. But when it came down to it my older son would often lay claim to it and I realised that there was very little my second son could call his own.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>One of the things that I have done is buy the toys from my oldest child so that the younger one could call the toys hers. My oldest didn&#39;t want to share the toys with her sister because she wanted to save them for a garage sale. I asked if I could buy the toys from her so that her sister could have them. It was a win-win situation because my younger daughter could claim the toys as her own and the older one got some money for her piggy bank. She has always been a money saver and loves to buy stuff for herself. Now that she is 9, she will announce that she is too old for something and willingly pass it on to her sisters. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":291337950,"authorName":"almadoing","from":"&quot;almadoing&quot; &lt;almadoing@...&gt;","profile":"almadoing","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: sibling jeolousy and purchases","postDate":"1279892744","msgId":56345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyYzZlOCtwN2ZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyOTBsZCttbWIzQGVHcm91cHMuY29tPg=="},"prevInTopic":56341,"nextInTopic":56346,"prevInTime":56344,"nextInTime":56346,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... Let me explain ... My first-born was showered with gifts for the first 4 years of her life - probably due to the fact that she was an only grandchild for a","messageBody":"<div id=\"ygrps-yiv-1889832890\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;gkcollins321&quot; &lt;gkcollins321@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>Let me explain ... My first-born was showered with gifts for the first 4 years of her life - probably due to the fact that she was an only grandchild for a while.  So by the time my 2nd daughter was born, we had a toy for every occasion.:)  Instead of buying duplicates of toys when my second was born, they always just shared toys.  This was never a problem.  Now I notice if the middle child is playing with something that my oldest wants, she (the oldest) will say,&quot;but that&#39;s mine, Mimi got that for me&quot;, and want it back.  I&#39;ve tried explaining to both girls how nice it makes people feel to share, but I just think this concept is lost on a 4 and 7 year-old most of the time.  <br/>\n<br/>\n<br/>\n-------<br/>\n<br/>\nI had this problem with my two boys. I&#39;d always put off buying stuff for my second son when we already had stacks for the older one, including plenty that was more age appropriate for the second one anyway. But when it came down to it my older son would often lay claim to it and I realised that there was very little my second son could call his own.<br/>\n<br/>\nOne day at the beach we had forgotten to pack all the buckets and spades etc so agreed to go to the beach shop to buy new ones. Both boys wanted the same spade and first I suggested different colours, then suggested scratching their initials on the handle (so if one got lost we&#39;d know whose) and then I had a revelation. These were FAMILY spades and buckets, not a set for one child and a set for the other to be fought over in a thousand ways later on. When they understood it this way, they quickly realised that instead of two big buckets they could get one big and one small (better castle design without anyone having to agree to the smaller bucket). After the success of this I now bring a lot more into the home as belonging to the family, even if, in the moment I know it will appeal to one child more than the other. Now they have smaller and more personal birthday gifts, and choose how to spend the day. And other things flow in and out of the home without the same issues of ownership. <br/>\n<br/>\nAlison<br/>\nDS1 (nearly 8) and DS2 (5)</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sibling jeolousy and purchases","postDate":"1279881485","msgId":56341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ2QjI0M0JELUZCMTEtNDY5Qi1BRjQ3LTE2QzczRjVGRTQwMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDRDNDg2RjA5LjUwNzA3MDVAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGkyODlyMitmdjV2QGVHcm91cHMuY29tPiA8NEM0ODZGMDkuNTA3MDcwNUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":56339,"nextInTopic":56345,"prevInTime":56340,"nextInTime":56342,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... Depending on age and how cut off from the process they are, kids will put groceries, gas, clothes, vacations, new car, paint ... anything and everything","messageBody":"<div id=\"ygrps-yiv-675355464\">On Jul 22, 2010, at 12:17 PM, Pam Sorooshian wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe be<br/>\n&gt; more understanding that, to kids, parents seem to spend money all the<br/>\n&gt; time on what they want. Some parents DO spend on whatever they want,<br/>\n&gt; while telling their kids they can&#39;t afford a candy bar or pack of gum.<br/>\n<br/>\n </span></blockquote>Depending on age and how cut off from the process they are, kids will  <br/>\nput groceries, gas, clothes, vacations, new car, paint ... anything  <br/>\nand everything parents buy for the house and family on the parents&#39;  <br/>\nwant list. If mom fills a whole cart full of &quot;good&quot; food for the  <br/>\nfamily when the kids would rather have spaghetti and hot dogs, then  <br/>\nwhen it comes to a candy bar or 50 cents for the toy machines that  <br/>\nthey do want and mom says no, it will come across as stingy, mean and  <br/>\nnot sharing. A mom can&#39;t explain that away because it really is!<br/>\n<br/>\nSo it helps to see the purchases for the family as what mom wants. It  <br/>\nhelps to see that they can&#39;t shift their point of view until they&#39;re  <br/>\nolder *and* feel mom takes their wants as seriously as she does her  <br/>\nown (including writing things down on a want list). It helps to share  <br/>\nwith them (like Pam&#39;s envelope of spare cash idea among others). It  <br/>\nhelps to involve them in deciding. Lots of little things will work  <br/>\ntogether to temper the feeling there will never be enough (which only  <br/>\nmakes it grow bigger.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: sibling jeolousy and purchases","postDate":"1279829297","msgId":56339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzNDUwMC45MDM4LnFtQHdlYjExMDQwOC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGkyOTBsZCttbWIzQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyOTBsZCttbWIzQGVHcm91cHMuY29tPg=="},"prevInTopic":56338,"nextInTopic":56341,"prevInTime":56338,"nextInTime":56340,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"***Now I notice if the middle child is playing with something that my oldest wants, she (the oldest) will say, but that s mine, Mimi got that for me , and want","messageBody":"<div id=\"ygrps-yiv-1222174836\">***Now I notice if the middle child is playing with something that my oldest <br/>\nwants, she (the oldest) will say,&quot;but that&#39;s mine, Mimi got that for me&quot;, and <br/>\nwant it back.***<br/>\n<br/>\nA lot of the toys that Margaux plays with were her sister&#39;s toys.  They are 7 <br/>\nyrs apart, so, by the time we would have started passing toys on to someone or <br/>\nsomewhere else, there was another child here in our family to pass them onto. <br/>\n Margaux has always assumed that these toys are hers.  There have been a few <br/>\ntimes when Chamille has told her, that &quot;no that was mine and this is who I got <br/>\nit from and this is why I got it and this is why I kept it&quot;.  It&#39;s not as if <br/>\nChamille wants any of those toys back, but somewhere inside of her she wants <br/>\neveryone to know that it belonged to her.  The only thing Chamille has held onto <br/>\nexclusively have been stuffed animals and Pokemon things.  She&#39;ll let her sister <br/>\nplay with those things, but is very clear about the ownership.  Some things she <br/>\nhas given to her sister because she sees how much joy her sister gets from it, <br/>\nand in a way it brings Chamille joy to watch her little sister enjoy something <br/>\nthat she also enjoyed.<br/>\n<br/>\nIf they were closer in age, I don&#39;t know that it would happen like that.  Even <br/>\nmy sister and I were clear about ownership of things.  We had almost everything <br/>\nfor sharing.  We had a horse stable to share, but each of us had our own little <br/>\nhorses that we did not share with each other, same with dolls.  We had doll <br/>\nfurniture and other doll accessories that we shared, but the dolls were owned <br/>\nindividually.  We shared a room, but we each had our own bed and desks and <br/>\ndressers and color schemes.<br/>\n<br/>\nMy sister had a special blanket that she carried with her everywhere.  I had a <br/>\nspecial blanket, but I didn&#39;t carry it with me, it generally stayed on my bed. <br/>\n My sister has been using my blanket with her babies.  When I visit, I still <br/>\ntease her about using *my* blanket.  Hers fell apart long ago because it was so <br/>\nused.  Mine is cool old style winnie the pooh.  Neither one of us could use it <br/>\nthough, if my mom hadn&#39;t saved it.  I have a couple of rag dolls that we played <br/>\nwith when we were kids and I have both my sister&#39;s and mine because I salvaged <br/>\nit from a &quot;get rid of&quot; pile that my sister made.  I kept it, just in case she <br/>\nchanged her mind about it later.  I also salvaged a really hideous plastic angel <br/>\nthat my sister had named &quot;sweetie&quot;, one that she insisted be put on the top of <br/>\nour Christmas tree when we were kids.  She finally decided that she didn&#39;t like <br/>\nthat angel.  I stashed it away in private after I saw one of her kids take an <br/>\nextreme liking to that thing.  The next Christmas, I gifted it to that child, my <br/>\nsister was annoyed, but her child was elated!  My mother was amused and my dad <br/>\nlaughed and laughed because that is how it was when my sister and I were young, <br/>\nmy sister loved that angel and the rest of us thought it was really ugly, but we <br/>\nlet her put it up on the Christmas tree anyway.  Here&#39;s a picture of that kind <br/>\nof angel, but her&#39;s had white hair and a blue <br/>\ndress... <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.worthpoint.com/pmimages/images1/1/0407/04/1_0cd6f8c9fb29f1c50e20782996941cd0.jpg\">http://www.worthpoint.com/pmimages/images1/1/0407/04/1_0cd6f8c9fb29f1c50e20782996941cd0.jpg</a><br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197421595,"authorName":"Katy Jennings","from":"Katy Jennings &lt;kjennings95@...&gt;","profile":"coyotegoddess95","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: sibling jeolousy and purchases","postDate":"1279821824","msgId":56338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwNS1XMzNCQzMxMzVBMjVCRDMzMURCNkY5RUJFQTIwQHBoeC5nYmw+","inReplyToHeader":"PEIxNEIxQUU0LUIxRTAtNDBBMi05NUQyLUVBMzhEQ0ZDODkyMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGkyODlyMitmdjV2QGVHcm91cHMuY29tPiw8QjE0QjFBRTQtQjFFMC00MEEyLTk1RDItRUEzOERDRkM4OTIyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":56337,"nextInTopic":56339,"prevInTime":56337,"nextInTime":56339,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"====Surely in reaction to that in my life, the first time we gave our kids the same gifts at Christmas was Holly and Marty getting the same laptop the year","messageBody":"<div id=\"ygrps-yiv-36197065\">====Surely in reaction to that in my life, the first time we gave our kids the same gifts at Christmas was Holly and Marty getting the same laptop the year after Kirby moved away.===<br/>\n<br/>\nI have 2 nieces that have grown up at my house as much as at their own.  They are 6 years apart, and from very early on they have usually wanted what the other one had.  They are both fairly jealous of each other, and if one got something the other had to have it, and if they got something similar they were sure that the other one had the better one.  I have been careful to give them gifts that are either exactly alike, or so different and individual that the other girl would not want it.  This has gotten better as they have gotten older, but there is still some of this now, at 24 and 18, especially since the older one has moved back home.  <br/>\nKaty<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: sibling jeolousy and purchases","postDate":"1279819808","msgId":56337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyOXY3MCs5bjdlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyOTBsZCttbWIzQGVHcm91cHMuY29tPg=="},"prevInTopic":56336,"nextInTopic":56338,"prevInTime":56336,"nextInTime":56338,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... ***************** It feels good to *choose* to share - not so good to feel one has to because there s not enough to go around. ... feel bad even saying","messageBody":"<div id=\"ygrps-yiv-795081208\">&quot;gkcollins321&quot; &lt;gkcollins321@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve tried explaining to both girls how nice it makes people feel to share, but I just think this concept is lost on a 4 and 7 year-old most of the time.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nIt feels good to *choose* to share - not so good to feel one &quot;has to&quot; because there&#39;s &quot;not enough&quot; to go around. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;ve thought about doing an allowance (not tied to any chores, of course), but I<br/>\n </span></blockquote>feel bad even saying things like, &quot;okay well save your allowance&quot; because then I<br/>\nstill feel that this is something a conventional parent does. Not giving freely<br/>\nto the child but making them save.<br/>\n****************<br/>\n<br/>\nBut the idea of an allowance doesn&#39;t have to be one of restricting their spending - think of it instead as a tool to demystify the process of making decisions about how to spend money. In order for an allowance to be a useful tool, it helps to give enough to both spend some and save some, so that&#39;s something to take into consideration when deciding how much. It&#39;s also helpful for parents to &quot;chip in&quot; when a child wants something that&#39;s just a little more than he or she can afford (assuming its in the parents&#39; budget). And an allowance shouldn&#39;t stop parents from buying things they think the kids might like - its not a substitute for strewing or offering! Its an aid in budgetting for kids and also for parents - you&#39;re not stuck thinking &quot;should I say yes or no?&quot; as much and trying to weigh nuances in your head, your kids buy what they want with no strings attached. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: sibling jeolousy and purchases","postDate":"1279816494","msgId":56336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDNDg3MzJFLjkwODAxMDFAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PEIxNEIxQUU0LUIxRTAtNDBBMi05NUQyLUVBMzhEQ0ZDODkyMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGkyODlyMitmdjV2QGVHcm91cHMuY29tPiA8QjE0QjFBRTQtQjFFMC00MEEyLTk1RDItRUEzOERDRkM4OTIyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":56335,"nextInTopic":56337,"prevInTime":56335,"nextInTime":56337,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... Us too - and slowly, even waiting until pretty much everybody s attention is on the opener - like if someone runs off to the bathroom, we ll wait for them","messageBody":"<div id=\"ygrps-yiv-993787629\">On 7/22/2010 5:40 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Usually we go<br/>\n&gt; around and take turns so each person&#39;s gift opening has admiring<br/>\n&gt; witnesses.<br/>\n<br/>\n </span></blockquote>Us too - and slowly, even waiting until pretty much everybody&#39;s <br/>\nattention is on the opener - like if someone runs off to the bathroom, <br/>\nwe&#39;ll wait for them to come back before the next person opens a gift. My <br/>\nkids grew up thinking it was fun to watch other people open presents.<br/>\n<br/>\nBut - there have been times, even still, that a kid wants to make it <br/>\nvery clear something belongs to THEM and is not community property. I <br/>\nthink that&#39;s okay and I support it. I was oldest and had two younger <br/>\nsisters and I remember the resentment of being forced to &quot;share&quot; - it <br/>\ndoesn&#39;t make &quot;sharing&quot; into a nice gesture when it is coerced. Builds <br/>\nresistance and makes it less and less likely a kid will be generous. I <br/>\nhad to get over my negative reaction to a kid being &quot;selfish&quot; and not <br/>\nshow that to the kid, but recognize that urge for ownership as a <br/>\nlegitimate human emotion. It helped to think about neighborliness - I <br/>\nlike being friendly with my neighbors and they&#39;re welcome to borrow my <br/>\nladder, but they&#39;re not welcome to assume that anything of mine is <br/>\ntheirs to borrow. If a neighbor started borrowing too much from me, I&#39;d <br/>\nbecome resistant and not want to share at all.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sibling jeolousy and purchases","postDate":"1279815433","msgId":56335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDNDg2RjA5LjUwNzA3MDVAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGkyODlyMitmdjV2QGVHcm91cHMuY29tPg==","referencesHeader":"PGkyODlyMitmdjV2QGVHcm91cHMuY29tPg=="},"prevInTopic":56334,"nextInTopic":56336,"prevInTime":56334,"nextInTime":56336,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... Sometimes unschoolers reject some very cool activities because they seem too schoolish (cuisinairre rods, for example, which can be fun toys). Sometime","messageBody":"<div id=\"ygrps-yiv-1102209348\">On 7/21/2010 7:19 PM, gkcollins321 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; then I still feel that this is something a conventional parent does.<br/>\n<br/>\n </span></blockquote>Sometimes unschoolers reject some very cool activities because they seem <br/>\ntoo schoolish (cuisinairre rods, for example, which can be fun toys). <br/>\nSometime they reject ideas that seem schoolish (happened in a discussion <br/>\nabout critical thinking, once). And sometimes parents are monitoring <br/>\nthemselves for signs of conventional knee-jerk parenting and they hear <br/>\nthose old conventional lines going in their head and they push them <br/>\naway, &quot;No no no not going to be conventional.&quot;  It is a reaction against <br/>\nsomething, rather than a moving toward something, and leaves the parent <br/>\nfeeling helpless and not knowing what to do instead.<br/>\n<br/>\nThat&#39;s what I think is happening here when it comes to buying stuff - <br/>\nmom doesn&#39;t want to be conventional, doesn&#39;t want to be arbitrary about <br/>\nwhat she&#39;ll buy or not buy. But if the policy is &quot;Don&#39;t be arbitrary,&quot; <br/>\nit leaves a big huge gaping hole in the process - how DO we decide when <br/>\nto buy and when not to buy in a way that isn&#39;t arbitrary?<br/>\n<br/>\nFirst, you have to gear your responses to the kids, themselves - your <br/>\nkids and their personalities and ages and stages of development. People <br/>\nhere can give lots and lots of ideas, you should pick through them and <br/>\ntry the ones you think make sense for your kids right now, and save the <br/>\nothers in the back of your mind for the future when they might be useful <br/>\nas the kids grow and change.<br/>\n<br/>\nSecond, if you are handling money in a very unconscious and arbitrary <br/>\nway - spending without at least some kind of budget or plan (in your <br/>\nhead, at least, if not wrtten), then your choices ARE arbitrary and <br/>\ncapricious and your kids will be justified in being frustrated. So - it <br/>\ncould be you would benefit from sitting down and talking with your <br/>\nspouse and maybe older kids about household money. It will help them to <br/>\nknow that there is reason and thoughtful choice behind the decisions, <br/>\neven if they don&#39;t fully understand.<br/>\n<br/>\nThird  -  give them as much information as they are interested in <br/>\nknowing about how money works - little kids do NOT at all understand it. <br/>\nThey really do not know why you can&#39;t just go to the ATM and get more if <br/>\nyou&#39;re low on money right now. They figure you can use a credit card and <br/>\nspend whatever you want. The whole monetary system is not really very <br/>\napparent to kids (or to lots of adults who use credit cards like they <br/>\nare free money instead of pre-approved on-the-spot loans at exorbitant <br/>\ninterest rates).<br/>\n<br/>\nAn idea: it might help you to be very concrete - maybe have an envelope <br/>\nfor &quot;impulse buying&quot; and put the amount you can afford for impulse <br/>\nbuying in it every week. Keep that in your purse. Then you&#39;ll have a <br/>\nbudget for that kind of spending and it will be very concrete for the <br/>\nkids - if it is empty, no impulse buying today. You could use the <br/>\noutside of the envelope for a wish list.<br/>\n<br/>\nFourth - it is okay to say to kids that this whole earning income and <br/>\nspending it thing is hard to explain and that it will take some years <br/>\nfor them to fully understand it. What they need isn&#39;t to fully <br/>\nunderstand it right now, but to have confidence and trust that YOU do <br/>\nand that you are not being selfish or random in your decisions. Maybe be <br/>\nmore understanding that, to kids, parents seem to spend money all the <br/>\ntime on what they want. Some parents DO spend on whatever they want, <br/>\nwhile telling their kids they can&#39;t afford a candy bar or pack of gum.<br/>\n<br/>\nFifth - supporting your children&#39;s needs and interests DOES mean going <br/>\nout of your way and spending money. If there is a voice in your head <br/>\nsaying, &quot;They shouldn&#39;t get everything they want, just because they want <br/>\nit,&quot; ask that voice, &quot;Why not?&quot; It will probably say, &quot;They&#39;ll be <br/>\nspoiled,&quot; or some variation of that.  I was talking to Rosie about this <br/>\nand remembering how every single time we went to the grocery store or a <br/>\ndrug store or Target or any store that had candy and gum at the check <br/>\nout, she&#39;d pick something out. For years that was true. She&#39;d ask, I&#39;d <br/>\nsay, &quot;Sure.&quot; Usually tic-tacs. She&#39;d spend time while we were standing <br/>\nin line thoughtfully deciding what to get - thinking about what she&#39;d <br/>\nmost like this time and how was this or that choice last time. It might <br/>\nhave seemed to some parents that spending fifty cents to a dollar extra <br/>\non every shopping trip was going to spoil her, but it didn&#39;t at all. It <br/>\ngave her a TON of experience making choices. She is 19 and has had a job <br/>\nsince she was 15 and she&#39;s super super good with her money - she gives a <br/>\nlot of thought to purchases JUST like she&#39;s been doing since she was <br/>\nabout  7 years old.<br/>\n<br/>\nI haven&#39;t mentioned this in a long time----I went to Albuquerque and <br/>\nSandra picked me up at the airport. We didn&#39;t know each other well, yet. <br/>\nHolly was about 5 or 6 years old and was with Sandra. Holly was wanting <br/>\nplums. Sandra asked if it was okay with me to stop at the grocery store. <br/>\nI was very pleased to do that - never been to New Mexico and grocery <br/>\nstores in different states carry different things and it is interesting <br/>\nto me. We went in and looked around - no plums. Got back in the car and <br/>\nSandra asked if I minded stopping at another store - fine by me, we were <br/>\nhaving a great time talking. Still, no plums, so we stopped at one other <br/>\nstore and they had plums. YAY. Holly sat in the back seat eating plums <br/>\nand was very very happy and not at all grumpy about me taking up her <br/>\nmom&#39;s attention. We spent a long weekend together at a conference and I <br/>\nlearned a LOT, but that trip from the airport stopping at three grocery <br/>\nstores was an eye-opener in that most parents would probably think it <br/>\nwas going too far to try to satisfy the whim of a little girl.<br/>\n<br/>\nI thought about that so many times when my little girls wanted something <br/>\nand I was always very careful not to be dismissive of what they wanted <br/>\nas &quot;just whims of little girls.&quot; And now they&#39;re grown and they are <br/>\nreally great with handling money. They are downright careful with their <br/>\nmoney. When Roxana spent a few months in France a couple of years ago, I <br/>\nhad to urge her to spend more money on buying things - she was being too <br/>\nfrugal, imo. Rosie has a minimum wage job but still manages to have <br/>\nhundreds of dollars of savings at any one time and she thinks and thinks <br/>\nabout how to spend it. She is NOT an impulsive buyer at all. She&#39;s been <br/>\nconsidering buying herself a netbook and has been looking at them for <br/>\nabout 6 months - waited for some new feature to come out and, even when <br/>\nit did, she didn&#39;t rush to buy it but is still comparing and considering <br/>\nwhich one she wants. Roya lives on her own and has a real job and <br/>\nhandles all her own money just fine. She bought an economy car and makes <br/>\nsmall car payments and has good credit at 25 years old. She&#39;s going to <br/>\ngrad school and has been offered student loans and she sat down and <br/>\nfigured out exactly the minimum she felt she woud need to pay for <br/>\ntuition and books and then how much her monthly payments would be after <br/>\nshe graduated, and whether her expected future income after graduation <br/>\nwould be enough to comfortably make those payments. She and her fiancee <br/>\nare still considering it - being very responsible in thinking of the future.<br/>\n<br/>\nThinking back - lots of times I didn&#39;t say no to things but I didn&#39;t <br/>\nexactly say yes, either, but maybe &quot;Well, let&#39;s think about it.&quot; And <br/>\nthen we&#39;d proceed to kind of list the pros and cons - or I&#39;d offer an <br/>\nalternative like, &quot;Well, this costs $20, so we could buy this or we <br/>\ncould use that $20 for two kids to get into Adventure City,&quot; (somewhere <br/>\nthey&#39;d been wanting to go) and when put as a choice between alternatives <br/>\nlike that the kids would often respond with, &quot;Oh - Adventure City!!&quot; and <br/>\nlet the other thing go. A good approach to money is to think of spending <br/>\nin terms of the next best thing that could be bought with it - so I did <br/>\na lot of giving choices like that, as I recall. That seems a way to get <br/>\nacross the idea of not being able to afford it ALL, while still giving <br/>\nthe kids the chance to make choices.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] sibling jeolousy and purchases","postDate":"1279811626","msgId":56334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzQUVDMUY3RjBERjRBMDU4QzJGNzJGQjlCRDc3NUI2QENvbm5pZVBDPg==","inReplyToHeader":"PDRDNDdEOUI3LjMwNzAwMDFAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPiA8NEM0N0Q5QjcuMzA3MDAwMUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":56333,"nextInTopic":56335,"prevInTime":56333,"nextInTime":56335,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... felt very left out if their sister was taken out for her birthday by grandparents - to go to Build a Bear and have dinner just alone with them. They felt","messageBody":"<div id=\"ygrps-yiv-563594540\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;They both said that at that age they&#39;d have been really disappointed and <br/>\n </span></blockquote>felt very left out if their sister was taken out for her birthday by <br/>\ngrandparents - to go to Build a Bear and have dinner just alone with <br/>\nthem. They felt like we didn&#39;t do that kind of thing - that birthdays <br/>\nwere a time for us all to celebrate that person being born, together.&lt;&lt;&lt;<br/>\n<br/>\nWe just celebrated my oldest daughter&#39;s 9th birthday and the one thing she wanted for her birthday was to go out with just me. She wanted to go to the mall and have lunch and go shopping. She specifically asked me if we she could go without her sisters. She is the oldest of 4 so she wanted to go into the stores that we tend to avoid because the younger ones aren&#39;t quite ready to go into them yet. We know that our 6 year old gets jealous rather easily. I asked my 9 year old if her 6 year old sister could go. She was adamant that she wanted it to be just me and her. We handled it by turning the time that we were gone into getting ready for a surprise party. My husband and the 3 younger girls got the house ready to surprise us when we got home. My husband and I talked about how much fun it would be to surprise her big sister. We also had guests arrive early enough to hang out with them for a while. We also let our 6 year old in on all of the birthday secrets including the presents that her sister got. Part of getting ready for the party involved blowing up balloons and experimenting with helium. They had so much fun getting ready for us to come home that they didn&#39;t really notice that we were gone. The stuff that we bought while out didn&#39;t really get noticed because there was so much activity when we got home. <br/>\n<br/>\nThe best part of my date with my daughter was when she found something that her little sister had really been wanting. She was so excited to have found it that she asked me if we could get it for her little sister. She told me that her little sister would really love and that it would help her to not feel so left out. I thought that was really nice of her. I think it comes from the fact that we try to be sensitive to each other as a family. Once everyone left that evening, my daughter was able to give her little sister the present she had picked up for her. It was great. <br/>\n<br/>\nWhenever we go out and find something cool that we can afford, we buy it on the spot. There have been times that we have had to say no because we know that we can get it cheaper online. Or, we have to say no because we have to wait another week or two until pay day. Time and time again we have purchased items so my kids know that when I tell them no because of money, they trust that I am telling them the truth and am not just using it as an excuse. I grew up in a house where my parents would say that we couldn&#39;t afford something yet they always seemed to find the money for their sodas and for their cigarettes and for their toys. When they told me no, it always felt like they were being arbitrary. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;They said that knowing you have a child who already tends to be envious, that this was a set-up for a bad response and it is better if parents <br/>\n </span></blockquote>think ahead and set their kids up for success. (I want to add that THIS <br/>\nis what I think is the best advice possible - set your kids up for success.)&lt;&lt;&lt;<br/>\n<br/>\nThat is precisely why we were able to take one kid out. We know that our 6 year old is very envious. We tried to find things to do BEFORE she got upset. We planned it into our day because we didn&#39;t want her to take away her big sister&#39;s spot light. Our 6 year old was the birthday assistant and she got to help dad with the house and her little sisters. Her role was important but it didn&#39;t diminish her sisters spot light. She felt really special sharing the birthday surprise secrets with us. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;They also thought that mom should have been sympathetic about the 7 yo <br/>\n </span></blockquote>being disappointed in not being invited to go with grandparents and <br/>\nsister to Build-a-Bear and to dinner&lt;&lt;&lt;<br/>\n<br/>\nWas all of this sprung on the 7 year old on the day of the birthday? I find that giving people fair warning about what is going to happen helps ease some of the negative feelings. I talked to my 6 year old about going out with her big sister in advance. I told her that I had asked her big sister if she could go too but that her sister wanted time alone with just me. She wasn&#39;t happy about it but I sympathized with her. We talked about what she got to do on her birthday and how cool her birthday was. We talked about how she could help us make her big sister&#39;s birthday just as cool and special. This was done well in advance of the birthday so that on the day of the birthday it wasn&#39;t unexpected. It gave her time to digest her disappointment and talk about it. It gave her the opportunity to grouse about it in the days leading up to the birthday. It gave her and her sister a chance to talk about it too. It also gave me an opportunity to talk to her about the secret birthday stuff. We didn&#39;t buy my 6 year old anything to make up for not getting to go out with me and her big sister. We found a way for her to be excited about it. We found a way to make her feel special. In the days leading up to the birthday, my husband and I talked a lot about how special birthdays are. We also reminisced about the birth of ALL of our children so that each one of them could hear how excited we were on the day they were born. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sibling jeolousy and purchases","postDate":"1279809995","msgId":56333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltVjF1dDNBUGp0OG1LMFdwaVBlNmNSUi1QYjdac1RoWlJqam1YZUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkyOTBsZCttbWIzQGVHcm91cHMuY29tPg==","referencesHeader":"PDRDNDdEOUI3LjMwNzAwMDFAZWFydGhsaW5rLm5ldD4JPGkyOTBsZCttbWIzQGVHcm91cHMuY29tPg=="},"prevInTopic":56332,"nextInTopic":56334,"prevInTime":56332,"nextInTime":56334,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... I know what you mean. I have an only child. I think what you re seeing is developmental. Karl used to be indiscriminate and totally easygoing about toys","messageBody":"<div id=\"ygrps-yiv-1414948176\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Now I notice if the middle child is playing with something that my oldest wants, she (the oldest) will say,&quot;but that&#39;s mine, Mimi got that for me&quot;, and want it back.  I&#39;ve tried explaining to both girls how nice it makes people feel to share, but I just think this concept is lost on a 4 and 7 year-old most of the time.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I know what you mean. I have an only child. I think what you&#39;re seeing<br/>\nis developmental. Karl used to be indiscriminate and totally easygoing<br/>\nabout toys and what belonged to who and what it was for. He used to<br/>\nwilling share whatever with anybody without even thinking about it...<br/>\nsure why not, let&#39;s play-- that was the idea.<br/>\n<br/>\nBut then he turned 4 and realized more and said more often what the<br/>\nintended purpose of things were, and later on after that he began to<br/>\nnotice that certain things belong to him and other things belong to<br/>\nothers (he noticed a little before but this seemed a more definite<br/>\nunderstanding of how ownership often pans out in our culture. And it&#39;s<br/>\ndifferent from culture to culture--- which he still doesn&#39;t know or<br/>\nhasn&#39;t experienced yet).<br/>\n<br/>\nSo on his 4th birthday, he barely understood what birthdays and gifts<br/>\nwere about because he didn&#39;t get the idea of a birthday being just one<br/>\nday, so of course we enjoyed celebrating a lowkey birthweek or<br/>\nbirthmonth with him. He was having fun with the idea of having<br/>\nconversation just to mention that it was his birthday. We didn&#39;t pile<br/>\nhim up with gifts because he got stuff all the time, being an only<br/>\nchild, and getting more would have been lost or not really special or<br/>\ndifferent.<br/>\n<br/>\nHis 5th birthday he understood more about being born on a particular<br/>\nday. We still did the birthweek thing for the fun of it. Same with his<br/>\n6th birthday. And then we added half-birthdays at Christmas just for<br/>\nthe heck of it. Still not a big gift focus.<br/>\n<br/>\nHe just had his 7th birthday. Right after dinner we celebrated with<br/>\ncake and all the kids (we were at his cousins&#39; house) disbanded after<br/>\neating to play while the adults hung out talking for a while. Karl<br/>\ncircled back around on his way to something else, looking a bit at<br/>\nloose ends, and his aunt handed him a gift to open. It wasn&#39;t done<br/>\nwhile other kids were looking on. He got to open gifts he was thrilled<br/>\nabout and though he didn&#39;t fill the water gun and start shooting it<br/>\nright then, he had something to look forward to, and boy was he happy!<br/>\n<br/>\nI think many times, adults think the proper way to do birthdays is to<br/>\nmake a big deal and a huge focus, to really do it up big, with cake<br/>\nand food galore and decorations and so forth and so on. Often that&#39;s<br/>\nabout what the adults wanted when they were kids. It can be a lot of<br/>\nfun that way if it works out for the ones being celebrated and doesn&#39;t<br/>\nadd stress to their relationships with family and friends. Lots of<br/>\npeople have not only family but also as many of the kid&#39;s friends<br/>\ninvolved too, and that can be even tougher to balance. Then there are<br/>\neven more kids who want to play with usually not very many birthday<br/>\ngifts to share.<br/>\n<br/>\nI know of one family whose child carefully invited friends to her<br/>\nbirthday party and got little secret thank you gifts she knew her<br/>\ninvitees would like, and that was a hit. Maybe that could be done with<br/>\nthe sisters too? After the big special Build-A-Bear thing, you could<br/>\nmake a special sister-to-sister tea party with little secret thank you<br/>\ngifts, sticker sets, candy bags or small gifts to share and play with.<br/>\n<br/>\nYou could even call it a celebration on the oldest&#39;s half-birthday<br/>\nsince her day is around Christmas and then do the same for the younger<br/>\nchild come Christmas time. I think it was last year that I came across<br/>\nthe idea of 12 days of Christmas and heard that people used to make<br/>\nlittle candy/toy ornamental gifts wrapped to hang on the tree and<br/>\nevery day of that time, one could pick an &quot;ornament&quot; to open. That was<br/>\nhow we did Karl&#39;s half-birthday which is right before Christmas and we<br/>\nmay do it again this year.<br/>\n<br/>\nMy grandmother used to do Christmas in August. It was started as an<br/>\nevangelism thing done at her church and she just liked the idea of<br/>\nspecially celebrating in the middle of the year for fun (she was not<br/>\nan evangelist). So she decorated a table up with a tiny tree, made<br/>\nfood, and I forget what else but it was cute. It suited her love of<br/>\ncrafts and social gatherings. She invited neighbors to come. It was a<br/>\nnice excuse to have a party. :)<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: sibling jeolousy and purchases","postDate":"1279809108","msgId":56332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrVjYtLWpETVNCcUJSSERkd1l5OHZ2Y2wyMWp1TGlVR0V3dGNHdEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkyOTBsZCttbWIzQGVHcm91cHMuY29tPg==","referencesHeader":"PDRDNDdEOUI3LjMwNzAwMDFAZWFydGhsaW5rLm5ldD4JPGkyOTBsZCttbWIzQGVHcm91cHMuY29tPg=="},"prevInTopic":56331,"nextInTopic":56333,"prevInTime":56331,"nextInTime":56333,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... I know what you mean. I have an only child. I think what you re seeing is developmental. Karl used to be very indiscriminating about toys and what belonged","messageBody":"<div id=\"ygrps-yiv-792677396\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Now I notice if the middle child is playing with something that my oldest wants, she (the oldest) will say,&quot;but that&#39;s mine, Mimi got that for me&quot;, and want it back.  I&#39;ve tried explaining to both girls how nice it makes people feel to share, but I just think this concept is lost on a 4 and 7 year-old most of the time.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I know what you mean. I have an only child. I think what you&#39;re seeing<br/>\nis developmental. Karl used to be very indiscriminating about toys and<br/>\nwhat belonged to who and what it was for. He used to willing share<br/>\nwhatever with anybody without even thinking about it... sure why not,<br/>\nlet&#39;s play-- that was the idea. But then he turned 4 and realized more<br/>\nand more and said more often what the intended purpose of things were,<br/>\nand after that he began to notice that certain things belong to him<br/>\nand other things belong to others (well, he noticed before but this<br/>\nseemed a more definite understanding of how ownership often pans out<br/>\nin our culture. And it&#39;s different from culture to culture--- which he<br/>\nprobably still *doesn&#39;t* know or hasn&#39;t experienced yet).<br/>\n<br/>\nHis 4th birthday, he barely understood what birthdays and gifts were<br/>\nabout because he didn&#39;t get the idea of a birthday being just one day,<br/>\nso of course we enjoyed celebrating a lowkey birthweek or birthmonth<br/>\nwith him. He was having fun with the idea of spending time mentioning<br/>\nthat it was his birthday. We didn&#39;t pile him up with gifts because he<br/>\ngot stuff all the time, being an only child, and getting more would<br/>\nhave been lost or not really special or different.<br/>\n<br/>\nHis 5th birthday he understood more about one being born on a<br/>\nparticular day. We still did the birthweek thing for the fun of it.<br/>\nSame with his 6th birthday. And then we had added half-birthdays at<br/>\nChristmas just for the heck of it. Still not a big gift focus. He just<br/>\nhad his 7th birthday. The way the focus wasn&#39;t on gifts was that right<br/>\nafter dinner we had celebrated with cake and all the kids (we were at<br/>\nhis cousins&#39; house) disbanded to play while the adults hung out<br/>\ntalking for a while. Karl circled back around on his way to something<br/>\nelse, looking a bit at loose ends and his aunt handed him a gift to<br/>\nopen. It wasn&#39;t done while other kids were looking on. He got to open<br/>\ngifts he was thrilled about and though he didn&#39;t fill the water gun<br/>\nand start shooting it right then, he had something to look forward to,<br/>\nand boy was he happy!<br/>\n<br/>\nI think many times, adults think the proper way to do birthdays is to<br/>\nmake a big deal and a huge focus, to really do it up big, with cake<br/>\nand food galore and decorations and so forth and so on. It can be a<br/>\nlot of fun that way if it works out for the ones being celebrated and<br/>\ndoesn&#39;t add stress to their relationships with family and friends.<br/>\nLots of people have not only family but also as many of the kid&#39;s<br/>\nfriends involved too, and that can be even tougher to balance. Then<br/>\nthere are even more kids who want to play with usually not very many<br/>\nbirthday gifts to share with others.<br/>\n<br/>\nI know of one family whose child carefully invited friends to her<br/>\nbirthday party and got little secret thank you gifts she knew her<br/>\ninvitees would like, and that was a hit. Maybe that could be done with<br/>\nthe sisters too? After the big special Build-A-Bear thing, you could<br/>\nmake a special sister-to-sister tea party with little secret thank you<br/>\ngifts, sticker sets, candy bags or small gifts to share and play with.<br/>\n<br/>\nYou could even call it a celebration on the oldest&#39;s half-birthday<br/>\nsince her day is around Christmas and then do the same for the younger<br/>\nchild come Christmas time. I think it was last year that I came across<br/>\nthe idea of 12 days of Christmas and heard that some people make<br/>\nlittle candy/toy ornamental gifts wrapped to hang on the tree and<br/>\nevery day of that time, children could pick an &quot;ornament&quot; to open.<br/>\nThat was how we did Karl&#39;s half-birthday which is right before<br/>\nChristmas and we may do it again this year.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sibling jeolousy and purchases","postDate":"1279802447","msgId":56331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIxNEIxQUU0LUIxRTAtNDBBMi05NUQyLUVBMzhEQ0ZDODkyMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkyODlyMitmdjV2QGVHcm91cHMuY29tPg==","referencesHeader":"PGkyODlyMitmdjV2QGVHcm91cHMuY29tPg=="},"prevInTopic":56330,"nextInTopic":56332,"prevInTime":56330,"nextInTime":56332,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"-=- *** How did the younger sister feel about her horse not being exclusive ... -=-I did ask her if it was okay if her big sister got the same horse. She said","messageBody":"<div id=\"ygrps-yiv-184741828\">-=-&gt;*** How did the younger sister feel about her horse not being  <br/>\nexclusive<br/>\n<blockquote><span title=\"ireply\">  &gt; anymore?***<br/>\n<br/>\n </span></blockquote>-=-I did ask her if it was okay if her big sister got the same horse.  <br/>\nShe said that would be great and that they could be &quot;twins&quot;. I&#39;m  <br/>\nfeeling better about my decision.-=-<br/>\n<br/>\nFor me, that&#39;s the big factor--whether the younger girl felt better or  <br/>\nworse about another horse.<br/>\n<br/>\nThere were a few years when my sister wanted whatever I had, and I  <br/>\nwanted to have what my sister didn&#39;t have.  We&#39;ve talked about it  <br/>\nsince, and I wish I could go back and be nicer, but if we were asked  <br/>\nwhat kind of soda we wanted and she said coke and I said orange, she  <br/>\nwould say &quot;I want orange too,&quot; and then I didn&#39;t want orange anymore.   <br/>\nI felt fully crowded and nullified by my sister and two female cousins  <br/>\nour age.  I had been a big deal the first few years, and then they had  <br/>\nanother baby and within three-to-five years (it was gradual) I became  <br/>\nthe second of four girls.<br/>\n<br/>\nMy mom wasn&#39;t into finding creative solutions. She used to give us all  <br/>\nthe very same gifts at Christmas.  The only way I could get a surprise  <br/>\nwas to turn my back and not look at what other people were opening.<br/>\n<br/>\nSurely in reaction to that in my life, the first time we gave our kids  <br/>\nthe same gifts at Christmas was Holly and Marty getting the same  <br/>\nlaptop the year after Kirby moved away.  I warned them these were the  <br/>\nsame and told them to open them at the same time.  Usually we go  <br/>\naround and take turns so each person&#39;s gift opening has admiring  <br/>\nwitnesses.<br/>\n<br/>\nNo doubt my own history with careless gift giving and disregard for my  <br/>\nfeelings colors my ideas about people wanting the very same thing  <br/>\nsomeone else has.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: sibling jeolousy and purchases","postDate":"1279797753","msgId":56330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzODQwRDMzLTBDMzYtNDk0MS04OEU3LTNFMkM0M0NEQTYxNUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGkyOGFoMit0cmdjQGVHcm91cHMuY29tPg==","referencesHeader":"PGkyOGFoMit0cmdjQGVHcm91cHMuY29tPg=="},"prevInTopic":56329,"nextInTopic":56331,"prevInTime":56329,"nextInTime":56331,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... Does she want you to? I suggested it to my sister whose birthday is just after Christmas and she had no interest. Instead of getting her to change, put in","messageBody":"<div id=\"ygrps-yiv-1058000303\">On Jul 21, 2010, at 10:30 PM, gkcollins321 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I may start celebrating my oldest&#39;s b-day in the summer. Her b-day  <br/>\n&gt; is right after Christmas<br/>\n<br/>\n </span></blockquote>Does she want you to? I suggested it to my sister whose birthday is  <br/>\njust after Christmas and she had no interest.<br/>\n<br/>\nInstead of getting her to change, put in extra effort at protecting  <br/>\nthat special day of hers. Putting in the effort will feel more like  <br/>\nlove and respect than suggesting that someone had picked an  <br/>\ninconvenient day to be born (even if in your head you&#39;re thinking it&#39;s  <br/>\ninconvenient for them instead of you.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":455693518,"authorName":"gkcollins321","from":"&quot;gkcollins321&quot; &lt;gkcollins321@...&gt;","profile":"gkcollins321","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: sibling jeolousy and purchases","postDate":"1279788525","msgId":56328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyOTBsZCttbWIzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRDNDdEOUI3LjMwNzAwMDFAZWFydGhsaW5rLm5ldD4="},"prevInTopic":56327,"nextInTopic":56329,"prevInTime":56327,"nextInTime":56329,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... No, I don t think so.? I always try to buy 2 or 3 of the same things each time I buy something.  (I have 3 girls ages 7, 4, 2).  But lately I have noticed","messageBody":"<div id=\"ygrps-yiv-1213474776\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; <br/>\n&gt; ***They said when they were older that they never felt envious of their <br/>\n&gt; siblings getting cool gifts for their birthdays - that they always <br/>\n&gt; looked forward and were excited about what their sisters got, because <br/>\n&gt; the knew they would also get to play with it.  So they were wondering if <br/>\n&gt; there is a lot of emphasis on who gets what in the fthe family.***<br/>\n<br/>\n </span></blockquote>No, I don&#39;t think so.? I always try to buy 2 or 3 of the same things each time I buy something.  (I have 3 girls ages 7, 4, 2).  But lately I have noticed them struggling more with what they play with at home.  Let me explain ... My first-born was showered with gifts for the first 4 years of her life - probably due to the fact that she was an only grandchild for a while.  So by the time my 2nd daughter was born, we had a toy for every occasion.:)  Instead of buying duplicates of toys when my second was born, they always just shared toys.  This was never a problem.  Now I notice if the middle child is playing with something that my oldest wants, she (the oldest) will say,&quot;but that&#39;s mine, Mimi got that for me&quot;, and want it back.  I&#39;ve tried explaining to both girls how nice it makes people feel to share, but I just think this concept is lost on a 4 and 7 year-old most of the time.  So lately, I have been respecting the fact that those toys were hers 1st, and telling her that it would be nice if she shared but that if she didn&#39;t want to, she didn&#39;t have to, and she should take the toys she is unwilling to share into her room and put them where nobody else could reach them.  (We have a seperate gameroom where most of the toys are kept.)  I had always had this romantic idea in my mind that the girls would always share all toys happily...even though when I was young it would have killed me to have to share my really special things with my younger sister.  And it would be easier, I think, if my older daughter only had a problem sharing certain special-to-her things, but lately it&#39;s even stuff she never cared about before (and probably forgot she even ever had).  Maybe this is even harder for me because so much of the time they play so beautifully together, and love each other so much.  It&#39;s hard for me to see them fight.  Hope that made some sense!:)<br/>\n<br/>\nAny more thoughts would be so helpful.<br/>\nThank you,<br/>\nGretchen  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;*** They also thought that mom should have been sympathetic about the 7 yo <br/>\n&gt; being disappointed in not being invited to go with grandparents and <br/>\n&gt; sister to Build-a-Bear and to dinner, but shouldn&#39;t have tried to make <br/>\n&gt; up for it by buying other stuff for her - they said that was never going <br/>\n&gt; to work because her feelings were hurt about being left out of the <br/>\n&gt; excitement and nothing she could buy would change that. ***<br/>\n<br/>\n </span></blockquote>Oh and it&#39;s even worse because Build a Bear is something special the grandparents have done every year with my oldest on HER birthday.  Last year was the first year they said they wanted to take my 2nd daughter for her b-day without the 1st.  I asked my in-laws if my older daughter could go too, and gave her money to buy her own bear that year.  They both had a blast last year.  I should have done the same thing this year. I think she felt more hurt by not being invited to go along than I had originally imagined.  Hindsight is 20/20.:(<br/>\n<br/>\nGretchen</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sibling jeolousy and purchases","postDate":"1279777607","msgId":56325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDNDdEQjQ3LjEwNTA2MDBAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDRDNDdEOUI3LjMwNzAwMDFAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPiA8NEM0N0Q5QjcuMzA3MDAwMUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":56324,"nextInTopic":56327,"prevInTime":56324,"nextInTime":56326,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... Rosie and Roxana -pam","messageBody":"<div id=\"ygrps-yiv-1170098018\">On 7/21/2010 10:40 PM, Pam Sorooshian wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I just asked Rosie and Ros (now 19 and 22) to respond to this post.<br/>\n<br/>\n </span></blockquote>Rosie and Roxana<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] sibling jeolousy and purchases","postDate":"1279777207","msgId":56324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDNDdEOUI3LjMwNzAwMDFAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":56321,"nextInTopic":56325,"prevInTime":56323,"nextInTime":56325,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"I have 3 girls about three years apart. I just asked Rosie and Ros (now 19 and 22) to respond to this post. They both said that at that age they d have been","messageBody":"<div id=\"ygrps-yiv-2082802352\">I have 3 girls about three years apart.<br/>\n<br/>\nI just asked Rosie and Ros (now 19 and 22) to respond to this post.<br/>\n<br/>\nThey both said that at that age they&#39;d have been really disappointed and <br/>\nfelt very left out if their sister was taken out for her birthday by <br/>\ngrandparents - to go to Build a Bear and have dinner just alone with <br/>\nthem.  They felt like we didn&#39;t do that kind of thing - that birthdays <br/>\nwere a time for us all to celebrate that person being born, together. We <br/>\ndidn&#39;t just shower the one birthday girl with a lot of gifts - we <br/>\ncelebrated together. So, for example, we&#39;d go to a special show <br/>\ntogether. Or we&#39;d go to Adventure City (which is a little kid amusement <br/>\npark), or we&#39;d have a picnic together or something.<br/>\n<br/>\nThey said that knowing you have a child who already tends to be envious, <br/>\nthat this was a set-up for a bad response and it is better if parents <br/>\nthink ahead and set their kids up for success. (I want to add that THIS <br/>\nis what I think is the best advice possible - set your kids up for success.)<br/>\n<br/>\nThey also both said it would have been a lot more fun for both girls if <br/>\nthey both had gotten to go to build-a-bear together and get toys they <br/>\ncould play with together and that by the time mom took the 7 yo to her <br/>\nfavorite restaurant and bought her cards and then eventually got her the <br/>\nbuild-a-bear animal, too, she really could have just gone along in the <br/>\nfirst place. It could have been really sweet - grandparents taking the <br/>\ngirls to celebrate (together) the 4 yo&#39;s birthday.<br/>\n<br/>\nThey said when they were older that they never felt envious of their <br/>\nsiblings getting cool gifts for their birthdays - that they always <br/>\nlooked forward and were excited about what their sisters got, because <br/>\nthe knew they would also get to play with it.  So they were wondering if <br/>\nthere is a lot of emphasis on who gets what in the fthe family.<br/>\n<br/>\nThey also thought that mom should have been sympathetic about the 7 yo <br/>\nbeing disappointed in not being invited to go with grandparents and <br/>\nsister to Build-a-Bear and to dinner, but shouldn&#39;t have tried to make <br/>\nup for it by buying other stuff for her - they said that was never going <br/>\nto work because her feelings were hurt about being left out of the <br/>\nexcitement and nothing she could buy would change that. They thought the <br/>\nbest thing would be to be sympathetic and talk about how she would want <br/>\nto celebrate birthdays, instead of one kid going out alone with <br/>\ngrandparents - what else could be done? Then, put on a movie or <br/>\nsomething and just distract her so that time would go by.<br/>\n<br/>\nIf grandparents are the ones initiating taking out just one kid for <br/>\ntheir birthday - try to dissuade them and, instead, have a family <br/>\ncelebration with all of you together.   When the girls are older, <br/>\nthey&#39;ll understand better that they&#39;ll each get their turn and they&#39;ll <br/>\nbetter tolerate being the one left out.<br/>\n<br/>\nAs far as the child wanting to buy lots of stuff, they pointed out that, <br/>\nfor kids, it only makes sense to keep asking for anything and everything <br/>\nthey want because they can&#39;t really make sense out of when parents will <br/>\nsay yes and when they&#39;ll say no. So - there&#39;s nothing wrong with a kid <br/>\nasking a lot - it is rational behavior for a kid who hasn&#39;t been <br/>\ndiscouraged from doing it.  But they said they remember me talking to <br/>\nthem about it being okay to ask, but that they should be courteous and <br/>\nkind about it. They remember me saying that it was hard to explain why <br/>\nit was sometimes okay and sometimes not okay to buy things - that it had <br/>\nto do with how much money I&#39;d already spent that week or that month and <br/>\nthat sometimes we&#39;d already spent a lot and I couldn&#39;t afford something <br/>\nthat maybe the next week or month we could afford. I told them, they <br/>\nremember, that I always wanted to buy them everything I could.<br/>\n<br/>\nThey remember me telling them that it wasn&#39;t nice to keep asking if I <br/>\nsaid, &quot;Not today or not now.&quot; They remember me keeping a list in my <br/>\npurse to write things down on that they wanted so they wouldn&#39;t forget <br/>\nand they said part of the reason for wanting something right NOW is that <br/>\n- that they know that it might be forgotten.  (There is an online site <br/>\ncalled &quot;Listigator&quot; that might be really fun for making lists of things <br/>\npeople want to buy or make or do or places to go or things they want to <br/>\nplay, etc.)<br/>\n<br/>\nThey also said you can&#39;t make someone not be disappointed that you don&#39;t <br/>\nbuy something immediately, but that it makes a big difference knowing <br/>\nthat their wants are taken seriously and a good way to show that is to <br/>\ngo back and get something they seem to really want and give it as a <br/>\ngift. After that happens a time or two or three, the disappointment will <br/>\nbe less because the real possibility of still getting it later will be <br/>\nthere, too.<br/>\n<br/>\nMostly, though, they thought it really wasn&#39;t that nice to take the <br/>\nyounger child off to celebrate her birthday with grandparents, leaving <br/>\nthe older sister behind to just imagine the fantastic good time her <br/>\nsister was having without her.  They get the idea of the birthday girl <br/>\ngetting the special treat - but think the reality for little kids is to <br/>\ncreate a have/have not situation when it would have been easy to create <br/>\na joyful sense of celebrating together, instead.<br/>\n<br/>\nGrandparents could have said, &quot;To celebrate your birtday (4 yo) we&#39;re <br/>\ngoing to take you and your sister to Build-a-Bear so you can both get <br/>\nstuffed animals to play with together.&quot; The girls could have gotten twin <br/>\nhorses, for example, and then that would have set up the older one to be <br/>\nhappy for the younger one.<br/>\n<br/>\nWe used to take kids to a musical for their birthdays, quite frequently. <br/>\nOr to the kiddie amusement park. We didn&#39;t just take the birthday girl  <br/>\nwe took the birthday girl and her sisters (and sometimes a friend or a <br/>\nfew friends). They had fun together. We never had big parties where one <br/>\nkid was opening a huge pile of gifts and the others getting nothing - <br/>\nnot until they were much older. Even if one was getting just a handful <br/>\nof gifts, we&#39;d wrap up a gift or two for the other girls and call them <br/>\ntheir &quot;sister birthday&quot; presents.<br/>\n<br/>\nThey eventually began to like to see their sisters get gifts - these <br/>\ndays they think about what they&#39;re getting each other and they are <br/>\ngenuinely happy when their sisters get something they like a lot.<br/>\n<br/>\nSorry - this is a little rambling - I was trying to take notes while <br/>\nthey were talking about it.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":455693518,"authorName":"gkcollins321","from":"&quot;gkcollins321&quot; &lt;gkcollins321@...&gt;","profile":"gkcollins321","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: sibling jeolousy and purchases","postDate":"1279765858","msgId":56327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyOGFoMit0cmdjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYxOTk2Ny40ODgyMy5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":56325,"nextInTopic":56328,"prevInTime":56326,"nextInTime":56328,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... ***  My sister is almost exactly one year younger than me. ... This along with another response from Meredith has made me think... I may start celebrating","messageBody":"<div id=\"ygrps-yiv-1075912115\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Jenny Cyphers &lt;jenstarc4@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>&#92;***  My sister is almost exactly one year younger than me. <br/>\n<blockquote><span title=\"ireply\"> &gt;  We shared almost everything and we wouldn&#39;t have wanted it any other way. <br/>\n&gt;  Gifts were almost always given as sets, not unlike someone would do for twins. <br/>\n&gt;  It helped that our birthdays are about 3 weeks apart.  It wasn&#39;t until we were <br/>\n&gt; much older, teens, that we started wanting things more separate. ***<br/>\n<br/>\n </span></blockquote>This along with another response from Meredith has made me think... I may start celebrating my oldest&#39;s b-day in the summer.  Her b-day is right after Christmas, which is sort of a bummer in my mind.  Her dad and both of her sisters have birthdays that all fall in the same week in July.  So I think to her it may seem as if everyone is getting gifts but her when July rolls around.   Her b-day sort of blends in with Christmas as it is.  Maybe she could have her party and get the bulk of her gifts in summer with the rest of the family:).  This past Christmas I made sure she and her sister got pretty much all of the same things.  It worked great.  I could do this for birthdays as well.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>Thank you for all of the great thoughts.<br/>\n<br/>\nGretchen<br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":455693518,"authorName":"gkcollins321","from":"&quot;gkcollins321&quot; &lt;gkcollins321@...&gt;","profile":"gkcollins321","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: sibling jeolousy and purchases","postDate":"1279765154","msgId":56329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyODlyMitmdjV2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAyODhFQTM1LUMwQTEtNENDNS04OTUxLTAwRjdFNkQ0REVCNEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":56328,"nextInTopic":56330,"prevInTime":56328,"nextInTime":56330,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... We did this.  My hubby spent time upstairs talking with her while I opened presents and celebrated with the b-day girl.  It worked out well.  ... It seems","messageBody":"<div id=\"ygrps-yiv-1774778165\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;*** Seven is very young, but seven is also old enough to be told not to  <br/>\n&gt; ruin someone else&#39;s birthday.  If she couldn&#39;t be sweeter to her  <br/>\n&gt; sister on the sister&#39;s birthday, I think finding her something to do  <br/>\n&gt; in another room would be better than having her right there.***<br/>\n<br/>\n </span></blockquote>We did this.  My hubby spent time upstairs talking with her while I opened presents and celebrated with the b-day girl.  It worked out well. &gt; <br/>\n<blockquote><span title=\"ireply\"> &gt;*** I&#39;m sorry confusion ensued.  It often does, when parents move too  <br/>\n&gt; quickly into areas they don&#39;t yet understand, and it confuses the  <br/>\n&gt; children too, if one day there are rules, and the next day the parents  <br/>\n&gt; are a confused mess. :-)***<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>It seems I&#39;m only really confused when it comes to spending money - am I the only one with a block when it comes to money?  I enjoy spending time with the kids, talking, playing, doing.  I can give them all the time and love in the world... just have a hard time applying unschooling to their material desires.  I&#39;ve thought about doing an allowance (not tied to any chores, of course), but I feel bad even saying things like, &quot;okay well save your allowance&quot; because then I still feel that this is something a conventional parent does.  Not giving freely to the child but making them save.  I can remember my mom bursting my bubble with this line.  I wanted something right then, knew she could make it happen, but was made to wait until I earned the money for myself.  Any more thoughts on this would be greatly appreciated.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt;*** How did the younger sister feel about her horse not being exclusive  <br/>\n&gt; anymore?***<br/>\n<br/>\n </span></blockquote>I did ask her if it was okay if her big sister got the same horse.  She said that would be great and that they could be &quot;twins&quot;.  I&#39;m feeling better about my decision.  We&#39;ve had a great day (back to normal).  The girls have played wonderfully together, as usual, and I&#39;ve gotten lots of hugs from all the girls today.  Knowing my daughter, had I not gotten the horse for her, we&#39;d still be going round and round over her wanting this horse.  She&#39;s not one to just get over something like this:)<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;*** But the older sister was enduring another celebration of the  <br/>\n&gt; day she stopped being an only child.  People who weren&#39;t firstborns or  <br/>\n&gt; who don&#39;t remember childhood probably play that down or can&#39;t imagine  <br/>\n&gt; how awful it is.***<br/>\n<br/>\n </span></blockquote>I think this is why I chose to buy her the horse.  I was the first-born.  Five years later, my sister came along and ruined everything -- just kidding.  But really, I remember feeling jealous of the time my parents spent with my little sister, things they said to her, etc.  I know that my eldest is struggling with this, too.  She&#39;s made comments lately like, &quot;you never tell me how good my drawings are&quot; when I complement her sister on something she made.  <br/>\n<br/>\nI am grateful for this list.<br/>\n<br/>\nThank you all for your insight.<br/>\n<br/>\nGretchen <br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sibling jeolousy and purchases","postDate":"1279758620","msgId":56321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlucm5WZWpCZ1hVYV9oQkJ4Q1JWUVE3QVFIdU1WQUFWLVV6a0lNT0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDYxOTk2Ny40ODgyMy5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPgk8NjE5OTY3LjQ4ODIzLnFtQHdlYjExMDQwNi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":56320,"nextInTopic":56324,"prevInTime":56320,"nextInTime":56322,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"Jenny I had the same reaction to this situation. I m 14 months older than my nearest age sibling (sister). We always had the same kinds of gifts for holidays","messageBody":"<div id=\"ygrps-yiv-1922398219\">Jenny I had the same reaction to this situation. I&#39;m 14 months older<br/>\nthan my nearest age sibling (sister). We always had the same kinds of<br/>\ngifts for holidays and birthdays. Though our birthdays were further<br/>\napart than that of you and your sibling, they were often celebrated<br/>\nsimultaneously especially if we traveled to see relatives, since my<br/>\nsister&#39;s birthday is so close to Christmas. We played together all the<br/>\ntime until we hit about 9 or 10, after which I stuck my nose in books<br/>\nwhile my sister sat listening to adults talking.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Jul 21, 2010 at 3:39 PM, Jenny Cyphers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenstarc4@...\">jenstarc4@...</a>&gt; wrote:<br/>\n&gt; ***I want her to know without a doubt that her needs are very important and that<br/>\n&gt; I am her partner in life and will always do my best to help her have her wants<br/>\n&gt; and needs met. However, I also feel that at some point, I want her to understand<br/>\n&gt; that money doesn&#39;t grow on trees. (That&#39;s the &quot;old me&quot; talking - pre-unschooling<br/>\n&gt; thoughts I guess). And there&#39;s a part of me that feels angry toward her for<br/>\n&gt; being selfish ( I know that sounds terrible).<br/>\n&gt;<br/>\n&gt; Anyway, how do you decide when to buy something for your children and when to<br/>\n&gt; say no?***<br/>\n&gt;<br/>\n&gt; I would&#39;ve just bought the horse in the first place.  You took her out to get<br/>\n&gt; books, cards and dinner.  It seems that money could have been spent, in the<br/>\n&gt; first place, on what she REALLY wanted, a trip to Build-A-Bear.  I understand<br/>\n&gt; the desire to create a birthday gift that feels special to the birthday person,<br/>\n&gt; but I seriously doubt that a 4 yr old would care if her older sister got<br/>\n&gt; something too.  In fact, it might have added to the birthday fun for the little<br/>\n&gt; sister, to have her older sister there giving input and adding interesting ideas<br/>\n&gt; for playing with the new toys.  Was that the only gift for the little sister?<br/>\n&gt;  It might have been the only gift for the older sister, but the birthday girl<br/>\n&gt; probably got many other gifts from mom and dad and other relatives and friends.<br/>\n&gt;<br/>\n&gt; Instead of seeing selfishness, see it as something that would enhance the play<br/>\n&gt; time between sisters.  How cool that they are interested in the same thing to<br/>\n&gt; play!  You have no idea how lucky you are!  Maybe the older girl doesn&#39;t get<br/>\n&gt; jealous, maybe she really wants the ultimate play happiness with her younger<br/>\n&gt; sister, so when her younger gets something that she sees as really fun to play<br/>\n&gt; with, with her sister, she wants it too because she sees how awesome that would<br/>\n&gt; be to play with together.  Perhaps think more in line with gifts that are for<br/>\n&gt; both of them with pieces that might be separate.  Build-A-Bear is a perfect<br/>\n&gt; example actually!  They each have their dolls and all the clothing and<br/>\n&gt; accessories can be shared.<br/>\n&gt;<br/>\n&gt; This is how I grew up.  My sister is almost exactly one year younger than me.<br/>\n&gt;  We shared almost everything and we wouldn&#39;t have wanted it any other way.<br/>\n&gt;  Gifts were almost always given as sets, not unlike someone would do for twins.<br/>\n&gt;  It helped that our birthdays are about 3 weeks apart.  It wasn&#39;t until we were<br/>\n&gt; much older, teens, that we started wanting things more separate.<br/>\n&gt;<br/>\n&gt; Take advantage of it while you can!  Really!<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: sibling jeolousy and purchases","postDate":"1279741918","msgId":56320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyN2o0dStxOXZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":56319,"nextInTopic":56321,"prevInTime":56319,"nextInTime":56321,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"... **************** How does the 4yo feel about it? If she s sanguine, then it can be easier to get things in pairs, or things that are almost-the-same.","messageBody":"<div id=\"ygrps-yiv-1639633093\">&quot;gkcollins321&quot; &lt;gkcollins321@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I have a 7 year-old daughter who is very jeolous any time her 4 year-old sister gets something that she does not have.<br/>\n </span></blockquote>****************<br/>\n<br/>\nHow does the 4yo feel about it? If she&#39;s sanguine, then it can be easier to get things in pairs, or things that are almost-the-same. Sometimes an older child can need more care and reassurance that she or he is still loved, even with the little one around. <br/>\n<br/>\nWith birthdays, sometimes it can work to give a gift or do something fun with other kids, but it depends a whole lot on the child - and the degree of &quot;specialness&quot; of the birthday too. Taking one child to build-a-bear is pretty darned special, I can see where that would leave another child with hurt feelings if they then have to wait months to get the same special day and gift.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; But the money can sort of always be found.<br/>\n<br/>\n </span></blockquote>Then budget for two of everything for awhile. You said you wanted her to know that &quot;money doesn&#39;t grow on trees&quot; but it doesn&#39;t seem like you have a good understanding, in your own mind, what the edges or limits of your finances are. There aren&#39;t really clear reasons or guidelines for spending - that&#39;s common for a Lot of people! We base spending decisions on lots of very fluid feelings about things, and that&#39;s baffling to children. Why yes to this but no to that? Why no now but yes ten minutes agor? Or later? Do as much as you can do to make the process seem reasonable and sensible to your kids. <br/>\n<br/>\nFor some people that takes the form of an allowance - figure out how much and then the kids get total control over how to spend it. Another strategy (not exclusive of the allowance idea, they can work together) is to help kids understand where the money comes from and how its spent, and bring them into the process to some extent. No one strategy is inherently better - it depends on the kids - the important thing is to help them understand the mysterious puzzle of household finances. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] sibling jeolousy and purchases","postDate":"1279741168","msgId":56319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxOTk2Ny40ODgyMy5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":56314,"nextInTopic":56320,"prevInTime":56318,"nextInTime":56320,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"***I want her to know without a doubt that her needs are very important and that I am her partner in life and will always do my best to help her have her wants","messageBody":"<div id=\"ygrps-yiv-1873725508\">***I want her to know without a doubt that her needs are very important and that <br/>\nI am her partner in life and will always do my best to help her have her wants <br/>\nand needs met. However, I also feel that at some point, I want her to understand <br/>\nthat money doesn&#39;t grow on trees. (That&#39;s the &quot;old me&quot; talking - pre-unschooling <br/>\nthoughts I guess). And there&#39;s a part of me that feels angry toward her for <br/>\nbeing selfish ( I know that sounds terrible).<br/>\n<br/>\nAnyway, how do you decide when to buy something for your children and when to <br/>\nsay no?***<br/>\n<br/>\nI would&#39;ve just bought the horse in the first place.  You took her out to get <br/>\nbooks, cards and dinner.  It seems that money could have been spent, in the <br/>\nfirst place, on what she REALLY wanted, a trip to Build-A-Bear.  I understand <br/>\nthe desire to create a birthday gift that feels special to the birthday person, <br/>\nbut I seriously doubt that a 4 yr old would care if her older sister got <br/>\nsomething too.  In fact, it might have added to the birthday fun for the little <br/>\nsister, to have her older sister there giving input and adding interesting ideas <br/>\nfor playing with the new toys.  Was that the only gift for the little sister? <br/>\n It might have been the only gift for the older sister, but the birthday girl <br/>\nprobably got many other gifts from mom and dad and other relatives and friends.<br/>\n<br/>\nInstead of seeing selfishness, see it as something that would enhance the play <br/>\ntime between sisters.  How cool that they are interested in the same thing to <br/>\nplay!  You have no idea how lucky you are!  Maybe the older girl doesn&#39;t get <br/>\njealous, maybe she really wants the ultimate play happiness with her younger <br/>\nsister, so when her younger gets something that she sees as really fun to play <br/>\nwith, with her sister, she wants it too because she sees how awesome that would <br/>\nbe to play with together.  Perhaps think more in line with gifts that are for <br/>\nboth of them with pieces that might be separate.  Build-A-Bear is a perfect <br/>\nexample actually!  They each have their dolls and all the clothing and <br/>\naccessories can be shared.<br/>\n<br/>\nThis is how I grew up.  My sister is almost exactly one year younger than me. <br/>\n We shared almost everything and we wouldn&#39;t have wanted it any other way. <br/>\n Gifts were almost always given as sets, not unlike someone would do for twins. <br/>\n It helped that our birthdays are about 3 weeks apart.  It wasn&#39;t until we were <br/>\nmuch older, teens, that we started wanting things more separate.  <br/>\n<br/>\nTake advantage of it while you can!  Really!<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] sibling jeolousy and purchases","postDate":"1279729044","msgId":56314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyODhFQTM1LUMwQTEtNENDNS04OTUxLTAwRjdFNkQ0REVCNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":56312,"nextInTopic":56319,"prevInTime":56313,"nextInTime":56315,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"-=- She was very jeoulous of the horse and pouted the rest of the evening. I told her when it was her b-day she could go get the same horse. -=- The first","messageBody":"<div id=\"ygrps-yiv-462141778\">-=- She was very jeoulous of the horse and pouted the rest of the  <br/>\nevening. I told her when it was her b-day she could go get the same  <br/>\nhorse. -=-<br/>\n<br/>\nThe first part, pouting until the next day, seemed fine.  Telling her  <br/>\nshe could go get the same horse ruined it.<br/>\nYou made a promise that wasn&#39;t really in your power to keep.  And if I  <br/>\ngot a cool thing for my birthday, I would NOT like it if my mom told  <br/>\nmy sister she could have one just like it.  What was cool about that  <br/>\nhorse was that it was HERS.<br/>\n<br/>\nSeven is very young, but seven is also old enough to be told not to  <br/>\nruin someone else&#39;s birthday.  If she couldn&#39;t be sweeter to her  <br/>\nsister on the sister&#39;s birthday, I think finding her something to do  <br/>\nin another room would be better than having her right there.  Or one  <br/>\nof the parents could have taken her out--not to spend money, but just  <br/>\nout, to play, to hike, to drive and talk, to ride in the car until she  <br/>\nwas asleep--something to protect the birthday joy at home.<br/>\n<br/>\n-=-I used to handle purchases by saying something like &quot;that would be  <br/>\na great birthday gift&quot; or &quot;would you like to do some chores around the  <br/>\nhouse to earn the money&quot;. Now that I am trying to adopt the  <br/>\nunschooling as it applies to parenting, I&#39;m just a confused mess. -=-<br/>\n<br/>\nI&#39;m sorry confusion ensued.  It often does, when parents move too  <br/>\nquickly into areas they don&#39;t yet understand, and it confuses the  <br/>\nchildren too, if one day there are rules, and the next day the parents  <br/>\nare a confused mess. :-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n<br/>\n-=This morning she was still so concerned that that horse would not be  <br/>\navailable on her b-day. So I got on the Build a Bear website, and sure  <br/>\nenough, it&#39;s a limited addition horse. Tears. I went ahead and bought  <br/>\nthe horse for her. I&#39;m feeling uneasy about my decision. -=-<br/>\n<br/>\nI think I would have assumed there might be something even better by  <br/>\nher birthday, or just written on a list on the wall w things she might  <br/>\nwant for her birthday.  Write the horse down.<br/>\n<br/>\nThen if you went to the site and discovered it was a limited-time  <br/>\nthing, maybe secretly go and get one, making sure it&#39;s not just like  <br/>\nher sister&#39;s, and stash it in secret at someone else&#39;s house so you&#39;re  <br/>\nnot tempted to get it and give it to her before her birthday.  But in  <br/>\nsuch a case, I&#39;m guessing by the time her birthday came she would be  <br/>\non to wanting something different.<br/>\n<br/>\nHow did the younger sister feel about her horse not being exclusive  <br/>\nanymore?<br/>\n<br/>\n-=-And there&#39;s a part of me that feels angry toward her for being  <br/>\nselfish ( I know that sounds terrible).-=-<br/>\n<br/>\nIt doesn&#39;t sound terrible.  Maybe think of it as frustrated instead of  <br/>\nangry, but parents are human.  You were, that day, celebrating the  <br/>\nbirth of your younger daughter.  YOU were there when the baby was  <br/>\nborn.   But the older sister was enduring another celebration of the  <br/>\nday she stopped being an only child.  People who weren&#39;t firstborns or  <br/>\nwho don&#39;t remember childhood probably play that down or can&#39;t imagine  <br/>\nhow awful it is.<br/>\n<br/>\n-=-Anyway, how do you decide when to buy something for your children  <br/>\nand when to say no? I&#39;ve read similar posts where people have said if  <br/>\nthe money is there... buy it. But the money can sort of always be  <br/>\nfound. Or I can always think of a reason why we should save that money  <br/>\nfor something else. This is such a tough one for me because I am a bit  <br/>\nfrugal when it comes to spending for myself. It&#39;s hard for me to have  <br/>\nchildren who want something everytime we go to the store. -=-<br/>\n<br/>\nIf you used to say no and now they know you&#39;re trying to say yes, they  <br/>\nwill want more for a while.  You wound up the &quot;need&quot; launcher, and the  <br/>\nrubber band got tighter and tighter and instead of unwinding it gently  <br/>\n(gradual change) you launched it all at once, so they went past the  <br/>\nmark you had envisioned.<br/>\n<br/>\n-=-I just feel at some point this spending needs to be slowed. I did  <br/>\ntell my daughter that we have only so much money to spend each month,  <br/>\nand that I wanted to make sure this horse was something that she  <br/>\nREALLY wanted and that she would be happy with the purchase.-=-<br/>\n<br/>\nYou asked her while she was in the midst of a big pout.  Writing it  <br/>\ndown and asking her a day or two later might have netted you a sweeter  <br/>\nand more rational response.<br/>\n<br/>\n-=-What&#39;s frustrating, too, is that she saw all this other stuff on  <br/>\nthe website that she wanted to get when I purchased the horse. So even  <br/>\nthough I was able to say &quot;yes&quot; to the horse, I was also saying &quot;no&quot; to  <br/>\nthe outfits she wanted for it. Ugh.-=-<br/>\n<br/>\nYou could have written those down on a list.  Maybe the outfits are  <br/>\nstill available after the &quot;special&quot; period expires?<br/>\n<br/>\n-=--I just feel at some point this spending needs to be slowed.-=-<br/>\n<br/>\nSpending could be stopped, not just slowed.  What can&#39;t be reasonably  <br/>\nslowed is joyful attention and filling them with input, ideas,  <br/>\nopportunities, music, visions, games, stories...<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a><br/>\n<br/>\nInstead of changing the parenting, first get the unschooling going!   <br/>\nThan gradually change other things.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":455693518,"authorName":"gkcollins321","from":"&quot;gkcollins321&quot; &lt;gkcollins321@...&gt;","profile":"gkcollins321","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"sibling jeolousy and purchases","postDate":"1279726231","msgId":56312,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkyNzNxbitnMGZ1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":56314,"prevInTime":56311,"nextInTime":56313,"topicId":56312,"numMessagesInTopic":0,"msgSnippet":"I would love some help!  I have a 7 year-old daughter who is very jeolous any time her 4 year-old sister gets something that she does not have.  Yesterday was","messageBody":"<div id=\"ygrps-yiv-1689579053\">I would love some help!  I have a 7 year-old daughter who is very jeolous any time her 4 year-old sister gets something that she does not have.  Yesterday was the 4 year-old&#39;s birthday and she got to go to Build a Bear with her grandparents.  My eldest was upset all day.  She repeatedly asked me why her sister got to go and not her.  I explained over and over to her that it was for a birthday celebration and that she would get to go when it was her birthday.<br/>\n<br/>\n I took all 3 of my girls to the bookstore and let them each choose 3 books.  I thought this might help cheer everyone up.  It didn&#39;t.  I then told the oldest we could go to her favorite restaurant for dinner while the b-day girl was away at Build a Bear.  I told her we&#39;d go to Target and get her some Bella Sara cards that she&#39;d been wanting.  She seemed happy with that until her sister came home with a fabulous new stuffed horse.  She was very jeoulous of the horse and pouted the rest of the evening.  I told her when it was her b-day she could go get the same horse.  She kept worrying that they wouldn&#39;t have it at that time.  I tried to cheer her up by telling her a story about when I was young and wanted a toy my sister had gotten for Christmas.  We laughed about that, then I spent some time reading to her and we all went to bed.<br/>\n<br/>\nThis morning she was still so concerned that that horse would not be available on her b-day.  So I got on the Build a Bear website, and sure enough, it&#39;s a limited addition horse.  Tears.  I went ahead and bought the horse for her.  I&#39;m feeling uneasy about my decision.<br/>\n<br/>\n I want her to know without a doubt that her needs are very important and that I am her partner in life and will always do my best to help her have her wants and needs met.  However, I also feel that at some point, I want her to understand that money doesn&#39;t grow on trees.  (That&#39;s the &quot;old me&quot; talking - pre-unschooling thoughts I guess).  And there&#39;s a part of me that feels angry toward her for being selfish ( I know that sounds terrible).<br/>\n<br/>\n Anyway, how do you decide when to buy something for your children and when to say no?  I&#39;ve read similar posts where people have said if the money is there... buy it.  But the money can sort of always be found.  Or I can always think of a reason why we should save that money for something else.  This is such a tough one for me because I am a bit frugal when it comes to spending for myself.  It&#39;s hard for me to have children who want something everytime we go to the store.<br/>\n<br/>\n I have recently purchased several other things for my daughter after reading a post earlier this month about trying to say yes more.  I just feel at some point this spending needs to be slowed.  I did tell my daughter that we have only so much money to spend each month, and that I wanted to make sure this horse was something that she REALLY wanted and that she would be happy with the purchase.  She kind of just shut down, but did say yes to answer my question.  What&#39;s frustrating, too, is that she saw all this other stuff on the website that she wanted to get when I purchased the horse.  So even though I was able to say &quot;yes&quot; to the horse, I was also saying &quot;no&quot; to the outfits she wanted for it.  Ugh.<br/>\n<br/>\n I used to handle purchases by saying something like &quot;that would be a great birthday gift&quot; or &quot;would you like to do some chores around the house to earn the money&quot;.  Now that I am trying to adopt the unschooling as it applies to parenting, I&#39;m just a confused mess.  Sorry about the rambling on... I&#39;m holding a very talkative 2 year-old as I write.  Thank you so much for any input.</div>","specialLinks":[]}],"prevTopicId":56340,"nextTopicId":55995}}