{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"virgin births and all that","postDate":"1008982774","msgId":1266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNC5lNGIxODliLjI5NTUzNGY2QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":1265,"nextInTime":1267,"topicId":1266,"numMessagesInTopic":0,"msgSnippet":"THE VIRGIN BIRTH OF JESUS Fact or fable? Quotations: The day will come when the mystical generation of Jesus by the Supreme Being as his father, in the womb","messageBody":"<div id=\"ygrps-yiv-447908531\">THE VIRGIN BIRTH OF JESUS<br/>\nFact or fable?<br/>\n<br/>\nQuotations:<br/>\n<br/>\n&quot;The day will come when the mystical generation of Jesus by the Supreme Being <br/>\nas his father, in the womb of a virgin, will be classed with the fable of the <br/>\ngeneration of Minerva in the brain of Jupiter.&quot; Thomas Jefferson, 1823. 1<br/>\n<br/>\nDisbelief in the virgin birth has been referred to by many early Christian <br/>\nwriters as: <br/>\n&quot;madness and blasphemy&quot; by Gennadius, <br/>\n&quot;madness&quot; by Origen,  <br/>\n&quot;sacrilege&quot; by St. Ambrose,  <br/>\n&quot;impiety and smacking of atheism&quot; by Philostorgius, <br/>\n&quot;perfidy&quot; by St. Bede, <br/>\n&quot;full of blasphemies&quot; by the author of Prædestin, <br/>\n&quot;perfidy of the Jews&quot; by Pope Siricius, <br/>\n&quot;heresy&quot; by St. Augustine.<br/>\n<br/>\n<br/>\nOverview:<br/>\n<br/>\nFrom about 80 CE to the present time, most faith groups within the Christian <br/>\nreligion have taught that Jesus was conceived by his mother Mary, before she <br/>\nengaged in sexual intercourse. Some groups have taught that Mary lived, gave <br/>\nbirth to Jesus and died while still a virgin. This is believed to have been <br/>\naccomplished by the action of the Holy Spirit, without an act of sexual <br/>\nintercourse.  <br/>\nThe Anglican Communion, Eastern Orthodoxy, Protestantism and Roman <br/>\nCatholicism have taught various beliefs about the virgin birth. This doctrine <br/>\nis usually called the virgin birth, although the term virgin conception would <br/>\nbe much more accurate. This has long been one of the church&#39;s foundational <br/>\nbeliefs, along with the inerrancy of the Bible, and the atonement, <br/>\nresurrection and the anticipated second coming of Jesus. Church creeds have <br/>\nmentioned it. <br/>\n<br/>\nLiberal theologians have generally rejected the virgin birth, and classify it <br/>\nas a religious myth that was added to Christian belief to make the religion <br/>\nmore competitive with contemporary Pagan religions in the Mediterranean <br/>\nregion. <br/>\n<br/>\n<br/>\nTopics covered in this section:<br/>\n<br/>\nThe Virgin Birth: Part 1:  <br/>\nThe immaculate conception<br/>\nJesus conception and his &quot;brothers&quot;<br/>\nBiblical passages about the virgin birth<br/>\nThe virgin birth in Islam<br/>\nThe virgin birth in church creeds<br/>\nBeliefs of conservative Christians<br/>\n<br/>\n The Virgin Birth: Part 2:  <br/>\nBeliefs of liberal Christians<br/>\nBeliefs of the Roman Catholic Church<br/>\nBeliefs of American & British clergy and public<br/>\n<br/>\n Beliefs of various Christian denominations on Jesus&#39; conception and paternity<br/>\n (Roman Catholics, Mormons, other Protestants, religious liberals)<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.religioustolerance.org/virgin_b.htm\">http://www.religioustolerance.org/virgin_b.htm</a><br/>\n<br/>\n--------------<br/>\nIt&#39;s all one paragraph, below, because it&#39;s a summary of a chapter from a <br/>\nbook written in 1922.<br/>\n---------------<br/>\n<br/>\nChapter III - OTHER STORIES OF VIRGIN BIRTHS <br/>\n<br/>\n<br/>\nSynopsis: A Virgin Birth story not new at the time when the Gospels were <br/>\nwritten. Mythology is full of such stories. Gods who lived on earth as mortal <br/>\nmen all had such stories told of them. An Egyptian Virgin Birth story told <br/>\nabout two thousand years before Christianity was founded, with many details <br/>\nidentical with those to be found in the Gospel stories. Another virgin <br/>\ngoddess and child. The virgin birth of Horus. Statuettes of the virgin Isis <br/>\nand the child Horus used to represent Mary and the infant Jesus. Other <br/>\npre-Christian figures similarly employed. The miraculous birth of Apis. The <br/>\nvirgin mother of Ra. The virgin births of Attis, of Dionysos, of Jason, and <br/>\nof Perseus. The religions in vogue at the time when Christianity arose. How <br/>\nall the men-gods worshipped in these religions were said to have been <br/>\nmiraculously born. Adonis, Osiris, and Mithra. Legend about Plato&#39;s virgin <br/>\nbirth. Glorification of virginity. The story of Hypermnestra. Unicorns and <br/>\nvirgins. Vestal virgins. Chinese myth about the race being descended from a <br/>\nvirgin mother. The virgin birth of Gautama, the Buddha. Details of this story <br/>\nwhich correspond to the later Christian story. Rama&#39;s miraculous birth. The <br/>\nvirgin and otherwise remarkable births of many other Indian divinities. The <br/>\nPandavas, Karna, Kansa, Kartikeya, Garuda, Ganesa, Marisha. A god incarnate <br/>\nin a human being so late as the seventeenth century. Kings looked upon as <br/>\ngods and assuming divine titles and honours. Legends about their births. Sons <br/>\nof gods. The Pharaohs. Alexander the Great. The love of gods for mortal <br/>\nwomen; Silvia and the god Mars. Rhea Silvia, the mother of Romulus and Remus. <br/>\nLaymen and priests posing as the divine lovers. Examples in fact and in <br/>\nfiction. Mundus. The god Astrabacus. The birth of Hercules. Nectanebus. Women <br/>\nas mistresses of the gods. Mortals hailed as gods and given divine titles. <br/>\nPtolemy. Lysander. Demetrius and others. The rise of new religions in the <br/>\nEast. Legends of the virgin or otherwise unusual births of great conquerors <br/>\nor their ancestors. Zingis Khan. Togrul Beg, the Seljuk. Nurhachu. Targitaus. <br/>\nScythes. Sargon. Gudea. Caesar. Macduff. The virgin or otherwise remarkable <br/>\nbirths of the founders of the great world-religions. Lao-Tzu. Confucius. <br/>\nZoroaster. (Mohammed.) The virgin birth of Terebinthus, the legendary <br/>\noriginator of the doctrines of Manes. An ephemeral legend about St. Dominic. <br/>\nA Christian sect which believes that John the Baptist was conceived by a <br/>\nkiss. Fairy tales about the miraculous impregnation of women. A tale from <br/>\nSicily. Danae. A Siberian tale. General belief in the truth of such stories. <br/>\nHow gossip spreads, and how some people boast of seeing things which have <br/>\nnever occurred. The virgin-birth stories of Mexico. Huitzilopotchli. The <br/>\nbirth of gods and goddesses fully armed. Karna. Athena. Conception by the <br/>\ntouch of a flower. Mars. The virgin mother Here, and the recovery of her <br/>\nvirginity when lost. Stories from the South Pacific, from China, and from <br/>\nNorth America. A virgin-born being who lives a life of self-sacrifice for the <br/>\ngood of others. Gods incarnate in animals. Archaic virgin-birth myths. <br/>\nSources of the myths. Phallicism. Astronomy. The virgin goddesses and the <br/>\nmothers of the gods in Roman and Greek mythology. Mary as &quot;the mother of <br/>\nGod,&quot; a refined version of the older conceptions. Christian attempts to give <br/>\na spiritual explanation of the story of a physical act. The physiology of <br/>\nconception. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/Athens/Olympus/6868/sh0000a.html\">http://www.geocities.com/Athens/Olympus/6868/sh0000a.html</a><br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/paulntobin/virgin.html\">http://www.geocities.com/paulntobin/virgin.html</a></div>","specialLinks":[]}],"prevTopicId":1253,"nextTopicId":1268}}