{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] clothing and makeup","postDate":"1092157723","msgId":97624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MS4zMDgyMDcyZC4yZTRhNWIxYkBhb2wuY29tPg=="},"prevInTopic":97611,"nextInTopic":0,"prevInTime":97623,"nextInTime":97625,"topicId":97607,"numMessagesInTopic":0,"msgSnippet":"Cindy I liked everything you wrote about your kids and your sister s unfortunate reaction.  I wanted to point something out, kind of a technicality: ","messageBody":"<div id=\"ygrps-yiv-221516760\">Cindy I liked everything you wrote about your kids and your sister&#39;s <br/>\nunfortunate reaction.  I wanted to point something out, kind of a technicality:<br/>\n<br/>\n&lt;&lt; Yes, I deal daily with issues regarding house rules like being kind and <br/>\nthoughtful, &gt;&gt;<br/>\n<br/>\nIf you didn&#39;t have rules, you wouldn&#39;t have to deal with them daily.<br/>\nand if we think of rules as laws, you can&#39;t make a rule that says &quot;be kind&quot; <br/>\nor &quot;be thoughtful.&quot;<br/>\n<br/>\nSo honestly, you have an expectation and a hope that kids will be kind and <br/>\nthoughtful,  but how can it be a rule?<br/>\n<br/>\nHere&#39;s the beginning of a collection of writings on rules vs. principles (I <br/>\nknow there are some new list members who might not have known it was out there):<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\nIt&#39;s fun to think about.  We used to have rules, but they were more work than <br/>\nnot, and weren&#39;t really helping much of anything.    I suppose we still have <br/>\na few (it&#39;s okay to be gone if we know where you are, and it&#39;s okay to stay up <br/>\nwhen others are asleep if you can be quiet), but they&#39;re on the principle-ish <br/>\nedge.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] clothing and makeup","postDate":"1092150887","msgId":97611,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMThFNjY3LjIwOTA0MDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PEJBWTUtREFWMjJiaktvTUZZc0QwMDAwMDhmZkBob3RtYWlsLmNvbT4=","referencesHeader":"PEJBWTUtREFWMjJiaktvTUZZc0QwMDAwMDhmZkBob3RtYWlsLmNvbT4="},"prevInTopic":97607,"nextInTopic":97624,"prevInTime":97610,"nextInTime":97612,"topicId":97607,"numMessagesInTopic":0,"msgSnippet":"** My 11 1/2 yr old son has a lovely ponytail.  My sister constantly bribes him to cut it off.  She says that his long hair is just a symptom of what s wrong","messageBody":"<div id=\"ygrps-yiv-2024225327\">** My 11 1/2 yr old son has a lovely ponytail.  My sister constantly <br/>\nbribes him to cut it off.  She says that his long hair is just a symptom <br/>\nof what&#39;s wrong with him.**<br/>\n<br/>\nShe thinks it&#39;s &quot;wrong&quot; for him to not want to be just like other people?<br/>\n<br/>\n** She put her kids in day care at 5 weeks, bottle fed, spanks, public <br/>\nschool, is an ultra-conservative Christian. **<br/>\n<br/>\nI would be tempted to find a Christian source for her that says that the <br/>\nshepherd guides his flock with a rod, he doesn&#39;t whack the sheep with it.<br/>\n<br/>\n**My sister wants me to &quot;get control of him before it&#39;s too late&quot;.**<br/>\n<br/>\nRiiiiggghhhht.  Because he can never be a functioning grown-up unless <br/>\nhis parents are in charge of whatever  he does.   (Oy!)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":185667356,"authorName":"Cindy White","from":"&quot;Cindy White&quot; &lt;cindyomom@...&gt;","profile":"whitehouseacademy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"clothing and makeup","postDate":"1092145284","msgId":97607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWMjJiaktvTUZZc0QwMDAwMDhmZkBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":97611,"prevInTime":97606,"nextInTime":97608,"topicId":97607,"numMessagesInTopic":0,"msgSnippet":"My 11 1/2 yr old son has a lovely ponytail.  My sister constantly bribes him to cut it off.  She says that his long hair is just a symptom of what s wrong with","messageBody":"<div id=\"ygrps-yiv-662745572\">My 11 1/2 yr old son has a lovely ponytail.  My sister constantly bribes him to cut it off.  She says that his long hair is just a symptom of what&#39;s wrong with him. <br/>\n<br/>\nHere I must interject that my sister and I have always been very different, opposites in fact.  We&#39;re very close, but usually steer clear of &quot;hot topics&quot; like religion, politics, even child rearing.  I attachment parent, breastfed, never hit my child, homeschool, am a liberal non-Christian.  She put her kids in day care at 5 weeks, bottle fed, spanks, public school, is an ultra-conservative Christian.  <br/>\n<br/>\nWhen she tells me to make him cut his hair, I tell her it&#39;s his hair.  I tell her, and others who ask, that long hair is his way of expressing who he his.  If I dictate that now, then he will find other ways to express it.  Besides, it&#39;s not my job to dictate who he is.  It&#39;s my job to help him stay happy and healthy.<br/>\n<br/>\nIt&#39;s the same thing with clothes.  My kids get to pick what they want to wear.  I request they bathe if they smell bad, put on a clean shirt without holes to go out to eat.  But I talk to them about positive and negative impressions other people draw from a person&#39;s clothing and looks.  I talk to them about self-expression and being sure that you are &quot;saying&quot; to others what you really mean. To illustrate this I&#39;ve pointed out comments they make about people based on clothing, hair or appearance.  I also talk to them about not judging people based on clothing, but I think they understand that try as you might, we are still human, so it&#39;s hard not to judge books by their covers.  Especially books that are overt in their illustrations of what&#39;s inside.  <br/>\n<br/>\nBottom line, I encourage my kids to express themselves through their appearance while teaching them more about human nature so that they are not surprised if someone makes an untrue assumption about them based on appearance.  But it&#39;s not something we talk about much, just if it comes up.  Sometimes too much talk can cause problems rather then prevent them, just like cutting a hangnail too short will hurt more than the hangnail did.<br/>\n<br/>\nBack to what&#39;s wrong with my son.....he&#39;s entering adolescence.  That&#39;s not something that needs to be corrected.  My sister wants me to &quot;get control of him before it&#39;s too late&quot;.  I tell her that my only concern is that he continues to be true to himself and make wise choices.  Yes, I deal daily with issues regarding house rules like being kind and thoughtful, but he&#39;s not out of control.  Sometimes he loses self-control but not in a dangerous way, only in a growing up kind of way.    <br/>\n<br/>\nCindy in VA<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":97549,"nextTopicId":97636}}