{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peace of Unschooling was: Re: help supporting daughter with letting go","postDate":"1359661730","msgId":70424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlERDhFMDJFLThBMEQtNDkzQi05ODEyLTZBRUMwOUY2QzQ1QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtlZTdxZStpNm9rQGVHcm91cHMuY29tPg==","referencesHeader":"PGtlZTdxZStpNm9rQGVHcm91cHMuY29tPg=="},"prevInTopic":70423,"nextInTopic":0,"prevInTime":70423,"nextInTime":70425,"topicId":70423,"numMessagesInTopic":0,"msgSnippet":"-=- I ve dealt with anxiety and depression my entire life, and have done a great deal of work on that, both with professionals and with self-help books. But","messageBody":"<div id=\"ygrps-yiv-1394952299\">-=- I&#39;ve dealt with anxiety and depression my entire life, and have done a great deal of work on that, both with professionals and with self-help books. But *nothing* has calmed me, and deeply improved my relationship with myself and my family, like learning about Radical Unschooling and putting it into action in our lives.-=-<br/>\n<br/>\nTherapy helps people get one step away from suicidal depression, or one step away from being so frustrated that their lives are being ruined.  <br/>\n<br/>\nIf you have a broken leg, the first time you can walk without crutches, the orthopedic guys will say &quot;cured.&quot;<br/>\n<br/>\nThere&#39;s a book called Slowing Down to the Speed of Life that&#39;s comforting and encouraging.    Because there are two authors, I can&#39;t say who says... but they&#39;re talking about mental health as being MUCH bigger and more important than just the lack of mental illness or of depression.  HEALTHY!  Walking painstakingly without crutches isn&#39;t &quot;healthy.&quot;  It&#39;s still gimpy.  :-)<br/>\n<br/>\nI&#39;ve had three big depressions in my life.  I would have had more, if I hadn&#39;t figured out (with self-help and help from a therapist when Kirby was a year old) what it was, so in retrospect I saw that it was the second time I had been in such a state.   A third one came (situationally triggered, and got worse) when Holly was two.  I went to the same counsellor, then.   <br/>\n<br/>\nProzac was employed, for a while.  I did not want to live there.  I wanted to find natural, honest ways to maintain my upbeat and joyful self.<br/>\n<br/>\nSince then I&#39;ve felt depression coming, and a couple of times I took prozac pre-emptively, to bouy myself up so that the other tools I had gained over the years would work more easily, and I was afraid to slip down again.  <br/>\n<br/>\nThe past few times that I&#39;ve had the feelings (which have become easier to recognize and deal with as I&#39;ve gotten older and more experienced) I didn&#39;t even consider prozac.  I used the maintenance tools I had.<br/>\n<br/>\nMany years ago, in an unschooling discussion (either on unschooling.com or in the early days of the discussions at radical unschooling.info, neither of which message board survived), I had said if someone was feeling depression coming, to listen to happy music watch comedies, eat comfort food, don&#39;t watch the news.   Someone else (someone I knew, who also had personal experience with depression) attempted to shush me, and shame me, but I was untouched, because I knew I was right.  She said nobody can do anything about depression because it&#39;s chemical and one MUST go to a therapist or die, pretty much.  And that if I advised people that they had any control whatsoever over such things I was giving dangerous advice.<br/>\n<br/>\nListen:  I know how to make myself unhappy.  I bet I could, with a few well-chosen stories artfully presented, make hundreds of you feel so horrible you wouldn&#39;t sleep tonight.  Maybe not for a week.  If I repeated the application of depressing ideas twice a day, and you weren&#39;t bright enough to get the hell away from me and stop reading it, we could just start counting the sorrow and violence that was likely to result from that.<br/>\n<br/>\nI WILL NOT DO THAT!  I don&#39;t want to.  But I know how.  And if you think about it, you probably know how to.  So whatever stories or moods or thoughts just came to your mind.  THOSE are the ones you should avoid, at least while you&#39;re responsible for the happiness of your children.  And probably you could go the rest of your life without wallowing in sorrow and grief and woe.<br/>\n<br/>\nSo If you know that you can make yourself unhappy, then you must know that making choices in the other direction could make you happy.  So that&#39;s the deal.  Each choice you make takes you nearer to one or the other—dark hole or happy light.  YES, absolutely, some people are &quot;even keeled&quot; (and were from birth) and won&#39;t be depressed, ever, nor will they (because of the same biohemical realities) ever experience giddy elation and the squealing giggles.   Those whose sine wave is small can watch the news and listen to John Prine and Joni Mitchell anytime.  Those with a more extreme range need to find their own personal ways to avoid the pit, and to remember, if they are IN the pit, that the curve will rise again, and they can help themselves up and out (or a therapist and some drugs can).<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/mindfulness/\">http://sandradodd.com/mindfulness/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a> <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":526125213,"authorName":"Michelle","from":"&quot;Michelle&quot; &lt;shellthed@...&gt;","profile":"pamperedthed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Peace of Unschooling was: Re: help supporting daughter with letting go","postDate":"1359651470","msgId":70423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlZTdxZStpNm9rQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":70424,"prevInTime":70422,"nextInTime":70424,"topicId":70423,"numMessagesInTopic":0,"msgSnippet":"I just wanted to echo what Trisha said here. I ve dealt with anxiety and depression my entire life, and have done a great deal of work on that, both with","messageBody":"<div id=\"ygrps-yiv-321494497\">I just wanted to echo what Trisha said here. I&#39;ve dealt with anxiety and depression my entire life, and have done a great deal of work on that, both with professionals and with self-help books. But *nothing* has calmed me, and deeply improved my relationship with myself and my family, like learning about Radical Unschooling and putting it into action in our lives. I&#39;d walked down this path several years ago, but had not heeded Sandra&#39;s wise words of, &quot;Read a little, try a little, wait a while, watch.&quot; We dropped all structure and it was very uncomfortable and confusing for everyone. I decided Radical Unschooling wouldn&#39;t work for us and went back to the old, mainstream way of homeschooling and (mostly) parenting. <br/>\n<br/>\nThe last six months of 2012 were horrible for us, emotionally. Fighting, anger, stress, meltdowns, you name it. Just misery. One day I started reading at Sandra&#39;s site again, little bits here and there. We gradually started leaning towards Radical Unschooling again, and the peace increased in our family, and in myself. I&#39;m still moving gradually, making choices in the moment, using kindness as my baseline. Baby steps. The energy in our home is completely different, in the best way possible.<br/>\n<br/>\nMy children are both very prone to anxiety, as they both have neurological challenges where anxiety is a large part. My older son was on Prozac for many years because his emotions were so difficult for him to handle. Since I&#39;ve changed how I relate to my family, and we&#39;re all in harmony more often than not, he has been able to completely stop taking medication (with a doctor&#39;s approval of course!). I&#39;m not saying this would be the result for everyone, nor am I saying that medication is not needed sometimes - he may very well use it again someday. But just to say how, when we took the unnecessary stress out of his environment - of school-at-home nonsense, control by his parents, etc. - he has been much more capable of handing the little stresses that are inevitable in life. That right there says an awful lot about the peace of unschooling to me. :)<br/>\n<br/>\nMichelle<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Trisha Farr  wrote:<br/>\n&gt;I know there are lots<br/>\n&gt; of books out there, but I&#39;m finding the things I read on this list help<br/>\n&gt; more with inner growth than anything else I have read. I have felt more<br/>\n&gt; peace in the six months or so that I&#39;ve been learning about unschooling<br/>\n&gt; than I have my entire life. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":70396,"nextTopicId":70393}}