{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":37265427,"authorName":"sennmanor@aol.com","from":"sennmanor@...","profile":"sennmanor","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Which digest number are we on?","postDate":"1050759223","msgId":65455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3Yy4xOWI1ZDcyMC4yYmQyYWEzN0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":65454,"nextInTime":65456,"topicId":65455,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/19/2003 5:42:56 AM Central Standard Time, ... Yes, I think you re right. Below is something someone posted to our local list which","messageBody":"<div id=\"ygrps-yiv-928430247\">In a message dated 4/19/2003 5:42:56 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sounds like an AOL problem.<br/>\n<br/>\n </span></blockquote>Yes, I think you&#39;re right. Below is something someone posted to our local <br/>\nlist which addresses this issue. BTW, when I got up this morning and signed <br/>\non, I had Digest #3330 waiting for me, which means I missed 9 others!<br/>\n<br/>\nMary<br/>\n<br/>\n* * *<br/>\n<br/>\n<br/>\nWhy does list mail come out of order or hours/days late or never appear at<br/>\nall? Why do my AOL members not get all the list mail or digests? Why does it<br/>\ntake hours or days for list mail to get to my Hotmail or Yahoo email box<br/>\n...?<br/>\n<br/>\nBecause AOL, MSN, Yahoo email, Hotmail, Earthlink, et al, are large email<br/>\nproviders. They get literally tons of email and they have to watch their<br/>\nservers carefully because they can get overloaded. So they prioritize. They<br/>\ngive private email priority over group or list mail.<br/>\n<br/>\n<br/>\nYahoogroups is the largest email list provider (pay or free) and they send<br/>\nout literally tons of mail. Large chunks of that mail go to the largest<br/>\nemail providers like AOL, MSN, Yahoo email, Hotmail, Earthlink, etc. Since<br/>\nthose large email providers give priority to private email, when their<br/>\nservers are busy, they will refuse connections with Yahoogroups.<br/>\n<br/>\n<br/>\nIn other words, Yahoogroups tries to connect to them but their incoming mail<br/>\nservers say no, try again later. So Yahoogroups holds the mail and waits,<br/>\ntries again later until the email provider (AOL, MSN, Yahoo email, etc) will<br/>\naccept the connection and receive the mail from Yahoogroups.<br/>\n<br/>\n<br/>\nSo that&#39;s why things come late and out of order. In addition, AOL has<br/>\nadmitted that they trash some email from Yahoogroups when their servers are<br/>\nbusy, so some Yahoogroups mail is lost and never delivered to AOL members.<br/>\n<br/>\n<br/>\nThis also applies to the confirmations sent by Yahoogroups to confirm your<br/>\nemail address or your subscription or unsubscription requests as well as<br/>\nnotices to listowners and moderators about pending posts or members.<br/>\nSometimes these confirmations and notifications take hours or days to get to<br/>\nyou or never show up at all.<br/>\n<br/>\n<br/>\nIf you really want to check things out, you can review the full headers of<br/>\ndelayed messages. The Received: lines at the top of the headers are the most<br/>\nrecent, the top one will be when your ISP or mail provider received it from<br/>\nYahoogroups. The Received: lines before that one are transfers between<br/>\ninternal Yahoogroups servers. So look at the time on the topmost Received<br/>\nline and compare it to the time on the Received line just below that. Adjust<br/>\nfor time differences if necessary and if there&#39;s a big gap, it means<br/>\nYahoogroups was trying to contact your ISP or mail provider and couldn&#39;t get<br/>\nthru, so they waited and tried again and again until they got thru.<br/>\n<br/>\n<br/>\nIn the case of AOL, it&#39;s also possible there&#39;s a delay after AOL received it<br/>\nand before they delivered it to the AOLer&#39;s mail box as AOL has admitted<br/>\nthat they do sometimes accept mail from Yahoogroups and then hold it<br/>\nsomewhere in their system until their servers are not so busy and then<br/>\ndeliver it to the AOL member&#39;s mail box.<br/>\n<br/>\n<br/>\nSometimes an ISP or mail provider isn&#39;t reachable after hours or days or<br/>\ntrying to send mail and then Yahoogroups considers it a soft bounce. Some<br/>\nYahoogroups list owners that use Yahoo email have reported seeing a message<br/>\nin their bounce history (go to My Preferences and click on Bounce History)<br/>\nthat says &quot;Yahoo mail servers unreachable for too long&quot;. This means<br/>\nYahoogroups tried to send mail to them for a long period and finally gave<br/>\nup. This may happen with any of the large ISPs or mail providers if they<br/>\nexperience temporary server problems and have to severely curtail their<br/>\nincoming mail for a period of time until the servers are fixed and list mail<br/>\nlike Yahoogroups is always the first thing they restrict.   <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":65394,"nextTopicId":65456}}