{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":4324016,"authorName":"Kelly Lenhart","from":"&quot;Kelly Lenhart&quot; &lt;mina@...&gt;","profile":"mommamina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Writing for no reason WAS Reassurance and support","postDate":"1102004229","msgId":101458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNvbmY2NStjbWljQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxMjcwMWM0ZDgwZiQwZGIxMDJmMCQ2NTAwYThjMEBTWVNURU1BWD4="},"prevInTopic":101454,"nextInTopic":0,"prevInTime":101457,"nextInTime":101459,"topicId":101445,"numMessagesInTopic":0,"msgSnippet":"... would try ... I did it.  And I finidhed, too.  Worked on a story idea I ve had since high school, which has gone through many forms. I actually set this","messageBody":"<div id=\"ygrps-yiv-2029395827\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;lgbryk&quot; &lt;lgbryk@e...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;   Wow! I&#39;m impressed.  I wondered how many people from the list<br/>\n </span></blockquote>would try<br/>\n<blockquote><span title=\"ireply\"> &gt;   it.  <br/>\n<br/>\n<br/>\n </span></blockquote>I did it.  And I finidhed, too.  Worked on a story idea I&#39;ve had since<br/>\nhigh school, which has gone through many forms.<br/>\n<br/>\nI actually set this list and many others to no mail to get it done.<br/>\n<br/>\nKelly</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Writing for no reason WAS Reassurance\tand support","postDate":"1101989926","msgId":101454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJERDQ3MjU1LjJFRTk2JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMDgwMWM0ZDgxOCQzMjgxZDI0MCQ5NzI3MjYwY0BNb20+"},"prevInTopic":101450,"nextInTopic":101458,"prevInTime":101453,"nextInTime":101455,"topicId":101445,"numMessagesInTopic":0,"msgSnippet":"... November is National Novel Writers Month. There s an organization called NaNoWriMo.org that challenges everyone who has ever thought about writing to write","messageBody":"<div id=\"ygrps-yiv-661926750\">on 12/1/04 9:39 PM, Heidi Here at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kleincrew@...\">kleincrew@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I must have missed something!! What are you guys taking about , what kind of<br/>\n&gt; book writing?<br/>\n&gt; Thanks for letting me know<br/>\n<br/>\n </span></blockquote>November is National Novel Writers Month. There&#39;s an organization called<br/>\nNaNoWriMo.org that challenges everyone who has ever thought about writing to<br/>\nwrite a 50,000 word novel in 30 days -- between Nov 1 and midnight Nov 30.<br/>\n<br/>\nThe basic idea is that we&#39;re each our biggest roadblocks to writing. We want<br/>\nour writing to be great so we think about it too much and put it off or edit<br/>\ntoo much trying to get something perfect. So the challenge is to just write<br/>\nwithout concern for quality. It&#39;s *quantity* that counts in November, not<br/>\nquality. :-)<br/>\n<br/>\nAnd by not caring about quality people can produce some pretty good writing<br/>\n:-) I remember reading in a book on writing that several authors basically<br/>\ndo write that way. Their goal is to produce 1000 words a day. And one was<br/>\nquoted as saying that some days he produces what feels like great stuff and<br/>\nsome days he produces what feels like crap but then when he reads it later<br/>\nthey&#39;re both equally good.<br/>\n<br/>\nMy daughter Kathryn (13) and I participated this year. (And completed it!<br/>\nYeah! :-) Hers is done. Mine is still going. (50,000 is the minimum for a<br/>\npublished novel.) (I probably couldn&#39;t have done it if Kathryn wasn&#39;t too<br/>\nsince she was perfectly content to write for several hours a day which gave<br/>\nme time to also. And also that we didn&#39;t have visitors for Thanksgiving!)<br/>\n<br/>\nAnd I&#39;d definitely not say writing for NaNoWriMo is &quot;writing for no reason&quot;!<br/>\nIt was writing for fun! :-)<br/>\n<br/>\n===========Here&#39;s a bit of Kathryn&#39;s:<br/>\n[Hers takes place in this world she&#39;s developed over many years.]<br/>\n<br/>\nBane&#39;s Awakening<br/>\n<br/>\nStory premise recap thing (just so you get the idea of what&#39;s going on):<br/>\n<br/>\nAvn Hisky is a pearly pink cat that can walk upright like a human. She lives<br/>\nin an enormous gigantic company called Katzah Korp. with her friends, Spot,<br/>\nTiger, Pachiki and her little sister Star. And along with about fifty<br/>\nthousand other cats. Katzah Korp. is owned by the never seen Mr. Katzah who<br/>\nholds classes where the cats in his company make products. Such as comic<br/>\nbooks and comic strips, origami ornaments for all kinds of occasions,<br/>\npottery and other things he can sell at a high price. Mostly, the cats enjoy<br/>\nit in Katzah Korp. but try to get back at Mr. Katzah for various reasons.<br/>\nSuch as, he is an overly powerful rich moron who thinks he&#39;s better than<br/>\neveryone else and likes money. But, Mr. Katzah does like one cat. His name<br/>\nis Richard Richmond. He has almost as much money as Mr. Katzah does.<br/>\n<br/>\nChapter one: The first chapter of many (well, this isn&#39;t actually a chapter<br/>\nso much as it is a devisor between the prologue and the actual story)<br/>\n<br/>\nAvn woke up to a chilly Autumn morning. She pulled herself out of her bed<br/>\nand slid into her fuzzy, warm and brown football slippers. She then went<br/>\nover to her closet and pulled on a leopard patterned winter robe. Once she<br/>\nwas ready, Avn headed down stairs to the enormous Breakfast Hall. (Which was<br/>\nalso the Lunch and Dinner Hall, but anyway).<br/>\n<br/>\nAvn stared up at the 54 different things that were on the breakfast menu.<br/>\nCats would give ideas and then usually the food ideas would go on the menu.<br/>\nThere was a new item on the menu called &quot;Bob and Larry&#39;s seafood chili&quot;. For<br/>\nsome unknown reason, when new items were added, they were added to all of<br/>\nthe menus. Maybe it was to see for which meal it was usually ordered, then<br/>\nthe menu person (whomever that may be) would put it on that menu.<br/>\n<br/>\n&quot;What are you going to get?&quot; asked Avn&#39;s best friend Spot as he walked into<br/>\nthe Breakfast Hall.<br/>\n<br/>\n&quot;Not &#39;Bob and Larry&#39;s seafood chili&#39;,&quot; Avn replied.<br/>\n<br/>\n&quot;Same with me. But that narrows the choice of breakfast down to fifty<br/>\nthree,&quot; said Spot.<br/>\n<br/>\n&quot;Exactly. How about Pineapple Fruit Bowl?&quot; asked Avn.<br/>\n<br/>\n&quot;Huh? Never heard of that one. What is it?&quot; Spot asked in return.<br/>\n<br/>\n&quot;It&#39;s a pineapple cut in half lengthwise with some of the fruit scooped out<br/>\nto make sort of a bowl. The fruit that was scooped out is then diced and<br/>\nmixed together with grapes and other diced fruits like melons, apples and<br/>\noranges and such and then put inside the pineapple half. It&#39;s really good&quot;<br/>\nreplied Avn.<br/>\n<br/>\n&quot;Sounds yummy! I&#39;ll try it!&quot; Said Spot.<br/>\n<br/>\nThey ordered two Pineapple Fruit Bowls and sat down with their breakfasts at<br/>\none of the many many gray plastic tables in the Breakfast Hall.<br/>\n<br/>\nThen, two of Avn and Spot&#39;s friends walked into the Breakfast Hall, ordered<br/>\nbreakfast, came over and sat down with Avn and Spot.<br/>\n<br/>\n&quot;Yo peeps! How ya doin&#39;?&quot; said the tiger striped one, whose name was Tiger.<br/>\nTiger believed that martians were going to take over the planet and suck out<br/>\neveryone&#39;s souls and eat them on their toast.<br/>\n<br/>\n&quot;We&#39;re doing good! As long as we don&#39;t eat a bowl of Bob and Larry&#39;s seafood<br/>\nchili.&quot; Said Avn.<br/>\n<br/>\n&quot;I hear that!&quot; said Tiger raising his glass of ruby red grapefruit juice.<br/>\n<br/>\n&quot;Attention! Attention!&quot; Boomed a loud, commanding and all too familiar voice<br/>\nover the loud speaker. It was the voice of Mr. Katzah. &quot;I have a special<br/>\ndelivery for anyone who can take care of and wants one! Meet me in the Main<br/>\nHall as soon as you can. I&#39;ll be there or I&#39;ll have someone stationed there<br/>\nall day. That is all.&quot;<br/>\n<br/>\n&quot;I wonder what &#39;It&#39; could be?&quot; Avn mused.<br/>\n<br/>\n&quot;Probably the world&#39;s largest Jolly Rancher. Or a living ball of fluffy pink<br/>\nand/or blue cotton candy! Ah, heaven...&quot; sighed Tiger.<br/>\n<br/>\n&quot;Uh, yeah. But, knowing Mr. Katzah, it might just be. Who knows?&quot; said<br/>\nPachiki sipping her Fruit Soup.<br/>\n<br/>\n&quot;What&#39;s in that stuff anyway? I&#39;ve thought about trying it. Is it good?&quot; Avn<br/>\nasked Pachiki, pointing at her Fruit Soup.<br/>\n<br/>\n&quot;Fruit juices and the syrup stuff that&#39;s in the cans of fruit for the broth,<br/>\nand chopped up fruit and chopped up canned fruit. It&#39;s sweet, but very<br/>\ngood,&quot; replied Pachiki.<br/>\n<br/>\n&quot;Well, once I&#39;m done with my Ham and Cheese Scone, I&#39;m going to go see what<br/>\n&#39;It&#39; is! Anyone want to join me?&quot; asked Tiger.<br/>\n<br/>\n&quot;Sure! I&#39;ll be done with my breakfast soon too,&quot; said Spot.<br/>\n<br/>\n========= And a bit of my fantasy titled &quot;Flight&quot;:<br/>\n<br/>\n&quot;I will rip his eyeballs out and impale them on a spit and roast them until<br/>\nthey burst. I will rip his nose off and season it with fire pepper and feed<br/>\nit to Tagira. I will rip his lips off and&quot; dark haired Magla chanted into<br/>\nthe warm wind rushing into her as the massive orange tiger beneath her<br/>\nbounded over ragged rocks and scrubby scrouse bushes.<br/>\n<br/>\nKaya rode near Magla on the back of a jewel blue dragon, its powerful wings<br/>\nthrusting rider and mount just a few hand breadths above the ground. This<br/>\nwas going downward in more ways than one, Kaya thought and tuned out her<br/>\nclanmate. Not that Kaya didn&#39;t agree with the sentiment. She just didn&#39;t<br/>\nneed to hear it graphically spelled out.<br/>\n<br/>\nTagira the tiger, carrying her small, spewing rider, leapt over the<br/>\noutcropping and dropped down to the dusty rocky path that led around the<br/>\nside of the mountain. Chengdo, Kaya&#39;s dragon, banked gracefully to follow<br/>\nTagira, then abruptly plummeted down the side of the mountain.<br/>\n<br/>\n&quot;Cheeennngggdooooo!&quot; Kaya screamed pulling at the emerald green reins<br/>\nattached to the ruby red halter. But the dragon was oblivious to external<br/>\ncommands for spilling out of a split in the side of the mountain was a tam<br/>\nbush, laden with fat purple berries. A sinuous twist to face upward and the<br/>\ndragon slammed into the rocky cliff, golden claws splayed feeling for tiny<br/>\ncracks and miniscule crevices. And her dragon began to feed on the one food<br/>\ndragons could never resist. Kaya clung to the neck of the dragon, settling<br/>\nher bottom on the backrest of the tooled leather dragon saddle, specially<br/>\ndesigned for this inevitable occurrence. She buried her face in the soft<br/>\nblue feathery scales of the dragon&#39;s neck and prepared to wait.<br/>\n<br/>\n&quot;Kaaaayaaaa!&quot; Magla called from above.<br/>\n<br/>\n&quot;Down here!&quot; called Kaya. &quot;Chengdo spotted tam berries.&quot; She didn&#39;t need to<br/>\nsay more. Magla&#39;s deep sigh drifted down to her. &quot;Go on without me.&quot;<br/>\n<br/>\n&quot;No, I can&#39;t. This is an insult to both of us. We must confront the beast of<br/>\na monk together.&quot;<br/>\n<br/>\nWhich was true. Her fist thudded against the dragon&#39;s neck in frustration<br/>\nbut the dragon paid no heed to her. She could feel the muscles beneath the<br/>\nscales working as the dragon stripped the berries from the bush and worked<br/>\nthem rhythmically into a pulp with his tongue. Chengdo&#39;s breath rumbled<br/>\ndeeply in his chest like the purring of a contented cat.<br/>\n<br/>\nKaya breathed deeply as she&#39;d been taught, letting go of the air and the<br/>\ntension and the desire to control what was uncontrollable. After 50 deep<br/>\nslow breaths she felt the dragon&#39;s grip relax. Chengdo pushed himself away<br/>\nfrom the craggy cliff. He thrust out his leathery wings catching huge scoops<br/>\nof the late spring air to twist acrobatically around until the two of them<br/>\nwere hovering above Magla and Tagira.<br/>\n<br/>\nA gentle nudge from Magla and Tagira twisted as gracefully as Chengdo as<br/>\nthough the two were adversaries in some fall athletic competition. Tagira<br/>\nbounded up the mountain, catching purchase where no earthbound creature<br/>\nshould be able to go. Chengdo followed easily, now a complementary partner<br/>\nin their powerful dance across the mountainous terrain.<br/>\n<br/>\nThe two pairs of riders and mounts reached the peak and paused to look down<br/>\nat the rock carved monastery and village of the herding people. The tiger<br/>\nstood proudly atop the stone perch as the dragon settled next to him.<br/>\n<br/>\nAfter a few moments of deep admiration for the patch of emerald green<br/>\nnestled in a rocky bowl of the mountain range, Kaya called, &quot;Find Xan.&quot; The<br/>\ntiger&#39;s ears flicked back as it caught the familiar name. Then the tiger and<br/>\ndragon locked in a contest to be the first to spot the monk.<br/>\n<br/>\nThe tiger won by an eye blink and bounded down the mountain. The dragon<br/>\nlaunched outward twisting and stretching into a banking circle high over the<br/>\ncurving patch of vegetation, its golden eyes locked onto the one the friends<br/>\nsought. With a gathering of wings, Chengdo dropped like hawk after a rabbit.<br/>\nThis would be no contest for the dragon could drop through the air faster<br/>\nthan the tiger could bound down the cliff.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":127152010,"authorName":"Holly Furgason","from":"&quot;Holly Furgason&quot; &lt;unschooler@...&gt;","profile":"hollyfurgason","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Writing for no reason WAS Reassurance and support","postDate":"1101958226","msgId":101450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNvbTI4aSs0Z3YzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQxMjAyMDI0NDQ1LjgwNjQ5LnFtYWlsQHdlYjU0NzA3Lm1haWwueWFob28uY29tPg=="},"prevInTopic":101449,"nextInTopic":101454,"prevInTime":101449,"nextInTime":101451,"topicId":101445,"numMessagesInTopic":0,"msgSnippet":"I did it for three years but decided not to this year since I have a real writing project I have to get done.  I was surprised to find bits and pieces in my","messageBody":"<div id=\"ygrps-yiv-1241067124\">I did it for three years but decided not to this year since I have <br/>\na &quot;real&quot; writing project I have to get done.  I was surprised to find <br/>\nbits and pieces in my NaNoWriMo writings that were actually good even <br/>\nthough I&#39;m not a fiction writer.  I cut and pasted them into a file I <br/>\ncall &quot;Snippets&quot; and will probably use them some time in other <br/>\nthings.  I even got an unfinished short story out of one. <br/>\n<br/>\nI went a couple of weeks ago see the guy who started it.  I can&#39;t <br/>\nremember his name but just a wrote a book called No Plot? No <br/>\nProblem!  He did say that he was still writing everyday despite being <br/>\non tour.  I think it works better in Nov. for people without kids. :-)<br/>\n<br/>\nHolly<br/>\n2 COOL 4 SCHOOL<br/>\nSave $12 when you spend $50 or more!<br/>\nEnter the coupon code HOLBUY6 when checking out.<br/>\nThis coupon expires December 8, 2004... so hurry! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafperess.com/2cool4school\">http://www.cafperess.com/2cool4school</a><br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Elizabeth Roberts <br/>\n&lt;ladyeliza_r@y...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; I tried last year and got about halfway through before<br/>\n&gt; it was just too much to keep up with. I think it would<br/>\n&gt; work better if it was a month without a major<br/>\n&gt; drop-everything sort of holiday.<br/>\n&gt; <br/>\n&gt; Elizabeth </span></blockquote></div>","specialLinks":[]},{"userId":65261722,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;ladyeliza_r@...&gt;","profile":"ladyeliza_r","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Writing for no reason WAS Reassurance and support","postDate":"1101955484","msgId":101449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMjAyMDI0NDQ1LjgwNjQ5LnFtYWlsQHdlYjU0NzA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDQxMjAxLjE4MDM0Ny4yMDcyLjQuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":101448,"nextInTopic":101450,"prevInTime":101448,"nextInTime":101450,"topicId":101445,"numMessagesInTopic":0,"msgSnippet":"I tried last year and got about halfway through before it was just too much to keep up with. I think it would work better if it was a month without a major ","messageBody":"<div id=\"ygrps-yiv-1012830431\">I tried last year and got about halfway through before<br/>\nit was just too much to keep up with. I think it would<br/>\nwork better if it was a month without a major<br/>\ndrop-everything sort of holiday.<br/>\n<br/>\nElizabeth<br/>\n<br/>\n--- Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***Now wait a minute!  &lt;g&gt;  I just finished trying<br/>\n&gt; to do NaNoWriMo - <br/>\n&gt; trying to write 50,000 words in the month of<br/>\n&gt; November, just because.  ***<br/>\n&gt; <br/>\n&gt; According to my mother &quot;because&quot; is a valid reason<br/>\n&gt; for doing a thing. &lt;g&gt;<br/>\n&gt; <br/>\n&gt; ***(I only got to 36934, but I tried - having house<br/>\n&gt; guests for more than<br/>\n&gt; a <br/>\n&gt; week and a half didn&#39;t help!)***<br/>\n&gt; <br/>\n&gt; Wow! I&#39;m impressed.  I wondered how many people from<br/>\n&gt; the list would try<br/>\n&gt; it.  <br/>\n&gt; <br/>\n&gt; ***The motto of NaNoWriMo is &quot;No Plot, No Problem&quot; <br/>\n&gt; It is amazing <br/>\n&gt; what comes out when you don&#39;t know what to write!***<br/>\n&gt; <br/>\n&gt; Tease!  You&#39;re a tease!  What *did* you write about?<br/>\n&gt;  &lt;g&gt;  <br/>\n&gt; <br/>\n&gt; Maybe somebody should start a list for unschooling<br/>\n&gt; writers where folks<br/>\n&gt; could post their curious works. &lt;g&gt;  I guess that&#39;s<br/>\n&gt; what we do here.  ; )<br/>\n&gt; <br/>\n&gt; Deb L<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>=====<br/>\nElizabeth<br/>\nHttp://rainbowacademy.blogspot.com<br/>\n<br/>\n<br/>\n\t\t<br/>\n__________________________________ <br/>\nDo you Yahoo!? <br/>\nAll your favorites on one personal page � Try My Yahoo!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://my.yahoo.com\">http://my.yahoo.com</a></div>","specialLinks":[]},{"userId":200184763,"authorName":"Heidi Here","from":"&quot;Heidi Here&quot; &lt;kleincrew@...&gt;","profile":"kleincrew","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Writing for no reason WAS Reassurance and support","postDate":"1101955189","msgId":101448,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWM0ZDgxOCQzMjgxZDI0MCQ5NzI3MjYwY0BNb20+","referencesHeader":"PDIwMDQxMjAxLjE4MDM0Ny4yMDcyLjQuZGR6aW1sZXdAanVuby5jb20+IDwwMTI3MDFjNGQ4MGYkMGRiMTAyZjAkNjUwMGE4YzBAU1lTVEVNQVg+"},"prevInTopic":101447,"nextInTopic":101449,"prevInTime":101447,"nextInTime":101449,"topicId":101445,"numMessagesInTopic":0,"msgSnippet":"I must have missed something!! What are you guys taking about , what kind of book writing? Thanks for letting me know Heidi ... From: lgbryk To:","messageBody":"<div id=\"ygrps-yiv-1138351980\">I must have missed something!! What are you guys taking about , what kind of book writing?<br/>\nThanks for letting me know<br/>\nHeidi<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: lgbryk <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Wednesday, December 01, 2004 8:34 PM<br/>\n  Subject: Re: [UnschoolingDiscussion] Writing for no reason WAS Reassurance and support<br/>\n<br/>\n<br/>\n    Wow! I&#39;m impressed.  I wondered how many people from the list would try<br/>\n    it.  <br/>\n<br/>\n<br/>\n<br/>\n  My daughter challenged me to write this novel -- sadly I wrote about 500 words -- on the other hand my daughter did over 30,000 words. Life did get in the way, but she plans to keep writing until she hits 50,000 words. She has had so much fun doing this.<br/>\n  Linda<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":140464434,"authorName":"lgbryk","from":"&quot;lgbryk&quot; &lt;lgbryk@...&gt;","profile":"willowrose07871","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Writing for no reason WAS Reassurance and support","postDate":"1101951260","msgId":101447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMjcwMWM0ZDgwZiQwZGIxMDJmMCQ2NTAwYThjMEBTWVNURU1BWD4=","referencesHeader":"PDIwMDQxMjAxLjE4MDM0Ny4yMDcyLjQuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":101446,"nextInTopic":101448,"prevInTime":101446,"nextInTime":101448,"topicId":101445,"numMessagesInTopic":0,"msgSnippet":"Wow! I m impressed.  I wondered how many people from the list would try it. My daughter challenged me to write this novel -- sadly I wrote about 500 words --","messageBody":"<div id=\"ygrps-yiv-1725431834\">Wow! I&#39;m impressed.  I wondered how many people from the list would try<br/>\n  it.  <br/>\n<br/>\n<br/>\n<br/>\nMy daughter challenged me to write this novel -- sadly I wrote about 500 words -- on the other hand my daughter did over 30,000 words. Life did get in the way, but she plans to keep writing until she hits 50,000 words. She has had so much fun doing this.<br/>\nLinda<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Writing for no reason WAS Reassurance and support","postDate":"1101949427","msgId":101446,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQxMjAxLjE4MDM0Ny4yMDcyLjQuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":101445,"nextInTopic":101447,"prevInTime":101445,"nextInTime":101447,"topicId":101445,"numMessagesInTopic":0,"msgSnippet":"***Now wait a minute!    I just finished trying to do NaNoWriMo - trying to write 50,000 words in the month of November, just because.  *** According to my","messageBody":"<div id=\"ygrps-yiv-583129056\">***Now wait a minute!  &lt;g&gt;  I just finished trying to do NaNoWriMo - <br/>\ntrying to write 50,000 words in the month of November, just because.  ***<br/>\n<br/>\nAccording to my mother &quot;because&quot; is a valid reason for doing a thing. &lt;g&gt;<br/>\n<br/>\n***(I only got to 36934, but I tried - having house guests for more than<br/>\na <br/>\nweek and a half didn&#39;t help!)***<br/>\n<br/>\nWow! I&#39;m impressed.  I wondered how many people from the list would try<br/>\nit.  <br/>\n<br/>\n***The motto of NaNoWriMo is &quot;No Plot, No Problem&quot;  It is amazing <br/>\nwhat comes out when you don&#39;t know what to write!***<br/>\n<br/>\nTease!  You&#39;re a tease!  What *did* you write about?  &lt;g&gt;  <br/>\n<br/>\nMaybe somebody should start a list for unschooling writers where folks<br/>\ncould post their curious works. &lt;g&gt;  I guess that&#39;s what we do here.  ; )<br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":162315742,"authorName":"Joni Zander","from":"Joni Zander &lt;fotoceo@...&gt;","profile":"cmjoni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Writing for no reason WAS Reassurance and support","postDate":"1101937010","msgId":101445,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFDMUJEM0M2LTQzRTEtMTFEOS1BNkNELTAwMEE5NUYwQjZDMEBjb3gubmV0Pg==","inReplyToHeader":"PDExMDE5MjcxODIuNDczLjc0ODEubTEyQHlhaG9vZ3JvdXBzLmNvbT4=","referencesHeader":"PDExMDE5MjcxODIuNDczLjc0ODEubTEyQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":101446,"prevInTime":101444,"nextInTime":101446,"topicId":101445,"numMessagesInTopic":0,"msgSnippet":"Deb said, No one writes unless it s important to them!  Does he think people everywhere are sitting down to write for no reason?  What do people write when","messageBody":"<div id=\"ygrps-yiv-460661387\">Deb said, &quot;No one writes unless it&#39;s important to them!  Does he think <br/>\npeople<br/>\neverywhere are sitting down to write for no reason?  What do people <br/>\nwrite<br/>\nwhen they have no reason to write, I wonder?   That&#39;s just silly.&quot;<br/>\n<br/>\n<br/>\nNow wait a minute!  &lt;g&gt;  I just finished trying to do NaNoWriMo - <br/>\ntrying to write 50,000 words in the month of November, just because.  <br/>\n(I only got to 36934, but I tried - having house guests for more than a <br/>\nweek and a half didn&#39;t help!)<br/>\n<br/>\nOkay, maybe it wasn&#39;t for no reason at all - I was trying to get over <br/>\nmy idea that my writing always has to be right - I thought 50,000 words <br/>\nwould cure me of that!  Maybe that will come in the next 13,066 words, <br/>\nor maybe not at all.  &lt;BG&gt;<br/>\n<br/>\nAnd Deb, I do agree with you that it&#39;s silly to expect a kid to write <br/>\nfor no reason.  Just trying to find an &quot;in&quot; in the conversation to say <br/>\nthat NaNoWriMo is OVER!  Yeah!  And congratulations to all the <br/>\nunschoolers, both young and not so young who participated this year.<br/>\n<br/>\nOh, and you asked, &quot;What do people write when they have no reason to <br/>\nwrite?&quot;  Well, that was probably the most interesting part of the whole <br/>\nthing.  The motto of NaNoWriMo is &quot;No Plot, No Problem&quot;  It is amazing <br/>\nwhat comes out when you don&#39;t know what to write!<br/>\n<br/>\nJoni Zander<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:FotoCEO@...\">FotoCEO@...</a></div>","specialLinks":[]}],"prevTopicId":101457,"nextTopicId":101363}}