{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Shannon Nicoletta Manns","from":"&quot;Shannon Nicoletta Manns&quot; &lt;snmanns@...&gt;","replyTo":"LIST","senderId":"4N5O5RPIumAoKd-vCPBYkY8cjtFaD8RBEDUelSr4QNXZTV0X4m2Tzwfk4IO0kpTjPa-v3fV3t5bokVV1Jiv5pNwfM2cUgmMF2tcgRjjsSZ8j92ndBa6H","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Healthy Loving Cultures - How They Learn: How to Get There.","postDate":"968702991","msgId":13096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOGMwMWMwMWMyYyRhMWRjOTMyMCRmYzcyOWE4ZUBmbWFubnM+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13095,"nextInTime":13097,"topicId":13096,"numMessagesInTopic":0,"msgSnippet":"Very interesting story; please keep an open mind; any comments? Nicoletta","messageBody":"<div id=\"ygrps-yiv-953742312\">Very interesting story; please keep an open mind; any comments?<br/>\n<br/>\nNicoletta<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Here is a little article about one of the world&#39;s happiest cultures and<br/>\n&gt; how they let their children learn, the older kids teaching the younger<br/>\n&gt; ones and all living and loving cooperatively. <br/>\n&gt; <br/>\n&gt; The Muria are not mentioned in our history books which are mostly<br/>\n&gt; written by historians brought up in a war-like culture. Hence we are<br/>\n&gt; given the impression that all humans have wars and that is entirely<br/>\n&gt; untrue. Though violent warlike cultures have destroyed many peaceful<br/>\n&gt; cultures (and appear to be destroying the rest of the planet also),<br/>\n&gt; humans are not &quot;normally&quot; violent. We all lived tribally for over a<br/>\n&gt; million years, that&#39;s at least 99% of our time on earth. Though &quot;Communal<br/>\n&gt; living&quot; - the modern tribe -  is often seen as &quot;strange&quot; and &quot;cultish&quot; in<br/>\n&gt; our &quot;culture&quot;, it is actually far more natural than the nation state. <br/>\n&gt; <br/>\n&gt; However, for rulers to have power over us they have to make us as<br/>\n&gt; insecure as possible so that we seek security from the state. Therefore<br/>\n&gt; their schools teach competition instead of cooperation, and individual<br/>\n&gt; separate &quot;mongamous&quot; lifestyles instead of tribal societies which were<br/>\n&gt; the way it was far longer. Tribal societies did have problems and some (a<br/>\n&gt; minority) also had wars. But for the most part they are peaceful and<br/>\n&gt; loving and relatively good for the planet.  <br/>\n&gt; <br/>\n&gt; Dr. James W. Prescott who spent most of his life researching the causes<br/>\n&gt; of human violence can attest to that. Though his work is not yet<br/>\n&gt; well-known in the U.S., he is being listened to more and more. His<br/>\n&gt; website (written in English) comes out of Germany but anyone can access<br/>\n&gt; it  with a click <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.violence.de\">http://www.violence.de</a> and there you will find some of<br/>\n&gt; the best information on raising healthy, peaceful children who will not<br/>\n&gt; find drugs attractive. <br/>\n&gt; <br/>\n&gt; Here is the story of a culture anthropologists consider the happiest<br/>\n&gt; culture on earth:<br/>\n&gt; <br/>\n&gt; KINGDOM OF THE YOUNG<br/>\n&gt; <br/>\n&gt; EDITOR&#39;S NOTE: The following is an article by Gordon Troeller and Claude<br/>\n&gt; Deffarge, translated from the German magazine, Stern (August, 1972). It<br/>\n&gt; is a sociological observation of children of another culture, included<br/>\n&gt; here to demonstrate the validity of mental control of conception. We do<br/>\n&gt; not in any way suggest that sex among children is appropriate in<br/>\n&gt; present-day North American culture.<br/>\n&gt; <br/>\n&gt;         KINGDOM OF THE YOUNG is the title of a book by Verrier Elwin, the<br/>\n&gt; British theologian mentioned in the article, detailing objectively the<br/>\n&gt; life of the Muria people and their ghotul dormitory discussed below.<br/>\n&gt; Elwin devotes an entire chapter to the issue of the apparent infertility<br/>\n&gt; of the girls, only four percent of whom become pregnant before marriage,<br/>\n&gt; despite regular sexual relations.<br/>\n&gt; <br/>\n&gt; He notes that, within the ghotul, no relationships are considered<br/>\n&gt; sinful, and if a pregnancy occurs, it is usually blamed on activity<br/>\n&gt; outside of that dormitory. Elwin mentions the fact that each girl, upon<br/>\n&gt; entering the ghotul, partakes of a ceremony in which the god of the<br/>\n&gt; ghotul is requested to keep her from becoming pregnant before marriage.<br/>\n&gt; Apparently, a mental or spiritual form of birth control is being used<br/>\n&gt; with outstanding success.<br/>\n&gt; <br/>\n&gt; The Story:<br/>\n&gt; <br/>\n&gt;         We are sitting in a small hut in the Indian jungle. Around us is<br/>\n&gt; a group consisting only of children from five to seventeen. It is<br/>\n&gt; evening. While the little ones play in the corner, the older children<br/>\n&gt; assign their roles for the night.<br/>\n&gt; <br/>\n&gt;         &quot;Do you want to share your bed with Mukwab today?&quot; the chief of<br/>\n&gt; the group asks a girl who is perhaps fourteen.<br/>\n&gt; <br/>\n&gt; She shakes her head vigorously.<br/>\n&gt; <br/>\n&gt; &quot;Then I suggest Defedar,&quot; the boy says.<br/>\n&gt; <br/>\n&gt; &quot;I don&#39;t want him either.&quot;<br/>\n&gt; <br/>\n&gt; &quot;Who, then?&quot;<br/>\n&gt; <br/>\n&gt; &quot;Halvaldar,&quot; she shouts, and her eyes glow.<br/>\n&gt; <br/>\n&gt;         Silence falls. Small groups form. They seem to be consulting.<br/>\n&gt; &gt;From the corner where the youngest children are playing a voice suddenly<br/>\n&gt; breaks out: &quot;That is impossible,&quot; shouts a nine-year-old boy, &quot;you&#39;ve<br/>\n&gt; already shared your bed with him three times. Tonight I want to sleep<br/>\n&gt; with you. Please ......<br/>\n&gt; <br/>\n&gt;         The girl smiles and goes to the little boy. &quot;Agreed,&quot; she says<br/>\n&gt; and begins to comb his hair.         But stop!   We must tip-toe into<br/>\n&gt; paradise. Softly, lovingly, quietly. Unburdened by our judgments. Like<br/>\n&gt; man before the Fall. Innocent and uncorrupted. Prepare yourself to assume<br/>\n&gt; for fifteen minutes that your world and morality are not absolutely the<br/>\n&gt; only correct ones<br/>\n&gt; <br/>\n&gt;         Perhaps we needn&#39;t go as far as Verrier Elwin, a famous<br/>\n&gt; theologian and anthropologist. When he came to convert the Muria people<br/>\n&gt; he laid aside his cassock and declared: &quot;There is no god but truth.&quot; He<br/>\n&gt; thought he was closer to this god among the Murias and could serve him<br/>\n&gt; better there than by strict conformity to Christian doctrines and the<br/>\n&gt; spreading of Western civilization.<br/>\n&gt; <br/>\n&gt;         On Elwin&#39;s track we reached the territory of the Murias, a people<br/>\n&gt; numbering 200,000, living south of New Delhi in the territory of Bastar,<br/>\n&gt; in the heart of India, surrounded by tigers, snakes, and Indians who,<br/>\n&gt; convinced of the doctrine of Hinduism, suspect the devil to be at work<br/>\n&gt; among the heathen Murias.<br/>\n&gt; <br/>\n&gt;         We met the first &quot;devil&quot; on a narrow forest path. A boy of<br/>\n&gt; perhaps ten. Alone. Happy. Singing. Since we have been traveling in<br/>\n&gt; India, this is the first time we have heard a song. Except in the houses<br/>\n&gt; reserved for music-making prostitutes, singing is never heard. In the<br/>\n&gt; villages people don&#39;t even smile. And here suddenly is a little person<br/>\n&gt; who sings contentedly at the top of his lungs - and who is startled with<br/>\n&gt; fright when he sees us, although the bush is thick and the territory<br/>\n&gt; dangerous.<br/>\n&gt; <br/>\n&gt;         In his hair are four red flowers. Around his neck he wears a<br/>\n&gt; necklace of carved wood. Boldly he approaches Claude Deffarge and offers<br/>\n&gt; her a flower.<br/>\n&gt; <br/>\n&gt; &quot;Are you a motiari (unmarried girl)?&quot; he asks.<br/>\n&gt; <br/>\n&gt; Claude nods.<br/>\n&gt; <br/>\n&gt; &quot;Then take this flower. It is a token of love.&quot;<br/>\n&gt; <br/>\n&gt;         Now we feel captured by this gallant child of the jungle. Out of<br/>\n&gt; sheer embarrassment I ask the little cavalier who gave him the flowers.<br/>\n&gt; <br/>\n&gt; &quot;My motiari,&quot; he says, and a tender light gleams in his eyes.<br/>\n&gt; <br/>\n&gt; &quot;And how old is she?&quot;<br/>\n&gt; <br/>\n&gt;         The boy raises his hand to the level of his chest and opens them<br/>\n&gt; as though cautiously clasping two small rounded objects. &quot;No older than<br/>\n&gt; that,&quot; he explains. &quot;Her breasts are still as small as lemons. But she is<br/>\n&gt; the most beautiful in the whole village!&quot;<br/>\n&gt; <br/>\n&gt;         When we meet the first girls we practice guessing their ages.<br/>\n&gt; This is not at all difficult. Over their backs and breasts they wear a<br/>\n&gt; folded cloth that reveals their &quot;birth certificates&quot; with every lively<br/>\n&gt; movement.<br/>\n&gt; <br/>\n&gt;         The little one who tells us that the oldest man of the village of<br/>\n&gt; Chilputi cannot receive us is - according to the &quot;scale&quot; of our young<br/>\n&gt; friend - already of grapefruit age. She offers us salfi, a palm wine,<br/>\n&gt; which tastes better than champagne. But that cannot comfort us. Without<br/>\n&gt; the permission of the mayor we cannot do anything here.<br/>\n&gt; <br/>\n&gt;         An older boy explains: &quot;The village elder is only a little drunk.<br/>\n&gt; He thinks he will offend you if he doesn&#39;t appear before you sober. Have<br/>\n&gt; patience.&quot;<br/>\n&gt; <br/>\n&gt;         A wise man! That comforts us. But we want more than the<br/>\n&gt; permission to stay here. We want to study the life of, the Murias. They<br/>\n&gt; belong to the 30 million natives whose forefathers already inhabited<br/>\n&gt; India before the Aryan conquerors overran the subcontinent.         <br/>\n&gt; <br/>\n&gt; The Murias live, as they always have, by agriculture, hunting, and<br/>\n&gt; fishing and they have hardly been touched by Hinduism. They have also<br/>\n&gt; preserved an institution to which they owe the privilege of being called<br/>\n&gt; the happiest people on earth: the ghotul - the children&#39;s house.<br/>\n&gt; <br/>\n&gt;         Every village has such a children&#39;s house. Usually it is set<br/>\n&gt; apart, at the edge of the jungle. The parents keep only the infants with<br/>\n&gt; them, and all other children of the village community live together in<br/>\n&gt; this house, which they have built themselves. Alone. Without adult<br/>\n&gt; supervision. It is an independent republic of minors, in which they live<br/>\n&gt; according to their own laws.<br/>\n&gt; <br/>\n&gt;         We are concerned above all with this ghotul. To gain entrance is<br/>\n&gt; very difficult. Up to now few have succeeded.<br/>\n&gt; <br/>\n&gt;         We are lucky. The polite young man who asked us to pardon the<br/>\n&gt; inebriated village elder, is the chief of the local ghotul. He has even<br/>\n&gt; been to school. We can therefore easily convince him that we are not -<br/>\n&gt; like Indian travelers and loiterers - lasciviously on the lookout for<br/>\n&gt; vice. What interests us is that even European sociologists call the<br/>\n&gt; children&#39;s house of the Murias the &quot;world&#39;s healthiest education.&quot;<br/>\n&gt; <br/>\n&gt;         We exchange a few gifts. In the evening we are already permitted<br/>\n&gt; to observe the daily dances of the children. Two days later we are<br/>\n&gt; officially named relatives. From now on I am the brother of the chief.<br/>\n&gt; Yes, in spite of my age I receive a noble title. Claude Deffarge, also.<br/>\n&gt; She becomes &quot;Balosa,&quot; I &quot;Divan.&quot; These titles designate important<br/>\n&gt; functions in the republic of children.<br/>\n&gt; <br/>\n&gt;         But our noble titles do not protect us from the strict command to<br/>\n&gt; stay in the ghotul only until midnight. What happens after that is<br/>\n&gt; exclusively a matter for the children and must remain hidden from adult<br/>\n&gt; eyes.<br/>\n&gt; <br/>\n&gt;         So there we sit in the circle of these young people who are<br/>\n&gt; assigning their roles for the night. It is eleven o&#39;clock.<br/>\n&gt; <br/>\n&gt;         The fourteen-year-old girl who earlier declined vigorously to<br/>\n&gt; share her bed with the partners suggested for her is finished with the<br/>\n&gt; combing. Now she takes off the shirt of the little boy who pleaded so<br/>\n&gt; loudly for her nocturnal companionship, and massages his back and arms.<br/>\n&gt; She is a head taller than he. A woman, in comparison to this child.<br/>\n&gt; <br/>\n&gt;         It is difficult to remain calm and not to judge according to our<br/>\n&gt; standards. Our Indian interpreter doesn&#39;t succeed. He is breathing<br/>\n&gt; heavily. &quot;They are reincarnated devils,&quot; he whispers. &quot;Shameless<br/>\n&gt; creatures. Why doesn&#39;t our government forbid such a thing?&quot;<br/>\n&gt; <br/>\n&gt;         I can imagine what is going on in his head. But only there. For<br/>\n&gt; there is no hint here of sex or perverse games. The massage in no tender<br/>\n&gt; stroking. I have tried it out. One&#39;s skin ends up in tatters, but one&#39;s<br/>\n&gt; muscles are relaxed after the day&#39;s work.<br/>\n&gt; <br/>\n&gt;         The children are doing everything with great seriousness. I would<br/>\n&gt; almost compare them with European Scouts who are discussing the next<br/>\n&gt; day&#39;s tasks around the camp fire. While five girls are combing their<br/>\n&gt; partners&#39; hair, a group of older boys is discussing the harvest. The jobs<br/>\n&gt; are assigned and the little children must report what they have done<br/>\n&gt; during the day.<br/>\n&gt; <br/>\n&gt; The chief, called &quot;Sirdar,&quot; and the mistress, the Belosa, oversee the<br/>\n&gt; order in the ghotul. Punishments are handed out when necessary and no one<br/>\n&gt; objects. Authority is embodied in the whole group and accepted by<br/>\n&gt; everyone. Rights and duties are continually reborn out of the inner needs<br/>\n&gt; of the children -and exclusively administered and strictly observed by<br/>\n&gt; them: for these rights and duties correspond to their world.<br/>\n&gt; <br/>\n&gt;         The parents have nothing to say in the ghotul. They may at no<br/>\n&gt; time interfere. Their authority is limited to the administration of the<br/>\n&gt; community, The council of elders regulates the relationships with<br/>\n&gt; neighboring tribes and the Indian government offices. It also oversees<br/>\n&gt; the schools, which many voluntarily attend nowadays.<br/>\n&gt; <br/>\n&gt;         Naturally the parents provide their children&#39;s meals - in return<br/>\n&gt; for which the children do a large part of the farming work. During the<br/>\n&gt; day the young people are in school or in the fields. But punctually at<br/>\n&gt; six the time at the ghotul begins.<br/>\n&gt; <br/>\n&gt;         The children&#39;s house does not by any means serve only for sexual<br/>\n&gt; education. It is the center of village activity. Its members organize the<br/>\n&gt; harvest. the hunt, and marriage and burial ceremonies. Without the ghotul<br/>\n&gt; the Muria community could not function.<br/>\n&gt; <br/>\n&gt;         At the moment the Belosa is asking who will take over the tiger<br/>\n&gt; watch tonight. Four boys volunteer. Two are appointed. A big boy and a<br/>\n&gt; little one.<br/>\n&gt; <br/>\n&gt;         Commands are never given. Everything is decided in common. Sirdar<br/>\n&gt; and Belosa are not tyrants. Nor do they get their posts because their<br/>\n&gt; parents, say, are rich and therefore have more influence, perhaps, than<br/>\n&gt; others. There is nothing like that here. The best one automatically rises<br/>\n&gt; to the highest rank and there is unanimity about it.<br/>\n&gt; <br/>\n&gt;         My brother, the Sirdar of this ghotul, is the son of a simple<br/>\n&gt; smith. Now he is smiling at me, because an eight-year-old girl has taken<br/>\n&gt; possession of him and is almost tearing his hair out. The little girl<br/>\n&gt; wants to show that she too can already comb the way she should.<br/>\n&gt; <br/>\n&gt; &quot;Have you chosen her for yourself?&quot; I ask.<br/>\n&gt; <br/>\n&gt;         &quot;No, the little girl wants to share my bed tonight, and I cannot<br/>\n&gt; say no,&quot; he answers, his face distorted by pain. Tufts of hair are stuck<br/>\n&gt; in the girl&#39;s comb.<br/>\n&gt; <br/>\n&gt;         Tonight, also, a fourteen-year-old girl will share her mat with a<br/>\n&gt; nine-year-old boy, and the sixteen-year-old Sirdar must sleep with the<br/>\n&gt; wildly combing child.<br/>\n&gt; <br/>\n&gt;         What will happen? Probably nothing at all. Or very little. Here<br/>\n&gt; there is no repressed sexual curiosity suddenly aware of a<br/>\n&gt; once-in-a-lifetime opportunity. For the occasion is not unique. It<br/>\n&gt; belongs to life like eating and drinking. The fourteenyear-old will take<br/>\n&gt; her little comrade into her arms and then peacefully go to sleep with<br/>\n&gt; him. Other couples may exchange a few caresses before sleepiness<br/>\n&gt; overcomes them -and older children perhaps steal softly out of the house<br/>\n&gt; in order to make love outside.<br/>\n&gt; <br/>\n&gt;         Meanwhile a few boys have spread out their mats. Next to them<br/>\n&gt; stand the girls. They have combed and massaged them. Now they wait until<br/>\n&gt; we have left the ghotul so that they can lie down to rest in the arms of<br/>\n&gt; the boys.<br/>\n&gt; <br/>\n&gt;         Belosa bends over Claude Deffarge. &quot;Only ten minutes more,&quot; she<br/>\n&gt; says, &quot;then unfortunately, you must leave us.&quot;         They are not<br/>\n&gt; sending us away because we might be witnesses to some love games. Whoever<br/>\n&gt; caresses or loves here must do it unobserved. Discretion and<br/>\n&gt; considerateness are very strict rules. And in general nothing forbidden<br/>\n&gt; ever happens. Here everyone holds very exactly to the prescribed laws of<br/>\n&gt; the children&#39;s republic.<br/>\n&gt; <br/>\n&gt;         This concept is hardly understandable for a European. In the<br/>\n&gt; ghotul, caresses and sexuality are just as harmoniously included in life<br/>\n&gt; as work and dancing in the day&#39;s events. The Murias are convinced that<br/>\n&gt; sexuality is the chief problem of man and that a society can only<br/>\n&gt; maintain its equilibrium if this primordial power is given a place that<br/>\n&gt; corresponds to its importance. Instead of damming it up - as we, the<br/>\n&gt; Indians, and many others do - with prohibitions, the Murias have made an<br/>\n&gt; attempt to tame sexuality in the ghotul and even to sublimate it: and in<br/>\n&gt; fact sexual harmony and inner peace reign in their paradise.<br/>\n&gt; <br/>\n&gt;         The proofs are not lacking: other peoples of India and even the<br/>\n&gt; modern Indians must attest to a real inflation of crimes, suicides, and<br/>\n&gt; sexual offences. But among the Murias there is no criminality, no<br/>\n&gt; prostitution, no homosexuality - not even petty thefts. Here, according<br/>\n&gt; to Indian statistics<br/>\n&gt; which are certainly not exactly friendly to the Murias - live the most<br/>\n&gt; harmonious people in the world. And if we had not visited them ourselves<br/>\n&gt; in many villages, I would not have believed it either.<br/>\n&gt; <br/>\n&gt;         In the ghotul, besides, there is no learning, instruction, or<br/>\n&gt; drilling. The basic attitude toward sexuality is simply the complete<br/>\n&gt; opposite of ours. We learn for instance from the thirteen-year-old girl<br/>\n&gt; on my right, who will share her bed today with a fifteen-year-old boy,<br/>\n&gt; that she is still a virgin. Not because her parents want it or a<br/>\n&gt; particular moral code dictates it. She has quite simply not yet found<br/>\n&gt; anyone with whom she will take the last step together - although she has<br/>\n&gt; been sleeping for five years with a different boy every night.<br/>\n&gt; <br/>\n&gt;         When we must leave the ghotul, the hour of sleep or caresses - or<br/>\n&gt; love - begins. It may even happen that the fourteenyear-old girl tonight<br/>\n&gt; will initiate her nine-year-old comrade into love. Perhaps, too, a<br/>\n&gt; sixteen-year-old boy will cautiously show a twelve-year-old girl what it<br/>\n&gt; means to be man and wife.<br/>\n&gt; <br/>\n&gt;         It is a part of the essential wisdom of the ghotul that it is<br/>\n&gt; bettor to be led by an older child than to be seduced or taken by<br/>\n&gt; surprise by an inexperienced one - without conscience pangs, without<br/>\n&gt; difficulty, but also without any obligation. And if a boy does try to<br/>\n&gt; force a girl or even to be tender with her against her will. then he is<br/>\n&gt; strictly punished.<br/>\n&gt; <br/>\n&gt;         At the beginning of the evening we were shown how that happens: a<br/>\n&gt; boy was hung by his thumbs with a rope. He stood it for a few seconds. In<br/>\n&gt; a serious case the punishment lasts three minutes. And in case the person<br/>\n&gt; who is punished this way tries again to overpower a girl&#39;s will, he is<br/>\n&gt; excluded from the society of the children for a considerable time. Here<br/>\n&gt; that is almost as serious as death.<br/>\n&gt; <br/>\n&gt;         Sirdar gives us the sign. It is just midnight. Each of the<br/>\n&gt; children touches our left shoulders briefly and wishes us, good night.<br/>\n&gt; <br/>\n&gt; At the door I ask the Sirdar how old a child must be to enter the ghotul.<br/>\n&gt; &quot;When he no longer goes in his pants at night and is big enough to gather<br/>\n&gt; wood for our fire.&quot;<br/>\n&gt; <br/>\n&gt; &quot;Is that the only standard?&quot;<br/>\n&gt; <br/>\n&gt;         &quot;Certainly not,&quot; he says, seriously now. &quot;The children come into<br/>\n&gt; the ghotul as soon as they understand what happens at night between their<br/>\n&gt; fathers and mothers. That is bad for a child. You understand? When a<br/>\n&gt; child suddenly sees that his father is taking his mother away from him,<br/>\n&gt; it is high time to send him to the ghotul.<br/>\n&gt; <br/>\n&gt;         The Murias know what a mental burden it can be for a child when<br/>\n&gt; he is half asleep to witness his parents&#39; love. They also seem to suspect<br/>\n&gt; that the awakening sexuality of a child usually is transferred to his<br/>\n&gt; mother or father and can lead to pathological complexes. They escape this<br/>\n&gt; danger by sending the child from his parents&#39; house into the ghotul,<br/>\n&gt; where his sexuality can be directed at the proper time to others of his<br/>\n&gt; own age. The unconscious and often deranging sexual rivalry with the<br/>\n&gt; father, which psychoanalysis has made famous under the name of the<br/>\n&gt; Oedipus complex, is thus avoided.<br/>\n&gt; <br/>\n&gt;         Also. the collision between the child&#39;s need for activity and<br/>\n&gt; parental authority does not exist here. Father and mother are soon<br/>\n&gt; replaced by another &quot;orderer&quot;: the community of all the children. Their<br/>\n&gt; rules and laws are never questioned - because they bind everyone. They<br/>\n&gt; are not, as at home, the sum of privileges - often arbitrarily<br/>\n&gt; administered -by two adults with all their weaknesses, moods, and<br/>\n&gt; pedagogical bumbling, but the self-chosen duties of a republic of<br/>\n&gt; children.<br/>\n&gt; <br/>\n&gt;         In short: Among the Murias there is no unavoidable conflict<br/>\n&gt; between parent and child - either in the unconscious sexual or in the<br/>\n&gt; conscious authoritarian realm. Consequently, love for parents is much<br/>\n&gt; greater than elsewhere, and lasts the whole life long.<br/>\n&gt; <br/>\n&gt;         That sounds almost too beautiful to be true. But in a singular<br/>\n&gt; way, this observation agrees essentially with the discoveries of European<br/>\n&gt; psychiatry: The ghotul of the Murias is, so to speak, the psychoanalytic<br/>\n&gt; ideal of education. Naturally, it contradicts our traditional family<br/>\n&gt; order and sexual morality. But many sociologists and even the Swedish<br/>\n&gt; parliament are seriously considering today whether the experiences of the<br/>\n&gt; Murias might not show us too a way out of our threatening sexual anarchy.<br/>\n&gt; <br/>\n&gt;         Be that as it may, we at any rate have never seen so many<br/>\n&gt; lighthearted people as in this &quot;paradise.&quot; And we have rarely met people<br/>\n&gt; who are as sexually fulfilled as the Muzias.<br/>\n&gt; <br/>\n&gt;         But what happens when one of these girls falls in love? When she<br/>\n&gt; prefers one special boy and wants to have him for herself? The laws of<br/>\n&gt; the ghotul forbid that. A girl may be with the same boy three times. Then<br/>\n&gt; she must change, or she will be punished. Later she may make love with<br/>\n&gt; him again three times. but she must always give some other boy the<br/>\n&gt; opportunity in between.<br/>\n&gt; <br/>\n&gt;         &quot;In this way love is preserved,&quot; an old Muria says to us. &quot;If the<br/>\n&gt; children attach themselves to one partner early, their love is lost.&quot;<br/>\n&gt; <br/>\n&gt;         We try to convince him he is wrong and tell him of Europe and<br/>\n&gt; America, where it is believed that young love can last beyond the grave.<br/>\n&gt; <br/>\n&gt; He only shakes his head. &quot;Where there is too much love before marriage,<br/>\n&gt; there is less and less afterward.&quot;<br/>\n&gt; <br/>\n&gt;         &quot;In this way, too, it is easier for a person to remain faithful<br/>\n&gt; later,&quot; adds another Muria. &quot;Someone who has already learned everything<br/>\n&gt; as a child is no longer curious later on.&quot;<br/>\n&gt; <br/>\n&gt; But what happens when a girl is in love and later is married to another?<br/>\n&gt; <br/>\n&gt;         &quot;That happens,&quot; the old man explains. &quot;If the love is really<br/>\n&gt; great, then the couple separate from their spouses, whom they love less,<br/>\n&gt; and marry each other. We have three such cases in the village. Everyone<br/>\n&gt; finds that normal. And no one would protest. Least of all the unloved<br/>\n&gt; spouse.&quot;<br/>\n&gt; <br/>\n&gt;         We ask many young men for their opinion. They all answer<br/>\n&gt; unanimously: &quot;In the ghotul there must not be any firm pairs, or jealousy<br/>\n&gt; and competition would creep in. Society could no longer function justly.<br/>\n&gt; And what would happen in such a case to the ugly ones? Should they be<br/>\n&gt; thrown out or made to stand aside?&quot;<br/>\n&gt; <br/>\n&gt;         &quot;Doesn&#39;t a lover become unhappy when he knows that the girl he<br/>\n&gt; prefers is in the arms of another?&quot; we want to know.<br/>\n&gt; <br/>\n&gt;         &quot;That happens only rarely. We get used to sharing everything very<br/>\n&gt; early. If a boy frowns because of jealousy he is punished.&quot;<br/>\n&gt; <br/>\n&gt; We ask some girls if they would rather not have a steady friend. &quot;Then we<br/>\n&gt; would all be pregnant,&quot; one of them answers. &quot;Oh, no - never!  In the<br/>\n&gt; ghotul everything is all right as it is.&quot;<br/>\n&gt; <br/>\n&gt;         The Murias are convinced that a girl can only become pregnant<br/>\n&gt; when she binds herself to a man in her mind and remains physically true<br/>\n&gt; to him. That may be a ridiculous superstition. But somehow this<br/>\n&gt; conviction must have anchored itself so deeply in the consciousness of<br/>\n&gt; the Murias that it is effective. For there are hardly any pregnancies<br/>\n&gt; among them: only 4 percent - with complete sexual freedom. That is<br/>\n&gt; incredibly few. But as soon as one of these girls marries, the first<br/>\n&gt; child appears in the first year of the marriage.<br/>\n&gt; <br/>\n&gt;         Physicians and psychologists have concerned themselves with this<br/>\n&gt; phenomenon without finding a satisfying answer. Perhaps there are in the<br/>\n&gt; ghotul rules and prescribed times of love which explain this limitation<br/>\n&gt; on conception. We do not know.<br/>\n&gt; <br/>\n&gt;         In spite of everything we and others before us have been able to<br/>\n&gt; find out the republic of children still contains a thousand secrets. They<br/>\n&gt; are guarded all the more carefully as more and more Indians traveling<br/>\n&gt; through look upon the ghotul as a brothel and try to gain entrance as<br/>\n&gt; &quot;customers.&quot; Thank God they have not yet succeeded!<br/>\n&gt; <br/>\n&gt;         This is the image &quot;civilization&quot; presents: foreign people who<br/>\n&gt; laugh at the Murias as primitives and scorn their customs, but who, at<br/>\n&gt; the first opportunity, try to exploit them shamelessly - supported by<br/>\n&gt; liquor, gifts, or threats. They are the snakes of paradise.<br/>\n&gt; <br/>\n&gt;         The Murias are not primitives. In their little world they have<br/>\n&gt; consciously created the most harmonious society we have ever seen.<br/>\n&gt; <br/>\n&gt; **************************<br/>\n&gt; <br/>\n&gt;         Further study of the writings of Verrier Elwin reveals that there<br/>\n&gt; are two types of ghotuls. In the older type, couples do pair off on a<br/>\n&gt; semi-permanent basis. In more recently established ghotuls there is a<br/>\n&gt; three - or four-day limit.         The English theologian Verrier Elwin,<br/>\n&gt; who has spent part of his life among the Murias, wrote: &quot;While I shared<br/>\n&gt; the free, happy life of the Murias, I often asked myself if I was<br/>\n&gt; centuries behind the times or centuries ahead. I am not proposing that we<br/>\n&gt; transform our middle schools into ghotuls. But I should like to point out<br/>\n&gt; that there are elements of the life and the teaching of the ghotul that<br/>\n&gt; we should study attentively, and that there are few of us who could be<br/>\n&gt; harmed by being infected by the spirit of the Murias.&quot;<br/>\n&gt; <br/>\n&gt; **********************************<br/>\n&gt; <br/>\n&gt; So, where do we go from here ?  Is there any way that we can listen to<br/>\n&gt; Mahandis Gandhi when a reporter asked him:<br/>\n&gt; <br/>\n&gt; &quot;Mr. Gandhi, What do you think of Western Civilization ?&quot;<br/>\n&gt; <br/>\n&gt; Long pause. <br/>\n&gt; <br/>\n&gt; Gandhi: &quot;I think it would be a good idea&quot;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;                 Peace and Love, Art Rosenblum  &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:artr@...\">artr@...</a>&gt;<br/>\n&gt; Aquarian Research 5620 Morton St., Philadelphia, PA  19144<br/>\n&gt; Working together for positive future, tax exempt since 1970. <br/>\n&gt; Website: www.ic.org/aq  (Phone: 215-848-2292 EST)  Click<br/>\n&gt; mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fr2-subscribe@egroups.com\">fr2-subscribe@egroups.com</a> to join our listserv.  Use <br/>\n&gt; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fr2-unsubscribe@egroups.com\">fr2-unsubscribe@egroups.com</a>&gt; to quit.<br/>\n&gt; <br/>\n&gt; Community email addresses:<br/>\n&gt;   Post message: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LearningCommunities@onelist.com\">LearningCommunities@onelist.com</a><br/>\n&gt;   Subscribe:    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LearningCommunities-subscribe@onelist.com\">LearningCommunities-subscribe@onelist.com</a><br/>\n&gt;   Unsubscribe:  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LearningCommunities-unsubscribe@onelist.com\">LearningCommunities-unsubscribe@onelist.com</a><br/>\n&gt;   List owner:   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LearningCommunities-owner@onelist.com\">LearningCommunities-owner@onelist.com</a><br/>\n&gt; <br/>\n&gt; Shortcut URL to this page:<br/>\n&gt;   <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com/community/LearningCommunities\">http://www.onelist.com/community/LearningCommunities</a><br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":13095,"nextTopicId":13098}}