{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":27,"messages":[{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1229210438","msgId":41002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2NkYxREJELUREODMtNDA1Ni1BNDBELTQwQkE2QjUzN0IwNkBtYWMuY29tPg==","inReplyToHeader":"PDQ5NDQxQjc0LjUwNTAzMDZAY29tY2FzdC5uZXQ+","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPiA8MUUxRjQ5QTUtRDkxRS00QkU2LTk4NDItNzIyQUMzNDZGRkZEQHNhbmRyYWRvZGQuY29tPiA8NjU3N0NCQzVFMzkyNEFFMTkwQUZFRERGQ0IwNzdEOEZATFlMQUxBUDI+IDw4RDlGRkI2Ri01QTFFLTQwOTItQTkwQi05QTQxRDE2MTdFODZAbWFjLmNvbT4gPDQ5NDQxQjc0LjUwNTAzMDZAY29tY2FzdC5uZXQ+"},"prevInTopic":41001,"nextInTopic":0,"prevInTime":41001,"nextInTime":41003,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"... Even looking at how we miscommunicate or are misunderstood can be really helpful to us. LIke I said, I didn t say anything the first time, but there was a ","messageBody":"<div id=\"ygrps-yiv-1418463335\">On Dec 13, 2008, at 12:30 PM, Miriam Mason wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Perhaps there was more read into her post than she ever intended?<br/>\n&gt; Perhaps it was a miscommunication?  Perhaps she didn&#39;t word it  <br/>\n&gt; properly?<br/>\n&gt;  Or there was a misunderstanding of what she was seeking?<br/>\n<br/>\n<br/>\n </span></blockquote>Even looking at how we miscommunicate or are misunderstood can be  <br/>\nreally helpful to us.<br/>\n<br/>\nLIke I said, I didn&#39;t say anything the first time, but there was a  <br/>\nsecond post that gave the same impression. So - what I said was, as  <br/>\nquoted, &quot;You sound like people I know who aren&#39;t really looking for  <br/>\nsolutions,...&quot;  The reason I worded it that way was because that had  <br/>\nNOT been the impression I had from other posts, but in those TWO  <br/>\nposts, that&#39;s how it sounded. So I said she might want to examine that  <br/>\nin herself. None of us is perfect - we have our &quot;issues&quot; - our hot  <br/>\nspots - our blind spots. I suggested she consider it and I still  <br/>\nthink, upon rereading those posts, that might be something to consider.<br/>\n<br/>\nI don&#39;t see the need for a response to that which defends Lyla in any  <br/>\nway - this comment was in no way at all a comment on what kind of  <br/>\nperson she is, it was pointing out what she was sounding like in those  <br/>\ntwo posts as being something worth looking at.<br/>\n<br/>\nAre we not all here to try to be better? Sometimes people will post  <br/>\nthings that we don&#39;t feel great about hearing, sometimes they&#39;ll touch  <br/>\non something we didn&#39;t expect to be so tender about, sometimes people  <br/>\nwill be way off-base and we&#39;ll shake our heads and wonder how they  <br/>\npossibly got THAT out of what we said. It&#39;s all in the interest of  <br/>\nhelping each other out.<br/>\n<br/>\n&lt;&lt;Perhaps there was more read into her post than she ever intended?<br/>\nPerhaps it was a miscommunication?  Perhaps she didn&#39;t word it properly?<br/>\n  Or there was a misunderstanding of what she was seeking?&gt;&gt;<br/>\n<br/>\nWhen I first read her post, my thoughts were &quot;wow, what a great post for<br/>\nthis list&quot;.<br/>\n<br/>\nIt was. And it got a lot of good responses and I&#39;m sure a lot of  <br/>\npeople got good ideas from it. But none of the ideas seemed to be  <br/>\nuseful to Lyla, really.<br/>\n<br/>\n  Was it not a bit of valuable piece of information she was seeking  <br/>\nfrom those further on in the journey than herself?<br/>\n<br/>\nDid you mistake my comments as complaints about her post? Not at all.  <br/>\nGreat post - it got feedback that was probably very useful to others,  <br/>\nbut it didn&#39;t seem that Lyla was getting what she was hoping for.<br/>\n<br/>\n&lt;&lt; I was very surprised at the above response, particularly as I know  <br/>\nher.  &gt;&gt;<br/>\n<br/>\nI wonder if those two posts reflected some deeper-than-usual  <br/>\nfrustration with this one issue - that would possibly explain  <br/>\nuncharacteristic negativity.<br/>\n<br/>\n&lt;&lt;Perhaps tough love is a good thing, in some regards.&gt;&gt;<br/>\n<br/>\n&quot;Tough love&quot; is a specific kind of parenting that I would NEVER ever  <br/>\nwant to be associated with. But sometimes hearing the perspective of  <br/>\nsomeone who doesn&#39;t know you at all, is responding entirely to what  <br/>\nyou say in a post, is surprising and at least worth thinking about.  <br/>\nLike Sandra mentioned, sometimes we say more in a post than we intend  <br/>\nto say. Sometimes strangers will see underlying stuff that those who  <br/>\nknow us overlook.<br/>\n<br/>\n&lt;&lt;Just wanted to put that out there.  Don&#39;t mean to open up wounds, or<br/>\nanything, or criticize anyone on the list.  Just to publicly affirm<br/>\nsomeone who I respect, admire and cherish.&gt;&gt;<br/>\n<br/>\nIf Lyla had her feelings hurt, then I&#39;m really really sorry. I didn&#39;t  <br/>\nget the feeling that she would - I thought she&#39;d think about how she  <br/>\nwas thinking about the issue and that it might give her a way to shift  <br/>\nher thinking into a new direction.<br/>\n<br/>\n&lt;&lt;And believe me, Lyla started examining that possibility in herself the<br/>\nmoment she read the above response.  :/  Thing is, she&#39;s not like  <br/>\nthat.&gt;&gt;<br/>\n<br/>\nUmmm - she was like that in those posts. So - it wasn&#39;t typical of  <br/>\nher. And I imagine she doesn&#39;t want to be like that. So why did it  <br/>\ncome across that way in those posts?  Not a real question that you  <br/>\nneed to answer here - something for her - and maybe others - to  <br/>\nconsider.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: insight into meeting divergent needs","postDate":"1229209430","msgId":41001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdpMWYwbSsycjJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg4NzI3RDdGOTFDNTQ0QzNCMDE0Qjc0OUFDNDAwRjdDQExZTEFMQVAyPg=="},"prevInTopic":41000,"nextInTopic":41002,"prevInTime":41000,"nextInTime":41002,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"... who show up might vary from month to month, and her original intention *was* to meet other kids interested in writing, but that just did not seem to be the","messageBody":"<div id=\"ygrps-yiv-1943770973\"><blockquote><span title=\"ireply\">&gt; well, she did stay for the whole 2 hours. i agree the that the people<br/>\n </span></blockquote>who show up might vary from month to month, and her original intention<br/>\n*was* to meet other kids interested in writing, but that just did not<br/>\nseem to be the case to her, at least that one evening. she may agree to<br/>\ngive it another try, although i think at this point she tends to enjoy<br/>\nthe company of older teens and adults more than younger or same age<br/>\nteens, which is what this group appeared to be comprised of...<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>This has been true for Chamille too!  Something that I&#39;ve had to let go,<br/>\nis the idea of giving it another go, because, in general, Chamille gets<br/>\na really good feel for the situation and sizing it up and knows almost<br/>\nimmediately wether or not she&#39;ll like something based on the initial<br/>\nsense for it.  If she&#39;s unsure, she&#39;ll continue until she knows.  It&#39;s<br/>\nbeen hugely frustrating at times for me, because I&#39;m accustomed to<br/>\nsticking something through, even if I don&#39;t initially like it.  Chamille<br/>\nis just so not that way and everything I set up for her, I do so knowing<br/>\nthat she may want to back out after the first time.  The absolute<br/>\nexception to that has been the haunted house thing, even though, she<br/>\nreally made no lasting social contacts which we were hoping for.  She<br/>\nwould go again in a heart beat tomorrow with or without time to do her<br/>\nhair first!</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: insight into meeting divergent needs","postDate":"1229208744","msgId":41000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdpMWViOCt2NmlyQGVHcm91cHMuY29tPg=="},"prevInTopic":40999,"nextInTopic":41001,"prevInTime":40999,"nextInTime":41001,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"... tears at the group, the facilitator talked about her arthritis for 30 minutes, the writing exercise was very juvelile for her, and my daughter so nothing","messageBody":"<div id=\"ygrps-yiv-1756912920\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Oh sorry I thought you were talking about the class. She was bored to<br/>\n </span></blockquote>tears at the group, the facilitator talked about her arthritis for 30<br/>\nminutes, the writing exercise was very juvelile for her, and my daughter<br/>\nso nothing there to go back for unfortunately.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>Well, we&#39;ve gone through similar things.  About a year and a half ago,<br/>\nChamille, wanting to find like minded friends, signed up for a library<br/>\nanime/manga club.  She was really excited about going and it was geared<br/>\nto kids specifically her age.  She went to one meeting and it was a<br/>\nhorrible experience for her.  All the other kids had come with at least<br/>\none other friend, it was in a large space and everyone sat seperately,<br/>\nleaving Chamille sitting by herself, and the leader of the group didn&#39;t<br/>\ngather everyone up to do introductions or any other group cohesive<br/>\nthing.<br/>\n<br/>\nI called the library and told them what happened and how dissappointed<br/>\nwe were that a leader at the library would allow for any kid to feel<br/>\nleft out in a group dynamic and start a meetup without at least informal<br/>\nfriendly introductions.  It was set up like a classroom, the leader<br/>\nstanding in front and all the kids sitting there listening.  They<br/>\nassured me that they&#39;d talk with the leader of the group, did so, and<br/>\ngot back to me to let me know that they&#39;d be doing introductions and<br/>\nmore casual friendliness at the next meetup.  However, Chamille refused<br/>\nto go again because the first experience was so yucky for her, after she<br/>\nhad bravely got up the nerve to jump into a potential social situation.<br/>\n<br/>\nThere was no amount of convincing her that it would be different the<br/>\nnext time, that made her want to give it another go.  In general with<br/>\nthese sorts of things, the person leading the group is a volunteer,<br/>\ngenerously giving of their time wether they know what they are doing or<br/>\nnot, so I&#39;ve always figured that feedback was important.  It never<br/>\ngauranteed that my kids would give it another chance, but knowing that I<br/>\nwas trying to help the situation be better, has always helped them feel<br/>\nbetter, especially for Chamille because she cares about people and was<br/>\nhappy that it wouldn&#39;t happen to another kid like her.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1229202181","msgId":40999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyMTJFM0QwLUU3NzMtNDkxRC1BOTc3LTY0ODUzQkZGMkJGOEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ5NDQxQjc0LjUwNTAzMDZAY29tY2FzdC5uZXQ+","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPiA8MUUxRjQ5QTUtRDkxRS00QkU2LTk4NDItNzIyQUMzNDZGRkZEQHNhbmRyYWRvZGQuY29tPiA8NjU3N0NCQzVFMzkyNEFFMTkwQUZFRERGQ0IwNzdEOEZATFlMQUxBUDI+IDw4RDlGRkI2Ri01QTFFLTQwOTItQTkwQi05QTQxRDE2MTdFODZAbWFjLmNvbT4gPDQ5NDQxQjc0LjUwNTAzMDZAY29tY2FzdC5uZXQ+"},"prevInTopic":40998,"nextInTopic":41000,"prevInTime":40998,"nextInTime":41000,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"-=-Perhaps there was more read into her post than she ever intended? Perhaps it was a miscommunication? Perhaps she didn t word it properly? Or there was a","messageBody":"<div id=\"ygrps-yiv-1830848854\">-=-Perhaps there was more read into her post than she ever intended?<br/>\nPerhaps it was a miscommunication? Perhaps she didn&#39;t word it properly?<br/>\nOr there was a misunderstanding of what she was seeking?-=-<br/>\n<br/>\n&quot;Properly&quot; isn&#39;t  a good measure.  There&#39;s more than one way to work  <br/>\nthings.<br/>\n<br/>\nEveryone who reads  anything reads it from inside herself (or himself).<br/>\n<br/>\nSometimes people communicate more than they intended, or more than  <br/>\nthan they knew they knew.  It&#39;s part of the value of journals.<br/>\n<br/>\nFor the purposes of this list, it&#39;s okay for there to be  <br/>\nmisunderstandings about what people were seeking.  As Joyce wrote once:<br/>\n<br/>\n<br/>\nThe list is about ideas, not about people.<br/>\nThink of ideas like balls and the list like a ball court. If someone  <br/>\ntosses an idea worth discussing into the court it&#39;s going to get  <br/>\nbatted about. At that point what&#39;s going on is no longer about the  <br/>\nperson who tossed the idea in. It&#39;s about the idea and how well and  <br/>\ncleanly it&#39;s being tossed about. (Unless the tosser keeps jumping in  <br/>\nand grabbing the idea ball saying &quot;Mine!&quot;)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/faq\">http://sandradodd.com/lists/faq</a><br/>\n(It was written about Always Learning, but it lives on the  <br/>\nUnschooling Discussion list faq)<br/>\n<br/>\nWhen Holly was a baby I had already nursed two, and had gone quite a  <br/>\nway toward becoming a La Leche League leader (though I dropped that  <br/>\nto do cesarean prevention support).  Holly wasn&#39;t nursing right.   <br/>\nSomething was wrong.  I  had read everything LLL had readily  <br/>\navailable, including a few years&#39; worth of the publication for  <br/>\nleaders, and the leaders&#39; handbook.  I asked several of my friends  <br/>\nwho were leaders.  Some of their advice was elementary and basic and  <br/>\nI was frustrated, because of course I had tried all the easy stuff.   <br/>\nI ended up getting help from an outside lactation consultant, and  <br/>\nrenting and electric pump, and feeding Holly with a tube on my finger  <br/>\nfor a bit until the suck was established.<br/>\n<br/>\nWhat turned out to be the deal was that she was sucking her tongue up  <br/>\nagainst the roof of her mouth.  It was her own little comfort thing.   <br/>\nBut it kept her from sucking after the first suck.  She was a preemie  <br/>\nand the hospital hadn&#39;t noted her as such.  Another friend who was a  <br/>\nneonatal nurse pointed that out as though I had known, but I hadn&#39;t.<br/>\n<br/>\nLong story to say that sometimes a situation IS very unusual, and  <br/>\nvolunteers can&#39;t help.  But there will be others who learn just from  <br/>\nbeing around the attempt to help, and from hearing of the problem and  <br/>\ncomparing it to their own experience.<br/>\n<br/>\nWe&#39;re all adding to our body of knowledge about parenting and  <br/>\nunschooling and communications.   It&#39;s okay that not every exchange  <br/>\nor discussion is as perfect as if the greatest scriptwriters designed  <br/>\nit.  Once in a while one DOES seem perfect, and we should appreciate  <br/>\nthose more, and regret the imperfections less.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":137356086,"authorName":"Miriam Mason","from":"Miriam Mason &lt;mimmason@...&gt;","profile":"anonimommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1229200244","msgId":40998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5NDQxQjc0LjUwNTAzMDZAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDhEOUZGQjZGLTVBMUUtNDA5Mi1BOTBCLTlBNDFEMTYxN0U4NkBtYWMuY29tPg==","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPiA8MUUxRjQ5QTUtRDkxRS00QkU2LTk4NDItNzIyQUMzNDZGRkZEQHNhbmRyYWRvZGQuY29tPiA8NjU3N0NCQzVFMzkyNEFFMTkwQUZFRERGQ0IwNzdEOEZATFlMQUxBUDI+IDw4RDlGRkI2Ri01QTFFLTQwOTItQTkwQi05QTQxRDE2MTdFODZAbWFjLmNvbT4="},"prevInTopic":40923,"nextInTopic":40999,"prevInTime":40997,"nextInTime":40999,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"... [NOTE TO MODERATOR: You may not want to let this post through, but I did feel at least you both should see it.] I rarely post because I feel I must still","messageBody":"<div id=\"ygrps-yiv-818824703\">Pamela Sorooshian wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;<br/>\n&gt; You sound like people I know who aren&#39;t really looking for solutions,<br/>\n&gt; but who are really wanting to complain about how impossible their<br/>\n&gt; particular situation is. I&#39;m not entirely sure why they want to do<br/>\n&gt; that - but I&#39;m suggesting that you examine that possibility in yourself.<br/>\n<br/>\n </span></blockquote>[NOTE TO MODERATOR: You may not want to let this post through, but I did <br/>\nfeel at least you both should see it.]<br/>\n<br/>\nI rarely post because I feel I must still learn so much, it&#39;s probably <br/>\nbetter to keep my mouth quiet and my ears and eyes open, but I felt I <br/>\nsimply must.  And ordinarily I would not post about an individual on any <br/>\nlist, because I know it&#39;s not the point of the list.  I&#39;m going to, <br/>\nthough, because it felt very personally as though it was more about Lyla <br/>\nherself than what she asked.<br/>\n<br/>\nIn defense of Lyla, I&#39;ve known her for almost 10 years personally, <br/>\nspoken with her every day, been to gatherings with her, gotten together <br/>\nas often as the divergent characters of our children have allowed us to. <br/>\n  I can say with all assuredness that Lyla is one of the most positive, <br/>\nloving, supportive people I know.  Her children love her, MY children <br/>\nlove her, all the children she knows love her.<br/>\n<br/>\nShe is the antithesis of a complainer.  She is fiercely in love with her <br/>\nchildren (all children, frankly), constantly seeking ideas and <br/>\nperspective to become an even better Mama than the amazing Mama she <br/>\nalready is.  She is also one of my most valued and loved friends.<br/>\n<br/>\nKnowing Lyla, I know she was genuinely seeking advice/input/ideas, and <br/>\nmany of the ideas she was presented with were ones she had already <br/>\ntried.  She is a scientist of human nature and was looking for new ideas <br/>\nthat she might be able to adapt to her situation.  I also know her <br/>\nchildren well -- the question made perfect sense to me.  She has never <br/>\nblamed her children for anything.  On the contrary.  She was one of <br/>\nthose wise women that taught me through modeling really early on not to <br/>\nblame my own children (as my parents had blamed me).<br/>\n<br/>\nPerhaps there was more read into her post than she ever intended? <br/>\nPerhaps it was a miscommunication?  Perhaps she didn&#39;t word it properly? <br/>\n  Or there was a misunderstanding of what she was seeking?<br/>\n<br/>\nWhen I first read her post, my thoughts were &quot;wow, what a great post for <br/>\nthis list&quot;.  Was it not a bit of valuable piece of information she was <br/>\nseeking from those further on in the journey than herself?  I was <br/>\ninterested in hearing the answers.  I was very surprised at the above <br/>\nresponse, particularly as I know her.  Perhaps tough love is a good <br/>\nthing, in some regards.<br/>\n<br/>\nJust wanted to put that out there.  Don&#39;t mean to open up wounds, or <br/>\nanything, or criticize anyone on the list.  Just to publicly affirm <br/>\nsomeone who I respect, admire and cherish.<br/>\n<br/>\nAnd believe me, Lyla started examining that possibility in herself the <br/>\nmoment she read the above response.  :/  Thing is, she&#39;s not like that.<br/>\n<br/>\nVery best,<br/>\nMiriam</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: insight into meeting divergent needs","postDate":"1228957569","msgId":40923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4NzI3RDdGOTFDNTQ0QzNCMDE0Qjc0OUFDNDAwRjdDQExZTEFMQVAyPg==","inReplyToHeader":"PDNhOTNmZmYxMDgxMjEwMTYzOHgyMjdiNTQ0NHIxYTRlY2E1ODk5ZTc0N2NmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDQ5NDA1MWNlLjIwMDE4ZTBhLjVhYWEuZmZmZmYzNWJTTVRQSU5fQURERURAbXguZ29vZ2xlLmNvbT4gPDNhOTNmZmYxMDgxMjEwMTYzOHgyMjdiNTQ0NHIxYTRlY2E1ODk5ZTc0N2NmQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":40922,"nextInTopic":40998,"prevInTime":40922,"nextInTime":40924,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"well, she did stay for the whole 2 hours.  i agree the that the people who show up might vary from month to month, and her original intention *was* to meet","messageBody":"<div id=\"ygrps-yiv-52811385\">well, she did stay for the whole 2 hours.  i agree the that the people who show up might vary from month to month, and her original intention *was* to meet other kids interested in writing, but that just did not seem to be the case to her, at least that one evening.  she may agree to give it another try, although i think at this point she tends to enjoy the company of older teens and adults more than younger or same age teens, which is what this group appeared to be comprised of...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: k <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Wednesday, December 10, 2008 4:38 PM<br/>\n  Subject: [SPAM]Re: [AlwaysLearning] Re: insight into meeting divergent needs<br/>\n<br/>\n<br/>\n  Are you sure there wouldn&#39;t have been anything there to go back for? I<br/>\n  suppose there&#39;s no getting around occasional boredom. <br/>\n  . <br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: insight into meeting divergent needs","postDate":"1228955903","msgId":40922,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMjEwMTYzOHgyMjdiNTQ0NHIxYTRlY2E1ODk5ZTc0N2NmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQ5NDA1MWNlLjIwMDE4ZTBhLjVhYWEuZmZmZmYzNWJTTVRQSU5fQURERURAbXguZ29vZ2xlLmNvbT4=","referencesHeader":"PDQ5NDA1MWNlLjIwMDE4ZTBhLjVhYWEuZmZmZmYzNWJTTVRQSU5fQURERURAbXguZ29vZ2xlLmNvbT4="},"prevInTopic":40921,"nextInTopic":40923,"prevInTime":40921,"nextInTime":40923,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"Are you sure there wouldn t have been anything there to go back for?  I suppose there s no getting around occasional boredom.  In writer s groups and classes","messageBody":"<div id=\"ygrps-yiv-482142947\">Are you sure there wouldn&#39;t have been anything there to go back for?  I<br/>\nsuppose there&#39;s no getting around occasional boredom.  In writer&#39;s groups<br/>\nand classes particularly, I have found plenty of talkers (not always plenty<br/>\nof writers.. ;).  And so you&#39;ll have that where the person leading the group<br/>\nis holding a group/class in order to have an audience.<br/>\n<br/>\nIt could still be a place to meet others who *are* interested in writing.<br/>\nEncourage your daughter to consider the possibilities of others in the<br/>\nclass/group besides the leader/teacher as avenues of interest for her to<br/>\npursue with those who are likeminded, rather than seeing the class/group<br/>\nonly for the specified purpose of the activity it&#39;s supposed to be for.<br/>\nYes, your daughter may have clear expectations yet she might glean many more<br/>\nsocial and critiquing/writing/collaborative opportunities by focusing on any<br/>\npositives she can find rather than tunneling in on what was boring her to<br/>\ntears.  What if others were there she could band together with were she to<br/>\nstay long enough to strike up conversations and find out what they are like?<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Oh sorry I thought you were talking about the class.  She was bored to<br/>\n </span></blockquote>tears at the group, the facilitator talked about her arthritis for 30<br/>\nminutes, the writing exercise was very juvelile for her,  and my daughter so<br/>\nnothing there to go back for unfortunately.&lt;&lt;&lt;&lt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228955193","msgId":40921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMjEwMTYyNnc1YWY2OGI2Y2ljOWNhMzhmOTU2NzM2MjhhQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEE5RkVCRTc0LURDRDQtNEY4My1BOTgwLTJEODdBOTVEMUMwNkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPgkgPDFFMUY0OUE1LUQ5MUUtNEJFNi05ODQyLTcyMkFDMzQ2RkZGREBzYW5kcmFkb2RkLmNvbT4JIDw2NTc3Q0JDNUUzOTI0QUUxOTBBRkVEREZDQjA3N0Q4RkBMWUxBTEFQMj4JIDwzYTkzZmZmMTA4MTIxMDExMDVxMmIzZGRlZDJ2ODhhYThlMzU4MDc4ODJiZkBtYWlsLmdtYWlsLmNvbT4JIDxBOUZFQkU3NC1EQ0Q0LTRGODMtQTk4MC0yRDg3QTk1RDFDMDZAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":40920,"nextInTopic":40922,"prevInTime":40920,"nextInTime":40922,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"That s the one.  :)  An old good film.  Another one I like but not quite as much is Finding Forrester, still in the mentor category but much more focused on","messageBody":"<div id=\"ygrps-yiv-1870125046\">That&#39;s the one.  :)  An old good film.  Another one I like but not quite as<br/>\nmuch is Finding Forrester, still in the mentor category but much more<br/>\nfocused on school and its horrors, and the kid in it is an older teen,<br/>\nalthough I think the music is absolutely divine.  The &quot;Somewhere&quot; medley is<br/>\njust so wonderful... it&#39;s probably my favorite part of the movie.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-This was just a movie and maybe not very real life. It&#39;s not an<br/>\n&gt;<br/>\n&gt; obscure<br/>\n&gt;  movie and maybe someone else remembers the title. I forget the name<br/>\n&gt;  of it.<br/>\n&gt;  The plot is a young boy goes to a park where old guys play chess and<br/>\n&gt;  joins<br/>\n&gt;  them, and it becomes something the kid does a lot. I think he&#39;s<br/>\n&gt;  supposed to<br/>\n&gt;<br/>\n&gt; be about 10 or 11.-=-<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  Searching for Bobby Fischer?<br/>\n&gt;<br/>\n&gt;  If so, that is one GREAT movie for unschoolers.  The boy has two very<br/>\n&gt;  different chess mentors, played by Ben Kingsley and Laurence Fishburne.<br/>\n&gt;<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.imdb.com/title/tt0108065/\">http://www.imdb.com/title/tt0108065/</a><br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228952954","msgId":40920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5RkVCRTc0LURDRDQtNEY4My1BOTgwLTJEODdBOTVEMUMwNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDNhOTNmZmYxMDgxMjEwMTEwNXEyYjNkZGVkMnY4OGFhOGUzNTgwNzg4MmJmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPiA8MUUxRjQ5QTUtRDkxRS00QkU2LTk4NDItNzIyQUMzNDZGRkZEQHNhbmRyYWRvZGQuY29tPiA8NjU3N0NCQzVFMzkyNEFFMTkwQUZFRERGQ0IwNzdEOEZATFlMQUxBUDI+IDwzYTkzZmZmMTA4MTIxMDExMDVxMmIzZGRlZDJ2ODhhYThlMzU4MDc4ODJiZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":40919,"nextInTopic":40921,"prevInTime":40919,"nextInTime":40921,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"-=-This was just a movie and maybe not very real life. It s not an obscure movie and maybe someone else remembers the title. I forget the name of it. The plot","messageBody":"<div id=\"ygrps-yiv-386582810\">-=-This was just a movie and maybe not very real life. It&#39;s not an  <br/>\nobscure<br/>\nmovie and maybe someone else remembers the title. I forget the name  <br/>\nof it.<br/>\nThe plot is a young boy goes to a park where old guys play chess and  <br/>\njoins<br/>\nthem, and it becomes something the kid does a lot. I think he&#39;s  <br/>\nsupposed to<br/>\nbe about 10 or 11.-=-<br/>\n<br/>\n<br/>\n<br/>\nSearching for Bobby Fischer?<br/>\n<br/>\nIf so, that is one GREAT movie for unschoolers.  The boy has two very  <br/>\ndifferent chess mentors, played by Ben Kingsley and Laurence Fishburne.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.imdb.com/title/tt0108065/\">http://www.imdb.com/title/tt0108065/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw@comcast.net","from":"&lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: insight into meeting divergent needs","postDate":"1228951980","msgId":40919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":40918,"nextInTopic":40920,"prevInTime":40918,"nextInTime":40920,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"Oh sorry I thought you were talking about the class.  She was bored to tears at the group, the facilitator talked about her arthritis for 30 minutes, the","messageBody":"<div id=\"ygrps-yiv-609510698\">Oh sorry I thought you were talking about the class.  She was bored to tears at the group, the facilitator talked about her arthritis for 30 minutes, the writing exercise was very juvelile for her,  and my daughter so nothing there to go back for unfortunately.</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw@comcast.net","from":"&lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228951680","msgId":40918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":40917,"nextInTopic":40919,"prevInTime":40917,"nextInTime":40919,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"... On this list, no matter what you thought you were just looking for, you ll probably end up getting feedback on what the tone of  your post looks like to","messageBody":"<div id=\"ygrps-yiv-612025865\">---<br/>\n On this list, no matter what you thought you were &quot;just looking for,&quot;  <br/>\n you&#39;ll probably end up getting feedback on what the tone of  your  <br/>\n post looks like to outsiders, and that can be very  helpful when  <br/>\n someone&#39;s even the least bit stuck.<br/>\n<br/>\n----<br/>\n<br/>\nyes of course.  That makes sense to me and I realize my tone didn&#39;t accurately convey my feelings.  I thought I was being careful to be clear but obviously from the responses I was not.<br/>\n<br/>\n-----<br/>\n It seems you&#39;re blaming your son for your daughter&#39;s unhappiness, and  <br/>\n blaming her personality and needs for his frustration.   <br/>\n<br/>\n-----<br/>\n<br/>\nwow really??  Interesting.... I am definitely noticing that my DAUGHTER is blaming my son, but I really don&#39;t blame him at all..i was trying to find ways to honor his temperament while meeting her needs so maybe it wouldn&#39;t feel so &#39;limited because of him&#39; to my daughter...<br/>\n<br/>\nI don&#39;t think I blame my daughter at all for his experience as she and I are more similar twmperament wise....<br/>\n<br/>\n<br/>\nI am definitely interested in the principles of unschooling and I do recognize that &#39;similar experience&#39; can look lots of different ways and doesn&#39;t have to mean same number of children or same exact experience.<br/>\n<br/>\nThanks for pointing out that my post was more negative than I may have realized, as I definitely strive to see opportunity in as many waus and places as I can.</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: insight into meeting divergent needs","postDate":"1228951496","msgId":40917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMjEwMTUyNGwxMjJiYTlmYWczMmE0YzJlZTRmYzA5OTFmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQ5NDA0ZWJiLjA1YTEyNjBhLjIzYzUuZmZmZmMwYmZTTVRQSU5fQURERURAbXguZ29vZ2xlLmNvbT4=","referencesHeader":"PDQ5NDA0ZWJiLjA1YTEyNjBhLjIzYzUuZmZmZmMwYmZTTVRQSU5fQURERURAbXguZ29vZ2xlLmNvbT4="},"prevInTopic":40916,"nextInTopic":40918,"prevInTime":40916,"nextInTime":40918,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"Here s what I read it to say:  she attended a local young writers group ... both bummed ... the class....? [Non-text portions of this message have been","messageBody":"<div id=\"ygrps-yiv-899903236\">Here&#39;s what I read it to say:  &quot;she attended a local young writers group&quot;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 12/10/08, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lylaw@...\">lylaw@...</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lylaw@...\">lylaw@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;                  -=-yeah - she&#39;d LOVE to take a writing class and we are<br/>\nboth bummed<br/>\n&gt;   and frustrated about that. she attended a local young writers group,<br/>\n&gt;   but all the kids there were there for extra credit not because they<br/>\n&gt;   actually like writing.-=-<br/>\n&gt;<br/>\n&gt;   The &quot;bummed and frustrated&quot; stands out.  Could you have helped put a<br/>\n&gt;   positive spin on the opportunity so she could&#39;ve lasted longer and<br/>\n&gt;<br/>\n&gt;  more happily?---------<br/>\n&gt;<br/>\n&gt;  I&#39;m am unclear what you mean by lasted longer? She was not admitted to<br/>\nthe class....?<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: insight into meeting divergent needs","postDate":"1228951404","msgId":40916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMjEwMTUyM2kyZDgzMGNlY2tlZDlhYmYzZmQyZDQ0ZTc3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgxMjEwMTUxOXM0YzYzZWIxYmg0ZDJkNzZmMjg2MmU4ODJlQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGdocDNkMytpdGJpQGVHcm91cHMuY29tPgkgPEVEMkFEOUFEMTlDQzQzMzg5NTRFMUJGNzUzQ0UxODQ4QExZTEFMQVAyPgkgPDRDMTNERUE2LUJBMEUtNDJERi05MEFFLTcwQjNDQTc1OEM4OEBzYW5kcmFkb2RkLmNvbT4JIDwzYTkzZmZmMTA4MTIxMDE1MTlzNGM2M2ViMWJoNGQyZDc2ZjI4NjJlODgyZUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":40915,"nextInTopic":40917,"prevInTime":40915,"nextInTime":40917,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"I like this suggestion too and you know what else ... SCA (Society for Creative Anachronism) does a lot of similar things like that.  I have been surprised and","messageBody":"<div id=\"ygrps-yiv-1562325151\">I like this suggestion too and you know what else ... SCA (Society for<br/>\nCreative Anachronism) does a lot of similar things like that.  I have been<br/>\nsurprised and pleased with the social possibilities in SCA in my region<br/>\nwhich otherwise hasn&#39;t been that easy to get into through other groups.<br/>\n<br/>\nI have a kid who absolutely loves playacting and dressing up for roles and<br/>\nanything to do with stories, and he&#39;s even interested in making sure it&#39;s in<br/>\nthe right genre.  I&#39;ve never been much into that myself but I love seeing<br/>\nwhat Karl does with those kinds of things.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 12/10/08, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&gt;  I loved Pam&#39;s suggestion about a book club in your home!  Maybe you<br/>\n&gt;  could combine that sometimes with lunches in the period or place of<br/>\n&gt;  the book, and it could include research and recipes and such.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw@comcast.net","from":"&lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: insight into meeting divergent needs","postDate":"1228951140","msgId":40915,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":40914,"nextInTopic":40916,"prevInTime":40914,"nextInTime":40916,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"-=-yeah - she d LOVE to take a writing class and we are both bummed and frustrated about that. she attended a local young writers group, but all the kids there","messageBody":"<div id=\"ygrps-yiv-1739180244\">-=-yeah - she&#39;d LOVE to take a writing class and we are both bummed  <br/>\n and frustrated about that. she attended a local young writers group,  <br/>\n but all the kids there were there for extra credit not because they  <br/>\n actually like writing.-=-<br/>\n <br/>\n The &quot;bummed and frustrated&quot; stands out.  Could you have helped put a  <br/>\n positive spin on the opportunity so she could&#39;ve lasted longer and  <br/>\n more happily?---------<br/>\n<br/>\nI&#39;m am unclear what you mean by lasted longer? She was not admitted to the class....?</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228950924","msgId":40914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhENEIyMkE4LUVGNEEtNDk4Qy1BMTFCLUUxODhENkZEMkYzQUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDg3ODEyNkRBMTk3RTRENDQ5MTA2MDAyMjVFNzVCMUEwQExZTEFMQVAyPg==","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPiA8MUUxRjQ5QTUtRDkxRS00QkU2LTk4NDItNzIyQUMzNDZGRkZEQHNhbmRyYWRvZGQuY29tPiA8NjU3N0NCQzVFMzkyNEFFMTkwQUZFRERGQ0IwNzdEOEZATFlMQUxBUDI+IDw4RDlGRkI2Ri01QTFFLTQwOTItQTkwQi05QTQxRDE2MTdFODZAbWFjLmNvbT4gPDg3ODEyNkRBMTk3RTRENDQ5MTA2MDAyMjVFNzVCMUEwQExZTEFMQVAyPg=="},"prevInTopic":40913,"nextInTopic":40915,"prevInTime":40913,"nextInTime":40915,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"-=-i was just looking for some inspiration into how things look for similar folks with a similar constitution in their family.-=- On this list, no matter what","messageBody":"<div id=\"ygrps-yiv-479985625\">-=-i was just looking for some inspiration into how things look for  <br/>\nsimilar folks with a similar constitution in their family.-=-<br/>\n<br/>\nOn this list, no matter what you thought you were &quot;just looking for,&quot;  <br/>\nyou&#39;ll probably end up getting feedback on what the tone of  your  <br/>\npost looks like to outsiders, and that can be very  helpful when  <br/>\nsomeone&#39;s even the least bit stuck.<br/>\n<br/>\nIt seems you&#39;re blaming your son for your daughter&#39;s unhappiness, and  <br/>\nblaming her personality and needs for his frustration.   There were  <br/>\nmore negative phrases than I bet you realized you used.  Neither of  <br/>\nyour kids seems to be blind or physically disabled or deaf or  <br/>\nseriously ill.  The tone of the post seemed to suggest things were  <br/>\ndire, though, and hopeless.  It did sound like you wanted solutions.<br/>\n<br/>\nJoyce only has one child, but her ideas might be worth ten times that  <br/>\nof someone with children almost exactly like yours, so please don&#39;t  <br/>\ntry to limit your feedback to just similar folks with a similar  <br/>\nconstitution in their similar family.  The principles of unschooling  <br/>\nare larger than any one family&#39;s personal experience.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: insight into meeting divergent needs","postDate":"1228950637","msgId":40913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDMTNERUE2LUJBMEUtNDJERi05MEFFLTcwQjNDQTc1OEM4OEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEVEMkFEOUFEMTlDQzQzMzg5NTRFMUJGNzUzQ0UxODQ4QExZTEFMQVAyPg==","referencesHeader":"PGdocDNkMytpdGJpQGVHcm91cHMuY29tPiA8RUQyQUQ5QUQxOUNDNDMzODk1NEUxQkY3NTNDRTE4NDhATFlMQUxBUDI+"},"prevInTopic":40912,"nextInTopic":40914,"prevInTime":40912,"nextInTime":40914,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"-=-yeah - she d LOVE to take a writing class and we are both bummed and frustrated about that. she attended a local young writers group, but all the kids there","messageBody":"<div id=\"ygrps-yiv-1950215152\">-=-yeah - she&#39;d LOVE to take a writing class and we are both bummed  <br/>\nand frustrated about that. she attended a local young writers group,  <br/>\nbut all the kids there were there for extra credit not because they  <br/>\nactually like writing.-=-<br/>\n<br/>\nThe &quot;bummed and frustrated&quot; stands out.  Could you have helped put a  <br/>\npositive spin on the opportunity so she could&#39;ve lasted longer and  <br/>\nmore happily?<br/>\n<br/>\nWhat about online classes?  It&#39;s not direct social experience but it  <br/>\nwould involve idea-exchange and input.<br/>\n<br/>\nI loved Pam&#39;s suggestion about a book club in your home!  Maybe you  <br/>\ncould combine that sometimes with lunches in the period or place of  <br/>\nthe book, and it could include research and recipes and such.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: insight into meeting divergent needs","postDate":"1228942200","msgId":40912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEMkFEOUFEMTlDQzQzMzg5NTRFMUJGNzUzQ0UxODQ4QExZTEFMQVAyPg==","inReplyToHeader":"PGdocDNkMytpdGJpQGVHcm91cHMuY29tPg==","referencesHeader":"PGdocDNkMytpdGJpQGVHcm91cHMuY29tPg=="},"prevInTopic":40911,"nextInTopic":40913,"prevInTime":40911,"nextInTime":40913,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"... What about something like The Boys and Girls Club? You live pretty urban, so there are probably several things of that nature around you. Does she have","messageBody":"<div id=\"ygrps-yiv-595676167\"><blockquote><span title=\"ireply\">&gt;&gt;<br/>\n </span></blockquote>  What about something like The Boys and Girls Club? You live pretty<br/>\n  urban, so there are probably several things of that nature around you. <br/>\n  Does she have interest in classes of any sort?&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n  yeah - she&#39;d LOVE to take a writing class and we are both bummed and frustrated about that.  she attended a local young writers group, but all the kids there were there for extra credit not because they actually like writing.  so i found a &quot;writer&#39;s haven&quot; place that has a ton of awesome sounding classes - geared toward adults, but she was very excited about the prospect of takign a novel writing class there, as she is deep in the midst of writing her second novel...it says on the site to write for special permission to let a teen into the class - so we did.  she was denied.  the reason given was that teens usually need support and affirmation, while adults are given brutal honesty about their writing.  we have written back asking for reconsideration, saying brutal honesty is what she really wants - have yet to hear back...<br/>\n<br/>\n  i also looked into community college classes, and may need to go that route again, but if you are under 16 it requires an exemption from compsulsory education letter from the district, and that would require registration, i assume...<br/>\n<br/>\n  i need to keep seeking...<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;Chamille went through what you&#39;ve described, and still occasionally&gt;&gt;<br/>\n </span></blockquote>  does. Taking off, when my husband came home helped a lot. We could<br/>\n  leave little sister at home and go do stuff for a few hours. Sometimes<br/>\n  we just walked around downtown PDX and looked a window displays,<br/>\n  sometimes we&#39;d go out for coffee or a movie or the mall.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n  &gt;&gt;Doing FrightTown was a huge big deal thing that helped A LOT! It was 2<br/>\n </span></blockquote>  long days a week doing something hugely focused that lasted about 2<br/>\n  months. We did it just long enough to be ready to stop doing it by the<br/>\n  last day. Now a month out, we miss it. I try to take Chamille to the<br/>\n  grocery store with me while leaving Margaux behind with dad. It&#39;s not<br/>\n  totally exciting, yet it&#39;s time away from home getting stuff done, and<br/>\n  time to talk and listen to music together and check stuff out.<br/>\n<br/>\n  yes!  we do this kidn of thing often and it does help a  lot!<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n </span></blockquote>  I try to be available for any and all chances of outings with friends,<br/>\n  and Chamille knows that, yet she&#39;s been reluctant to set stuff up<br/>\n  herself, until VERY recently.&gt;&gt;<br/>\n<br/>\n  yes, i am always available for transportation, and yet, because she is recently unschooling, most of her friends are in school (that&#39;s why we started the teen unschoolers yahoo group! - hopefully that will turn into something!)<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;I have very similar issues in regards to meeting the needs of both my<br/>\n </span></blockquote>  kids. Margaux doesn&#39;t like to be pressured to go out and do things,<br/>\n  expecially if it&#39;s so her sister can get out. If I set up stuff for<br/>\n  Margaux without her sister, she&#39;s very into it. So, unlike you, I have<br/>\n  to kids that like to get out and about, but mostly not together, and the<br/>\n  younger one can&#39;t stay home alone yet, and my older one doesn&#39;t really<br/>\n  like to stay home alone all the time, sometimes, but not always. <br/>\n  Finding things they both like, is hard because of the huge age<br/>\n  difference, and it&#39;s only getting more and more that way!&gt;&gt;<br/>\n<br/>\n  thanks for that - it&#39;s nice to hear others find it challenging at times.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;Chamille has a newish friend that has a car, so she may go do something<br/>\n </span></blockquote>  today while Margaux and I are out doing Margaux stuff. It&#39;s interesting<br/>\n  that Chamille has a friend with a car. I have mixed feelings about it,<br/>\n  but it&#39;s a first and it could turn out great for everyone.&gt;&gt;<br/>\n<br/>\n  wow yeah that is rather terrifying and liberating at the same time, i&#39;d imagine!  my daughter often dreams of when she can drive!<br/>\n<br/>\n  Lyla<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228941465","msgId":40911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3ODEyNkRBMTk3RTRENDQ5MTA2MDAyMjVFNzVCMUEwQExZTEFMQVAyPg==","inReplyToHeader":"PDhEOUZGQjZGLTVBMUUtNDA5Mi1BOTBCLTlBNDFEMTYxN0U4NkBtYWMuY29tPg==","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPiA8MUUxRjQ5QTUtRDkxRS00QkU2LTk4NDItNzIyQUMzNDZGRkZEQHNhbmRyYWRvZGQuY29tPiA8NjU3N0NCQzVFMzkyNEFFMTkwQUZFRERGQ0IwNzdEOEZATFlMQUxBUDI+IDw4RDlGRkI2Ri01QTFFLTQwOTItQTkwQi05QTQxRDE2MTdFODZAbWFjLmNvbT4="},"prevInTopic":40909,"nextInTopic":40912,"prevInTime":40910,"nextInTime":40912,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"I know what you re going to say - you were looking for how to pattern your day-to-day existence, not for ideas of one-time activities. interesting - that is","messageBody":"<div id=\"ygrps-yiv-944220715\">I know what you&#39;re going to say - you were looking for how to pattern <br/>\nyour day-to-day existence, not for ideas of one-time activities.&gt;&gt;<br/>\n<br/>\ninteresting - that is not at all what i was going to say! i do find that i am pretty creative about one time activities, although new ideas are always great to hear.  but  really appreciated your detailed descriptions of how you responded to different situations and your inventive ways for addressing the different needs.  i guess i wasn&#39;t clear enough about all we DO do in that vein, in an effort to be brief.<br/>\n<br/>\ni have done almost ALL the things you mention, and many of them work well, for sure!  inviting folks into our home doesn&#39;t work well, unfortunately, as my son finds that very stressful (at least other kids).  i have definitely had adult women parties/focused groups/activities and that works well.  but everything else you mentioned is great, and a good reminder to just do more of that.  <br/>\n<br/>\ni am not &quot;not looking for solutions&quot; - but i am not really lookng for solutions, either, just ideas/experiences that might contrinbute to broadening my perspective on how to meet everyone&#39;s needs.<br/>\n<br/>\ni *defintitely* try to focus on all of the ways in which things *are* working and all of the gifts that come with having different temperaments in the family - all the value gained for everyone and i DO appreciate all of that.  i was just looking for some inspiration into how things look for similar folks with a similar constitution in their family.<br/>\n<br/>\ni am sorry if i came across as &quot;yes-butting&quot; - i really do appreciate the ideas i got, and i will absolutely think about how things that might not first appear to have worked might actually work!<br/>\n<br/>\nLyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228940534","msgId":40909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhEOUZGQjZGLTVBMUUtNDA5Mi1BOTBCLTlBNDFEMTYxN0U4NkBtYWMuY29tPg==","inReplyToHeader":"PDY1NzdDQkM1RTM5MjRBRTE5MEFGRURERkNCMDc3RDhGQExZTEFMQVAyPg==","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPiA8MUUxRjQ5QTUtRDkxRS00QkU2LTk4NDItNzIyQUMzNDZGRkZEQHNhbmRyYWRvZGQuY29tPiA8NjU3N0NCQzVFMzkyNEFFMTkwQUZFRERGQ0IwNzdEOEZATFlMQUxBUDI+"},"prevInTopic":40908,"nextInTopic":40911,"prevInTime":40908,"nextInTime":40910,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"... I tried to respond to your first post about this, Lyla, but my response seemed overly harsh. Now that you ve gotten lots of other ideas and posted again,","messageBody":"<div id=\"ygrps-yiv-869603308\">On Dec 10, 2008, at 9:50 AM, Lyla Wolfenstein wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my son is not into the idea of being &quot;babysat&quot;, nor does he form  <br/>\n&gt; connections with others very easily....and all my friends/people he  <br/>\n&gt; IS connected to either have young children of their own (younger)  <br/>\n&gt; and no time for mentor relationships or are working during the day...<br/>\n&gt;<br/>\n&gt; i guess perhaps there are no easy answers here, i was just wondering  <br/>\n&gt; how folks with kids of different extreme temperaments pattern their  <br/>\n&gt; day to day lives....?<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I tried to respond to your first post about this, Lyla, but my  <br/>\nresponse seemed overly harsh. Now that you&#39;ve gotten lots of other  <br/>\nideas and posted again, dismissing them, I&#39;m going to say it anyway.  <br/>\nYou sound like people I know who aren&#39;t really looking for solutions,  <br/>\nbut who are really wanting to complain about how impossible their   <br/>\nparticular situation is. I&#39;m not entirely sure why they want to do  <br/>\nthat - but I&#39;m suggesting that you examine that possibility in yourself.<br/>\n<br/>\nThe best solution I can offer (and I have one extreme extrovert and  <br/>\none extreme introvert and another in-between) is to change your way of  <br/>\nthinking about it. Decide to think of this as an amazingly wonderful  <br/>\nincredibly positive aspect of your family and treat it that way. How  <br/>\nWONDERFUL that you have a child of each temperament. How wonderful  <br/>\nthat you are able and willing to find ways to nurture both of them in  <br/>\ntheir own ways. How wonderful that they (and you) learn to enjoy and  <br/>\nappreciate the diversity of human temperament. How wonderful that your  <br/>\ndaughter and son provide YOU with such a variety of life experiences.<br/>\n<br/>\nIn practice, multiple people living together ALWAYS have to &quot;work  <br/>\nthings out&quot; between them. That is a process that goes on and on -  <br/>\nalways changing in its dynamics, but never stopping. We all have that.  <br/>\nThere is no &quot;answer to the problem,&quot; there is only the day-to-day  <br/>\nthinking of each others&#39; needs as we go about living our lives.<br/>\n<br/>\nReading your post, the one thing I kept thinking was that you&#39;re  <br/>\nlooking too hard at the conflicts, too hard at how hard this is. You  <br/>\ncan&#39;t &quot;see&quot; the solutions when your eyes are focused on the problem.  <br/>\nYou have to look at it a little more &quot;sideways&quot; - by that I mean,  <br/>\ndon&#39;t see it so black and white. Take bits of it and combine things.<br/>\n<br/>\nFor example, your daughter likes to hang out with you and your women  <br/>\nfriends. Start a book club - once a month you have a group of women  <br/>\nfriends come over and everybody has read the same book. You have food  <br/>\n(everyone contributes) based on a theme related to the book you all  <br/>\nread. You might have a little related game, some decorations, people  <br/>\nmight even dress up. You spend a bit of time talking about the book,  <br/>\nmost of the time is socializing. (You can google how to run book  <br/>\nclubs, but do keep it casual and be creative with it.) Now you have  <br/>\none thing - once a month - that is a big social activity for you and  <br/>\nyour daughter, and your son can be home, in his room, doing what he  <br/>\nfeels like doing (if he&#39;s into it, he could help with the food,  <br/>\ndecorations, etc, beforehand, then disappear during the get-together).<br/>\n<br/>\nAnother thing you could add to the mix - a weekly &quot;game day&quot; at your  <br/>\nhouse. Invite a group of kids to come to play RISK or some other  <br/>\nparticular game that your daughter might enjoy. Make cookies, provide  <br/>\na good nice clear comfy space and some background music. All you need  <br/>\nis a couple of kids and she&#39;s in a &quot;group.&quot; You could do this at your  <br/>\nhouse, so your son can, again, just hang out where he wants and you  <br/>\ncan be with him while you still hostess the game-players.<br/>\n<br/>\nI know what you&#39;re going to say - you were looking for how to pattern  <br/>\nyour day-to-day existence, not for ideas of one-time activities.<br/>\n<br/>\nMy answer is that that IS how your day-to-day existence gets its  <br/>\n&quot;pattern,&quot; it is nothing more than the accumulation of all your plans.<br/>\n<br/>\nYour daughter wants more activity? Help her get that by setting up  <br/>\nactivities for her and helping her with transportation. Can you  <br/>\nprovide as much of YOUR time in all these social activities as you  <br/>\nthink she wants? Probably not - you have time constraints as real as  <br/>\nbudget constraints. You have another child with different needs.  <br/>\nThat&#39;s just a flat-out reality that your whole family can accept and  <br/>\nadjust to in the exact same way you adjust to whatever your particular  <br/>\nincome level and standard of living are. You don&#39;t gain anything by  <br/>\nwishing it was different, you work it out - not by constantly  <br/>\nbemoaning how you don&#39;t have enough money, but by constantly focusing  <br/>\non spending it on what will give you the most satisfaction. Do the  <br/>\nsame with the kids. Spend your time with a positive energy, just like  <br/>\nyou do your money.<br/>\n<br/>\nWhen your daughter wants to do two or three social outings in one day,  <br/>\none right on top of the other, and seems disappointed that you can&#39;t  <br/>\nmanage that because you feel the need to be there for your home-loving  <br/>\nson, don&#39;t focus on how you&#39;re not able to 100 percent meet all of  <br/>\nboth kids&#39; immediate desires. Focus on overall meeting their needs -  <br/>\nhers for more social life and his for more home life. Point out to her  <br/>\nwhat you WILL be doing.<br/>\n<br/>\nI had this scenario in my family, quite often.<br/>\n<br/>\nWe&#39;ve spent hours at the beach with a large group of families. Roya is  <br/>\nenergized and happy and excited and doesn&#39;t want it to end, wants to  <br/>\nstart something else immediately with some of the people we just spent  <br/>\na lot of time with. Roxana is worn out, had enough, desperately wants  <br/>\nto go home and curl up with a book all by herself and recuperate.<br/>\n<br/>\nI might arrange for Roya to go with some of the other people there and  <br/>\nhave dinner and spend the evening with them. I might invite a couple  <br/>\nof her friends to go home with us to watch a movie or something.<br/>\n<br/>\nBut sometimes I would not be able to arrange something and we&#39;d go home.<br/>\n<br/>\nWe&#39;d pull into the driveway of our house and Roya would be, in her  <br/>\nvery high energy and demanding way, asking, &quot;What now?&quot; I&#39;d say,  <br/>\n&quot;Right now we go in the house and you find something to do on your own  <br/>\nfor a while because the rest of us need some down time.&quot; I&#39;d be  <br/>\nsympathetic, but I&#39;d feel okay about this because we DID spend the day  <br/>\nin a big social situation and Roxana really DID need the down time.  <br/>\nI&#39;d feel okay about it the same way I&#39;d feel okay about saying, &quot;Right  <br/>\nnow we can&#39;t buy a new American Girl doll, but we will do our best to  <br/>\nfigure out a way to get one for you.&quot; Meeting our kids needs doesn&#39;t  <br/>\nmean we can (magically) overcome all real constraints - it means we  <br/>\nare willing to consider and be creative and try to do our best to  <br/>\nsupport our kids&#39; interests.<br/>\n<br/>\nThe nice thing about this is that the kids will, over time, realize  <br/>\nhow we are truly trying to make life good for them and they will  <br/>\nappreciate it. My kids, at 17, 21, and 24, look around at how parents  <br/>\ngenerally are so very uncaring about children&#39;s needs and interests,  <br/>\nand they mention all the time how differently we treated them. This in  <br/>\nSPITE of the fact that I could not possibly claim that I could always  <br/>\ndo exactly what every kid wanted exactly when they wanted. It was  <br/>\nalways a matter of doing our best to balance what different people  <br/>\nwanted.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228935902","msgId":40908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMjEwMTEwNXEyYjNkZGVkMnY4OGFhOGUzNTgwNzg4MmJmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDY1NzdDQkM1RTM5MjRBRTE5MEFGRURERkNCMDc3RDhGQExZTEFMQVAyPg==","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPgkgPDFFMUY0OUE1LUQ5MUUtNEJFNi05ODQyLTcyMkFDMzQ2RkZGREBzYW5kcmFkb2RkLmNvbT4JIDw2NTc3Q0JDNUUzOTI0QUUxOTBBRkVEREZDQjA3N0Q4RkBMWUxBTEFQMj4="},"prevInTopic":40907,"nextInTopic":40909,"prevInTime":40907,"nextInTime":40909,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"This was just a movie and maybe not very real life.  It s not an obscure movie and maybe someone else remembers the title.  I forget the name of it. The plot","messageBody":"<div id=\"ygrps-yiv-196037200\">This was just a movie and maybe not very real life.  It&#39;s not an obscure<br/>\nmovie and maybe someone else remembers the title.  I forget the name of it.<br/>\nThe plot is a young boy goes to a park where old guys play chess and joins<br/>\nthem, and it becomes something the kid does a lot.  I think he&#39;s supposed to<br/>\nbe about 10 or 11.<br/>\n<br/>\nA friend of mine has a loner-ish type child who likes having friends to hang<br/>\nout with but not often.  He will occasionally (once or so a week) hang out<br/>\nwith others (then it was in the afternoon to do some skateboarding and catch<br/>\nup with them).  Sometimes he goes to their parties, sometimes he&#39;d rather be<br/>\nhome.  He uses the cell phone a lot.  He&#39;s not crazy about being around<br/>\npeople much.  At that time in his life, he was a lot older than your son<br/>\nthough (16).<br/>\n<br/>\nMaybe it was the times and maybe it was the circumstances.  When I was ten,<br/>\nmy mom would often take the kids with her to grocery or thrift shop and<br/>\nleave other kids at home who would rather watch TV or read.  One of my aunts<br/>\nwho lived next door (there were one on each side of us) was invariably home<br/>\nand never checked on us.  Yet we knew we could go over to their house if we<br/>\nneeded to while our parents were out.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 12/10/08, Lyla Wolfenstein &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lylaw@...\">lylaw@...</a>&gt; wrote:<br/>\n&gt; i guess i should clarify - we do LOTS of &quot;special&quot; one time type things -<br/>\ni bring my daughter on moms &quot;night out&quot; - we have gone to conferences<br/>\ntogether, and on mini-vacations together, just the two of us, and she has<br/>\ngone to visit relatives and do other things with people we are close to,<br/>\nwithout me as well.  the &quot;special&quot; times are not an issue carving out - it&#39;s<br/>\nthe day to day every day, every week thing i am struggling with.  if she<br/>\nonly has &#39;special&quot; things to look forward to, what would ever keep her from<br/>\nwanting to go back to school?  she is bored and disatisfied at home during<br/>\nthe week.<br/>\n&gt;<br/>\n&gt;  my son is not into the idea of being &quot;babysat&quot;, nor does he form<br/>\nconnections with others very easily....and all my friends/people he IS<br/>\nconnected to either have young children of their own (younger) and no time<br/>\nfor mentor relationships or are working during the day...<br/>\n&gt;<br/>\n&gt;  i guess perhaps there are no easy answers here, i was just wondering how<br/>\nfolks with kids of different extreme temperaments pattern their day to day<br/>\nlives....?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;  Lyla<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: insight into meeting divergent needs","postDate":"1228935395","msgId":40907,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdocDNkMytpdGJpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY1NzdDQkM1RTM5MjRBRTE5MEFGRURERkNCMDc3RDhGQExZTEFMQVAyPg=="},"prevInTopic":40904,"nextInTopic":40908,"prevInTime":40906,"nextInTime":40908,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":" it s the day to day every day, every week thing i am struggling with. if she only has special things to look forward to, what would ever keep her from","messageBody":"<div id=\"ygrps-yiv-1277021863\">&quot; it&#39;s the day to day every day, every week thing i am struggling with.<br/>\nif she only has &#39;special&quot; things to look forward to, what would ever<br/>\nkeep her from wanting to go back to school? she is bored and disatisfied<br/>\nat home during the week.&quot;<br/>\n<br/>\nWhat about something like The Boys and Girls Club?  You live pretty<br/>\nurban, so there are probably several things of that nature around you. <br/>\nDoes she have interest in classes of any sort?<br/>\n<br/>\nChamille went through what you&#39;ve described, and still occasionally<br/>\ndoes.  Taking off, when my husband came home helped a lot.  We could<br/>\nleave little sister at home and go do stuff for a few hours.  Sometimes<br/>\nwe just walked around downtown PDX and looked a window displays,<br/>\nsometimes we&#39;d go out for coffee or a movie or the mall.<br/>\n<br/>\nDoing FrightTown was a huge big deal thing that helped A LOT!  It was 2<br/>\nlong days a week doing something hugely focused that lasted about 2<br/>\nmonths.  We did it just long enough to be ready to stop doing it by the<br/>\nlast day.  Now a month out, we miss it.  I try to take Chamille to the<br/>\ngrocery store with me while leaving Margaux behind with dad.  It&#39;s not<br/>\ntotally exciting, yet it&#39;s time away from home getting stuff done, and<br/>\ntime to talk and listen to music together and check stuff out.<br/>\n<br/>\nI try to be available for any and all chances of outings with friends,<br/>\nand Chamille knows that, yet she&#39;s been reluctant to set stuff up<br/>\nherself, until VERY recently.<br/>\n<br/>\nI have very similar issues in regards to meeting the needs of both my<br/>\nkids.  Margaux doesn&#39;t like to be pressured to go out and do things,<br/>\nexpecially if it&#39;s so her sister can get out.  If I set up stuff for<br/>\nMargaux without her sister, she&#39;s very into it.  So, unlike you, I have<br/>\nto kids that like to get out and about, but mostly not together, and the<br/>\nyounger one can&#39;t stay home alone yet, and my older one doesn&#39;t really<br/>\nlike to stay home alone all the time, sometimes, but not always. <br/>\nFinding things they both like, is hard because of the huge age<br/>\ndifference, and it&#39;s only getting more and more that way!<br/>\n<br/>\nChamille has a newish friend that has a car, so she may go do something<br/>\ntoday while Margaux and I are out doing Margaux stuff.  It&#39;s interesting<br/>\nthat Chamille has a friend with a car.  I have mixed feelings about it,<br/>\nbut it&#39;s a first and it could turn out great for everyone.</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228931438","msgId":40904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1NzdDQkM1RTM5MjRBRTE5MEFGRURERkNCMDc3RDhGQExZTEFMQVAyPg==","inReplyToHeader":"PDFFMUY0OUE1LUQ5MUUtNEJFNi05ODQyLTcyMkFDMzQ2RkZGREBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPiA8MUUxRjQ5QTUtRDkxRS00QkU2LTk4NDItNzIyQUMzNDZGRkZEQHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":40902,"nextInTopic":40907,"prevInTime":40903,"nextInTime":40905,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"i guess i should clarify - we do LOTS of special one time type things - i bring my daughter on moms night out - we have gone to conferences together, and","messageBody":"<div id=\"ygrps-yiv-173781881\">i guess i should clarify - we do LOTS of &quot;special&quot; one time type things - i bring my daughter on moms &quot;night out&quot; - we have gone to conferences together, and on mini-vacations together, just the two of us, and she has gone to visit relatives and do other things with people we are close to, without me as well.  the &quot;special&quot; times are not an issue carving out - it&#39;s the day to day every day, every week thing i am struggling with.  if she only has &#39;special&quot; things to look forward to, what would ever keep her from wanting to go back to school?  she is bored and disatisfied at home during the week.<br/>\n<br/>\nmy son is not into the idea of being &quot;babysat&quot;, nor does he form connections with others very easily....and all my friends/people he IS connected to either have young children of their own (younger) and no time for mentor relationships or are working during the day...<br/>\n<br/>\ni guess perhaps there are no easy answers here, i was just wondering how folks with kids of different extreme temperaments pattern their day to day lives....?<br/>\n<br/>\nLyla<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228926762","msgId":40901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFMUY0OUE1LUQ5MUUtNEJFNi05ODQyLTcyMkFDMzQ2RkZGREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPg==","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPg=="},"prevInTopic":40899,"nextInTopic":40902,"prevInTime":40900,"nextInTime":40902,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"-=-as i was writing this, i was talking with a friend online and the only idea we came up with is to take my daughter out at night, after my son is asleep","messageBody":"<div id=\"ygrps-yiv-1985983845\">-=-as i was writing this, i was talking with a friend online and the  <br/>\nonly idea we came up with is to take my daughter out at night, after  <br/>\nmy son is asleep (around 10:30 or so) maybe once a week or so - to  <br/>\nhear music, watch belly dancing, or something fun and &quot;night lifey&quot;.  <br/>\nthat sounds great, and i think it will help (if i can stay awake!)  <br/>\nbut it still leaves all day every day with a fairly understimulated  <br/>\nchild who wants to get OUT and another to whom going out to do  <br/>\nANYTHING almost never sounds good, and mostly sounds torturous.-=-<br/>\n<br/>\nYour husband doesn&#39;t work seven days a week, does he?   When he&#39;s  <br/>\nhome, take off.  Or does your son have a friend he could stay with or  <br/>\nhave over who also likes being fairly still?   Or do you have a  <br/>\nfriend who would stay over with him for you to take your daughter on  <br/>\novernight trips to visit female friends in other towns?<br/>\n<br/>\nHolly loves to be with my friends, too, just to hear us talk or be in  <br/>\non those conversations.  Last week we visited a college friend of  <br/>\nmine I hadn&#39;t seen for years, but I had talked about, and Holly  <br/>\nreminded me several times she wanted to meet her, so we went and it  <br/>\nwas great.  Last year we drove 100 miles to see a cousin who grew up  <br/>\nwith me, and we tried to go again in November, but logistics didn&#39;t  <br/>\nwork out.   There would have been no benefit at all in trying to  <br/>\ninclude Marty in those things.  It was about Holly&#39;s desire to know  <br/>\nmore about me as a person outside of just being her mom.<br/>\n<br/>\n-=-anyone else been there, done that? any ideas for how to &quot;do&quot;  <br/>\nunschooling with two such very different kids without one kid feeling  <br/>\nlike an unwilling third wheel or the other feeling tormented with  <br/>\nrestlessness and understimulation?-=-<br/>\n<br/>\nI have one introvert and two extrovert kids.  We&#39;ve found things to  <br/>\ndo with one or two of them that didn&#39;t involve the others, and found  <br/>\nplaces or people for the others.  Twice we&#39;ve left Kirby and Holly  <br/>\nand taken Marty (the introvert) with us to do something.  It might  <br/>\nseem backwards, but once we dropped Kirby and Holly off at a May Day  <br/>\nfestival at which several friends and relatives were, partway between  <br/>\nAlbuquerque and Denver, and took Marty with us to see a King Tut  <br/>\nexhibit at the museum up there, and to visit friends overnight.  We  <br/>\npicked the other two up on the way home, and everyone had had a great  <br/>\ntime.  Another time, when Keith was living in Minneapolis, I got  <br/>\nfriends to stay at my house and Marty and I went to MN for Marty&#39;s  <br/>\nbirthday.   He and Keith went snowboarding and ice skating and to  <br/>\nmovies they would like, and I stayed at the apartment and talked to  <br/>\nfriends on the phone and slept and watched movies.<br/>\n<br/>\nThere&#39;s nothing wrong with mixing it up that way.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Please do NOT cross post","postDate":"1228924861","msgId":40899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGNzVGNTJELTE3RDYtNDU2OC04RkRDLTE1QkNFQUQ1MzUzMUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPg==","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPg=="},"prevInTopic":40895,"nextInTopic":40901,"prevInTime":40898,"nextInTime":40900,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"-=-i am cross posting this two unschooling lists.-=- I know people join the list all the time and can t have read everything, but every time someone cross","messageBody":"<div id=\"ygrps-yiv-2008680750\">-=-i am cross posting this two unschooling lists.-=-<br/>\n<br/>\nI know people join the list all the time and can&#39;t have read  <br/>\neverything, but every time someone cross posts, I ask them not to.   <br/>\nPick a place.  Or post separately and don&#39;t tell us about the other one.<br/>\n<br/>\nIf this list isn&#39;t really the place you want to discuss something,  <br/>\ndon&#39;t bring it to the list.  It&#39;s like bulk mail then, and people  <br/>\nfeel less responsibility to help.  Bring special things to this list  <br/>\nif you want to, anytime.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":98618240,"authorName":"Renee M","from":"Renee M &lt;reneem29@...&gt;","profile":"reneem29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228922797","msgId":40902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxNDQ0OS4yODg1Mi5xbUB3ZWI1MzMxMi5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPg=="},"prevInTopic":40901,"nextInTopic":40904,"prevInTime":40901,"nextInTime":40903,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"//any ideas for how to do unschooling with two such very different kids without one kid feeling like an unwilling third wheel or the other feeling tormented","messageBody":"<div id=\"ygrps-yiv-809280444\">//any ideas for how to &quot;do&quot; unschooling with two such very different kids without one kid feeling like an unwilling third wheel or the other feeling tormented with restlessness and understimulation?//<br/>\n<br/>\nYou haven&#39;t mentioned finances here. Since you are uncomfortable leaving your son alone, have you considered finding a sitter? I know you&#39;d like to be with both kids all the time, but having an older &quot;grandma&quot; type lady hanging out with her knitting or whatever while your son happily engages in his own thing at home might not be so bad, if it gives yousome extragoing-outtime with your daughter that she craves. And if she happens to have an interest in baking or jewelry making herself, maybe he finds an interested mentor as well.<br/>\n<br/>\nOur kids are young yet, and the couple of non-family member sitters we&#39;ve found that the kids really enjoy spending time with are older women with grown kids of their own. <br/>\n<br/>\n-Renee<br/>\n<br/>\n <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] insight into meeting divergent needs","postDate":"1228909928","msgId":40895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMjEwMDM1Mmg4YWY4ZGJmdjFiMTUxMDYzNDI1M2MyMDJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPg==","referencesHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPg=="},"prevInTopic":40892,"nextInTopic":40899,"prevInTime":40894,"nextInTime":40896,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"I feel so unqualified to add much of value to your question.  I have a 5 year old only son. However, this stuck out to me and I found myself scratching my head","messageBody":"<div id=\"ygrps-yiv-1677210538\">I feel so unqualified to add much of value to your question.  I have a 5<br/>\nyear old only son.<br/>\n<br/>\nHowever, this stuck out to me and I found myself scratching my head over it:<br/>\n&quot;unschooling family adventure experience&quot;<br/>\n<br/>\nThat as an expectation sounds quite torturous to *me* and I&#39;m an adult not a<br/>\nteen or a child.<br/>\n<br/>\nHaving some conversations about expectations in general might clear the way<br/>\nto some understanding what it looks and feels like to others to have<br/>\nexpectations laid on them.  What if the situation were in reverse... if the<br/>\ndaughter were expected to behave contrary to her nature?  To stay at home<br/>\ncontinually and *not* be very social?<br/>\n<br/>\nThere may be something that can ease the situation or there may not be much<br/>\nbeyond acceptance of differences in people.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"insight into meeting divergent needs","postDate":"1228898492","msgId":40892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1MjE4NTQyMEZFODRBQjg5Qjg5RDE1MzdEMDhDMjlFQExZTEFMQVAyPg=="},"prevInTopic":0,"nextInTopic":40895,"prevInTime":40891,"nextInTime":40893,"topicId":40892,"numMessagesInTopic":0,"msgSnippet":"i am cross posting this two unschooling lists. i have a question that i just feel quite stuck with, and am hoping to get some perspective and experience. i","messageBody":"<div id=\"ygrps-yiv-286428047\">i am cross posting this two unschooling lists.<br/>\n<br/>\ni have a question that i just feel quite stuck with, and am hoping to get some perspective and experience.<br/>\n<br/>\ni have two children - my son is 10 and my daughter is 13.<br/>\n<br/>\nmy son  has been out of school for nearly a year and my daughter just decided about 6 weeks ago to leave school.  she is thinking it is just for the semester or maybe the year, but i could imagine her choosing to stay home beyond that, especially if we can solve this dilemma...<br/>\n<br/>\nhere it is:  <br/>\n<br/>\nmy kids have *very* different temperaments, and always have.  they share some traits of course - sensitivity, passion, creativity...<br/>\n<br/>\nbut in terms of how they interact with the world and other people, they are sooooo different.  my son is quite introverted, prefering the company of his close family and an occasional friend, lots of time alone, and a focused hobbies for activities, which very from week to week or month to month, but are focused on pretty intensely for however long they hold his interest.  right now he is into jewelry making (beading) and baking. he gets quite stressed by too much activity, doesn&#39;t care for much travel, crowds, groups (even of familiar people), etc.  and has very little tolerance for activities that he isn&#39;t personally interested in.<br/>\n<br/>\nmy daughter on the other hand is *very* extraverted, and if she could design her life exactly as she wanted it, it&#39;d be full of spontaneous mother-daughter adventures, activities, and explorations, including time with me and my women friends (who she loves to hang out with), time together with just me, and time with our whole family, or just the three of us, while my husband is working, but only if my son would be a willing and fun participant.<br/>\n<br/>\nexpecting him to go along on stuff he isn&#39;t up for is a lose-lose situation, as it becomes miserable for everyone.  bringing stuff along is no longer helpful - there is nothing portable that is interesting enough to him to help him get through an unpalatable situation.<br/>\n<br/>\nhe can stay home alone for a few hours at a time, once or twice a week, but that is not enough time to really get the kind of experiences my daughter is craving....and i can&#39;t fully relax or go far from home, so there are limitations there.  i could of course drive her places and pick her up, and i facilitate any social activites she wants to be part of, but what she is really craving is that &quot;unschooling family adventure experience&quot;!  <br/>\n<br/>\nmy husband works long hours, so time together is hard to come by, and time for him to stay with our son is limited too,although he does it frequently for parties, short trips, and events.  there just doesn&#39;t seem to be enough hours in the day to meet everyone&#39;s needs for attention, activites, sleep, and connection.<br/>\n<br/>\nas i was writing this, i was talking with a friend online and the only idea we came up with is to take my daughter out at night, after my son is asleep (around 10:30 or so) maybe once a week or so - to hear music, watch belly dancing, or something fun and &quot;night lifey&quot;.  that sounds great, and i think it will help (if i can stay awake!) but it still leaves all day every day with a fairly understimulated child who wants to get OUT and another to whom going out to do ANYTHING almost never sounds good, and mostly sounds torturous.<br/>\n<br/>\nanyone else been there, done that?  any ideas for how to &quot;do&quot; unschooling with two such very different kids without one kid feeling like an unwilling third wheel or the other feeling tormented with restlessness and understimulation?<br/>\n<br/>\nthanks!<br/>\n<br/>\nLyla<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":40969,"nextTopicId":40941}}