{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Getting to be social","postDate":"1331581255","msgId":66057,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUzQjBEQTE5LTY5NjItNDdFNC05QjkyLTc0NzBDOTU2QzA1Q0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGpqbGJrYyt2MTloQGVHcm91cHMuY29tPg==","referencesHeader":"PGpqbGJrYyt2MTloQGVHcm91cHMuY29tPg=="},"prevInTopic":66056,"nextInTopic":0,"prevInTime":66056,"nextInTime":66058,"topicId":66053,"numMessagesInTopic":0,"msgSnippet":"... When my daughter was still nursing and later on past the age of your eldest,  we did family sleepovers - usually the mum and kid(s). That worked well,","messageBody":"<div id=\"ygrps-yiv-722029005\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; If the drives are long, what about sleepovers? If your daughter  <br/>\n&gt; isn&#39;t ready to be away from home, you could invite her friends to  <br/>\n&gt; stay with you - overnight or for a weekend. It might be a nice  <br/>\n&gt; countryside adventure for someone! Mo&#39;s gone to a couple sleepovers  <br/>\n&gt; in town with friends and then on day trips into the city from there<br/>\n<br/>\n </span></blockquote>When my daughter was still nursing and later on past the age of your  <br/>\neldest,  we did family sleepovers - usually the mum and kid(s). That  <br/>\nworked well, especially for children who weren&#39;t ready to be away from  <br/>\ntheir mothers and gave the mums time to visit over a length of time  <br/>\nwhile their kids were together, too.  There was always a place for a  <br/>\nfamily to just be on their own if they needed quiet time, like the  <br/>\nbedroom in which they stayed, so it worked for even the most  <br/>\nintroverted (like us).<br/>\n<br/>\nI miss those times of families hanging together :-)<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Getting to be social","postDate":"1331580585","msgId":66056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFREIyQkZCLUYxMkItNEVBOS1BODQyLUNERDAzMzYyQkY2QkBnbWFpbC5jb20+","inReplyToHeader":"PGpqa25zdStzYTZpQGVHcm91cHMuY29tPg==","referencesHeader":"PGpqa25zdStzYTZpQGVHcm91cHMuY29tPg=="},"prevInTopic":66055,"nextInTopic":66057,"prevInTime":66055,"nextInTime":66057,"topicId":66053,"numMessagesInTopic":0,"msgSnippet":"... I live in the Netherlands where the homeschooling population is tiny - about 400 children have official permission to homeschool out of a school population","messageBody":"<div id=\"ygrps-yiv-1633447711\">---My children are young 2.5 and 6 so a lot of time with me is great...but they long for friends.---<br/>\n<br/>\nI live in the Netherlands where the homeschooling population is tiny - about 400 children have official permission to homeschool out of a school population of about 2.4 million. When my children wanted more friends to play with during school hours, I started thinking about ways I could make Leiden an interesting place for homeschooling families to come visit.<br/>\n<br/>\nI found a children&#39;s theater facilitator that was happy to give once a week sessions for about 12-15 children, aged 4-7. The workshop was meant to last 8 weeks. I advertised on regional dutch yahoo lists and about a dozen children signed up from different cities and towns in the Netherlands. Some of the families had to travel an hour (or more) to reach Leiden. About 2 days before the class was meant to start, the facilitator cancelled. I decided to offer a games session instead, playing games such as charades, musical chairs and duck, duck, goose. Everyone still showed up and both the parents and children seemed to enjoy it. This series of serendipitous events is how our weekly homeschool group got started.<br/>\n<br/>\nThe group&#39;s main focus is on friendships and free play. However, I&#39;m not sure if most people would continue traveling regularly to Leiden without the group also offering regular, interesting activities that the children can participate in. Some past examples are burying a time capsule, a health and wellness spa, treasure hunts, playing with music, visiting farms, visiting museums, crafting, making boats, etc. The activities are usually only about 30-45 minutes and the rest of the time is free play. Some children usually decide they would rather play than participate in activities and that is always fine. Currently we have about 2 meetings a month that are completely free play (usually at a playground, a park, or at the beach) and two meetings that have some type of activity offered.<br/>\n<br/>\nIt&#39;s worked really well for my family and my children&#39;s social needs are met. If they want to play with friends during the week, I now have about a dozen families I can contact to arrange a play date. Often this means us traveling at least an hour on public transport to reach our friends. But that is one of the realities of homeschooling in a country with such few homeschoolers. <br/>\n<br/>\n---There are not heaps of people to gather and most seem to want to keep to themselves.---<br/>\n<br/>\nI had a difficult time getting to know people when I attended different homeschooling outings. My dutch is not stellar and it seemed everyone went in different directions. Often we explored the attraction alone and the children found it difficult to make friends. When I started the group, I made it a priority to get to know everyone personally - parents and children - and suggest activities and places to visit based on the personalities of the children in the group. The group has become an extension of my unschooling nest and so I try to make it a sparkly, interesting and vibrant place to be. I think it helps if someone takes responsibility for this.<br/>\n<br/>\nMost of our meetings have about 8-12 children. It seems to work better when there are not heaps of people, especially with young children. <br/>\n<br/>\nRippy<br/>\n(Gianluca 7, Gisele 5)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Getting to be social","postDate":"1331573196","msgId":66055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpqbGJrYyt2MTloQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpqa25zdStzYTZpQGVHcm91cHMuY29tPg=="},"prevInTopic":66054,"nextInTopic":66056,"prevInTime":66054,"nextInTime":66056,"topicId":66053,"numMessagesInTopic":0,"msgSnippet":"... *************** I live out in the country and used to drive an hour and a half to homeschool gatherings. Ray loved it (there was an outdoor skatepark), but","messageBody":"<div id=\"ygrps-yiv-527431005\">&quot;madh4ofwaipu&quot; &lt;megan2@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;m trying really hard to have homeschool gatherings in our closest major town which is 45mins drive away but this is really hard going.<br/>\n </span></blockquote>***************<br/>\n<br/>\nI live out in the country and used to drive an hour and a half to homeschool gatherings. Ray loved it (there was an outdoor skatepark), but the long drives wore on Mo, so sometimes I&#39;d find other rides for Ray - other people going to the city who could drop him off and pick him up. He was a teen by then, though - not a great solution for younger kids. <br/>\n<br/>\nI&#39;ve had better luck with one-on-one playdates with families closer to home for Mo - a mix of homeschooling and school kids. And then a couple times a year we go to a good sized unschooling campout which is several hours drive from home. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My older daughter does ballet once a week...its a nice catch up for her with others her age...but it&#39;s not what you would call having fun with friends. <br/>\n </span></blockquote>***************<br/>\n<br/>\nIf the drives are long, what about sleepovers? If your daughter isn&#39;t ready to be away from home, you could invite her friends to stay with you - overnight or for a weekend. It might be a nice countryside adventure for someone! Mo&#39;s gone to a couple sleepovers in town with friends and then on day trips into the city from there, and Ray did a lot of sleepovers and weekend visits with other families when he was younger - he still does ;) but now he mostly handles the transportation issues on his own. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Getting to be social","postDate":"1331563504","msgId":66054,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVCNDQwQkRDLUFBODgtNEM1OS05MUE5LTA4OEYzREJDNjlEOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpqa25zdStzYTZpQGVHcm91cHMuY29tPg==","referencesHeader":"PGpqa25zdStzYTZpQGVHcm91cHMuY29tPg=="},"prevInTopic":66053,"nextInTopic":66055,"prevInTime":66053,"nextInTime":66055,"topicId":66053,"numMessagesInTopic":0,"msgSnippet":"-=-How did others tackle this learning step?-=- I think it will help if you don t think of it as a learning step. It s part of life.  The cost of living","messageBody":"<div id=\"ygrps-yiv-1097310208\">-=-How did others tackle this learning step?-=-<br/>\n<br/>\nI think it will help if you don&#39;t think of it as &quot;a learning step.&quot;<br/>\nIt&#39;s part of life.  The &quot;cost&quot; of living out of town is a lot of driving.<br/>\n<br/>\nOne family we knew well from the time my boys were 6 and 8 years old moved 50 miles out of town so the kids could live rurally.  The parents were sure this would be good for their children to have a horse, and chickens, and a pig.  <br/>\n<br/>\nIt wasn&#39;t good for their children.<br/>\n<br/>\nTurns out it wasn&#39;t good for the parents, either, and they ended up divorced, and not taking care of the animals very well, and spending a ton of money on gasoline and car repairs.  The boy who was my boys&#39; age ended up staying with us a lot.  When they were all old enough to get jobs, he was too far from town to get a job.<br/>\n<br/>\nIt&#39;s doable, but as it was a parental choice to live out there, it&#39;s not good to resent the kids for wanting to have and do things that are only happening in the larger town.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":474398264,"authorName":"madh4ofwaipu","from":"&quot;madh4ofwaipu&quot; &lt;megan2@...&gt;","profile":"madh4ofwaipu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Getting to be social","postDate":"1331552990","msgId":66053,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpqa25zdStzYTZpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":66054,"prevInTime":66052,"nextInTime":66054,"topicId":66053,"numMessagesInTopic":0,"msgSnippet":"Hello everyone I would like to know about social times for the home learner Our family does live in new Zealand and in a small country town. Living where we","messageBody":"<div id=\"ygrps-yiv-522794355\">Hello everyone<br/>\nI would like to know about social times for the home learner<br/>\n<br/>\nOur family does live in new Zealand and in a small country town. Living where we live gives us many opertuneities and to home educate is one of them....if we moved closer to Auckland - a main city - i would have to work full time....and the stress of paying off a huge mortgage we feel would not be a good growing environment for our children.<br/>\nThere are not many homeschoolers and we need to drive 45mins to get to a gathering spot.<br/>\n<br/>\nMy children are young 2.5 and 6 so a lot of time with me is great...but they long for friends.<br/>\nMy older daughter does ballet once a week...its a nice catch up for her with others her age...but it&#39;s not what you would call having fun with friends. <br/>\nI also try to catch up with other home learners once a week at swimming but the lesson times make for a very long day and Even then they don&#39;t get to play with many others.<br/>\n<br/>\nI&#39;m trying really hard to have homeschool gatherings in our closest major town which is 45mins drive away but this is really hard going. There are not heaps of people to gather and most seem to want to keep to themselves.<br/>\n<br/>\nI&#39;m starting to look around our own little town for other after school activitys but wondering if I&#39;m worried about this too much. <br/>\nHow did others tackle this learning step?<br/>\n<br/>\nThank you<br/>\nMegan</div>","specialLinks":[]}],"prevTopicId":66021,"nextTopicId":66037}}