{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":31,"messages":[{"userId":146149790,"authorName":"Jane Bertone","from":"&quot;Jane Bertone&quot; &lt;janeb602@...&gt;","profile":"janeb602","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: engaged and engaging; interested and interesting","postDate":"1226350060","msgId":40098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmYTZsYytjdTR1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNCNDkwMUEwLTBDOTctNDkwQi1CM0E3LTQzQzcxRjFENkQwNUBtYWMuY29tPg=="},"prevInTopic":40087,"nextInTopic":40105,"prevInTime":40097,"nextInTime":40099,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... I think part of it is that grasping principles wrt parenting has often (historically?) been about acquiring a set of skills and tools to, e.g., achieve","messageBody":"<div id=\"ygrps-yiv-1775669698\"><blockquote><span title=\"ireply\">&gt; What is really interesting to me is that I just told people almost the  <br/>\n&gt; opposite the other day when I said that they need to focus on  <br/>\n&gt; understanding the basic reasons for and principles of unschooling -  <br/>\n&gt; that if they really grasp those, they won&#39;t have to decide whether or  <br/>\n&gt; not to unschool, <br/>\n<br/>\n </span></blockquote>I think part of it is that grasping &quot;principles&quot; wrt parenting has<br/>\noften (historically?) been about acquiring a set of skills and tools<br/>\nto, e.g., achieve discipline, or teach sharing, or something specific<br/>\n(in mainstream parenting books etc.).  And maybe people are in the<br/>\nhabit/custom of instituting a principle as if it were a timeout or a<br/>\ngold star.  <br/>\n<br/>\nI think it&#39;s difficult for some of us to understand principles in the<br/>\nbroader context of a life changing, fundamental, who am I at heart<br/>\nkind of thing.  We have so long been trying to bend the spoon.<br/>\n<br/>\nWe juxtapose principles with rules and make simple differentiations to<br/>\nreplace the other with the one.  I think this may sometimes downplay<br/>\nthe magnitude of the shift required.  It&#39;s difficult to see that you<br/>\nhave to step into a whole new paradigm, *system* of thought; very much<br/>\nlike the Matrix, you didn&#39;t imagine it could be like that.  You have<br/>\nto realize that the spoon doesn&#39;t exist.<br/>\n<br/>\nAnd then you realize that *being* interesting is indeed a principle. <br/>\nIt&#39;s about embracing LIFE, being alive, every minute, because you love<br/>\nit and it&#39;s worth doing.  And that any other choice that involves your<br/>\nkids feels very near to choosing death.<br/>\n<br/>\nAnd when you see that, this is true:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; they won&#39;t have to &quot;pick&quot; unschooling like they pick  <br/>\n&gt; a new curriculum, it will be the only thing that makes sense to do,  <br/>\n&gt; the only way they feel comfortable living.<br/>\n<br/>\n </span></blockquote>To me, Pam and Sandra both describe the process clearly.<br/>\n<br/>\n(Maybe this is easier to do based on certain circumstances.  When the<br/>\nconcept of unschooling, or perhaps whole life learning, occurs to<br/>\npeople who have recently been shocked with the life-changing<br/>\nexperience of becoming a parent; maybe they are more ripe for the<br/>\nunschooling Change.  When you come to unschooling because schooling<br/>\nand then homeschooling wasn&#39;t working for you, you may be more likely<br/>\nto be gradually acquiring more and more sophisticated &quot;tools&quot;.  Yet<br/>\nnot really seeing (or wanting to see) the whole new world order, so to<br/>\nspeak.)<br/>\n<br/>\nThe other thing is that for many of us, being interesting has been<br/>\ndangerous.  You know, the whole school thing and all.  I had a Russian<br/>\nfriend in college who would say to me, &quot;So, Jaayyne, telll me, what do<br/>\nyou think?&quot;  And so often my answer would be, &quot;I don&#39;t know.&quot; <br/>\n&quot;Jaayynne, what do you waant to do?&quot;   &quot;I don&#39;t know.&quot;  Eventually he<br/>\nwould just say it for me, &quot;I know, I know: you donnn&#39;t knooowww&quot;,<br/>\nteasing me.  I would get incredibly frustrated and refuse to hang out<br/>\nwith him for a while because he was so rude and snobbish.  He simply<br/>\nvalued interesting conversation and I was seriously lacking, afraid to<br/>\nvoice any thought or idea at all.  It&#39;s taken me *years* to get to a<br/>\npoint where I value and know what *I* like.  This seems pretty common<br/>\nto me.  And maybe this is the part that can actually be too difficult<br/>\nto overcome or change.<br/>\n<br/>\nBTW, this is my first post here.  Hello!  I have seen many of your<br/>\nnames on other lists and on the RUN.  I doubt I&#39;ll be posting much<br/>\nhere.  I just wanted to lurk and learn but I thought I might have<br/>\nsomething useful to contribute on this thread.  I&#39;m mom to two bio<br/>\ndaughters, Selena and Samantha (4 and 2) and two step daughters,<br/>\nKelsey and Abbie (17 and 14).  I&#39;m married to Dean and we live in<br/>\nMassachusetts.<br/>\n<br/>\nJane</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: engaged and engaging; interested and interesting","postDate":"1226346022","msgId":40087,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmYTJuNitkYzltQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcxQkY1Njc2LTg4RUMtNEU0NC1CODYxLTU3MDg1OTMyMjE4NEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40040,"nextInTopic":40098,"prevInTime":40086,"nextInTime":40088,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... Yes--I think this is the crux of it right here.  I believe that the ethic that we as adults need to make decisions for our children is so strong that that","messageBody":"<div id=\"ygrps-yiv-1596679149\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-I can still do other things once my focus has been<br/>\n&gt; directed toward them first, but if I do those things without my focus<br/>\n&gt; being first on my kids, then they end up not being in the equation.<br/>\n&gt; That alone is what allows me to be engaging with them, rather than<br/>\n&gt; seperate from them.<br/>\n&gt; <br/>\n&gt; -=-I&#39;m having a hard time puting that in words.-=-<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I think we&#39;re talking about something people have never talked about  <br/>\n&gt; before.<br/>\n&gt; <br/>\n </span></blockquote>Yes--I think this is the crux of it right here.  I believe that the ethic that we as adults need <br/>\nto make decisions for our children is so strong that that is what stands in the way of <br/>\npeople getting unschooling.  I think this is also why many people who are truly trying to <br/>\nfind partnership parenting, in trying to dislodge this thought from their brains, do the only <br/>\nalternative that makes any sense at first, which is to then try to have the child make all the <br/>\ndecisions instead. <br/>\n<br/>\nIt&#39;s about still figuring out who will have control.  When still in this paradigm, it seems like <br/>\npower can&#39;t really be shared--someone must have 51%.  So they try giving the 51% to their <br/>\nchild.  I moved through a phase like this, and eventually I figured out how to move out of it <br/>\naltogether, but I personally had to experience what it was like for me to give up &quot;control&quot;  <br/>\nto a child in order to find how to work together.  Our cultural ideas about parenting are so <br/>\nincredibly hierarchical that I think it&#39;s hard for people to see their way around it without <br/>\nfirst running smack into it.  Because we were all raised to be controlled in some way by <br/>\nour parents.  We all know how to be controlling or helpless, but not how to work in <br/>\npartnership with a child.<br/>\n<br/>\nI think many people get stuck in that dynamic, in either trying to make it work or feeling <br/>\nthat this isn&#39;t right either and give up.  Partnering with our children is just not a reality that <br/>\nmost people have ever seen or heard of--it is a really different mindset that isn&#39;t <br/>\nsupported or modeled anywhere, except perhaps attachment parenting (I don&#39;t know for <br/>\nsure because I didn&#39;t know about that until it was too late).<br/>\n<br/>\nI think people try to do the &quot;stuff&quot; of unschooling and then call it unschooling even though <br/>\nthat isn&#39;t really it, because they either don&#39;t understand about the real shift that needs to <br/>\nhappen, or they just can&#39;t go there.<br/>\n<br/>\nPeople who want to find this new place are all looking for a road map, but the destination <br/>\nis hidden until you get there.  I think that those of us who are involved in trying to help <br/>\nother people find it are trying to find ways to better describe the destination.<br/>\n<br/>\n(Sorry this got a little long)<br/>\nJoanna</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"[AlwaysLearning] Re: engaged and engaging; interested and interesting","postDate":"1226267804","msgId":40040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBOEI0QjNFODFBOTRGRTI4OEFGOTU4RTU4Qzg0NjNBQExZTEFMQVAyPg==","inReplyToHeader":"PGdmN2l1cCs1NnBvQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmN2l1cCs1NnBvQGVHcm91cHMuY29tPg=="},"prevInTopic":40035,"nextInTopic":40087,"prevInTime":40039,"nextInTime":40041,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... a valid request, I would have been made to feel selfish if I d even been brave enough to ask in the first place. In fact, the dynamic of my house, as a","messageBody":"<div id=\"ygrps-yiv-1756227674\"><blockquote><span title=\"ireply\">&gt;&gt;make it happen. When I was a kid, that never would have been considered<br/>\n </span></blockquote>a valid request, I would have been made to feel selfish if I&#39;d even been<br/>\nbrave enough to ask in the first place. In fact, the dynamic of my<br/>\nhouse, as a kid, being what it was, I probably wouldn&#39;t have even<br/>\nconsidered this in the first place. The idea of it wouldn&#39;t have<br/>\noccured to me. This is a big difference that I see in Chamille, her<br/>\nthinking isn&#39;t defined by parental parameters in that manner, she thinks<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;big and offers suggestions that never would have occured to me. <br/>\n<br/>\n </span></blockquote>yeah, i have also had some experiences of what i would consider &quot;thinking small&quot; leading to a snowballing of experiences - in the &quot;if you give a moose a muffin&quot; tradition.  but none of it would have happened without responsiveness, and engagement on my part - which i am just recently really recognizing and developing...<br/>\n<br/>\nfor example, thursday night, i was showing my son (10) a web site of wolf haven, because i had just proposed going on a road trip with my kids there next week, when my husband is out of town.  his first response was &quot;no&quot; (very common for him) but he was open to the notion of just going for the experience/adventure, even if the destination itself doesn&#39;t turn out to be facinating for him.  so i was showing him some of hte sights we could see/experience along the way, and one was a cider press/farm.  on that page, we saw a lovely color photo of fresh baked cinnamon rolls, which inspired a deep desire for one!  i overcame my initial &quot;it&#39;s dark, late, i don&#39;t want to go to the store just for that&quot; feeling&quot; and took him.  he was elated, and remarked on the way out the door how nice i was to do so.<br/>\n<br/>\nonce there, i was looking in the baking aisle for citric acid to make bath bombs, and he saw the cake decorating supplies.  it reminded him of a cake workshop he&#39;d been involved in a few years back in school, and he said &quot;i want to make a cake&quot;<br/>\n<br/>\nhe has been at loose ends/bored/restless for a while so this was really cool, for him to choose something that inspired him.  we got supplies.  <br/>\n<br/>\nthe next day he was ready to make the cake, and we did - he did almost all of it himself, and  was happy and easygoing about it (another accomplishment for him, as he tends to be very intense and easily stressed by collaborative work or focused projects that encounter snafoos or might.)<br/>\n<br/>\nit came out great, and he was delighted with it.  the final development from this experience was that he had been struggling with anxiety and stress around what he wanted to do for a unschoolers children&#39;s market event i am coordinating - and had decided it was too much for him and he would just be a customer and not have a booth.  after the cake experience, i suggested that maybe he&#39;d want to bake a cake and raffle it off and that was a VERY exciting idea for him - so now he has a plan for that as well.<br/>\n<br/>\nso - a hankering for a cinnamon roll turned into a processional of experiences that contributed to his joy, learning, confidence, and peace!<br/>\n<br/>\nwarmly, Lyla<br/>\n<br/>\n_,_._,___ <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: engaged and engaging; interested and interesting","postDate":"1226264345","msgId":40035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmN2l1cCs1NnBvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgzNDE2OC4xNzM4My5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":40025,"nextInTopic":40040,"prevInTime":40034,"nextInTime":40036,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... me on this computer and Simon was on the couch on a different computer and David was either in the study, outside working on the car, or in this room","messageBody":"<div id=\"ygrps-yiv-372746152\"><blockquote><span title=\"ireply\">&gt; I spent a lot of yesterday playing on WoW. Linnaea was sitting next to<br/>\n </span></blockquote>me on this computer and &gt;Simon was on the couch on a different computer<br/>\nand David was either in the study, outside &gt;working on the car, or in<br/>\nthis room watching television. There wasn&#39;t a lot of engagement going<br/>\n<blockquote><span title=\"ireply\"> &gt;on.<br/>\n<br/>\n </span></blockquote>This whole last week, the kids have been sick, so I&#39;ve been at the<br/>\ncomputer a lot because everyone was inactive.  However, I also made a<br/>\nLOT of food for people, washed clothing, organized closets, picked up<br/>\ntoys, washed dishes, helped in beading projects, got out origami and<br/>\nexplored a lot of paper projects online, like paper bangers and<br/>\nexploding straws.<br/>\n<br/>\nI was constantly available to both my kids who were in seperate rooms<br/>\nbecause neither of them felt good and couldn&#39;t agree on what to watch on<br/>\nTV and didn&#39;t want to share the couch.<br/>\n<br/>\nThe thing is, it&#39;s not so different from any other day, which I&#39;m<br/>\nconstantly available, just maybe less hop to, since they will do stuff<br/>\non their own accord knowing that I will help them get what they want if<br/>\nthey can&#39;t or don&#39;t want to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Toontown (which doesn&#39;t have as much available for non paying players<br/>\n </span></blockquote>as it did a year ago)<br/>\n<br/>\nWe were just considering renewing one of our accounts because of that,<br/>\nand it would&#39;ve been a nice thing to do while not feeling well.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Unschooling takes a near constant willingness to be interested in<br/>\n </span></blockquote>whatever is going on. It &gt;doesn&#39;t mean withholding judgement, but it may<br/>\nmean delaying it, giving something a go and &gt;not dismissing it out of<br/>\nhand. I really like that aspect of unschooling. I really like having<br/>\n&quot;willing &gt;to give it a go&quot; as part of my job description.<br/>\n<br/>\nThat is exactly It!  I never would have been involved in a Halloween<br/>\nhaunt production, if it hadn&#39;t been for Chamille&#39;s intense desire to do<br/>\nit.  That is the case a lot.  One of my kids has an idea and rather than<br/>\ndismissing it or finding reasons to NOT do it, we encourage it and find<br/>\nways TO do it.<br/>\n<br/>\nToday, Chamille wants us out of the house so that she can do some video<br/>\nmaking thing with a friend.  John and I are taking Margaux to a movie to<br/>\nmake it happen.  When I was a kid, that never would have been considered<br/>\na valid request, I would have been made to feel selfish if I&#39;d even been<br/>\nbrave enough to ask in the first place.  In fact, the dynamic of my<br/>\nhouse, as a kid, being what it was, I probably wouldn&#39;t have even<br/>\nconsidered this in the first place.  The idea of it wouldn&#39;t have<br/>\noccured to me.  This is a big difference that I see in Chamille, her<br/>\nthinking isn&#39;t defined by parental parameters in that manner, she thinks<br/>\nbig and offers suggestions that never would have occured to me.<br/>\n<br/>\nParents can cause &quot;in the box&quot; thinking or &quot;in the parent approved box&quot;<br/>\nthinking.  It stifles creative thinking and the generation and flow of<br/>\nideas.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: engaged and engaging; interested and interesting","postDate":"1226253771","msgId":40025,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGMkExQUQ1LUY0QzgtNERCMS1CMjIwLUVBRDE0NTY5RDgxNEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmNm1tayt1YmQ2QGVHcm91cHMuY29tPg==","referencesHeader":"PGdmNm1tayt1YmQ2QGVHcm91cHMuY29tPg=="},"prevInTopic":40021,"nextInTopic":40035,"prevInTime":40024,"nextInTime":40026,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"-=-The hard work of unschooling comes not only from the day to day engagement with kids learning, but also (and this may be too big a hurdle for some) because","messageBody":"<div id=\"ygrps-yiv-1823571286\">-=-The hard work of unschooling comes not only from the day to day  <br/>\nengagement with kids&#39;<br/>\nlearning, but also (and this may be too big a hurdle for some)  <br/>\nbecause ultimately<br/>\nunschooling asks us to confront the question &#39;What kind of person am  <br/>\nI?&#39;-=-<br/>\n<br/>\nClaire, thanks for this!  I think it&#39;s that talk of the state and  <br/>\nnature of &quot;being&quot; that makes people so nervous.  Talking about the  <br/>\nway they are is like religion or philosophy.  It&#39;s on the spiritual  <br/>\nlevel, and it&#39;s hard to get to unschooling without going through  <br/>\nthere somehow.  I&#39;ve seen some people try it for years, and their  <br/>\nkids aren&#39;t as happy and centered as some others.<br/>\n<br/>\n<br/>\n<br/>\nYour list of principles is nice:<br/>\n<br/>\n<br/>\n- my kids learn from my example<br/>\n- my mothering instincts can be trusted<br/>\n- I am guided by my love for my children<br/>\n- unschooling is a continuum that can last a lifetime<br/>\n- hard work in the early years is repaid many times over<br/>\n- I am fallible just like everyone else but openness and reflection  <br/>\ncan help me not to repeat<br/>\nmistakes<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337319671,"authorName":"Stephanie Bonck","from":"Stephanie Bonck &lt;stephaniebonck@...&gt;","profile":"stephaniebonck","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: engaged and engaging; interested and interesting","postDate":"1226243620","msgId":40021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3NDQ4OS4zMTY3Ni5xbUB3ZWI0NTcxMi5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":40018,"nextInTopic":40025,"prevInTime":40020,"nextInTime":40022,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"I have been TRULY unschooling for about one month now. My 12 year old daughter came out of the blue and said she wanted to do some math. She is doing it in","messageBody":"<div id=\"ygrps-yiv-506791257\">I have been TRULY unschooling for about one month now. My 12 year old daughter came out of the blue and said she wanted to do some math. She is doing it in small increments when she feels like it. I am glad, I was apprehensive at first. I am so glad I let go of all the stress and worry from trying to force curriculum on my kids. We watch tv, play games, go on Myspace, and the park. My kids are pretty smart, and very energetic. They seem so happy now. I&#39;m so glad I found out about unschooling. And I only have one other family here that unschools. The rest of the mothers seem a bit holier than thou, but it &#39;s alright. I like the park days.<br/>\n <br/>\nSteph in East TX<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":363518215,"authorName":"claire.horsley08","from":"&quot;claire.horsley08&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: engaged and engaging; interested and interesting","postDate":"1226235412","msgId":40018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNm1tayt1YmQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDgzNDE2OC4xNzM4My5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":40006,"nextInTopic":40021,"prevInTime":40017,"nextInTime":40019,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"I m new to the group, but have been avidly reading this list and the Radical Unschooling site.  I see Sandra s phrase engaged and engaging; interested and","messageBody":"<div id=\"ygrps-yiv-294593727\">I&#39;m new to the group, but have been avidly reading this list and the Radical Unschooling <br/>\nsite.  I see Sandra&#39;s phrase &#39;engaged and engaging; interested and interesting&#39; as the day-<br/>\nto-day physical living out of the philosophical principles Pam mentioned:<br/>\n<br/>\n===(What is really interesting to me is that I just told people almost the<br/>\n===opposite the other day when I said that they need to focus on<br/>\n===understanding the basic reasons for and principles of unschooling -<br/>\n===that if they really grasp those, they won&#39;t have to decide whether or<br/>\n===not to unschool, they won&#39;t have to &quot;pick&quot; unschooling like they pick<br/>\n===a new curriculum, it will be the only thing that makes sense to do,<br/>\n===the only way they feel comfortable living.)<br/>\n<br/>\nAs my 2 daughters are still young (nearly 4 & 16 months), my approach to unschooling <br/>\nhas been from theory to practice.  A friend introduced me to the writing of John Holt and <br/>\nJohn Taylor Gatto, I then found Sandra&#39;s Radical Unschooling site, and have never looked <br/>\nback. I have started to condense all this reading into principles which I then use every day <br/>\nto make my behaviour more peaceful and loving and dynamic:<br/>\n<br/>\n- my kids learn from my example<br/>\n- my mothering instincts can be trusted<br/>\n- I am guided by my love for my children<br/>\n- unschooling is a continuum that can last a lifetime<br/>\n- hard work in the early years is repaid many times over<br/>\n- I am fallible just like everyone else but openness and reflection can help me not to repeat <br/>\nmistakes<br/>\n<br/>\nI think for unschooling to work there needs to be a unity of theory and practice - both a <br/>\nwell thought-out philosophical framework and an ability to bring those principles to bear <br/>\non a daily stream of ever-changing scenarios.  For this to be possible I think one of the <br/>\nmain things required is time - time to read, to mull over what you read, and then time <br/>\nduring the whirl of the day to take a breath, stop the controlling reactions and draw forth <br/>\nyour loving, patient, engaged and interesting self.  Each day, in little steps, I am doing this <br/>\nand already I can see that our home is more peaceful and our relationships more loving.<br/>\n<br/>\nThe hard work of unschooling comes not only from the day to day engagement with kids&#39; <br/>\nlearning, but also (and this may be too big a hurdle for some) because ultimately <br/>\nunschooling asks us to confront the question &#39;What kind of person am I?&#39;</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226227677","msgId":40006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzNDE2OC4xNzM4My5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":39995,"nextInTopic":40018,"prevInTime":40005,"nextInTime":40007,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... I spent a lot of yesterday playing on WoW. Linnaea was sitting next to me on this computer and Simon was on the couch on a different computer and David was","messageBody":"<div id=\"ygrps-yiv-2139709537\">I was thinking about it to and I couldn&#39;t have done it without information or curiousity or desire. The desire was actually from Simon and Linnaea or for Simon and Linnaea. We went to a friend of my step-dad&#39;s to see her wood stove that she used to bake bread. Simon and Linnaea loved her bread and I wanted to see if I could do something similar. I&#39;m not a big bread fan, but I love giving Simon and Linnaea things that make them smile.  Some of it may be what Jenny wrote: <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Always, what helps me, is to turn towards my kids, physically and<br/>\n&gt;mentally.  It is really that simple for me.  If my focus is on them<br/>\n&gt;instead of the whole host of other things I could be focusing on, I&#39;ve<br/>\n&gt;changed the dynamic.  I can still do other things once my focus has been<br/>\n&gt;directed toward them first, but if I do those things without my focus<br/>\n&gt;being first on my kids, then they end up not being in the equation. <br/>\n&gt;That alone is what allows me to be engaging with them, rather than<br/>\n&gt;seperate from them.<br/>\n<br/>\n </span></blockquote>I spent a lot of yesterday playing on WoW. Linnaea was sitting next to me on this computer and Simon was on the couch on a different computer and David was either in the study, outside working on the car, or in this room watching television. There wasn&#39;t a lot of engagement going on. However, I was working on getting Simon&#39;s main character up in levels and cash and would frequently tell  him where I was and what was going on. Linnaea played on Sims and then worked on her Meez and then on Toontown (which doesn&#39;t have as much available for non paying players as it did a year ago) with Simon and Linnaea and I talking about what she was doing. When they were littler I couldn&#39;t have done that. Simon and I used to sit and play games on the computer together, but Linnaea wanted motion and engagement and being and doing more. She still does. I be and do with them a lot. I enjoy the things I do, I like playing WoW, I like playing with the crocodile dentist with<br/>\n them or going roller skating or building decks to play Yugioh. Actually, there was a lot of engagement going on. There were conversations about the cats and the crocodile dentist was out so a game of risk was going regularly. Pickle was playing with his towel, which got lots of conversation and movement around him. Linnaea had a big decision to make about whether she wanted an energy drink at 7 at night. I gave her my opinion and Simon enticed her to stay up late with him. In the end she decided that she didn&#39;t want to not be able to go to sleep when she wanted to. She did stay up pretty late. I don&#39;t know when she came to bed, she still wants me to sleep with her, but she read in bed for a while before turning off the light when it began to disturb my sleep too much. <br/>\n<br/>\nUnschooling takes a near constant willingness to be interested in whatever is going on. It doesn&#39;t mean withholding judgement, but it may mean delaying it, giving something a go and not dismissing it out of hand. I really like that aspect of unschooling. I really like having &quot;willing to give it a go&quot; as part of my job description. <br/>\n<br/>\nSchuyler<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.waynforth.blogspot.com\">http://www.waynforth.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n----- Original Message ----<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Sunday, 9 November, 2008 12:04:12 AM<br/>\nSubject: Re: [AlwaysLearning] engaged and engaging; interested and interesting<br/>\n<br/>\n-=-It is possible. I&#39;ve done it, no package, no hand-me-over starter,  <br/>\nI set a little flour and water trap and in 7 days of coaxing and  <br/>\npaying attention I got a sourdough starter (http:// <br/>\nwaynforth.blogspot.com/2006/04/sourdough-starter-recipe.html).-=-<br/>\n<br/>\nRight, but you made starter.  You didn&#39;t make sourdough on day 1, but  <br/>\non day 7 or 8.<br/>\n<br/>\nPeople can&#39;t say &quot;I unschooled today and it didn&#39;t work.&quot;  It needs  <br/>\nto... get yeasty or something.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211613982,"authorName":"Margaret","from":"Margaret &lt;margaretz@...&gt;","profile":"margaretzat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226195170","msgId":39995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlmNzJkNzYyMDgxMTA4MTc0NnQyYjYwN2MzOGw5MTc4M2I2YzU2MWIwMmNAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDBCNjA2OUU0LUQyNzEtNDQxQi04NTAzLTBBQjc2NTZDQTdFOUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4JIDw5ZjcyZDc2MjA4MTEwODEzMTN2MTliYzM1Y2RtOGQxODUxZTdmMTJlN2RmMUBtYWlsLmdtYWlsLmNvbT4JIDwwQjYwNjlFNC1EMjcxLTQ0MUItODUwMy0wQUI3NjU2Q0E3RTlAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":39994,"nextInTopic":40006,"prevInTime":39994,"nextInTime":39996,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"Yes, that is what I meant :)  I have never tried playing video games while asleep.  I suppose you could play some sort game that was controlled by what you did","messageBody":"<div id=\"ygrps-yiv-1061599214\">Yes, that is what I meant :)  I have never tried playing video games<br/>\nwhile asleep.  I suppose you could play some sort game that was<br/>\ncontrolled by what you did in your sleep.  It could sort of like being<br/>\nin the Matrix, if you could do it right.<br/>\n<br/>\nSpeaking of games, my son (2) was playing Mario Kart on our Wii and he<br/>\nhad us captivated one morning with his playing and my husband looked<br/>\nat me and said something along the lines of &quot;and if he wants to write<br/>\na video game instead of going to swimming, he can.&quot;  His parents made<br/>\nhim go to hours of swim practice year round  (he wasn&#39;t allowed to<br/>\nquit until he went to college) and he couldn&#39;t spend very much time<br/>\nduring his summers writing video games with his best friend (DH is a<br/>\nprogrammer now, so they didn&#39;t permanently foil him).   I was really<br/>\nglad that he could see some of the good in unschooling.  I&#39;m the one<br/>\nwho reads these boards and he sometimes has doubts and frustrations<br/>\nabout the way I want us to do things.  It was really nice to see him<br/>\nbe so happy about unschooling and it&#39;s all because of video games :)<br/>\n<br/>\nI had a similar happy moment about my mom.  She found a video game<br/>\nthat she wanted to get my son a video game for Christmas and asked me<br/>\nif I thought that he would enjoy it.  I thought that was so cool.  Not<br/>\nmany grandmothers would buy a video game (a real one intended for fun<br/>\n- not an &quot;educational&quot; title) for a two year old.  It made my day.<br/>\n<br/>\nMargaret<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Nov 8, 2008 at 5:04 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&gt; -=-Trust<br/>\n&gt;<br/>\n&gt; that your kids won&#39;t turn into people who play video games during<br/>\n&gt; their waking hours, eat nothing but sugar, never sleep, etc. -=-<br/>\n&gt;<br/>\n&gt; I think you meant &quot;all their waking hours.&quot; My kids do play video<br/>\n&gt; games during their waking hours. &lt;g&gt; Kirby plays on his days off<br/>\n&gt; from working at a video game company.<br/>\n&gt;<br/>\n&gt; Sandra </span></blockquote></div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: engaged and engaging; interested and interesting","postDate":"1226193788","msgId":39994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNWUxcysybjUxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY3MTJDQjMwLTNCN0EtNDhDNS1CNURDLUM5QTlFNEFEMEE1QkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":39991,"nextInTopic":39995,"prevInTime":39993,"nextInTime":39995,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... documentarys ... the ... The movie we got turned out to be a dramatization of the discovery of King Tuts tomb and one about Belzoni and another about the","messageBody":"<div id=\"ygrps-yiv-300297457\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-In the last few weeks I<br/>\n&gt; rented some movies on netflix that I thought I would like. <br/>\n </span></blockquote>documentarys<br/>\n<blockquote><span title=\"ireply\"> &gt; about things I have always been interested in. -=-<br/>\n&gt; <br/>\n&gt; What about the movie &quot;The Ten Commandments,&quot; or things that are more  <br/>\n&gt; dramatic and not so &quot;documentary&quot;?  That movie might not interest <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; kids start to finish, but they might like some parts (or some parts  <br/>\n&gt; might be too scary for them, come to think of it...)<br/>\n <br/>\n<br/>\n </span></blockquote>The movie we got turned out to be a dramatization of the discovery of <br/>\nKing Tuts tomb and one about Belzoni and another about the Rosetta <br/>\nstone.  I didnt think my 7 year old would like it but he really did.  I <br/>\nrented the Disney version of Prince of Egypt the other day and  they <br/>\nliked it but I think I liked the Ten Commandments better.  It opened up <br/>\na whole nother set of questions like, &quot;why would God yell like that at <br/>\nhim?&quot;  He had a point.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226192693","msgId":39991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBCNjA2OUU0LUQyNzEtNDQxQi04NTAzLTBBQjc2NTZDQTdFOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDlmNzJkNzYyMDgxMTA4MTMxM3YxOWJjMzVjZG04ZDE4NTFlN2YxMmU3ZGYxQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4gPDlmNzJkNzYyMDgxMTA4MTMxM3YxOWJjMzVjZG04ZDE4NTFlN2YxMmU3ZGYxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39989,"nextInTopic":39994,"prevInTime":39990,"nextInTime":39992,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"-=-Trust that your kids won t turn into people who play video games during their waking hours, eat nothing but sugar, never sleep, etc. -=- I think you meant","messageBody":"<div id=\"ygrps-yiv-808903106\">-=-Trust<br/>\nthat your kids won&#39;t turn into people who play video games during<br/>\ntheir waking hours, eat nothing but sugar, never sleep, etc. -=-<br/>\n<br/>\nI think you meant &quot;all their waking hours.&quot;  My kids do play video  <br/>\ngames during their waking hours. &lt;g&gt;  Kirby plays on his days off  <br/>\nfrom working at a video game company.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: engaged and engaging; interested and interesting","postDate":"1226192623","msgId":39989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3MTJDQjMwLTNCN0EtNDhDNS1CNURDLUM5QTlFNEFEMEE1QkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmNWJubitsY2FoQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmNWJubitsY2FoQGVHcm91cHMuY29tPg=="},"prevInTopic":39988,"nextInTopic":39991,"prevInTime":39988,"nextInTime":39990,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"-=-In the last few weeks I rented some movies on netflix that I thought I would like. documentarys about things I have always been interested in. -=- What","messageBody":"<div id=\"ygrps-yiv-769732439\">-=-In the last few weeks I<br/>\nrented some movies on netflix that I thought I would like. documentarys<br/>\nabout things I have always been interested in. -=-<br/>\n<br/>\nWhat about the movie &quot;The Ten Commandments,&quot; or things that are more  <br/>\ndramatic and not so &quot;documentary&quot;?  That movie might not interest the  <br/>\nkids start to finish, but they might like some parts (or some parts  <br/>\nmight be too scary for them, come to think of it...)<br/>\n<br/>\n<br/>\n<br/>\nMaybe some parts of these would be fun (or maybe you&#39;ve already found  <br/>\nthem):<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ancientegypt.co.uk/menu.html\">http://www.ancientegypt.co.uk/menu.html</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.touregypt.net/Kids/\">http://www.touregypt.net/Kids/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.woodlands-junior.kent.sch.uk/Homework/Egypt.html\">http://www.woodlands-junior.kent.sch.uk/Homework/Egypt.html</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-=-I guess I am saying that as I feel myself genuinely interested in  <br/>\nmore things they seem to be waking up too. As I take more interest in  <br/>\ntheir interests, I see them light up. It takes time, or it has for  <br/>\nus, but it is happening. -=-<br/>\n<br/>\n<br/>\n<br/>\nVery cool.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":228015734,"authorName":"m_aduhene","from":"&quot;m_aduhene&quot; &lt;anthony@...&gt;","profile":"m_aduhene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: engaged and engaging; interested and interesting","postDate":"1226192230","msgId":39988,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNWNoNitia29nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlmNzJkNzYyMDgxMTA4MTMxM3YxOWJjMzVjZG04ZDE4NTFlN2YxMmU3ZGYxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":39986,"nextInTopic":39989,"prevInTime":39987,"nextInTime":39989,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"Hi, I would not have had a name for what I do instinctively on a day-to-day basis until I found these sites and thought hey there r people like me out there","messageBody":"<div id=\"ygrps-yiv-271778553\">Hi,<br/>\nI would not have had a name for what I do instinctively on a<br/>\nday-to-day basis until I found these sites and thought &quot;hey there r<br/>\npeople like me out there&quot;  :-).  People who just enjoy being with<br/>\ntheir children and just accept them as other people in the family, and<br/>\nnot as objects to be ordered, directed and patronised.  I think<br/>\naccepting that I am not perfect and am still discovering things about<br/>\nmyself and the world, (a lot of which I am understanding through the<br/>\neyes of my children), has also helped a great deal becos it takes away<br/>\nthe compulsion to see yourself as the authority.  I have been truly<br/>\nastounded at times by the logic and reasoning that flow from the<br/>\nmouths of my dd 7 and my ds 4.  We by no means have perfect days, as<br/>\nanother poster stated, and there are times when I am grumpy and tired<br/>\nand not my best.  There are times too when my children feel the same<br/>\nway. I alwys try to apologise if I have reacated in a certain way due<br/>\nto my feelings on those days and try to understand their reasons for<br/>\ntheir reactions on their &quot;off days&quot;.  I think the process of<br/>\nunschooling is about growing together and establishing a relationship<br/>\nwith your children that sincerely tries to help them become everything<br/>\nthey have the potential to become, and then being there to pick up the<br/>\npieces and restore them when life doesn&#39;t turn out how they expect it too.<br/>\nI have unsure days, but am beginning to realise it is only when I<br/>\nbegin to compare with others (usually not of an unschooling ilk,<br/>\nusually the more structured home-schoolers).<br/>\nMy dd will never be a jump thru hoops kind of girl and I am beginning<br/>\nto see that the way she is being able to interact with her world<br/>\nallows her to pick and choose how she wants to progress and develop. <br/>\nMy ds is a sensitive little chap who had severe excema as a baby.  He<br/>\nis over-whelmed easily and I could not imagine him at this time of  <br/>\nhis life coping with a roomful of other 4 year olds and not being<br/>\nlabelled as uncoperative and disruptive.  Here at home he can go to<br/>\nthe supermarket with his dad at 8pm at night, watch a fish being<br/>\ngutted (his request), bring it home, give it a name and just sit and<br/>\nstroke it.  Have a discussion about fish and how he wouldn&#39;t be able<br/>\nto swim in the water now, and then the next day cut open the fish and<br/>\nexamine it&#39;s back bone, tail and the intracacies(sp?) of its&#39; gills.<br/>\nUnschooling for me just sums up life and all it&#39;s fun and sorrows, <br/>\njoys and downfalls, kisses and hugs,  chickens in the garden, sleeping<br/>\nbabies at 9am on a Monday morning when everyone else is rushing to<br/>\nwork, and running naked in the garden (the children not me) on a hot,<br/>\nsunny day without a care in the world when most of the rest of the<br/>\ncity&#39;s children will be sweating at their desks.<br/>\nGosh.....I&#39;ve just reassured myself in a big way what this life means<br/>\nfor me and what a life it means to my children.<br/>\nblessings<br/>\nmichelle</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: engaged and engaging; interested and interesting","postDate":"1226191415","msgId":39986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNWJubitsY2FoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM4N0ZCRjU3LTYwNjYtNDQ5QS1CRUZDLUIyOTlERkQzQkE5M0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":39985,"nextInTopic":39988,"prevInTime":39985,"nextInTime":39987,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":". ... supposee, you ll become one? Ask yourself, What would I do if I WAS ... Our kids are still young (3 to 7) and even though my two school age kids have","messageBody":"<div id=\"ygrps-yiv-21944272\">.<br/>\n<blockquote><span title=\"ireply\"> &gt; Pretend to be an interesting and engaging person for a while - and,<br/>\n&gt; over tim--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd <br/>\n </span></blockquote>&lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-That&#39;s when the answer is to fake it until you make it, I <br/>\n </span></blockquote>supposee, you&#39;ll become one? Ask yourself, &quot;What would I do if I WAS<br/>\n<blockquote><span title=\"ireply\"> &gt; an interesting and engaging person?&quot; Then do that. It&#39;ll become easier<br/>\n&gt; and more natural.-=-<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>Our kids are still young (3 to 7) and even though my two school age <br/>\nkids have never been to school or we have never used a curriculum I <br/>\nstill approached things with a school mentality to some degree.  For <br/>\nthe past several months I have let go of alot.  I have tried to think <br/>\nalot about why we do this or that and honestly I dont feel our lives <br/>\nhave been all that interesting or engaging.  But over time I have felt <br/>\nmyself become interested in things again.  In the last few weeks I <br/>\nrented some movies on netflix that I thought I would like. documentarys <br/>\nabout things I have always been interested in.  I love history but have <br/>\nspent so little time pursuing it.  Anyway, my 7 year old sat and <br/>\nwatched one of them about Explorers in Egypt with me.  He was <br/>\nfacinated.  When we went to the library I found a couple books on <br/>\nEgypt.  Yesterday my 5 year old was asking me about Egyptian writing <br/>\nand my 7 year old started telling him about them.  We found a chart in <br/>\none of the books and they wanted to write their name on a clay tablet <br/>\nso we used playdo.  Today my 7 year old wanted some popcorn and I was <br/>\ntrying to get a few bills done and had asked him to wait a few minutes <br/>\nwhile I finished and he came in with a note he had written me in <br/>\nhierogriphics (telling me how hungry he was).  We also came across an <br/>\nEgytian board game in one of the books and they wanted to play it.  I <br/>\nguess I am saying that as I feel myself genuinely interested in more <br/>\nthings they seem to be waking up too.  As I take more interest in their <br/>\ninterests, I see them light up.  It takes time, or it has for us, but <br/>\nit is happening.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: engaged and engaging; interested and interesting","postDate":"1226189238","msgId":39985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxQkY1Njc2LTg4RUMtNEU0NC1CODYxLTU3MDg1OTMyMjE4NEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmNHRtais0b2lzQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmNHRtais0b2lzQGVHcm91cHMuY29tPg=="},"prevInTopic":39984,"nextInTopic":39986,"prevInTime":39984,"nextInTime":39986,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"-=-I can still do other things once my focus has been directed toward them first, but if I do those things without my focus being first on my kids, then they","messageBody":"<div id=\"ygrps-yiv-1715919581\">-=-I can still do other things once my focus has been<br/>\ndirected toward them first, but if I do those things without my focus<br/>\nbeing first on my kids, then they end up not being in the equation.<br/>\nThat alone is what allows me to be engaging with them, rather than<br/>\nseperate from them.<br/>\n<br/>\n-=-I&#39;m having a hard time puting that in words.-=-<br/>\n<br/>\n<br/>\n<br/>\nI think we&#39;re talking about something people have never talked about  <br/>\nbefore.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226189052","msgId":39984,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU4MTA0OTVCLTVFQUMtNEQ1OC04MEM0LTBBOEI3M0UzRDVDNUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQyNTU2LjE2OTI1LnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PDQyNTU2LjE2OTI1LnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":39978,"nextInTopic":39985,"prevInTime":39983,"nextInTime":39985,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"-=-It is possible. I ve done it, no package, no hand-me-over starter, I set a little flour and water trap and in 7 days of coaxing and paying attention I got a","messageBody":"<div id=\"ygrps-yiv-1977343973\">-=-It is possible. I&#39;ve done it, no package, no hand-me-over starter,  <br/>\nI set a little flour and water trap and in 7 days of coaxing and  <br/>\npaying attention I got a sourdough starter (http:// <br/>\nwaynforth.blogspot.com/2006/04/sourdough-starter-recipe.html).-=-<br/>\n<br/>\nRight, but you made starter.  You didn&#39;t make sourdough on day 1, but  <br/>\non day 7 or 8.<br/>\n<br/>\nPeople can&#39;t say &quot;I unschooled today and it didn&#39;t work.&quot;  It needs  <br/>\nto... get yeasty or something.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321729783,"authorName":"Angela Shaw","from":"&quot;Angela Shaw&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: engaged and engaging; interested and interesting","postDate":"1226184179","msgId":39976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwODY0RDYxQ0RFNjQ5QkRCNDUzNkMzMzQwMTlFRUNBQEVib255Pg==","inReplyToHeader":"PGdmNHRtais0b2lzQGVHcm91cHMuY29tPg=="},"prevInTopic":39975,"nextInTopic":39978,"prevInTime":39975,"nextInTime":39977,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":" I think","messageBody":"<div id=\"ygrps-yiv-1161068888\">&lt;Yes, that&#39;s always been an interesting question, why someone who<br/>\nbelieves in something and can talk the talk, but won&#39;t actually walk the<br/>\nwalk. &gt;<br/>\n<br/>\nI think people can believe it on an intellectual level but still not be able<br/>\nto do it out of fear of what other people will think of their kids if they<br/>\ndon&#39;t appear to be on par with or ahead of their peers.  A<br/>\n<br/>\nAngela<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"e: [AlwaysLearning] Re: engaged and engaging; interested and interesting","postDate":"1226182111","msgId":39975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ1OEEzQUJEOTRGRTQ3QjhCQ0MxRUFFRTQzMDM2NUQwQExZTEFMQVAyPg==","inReplyToHeader":"PDg4NTFBRkEwLTgyMDQtNDdDQS1CMjA2LTUwNDc1QkMwMDlGOUBtYWMuY29tPg==","referencesHeader":"PGdmNHRtais0b2lzQGVHcm91cHMuY29tPiA8ODg1MUFGQTAtODIwNC00N0NBLUIyMDYtNTA0NzVCQzAwOUY5QG1hYy5jb20+"},"prevInTopic":39974,"nextInTopic":39976,"prevInTime":39974,"nextInTime":39976,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... From: Pamela Sorooshian To: AlwaysLearning@yahoogroups.com Sent: Saturday, November 08, 2008 2:05 PM Subject: [SPAM]Re: [AlwaysLearning] Re: engaged and","messageBody":"<div id=\"ygrps-yiv-2135460630\"><blockquote><span title=\"qreply\">----- Original Message ----- <br/>\n  From: Pamela Sorooshian <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Saturday, November 08, 2008 2:05 PM<br/>\n  Subject: [SPAM]Re: [AlwaysLearning] Re: engaged and engaging; interested and interesting<br/>\n<br/>\n<br/>\n  &gt;&gt;<br/>\n  That reminded me of something I learned about getting along with my <br/>\n  teenagers. It seems pretty easy for teenagers and their parents to <br/>\n  become adversarial - I see why, but I managed to almost totally avoid <br/>\n  it (I mean, we had our moments, but they were moments and far and few <br/>\n  between). One &quot;trick&quot; i used was that when I started to have any <br/>\n  feeling that we were sort of &quot;facing off&quot; - I would physically change <br/>\n  my position to be next to my kid, not face-to-face. I can&#39;t express <br/>\n  how much that physical move could mean - it often seemed to melt <br/>\n  antagonism almost instantly. While I maneuvered into a position beside <br/>\n  my kid, facing the same direction, I&#39;d think to myself, &quot;We are on the <br/>\n  same team. We&#39;re partners. We are NOT adversaries.&quot; I&#39;ve since then <br/>\n  automatically done the same thing with lots of other people - work <br/>\n  people, my husband, my extended family, students.&gt;&gt;<br/>\n  . wow, that is really powerful.  i have seen how i have done something similar recently with my teen and it really does change things - both within me and between us.  thanks for putting it into words.<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: engaged and engaging; interested and interesting","postDate":"1226181940","msgId":39974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4NTFBRkEwLTgyMDQtNDdDQS1CMjA2LTUwNDc1QkMwMDlGOUBtYWMuY29tPg==","inReplyToHeader":"PGdmNHRtais0b2lzQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmNHRtais0b2lzQGVHcm91cHMuY29tPg=="},"prevInTopic":39972,"nextInTopic":39975,"prevInTime":39973,"nextInTime":39975,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... That reminded me of something I learned about getting along with my teenagers. It seems pretty easy for teenagers and their parents to become adversarial -","messageBody":"<div id=\"ygrps-yiv-542780648\">On Nov 8, 2008, at 12:44 PM, Jenny C wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Always, what helps me, is to turn towards my kids, physically and<br/>\n&gt; mentally.  It is really that simple for me.  If my focus is on them<br/>\n&gt; instead of the whole host of other things I could be focusing on, I&#39;ve<br/>\n&gt; changed the dynamic.  I can still do other things once my focus has  <br/>\n&gt; been<br/>\n&gt; directed toward them first, but if I do those things without my focus<br/>\n&gt; being first on my kids, then they end up not being in the equation.<br/>\n&gt; That alone is what allows me to be engaging with them, rather than<br/>\n&gt; seperate from them.<br/>\n&gt;<br/>\n&gt; I&#39;m having a hard time puting that in words.<br/>\n<br/>\n </span></blockquote>That reminded me of something I learned about getting along with my  <br/>\nteenagers. It seems pretty easy for teenagers and their parents to  <br/>\nbecome adversarial - I see why, but I managed to almost totally avoid  <br/>\nit (I mean, we had our moments, but they were moments and far and few  <br/>\nbetween). One &quot;trick&quot; i used was that when I started to have any  <br/>\nfeeling that we were sort of &quot;facing off&quot; - I would physically change  <br/>\nmy position to be next to my kid, not face-to-face. I can&#39;t express  <br/>\nhow much that physical move could mean - it often seemed to melt  <br/>\nantagonism almost instantly. While I maneuvered into a position beside  <br/>\nmy kid, facing the same direction, I&#39;d think to myself, &quot;We are on the  <br/>\nsame team. We&#39;re partners. We are NOT adversaries.&quot; I&#39;ve since then  <br/>\nautomatically done the same thing with lots of other people - work  <br/>\npeople, my husband, my extended family, students.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":211613982,"authorName":"Margaret","from":"Margaret &lt;margaretz@...&gt;","profile":"margaretzat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226178795","msgId":39972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlmNzJkNzYyMDgxMTA4MTMxM3YxOWJjMzVjZG04ZDE4NTFlN2YxMmU3ZGYxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":39970,"nextInTopic":39974,"prevInTime":39971,"nextInTime":39973,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"I was thinking about your post and Pam s post, and here is what bubbled up for me.  It doesn t directly address the questions posed, but I think it is relevant","messageBody":"<div id=\"ygrps-yiv-863031108\">I was thinking about your post and Pam&#39;s post, and here is what<br/>\nbubbled up for me.  It doesn&#39;t directly address the questions posed,<br/>\nbut I think it is relevant nonetheless.<br/>\n<br/>\nThere are a lot of questions for which the answer is TRUST.  Trust<br/>\nthat your kids won&#39;t turn into people who play video games during<br/>\ntheir waking hours, eat nothing but sugar, never sleep, etc.  There is<br/>\na lot of encouragement to trust.<br/>\n<br/>\nWhich is good.<br/>\n<br/>\nSort of.<br/>\n<br/>\nThe trouble is that it can be misunderstood and turned into an excuse<br/>\nfor laziness.  I have seen posts on this list and others where people<br/>\nthink that unschooling isn&#39;t work.  They think that they can set up<br/>\nthis environment and the kids will just go.  My kids are younger (5<br/>\nand 2) so there are a lot of things that they need me to help with<br/>\nthat they may do on their own later (look things up, reserve books at<br/>\nthe library, read :).<br/>\n<br/>\nIn my house, I can tell when I am doing a good job and when I am not<br/>\ndoing such a great job.  When I am stressed, haven&#39;t had enough sleep,<br/>\nor I am feeling down, I find that don&#39;t do as good of a job and things<br/>\naren&#39;t as sparkly.  When I am doing a great job following up on<br/>\ninterests, thinking of new things that my kids would like, being very<br/>\nengaged etc. the difference in what the kids are doing and learning is<br/>\nvisible. It&#39;s wonderful and  sparkly.  It isn&#39;t that way all the time,<br/>\nand it isn&#39;t the kids, it is me.  I am trying to work on being<br/>\nengaged, interested, and in inspiring even when I am feeling that way,<br/>\nbut it is something that takes effort.<br/>\n<br/>\nI wonder if the fact that so much of the discussion is about trust and<br/>\nbeing respectful that the other HUGE part of it seems to be overlooked<br/>\nby people new to unschooling.  So perhaps in the discussions about<br/>\ntrust, a reminder of the work is important too.  It&#39;s happy work, in<br/>\nmy mind... but there is a LOT for the parents to do.<br/>\n<br/>\nThis is something the mother of a five year old who was trying to<br/>\nunschool said &quot;I wish I could find a way everyone could have their<br/>\nneeds met and coexist peacefully without me always having to be the<br/>\ncatalyst. &quot;  This is another bit from this list &quot;One motivation for<br/>\nmaking a change [to unschooling] is that I&#39;m slowing down because I&#39;m<br/>\naging. I turn 62 in December [snip] I love parenting. I&#39;ve loved<br/>\nhomeschooling. But I&#39;m tired.&quot;<br/>\n<br/>\nTrusting does seem to be hard for a lot of people and I&#39;m sure that<br/>\nit&#39;s why it comes up so often.... but somehow the work involved in<br/>\nunschooling seems to get overlooked.  Yes, links to the strewing site<br/>\nare posted regularly, but I think that sometimes that part of it seems<br/>\nsmall (in terms of what is discussed) and I think that it is easy to<br/>\nthink that it&#39;s less work than it really is.<br/>\n<br/>\nIt isn&#39;t just unschooling lists... people that I know in real life<br/>\n(who aren&#39;t unschoolers) think that unschooling is the mom doing<br/>\nnothing.  It is dead wrong, but that idea is out there.<br/>\n<br/>\nHonestly, it seems strange to me when people think that unschooling is<br/>\nless work.  I think that it would be soooooo much easier to send kids<br/>\nto school or to do curriculum out of a box.  I don&#39;t unschool because<br/>\nit&#39;s easy, I unschool because it can be sparkly and wonderful and it<br/>\nis worth the work.<br/>\n<br/>\nMargaret<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Nov 8, 2008 at 5:14 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&gt; I woke up with these two phrases in my head.<br/>\n&gt;<br/>\n&gt; Unschooling requires that a parent be engaged and engaging.<br/>\n&gt; Unschooling requires that a parent be interested and interesting.<br/>\n&gt;<br/>\n&gt; Probably half the people here figured that out somewhat on their own,<br/>\n&gt; or from similar statements made by Pam or Joyce or Deb or someone<br/>\n&gt; when they describe what unschoolers DO and not just what they don&#39;t do.<br/>\n&gt;<br/>\n&gt; It ties some things together for me, though, that have been clear in<br/>\n&gt; my head but less clear in explanation, maybe.<br/>\n&gt;<br/>\n&gt; For years I&#39;ve said &quot;not everyone can unschool,&quot; and people have<br/>\n&gt; asked &quot;like who?&quot; and I&#39;ve said some people are too cynical and<br/>\n&gt; unwilling to change.<br/>\n&gt;<br/>\n&gt; So here, I think, is where the cynicism and pessimism have hooked up<br/>\n&gt; to my other concepts. A person who is negative and unsure things<br/>\n&gt; will work (or worse, expresses a belief that things will NOT work)<br/>\n&gt; needs to change that before unschooling can thrive.<br/>\n&gt;<br/>\n&gt; There is unschooling that barely qualifies, that would maybe pass a<br/>\n&gt; test or that someone else would nervously or grudgingly say &quot;Yeah,<br/>\n&gt; that&#39;s unschooling...&quot; maybe thinking &quot;except...&quot; or maybe saying<br/>\n&gt; &quot;but you should get them out more&quot; or &quot;but you need to hang out with<br/>\n&gt; them and really pay attention to them.&quot; Then there is unschooling<br/>\n&gt; that is undoubtedly alive with its own propulsive intensity and joy.<br/>\n&gt; There is unschooling that has momentum and flow.<br/>\n&gt;<br/>\n&gt; That&#39;s what I was trying to describe in August, on this list, when I<br/>\n&gt; wrote the response below<br/>\n&gt; ******************<br/>\n&gt; &lt;&lt; I can&#39;t figure out how unschoolers do these things if they don&#39;t plan<br/>\n&gt; to do them or structure the day so there is a time to do them.&gt;&gt;<br/>\n&gt;<br/>\n&gt; Maybe it&#39;s like priming a hand-pump (another air pressure/water<br/>\n&gt; situation)--the first pump gets nothing. The second usually gets<br/>\n&gt; nothing.<br/>\n&gt; Once the water&#39;s in the pipe, though, every touch on the pump handle<br/>\n&gt; brings<br/>\n&gt; water.<br/>\n&gt;<br/>\n&gt; Or like sourdough bread. Once you have the starter and you keep paying<br/>\n&gt; attention enough to make more bread every once in a while, &quot;It&#39;s<br/>\n&gt; easy.&quot; But<br/>\n&gt; for those with no starter, it&#39;s not just not easy, it&#39;s not possible.<br/>\n&gt; (That&#39;s theory. There&#39;s sourdough breadmix now that has the sourdough in<br/>\n&gt; some kind of powdered and encapsulated form.)<br/>\n&gt; **********************<br/>\n&gt;<br/>\n&gt; It can be hard to get it started, because it takes new kinds of<br/>\n&gt; effort and learning and attention on the parents&#39; part. But if it<br/>\n&gt; DOES get started, it will be self-sustaining for short bursts and<br/>\n&gt; then longer periods, and eventually the parent(s) can figure out how<br/>\n&gt; to do it with less effort. But if they never do the work to learn<br/>\n&gt; how it works and then get it started, it would be like buying a hand<br/>\n&gt; pump and leaving it in the box and continuing to ask how it&#39;s<br/>\n&gt; supposed to get water out of the ground, or like getting bread<br/>\n&gt; starter and never even trying to make any bread.<br/>\n&gt;<br/>\n&gt; Yet unschooling is easier than hooking up a water pump or than making<br/>\n&gt; sourdough.<br/>\n&gt;<br/>\n&gt; People have this list and others; my website and Joyce&#39;s and others;<br/>\n&gt; my book and Rue&#39;s and others. Being in proximity to those things<br/>\n&gt; doesn&#39;t help, though. What helps is being interested enough to take<br/>\n&gt; the ideas and use them until you start to understand them, and then<br/>\n&gt; replace your old reactions and beliefs with the ideas that will turn<br/>\n&gt; you into an unschooler. Being on a list with other unschoolers<br/>\n&gt; isn&#39;t enough. It won&#39;t happen by osmosis or reflection.<br/>\n&gt;<br/>\n&gt; I think now that when people come here and want to be unschooled<br/>\n&gt; themselves, they want me to treat them like I treat my children, that<br/>\n&gt; they want to have water come out of their pump just because I say I<br/>\n&gt; have a pump. They want to eat homemade bread at their house for<br/>\n&gt; having read about other people&#39;s sourdough bread.<br/>\n&gt;<br/>\n&gt; Reading helps. Thinking helps. Questions and dialog and discussion<br/>\n&gt; can help, but they can&#39;t create unschooling at anyone&#39;s house. The<br/>\n&gt; parent must find ways to be engaged and engaging; interested and<br/>\n&gt; interesting; inspired and inspiring.<br/>\n&gt;<br/>\n&gt; Sandra </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226177057","msgId":39970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4MzU3My41MTI0NS5xbUB3ZWI4NjIwNy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":39969,"nextInTopic":39972,"prevInTime":39969,"nextInTime":39971,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... A friend came over on Wednesday, after the election results were in and she was bummed, not by the election, but by the response that she had gotten from","messageBody":"<div id=\"ygrps-yiv-929818907\">----------------snip---------------<br/>\n<blockquote><span title=\"ireply\"> &gt;So here, I think, is where the cynicism and pessimism have hooked up  <br/>\n&gt;to my other concepts.   A person who is negative and unsure things  <br/>\n&gt;will work (or worse, expresses a belief that things will NOT work)  <br/>\n&gt;needs to change that before unschooling can thrive.<br/>\n </span></blockquote>-----------snip--------------<br/>\n<br/>\nA friend came over on Wednesday, after the election results were in and she was bummed, not by the election, but by the response that she had gotten from other people when she&#39;d started a conversation about the U.S. election. This morning I was thinking about that cynicism, the cynicism with which her excitement had been met by the Brits she wanted to share with. Maybe part of it is simply that it doesn&#39;t touch that deeply into the British public, they aren&#39;t engaged by the election, even though U.S. politics have deeply affected Britain the entire time I&#39;ve lived here, and I&#39;m sure it has been doing so for a long, long time. Part of it is trying to be funny and smart. I know the person who most disappointed her with his response and he likes to be detached from most things. Cool is important, and cool = cynical from his perspective. Part of it may be that the U.S. system of electing a president may in and of itself produce an excitement that having a<br/>\n prime minister doesn&#39;t do. You don&#39;t elect the prime minister, and, while technically you don&#39;t elect the president, it certainly feels like a greater degree of separation than the U.S. system has. <br/>\n<br/>\nElections are exciting to me. I have such optimism in each and every election I&#39;ve watched. When I was a child we had election parties at our house. My dad ran for a few elections and so there was that level of excitment, that sense that change is possible that infused my relationship with elections. Nobody there was cynical. Nobody thought that it didn&#39;t matter who made it to the City Council or the Water board, or which new by-law was passed. There was a real sense that politics could change their world, my world, everybody&#39;s world. And they owned that changed, they walked the miles, they made the fliers, they shook the hands and they researched the routes of change. <br/>\n<br/>\nIt is different here. I can&#39;t vote, I&#39;m not a citizen. I could change that. I could still get involved with things, even without voting. Instead of putting my time into changing the political world however, I&#39;ve volunteered my time to the unschooling world. It has changed my life, and I get really excited about the process and the ideas and the little things that make a difference in mine and Simon&#39;s and Linnaea&#39;s and David&#39;s lives. I get excited, too, when I see that change happening in other people&#39;s lives. It can make it hard when somebody seems to want change, but only in theory. <br/>\n<br/>\nI don&#39;t know if that is clear. I don&#39;t know if that is really what I wanted to say. But Linnaea wants to update her Meez and I&#39;m working on getting Simon&#39;s character on WoW up a few levels before the expansion pack comes out. <br/>\n<br/>\nSchuyler<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.waynforth.blogspot.com\">http://www.waynforth.blogspot.com</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: engaged and engaging; interested and interesting","postDate":"1226177043","msgId":39969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNHRtais0b2lzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNCNDkwMUEwLTBDOTctNDkwQi1CM0E3LTQzQzcxRjFENkQwNUBtYWMuY29tPg=="},"prevInTopic":39968,"nextInTopic":39970,"prevInTime":39968,"nextInTime":39970,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... I don t see them as being opposites, but different angles of the same thing.  You can t absorb unschooling through osmosis or reflection, but you can take","messageBody":"<div id=\"ygrps-yiv-1383257572\"><blockquote><span title=\"ireply\">&gt;Being on a list with other unschoolers<br/>\n&gt; isn&#39;t enough. It won&#39;t happen by osmosis or reflection.&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; What is really interesting to me is that I just told people almost the<br/>\n&gt; opposite the other day when I said that they need to focus on<br/>\n&gt; understanding the basic reasons for and principles of unschooling -<br/>\n&gt; that if they really grasp those, they won&#39;t have to decide whether or<br/>\n&gt; not to unschool, they won&#39;t have to &quot;pick&quot; unschooling like they pick<br/>\n&gt; a new curriculum, it will be the only thing that makes sense to do,<br/>\n&gt; the only way they feel comfortable living.<br/>\n&gt;<br/>\n&gt; So - I&#39;m trying to figure out how to reconcile Sandra&#39;s point and mine<br/>\n&gt; - or are they reconcilable?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t see them as being opposites, but different angles of the same<br/>\nthing.  You can&#39;t absorb unschooling through osmosis or reflection, but<br/>\nyou can take those ideas to heart and once you really get them, you can<br/>\nlive them.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So - it would be interesting to me to think about why people who seem<br/>\n&gt; to understand unschooling and believe in its principles, still don&#39;t<br/>\n&gt; do it. I think that is what Sandra is addressing.<br/>\n<br/>\n </span></blockquote>Yes, that&#39;s always been an interesting question, why someone who<br/>\nbelieves in something and can talk the talk, but won&#39;t actually walk the<br/>\nwalk.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also,<br/>\n&gt; people who are very risk-averse, conformist, or fearful could<br/>\n&gt; intellectually and even emotionally &quot;get it&quot;, but have trouble acting<br/>\n&gt; on their own beliefs.<br/>\n<br/>\n </span></blockquote>I think this happens a lot!  I&#39;ve always been a bit of a non-conformist,<br/>\nso not conforming to school think felt pretty natural.  Not everyone has<br/>\nor wants to be a non-conformist, so going against mainstream culture<br/>\nfeels extremely daunting.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; That&#39;s when the answer is to fake it until you make it, I suppose.<br/>\n&gt; Pretend to be an interesting and engaging person for a while - and,<br/>\n&gt; over time, you&#39;ll become one? Ask yourself, &quot;What would I do if I WAS<br/>\n&gt; an interesting and engaging person?&quot; Then do that. It&#39;ll become easier<br/>\n&gt; and more natural.<br/>\n<br/>\n<br/>\n </span></blockquote>Always, what helps me, is to turn towards my kids, physically and<br/>\nmentally.  It is really that simple for me.  If my focus is on them<br/>\ninstead of the whole host of other things I could be focusing on, I&#39;ve<br/>\nchanged the dynamic.  I can still do other things once my focus has been<br/>\ndirected toward them first, but if I do those things without my focus<br/>\nbeing first on my kids, then they end up not being in the equation. <br/>\nThat alone is what allows me to be engaging with them, rather than<br/>\nseperate from them.<br/>\n<br/>\nI&#39;m having a hard time puting that in words.</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226175639","msgId":39978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyMjgxMy4zNjAwMS5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDM4N0ZCRjU3LTYwNjYtNDQ5QS1CRUZDLUIyOTlERkQzQkE5M0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":39976,"nextInTopic":39984,"prevInTime":39977,"nextInTime":39979,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... -=-That s when the answer is to fake it until you make it, I suppose. Pretend to be an interesting and engaging person for a while - and, over time, you ll","messageBody":"<div id=\"ygrps-yiv-87730214\"><blockquote><span title=\"qreply\">--- On Sat, 11/8/08, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n            -=-That&#39;s when the answer is to fake it until you make it, I suppose.<br/>\n<br/>\nPretend to be an interesting and engaging person for a while - and,<br/>\n<br/>\nover time, you&#39;ll become one? Ask yourself, &quot;What would I do if I WAS<br/>\n<br/>\nan interesting and engaging person?&quot; Then do that. It&#39;ll become easier<br/>\n<br/>\nand more natural.-=-<br/>\n<br/>\n<br/>\n<br/>\nI think that works for courtesy and peace, too.  &quot;What would a  <br/>\n<br/>\nconsiderate person do?&quot;<br/>\n<br/>\n<br/>\n<br/>\n***That reminds me of the book The Wizard of Oz.  The tinman has to be extra considerate of others because he does not have a heart and the scarecrow must think extra hard because he does not have a brain and the lion has to be extra brave because he has no courage.  The wizard of course only pretend to give the travelers these things.  <br/>\n<br/>\nAmandaEli 7, Samuel 6<br/>\n <br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226175472","msgId":39968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyNTU2LjE2OTI1LnFtQHdlYjg2MjAxLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":39967,"nextInTopic":39969,"prevInTime":39967,"nextInTime":39969,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... Or like sourdough bread. Once you have the starter and you keep paying attention enough to make more bread every once in a while, It s easy. But for","messageBody":"<div id=\"ygrps-yiv-594266256\">--------snip----------<br/>\nOr like sourdough bread. Once you have the starter and you keep paying<br/>\nattention enough to make more bread every once in a while, &quot;It&#39;s  <br/>\neasy.&quot; But<br/>\nfor those with no starter, it&#39;s not just not easy, it&#39;s not possible.<br/>\n(That&#39;s theory. There&#39;s sourdough breadmix now that has the sourdough in<br/>\nsome kind of powdered and encapsulated form.)<br/>\n<br/>\n----------snip-----------<br/>\n<br/>\n<br/>\nSee, I got stuck here. It is possible. I&#39;ve done it, no package, no hand-me-over starter, I set a little flour and water trap and in 7 days of coaxing and paying attention I got a sourdough starter (<a rel=\"nofollow\" target=\"_blank\" href=\"http://waynforth.blogspot.com/2006/04/sourdough-starter-recipe.html)\">http://waynforth.blogspot.com/2006/04/sourdough-starter-recipe.html)</a>. I&#39;ve had it for 3 years now. I feed it regularly, I use it regularly, the population lives in my fridge. The flavor has changed as we&#39;ve moved from place to place. There are different yeast in different places. If you buy a San Francisco sourdough starter pack it will change with time to a local yeast population, unless you keep them in a hermetically sealed environment with filtered air...<br/>\n<br/>\nI know it&#39;s a technicality, but sourdough is possible to create even without the starter. As long as you give yourself the week run up...<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226174283","msgId":39967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFMDI5Q0Y5RUMxNTQ4NTc5ODY2RkRFNTNGRDQzQzJCQExZTEFMQVAyPg==","inReplyToHeader":"PEYxRDZFNzNFLTlFN0YtNEQ0Qy1BMjkxLTM0RUMyQzBGOTAyMUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4gPDNCNDkwMUEwLTBDOTctNDkwQi1CM0E3LTQzQzcxRjFENkQwNUBtYWMuY29tPiA8NkQzQUM1Rjc3NURENDc3REE3NDFBNDc5MjQ4MDI4MEFATFlMQUxBUDI+IDxGMUQ2RTczRS05RTdGLTRENEMtQTI5MS0zNEVDMkMwRjkwMjFAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":39965,"nextInTopic":39968,"prevInTime":39966,"nextInTime":39968,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... That will cancel out unschooling, though, especially if it s a real summer break (the kids just got out of school, or just finished a school-at-home","messageBody":"<div id=\"ygrps-yiv-1673535701\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;<br/>\n </span></blockquote>  That will cancel out unschooling, though, especially if it&#39;s a real <br/>\n  summer break (the kids just got out of school, or just finished a <br/>\n  school-at-home session).<br/>\n<br/>\n  And if kids are between school sessions, they have *earned* their <br/>\n  break, and can&#39;t be expected to earn a reprieve from the return of <br/>\n  school by some accelerated unschooling experimet. I think it would <br/>\n  just &quot;prove&quot; to those families that unschooling doesn&#39;t work. But <br/>\n  anyone whose been through deschooling could tell them it won&#39;t work <br/>\n  that way, and DEFINITELY not if the kids know that school could be <br/>\n  returning on schedule in just a few weeks.&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n  yeah- i didn&#39;t mean a real summer break - i was thinking about young kids, never been to school, with parents considering unschooling but unable to really envision it or trust themselves to be engaging and engaged.  <br/>\n<br/>\n  -=-also think learning styles definitely factors in here - some <br/>\n  people DO learn, or at least gain the confidence and commitment to <br/>\n  try something new - just by reading lists and talking to others. <br/>\n  Other people need to *see* the &quot;evidence&quot; that it works in their <br/>\n  family...or *experience* the feeling of being interesting and <br/>\n  engaging....so maybe some reflection on an individual level of how <br/>\n  each person changes/learns/adopts new behaviors - or had in the past <br/>\n  with other life changing things - would reveal a path that works on <br/>\n  an individual level? -=-<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;Maybe so, my site and Joyce&#39;s and this list and other providing all <br/>\n </span></blockquote>  of what anyone would need to be prepared to try unschooling no matter <br/>\n  what their particular learning style. It&#39;s their responsibility to <br/>\n  figure out how to make it work, not ours to ensure that they get it <br/>\n  working.&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n  i am confused - i thought you said that reading helps.  discussing helps.  but doing is necessary to really get it...?<br/>\n<br/>\n  . <br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226171825","msgId":39965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxRDZFNzNFLTlFN0YtNEQ0Qy1BMjkxLTM0RUMyQzBGOTAyMUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDZEM0FDNUY3NzVERDQ3N0RBNzQxQTQ3OTI0ODAyODBBQExZTEFMQVAyPg==","referencesHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4gPDNCNDkwMUEwLTBDOTctNDkwQi1CM0E3LTQzQzcxRjFENkQwNUBtYWMuY29tPiA8NkQzQUM1Rjc3NURENDc3REE3NDFBNDc5MjQ4MDI4MEFATFlMQUxBUDI+"},"prevInTopic":39963,"nextInTopic":39967,"prevInTime":39964,"nextInTime":39966,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"-=-perhaps simply looking at it like a summer break (from a school mindset) and just see what throwing oneself into unschooling, and being an interesting,","messageBody":"<div id=\"ygrps-yiv-1085598015\">-=-perhaps simply looking at it like a &quot;summer break&quot; (from a school  <br/>\nmindset) and just see what throwing oneself into unschooling, and  <br/>\nbeing an interesting, engaged, engaging, interesting person for 10  <br/>\nweeks to &quot;see what comes of it&quot; would be enough to see some real  <br/>\ntransformation in some children/families, and not so long that it  <br/>\nfeels like a permanent commitment to those who are more pessimistic,  <br/>\nnegative, fearful, compliant, etc. would help?-=-<br/>\n<br/>\nThat will cancel out unschooling, though, especially if it&#39;s a real  <br/>\nsummer break (the kids just got out of school, or just finished a  <br/>\nschool-at-home session).<br/>\n<br/>\nAnd if kids are between school sessions, they have *earned* their  <br/>\nbreak, and can&#39;t be expected to earn a reprieve from the return of  <br/>\nschool by some accelerated unschooling experimet.   I think it would  <br/>\njust &quot;prove&quot; to those families that unschooling doesn&#39;t work.   But  <br/>\nanyone whose been through deschooling could tell them it won&#39;t work  <br/>\nthat way, and DEFINITELY not if the kids know that school could be  <br/>\nreturning on schedule in just a few weeks.<br/>\n<br/>\n-=-also think learning styles definitely factors in here - some  <br/>\npeople DO learn, or at least gain the confidence and commitment to  <br/>\ntry something new - just by reading lists and talking to others.  <br/>\nOther people need to *see* the &quot;evidence&quot; that it works in their  <br/>\nfamily...or *experience* the feeling of being interesting and  <br/>\nengaging....so maybe some reflection on an individual level of how  <br/>\neach person changes/learns/adopts new behaviors - or had in the past  <br/>\nwith other life changing things - would reveal a path that works on  <br/>\nan individual level? -=-<br/>\n<br/>\nMaybe so, my site and Joyce&#39;s and this list and other providing all  <br/>\nof what anyone would need to be prepared to try unschooling no matter  <br/>\nwhat their particular learning style.  It&#39;s their responsibility to  <br/>\nfigure out how to make it work, not ours to ensure that they get it  <br/>\nworking.<br/>\n<br/>\nI just bought a book on making fountains.  I&#39;ve seen articles and  <br/>\nseen  homemade fountains before, but I just wanted the book because  <br/>\nthe photos are pretty and it had some great ideas.  It has a page of  <br/>\nsupplies one might need, with pictures and notes.  We have most of  <br/>\nthose things, but not all.  I&#39;m interested in getting the rest.  If I  <br/>\ncan&#39;t figure it out, I&#39;ll go online and look for faqs or  <br/>\ndiscussions.   But it&#39;s not the job of the author of that book to  <br/>\nfollow me down to the afternoon that I actually try to set up a  <br/>\nfountain and make sure it&#39;s working.  And it wouldn&#39;t make sense for  <br/>\nme to write to the author (or to complain behind his back) that I  <br/>\nhave that book and yet I still don&#39;t have a homemade fountain  <br/>\n(especially if I didn&#39;t actually buy the supplies or read the book).<br/>\n<br/>\nThere&#39;s still something missing.  Somehow, for some reason, some  <br/>\npeople expect unschooling to happen to them magically because they  <br/>\nhave communicated with unschoolers.  Is it school?  Church?  Social  <br/>\nclubs?  What analogy is kicking in inside them that seems to make  <br/>\nthem angry at experienced unschoolers when they don&#39;t get it going?   <br/>\nPartly it could be jealousy.  Partly it could be irritation that  <br/>\nthere actually is a lot of work involved, and that others ARE  <br/>\nexpecting them to put up or shut up, to some extent.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226167627","msgId":39963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZEM0FDNUY3NzVERDQ3N0RBNzQxQTQ3OTI0ODAyODBBQExZTEFMQVAyPg==","inReplyToHeader":"PDNCNDkwMUEwLTBDOTctNDkwQi1CM0E3LTQzQzcxRjFENkQwNUBtYWMuY29tPg==","referencesHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4gPDNCNDkwMUEwLTBDOTctNDkwQi1CM0E3LTQzQzcxRjFENkQwNUBtYWMuY29tPg=="},"prevInTopic":39962,"nextInTopic":39965,"prevInTime":39962,"nextInTime":39964,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... - or are they reconcilable? ... to understand unschooling and believe in its principles, still don t do it. I think that is what Sandra is addressing. ... ","messageBody":"<div id=\"ygrps-yiv-339737407\"><blockquote><span title=\"ireply\">&gt;&gt;So - I&#39;m trying to figure out how to reconcile Sandra&#39;s point and mine <br/>\n </span></blockquote>- or are they reconcilable?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Reading helps. Thinking helps. Questions and dialog and discussion<br/>\n&gt; can help, but they can&#39;t create unschooling at anyone&#39;s house. The<br/>\n&gt; parent must find ways to be engaged and engaging; interested and<br/>\n&gt; interesting; inspired and inspiring.<br/>\n<br/>\n&gt;&gt;So - it would be interesting to me to think about why people who seem <br/>\n </span></blockquote>to understand unschooling and believe in its principles, still don&#39;t <br/>\ndo it. I think that is what Sandra is addressing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Some of the reasons I can think of right off are those we&#39;ve mentioned <br/>\n </span></blockquote>before - cynical or pessimistic personalities, but also lethargic, low- <br/>\nenergy people might have trouble with getting going, too, getting <br/>\nstarted at anything new can be an obstacle for some people. Also, <br/>\npeople who are very risk-averse, conformist, or fearful could <br/>\nintellectually and even emotionally &gt;&gt;<br/>\n<br/>\nperhaps simply looking at it like a &quot;summer break&quot; (from a school mindset) and just see what throwing oneself into unschooling, and being an interesting, engaged, engaging, interesting person for 10 weeks to &quot;see what comes of it&quot; would be enough to see some real transformation in some children/families, and not so long that it feels like a permanent commitment to those who are more pessimistic, negative, fearful, compliant, etc. would help?<br/>\n<br/>\ni also think learning styles definitely factors in here - some people DO learn, or at least gain the confidence and commitment to try something new  - just by reading lists and talking to others.  Other people need to *see* the &quot;evidence&quot; that it works in their family...or *experience* the feeling of being interesting and engaging....so maybe some reflection on an individual level of how each person changes/learns/adopts new behaviors  - or had in the past with other life changing things - would reveal a path that works on an individual level?  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226166819","msgId":39962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4N0ZCRjU3LTYwNjYtNDQ5QS1CRUZDLUIyOTlERkQzQkE5M0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDNCNDkwMUEwLTBDOTctNDkwQi1CM0E3LTQzQzcxRjFENkQwNUBtYWMuY29tPg==","referencesHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4gPDNCNDkwMUEwLTBDOTctNDkwQi1CM0E3LTQzQzcxRjFENkQwNUBtYWMuY29tPg=="},"prevInTopic":39961,"nextInTopic":39963,"prevInTime":39961,"nextInTime":39963,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"-=-That s when the answer is to fake it until you make it, I suppose. Pretend to be an interesting and engaging person for a while - and, over time, you ll","messageBody":"<div id=\"ygrps-yiv-1940144933\">-=-That&#39;s when the answer is to fake it until you make it, I suppose.<br/>\nPretend to be an interesting and engaging person for a while - and,<br/>\nover time, you&#39;ll become one? Ask yourself, &quot;What would I do if I WAS<br/>\nan interesting and engaging person?&quot; Then do that. It&#39;ll become easier<br/>\nand more natural.-=-<br/>\n<br/>\nI think that works for courtesy and peace, too.  &quot;What would a  <br/>\nconsiderate person do?&quot;<br/>\n<br/>\n<br/>\n<br/>\nAnd when others respond to one as considerate, that will feel good,  <br/>\nand consideration might take hold.<br/>\n<br/>\nWhen kids respond to a parent&#39;s interesting and engaging actions, it  <br/>\nmight lead to more authentic and natural and easy engagement and  <br/>\ninterestingness.  (What  a word, but I have to take Holly out to a  <br/>\ndoctor&#39;s appointment and maybe a movie.)<br/>\n<br/>\n<br/>\n<br/>\nPam, I think the two statements can work together, but I don&#39;t think  <br/>\nsomeone can really understand or trust unschooling until they see  <br/>\nsome evidence with their own children, maybe.<br/>\n<br/>\nIf anyone here has suggestions for tweaking these theories and  <br/>\nexamples, let&#39;s do it!  If we can summarize what we&#39;ve danced around  <br/>\nfor years, it will be wonderful.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] engaged and engaging; interested and interesting","postDate":"1226166427","msgId":39961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCNDkwMUEwLTBDOTctNDkwQi1CM0E3LTQzQzcxRjFENkQwNUBtYWMuY29tPg==","inReplyToHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":39959,"nextInTopic":39962,"prevInTime":39960,"nextInTime":39962,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"... doesn t help, though.  What helps is being interested enough to take the ideas and use them until you start to understand them, and then replace your old","messageBody":"<div id=\"ygrps-yiv-1179423319\">On Nov 8, 2008, at 5:14 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;Being in proximity to those things<br/>\n </span></blockquote>doesn&#39;t help, though.  What helps is being interested enough to take<br/>\nthe ideas and use them until you start to understand them, and then<br/>\nreplace your old reactions and beliefs with the ideas that will turn<br/>\nyou into an unschooler.    Being on a list with other unschoolers<br/>\nisn&#39;t enough.  It won&#39;t happen by osmosis or reflection.&lt;&lt;&lt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>What is really interesting to me is that I just told people almost the  <br/>\nopposite the other day when I said that they need to focus on  <br/>\nunderstanding the basic reasons for and principles of unschooling -  <br/>\nthat if they really grasp those, they won&#39;t have to decide whether or  <br/>\nnot to unschool, they won&#39;t have to &quot;pick&quot; unschooling like they pick  <br/>\na new curriculum, it will be the only thing that makes sense to do,  <br/>\nthe only way they feel comfortable living.<br/>\n<br/>\nSo - I&#39;m trying to figure out how to reconcile Sandra&#39;s point and mine  <br/>\n- or are they reconcilable?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Reading helps.  Thinking helps.  Questions and dialog and discussion<br/>\n&gt; can help, but they can&#39;t create unschooling at anyone&#39;s house.  The<br/>\n&gt; parent must find ways to be engaged and engaging; interested and<br/>\n&gt; interesting; inspired and inspiring.<br/>\n<br/>\n </span></blockquote>So - it would be interesting to me to think about why people who seem  <br/>\nto understand unschooling and believe in its principles, still don&#39;t  <br/>\ndo it. I think that is what Sandra is addressing.<br/>\n<br/>\nSome of the reasons I can think of right off are those we&#39;ve mentioned  <br/>\nbefore - cynical or pessimistic personalities, but also lethargic, low- <br/>\nenergy people might have trouble with getting going, too, getting  <br/>\nstarted at anything new can be an obstacle for some people. Also,  <br/>\npeople who are very risk-averse, conformist, or fearful could  <br/>\nintellectually and even emotionally &quot;get it&quot;, but have trouble acting  <br/>\non their own beliefs.<br/>\n<br/>\nThat&#39;s when the answer is to fake it until you make it, I suppose.  <br/>\nPretend to be an interesting and engaging person for a while - and,  <br/>\nover time, you&#39;ll become one? Ask yourself, &quot;What would I do if I WAS  <br/>\nan interesting and engaging person?&quot; Then do that. It&#39;ll become easier  <br/>\nand more natural.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"engaged and engaging; interested and interesting","postDate":"1226150081","msgId":39959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMjRDMDNFLUQ0MDUtNEIwRi05RjgxLTNDN0M1QjI1NTY4REBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":39961,"prevInTime":39958,"nextInTime":39960,"topicId":39959,"numMessagesInTopic":0,"msgSnippet":"I woke up with these two phrases in my head. Unschooling requires that a parent be engaged and engaging. Unschooling requires that a parent be interested and","messageBody":"<div id=\"ygrps-yiv-2142499909\">I woke up with these two phrases in my head.<br/>\n<br/>\nUnschooling requires that a parent be engaged and engaging.<br/>\nUnschooling requires that a parent be interested and interesting.<br/>\n<br/>\nProbably half the people here figured that out somewhat on their own,  <br/>\nor from similar statements made by Pam or Joyce or Deb or someone  <br/>\nwhen they describe what unschoolers DO and not just what they don&#39;t do.<br/>\n<br/>\nIt ties some things together for me, though, that have been clear in  <br/>\nmy head but less clear in explanation, maybe.<br/>\n<br/>\nFor years I&#39;ve said &quot;not everyone can unschool,&quot; and people have  <br/>\nasked &quot;like who?&quot; and I&#39;ve said some people are too cynical and  <br/>\nunwilling to change.<br/>\n<br/>\nSo here, I think, is where the cynicism and pessimism have hooked up  <br/>\nto my other concepts.   A person who is negative and unsure things  <br/>\nwill work (or worse, expresses a belief that things will NOT work)  <br/>\nneeds to change that before unschooling can thrive.<br/>\n<br/>\nThere is unschooling that barely qualifies, that would maybe pass a  <br/>\ntest or that someone else would nervously or grudgingly say &quot;Yeah,  <br/>\nthat&#39;s unschooling...&quot;  maybe thinking &quot;except...&quot; or maybe saying  <br/>\n&quot;but you should get them out more&quot; or &quot;but you need to hang out with  <br/>\nthem and really pay attention to them.&quot;  Then there is unschooling  <br/>\nthat is undoubtedly alive with its own propulsive intensity and joy.   <br/>\nThere is unschooling that has momentum and flow.<br/>\n<br/>\nThat&#39;s what I was trying to describe in August, on this list, when I  <br/>\nwrote the response below<br/>\n******************<br/>\n&lt;&lt; I can&#39;t figure out how unschoolers do these things if they don&#39;t plan<br/>\nto do them or structure the day so there is a time to do them.&gt;&gt;<br/>\n<br/>\nMaybe it&#39;s like priming a hand-pump (another air pressure/water<br/>\nsituation)--the first pump gets nothing. The second usually gets  <br/>\nnothing.<br/>\nOnce the water&#39;s in the pipe, though, every touch on the pump handle  <br/>\nbrings<br/>\nwater.<br/>\n<br/>\nOr like sourdough bread. Once you have the starter and you keep paying<br/>\nattention enough to make more bread every once in a while, &quot;It&#39;s  <br/>\neasy.&quot; But<br/>\nfor those with no starter, it&#39;s not just not easy, it&#39;s not possible.<br/>\n(That&#39;s theory. There&#39;s sourdough breadmix now that has the sourdough in<br/>\nsome kind of powdered and encapsulated form.)<br/>\n**********************<br/>\n<br/>\nIt can be hard to get it started, because it takes new kinds of  <br/>\neffort and learning and attention on the parents&#39; part.  But if it  <br/>\nDOES get started, it will be self-sustaining for short bursts and  <br/>\nthen longer periods, and eventually the parent(s) can figure out how  <br/>\nto do it with less effort.  But if they never do the work to learn  <br/>\nhow it works and then get it started, it would be like buying a hand  <br/>\npump and leaving it in the box and continuing to ask how it&#39;s  <br/>\nsupposed to get water out of the ground, or like getting bread  <br/>\nstarter and never even trying to make any bread.<br/>\n<br/>\nYet unschooling is easier than hooking up a water pump or than making  <br/>\nsourdough.<br/>\n<br/>\nPeople have this list and others; my website and Joyce&#39;s and others;  <br/>\nmy book and Rue&#39;s and others.   Being in proximity to those things  <br/>\ndoesn&#39;t help, though.  What helps is being interested enough to take  <br/>\nthe ideas and use them until you start to understand them, and then  <br/>\nreplace your old reactions and beliefs with the ideas that will turn  <br/>\nyou into an unschooler.    Being on a list with other unschoolers  <br/>\nisn&#39;t enough.  It won&#39;t happen by osmosis or reflection.<br/>\n<br/>\nI think now that when people come here and want to be unschooled  <br/>\nthemselves, they want me to treat them like I treat my children, that  <br/>\nthey want to have water come out of their pump just because I say I  <br/>\nhave a pump.  They want to eat homemade bread at their house for  <br/>\nhaving read about other people&#39;s  sourdough bread.<br/>\n<br/>\nReading helps.  Thinking helps.  Questions and dialog and discussion  <br/>\ncan help, but they can&#39;t create unschooling at anyone&#39;s house.  The  <br/>\nparent must find ways to be engaged and engaging; interested and  <br/>\ninteresting; inspired and inspiring.<br/>\n<br/>\nSandra<br/>\n-----------<br/>\nThe quote above is from<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/message/6733\">http://groups.yahoo.com/group/AlwaysLearning/message/6733</a><br/>\nand here are links to help beginners or those who haven&#39;t quite  <br/>\ngotten it to flow yet:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help\">http://sandradodd.com/help</a><br/>\n<br/>\nAnd for images and more on siphon pumps:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thinkingsticks.blogspot.com/2008/10/hand-pumps-siphons-water-\">http://thinkingsticks.blogspot.com/2008/10/hand-pumps-siphons-water-</a> <br/>\ncontainers.html<br/>\nIf that link cuts off go to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thinkingsticks.blogspot.com/\">http://thinkingsticks.blogspot.com/</a> and scroll down.<br/>\nAnd on the left column there are many links to unschoolers&#39; blogs,  <br/>\nand  you can see for yourself some examples of unschooling days.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":40073,"nextTopicId":40079}}