{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"Z6AHlQnE6j0DAu00pw1i-1VM84kODygW61rwcbTXRj9UjCj6e-1LRl9BmbuEPaOVb0bydklnBPCHM5EMA4IXFo7djHsEuw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japan news: Schoolkids &quot;must&quot; volunteer","postDate":"969700909","msgId":13311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwOTIzMDkyMS5TQUEwMTkzOUBzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13310,"nextInTime":13312,"topicId":13311,"numMessagesInTopic":0,"msgSnippet":"Hi again everybody, Just when you thought you ve heard it all, along comes an official Japanese government proposal for solving the education crisis: make ","messageBody":"<div id=\"ygrps-yiv-419696423\">Hi again everybody,<br/>\n<br/>\nJust when you thought you&#39;ve heard it all, along comes an official <br/>\nJapanese government proposal for solving the education crisis: make <br/>\nvolunteer work a mandatory part of Japanese schoolchildren&#39;s curriculum.<br/>\n<br/>\nFeast your logic on the story below for more details....<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nOsaka, Japan<br/>\n<br/>\n----------------------------<br/>\n<br/>\nThe Japan Times - Saturday, September 23, 2000<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.japantimes.co.jp/cgi-bin/getarticle.pl5?nn20000923a1.htm\">http://www.japantimes.co.jp/cgi-bin/getarticle.pl5?nn20000923a1.htm</a><br/>\n<br/>\n<br/>\nPUPILS TO BE REQUIRED TO VOLUNTEER: PANEL<br/>\n<br/>\n<br/>\nAn education advisory panel to the prime minister on Friday submitted an <br/>\ninterim report calling for drastic changes in the current education <br/>\nsystem that would nurture volunteer spirit among students by requiring <br/>\nthem to do community service.<br/>\n<br/>\nThe report also emphasized the importance of fostering a sense of <br/>\nself-reliance and originality in individual children by discarding the <br/>\nconventional idea of a standardized education.                           <br/>\n<br/>\nThis is apparently an attempt to develop more capable future generations <br/>\nin an increasingly competitive world and at a time when Japan&#39;s economic <br/>\npower is on the decline.<br/>\n                                                                      .<br/>\nThe proposals are among 17 suggestions the National Commission on <br/>\nEducational Reform outlined in its interim report to Prime Minister <br/>\nYoshiro Mori.<br/>\n<br/>\nThe 26-member panel, which is headed by Nobel Physics laureate Reona <br/>\n(Leo) Esaki, will draft a final report by the end of the year, after <br/>\nconducting public hearings based on the interim report.<br/>\n<br/>\n&quot;School curricula should be changed to give students diversified <br/>\neducational opportunities to help develop their individual abilities,&quot; <br/>\nEsaki said, adding that panel members hope the proposals will provoke <br/>\npublic debate.<br/>\n<br/>\nThe proposal to require students between elementary and high school to <br/>\nparticipate in extracurricular activities reflected the members&#39; anxiety <br/>\nabout conventional education, which focuses too narrowly on classroom <br/>\nstudies.<br/>\n<br/>\nIn the report, the panel underlines the pressing need to reform the <br/>\nnation&#39;s education system, which it says stands at a crossroads and will <br/>\nbe useless unless something is done.<br/>\n<br/>\nThe panel cited serious problems such as bullying, truancy and violence <br/>\namong young people and proposed that elementary and junior high school <br/>\nstudents spend two weeks performing community service, while high school <br/>\nstudents spend one month.<br/>\n<br/>\nThe panel did not specify what kind of services the students should be <br/>\nrequired to perform.<br/>\n<br/>\nIf enacted, the report says the proposal would change the conventional <br/>\nidea of education, which mainly focuses on classroom studies, and will <br/>\ngive students &quot;opportunities to widen their views on society while <br/>\nworking for others.&quot;<br/>\n<br/>\nThe report also says that in the future, the nation should consider <br/>\nmandatory community service of one year for everyone aged 18. It lists <br/>\ncaring for the aged as one of the mandatory social activities.<br/>\n<br/>\nOther proposals include abolishing the age limit that prevents people <br/>\nfrom entering universities or colleges before they turn 18 and creating <br/>\nprofessional schools, such as law schools and business schools, to train <br/>\nexperts.<br/>\n<br/>\nThe report also suggests merging about half of the national junior high <br/>\nand high schools so single six-year secondary educations can be offered. <br/>\nThe reform would help ease the current &quot;examination hell&quot; and would <br/>\nprovide students with a more diversified secondary education, it says.<br/>\n<br/>\nThe panel also said academic years at Japanese universities and colleges, <br/>\nwhich usually begin in April, should instead begin in September.<br/>\n<br/>\nThe report says that while many of the panel&#39;s members felt the need to <br/>\nrevise the 1947 Fundamental Law of Education to suit present needs, the <br/>\npanel has not reached any decisions on how to revise it. The report <br/>\nnonetheless says discussions should start toward revising the law.<br/>\n<br/>\nMori is keen to revise the law, which has served as the basis of all <br/>\nsubsequent education laws and ordinances, to include clauses emphasizing <br/>\nthe importance of Japan&#39;s traditional values and culture.<br/>\n<br/>\nThe prime minister has already expressed his government&#39;s intention to <br/>\ndraft bills to achieve education reforms based on the panel&#39;s discussions <br/>\nand in his policy speech before the Diet the day before he said education <br/>\nreform will be a key theme during next year&#39;s regular legislative session.<br/>\n<br/>\nThe panel also includes school teachers and representatives from various <br/>\ncircles, such as business and the arts.<br/>\n<br/>\n<br/>\nThe Japan Times: Sept. 23, 2000<br/>\n(C) All rights reserved</div>","specialLinks":[]}],"prevTopicId":13299,"nextTopicId":13296}}