{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":189844599,"authorName":"gbdawson","from":"&quot;gbdawson&quot; &lt;gdawson22824@...&gt;","profile":"gbdawson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Asperger&#39;s in retrospect (was Intro..)","postDate":"1116609363","msgId":106029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2bDYwaisydWxwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFhMS4zNDJhNzEyNS4yZmJlYzlhNUBhb2wuY29tPg=="},"prevInTopic":106018,"nextInTopic":0,"prevInTime":106028,"nextInTime":106030,"topicId":106018,"numMessagesInTopic":0,"msgSnippet":"Last week on the public radio program _The Infinite Mind_ (also available to listen to on the web at www.theinfinitemind.com), was the first of a two-part","messageBody":"<div id=\"ygrps-yiv-841051287\">Last week on the public radio program _The Infinite Mind_ (also <br/>\navailable to listen to on the web at www.theinfinitemind.com), was <br/>\nthe first of a two-part special on Asperger&#39;s (both parts listed <br/>\nbelow):  <br/>\n<br/>\nAsperger&#39;s Disorder: &quot;Don&#39;t Try to Cure Us!&quot; Part one of a Special <br/>\nReport (beginning May 11, 2005) In the first segment of this ground-<br/>\nbreaking two-part report, we examine the challenges and gifts of <br/>\nAsperger&#39;s syndrome, a form of high functioning autism, and what it <br/>\nmight teach all of us about the difference between the male and <br/>\nfemale brain. We&#39;ll track the emergence of a vocal, largely web-based <br/>\nAsperger&#39;s community: Don&#39;t call it a disability, these folks say, <br/>\nand please don&#39;t try to &quot;cure&quot; us; we like our differences. We&#39;ll get <br/>\na peek at some break-through research from British scientist Simon <br/>\nBaron-Cohen, who believes that Asperger&#39;s and other autistic <br/>\ndisorders result when two &quot;systematizing&quot; types, like engineers and <br/>\nmathematicians, have kids.<br/>\n<br/>\nAsperger&#39;s Syndrome: Part two of a Special Report: (beginning May 18, <br/>\n2005) In this second segment of our two-part series on Asperger&#39;s <br/>\nsyndrome, we explore the impact of this learning difference in <br/>\nchildren and young adults. We&#39;ll hear from noted child development <br/>\nexpert Dr. Stanley Greenspan, who believes that the most widely <br/>\npracticed therapy for Asperger&#39;s and autism is misguided and may <br/>\nactually worsen the condition. We&#39;ll also talk about Asperger&#39;s in <br/>\nadolescence with a 17-year-old boy and a psychologist who works with <br/>\nthese sometimes touchy teens. And, a moving and personal commentary <br/>\nfrom Howard Bloom.<br/>\n<br/>\nSome final personal comments:<br/>\n1.  Though never formally diagnosed, my brother (age 46) has <br/>\ndisplayed many of the traits now associated with Asperger&#39;s.  He <br/>\nworks as a computer operator, a job at which he can work <br/>\nindependently.  He does not appear to need much contact with others <br/>\n(in fact, he prefers it that way).  <br/>\n<br/>\n2.  I&#39;ve worked in software development environments for 20+ years.  <br/>\nMy non-scientific, anecdotal opinion is that Asperger-like traits are <br/>\nbetter accepted, understood, and appreciated in this kind of <br/>\nenvironment. <br/>\n<br/>\nGail Dawson</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Asperger&#39;s in retrospect (was Intro..)","postDate":"1116565413","msgId":106018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMS4zNDJhNzEyNS4yZmJlYzlhNUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":106029,"prevInTime":106017,"nextInTime":106019,"topicId":106018,"numMessagesInTopic":0,"msgSnippet":"There was a boy (he s grown now) in our unschooling group  who had  severe Asperger s behavior, and the other kids were so  nice to him and so patient that he","messageBody":"<div id=\"ygrps-yiv-248923012\">There was a boy (he&#39;s grown now) in our unschooling group  who had  severe <br/>\nAsperger&#39;s behavior, and the other kids were so  nice to him and so patient that <br/>\nhe made noticeable progress within a year&#39;s  time, just being out of school <br/>\nand being around kids his age (a little younger,  which was fine) who were nice <br/>\nwhether he wanted to play with them or just watch  them or totally ignore <br/>\nthem.  Eventually he would play with them a little,  and then more.<br/>\n <br/>\nHis mom did him a gigantic favor taking him out of school.<br/>\n <br/>\nFor retrospective diagnoses, my nephew Elijah (the one who was in the  gifted <br/>\nclass, the one who inspired my sister to offer her kids the option to  <br/>\nhomeschool, documented somewhat here:  _<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice_\">http://sandradodd.com/schoolchoice_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice)\">http://sandradodd.com/schoolchoice)</a>   ) was looked at lately as Asperger&#39;s.  He cried <br/>\na LOT as a baby, and  rocked.  They found something physically wrong and he <br/>\nhad surgery, but that  wasn&#39;t all of his problem, probably.  He was tested for <br/>\ndeafness because he  wouldn&#39;t respond to people, yet he was writing very <br/>\nearly.  He spoke in a  monotone, and still, to some extent does now.  <br/>\n <br/>\nWhen a child can score high at school, school tends to care less about  <br/>\n&quot;conditions,&quot; they&#39;ll just justify it as quirks of giftedness.  When a  child&#39;s <br/>\ntalents are not what school values or when a child won&#39;t play for  school-points, <br/>\nTHEN the school wants to justify their &quot;failure&quot; to teach, and  they want to <br/>\nget special ed funding and to separate the problem child from other  kids, and <br/>\nthat&#39;s where a lot of labelling comes in.<br/>\n <br/>\nThese days Elijah Trujillo (my nephew) is growing fancy organic stuff for  <br/>\nthe Santa Fe farmer&#39;s market (he made money last year and so has already planted <br/>\n for this year), and though he only started learning bass guitar a few months <br/>\n ago, he&#39;s now playing bass, lead and rhythm and kind of alarming well.   <br/>\nStunning progress and musicality, but my sister was always that way.  When  she <br/>\nlearned a new instrument or musical style, she would zoom along for a while,  <br/>\nand then lose interest in favor of something newer and more exciting.  <br/>\n <br/>\nI&#39;m just blabbering now, lost my train of thought, sorry.  It&#39;s  late.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":106024,"nextTopicId":106036}}