{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"vXAWrAvaefgaTx5-FGpbP-WTIOaDCqmAHAKxrr7TSLRzXVh200yUVAACG9zckZP-_YlJJUchb5_jVDapMRGe_rjhBg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: What&#39;s Hiding In GW&#39;s Cabinet? by R Lederman","postDate":"977672062","msgId":14735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNWQwMWMwNmRjYyQzZGI2N2VhMCQxYzVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14734,"nextInTime":14736,"topicId":14735,"numMessagesInTopic":0,"msgSnippet":"Now, before all the fireworks begin, this is being forwarded as an interesting read, in particular because of the references to Bob Jones U. Delete if not","messageBody":"<div id=\"ygrps-yiv-39980284\">Now, before all the fireworks begin, this is being forwarded as an<br/>\ninteresting read, in particular because of the references to Bob Jones U.<br/>\nDelete if not interested.<br/>\n<br/>\nAlso, of interest, at least to me &lt;g&gt; was that I got this from one of the<br/>\nmost rabid right wing lists going down the road.  Not only is the list<br/>\nmoderated, the list owner has stated that it is a dictatorship and she will<br/>\ncensor everything that comes across her cyber desk and she does!  Guess she<br/>\nwas off christmas shopping &lt;g&gt;<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\n<br/>\n&gt; What&#39;s Hiding In GW&#39;s Cabinet?<br/>\n&gt; by Robert Lederman<br/>\n&gt;<br/>\n&gt; &quot;I&#39;m very good at delegating authority...I&#39;ll surround myself<br/>\n&gt; with the best minds in America&quot;. Exactly who are these, best<br/>\n&gt; minds in America, and where is GW Bush getting them from?<br/>\n&gt;<br/>\n&gt; There is a common thread connecting all of Bush&#39;s appointees<br/>\n&gt; so far-pharmaceuticals, oil, Wall Street and the historical<br/>\n&gt; connection between the CIA, major US corporations and Nazi<br/>\n&gt; Germany. If you&#39;ve studied the Bush family history in any<br/>\n&gt; depth you won&#39;t find many surprises among his nominations.<br/>\n&gt;<br/>\n&gt; Paul O&#39;Neill, the Bush nominee for Treasury Secretary, is the<br/>\n&gt; chairman of Alcoa Aluminum, one of the nation&#39;s largest toxic<br/>\n&gt; polluters. O&#39;Neill owns 1.6 million shares of Alcoa, worth more<br/>\n&gt; than $50 million. During WWII Alcoa negotiated a deal with<br/>\n&gt; the Nazis and IG Farben to supply Germany&#39;s war machine<br/>\n&gt; rather than the US military with aluminum. &quot;If America loses<br/>\n&gt; this war,&quot; said then Secretary of the Interior Harold Ickes on<br/>\n&gt; June 26, 1941, &quot;it can thank the Aluminum Corporation of<br/>\n&gt; America [ALCOA].&quot;<br/>\n&gt;<br/>\n&gt; Alcoa is the producer of hundreds of millions of tons of<br/>\n&gt; fluoride. This highly toxic byproduct of aluminum has been<br/>\n&gt; scientifically linked in thousands of medical studies conducted<br/>\n&gt; since the 19th century to cancer and other degenerative<br/>\n&gt; diseases. In the 1950&#39;s Alcoa arranged to have it profitably<br/>\n&gt; added to our nation&#39;s drinking water rather than disposed of as<br/>\n&gt; toxic waste. During WWII the Nazis discovered that by adding<br/>\n&gt; fluoride to the drinking water in concentration camps they<br/>\n&gt; could make prisoners far more submissive to authority. .<br/>\n&gt;<br/>\n&gt; Melquiades R. Martinez, designated Secretary for Housing and<br/>\n&gt; Urban Development, is a Cuban refugee who established his<br/>\n&gt; political reputation by preventing new housing from being built<br/>\n&gt; in conservative Orange Co. Florida-claiming it was a quality of<br/>\n&gt; life violation. As chair of Orange County, Martinez eliminated<br/>\n&gt; the department of community affairs, a civil rights agency that<br/>\n&gt; was set up to give poor people a voice in local government. It<br/>\n&gt; is probable that Martinez received CIA indoctrination after he<br/>\n&gt; arrived in the US at age 15 as part of a government airlift<br/>\n&gt; program of children whose parents did not want them to grow<br/>\n&gt; up under the Castro regime.<br/>\n&gt;<br/>\n&gt; NJ Governor Christie Whitman is the Bush designee for the<br/>\n&gt; Environmental Protection Agency. Her massively polluted<br/>\n&gt; state hosts some of the world&#39;s largest oil refineries and<br/>\n&gt; chemical manufacturing plants. Environmental non-expert<br/>\n&gt; Whitman has said she doubts that the giant ozone hole over the<br/>\n&gt; North Pole or global warming are actually serious problems.<br/>\n&gt;<br/>\n&gt; Donald L. Evans, the nominee for Commerce Secretary, is an<br/>\n&gt; insider in the Texas &quot;oil mafia&quot; and is GW&#39;s closest friend and<br/>\n&gt; confidant. He&#39;s also a close friend, confidant and contributor to<br/>\n&gt; one of America&#39;s biggest recipients of government contacts,<br/>\n&gt; Halliburton&#39;s Dick Cheney.<br/>\n&gt;<br/>\n&gt; Rev. Floyd Flake, Dubya&#39;s nominee for Secretary of Education,<br/>\n&gt; was the only prominent African American leader in NYC to<br/>\n&gt; endorse Bush pal Rudy Giuliani, the racist NYC Mayor who<br/>\n&gt; has executed a seven year long campaign of violence,<br/>\n&gt; harassment and false arrest aimed at African Americans.<br/>\n&gt; Giuliani&#39;s most memorable quote on education was a proposal<br/>\n&gt; to blow up the entire NYC Board of Education.<br/>\n&gt;<br/>\n&gt; Last year, to his everlasting credit, Flake publicly denounced<br/>\n&gt; Giuliani as a mental case. Like numerous GW Bush aides and<br/>\n&gt; advisors, Rev. Flake is part of the CIA&#39;s Manhattan Institute<br/>\n&gt; which masterminded Giuliani&#39;s entire social eugenics agenda.<br/>\n&gt; Among the areas Flake is likely to focus on for Bush is turning<br/>\n&gt; public education over to religious institutions and corporations.<br/>\n&gt;<br/>\n&gt; Ann M. Veneman, Bush&#39;s appointee for secretary of<br/>\n&gt; agriculture, was deputy secretary for agriculture under<br/>\n&gt; President George Bush. She is known as an advocate for letting<br/>\n&gt; corporations exploit public land and for widespread<br/>\n&gt; distribution of foods containing genetically-altered animal<br/>\n&gt; genes, viruses, self-contained insecticides and bacteria. Bush<br/>\n&gt; has said he wants to open up Federal reserves, national forests<br/>\n&gt; and other pristine areas of public land to oil drilling, mining<br/>\n&gt; and road construction. Under Bush stewardship, we could see<br/>\n&gt; corporations running frankenfood farms in Yosemite or drilling<br/>\n&gt; for oil in the Grand Canyon.<br/>\n&gt;<br/>\n&gt; John Ashcroft, GW&#39;s choice for Attorney General, is a<br/>\n&gt; self-styled moral crusader as strongly against abortion as he is<br/>\n&gt; enthusiastic about the death penalty. He lost his Senate seat in<br/>\n&gt; the 2000 election to an opponent who died during the<br/>\n&gt; campaign. Last year, Ashcroft received an honorary degree<br/>\n&gt; from Bob Jones University and is closely aligned with the<br/>\n&gt; Christian Coalition and Pat Robertson. Ashcroft is also an<br/>\n&gt; outspoken fan of Supreme Court Justice Clarence Thomas. He<br/>\n&gt; is known among lobbyists as an advocate for drug companies<br/>\n&gt; and the automotive industry and for preventing consumers<br/>\n&gt; from suing HMO&#39;s.<br/>\n&gt;<br/>\n&gt; Mitchell E. Daniels Jr., nominated as director of the Office of<br/>\n&gt; Management and Budget was senior executive of the Eli Lilly<br/>\n&gt; drug company-which Bush&#39;s father headed from 1977-79.<br/>\n&gt; Daniels was also previously the president of the<br/>\n&gt; arch-conservative think tank Hudson Institute. Daniels, who<br/>\n&gt; advocates strict enforcement of  laws against casual drug users,<br/>\n&gt; was arrested for marijuana possession in 1970.<br/>\n&gt;<br/>\n&gt; Secretary of State designee Colin Powell is a lifelong operative<br/>\n&gt; of the CIA/military-industrial complex. While working for the<br/>\n&gt; Pentagon he helped cover up the Mai Lai massacre, the<br/>\n&gt; contra/arms deal and Gulf War Syndrome. Powell&#39;s fame<br/>\n&gt; derives from presiding over a war in which US troops were<br/>\n&gt; used as guinea pigs for experimental vaccines so that they<br/>\n&gt; could &quot;safely&quot; fight George Bush&#39;s friend Sadamn<br/>\n&gt; Hussein-who had been given the go ahead to attack Kuwait<br/>\n&gt; after being supplied with chemical and biological weapons by<br/>\n&gt; the Bush administration. Like many of GW&#39;s appointees of<br/>\n&gt; color, Powell proudly admits he owes his career in large part to<br/>\n&gt; affirmative action while joining an administration that<br/>\n&gt; considers ending affirmative action one of its topmost<br/>\n&gt; priorities.<br/>\n&gt;<br/>\n&gt; Condolezza Rice, Bush&#39;s National Security advisor was<br/>\n&gt; formerly a security advisor under President George Bush and<br/>\n&gt; an aide to Colin Powell. She has the job of explaining the basic<br/>\n&gt; elements of foreign policy to GW, about which Bush admits to<br/>\n&gt; knowing almost nothing. A large part of her career was<br/>\n&gt; involved in administering the CIA&#39;s foreign policy objectives.<br/>\n&gt; She serves on the board of Chevron Oil-known as one of the<br/>\n&gt; African continents most violent human rights abusers. A<br/>\n&gt; grateful Chevron recently named an oil tanker after her.<br/>\n&gt;<br/>\n&gt; The emerging profile of the Bush administration-moderately<br/>\n&gt; conservative and multi-racial-is a facade. To see their real<br/>\n&gt; agenda one has to examine the administration&#39;s ideological<br/>\n&gt; source-the Manhattan Institute. GW may cultivate the image of<br/>\n&gt; a plain-talkin&#39; good ole boy who prefers barbecuing to making<br/>\n&gt; policy, but virtually every idea presented as central to his<br/>\n&gt; agenda comes from this elite east coast institution.<br/>\n&gt;<br/>\n&gt; A little background<br/>\n&gt; MI (The Manhattan Institute) was started in 1978 by William<br/>\n&gt; Casey, one of the top intelligence operatives in US history.<br/>\n&gt; During WWII Casey worked with OSS chief William Donavan<br/>\n&gt; and Allen Dulles to bring top level Nazi officials to the US<br/>\n&gt; where they were recruited into the newly-formed CIA, the<br/>\n&gt; military, government-connected medical research institutions<br/>\n&gt; and the media. The stated rational for importing Hitler&#39;s top<br/>\n&gt; intelligence operatives, social scientists and propagandists to<br/>\n&gt; the US was that they would be employed in fighting<br/>\n&gt; Communism-exactly what Hitler claimed he used them for. In<br/>\n&gt; reality they were brought here to help establish fascism in<br/>\n&gt; America-a goal which they are increasingly succeeding at.<br/>\n&gt;<br/>\n&gt; Before WWII started Dulles was involved with GW&#39;s<br/>\n&gt; grandfather Prescott Bush on Wall Street where, along with<br/>\n&gt; George Herbert Walker (Prescott Bush&#39;s father-in-law) they<br/>\n&gt; operated banks and shipping companies that were later<br/>\n&gt; declared by the US Congress to be fronts for the Nazis. In 1942<br/>\n&gt; shortly after the US entered WWII the assets of these Wall<br/>\n&gt; Street companies were seized by the US government under the<br/>\n&gt; Trading With The Enemy Act.<br/>\n&gt;<br/>\n&gt; Dulles was the legal counsel for both Standard Oil and for Nazi<br/>\n&gt; Germany&#39;s I.G. Farben-one of the world&#39;s largest industrial<br/>\n&gt; powerhouses-which was co-owned by the Rockefeller<br/>\n&gt; family-the main funders of the Manhattan Institute.<br/>\n&gt;<br/>\n&gt; The US ambassador to Germany at the time had this to say<br/>\n&gt; about The Rockefellers, the Bush&#39;s, the Mellons (owners of<br/>\n&gt; Alcoa) and the other wealthy Americans who were backing<br/>\n&gt; Hitler and promoting  Eugenics, or scientific racism:<br/>\n&gt;<br/>\n&gt; &quot;A clique of U.S. industrialists is hell-bent to bring a fascist<br/>\n&gt; state to supplant our democratic government and is working<br/>\n&gt; closely with the fascist regime in Germany. I have had plenty<br/>\n&gt; of opportunity in Berlin to witness how close some of our<br/>\n&gt; American ruling families are to the Nazi regime. . .They<br/>\n&gt; extended aid to help Fascism occupy the seat of power, and<br/>\n&gt; they are helping to keep it there.&quot; - William Dodd, U.S.<br/>\n&gt; Ambassador to Germany, 1937.-Facts and Fascism, G Seldes,<br/>\n&gt; p. 122  Also, Trading with the Enemy, Charles Higham, p.167<br/>\n&gt;<br/>\n&gt; When IG Farben was broken up after Germany lost the war its<br/>\n&gt; parts became the top pharmaceutical companies in the world-<br/>\n&gt; BASF, Hoechst, Bayer AG, Agfa-Gevaert and Cassella AG.<br/>\n&gt; Today these companies, along with Pfizer and Eli Lilly-which<br/>\n&gt; former President George Bush headed from 1977-1979-are the<br/>\n&gt; largest manufacturers of prescription and over the counter<br/>\n&gt; drugs sold in the U.S.  Both the Pfizer and Eli Lilly drug<br/>\n&gt; companies are sponsors of MI.<br/>\n&gt;<br/>\n&gt; These oil, pharmaceutical and Wall Street investment banking<br/>\n&gt; elites are the foundations of the Rockefeller and Bush dynasties<br/>\n&gt; and are the real constituents of the new Bush administration.<br/>\n&gt;<br/>\n&gt; Being a business partner with the Third Reich posed no<br/>\n&gt; problem for Dulles who became the first CIA director in 1947.<br/>\n&gt; In fact, their relationship with the Nazis and Wall Street was<br/>\n&gt; exactly how Dulles, former Pres. Bush and William Casey all<br/>\n&gt; became CIA directors. GW&#39;s father was made CIA director in<br/>\n&gt; 1976. Shortly after creating the Manhattan Institute, William<br/>\n&gt; Casey was made CIA director by Ronald Reagan.<br/>\n&gt;<br/>\n&gt; In 1954 Casey put together a consortium of investors including<br/>\n&gt; top US intelligence experts who had made fortunes on Wall<br/>\n&gt; Street to form Capital Cities. In the interim, Casey served as<br/>\n&gt; Chairman of the Securities and Exchange Commission from<br/>\n&gt; 1969 to 1977. By 1985 Casey&#39;s Capital Cities had so much cash<br/>\n&gt; it was able to buy ABC and operate it as a propaganda arm of<br/>\n&gt; the US government-which it continues to be today.<br/>\n&gt;<br/>\n&gt; Casey was the top stockholder in ABC while he was director of<br/>\n&gt; the CIA under the Reagan and Bush administrations. ABC,<br/>\n&gt; CNN and Rupert Murdoch&#39;s rabidly right wing network FOX<br/>\n&gt; were instrumental in fabricating GW Bush&#39;s illegitimate<br/>\n&gt; presidency, the myth that Colin Powell is a hero and the idea<br/>\n&gt; that the Gulf War was a military victory-rather than a human<br/>\n&gt; and ecological disaster fought solely to benefit the oil industry.<br/>\n&gt;<br/>\n&gt; The reason this history is crucial to understanding GW Bush<br/>\n&gt; and his ties to the Manhattan Institute is that these same<br/>\n&gt; themes-Wall Street investing, Eugenics, the oil and drug<br/>\n&gt; industries, working for the Rockefeller family, manipulating<br/>\n&gt; the media and the directorship and ideology of the CIA-are the<br/>\n&gt; foundation on which the MI and it&#39;s influence within the new<br/>\n&gt; Bush administration can be understood.<br/>\n&gt;<br/>\n&gt; The connection between Nazi Germany, the Bush family and<br/>\n&gt; the CIA is simultaneously political, financial and ideological. It<br/>\n&gt; encompasses investment banking, legal and illegal drug dealing<br/>\n&gt; and Eugenics, the pseudo-science of population control. Unlike<br/>\n&gt; openly racist groups, they are equal opportunity employers<br/>\n&gt; carefully cultivating operatives among all races. Academics,<br/>\n&gt; politicians, doctors, clergy, prominent new anchors, social<br/>\n&gt; scientists and in some cases even street gangs are among their<br/>\n&gt; assets in the war to exert social control.<br/>\n&gt;<br/>\n&gt; If you visit the MI website you will find a list of academics<br/>\n&gt; who are their roster of so-called conservative experts. Their<br/>\n&gt; areas of expertise are race, eliminating welfare, deregulation of<br/>\n&gt; business and the privatization of virtually everything the<br/>\n&gt; government presently manages-including education, prisons,<br/>\n&gt; parks, streets, social security, courts and welfare.<br/>\n&gt;<br/>\n&gt; A number of their experts, including Bush&#39;s domestic policy<br/>\n&gt; advisor Stephen Goldsmith and Rev. Floyd Flake, are slated for<br/>\n&gt; cabinet positions. Others MI notables, including Myron<br/>\n&gt; Magnet, are the inventors of Bush&#39;s doublespeak theme,<br/>\n&gt; &quot;compassionate conservatism&quot;. GW has stated that next to<br/>\n&gt; Jesus and the bible, Magnet&#39;s book on the so-called underclass<br/>\n&gt; has been the single greatest influence on his ideas.<br/>\n&gt;<br/>\n&gt; The Pioneer Fund, perhaps the world&#39;s greatest promoter of<br/>\n&gt; Eugenics, funded MI&#39;s best-known resident scholar, Charles<br/>\n&gt; Murray, during eight years in which he wrote The Bell Curve.<br/>\n&gt; Despite tremendous controversy about his ideas Murray<br/>\n&gt; remains the MI&#39;s leading expert on welfare reform, IQ and<br/>\n&gt; affirmative action. The Bell Curve advances the idea, as do<br/>\n&gt; virtually all Pioneer Fund projects, that African Americans are<br/>\n&gt; genetically inferior, disease prone, have low IQ and are a drain<br/>\n&gt; on the US economy. Murray&#39;s books have been heavily<br/>\n&gt; promoted by the MI and are the intellectual foundation for the<br/>\n&gt; movement in the US to end affirmative action and welfare.<br/>\n&gt;<br/>\n&gt; Murray is glowingly mentioned hundreds of times on their<br/>\n&gt; website, speaks at their seminars and is cited as a brilliant<br/>\n&gt; scholar by none other than GW Bush&#39;s top domestic policy<br/>\n&gt; advisor, Stephen Goldsmith.<br/>\n&gt;<br/>\n&gt; Many Americans didn&#39;t seem to mind seeing the CIA ruthlessly<br/>\n&gt; manipulate the political and social fabric of other nations for<br/>\n&gt; the second half of the 20th century. How they will feel about<br/>\n&gt; America being openly run by the CIA and this circle of racist<br/>\n&gt; corporate gangsters may well determine the history of the next<br/>\n&gt; century.<br/>\n&gt; Robert Lederman 12/23/2000<br/>\n&gt;<br/>\n&gt; NY Times  June 12, 2000 Bush Culls Campaign Theme From<br/>\n&gt; Conservative Thinkers “Gov. George W. Bush has said his<br/>\n&gt; political views have been shaped by the work of Myron<br/>\n&gt; Magnet of the Manhattan Institute.” Also see: The Dallas<br/>\n&gt; Morning Star 4/16/2000 The Godfathers of &#39;Compassionate<br/>\n&gt; Conservatism<br/>\n&gt;<br/>\n&gt; NY Times Monday, May 12, 1997<br/>\n&gt; Turning Intellect Into Influence Promoting Its Ideas, the<br/>\n&gt; Manhattan Institute Has Nudged New York Rightward &quot;...the<br/>\n&gt; institute was founded as a free-market education and research<br/>\n&gt; organization by William Casey, who then went off to head the<br/>\n&gt; Central Intelligence Agency in the Reagan Administration.&quot;<br/>\n&gt;<br/>\n&gt; See: Sarasota Herald-Tribune 11/11/2000<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.newscoast.com/headlinesstory2.cfm?ID=35115\">http://www.newscoast.com/headlinesstory2.cfm?ID=35115</a><br/>\n&gt;  Director of Florida Holocaust Museum links Bush family to<br/>\n&gt; Nazis<br/>\n&gt;<br/>\n&gt; &quot;If this were a dictatorship, it&#39;d be a heck of a lot easier, just so<br/>\n&gt; long as I&#39;m the dictator.&quot; -12/18/2000 GW Bush<br/>\n&gt; See CNN transcripts<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cnn.com/TRANSCRIPTS/0012/18/nd.01.html\">http://www.cnn.com/TRANSCRIPTS/0012/18/nd.01.html</a> </span></blockquote></div>","specialLinks":[]}],"prevTopicId":14733,"nextTopicId":14744}}