{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: some help needed here","postDate":"1032837321","msgId":44566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5LjJkOWQ4NmI5LjJhYzEzMmM5QGFvbC5jb20+"},"prevInTopic":44560,"nextInTopic":0,"prevInTime":44565,"nextInTime":44567,"topicId":44551,"numMessagesInTopic":0,"msgSnippet":"... http://sandradodd.com/BoredNoMore.html It probably looks better on the webpage, but here s the text: BORED NO MORE by SandraDodd, 1998 Another","messageBody":"<div id=\"ygrps-yiv-1109172922\"><blockquote><span title=\"ireply\">&gt;When nothing is &#39;happening&#39; around here, he has a lament of &quot;I&#39;m<br/>\n&gt; bored - what can I do?&quot; My suggestions are often met with disdane.&gt;&gt;<br/>\n<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/BoredNoMore.html\">http://sandradodd.com/BoredNoMore.html</a><br/>\n<br/>\nIt probably looks better on the webpage, but here&#39;s the text:<br/>\n<br/>\n<br/>\nBORED NO MORE<br/>\n<br/>\n<br/>\nby SandraDodd, 1998<br/>\n<br/>\nAnother homeschooling mom once wrote, “It&#39;s a valuable lesson to learn to <br/>\ndeal with boredom, just like all other emotions.” <br/>\n<br/>\nUntil I read that, I hadn’t ever thought of boredom as an emotion. I liked <br/>\nthe idea. When a child comes to me seeking advice on how to deal with any <br/>\nemotional state, I&#39;m flattered and glad for the opportunity. <br/>\n<br/>\nTraditionally in this culture boredom is seen as a state of sin. “I’m bored” <br/>\nis met by unthinking parents with, “Then mop the kitchen,” or “You have a <br/>\nthousand dollars’ worth of toys, you can’t be bored,” or “Boredom’s good <br/>\nfor you.” I believe the VERY common habit of belittling children who use the <br/>\nword “bored” should be rethought (or “thought,” since it seems many parents <br/>\nhave never considered it carefully but just repeat what their parents said to <br/>\nthem). <br/>\n<br/>\nIf a child came and said she was heartbroken would you tell her she was a <br/>\nbrat and should clean the garage? If a child came and said he was angry <br/>\nenough to hit would you say, “Then sit down and read a book whether you want <br/>\nto or not”? Wouldn’t you try to help them? It&#39;s nonsensical to me that some <br/>\nparents shame their children for saying they are at a loss about what to do <br/>\nnext. <br/>\n<br/>\nThe most to be accomplished from punishing or sending bored kids away is that <br/>\nthe kids will learn not to go to that parent for advice and ideas. <br/>\n<br/>\nSometimes the real message behind &quot;I&#39;m bored&quot; is &quot;I&#39;m little and feeling <br/>\nagitated and vaguely unhappy and I don&#39;t know what I can do to get over this <br/>\nuncomfortable feeling. What would you do if you were my age, in this house, <br/>\non a day like this?&quot; <br/>\n<br/>\nI think that deserves a helpful, respectful response. <br/>\n<br/>\nIt is rare that my children say, “I’m bored,” but when they do I walk with <br/>\nthem where they are, or to some other part of the house, thinking quickly <br/>\nabout what I might have that they have never seen, or haven’t seen for a <br/>\nwhile. I think of art supplies or games or toys or musical instruments they <br/>\nhaven’t thought of for a long time. I scan my mind and the house for things <br/>\nwhich would provide some visual, auditory, olfactory, or mental stimulation, <br/>\npreferably two or three of those. Tactile stimulation is good too--perhaps <br/>\nthe offer of a shower or bath with new/different toys, or different soap or <br/>\nsomething. Sometimes “watering the yard” (playing with the hose) will do. <br/>\nWhen a baby cries for no clear reason, parents will often joyfully see <br/>\nwhether the baby means “I’m uncomfortable.” They’ll try a change of cloth<br/>\nes, physical contact, a change of temperature, more air, less air, hot <br/>\nfood, cold food, a stroll outside, a car ride, SOMETHING different. Older <br/>\nkids have the same needs, and the expression of that need might come through <br/>\nas whining, irritability, or a claim of boredom. <br/>\nMaybe it’s not physical need, but intellectual need. Boredom is a desire for <br/>\ninput which unschooling parents should welcome. It’s a child saying “How can <br/>\nI add excitement to my life?” This can be a big opportunity to introduce a <br/>\nnew subject, activity, or thought-collection. <br/>\nMaybe it’s an emotional need, and the parent’s undivided attention for a <br/>\nlittle while will solve the problem. A walk, some joking, a hug, inquiries <br/>\nabout progress on the child’s projects or plans or friends might serve many <br/>\npurposes at once. If after a walk and a talk the child is not quite <br/>\nrefreshed, you still had that time together, which made “I’m bored” a useful <br/>\ninvitation to bonding. <br/>\nSometimes “bored” means tired, low on energy, needing a break from conscious <br/>\nthought and responsibility. Arranging a nap, or putting on a soothing video <br/>\n(even for older kids--a romance instead of an action flick, or light drama <br/>\ninstead of comedy), leaving a pillow on the couch and herding the rest of the <br/>\nfamily in other directions might result in an unplanned but needed nap. <br/>\nI’m grown. I still get bored occasionally. Thinking about why I’m bored and <br/>\nforgiving myself for being bored have helped me assist my children in <br/>\nlearning some coping skills they can use in their own lives. I have also used <br/>\nmy occasional boredom as a trigger to seek out the kids. If there’s a lull in <br/>\nmy life now I should fill it with those children who will be gone too soon. <br/>\nWelcome opportunities to learn about when and why your child asks for your <br/>\nadvice and stimulation. The threshhold of needing the parent will change over <br/>\ntime, and parents can really use knowing where it is and seeing the benefit <br/>\nin it. One complaint of parents of school kids is that communications are <br/>\nlacking or are misunderstood. Homeschoolers have the fulltime luxury of the <br/>\nchance to do better. Unschoolers have the added advantage of “counting” <br/>\nevery interaction as a learning experience. Self awareness, interpersonal <br/>\nskills, creativity and compassion all come into play when a child and a <br/>\nparent can build an uplifting memory from “I’m bored.” <br/>\n<br/>\n------------------------------------------------------------------------<br/>\n<br/>\n------------------------------------------------------------------------<br/>\n<br/>\n------------------------------------------------------------------------<br/>\n<br/>\n------------------------------------------------------------------------<br/>\nNext unschooling stop? Radical Unschooling <br/>\nOther Articles by Sandra Dodd <br/>\ne-mail the author at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a></div>","specialLinks":[]},{"userId":94797851,"authorName":"kc85022","from":"&quot;kc85022&quot; &lt;curtkar@...&gt;","profile":"kc85022","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: some help needed here","postDate":"1032826797","msgId":44560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFtb2IzZCt2OXMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMuMC41LjMyLjIwMDIwOTIzMDc0NjMxLjAwN2FiOGQwQG1haWwuYWxvaGEubmV0Pg=="},"prevInTopic":44557,"nextInTopic":44566,"prevInTime":44559,"nextInTime":44561,"topicId":44551,"numMessagesInTopic":0,"msgSnippet":"... veterans!) ... I am ... however ... unschooling). ... Dear Lee, First I d like to say that I ve visited your website and I am truly envious of where you","messageBody":"<div id=\"ygrps-yiv-2113766508\">--- In Unschooling-dotcom@y..., Lee Roversi &lt;ncfarms@a...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Aloha dear listmates-<br/>\n&gt; <br/>\n&gt; I need some help from you veterans (and maybe even some not-so-<br/>\n </span></blockquote>veterans!)<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My son, Bay, is just turned 12. He a kind, centered, precious boy. <br/>\n </span></blockquote>I am<br/>\n<blockquote><span title=\"ireply\"> &gt; feeling those old qualms about this schooling path come up for me, <br/>\n </span></blockquote>however<br/>\n<blockquote><span title=\"ireply\"> &gt; (partially brought on by an ex-husband who is not understanding <br/>\n </span></blockquote>unschooling). <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n </span></blockquote>Dear Lee,<br/>\n<br/>\nFirst I&#39;d like to say that I&#39;ve visited your website and I am truly <br/>\nenvious of where you live. It looks beautiful!! A true paradise. Our <br/>\nfamily has never visited Hawaii, not for lack of wanting! But we talk <br/>\nabout going &quot;some day&quot;. If and when we do, your Tropical B&B Cottages <br/>\nsound lovely and we&#39;ll consider staying at your farms.<br/>\n<br/>\nNow about your son Bay. He sounds so much like my boys Ben (11) and <br/>\nJon (9). My boys have never been to school and I did school-at-home <br/>\nwith the for 5 years before unschooling for the past year. I was so <br/>\nhappy to find unschooling because our homeschooling efforts were <br/>\nmaking us all miserable.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He dislikes sitting down to &#39;do&#39; math - but seems to have a good <br/>\n&gt;grasp of the way it works. &gt;&gt;<br/>\n<br/>\n </span></blockquote>This describes both of my sons. They do basically understand math. <br/>\nThey even sit down occasionally with a math curriculum and do a page <br/>\nor two. But they won&#39;t open the book again for a month or more. <br/>\nSometimes they surprise me when they do a quick calculation in their <br/>\nhead without even thinking hard - because it&#39;s relevant to them. They <br/>\nare whizzes when it comes to money and buying things they want. They <br/>\nhave it all figured out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He reads really well, but doesn&#39;t enjoy reading much (in this family<br/>\n&gt; - that is downright bizarre!) &gt;&gt;<br/>\n<br/>\n </span></blockquote>My older son Ben reads well, but also doesn&#39;t read much. He likes to <br/>\nread Calvin and Hobbes and skateboard books from the library, and <br/>\nlots of cheats that he looks up on the internet (by himself). Lately <br/>\nhe also checked out a bunch of books on How to do Card Tricks at the <br/>\nlibrary - and learned some good tricks on his own!<br/>\n<br/>\nMy younger son Jon has slowly been learning to read this past year of <br/>\nunschooling, on his own, just by reading while he&#39;s playing his <br/>\nGameboy or his computer games.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He has an electric guitar, but doesn&#39;t play<br/>\n&gt; it much and doesn&#39;t seem to want to try another instrument. &gt;&gt;<br/>\n<br/>\n </span></blockquote>Ben and Jon both started played instruments for a year and then they <br/>\njust decided they didn&#39;t want to anymore. They were playing so well! <br/>\nBen played the trumpet and Jon played the clarinet. They even played <br/>\nduets together. I was sad to see them quit playing but knew that <br/>\nmaking them play when they didn&#39;t want to anymore would ruin any fun <br/>\nthey had experienced with their instruments the year before. They do <br/>\nwant to learn to play the sax with my husband, though.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He doesn&#39;t like to write. &gt;&gt;<br/>\n<br/>\n </span></blockquote>My boys don&#39;t like to write either, except they are already working <br/>\non their Christmas lists. &lt;g&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What he likes to do is move - surf, skateboard. His greatest<br/>\n&gt; passion now is dirtbiking. &gt;&gt;<br/>\n<br/>\n </span></blockquote>Yes, Yes! My boys love roller blading, scootering and are trying to <br/>\nget better at skateboarding (it&#39;s really hard!). They love riding <br/>\nbikes and I&#39;m sure would love surfing if given a chance (we live in <br/>\nArizona). They love playing games, running, jumping, and generally <br/>\nmoving. We belong to a homeschool PE group that meets once a week and <br/>\nparticipating in that is the highlight of their week (unlike my <br/>\ntorturous memories of PE in school. LOL)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He likes the computer - plays Motocross Madness and Age of Empires <br/>\n&gt;and such with his brother and his friends. Likes his Gameboy. &gt;&gt;<br/>\n<br/>\n </span></blockquote>Yes again. They like Monster Truck Madness, Age of Empires, <br/>\nRollercoaster Tycoon, Skateboard Tycoon, and Microsoft Flight <br/>\nSimulator just to name a few. Then there&#39;s Tony Hawkes 1, 2 & 3 on <br/>\nPlaystation and Gameboy, and also many different Pokemon games for <br/>\ntheir Gameboy. They are also heavily into card collecting, even <br/>\ngetting back into Pokemon cards (thank goodness they listened to me <br/>\nwhen I talked them out of selling their collection a year ago, LOL), <br/>\nand Harry Potter cards.<br/>\n<br/>\nI&#39;ve also been trying to watch more movies with them - whatever <br/>\nthey&#39;ll watch with me. I just rented Merlin and maybe we&#39;ll see that <br/>\ntonight. And we still need to watch Monsters, Inc. that we picked up <br/>\nat Blockbuster yesterday.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He is social to the max - and is the only<br/>\n&gt; homeschooled boy his age on the entire northshore of Kauai. He likes<br/>\n&gt; television, but the good opportunities for viewing are rare. <br/>\n </span></blockquote>He likes<br/>\n<blockquote><span title=\"ireply\"> &gt; storytapes and, even more, the stories his older brother weaves for <br/>\n </span></blockquote>him all<br/>\n<blockquote><span title=\"ireply\"> &gt; the time. &gt;&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s getting redundant, I know, but yes again. They love their <br/>\nfriends and take any opportunity to play with them. They play long <br/>\nand hard. Last week after PE a few of us stayed at the park and the <br/>\nkids all chose swords (sticks) and were having sword fights for at <br/>\nleast an hour or two. They get along so well with their friends. They <br/>\neven play happily with the 6 year girl who is homeschooled and lives <br/>\nacross the street (they were doing that this morning).<br/>\n<br/>\nAnd yes, they love listening to storytapes, too, but only in the car. <br/>\nThey hate listening at home because it&#39;s too confining to have to <br/>\nstay in the same room for any length of time.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;When nothing is &#39;happening&#39; around here, he has a lament of &quot;I&#39;m<br/>\n&gt; bored - what can I do?&quot; My suggestions are often met with disdane.&gt;&gt;<br/>\n<br/>\n </span></blockquote>Can you believe that with all this activity going on I still <br/>\nhear &quot;I&#39;m bored&quot; often enough? Sometimes I&#39;ll suggest something they <br/>\ncould do or something I could do with them. Sometimes I just leave <br/>\nthem be and tell them I&#39;m sorry that they feel bored.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am feeling like he is not getting a strong educational <br/>\n </span></blockquote>experience - will<br/>\n<blockquote><span title=\"ireply\"> &gt; be &#39;weak&#39; in his language arts and math skills. (Go easy on me, <br/>\n </span></blockquote>folks -<br/>\n<blockquote><span title=\"ireply\"> &gt; these are my deep-seated fears from decades of conditioning and too <br/>\n </span></blockquote>many<br/>\n<blockquote><span title=\"ireply\"> &gt; recent conversations/attacks with ex-husband! <br/>\n<br/>\n </span></blockquote>I hear ya, I still get those feelings, too, sometimes. And I realize <br/>\nthat it only happens when I fall for the comparison trap. When I <br/>\nstart comparing them to others, I feel like they should know how to <br/>\nspell better by now, or be reading certain books, or know how to do <br/>\nthis math concept, or WHATEVER. And then I read something that <br/>\nsomeone else has written either here or at unschooling.com and my <br/>\nfears are calmed. And we can go on happily living our unschooling <br/>\nlives.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I worry that Bay is easily bored and would spend hours only<br/>\n&gt; on the computer, if he were able (we have to share one computer for <br/>\n&gt;all 4 of us, so that is not possible). &gt;&gt;<br/>\n<br/>\n </span></blockquote>My boys do have unlimited computer access because they each have <br/>\ntheir own computer, and sometimes they do spend hours on the <br/>\ncomputer, but some days it doesn&#39;t even get turned on! The same with <br/>\nTV. They love their shows like Spongebob and a few other shows on <br/>\nNICK, some on PBS, but they probably watch about 1-2 hours a day. Not <br/>\nexcessive, IMO. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Any ideas/thought/suggestions/support would be really appreciated. <br/>\n </span></blockquote>Let me<br/>\n<blockquote><span title=\"ireply\"> &gt; give you any more background, if it would help - I&#39;m really needing <br/>\n </span></blockquote>some<br/>\n<blockquote><span title=\"ireply\"> &gt; input from this great list. &gt;&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t know if what I&#39;ve written here today can help you in any way, <br/>\nbut I can tell you that I&#39;m going through many similar things with my <br/>\nboys. And as far as I can tell, they are happy - and so I&#39;m happy.<br/>\n<br/>\nBest Wishes,<br/>\n<br/>\nKarin</div>","specialLinks":[]},{"userId":117801964,"authorName":"MO Milligans","from":"MO Milligans &lt;Ozarkren@...&gt;","profile":"trozark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] some help needed here","postDate":"1032813499","msgId":44557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4xLjYuMi4yMDAyMDkyMzE1MzM1MS4wMGEwMWEzMEBlZGlzb24ucmlwaW50ZXJuZXQuY29tPg==","inReplyToHeader":"PDMuMC41LjMyLjIwMDIwOTIzMDc0NjMxLjAwN2FiOGQwQG1haWwuYWxvaGEubmV0Pg=="},"prevInTopic":44552,"nextInTopic":44560,"prevInTime":44556,"nextInTime":44558,"topicId":44551,"numMessagesInTopic":0,"msgSnippet":"... == To me, it sounds like your newly unschooled son is doing fine. He s able to save money doing jobs , he s got a passion (dirt bikes), good on computers,","messageBody":"<div id=\"ygrps-yiv-744019884\">At 07:46 AM 9/23/02 -1000, you wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Any ideas/thought/suggestions/support would be really appreciated. Let me<br/>\n&gt;give you any more background, if it would help - I&#39;m really needing some<br/>\n&gt;input from this great list.<br/>\n&gt;<br/>\n&gt;Warmly, Lee<br/>\n </span></blockquote>==<br/>\nTo me, it sounds like your newly unschooled son is doing fine. He&#39;s able to <br/>\nsave money doing &quot;jobs&quot;, he&#39;s got a passion (dirt bikes), good on <br/>\ncomputers, etc. etc., and he&#39;s *only* 12. That&#39;s way more than I was doing <br/>\nat that age, and I think I turned out okay :) Give it another year, <br/>\nbreathe, relax, and so on, and then re-evaluate. Has *he* said, &quot;This <br/>\nunschooling isn&#39;t working...fix it!&quot; ? If not, I would talk *in-depth* <br/>\nw/him about your worries. Maybe he can also help alleviate some of them. <br/>\n&lt;hugs&gt;<br/>\n<br/>\nTodd<br/>\n<br/>\n&quot;If you choose not to decide, you still have made a choice.<br/>\n  I will choose Free Will&quot; -Rush (& Todd)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://rambleman.tripod.com/index.html\">http://rambleman.tripod.com/index.html</a></div>","specialLinks":[]},{"userId":68345311,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valfitz@...&gt;","profile":"valfitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: some help needed here","postDate":"1032806295","msgId":44552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFtbm4ybityYWpnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMuMC41LjMyLjIwMDIwOTIzMDc0NjMxLjAwN2FiOGQwQG1haWwuYWxvaGEubmV0Pg=="},"prevInTopic":44551,"nextInTopic":44557,"prevInTime":44551,"nextInTime":44553,"topicId":44551,"numMessagesInTopic":0,"msgSnippet":"... veterans!) ... I am ... however ... unschooling). ******* Hi Lee... here s a bit of my background so you ll see where I m coming from. My daughter Laurie","messageBody":"<div id=\"ygrps-yiv-533759538\">--- In Unschooling-dotcom@y..., Lee Roversi &lt;ncfarms@a...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Aloha dear listmates-<br/>\n&gt; <br/>\n&gt; I need some help from you veterans (and maybe even some not-so-<br/>\n </span></blockquote>veterans!)<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My son, Bay, is just turned 12. He a kind, centered, precious boy. <br/>\n </span></blockquote>I am<br/>\n<blockquote><span title=\"ireply\"> &gt; feeling those old qualms about this schooling path come up for me, <br/>\n </span></blockquote>however<br/>\n<blockquote><span title=\"ireply\"> &gt; (partially brought on by an ex-husband who is not understanding <br/>\n </span></blockquote>unschooling). <br/>\n<br/>\n******* Hi Lee... here&#39;s a bit of my background so you&#39;ll see where <br/>\nI&#39;m coming from. My daughter Laurie is 22 and was unschooled all of <br/>\nher life. She now has a BS in Sociology and is continuing her <br/>\neducation. Her father (now my ex) pushed me to put her in school too. <br/>\nWhen she was midway through college, he thanked me for not listening <br/>\nto him. Ask him to read some books about unschooling? Mine wouldn&#39;t <br/>\nread them.. he already knew everything. (sarcasm bigtime)<br/>\n<br/>\n  When nothing is &#39;happening&#39; around here, he has a lament of &quot;I&#39;m<br/>\n<blockquote><span title=\"ireply\"> &gt; bored - what can I do?&quot; My suggestions are often met with disdane.<br/>\n<br/>\n </span></blockquote>******* I&#39;ve found that when someone says they are bored, they don&#39;t <br/>\nwant suggestions, they just want to know someone hears them. Someone <br/>\nto empathize with what they&#39;re feeling.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I am feeling like he is not getting a strong educational <br/>\n </span></blockquote>experience - will be &#39;weak&#39; in his language arts and math skills. <br/>\n<br/>\n*******If he&#39;s allowed to pursue his true interests, he will become <br/>\nstrong in language arts and math skills when he needs them. Right now <br/>\nhe&#39;s too busy to care. He&#39;s interested in motors, he&#39;ll learn math <br/>\nwithout even realizing it. A strong educational experience is not a <br/>\ngood thing when it&#39;s forced upon someone. It becomes torture.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I worry that Bay is easily bored and would spend hours only<br/>\n&gt; on the computer, if he were able <br/>\n<br/>\n </span></blockquote>******* We bought Laurie a computer at age 11. She was an avid reader <br/>\nbefore getting the computer but rarely read a book for the next eight <br/>\nyears. She was immersed in the computer, playing games all night and <br/>\nlearning how a computer works. At age 18 she built two computers and <br/>\nfully understood them. She helped professors in college with computer <br/>\nskills. She taught her Computer Basics Professor quite a few tricks. <br/>\nNow the computer is a tool and she never just sits and surfs for fun. <br/>\nA game will get her attention when she needs some chilling out time, <br/>\nbut that&#39;s it. She reads books constantly now.<br/>\n<br/>\nI think you already know this, but trust him to get what he needs <br/>\nfrom life. Tell ex is he&#39;s really concerned that there are many books <br/>\nto enlighten him.<br/>\n<br/>\nlove, Valerie</div>","specialLinks":[]},{"userId":2892732,"authorName":"Lee Roversi","from":"Lee Roversi &lt;ncfarms@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"some help needed here","postDate":"1032803191","msgId":44551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMuMC41LjMyLjIwMDIwOTIzMDc0NjMxLjAwN2FiOGQwQG1haWwuYWxvaGEubmV0Pg=="},"prevInTopic":0,"nextInTopic":44552,"prevInTime":44550,"nextInTime":44552,"topicId":44551,"numMessagesInTopic":0,"msgSnippet":"Aloha dear listmates- I need some help from you veterans (and maybe even some not-so-veterans!) My son, Bay, is just turned 12. He a kind, centered, precious","messageBody":"<div id=\"ygrps-yiv-1878139684\">Aloha dear listmates-<br/>\n<br/>\nI need some help from you veterans (and maybe even some not-so-veterans!)<br/>\n<br/>\nMy son, Bay, is just turned 12. He a kind, centered, precious boy. I am<br/>\nfeeling those old qualms about this schooling path come up for me, however<br/>\n(partially brought on by an ex-husband who is not understanding unschooling). <br/>\n<br/>\nA bit of background . . . son Sky (19) and daughter Nell (16) went to our<br/>\nlocal small Waldorf school through 6th grade . . . had really positive<br/>\nexperiences and when the options for jr/high school ran out - they came<br/>\nhome and did a curriculum for a bit, then went to Not Back to School Camp<br/>\nand were inspired to throw the whole thing out and unschool, which has<br/>\nreally gone well for them both, with me in a supportive position. Bay went<br/>\nto the same Waldorf school and really disliked it from the beginning -<br/>\nresisted the form from the get-go. So, I cajolled him for a time and then<br/>\nsaw the idiocy in that and brought him home when the signs were clear, in<br/>\n4th grade, that it was insane. He has never done a curriculum. He dislikes<br/>\nsitting down to &#39;do&#39; math - but seems to have a good grasp of the way it<br/>\nworks. He reads really well, but doesn&#39;t enjoy reading much (in this family<br/>\n- that is downright bizarre!) He has an electric guitar, but doesn&#39;t play<br/>\nit much and doesn&#39;t seem to want to try another instrument. He doesn&#39;t like<br/>\nto write. What he likes to do is move - surf, skateboard. His greatest<br/>\npassion now is dirtbiking. He has saved from his landscape maintenance jobs<br/>\nalmost enough money to buy his own! He mows and weedwhacks our entire 4<br/>\nacres. He is interested in motors and such. He likes the computer - plays<br/>\nMotocross Madness and Age of Empires and such with his brother and his<br/>\nfriends. Likes his Gameboy. He is social to the max - and is the only<br/>\nhomeschooled boy his age on the entire northshore of Kauai. He likes<br/>\ntelevision, but the good opportunities for viewing are rare. He likes<br/>\nstorytapes and, even more, the stories his older brother weaves for him all<br/>\nthe time. When nothing is &#39;happening&#39; around here, he has a lament of &quot;I&#39;m<br/>\nbored - what can I do?&quot; My suggestions are often met with disdane.<br/>\n<br/>\nI am feeling like he is not getting a strong educational experience - will<br/>\nbe &#39;weak&#39; in his language arts and math skills. (Go easy on me, folks -<br/>\nthese are my deep-seated fears from decades of conditioning and too many<br/>\nrecent conversations/attacks with ex-husband! - and, remember, his siblings<br/>\nunschooling experiences came later, when their skills/learning patterns<br/>\nwere in place.) I worry that Bay is easily bored and would spend hours only<br/>\non the computer, if he were able (we have to share one computer for all 4<br/>\nof us, so that is not possible). With the children&#39;s help, I run three home<br/>\nbusinesses, so my time is maxed out often, although I am here.<br/>\n<br/>\nAny ideas/thought/suggestions/support would be really appreciated. Let me<br/>\ngive you any more background, if it would help - I&#39;m really needing some<br/>\ninput from this great list.<br/>\n<br/>\nWarmly, Lee<br/>\nNorth Country Farms<br/>\nAn Organic Family Farm & Tropical B&B Cottages<br/>\n        . . . an eco-tourism destination . . . <br/>\nP.O. Box 723<br/>\nKilauea, HI 96754<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.northcountryfarms.com\">http://www.northcountryfarms.com</a><br/>\n808-828-1513 phone and voice mail</div>","specialLinks":[]}],"prevTopicId":44561,"nextTopicId":44571}}