{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"UNSCHOOLING.COM ONLINE NEWS Mid August 2002","postDate":"1029827525","msgId":41502,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExYi4xNTFlMjBlMS4yYTkzNDVjNUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":41501,"nextInTime":41503,"topicId":41502,"numMessagesInTopic":0,"msgSnippet":"... UNSCHOOLING.COM ONLINE NEWS Mid-August 2002 ... In this Issue: Linda Dobson on Building a Life Not Back to School Harmonious Multiplication Marilyn Burns","messageBody":"<div id=\"ygrps-yiv-1516804300\">::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS<br/>\nMid-August 2002<br/>\n<br/>\n::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\nIn this Issue:<br/>\n<br/>\nLinda Dobson on Building a Life<br/>\nNot Back to School<br/>\nHarmonious Multiplication<br/>\nMarilyn Burns on Music and Math<br/>\nNHEN Launches Membership Drive!<br/>\nPlaying with Math<br/>\nMessing Around with Math Books<br/>\nReal World Geometry<br/>\nJohn Holt on Measurement<br/>\nTrue Confessions of Alison McKee<br/>\nUnschool Friendly Conferences<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\n&quot;Your efforts may, at first, seem more like scrap lumber randomly scattered <br/>\nacross the vast universe that is your child rather than a remarkable <br/>\nstructure you watch rise, floor by measurable floor. But the Eiffel Tower <br/>\ndidn&#39;t appear overnight, and the most beautiful cathedrals of the world took <br/>\ndecades to complete.<br/>\n<br/>\nIt helps to think of yourself not as &quot;teacher&quot; the way you remember it, but <br/>\nlike the supplier whose purpose is merely making sure the builder - your <br/>\nchild - can get his hands on the necessary materials when he needs them. Be <br/>\nhappy when you make any sale, however modest. The true architect will use the <br/>\nmaterials in his own way, in his own time. <br/>\n<br/>\nSchools force a child into using his limited resources today. &quot;Build a bird <br/>\nhouse,&quot; they demand, &quot;so that we may count how many sticks you&#39;ve collected.&quot;<br/>\n<br/>\nAt home there&#39;s no need for immediate &quot;proof&quot;. Be patient. Don&#39;t measure. Who <br/>\ncan say what exquisite masterpiece your child will shape and build from the <br/>\nscraps tomorrow - or ten years from now? The more he collects, the greater <br/>\nthe structure he&#39;s capable of building. And when that structure is life <br/>\nitself, don&#39;t settle for a bird house today. Trust you&#39;ll find a castle <br/>\ntomorrow.<br/>\n<br/>\nSimply provide the materials.&quot;<br/>\n<br/>\nfrom The Art of Education<br/>\nLinda Dobson<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nNot Back to School<br/>\n<br/>\nIn late summer, when it sometimes seems that the entire universe is obsessed <br/>\nwith Back to School hoopla, new and even not-so-new unschoolers often find <br/>\nthemselves filled with doubts. Many parents feel confident in their ability <br/>\nto help their children understand almost anything, except math. &quot;But how will <br/>\nthey learn math?&quot; is one of the most common questions posed to unschoolers on <br/>\nemail lists, message boards, and in face to face conversations with the <br/>\ncurious and the hopeful. <br/>\n<br/>\nThis issue is a musing about math - how kids learn skills and how they don&#39;t, <br/>\nwhat helps, what hinders. Having fun with math. Learning to see and share the <br/>\nmath in everyday life. <br/>\n<br/>\nI&#39;ve included several longer book excerpts from favorite authors. I hope they <br/>\nsupply you with food for thought, and that you&#39;ll seek out the books to read <br/>\nfurther after you&#39;ve finished pondering this newsletter. I&#39;ve also included <br/>\nsome recent conversations on math from the Unschooling-dotcom email list. <br/>\nWant to read more? Come join the conversation at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a> <br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nHarmonious Multiplication<br/>\n<br/>\nFrom a conversation on the Unschooling-dotcom email list: <br/>\n<br/>\n&quot;... the bit about multiplication was just a side note to the division being <br/>\nrepeated subtraction. Most kids undoubtedly don&#39;t see multiplication as a <br/>\nquick way to do repeated addition either. Multiplication as far school <br/>\nlearning is concerned is just more magical mumbo jumbo like division. &quot;<br/>\nJoyce<br/>\n<br/>\n&quot;My kids know how it really works, and how to do it in their heads, but I&#39;m <br/>\npretty sure if they saw some typical 6th grade math textbook with pages of <br/>\n&quot;problems&quot; in the regular school format they wouldn&#39;t know what it was or <br/>\nwhat a person might be expected to do with it. If someone spoke the same math <br/>\nquestion in English (&quot;How many fifteens are in 300?&quot;) they could figure it <br/>\nout. <br/>\n<br/>\nI liken that to being able to sing and harmonize and to make up songs but not <br/>\nto understand a bit of musical notation.&quot;  Sandra<br/>\n<br/>\n&quot;And - SHEESH - imagine teaching musical notation to a kid who hasn&#39;t ever <br/>\nheard music?<br/>\n<br/>\nSchools teach math to kids who have no equivalent of having &quot;heard music&quot;. <br/>\nThey have no relevant context.&quot; --pamS<br/>\n<br/>\n<br/>\nTo subscribe to the Unschooling-dotcom email list send a blank email to: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-subscribe@yahoogroups.com\">Unschooling-dotcom-subscribe@yahoogroups.com</a><br/>\nOr visit the email list website at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a> <br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nMarilyn Burns on Music and Math<br/>\n<br/>\nI began taking piano lessons when I was seven or eight years old. I remember <br/>\nlearning to read notes and play scales and memorizing the sharps and flats <br/>\nfor each key. These things were basic to learning to play the piano, just as <br/>\nwe may think of arithmetic facts and procedures as being basic to learning <br/>\nmathematics.<br/>\n<br/>\nThere&#39;s a big difference, however, between the way I was taught to play the <br/>\npiano and the way I was taught mathematics. Before learning to play the <br/>\npiano, I&#39;d had many opportunities to hear music played on the piano. I&#39;d seen <br/>\npeople play the piano - in person and in movies. I&#39;d watched and listened to <br/>\nmy mother play the few songs she knew. In my very first piano lesson, I was <br/>\ninvited to learn to play a song. Making music was part of my learning, and <br/>\neach new piece of music I tackled taught me new skills and gave me the chance <br/>\nto practice what I had already learned.<br/>\n<br/>\nYes, I did practice scales, arpeggios, and other exercises in isolation from <br/>\nplaying music. But I was always clear that my goal for learning to play the <br/>\npiano was to play music.<br/>\n<br/>\nThree of my aunts came to visit regularly and showed interest in what I was <br/>\nlearning on the piano.<br/>\n<br/>\n&quot;I&#39;d love to hear you play a song,&quot; Aunt Freda would say.<br/>\n<br/>\n&quot;What piece can you play for me?&quot; Aunt Florrie would ask.<br/>\n<br/>\n&quot;Come, darling, play something on the piano,&quot; Aunt Gertie would coax.<br/>\n<br/>\nAnd I would give a short performance, pleased by their interest and bathed in <br/>\ntheir attention. I continued studying the piano all through high school, <br/>\nwhich amounted to almost ten years of lessons. Never, never, in all of those <br/>\nyears, did Aunt Freda, Aunt Florrie, or Aunt Gertie ask me to play scales or <br/>\narpeggios. It was music they wanted and expected to hear.<br/>\n<br/>\nSo who cared about my ability to play scales, arpeggios, and other exercises? <br/>\nMy piano teacher did, and she had me do so for part of my one-hour lesson <br/>\neach week. But the bulk of each lesson focused on the music I was learning to <br/>\nplay, and most of the teaching of skills - helping me with fingering, playing <br/>\ndifficult passages, interpreting the music - was done in the context of the <br/>\nmusic I was studying.<br/>\n<br/>\nWhat&#39;s the parallel with math? While I never lost sight that making music was <br/>\nthe reason for learning to play the piano, when learning math I never got <br/>\neven a glimpse of anything beyond learning skills. All I experienced for the <br/>\nfirst several years of school was a steady diet of pages of practice with <br/>\narithmetic skills, with a little bit of measurement and learning about shapes <br/>\nthrown in.<br/>\n<br/>\nI thought doing arithmetic exercises was doing math. It isn&#39;t. Doing math has <br/>\nto do with thinking and reasoning about problems or situations that call for <br/>\napplying mathematical ideas and skills. The skills are part of doing math, or <br/>\ncourse, but for a purpose, not as ends in themselves. Skills should be <br/>\nlearned in the context of problems and situations and should not exist <br/>\nisolated from the problems and situations that give them their purpose.<br/>\n<br/>\nfrom Math: Facing an American Phobia<br/>\nMarilyn Burns<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nNHEN Launches Membership Drive!<br/>\nwww.NHEN.org<br/>\n<br/>\nNHEN Mission Statement:<br/>\nThe National Home Education Network exists to encourage and facilitate the <br/>\nvital grassroots work of state and local homeschooling groups and individuals <br/>\nby providing information, fostering networking and promoting public relations <br/>\non a national level. Because we believe there is strength in a diverse <br/>\nnetwork of homeschoolers, we support the freedom of all individual families <br/>\nto choose home education and to direct such education. <br/>\n<br/>\nNational Home Education Network<br/>\nChanging the Way the World Sees Homeschooling<br/>\n<br/>\nSince its founding in 1999, NHEN, an all-volunteer organization connecting <br/>\nhomeschoolers nationwide, has evolved into a respected source of information <br/>\nfor the homeschooling community as well as the general public. Our <br/>\naward-winning website contains a wealth of firsthand information about <br/>\nhomeschooling, written from a variety of viewpoints. In keeping with our <br/>\nmission statement, NHEN espouses no one particular political agenda or <br/>\nhomeschooling philosophy.  Instead, we know that homeschooling parents can <br/>\nread all of the material and determine for themselves what is best for their <br/>\nfamily.<br/>\n<br/>\nIn response to media requests, we help reporters find accurate, balanced <br/>\ninformation about homeschooling and put them in touch with NHEN members who <br/>\nhave previously indicated a willingness to be interviewed. Information and <br/>\ninterviews provided by NHEN contacts have appeared in articles in Time, on <br/>\nNational Public Radio, and other national, state, and local media. <br/>\n<br/>\nAll homeschoolers are invited to participate in our network. NHEN membership <br/>\nis free. By joining NHEN you will add your voice to those of thousands of <br/>\nother homeschoolers who have approved our mission statement. The more <br/>\nhomeschoolers connect through our network, the better we will be able to help <br/>\neach other in our joint efforts to improve the climate for homeschooling in <br/>\nthis country; numbers matter to legislators and the media. <br/>\n<br/>\nBy joining NHEN you also send a message of appreciation to the dedicated <br/>\nvolunteers who answer questions,  provide extensive website information, work <br/>\non the newsletters and email list forums - free of charge for all. <br/>\nNHEN operates only through volunteer contributions. Once you&#39;ve joined, be <br/>\nsure to read the NHENotes and find out how you could help!  NHEN T-shirts, <br/>\nfanny packs, and tote bags are also available for sale. And, as a 501C3 <br/>\nnonprofit organization, NHEN is happy to receive a donation of any size. <br/>\n<br/>\nJoin us and help change the way the world sees homeschooling!<br/>\nNational Home Education Network<br/>\nP.O. Box 7844<br/>\nLong Beach, California 90807<br/>\nwww.NHEN.org<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nPlaying with Math<br/>\n<br/>\nFrom a conversation on the Unschooling-dotcom email list: <br/>\n<br/>\n&quot;My kids figured out multiplication by &quot;skip counting&quot; and goofing around <br/>\nwith pennies and stuff, and by me giving them a blank multiplication table <br/>\nfor them to fill in if they wanted to, as a puzzle.  I didn&#39;t give them <br/>\nterminology or time limits or reasons.  It was fun for its own sake.  And <br/>\nthey discovered the cool patterns of fives and nines and twos and threes all <br/>\non their own.&quot;  Sandra<br/>\n<br/>\n&quot;My kids learned multiplication facts by playing games too, I guess. <br/>\n<br/>\nA page of 100 numbers, ten rows of ten numbers in each row -- a &quot;Hundreds <br/>\nChart&quot; as they&#39;re usually called -- is nice to just have around &lt;G&gt;. Make <br/>\nsome copies so you have one to pull out and play with when something just <br/>\ncomes up.<br/>\n<br/>\nOne fun thing to do (if it isn&#39;t fun - don&#39;t do it) is to draw a simple <br/>\npattern in all the squares where the number is a multiple of two - draw an X <br/>\nacross the square, for example. Then - draw a different pattern, with a <br/>\ndifferent color, in all the squares where the number is a multiple of three. <br/>\nThen a different one for multiples of four -- and so on. Make the patterns <br/>\nsimple and use different colors -- as you&#39;re doing it - it is interesting to <br/>\nsee how some numbers are &quot;special&quot; -- they start looking much more fancy than <br/>\nothers -- the number twelve, for example, gets the patterns for two, three, <br/>\nfour, AND six.  It is really kind of a cool thing - and kid sometimes want to <br/>\ndo it over and over - with different colors and patterns. Again - this isn&#39;t <br/>\nan &quot;assignment - done to &quot;teach&quot; them the multiples -- it is a game. <br/>\n<br/>\nAlso - play &quot;Buzz&quot; --- we play in the car. If you&#39;re doing &quot;threes&quot; you play <br/>\nlike this:<br/>\nFirst person says: 1<br/>\nSecond person says: 2<br/>\nFirst person says: BUZZ<br/>\nSecond person says: 4<br/>\nFirst person says: 5<br/>\nSecond person says: BUZZ<br/>\nFirst person: 7<br/>\nSecond person: 8<br/>\nFirst Person: BUZZ<br/>\n<br/>\nIf you have more people you&#39;ll find some interesting things -- for example, <br/>\nif you have three people, doing &quot;threes&quot; is boring since the same person just <br/>\nsays BUZZ every time. That is enlightening - itself, but doesn&#39;t make for a <br/>\nfun game, so the kids will figure out to avoid doing numbers that don&#39;t work <br/>\nwell for whatever number of people they have playing. <br/>\n<br/>\nThen - you can make the game WAY more complicated. Do two sets of multiples <br/>\nat once when you play: &quot;BIZZ BUZZ&quot;.<br/>\n<br/>\nExample -- 5 people playing twos are BIZZ and threes are BUZZ:<br/>\nPerson 1: 1<br/>\nPerson 2: BIZZ<br/>\nPerson 3: BUZZ<br/>\nPerson 4: BIZZ<br/>\nPerson 5: 5<br/>\nPerson 1: BIZZ BUZZ<br/>\nPerson 2: 7<br/>\nPerson 3: BIZZ<br/>\nPerson 4: BUZZ<br/>\nPerson 5: BIZZ<br/>\n<br/>\nand so on.&quot;   --pamS<br/>\n<br/>\n&quot;...wondering why phonics and times tables is relevant to the *unschooling* <br/>\nlist anyway, LOL.&quot;  Rachel<br/>\n<br/>\n&quot;As an unschooler - I expect that my kids will learn to sound out words <br/>\n(phonics) and will learn to multiply (multiplication tables). Unschooling <br/>\ndoesn&#39;t mean &quot;unlearning&quot; &lt;G&gt;. I don&#39;t &quot;make them learn&quot; and I don&#39;t plan <br/>\ntheir learning in some systematic structured progressive bit-by-bit way. But <br/>\nI do have a lot of ideas and fun and interesting possibilities always at my <br/>\nfingertips -- that&#39;s how we live our lives. I treat multiplication tables as <br/>\na potentially interesting and useful thing to know or do in the same way I <br/>\ntreat riding a horse, clearing the dinner table, going to an opera, or <br/>\nreading a book. <br/>\n<br/>\nSo - you&#39;d have to know that, I guess, or you might think I was suggesting <br/>\nsitting your kid down and telling them, &quot;Now is multiplication time - please <br/>\nfill out this chart in this way using these colored pencils.&quot; No -- we&#39;re not <br/>\ndoing that. In fact, I&#39;m more likely to fool with it myself and then &quot;let&quot; <br/>\nthe kids do one too, if they ask. Or - I might say, &quot;Here - I had this cool <br/>\nidea about multiplying - wanna see it?&quot; OR - a kid might moan and groan that <br/>\nthey don&#39;t know multiplication facts and it is slowing them down in some <br/>\nother activity they&#39;re trying to pursue - so I might tell them that I have <br/>\nsome pretty fun ways in mind that can help them learn them.<br/>\n<br/>\nIt is always an offer and it is always something that they can take or leave <br/>\nor expand or cut short or whatever.<br/>\n<br/>\nI agree - a formal phonics or math program would not be appropriate to <br/>\nsuggest on an unschooling list. Thanks for pointing that out, Rachel, and <br/>\ngiving me the opportunity to clarify how I intended the multiplication stuff <br/>\nto be considered - just as something fun that kids and parents might enjoy, <br/>\nnot as a &quot;lesson,&quot; by any means.<br/>\n<br/>\nYou should have seen me sitting here drawing the spirolaterals the other day <br/>\n-- I had a bunch of kids here and after 5 minutes they were all drawing and <br/>\ncoloring too. That&#39;s just for fun, not school.&quot;  --pamS<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nMessing Around with Math Books<br/>\n<br/>\nHere are a few titles that are personal favorites on our bookshelves. <br/>\n<br/>\nHow Math Works<br/>\nCarol Vorderman<br/>\nPart of the Readers Digest &quot;Works&quot; series. Filled with things to make and <br/>\nprojects to do, math as discovery,  history and invention.<br/>\n<br/>\nMath Wizardry for Kids<br/>\nMargaret Kenda and Phyllis S. Williams<br/>\nPuzzles, projects, games and creations. Dig in!<br/>\n<br/>\nFactastic Book of Comparisons<br/>\nRussell Ash<br/>\nHow big? How many? How much? A fascinating compilation of facts and <br/>\ncomparisons covering topics from animal speeds to the size of the universe. <br/>\nFun for browsing and pondering.<br/>\n<br/>\nAnd one webpage of links to truly fascinating mathematical sites. <br/>\nGo figure! The Fascinating World of Mathematics <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hsc.org/gateway/inted03.html\">http://www.hsc.org/gateway/inted03.html</a><br/>\nHSC (HomeSchool Association of California) gateway to the web<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nReal World Geometry<br/>\n<br/>\n&quot;A friend of mine just made a big tent.  Big.  Like 18&#39; tall in the center, <br/>\n7&#39; side poles, 22 feet long or so. Big.<br/>\n<br/>\nHe&#39;s a very meticulous guy.<br/>\n<br/>\nI&#39;ve made tents, but never that big.  Still, all mine had sides out at <br/>\nangles, and roofs at angles.  <br/>\n<br/>\nI figured mine out on paper, and double-checked the measurements before I cut <br/>\nthe cloth, and they worked out fine.<br/>\n<br/>\nMy friend said (and I let him run on without comment, because he has to leave <br/>\nfor three weeks of a big medieval deal tomorrow and he was stressed enough) <br/>\nthat had the walls been straight it would have only involved geometry, but <br/>\nwith angled side-walls it was trigonometry and so he asked our friend Tomas, <br/>\na research engineer involved in astronomy or some space something, to help <br/>\nhim with the math.  So they worked it all out.  And the measurements were <br/>\nwrong.  So he had to recut the cloth, but he finally got it worked out.<br/>\n<br/>\nI &quot;don&#39;t know trig,&quot; and that&#39;s for sure.  It&#39;s something engineers do.  <br/>\nSometimes not well, apparently! &lt;g&gt;<br/>\n<br/>\nBut cloth, I can do.  And the angles and measurements are very mechanical.  <br/>\nThere&#39;s an angle from the top of the wall, and it can only go so far.  There <br/>\nare triangles involved.  They can be drawn on paper, and measured.  And the <br/>\nlong side of the triangle is just a measurement.  And the corners can be made <br/>\nout of a rectangle with the diagonal of the longest length, cut and turned so <br/>\nthe points of the triangles are both up, and the short side is toward the <br/>\nground.<br/>\n<br/>\nAnd if all else fails, and a calculation was wrong, it&#39;s easier to shorten <br/>\nside-poles or get longer poles than it is to redo all those acres (okay, <br/>\ndozens of yards) of canvas!! <br/>\n<br/>\nI&#39;ve built tents in English and with sketches.  Not trigonometry.&quot; <br/>\n<br/>\nSandra Dodd, on the Unschooling-dotcom email list<br/>\n<br/>\nTo subscribe to the Unschooling-dotcom email list send a blank email to: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-subscribe@yahoogroups.com\">Unschooling-dotcom-subscribe@yahoogroups.com</a><br/>\nOr visit the email list website at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a> <br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nJohn Holt on Measurement<br/>\n<br/>\nWhat then should we do about making the world of numbers and math accessible, <br/>\ninteresting, and understandable to children?<br/>\n<br/>\nA few good principles to keep in mind: (1) Children do not need to be <br/>\n&quot;taught&quot; in order to learn; they will learn a great deal, and probably learn <br/>\nbest, without being taught. (2) Children are enormously interested in our <br/>\nadult world and what we do there. (3) Children learn best when the things <br/>\nthey learn are embedded in a context of real life, are part of what George <br/>\nDennison, in The Lives of Children, called &quot;the continuum of experience.&quot; (4) <br/>\nChildren learn best when their learning is connected with an immediate and <br/>\nserious purpose.<br/>\n<br/>\nWhat this means in the filed of numbers and math is simply this: the more we <br/>\ncan make it possible for children to see how we use numbers, and to use them <br/>\nas we use them, the better.<br/>\n<br/>\nWhat do we adults do with numbers? We measure things with them, a huge <br/>\nvariety of things in the real world around us. Why? So that we can think <br/>\nbetter about them and make better use of them. We measure, among a host of <br/>\nother reasons, to find out whether we are sick or well; to find out whether  <br/>\nwe are doing something better than we did before; to find out which of <br/>\nseveral ways of doing this is better; to find out how strong we have to make <br/>\nthings in order to make them stand up; to find out where we are, or where <br/>\nwe&#39;re going; to find our, if we do a certain thing, what other things are <br/>\nlikely to happen as a result. And so on. We don&#39;t measure things out of idle <br/>\ncuriosity. We measure them so that we can decide things about them and do <br/>\nthings with them.<br/>\n<br/>\nSince all this is inherently interesting and important to us, it will also <br/>\ninterest children.<br/>\n<br/>\nSo we should introduce children to numbers by giving them or making available <br/>\nto them as many measuring instruments as possible - rulers, measuring tapes <br/>\n(in both feet and meters), scales, watches and stopwatches, thermometers, <br/>\nmetronomes, barometers, light meters, decibel meters, and so on. Whatever we <br/>\nmeasure in our lives and work, we should try to measure so that children can <br/>\nsee us doing it, and we should try to make it possible for them to measure <br/>\nthe same things, and let them know how we are thinking about the things we <br/>\nhave measured. <br/>\n<br/>\nChildren are interested in themselves, their own bodies, their growth, <br/>\nquickness, strength. In What Do I Do Monday? I suggested a whole range of <br/>\nexperiments that children might do to measure their own size, strength, and <br/>\nspeed, and how these things change over time and vary with different <br/>\nconditions. Thus children might measure their own respiration and pulse rate, <br/>\nthen exercise violently for a while, then measure their breathing and pulse <br/>\nrate again, then measure it at intervals to see how long it takes it to get <br/>\ndown to normal. Or children might do various tests of speed and strength, <br/>\nrunning timed distances or lifting weights or doing other exercise, and what <br/>\nhappens when they try to do this a second time, and how their performance <br/>\nvaries with the amount of rest they have, and how their speed or strength, <br/>\nand their recovery times, vary from week to week or from month to month.<br/>\n<br/>\nAside from involving numbers, all this is true science, not the passive <br/>\nscience of the schools where children are told about the wonderful things <br/>\nthat scientists have discovered, or the fake science of other schools where <br/>\nchildren do &quot;experiments&quot; to find out what is already well known, or to get <br/>\nanswers which a teacher marks &quot;right&quot; or &quot;wrong.&quot;<br/>\n<br/>\nHow Children Fail  revised edition<br/>\nJohn Holt<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nTrue Confessions of Alison McKee<br/>\n<br/>\n... when Christian was ten, he developed a keen interest in the nature <br/>\npreserve that is at our back door. During the winter months, he would just <br/>\nwander the acres. After one of these wanderings, he announced that he wanted <br/>\nto do a &quot;habitat study.&quot; Apparently, he had been scouting for a plot of land <br/>\nto study for quite some time.<br/>\n<br/>\nAs on other occasions, Christian knew what he wanted to do and had devised <br/>\nhis own plan of study. Over the next few weeks, he made repeated trips to his <br/>\nlittle plot of land in the park. Each time he returned from one of his <br/>\nexcursions, he had new and interesting things to tell us. One afternoon he <br/>\nmight tell me about a flock of geese that he;d seen heading north: a sure <br/>\nsign of spring! A week later, he might report that the temperatures were <br/>\nsomewhat cooler; therefore some of the buds had ceased opening. His reports <br/>\nwere always interesting and involved great detail.<br/>\n<br/>\nIn my eagerness to help Christian &quot;do a better habitat study,&quot; I began to <br/>\ninterfere. At my suggestion, he showed me his plot of land. It was simply a <br/>\nstretch of land next to the path, and included a piece of field, some <br/>\nlow-lying shrubs, and a small section of woods. There was nothing <br/>\nparticularly remarkable about it; it just was.<br/>\n<br/>\nI, of course, being a &quot;teacher&quot; began to cook up lots of ideas about how he <br/>\nshould do his study. I knew how such projects should be conducted! When I was <br/>\nin high school, our biology teacher had assigned just such a project, and <br/>\nlater I had helped many of my own students put together sciences projects. <br/>\nThese experiences called for the application of &quot;proper methodology&quot; and I <br/>\nwas ready to see to it that Christian was well-versed in its use. Suggestions <br/>\npoured forth. I didn&#39;t bother to ask Christian whether or not he wanted my <br/>\nsuggestions.<br/>\n<br/>\nMy first suggesting was that Christian measure his plot of land. Measuring, I <br/>\nsurmised, would lend itself to creating a scaled drawing. I knew from <br/>\nexperience that illustrations were and important part of any graded project <br/>\nand felt that Christian needed to include one in his work. Never mind the <br/>\nfact that he might come to the same conclusion on his own, or, conversely, <br/>\nnever feel that he should illustrate or share his work with anyone!<br/>\n<br/>\nChristian acquiesced. Together with his sister, we took our meter stick (all <br/>\nscientific measurements must be done in metric measure - another of my <br/>\n&quot;teacher&quot; notions) and measured the plot. Without realizing it, I was already <br/>\nlimiting Christian&#39;s project. Not only was I setting boundaries to something <br/>\nthat he had seen as free of boundaries, I was also causing him to think in <br/>\nterms of my limiting experiences of &quot;school projects.&quot;<br/>\n<br/>\nWhen we returned home, I asked Christian to draw a scaled map of his plot of <br/>\nland. Christian saw no need for this but, like a good son, he tried. Soon his <br/>\ninterest was truly on the wane. Seeing this, I once more attempted to take <br/>\ncontrol in hopes of rekindling his dying interest in his habitat study. <br/>\nBefore I had jumped in, I had noticed that Christian had been taking <br/>\ntemperature readings using the thermometer outside our bedroom window. This <br/>\nmet his needs. He simply enjoyed noting the temperature and the date and time <br/>\nof day that it was taken. Now I insisted he chart and graph his readings, and <br/>\nof course, this put a damper on his interest in keeping track of temperature <br/>\nat all. To counter this, I offered him a bribe - a nifty thermometer he could <br/>\nclip onto his jacket. Christian seemed to understand what I didn&#39;t; that the <br/>\nthermometer was not a gift, but rather an attempt to buy back his interest <br/>\nand that if he accepted the thermometer, he&#39;d be more firmly bound by my <br/>\nnotion of how he should conduct his project.<br/>\n<br/>\nAlthough the thermometer temporarily rekindled Christian&#39;s interest in his <br/>\nhabitat project, by this time the damage had been done. My schooled voice had <br/>\noverpowered Christian&#39;s intuitive idea of how to study his habitat, and as a <br/>\nresult he gave up on it. Finally, as I watched him put away his notes for the <br/>\nlast time, the light dawned; I remembered what John Holt had said in a Mother <br/>\nEarth News interview: that rewarding a child for work that is self-rewarding <br/>\neventually kills the child&#39;s interest in doing the work at all. This was <br/>\nexactly what I had done. I felt remorse when I realized that my best <br/>\nintentions to help Christian had, in fact, not helped at all.<br/>\n<br/>\nWhen I realized that we had effectively ruined Christian&#39;s habitat study, we <br/>\nsat down for some serious discussion. If we were going to continue <br/>\nunschooling, we needed to understand what had driven us to insist that <br/>\nChristian change the design of his study. Our discussions eventually led us <br/>\nto a truth that we were not readily acknowledging: in spite of our <br/>\nconvictions about the merits of unschooling, we simply didn&#39;t trust our <br/>\nchildren and their intuitions about how best to learn.<br/>\n<br/>\nAlthough we had watched our children initiate many interesting projects, any <br/>\ntime Christian or Georgina decided to do something that reminded us of our <br/>\nschool experiences, we&#39;d feel the urge to help them &quot;get it right.&quot; We&#39;d <br/>\nmeddle just a little bit with such projects, so that neither Christian nor <br/>\nGeorgina would wander too far from our understanding of how things &quot;ought&quot; to <br/>\nbe studied.<br/>\n<br/>\n&quot;I ruin Christian&#39;s interest in his habitat study&quot; from<br/>\nHomeschooling Our Children: Unschooling Ourselves<br/>\nAlison McKee<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUnschool Friendly Conferences<br/>\n<br/>\nFeeling like a fish out of water after attending a large curriculum oriented <br/>\nhomeschool convention?  The following conferences have unschooling presenters <br/>\nand participants, including many regular posters at the unschooling.com <br/>\nwebsite and email discussion list. <br/>\n<br/>\nDiversity in Education<br/>\nKeynote Speaker - Linda Dobson<br/>\nSeptember 14, 2002<br/>\nIroquois Ridge High School, Oakville, Ontario<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ontariohomeschool.org/2002conferenceframeset.html\">http://www.ontariohomeschool.org/2002conferenceframeset.html</a><br/>\n<br/>\nTexas Family Learning Conference<br/>\nKeynote Speakers - David Albert, Sandra Dodd<br/>\nOctober 4 & 5, 2002<br/>\nSheraton Brookhollow in Houston, Texas<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.angelfire.com/tx/wlr/conference.html\">http://www.angelfire.com/tx/wlr/conference.html</a><br/>\n<br/>\nLive and Learn Unschool Conference<br/>\nOctober 11 - 13, 2002<br/>\nColumbia, SC<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.schoolsoutsupport.org/index.html\">http://www.schoolsoutsupport.org/index.html</a><br/>\n<br/>\nIf you have information on other unschooling friendly conferences please <br/>\nemail the editor at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a> <br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n________________________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nwww.resourcefulhomeschooler.com<br/>\n<br/>\nWhat do you call your family? Unschoolers...Interest-Based <br/>\nLearners...Life-Long Learners...Eclectic Homeschoolers...Learner-Led <br/>\nSchoolers...Relaxed Homeschoolers...Whatever you call yourselves, The <br/>\nResourceful Homeschooler carries great books, science materials and kits, <br/>\nlearning games, and the most interesting software. Visit us at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.resourcefulhomeschooler.com\">http://www.resourcefulhomeschooler.com</a><br/>\nMaterials to involve, inspire and support independent learners of all ages!<br/>\n________________________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\n<br/>\nThe September/October issue of Home Education Magazine includes an interview <br/>\nwith Daniel Pink, author of Free Agent Nation; articles on unschooling and <br/>\ndeschooling; and a wonderful piece by the founder of the apricotpie.com web <br/>\nsite for young homeschooled writers! Check out the HEM web site for a free <br/>\nsample issue and the best subscription deals: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<br/>\nSubscriptions to Home Education Magazine are regularly $32.00 for oneyear/6 <br/>\nissues; single issue $6.50. Take advantage of our &quot;Don&#39;t Send Your Kids to <br/>\nSchool!&quot; offer, a one year subscription for only $20.00:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/ORD/_nottoschool.html\">http://www.home-ed-magazine.com/ORD/_nottoschool.html</a><br/>\n<br/>\nOr Home Education Magazine, PO Box 1083, Tonasket WA 98855; for orders: <br/>\ntoll-free 1-800-236-3278; email <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:orders@...\">orders@...</a>. MC/Visa cards <br/>\naccepted.<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nFinal Thought<br/>\n<br/>\n&quot;Computation (routine calculation) is to mathematics as spelling is to <br/>\nliterature. It has value in itself, but it is no substitute for the real <br/>\nthing.&quot;<br/>\n<br/>\nPatricia Kenschaft<br/>\nMath Power: How to Help Your Child Love Math, Even if You Don&#39;t<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThanks for reading the Unschooling.com newsletter! Feel free to forward this <br/>\nnewsletter to all your friends, your local support group, and your <br/>\nmother-in-law!<br/>\n<br/>\nTo subscribe, visit our web site at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> or send an <br/>\nemail to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words subscribe <br/>\nunschooling-newsletter followed by your name@your address.com in the body of <br/>\nthe email. (e.g. subscribe unschooling-newsletter youremailaddress). <br/>\n<br/>\nTo unsubscribe, send an email to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words <br/>\nunsubscribe unschooling-newsletter followed by your <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:name@...\">name@...</a> in <br/>\nthe body of the email. (e.g. unsubscribe unschooling-newsletter <br/>\nyouremailaddress). <br/>\n<br/>\nTo change the address at which you receive the newsletter, unsubscribe your <br/>\nold address and then subscribe with your new one.<br/>\n<br/>\nSee you in September!<br/>\n<br/>\nDeborah A Cunefare, Newsletter Editor<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:newsletter@...\">newsletter@...</a><br/>\n<br/>\nUnschooling.com is a service of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":41498,"nextTopicId":41506}}