{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"WDVYDiJdLEAQ6AIAns4DrYxvFO6MjIW3P2UCsV77Zwog-zNZUy1YkMLIr--YntD8daY0-SH5PMTtGF713Z6bVRtMY6PANw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japan news: Homelearning in Thailand","postDate":"973596154","msgId":14027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMTA3MTEyMS5VQUExOTkzMkBzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":14026,"nextInTime":14028,"topicId":14027,"numMessagesInTopic":0,"msgSnippet":"Hi everybody, By popular request, I am sharing with you the following (rather positive) story about homelearning in Thailand. The story originally appeared in","messageBody":"<div id=\"ygrps-yiv-139487654\">Hi everybody,<br/>\n<br/>\nBy popular request, I am sharing with you the following (rather positive) <br/>\nstory about homelearning in Thailand.<br/>\n<br/>\nThe story originally appeared in a Japanese newspaper recently, and was <br/>\nfeatured in our Japan news digest for last week. The Japanese press as of <br/>\nlate has been generally receptive to, and respectful of, the practice of <br/>\nhomelearning -- both in and out of Japan. This story is further evidence <br/>\nof that.<br/>\n<br/>\nThe Daily Yomiuri newspaper typically does not maintain its website links <br/>\nfor very long, and since some people have been asking to see the story in <br/>\nits entirety, I repost it here strictly for informational purposes.  <br/>\n<br/>\nHope you enjoy it,<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nOsaka, Japan<br/>\n<br/>\n----------------------------------- <br/>\n<br/>\n[The Daily Yomiuri - Monday, 30 October 2000]<br/>\n<br/>\n<br/>\nPARENTS IN THAILAND EXPERIMENT WITH DO-IT-YOURSELF EDUCATION<br/>\n<br/>\n<br/>\n[by] Seiji Hasegawa<br/>\nYomiuri Shimbun Correspondent<br/>\n<br/>\nBANGKOK -- Last November, the Thai government introduced a home school <br/>\nsystem that allows parents to educate their children at home. Since then, <br/>\na total of 50 families, either dissatisfied with the cramming style of <br/>\nschool education, fearing the spread of drugs among students or trying to <br/>\nkeep closer contact between family members, have started teaching their <br/>\nchildren at home.<br/>\n<br/>\nYutthachai Chalermchai, a 45-year-old magazine editor who works from his <br/>\nhome in Bangkunon, 20 kilometers south of Bangkok, is one of the <br/>\npioneering parents. His two sons, 14-year-old Saipan and 12-year-old <br/>\nSarntor, decided in May to study at home instead of going to school.<br/>\n<br/>\n&quot;I was disappointed in the schools, which put too much emphasis on <br/>\ncramming knowledge. They don&#39;t respect children&#39;s opinions, so it is <br/>\nimpossible for children to learn at school how to think or live on their <br/>\nown,&quot; Yutthachai explained. He cut his work hours in order to make more <br/>\ntime for his sons.<br/>\n<br/>\nNow their typical day starts early in the morning with walking and <br/>\nswimming for exercise. Later, they visit a science museum and participate <br/>\nin various volunteer activities to learn about politics, economics and <br/>\nsocial studies in a direct way. Yutthachai takes charge of his sons in <br/>\nall these activities.<br/>\n<br/>\nHis wife is responsible for teaching them English, and the boys learn <br/>\nmathematics from Yutthachai&#39;s dentist friend and Buddhism and traditional <br/>\nThai music from their grandfather.<br/>\n<br/>\n&quot;We have come closer to each other and have more conversation than <br/>\nbefore. I also noticed my sons have developed a stronger sense of <br/>\nresponsibility through participating in volunteer activities. They have <br/>\nenough academic skills, too,&quot; Yutthachai explained.<br/>\n<br/>\n&quot;I used to do only what the teachers told me to do when I was at school. <br/>\nNow I can try my hand at all sorts of things. I can make friends with <br/>\npeople of different ages through the volunteer activities,&quot; Sarntor said.<br/>\n<br/>\nThailand revised its education law last November and granted equal status <br/>\nfor home schools and ordinary schools. If parents apply to the Education <br/>\nMinistry, the ministry decides whether the applicants are capable of <br/>\nproviding education at home. This depends on what ideas and environment <br/>\nthe parents can provide for the children, not on the parents&#39; academic <br/>\nbackgrounds.<br/>\n<br/>\nThe home school curriculum is left up to the parents. If they provide the <br/>\nchildren with six years of primary school education, three years of <br/>\nmiddle school and three years of high school, as in ordinary government <br/>\neducation, then the children are regarded as having completed ordinary <br/>\nschooling and are allowed to take entrance examinations for universities.<br/>\n<br/>\nHowever, it is difficult to ensure that children educated at home reach <br/>\nan adequate academic standard. The ministry is discussing detailed <br/>\nregulations such as obliging the parents to submit to regular inspections <br/>\nby ministry officials.<br/>\n<br/>\n&quot;Parents have the right to educate their own children. We would like to <br/>\nkeep an eye on the home school system as an experiment for education <br/>\nreform,&quot; a ministry official in charge of the project said.<br/>\n<br/>\nChotchoeng Chutinthorn, a 55-year-old medical doctor living in Bangkok, <br/>\nis credited with starting the first home school in the nation. He <br/>\neducated all three of his children at home.<br/>\n<br/>\n&quot;When I started, it was completely illegal. But I don&#39;t regret what I <br/>\nhave done. Some people say children who have not experienced group <br/>\nbehavior cannot adapt to society, but my children have grown up without <br/>\nany mental, physical or moral problems,&quot; Chotchoeng said, emphasizing his <br/>\nsuccess.<br/>\n<br/>\nHe now travels the country to give talks about his experiences.<br/>\n<br/>\nHowever, the home school system may be something to which only the rich <br/>\ncan aspire. &quot;The idea of home-schooling is wonderful in the sense that it <br/>\nenables parents to provide their children with the best educational <br/>\nopportunities,&quot; said an official of the education policy research <br/>\ninstitute at Chulalongkorn University in Bangkok. &quot;But I am not sure if <br/>\nthe system is suitable in this society, in which it is common for both <br/>\nmembers of a couple to work outside the home.&quot;<br/>\n<br/>\nThe nation&#39;s experiment in educational reform has just started out, and <br/>\nit will be several years before anyone can judge whether it has been <br/>\neffective.<br/>\n<br/>\n<br/>\n[Copyright 2000 The Yomiuri Shimbun]</div>","specialLinks":[]}],"prevTopicId":14015,"nextTopicId":14003}}