{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"teach vs learn","postDate":"1095708474","msgId":99705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2LjQxNWM0MTIyLjJlODA4OTNhQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":99704,"nextInTime":99706,"topicId":99705,"numMessagesInTopic":0,"msgSnippet":"One of my favorite essays by Sandra is the one on teaching vs  learning---how teaching can end up just being a song and dance if the  learner isn t receptive. ","messageBody":"<div id=\"ygrps-yiv-124691907\">One of my favorite essays by Sandra is the one on teaching vs  learning---how <br/>\nteaching can end up just being a song and dance if the  learner isn&#39;t <br/>\nreceptive.  <br/>\n <br/>\nI was recently explaining something along the same lines and realized that  <br/>\nit can be something even deeper.<br/>\n <br/>\nI&#39;ve mentioned before about a parenting class I took at Cameron&#39;s  <br/>\nschool---way back when he was still in school. As usual, the people who attended  the <br/>\nparenting classes (by choice) are the ones that need it the least!  &lt;G&gt; But <br/>\nthere were still a few....<br/>\n <br/>\nOne was Margaret. She had two daughters---like six and 11 or so. I forget  <br/>\nages exactly.<br/>\n <br/>\nOne of her examples of her child&#39;s disregard for her authority (!) was  that, <br/>\nin the mornings, as they pulled out of the drive-way, she would &quot;ask&quot; her  <br/>\nolder daughter to get out and toss the newspaper on her elderly neighbor&#39;s  <br/>\nporch. The daughter had NO desire to accomodate, but after threats and bribes,  <br/>\nshe&#39;d get out and begrudgingly pick up the paper and put it on the porch. It was <br/>\n a fight every single morning. Margaret wanted a way to get the daughter to  <br/>\npick up the paper *on her own*.<br/>\n <br/>\nWithholding allowance, grounding, other punishments/threats were suggested.  <br/>\nI offered that she should just go out, cheerfully place the paper on the <br/>\nporch,  and get back in the car, and MODEL the behavior she was after---for a long <br/>\ntime.  She should also mention how much she likes Mrs. SoandSo and how hard it <br/>\nis for  her to walk so far for her paper. Maybe how good it makes her feel to <br/>\nbe  doing something good for Mrs. SoandSo. She did---with good results,  <br/>\nespecially from the younger daughter.<br/>\n <br/>\nMy point is this: She was looking to TEACH her daughter that helping others  <br/>\nis a nice way to be. What the daughter was LEARNING, on the other hand, was <br/>\nthat  bullying another person is the way to get what you want.<br/>\n <br/>\nIn school, my history teacher thought that he was TEACHING me about  <br/>\nElizabethan England. In reality, I LEARNED that history sucks! I actually love  many <br/>\nperiods in history, just not *his* favorite time period. By spending so  much <br/>\ntime there, he turned me off history altogether. Took me a long time to  <br/>\n&quot;re-learn&quot; that history is fascinating.<br/>\n <br/>\nParents think that they are TEACHING respect and obedience by spanking  their <br/>\nkids. In reality, what the children LEARN is that the bigger and meaner  you <br/>\nare, the more power you can wield.<br/>\n <br/>\nParents think that TEACHING their children to do chores will result in  <br/>\nindustrious, responsible children. In reality, the children LEARN that they can  <br/>\nmake someone else clean ---or expect someone else to do it. By  watching you *do <br/>\nfor* them, they LEARN that cleaning/helping/doing is a  pleasant and joyful <br/>\nthing.<br/>\n <br/>\nWhat is TAUGHT and what is LEARNED can be two completely different  things.<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":99466,"nextTopicId":99699}}