{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Kitty","from":"&quot;Kitty &quot; &lt;nord.sky@...&gt;","replyTo":"LIST","senderId":"YICW9sddRP4p6ZXQqJD8R54bGzrF9n5ZfMQS0K_Fl0RPkfucWHo-pHOxkIhUfyMLX4vHfyDKqvCAx-VdnLSb4MUONMl-rTpK","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling teens out there?","postDate":"976055002","msgId":14379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwanBzcStybm9wQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14378,"nextInTime":14380,"topicId":14379,"numMessagesInTopic":0,"msgSnippet":"Hello there! I m Kitty Allie, aged 15 (16 tomorrow!) unschooler, and I m looking for similar minded and aged unschoolers to correspond with. I m a native of US","messageBody":"<div id=\"ygrps-yiv-798571797\">Hello there! I&#39;m Kitty Allie, aged 15 (16 tomorrow!) unschooler, and <br/>\nI&#39;m looking for similar minded and aged unschoolers to correspond with. <br/>\nI&#39;m a native of US (New York state!). I am a very artistic type of <br/>\nperson (opposed to other types), I love to draw, inks, pencil, <br/>\nwatercolour, oil, collage and charcoal are my favorite mediums. I also <br/>\nlove to look at art, contemporary and Renaissance are my favourite <br/>\nperiods, but I love it all! I&#39;m a writer of poetry, plays, and short <br/>\nstories. I would love to hear from someone who likes to write (though <br/>\nI&#39;d love to hear from everyone else too!), I like to discuss and share <br/>\nwritings. I also enjoy fashion, following contemporary through it&#39;s <br/>\ncrazy stages, and also historical fashion (particularly the 20th <br/>\ncentury). I have a growing wardrobe of historical costume, mainly of <br/>\nthe 20s, my favourite decade.  I am a very comical person but I enjoy <br/>\nhaving a good debate on political, religious, governmental, the media <br/>\n(better watch out on that subject, you&#39;ll get me going ; ), anything! <br/>\nWhen I have a chance I get in as much reading as possible, all kinds of <br/>\nsubjects. I love modern American history, short stories, poetry, <br/>\nrealistic-fiction, non fiction, whatever that come along my way that I <br/>\nhave an interest in. On my reading table now is: (along with my <br/>\njournal) `An American Tragedy&#39; by Dreiser and the `Beak of the Finch&#39;- <br/>\nthat new book on evolution. Very good books I must say! I am also a <br/>\nvery outdoorsy person: skiing, biking, hiking, windsurfing, canoeing, <br/>\nswimming I do in season (and sometimes out). I&#39;m big on traveling, <br/>\nthough I don&#39;t get nearly enough of it. (My most recent love is Paris. <br/>\nSigh.) I enjoy theater a lot, though I don&#39;t get to perform in it much, <br/>\nI am wild about seeing it, I prefer it to movies. In my opinion there <br/>\nare better points and cultural comics made in the theater form. In the <br/>\nmedia (general TV and film) it is for a broader range, and are more set <br/>\non raking in the cash than making something worth viewing. I live on <br/>\nmusic (and laughter), my favorite bands being Guster, Our Lady Peace, <br/>\nand the Beatles... the list goes on, though I like all different kids <br/>\nof music including hand drumming and piano (Keith Jarett is great!). If <br/>\nyou have a good sense of humor and anything in common with me- or if <br/>\nyou just want to say hi- write me at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nord.sky@...\">nord.sky@...</a>. Love ya <br/>\nall, Kitty</div>","specialLinks":[]}],"prevTopicId":14371,"nextTopicId":14380}}