{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Help with specific problem","postDate":"1353620061","msgId":69690,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTM2MjAwNjEuNDA4OC5ZYWhvb01haWxOZW9Ad2ViMTg2MTAzLm1haWwuaXIyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGs4bGJyayt0dXUyQGVHcm91cHMuY29tPg==","referencesHeader":"PGs4a2JlbCt0MHV0QGVHcm91cHMuY29tPiA8azhsYnJrK3R1dTJAZUdyb3Vwcy5jb20+"},"prevInTopic":69687,"nextInTopic":0,"prevInTime":69689,"nextInTime":69691,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"... Be with your children. Don t look to her to place the blame on, look to being nearer to her as much as possible. Time, your time, your direct attention","messageBody":"<div id=\"ygrps-yiv-255567152\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;It&#39;s not that I want her to admit wrong necessarily, but I do admit to feeling upset when she has really hurt someone&#39;s feelings or been very rude to them; I know I feel helpless, and I think that makes me less able to handle the situation in the best way possible - ie in the way she might most likely be receptive to.&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Be with your children. Don&#39;t look to her to place the blame on, look to being nearer to her as much as possible. Time, your time, your direct attention will go the furthest, in my experience, to making these events less likely to occur. <br/>\n<br/>\nI was at the grocery store yesterday and overheard a Dad saying to his two children &quot;How many times do I have to tell you?...&quot; and I thought, &quot;until you learn that what you are telling them isn&#39;t something they are ready to hear.&quot; It wasn&#39;t his two little boys fault that he had to keep repeating himself. They were little, standing up in the grocery cart little. They just couldn&#39;t understand what was being required of them. So they were getting yelled at, in the sotto voce, public place, yelling for the failing of their parent to fathom his children&#39;s limitations.<br/>\n<br/>\nYour daughter isn&#39;t receptive at this point to your exhortation that she behave in one way or the other. She isn&#39;t capable, yet. She isn&#39;t ready to be on her own with her sibling as much as you are asking her to be. Instead of getting frustrated at her, recognise your responsibility as her parent to change your game plan, to make it easier for her to not have such horrible interactions with someone else. It isn&#39;t any fun for her. It isn&#39;t a joyous game of shout and hit. It is a miserable moment of frustration and anger and reaction. Make it easier for those moments not to happen. Be there more. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: Help with specific problem","postDate":"1353601849","msgId":69687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFMTQ3NEVDLTVFMkUtNDNGQS05MkFBLUFFQjlENTM5NTM4M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs4bGJyayt0dXUyQGVHcm91cHMuY29tPg==","referencesHeader":"PGs4bGJyayt0dXUyQGVHcm91cHMuY29tPg=="},"prevInTopic":69683,"nextInTopic":69690,"prevInTime":69686,"nextInTime":69688,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"-=- On the way home my oldest asked me why they are such jerks and why they seem to have such a problem with being nice or even letting other people be nice. I","messageBody":"<div id=\"ygrps-yiv-1168249586\">-=- On the way home my oldest asked me why they are such jerks and why they seem to have such a problem with being nice or even letting other people be nice. I didn&#39;t have an answer. My husband and I have talked about that tendency in them for a while but it never quite stood out like it did after my oldest pointed it out to me and articulated it the way she did. It caused me to have one of those big huge light bulb moments and now we, as a family, are talking about how to limit our contact with them further without hurting feelings or causing too much of a rift. -=-<br/>\n<br/>\nMaybe you could write a note to the mom of that family saying that you&#39;re trying to get away from that cynical, casually insulting way of being.  (Or whichever parent you&#39;re related to or trust more.)   <br/>\n<br/>\nI did write to my sister once after a visit showed clearly how differently my kids were being rasied from hers .  That one had to do with alcohol-induced insults and rants, and their kids ignoring a drunken argument while mine was really afraid.<br/>\n<br/>\nIt SHOULD be something to be afraid of, but her kids were used to it.  <br/>\nThat&#39;s when they were all very young, three and four and that.  <br/>\n<br/>\nI expected the letter to be an explanation of why we weren&#39;t going to visit for a while, because I didn&#39;t want my kids to be around the kind of alcoholic behavior my sister and I had experienced.  What happened was my sister and brother-in-law stopped drinking, for many years.<br/>\n<br/>\nIt&#39;s possible that if you write down your concerns and a few examples, that other family might become more aware.  Or they might make fun of you behind your back for being too happy.    Either way, you&#39;re better off.  One makes more lives better.  The other might keep you from feeling that you&#39;ve overreacted.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"casouthworth","from":"&quot;casouthworth&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Help with specific problem","postDate":"1353593524","msgId":69683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs4bGJyayt0dXUyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs4a2JlbCt0MHV0QGVHcm91cHMuY29tPg=="},"prevInTopic":69681,"nextInTopic":69687,"prevInTime":69682,"nextInTime":69684,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"... One of the things that helped me to move beyond that was to look at my own childhood and pay attention to who I am/was around. As a child, there was an","messageBody":"<div id=\"ygrps-yiv-750248136\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;sometimes I start asking for too much in return (agreement, acknowledgement, or whatever).&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>One of the things that helped me to move beyond that was to look at my own childhood and pay attention to who I am/was around. As a child, there was an expectation that if I did something wrong, I had to apologize and be held accountable for my behavior. Even if I wasn&#39;t sorry, there was an expectation that I should apologize. There was no help for doing better. It was me being called out on something I did and then it was over-analyzed and everyone made a big deal out of it. It seemed like one screw up required a whole lot of reparations and I was never allowed to forget those screw ups. Coming from that required me to really think about how I felt in those moments. A small screw up is a small screw up. I don&#39;t need to make a big deal out of it. I realized that a lifetime of people telling me what not to do and calling me out on stuff didn&#39;t make me a better person. If anything, it made me worse. Realizing that made a huge difference because it removed the element of fear. It stopped me from thinking &quot;If I don&#39;t do this, then my child will grow up and be &lt;fill in blank&gt;.&quot;<br/>\n<br/>\nThe other part of the equation was to look at who I was spending time with on a regular basis. My family of origin is great but one of their biggest flaws is the inability to say nice things to each other on a regular basis. I never realized it because I grew up with it. That kind of snotty, rude behavior had been so normalized during my childhood that it took my oldest pointing it out to me. For the longest time I wondered what I was doing wrong. I kept trying all of these different things to be nicer. I was trying to be deliberate in my thoughts and actions but I kept slipping up. The final piece of the puzzle fell into place earlier this week. And that was the fact that my family of origin mocks people that are nice. How in the hell could I make any real progress without realizing that and trying to minimize being with them even more. We were all sitting in the yard talking about stuff and my oldest daughter said, Mom, I don&#39;t want anything for Christmas. When I asked her why, she said, &quot;Because I have you as a mom and you are awesome.&quot; My nephew said, &quot;Hey, you wanna kiss my ass too.&quot; My oldest was a bit confused for a second because she was being sincere. My nephew said a few other things about it and my daughter ended up agreeing and saying okay, yeah, whatever, I was kissing her ass just to get her cousin to shut up. We left not long after that. On the way home my oldest asked me why they are such jerks and why they seem to have such a problem with being nice or even letting other people be nice. I didn&#39;t have an answer. My husband and I have talked about that tendency in them for a while but it never quite stood out like it did after my oldest pointed it out to me and articulated it the way she did. It caused me to have one of those big huge light bulb moments and now we, as a family, are talking about how to limit our contact with them further without hurting feelings or causing too much of a rift. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;It&#39;s not that I want her to admit wrong necessarily, but I do admit to feeling upset when she has really hurt someone&#39;s feelings or been very rude to them; I know I feel helpless, and I think that makes me less able to handle the situation in the best way possible - ie in the way she might most likely be receptive to.&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Here is a question to ponder without answering: Is this about you or your daughter? I don&#39;t like seeing anybody&#39;s feelings get hurt. I don&#39;t like it when anybody is mean or rude. I am not sure quite how to articulate this but part of the problem was that I used to think of my kids as extensions of me, which meant that I took everything they did way too personally. There is a discussion on the Facebook page about being your child&#39;s partner. It is difficult to be somebody&#39;s partner if I am caught up in my feelings and how my children&#39;s behavior reflects on me rather than focusing on them being individuals that need my help. (Not sure if that makes much sense.)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;It isn&#39;t just that I&#39;m embarrassed by the behaviour, it is also that since we don&#39;t see those people often (or in the case of a stranger, never again), I feel like there will be less chance to make amends, although I have sometimes been able to make apologies for the behaviour after the fact.&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Is there something about the people that you are seeing that is stressing out the kids and causing them to behave in ways that are not very nice? That is another big factor that my husband and I try to pay close attention to when we notice the kids being rude. Are the people that we are seeing being rude to the kids? Do we need to reconsider seeing certain people? There are some people that tend to stress my kids out because they are too in your face or not very nice. Since these are family members, we try to discuss whether or not we even want to see those people before going. Sometimes the answer is yes and sometimes it is no. If it is somebody you know, give them a call or send them an e-mail to apologize. If it is a stranger, offer a quick apology and get the hell out of there as quickly as possible. Don&#39;t sit and dawdle fumbling over an apology. Excuse yourself from the situation. If the girls are saying and doing things that are inappropriate, I will round them up and excuse ourselves from the situation with something like, &quot;I am so sorry. Looks like we need to get something to eat or take a break.&quot; And then leave. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;With her, I am concerned more about her words and actions causing hurt feelings; with him, I am concerned about him causing physical hurt or damage.&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>It might help to give both of them lets of space to use words or physical actions. I say this because we have done some role playing here. It wasn&#39;t really intentional but at some point I got a bit frustrated because one of the girls said something mean to me. I crossed my arms and pretended to pout and said something like, &quot;I think I want to cry now. That was mean.&quot; It was a playful goofy thing and it gave the girls the opportunity to experiment with words (good and bad). My initial reaction was to be angry and hurt and provide criticism. After breathing, I decided to lighten up and get silly with it. There have been lots of times when I get really frustrated and decide to channel my energies into something silly or fun or lighthearted. Every situation doesn&#39;t have to be turned into a learning moment. Really, what is it going to hurt if I let some things slide?<br/>\n<br/>\nMy girls have expressed frustration at the fact that we try to be nice and loving to each other but other people, like other family members, mock us for that. <br/>\n<br/>\nNow, we will sometimes intentionally role play bad behaviors just for fun. And I see them doing it in their play together. Now, when I see/hear them saying/doing things that I think are mean, I ask if they are all okay with what is going on. That is another consideration to think about: Am I making things bigger than they really are? <br/>\n<br/>\n<br/>\nConnie</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with specific problem","postDate":"1353587999","msgId":69681,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZEMEM3MzhGLTkxMUItNDcwOC1CQzNCLTYzRTY5NkFFRDRGN0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGs4a2JlbCt0MHV0QGVHcm91cHMuY29tPg==","referencesHeader":"PGs4a2JlbCt0MHV0QGVHcm91cHMuY29tPg=="},"prevInTopic":69679,"nextInTopic":69683,"prevInTime":69680,"nextInTime":69682,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"... It will help to realize she can t figure out how to meet her need AND be kind. You ve told her what not to use. You may have told her what to use. But","messageBody":"<div id=\"ygrps-yiv-1655279768\">On Nov 21, 2012, at 11:59 PM, apprentice_mom wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think sometimes I start asking for too much in<br/>\n&gt; return (agreement, acknowledgement, or whatever)<br/>\n<br/>\n </span></blockquote>It will help to realize she can&#39;t figure out how to meet her need AND be kind. You&#39;ve told her what not to use. You may have told her what to use. But getting those tools to actually work takes a great deal of skill as well as the other party willing to cooperate.<br/>\n<br/>\nThere are wars going on because *adults* can&#39;t figure out how to get other adults to give them what they want. Just knowing you shouldn&#39;t hit isn&#39;t enough. Knowing you should use words isn&#39;t enough. Especially since the easiest-to-understand use of words generally tell the other person they need to give up what they want so you can get what you want. Negotiating anything more is incredibly complex!<br/>\n<br/>\nThe beauty of Sandra&#39;s suggestion is it starts with talking which is the skill most useful for a lifetime. If that doesn&#39;t work -- and usually it won&#39;t just as first &quot;walking&quot; usually looks more like crawling or scooting or, in my daughter&#39;s case, sitting gathering data about walking ;-) -- then it moves onto something really easy to grasp: getting an adult to help.<br/>\n<br/>\nThe hardest part will be learning to handle the emotions of wanting results *now*. And that too will take time.<br/>\n<br/>\nHitting or whatever she chooses is fast, easy to grasp and often works. She&#39;s not thinking ahead to consequences. She&#39;s seeing the direct path from A to B that works and rejecting the convoluted path you want her to use that she can&#39;t figure out how to make work.<br/>\n<br/>\nWhat she needs is someone who focuses on helping her get her wants and needs met rather than someone who focuses on how she&#39;s going about it. Stop her if she&#39;s hurting, of course. Soothe the other child, of course. Then focus on kind, respectful, safe, doable ways for her to get what she wants (or an acceptable substitute). She needs to see skilled people doing what she was trying to do in order to figure out how to eventually do it herself. She needs simple ideas she can try herself. (And it&#39;s not a simple process. It can take years. Do as much as she needs you to do.)<br/>\n<br/>\nHave you read Ross Greene&#39;s The Explosive Child?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/JCilMW\">http://amzn.to/JCilMW</a><br/>\n<br/>\nAnd Raising Your Spirited Child Rev Ed: A Guide for Parents Whose Child Is More Intense, Sensitive, Perceptive, Persistent, and Energetic by Mary Sheedy Kurcinka<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/IKBN4R\">http://amzn.to/IKBN4R</a><br/>\n<br/>\nThose should give you some insights and tips.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":411981224,"authorName":"apprentice_mom","from":"&quot;apprentice_mom&quot; &lt;justine@...&gt;","profile":"apprentice_mom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Help with specific problem","postDate":"1353560341","msgId":69679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs4a2JlbCt0MHV0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQxNjE2QzZCLTQ5NkItNDEzQi05NDRBLTg4RTNENjA2N0MwN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69678,"nextInTopic":69681,"prevInTime":69678,"nextInTime":69680,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"... That s a really good idea.  I have tried to do this, but I think sometimes I start asking for too much in return (agreement, acknowledgement, or whatever).","messageBody":"<div id=\"ygrps-yiv-1064744817\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Instead of telling her what she did, and what to do about it, mabe try asking her what happened.  Hear her side of it.  If her logic and perception are off, she might figure that out as she talks it through with you.  Maybe you could say &quot;Next time, maybe you could try...&quot; and make a suggestion.  And let her think about it without any promises or conclusions being reached.  Don&#39;t look at the one past incident so much as the thoughts she had (or might try to have in similar situations in the future).<br/>\n<br/>\n </span></blockquote>That&#39;s a really good idea.  I have tried to do this, but I think sometimes I start asking for too much in return (agreement, acknowledgement, or whatever).  It&#39;s not that I want her to admit wrong necessarily, but I do admit to feeling upset when she has really hurt someone&#39;s feelings or been very rude to them; I know I feel helpless, and I think that makes me less able to handle the situation in the best way possible - ie in the way she might most likely be receptive to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The way I handled disagreements is here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/fighting\">http://sandradodd.com/peace/fighting</a><br/>\n&gt; It still works, with my kids grown, and I&#39;ve seen them do it with others over the years (friends or siblings having disagreements).<br/>\n<br/>\n </span></blockquote>Completely helpful.  I&#39;ve read this over many times, and try to do this with both kids, but it is helpful to read it again and try again to do better with this.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You&#39;ve trapped her, it sounds like.  Be her partner, not her adversary.<br/>\n&gt; But be your son&#39;s partner, too.  If she has hurt his feelings, soothe him, protect him, let her see you being kind and fixing her mess without telling her &quot;Look.  I&#39;m fixing a mess *you* made.&quot;<br/>\n<br/>\n </span></blockquote>Ok this is definitely something that I can see her thinking, especially if I am feeling flustered or upset about the incident at the time.  I do much better when it is just the two of them, or family at home; it is harder for me when the hurtful behaviour is directed at other people outside the home with whom we have much less interaction.  It isn&#39;t just that I&#39;m embarrassed by the behaviour, it is also that since we don&#39;t see those people often (or in the case of a stranger, never again), I feel like there will be less chance to make amends, although I have sometimes been able to make apologies for the behaviour after the fact.  (That is something I do on my own; it not something I ask her to do, or even necessarily tell her that I have done.)<br/>\n<br/>\nAs for &quot;fixing the mess *you* made&quot;, yes, definitely I don&#39;t want her to feel that way.  I know that part of the problem is that she gets embarrassed quite easily, which tends to result in anger...so, yes, I do want to be careful that I am not creating even more difficulty for her.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you set it up so that if she does what you want you win and she loses, she will be upset either way.  Think of it as coaching her, helping her be the kind of person SHE would like to be.  Coaching rather than controlling.<br/>\n<br/>\n </span></blockquote>Yes, this is EXACTLY what I want to do!  I just need to get better at doing it! :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Her younger brother (4) is also a highly emotional and very high energy person (there are wonderful times of play together, but also some periods very intense conflict).-=-<br/>\n&gt; <br/>\n&gt; Don&#39;t be too far away.  That&#39;s the age difference of me and my sister.  Don&#39;t leave your daughter &quot;in charge&quot; of the younger sibling.  Be there when the conflict begins, not after it&#39;s very intense.<br/>\n<br/>\n </span></blockquote>Absolutely!  Although I wrote specifically about my daughter, there is definitely another side to the equation with my son.  Even though he is only 4, he is also exceptionally verbal, highly emotional, and a kid who tends to act out physically very quickly when happy, angry, bored, well, you get the idea.  With her, I am concerned more about her words and actions causing hurt feelings; with him, I am concerned about him causing physical hurt or damage.  I absolutely do not ever leave her &quot;in charge&quot; of him; that would definitely not be fair to her at all in the circumstances. I was the oldest and my parents never made me feel like I was in charge of my younger sibling either.<br/>\n<br/>\nI do try to always stay very physically close so that I can intervene; I agree that is absolutely key.  I am lucky that my parents live with us (and are completely supportive of unschooling).  Since my parents are around, things that need doing during the day get done, and I can make sure I am right there all the time, although it can still become intense very, very quickly.  I think the answer is to try and continue to get better at seeing it building sooner so that I can intervene sooner.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe she doesn&#39;t want to talk about it, at her age.  Maybe she never will want to talk about it.  It&#39;s possible that your best tactic might be to talk to her brother instead--not in the irritating talking behind her back with her in the room, but saying things that he can&#39;t yet verbalize.  Not in a baby-talk kind of way, not in a taking sides kind of way. <br/>\n&gt; <br/>\n&gt; And another thing to do might be to redirect the situation by showing up with a snack, or something to show them, or to ask one of them to do something very quick and interesting with you to break the tension.   They can figure it out more easily (and gradually, which is the only way anyway) if you are there and attentive and involved. <br/>\n<br/>\n </span></blockquote>Yes! Netflix and our movie collection is great for this when we are at home.  If we are out, there are always some quick and easy treats to be had.  I do find that when they are given a chance to be happy about something else, that the tension lessens.  <br/>\n<br/>\nThanks...that was very helpful to me.  All the things that you have suggested are things I KNOW I should do, that I WANT to do, but I think that in the intensity of things I am losing sight and not doing quite the job that I could be.  I think the recommended advice for that is taking a deep breath or two before continuing, yes? :)<br/>\n<br/>\nJustine</div>","specialLinks":[]},{"userId":224796703,"authorName":"casouthworth","from":"&quot;casouthworth&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Help with specific problem","postDate":"1353524555","msgId":69677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs4ajhnYitkdHQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc1MzgwNjgyRDc3QzRFREM5RjdFN0JBNDY1QzYyNDc0QExhcHB5SFA+"},"prevInTopic":69676,"nextInTopic":69678,"prevInTime":69676,"nextInTime":69678,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"I wasn t sure that this message came through. Now that it has, I see that it is almost unreadable. I will try to reformat it so it might be readable. ... ","messageBody":"<div id=\"ygrps-yiv-809131460\">I wasn&#39;t sure that this message came through. Now that it has, I see that it is almost unreadable. I will try to reformat it so it might be readable. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;For example, if she does something that hurts someone (it could be anything, taking her brother&#39;s toy, speaking rudely or unkindly to someone, or even just saying or doing something thoughtless, which <br/>\n </span></blockquote>caused hurt although unintended), I want to talk to her, to say something, but when I try to say anything about it, even something simple such as, &quot;please don&#39;t take your brother&#39;s toy; it upsets him&quot; or even just &quot;please stop what you are doing&quot; her response is always to say that she didn&#39;t do anything or that it didn&#39;t happen.&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWhat about rephrasing? Instead of &quot;Please don&#39;t take your brother&#39;s toy; it upsets him&quot;, what about &quot;Please give your brother his toy back, it is his.&quot; It doesn&#39;t have the accusatory tone and accomplishes the same thing. I have a child that will deny things if I am not careful in my phrasing. Rather than something long like &quot;Please stop what you are doing&quot; simplify it to &quot;STOP&quot;. Or, better yet, try to be close enough to intervene without words. Put a hand on her shoulder and say something nice to distract her and get her doing something else. <br/>\n<br/>\n<br/>\nWe had gotten in a pattern when one of our girls was younger where we would correct her or ask her to stop something that was annoying and she would deny it. We realized that we were the problem because of the way we were saying things and the fact that she was afraid of getting in trouble. If we didn&#39;t put her on the spot by phrasing things negatively, she responded much better. That meant telling her what to do rather than telling her what not to do. If I hear her saying something ugly to a sibling, rather than telling her to stop, I say something like &quot;Be nice&quot;.<br/>\n<br/>\n<br/>\nAlso, it helps to be a bit playful. I am not quite sure how to explain it but there are times when things get broken or something gets screwed up that needs to be taken care of immediately, like a broken glass or something that might be dangerous. I know who did it but I don&#39;t call the person out. I focus on the fact that &lt;fill in the blank&gt; happened and it needs to be addressed. I have had the kids start denying who did it or how it happened. I tell them, &quot;I don&#39;t care who did it. I care that something happened that needs to be fixed.&quot; This even works when somebody says something ugly. If one of my girls says something ugly to another one, I talk to the child that was hurt and I comfort them and commiserate with them rather than focusing on the person that said or did whatever. A lot of times, that alone is enough, especially with young kids.<br/>\n<br/>\n<br/>\nThis also reminds me of an episode of Little Bear. I think the episode is called Mister Nobody. It really shows how to get the point across without trying to call out somebody specific. In the episode, Little Bear creates a bunch of mischief by taking his parents things. While Mother Bear and Father Bear are looking for their stuff, they talk about how Mister Nobody did it and how it isn&#39;t nice for Mister Nobody to take other people&#39;s stuff and create mischief. Since one of my daughters had an invisible friend, we would talk about all of the bad things her invisible friend did and how she should stop that stuff. We talked about what could be done to help her invisible friend to be nicer.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;She knows that something has happened, and she knows that I know it, but she just gets very angry with me and says nothing happened. &lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>It sounds like she is feeling a bit defensive. Is she afraid of getting in trouble? Does she feel like she is getting in trouble because of the way that you are phrasing things? I am not asking specifically but these are some questions to think about. I know that thinking about those things really helped me to respond better to my children while still letting them know that certain behaviors are NOT okay. <br/>\n<br/>\n<br/>\nIf you know that she knows that something happened, what is the point of calling her out on it? I usually know when I screw up and it doesn&#39;t help to have somebody rub my nose in it by making me acknowledge it. There have been times when I have thought, &quot;No <br/>\nshit, I know I screwed up but how do I fix it?&quot; It makes me kind of angry when I feel like people are criticizing me without giving me any direction or specifics on how to do better. Realizing that about myself went a long way to helping me find better ways of responding to my children.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;I don&#39;t feel that I can just say nothing when her actions are clearly affecting others, but I&#39;m not sure what to do, because I also can&#39;t talk about the situation with her, or even just tell her to stop. This is not a situation where I am talking her to death and it is just too many words&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Three words could be three words too many for some kids. We realized that with one of our girls and rather than focusing on calling her out on things or talking about the situation, we started calling her name and leaving it at that. It is difficult to explain but before we had our epiphany, we would call her name and follow it with a criticism or a directive to not do something. When we would catch ourselves calling her name, we would stop and then tell her something like, &quot;I love you&quot;. The act of calling her name got her attention long enough to get her to stop whatever it was she was doing long enough to realize that she was doing something that she shouldn&#39;t be doing (like talking ugly to a sister or being bossy). If calling her name doesn&#39;t work, then it helps to get up and go talk to her or insert myself in the situation so that I can change the dynamic of what is going on without using words and without focusing on what she is doing wrong. <br/>\n<br/>\nWhen I say that I go talk to her, I don&#39;t go over and start pointing out what is wrong. It is more of, &quot;Hey, what&#39;s going on here? Is everybody having fun? Do you wanna go bake some cookies or go outside? All of this depends on the specific situation and what exactly is going on. <br/>\n<br/>\nAs for talking about it afterwards, I have found that it helps to talk about it in generalities as a family. My husband and I can talk about how important it is for all of us to be more careful with our words and actions. Talking about a specific incident with some of the girls leads them to shut down so it isn&#39;t helpful at all.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;If anyone else has had a child like this, I am wondering if this is something that got better as they got older, or if there were specific things that helped open the child up a little to discussion? &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Why do you want to have a discussion like this with a 7 year old? Some kids are very verbal and are open to having these kinds of discussions. Some kids are not. For kids that don&#39;t like discussions like that, it could be painful and grueling and have the opposite effect. Is your goal to teach her not to do those things or is your goal to help her not hurt other people and have better relationships? I am not quite sure how to articulate it but at some point I quit focusing on trying to teach them proper behavior by calling attention to what they were doing wrong. Instead, I focused on trying to become more peaceful and mindful in my own interactions. If I see them doing something that is hurtful, I try to intervene, with or without words, and redirect things to stop the hurtful behavior.<br/>\n<br/>\n<br/>\nConnie</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with specific problem","postDate":"1353504480","msgId":69675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVDMzM1RTgxLTMxMzQtNDgyOC05QjMwLTMwMzQxQTE5QTlFOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEQxNjE2QzZCLTQ5NkItNDEzQi05NDRBLTg4RTNENjA2N0MwN0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGs4aGpjYStvYXB0QGVHcm91cHMuY29tPiA8RDE2MTZDNkItNDk2Qi00MTNCLTk0NEEtODhFM0Q2MDY3QzA3QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":69674,"nextInTopic":69676,"prevInTime":69674,"nextInTime":69676,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"I m sorry my two posts came out of order in e-mail.  They re in order at the webpage.   The ideas for dealing with kids was sent before I wrote the bit about","messageBody":"<div id=\"ygrps-yiv-581330543\">I&#39;m sorry my two posts came out of order in e-mail.  They&#39;re in order at the webpage.   The ideas for dealing with kids was sent before I wrote the bit about whether someone needed to have a child that age with that problem to be able to help.<br/>\n<br/>\nSometimes it&#39;s better to get ideas from people who haven&#39;t had that problem.  <br/>\n<br/>\nMy kids are two and a half years apart (Kirby and Marty) and nearly three years (Marty to Holly).    My sister and I were three years and four months apart.  I still have lots of vivid memories, and wish I could have done things better with her.  My mom would insult me for the ways I treated her, but I don&#39;t remember suggestions for doing it better, and school was a definite wedge between us.  By the time I was seven, I was in second grade and my poor sister was home alone all day, wishing I would come back and play, but when I got back I was tired and cranky and didn&#39;t want to play &quot;with a baby,&quot; because school had assured me I didn&#39;t even &quot;have to&quot; play with six year olds.<br/>\n<br/>\nHome can be better.  The best thing is the relationship between the parent and each child.  Don&#39;t worry about the relationship between them so much as creating a bond with each.  <br/>\n<br/>\nI used to tell my kids they never had to deal with each other at all when they were grown, but that I had a responsibility to see that each was safe and happy in his own home.  <br/>\n<br/>\nNow that they&#39;re all grown, they do communicate quite a bit, and well, because I tried to prevent resentments.  They can choose to be friends, as adults.  We didn&#39;t put that pressure on them some families do to be close, to feel lifelong duty toward each other.  I think that was helpful.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with specific problem","postDate":"1353502495","msgId":69674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFCREEzMTBFLUM2MjMtNENCOC1BOTMxLTM4NjlEMkVBRDhFMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs4aGpjYStvYXB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGs4aGpjYStvYXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":69673,"nextInTopic":69675,"prevInTime":69673,"nextInTime":69675,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"More generally... -=-I am having a specific difficulty with my seven year old and I was wondering if anyone else has had a similar problem and how they dealt","messageBody":"<div id=\"ygrps-yiv-1289340085\">More generally...<br/>\n<br/>\n-=-I am having a specific difficulty with my seven year old and I was wondering if anyone else has had a similar problem and how they dealt with it.-=-<br/>\n<br/>\n-=- If anyone else has had a child like this, I am wondering if this is something that got better as they got older, or if there were specific things that helped open the child up a little to discussion? <br/>\n =-<br/>\n<br/>\nYou didn&#39;t describe a specific problem.  That&#39;s okay.  It&#39;s better to discuss the generalities (as you did).   <br/>\n<br/>\nBut asking for advice only from people who think they had the same problem isn&#39;t the best use of this discussion.   And if someone had said &quot;I had a child like that, and it never got better,&quot; what would you think about that?<br/>\n<br/>\nIt might be good to hear from people who managed NOT to have that problem. :-)<br/>\nI&#39;m serious.  The principles that make unschooling work aren&#39;t specific to particular personalities or situations.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with specific problem","postDate":"1353502198","msgId":69673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxNjE2QzZCLTQ5NkItNDEzQi05NDRBLTg4RTNENjA2N0MwN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs4aGpjYStvYXB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGs4aGpjYStvYXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":69672,"nextInTopic":69674,"prevInTime":69672,"nextInTime":69674,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"-=-when I try to say anything about it, even something simple such as, please don t take your brother s toy; it upsets him or even just please stop what you","messageBody":"<div id=\"ygrps-yiv-1127003958\">-=-when I try to say anything about it, even something simple such as, &quot;please don&#39;t take your brother&#39;s toy; it upsets him&quot; or even just &quot;please stop what you are doing&quot; her response is always to say that she didn&#39;t do anything or that it didn&#39;t happen.-=-<br/>\n<br/>\nInstead of telling her what she did, and what to do about it, mabe try asking her what happened.  Hear her side of it.  If her logic and perception are off, she might figure that out as she talks it through with you.  Maybe you could say &quot;Next time, maybe you could try...&quot; and make a suggestion.  And let her think about it without any promises or conclusions being reached.  Don&#39;t look at the one past incident so much as the thoughts she had (or might try to have in similar situations in the future).<br/>\n<br/>\nThe way I handled disagreements is here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/fighting\">http://sandradodd.com/peace/fighting</a><br/>\nIt still works, with my kids grown, and I&#39;ve seen them do it with others over the years (friends or siblings having disagreements).<br/>\n<br/>\n-=-She knows that something has happened, and she knows that I know it, but she just gets very angry with me and says nothing happened. If I say anything further, she gets even more upset and often starts shouting at me or becoming even more rude and hurtful.-=-<br/>\n<br/>\nYou&#39;ve trapped her, it sounds like.  Be her partner, not her adversary.<br/>\nBut be your son&#39;s partner, too.  If she has hurt his feelings, soothe him, protect him, let her see you being kind and fixing her mess without telling her &quot;Look.  I&#39;m fixing a mess *you* made.&quot;<br/>\n<br/>\nIf you set it up so that if she does what you want you win and she loses, she will be upset either way.  Think of it as coaching her, helping her be the kind of person SHE would like to be.  Coaching rather than controlling.<br/>\n<br/>\n-=-This is not a situation where I am talking her to death and it is just too many words; these are very short and to the point conversations (obviously). -=-<br/>\n<br/>\nPerhaps too short, and to the wrong point. <br/>\n<br/>\n-=-I have tried talking to her about things that happen after the fact, after things have cooled down, but that is also not very successful.-=-<br/>\n<br/>\nShe&#39;s only seven.   If she were at school, she might be acting in similar ways but you wouldn&#39;t be there to help her.  <br/>\n<br/>\n-=-Her younger brother (4) is also a highly emotional and very high energy person (there are wonderful times of play together, but also some periods very intense conflict).-=-<br/>\n<br/>\nDon&#39;t be too far away.  That&#39;s the age difference of me and my sister.  Don&#39;t leave your daughter &quot;in charge&quot; of the younger sibling.  Be there when the conflict begins, not after it&#39;s very intense.<br/>\n<br/>\nMaybe she doesn&#39;t want to talk about it, at her age.  Maybe she never will want to talk about it.  It&#39;s possible that your best tactic might be to talk to her brother instead--not in the irritating talking behind her back with her in the room, but saying things that he can&#39;t yet verbalize.  Not in a baby-talk kind of way, not in a taking sides kind of way. <br/>\n<br/>\nAnd another thing to do might be to redirect the situation by showing up with a snack, or something to show them, or to ask one of them to do something very quick and interesting with you to break the tension.   They can figure it out more easily (and gradually, which is the only way anyway) if you are there and attentive and involved.  <br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with specific problem","postDate":"1353501660","msgId":69676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1MzgwNjgyRDc3QzRFREM5RjdFN0JBNDY1QzYyNDc0QExhcHB5SFA+","inReplyToHeader":"PGs4aGpjYStvYXB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGs4aGpjYStvYXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":69675,"nextInTopic":69677,"prevInTime":69675,"nextInTime":69677,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"... What about rephrasing? Instead of “Please don’t take your brother’s toy; it upsets him”, what about “Please give your brother his toy back, it is","messageBody":"<div id=\"ygrps-yiv-775297685\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;For example, if she does something that hurts someone (it could be <br/>\n&gt;&gt;&gt;&gt;&gt;anything, taking her brother&#39;s toy, speaking rudely or unkindly to <br/>\n&gt;&gt;&gt;&gt;&gt;someone, or even just saying or doing something thoughtless, which <br/>\n&gt;&gt;&gt;&gt;&gt;caused hurt although unintended), I want to talk to her, to say <br/>\n&gt;&gt;&gt;&gt;&gt;something, but when I try to say anything about it, even something <br/>\n&gt;&gt;&gt;&gt;&gt;simple such as, &quot;please don&#39;t take your brother&#39;s toy; it upsets him&quot; <br/>\n&gt;&gt;&gt;&gt;&gt;or even just &quot;please stop what you are doing&quot; her response is always to <br/>\n&gt;&gt;&gt;&gt;&gt;say that she didn&#39;t do anything or that it didn&#39;t happen.&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n </span></blockquote>What about rephrasing? Instead of “Please don’t take your brother’s toy; it <br/>\nupsets him”, what about “Please give your brother his toy back, it is his.” <br/>\nIt doesn’t have the accusatory tone and accomplishes the same thing. I have <br/>\na child that will deny things if I am not careful in my phrasing. Rather <br/>\nthan something long like “Please stop what you are doing” simplify it to <br/>\n“STOP”. Or, better yet, try to be close enough to intervene without words. <br/>\nPut a hand on her shoulder and say something nice to distract her and get <br/>\nher doing something else. We had gotten in a pattern when one of our girls <br/>\nwas younger where we would correct her or ask her to stop something that was <br/>\nannoying and she would deny it. We realized that we were the problem because <br/>\nof the way we were saying things and the fact that she was afraid of getting <br/>\nin trouble. If we didn’t put her on the spot by phrasing things negatively, <br/>\nshe responded much better. That meant telling her what to do rather than <br/>\ntelling her what not to do. If I hear her saying something ugly to a <br/>\nsibling, rather than telling her to stop, I say something like “Be nice”.<br/>\nAlso, it helps to be a bit playful. I am not quite sure how to explain it <br/>\nbut there are times when things get broken or something gets screwed up that <br/>\nneeds to be taken care of immediately, like a broken glass or something that <br/>\nmight be dangerous. I know who did it but I don’t call the person out. I <br/>\nfocus on the fact that &lt;fill in the blank&gt; happened and it needs to be <br/>\naddressed. I have had the kids start denying who did it or how it happened. <br/>\nI tell them, “I don’t care who did it. I care that something happened that <br/>\nneeds to be fixed.” This even works when somebody says something ugly. If <br/>\none of my girls says something ugly to another one, I talk to the child that <br/>\nwas hurt and I comfort them and commiserate with them rather than focusing <br/>\non the person that said or did whatever. A lot of times, that alone is <br/>\nenough, especially with young kids.<br/>\nThis also reminds me of an episode of Little Bear. I think the episode is <br/>\ncalled Mister Nobody. It really shows how to get the point across without <br/>\ntrying to call out somebody specific. In the episode, Little Bear creates a <br/>\nbunch of mischief by taking his parents things. While Mother Bear and Father <br/>\nBear are looking for their stuff, they talk about how Mister Nobody did it <br/>\nand how it isn’t nice for Mister Nobody to take other people’s stuff and <br/>\ncreate mischief. Since one of my daughters had an invisible friend, we would <br/>\ntalk about all of the bad things her invisible friend did and how she should <br/>\nstop that stuff. We talked about what could be done to help her invisible <br/>\nfriend to be nicer.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;She knows that something has happened, and she knows that I know it, <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;but she just gets very angry with me and says nothing happened. &lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>It sounds like she is feeling a bit defensive. Is she afraid of getting in <br/>\ntrouble? Does she feel like she is getting in trouble because of the way <br/>\nthat you are phrasing things? I am not asking specifically but these are <br/>\nsome questions to think about. I know that thinking about those things <br/>\nreally helped me to respond better to my children while still letting them <br/>\nknow that certain behaviors are NOT okay. If you know that she knows that <br/>\nsomething happened, what is the point of calling her out on it? I usually <br/>\nknow when I screw up and it doesn’t help to have somebody rub my nose in it <br/>\nby making me acknowledge it. There have been times when I have thought, “No <br/>\nshit, I know I screwed up but how do I fix it?” It makes me kind of angry <br/>\nwhen I feel like people are criticizing me without giving me any direction <br/>\nor specifics on how to do better. Realizing that about myself went a long <br/>\nway to helping me find better ways of responding to my children.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;I don&#39;t feel that I can just say nothing when her actions are clearly <br/>\n&gt;&gt;&gt;&gt;&gt;affecting others, but I&#39;m not sure what to do, because I also can&#39;t <br/>\n&gt;&gt;&gt;&gt;&gt;talk about the situation with her, or even just tell her to stop. This <br/>\n&gt;&gt;&gt;&gt;&gt;is not a situation where I am talking her to death and it is just too <br/>\n&gt;&gt;&gt;&gt;&gt;many words; these are very short and to the point conversations <br/>\n&gt;&gt;&gt;&gt;&gt;(obviously).&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Three words could be three words too many for some kids. We realized that <br/>\nwith one of our girls and rather than focusing on calling her out on things <br/>\nor talking about the situation, we started calling her name and leaving it <br/>\nat that. It is difficult to explain but before we had our epiphany, we would <br/>\ncall her name and follow it with a criticism or a directive to not do <br/>\nsomething. When we would catch ourselves calling her name, we would stop and <br/>\nthen tell her something like, “I love you”. The act of calling her name got <br/>\nher attention long enough to get her to stop whatever it was she was doing <br/>\nlong enough to realize that she was doing something that she shouldn’t be <br/>\ndoing (like talking ugly to a sister or being bossy). If calling her name <br/>\ndoesn’t work, then it helps to get up and go talk to her or insert myself in <br/>\nthe situation so that I can change the dynamic of what is going on without <br/>\nusing words and without focusing on what she is doing wrong. When I say that <br/>\nI go talk to her, I don’t go over and start pointing out what is wrong. It <br/>\nis more of, “Hey, what’s going on here? Is everybody having fun? Do you <br/>\nwanna go bake some cookies or go outside? All of this depends on the <br/>\nspecific situation and what exactly is going on. As for talking about it <br/>\nafterwards, I have found that it helps to talk about it in generalities as a <br/>\nfamily. My husband and I can talk about how important it is for all of us to <br/>\nbe more careful with our words and actions. Talking about a specific <br/>\nincident with some of the girls leads them to shut down so it isn’t helpful <br/>\nat all.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;If anyone else has had a child like this, I am wondering if this is <br/>\n&gt;&gt;&gt;&gt;&gt;something that got better as they got older, or if there were specific <br/>\n&gt;&gt;&gt;&gt;&gt;things that helped open the child up a little to discussion? &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Why do you want to have a discussion like this with a 7 year old? Some kids <br/>\nare very verbal and are open to having these kinds of discussions. Some kids <br/>\nare not. For kids that don’t like discussions like that, it could be painful <br/>\nand grueling and have the opposite effect. Is your goal to teach her not to <br/>\ndo those things or is your goal to help her not hurt other people and have <br/>\nbetter relationships? I am not quite sure how to articulate it but at some <br/>\npoint I quit focusing on trying to teach them proper behavior by calling <br/>\nattention to what they were doing wrong. Instead, I focused on trying to <br/>\nbecome more peaceful and mindful in my own interactions. If I see them doing <br/>\nsomething that is hurtful, I try to intervene, with or without words, and <br/>\nredirect things to stop the hurtful behavior.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with specific problem","postDate":"1353501660","msgId":69678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0RjhDRjJCNThCQzRENUQ4N0MwNDY0QTlBRTBDMzk5QExhcHB5SFA+","inReplyToHeader":"PGs4aGpjYStvYXB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGs4aGpjYStvYXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":69677,"nextInTopic":69679,"prevInTime":69677,"nextInTime":69679,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"... What about rephrasing? Instead of “Please don’t take your brother’s toy; it upsets him”, what about “Please give your brother his toy back, it is","messageBody":"<div id=\"ygrps-yiv-1029509194\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;For example, if she does something that hurts someone (it could be <br/>\n&gt;&gt;&gt;&gt;&gt;anything, taking her brother&#39;s toy, speaking rudely or unkindly to <br/>\n&gt;&gt;&gt;&gt;&gt;someone, or even just saying or doing something thoughtless, which <br/>\n&gt;&gt;&gt;&gt;&gt;caused hurt although unintended), I want to talk to her, to say <br/>\n&gt;&gt;&gt;&gt;&gt;something, but when I try to say anything about it, even something <br/>\n&gt;&gt;&gt;&gt;&gt;simple such as, &quot;please don&#39;t take your brother&#39;s toy; it upsets him&quot; <br/>\n&gt;&gt;&gt;&gt;&gt;or even just &quot;please stop what you are doing&quot; her response is always to <br/>\n&gt;&gt;&gt;&gt;&gt;say that she didn&#39;t do anything or that it didn&#39;t happen.&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n </span></blockquote>What about rephrasing? Instead of “Please don’t take your brother’s toy; it <br/>\nupsets him”, what about “Please give your brother his toy back, it is his.” <br/>\nIt doesn’t have the accusatory tone and accomplishes the same thing. I have <br/>\na child that will deny things if I am not careful in my phrasing. Rather <br/>\nthan something long like “Please stop what you are doing” simplify it to <br/>\n“STOP”. Or, better yet, try to be close enough to intervene without words. <br/>\nPut a hand on her shoulder and say something nice to distract her and get <br/>\nher doing something else. We had gotten in a pattern when one of our girls <br/>\nwas younger where we would correct her or ask her to stop something that was <br/>\nannoying and she would deny it. We realized that we were the problem because <br/>\nof the way we were saying things and the fact that she was afraid of getting <br/>\nin trouble. If we didn’t put her on the spot by phrasing things negatively, <br/>\nshe responded much better. That meant telling her what to do rather than <br/>\ntelling her what not to do. If I hear her saying something ugly to a <br/>\nsibling, rather than telling her to stop, I say something like “Be nice”.<br/>\nAlso, it helps to be a bit playful. I am not quite sure how to explain it <br/>\nbut there are times when things get broken or something gets screwed up that <br/>\nneeds to be taken care of immediately, like a broken glass or something that <br/>\nmight be dangerous. I know who did it but I don’t call the person out. I <br/>\nfocus on the fact that &lt;fill in the blank&gt; happened and it needs to be <br/>\naddressed. I have had the kids start denying who did it or how it happened. <br/>\nI tell them, “I don’t care who did it. I care that something happened that <br/>\nneeds to be fixed.” This even works when somebody says something ugly. If <br/>\none of my girls says something ugly to another one, I talk to the child that <br/>\nwas hurt and I comfort them and commiserate with them rather than focusing <br/>\non the person that said or did whatever. A lot of times, that alone is <br/>\nenough, especially with young kids.<br/>\nThis also reminds me of an episode of Little Bear. I think the episode is <br/>\ncalled Mister Nobody. It really shows how to get the point across without <br/>\ntrying to call out somebody specific. In the episode, Little Bear creates a <br/>\nbunch of mischief by taking his parents things. While Mother Bear and Father <br/>\nBear are looking for their stuff, they talk about how Mister Nobody did it <br/>\nand how it isn’t nice for Mister Nobody to take other people’s stuff and <br/>\ncreate mischief. Since one of my daughters had an invisible friend, we would <br/>\ntalk about all of the bad things her invisible friend did and how she should <br/>\nstop that stuff. We talked about what could be done to help her invisible <br/>\nfriend to be nicer.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;She knows that something has happened, and she knows that I know it, <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;but she just gets very angry with me and says nothing happened. &lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>It sounds like she is feeling a bit defensive. Is she afraid of getting in <br/>\ntrouble? Does she feel like she is getting in trouble because of the way <br/>\nthat you are phrasing things? I am not asking specifically but these are <br/>\nsome questions to think about. I know that thinking about those things <br/>\nreally helped me to respond better to my children while still letting them <br/>\nknow that certain behaviors are NOT okay. If you know that she knows that <br/>\nsomething happened, what is the point of calling her out on it? I usually <br/>\nknow when I screw up and it doesn’t help to have somebody rub my nose in it <br/>\nby making me acknowledge it. There have been times when I have thought, “No <br/>\nshit, I know I screwed up but how do I fix it?” It makes me kind of angry <br/>\nwhen I feel like people are criticizing me without giving me any direction <br/>\nor specifics on how to do better. Realizing that about myself went a long <br/>\nway to helping me find better ways of responding to my children.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;I don&#39;t feel that I can just say nothing when her actions are clearly <br/>\n&gt;&gt;&gt;&gt;&gt;affecting others, but I&#39;m not sure what to do, because I also can&#39;t <br/>\n&gt;&gt;&gt;&gt;&gt;talk about the situation with her, or even just tell her to stop. This <br/>\n&gt;&gt;&gt;&gt;&gt;is not a situation where I am talking her to death and it is just too <br/>\n&gt;&gt;&gt;&gt;&gt;many words; these are very short and to the point conversations <br/>\n&gt;&gt;&gt;&gt;&gt;(obviously).&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Three words could be three words too many for some kids. We realized that <br/>\nwith one of our girls and rather than focusing on calling her out on things <br/>\nor talking about the situation, we started calling her name and leaving it <br/>\nat that. It is difficult to explain but before we had our epiphany, we would <br/>\ncall her name and follow it with a criticism or a directive to not do <br/>\nsomething. When we would catch ourselves calling her name, we would stop and <br/>\nthen tell her something like, “I love you”. The act of calling her name got <br/>\nher attention long enough to get her to stop whatever it was she was doing <br/>\nlong enough to realize that she was doing something that she shouldn’t be <br/>\ndoing (like talking ugly to a sister or being bossy). If calling her name <br/>\ndoesn’t work, then it helps to get up and go talk to her or insert myself in <br/>\nthe situation so that I can change the dynamic of what is going on without <br/>\nusing words and without focusing on what she is doing wrong. When I say that <br/>\nI go talk to her, I don’t go over and start pointing out what is wrong. It <br/>\nis more of, “Hey, what’s going on here? Is everybody having fun? Do you <br/>\nwanna go bake some cookies or go outside? All of this depends on the <br/>\nspecific situation and what exactly is going on. As for talking about it <br/>\nafterwards, I have found that it helps to talk about it in generalities as a <br/>\nfamily. My husband and I can talk about how important it is for all of us to <br/>\nbe more careful with our words and actions. Talking about a specific <br/>\nincident with some of the girls leads them to shut down so it isn’t helpful <br/>\nat all.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;If anyone else has had a child like this, I am wondering if this is <br/>\n&gt;&gt;&gt;&gt;&gt;something that got better as they got older, or if there were specific <br/>\n&gt;&gt;&gt;&gt;&gt;things that helped open the child up a little to discussion? &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Why do you want to have a discussion like this with a 7 year old? Some kids <br/>\nare very verbal and are open to having these kinds of discussions. Some kids <br/>\nare not. For kids that don’t like discussions like that, it could be painful <br/>\nand grueling and have the opposite effect. Is your goal to teach her not to <br/>\ndo those things or is your goal to help her not hurt other people and have <br/>\nbetter relationships? I am not quite sure how to articulate it but at some <br/>\npoint I quit focusing on trying to teach them proper behavior by calling <br/>\nattention to what they were doing wrong. Instead, I focused on trying to <br/>\nbecome more peaceful and mindful in my own interactions. If I see them doing <br/>\nsomething that is hurtful, I try to intervene, with or without words, and <br/>\nredirect things to stop the hurtful behavior.<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":411981224,"authorName":"apprentice_mom","from":"&quot;apprentice_mom&quot; &lt;justine@...&gt;","profile":"apprentice_mom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Help with specific problem","postDate":"1353470154","msgId":69672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs4aGpjYStvYXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":69673,"prevInTime":69671,"nextInTime":69673,"topicId":69672,"numMessagesInTopic":0,"msgSnippet":"I am having a specific difficulty with my seven year old and I was wondering if anyone else has had a similar problem and how they dealt with it.  My seven","messageBody":"<div id=\"ygrps-yiv-1598129334\">I am having a specific difficulty with my seven year old and I was wondering if anyone else has had a similar problem and how they dealt with it.  My seven year old is a very independent person; she is also extremely emotional.  This brings many wonderful things with it, but also creates some difficulties.<br/>\n<br/>\nFor example, if she does something that hurts someone (it could be anything, taking her brother&#39;s toy, speaking rudely or unkindly to someone, or even just saying or doing something thoughtless, which caused hurt although unintended), I want to talk to her, to say something, but when I try to say anything about it, even something simple such as, &quot;please don&#39;t take your brother&#39;s toy; it upsets him&quot; or even just &quot;please stop what you are doing&quot; her response is always to say that she didn&#39;t do anything or that it didn&#39;t happen.<br/>\n<br/>\nShe knows that something has happened, and she knows that I know it, but she just gets very angry with me and says nothing happened.  If I say anything further, she gets even more upset and often starts shouting at me or becoming even more rude and hurtful.  I don&#39;t feel that I can just say nothing when her actions are clearly affecting others, but I&#39;m not sure what to do, because I also can&#39;t talk about the situation with her, or even just tell her to stop.  This is not a situation where I am talking her to death and it is just too many words; these are very short and to the point conversations (obviously). <br/>\n<br/>\nI have tried talking to her about things that happen after the fact, after things have cooled down, but that is also not very successful.  Her younger brother (4) is also a highly emotional and very high energy person (there are wonderful times of play together, but also some periods very intense conflict).  I know that some of this difficulty she has in acknowledging that she has done something hurtful is part of her personality, and also her age, but I&#39;m wondering if there are things I can do to help her with this?  If anyone else has had a child like this, I am wondering if this is something that got better as they got older, or if there were specific things that helped open the child up a little to discussion?  <br/>\n<br/>\nJustine</div>","specialLinks":[]}],"prevTopicId":69639,"nextTopicId":69686}}