{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":284083644,"authorName":"drcotter","from":"&quot;drcotter&quot; &lt;drcotter72@...&gt;","profile":"drcotter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Struggling in Oregon","postDate":"1259883652","msgId":48866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmOWlhNCs0ZXZmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA2N2UwMWNhNzNhNiQ4M2Q4MzMzMCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":48861,"nextInTopic":0,"prevInTime":48865,"nextInTime":48867,"topicId":48842,"numMessagesInTopic":0,"msgSnippet":"Hi Kim- My oldest had a similar thing with classes too.  When Rebecca (now 6) was younger, she loved going to classes, and did swimming and gymnastics and","messageBody":"<div id=\"ygrps-yiv-868182069\">Hi Kim-<br/>\nMy oldest had a similar thing with classes too.  When Rebecca (now 6) was younger, she loved going to classes, and did swimming and gymnastics and loved it.  Somewhere around 4 or 5 she didn&#39;t really want to go off to the classes.  She still likes the activities, but wants to do them when she&#39;s in the mood, not when they&#39;re pre-scheduled :)  Also, she likes to pick what she wants to do at the class (balance beam instead of bars, hide and seek instead of trampoline, etc.), so the class format doesn&#39;t really work for her anymore.  If we can find places that offer it, she likes the open gym/free play format, where she can do whatever she feels like.<br/>\n<br/>\nAlso, at times when she wouldn&#39;t want to go to the zoo or children&#39;s museum (even to meet friends), she&#39;d still like to go to friends&#39; houses to play.  So maybe Damon would like some open gym times, or more playdates at friends&#39; houses?  Maybe friends with video game systems?  That way he could play those and you could visit with another adult?<br/>\n<br/>\nAnother thought:  could your husband come home for lunch with Damon once in a while?  Then he&#39;d be coming to you guys, have time with Damon, and if you wanted to get outside maybe you could pop out for an hour or so?<br/>\n-Dawn S.</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Struggling in Oregon","postDate":"1259873859","msgId":48861,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3ZDAwMWNhNzQ1YiQ0MDY4ZGFlMCQ2NDBhYTlhOUBHb256bz4=","inReplyToHeader":"PEZCRjZGQjgwLTJCQjEtNDZERS1BRENELUZERkY2MTAwREFBM0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDA2N2UwMWNhNzNhNiQ4M2Q4MzMzMCQ2NDBhYTlhOUBHb256bz4gPEZCRjZGQjgwLTJCQjEtNDZERS1BRENELUZERkY2MTAwREFBM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48857,"nextInTopic":48866,"prevInTime":48860,"nextInTime":48862,"topicId":48842,"numMessagesInTopic":0,"msgSnippet":" It might help to announce (in some direct and conversational way) what you re doing the next day while you re winding down","messageBody":"<div id=\"ygrps-yiv-2031787275\">&lt;&lt; My &quot;have to&quot; alarm sounded. &lt;g&gt; <br/>\n <br/>\nIt might help to &quot;announce&quot; (in some direct and conversational way) <br/>\nwhat you&#39;re doing the next day while you&#39;re winding down to sleep. &gt;&gt; <br/>\n <br/>\nWell, that is really what I do. It&#39;s not like an announcement or demand. It<br/>\nsounds a bit nit-picky but I should be more careful with my words. I am<br/>\nalready quite verbose and worry about how much I should include in my posts<br/>\nso that people get the idea of what I&#39;m asking without leaving out pertinent<br/>\ninfo. (I&#39;ve seen replies where they give more info that would have been nice<br/>\nto know up front.) But then my stuff gets pretty long.<br/>\n <br/>\nSo I should have mentioned that I do bring things up the night before so<br/>\nit&#39;s not a total surprise that we have somewhere to go. Damon still sleeps<br/>\nwith us and we read stories in bed so I&#39;d probably mention it then. Like<br/>\nwhen there is an unschooling gathering I&#39;ll let him know that a bunch of our<br/>\nfriends will be meeting at the zoo tomorrow. He&#39;ll seem excited. I&#39;ll even<br/>\nbring up some of the things we might see or do there, like they have been<br/>\nworking on the monkey habitat forever and it&#39;s finally finished and we<br/>\nhaven&#39;t seen it yet, so we should be sure to check that out. Or if we just<br/>\nwatched Happy Feet recently I might say we could check out the penquins.<br/>\n <br/>\nWhile he seems to want to go the night before, he&#39;ll totally change his mind<br/>\nthe next day when faced with leaving the house. I&#39;ll try to prep him early<br/>\nand involve him in packing a lunch or snacks, but if he gets on the wii all<br/>\nbets are off. He&#39;ll say he&#39;s not going anywhere today. I might tell him who<br/>\nI know is planning to go (although the other kids could choose to stay home<br/>\ntoo!) or express my sadness that I had hoped to see MY friends today too. I<br/>\nmight ask if he&#39;s sure he really doesn&#39;t want to go, but he&#39;ll usually say<br/>\nNo Way. So I have to give up my plans to see my unschooling friends in<br/>\nperson. It&#39;s a real bummer! Sometimes I really need to talk to a PERSON face<br/>\nto face and can&#39;t! I could call but don&#39;t want to interrupt their time at<br/>\nthe zoo. So I have to try to call someone later. That usually makes me feel<br/>\nbetter, especially if their kids have ever chosen to NOT go to the zoo and<br/>\nthey&#39;ve been bummed about missing the outing.<br/>\n <br/>\n <br/>\n&lt;&lt; Those aren&#39;t the only two choices, late or miss it. There&#39;s go early <br/>\nwith something cool in mind so that you&#39;re both there before his dad. &gt;&gt;<br/>\n<br/>\nOK, so I hadn&#39;t thought of that! On a very RARE occasion we have been early<br/>\nto lunch, but that would be like if we had already been somewhere else and<br/>\nwere in the car with plenty of time to get to the lunch place. Then Geoff is<br/>\nlate, but we don&#39;t care since we are not the ones on a time schedule. I have<br/>\nordered for him then too. It&#39;s funny how bleak things look from my POV when<br/>\nI&#39;m in a rut and someone outside of it can suggest a simple solution that<br/>\ntotally works, I just hadn&#39;t thought of it! This really is a great idea! We<br/>\nhave also bought Subway subs to his office before and picked him up and<br/>\neaten at the park across the street. That is good when the weather is nice<br/>\n(not now).<br/>\n <br/>\n <br/>\n&lt;&lt; One clue to your stuckness might be that you don&#39;t think &quot;freedom <br/>\nof choices&quot; is responsible parenting. I think &quot;freedom&quot; is a bad direction <br/>\nto head, but &quot;choices&quot; is a GREAT direction to head, so if you stick them<br/>\ntogether, you get all muddled and don&#39;t know which way to go. &gt;&gt;<br/>\n<br/>\nYes. I am stuck on this. I was off in the direction that FREEDOM was good<br/>\nand &quot;trying to get him to do what I want him to do&quot; was bad. In my initial<br/>\nreadings and exposure to unschooling (2 yrs ago) it was hard to figure out<br/>\nhow to be a good parent! I watched a friend who seemed to know what she was<br/>\ndoing/talking about, but she seemed to me to be missing something. It was<br/>\nlike her kid got to do whatever he wanted and she only stepped in when there<br/>\nwas a conflict, but usually too late, and she didn&#39;t seem to know how to<br/>\nhandle things most of the time. Reluctant to step in. I decided to stop<br/>\ntrying to be like her! I had to read more on my own and find some new<br/>\nfriends. (I think she had to find her own way too.)<br/>\n <br/>\nI&#39;m fine with Choices. I&#39;ve always managed to offer lots of choices and been<br/>\nrelatively OK with the outcomes. (Still dealing with childhood baggage and<br/>\ntrying to honor the child within me who never got to eat cake for breakfast<br/>\nand often suppressing the urge to tell my son things like that.)<br/>\n <br/>\nAnyway, back to the point. There ARE times when you need your child to do<br/>\ncertain things and there are ways to get him to do them. (I just read the<br/>\nsection about bribery and how it is OK to promise a child ice cream if he<br/>\ndoes X for you, maybe sits in the cart while you grocery shop. That is<br/>\nsinking in, I used to be confused on that, thinking it was bribery and that<br/>\nwas BAD.) But these times don&#39;t happen as often as people think! I&#39;ve seen<br/>\nmothers yank their kids off the playground crying because she said they had<br/>\nto get to the grocery store or bank or wherever and be home to fix dinner by<br/>\n5. I am SO not like them! I&#39;m fine with playing as long as he wants to. I&#39;m<br/>\nfine with shopping when he&#39;s done and missing the bank because it closed at<br/>\n6. It&#39;s open the next day. I&#39;m all too fine with not fixing dinner at a<br/>\ncertain time every day! If we are so late with the grocery shopping and I<br/>\nknow Geoff is on his way home (I can call him and find out where he is) I<br/>\nmight offer to pick something up and bring it home or ask him to do that if<br/>\nI have melting stuff in the car. If nothing is in danger of melting, and we<br/>\nare both in the car, we could meet somewhere for dinner! <br/>\n <br/>\nI just get stuck on those rare times when we really do need to go somewhere<br/>\nat a certain time. It feels like a bad thing to say you need to get in the<br/>\ncar now. Well, the tone of that is bad! Like maybe a dentist appointment. He<br/>\nwants to stay home. I need to go to this appt. On time. Prepping him the<br/>\nnight before is good, reminding him in the morning is good, making sure he<br/>\nis dressed and ready to go way ahead of time is crutial, but getting him<br/>\naway from the TV is nearly impossible. I think it would be great to have a<br/>\nDS, for my own sanity! Geoff worries about all the typical things like how<br/>\nwe&#39;ll lose him even more to electronics, it&#39;s a money suck, time waster,<br/>\netc. I see it as a way to get Damon in the car! And occupied when I need to<br/>\ndo things he doesn&#39;t want to do! Plus Damon really wants one. Maybe I can<br/>\nconvince Geoff based on the merits of us being on time for lunches. (We have<br/>\nnot had lunch with him all 4 days of this week.)<br/>\n <br/>\nThanks for the ideas and aha moments! Seeing the light again.<br/>\n <br/>\nKim<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Struggling in Oregon","postDate":"1259871108","msgId":48857,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxNTgwMi44MDMzNC5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDA2N2UwMWNhNzNhNiQ4M2Q4MzMzMCQ2NDBhYTlhOUBHb256bz4=","referencesHeader":"PDA2N2UwMWNhNzNhNiQ4M2Q4MzMzMCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":48851,"nextInTopic":48861,"prevInTime":48856,"nextInTime":48858,"topicId":48842,"numMessagesInTopic":0,"msgSnippet":"***I announce in the morning what we have to do today. Usually I get him dressed while he plays wii or watches tv. I give notice that we are going somewhere in","messageBody":"<div id=\"ygrps-yiv-1900808155\">***I announce in the morning what we have to do today. Usually I get him<br/>\ndressed while he plays wii or watches tv. I give notice that we are going<br/>\nsomewhere in a few minutes (saying 5 or 10 minutes has little meaning to him<br/>\nso I haven&#39;t been saying actual times). If he is playing a game I say he<br/>\nshould get to a good stopping point and save his game. If we are playing<br/>\ntogether, I might say this is our last battle or race or whatever.***<br/>\n <br/>\nSomething that I&#39;ve done is to truly evaluate the need to leave and at what time.  The less I say about it the better.  If we truly need to leave in 10 min, then I make sure that everything else is ready to go and that the whole 10 minutes is completely devoted to that child that needs to leave with me.  If we really do need to leave and my child doesn&#39;t want to go, engaging in a struggle is the very last thing I want to do.  I&#39;ve said to my children at times like this, that we can either do this the easy way or the hard way, but ulimately we will be in the car heading away from home.  I only do this if there is truly a need to leave.  That&#39;s not something for a grocery store outing, or a class that can be missed, or a play date that has flexibility for lateness.  The less you do this, and the more you allow for flexibility and the ability for the child to NOT go, the easier it gets.<br/>\n<br/>\n***Now before anyone says I&#39;m overscheduling my child, let me say that my son<br/>\nis extremely physical, moving all the time, and has enjoyed these classes<br/>\nsince he was very small. It&#39;s a great way to get his energy out and be<br/>\naround other kids and learn something new.*** <br/>\n <br/>\nI&#39;d find a way to do this physical activity at home for now.  Has Damon discovered stairs as a fun thing to slide down?  It also occurs to me that Damon may really appreciate obstacle courses. <br/>\n<br/>\n***It&#39;s also not light very much these days (sun down by 4:30) and we stay up so late and<br/>\nsleep in so late, we barely have much daylight to enjoy! ***<br/>\n <br/>\nI deal with this too.  I&#39;m working on bumping our schedule earlier, slowly and incrementally.  I like the daylight and need it and suspect that my children do too.<br/>\n<br/>\n***Lately he has said he hates class and doesn&#39;t want to go.*** <br/>\n <br/>\nI wouldn&#39;t force classes at all, one way or the other.  If he does indeed express an interest, keep a handy list of drop in activities.  I have never had success forcing classes on anyone, ever, as a parent, and as an instructor.<br/>\n <br/>\n*** I used to stop by this local indoor play<br/>\nplace with slides and bouncers and cars to ride, but he never wants to go<br/>\nthere any more. It&#39;s too cold to do much outside. I&#39;m out of ideas.***<br/>\n <br/>\nI&#39;m thinking that it&#39;s not novel anymore.  If you stop going for a while, don&#39;t even mention it, a couple of months down the road, he may be totally into the idea.<br/>\n<br/>\n***I think I&#39;m in a rut. No ideas. I&#39;ve started so many projects, thinking<br/>\nDamon might be interested and come join me, but I end up coloring or doing a<br/>\ncraft alone, making a fort for no one, cleaning or cooking or baking by<br/>\nmyself (which I HATE by the way, and don&#39;t want Damon to grow up hating the<br/>\nkitchen like I do, I suspect because my mom used to MAKE me help her and it<br/>\nwas never FUN). ***<br/>\n <br/>\nBe with him where he is and do things near him.  If you get bored watching and playing video games, do something beside him that you do enjoy doing. <br/>\n <br/>\nAs to the kitchen stuff, I can relate a bit.  I&#39;ve never been a huge fan of cooking, but, I&#39;ve found ways and things to enjoy about being in the kitchen.  I really enjoy puting a big pot of something on the stove, something that makes the house smell good and that I can go in every once in a while to check on and taste test and add ingredients to.  I LOVE my cuisinart because I can make baked goods really easily with it&#39;s use.  I make gluten free things and it requires a different kind of mixing of ingredients than regular cookies and biscuits and baked goods.  I love having a bread machine because I can make bread very easily and doughs that can be made into pizzas or bread sticks.  They make the house smell good and my family likes it and my kitchen doesn&#39;t have to be spotlessly clean to use these things.<br/>\n<br/>\n***If it&#39;s not a video game, he&#39;s not interested and there&#39;s only so much wii I<br/>\ncan play in a day. He&#39;s not getting enough excercise and has energy that<br/>\nkeeps him going until 3am. ***<br/>\n <br/>\nDoes the wii have any games that are physical that Damon would enjoy?  I don&#39;t have a wii, so I&#39;m not familiar with the games or the platform.  I&#39;d also really consider getting a handheld game that can be taken along on outings.  We got Chamille her first handheld device when she was 4, it was a gameboy color, and she loved it.  It made it way easier to leave the house and car rides were pleasant.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":199576968,"authorName":"Heather","from":"&quot;Heather&quot; &lt;brownsplus2@...&gt;","profile":"brownsplus2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Struggling in Oregon","postDate":"1259852116","msgId":48851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmOGpnaytkb2R0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA2N2UwMWNhNzNhNiQ4M2Q4MzMzMCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":48846,"nextInTopic":48857,"prevInTime":48850,"nextInTime":48852,"topicId":48842,"numMessagesInTopic":0,"msgSnippet":"This must be a common situation with some 5 year olds. Before my son was 5 he wanted to go somewhere everyday. Transitions have never been easy for my boys","messageBody":"<div id=\"ygrps-yiv-684438695\">This must be a common situation with some 5 year olds. Before my son was 5 he wanted to go somewhere everyday. Transitions have never been easy for my boys though. Once they are playing their games, or doing anything with intent, it is tough for them to think of anything else at that moment. What seems to work lately is distracting them about an hour or so before we need to go and getting them excited about our outing. If I can somehow get them on another path without being controlling or condescending in anyway it helps us a lot. <br/>\n<br/>\nSome transition ideas that have helped me lately with my 5 year old:<br/>\nTickle wars<br/>\nHide and Seek for 5 to 15 minutes in the house<br/>\nWrestling on the bed<br/>\nArt projects<br/>\nBalloon games<br/>\nPuzzles<br/>\nMoon Sand<br/>\nPlay Doh<br/>\nDS in the car <br/>\nDS in bed for an hour or even half an hour while we cuddle<br/>\nNew stack of books from the library every 5 days for bedtime ritual<br/>\nPut shoes on when you get there if it makes leaving easier. Or help him put them on, if he is willing. Boots are handy for us in winter.<br/>\n<br/>\n<br/>\nHave fun and enjoy your dynamo!<br/>\n<br/>\n~Heather Brown<br/>\nMom to Holden (8) and Camden (5)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt; wrote:<br/>\n  <br/>\n&gt; But now (at 5) he has become a huge fan of HOME. He doesn&#39;t like to leave the house. He wants to stay home all day every day and play wii or watch cartoons. </span></blockquote></div>","specialLinks":[]},{"userId":197014879,"authorName":"misskatenwa","from":"&quot;misskatenwa&quot; &lt;misskatenwa@...&gt;","profile":"misskatenwa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Struggling in Oregon","postDate":"1259807991","msgId":48846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmNzhkbitoZG9jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA2N2UwMWNhNzNhNiQ4M2Q4MzMzMCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":48844,"nextInTopic":48851,"prevInTime":48845,"nextInTime":48847,"topicId":48842,"numMessagesInTopic":0,"msgSnippet":"Hi Kim, I understand that the weather in Oregon is sometimes like the weather here in Arkansas. Cloudy & cold. There are times when we go 30 to 40 days without","messageBody":"<div id=\"ygrps-yiv-899622510\">Hi Kim, <br/>\n<br/>\nI understand that the weather in Oregon is sometimes like the weather here in Arkansas. Cloudy & cold. There are times when we go 30 to 40 days without sun. I&#39;ve found since moving here from out west where there is lots of sun... that I have SADD... I need Sun! It&#39;s strange too because the longer I go with out sun, the more I loose motivation to do so many things. My kids need sun too. Believe me, their attitudes are so much better with sunshine. <br/>\n<br/>\nWe have dogs. The dogs, bless their hearts, love their walks... so much so that they&#39;ll tap on the window when its time to go. So we&#39;re outside and walking the dogs. I&#39;ve found that animal care does wonders in changing attitudes. How can you be upset when your dog is loving you? <br/>\n<br/>\nOf my three, I have one (the youngest) who would tell you he&#39;d rather stay home than do anything. He&#39;s usually happy that he went to whatever after we get home, but getting him out the door sometimes has been difficult. But more than not wanting to leave, he doesn&#39;t like being left out. So in his case, his personality has provided the answer for us. I understand that dynamics are different because your son Damon is an only child. <br/>\n<br/>\nHowever, as I read your post, I wondered if your son has other people or other children that he really likes to see or play with? Perhaps, you could call with an invitation to meet them somewhere or ask if you could visit? No class. No have-to. Just play or hang-out. <br/>\n<br/>\nKate</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Struggling in Oregon","postDate":"1259806729","msgId":48844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCRjZGQjgwLTJCQjEtNDZERS1BRENELUZERkY2MTAwREFBM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDA2N2UwMWNhNzNhNiQ4M2Q4MzMzMCQ2NDBhYTlhOUBHb256bz4=","referencesHeader":"PDA2N2UwMWNhNzNhNiQ4M2Q4MzMzMCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":48842,"nextInTopic":48846,"prevInTime":48843,"nextInTime":48845,"topicId":48842,"numMessagesInTopic":0,"msgSnippet":"-=-I announce in the morning what we have to do today.-=- My have to alarm sounded.  It might help to announce (in some direct and conversational way) ","messageBody":"<div id=\"ygrps-yiv-1114916053\">-=-I announce in the morning what we have to do today.-=-<br/>\n<br/>\nMy &quot;have to&quot; alarm sounded. &lt;g&gt;<br/>\n<br/>\nIt might help to &quot;announce&quot; (in some direct and conversational way)  <br/>\nwhat you&#39;re doing the next day while you&#39;re winding down to sleep.   <br/>\nThat&#39;s always been the deal here.  At night people make their  <br/>\nreminders and declarations (not &quot;announcements&quot;) so we can checklist  <br/>\nwhether we have the right clothes clean, or cars available, or cash on  <br/>\nhand, or whatever.  Then as people get up, it&#39;s reviewed or people are  <br/>\nreminded.<br/>\n<br/>\nI wouldn&#39;t wake up and announce to my husband what we&#39;re doing  <br/>\ntomorrow.  Today he went to the doctor.  Monday we picked the car up  <br/>\nfrom the shop.  Tuesday he had a singing practice.  There&#39;s almost  <br/>\nalways something we have to cooperate to do, and some are crucial to  <br/>\ndo at a certain time, but neither of us &quot;announces,&quot; and it helped to  <br/>\nthink of speaking to my children in the same ways I would to friends  <br/>\nor their dad.<br/>\n<br/>\n-=-At this point he might start saying &quot;I&#39;m not going!&quot; or throw the wii<br/>\ncontroller across the room or try to kick me or hit me. What I do next<br/>\ndepends on where we were going and how badly I need to go right then. - <br/>\n=-<br/>\n<br/>\nDoes it help to have everything ready to go, shoes on, car keys in  <br/>\nyour pocket, and then play as the last thing?<br/>\n<br/>\n-=- We used to meet his dad for lunch, now we hardly ever go, or if we<br/>\ndo we&#39;re late and that&#39;s rude since Geoff has to go back to work. Both  <br/>\nare<br/>\ndisappointing for Geoff, he either misses us or is mad that we&#39;re  <br/>\nlate.-=-<br/>\n<br/>\nThose aren&#39;t the only two choices, late or miss it.<br/>\nThere&#39;s go early with something cool in mind so that you&#39;re both there  <br/>\nbefore his dad.<br/>\n<br/>\nI&#39;ve had games playing kids.  Do you have a gameboy?  It wouldn&#39;t need  <br/>\nto be a jazzy brand new one.  But that&#39;s not my best or favorite  <br/>\nsuggestion.<br/>\n<br/>\nIf you leave so early that you can get there early and have a table  <br/>\nand decorate it (arrange) it a bit, that might be fun.  If it&#39;s a  <br/>\nfamiliar restaurant, maybe you could order what he wants and have it  <br/>\nready to eat when he gets there!<br/>\n<br/>\n-=-Lately he has said he hates class and doesn&#39;t want to go. I have  <br/>\nboth let<br/>\nhim stay home and told him he needed to go.-=-<br/>\n<br/>\nHe&#39;s telling you he does NOT &quot;need&quot; to go.  He&#39;s saying he needs NOT  <br/>\nto go.   If you win by his going and he loses, or he wins by staying  <br/>\nand then you lose, you&#39;re being adversaries.<br/>\n<br/>\n-=- Other times he will kick and scream and I&#39;ll put him in the<br/>\ncar without shoes, thinking once we&#39;re there he&#39;ll have a good time, but<br/>\nhe&#39;ll carry on once in the class and throw himself on the floor and  <br/>\nsay he<br/>\nhates this class and wants to go home. I&#39;ll take him out and talk to  <br/>\nhim,<br/>\nand if he continues the fit ...-=-<br/>\n<br/>\nSurely that&#39;s not something you want to do every third day.  It  <br/>\ndoesn&#39;t sound like getting out into the sunshine to me at all.<br/>\n<br/>\n-=-Like I said, I&#39;ve been reading a lot, and am realizing there has to  <br/>\nbe a<br/>\nbalance of responsible parenting and freedom of choices. It&#39;s just  <br/>\nreally<br/>\nhard to see outside my own situation to get there! Any ideas?! I&#39;m  <br/>\nstuck!-=-<br/>\n<br/>\nOne clue to your stuckness might be that you don&#39;t think &quot;freedom of  <br/>\nchoices&quot; is responsible parenting.  I think &quot;freedom&quot; is a bad  <br/>\ndirection to head, but &quot;choices&quot; is a GREAT direction to head, so if  <br/>\nyou stick them together, you get all muddled and don&#39;t know which way  <br/>\nto go.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Struggling in Oregon","postDate":"1259796233","msgId":48842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2N2UwMWNhNzNhNiQ4M2Q4MzMzMCQ2NDBhYTlhOUBHb256bz4="},"prevInTopic":0,"nextInTopic":48844,"prevInTime":48841,"nextInTime":48843,"topicId":48842,"numMessagesInTopic":0,"msgSnippet":"I ve been thinking about the term daily struggle as it was brought up again recently. Also I ve been reading Sandra s Big Book (a lot over the holiday","messageBody":"<div id=\"ygrps-yiv-446730727\">I&#39;ve been thinking about the term &quot;daily struggle&quot; as it was brought up<br/>\nagain recently. Also I&#39;ve been reading Sandra&#39;s Big Book (a lot over the<br/>\nholiday weekend) and came across it again there.<br/>\n <br/>\nI don&#39;t have a DAILY struggle with my son Damon, but it does seem like we<br/>\nhave a LOT of struggles lately, mainly around leaving the house. I&quot;m getting<br/>\ndepressed about it. Reading about unschooling is not the same as living it!<br/>\nBut it has been good in getting my mind in a place where my ultimate goal is<br/>\npeace and a good relationship with my child. Damon is 5 and an only child.<br/>\n <br/>\nI announce in the morning what we have to do today. Usually I get him<br/>\ndressed while he plays wii or watches tv. I give notice that we are going<br/>\nsomewhere in a few minutes (saying 5 or 10 minutes has little meaning to him<br/>\nso I haven&#39;t been saying actual times). If he is playing a game I say he<br/>\nshould get to a good stopping point and save his game. If we are playing<br/>\ntogether, I might say this is our last battle or race or whatever.<br/>\n <br/>\nAt this point he might start saying &quot;I&#39;m not going!&quot; or throw the wii<br/>\ncontroller across the room or try to kick me or hit me. What I do next<br/>\ndepends on where we were going and how badly I need to go right then. (At<br/>\nthe very least I say to not throw things or hit people.) Sometimes I say<br/>\n&quot;Daddy is counting on us, he&#39;s really looking forward to seeing you at<br/>\nlunch.&quot; We used to meet his dad for lunch, now we hardly ever go, or if we<br/>\ndo we&#39;re late and that&#39;s rude since Geoff has to go back to work. Both are<br/>\ndisappointing for Geoff, he either misses us or is mad that we&#39;re late.<br/>\n <br/>\nIf he has a class to get to, we need to get there on time and dressed to<br/>\nplay. We have loads of classes available at our local parks & rec centers.<br/>\nThey are very cheap and low commitment, usually only 4 weeks, 45 mins per<br/>\nsession (30 mins for 3yr olds). Damon has taken gymnastics, soccer, tennis,<br/>\nkarate, baseball, and games galore, in this fashion, and several art classes<br/>\nwhich are just 1 time sessions. We also did swimming off and on when he was<br/>\n9-12 mos, it was a drop in Mommy and Me class and he really loved the water.<br/>\nNo committment, just pay when you go. <br/>\n <br/>\nNow before anyone says I&#39;m overscheduling my child, let me say that my son<br/>\nis extremely physical, moving all the time, and has enjoyed these classes<br/>\nsince he was very small. It&#39;s a great way to get his energy out and be<br/>\naround other kids and learn something new. He really loved going when he was<br/>\n3 and 4 and when the new book would come out, I&#39;d tell him what was<br/>\navailable and he would tell me what he was interested in. Usually only 1 or<br/>\n2 class at a time.<br/>\n <br/>\nBut now (at 5) he has become a huge fan of HOME. He doesn&#39;t like to leave<br/>\nthe house. He wants to stay home all day every day and play wii or watch<br/>\ncartoons. I am usually OK with being inside the house for 1 or 2 days but on<br/>\nday 3 of not leaving the house, I feel like I&#39;m on a cruise only looking out<br/>\nthe windows at outside and start to get grumpy and mad and really NEED to go<br/>\noutside and visit the sun and be some place that isn&#39;t home. It&#39;s also not<br/>\nlight very much these days (sun down by 4:30) and we stay up so late and<br/>\nsleep in so late, we barely have much daylight to enjoy! If I have an errand<br/>\nI need to do, I entice Damon by saying we can stop at Game Stop or get a<br/>\nsmoothie at Costco if we&#39;re going there. Sometimes that&#39;s enough, but often<br/>\nhe still won&#39;t want to leave the house.<br/>\n <br/>\nLately he has said he hates class and doesn&#39;t want to go. I have both let<br/>\nhim stay home and told him he needed to go. Both of those choices have gone<br/>\nwell and both have gone poorly. If I tell him he has to go to class,<br/>\nsometimes he puts on his own shoes and gets in the car and has a great time<br/>\nat the class (might even say at the end how much he liked it or tell his dad<br/>\nabout it later). Other times he will kick and scream and I&#39;ll put him in the<br/>\ncar without shoes, thinking once we&#39;re there he&#39;ll have a good time, but<br/>\nhe&#39;ll carry on once in the class and throw himself on the floor and say he<br/>\nhates this class and wants to go home. I&#39;ll take him out and talk to him,<br/>\nand if he continues the fit we&#39;ll leave. If he does go back into the class,<br/>\nit was under coercion and he doesn&#39;t pay attention to the teacher or do what<br/>\nhe&#39;s supposed to do and disrupts the class. This happened once and he ended<br/>\nup not allowed turns on the trampoline, his favorite part. He told me why<br/>\nand said next time he would pay attention so he could get all of his turns,<br/>\nwhich he actually did the following week. He is happy when I say he doesn&#39;t<br/>\nhave to go to class, but then Geoff is mad at me! <br/>\n <br/>\nSo classes have ended and I have not signed him up for anything else. He<br/>\nreally would benefit from physical classes or playing at the park but he<br/>\ndoesn&#39;t want to leave the house. So he is bouncing off the walls at home all<br/>\nday and fighting me when I say we need to leave the house, even if it<br/>\nincludes something fun for him. I used to stop by this local indoor play<br/>\nplace with slides and bouncers and cars to ride, but he never wants to go<br/>\nthere any more. It&#39;s too cold to do much outside. I&#39;m out of ideas.<br/>\n <br/>\nI think I&#39;m in a rut. No ideas. I&#39;ve started so many projects, thinking<br/>\nDamon might be interested and come join me, but I end up coloring or doing a<br/>\ncraft alone, making a fort for no one, cleaning or cooking or baking by<br/>\nmyself (which I HATE by the way, and don&#39;t want Damon to grow up hating the<br/>\nkitchen like I do, I suspect because my mom used to MAKE me help her and it<br/>\nwas never FUN). <br/>\n <br/>\nIf it&#39;s not a video game, he&#39;s not interested and there&#39;s only so much wii I<br/>\ncan play in a day. He&#39;s not getting enough excercise and has energy that<br/>\nkeeps him going until 3am. He only goes to bed then because I say I can&#39;t<br/>\nstay up any longer, so if he wants stories read, he&#39;d better come now before<br/>\nI fall asleep. It&#39;s about 50/50 if he throws a fit or goes on his own. It<br/>\ndepends on my approach and if he&#39;s really tired or not. <br/>\n <br/>\nLike I said, I&#39;ve been reading a lot, and am realizing there has to be a<br/>\nbalance of responsible parenting and freedom of choices. It&#39;s just really<br/>\nhard to see outside my own situation to get there! Any ideas?! I&#39;m stuck!<br/>\n <br/>\nKim Zerbe<br/>\nmom of 1 high energy kid<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":48828,"nextTopicId":48809}}