{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":71825534,"authorName":"Kandy","from":"&quot;Kandy&quot; &lt;kandyk438@...&gt;","profile":"kandyk438","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"THE WATER","postDate":"1084938114","msgId":19589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4ZWwyMitkaWo5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":19588,"nextInTime":19590,"topicId":19589,"numMessagesInTopic":0,"msgSnippet":"THE WATER It was one of the hottest days of the dry season. We had not seen rain in almost a month. The crops were dying. Cows had stopped giving milk. The","messageBody":"<div id=\"ygrps-yiv-240135809\">THE WATER<br/>\n<br/>\nIt was one of the hottest days of the dry season. We had not seen<br/>\nrain in almost a month. The crops were dying. Cows had stopped giving<br/>\nmilk. The creeks and streams were long gone back into the earth.<br/>\n<br/>\nIt was a dry season that would bankrupt several farmers before it was<br/>\nthrough. Every day, my husband and his brothers would go about the<br/>\narduous process of trying to get water to the fields.<br/>\n<br/>\nLately this process had involved taking a truck to the local water<br/>\nrendering plant and filling it up with water. But severe rationing<br/>\nhad cut everyone off. If we didn&#39;t see some rain soon...we would lose<br/>\neverything.<br/>\n<br/>\nIt was on this day that I learned the true lesson of sharing and<br/>\nwitnessed the only miracle I have seen with my own eyes. I was in the<br/>\nkitchen making lunch for my husband and his brothers when I saw my<br/>\nsix-year old son, Billy, walking toward the woods.<br/>\n<br/>\nHe wasn&#39;t walking with the usual carefree abandon of a youth but with<br/>\na serious purpose. I could only see his back. He was obviously<br/>\nwalking with a great effort...trying to be as still as possible.<br/>\n<br/>\nMinutes after he disappeared into the woods, he came running out<br/>\nagain, toward the house. I went back to making sandwiches; thinking<br/>\nthat whatever task he had been doing was completed. Moments later,<br/>\nhowever, he was once again walking in that slow purposeful stride<br/>\ntoward the woods.<br/>\n<br/>\nThis activity went on for an hour: walk carefully to the woods, run<br/>\nback to the house. Finally I couldn&#39;t take it any longer and I crept<br/>\nout of the house and followed him on his journey (being very careful<br/>\nnot to be seen...as he was obviously doing important work and didn&#39;t<br/>\nneed his Mommy checking up on him).<br/>\n<br/>\nHe was cupping both hands in front of him as he walked; being very<br/>\ncareful not to spill the water he held in them...maybe two or three<br/>\ntablespoons were held in his tiny hands. I sneaked close as he went<br/>\ninto the woods. Branches and thorns slapped his little face but he<br/>\ndid not try to avoid them. He had a much higher purpose. As I leaned<br/>\nin to spy on him, I saw the most amazing site.<br/>\n<br/>\nSeveral large deer loomed in front of him. Billy walked right up to<br/>\nthem. I almost screamed for him to get away. A huge buck with<br/>\nelaborate antlers was dangerously close. But the buck did not<br/>\nthreaten him...he didn&#39;t even move as Billy knelt down. And I saw a<br/>\ntiny fawn laying on the ground, obviously suffering from dehydration<br/>\nand heat exhaustion, lift its head with great effort to lap up the<br/>\nwater cupped in my beautiful boy&#39;s hand.<br/>\n<br/>\nWhen the water was gone, Billy jumped up to run back to the house and<br/>\nI hid behind a tree. I followed him back to the house; to a spigot<br/>\nthat we had shut off the water to. Billy opened it all the way up and<br/>\na small trickle began to creep out. He knelt there, letting the drip,<br/>\ndrip slowly fill up his makeshift &quot;cup,&quot; as the sun beat down on his<br/>\nlittle back. And it came clear to me. The trouble he had gotten into<br/>\nfor playing with the hose the week before. The lecture he had<br/>\nreceived about the importance of not wasting water. The reason he<br/>\ndidn&#39;t ask me to help him.<br/>\n<br/>\nIt took almost twenty minutes for the drops to fill his hands. When<br/>\nhe stood up and began the trek back, I was there in front of him. His<br/>\nlittle eyes just filled with tears. &quot;I&#39;m not wasting,&quot; was all he<br/>\nsaid. As he began his walk, I joined him...with a small pot of water<br/>\nfrom the kitchen. I let him tend to the fawn. I stayed away. It was<br/>\nhis job. I stood on the edge of the woods watching the most beautiful<br/>\nheart I have ever known working so hard to save another life.<br/>\n<br/>\nAs the tears that rolled down my face began to hit the ground, they<br/>\nwere suddenly joined by other drops...and more drops...and more. I<br/>\nlooked up at the sky. It was as if God, himself, was weeping with<br/>\npride.<br/>\n<br/>\nSome will probably say that this was all just a huge coincidence.<br/>\nThat miracles don&#39;t really exist. That it was bound to rain sometime.<br/>\nAnd I can&#39;t argue with that...I&#39;m not going to try. All I can say is<br/>\nthat the rain that came that day saved our farm...just like that<br/>\nactions of one little boy saved another.<br/>\n<br/>\n-- Author Unknown<br/>\n<br/>\nBlessings,<br/>\nKandy<br/>\n<br/>\nDo you currently sell products with MELALEUCA oil in them?  Get <br/>\nscripts and training here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/2crd7\">http://tinyurl.com/2crd7</a> <br/>\n<br/>\n <br/>\nHelp your AUTISTIC child without medication, special diets, or <br/>\nM.L.M&#39;s   <a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/3xbey\">http://tinyurl.com/3xbey</a></div>","specialLinks":[]}],"prevTopicId":19579,"nextTopicId":19598}}