{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Book Recommendation: $100 Startup for Parents or Kids Starting a Business","postDate":"1336484742","msgId":67103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzMkMyNkZCLTg5RDctNDJBRS1BMkUxLUFGRkE0RjRGRTAzREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpvYjZtbCsyZG83QGVHcm91cHMuY29tPg==","referencesHeader":"PGpvYjZtbCsyZG83QGVHcm91cHMuY29tPg=="},"prevInTopic":67102,"nextInTopic":0,"prevInTime":67102,"nextInTime":67104,"topicId":67102,"numMessagesInTopic":0,"msgSnippet":"Thanks! Holly (20) is looking ever more seriously into ideas involving small-venue music production and was asking me questions just yesterday that I couldn t","messageBody":"<div id=\"ygrps-yiv-627158088\">Thanks!<br/>\n<br/>\nHolly (20) is looking ever more seriously into ideas involving small-venue music production and was asking me questions just yesterday that I couldn&#39;t answer. :-)<br/>\n<br/>\nShe&#39;s planning to take some business classes at the community college and has a boyfriend in a punk band.  They go to small local shows three or four time a week, and she&#39;s fascinated by the buildings--some old industrial shops, some old storefronts, some residential houses--and how people decide what to do where, when and why.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":277265547,"authorName":"maltmanjamie","from":"&quot;maltmanjamie&quot; &lt;jamie.maltman@...&gt;","profile":"maltmanjamie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Book Recommendation: $100 Startup for Parents or Kids Starting a Business","postDate":"1336483349","msgId":67102,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpvYjZtbCsyZG83QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67103,"prevInTime":67101,"nextInTime":67103,"topicId":67102,"numMessagesInTopic":0,"msgSnippet":"Hi everyone,    I know a lot of parents in the unschooling community either have a business or would like to have a side business, and more and more of the","messageBody":"<div id=\"ygrps-yiv-379790938\">Hi everyone,    I know a lot of parents in the unschooling community<br/>\neither have a business or would like to have a side business, and more<br/>\nand more of the kids are starting up their own businesses as well, so I<br/>\nthought this book recommendation would be appropriate for the list.<br/>\nThe $100 Startup by Chris Guillebeau goes on sale today. I had the<br/>\npleasure of meeting Chris when he came to Toronto for his Art of<br/>\nNon-Conformity self-promotion book tour - I recommend that book and his<br/>\nblog as well since we&#39;re all non-conformists here to a significant<br/>\nextent - and he sent me a preview copy of his new book. After reading<br/>\nit, I bought another copy to share.<br/>\n<br/>\nAs a Dad who has started several businesses in various industries over<br/>\nthe past 8 years, and whose family is currently supported by our<br/>\nbusiness efforts, this topic is near and dear to my heart. I wish I had<br/>\nthis book 8 years ago, and learned a lot from it that is still relevant<br/>\nto my both my new business, my future business ideas, and my existing<br/>\nbusiness.<br/>\n<br/>\nThe book is not about Shark Tank or Dragon&#39;s Den style strike it rich<br/>\nstartup ideas to be the next Google, its about using the skills and<br/>\ninterests and resources you have right now to create a business that is<br/>\nright for you and the life you want to live. While Chris has been<br/>\nsuccessfully self-employed for years now, and it has supported his<br/>\nmission to visit all 175 UN recognized countries before he turns 35 (and<br/>\nhe&#39;s got about a dozen left for his last year) and is a wealth of<br/>\nexperience and ideas, that&#39;s not even the full power of the book. He<br/>\ninterviewed 1500 other entrepreneurs from all over the world in any<br/>\nindustry you could find, all of whom created a full time income of<br/>\n$50,000 or more, and you get to learn from these case studies throughout<br/>\nthe book.<br/>\n<br/>\nOf special note to us, two of the families featured are unschoolers who<br/>\nnow support themselves from their businesses, as well as other<br/>\nmomtrepreneurs. So while Chris doesn&#39;t have kids, the book certainly<br/>\nshows the way for those of us that do.<br/>\n<br/>\nIts very well written, edited and structured - and has great practical<br/>\ntools and a companion website and supportive community around it. There<br/>\nare specific templates for everything from your mission statement to<br/>\nbusiness plan to plans for sales offers, launch, and promotion. I&#39;ve<br/>\nnever read a better book about starting a new business today, whether<br/>\nonline or very traditional or both.<br/>\n<br/>\nI&#39;d recommend it for all the parents out there who have a business<br/>\nalready, or have a business idea, or wish they could add some kind of a<br/>\nside business to their family life to better support their unschooling<br/>\nlifestyle. We chose to start businesses so that we could create the time<br/>\nflexibility for us both to be at home with our little guys, and I know<br/>\nthat resonates with a lot of people.<br/>\n<br/>\nI&#39;d also recommend it even more strongly to any of your kids who have<br/>\nbusiness ideas, or are interested in understanding what it takes to<br/>\nstart up a business. One of these stories may inspire them to create<br/>\nsomething amazing in their lives.<br/>\n<br/>\nYou can watch the video book trailer here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtu.be/xbwBboFr3fQ\">http://youtu.be/xbwBboFr3fQ</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtu.be/xbwBboFr3fQ\">http://youtu.be/xbwBboFr3fQ</a>&gt;<br/>\n<br/>\nor read more about what Chris has to say here at the book website:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://100startup.com/\">http://100startup.com/</a> &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://100startup.com/\">http://100startup.com/</a>&gt;<br/>\n<br/>\nand please take the opportunity to meet up with him when he comes to a<br/>\ncity near you on his self-financed book tour on the tour page. I&#39;ll be<br/>\nat the Toronto event again, and would love to meet you if you are too!<br/>\n<br/>\nCheers,<br/>\nJamie (the Dad)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/xbwBboFr3fQ?wmode=opaque","type":"VIDEO"}]}],"prevTopicId":67049,"nextTopicId":67105}}