{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] sleeping/bedtimes etc.was: Florida here","postDate":"1072238882","msgId":17694,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1NUZENzlGRTczQUUwNDVBRjI4QUM0MkFCQTkyNDhDMEYwMTQxQGRlbHRhLW1haWwuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":17664,"nextInTopic":0,"prevInTime":17693,"nextInTime":17695,"topicId":17664,"numMessagesInTopic":0,"msgSnippet":"I think that one thing to remember too is that not all kids do fall asleep easily on their own. With my oldest, now 7, we have gone through SO many different","messageBody":"<div id=\"ygrps-yiv-137134126\">I think that one thing to remember too is that not all kids do fall<br/>\nasleep easily<br/>\non their own. With my oldest, now 7, we have gone through SO many<br/>\ndifferent types<br/>\nof sleep...and only now is he comfortable with falling asleep by<br/>\nhimself. He was <br/>\n*able* to do it, if he had to, but he did not like too and I did not see<br/>\nany<br/>\nreason to force the issue. The funny thing is, that it was not until I<br/>\ngave up<br/>\ntrying to get him to bed at a certain time that I was able to find what<br/>\nwould<br/>\nwork well for us. <br/>\n<br/>\nWhen I first &quot;gave up bedtimes&quot;, he would stay up until I<br/>\nwas ready for bed, sometimes around 12 or 1. But then he was exhausted<br/>\nthe next<br/>\nday. What I found after a little while of this was that he seemed to<br/>\nhonestly<br/>\nget tired around 10 pm, but his desire to stay up with me caused him to<br/>\nstay<br/>\nawake as long as he could. So I just gradually adjusted our nighttime<br/>\nroutine.<br/>\nInstead of reading for a little while at 8 and then letting him stay up<br/>\nuntil<br/>\nhe was tired, I now read to both boys starting around 8:30ish, Kyle<br/>\nusually <br/>\ncrashes around 9 and Jason and I keep reading until around 10ish. We<br/>\nthen<br/>\ngo upstairs and I lie down with him a bit (and we have some of the best <br/>\nconversations! Last night we talked all about the solstices and<br/>\nequinoxes) and<br/>\nnow he is perfectly fine with me going downstairs (in the past anytime I<br/>\ntried<br/>\nto leave before he was asleep, he would be up and after me within<br/>\nminutes).<br/>\n<br/>\nOver the years we tried so long to get him onto a schedule..sometimes<br/>\nwith <br/>\nsuccess, but for the most part not. For us it was not for lack of<br/>\ntrying!<br/>\nHe just tends to be a very high energy kid who does not tire easily. He <br/>\nalso has a very strong need to be with people. It has only been in the<br/>\nlast<br/>\nyear that I have truly begun to see this as how he is and begun to be<br/>\nable<br/>\nto accept it. Luckily we discovered the family bed when he was 1 and we<br/>\nworked on all sorts of gentle ways to help him sleep..relaxation<br/>\nexercises,<br/>\nlavender on his pillow etc. But underlying it was that we were trying to<br/>\n<br/>\nchange him...now I feel more like we are accepting him and his sleep<br/>\nneeds<br/>\nand trying to work out something that works for everyone. I do wake<br/>\neveryone at around 8am, but we cuddle on the couch together watching<br/>\ndora <br/>\nor save-ums while we wake up. Actually a very nice way to wake up. <br/>\n<br/>\nFunny thing is, Kyle (almost 4), who was nursed to sleep and shared a<br/>\nbed with us from<br/>\nday 1 has always fallen asleep between 8 and 9. He used to tell me when<br/>\nhe<br/>\nneeded a nap also. Kyle&#39;s sleep from day one was very unstructured...he<br/>\nslept<br/>\nwhen he was sleepy in a sling and we did little to no scheduling.<br/>\nDifferent kids,<br/>\ndifferent needs. Sometimes I am glad that we had Jason first, as we<br/>\nmight never have<br/>\ndiscovered the joys of co-sleeping.<br/>\n<br/>\nDH has not always been overly happy with our sleep arrangements...we<br/>\nhave had to<br/>\nbe very creative sometimes to get time together. I kept telling him that<br/>\nit would<br/>\nnot last forever and it seems like we have finally hit that time...we<br/>\nhave a couple<br/>\nof hours each evening and have just now started going away overnight<br/>\n(the kids<br/>\nadore my ILs). Kyle has just now started sleeping with his brother,<br/>\nbefore that<br/>\nhe would fall asleep in the living room and I would move him into bed<br/>\nwith us<br/>\nwhen I went to sleep...leaving the bedroom free for when we needed it.<br/>\n;o)<br/>\n<br/>\nGood luck Heidi! Just keep trying to think of ways to work so that<br/>\neveryone&#39;s needs<br/>\nare met. They may not be met today, but if you keep thinking about it<br/>\nyou may <br/>\nsurprise yourself and come up with some creative solutions. <br/>\n<br/>\nStephanie E.</div>","specialLinks":[]},{"userId":78134331,"authorName":"Genant2@aol.com","from":"Genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"sleeping/bedtimes etc.was: Florida here","postDate":"1072195999","msgId":17664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Ni4yYTVmOWM5MS4yZDE5YzM5ZkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":17694,"prevInTime":17663,"nextInTime":17665,"topicId":17664,"numMessagesInTopic":0,"msgSnippet":"... need you to help them sleep and you being there probably actually keeps them from sleeping well.","messageBody":"<div id=\"ygrps-yiv-1183276062\"><blockquote><span title=\"ireply\">&gt;&gt;Now about the not enforcing a bedtime - WHY??? Your kids do not <br/>\n </span></blockquote>need you to help them sleep and you being there probably actually <br/>\nkeeps them from sleeping well.&lt;&lt;<br/>\n<br/>\nI believe that some children do need help to sleep.  I know we have a <br/>\ncosleeping arrangement.  My boys would find it difficult alone as would I.  When we <br/>\nare together we sleep peacefully.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; It is not against the unschooling train of thought to insist that your <br/>\n </span></blockquote>children be in their rooms by a certain time each night.&lt;&lt;<br/>\n<br/>\nNot sure about the &quot;unschooling train of thought&quot; but I never insist on <br/>\nanything.  My mother was like that.  It was &quot;because I said so&quot;.  We never had any <br/>\ndialogue, my thoughts and feelings were not respected.  That is something I <br/>\nwant for my children.  I  respect their thoughts and opinions.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We remind him about 7 everynight that it is about time for bed, he knows <br/>\n </span></blockquote>the routine that he needs to get his pjs on and clean up whatever he&#39;s working <br/>\non (he doesn&#39;t have to put away stuff he wants to work on the next day but he <br/>\ncan&#39;t have toys everywhere) then he picks out a story for me himself and dad, <br/>\ngoes potty, brushes teeth etc. If he is not ready by 7:30 then no stories and <br/>\nhe has to put himself to bed and we do only hugs and kisses,&lt;&lt;<br/>\n<br/>\nIn our house we don&#39;t withhold things to &quot;get someone to do what we want&quot;.  <br/>\nPunishment isn&#39;t our way.  I would rather that my children get ready for bed <br/>\nbecause they are tired. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I can see how your dh <br/>\n </span></blockquote>could easily be stressed by the situation - I think I would be <br/>\nalso!!! Why not have a family meeting and come to a good agreement <br/>\non a bedtime, a time for the children to remain in their rooms and <br/>\nget ready for sleep in their own way.&lt;&lt;<br/>\n<br/>\nA family meeting is only good if everyone has equal say and everyone&#39;s voice <br/>\nis respected and there is a win-win situation. Where everyone&#39;s needs are at <br/>\nleast partially met. Sometimes a family meeting can lead to &quot;this is the way we <br/>\nare doing things&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Perhaps letting them understand how to put themselves to sleep is a gift <br/>\n </span></blockquote>you could give them now, and the gift to your family would be a stronger <br/>\nrelationship between you and your dh. Remember that freedom is no <br/>\nlonger freedom when it infringes on the rights of others. Good luck! &lt;&lt;<br/>\n<br/>\nand perhaps not.  It doesn&#39;t take a bedtime and adult alone time every night <br/>\nat 7:30 to build a strong relationship.  We have always attachment parented <br/>\nand coslept. (Was it Heidi in the original post)  It sounds like you have worked <br/>\nout a good compromise that is working for everyone.  You get your sleep and <br/>\nthe children and dad get theirs.  Conversation time with dad can happen <br/>\nanytime.  The children don&#39;t have to be asleep for that.  I know that my boys often <br/>\nplay int eh living room while we are eating dinner.  Or will be watching a TV <br/>\nshow in another room etc.  And &quot;private&quot; time with your dh can also happen <br/>\nanywhere.  Sometimes when you do cosleep I think you have to be more flexible.  <br/>\nBut I do agree with you.  I feel I brought these children into the world it is <br/>\nmy responsibility to meet their needs.  Right now they need to security and <br/>\ncomfort of sleeping with me.<br/>\n<br/>\nJust a couple of thoughts,<br/>\nPam G<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":17673,"nextTopicId":17683}}