{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Writing samples (grown unschoolers)","postDate":"1467793584","msgId":77289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwRjRGMzI2LTkxN0QtNDEyRS05MzVELTA4MzAyMjdFOENDOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":77288,"nextInTime":77290,"topicId":77289,"numMessagesInTopic":0,"msgSnippet":"Things my kids have written lately— Kirby Dodd (in answer to a “which weapon should I choose?” in a multi-player online game: One other thing to consider","messageBody":"<div id=\"ygrps-yiv-105438904\">Things my kids have written lately—<br/>\n<br/>\n<br/>\nKirby Dodd (in answer to a “which weapon should I choose?” in a multi-player online game:<br/>\n One other thing to consider is playstyle. Are you high agility and use VATS often? If so, authority will let you crit more often. If you&#39;re playing more of a FPS style, then unending is definitely the better path.<br/>\n<br/>\n_______________<br/>\n<br/>\nMarty Dodd, writing as Sir Bardolf, the Baron of al-Barran (which might be impressive to SCA members, but just a weird real-life game thing to others—and a weird real-life game thing even to SCA members, but impressive):<br/>\n<br/>\n<br/>\n<br/>\nal-Barran,<br/>\n<br/>\nWe have returned from the Midrealm!<br/>\n<br/>\nOn our pilgrimage to celebrate the 50th year of our society we were accompanied by a few loyal retainers and endured great hardships: winds that threatened entire towns, heat that broke the mightiest warriors, daytime that lasted till near midnight, the great “quiet hours”, the barren wastelands of the Village Green, and ale shortages as well. <br/>\n<br/>\nThis quest was not easy but we have survived and returned, bringing with us; abundant knowledge on matters of history and courtesy, confidence in the Outlands’ hospitality and merrymaking, and renewed vigor for all that we do here in al-Barran.<br/>\n<br/>\nWe carried always, in our hearts, the comfort and love of our home.<br/>\n<br/>\n-Bardolf & Sabiha, <br/>\nBaron and Baroness of al-Barran.<br/>\n______________________________________<br/>\n<br/>\nHad I edited, I would’ve objected to one semi-colon, and scrapped that period at the end, but poetically it’s pretty nice.<br/>\n____________<br/>\n<br/>\nHolly… some tweets.  Mostly hers are photos with commentary, but here are some text-only tweets of recent days:<br/>\n_______<br/>\n<br/>\nI am going to keep this life.<br/>\n_______<br/>\n<br/>\nI think Sam Rockwell would make Lex Luther great again.<br/>\n________<br/>\n<br/>\nHolding down the Fort in the North today. Aka. pouring cold beer in beautiful Rinconada, NM! <br/>\n<br/>\n(Holly works at a Brew Pub, and she came in while I was working on this post.  She says the Sam Rockwell comment was a play on “make  America great again.”)<br/>\n<br/>\n_______________________________<br/>\n<br/>\nI like Kirby’s being technical but concise.  Marty’s is flowery and in character.   Holly’s have a nice rhythm.<br/>\nThey’re all real writing—not assignments in any way.  Not practice writing.<br/>\n<br/>\nOften when detractors of unschooling ask their questions or state their fears, “how will they learn to write a report?” is one of them.  I ask “Report what?”  And those people who are thinking of “school reports” and “book reports” and “research papers” don’t know the answer to what a report would be, in the real world.<br/>\n<br/>\nMarty’s writing above is a report.  Kirby writes reports at work—of progress on contracts, and people’s “metrics” (performance times and customer satisfaction), and problems and needs.   Those are what school tries to prepare people for.  Holly usually writes artsy humor and inspirational short bursts.<br/>\n<br/>\nI just wrote a report on some of the writing my kids have done lately, to a group of people.  Some will read it, some won’t.  Some of those who read it will make use of the information to feel more confident in their own lives, or as amusement and checkpoints in following the continued learning and lives of unschoolers they’ve read about or met before.<br/>\n<br/>\nThere is school writing, and there is real writing.  <br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":77230,"nextTopicId":77294}}