{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","profile":"mfhickman95616","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Kids, school and unschooling","postDate":"1046620631","msgId":59961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2MDQ4NzAuMTA0NjYyMDYxNTQzMi5KYXZhTWFpbC5ub2JvZHlAYmlnYmlyZC5wc3AucGFzLmVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":59960,"nextInTime":59962,"topicId":59961,"numMessagesInTopic":0,"msgSnippet":"Hi, I m listening to the conversation about how school fits in with unschooling. We decided when our oldest was 2 to keep her with us instead of starting her","messageBody":"<div id=\"ygrps-yiv-1138930218\">Hi,<br/>\n<br/>\nI&#39;m listening to the conversation about how school fits in with unschooling. We decided when our oldest was 2 to keep her with us instead of starting her in Kindergarden. We have 3 kids now, 2 home and my oldest is trying a year in school. She asked several times to go. This last time she seemed mature nough to try. She&#39;s in 3rd grade. I would prefer she was home, yet it was her deal. Her wanting, over and over again to know. I think she needs to be in the system also, to compare between school and unschooling. <br/>\n<br/>\nShe lives, though in a home where learning is valued, encouraged and our passions are followed. An unschooling house. School is part of our world, more so that I would like. Our life has not changed so much though, other than Ashley is gone during the day and we go get her at 2:30. She is aware of our way of learning and takes this with her to school. She has choices to come on outings with us or go to school. She also knows that she can come back when she has had her fill. She picks school most of the time over theater outings, fishing, and other trips. She spends alot of her time with her teacher, forging a relationship with another trusted adult. We have been lucky, in that she and her teacher really bonded and I suspect will be friends for a long time following this year. Ashley is thriving in her environment, and I do appreciate she choose a free activity this year. She has in the past been drawn to high cost activities, like swim teams and dance lessons. Next year will come and we will decide if school is part of her day.<br/>\n<br/>\nMary H.</div>","specialLinks":[]}],"prevTopicId":59960,"nextTopicId":59886}}