{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":154033277,"authorName":"Crystal","from":"&quot;Crystal&quot; &lt;crystal.pina@...&gt;","profile":"crystalinma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Unschooling - some questions","postDate":"1062770636","msgId":79934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDkwMWMzNzNiNiQ4YmZmYjhlMCRiYWVhZmVhOUBTRVlNT1VSQlVUVFM+","referencesHeader":"PGJqYTJ2dCtjc2ZuQGVHcm91cHMuY29tPg=="},"prevInTopic":79932,"nextInTopic":0,"prevInTime":79933,"nextInTime":79935,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"Priss said:  If I gave Glenn a test right now could he pass? Yesterday he did that. Wanted to know if Glenn could still do long division problems, something","messageBody":"<div id=\"ygrps-yiv-1104960264\">Priss said:  &quot;If I gave Glenn a test right now could he pass?&quot; Yesterday he<br/>\ndid that. Wanted to know if Glenn could still do long division problems,<br/>\nsomething he could do pretty easily a couple of years ago. I told my husband<br/>\nI didn&#39;t know, but that if Glenn couldn&#39;t still do the problems it seemed to<br/>\nme it would uphold the unschooling point of view that drill and successful<br/>\ntest taking are not the same as learning.<br/>\n<br/>\nPriss, you can tell your husband that my son was public schooled through 6th<br/>\ngrade.  He learned long division in 4th grade which meant he had 2 full<br/>\nyears of practicing long division problems on papers.  Today he says he<br/>\ndoesn&#39;t know how to do long division.  If you gave him a test today on long<br/>\ndivision he would fail.  You are absolutely right that drill and then tests<br/>\nare not the same as learning.<br/>\n<br/>\nCrystal</div>","specialLinks":[]},{"userId":3082890,"authorName":"Priss Adams","from":"&quot;Priss Adams&quot; &lt;Priss1000@...&gt;","profile":"priss_adams","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling - some questions","postDate":"1062768445","msgId":79932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJqYTJ2dCtjc2ZuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5MS4xZWFjMmE1YS4yYzg5NWZkOUBhb2wuY29tPg=="},"prevInTopic":79925,"nextInTopic":79934,"prevInTime":79931,"nextInTime":79933,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"... counterproductive. The ... I found that to be very much the case in our household. For a few years my husband insisted on math lessons for our son, though","messageBody":"<div id=\"ygrps-yiv-1889519\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, dacunefare@a... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Or they learn that math isn&#39;t part of a real everyday life.<br/>\n&gt; <br/>\n&gt; Which is why &quot;unschooling everything except math&quot; is <br/>\n </span></blockquote>counterproductive. The <br/>\n<blockquote><span title=\"ireply\"> &gt; kids learn the exact opposite of what the parents intend.<br/>\n&gt; <br/>\n&gt; Deborah in IL<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I found that to be very much the case in our household. For a few <br/>\nyears my husband insisted on math lessons for our son, though dh had <br/>\nread some John Holt and liked what he read, though he agreed with <br/>\nunschooling for the most part. He still thought math had to be taught <br/>\nsequentially, with a lot of practice, on paper. I wasn&#39;t so sure <br/>\nabout it myself to completely disagree with him (at first) so I <br/>\nworked with my son on math for a long time. The result became that <br/>\nGlenn hated math and felt he was an idiot where math was concerned. <br/>\nIt didn&#39;t affect only math. He got to where he distrusted me if it <br/>\nseemed I wanted to talk about anything that he thought <br/>\nwas &quot;educational.&quot; It even seemed to affect reading though I can&#39;t be <br/>\nsure the connection is there. He enjoyed reading when he was younger <br/>\nbut got to the point where he didn&#39;t even want to read. He would tell <br/>\nme he &quot;hated reading&quot; like he &quot;hated math.&quot; Since I&#39;d never forced <br/>\nreading on him even in our early more structured homeschool days, I <br/>\nthink he was just closing off reading as a possibility of something <br/>\nfun because his dad and I seemed to think books were valuable and <br/>\nsince we also seemed to think math was valuable he just couldn&#39;t <br/>\ntrust us. That&#39;s my theory. I don&#39;t know if it&#39;s true, but it seems <br/>\nlikely to me.<br/>\n<br/>\nAfter the conference last year I had a showdown with my husband and <br/>\ntold him the math thing wasn&#39;t working, that it was <br/>\ncounterproductive, and he agreed very reluctantly to have us unschool <br/>\nGlenn for real. He&#39;s still not a real supporter and still asks from <br/>\ntime to time if we &quot;did math&quot; or he&#39;ll say &quot;If I gave Glenn a test <br/>\nright now could he pass?&quot; Yesterday he did that. Wanted to know if <br/>\nGlenn could still do long division problems, something he could do <br/>\npretty easily a couple of years ago. I told my husband I didn&#39;t know, <br/>\nbut that if Glenn couldn&#39;t still do the problems it seemed to me it <br/>\nwould uphold the unschooling point of view that drill and successful <br/>\ntest taking are not the same as learning. He seemed to listen and <br/>\ndidn&#39;t continue the badgering so maybe that helped.<br/>\n<br/>\nGlenn&#39;s had almost a year of unschooling without that holdout of math <br/>\nand I think he&#39;s healing some. He&#39;ll notice and mention how <br/>\nsomething has math in it without running scared the other direction. <br/>\nHe&#39;s more open to talking with me about a lot of different things and <br/>\nisn&#39;t worrying that I&#39;m trying to &quot;teach&quot; him. He read a book last <br/>\nnight and has started another one this morning. Anyway, I sure <br/>\nagree that unschooling everything except math is wayyyyy <br/>\ncounterproductive. It affects the whole unschooling experience in a <br/>\nbad way. <br/>\n<br/>\nPriss</div>","specialLinks":[]},{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling - some questions","postDate":"1062733273","msgId":79925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MS4xZWFjMmE1YS4yYzg5NWZkOUBhb2wuY29tPg=="},"prevInTopic":79906,"nextInTopic":79932,"prevInTime":79924,"nextInTime":79926,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"**That might sound lame to people new to unschooling, but if the parent reserves something (math, usually) as the thing they won t risk, the child learns that","messageBody":"<div id=\"ygrps-yiv-67254181\">**That might sound lame to people new to unschooling, but if the parent<br/>\nreserves something (math, usually) as the thing they won&#39;t risk, the child <br/>\nlearns<br/>\nthat math is hard and important, but the other stuff isn&#39;t as important.**<br/>\n<br/>\nOr they learn that mom thinks they aren&#39;t smart enough to learn math without <br/>\nspecial help.<br/>\n<br/>\nOr they learn that math isn&#39;t part of a real everyday life.<br/>\n<br/>\nWhich is why &quot;unschooling everything except math&quot; is counterproductive. The <br/>\nkids learn the exact opposite of what the parents intend.<br/>\n<br/>\nDeborah in IL<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshiantafti","from":"Pamela Sorooshiantafti &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062716539","msgId":79906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MjI1NjMuMTA2MjcxNjUzOTA0NS5KYXZhTWFpbC5wYW1zb3Jvb3NoQG1hYy5jb20+"},"prevInTopic":79903,"nextInTopic":79925,"prevInTime":79905,"nextInTime":79907,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"... matter how easygoing my tone. I hear you saying that your kid and Pam s kid weren t, that they enjoy it, but my point is that not all kids will respond","messageBody":"<div id=\"ygrps-yiv-1529103263\"><blockquote><span title=\"ireply\">&gt;&gt;I know that Rain would be upset by my saying things like that to her, no <br/>\n </span></blockquote>matter how easygoing my tone. I hear you saying that your kid and Pam&#39;s <br/>\nkid weren&#39;t, that they enjoy it, but my point is that not all kids will <br/>\nrespond that way. &gt;&gt;<br/>\n<br/>\n<br/>\nI kind of responded to this - but I need to be more clear that my kids don&#39;t take well to people quizzing them either. It doesn&#39;t happen to them very often- but once in a while they feel &quot;quizzed&quot; by someone and they&#39;re kind of bewildered by it, to be honest. They&#39;ve asked me, later, &quot;Why was so-and-so asking me those questions&quot; and they&#39;ve even said things directly to the person, like,&quot;I&#39;m sorry, don&#39;t understand why you&#39;re asking me questions like this that you know the answers to.&quot; &lt;G&gt;<br/>\n<br/>\nIt isn&#39;t my nature to quiz them like that - so it hasn&#39;t come up between us - but I do remember my youngest being suspicious once, of a question I was asking. She responded, &quot;Mom, are you really asking or just trying to find out if I know?&quot; I was really asking - this was before she&#39;d realized how much she knows that I don&#39;t know, I guess. She&#39;s still startled by that realization sometimes &lt;G&gt;.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":158112576,"authorName":"TeresaBnNC@aol.com","from":"TeresaBnNC@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062715280","msgId":79903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMy4zNTYwOTYxYy4yYzg5MTk5MEBhb2wuY29tPg=="},"prevInTopic":79895,"nextInTopic":79906,"prevInTime":79902,"nextInTime":79904,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/4/03 1:49:36 PM Eastern Daylight Time, freeform@juno.com ... I understand that.  I just shared some things that happen in our family.  It ","messageBody":"<div id=\"ygrps-yiv-2091362951\">In a message dated 9/4/03 1:49:36 PM Eastern Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freeform@...\">freeform@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I hear you saying that your kid and Pam&#39;s<br/>\n&gt; kid weren&#39;t, that they enjoy it, but my point is that not all kids will<br/>\n&gt; respond that way.<br/>\n<br/>\n </span></blockquote>I understand that.  I just shared some things that happen in our family.  It <br/>\nwas not meant as an endorsement that that kind of exchange will be the best <br/>\nfor everyone.   <br/>\n<br/>\n Ethan hates being quizzed.. even in game/fun situations.  Landon and JP love <br/>\nto be quizzed ( although, as I said before, the conversation I referred to <br/>\nwas NOT quizzing, it was talking)  They enjoy answering trivial pursuit <br/>\nquestions,  Brainquest, watching Jeopardy, &quot;Millionaire&quot;  etc.  I am talking about FOR <br/>\nFUN, on thier own accord, requesting these activities, seeking them out.  <br/>\nYeah, I will be the first to agree, some kids may be resistant to a conversation <br/>\nthat includes questions...  So, of course, you wouldnt engage in that type of <br/>\nconversation with that child.<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"psoroosh","from":"&quot;psoroosh&quot; &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling - some questions","postDate":"1062700042","msgId":79895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJqODA2YStmNDFlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFkZC4xMDVhMGEwMS4yYzg4Y2MzMkBhb2wuY29tPg=="},"prevInTopic":79893,"nextInTopic":79903,"prevInTime":79894,"nextInTime":79896,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"Actually, this scenario is very similar to some that Pam S talked about in her Math lecture at the conference. She asked her daughter how much change she","messageBody":"<div id=\"ygrps-yiv-1506069183\">Actually, this scenario is very similar to some that Pam S talked <br/>\nabout in her Math lecture at the conference. She asked her daughter <br/>\nhow much change she expected to get back from a purchase, and it <br/>\nturned out to be a good thing, as she was overcharged. &gt;&gt;<br/>\n<br/>\n<br/>\nKind of like what I was talking about. But - maybe this will help <br/>\nexplain the difference between &quot;quizzing&quot; for teaching purposes and <br/>\nwhat I was trying to convey about how unschooling parents facilitate <br/>\nlearning as they&#39;re going through real life with their kids:<br/>\n<br/>\nI handed a $20 bill to my young child - she was 9 years old. She went <br/>\nacross the mall (where I could still see her but not hear or <br/>\nparticipate in the transaction) to buy a cookie. As I handed her the <br/>\nmoney I said something like: &quot;It is good to think in advance about <br/>\napproximately how much change you expect to get, to make sure you get <br/>\nthe right amount.&quot; She sort of quickly figured it out, assumed a <br/>\ncookie would be a few dollars and said how much it was, but I wasn&#39;t <br/>\nactually asking her to TELL me. It was definitely not a quiz. I was <br/>\noffering useful information with a practical purpose - practical and <br/>\nuseful TO the child, not useful because it is something I thought she <br/>\nmight need to know someday and not practical because I thought she <br/>\nneeded to know arithmetic now in order to do algebra later to get <br/>\ninto college and get a good job, etc.<br/>\n<br/>\nAs it turned out, I couldn&#39;t have chosen a better time to just happen <br/>\nto mention predicting your change -- the girl behind the cookie <br/>\ncounter returned change for a $10 bill, not a $20. My daughter <br/>\npointed it out and got the right change. So - the most important <br/>\nthing about this whole incident that was the most cool aspect - my <br/>\ndaughter got a dose of instant reinforcement that my suggestions are <br/>\nworth listening to. She thought I was psychic or something, of <br/>\ncourse! &lt;G&gt; Very impressed.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;You have to read and believe that the tone in these conversations <br/>\nis natural and easy going. &gt;&gt;  <br/>\n<br/>\nAnd that they are conversations, not teacher moments. Not necessary <br/>\nthe same conversation I&#39;d have with another adult, though. I wouldn&#39;t <br/>\nsuggest to my friend Jocelyn that its a good idea to know how much <br/>\nchange to expect before you hand over a big bill like that. So it <br/>\nisn&#39;t a conversation I&#39;d really ever have with an adult. STILL, the <br/>\nprinciple is the same - would I offer useful information to an adult <br/>\nfriend? Sure - do it all the time. My friends offer useful <br/>\ninteresting information tome all the time too. Those are the friends <br/>\nI most appreciate and enjoy!! Is this useful information for my child <br/>\nand am I offering it in that same spirit that I&#39;d offer it to an <br/>\nadult? If yes - that&#39;s an unschooling kind of thing to do.<br/>\n<br/>\nIs it information that I just want to somehow drop into her brain <br/>\nbecause I think it is good for her? Is it for some future need that <br/>\nshe has no way of understanding? Is it me thinking &quot;you need to know <br/>\nthis&quot; just because I think she should? Is it something the child <br/>\nisn&#39;t going to see any practical use for right now? If the answer to <br/>\nthese questions is &quot;yes&quot; then I&#39;m not unschooling, I&#39;m schooling.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;And, although I may ask him questions that I know the answers, I <br/>\n </span></blockquote>never ask him questions that he obviously knows ( or has thought out) <br/>\nthe answers to. Maybe you just have to hear it in person to <br/>\nunderstand it&lt;&lt;<br/>\n<br/>\nOr keep reading with an open mind - it was the accumulation of lots <br/>\nand lots of stories like this that helped me grasp the basic <br/>\nprinciples of unschooling. That, and just trying them out in our <br/>\nlives and observing the real-life results.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062697345","msgId":79893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwOTA0LjEwNDMyMS4yNjAuMy5mcmVlZm9ybUBqdW5vLmNvbT4="},"prevInTopic":79892,"nextInTopic":79895,"prevInTime":79892,"nextInTime":79894,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"... a sense ... similar to ... She ... purchase, ... have to read ... going. I know that Rain would be upset by my saying things like that to her, no matter","messageBody":"<div id=\"ygrps-yiv-581130074\">On Thu, 4 Sep 2003 13:11:14 EDT <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:TeresaBnNC@...\">TeresaBnNC@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; JP knows that I know the answers to these questions too.  But he  gets<br/>\n </span></blockquote>a sense <br/>\n<blockquote><span title=\"ireply\"> &gt; of mastery and accomplishment if he can figure it out himself.  I <br/>\n&gt; would never  try to frustrate him.   Actually, this scenario is very<br/>\n </span></blockquote>similar to <br/>\n<blockquote><span title=\"ireply\"> &gt; some that  Pam S talked about in her Math lecture at the conference.  <br/>\n </span></blockquote>She <br/>\n<blockquote><span title=\"ireply\"> &gt; asked her daughter how much change she expected to get back from a<br/>\n </span></blockquote>purchase, <br/>\n<blockquote><span title=\"ireply\"> &gt; and it turned  out to be a good thing, as she was overcharged.    You<br/>\n </span></blockquote>have to read <br/>\n<blockquote><span title=\"ireply\"> &gt; and believe  that the tone in these conversations is natural and easy<br/>\n </span></blockquote>going.   <br/>\n<br/>\nI know that Rain would be upset by my saying things like that to her, no<br/>\nmatter how easygoing my tone.  I hear you saying that your kid and Pam&#39;s<br/>\nkid weren&#39;t, that they enjoy it, but my point is that not all kids will<br/>\nrespond that way. Rain doesn&#39;t generally like being quizzed, or<br/>\nchallenged to figure things out. It has worked better for me to just<br/>\nverbalize my thought processes occasionally, and eventually she&#39;ll stop<br/>\nme and finish figuring it out herself.<br/>\n<br/>\nSometimes she&#39;ll specifically ask about something, like our half hour<br/>\nlong exploration of different number bases at a fast food restaurant last<br/>\nweek, and then I might ask questions I already know, to walk her through<br/>\nit... but those are pretty unique situations.<br/>\n<br/>\nDar, going nomail and on vacation for a few days...</div>","specialLinks":[]},{"userId":158112576,"authorName":"TeresaBnNC@aol.com","from":"TeresaBnNC@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062695474","msgId":79892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZC4xMDVhMGEwMS4yYzg4Y2MzMkBhb2wuY29tPg=="},"prevInTopic":79891,"nextInTopic":79893,"prevInTime":79891,"nextInTime":79893,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/4/03 12:43:58 PM Eastern Daylight Time, ... JP knows that I know the answers to these questions too.  But he gets a sense of mastery and","messageBody":"<div id=\"ygrps-yiv-827031273\">In a message dated 9/4/03 12:43:58 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freeform@...\">freeform@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; FWIW, Rain would be upset if I tried to have this conversation with her.<br/>\n&gt; She knows I already know the answers to these questions, and she doesn&#39;t<br/>\n&gt; respond well when I ask her things I already know within the context of<br/>\n&gt; everyday life.<br/>\n&gt; <br/>\n<br/>\n <br/>\n<br/>\n </span></blockquote>JP knows that I know the answers to these questions too.  But he gets a sense <br/>\nof mastery and accomplishment if he can figure it out himself.  I would never <br/>\ntry to frustrate him.   Actually, this scenario is very similar to some that <br/>\nPam S talked about in her Math lecture at the conference.   She asked her <br/>\ndaughter how much change she expected to get back from a purchase, and it turned <br/>\nout to be a good thing, as she was overcharged.    You have to read and believe <br/>\nthat the tone in these conversations is natural and easy going.   And, <br/>\nalthough I may ask him questions that I know the answers, I never ask him questions <br/>\nthat he obviously knows ( or has thought out) the answers to.   Maybe you just <br/>\nhave to hear it in person to understand it<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062693471","msgId":79891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwOTA0LjA5Mzc1MS4yNjAuMC5mcmVlZm9ybUBqdW5vLmNvbT4="},"prevInTopic":79882,"nextInTopic":79892,"prevInTime":79890,"nextInTime":79892,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"... FWIW, Rain would be upset if I tried to have this conversation with her. She knows I already know the answers to these questions, and she doesn t respond","messageBody":"<div id=\"ygrps-yiv-1814656722\">On Thu, 4 Sep 2003 10:27:59 EDT <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:TeresaBnNC@...\">TeresaBnNC@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    Then I would ask, &quot;about how much <br/>\n&gt; change will <br/>\n&gt; you be getting back?&quot;  And he would figure it up and give me an <br/>\n&gt; answer..  &quot;  hmm <br/>\n&gt; $3... can I get a candy bar?&quot;  &quot;Will you have enough left for one?&quot;  <br/>\n&gt; &quot;Yeah, <br/>\n&gt; they are .50..&quot;   Ok, well get me and Anna one too, will you have <br/>\n&gt; enough for <br/>\n&gt; that?&quot;   <br/>\n<br/>\n </span></blockquote>FWIW, Rain would be upset if I tried to have this conversation with her.<br/>\nShe knows I already know the answers to these questions, and she doesn&#39;t<br/>\nrespond well when I ask her things I already know within the context of<br/>\neveryday life.<br/>\n<br/>\nI do talk things through out loud sometimes, like if I&#39;m trying to figure<br/>\nout how much money she&#39;ll need for a Waterworld and then dinner, or<br/>\nsomething. Then I just give her some bill that seems like enough, and I<br/>\nusually tell her about how much change I expect to get back, if it&#39;s a $5<br/>\n+ aount.<br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062688711","msgId":79882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMC4xOWNiMjEyNi4yYzg4YjFjN0Bhb2wuY29tPg=="},"prevInTopic":79881,"nextInTopic":79891,"prevInTime":79881,"nextInTime":79883,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/3/03 5:37:50 PM, TarazSpot@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-599814497\">In a message dated 9/3/03 5:37:50 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:TarazSpot@...\">TarazSpot@...</a> writes:<br/>\n<br/>\n&lt;&lt;  We are going into our third year of &quot;homeschooling.&quot;  Our first <br/>\n<br/>\nyear consisted of complete deschooling.  The next year I fell victim <br/>\n<br/>\nto mother panic mode &gt;&gt;<br/>\n<br/>\nIf I said &quot;I went through a year of demagnetization, and the next year all <br/>\nkinds of metal stuck to me,&quot; you might think I hadn&#39;t really demagnetized!<br/>\n<br/>\nDeschooling only works when it works.   Doing nothing schoolish isn&#39;t the <br/>\nsame as actively recovering from school.   Kids will get over school gradually, <br/>\nbut there needs to be an active unschooling life taking its place as they <br/>\nrecover.  Parents get over schooling MUCH more gradually, as they were in school <br/>\nmore and they have parental fears and responsibilities and pressures from <br/>\nothers.   So it takes more work and more time for parents to see the value of and to <br/>\nrecognize the form and substance of natural learning.<br/>\n<br/>\nHere&#39;s a little article with good links to others similar and better:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\n&lt;&lt; I pretty much continued to <br/>\n<br/>\nnot do any formal lessons with my 6 year old daughter. &gt;&gt;<br/>\n<br/>\nAny formal lessons at all can keep unschooling from growing and blossoming.<br/>\n<br/>\nThat might sound lame to people new to unschooling, but if the parent <br/>\nreserves something (math, usually) as the thing they won&#39;t risk, the child learns <br/>\nthat math is hard and important, but the other stuff isn&#39;t as important.  That&#39;s <br/>\nnot a useful lesson.  History is WAY more important than math in almost every <br/>\npractical way, and math IS a part of history, bigtime, but by separating them <br/>\nand treating history the way Lego is treated (as not-math), there is an object <br/>\nand field problem, and there is a valuation problem, and it becomes a <br/>\nstoppage.<br/>\n<br/>\n&lt;&lt;  Example, today we stopped at a gas station to buy a bottle of water <br/>\n<br/>\nand driving away I asked the kids since the bottle was $1.39 how much <br/>\n<br/>\nchange did I get back. I had paid with two dollar bills. Well, I got <br/>\n<br/>\nmy answer and I had my 8 yr. old count out the change to see if he <br/>\n<br/>\nand his brother were right. &gt;&gt;<br/>\n<br/>\nI think the best tool for getting over that is to ask yourself honestly <br/>\nwhether you would have asked the same question of your husband, or of an adult <br/>\nfriend who happened to go to the store with you.<br/>\n<br/>\n&lt;&lt; Maybe it would be better in the future <br/>\n<br/>\nto let them handle the money and pay for things themselves or not do <br/>\n<br/>\nanything with the whole money thing at all?  &gt;&gt;<br/>\n<br/>\nArtificial dichotomy!!!<br/>\nWhy all of one or all of the other?  <br/>\n<br/>\nThere will be money opportunities LOTS of times.  <br/>\n<br/>\nWhat has worked pretty well here is me giving them a larger bill instead of <br/>\ntrying to estimate exactly how much something would cost, and letting them <br/>\nbring the receipt and change back.  They get a printout, they have the money, <br/>\nsometimes they look and care and sometimes they don&#39;t.   Instead of sending one to <br/>\nthe store for bread and saying &quot;It will be about $150, here&#39;s $1.65 which <br/>\nshould cover the tax too and I should get a few pennies back,&quot; I often just give <br/>\nthem $5 and say &quot;You can get something for you, too, if you want, for doing th<br/>\ne errand.&quot;   Usually they haven&#39;t gotten anything else.<br/>\n<br/>\nLately, now that they&#39;re older, there are often short-notice opportunities.  <br/>\n&quot;Can we go to the dollar movies with Crystal?  Holly can go.  And they&#39;re <br/>\ngoing to Denny&#39;s.&quot;<br/>\n<br/>\n&quot;Do you have any money?&quot;<br/>\n<br/>\n&quot;$10.&quot;<br/>\n<br/>\n&quot;Well take this in case you need more, and bring it back if you don&#39;t,&quot; and <br/>\nI&#39;ll give Marty  $10 or $20 to make sure Holly gets to eat, and that Marty gets <br/>\nto eat, and remind him to tip, and he brings back change.<br/>\n<br/>\nI think the same way it has worked with my kids not to limit TV or food, <br/>\nwhich made them not needy, trusting them with money and being open to financing <br/>\nthings like others taking them to movies and such has kept them from a desperate <br/>\nneed to get out and spend money.   Maybe I&#39;m just lucky, but I don&#39;t think <br/>\nso.  I think because we haven&#39;t made money scary or nearly impossible to come <br/>\nby, they&#39;re not grasping.  Because we&#39;re open to saying &quot;This month is really <br/>\ntight, so we can&#39;t get hamburgers, we have to eat at home,&quot; and we don&#39;t say it <br/>\nALL the time, the flow of information and energy regarding money hasn&#39;t been <br/>\nweird here, as it so often was when I was little.<br/>\n<br/>\nMy mom smoked cigarettes and drank a lot of beer.  I knew what that cost.   I <br/>\nnever got a stereo.  We had some old ratty portable record player found at a <br/>\ndump or given to my dad.  When I wanted a book there was no money but when my <br/>\nmom wanted beer there was.<br/>\n<br/>\nThat&#39;s a better math lesson (and other lessons thrown in too!) than counting <br/>\nchange.<br/>\n<br/>\nMaybe some of the chitchat above seems to miss the point, if a person is JUST <br/>\nlooking for a subtraction problem.  Subtraction problems are too schoolish, <br/>\nthough, for the purposes of unschooling.  That WILL come in the course of real <br/>\nlife.   Real life has a hard time unfolding when we stop for subtractions <br/>\nlessons.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":158112576,"authorName":"TeresaBnNC@aol.com","from":"TeresaBnNC@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062685679","msgId":79881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMS5mMmNjYzc3LjJjODhhNWVmQGFvbC5jb20+"},"prevInTopic":79851,"nextInTopic":79882,"prevInTime":79880,"nextInTime":79882,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/4/03 4:36:02 AM Eastern Daylight Time, ... I ask my kids questions to help them think through things.  NOT like a quiz, just some","messageBody":"<div id=\"ygrps-yiv-446798220\">In a message dated 9/4/03 4:36:02 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You don&#39;t have to teach - but you can behave in ways that are helpful to <br/>\n&gt; kids who WANT to learn to do what adults do.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I ask my kids questions to help them think through things.  NOT like a quiz, <br/>\njust some prompting.   Like with the &quot;change left over&quot; thing.  A very natural <br/>\nsituation would be that JP ( 8)  may want to go in the store to pick up some <br/>\nitems for me.   (this makes my kids feel very grown up and responsible, to go <br/>\nin a get a loaf of bread, a drink.. something like that).  So, I will count <br/>\nup, out loud, about how much it is going to cost.. &quot;OK.. we need bread, that&#39;s <br/>\nabout $2, milk. thats @ $3, and some chips, they are @ $2... so, it should be <br/>\n@$7 plus tax.. here is a 10&quot;   Then I would ask, &quot;about how much change will <br/>\nyou be getting back?&quot;  And he would figure it up and give me an answer..  &quot;  hmm <br/>\n$3... can I get a candy bar?&quot;  &quot;Will you have enough left for one?&quot;  &quot;Yeah, <br/>\nthey are .50..&quot;   Ok, well get me and Anna one too, will you have enough for <br/>\nthat?&quot;    At any point he might not know the answer.   He would in this <br/>\nsituation., cause he is very familar with quarters and .50.. If the conversation was <br/>\nnot easy and natural, if he balked at figuring it up, I would just continue to <br/>\ndo the math out loud.   But the point is, this is all just every day stuff, <br/>\nit&#39;s not contrived. <br/>\n<br/>\nTeresa  <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062676461","msgId":79851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCN0NBMDJELjFERUJCJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGJqNXRvZitkcXRlQGVHcm91cHMuY29tPg=="},"prevInTopic":79848,"nextInTopic":79881,"prevInTime":79850,"nextInTime":79852,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"... Pam Sorooshian mentioned (in her conference talk I think) that her daughter wanted to buy a slushie and Pam handed her daughter a $20 bill and suggested ","messageBody":"<div id=\"ygrps-yiv-52522766\">on 9/3/03 7:33 PM, tarazspot at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:TarazSpot@...\">TarazSpot@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Example, today we stopped at a gas station to buy a bottle of water<br/>\n&gt; and driving away I asked the kids since the bottle was $1.39 how much<br/>\n&gt; change did I get back. I had paid with two dollar bills. Well, I got<br/>\n&gt; my answer and I had my 8 yr. old count out the change to see if he<br/>\n&gt; and his brother were right.  Nagging me though was the feeling that<br/>\n&gt; this was not unschooling but a &quot;teacher-like&quot; conceived coersion<br/>\n&gt; tactic to get them to LEARN.   Maybe it would be better in the future<br/>\n&gt; to let them handle the money and pay for things themselves or not do<br/>\n&gt; anything with the whole money thing at all?<br/>\n<br/>\n </span></blockquote>Pam Sorooshian mentioned (in her conference talk I think) that her daughter<br/>\nwanted to buy a slushie and Pam handed her daughter a $20 bill and suggested<br/>\nthat she estimate how much change she&#39;d get. Her daughter did that on the<br/>\nway over and the woman in fact did give her incorrect change. Her daughter<br/>\nwas able to recognize that and speak up about it.<br/>\n<br/>\nThat&#39;s a real situation.<br/>\n<br/>\nIt depends on your kids. On the surface what you did does sound teacherly.<br/>\nYou already knew the answer and you were testing to see if they could figure<br/>\nit out.<br/>\n<br/>\nIf your kids are puzzle/quiz oriented, though, they might view the situation<br/>\nlike a trivia game and enjoy it. &quot;Hey, let&#39;s see if you guys can figure out<br/>\nhow much change I got,&quot; might sound like a fun game. Or it may sound great<br/>\nto one and paralyze the other with fear. Encouraging a joint answer is *way*<br/>\nbetter than each answering indvidually. A joint answer would involve<br/>\ndiscussion and verbalizing number manipulation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is stopping to &quot;teach&quot; in daily<br/>\n&gt; life against the grain of unschooling??  Or instead is that our duty<br/>\n&gt; as unschooling parents??  I think that perhaps as an parent of a<br/>\n&gt; unschooled child your role may be more of a facilitator of learning<br/>\n&gt; as opposed to a teacher.<br/>\n<br/>\n </span></blockquote>It *is* a tricky area to try to explain since everyone&#39;s concept of<br/>\n&quot;helping&quot; is different. Some people may feel it&#39;s helping to stop and have<br/>\nmini lectures on something that pops up and some people may feel it&#39;s<br/>\nhelping to let kids figure things out without interference no matter how<br/>\nbadly they&#39;re floundering. It&#39;s a balance. What you actually end up doing<br/>\nwill depend on your children&#39;s needs and their personalities.<br/>\n<br/>\nSandra often expresses it as sharing something cool with the kids the same<br/>\nway you&#39;d do with a friend. You probably wouldn&#39;t quiz a friend to see if<br/>\nshe could guess how much change you got? ;-) (But, as I said above, it<br/>\ndepends on your kids.) If you can get into a mode of sharing what you find<br/>\nenjoyable rather than feeling it&#39;s important for them to possess whatever<br/>\nknowledge you&#39;re seeing, then unschooling will flow more smoothly for you.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshiantafti","from":"Pamela Sorooshiantafti &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062664269","msgId":79848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3OTQ3OC4xMDYyNjY0MjY5MTcxLkphdmFNYWlsLnBhbXNvcm9vc2hAbWFjLmNvbT4="},"prevInTopic":79835,"nextInTopic":79851,"prevInTime":79847,"nextInTime":79849,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"... this was not unschooling but a teacher-like conceived coersion tactic to get them to LEARN. ","messageBody":"<div id=\"ygrps-yiv-1513387552\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; Nagging me though was the feeling that <br/>\n </span></blockquote>this was not unschooling but a &quot;teacher-like&quot; conceived coersion <br/>\ntactic to get them to LEARN. &lt;&lt;<br/>\n<br/>\n<br/>\nTry this: Just do what you would normally do, whether or not the kids were with you, but do it a bit more slowly and out loud. In other words, give them a fighting chance of being able to follow your modeling. THEN - let them take over what they want to take over. Support that urge when they say, &quot;I can do it.&quot;<br/>\n<br/>\nYou don&#39;t have to teach - but you can behave in ways that are helpful to kids who WANT to learn to do what adults do.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":139187074,"authorName":"Julie Solich","from":"&quot;Julie Solich&quot; &lt;mjsolich@...&gt;","profile":"foxymophandlemama32","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062641525","msgId":79835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzYwMWMzNzI4OSRmMTM4NzE4MCQxMzFhMzJkMkBtYXJrPg==","referencesHeader":"PGJqNXRvZitkcXRlQGVHcm91cHMuY29tPg=="},"prevInTopic":79833,"nextInTopic":79848,"prevInTime":79834,"nextInTime":79836,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"... teacher-like conceived coersion  tactic to get them to LEARN.   Maybe it would be better in the future  to let them handle the money and pay for things","messageBody":"<div id=\"ygrps-yiv-1769993213\"><blockquote><span title=\"ireply\">&gt;&gt;Nagging me though was the feeling that  this was not unschooling but a<br/>\n </span></blockquote>&quot;teacher-like&quot; conceived coersion  tactic to get them to LEARN.   Maybe it<br/>\nwould be better in the future  to let them handle the money and pay for<br/>\nthings themselves or not do  anything with the whole money thing at all? &gt;&gt;<br/>\n<br/>\nWhen I decided to unschool (we had been homeschooling for 3 years), I spent<br/>\na couple of months deschooling. I really stepped back and just answered<br/>\nquestions and let them be.<br/>\n<br/>\n Eight months on, if I manage to answer all their questions in a day, I&#39;m<br/>\nlucky. My middle son in particular asks me&#39; how much is...?&#39; countless times<br/>\na day. Learning to answer their questions the way I would answer an adult,<br/>\nwith respect and without turning it into a lecture, has been one of my best<br/>\nlessons. It really does build trust.<br/>\n<br/>\n My kids know they can ask me stuff now and I am not going to turn it into a<br/>\nlesson which has really put them off asking in the past.<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; To unsubscribe from this send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":152271008,"authorName":"Jon and Rue Kream","from":"&quot;Jon and Rue Kream&quot; &lt;skreams@...&gt;","profile":"jonkream","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Unschooling - some questions","postDate":"1062635606","msgId":79833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzOGEwMWMzNzI3YyQyOTA2NWQ2MCQ2NDAwYThjMEBsaXZpbmdyb29tMT4=","inReplyToHeader":"PGJqNXRvZitkcXRlQGVHcm91cHMuY29tPg=="},"prevInTopic":79830,"nextInTopic":79835,"prevInTime":79832,"nextInTime":79834,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"... this was not unschooling but a teacher-like conceived coersion tactic to get them to LEARN. **I would not have asked them that question.  There are times","messageBody":"<div id=\"ygrps-yiv-72316971\"><blockquote><span title=\"ireply\">&gt;&gt; Nagging me though was the feeling that<br/>\n </span></blockquote>this was not unschooling but a &quot;teacher-like&quot; conceived coersion<br/>\ntactic to get them to LEARN.<br/>\n<br/>\n**I would not have asked them that question.  There are times when Dagny and<br/>\nRowan pay themselves, times when I pay and they notice how much the total<br/>\nis/what I get back, and times when I pay and they don&#39;t pay any attention.<br/>\nIt isn&#39;t necessary to create situations (or ask questions you don&#39;t need the<br/>\nanswer to) in order for your kids to learn.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I think that perhaps as an parent of a<br/>\n </span></blockquote>unschooled child your role may be more of a facilitator of learning<br/>\nas opposed to a teacher.<br/>\n<br/>\n**I definitely do not think of myself as my kids&#39; teacher.  I do help them<br/>\nfind the information and resources and fun things that they want.<br/>\n<br/>\nIt sounds like your nagging feelings are right on :0). ~Rue<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":79195411,"authorName":"tarazspot","from":"&quot;tarazspot&quot; &lt;TarazSpot@...&gt;","profile":"tarazspot","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling - some questions","postDate":"1062632015","msgId":79830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJqNXRvZitkcXRlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":79833,"prevInTime":79829,"nextInTime":79831,"topicId":79830,"numMessagesInTopic":0,"msgSnippet":"We are going into our third year of homeschooling.  Our first year consisted of complete deschooling.  The next year I fell victim to mother panic mode and","messageBody":"<div id=\"ygrps-yiv-1465003446\">We are going into our third year of &quot;homeschooling.&quot;  Our first <br/>\nyear consisted of complete deschooling.  The next year I fell victim <br/>\nto mother panic mode and went towards some curriculum type learning <br/>\nfor both my 8yr.old and 11yr. old sons.  I pretty much continued to <br/>\nnot do any formal lessons with my 6 year old daughter.  Well, at the <br/>\nend of last school year I was burned out and and miserable and so <br/>\nwere my children.  My 8yr. old was still not reading, and my 11yr. <br/>\nold was going through the motions of his schoolwork and not enjoying <br/>\nany of it!  After spending the summer reading every book I could get <br/>\nmy hands on in regards to learning, from unschooling books to books <br/>\ngeared toward better late then early themes, I am now ready to <br/>\nunschool.  As usual, I can never stop with the questions...which is <br/>\nwhy I writing to you all now!  <br/>\n<br/>\n  Example, today we stopped at a gas station to buy a bottle of water <br/>\nand driving away I asked the kids since the bottle was $1.39 how much <br/>\nchange did I get back. I had paid with two dollar bills. Well, I got <br/>\nmy answer and I had my 8 yr. old count out the change to see if he <br/>\nand his brother were right.  Nagging me though was the feeling that <br/>\nthis was not unschooling but a &quot;teacher-like&quot; conceived coersion <br/>\ntactic to get them to LEARN.   Maybe it would be better in the future <br/>\nto let them handle the money and pay for things themselves or not do <br/>\nanything with the whole money thing at all?  <br/>\n I know this may seem like a very trivial situation,and by all rights <br/>\nit is,but I am still in many daily situations trying to come to terms <br/>\nwith the concept of &quot;unschooling.&quot;   Is stopping to &quot;teach&quot; in daily <br/>\nlife against the grain of unschooling??  Or instead is that our duty <br/>\nas unschooling parents??  I think that perhaps as an parent of a <br/>\nunschooled child your role may be more of a facilitator of learning <br/>\nas opposed to a teacher.  As a facilitator you would be there to help <br/>\nthe child locate resources or information as they come to you with <br/>\ntheir interests....such as leading them to music classes should they <br/>\ndesire to learn music or helping them to navigate the internet to <br/>\nlocate information,etc..  <br/>\n<br/>\n  I would appreciate any thoughts you can offer in regards to these <br/>\nissues.   Thanks!<br/>\n                        Tara</div>","specialLinks":[]}],"prevTopicId":79921,"nextTopicId":79936}}