{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Visiting unschooling families","postDate":"1205173621","msgId":32910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERFNjc2Q0NCLUMxN0QtNDBGOC04OTZELTA4RUY4QkJERkQ4NkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGZyM2EzMStpcDZwQGVHcm91cHMuY29tPg==","referencesHeader":"PGZyM2EzMStpcDZwQGVHcm91cHMuY29tPg=="},"prevInTopic":32900,"nextInTopic":0,"prevInTime":32909,"nextInTime":32911,"topicId":32850,"numMessagesInTopic":0,"msgSnippet":"-=-Would it have been so hard to say Excuse me for a moment? and tended to her baby? -=- I wouldn t even say excuse me, I d just pick up the baby and keep ","messageBody":"<div id=\"ygrps-yiv-621533610\">-=-Would it have been so hard to say &quot;Excuse me for a moment?&quot; and  <br/>\ntended<br/>\nto her baby? -=-<br/>\n<br/>\nI wouldn&#39;t even say &quot;excuse me,&quot; I&#39;d just pick up the baby and keep  <br/>\ntalking. Anyone who thinks I need her permission to take care of my  <br/>\nkid can go find some different friends!!<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":244317154,"authorName":"swissarmy_wife","from":"&quot;swissarmy_wife&quot; &lt;heatherbean@...&gt;","profile":"swissarmy_wife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Visiting unschooling families","postDate":"1205152673","msgId":32900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZyM2EzMStpcDZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDczM0NCNEQ2LTI5QTktNDkzMy05RURGLUY0ODZBNTk0MkFCREBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":32879,"nextInTopic":32910,"prevInTime":32899,"nextInTime":32901,"topicId":32850,"numMessagesInTopic":0,"msgSnippet":"We attend a few homeschool events throughout the year.  Ice skating, rock climbing, park day, those sorts of things.  I see this happening all the time. Last","messageBody":"<div id=\"ygrps-yiv-320248945\">We attend a few homeschool events throughout the year.  Ice skating,<br/>\nrock climbing, park day, those sorts of things.  I see this happening<br/>\nall the time.  <br/>\n<br/>\nLast Wednesday at the ice rink I was watching 2 homeschool moms chat,<br/>\nwhile the baby sat on the floor screaming with tears running down her<br/>\nface.  The mom made sure she was able to finish her conversation THEN<br/>\npicked up the baby and calmed her.  <br/>\n<br/>\nWould it have been so hard to say &quot;Excuse me for a moment?&quot; and tended<br/>\nto her baby?  <br/>\n<br/>\n <br/>\n<blockquote><span title=\"qreply\"> &gt; I find myself just about unable to pay attention to the conversation  <br/>\n&gt; myself when a mom clearly chooses to ignore a child&#39;s  needs.   <br/>\n&gt; Usually in the case of phone conversations, just a couple of seconds  <br/>\n&gt; will be enough to let the mom provide something fun for her child, or  <br/>\n&gt; to answer his question, or to get the bowl he couldn&#39;t reach, or  <br/>\n&gt; whatever it was.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":124256069,"authorName":"alohabun","from":"&quot;alohabun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Visiting unschooling families","postDate":"1205064351","msgId":32879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZyMGpxdis4b24yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEVEMzE2NENCNjM2MTQ3Nzg4NkM3Mzg5NUY0ODVBQzFCQFJvYnluUEM+"},"prevInTopic":32861,"nextInTopic":32900,"prevInTime":32878,"nextInTime":32880,"topicId":32850,"numMessagesInTopic":0,"msgSnippet":"Robyn, I loved your post!!!  I have a friend who parents alot like me (another unschooler) and she and I never talked about it, but our conversations almost","messageBody":"<div id=\"ygrps-yiv-778059651\">Robyn, I loved your post!!!  I have a friend who parents alot like me <br/>\n(another unschooler) and she and I never talked about it, but our <br/>\nconversations almost always include one or both of us attending to our <br/>\nkids needs.  I love that we do this!  And I do think it is a great <br/>\nblessing when one parent will tell another, &quot;Go, do what you need to <br/>\ndo for your child!  They do come first!&quot;  It is so common for many  <br/>\npeople to have been brought up taking a back seat to adult <br/>\nconversation or needs.  So it is a needed thing for many moms/dads to <br/>\nknow they don&#39;t have to parent that way.  And perhaps more would if <br/>\nthey didn&#39;t feel like they might be judged.    Laurie</div>","specialLinks":[]},{"userId":213505820,"authorName":"Jennifer Varela","from":"&quot;Jennifer Varela&quot; &lt;gemini7772@...&gt;","profile":"gemini7772","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Visiting unschooling families","postDate":"1205001186","msgId":32861,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmYTNlNzYxMDgwMzA4MTAzM20yOTBkY2MzM3BjNWM2ODBlZjYzMTc1ZGVmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDczM0NCNEQ2LTI5QTktNDkzMy05RURGLUY0ODZBNTk0MkFCREBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEVEMzE2NENCNjM2MTQ3Nzg4NkM3Mzg5NUY0ODVBQzFCQFJvYnluUEM+CSA8NzMzQ0I0RDYtMjlBOS00OTMzLTlFREYtRjQ4NkE1OTQyQUJEQHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":32855,"nextInTopic":32879,"prevInTime":32860,"nextInTime":32862,"topicId":32850,"numMessagesInTopic":0,"msgSnippet":"... First, thank you soooo much for that wonderful post, Robyn.   It helped me remember that there are a number of the things I do right!  It also made me ","messageBody":"<div id=\"ygrps-yiv-1128890124\"><blockquote><span title=\"ireply\">&gt;&gt;Robyn wrote and Sandra agreed:<br/>\n<br/>\n&gt; -=-feel uncomfortable and stressed if I think that the mom is placing<br/>\n&gt; some notion of hospitality toward me ahead of her kids - particularly<br/>\n&gt; the younger ones-=-<br/>\n&gt;<br/>\n&gt; I do too.&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>First, thank you soooo much for that wonderful post, Robyn.   It helped me<br/>\nremember that there are a number of the things I do right!  It also made me<br/>\nrealize a huge error in my thinking.  I don&#39;t have any unschoolers near me.<br/>\nWhen I visit with other families, most of the other moms believe that I<br/>\n*should* put their comfort and the conversation we are having ahead of my<br/>\nchildrens&#39; needs.  *This* realization is a big one for me because when I do<br/>\nput my children first, I get the dissapproving looks and the mom is clearly<br/>\nuncomfortable with being asked to wait a few minutes while I tend to a<br/>\nchild.  Which, then, makes me feel uncomfortable.  So, that&#39;s when I start<br/>\nasking the kids to &quot;wait a minute&quot; in order to put this other persons<br/>\ncomfort ahead of my children.  Bleh.  No wonder Kira has occasionally<br/>\nresorted to hitting!    Our place is small (one BR apt, kitchen/living<br/>\ncombo) and we don&#39;t have people here often, but, when we do I get many<br/>\ncomments about &quot;all the toys&quot; and &quot; kid stuff&quot;.<br/>\n<br/>\nJen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Visiting unschooling families","postDate":"1204999358","msgId":32855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczM0NCNEQ2LTI5QTktNDkzMy05RURGLUY0ODZBNTk0MkFCREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEVEMzE2NENCNjM2MTQ3Nzg4NkM3Mzg5NUY0ODVBQzFCQFJvYnluUEM+","referencesHeader":"PEVEMzE2NENCNjM2MTQ3Nzg4NkM3Mzg5NUY0ODVBQzFCQFJvYnluUEM+"},"prevInTopic":32850,"nextInTopic":32861,"prevInTime":32854,"nextInTime":32856,"topicId":32850,"numMessagesInTopic":0,"msgSnippet":"-=-If I am at the home of a parent of young children, and I see that the child is needing their mom, I immediately say something like, It looks like Johnny","messageBody":"<div id=\"ygrps-yiv-50740563\">-=-If I am at the home of a parent of young children, and I see that  <br/>\nthe child is needing their mom, I immediately say something like, &quot;It  <br/>\nlooks like Johnny needs your attention. Don&#39;t worry about me.Go. I  <br/>\nunderstand.&quot; I do the same thing if I can hear something in the  <br/>\nbackground of a phone call. &quot;Call me back when you can. I  <br/>\nunderstand.&quot;-=-<br/>\n<br/>\nI find myself just about unable to pay attention to the conversation  <br/>\nmyself when a mom clearly chooses to ignore a child&#39;s  needs.   <br/>\nUsually in the case of phone conversations, just a couple of seconds  <br/>\nwill be enough to let the mom provide something fun for her child, or  <br/>\nto answer his question, or to get the bowl he couldn&#39;t reach, or  <br/>\nwhatever it was.<br/>\n<br/>\n-=-feel uncomfortable and stressed if I think that the mom is placing  <br/>\nsome notion of hospitality toward me ahead of her kids - particularly  <br/>\nthe younger ones-=-<br/>\n<br/>\nI do too.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Visiting unschooling families","postDate":"1204995769","msgId":32850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEMzE2NENCNjM2MTQ3Nzg4NkM3Mzg5NUY0ODVBQzFCQFJvYnluUEM+"},"prevInTopic":0,"nextInTopic":32855,"prevInTime":32849,"nextInTime":32851,"topicId":32850,"numMessagesInTopic":0,"msgSnippet":"I love visiting with other unschoolers. When I get to spend time with someone whose life I know a bit about from the unschooling lists or boards, it is like","messageBody":"<div id=\"ygrps-yiv-1339280891\">I love visiting with other unschoolers. When I get to spend time with someone whose life I know a bit about from the unschooling lists or boards, it is like taking a deep breath of relaxation. What I love most about it is that I don&#39;t have to be on my guard. I am free to be my true Self, without having to fear judgment. I don&#39;t have to be concerned about tense moments. There won&#39;t be many.<br/>\n<br/>\nI am not judged for not keeping up a house to the standards that someone whose child was away all day would be able to. I am not judged for including my child in my daily life and including her in the making of plans. Most of all I am not judged for attending to my child first at any moment at the &quot;expense&quot; of the adult conversation. The constant loving response from another unschooler, mom or dad, is always, &quot;sure go, I understand.&quot;<br/>\n<br/>\nThose are the magic words: &quot;I understand&quot;.<br/>\n<br/>\nAnd those are the same words I offer to other parents, unschoolers or not, when their little one is clamoring for attention and for whatever reason that parent believes they should be attending to me instead.<br/>\n<br/>\nIf I am at the home of a parent of young children, and I see that the child is needing their mom, I immediately say something like, &quot;It looks like Johnny needs your attention. Don&#39;t worry about me.Go. I understand.&quot; I do the same thing if I can hear something in the background of a phone call. &quot;Call me back when you can. I understand.&quot;<br/>\n<br/>\nI make it easier for the parent by always - always - taking along some crafting project that I am doing. I can be visibly, obviously, perfectly content sewing beads on a doll, or crocheting, or loom knitting. Whatever else happens, I don&#39;t want to be the cause of added stress or discomfort to a family that I am visiting.<br/>\n<br/>\nWhen I take Jayn on her playdates, I take along the food bag just like going to the park. It is not that the people I visit aren&#39;t hospitable, and much of the time the food bag sits tightly zipped up and unheeded. But I am not going to visit people only to be a burden to them. If I or Jayn gets hungry, and we are often on a different schedule than our hosts, I can grab something to keep us going. People sometimes bring along their lunch when they visit me too. I don&#39;t take it as an aspersion on my ability to take care of them or as a judgment about my hospitality, but as a loving gesture by someone free of expectations. Sometimes their food gets eaten, sometimes it stays in the bag because I have something yummier on offer. (Not that I&#39;m much of a cook.)<br/>\n<br/>\nThere is one dear family, not unschoolers but mindfully parenting home schoolers, whose little girl is Jayn&#39;s good friend. I usually take along some little project or object to help entertain her younger brother (4yo). Some air drying clay, or crafty thing that might be different from the things that they have there. It helps him feel special for a minute, although he still desperately wants to play with the girls sometimes for longer than they are willing to have him. I have no hesitation in saying, &quot;sure, go. I understand&quot; when his mom wants to attend to him to give the girls some relief.<br/>\n<br/>\nIt is an awful feeling to sense that someone visiting one&#39;s home is being judgemental in some way. Maybe they had an expectation that I was more like them philosophically. I particularly remember one mom who couldn&#39;t keep her disdain for the number of toys we have out of her voice. I am lucky - there are so very few of the &quot;seen and not heard&quot; brigade on my radar. I&#39;ll do a tidy up and run the vacuum before a playdate, but the reason behind it is to facilitate the playing, not impress the mom. I put out a nice, big snack tray fairly quickly too, but that is really so that Jayn doesn&#39;t forget to eat and get grumpy. Hospitality is a nice side effect.<br/>\n<br/>\nSometimes I visit another family&#39;s home and they apologize for &quot;the state of it&quot;. &quot;Oh please - you should see mine&quot;. Everyone gets to feel better about their home once they&#39;ve seen my joint!<br/>\n<br/>\nHomeschooling families have all the big, messy, elaborate activities that usually are confined to  classroom, craft center, science lab, gym, right there in their home and garden. Of course there is more going on. If you visit my home there are not only Jayn&#39;s projects, but mine too. I have a craft manufacturing workshop alive in my living room. <br/>\n<br/>\nAnd we only have two rooms, in all reality. The living/dining ell, and the bedroom. Bathroom is part storage closet. The kitchen is a galley. The bedroom is James&#39; domain when he isn&#39;t working. <br/>\n<br/>\nOne day we will have a bigger house. I have no doubt that I will be able to fill it to the brim with crazy, swirling, magic fun. I hope to have enough room to be able to invite travelling unschoolers to stay a spell. That would be heaven to me.<br/>\n<br/>\nMeanwhile wherever I go I try to look with a loving eye. Being judgemental never adds joy to my visit or to my serenity. I pass over the dust bunnies and look at the kid&#39;s paintings. I tend to my own needs for refreshment without rancour and enjoy the show that Jayn and her friends will put on. &quot;Watch this mommy!&quot; And sometimes, if I look and see a babe in arms and a two year old and a pile of dishes, I roll up my sleeves and say, &quot;I&#39;m going to clean up your kitchen, and I don&#39;t want to hear anything about it. You look after the baby&quot;.<br/>\n<br/>\nThere is nothing more peaceful than a mom (or dad) attending to the kids, joyfully and calmly. It might seem busy and constant. It might be that she keeps getting up from her chair. It might be that I get up and move to another place to be nearer to her while she runs the bath (presuming the children are old enough to be safe) to keep a couple of them busy for half an hour while we sit in earshot. But for all the movement and activity, there is still a peace underneath it. A rightness. <br/>\n<br/>\nI think I feel most welcomed in a home where my presence adds to the peace, rather than creates a stressor for the mom. I feel at home when I don&#39;t interfere with the young children&#39;s needs being met. I feel joy and comfort in a home where the kids&#39; happy lives, time spent on and with them, are clearly the priority. Conversely I feel uncomfortable and stressed if I think that the mom is placing some notion of hospitality toward me ahead of her kids - particularly the younger ones who aren&#39;t getting a nice, special visitor in the form of my daughter. <br/>\n<br/>\nThere is nothing better in all the world than sitting with another family or two of unschoolers, talking about philosophy, technology, life, the universe, and everything, while the kids freely roam (physically or metaphorically). Recently the Traaseths were here. We were in their hotel room quite late. It was really hard to go. <br/>\n<br/>\nJayn and Kyra wanted to walk the halls. I walked with them for safety. It could have been interpreted as me missing out on the adult conversation. Some might say that my visiting with adults should have had priority. But I got the gift of being able to have a conversation with two wonderful young girls, and few giggles. I was happy to facilitate their exploration of a pretty unusually laid out hotel, and give the other adults, including my dh, the chance to not have to get up and follow, but keep talking together.<br/>\n<br/>\nBy the end of the evening we were all tired, but it was hard to let the experience end. We started to go home several times and another topic would get started and lo, we would be off talking again. Finally we really had to go home to sleep, regretfully, and let them get some rest too. &quot;Parting is such sweet sorrow, that I will say goodnight &#39;til it be morrow&quot;.<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":32617,"nextTopicId":32926}}