{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] long-bed wetting","postDate":"1072945820","msgId":87353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwMmEwMWMzZDA0MCQ5ZWJkNWI0MCQzMWUwYjVkMEBHcmFjZVBlbm4+"},"prevInTopic":87351,"nextInTopic":0,"prevInTime":87352,"nextInTime":87354,"topicId":87351,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-220779423\">&lt;&lt;My mom used to get me up to go downstairs to the bathroom sometimes. I can<br/>\nstill remember never feeling awake. then I used  to dream that I got up,<br/>\nwent downstairs, sat on the toilet and went -and then woke up   to find I<br/>\nhad wet the bed.&gt;&gt;<br/>\n<br/>\nI remember having that very dream when I was about 7, the last few times I<br/>\nrecall wetting the bed, although I always woke up. I remember the last time<br/>\nwetting about 3 times in succession the same night, dreaming I was in the<br/>\nbathroom each time. I wonder why. <br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1160699,"authorName":"Penn Acres","from":"&quot;Penn Acres&quot; &lt;pennacres@...&gt;","profile":"mtnsky2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"long-bed wetting","postDate":"1072945427","msgId":87351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmEwMWMzZDA0MCQ5ZWJkNWI0MCQzMWUwYjVkMEBHcmFjZVBlbm4+","referencesHeader":"PDFkMS4xNmVlNzc4OS4yZDIzYjgwYkBhb2wuY29tPiA8YnN1cm1hK2ZzN25AZUdyb3Vwcy5jb20+IDw2LjAuMC4yMi4wLjIwMDMxMjMxMTI0MDAwLjAyNWExMzQwQHNoYXdtYWlsLmd2LnNoYXdjYWJsZS5uZXQ+"},"prevInTopic":0,"nextInTopic":87353,"prevInTime":87350,"nextInTime":87352,"topicId":87351,"numMessagesInTopic":0,"msgSnippet":"I wet the bed till I  had my first child  which was 6 weeks after my 16th birthday. I used to sleep so deeply almost nothing ever woke me as a child.  Having","messageBody":"<div id=\"ygrps-yiv-225153554\">I wet the bed till I  had my first child  which was 6 weeks after my 16th birthday. I used to sleep so deeply almost nothing ever woke me as a child.  Having to get up often at night with her  did the trick. I did wet the bed after that a few times in the next couple of years.<br/>\nMy mom used to get me up to go downstairs to the bathroom sometimes. I can still remember never feeling awake. then I used  to dream that I got up, went downstairs, sat on the toilet and went -and then woke up   to find I had wet the bed. Most of the time I never knew I had till morning. My Dad wet the bed till he was 13. I think he went thru hell for it which is probably why I never got a licking for it. My older half brother wet the bed till he was 14 and I think he did get  beaten for it. He ran away from home at 14.<br/>\nI remember wetting the bed  the night before I was married and having to wash the sheets  and ran my hand thru the wringer washer and my engagement ring skinned my finger badly.You want to know embarrasment...lots of other occasions which shall remain unwritten.<br/>\nMy oldest son wet the bed till he was 11 or 12-do you think I had learned thru my own past? nope..I was horribly hard on him..It  seemed, I think in my mind,  to have to do with my being a poor mother not knowing how to properly &quot;train&quot; a child. He also, like me, slept like the dead. <br/>\nThe others wet  the bed occasionally   but not all the time. My  adopted daughter (grandaughter)  ( the girls mother) never wet the bed past two. At two I bought fancy panties-explained  how they could be worn instead of diapers  if she didnt mess in them and she had herself clean and dry in a few months. <br/>\nThe girls, my gg&#39;ds wet the bed at night till they were  almost 3 and a half.  I used pullups during the day  so they could take them down easily to use the potty but still would not soak  everything if they didnt make it. the pullups did not seem to lengthen the time  it took them to learn to  use the potty or toilet at about 2 and a half. they wore pullups  at night  so they didnt soak everything and get cold. After I  quit using them, one of them would still wet fairly often till about  4.One of my other  grandaughters wet the bed till she was almost  8. I dont know what all  her mom (my oldest daughter)  did but finally went to a pediatrition who suggested  ...cant think- pills that  are the opposite of diuretic....took it before bedtime and it  decreased th amount of urine. she only used it  for a while and  was dry after that. Never  took our kids to the dr. Dont know if it would have helped 40 yrs ago-maybe. The hormone thing sounds very interesting...<br/>\nNow I hear almost everything and can wake up in a split second. also can never get to sleep till very late.If I have to go the bathroom at night tho I have the most vivid and involved dreams about looking for and finding non usable bathrooms ....until I finally wake up and get up<br/>\ngrace<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":87338,"nextTopicId":87233}}