{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;Tracy@...-online.co.uk&gt;","replyTo":"LIST","senderId":"VoWBMkE2TVsLVndJLJ7M5X-e4nMqfsoLElHZA0MhclgQwYgAyr_OIMhjp3I2MTESoORiKgHcU8z-2ONHiI9zWXWgeoehaS0zocJM89KEcr4AiaDAbB2Nu0_G","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: breastfeeding - Stephanie, Bridget and Wendy","postDate":"955315291","msgId":7946,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxZWMwMWJmYTI2YyRjMjc4NjEyMCRlNzQ1OWZkNEBsaW5rMTA1MjY2Pg==","referencesHeader":"PGUuMjIzYmQ0ZC4yNjFlYzUxMkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7945,"nextInTime":7947,"topicId":7946,"numMessagesInTopic":0,"msgSnippet":"If this looks odd, it s cos it was 3 separate emails that I decided should go together, but I don t want to spend time editing them now.  Hope no-one minds :-)","messageBody":"<div id=\"ygrps-yiv-1241451453\">\n<html><head>\n \n \n<style></style>\n</head>\n \n<div><font size=\"2\">If this looks odd, it&#39;s cos it was 3 separate emails that I \ndecided should go together, but I don&#39;t want to spend time editing them \nnow.&nbsp; Hope no-one minds :-)</font></div>\n<div><font size=\"2\"></font>&nbsp;</div>\n<div><font size=\"2\">Bridget, I know what you mean.&nbsp; I don&#39;t want to get \noffensive, but I don&#39;t mean that formula is &#39;just as good.&#39;&nbsp; It&#39;s an \ninferior product, but babies can still thrive on it, my own daughter, touch \nwood, has no physical problems with it.&nbsp; The point is that unless people \ntake breastfeeding down from it&#39;s pedestal and say &#39;This is the natural thing to \ndo,&#39; some people are going to hold it up as an unapproachable ideal, which I did \nto an extent with the general lifestyle portrayed in the Art of Breastfeeding \n(GB and NZ version from about 10 years ago.)&nbsp; I was heartbroken when I \ncouldn&#39;t continue breastfeeding Heather, partly because I&#39;d held it up so \nhigh.&nbsp; Anyway, I&#39;ve been sent the article I was talking about, I&#39;ll attach \nit.&nbsp; If the group doesn&#39;t accept attachments, I can send it privately to \nanyone who wants it, or if the consensus of the list agrees, I can cut-and-paste \nit to the list.&nbsp; It explains what I mean much better than I can \n:-)</font></div>\n<div>&nbsp;</div>\n<div><font size=\"2\">Tracy</font></div>\n<div>&nbsp;</div>\n<div><font size=\"2\">PS&nbsp; Support for parents interested in child-led weaning \ncan be found at <a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:naturalweaners@egroups.com\">naturalweaners@egroups.com</a> \n</font></div>\n<div>&nbsp;</div>\n<div><font\n size=\"2\">--------------------------------------------------</font></div>\n<div>&nbsp;</div>\n<div><font size=\"2\">\n<div><font size=\"2\">Stephanie, you both deserve a big round of applause for being \nopen to discussion, with your past experiences, and your dh&#39;s reservations about \nthe benefits.&nbsp; I know you wanted the discussion closed, but I would like to \nadd a few more thoughts.&nbsp; You don&#39;t have to read them if you don&#39;t want \n:-)</font></div>\n<div><font size=\"2\"></font>&nbsp;</div>\n<div><font size=\"2\">I am glad that you have reached a decision that works for you \nboth.&nbsp; And while I understand the desire for the husband to bond with the \nchild, I think I have to point out that there are so many ways that we bond with \nour babies, feeding is only one of them.&nbsp; There are many breastfeeding \nfathers who feel well-connected to their children, and their partners no doubt \nfeel indebted for their commitment to their families&#39; well-being.&nbsp; Yes, \nexpressing milk is the next best thing to breastfeeding, with, according to the \nWHO other mothers&#39; expressed milk next and formula fourth and last on the \npriority list.&nbsp; I would add other mother breastfeeding (in cases where \nmaternal breastfeeding is not possible, rather than not desired) &#39;wet nursing,&#39; \nbelow maternal breastfeeding in this list, because there is much more to \nbreastfeeding than nutritional content.&nbsp; This is what was so upsetting for \nme. I knew that while some babies have allergic reactions to formula, some \nbabies suffer medical problems later in life due to bottlefeeding, I have not \nsuffered any visible effects (yet) from being bottlefed.&nbsp; I wanted my \nchildren to experience the whole experience of breastfeeding, the skin contact, \nthe physical developmental differences...&nbsp; I wanted to experience \nbreastfeeding, the hormonal rush, the skin contact.&nbsp; It was particularly \nimportant for me since Heather had spent time in SCBU&nbsp;that I become the \nonly person who could provide this for my daughter.&nbsp; Other people can do \nanything else for a baby, and in some societies, even breastfeeding is widely \nshared.&nbsp; But it is a very special thing for a mother to share with her \nbaby, and I am glad that I experienced it, and still do, with my second \nchild.&nbsp; Now, if only I could persuade her to stop.... \n&lt;g&gt;</font></div>\n<div>&nbsp;</div>\n<div><font size=\"2\">Thanks for listening here, and I hope your dialogue continues, \nsince I think that parenting issues are never really closed.</font></div>\n<div>&nbsp;</div>\n<div><font size=\"2\">Tracy</font></div>\n<div>&nbsp;</div>\n<div><font size=\"2\">PS&nbsp; I have to admire your commitment to expressing, I \nfound it to be very difficult and did not produce enough to feed my daughter \nfully after a few weeks, even though I had provided for her completely while she \nwas on the SCBU.</font></div>\n<div>&nbsp;</div>\n<div>-----------------------------------</div>\n<div>&nbsp;</div>\n<div>Wendy, <font size=\"2\">you&#39;re right, that&#39;s why I made the point that I don&#39;t \nspeak for LLL earlier :-)</font>\n<div>&nbsp;</div>\n<div><font size=\"2\">But I&#39;d be interested to know what exactly you think gave LLL \na bad name, either on or off list.</font></div>\n<div>&nbsp;</div>\n<div><font size=\"2\">Tracy</font></div></div></font></div>\n<div>&nbsp;</div></html></div>","specialLinks":[]}],"prevTopicId":7944,"nextTopicId":7871}}