{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":257127,"authorName":"Deb","from":"Deb &lt;herbtea@...&gt;","profile":"live_oak2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"history, religion, philosophy and the big questions","postDate":"1028823368","msgId":40299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENTI5OTQ4LkMyOEI4MkREQGd0ZS5uZXQ+","referencesHeader":"PDEwMjg4MTMyODguMTY5My42MjA1MC5tM0B5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":40298,"nextInTime":40300,"topicId":40299,"numMessagesInTopic":0,"msgSnippet":"Oops. I meant to say the that whole period after Solomon s empire broke up was that of the prophets. Solomon built an empire rich in material ways and mingled","messageBody":"<div id=\"ygrps-yiv-466102491\">Oops. I meant to say the that whole period after Solomon&#39;s empire broke<br/>\nup was that of the prophets. Solomon built an empire rich in material<br/>\nways and mingled with the customs of foreign wives and vassal nations.<br/>\nBY time he was done the spiritual life of the nation of Israel was<br/>\nalready deteriorated.  That&#39;s when Jews left the ways of the Torah,<br/>\nmingled them with other pagan ways, and the kingdoms were destroyed and<br/>\nthe Jews taken captive by the Assyrians and later the Babylonians.<br/>\n<br/>\nI have heard it said that when a society appears to be at its strongest,<br/>\nit is already falling. Its the force of material vs spiritual. And here<br/>\nI speak of individual spiritual values and actions; they are often<br/>\nstrongest when a religion is growing, and when it reaches it so-called<br/>\npeak it may already be stagnating due too the taking over the individual<br/>\nresponsibilities and responses by some organized group that supposedly<br/>\nacts and speaks for all.<br/>\n<br/>\nThe precarious balance of individual vs group, and attempts to<br/>\npeacefully and co-operatively maintain a social culture and activity<br/>\nwith varying views of those within it. School &quot;culture&quot; vs home culture,<br/>\nshould we do stuff with our kids all the time or leave them to work it<br/>\nout themselves, who should speak for homeschoolers? We could all speak<br/>\nfor ourselves, but co-ordination makes a bigger impact - then who&#39;ll<br/>\nwatch and decide, how to keep the group from overwhelming the<br/>\nindividual? And how to manage the material while not falling prey to its<br/>\nseduction but keeping our values regards what is most worthwhile in<br/>\nlife.<br/>\n<br/>\nWe have a very philosophical discussion group here really, these are<br/>\nsome of the big questions of life - ;)<br/>\n<br/>\nDebbie<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;David moved the capital for the first time to Jerusalem (after battling<br/>\n </span></blockquote>its pagan inhabitants). He had the strong backing of the tribe of Judah<br/>\n(from whence comes the name of the religion: Judaism) but united and<br/>\nruled all the Israelites  in their lands as king. and conquered<br/>\nneighboring land too expanded his kingdom. His son Solomon expanded it<br/>\neven further as an Empire, ruling neighboring lands. After Solomon&#39;s<br/>\ndeath, Israel and Judea split apart again and the rest of the tribes<br/>\ntook sides with them. They were rivaling kingdoms until Israel fell to<br/>\nthe Assyrians. About 45 years later, Judah was taken by the Assyrians as<br/>\nwell. This whole period was that of the prophets.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;&gt;&gt;That&#39;s more or less what is recorded. I might have missed something. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":40284,"nextTopicId":40301}}