{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":342942830,"authorName":"Jay Ford","from":"Jay Ford &lt;jay.ford79@...&gt;","profile":"jay.ford79","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Sugar, and phrases to avoid","postDate":"1212105953","msgId":35126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyMDE3NS4xNDA5NC5xbUB3ZWI0NjMwOC5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":35125,"nextInTime":35127,"topicId":35126,"numMessagesInTopic":0,"msgSnippet":"===Everything I ve ever known about eating disorders have been about kids that I ve known throughout my life, and what I ve heard through scientific studies","messageBody":"<div id=\"ygrps-yiv-857023415\">===Everything I&#39;ve ever known about eating disorders have been about kids<br/>\nthat I&#39;ve known throughout my life, and what I&#39;ve heard through<br/>\nscientific studies and such. It seemed to me the underlying issue<br/>\nwas/is always about control or trying to find control for oneself. In<br/>\nmy own head I&#39;m playing out all these ideas and scenarios, intentionally<br/>\nnot discussing any of it with my daughter until I worked it out in my<br/>\nown head through thought and observation of what was going on right in<br/>\nfront of me.<br/>\n<br/>\nAt any age a kid should be able to decide what and how much and when to<br/>\neat, at 14, they should pretty much have that down. My daughter has<br/>\nnever been restricted with food, so I decided that she must clearly know<br/>\nwhat she&#39;s doing, especially given that I completely trust her. I<br/>\nfigured the best thing I could do, as her mom, is to observe and listen,<br/>\nmake food she likes and offer to make food at any time that she might<br/>\nseem hungry. That is what I did. After all many people fast for many<br/>\nreasons and live to tell about it!<br/>\n<br/>\nFast forward about 2 months, and a whole bunch of unexpected things have<br/>\ncome out of this. One is that she&#39;s still here and still healthy. She<br/>\ndoesn&#39;t have an eating disorder just because she chose not to eat much<br/>\nif at all. Her food choices became very select, and almost entirely<br/>\nwhole foods. She learned all about caloric intake, vitamins, fats,<br/>\ncarbs, and all those other nutrition labeling that is on food, she even<br/>\nfound info about fruits and meats. In her research about meat, she<br/>\nlearned all about factory farming and has decided to avoid these things.<br/>\n<br/>\nShe&#39;s found for herself on a whole new level what it is to push her body<br/>\nand find it&#39;s limits, to know really what she NEEDS to eat to survive.. <br/>\nMeanwhile alarmists all around me have been trying to tell me that she&#39;s<br/>\ngot this eating disorder and that she&#39;s anorexic and all sorts of other<br/>\ndysfunctional stuff. I&#39;ve pushed those nay sayers out the door to make<br/>\nroom for my daughter. What I see is a very smart kid who found for<br/>\nherself in an unconventional way how and what to eat and took it to a<br/>\nlevel that goes beyond basic nutrition and goes all the way to ethics.<br/>\n<br/>\nThat never would have happened if I hadn&#39;t trusted, if I had listened to<br/>\nthe alarmists instead of observing and knowing deeply that my daughter<br/>\ncan and will make good choices if given the chance to. I could have<br/>\ndone a lot to ruin all that happened. It&#39;s really easy to screw it up,<br/>\nit takes a lot to shut up and trust and watch and observe when you see<br/>\nyour kids do things that trigger alarms.===<br/>\nMy daughter is 13 and just did the same thing.  Only before I could adjust to her being vegetarian (and we had just stocked up on veggie foods) she became a vegan. :)  Huge mental shift for *me*, the meat eater and junk food king.  But she&#39;s cooking and trying new recipes, and I&#39;m looking for foods she can eat (when not in Whole Foods).  Most of our shopping is done at Whole Foods now.<br/>\nJay<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":35114,"nextTopicId":35134}}