{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] what&#39;s really important (was Limits/showering)","postDate":"1068314703","msgId":84207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMC4xY2IzYThhMC4yY2RlOGE0ZkBhb2wuY29tPg=="},"prevInTopic":84192,"nextInTopic":0,"prevInTime":84206,"nextInTime":84208,"topicId":84192,"numMessagesInTopic":0,"msgSnippet":"Yep. Exactly so. The way Sandra put this reminded me of a counseling session I had with a sports psychologist last year. I was working on my head game and","messageBody":"<div id=\"ygrps-yiv-1284551707\">Yep. Exactly so. <br/>\n<br/>\n       The way Sandra put this reminded me of a counseling session I had with <br/>\na sports psychologist last year. I was working on my &quot;head game&quot; and looking <br/>\nfor ways to focus and better shut out distractions during play. <br/>\n<br/>\n       He said I didn&#39;t need more focus because I was already OVER-focusing, <br/>\nwhich is why I could barely tolerate any disturbance. He suggested a sort of <br/>\nself-hypnosis technique I could use during play involving phrases I would focus <br/>\non, like &quot;cool head&quot; or &quot;warm heart&quot; -- anyway, as he had me close my eyes <br/>\nand began to teach me the technique, I was greatly amused to note that the first <br/>\n(well-modulated) words out of his professional mouth were, &quot;Only if you want <br/>\nto, and whenever you feel like it, you can ...&quot;<br/>\n<br/>\n       I asked him about this later, and he explained that the main problem <br/>\nwith helping people who feel like they can or should do things well, is <br/>\novercoming their well-developed resistance to any interference, even if it&#39;s really <br/>\njust &quot;help&quot; and even if it&#39;s coming from people who love them, even sometimes <br/>\nwhen it comes from voices in their own heads! <br/>\n<br/>\n       So what works is if every time, you start by sort of verbally showing <br/>\nyour belly in a  submissive way, making it clear that there&#39;s no reason for <br/>\nresistance to rise. Then the message can get through in a win-win way. If you <br/>\nstart off by making it a directive, even a positive one, resistance is <br/>\nsubconsciously aroused.<br/>\n<br/>\n       I never used the specific sports technique he was trying to teach me <br/>\nbut I do have a new way of getting through (even to myself!) now. Maybe it&#39;s <br/>\njust the strange way my mind works, but it seems to me like another way of <br/>\nexpressing the effect Sandra describes below. JJ<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t believe that is what we are talking about.   But then again, I <br/>\n&gt; never <br/>\n&gt; &quot;taught hygiene&quot; to my children.  They picked the word up elsewhere.  Just <br/>\n&gt; as <br/>\n&gt; I  never used the term &quot;education&quot; so they couldn&#39;t resist it, and I didn&#39;t <br/>\n&gt; use the term &quot;mathematics,&quot; so they couldn&#39;t reject it, there is no category <br/>\n&gt; of <br/>\n&gt; life called &quot;hygiene&quot; that they reject.<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"what&#39;s really important (was Limits/showering)","postDate":"1068307283","msgId":84192,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMC4xMTVmYjI2OS4yY2RlNmQ1M0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":84207,"prevInTime":84191,"nextInTime":84193,"topicId":84192,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/8/03 2:13:02 AM, TeresaBnNC@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-560861483\">In a message dated 11/8/03 2:13:02 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:TeresaBnNC@...\">TeresaBnNC@...</a> writes:<br/>\n<br/>\n&lt;&lt; Basically, anywhere in public, where folks would assume neglectful <br/>\nparenting if they <br/>\nsaw the way your kid was dressed/smelled.    &gt;&gt;<br/>\n<br/>\nI would say &quot;People will think I&#39;m a bad mom if you wear a dirty shirt, so <br/>\nplease change.&quot;<br/>\n<br/>\n&lt;&lt;Just out of curiousity.. what would you have done if he didnt change his <br/>\nshirt?&gt;&gt;<br/>\n<br/>\nIt wouldn&#39;t happen.  If he asked me to do something for him, I would do it.  <br/>\nBecause of that, when I ask him to do something for me, he does it, or he <br/>\nconvinces me why it&#39;s not a good idea.   Because I really listen to them, they <br/>\nreally listent to me.<br/>\n<br/>\n&lt;&lt;  You are lucky that your boys <br/>\nchanged/showered/cleaned up when you gently suggested it.  I don&#39;t think it <br/>\nis the same as what some folks here are experiencing.. &gt;&gt;<br/>\n<br/>\nThe relationship I have developed with my children is the reason unschooling <br/>\nworks, and it&#39;s the reason they don&#39;t watch TV all the time--we don&#39;t have a <br/>\nhomelife they need to escape from.  It&#39;s the reason they don&#39;t eat all the <br/>\ntime--they don&#39;t need food to feel comforted.  It&#39;s the reason all the things we <br/>\ntalk about work, because of the respect we have shown our children.<br/>\n<br/>\nI know parents whose reminders to their children take the form of shaming, or <br/>\nmaking fun of them, or downright insulting them.  If a mother gives an <br/>\nultimatum like &quot;We&#39;re not leaving this house until you take a shower,&quot; they&#39;re <br/>\ntalking about MUCH more than a shower.  They&#39;re saying the child has the power to <br/>\nruin the day.  They&#39;re saying the mother MUST have her way.  They&#39;re saying the <br/>\nchild is small and stinky.   How, in that situation, can the child feel big <br/>\nor right or kind or good?<br/>\n<br/>\n&lt;&lt;And, yes, Im sure many of them need some gentle guidance <br/>\nand reminders to shower and freshen up.. but we are talking about resisting <br/>\nhygiene all together. If that were the case, what would you do?<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t believe that is what we are talking about.   But then again, I never <br/>\n&quot;taught hygiene&quot; to my children.  They picked the word up elsewhere.  Just as <br/>\nI  never used the term &quot;education&quot; so they couldn&#39;t resist it, and I didn&#39;t <br/>\nuse the term &quot;mathematics,&quot; so they couldn&#39;t reject it, there is no category of <br/>\nlife called &quot;hygiene&quot; that they reject.<br/>\n<br/>\nThere are many things we do, but they&#39;re separate and not categorized <br/>\ntogether.  Laundry, taking out trash, brushing teeth, having good soap and shampoo in <br/>\neach shower, having clean towels, changing bedsheets (which happens rarely <br/>\nwith Kirby&#39;s bed but more often with the other two who don&#39;t use their beds for <br/>\nstorage areas)--those things are done because it feels good to have clean <br/>\nteeth, to smell clean sheets, to be able to throw something in the trash from a <br/>\ndistance without it bouncing back out, etc.  Individual things, individual good <br/>\nreasons.   <br/>\n<br/>\nWhy would they reject what feels good to them?<br/>\n<br/>\nBut we all know why a child who feels powerless and beat down will reject <br/>\nwhat his mother wants him to do, especially if it&#39;s the twelfth thing that day <br/>\nshe&#39;s &quot;making him do.&quot;<br/>\n<br/>\n&lt;&lt;  I know that I always gently suggest some &quot;hygiene&quot; .. several times.. <br/>\nbefore I get to the insisting..  &gt;&gt;<br/>\n<br/>\nPerhaps you&#39;ve set up a situation where you&#39;re going to be the winner and <br/>\nhe&#39;s going to be the loser.<br/>\n<br/>\nI&#39;ve thought about this a lot, even before I had my own children, when I was <br/>\nraising others and when I was teaching, when I looked at my friends who lied <br/>\nand rebelled (I didn&#39;t) and at those who didn&#39;t lie, who were comfortable in <br/>\ntheir own homes.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/respect\">http://sandradodd.com/respect</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/206/ndunschool.html\">http://www.home-ed-magazine.com/HEM/206/ndunschool.html</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/fullofyourself\">http://sandradodd.com/fullofyourself</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/library/essays/essay06.shtml\">http://www.unschooling.com/library/essays/essay06.shtml</a><br/>\n<br/>\n<br/>\nYou don&#39;t start with forcing them to shower and then building a better <br/>\nrelationship after you&#39;ve broken their will.  You start building a better <br/>\nrelationship so they will think showers are fun and that being nice to mom is natural.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":84087,"nextTopicId":84214}}