{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"(no subject)","postDate":"1035909768","msgId":10008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwLjI1NzIwOTJkLjJhZjAxNDg4QGNzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":10007,"nextInTime":10009,"topicId":10008,"numMessagesInTopic":0,"msgSnippet":"I do really good with the kids as long as no massive stress comes into play. The kids are asked nicely to do things and usually agree.  The kids make their","messageBody":"<div id=\"ygrps-yiv-319140265\">&quot;I do really good with the kids as long as no massive stress comes into play.<br/>\nThe kids are asked nicely to do things and usually agree.  The kids make<br/>\ntheir own decisions about food, tv, friends, etc..  Lots of hugs and kisses,<br/>\nlots of laughing but with 7 of us in the house and 3 under age 6, we live on<br/>\nthe edge of chaos (which again is ok as long as life is smooth).  Then<br/>\nsomething happens and I find myself taking out my stress on the kids<br/>\n(over-reacting, biting someone&#39;s head off, etc.)  I always apologize when I<br/>\nhave one of my tantrums but I&#39;m having trouble moving past this level.&quot;<br/>\n<br/>\nI&#39;m in the same boat. We only have four children, but boy can things get <br/>\nchaotic, especially with a wee one that wants to destroy the house!!<br/>\nI find my stress level rising when to many things are coming at me at once. <br/>\nThe house is a mess, the kids are having a rough day and getting on each <br/>\nothers nerves etc...<br/>\nIf you take any one stress at a time, I am fine. But combine them and I get <br/>\ncranky.<br/>\nI do find myself talking more now, than just screaming and being reactive.<br/>\nAnd I don&#39;t think it hurts kids to know you&#39;re angry, sometimes they do <br/>\nthings that warrant anger.<br/>\nBut it&#39;s how the anger is directed......am I making them feel rotten? Or am I <br/>\njust saying &quot;I&#39;m really, really frustrated and angry right now!!&quot;<br/>\nTime out is not something I&#39;m very good at giving myself...but I try.<br/>\nI ran outside the other night and did some deep breathing, just being out in <br/>\nthe moonlight really calmed me down.<br/>\nThe kids were a little freaked out I think, because I didn&#39;t say I was taking <br/>\n a time out, I just ran out the door because I could feel the rage rising up.<br/>\nThey wondered if I was going to drive off I think!! So it is good to warn <br/>\neveryone that you&#39;re going to be alone for a while.<br/>\nMeditation helps a lot. We have these little stones with words on them like <br/>\n&quot;strength, joy, patience, God&quot; etc....and holding one seems to help you focus <br/>\non that characteristic and keep in mind how you want to act.<br/>\nReading Deepak Chopra helps a lot.<br/>\nBuying fun items that I think the kids will like from the dollar store and <br/>\nkeeping them around for tense moments helps (Sandra&#39;s idea).<br/>\nRight now I have a puzzle, sticker book, mini-dolls, a Zen Garden, fake fruit <br/>\nand Barbie clothes all tucked in my closet. I pulled out a coloring book the <br/>\nother day which kept Sierra entertained ALL day, so no time for fights with <br/>\nher brothers.<br/>\nWorth a buck anytime!!<br/>\nTaking everyone for a walk to search for leaves or bugs can break my tension, <br/>\nor if it&#39;s really bad I go by myself.<br/>\nPutting on a new movie can calm me down. Dates with my dh seem to keep things <br/>\nfrom building up, time alone or with him helps refresh me and be a better Mom.<br/>\nGetting dh to entertain the kids for an afternoon without me, or Trevor to <br/>\nkeep them all in his room and watch tv or something, lets me clean the house <br/>\nwithout much interruption.<br/>\nSomehow, house cleaning helps me feel calm. It&#39;s something I CAN control when <br/>\nother things feel out of control.<br/>\nThat&#39;s the trigger for me I think, feelings of lack of control. I&#39;m sure it <br/>\nstems somewhat from childhood. But my anger is definitely related to that.<br/>\nI used  to feel SO angry as a child over certain issues. I was extremely <br/>\nindependant and that was coming into conflict with my Mom and Dads parenting <br/>\nstyle too often....caused a LOT of anger and rebellion.<br/>\nSo here I am trying to let go of that. Trying to not let lack of control make <br/>\nme cranky even though it&#39;s in my nature.<br/>\nHouse cleaning gives me some sense of control and I can then be very mild and <br/>\nrelaxed for my children. Their messes don&#39;t bother me, the noise doesn&#39;t <br/>\netc... just because I got things straightened up.<br/>\nCrazy eh?<br/>\nAnd I&#39;m no neat freak, I&#39;m just talking getting the dishes done, laundry <br/>\nstarted and floor picked up.....strangely calming for me.<br/>\nThat and the meditation seem to help the most right now.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":9991,"nextTopicId":9996}}