{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":111436570,"authorName":"lurningathome@aol.com","from":"lurningathome@...","profile":"tolearnwithfreedom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"military seeks info from students","postDate":"1039361729","msgId":50994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMi5kMTMyMjk0LjJiMjRjMGMxQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":50993,"nextInTime":50995,"topicId":50994,"numMessagesInTopic":0,"msgSnippet":"BOSTON - A little-noticed provision in a new federal education law is requiring high schools to hand over to military recruiters some key information about its","messageBody":"<div id=\"ygrps-yiv-1796671549\">BOSTON - A little-noticed provision in a new federal education law is <br/>\nrequiring high schools to hand over to military recruiters some key <br/>\ninformation about its juniors and seniors:<br/>\nname, address and phone number.<br/>\n<br/>\nThe Pentagon says the information will help it recruit young people to defend <br/>\ntheir country. But the new law disturbs parents and administrators in some <br/>\nliberal communities that aren&#39;t exactly gung-ho about the armed forces.<br/>\n<br/>\nSome say the law violates students&#39; privacy and creates a moral dilemma over <br/>\nthe military&#39;s &#39;&#39;don&#39;t ask, don&#39;t tell&#39;&#39; policy on gays.<br/>\n<br/>\n&#39;&#39;I find it appalling that the school is sending out letters to do the job of <br/>\nthe military,&#39;&#39; said Amy Lang, the parent of a student at Cambridge Rindge <br/>\nand Latin School, where Coke was once banned in a protest against the soda <br/>\ngiant&#39;s investments in apartheid South Africa. &#39;&#39;It&#39;s clearly an invasion of <br/>\nmy daughter&#39;s privacy.&#39;&#39;<br/>\n<br/>\nThe No Child Left Behind law, signed last January, pumps billions into <br/>\neducation but also gives military recruiters access to the names, addresses <br/>\nand phone numbers of students in 22,000 schools. The law also says that <br/>\nschools must give the military the same access to their campuses that <br/>\nbusinesses and college recruiters enjoy.<br/>\n<br/>\nSchool systems that fail to comply could lose federal money. The measure also <br/>\napplies to private schools receiving federal funding. But Quaker schools and <br/>\nothers that have a religious objection to military service can get out of the <br/>\nrequirement.<br/>\n<br/>\nStudents and parents who oppose the law can keep their information from being <br/>\nturned over to the military, but they must sign and return an &#39;&#39;opt-out&#39;&#39; <br/>\nform.<br/>\n<br/>\nThe Boston school system, which has 7,500 juniors and seniors, included the <br/>\nopt-out notice in a take-home student handbook, but fewer than a dozen <br/>\nparents opted out.<br/>\n<br/>\nSo far, 95 percent of the nation&#39;s schools are in compliance, said Pentagon <br/>\nspokeswoman Maj. Sandra Troeber. She would not identify the other schools. <br/>\nBut Education Department spokesman Dan Langan said that the current focus is <br/>\non cooperation and that no schools have been sanctioned.<br/>\n<br/>\nFederal law already requires men to register with the Selective Service <br/>\nwithin 30 days of turning 18. The new law, however, enables the Pentagon to <br/>\nreach potential recruits when they are 15 or 16.<br/>\n<br/>\nIn New York City, Daniel Alterman was taken aback when his 15-year-old son, a <br/>\njunior at Stuyvesant High, received a recruitment letter.<br/>\n<br/>\n&#39;&#39;Parents are in the dark,&#39;&#39; Alterman said. &#39;&#39;It freaked me out. I didn&#39;t <br/>\nsign up to support the military effort.&#39;&#39;<br/>\n<br/>\nAlterman said after he opted out, his son received another letter, this one <br/>\npromoting scholarships. &#39;&#39;It was very seductive. They didn&#39;t say anything <br/>\nabout risk to personal safety,&#39;&#39; Alterman said.<br/>\n<br/>\nAmong those objecting to the new requirements is the New York City chapter of <br/>\nthe American Civil Liberties Union. Executive director Donna Lieberman said <br/>\nthat the opt-out provision is inadequate and that schools should be doing <br/>\nmore to protect students&#39; privacy.<br/>\n<br/>\nIn a letter last month, Defense Secretary Donald Rumsfeld and Education <br/>\nSecretary Rod Paige reminded high school administrators of their duty, and <br/>\ncited &#39;&#39;the excellent educational opportunities the military affords, as well <br/>\nas an environment that encourages the development of strong character and <br/>\nleadership skills.&#39;&#39;<br/>\n<br/>\nThe Pentagon said better access to students could also hold down the rising <br/>\ncosts of recruitment. Over the past decade, the cost per recruit has nearly <br/>\ndoubled from $6,500 to $11,600.<br/>\n<br/>\nBefore the law, military recruiters could meet with students in Cambridge and <br/>\nNorthampton on campus only if the student sought them out, and then only at a <br/>\nmeeting attended by a guidance counselor. But Cambridge held a military <br/>\ncareer fair at the high school a month ago.<br/>\n<br/>\n&#39;&#39;It&#39;s a vast departure from the way we&#39;ve done business,&#39;&#39; said Donna <br/>\nHarlan, an associate superintendent in the Northampton school system. &#39;&#39;We <br/>\nare not in the business of giving lists of names of kids to anybody. That was <br/>\ntough. The issue was if we were to receive federal or state money, we had to <br/>\ncomply with the law.&#39;&#39;<br/>\n<br/>\nThe law also spelled the end of a 6-year ban on military recruiting on campus <br/>\nin Portland, Ore. After contending that the &#39;&#39;don&#39;t ask, don&#39;t tell&#39;&#39; policy <br/>\ndiscriminates against gays, the school system now gives recruiters a shot at <br/>\nits 16,000 students.<br/>\n<br/>\nIn Massachusetts, Framingham High senior April Middleton decided over lunch <br/>\nrecently that maybe the military is in her future after talking with Army <br/>\nNational Guard Sgt. Louis Perrin, a recruiter who visited the cafeteria.<br/>\n<br/>\nMiddleton, 18, said she plans to enlist after she graduates, and the prospect <br/>\nof war has not scared her off. &#39;&#39;Sometimes you&#39;ve got to make sacrifices,&#39;&#39; <br/>\nshe said.<br/>\n<br/>\nSometimes, however, recruiters battle hostility.<br/>\n<br/>\n&#39;&#39;One teacher said we were trying to brainwash kids. All we were doing was <br/>\nhanding out pencils,&#39;&#39; Perrin said. &#39;&#39;We&#39;re not trying to invade anybody&#39;s <br/>\nprivacy. We&#39;re just trying to protect their freedoms.&#39;&#39;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":50988,"nextTopicId":50998}}