{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"David Albert","from":"David Albert &lt;shantinik@...&gt;","replyTo":"LIST","senderId":"A8VZn7dwcmL5upABujuL-tplxbKDdRytvjMBF36vReXhgXyQaKaeT1RugH98CtG1Zyu4NrcmDH10LIPDQs_N9-ePxdgOf03FziTQLZE","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] contract learning??","postDate":"962308023","msgId":10275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NUJBN0I3LjgzRkQzNkMxQGVhcnRobGluay5uZXQ+","referencesHeader":"PDM5NUJBMUJDLkNDMzg4OTUwQGl4Lm5ldGNvbS5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":10272,"nextInTime":10276,"topicId":10275,"numMessagesInTopic":0,"msgSnippet":"... The way it is used at the Sudbury Valley School is quite formal.  A student will say I want to learn wordworking. The teacher, whose job it is to find a","messageBody":"<div id=\"ygrps-yiv-1212548875\">Cindy Ferguson wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What is &#39;contract learning&#39;?  I have seen several mention it in the context<br/>\n&gt; of Sudbury schools.  At what age do children start with this idea?  What time<br/>\n&gt; frame is covered? I&#39;d love to hear more about this!<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>The way it is used at the Sudbury Valley School is quite formal.  A student will<br/>\nsay &quot;I want to learn wordworking.&quot; The teacher, whose job it is to find a way for<br/>\nthe child to learn wordworking (or math, or whatever) will try to find an<br/>\nappropriate mentor.  Then a formal contract will be drawn up between the 3 of<br/>\nthem.  The student contract might say, &quot;I agree to come on time to a lesson,<br/>\nevery other day for 2 hours, for the next 2 months, to listen carefully, to take<br/>\nnotes, to clean up after myself, etc., etc.&quot;  The mentor might say -- &quot;I agree to<br/>\nmentor the student so that s/he will learn the following skills in the next two<br/>\nmonths -- then a list of skills, or tools to be used, etc. etc.&quot;  The &quot;teacher&quot;<br/>\nwould contract to mediate any conflicts, to check in from time to time, and to<br/>\nhelp evaluate at the end of the two month period.<br/>\n<br/>\nIn our house, we aren&#39;t so formal, but we work based on a similar principle.<br/>\nJust exposing a child to a subject area or something of interest may not<br/>\nnecessarily help her understand what kind of commitment -- time (both daily and<br/>\nperiod of weeks, months, or years) and resources might be necessary to master<br/>\nit.  So, to learn the violin for example, my daughter will agree to a certain<br/>\namount of weekly practice, to pay attention during lessons, to suggest music she<br/>\nwishes to learn, etc.  We will agree to pay for the lessons, to get her to<br/>\nlessons on time, to ask her (not too often!) how her practice is going and<br/>\nwhether the teacher&#39;s instructions are clear enough, and then to choose a time<br/>\n(say 3 months or 6 months) to evaluate how the contract is working.<br/>\n<br/>\nThe best thing about the Sudbury contract (and I think it is okay to have formal<br/>\ncontracts even with the youngest children) is that kids immediately pick up on<br/>\nthe fact that their education is a two- or three-way deal, and that parents and<br/>\nteachers have obligations just like they do.  The second thing I like about the<br/>\ncontract approach is that it helps children understand that many things are not<br/>\nlearned easily or instantly, and that this is okay!  Most important of all, they<br/>\nlearn that they can fulfill their own chosen knowledge quests by making the<br/>\nnecessary commitment to it, and that adults can be helpful in helping them figure<br/>\nout what might be needed, but it is ultimately their own responsibility to take<br/>\ncharge of their education.<br/>\n<br/>\nI have lots of examples of &quot;contracts&quot; (though I don&#39;t talk about them as such)<br/>\nin my book.<br/>\n<br/>\nDavid<br/>\n--<br/>\n&quot;And the Skylark Sings with Me&quot; is to homeschooling what Tom Paine&#39;s &quot;Common<br/>\nSense&quot; was to the American Revolution.&quot;--Greg Bates, Common Courage Press. To<br/>\nread a sample chapter or the foreword, and to get information about ordering a<br/>\nsigned copy, visit www.skylarksings.com or send an e-mail to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shantinik@...\">shantinik@...</a></div>","specialLinks":[]}],"prevTopicId":10031,"nextTopicId":10277}}