{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":230706843,"authorName":"Betsy Hill","from":"Betsy Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Feeling brave already - looking for input here.","postDate":"1136237535","msgId":23730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzQjk5QkRGLjEwNjAzMDFAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PDExMzYyMTQ5NTAuNjE5NS40Mjg3OC5tMTNAeWFob29ncm91cHMuY29tPg==","referencesHeader":"PDExMzYyMTQ5NTAuNjE5NS40Mjg3OC5tMTNAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":23711,"nextInTopic":0,"prevInTime":23729,"nextInTime":23731,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"** But, I wanted to spend my money at the book store. That was my priority at the time.** I know more than one homeschooling mom (incl. me) who doesn t get","messageBody":"<div id=\"ygrps-yiv-844453386\">**<br/>\n<br/>\n But, I wanted to spend my money at the book store. That was my priority at the time.**<br/>\n<br/>\nI know more than one homeschooling mom (incl. me) who doesn&#39;t get haircuts because she wants to spend money at the bookstore!  You&#39;re going to fit in fine here.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136214931","msgId":23711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGRjA4Q0EwLUVGREItNDYxOC04NkYyLUYzNzMyQkYzQzA1QUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwMDYwMTAyMDIzMzM4Ljg0OTg2LnFtYWlsQHdlYjMxMzEzLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwMTAyMDIzMzM4Ljg0OTg2LnFtYWlsQHdlYjMxMzEzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":23710,"nextInTopic":23730,"prevInTime":23710,"nextInTime":23712,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"... It depends on many factors. If the singularity of the gift is declared to be proof against becoming spoiled and ungrateful, I think there is a chance of","messageBody":"<div id=\"ygrps-yiv-1294479164\">On Jan 1, 2006, at 7:33 PM, Marianne Pfister wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-  Would receiving only one gift for your birthday result in  <br/>\n&gt; making a child feel needy or unloved? I don&#39;t think so.  -=-<br/>\n<br/>\n<br/>\n </span></blockquote>It depends on many factors.<br/>\nIf the singularity of the gift is declared to be proof against  <br/>\nbecoming spoiled and ungrateful, I think there is a chance of that.<br/>\n<br/>\nI grew up hearing about how other children were &quot;spoiled&quot; because  <br/>\nthey had more than I did, but some of the nicest and most generous  <br/>\npeople I knew had more than I had, and some of the meanest and  <br/>\nstingiest and least content had the same or less than I had, so I  <br/>\ncould tell even at a very early age that it was more about attitude  <br/>\nand joy than about quantity or quality.<br/>\n<br/>\nI  have come to see the concept of being &quot;poiled&quot; as a boogey-man  <br/>\nused for control and justification of parental limitations on a  <br/>\nchild&#39;s world.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spoiled\">http://sandradodd.com/spoiled</a><br/>\n<br/>\nI wrote it better there.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136214686","msgId":23710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdEN0JGQkIzLTBGQUMtNEU0Ri04NDAzLTk4QkI0MjM5MTREN0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwMDYwMTAyMTMyOTIwLjEwMDU1LnFtYWlsQHdlYjMxMzA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwMTAyMTMyOTIwLjEwMDU1LnFtYWlsQHdlYjMxMzA1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":23705,"nextInTopic":23711,"prevInTime":23709,"nextInTime":23711,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"... =============================== I have voices in my head.  Mostly they re my grandmothers, but there are a few others.  I learned a long time ago to have","messageBody":"<div id=\"ygrps-yiv-1364582940\">On Jan 2, 2006, at 6:29 AM, Marianne Pfister wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   One thing, one simple thing, stood out the most for me, did the  <br/>\n&gt; kids have fun? YES, Everyone loved it! Me? NO! I just sat their  <br/>\n&gt; begin judgmental! It was terrible, I was terrible. I see it was  <br/>\n&gt; judgment that made me feel so bad after leaving, not the bouncy  <br/>\n&gt; house at all. I couldn&#39;t even be happy!<br/>\n<br/>\n </span></blockquote>===============================<br/>\n<br/>\nI have voices in my head.  Mostly they&#39;re my grandmothers, but there  <br/>\nare a few others.  I learned a long time ago to have my dialog with  <br/>\nthose parroting memories.  They were just reciting what THEIR mothers  <br/>\nsaid, probably.  At some point it&#39;s worth talking back to the ghosts  <br/>\nof your ancestors, if they&#39;re mean and wounded.  And if they use  <br/>\nterms like &quot;brat&quot; and &quot;selfish&quot; especially.   So I re-thought and  <br/>\nrecast my grandmothers as people I wished could have had a sweeter,  <br/>\ngentler upbringing and happier marriages, and more comfortable  <br/>\nsurroundings, and tried to pour my good wishes on the sad little  <br/>\ngirls who were still trapped inside them their whole lives.<br/>\n<br/>\nThat helped inside my head.<br/>\n<br/>\nWhat helped outside was putting their lacks on the list of things to  <br/>\navoid with my own children.<br/>\n<br/>\nIf they didn&#39;t have enough food and it affected them for life, I  <br/>\noffered my children more food.<br/>\n<br/>\nBecause they both talked about unreasonable amounts of chores and  <br/>\nlack of gratitude or acknowledgment, I always thank my children every  <br/>\ntime they help.<br/>\n<br/>\nBecause one of them was pressed to mother her six younger siblings  <br/>\nand married at the first opportunity to escape that (and because of  <br/>\nanother couple of experiences too) I tried never to leave one of my  <br/>\nchildren in charge of the safety or well-being of another one, and if  <br/>\nfor a brief period I did need to, I thanked him profusely.<br/>\n<br/>\nSeeing the longterm effects of certain parenting decisions and  <br/>\npractices helped me create my internal list of priorities and of  <br/>\ntraps to avoid.<br/>\n<br/>\nGradually, over years, I&#39;ve cleaned, updated and reorganized those  <br/>\nlists and priorities.  I continue to do so.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136210600","msgId":23705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCRkZBMjIzLUIwNDAtNEUyMi05NzM4LTk1RTdEOEY4RjBEREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDYxNkNDNjM3LTU2RjYtNERCMi1CQkUyLUE2QzkyOTZCM0Q3M0BlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDIwMDYwMTAxMjM1MzM2Ljc0OTA0LnFtYWlsQHdlYjM2MzA3Lm1haWwubXVkLnlhaG9vLmNvbT4gPDYxNkNDNjM3LTU2RjYtNERCMi1CQkUyLUE2QzkyOTZCM0Q3M0BlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":23703,"nextInTopic":23710,"prevInTime":23704,"nextInTime":23706,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"... Mine too.   Kirby turned 19 and had a costume party (in July; pretty hot in costumes).  There are photos linked from http://sandradodd.com/ kirby Holly","messageBody":"<div id=\"ygrps-yiv-2005973374\">On Jan 1, 2006, at 7:20 PM, Pamela Sorooshian wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-My kids have done all KINDS of birthday things. Often just our  <br/>\n&gt; family<br/>\n&gt; will go out to dinner and to the theater. They&#39;ve occasionally had<br/>\n&gt; parties - but that isn&#39;t usually what they choose. Lots of times they<br/>\n&gt; invite a friend to go do something special. Always something<br/>\n&gt; different. -=-<br/>\n<br/>\n </span></blockquote>Mine too.   Kirby turned 19 and had a costume party (in July; pretty  <br/>\nhot in costumes).  There are photos linked from <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/\">http://sandradodd.com/</a> <br/>\nkirby<br/>\n<br/>\nHolly turned 14 in November, and rather than a party, she spent the  <br/>\nday at the mall with her friend Jasmine, who lives in England but has  <br/>\nnow for the third year come here for Halloween and Holly&#39;s birthday.   <br/>\nShe has four grandparents here, so it&#39;s not just to see Holly, but  <br/>\nshe likes Halloween a lot, and Holly&#39;s birthday is two days after,   <br/>\nso she stays with us those few days.  Next year they&#39;ll be too old to  <br/>\ntrick-or-treat, probably.<br/>\n<br/>\nMarty will be 17 on the 14th.  Because it&#39;s a Saturday I suggested we  <br/>\nhave a party (though I would&#39;ve offered in any case).  Last year he  <br/>\nopted for dinner and a movie with friends, but some of them were  <br/>\nbroke so it ended up not only was he not treated by them, but he had  <br/>\nto pay for some of their food and movie.   It was kind of a bust.  So  <br/>\nthis year some of those are planning something special for him, to  <br/>\nmake up for it.<br/>\n<br/>\nI asked him yesterday if there was anything he wanted (giftwise), but  <br/>\nChristmas just passed and he liked the things he got and he couldn&#39;t  <br/>\nthink of anything.  He has a job, so he doesn&#39;t need money.<br/>\n<br/>\nOnce for one of Marty&#39;s birthdays we hired a friend of ours who had a  <br/>\nMagic Fairy routine.  She did a clown sometimes, and a magic fairy  <br/>\nothers, and we hired her for $50 I think as a magic fairy.  Another  <br/>\ntime we hired a family of unschooled kids who had a magic and  <br/>\njuggling show, for a party at my sister&#39;s house.  That was our gift,  <br/>\nbut we were doing a favor for the family we hired, and for our kids  <br/>\n(who were friends of theirs) and for my sister&#39;s kids (who hadn&#39;t met  <br/>\nthem, but the whole families became friends for years after).<br/>\n<br/>\nMy kids have been to parties at places like little amusement parks or  <br/>\nmuseums which were probably  more expensive overall than renting a  <br/>\nbouncy house would have been, but sometimes it was because the family  <br/>\ndidn&#39;t have room at home for a party.  Our best parties were on the  <br/>\npatio at our old house, where there was lots of room and a swingset  <br/>\nand a sandbox.<br/>\n<br/>\nI do miss having little kids who are so excited about birthdays, and  <br/>\nI&#39;m glad we put so much into their celebrations.   They often had  <br/>\nhomemade cakes, sometimes fancy ones by friends, sometimes plainer  <br/>\nones by me, sometimes storebought, but they were always happily and  <br/>\ngratefully received and shared.<br/>\n<br/>\nMy mother let me have one single birthday party and it wasn&#39;t very  <br/>\ngood at all, so I was happy not to have another one.  I wanted a  <br/>\nmerrier life for my children, and have accomplished that pretty well.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":194874034,"authorName":"Marianne Pfister","from":"Marianne Pfister &lt;allowinglife@...&gt;","profile":"allowinglife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136208560","msgId":23703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTAyMTMyOTIwLjEwMDU1LnFtYWlsQHdlYjMxMzA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDIwMDYwMTAyMDYxMTQxLjk3MjAucW1haWxAd2ViODExMDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":23699,"nextInTopic":23705,"prevInTime":23702,"nextInTime":23704,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"I think I have been able to agree with everyone regarding the birthday party. I have been giving ever thing said a lot of thought. One thing, one simple thing,","messageBody":"<div id=\"ygrps-yiv-1813161628\">I think I have been able to agree with everyone regarding the birthday party. I have been giving ever thing said a lot of thought. <br/>\n   <br/>\n  One thing, one simple thing, stood out the most for me, did the kids have fun? YES, Everyone loved it! Me? NO! I just sat their begin judgmental! It was terrible, I was terrible. I see it was judgment that made me feel so bad after leaving, not the bouncy house at all. I couldn&#39;t even be happy! This is my biggest issue. I&#39;m not even consistent about it; sometimes I am OK with spending money on something, other times &quot;No Way&quot;. <br/>\n   <br/>\n    I would like to work on being more observant and less judgmental. When you see how someone else does things, I think it is fine to observe how you feel about it. It gives you an opportunity to learn something about yourself. How, why would you do things? If differently? The problem is stopping with the observation before it turns into a judgment. Does that make sense. My perspective may be different but not better.<br/>\n   <br/>\n  I had this boyfriend once who always wanted to go out drinking on weekends. I never wanted to go because I didn&#39;t want to spend my money in a bar. It always bothered him because he thought that I was just being cheep, (OK, obviously this may be partly true). But, I wanted to spend my money at the book store. That was my priority at the time.<br/>\n   <br/>\n  I started working when I was 13 years old. My parents put no restrictions on what I did with my earned income. So, what did I do with it? Bought clothing. Very expensive, fashionable clothing. It never mattered to me what things cost, if I wanted it, I bought it....with my own hard earned money. My parents never judge me for that. This is not what I spend money on now, but clothing was my priority then.<br/>\n   <br/>\n  My friend&#39;s priority at this time in her life is her children. She used her own hard earned money to help her son have a great birthday celebration. Her son and all his friends had a wonderful time! It was a great party. <br/>\n   <br/>\n  Thank you for letting me see this! Now I want a bouncy house!<br/>\n   <br/>\n  ~ Marianne<br/>\n     <br/>\n<br/>\n  Very helpful thoughts:<br/>\n   <br/>\n<br/>\n    &quot;Pamela Sorooshian&quot; wrote: <br/>\n   <br/>\n  Do you have just the one child? Are you perhaps feeling that he might be &quot;spoiled&quot; by all the attention and having more material goods than what you, yourself, had? Could you be slightly envious, even?<br/>\n   <br/>\n  Like you&#39;re negative about it just BECAUSE it cost money and isn&#39;t &quot;necessary.&quot; Is &quot;necessary&quot; going to be your criterion for judging the value of things your child might enjoy? Do you tell your child things like: &quot;No, you don&#39;t need a cookie?&quot; <br/>\n   <br/>\n  Sandra Dodd had to say this:<br/>\n   <br/>\n  You don&#39;t have to live in the grumpy shadows.  You can start to want and be sunshine without even taking a step in any direction. It&#39;s just thoughts.<br/>\n   <br/>\n  Do you want to live in that narrow channel of &quot;necessary&quot;?<br/>\nWhat about &quot;possible&quot;? What about just making a decision because it&#39;s fun? Did the kids have fun in that bouncy castle?  It&#39;s not clear whether you were there or you just heard about it later. If you were there, did you watch the kids and hear their excitement?<br/>\n   <br/>\n   <br/>\n  Susan McGlohn added this:<br/>\n   <br/>\n  It isn&#39;t about big parties versus littler parties or the number of  gifts.  That isn&#39;t what I read Sandra as saying.  It is about living joyfully and abundantly and freely.  It&#39;s about not imposing our own values onto our children&#39;s happiness. <br/>\n   <br/>\n  Any time a parent passes judgement on something a child enjoys, even silently, through their posture, or a look that crosses their face, or their own lack of enthusiasm or refusal to join in the child&#39;s passion, they are imposing their prejudice upon their children. They are creating an atmosphere of unacceptance and ridicule and judgement. The child will <br/>\nmost likely give up that thing he enjoys to obtain the parent&#39;s favor, but it will be at a greater cost than a video game or a pony ride or 3 more birthday presents.<br/>\n<br/>\nNo one can teach another person gratitude or generosity, neither by supplying tons of gifts nor refraining from them.  They come from a heart that feels joyfully and abundantly cared for. <br/>\n<br/>\n   <br/>\n   <br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\n Yahoo! DSL Something to write home about. Just $16.99/mo. or less<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240085865,"authorName":"NANCY OWENS","from":"NANCY OWENS &lt;nancy-owens@...&gt;","profile":"nancyeddsowens","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136182301","msgId":23699,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTAyMDYxMTQxLjk3MjAucW1haWxAd2ViODExMDgubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PDIwMDYwMTAxMjM1MzM2Ljc0OTA0LnFtYWlsQHdlYjM2MzA3Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":23696,"nextInTopic":23703,"prevInTime":23698,"nextInTime":23700,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"Dawn White  wrote: Just my two cents worth here, but I totally agree with you Marianne.  I grew up the same way as you regarding birthday","messageBody":"<div id=\"ygrps-yiv-1171310844\">Dawn White &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:forhim2730@...\">forhim2730@...</a>&gt; wrote:<br/>\n    Just my two cents worth here, but I totally agree with you Marianne.  I grew up the same way as you regarding birthday parties and I do the same with my children.  In this situation I believe &quot;less is more&quot;.  I think my children appreciate the gifts they receive more than other children I know.<br/>\n*****************<br/>\n   <br/>\n  Why do you totally agree? I grew up with parents who could pretty much afford the moon if they wanted. Did they give any of that to me? Nope. Am I bitter? Yes. But not because I feel I should have or that it was my right or any thing like that. I&#39;m bitter because with every NO I got I also got a &#39;when I was a kid we had nothing&#39; story. I grew up feeling that since they didn&#39;t have anything growing up I was being punished for it. I grew up feeling guilty every time I asked for something or needed something. It didn&#39;t matter if I needed new jeans or I wanted an extra helping at meal time. I felt guilty. I wanted to play the guitar desperately, but my Mom didn&#39;t get to play the flute. They did become better parents. My sister got to play the flute, and my brother got to play the drums. I was definitely their experimental kid. Sad for me, but good for my little sister and brother. I am grateful for anything positive that came out of my upbringing. (rather, maybe I should say, I&#39;ve<br/>\n learned to be positive about things I could still wallow in?) <br/>\n   <br/>\n  Darin and I haven&#39;t always been able to afford birthdays and holidays. It&#39;s been rough. Probably rougher on us than the kids because we want so much to give them what we didn&#39;t have. Darin grew up poor, poorer than he probably should have because his mom mismanaged money. I grew up with rich parents who thought I should know the value of being poor. So if there is a birthday where I can afford to do that dream thing, where it isn&#39;t going to interfere with food on the table for a week or heat or what ever than I&#39;m all for it. And if it looks like it is, than I start saving for it well in advance. <br/>\n   <br/>\n  Moly is getting ONLY one gift this year. On the 25th of this month she will be twelve and the weekend before, Darin is coming home. We are going to take her out to a Japanese restaurant and give her a long thin box with drum sticks in it. Only because I really don&#39;t want to wrap a whole trap set up! &lt;g&gt; I&#39;m excited! Two years ago her wish was a new bike. One I really couldn&#39;t afford at the time. But I saved, and got it for her. I remember that want. The year I wanted a bike, my Dad went to a thrift store and got me this ugly red boys bike. I had to prove I really wanted a bike like my friends had. I had to learn to ride on that old thing, I had to get good grades, I had to be a good girl... It took me two years to prove I was worthy of a new, pretty, girls bike. The year Darin wanted a bike, he had to save on his own. It&#39;s hard for a seven year old to save that kind of money. I feel bad for begrudging an ugly used bike when my husband would have been grateful for the chain... I<br/>\n hope that my kids won&#39;t grow up knowing that feeling. I don&#39;t want them growing up with the exact opposite feeling of I want=I get, but I don&#39;t want them to feel that their wants and needs were unimportant, or that less is more. Because less isn&#39;t always more. I do want them to understand that it is the thought that counts, that there are gifts from the heart. That homemade is nice and wonderful. But I also don&#39;t want them to think that gifts are &#39;have to&#39; or come with attachments.<br/>\n  ~Nancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136171177","msgId":23696,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCMjRFMEYyLTQzMEEtNDA3NC05MDY5LUQwMkM1RjhEMURDOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDkwLjZjZDgyYjAxLjMwZTllYzE5QGFvbC5jb20+","referencesHeader":"PDkwLjZjZDgyYjAxLjMwZTllYzE5QGFvbC5jb20+"},"prevInTopic":23693,"nextInTopic":23699,"prevInTime":23695,"nextInTime":23697,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"... For Roya s 9th birthday, she wanted a party with all her friends. So - we had it at a park and told her to go ahead, invite everybody she wanted. It was","messageBody":"<div id=\"ygrps-yiv-381135411\">On Jan 1, 2006, at 6:38 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:JMCAUSEYJ@...\">JMCAUSEYJ@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My wife and I created a little treasure map, wrote out clues at  <br/>\n&gt; each station,<br/>\n&gt; and the kids ran around inside and outside our house getting the  <br/>\n&gt; &quot;treasure&quot;<br/>\n&gt; (courtesy of the local $1 store). We had the mandatory cake, of  <br/>\n&gt; course, but<br/>\n&gt; that was it. Several kids afterward told their parents they wanted  <br/>\n&gt; that kind of<br/>\n&gt; party.<br/>\n&gt;<br/>\n&gt; So now that we&#39;ve further confused the discussion...<br/>\n<br/>\n </span></blockquote>For Roya&#39;s 9th birthday, she wanted a party with &quot;all&quot; her friends.  <br/>\nSo - we had it at a park and told her to go ahead, invite everybody  <br/>\nshe wanted. It was HUGE - she invited something like 60 kids and  <br/>\nmaybe 45 showed up. We ordered pizza and had a big cake and big tub  <br/>\nof ice cream. We played outdoor games - big group cooperative games,  <br/>\nmostly, plus some creative relay races. It was a lot of fun. But the  <br/>\nhighlight was that we had spray painted bags full of aquarium gravel  <br/>\nwith bright glittery gold paint - and we threw it in the sand all  <br/>\nover the large playground and the kids &quot;panned for gold.&quot;  They  <br/>\ndidn&#39;t get any prizes or anything - we just gave them little baggies  <br/>\nto take their gold home with them! They LOVED it.<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128461194,"authorName":"Susan McGlohn","from":"Susan McGlohn &lt;wifeto.vegman@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input  here.","postDate":"1136170621","msgId":23693,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMS4xLjEuMi4yMDA2MDEwMTIxNDI1My4wMWM3NTRjOEBpbmNvbWluZy52ZXJpem9uLm5ldD4=","inReplyToHeader":"PDIwMDYwMTAyMDIzMzM4Ljg0OTg2LnFtYWlsQHdlYjMxMzEzLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDBDRTdENEE3LTM3QTQtNDJFRS1BQzk2LTM2MEYyQkM1ODlDNkBzYW5kcmFkb2RkLmNvbT4gPDIwMDYwMTAyMDIzMzM4Ljg0OTg2LnFtYWlsQHdlYjMxMzEzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":23692,"nextInTopic":23696,"prevInTime":23692,"nextInTime":23694,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"... It isn t about big parties versus littler parties or the number of gifts.  That isn t what I read Sandra as saying.  It is about living joyfully and","messageBody":"<div id=\"ygrps-yiv-750091176\">At 21:33 1/1/2006, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;   Would receiving only one gift for your birthday result in making a <br/>\n&gt; child feel needy or unloved? I don&#39;t think so.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>It isn&#39;t about big parties versus littler parties or the number of <br/>\ngifts.  That isn&#39;t what I read Sandra as saying.  It is about living <br/>\njoyfully and abundantly and freely.  It&#39;s about not imposing our own values <br/>\nonto our children&#39;s happiness.<br/>\n<br/>\nThere have been lots of discussions over the months on here and elsewhere <br/>\nabout how parents impose their values on kids about TV shows, bedtimes, <br/>\nwhat is good to eat and what isn&#39;t, what is good to read and what isn&#39;t, <br/>\nand what is environmentally good and what isn&#39;t, whether it is plastic toys <br/>\nversus wooden ones, or video games versus board games.<br/>\n<br/>\nLike Sam was sharing about realizing he was imposing his judgement about <br/>\nthe tv shows the boys wanted to watch, if your kids attend a boisterous and <br/>\nexpensive party, and the birthday child got lots of presents, and on the <br/>\nway home you are clucking and complaining about the wastefulness or <br/>\nspoiling or whatever you are thinking it is, your child is not going to <br/>\nfeel that she can say, &quot;I really loved that party.  It was one of the best <br/>\nparties I&#39;ve been to!&quot;<br/>\n<br/>\nAny time a parent passes judgement on something a child enjoys, even <br/>\nsilently, through their posture, or a look that crosses their face, or <br/>\ntheir own lack of enthusiasm or refusal to join in the child&#39;s passion, <br/>\nthey are imposing their prejudice upon their children.   They are creating <br/>\nan atmosphere of unacceptance and ridicule and judgement.  The child will <br/>\nmost likely give up that thing he enjoys to obtain the parent&#39;s favor, but <br/>\nit will be at a greater cost than a video game or a pony ride or 3 more <br/>\nbirthday presents.<br/>\n<br/>\nNo one can teach another person gratitude or generosity, neither by <br/>\nsupplying tons of gifts nor refraining from them.  They come from a heart <br/>\nthat feels joyfully and abundantly cared for.<br/>\n<br/>\n<br/>\nSusan (in VA)<br/>\nwife to VegMan (aka Ted) since 12/86<br/>\nmomma to Sarah (10/89), Andrew (6/91), and Aaron (3/98)<br/>\n<br/>\n&quot;It&#39;s a small world....but a BIG life!&quot;  ~ Aaron, age 6<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://radicalchristianunschool.homestead.com/index.html\">http://radicalchristianunschool.homestead.com/index.html</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":124441255,"authorName":"JMCAUSEYJ@aol.com","from":"JMCAUSEYJ@...","profile":"homefamilyfour","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136169497","msgId":23692,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwLjZjZDgyYjAxLjMwZTllYzE5QGFvbC5jb20+"},"prevInTopic":23691,"nextInTopic":23693,"prevInTime":23691,"nextInTime":23693,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"Hi everyone. We re new, Pattie and Michael in northern Virginia, and we have twin daughters who will be 10 in April. This birthday party thread is interesting,","messageBody":"<div id=\"ygrps-yiv-483317885\">Hi everyone. We&#39;re new, Pattie and Michael in northern Virginia, and we have <br/>\ntwin daughters who will be 10 in April. This birthday party thread is <br/>\ninteresting, and while there are no easy answers, and probably not even a single <br/>\nanswer that works for all people all the time, we&#39;ll just add this: We&#39;ve done <br/>\nrelatively expensive (and showy?) &#39;paint your own pottery&#39; birthdays, we&#39;ve done <br/>\nsimilar gymnastics parties (at a local gym) and our daughters have attended <br/>\neven more splashy parties, e.g. an acting troupe acted out Sleeping Beauty <br/>\ncomplete with costumes and sets!<br/>\n<br/>\nBut our kids favorite ever, so far, birthday party? <br/>\n<br/>\nMy wife and I created a little treasure map, wrote out clues at each station, <br/>\nand the kids ran around inside and outside our house getting the &quot;treasure&quot; <br/>\n(courtesy of the local $1 store). We had the mandatory cake, of course, but <br/>\nthat was it. Several kids afterward told their parents they wanted that kind of <br/>\nparty. <br/>\n<br/>\nSo now that we&#39;ve further confused the discussion...<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194874034,"authorName":"Marianne Pfister","from":"Marianne Pfister &lt;allowinglife@...&gt;","profile":"allowinglife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136169218","msgId":23691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTAyMDIzMzM4Ljg0OTg2LnFtYWlsQHdlYjMxMzEzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDBDRTdENEE3LTM3QTQtNDJFRS1BQzk2LTM2MEYyQkM1ODlDNkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":23690,"nextInTopic":23692,"prevInTime":23690,"nextInTime":23692,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"But creating paucity in order to increase appreciation isn t very generous or loving. Would receiving only one gift for your birthday result in making a","messageBody":"<div id=\"ygrps-yiv-223799876\">&quot;But creating paucity in order to increase appreciation isn&#39;t very generous or loving.&quot;<br/>\n   <br/>\n  Would receiving only one gift for your birthday result in making a child feel needy or unloved? I don&#39;t think so. <br/>\n   <br/>\n  On the other hand, perhaps there are people who would/do feel unloved when they do not receive things in generous portions. This reminds me of a book a read a few years ago. Gary Chapman &quot;describe five ways we can connect with our children: physical touch, quality time, words of affirmation, gifts, and acts of service.&quot; in his book, The Five Love Languages of Children. Though it has been a while since I read this book, I recall it being an interesting read.<br/>\n   <br/>\n   <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nYahoo! for Good - Make a difference this year. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136168459","msgId":23690,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxNkNDNjM3LTU2RjYtNERCMi1CQkUyLUE2QzkyOTZCM0Q3M0BlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwMTAxMjM1MzM2Ljc0OTA0LnFtYWlsQHdlYjM2MzA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwMTAxMjM1MzM2Ljc0OTA0LnFtYWlsQHdlYjM2MzA3Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":23687,"nextInTopic":23691,"prevInTime":23689,"nextInTime":23691,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"... So do you not invite other people to celebrate your children s birthdays with them? Do you tell them not to bring gifts? Do you not let your kids go to","messageBody":"<div id=\"ygrps-yiv-706451636\">On Jan 1, 2006, at 3:53 PM, Dawn White wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Just my two cents worth here, but I totally agree with you  <br/>\n&gt; Marianne.  I grew up the same way as you regarding birthday parties  <br/>\n&gt; and I do the same with my children.  In this situation I believe  <br/>\n&gt; &quot;less is more&quot;.  I think my children appreciate the gifts they  <br/>\n&gt; receive more than other children I know.<br/>\n<br/>\n </span></blockquote>So do you not invite other people to celebrate your children&#39;s  <br/>\nbirthdays with them? Do you tell them not to bring gifts? Do you not  <br/>\nlet your kids go to other kids&#39; birthday parties and take them gifts?<br/>\n<br/>\nMy kids have done all KINDS of birthday things. Often just our family  <br/>\nwill go out to dinner and to the theater. They&#39;ve occasionally had  <br/>\nparties - but that isn&#39;t usually what they choose. Lots of times they  <br/>\ninvite a friend to go do something special. Always something  <br/>\ndifferent. My extended family always celebrates each of our birthdays  <br/>\n- that&#39;s my two sisters, their husbands and kids (age range now from  <br/>\n12 to 25). We combine birthdays of those who are very close together  <br/>\n- we all go to the park together, usually, and we share food, play  <br/>\nsome games, talk and hang out, have some birthday cake, and open  <br/>\npresents.<br/>\n<br/>\nIt doesn&#39;t seem to matter to my kids whether or not they get a lot of  <br/>\ngifts. They enjoy and appreciate them when they get them - they don&#39;t  <br/>\nmiss them if they don&#39;t. They aren&#39;t deciding what to do for their  <br/>\nbirthday based on getting or not getting gifts.<br/>\n<br/>\nIMPOSING a &quot;less is more&quot; principle on a child just sounds  <br/>\npuritanical, though, to me. What if a child thinks having a big party  <br/>\nand getting lots of gifts sounds really fun? Would you say no?<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136167680","msgId":23687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBDRTdENEE3LTM3QTQtNDJFRS1BQzk2LTM2MEYyQkM1ODlDNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwMDYwMTAxMjM1MzM2Ljc0OTA0LnFtYWlsQHdlYjM2MzA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDIwMDYwMTAxMjM1MzM2Ljc0OTA0LnFtYWlsQHdlYjM2MzA3Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":23684,"nextInTopic":23690,"prevInTime":23686,"nextInTime":23688,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"... Someone who only gets one meal  a day might appreciate it more than those who get three.  But creating paucity in order to increase appreciation isn t very","messageBody":"<div id=\"ygrps-yiv-1056453174\">On Jan 1, 2006, at 4:53 PM, Dawn White wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  In this situation I believe &quot;less is more&quot;.  I think my children  <br/>\n&gt; appreciate the gifts they receive more than other children I know.<br/>\n<br/>\n<br/>\n </span></blockquote>Someone who only gets one meal  a day might appreciate it more than  <br/>\nthose who get three.  But creating paucity in order to increase  <br/>\nappreciation isn&#39;t very generous or loving.<br/>\n<br/>\nUnschooling doesn&#39;t work very well when children feel needy.<br/>\nLearning doesn&#39;t work when a child feels hungry or needy.  (Maslow&#39;s  <br/>\nHierarchy of Needs)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":242814825,"authorName":"Dawn White","from":"Dawn White &lt;forhim2730@...&gt;","profile":"forhim2730","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136159616","msgId":23684,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTAxMjM1MzM2Ljc0OTA0LnFtYWlsQHdlYjM2MzA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDIwMDYwMTAxMTc1MTI5LjY1MDAucW1haWxAd2ViMzEzMDYubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":23657,"nextInTopic":23687,"prevInTime":23683,"nextInTime":23685,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"Just my two cents worth here, but I totally agree with you Marianne.  I grew up the same way as you regarding birthday parties and I do the same with my","messageBody":"<div id=\"ygrps-yiv-1208678232\">Just my two cents worth here, but I totally agree with you Marianne.  I grew up the same way as you regarding birthday parties and I do the same with my children.  In this situation I believe &quot;less is more&quot;.  I think my children appreciate the gifts they receive more than other children I know.<br/>\n   <br/>\n  Dawn<br/>\n<br/>\nMarianne Pfister &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:allowinglife@...\">allowinglife@...</a>&gt; wrote:<br/>\n  A friend of mine had a birthday party for her son this weekend and I was shocked to find out that she had rented one of those big blow up bouncy castles. (Her son turned five.)  I can&#39;t help feeling that it is so unnecessary to spend so much money on a child&#39;s birthday party. Receiving 10 toys at one time also seems like a bit much.  I think part of my problem is due to the fact that since I grew up with 8 people in my family, we never needed &quot;friend&quot; birthday parties. We just didn&#39;t have them. In addition, we would only receive one gift.<br/>\n   <br/>\n  Whenever I attend a child&#39;s birthday party, I often leave feeling that I am the only one in the world who feels that children can have fun without involving a lot of money. It seems like everything in the world has been commercialized....hmmm, I can&#39;t seem to avoid it, and yet I feel can&#39;t just accept it. <br/>\n   <br/>\n  I would like to know how others feel about this and am looking for any suggestions for dealing with it, or at least dealing with my feelings regarding it.<br/>\n   <br/>\n  ~ Marianne<br/>\n<br/>\n            <br/>\n---------------------------------<br/>\nYahoo! Photos<br/>\nRing in the New Year with Photo Calendars. Add photos, events, holidays, whatever.<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  SPONSORED LINKS <br/>\n        Unschooling   Attachment parenting   John holt     Parenting magazine   Single parenting <br/>\n    <br/>\n---------------------------------<br/>\n  YAHOO! GROUPS LINKS <br/>\n<br/>\n    <br/>\n    Visit your group &quot;AlwaysLearning&quot; on the web.<br/>\n    <br/>\n    To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n    <br/>\n    Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n    <br/>\n---------------------------------<br/>\n  <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nYahoo! Shopping<br/>\n Find Great Deals on Holiday Gifts at Yahoo! Shopping <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136145793","msgId":23657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFOTlFODcyLUZFOTEtNEU3QS1CMkIxLTU0ODY2NjYzQTZDOEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwMDYwMTAxMTc1MTI5LjY1MDAucW1haWxAd2ViMzEzMDYubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PDIwMDYwMTAxMTc1MTI5LjY1MDAucW1haWxAd2ViMzEzMDYubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":23651,"nextInTopic":23684,"prevInTime":23656,"nextInTime":23658,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"... ========================= Trying to sort through childhood frustrations and regrets is hard but worthwhile, especially when we have children of our own. ","messageBody":"<div id=\"ygrps-yiv-315561983\">On Jan 1, 2006, at 10:51 AM, Marianne Pfister wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   I would like to know how others feel about this and am looking  <br/>\n&gt; for any suggestions for dealing with it, or at least dealing with  <br/>\n&gt; my feelings regarding it.<br/>\n<br/>\n </span></blockquote>=========================<br/>\n<br/>\nTrying to sort through childhood frustrations and regrets is hard but  <br/>\nworthwhile, especially when we have children of our own.<br/>\n<br/>\nDon&#39;t limit your son&#39;s life because your own was limited.  Don&#39;t  <br/>\nresent others&#39; joy because you had to wait in line and share with  <br/>\nlots of siblings.  It&#39;s a harsh and grey place to come from.<br/>\n<br/>\nYou don&#39;t have to live in the grumpy shadows.  You can start to want  <br/>\nand be sunshine without even taking a step in any direction.  It&#39;s  <br/>\njust thoughts.<br/>\n<br/>\n-=-I can&#39;t help feeling that it is so unnecessary to spend so much  <br/>\nmoney on a child&#39;s birthday party.-=-<br/>\n<br/>\nDo you want to live in that narrow channel of &quot;necessary&quot;?<br/>\nWhat about &quot;possible&quot;?<br/>\nWhat about just making a decision because it&#39;s fun?<br/>\n<br/>\nDid the kids have fun in that bouncy castle?  It&#39;s not clear whether  <br/>\nyou were there or you just heard about it later.<br/>\nIf you were there, did you watch the kids and hear their excitement?<br/>\n<br/>\nSometimes I&#39;ve felt jealousy about something my kids get to do, but  <br/>\nit&#39;s fleeting and I recognize it.  I&#39;ve seen in strong in  my  <br/>\nhusband, but after a few years he started recognizing what it was and  <br/>\nmoving past it too.  Some parents just live there, and resent  <br/>\nanything their children get to do or have or be.  It will stunt you,  <br/>\nit will not enlarge you.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/respect\">http://sandradodd.com/respect</a><br/>\n<br/>\nGenerosity is good.<br/>\nNeediness is not as good.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Feeling brave already - looking for input here.","postDate":"1136140828","msgId":23651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCQkVEMzJCLUFCNDItNENCNS1BNTYwLTVEM0NFMkFGMTVFOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDYwMTAxMTc1MTI5LjY1MDAucW1haWxAd2ViMzEzMDYubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PDIwMDYwMTAxMTc1MTI5LjY1MDAucW1haWxAd2ViMzEzMDYubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":23644,"nextInTopic":23657,"prevInTime":23650,"nextInTime":23652,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"Do you have just the one child? Are you perhaps feeling that he might be spoiled by all the attention and having more material goods than what you, yourself,","messageBody":"<div id=\"ygrps-yiv-2070232054\">Do you have just the one child? Are you perhaps feeling that he might  <br/>\nbe &quot;spoiled&quot; by all the attention and having more material goods than  <br/>\nwhat you, yourself, had? Could you be slightly envious, even?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   Whenever I attend a child&#39;s birthday party, I often leave feeling  <br/>\n&gt; that I am the only one in the world who feels that children can  <br/>\n&gt; have fun without involving a lot of money. It seems like everything  <br/>\n&gt; in the world has been commercialized....hmmm, I can&#39;t seem to avoid  <br/>\n&gt; it, and yet I feel can&#39;t just accept it.<br/>\n<br/>\n </span></blockquote>In a way, I agree with you. But much of that commercialization is in  <br/>\nthe attitude, not in the &quot;things&quot; themselves. I&#39;m sorry when I see  <br/>\nparents giving their kids lots of things &quot;in place of&quot; their time and  <br/>\nattention and energy, yes. But, on the other hand, if we&#39;ve got money  <br/>\nand can spend it on things that make our kids&#39; lives better, then I  <br/>\ndon&#39;t see that as a negative. For example, a bounce house is SO much  <br/>\nfun for kids - and they aren&#39;t that expensive these days, to rent.  <br/>\nJust because it is something &quot;paid for,&quot; don&#39;t condemn it - think  <br/>\nabout &quot;it&quot; - kids jumping and jumping and jumping for hours together  <br/>\nwith friends. Think of all the fun they&#39;re having together.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;   I would like to know how others feel about this and am looking  <br/>\n&gt; for any suggestions for dealing with it, or at least dealing with  <br/>\n&gt; my feelings regarding it.<br/>\n<br/>\n </span></blockquote>You sound kind of puritanical about it. Like you&#39;re negative about it  <br/>\njust BECAUSE it cost money and isn&#39;t &quot;necessary.&quot; Is &quot;necessary&quot;  <br/>\ngoing to be your criterion for judging the value of things your child  <br/>\nmight enjoy? Do you tell your child things like: &quot;No, you don&#39;t need  <br/>\na cookie?&quot;  I know someone like this - she&#39;s constantly saying her  <br/>\nchild doesn&#39;t &quot;need&quot; this or that. She seems EXTREMELY controlling  <br/>\nand, to be honest, very stingy and not very enjoyable. I spend as  <br/>\nlittle time with her as possible because I can feel her judging eyes  <br/>\non me - thinking that I&#39;m too extravagant, too willing to satisfy  <br/>\nwhat she thinks are &quot;just&quot; children&#39;s whims. What &quot;I&quot; think is that  <br/>\nwe&#39;re full of the love of life and what we enjoy, we enjoy with gusto.<br/>\n<br/>\nMy kids had birthdays when we paid to take them and a bunch of  <br/>\nfriends to a local kiddie amusement park and other years where we  <br/>\ninvited a few friends over and the kids played with dress-ups.  <br/>\nDepends on the kid - on how THEY felt like celebrating their own  <br/>\nbirthdays.<br/>\n<br/>\nSometimes it is really FUN to have a lot of presents to open, too.  <br/>\nThat wonderful feeling of being wealthy is great - why not let a kid  <br/>\nexperience that? What are you afraid might result from that?<br/>\n<br/>\n  I have a friend who had her child open gifts AS the person arrived  <br/>\nat their house for the party - that way each gift was opened by  <br/>\nitself - it wasn&#39;t just one of a big stack - and her child could take  <br/>\ntime to more personally thank the gift giver, not be rushing to open  <br/>\nthe next one. I liked that - made each gift seem more special. In  <br/>\ntheir case, people were not all arriving at the same set time for the  <br/>\nparty - so that worked well.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194874034,"authorName":"Marianne Pfister","from":"Marianne Pfister &lt;allowinglife@...&gt;","profile":"allowinglife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Feeling brave already - looking for input here.","postDate":"1136137889","msgId":23644,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDYwMTAxMTc1MTI5LjY1MDAucW1haWxAd2ViMzEzMDYubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":23651,"prevInTime":23643,"nextInTime":23645,"topicId":23644,"numMessagesInTopic":0,"msgSnippet":"A friend of mine had a birthday party for her son this weekend and I was shocked to find out that she had rented one of those big blow up bouncy castles. (Her","messageBody":"<div id=\"ygrps-yiv-617315254\">A friend of mine had a birthday party for her son this weekend and I was shocked to find out that she had rented one of those big blow up bouncy castles. (Her son turned five.)  I can&#39;t help feeling that it is so unnecessary to spend so much money on a child&#39;s birthday party. Receiving 10 toys at one time also seems like a bit much.  I think part of my problem is due to the fact that since I grew up with 8 people in my family, we never needed &quot;friend&quot; birthday parties. We just didn&#39;t have them. In addition, we would only receive one gift.<br/>\n   <br/>\n  Whenever I attend a child&#39;s birthday party, I often leave feeling that I am the only one in the world who feels that children can have fun without involving a lot of money. It seems like everything in the world has been commercialized....hmmm, I can&#39;t seem to avoid it, and yet I feel can&#39;t just accept it. <br/>\n   <br/>\n  I would like to know how others feel about this and am looking for any suggestions for dealing with it, or at least dealing with my feelings regarding it.<br/>\n   <br/>\n  ~ Marianne<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nYahoo! Photos<br/>\n Ring in the New Year with Photo Calendars. Add photos, events, holidays, whatever.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":23694,"nextTopicId":23739}}