{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":46,"messages":[{"userId":175882957,"authorName":"MomandMe2@aol.com","from":"MomandMe2@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Allowances, spending money, etc.","postDate":"1088179203","msgId":95914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3LjJkNzcwZDhiLjJlMGRhNjAzQGFvbC5jb20+"},"prevInTopic":95911,"nextInTopic":95915,"prevInTime":95913,"nextInTime":95915,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"Hello everyone.  I recently joined the group, and have been reading posts eagerly for several weeks now.  My name is Emily and I am currently homeschooling ","messageBody":"<div id=\"ygrps-yiv-243781498\">Hello everyone.  I recently joined the group, and have been reading posts <br/>\neagerly for several weeks now.  My name is Emily and I am currently homeschooling <br/>\n(leaning and learning more on unschooling) for some time now.  My children <br/>\nare Joshua who&#39;s 8 (close to 9) and Stephanie who is 3 (close to 4).  Both bdays <br/>\nare at the end of summer. <br/>\nThe latest topics on the list have had me very eager to respond, but being <br/>\nthat the custom and request is for new members to read for several weeks, I have <br/>\nbeen biding my time.  <br/>\nThe more I read, however, the more I realize that my natural instincts in <br/>\nparenting, since my son was born, truly matches much of what I&#39;ve learned about <br/>\nunschooling families.  And, yet, I&#39;ve only recently learned of that <br/>\nterminology.  It&#39;s great to realize I have not been alone in how I&#39;ve always felt most <br/>\ncomfortable in raising my children.  Meaning ... allowing them their freedom in <br/>\ngrowing and learning, rather than restricting them simply because it&#39;s how <br/>\n&quot;everyone else has been raised.&quot;  <br/>\nI&#39;ve often been criticized, lectured, and sneered at for what I believe, but <br/>\nrarely let it effect me.  But the funny thing is, many of the people who have <br/>\ndone this, eventually tell me that my children are considerably &quot;brighter,&quot; <br/>\nand &quot;more socially well behaved&quot; than the majority of other kids they have come <br/>\nacross.  (Please note, I am quoting specific comments that I&#39;ve heard more <br/>\nthan once from people)<br/>\nAnyway... I&#39;ve been wanting to comment myself, on the latest topic of <br/>\ndiscussion here.  About allowances, spending money and such.  <br/>\nMy children are young, and often have the &quot;gimmes&quot; and &quot;I wants.&quot;  But coming <br/>\nfrom a one income family we live on a tight budget.  From the time my son was <br/>\nborn, I&#39;ve always believed in being very honest and open with him and then my <br/>\ndaughter.  Especially about money and finances.  My parents always kept <br/>\nincome and finances some sort of sacred secret, and that left me in the dark once I <br/>\nwas adult and on my own.  Therefore, I&#39;ve had to learn as I go ... which was <br/>\ndifficult.  I didn&#39;t want the same for my kids ... but my honesty goes with <br/>\nall topics, not just money.  Anyhow, what I find myself doing with my kids is <br/>\nbeing honest, and allowing them to help me with bills and shopping, rather than <br/>\njust saying &quot;bills need to be paid, so we have no extra money.&quot;  Every pay day <br/>\nis &quot;running&quot; day for us.  And being that the kids are home with me, this <br/>\nmeans they go with me to do this.  I find the fact that they must do the traveling <br/>\nmeans their day is being effected and disrupted so instead them being bored, <br/>\nand miserable, they become a part of the day and responsibilities.  And of <br/>\ncourse, they love to be helpers, so I allow them to do just that. Being that my <br/>\ndaughter is only 3, she likes to help me make my daily lists.  She &#39;writes&#39; the <br/>\nlists, and then tells me what&#39;s on them.  This may be for where we need to <br/>\ngo, and is also for the groceries.  I always try to keep mental note of what she <br/>\ntells me is on there so that I can be sure to accommodate some of what she <br/>\nputs.  Such as carrots and dip (her favorite) or brownies, or what type of juice <br/>\nshe wants.  This allows her to feel important and an active and appreciated <br/>\npart of the family and decision making.  My son, being older helps me with the <br/>\nmath part of things a lot.  After going to the bank he&#39;ll keep a notebook and <br/>\npen with him.  He&#39;ll write down the money amount we are beginning with ... and <br/>\nafter each stop and bill paid, he&#39;ll subtract what we spent for me.  This <br/>\nallows him to truly visualize and understand where the money goes, and why.  We <br/>\nalways discuss what&#39;s being paid, and why it&#39;s important and/or necessary for <br/>\neach thing paid.  Such as, electric bill, or phone bill, or rent.  The last <br/>\nstop we always make is the grocery store.  He already knows ahead of time what <br/>\namount of money is left for shopping, since he did the math along the way.  As <br/>\nwe shop with our list (Stephanie&#39;s in hand also) both kids will help choose the <br/>\nitems and put them in the cart.  Yes, we have a list, but the list may simply <br/>\nsay &quot;cereal,&quot; so they can pick which type they want.  Or it may say &quot;yogurt&quot; <br/>\nso they can pick their favorite flavors.  This also allows them to feel <br/>\nappreciated.  After all, they are human, and have likes, dislikes, and emotions <br/>\nalso!  I&#39;ve always resented those who demand children &quot;must eat what&#39;s made, like <br/>\nit or not,&quot; or the comment &quot;it&#39;s what was made and you will sit there until <br/>\nyour plate is cleared.&quot;  I have NEVER expected such things from my kids, and <br/>\nalways shop keeping in mind what they do or do not like.  If they do not like <br/>\nbeef stew (which they don&#39;t), when I make it, I will always accommodate something <br/>\nseparate for them.  Well, my point is, I keep my kids, even the youngest, <br/>\ninvolved.  I allow them to make their choices and give their input.  But I also <br/>\nhave them help me, so they gain an understanding of where the money goes.  So <br/>\nthere is never empty comments of &quot;we don&#39;t have the money.&quot;  My son especially <br/>\nnow has a very mature understanding of what &quot;bills need paying&quot; means.  He <br/>\nsees, on paper, how the money dwindles down each week.  We discuss freely the <br/>\nimportance of what each bill paid is for.  He may not understand yet the <br/>\ncomplications ... but he knows we cannot drive our car unless we pay to keep that <br/>\nlicense plate on it and the car insurance paid.  &quot;What insurance?&quot; he asks.... I <br/>\nkeep it simple, I say, &quot;Insurance is so that if there is a car accident, the <br/>\ninsurance company helps pay for the expensive damages and/or doctor bills.&quot;  The <br/>\nphone bill needs to be paid so that we can have the phone to keep in touch <br/>\nwith friends and family.  Cable bill ... well, you have your favorite shows, and <br/>\nwe have ours.  If I don&#39;t pay for the cable, we will not be able to watch <br/>\nthem. <br/>\nI know I&#39;ve written SO much here, and I apologize if this is too long for <br/>\nsome to want to read.  But I just had one more comment I&#39;d like to make. <br/>\nSomeone made comment about using worldly comparisons to make kids <br/>\n&quot;appreciate&quot; their lives.  This is something I would and have never done.  My thoughts on <br/>\nthis is that few people are better off than anyone else, because money and <br/>\nmaterial things do not buy happiness.  Perhaps people in 3rd world countries do <br/>\nnot have the modern technology America does.  But why on earth would that make <br/>\n&quot;us&quot; better than them?  If it&#39;s all they&#39;ve known, and it&#39;s the only life <br/>\nthey&#39;ve lived, they may not know of, or resent our modernization&#39;s.  Of course, <br/>\nwithout doubt, there is poverty and starvation over seas ... but ya know ... <br/>\nthere is PLENTY of that in America also.  We never compare, but we do help!  <br/>\nTHAT is something that makes my son come to me on his own and say, &quot;Mommy, I <br/>\nreally feel sad for them, we are lucky we have all our toys, clothes, food, etc.&quot; <br/>\nWe give to food shelters, donate old clothes and toys to abuse shelters, <br/>\nhomeless shelters, and things such as that.  My son will pack boxes and go through <br/>\nhis dresser and closet and toy boxes once a month to donate.  They go with me <br/>\nto drop the things off.  Always a companion, never a &quot;tagalong.&quot;<br/>\nThanks for all who took the time to read this mini-novel. (hehehe) I look <br/>\nforward to continuing reading, and perhaps making some new friends and confidants <br/>\nhere.  <br/>\nSincerely, <br/>\nEmily<br/>\nWife to Chris, Mom to Joshua (8), Stephanie (3)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Allowances, spending money, etc.","postDate":"1088131522","msgId":95911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM4LjQ5MjVjNjBjLjJlMGNlYmMyQGFvbC5jb20+"},"prevInTopic":95910,"nextInTopic":95914,"prevInTime":95910,"nextInTime":95912,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/24/2004 10:36:53 PM Eastern Daylight Time, hayes@metrocast.net writes: We ve  already worked out a few ideas and we ll see how they go! ","messageBody":"<div id=\"ygrps-yiv-386386662\">In a message dated 6/24/2004 10:36:53 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hayes@...\">hayes@...</a> writes:<br/>\n<br/>\nWe&#39;ve  already worked out a few ideas and we&#39;ll <br/>\nsee how they go!<br/>\n<br/>\nKristi  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nMy little neighbor girl is recently turned five.  She sometimes comes  and <br/>\nwants to &quot;help&quot; me do stuff.  She pulls weeds with me in my flower  beds.  She <br/>\nLOVES to run the vacuum (even though to me it seems bigger than  her!).  She <br/>\nloves putting her hands in soapy water and washing  dishes.<br/>\n <br/>\nShe recently told me quite matter of factly that she is now &quot;grown&quot; and  does <br/>\nALL the cooking and cleaning at her house, she&#39;s even allowed to use a  <br/>\nknife!  I had to laugh.  I was peeling potatoes and she wanted to do  it for me!<br/>\n <br/>\nOf course at her house, those things aren&#39;t nearly as attractive to do as  at <br/>\nmy house.  Maybe because I have no other small children and I have  patience <br/>\nand time to wait patiently while she does this &quot;work&quot;.<br/>\n <br/>\nI always send her home with a few dollars.  She feels very  proud.  If I know <br/>\nshe especially wants something, I usually pick it up for  her.  <br/>\n <br/>\nI know some people think it&#39;s odd or unusual for a five year old to &quot;work&quot;  <br/>\nbut I think a lot of it is just being listened to and responding to her and  <br/>\nenjoying her company that makes her want to do this so much.  I don&#39;t think  she <br/>\nhas a lot of interaction with her mother.  I do know one Grandmother is  very <br/>\nhands on, but of course would never let a &quot;toddler&quot; do &quot;work&quot;.<br/>\n <br/>\nMaybe your daughter can find an adult lady to &quot;help out&quot; and  befriend.  It <br/>\ncould be beneficial in many ways to both of them.<br/>\n <br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142002410,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;hayes@...&gt;","profile":"morgainesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Allowances, spending money, etc.","postDate":"1088128692","msgId":95910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiZzByaytiNjJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDQwNjI0MTUzOTQ5LjE5OTk5LnFtYWlsQHdlYjIwNzA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":95908,"nextInTopic":95911,"prevInTime":95909,"nextInTime":95911,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... This is a large part of my problem with my daughter.  (And, probably soon, my middle child as well, since he keeps on growing -- LOL!)  I can t just say","messageBody":"<div id=\"ygrps-yiv-1679375470\"><blockquote><span title=\"ireply\">&gt;It&#39;s a big difference to say &quot;I have no money&quot; and &quot;I have allocated <br/>\n&gt;my money elsewhere&quot;...  Am I wrong?<br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>This is a large part of my problem with my daughter.  (And, probably <br/>\nsoon, my middle child as well, since he keeps on growing -- LOL!)  I <br/>\ncan&#39;t just say &quot;we can&#39;t afford that.&quot;  Instead, when she wants <br/>\nsomething, I explain that it costs money and we don&#39;t have alot of <br/>\nmoney.  -why? -well, Mommy quit her job so that .... -why do we need <br/>\nmoney? -insert explanation with way too much info here. -I wish Daddy <br/>\ncould stay home too. -conversation about this. <br/>\n<br/>\nThere are variants to this conversation, far too many to list, and <br/>\nshe understands our desire to get a house; the trailer park we live <br/>\nin just made us get rid of some of our outdoor toys, she wants a pool <br/>\nand some personal space that she&#39;s not sharing with her baby <br/>\nbrothers, etc.  But I just feel that I&#39;m immersing her in adult <br/>\nconcerns at a young age (4.5), and she&#39;s a very sensitive little <br/>\nperson; I&#39;m concerned that I may be transferring my general anxiety <br/>\nabout finances to her by being forthright and showing her how many <br/>\ndifferent bills we&#39;re paying right now.  If she has a few ready ways <br/>\nto make money, though, I can skip this part of the conversation and <br/>\ngo to, &quot;I want xyz.&quot;  &quot;OK!  Let&#39;s make a plan to pay for it.&quot;  <br/>\nUnfortunately Dan and I are pretty much stretched as far as we can <br/>\ngo, definitely past our comfort lines.  And it seems wrong to me <br/>\nsometimes to suggest to a 4yo to make her own money tp meet her <br/>\nwants, but I think it will give her the option to step outside our <br/>\ntight, frugal lifestyle if she wants.  Physically, she gets what she <br/>\n*needs,* but then I feel sometimes that she also *needs* certain <br/>\nthings to make her feel more comfortable inside this world (like a <br/>\nchild who wants brand name shoes even though second hand shoes do the <br/>\nsame physical job).  We&#39;ve already worked out a few ideas and we&#39;ll <br/>\nsee how they go!<br/>\n<br/>\nKristi <br/>\n<br/>\nKristi</div>","specialLinks":[]},{"userId":184936771,"authorName":"Ali Kat","from":"Ali Kat &lt;sweetgypsiedncer@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Allowances, spending money, etc.","postDate":"1088091589","msgId":95908,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjI0MTUzOTQ5LjE5OTk5LnFtYWlsQHdlYjIwNzA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDFhOC4yNTMyNzQ2Mi4yZTBiNWYxNUBhb2wuY29tPg=="},"prevInTopic":95904,"nextInTopic":95910,"prevInTime":95907,"nextInTime":95909,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"I guess that does sound selfish and lazy.  I feel like a horrible person now!  Most times we do put the toys back, but sometimes we don t.  I meant no offense,","messageBody":"<div id=\"ygrps-yiv-805669996\">I guess that does sound selfish and lazy.  I feel like a horrible person now!  Most times we do put the toys back, but sometimes we don&#39;t.  I meant no offense, and certainly have never meant to selfishly place a burden on any cashier.  I was a cashier at one time, and just saw it as part of my job and was glad to be of service to folks - it also gave me some time away from the register to reshelve things and learn the layout of the store so I could better direct people.  I guess I have been looking through the wrong glasses though...       <br/>\n <br/>\nMy daughter started walking at 6 months of age (walking - not cruising) - and pretty much hated being confined in a stroller or shopping cart.  Additionally, her fine motor skills were such that she could work buttons, buckles, snaps and ties better than even I could.  She is a regular Houdini at times.  She wanted to be up walking and running.  She is intense, active, and curious.  While that is good and I have encouraged it (and part of the reason I&#39;ve kept her from school so it would not be squashed), it can be dangerous in some situations - especially at such a young age.  <br/>\n <br/>\nWe have had and continue to have intense converstions while shopping or otherwise.  I used the toys as a tool to keep her from running off and hiding under racks, slipping down ailses, standing up in the cart and falling out, or from being snatched by someone.  I am human and one person and when you are looking on a shelf it can be quite easy for such a wee one to get away from you.  At least, in my experience it can be.  I am a full-time working single mom, and while shopping is necessary, it isn&#39;t something I like to spend a lot of time doing.  I already feel guilty that I am not home with my daughter, and so I like to spend our time differently - doing things she truly enjoys.  I make it as pleasant as possible, take time where needed, but since neither my daughter or I are the &quot;shopper&quot; types we don&#39;t spend much time in a store.  Her brain goes so fast and furious that she is easily bored, so I have used toys to occupy her.  The only exception is the material department at<br/>\n Wal-Mart where my daughter and I spend time selecting fabrics for her to sew with since that is a high interest to her.  <br/>\n<br/>\nPast tense &quot;found&quot; because it was something I &quot;found&quot; in the past - discovered, learned, realized...  I apparently was not clear that I was remarking on the part where the previous writer said someone said &quot;We are broke&quot; and meant &quot;I don&#39;t want to spend money on that&quot;.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;I think having the flexibility to do what seems best outweighs clinging to an artibitrary decision for the sake of &quot;consistency.&quot;   I consistently tried to be flexible and compassionate.  Others around me made a priority of &quot;doing <br/>\n </span></blockquote>what they said&quot; without correspondingly being extra careful what they promised/threatened/claimed.    <br/>\n<br/>\nThey tied their own hands with the hope that &quot;consistency&quot; would be the thing <br/>\nthat would make them good moms and their kids contented.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;<br/>\n <br/>\n <br/>\n </span></blockquote>Forgive me, I am unsure what you mean by all this.  I think I am misreading your comments, or perhaps it is because I did not provide clarity in my post for you.  <br/>\n <br/>\nI have flexibility in plans, etc...  I am ADD... I was born with flexibility, and consistency is hardly used to describe my life... LOL.  Saying what you mean and meaning what you say is simply choosing words carefully.  i.e. my sister moved in with us for a short time and ran up a $300 phone bill.  I asked her to pay it.  She said &quot;I have no money - I&#39;m broke.&quot;  What she meant was &quot;I am planning on taking a two week vacation and treating my boyfriend to a trip to Chicago to see 2 concerts and spending my money there&quot; etc...  It&#39;s a big difference to say &quot;I have no money&quot; and &quot;I have allocated my money elsewhere&quot;...  Am I wrong?<br/>\n <br/>\nAs far as promises, I try not to say &quot;I promise&quot; unless I can be as sure as possible that I can fulfill those promises.  I also try not to say that we have certain activities planned, etc... because this is life.  Things happen, plans change, something better or more important can come up.  Like the time we planned on attending a big tea party, but I fell down the back steps and broke my arm - we spent all day at the ER instead of the tea party... or the time we planned to go to the drive-in but Bekka was beyond crabby an hour before we were to leave, ended up crawling in bed and falling asleep.  I thought it wiser to reschedule than to try to drag a sleeping child to a drive-in that she wouldn&#39;t enjoy or remember.  Also, I may plan yardwork, but an opportunity may come up to go tadpole hunting or bike riding, or Bekka would like to show me her new play... quite frankly, the yard can wait! (well... at least until the city is knocking on the door - gotta love neighbors)<br/>\n <br/>\nI hope I have not come off with an attitude... I know this online communication can be a challenge, and I will try harder to clarify more in the future.  Thank you for your patience with me.  Also, if I have misunderstood or have skewed perceptions please tell me.  I appreciate it very much, as I am still learning, and I realize that I can be selfish and simply not pay attention to life or people around me.<br/>\n <br/>\nAlicia  <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail Address AutoComplete - You start. We finish.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Allowances, spending money, etc.","postDate":"1088037543","msgId":95904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxLjNmZmRjMTcxLjJlMGI3Y2E3QGFvbC5jb20+"},"prevInTopic":95903,"nextInTopic":95908,"prevInTime":95903,"nextInTime":95905,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/23/04 6:22:29 PM, kate@sitzman.net writes: ","messageBody":"<div id=\"ygrps-yiv-745622621\">In a message dated 6/23/04 6:22:29 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kate@...\">kate@...</a> writes:<br/>\n<br/>\n&lt;&lt; but<br/>\njust so you know, there is no bad karma for leaving it with the checker -<br/>\nand it&#39;s easier for the store than if you put it back in the wrong place. &gt;&gt;<br/>\n<br/>\nWe never put things in the wrong place.<br/>\nI don&#39;t want to model for my kids that it&#39;s okay to make work for people <br/>\nunnecessarily.<br/>\n<br/>\nPeople from NYC who have moved here tend to do things like that, and it&#39;s <br/>\noffensive to the locals.  <br/>\n<br/>\n-=-Consistency is often just an unwillingness to look at something from<br/>\n<br/>\nanother&#39;s point of view. . . . Showing our kids flexibility, listening to <br/>\nthem,<br/>\n<br/>\nadapting old ideas to new situations not only makes for a better<br/>\n<br/>\nrelationship but I think it models &quot;learning skills&quot; well too.-=-<br/>\n<br/>\nI think some people think if they don&#39;t stick to their consistency, they&#39;ll <br/>\nbe wishy-washy, or have no basis for decision making.  But if principles are <br/>\nstrongly in place, that&#39;s how decisions are made.   <br/>\n<br/>\nPeople who haven&#39;t thought a whole lot about it can seem to think either the <br/>\nparent is in charge, and calling all shots, or the kid is in charge, and <br/>\ncalling all shots.  There&#39;s a universe in between those two theoretical points.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":139187074,"authorName":"Julie","from":"&quot;Julie&quot; &lt;mjsolich@...&gt;","profile":"foxymophandlemama32","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Allowances, spending money, etc.","postDate":"1088036272","msgId":95902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDEwMWM0NTk4MCRiMjI0ODQwMCQ5ZDY4MzJkMkB5MmYwbzQ+","referencesHeader":"PDFhOC4yNTMyNzQ2Mi4yZTBiNWYxNUBhb2wuY29tPg=="},"prevInTopic":95901,"nextInTopic":95903,"prevInTime":95901,"nextInTime":95903,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... I love this Sandra. What our kids need to know is that we love them and how they feel does matter to us. Consistency is often just an unwillingness to look","messageBody":"<div id=\"ygrps-yiv-2136186361\"><blockquote><span title=\"ireply\">&gt;&gt;I consistently tried to  be flexible and compassionate. &gt;&gt;<br/>\n<br/>\n </span></blockquote>I love this Sandra. What our kids need to know is that we love them and how<br/>\nthey feel does matter to us.<br/>\n<br/>\n Consistency is often just an unwillingness to look at something from<br/>\nanother&#39;s point of view. I said this and I&#39;m sticking to it no matter what.<br/>\nAll that really does is show our kids that how they feel and what they think<br/>\nis unimportant to us. I think too that that attitude is a big obstacle to<br/>\nlearning new things. Showing our kids flexibility, listening to them,<br/>\nadapting old ideas to new situations not only makes for a better<br/>\nrelationship but I think it models &quot;learning skills&quot; well too.<br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":121772804,"authorName":"Kate Sitzman","from":"&quot;Kate Sitzman&quot; &lt;kate@...&gt;","profile":"kate_sitzman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re: Allowances, spending money, etc.","postDate":"1088035789","msgId":95903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjI0MDAwOS5pNU8wOXBRRjA3Mzc5OEBwcm94eTEuYWRkci5jb20+","inReplyToHeader":"PDFhOC4yNTMyNzQ2Mi4yZTBiNWYxNUBhb2wuY29tPg=="},"prevInTopic":95902,"nextInTopic":95904,"prevInTime":95902,"nextInTime":95904,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-521510461\">&lt;&lt;  Not only did that help keep her occupied while I focused on getting the <br/>\nshopping done, but she would willingly give up the toy to the cashier as we <br/>\nleft.  &gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;We always put them back on the shelf ourselves.  In my view, asking the <br/>\n&gt;&gt;&gt;&gt;employees to replace a toy we never meant to buy isn&#39;t cool.<br/>\n<br/>\n </span></blockquote>Veering OT here, but I recently put this question to my husband (who worked<br/>\ngrocery for over 10 years). He said stores are annoyed if you take a frozen<br/>\nitem and ditch it in the bakery section (thereby spoiling the item) but it<br/>\nis fine to ditch toys in the checkout. Stores understand that people with<br/>\nhappy kids shop longer and spend more money. If having an in-store toy makes<br/>\nyour child happy, they are generally pleased to accommodate you by<br/>\nre-stocking the item.  The basic rule of thumb is - will the item still be<br/>\nin sellable condition when they re-stock it? If yes, you are ethically in<br/>\nthe clear. If no (like when a toddler chews it up) you really ought to buy<br/>\nit. Obviously it is extra-considerate to put it back where you found it, but<br/>\njust so you know, there is no bad karma for leaving it with the checker -<br/>\nand it&#39;s easier for the store than if you put it back in the wrong place.<br/>\n<br/>\nKate</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Allowances, spending money, etc.","postDate":"1088029973","msgId":95901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhOC4yNTMyNzQ2Mi4yZTBiNWYxNUBhb2wuY29tPg=="},"prevInTopic":95900,"nextInTopic":95902,"prevInTime":95900,"nextInTime":95902,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/23/04 3:35:12 PM, sweetgypsiedncer@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-164729487\">In a message dated 6/23/04 3:35:12 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sweetgypsiedncer@...\">sweetgypsiedncer@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Not only did that help keep her occupied while I focused on getting the <br/>\nshopping done, but she would willingly give up the toy to the cashier as we <br/>\nleft.  &gt;&gt;<br/>\n<br/>\nWe always put them back on the shelf ourselves.  In my view, asking the <br/>\nemployees to replace a toy we never meant to buy isn&#39;t cool.<br/>\n<br/>\nFocussing on the kids, even when I was grocery shopping, really helped us in <br/>\nlots of ways.    We could talk about their day, or ideas, or about things at <br/>\nthe store, and slowing down to their pace and making being at the store as good <br/>\nas (better, often) being at a park or museum made it soothing instead of <br/>\njittery, and enjoyable for all of us (or most, and the kid having the least fun <br/>\nneeded the most attention).<br/>\n<br/>\n<br/>\n&lt;&lt;I found it very important to say what you mean and mean what you say...&gt;&gt;<br/>\n<br/>\nYou used past tense, &quot;found.&quot;  <br/>\nHave you changed your mind?<br/>\nAre your kids grown?<br/>\n<br/>\nI think having the flexibility to do what seems best outweighs clinging to an <br/>\nartibitrary decision for the sake of &quot;consistency.&quot;   I consistently tried to <br/>\nbe flexible and compassionate.  Others around me made a priority of &quot;doing <br/>\nwhat they said&quot; without correspondingly being extra careful what they <br/>\npromised/threatened/claimed.    <br/>\n<br/>\nThey tied their own hands with the hope that &quot;consistency&quot; would be the thing <br/>\nthat would make them good moms and their kids contented.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":184936771,"authorName":"Ali Kat","from":"Ali Kat &lt;sweetgypsiedncer@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Allowances, spending money, etc.","postDate":"1088017374","msgId":95900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjIzMTkwMjU0Ljc1MzM3LnFtYWlsQHdlYjIwNzAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNiOThnNStrNWJmQGVHcm91cHMuY29tPg=="},"prevInTopic":95888,"nextInTopic":95901,"prevInTime":95899,"nextInTime":95901,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"I pretty much did the same thing with my daughter.  I hate trying to say we don t have money for that etc...  or trying to explain it when I know she just","messageBody":"<div id=\"ygrps-yiv-2060961467\">I pretty much did the same thing with my daughter.  I hate trying to say &quot;we don&#39;t have money for that&quot; etc...  or trying to explain it when I know she just doesn&#39;t get it.  She doesn&#39;t care that the electric bill needs paid, all she knew was that you hit the switch and get light...<br/>\n <br/>\nI would try to accomodate some of her smaller requests when possible - i.e. bubbles, cheap puzzle or game, 50 cents for the silly gum/toy machines at the checkouts... stuff like that.  That way, I wasn&#39;t always saying &quot;no&quot;, and I wasn&#39;t saying &quot;yes&quot; to stuff we really couldn&#39;t afford.  <br/>\n <br/>\nWhen we went to the store, we usually would head for the toy aisles first... I would tell DD that we were not buying any toys today, but she could pick out 1 or 2 to play with as we shopped, and that she&#39;d have to give them to the cashier when we left.  Not only did that help keep her occupied while I focused on getting the shopping done, but she would willingly give up the toy to the cashier as we left.  I think there was only one time that she started to fuss and I told her that if she fussed then she wouldn&#39;t get to play with a toy next time.  Worked for me - and of course I meant it... I found it very important to say what you mean and mean what you say...<br/>\n <br/>\nGood luck<br/>\n <br/>\nAlicia<br/>\n<br/>\n<br/>\neriksmama2001 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:scubamama@...\">scubamama@...</a>&gt; wrote:<br/>\nAnother approach is to write down what he wants. I remember making a <br/>\nwish list for Christmas: EVERYTHING the Sears catalog had that I <br/>\nwanted was written down, with page number and item number. You know, <br/>\nhundreds of items! Obviously, I did not receive everything on my <br/>\nlists but writing it down made my desire more real and acknowledged. <br/>\nThis helped me to see the extent of my wishes and I could review it, <br/>\nchange my mind or decide something really was a high priority. And <br/>\nworth waiting for. Basically, I do this now too. We are renovating <br/>\nour house. I want everything (new roof, new heating/air, patio, new <br/>\nkitchen counters, new floors)....but this is not possible all at <br/>\nonce. And I change my mind. I mark things off the list as something <br/>\nmore important to me comes up. So, this is a useful tool in <br/>\nprioritizing our wants. This works the same when my 3 y/o wants to do <br/>\nx and y and z all right NOW! We have/get to choose what is most <br/>\nimportant. <br/>\n<br/>\nOften we have to wait for things we want....I get to model this all <br/>\nthe time. I tried to keep my wants non-verbalized, but I realized <br/>\nthat my child couldn&#39;t see me model waiting for things if I didn&#39;t <br/>\ntell him how I wanted things too and why I was wanting to wait (what <br/>\nI was doing/getting) instead.<br/>\n<br/>\nWe also give our 3 y/o money of his own (not attached to any behavior <br/>\nexcept that he is part of our family). When he wants something, I <br/>\nexplain why I do or don&#39;t want to buy it (plastic, limited use, <br/>\npoorly made...) but he can buy anything he wants with his money. <br/>\nSometimes I buy things for him because I want to. Sometimes he saves <br/>\nthe money for later. We decide to start when he asked for a $250 drum <br/>\nset. (he has a small, cheaper set already) He gets $5 a week. He has <br/>\nsaved a lot so far. He wants the drums. Most weeks, it is at the top <br/>\nof his list.<br/>\n<br/>\nI suggest toys that I think look interesting. However, he frequently <br/>\nsays &quot;I don&#39;t want anything today&quot;. Anything that he does want to <br/>\ntouch or hold in the store I try to facilitate. This alone seems to <br/>\nbe the key for us though. Usually, he just wants to touch and see <br/>\nthings up close. Then I ask &quot;are you done holding it?&quot; and we put it <br/>\nback. We go to the drum store and touch ALL of them, and touch all of <br/>\nthe guitars...everything. This outing alone is worth owning any one <br/>\nthing from the store. We go several times a month, cheap fun.<br/>\n<br/>\nHope this helps.<br/>\n<br/>\nPat<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;mamaaj2000&quot; <br/>\n&lt;mamaaj2000@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n&gt; &gt; My kids aren&#39;t needy of stuff, and I&#39;m not sure of all the <br/>\n </span></blockquote>reasons <br/>\n<blockquote><span title=\"ireply\"> &gt; for it, but because of that, we negotiate each request on its <br/>\n </span></blockquote>merits <br/>\n<blockquote><span title=\"ireply\"> &gt; in the full context of need, interest, benefit, sharability <br/>\n&gt; (sometimes that&#39;s a cool aspect, if lots of other people can <br/>\n </span></blockquote>benefit <br/>\n<blockquote><span title=\"ireply\"> &gt; too)...<br/>\n&gt; to me.<br/>\n&gt; <br/>\n&gt; My son (3.5 y o) is very needy of stuff and I&#39;m trying to figure <br/>\n </span></blockquote>out <br/>\n<blockquote><span title=\"ireply\"> &gt; how to respond to that. He doesn&#39;t get money really yet. If I say <br/>\n&gt; something is too expensive, he suggests we buy it for $1. Yeh, I&#39;d <br/>\n&gt; like to do that, but...<br/>\n&gt; <br/>\n&gt; I&#39;ve been thinking back to when I was a kid and I think he&#39;s a lot <br/>\n&gt; like me. Always wanting to look at catalogs, pick out the best of <br/>\n&gt; whatever, never satisfied with what I had, and so on. <br/>\n&gt; <br/>\n&gt; I don&#39;t really know how to respond to him. When we get a new Thomas <br/>\n&gt; toy and he plays with it for ten minutes and then spends an hour <br/>\n&gt; looking at the catalog that came with it...and is upset that I <br/>\n </span></blockquote>won&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; take him right back out to the store, etc. I&#39;m not telling him to <br/>\n </span></blockquote>put <br/>\n<blockquote><span title=\"ireply\"> &gt; the catalog down and play, damn it, but I worry (quietly, I hope) <br/>\n&gt; about how happy he is and will be. I am happier now that I&#39;m less <br/>\n&gt; materialistic, but I didn&#39;t learn that until my 30&#39;s! <br/>\n&gt; <br/>\n&gt; There is a positive side, I know, to the relentless search for <br/>\n </span></blockquote>more, <br/>\n<blockquote><span title=\"ireply\"> &gt; for the best. And I know Mikey will learn math skills with no <br/>\n&gt; problem...my parents sent me to the store when I was 5 or 6 and <br/>\n </span></blockquote>told <br/>\n<blockquote><span title=\"ireply\"> &gt; me I could buy a treat with the change. I bought the milk or <br/>\n&gt; whatever, then went back and bought a big container of cookies and <br/>\n&gt; came home with 1 cent!<br/>\n&gt; <br/>\n&gt; Anywho, I&#39;d love to hear perspectives on this. I sense that I&#39;m to <br/>\n&gt; close to the situation and too worried to really think about it <br/>\n&gt; objectively.<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; aj<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nYahoo! Groups Links<br/>\n<br/>\n   To visit your group on the web, go to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n  <br/>\n   To unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n  <br/>\n   Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail - 50x more storage than other providers!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142002410,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;hayes@...&gt;","profile":"morgainesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Allowances, spending money, etc.","postDate":"1087961264","msgId":95886,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiYXRiZytxbnVuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PERGMDc2NDJBLUM0NkQtMTFEOC1CMDUzLTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":95882,"nextInTopic":95888,"prevInTime":95885,"nextInTime":95887,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"Thanks everyone for your input about this!  I ve decided to offer to Morgaine that she can make things to sell on the website I m putting up if she wants, and","messageBody":"<div id=\"ygrps-yiv-239817636\">Thanks everyone for your input about this!  I&#39;ve decided to offer to <br/>\nMorgaine that she can make things to sell on the website I&#39;m putting <br/>\nup if she wants, and so far she&#39;s declined.  I&#39;ve started asking her <br/>\nat the beginning of each outing if she wants to bring money from her <br/>\npiggy bank, since I dislike always making her put off purchases, and <br/>\nshe usually says No, and is asking less often.  I&#39;m wondering if my <br/>\nattitude about money is making her want to horde, but I&#39;m not sure <br/>\nwhat to do about that.  I am extremely tight with our money, right <br/>\nnow we are paying off debt and hoping to sell our trailer and move <br/>\nwithin three years (when baby will certainly be moving out of our <br/>\nroom and the three kids will be sharing a little bedroom).  They <br/>\ncould continue sharing a room, but I expect that by the age of 7 or <br/>\n8 they&#39;ll want some more space of their own. <br/>\n<br/>\nAs far as the comments from my Mom about dance, I should have been <br/>\nmore clear -- my Mom wants Morgaine to take dance.  As soon as she <br/>\nwas potty trained at 25 months, my mother enrolled her in dance.  <br/>\nOrion loves to dance and also wants to do it, and my mother doesn&#39;t <br/>\nthink boys should dance, so will only pay for Morgaine.  I stopped <br/>\nlessons just about the time baby was born, since Orion was crying <br/>\nthrough them and I couldn&#39;t give him such complete attention with a <br/>\nnewborn, and told my mom that she&#39;d need to send them both if she <br/>\nwanted to continue, or stop the lessons.  That&#39;s when she decided I <br/>\nshould pay for one child -- though Morgaine seems perfectly content <br/>\nwith what she calls &quot;homeschool dance class&quot; -- putting on music to <br/>\nsuit her mood and dancing at home for long stretches of time while I <br/>\nand her dolls act as the audience.  I&#39;m just frustrated by my mother <br/>\ntrying to create a need -- both for dance lessons as well as other <br/>\nthings -- for something that isn&#39;t there, and saying in front of the <br/>\nkids that now we can pay for it since Dan&#39;s getting a better job.  <br/>\nThe better job helps him not have to work 80 hour weeks to make ends <br/>\nmeet so he can be home to enjoy our family.  *Sigh*  Having parents <br/>\nliving nearby can be such a mixed blessing, much as we love them!<br/>\n<br/>\nAnyway, thanks again for the input and encouragement.  I really <br/>\nappreciated it. <br/>\n<br/>\nKristi <br/>\nmama to Morgaine, 4.5, Orion, 2, and Isaac, 3.5 mo.</div>","specialLinks":[]},{"userId":87734814,"authorName":"Priscilla Martinez","from":"Priscilla Martinez &lt;ummhjm@...&gt;","profile":"ummhjm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"OT?? finishing our basement","postDate":"1087939839","msgId":95888,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjIyMjEzMDM5LjY0NDg5LnFtYWlsQHdlYjIwMjEwLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDQwNjIyMDEwNTAxLjM5MjI2LnFtYWlsQHdlYjYwODA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":95886,"nextInTopic":95900,"prevInTime":95887,"nextInTime":95889,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"howdy everyone! if sandra allows, i d like y all s input.  we re planning to finish our basement within the next year.  it s about 1200 square feet of space. ","messageBody":"<div id=\"ygrps-yiv-1157312730\">howdy everyone!<br/>\n<br/>\nif sandra allows, i&#39;d like y&#39;all&#39;s input.  we&#39;re planning to finish our basement within the next year.  it&#39;s about 1200 square feet of space.<br/>\n<br/>\nwhile i *definitely* do not believe in the school-at-home thing, and *definitely* plan to get our kids&#39; input, what i&#39;m looking for from y&#39;all would be the tried-and-true, it&#39;d-be-good-to-have, if-only-i-had kinda things.  (ie not specific suggestions, like a pottery wheel corner because someone&#39;s daughter/son like theirs -- i&#39;ll get specific input based on my kids and their interests, of course!)  any suggestions that would facilitiate our long-term unschooling approach is what i&#39;m looking for!<br/>\n<br/>\ni&#39;ve already figured out that we need lots of built-in storage space.  and that we need flexibility in the entire space.  and that we&#39;re not doing anything typical!  what i&#39;d really love is astrotuf floors, padded/paintable/staplable/pinable/chalkable/etc walls, and a gigantic drain in the middle of the floor so i can just hose-down whatever and whenever!  including the kids and myself!  lol!<br/>\n<br/>\nif this discussion needs to be off-list, then please email me directly at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ummhjm@...\">ummhjm@...</a> .  and, as always, even when i&#39;m on the receiving end of change-how-you&#39;re-thinking advice, i thank y&#39;all in advance because i so, so appreciate it!<br/>\n<br/>\n~peace, priscilla<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Allowances, spending money, etc.","postDate":"1087923717","msgId":95882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERGMDc2NDJBLUM0NkQtMTFEOC1CMDUzLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDE5NkIzMTQyLjMzODRBRjA0LjBDOEQ0NUE4QGFvbC5jb20+","referencesHeader":"PDE5NkIzMTQyLjMzODRBRjA0LjBDOEQ0NUE4QGFvbC5jb20+"},"prevInTopic":95881,"nextInTopic":95886,"prevInTime":95881,"nextInTime":95883,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... Ah - I d forgotten about this. I used to do that a lot when the kids were little enough to be in the cart. I d say, Do you want an in the store toy?","messageBody":"<div id=\"ygrps-yiv-1823385835\">On Jun 22, 2004, at 8:50 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sometimes having a toy in the cart, and the kid getting to hold it a <br/>\n&gt; while, and really examine it, was enough for mine.  THey&#39;d be fine <br/>\n&gt; with putting it back, or putting it on a list or things they might <br/>\n&gt; want for birthday or Christmas.  And lots of times I&#39;ve said &quot;We can <br/>\n&gt; get it if you want to,&quot; but they&#39;ll say &quot;No, that&#39;s okay.&quot;<br/>\n<br/>\n </span></blockquote>Ah - I&#39;d forgotten about this. I used to do that a lot when the kids <br/>\nwere little enough to be in the cart. I&#39;d say, &quot;Do you want an &quot;in the <br/>\nstore toy?&quot;&quot; They would pick out something to hold in the store and <br/>\nthen we&#39;d put it back at the end of the trip.<br/>\n<br/>\nIn the grocery store, my kids liked to play &quot;babies&quot; with bags of beans <br/>\nor rice. They&#39;d cradle the bag and sing to it and pat it and pretend it <br/>\nwas their baby.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Allowances, spending money, etc.","postDate":"1087920965","msgId":95880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiOW0wNStzZWk5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5NkIzMTQyLjMzODRBRjA0LjBDOEQ0NUE4QGFvbC5jb20+"},"prevInTopic":95879,"nextInTopic":95881,"prevInTime":95879,"nextInTime":95881,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... to ... Yeh... I think I ve been focusing on the money aspect and on the actual buying, including saying hurry up and pick something usually because","messageBody":"<div id=\"ygrps-yiv-1217091066\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; In a message dated 6/22/2004 8:25:41 AM Eastern Daylight Time, <br/>\n </span></blockquote>scubamama@e... writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &gt;  Anything that he does want to <br/>\n&gt; &gt; touch or hold in the store I try to facilitate. This alone seems <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; be the key for us though. Usually, he just wants to touch <br/>\n&gt; &gt; and see <br/>\n&gt; &gt; things up close.<br/>\n&gt; <br/>\n&gt; That&#39;s a really good point.<br/>\n<br/>\n </span></blockquote>Yeh...<br/>\n<br/>\nI think I&#39;ve been focusing on the money aspect and on the actual <br/>\nbuying, including saying &quot;hurry up and pick something&quot; usually <br/>\nbecause Caroline is getting fussy. But maybe I could do something <br/>\ndifferently, like instead of getting a toy while we&#39;re out shopping <br/>\nfor other things, Mikey and I could make a separate trip and spend <br/>\nmore time picking things out. <br/>\n<br/>\nI think I&#39;ll start talking to Mikey about the different things you <br/>\ncould do with $5...buy 5 things at the dollar store, 1 small toy, a <br/>\npresent for someone else, save it to buy something bigger next time, <br/>\netc. He&#39;d probably be fine if I just handed him $5 a week, but I need <br/>\nto work up to the hours of conversation about it!<br/>\n<br/>\nthanks,<br/>\naj</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Allowances, spending money, etc.","postDate":"1087920231","msgId":95881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiOWw5Nyt2cDlsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNiOThnNStrNWJmQGVHcm91cHMuY29tPg=="},"prevInTopic":95880,"nextInTopic":95882,"prevInTime":95880,"nextInTime":95882,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... a ... know, ... Oh, yes, I ve done this before, but not lately. I almost went nuts last year before Christmas listening to I want... all day everyday, ","messageBody":"<div id=\"ygrps-yiv-1297621908\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;eriksmama2001&quot; <br/>\n&lt;scubamama@e...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Another approach is to write down what he wants. I remember making <br/>\n </span></blockquote>a <br/>\n<blockquote><span title=\"ireply\"> &gt; wish list for Christmas: EVERYTHING the Sears catalog had that I <br/>\n&gt; wanted was written down, with page number and item number. You <br/>\n </span></blockquote>know, <br/>\n<blockquote><span title=\"ireply\"> &gt; hundreds of items!<br/>\n<br/>\n </span></blockquote>Oh, yes, I&#39;ve done this before, but not lately. I almost went nuts <br/>\nlast year before Christmas listening to &quot;I want...&quot; all day everyday, <br/>\nuntil someone suggested giving ds scissors and a catalog!!! He cut <br/>\nout tons of stuff he wanted and then we talked about it.<br/>\n<br/>\nThanks,<br/>\naj</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Allowances, spending money, etc.","postDate":"1087919432","msgId":95879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5NkIzMTQyLjMzODRBRjA0LjBDOEQ0NUE4QGFvbC5jb20+"},"prevInTopic":95878,"nextInTopic":95880,"prevInTime":95878,"nextInTime":95880,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... That s a really good point. One reason I love garage sales and flea markets so much is you CAN pick things up and mess with them.  At stores, sometimes the","messageBody":"<div id=\"ygrps-yiv-159813714\">In a message dated 6/22/2004 8:25:41 AM Eastern Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:scubamama@...\">scubamama@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Anything that he does want to <br/>\n&gt; touch or hold in the store I try to facilitate. This alone seems to <br/>\n&gt; be the key for us though. Usually, he just wants to touch <br/>\n&gt; and see <br/>\n&gt; things up close.<br/>\n<br/>\n </span></blockquote>That&#39;s a really good point.<br/>\nOne reason I love garage sales and flea markets so much is you CAN pick things up and mess with them.  At stores, sometimes the toys are in boxes, but still if the kid can turn the box over, look at the back, have someone read the contents or discuss what&#39;s good about it.<br/>\n<br/>\nSometimes I&#39;ve seen parents with kids in toy stores and it&#39;s not like they&#39;re even there together.  The kid is all on his own, looking or not looking with no assistance. Maybe taking something home is his most likely way to really examine it, sometimes, perhaps.<br/>\n<br/>\nBut I do agree about touching things sometimes being the &quot;I want that&quot; originally intended.  &quot;I want to touch that&quot; or whatever. <br/>\n<br/>\nSometimes having a toy in the cart, and the kid getting to hold it a while, and really examine it, was enough for mine.  THey&#39;d be fine with putting it back, or putting it on a list or things they might want for birthday or Christmas.  And lots of times I&#39;ve said &quot;We can get it if you want to,&quot; but they&#39;ll say &quot;No, that&#39;s okay.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":140240070,"authorName":"eriksmama2001","from":"&quot;eriksmama2001&quot; &lt;scubamama@...&gt;","profile":"eriksmama2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Allowances, spending money, etc.","postDate":"1087907141","msgId":95878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiOThnNStrNWJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNiN2FtdCttajQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":95873,"nextInTopic":95879,"prevInTime":95877,"nextInTime":95879,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"Another approach is to write down what he wants. I remember making a wish list for Christmas: EVERYTHING the Sears catalog had that I wanted was written down,","messageBody":"<div id=\"ygrps-yiv-569162867\">Another approach is to write down what he wants. I remember making a <br/>\nwish list for Christmas: EVERYTHING the Sears catalog had that I <br/>\nwanted was written down, with page number and item number. You know, <br/>\nhundreds of items! Obviously, I did not receive everything on my <br/>\nlists but writing it down made my desire more real and acknowledged. <br/>\nThis helped me to see the extent of my wishes and I could review it, <br/>\nchange my mind or decide something really was a high priority. And <br/>\nworth waiting for. Basically, I do this now too. We are renovating <br/>\nour house. I want everything (new roof, new heating/air, patio, new <br/>\nkitchen counters, new floors)....but this is not possible all at <br/>\nonce. And I change my mind. I mark things off the list as something <br/>\nmore important to me comes up. So, this is a useful tool in <br/>\nprioritizing our wants. This works the same when my 3 y/o wants to do <br/>\nx and y and z all right NOW! We have/get to choose what is most <br/>\nimportant. <br/>\n<br/>\nOften we have to wait for things we want....I get to model this all <br/>\nthe time. I tried to keep my wants non-verbalized, but I realized <br/>\nthat my child couldn&#39;t see me model waiting for things if I didn&#39;t <br/>\ntell him how I wanted things too and why I was wanting to wait (what <br/>\nI was doing/getting) instead.<br/>\n<br/>\nWe also give our 3 y/o money of his own (not attached to any behavior <br/>\nexcept that he is part of our family). When he wants something, I <br/>\nexplain why I do or don&#39;t want to buy it (plastic, limited use, <br/>\npoorly made...) but he can buy anything he wants with his money. <br/>\nSometimes I buy things for him because I want to. Sometimes he saves <br/>\nthe money for later. We decide to start when he asked for a $250 drum <br/>\nset. (he has a small, cheaper set already) He gets $5 a week. He has <br/>\nsaved a lot so far. He wants the drums. Most weeks, it is at the top <br/>\nof his list.<br/>\n<br/>\nI suggest toys that I think look interesting. However, he frequently <br/>\nsays &quot;I don&#39;t want anything today&quot;. Anything that he does want to <br/>\ntouch or hold in the store I try to facilitate. This alone seems to <br/>\nbe the key for us though. Usually, he just wants to touch and see <br/>\nthings up close. Then I ask &quot;are you done holding it?&quot; and we put it <br/>\nback. We go to the drum store and touch ALL of them, and touch all of <br/>\nthe guitars...everything. This outing alone is worth owning any one <br/>\nthing from the store. We go several times a month, cheap fun.<br/>\n<br/>\nHope this helps.<br/>\n<br/>\nPat<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;mamaaj2000&quot; <br/>\n&lt;mamaaj2000@y...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n&gt; &gt; My kids aren&#39;t needy of stuff, and I&#39;m not sure of all the <br/>\n </span></blockquote>reasons <br/>\n<blockquote><span title=\"ireply\"> &gt; for it, but because of that, we negotiate each request on its <br/>\n </span></blockquote>merits <br/>\n<blockquote><span title=\"ireply\"> &gt; in the full context of need, interest, benefit, sharability <br/>\n&gt; (sometimes that&#39;s a cool aspect, if lots of other people can <br/>\n </span></blockquote>benefit <br/>\n<blockquote><span title=\"ireply\"> &gt; too)...<br/>\n&gt; to me.<br/>\n&gt; <br/>\n&gt; My son (3.5 y o) is very needy of stuff and I&#39;m trying to figure <br/>\n </span></blockquote>out <br/>\n<blockquote><span title=\"ireply\"> &gt; how to respond to that. He doesn&#39;t get money really yet. If I say <br/>\n&gt; something is too expensive, he suggests we buy it for $1. Yeh, I&#39;d <br/>\n&gt; like to do that, but...<br/>\n&gt; <br/>\n&gt; I&#39;ve been thinking back to when I was a kid and I think he&#39;s a lot <br/>\n&gt; like me. Always wanting to look at catalogs, pick out the best of <br/>\n&gt; whatever, never satisfied with what I had, and so on. <br/>\n&gt; <br/>\n&gt; I don&#39;t really know how to respond to him. When we get a new Thomas <br/>\n&gt; toy and he plays with it for ten minutes and then spends an hour <br/>\n&gt; looking at the catalog that came with it...and is upset that I <br/>\n </span></blockquote>won&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; take him right back out to the store, etc. I&#39;m not telling him to <br/>\n </span></blockquote>put <br/>\n<blockquote><span title=\"ireply\"> &gt; the catalog down and play, damn it, but I worry (quietly, I hope) <br/>\n&gt; about how happy he is and will be. I am happier now that I&#39;m less <br/>\n&gt; materialistic, but I didn&#39;t learn that until my 30&#39;s! <br/>\n&gt; <br/>\n&gt; There is a positive side, I know, to the relentless search for <br/>\n </span></blockquote>more, <br/>\n<blockquote><span title=\"ireply\"> &gt; for the best. And I know Mikey will learn math skills with no <br/>\n&gt; problem...my parents sent me to the store when I was 5 or 6 and <br/>\n </span></blockquote>told <br/>\n<blockquote><span title=\"qreply\"> &gt; me I could buy a treat with the change. I bought the milk or <br/>\n&gt; whatever, then went back and bought a big container of cookies and <br/>\n&gt; came home with 1 cent!<br/>\n&gt; <br/>\n&gt; Anywho, I&#39;d love to hear perspectives on this. I sense that I&#39;m to <br/>\n&gt; close to the situation and too worried to really think about it <br/>\n&gt; objectively.<br/>\n&gt; <br/>\n&gt; Thanks,<br/>\n&gt; aj </span></blockquote></div>","specialLinks":[]},{"userId":168046064,"authorName":"Kimberly Fry","from":"Kimberly Fry &lt;kimber_fry@...&gt;","profile":"kimber_fry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087866301","msgId":95873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjIyMDEwNTAxLjM5MjI2LnFtYWlsQHdlYjYwODA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDM0QTk0MTg5LjIzMDU2NzNGLjBDOEQ0NUE4QGFvbC5jb20+"},"prevInTopic":95871,"nextInTopic":95878,"prevInTime":95872,"nextInTime":95874,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... I must have made it sound as if I was totally inflexible with looking and buying days.  Andy hasn t really ever had the gimmes.  I don t remember him","messageBody":"<div id=\"ygrps-yiv-1731004136\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;But to say in advance &quot;you can buy something&quot;...  what if they don&#39;t want anything they see, really, but they find something just because it was &quot;buy something&quot; time?&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I must have made it sound as if I was totally inflexible with &quot;looking and buying days.&quot;  Andy hasn&#39;t really ever had the gimmes.  I don&#39;t remember him ever buying something just to buy something.  He could and would sometimes save the money for another trip or another store.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;So I would declare the &quot;just here for underwear&quot; days (or whatever) but otherwise didn&#39;t specify.  And as to price limit, if you see a most glorious thing that would make all your lives better and last for forty years, but it costs $20 and you&#39;ve already said &quot;We&#39;re only spending $10,&quot; the kids might resent the discrepancy.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>A spending limit was an &quot;ish&quot; thing.  $20ish or $10ish.  If he saw something and he really wanted it, be it a toy or something for everyone, he would ask about it, no matter what the cost was in relation to the limit.  Sometimes I could afford it, and sometimes it had to be put off for a couple of weeks or a month.    <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&quot;Have no money whatsoever&quot; (and charge cards are past limit, and dad is fearful for cashflow, and the sewer needs redone, and Marty needs braces)--that&#39;s a reason NOT to buy some things, but it&#39;s not a reason not to buy something that will never come along again and is worth many times more than the price being asked.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>&quot;I&#39;m broke or I&#39;m overdrawn,&quot; is something my Mom would say frequently as I was growing up.  It didn&#39;t mean either one.  It meant I have less than an extra $x,xxx stubbed off in the checking account.  <br/>\n<br/>\nAndy has heard his Gram say both of those statements.  It bothers him to hear it.  I&#39;ve explained it&#39;s not what *she* means.  But he knows that if he hears me say, &quot;I&#39;m broke,&quot; or whatever that&#39;s exactly what it means.  <br/>\n<br/>\n&quot;Looking days&quot; were broke days.  A spending limit and the finances needed to be watched.  &quot;Have no money whatsoever,&quot; and it wouldn&#39;t matter if it was a once in a lifetime thing that would never come along again, it would mean I had no money -- zip, zero, zilch, nada.  <br/>\n<br/>\nWhen money is available, it&#39;s for whatever he&#39;d like -- sometimes even when I think it&#39;s a bad purchase.  This is how he learned commercials aren&#39;t necessarily an accurate representation of the product.  Example:  The Clorox pen bleaching areas it didn&#39;t touch.  <br/>\n<br/>\nSometimes when it hasn&#39;t been readily available, I&#39;ve found it because he&#39;s wanted something really bad, or for a specific purpose. <br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Allowances, spending money, etc.","postDate":"1087843869","msgId":95870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiN2FtdCttajQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM0QTk0MTg5LjIzMDU2NzNGLjBDOEQ0NUE4QGFvbC5jb20+"},"prevInTopic":95867,"nextInTopic":95871,"prevInTime":95869,"nextInTime":95871,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... for it, but because of that, we negotiate each request on its merits in the full context of need, interest, benefit, sharability (sometimes that s a cool","messageBody":"<div id=\"ygrps-yiv-1179838192\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My kids aren&#39;t needy of stuff, and I&#39;m not sure of all the reasons <br/>\n </span></blockquote>for it, but because of that, we negotiate each request on its merits <br/>\nin the full context of need, interest, benefit, sharability <br/>\n(sometimes that&#39;s a cool aspect, if lots of other people can benefit <br/>\ntoo)...<br/>\nto me.<br/>\n<br/>\nMy son (3.5 y o) is very needy of stuff and I&#39;m trying to figure out <br/>\nhow to respond to that. He doesn&#39;t get money really yet. If I say <br/>\nsomething is too expensive, he suggests we buy it for $1. Yeh, I&#39;d <br/>\nlike to do that, but...<br/>\n<br/>\nI&#39;ve been thinking back to when I was a kid and I think he&#39;s a lot <br/>\nlike me. Always wanting to look at catalogs, pick out the best of <br/>\nwhatever, never satisfied with what I had, and so on. <br/>\n<br/>\nI don&#39;t really know how to respond to him. When we get a new Thomas <br/>\ntoy and he plays with it for ten minutes and then spends an hour <br/>\nlooking at the catalog that came with it...and is upset that I won&#39;t <br/>\ntake him right back out to the store, etc. I&#39;m not telling him to put <br/>\nthe catalog down and play, damn it, but I worry (quietly, I hope) <br/>\nabout how happy he is and will be. I am happier now that I&#39;m less <br/>\nmaterialistic, but I didn&#39;t learn that until my 30&#39;s! <br/>\n<br/>\nThere is a positive side, I know, to the relentless search for more, <br/>\nfor the best. And I know Mikey will learn math skills with no <br/>\nproblem...my parents sent me to the store when I was 5 or 6 and told <br/>\nme I could buy a treat with the change. I bought the milk or <br/>\nwhatever, then went back and bought a big container of cookies and <br/>\ncame home with 1 cent!<br/>\n<br/>\nAnywho, I&#39;d love to hear perspectives on this. I sense that I&#39;m to <br/>\nclose to the situation and too worried to really think about it <br/>\nobjectively.<br/>\n<br/>\nThanks,<br/>\naj</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087789707","msgId":95871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjZC4yM2Y4NTEwNS4yZTA3YjQ4YkBhb2wuY29tPg=="},"prevInTopic":95870,"nextInTopic":95873,"prevInTime":95870,"nextInTime":95872,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/19/2004 2:12:12 PM Eastern Daylight Time, pmteet@sbcglobal.net writes: I try to  redirect the conversation but have told my mother again","messageBody":"<div id=\"ygrps-yiv-1515754896\">In a message dated 6/19/2004 2:12:12 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pmteet@...\">pmteet@...</a> writes:<br/>\n<br/>\nI try to  redirect the<br/>\nconversation but have told my mother again and again that,  no,<br/>\nbefore dance classes we will first buy a house that better fits  our<br/>\nfamily since we&#39;ve outgrown our trailer and get some savings  for<br/>\nemergencies like car repair, etc.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI know people that have nice houses.  Big houses, wonderful  houses.  They do <br/>\nlittle with or for their children because they can&#39;t  afford it.  I live in <br/>\nan old house, old neighborhood.  We surely could  have used more room when all <br/>\nthe children lived at home.<br/>\n <br/>\nWe stayed in our old, needs repairs/remolding house and spent the money on  <br/>\nthe things the kids wanted to do.<br/>\n <br/>\nThey are in our lives wholly for such a few years, I figure the house can  <br/>\nwait, the savings can wait.  Dance lessons are important to some  children.  To <br/>\nothers a new leather baseball glove is important, important  today, not so <br/>\nimportant some years or months from now when we might or might not  have savings <br/>\nand a better house.<br/>\n <br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087789390","msgId":95867,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ3LmQ3ODY2ZWEuMmUwN2IzNGVAYW9sLmNvbT4="},"prevInTopic":95866,"nextInTopic":95870,"prevInTime":95866,"nextInTime":95868,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/19/2004 2:12:25 PM Eastern Daylight Time, mamatoethan1@yahoo.com writes: Do any  of you have small children who ve found ways to make ","messageBody":"<div id=\"ygrps-yiv-1615787323\">In a message dated 6/19/2004 2:12:25 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamatoethan1@...\">mamatoethan1@...</a> writes:<br/>\n<br/>\nDo any  of you have small children who&#39;ve found ways to make <br/>\ntheir own income  without having to spend money for startup, etc.?  <br/>\nI&#39;d love to hear  about it.  I want something she can do only when <br/>\nshe wants that can  allow her to raise money for things between <br/>\nholidays.  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nMy older two children had LOTS of jobs when they were younger.  One  was <br/>\ndelivering newspapers, not a daily newspaper but the weekly local  paper.  They <br/>\ndropped them off, the kids had to fold them and stuff them  into baggies and <br/>\ndeliver them to the front porches of two hundred  townhouses/homes.  They got <br/>\npaid three cents per paper.  They got paid  once a month.<br/>\n <br/>\nThey would put them in their wagon and pull them around the neighborhood  and <br/>\nthe next one over to deliver.  That was of course ten years ago and  would <br/>\ndepend on if you had houses close enough for this.  Or kids  determined.  They <br/>\ndid it in snow, rain, even and ice storm once.  THEY  felt it HAD to be done.<br/>\n <br/>\nMothers&#39; helper is also a good way for them to earn money.  Sometimes  <br/>\nparents would not be quite sure if they were old enough at ten or eleven to  watch <br/>\ntheir child so they would bring them to our house just for added  security.  <br/>\nThey usually made big bucks doing that.<br/>\n <br/>\nWhen my older boy was about ten he started mowing neighbor&#39;s lawns,  <br/>\nshoveling snow, etc.  He had a regular client list that he did on certain  days and <br/>\ngot quite a savings account from that.<br/>\n <br/>\nA not so fun job but paid well was popper scooping yards.  My youngest  did <br/>\nthat, with regular customers and made about a hundred a week or more,  several <br/>\nyears ago.  People with fenced in yards that let their dogs do  their business <br/>\nthere often don&#39;t have time to clean it up for parties or to keep  the kids <br/>\nor anyone from stepping in it.  He got twenty dollars a week per  dog per <br/>\nhouse.  A teen that I knew a couple years ago took that idea and he  made a LOT of <br/>\nmoney the summer before he headed off to college and had lots of  free time as <br/>\nwell.<br/>\n <br/>\nThose are just some of the things I can think of right now that my children  <br/>\ndid.  The of course had the lemonade/koolaid stands in the summer for  &quot;quick&quot; <br/>\nmoney at times too.<br/>\n <br/>\nHope these ideas help.<br/>\n <br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087747918","msgId":95866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0QTk0MTg5LjIzMDU2NzNGLjBDOEQ0NUE4QGFvbC5jb20+"},"prevInTopic":95863,"nextInTopic":95867,"prevInTime":95865,"nextInTime":95867,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... I have always tried to just avoid being where things are for sale if we have no money to spend at all.  It s less painful.  If we were going to a big store","messageBody":"<div id=\"ygrps-yiv-1633055711\"><blockquote><span title=\"ireply\">&gt; I would always let him know BEFORE we went into the store if that day was looking only or if he could buy something.  If there was a price limit on a buying day he also knew what it <br/>\n&gt; was before going in.   <br/>\n<br/>\n<br/>\n </span></blockquote>I have always tried to just avoid being where things are for sale if we have no money to spend at all.  It&#39;s less painful.  If we were going to a big store or a mall for one purpose, kind of in and out, I would make that clear.  <br/>\n<br/>\nBut to say in advance &quot;you can buy something&quot;...  what if they don&#39;t want anything they see, really, but they find something just because it was &quot;buy something&quot; time? <br/>\n<br/>\nSo I would declare the &quot;just here for underwear&quot; days (or whatever) but otherwise didn&#39;t specify.  And as to price limit, if you see a most glorious thing that would make all your lives better and last for forty years, but it costs $20 and you&#39;ve already said &quot;We&#39;re only spending $10,&quot; the kids might resent the discrepancy.   <br/>\n<br/>\nSometimes at a thrift store, yard sale or the fleamarket we find something wonderful.  A local-tradition table and three chairs, all hand-joined, no nails or even pegs.  $50.  I would have put back any and everything else we had to get that.    <br/>\n<br/>\nFlexibility in spending might have come from flexibility in pursuing other kinds of subjects and activities in life.  If we go to a museum just to see the Imax movie, but there&#39;s a new display the kids are excited about, I will rearrange life and schedules if I can to allow them a chance to see it.  <br/>\n<br/>\nLearning and spontaneity are higher priorities than budget and schedule for me.  Sometimes there ARE reasons people absolutely have to leave.  &quot;Because I said so&quot; has never been one of them for me.   &quot;Someone is waiting for us&quot; is prime for us.  If nobody is waiting for us, there is much flexibility.   &quot;Have no money whatsoever&quot; (and charge cards are past limit, and dad is fearful for cashflow, and the sewer needs redone, and Marty needs braces)--that&#39;s a reason NOT to buy some things, but it&#39;s not a reason not to buy something that will never come along again and is worth many times more than the price being asked.<br/>\n<br/>\nMy kids aren&#39;t needy of stuff, and I&#39;m not sure of all the reasons for it, but because of that, we negotiate each request on its merits in the full context of need, interest, benefit, sharability (sometimes that&#39;s a cool aspect, if lots of other people can benefit too)...<br/>\n<br/>\nFlexibility and being open to special opportunities seems important to me.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087713863","msgId":95863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0NTA0RkRDLUMyODUtMTFEOC04M0EwLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDIwMDQwNjIwMDMxNzE0Ljk0MDE4LnFtYWlsQHdlYjYwODAxLm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDQwNjIwMDMxNzE0Ljk0MDE4LnFtYWlsQHdlYjYwODAxLm1haWwueWFob28uY29tPg=="},"prevInTopic":95859,"nextInTopic":95866,"prevInTime":95862,"nextInTime":95864,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... When we go out to eat - fast food or low-cost coffee shop or restaurant or wherever - my kids always ask, Is this a drink day? This is a code for -","messageBody":"<div id=\"ygrps-yiv-590087413\">On Jun 19, 2004, at 8:17 PM, Kimberly Fry wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When Andy was little and we went to the store, some days were &quot;looking <br/>\n&gt; days&quot; others were &quot;buying days.&quot;  I would always let him know BEFORE <br/>\n&gt; we went into the store if that day was looking only or if he could buy <br/>\n&gt; something.  If there was a price limit on a buying day he also knew <br/>\n&gt; what it was before going in.<br/>\n<br/>\n </span></blockquote>When we go out to eat - fast food or low-cost coffee shop or restaurant <br/>\nor wherever - my kids always ask, &quot;Is this a drink day?&quot;<br/>\n<br/>\nThis is a code for - should we just ask for water or can we order a <br/>\nsoda or milk or juice? And - they know - if it is a &quot;water day&quot; - they <br/>\nshould look for lower priced items on the menu, too.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":168046064,"authorName":"Kimberly Fry","from":"Kimberly Fry &lt;kimber_fry@...&gt;","profile":"kimber_fry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087701888","msgId":95859,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjIwMDMyNDQ4Ljg1NDQyLnFtYWlsQHdlYjYwODA4Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDFlOC4yMzU1ZGJhZC4yZTA2MjcxY0Bhb2wuY29tPg=="},"prevInTopic":95858,"nextInTopic":95863,"prevInTime":95858,"nextInTime":95860,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... we pay them.","messageBody":"<div id=\"ygrps-yiv-822974012\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Fiskecnn@...\">Fiskecnn@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;I just felt I needed to add that we do not give allowance to our children.   They should do things to help because they are part of the family, not because <br/>\n </span></blockquote>we pay them.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nI&#39;d be more inclined to give the allowance, just not tie it to chores or things to be done around the house.  Andy helps, because he&#39;s part of the family, lives here, and makes part of the mess, not because of money or things he&#39;s given.  <br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a> <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":168046064,"authorName":"Kimberly Fry","from":"Kimberly Fry &lt;kimber_fry@...&gt;","profile":"kimber_fry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087701434","msgId":95858,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjIwMDMxNzE0Ljk0MDE4LnFtYWlsQHdlYjYwODAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDQwRDQ1MkYwLjAwMDAwMS43OTQ2NUBNSUNIRUxMPg=="},"prevInTopic":95854,"nextInTopic":95859,"prevInTime":95857,"nextInTime":95859,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... When Andy was little and we went to the store, some days were looking days others were buying days.  I would always let him know BEFORE we went into","messageBody":"<div id=\"ygrps-yiv-39109836\">&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pmteet@...\">pmteet@...</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pmteet@...\">pmteet@...</a>&gt; wrote: <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;Don&#39;t feel bad telling a 4 yo you can&#39;t afford it. From the time they were babies I would say: &quot;mommy can&#39;t afford this now&quot; or &quot; We do not NEED this, we just WANT it maybe next time we can get things we WANT but this time we are getting things we NEED&quot;  I tried to start early letting them see the difference between WANTS and NEEDS.  I do however let them look at anything they want and even press all the buttons on the toys with demo buttons.&lt;&lt;&lt;&lt;&lt;  <br/>\n<br/>\n </span></blockquote>When Andy was little and we went to the store, some days were &quot;looking days&quot; others were &quot;buying days.&quot;  I would always let him know BEFORE we went into the store if that day was looking only or if he could buy something.  If there was a price limit on a buying day he also knew what it was before going in.  <br/>\n<br/>\nKim<br/>\n<br/>\n<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! Mail - 50x more storage than other providers!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087695743","msgId":95854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzN0NGMDlDLUMyNUItMTFEOC04M0EwLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGNiMWhrbitsazRmQGVHcm91cHMuY29tPg==","referencesHeader":"PGNiMWhrbitsazRmQGVHcm91cHMuY29tPg=="},"prevInTopic":95852,"nextInTopic":95858,"prevInTime":95853,"nextInTime":95855,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"... I guess that s just part of being a parent, huh? The price tags get - bigger, but we still have the same real-life constraints when they get older - we","messageBody":"<div id=\"ygrps-yiv-864550397\">On Jun 19, 2004, at 7:12 AM, Kristi wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel badly.  I hate having to tell a child of 4 we can&#39;t afford<br/>\n&gt; it, and explaining why.<br/>\n<br/>\n </span></blockquote>I guess that&#39;s just part of being a parent, huh? The price tags get - <br/>\nbigger, but we still have the same real-life constraints when they get <br/>\nolder - we can&#39;t do everything or buy everything that we&#39;d like, we <br/>\nhave to make choices.<br/>\n<br/>\nMy 16 and 19 yo&#39;s want so MUCH to go see Miss Saigon at the Pantages <br/>\nTheater in Hollywood - like this week. Prices are $40 to $65. I&#39;ve seen <br/>\nit - saw the L.A. premier. They love the music. They don&#39;t have the <br/>\nmoney - I just can&#39;t spring for it this week.  They understand better <br/>\nthan a 4 yo would.<br/>\n<br/>\nThey&#39;ve both bought quite a few cd&#39;s in the past month with their own <br/>\nmoney - I have to remind myself that they HAD the money and spent it <br/>\nalready. If they&#39;d &quot;saved it for a rainy day&quot; they&#39;d have it now to get <br/>\ntickets to this show.<br/>\n<br/>\nStill --- I think it is normal for parents to wish they could give <br/>\ntheir kids everything. Especially when they&#39;re little and don&#39;t yet <br/>\nreally understand the constraints of income and time.<br/>\n<br/>\n<br/>\n-pam<br/>\n<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":30416826,"authorName":"Fiskecnn@aol.com","from":"Fiskecnn@...","profile":"bwtrmomathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087687964","msgId":95852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlOC4yMzU1ZGJhZC4yZTA2MjcxY0Bhb2wuY29tPg=="},"prevInTopic":95851,"nextInTopic":95854,"prevInTime":95851,"nextInTime":95853,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/19/04 11:12:34 AM Pacific Daylight Time, ... I just felt I needed to add that we do not give allowance to our children. They should do","messageBody":"<div id=\"ygrps-yiv-208756972\">In a message dated 6/19/04 11:12:34 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamatoethan1@...\">mamatoethan1@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Sometimes reading this list <br/>\n&gt; and allowance figures of $50 or $60 a month I feel like we&#39;re the <br/>\n&gt; only ones. <br/>\n<br/>\n </span></blockquote>I just felt I needed to add that we do not give allowance to our children.   <br/>\nThey should do things to help because they are part of the family, not because <br/>\nwe pay them.  <br/>\n<br/>\nI am not saying they don&#39;t occasionally get a buck or two if they go out of <br/>\ntheir way and really do something above and beyond.  There is, however, no <br/>\nweekly/monthly allowance.<br/>\n<br/>\nJust my two cents.<br/>\nLynn ~ Mom to Jake 11 and Abbie 9<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":173212844,"authorName":"Michelle","from":"Michelle &lt;mamatoethan1@...&gt;","profile":"mamatoethan1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087664519","msgId":95851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNjE5MTcwMTU5LjYxMTcxLnFtYWlsQHdlYjUzMzA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGNiMWhrbitsazRmQGVHcm91cHMuY29tPg=="},"prevInTopic":95850,"nextInTopic":95852,"prevInTime":95850,"nextInTime":95852,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"Kristi: We have not always been in the position to give this much allowance to our son.  Also, we only have one child.  Which I know makes a HUGE difference in","messageBody":"<div id=\"ygrps-yiv-787494088\">Kristi:<br/>\n<br/>\nWe have not always been in the position to give this much allowance to our son.  Also, we only have one child.  Which I know makes a HUGE difference in the household budget.  If we had more than one child, we would not be giving so much allowance.  We have finally got ourselves where we can afford to do this, and I figured we were probably spending more than this a month on toys and video games.  Wanting to get it under control, hubby and I decided on an amount that we could now handle, and that would give him enough to buy what he really wanted.  Right now it works for us, but a year ago we would not have been able to afford it.  Time has just made our situation better for us.<br/>\n <br/>\nMichelle<br/>\n<br/>\n<br/>\nDo any of you deal with these issues?  Sometimes reading this list <br/>\nand allowance figures of $50 or $60 a month I feel like we&#39;re the <br/>\nonly ones.  DH and I don&#39;t even have a disposable income for <br/>\nourselves of that much.  I know others have to struggle with it <br/>\ntoo.  Do any of you have small children who&#39;ve found ways to make <br/>\ntheir own income without having to spend money for startup, etc.?  <br/>\nI&#39;d love to hear about it.  I want something she can do only when <br/>\nshe wants that can allow her to raise money for things between <br/>\nholidays.  <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nNew and Improved Yahoo! Mail - Send 10MB messages!<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087662450","msgId":95849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzEwMWM0NTYxYSQ1MjFjYmNkMCRjN2I2Y2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PGNiMWhrbitsazRmQGVHcm91cHMuY29tPg=="},"prevInTopic":95848,"nextInTopic":95850,"prevInTime":95848,"nextInTime":95850,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"Kristi, I can totally relate to your situation.  I can t say I have any specific advice, because I struggle with being able to afford what my children need and","messageBody":"<div id=\"ygrps-yiv-1137573580\">Kristi,<br/>\n<br/>\nI can totally relate to your situation.  I can&#39;t say I have any specific<br/>\nadvice, because I struggle with being able to afford what my children need<br/>\nand want all the time, but I wanted you to know that you aren&#39;t the only<br/>\none.  My own children are young, also--the oldest is not yet 5, but my<br/>\nstepdaughter who is with us for awhile until her mom returns from a study<br/>\nabroad in Germany is 10.  She is really helpful and fun to have around, but<br/>\nshe eats so much!  I used to be able to serve leftovers for lunch the next<br/>\nday--no more!  She eats as much and more often much more than I do.<br/>\nAnyway, this has been difficult financially, and it&#39;s so frustrating when<br/>\nyou are trying to change and give the kids the freedom to eat what they want<br/>\nwhen they want it, and they just eat it all, right away.  I really can&#39;t<br/>\nafford this.  My 4 year old does this, in part, I think, because she watches<br/>\nher older sister and figures, she better eat a bunch too, or she might not<br/>\nget any.  Very frustrating.<br/>\n<br/>\n~Andrea<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Kristi&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hayes@...\">hayes@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, June 19, 2004 7:12 AM<br/>\nSubject: [UnschoolingDiscussion] Allowances, spending money, etc.<br/>\n<br/>\n<br/>\n&gt; I love the idea of giving the kids a budget.  I want my kids to be<br/>\n&gt; able to have things they want, like dance lessons, toys, snacks,<br/>\n&gt; etc.  We&#39;re in a situation though where if I were to add up the<br/>\n&gt; money I spent on extras for the kids, most months it would be under<br/>\n&gt; $5-$10.  I&#39;m frugal and tight because that&#39;s how we have to be.<br/>\n&gt; Occasionally, perhaps once a month, we splurge and order pizzas for<br/>\n&gt; $11, or maybe every other month go to a movie.  I buy little<br/>\n&gt; convenience food either, and what I do buy is like veggie burgers or<br/>\n&gt; bread or cold cereal.<br/>\n&gt;<br/>\n&gt; My kids are little.  My oldest is not yet 5.  When she asks, which<br/>\n&gt; she&#39;s doing more often, for things, I say, &quot;You can buy it with the<br/>\n&gt; money in your piggy bank.&quot;  Only once has she wanted to, when we<br/>\n&gt; were yard-saling one day.  I had given her a dollar to spend, and<br/>\n&gt; asked if she wanted to bring extra; she pulled out 43 cents, and<br/>\n&gt; spent it all at the first yard sale.  I reminded her there would be<br/>\n&gt; other yard sales that day, but she finalized her purchase and spent<br/>\n&gt; the day asking.  I&#39;m ok with saying &quot;no,&quot; because I know we don&#39;t<br/>\n&gt; have it.  I was looking for specific items for our home and not<br/>\n&gt; buying things for me or the kids, and I explained that to her, and<br/>\n&gt; she started asking differently, &quot;Would you buy this for me because<br/>\n&gt; you love me?&quot;  Again, a gentle no, a cuddle, love, move on.<br/>\n&gt;<br/>\n&gt; I feel badly.  I hate having to tell a child of 4 we can&#39;t afford<br/>\n&gt; it, and explaining why.  I did work for a while when my second child<br/>\n&gt; was only 4 months old, and she cried each night that I went to<br/>\n&gt; work.  We talk about that.  I&#39;m starting a home business to make<br/>\n&gt; extra, and we talk about that too.  DH is starting a new career as a<br/>\n&gt; nurse, so things will get better soon.  He&#39;s just graduated and<br/>\n&gt; starts his new job soon.  But now my mother, in front of my<br/>\n&gt; daughter, likes to say things like &quot;Now that Dan&#39;s got a &quot;real job&quot;<br/>\n&gt; you can send her to dance class.&quot;  I try to redirect the<br/>\n&gt; conversation but have told my mother again and again that, no,<br/>\n&gt; before dance classes we will first buy a house that better fits our<br/>\n&gt; family since we&#39;ve outgrown our trailer and get some savings for<br/>\n&gt; emergencies like car repair, etc.<br/>\n&gt;<br/>\n&gt; Do any of you deal with these issues?  Sometimes reading this list<br/>\n&gt; and allowance figures of $50 or $60 a month I feel like we&#39;re the<br/>\n&gt; only ones.  DH and I don&#39;t even have a disposable income for<br/>\n&gt; ourselves of that much.  I know others have to struggle with it<br/>\n&gt; too.  Do any of you have small children who&#39;ve found ways to make<br/>\n&gt; their own income without having to spend money for startup, etc.?<br/>\n&gt; I&#39;d love to hear about it.  I want something she can do only when<br/>\n&gt; she wants that can allow her to raise money for things between<br/>\n&gt; holidays.<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt; Kristi<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":160951630,"authorName":"pmteet@sbcglobal.net","from":"&quot;pmteet@...&quot; &lt;pmteet@...&gt;","profile":"pmteet","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Allowances, spending money, etc.","postDate":"1087656688","msgId":95850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwRDQ1MkYwLjAwMDAwMS43OTQ2NUBNSUNIRUxMPg==","referencesHeader":"PGNiMWhrbitsazRmQGVHcm91cHMuY29tPg=="},"prevInTopic":95849,"nextInTopic":95851,"prevInTime":95849,"nextInTime":95851,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"Kristi you are NOT the only ones lol. I have 3 kids 12, 8 and almost  7. We\nhave little disposable income. I laughed at the  50 bucks a month. I don t\nspend","messageBody":"<div id=\"ygrps-yiv-290659850\">Kristi you are NOT the only ones lol. I have 3 kids 12, 8 and almost  7. We<br/>\nhave little disposable income. I laughed at the  50 bucks a month. I don&#39;t<br/>\nspend that much on ANY extras.  When we can afford it the kids get an<br/>\nallowance. the equivilant of half thier age. So the 8 yo gets 4 dollars. <br/>\nBut it is  only MAYBE once a month that we can afford it.  We do go out to a<br/>\nfast food place once a week. \r<br/>\nI don&#39;t know how people do it.  We live on one income and one car.  I spend<br/>\nMAYBE 200 dollars a year on ALL of our clothes and that includes shoes sock<br/>\nand underwear. LOL  Our &quot;extras&quot; include bubble bath , chips  and the 2<br/>\nletter of soda at walmart that is .50.  I WISH I could give them more money<br/>\nbut it is not possible. The kids do not always understand but it gets easier<br/>\nas they get older. THey don&#39;t like it any less but they understand.  My 12<br/>\nyo dd Wanted to color her hair so she saved her money and bought the hair<br/>\ncolor.  \r<br/>\n\r<br/>\nDon&#39;t feel bad telling a 4 yo you can&#39;t afford it. From the time they were<br/>\nbabies I would say: &quot;mommy can&#39;t afford this now&quot; or &quot; We do not NEED this,<br/>\nwe just WANT it maybe next time we can get things we WANT but this time we<br/>\nare getting things we NEED&quot;  I tried to start early letting them see the<br/>\ndifference between WANTS and NEEDS.  I do however let them look at anything<br/>\nthey want and even press all the buttons on the toys with demo buttons.  \r<br/>\n\r<br/>\nIt is hard when the money is just not there.  Especially when you or the<br/>\nchild sees freinds or others getting a lot of stuff. OR even a large<br/>\nallowance.  \r<br/>\n\r<br/>\n\r<br/>\nAnyway you are not alone there are many of us out here in the same boat\r<br/>\nMichelle\r<br/>\n-------Original Message-------\r<br/>\n \r<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>\r<br/>\nDate: 06/19/04 09:14:21\r<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>\r<br/>\nSubject: [UnschoolingDiscussion] Allowances, spending money, etc.\r<br/>\n \r<br/>\nI love the idea of giving the kids a budget.  I want my kids to be\r<br/>\nable to have things they want, like dance lessons, toys, snacks,\r<br/>\netc.  We&#39;re in a situation though where if I were to add up the\r<br/>\nmoney I spent on extras for the kids, most months it would be under\r<br/>\n$5-$10.  I&#39;m frugal and tight because that&#39;s how we have to be.\r<br/>\nOccasionally, perhaps once a month, we splurge and order pizzas for\r<br/>\n$11, or maybe every other month go to a movie.  I buy little\r<br/>\nconvenience food either, and what I do buy is like veggie burgers or\r<br/>\nbread or cold cereal.\r<br/>\n \r<br/>\nMy kids are little.  My oldest is not yet 5.  When she asks, which\r<br/>\nshe&#39;s doing more often, for things, I say, &quot;You can buy it with the\r<br/>\nmoney in your piggy bank.&quot;  Only once has she wanted to, when we\r<br/>\nwere yard-saling one day.  I had given her a dollar to spend, and\r<br/>\nasked if she wanted to bring extra; she pulled out 43 cents, and\r<br/>\nspent it all at the first yard sale.  I reminded her there would be\r<br/>\nother yard sales that day, but she finalized her purchase and spent\r<br/>\nthe day asking.  I&#39;m ok with saying &quot;no,&quot; because I know we don&#39;t\r<br/>\nhave it.  I was looking for specific items for our home and not\r<br/>\nbuying things for me or the kids, and I explained that to her, and\r<br/>\nshe started asking differently, &quot;Would you buy this for me because\r<br/>\nyou love me?&quot;  Again, a gentle no, a cuddle, love, move on.\r<br/>\n \r<br/>\nI feel badly.  I hate having to tell a child of 4 we can&#39;t afford\r<br/>\nit, and explaining why.  I did work for a while when my second child\r<br/>\nwas only 4 months old, and she cried each night that I went to\r<br/>\nwork.  We talk about that.  I&#39;m starting a home business to make\r<br/>\nextra, and we talk about that too.  DH is starting a new career as a\r<br/>\nnurse, so things will get better soon.  He&#39;s just graduated and\r<br/>\nstarts his new job soon.  But now my mother, in front of my\r<br/>\ndaughter, likes to say things like &quot;Now that Dan&#39;s got a &quot;real job&quot;\r<br/>\nyou can send her to dance class.&quot;  I try to redirect the\r<br/>\nconversation but have told my mother again and again that, no,\r<br/>\nbefore dance classes we will first buy a house that better fits our\r<br/>\nfamily since we&#39;ve outgrown our trailer and get some savings for\r<br/>\nemergencies like car repair, etc.\r<br/>\n \r<br/>\nDo any of you deal with these issues?  Sometimes reading this list\r<br/>\nand allowance figures of $50 or $60 a month I feel like we&#39;re the\r<br/>\nonly ones.  DH and I don&#39;t even have a disposable income for\r<br/>\nourselves of that much.  I know others have to struggle with it\r<br/>\ntoo.  Do any of you have small children who&#39;ve found ways to make\r<br/>\ntheir own income without having to spend money for startup, etc.?\r<br/>\nI&#39;d love to hear about it.  I want something she can do only when\r<br/>\nshe wants that can allow her to raise money for things between\r<br/>\nholidays.\r<br/>\n \r<br/>\nThanks,\r<br/>\nKristi\r<br/>\n \r<br/>\n \r<br/>\n \r<br/>\n------------------------ Yahoo! Groups Sponsor --------------------~--&gt;\r<br/>\nMake a clean sweep of pop-up ads. Yahoo! Companion Toolbar.\r<br/>\nNow with Pop-Up Blocker. Get it for free!\r<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.click.yahoo.com/L5YrjA/eSIIAA/yQLSAA/0xXolB/TM\">http://us.click.yahoo.com/L5YrjA/eSIIAA/yQLSAA/0xXolB/TM</a>\r<br/>\n--------------------------------------------------------------------~-&gt;\r<br/>\n \r<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group.\r<br/>\n \r<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a>\r<br/>\nYahoo! Groups Links\r<br/>\n \r<br/>\n \r<br/>\n \r<br/>\n \r<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":142002410,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;hayes@...&gt;","profile":"morgainesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Allowances, spending money, etc.","postDate":"1087654359","msgId":95848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNiMWhrbitsazRmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":95849,"prevInTime":95847,"nextInTime":95849,"topicId":95848,"numMessagesInTopic":0,"msgSnippet":"I love the idea of giving the kids a budget.  I want my kids to be able to have things they want, like dance lessons, toys, snacks, etc.  We re in a situation","messageBody":"<div id=\"ygrps-yiv-1162764762\">I love the idea of giving the kids a budget.  I want my kids to be <br/>\nable to have things they want, like dance lessons, toys, snacks, <br/>\netc.  We&#39;re in a situation though where if I were to add up the <br/>\nmoney I spent on extras for the kids, most months it would be under <br/>\n$5-$10.  I&#39;m frugal and tight because that&#39;s how we have to be.  <br/>\nOccasionally, perhaps once a month, we splurge and order pizzas for <br/>\n$11, or maybe every other month go to a movie.  I buy little <br/>\nconvenience food either, and what I do buy is like veggie burgers or <br/>\nbread or cold cereal.  <br/>\n<br/>\nMy kids are little.  My oldest is not yet 5.  When she asks, which <br/>\nshe&#39;s doing more often, for things, I say, &quot;You can buy it with the <br/>\nmoney in your piggy bank.&quot;  Only once has she wanted to, when we <br/>\nwere yard-saling one day.  I had given her a dollar to spend, and <br/>\nasked if she wanted to bring extra; she pulled out 43 cents, and <br/>\nspent it all at the first yard sale.  I reminded her there would be <br/>\nother yard sales that day, but she finalized her purchase and spent <br/>\nthe day asking.  I&#39;m ok with saying &quot;no,&quot; because I know we don&#39;t <br/>\nhave it.  I was looking for specific items for our home and not <br/>\nbuying things for me or the kids, and I explained that to her, and <br/>\nshe started asking differently, &quot;Would you buy this for me because <br/>\nyou love me?&quot;  Again, a gentle no, a cuddle, love, move on. <br/>\n<br/>\nI feel badly.  I hate having to tell a child of 4 we can&#39;t afford <br/>\nit, and explaining why.  I did work for a while when my second child <br/>\nwas only 4 months old, and she cried each night that I went to <br/>\nwork.  We talk about that.  I&#39;m starting a home business to make <br/>\nextra, and we talk about that too.  DH is starting a new career as a <br/>\nnurse, so things will get better soon.  He&#39;s just graduated and <br/>\nstarts his new job soon.  But now my mother, in front of my <br/>\ndaughter, likes to say things like &quot;Now that Dan&#39;s got a &quot;real job&quot; <br/>\nyou can send her to dance class.&quot;  I try to redirect the <br/>\nconversation but have told my mother again and again that, no, <br/>\nbefore dance classes we will first buy a house that better fits our <br/>\nfamily since we&#39;ve outgrown our trailer and get some savings for <br/>\nemergencies like car repair, etc.  <br/>\n<br/>\nDo any of you deal with these issues?  Sometimes reading this list <br/>\nand allowance figures of $50 or $60 a month I feel like we&#39;re the <br/>\nonly ones.  DH and I don&#39;t even have a disposable income for <br/>\nourselves of that much.  I know others have to struggle with it <br/>\ntoo.  Do any of you have small children who&#39;ve found ways to make <br/>\ntheir own income without having to spend money for startup, etc.?  <br/>\nI&#39;d love to hear about it.  I want something she can do only when <br/>\nshe wants that can allow her to raise money for things between <br/>\nholidays.  <br/>\n<br/>\nThanks,<br/>\nKristi</div>","specialLinks":[]}],"prevTopicId":95960,"nextTopicId":95840}}