{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:Guilt and the ways your parents went wrong","postDate":"1270597844","msgId":52530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQkJDOEQ0LjcwMTA3MDFAeWFob28uY2E+"},"prevInTopic":52510,"nextInTopic":0,"prevInTime":52529,"nextInTime":52531,"topicId":52504,"numMessagesInTopic":0,"msgSnippet":"... parents didn t have any exposure to the ideas of Unschooling when we were kids. Sure, it was there but information of this nature didn t get around like it","messageBody":"<div id=\"ygrps-yiv-2056536292\">----I don&#39;t think this choice is a betrayal, however. Many of our <br/>\nparents didn&#39;t have any exposure to the ideas of Unschooling when we <br/>\nwere kids. Sure, it was there but information of this nature didn&#39;t get <br/>\naround like it does today. I think it&#39;s also important to take into <br/>\naccount the childhood of our parents. What type of history is there that <br/>\nmay have led them to choose a certain parenting style or school choice.-----<br/>\n<br/>\nIt was certainly a revelation to finally grasp (though I had been told <br/>\nit all my life) the abuses and neglect and overall horrible childhoods <br/>\nmy parents had been through.  During my childhood, I thought of their <br/>\nstories along the lines of &quot;When I was a child... we had to walk 100 <br/>\nmiles to school through 10 foot deep snow!&quot;, not as the tales of <br/>\nemotional and physical abuse they really were.  Even though the abuse <br/>\nthey suffered was not so bad, on the grand scale of child abuse... it <br/>\ndamaged them emotionally.  As an adult, I can reflect back on many of <br/>\nthe decisions they made, many of their parental actions, and see the <br/>\nWHY.  With that frame of reference, a lot of my own childhood has felt <br/>\nhealed, to some extent.  I was not abused.  My parents were 100X better <br/>\nfor me than theirs were for them.  They did do things I don&#39;t agree <br/>\nwith.  I&#39;ve found unschooling literature, and Alfie Kohn&#39;s book (in the <br/>\nbeginning, thats what I had read first) very healing.  And as we <br/>\nencounter more situations where we want to explain the differences in <br/>\nparenting to my father (my mother is not able to really understand any <br/>\nof this, I think), I have found that my relationship with my father has <br/>\ndeepened as well.  I share with him my insights into his childhood, oh <br/>\nso gently, and what we want to do differently, and why, and the outcomes <br/>\nwe expect, and I am oh, so, careful to reassure him of how great a <br/>\nfather he was, and how wonderful his children, and now his <br/>\ngrandchildren, have turned out because of his choice NOT to abuse.  He <br/>\ndoes come to me and ask if I felt abused, when I talk about certain <br/>\nparenting practices being damaging.  He worries that he was a bad <br/>\nfather.  But, through those discussions, I think/hope he is discovering <br/>\nsome healing as well, and learning to be a better grandfather!<br/>\n<br/>\n-----I guess my thought was that Unschooling doesn&#39;t have to be an <br/>\ninsult to your parents or an admission of brokenness in yourself. And if <br/>\nyour parents seem insulted by the choice, it might be prudent to <br/>\nreinforce your respect and love for them (should they deserve it) and <br/>\ntry to include them so they can see the kids thriving.-----<br/>\n<br/>\nI didn&#39;t feel I was admitting brokenness in myself when I found <br/>\nunschooling... but there has been healing.  Does there have to be <br/>\nbrokenness?  Perhaps its just differentness?<br/>\n<br/>\nI would add: We should also not expect them to act as we would.  My <br/>\nmother-in-law is big on praise, positive reinforcement, and other very <br/>\nobvious tactics for changing behaviour.  My father is impatient, cannot <br/>\ndeal with tantrums, crying, walks away from conflict rather than <br/>\nsoothing the children.   Rather than feel as if what they do is <br/>\ndamaging, or not good enough, I&#39;ve decided to focus on the loving <br/>\nrelationship developing between them, and intervene when my father looks <br/>\noverwhelmed, and turn a blind eye to what grandma does... because in the <br/>\nlong run, their relationship, the love and memories they are creating, <br/>\nare more important to how the children turn out.  My own influence, my <br/>\nown style of parenting, will surely have the larger impact, me being <br/>\ntheir mother and spending so much time with them.   So also, I would add <br/>\nnot to feel threatened actions that seem non-unschooling, if they are <br/>\nessentially safe.</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Guilt and the ways your parents went wrong","postDate":"1270571614","msgId":52510,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGwyeTNhOTNmZmYxMTAwNDA2MDkzM3o4YWUyZjEyNW4zZDlmOTUwMDg0ZDhkOGVlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhwZmVicit1dDhvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhwZmVicit1dDhvQGVHcm91cHMuY29tPg=="},"prevInTopic":52504,"nextInTopic":52530,"prevInTime":52509,"nextInTime":52511,"topicId":52504,"numMessagesInTopic":0,"msgSnippet":"... your parents or an admission of brokenness in yourself.","messageBody":"<div id=\"ygrps-yiv-957568562\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I guess my thought was that Unschooling doesn&#39;t have to be an insult to<br/>\n </span></blockquote>your parents or an admission of brokenness in yourself.&lt;&lt;&lt;<br/>\n<br/>\nWithout a perception of brokenness where it exists, it&#39;s not likely that<br/>\npeople will see a corresponding need for change for themselves, let alone<br/>\nfor their home and their children.<br/>\n<br/>\nOn the other hand, I quoted a funny thing on FB once that went like this:<br/>\n&quot;You can&#39;t fix something that&#39;s not broken.&quot; Regardless of perception, if<br/>\nsomething isn&#39;t broken, fixing on things (nothing&#39;s perfect) might improve<br/>\nthings tweak by tweak and unless the perception is that things are terribly<br/>\nmessed up when they aren&#39;t (I don&#39;t think this is likely at home...<br/>\nhopefully) then doing things better, more peacefully, more contentedly,<br/>\nwon&#39;t mess anything up.<br/>\n<br/>\nWhat does mess things up (I&#39;ve tried it ;) is to know there is brokenness<br/>\nand rather than doing things more peacefully and better myself, to instead<br/>\ntell others around me to be more peaceful and do better. That quickly runs<br/>\nthings afoul around here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;And if your parents seem insulted by the choice, it might be prudent to<br/>\n </span></blockquote>reinforce your respect and love for them (should they deserve it) and try to<br/>\ninclude them so they can see the kids thriving.&lt;&lt;&lt;<br/>\n<br/>\nIt depends on the parents. Mine are so controlling about religious choices<br/>\nand morality, that the only thing that &quot;works&quot; is to make our differences<br/>\nplain... I live my life very differently (not in order to be different but<br/>\nbecause it&#39;s who/how I am), and after the predictable assay at changing my<br/>\nways, they eventually settled down into saying that we&#39;re really not<br/>\ndifferent. I can&#39;t (and don&#39;t want to) make people see me as I am, and as<br/>\nsoon as *I* became comfortable with that idea, the less energy I put on the<br/>\nmatter.  And the more energy I have for my family and our home and whatever<br/>\nwe&#39;re doing here.<br/>\n<br/>\nWhen we visit my parents/family, which Karl and I did yesterday, it&#39;s<br/>\npleasant because neither one of us are trying to change the other. I don&#39;t<br/>\ntry to change their idea(s) about me, and if they get upset with me about<br/>\nanything, I treat it lightly. It didn&#39;t used to be that way. I&#39;m the one who<br/>\nhas changed, really, by being myself and happy with it rather than being<br/>\nuncomfortable with it and constantly asking others to accept it. We have<br/>\npleasant visits because I keep the tempo of the conversation moving rather<br/>\nthan letting it meander to our differences that I don&#39;t want to dwell on and<br/>\nalso because I stay only for a short time. Karl at 6 says it&#39;s boring, and<br/>\nabout 10 minutes before we left he whispered in my ear &quot;can we go yet?&quot; and<br/>\nmy dad jokingly told him no secrets are allowed. That was my cue to wrap<br/>\nthings up. I mentioned the gardening I&#39;m doing and as we walked outside they<br/>\nshowed us things they&#39;re doing with their own garden. It was good to see<br/>\nthem and I&#39;m glad to visit because they&#39;re getting so old and might not be<br/>\naround for much longer.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":312331466,"authorName":"Camille","from":"&quot;Camille&quot; &lt;camilleystevens@...&gt;","profile":"camilleyrichards","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Guilt and the ways your parents went wrong","postDate":"1270561979","msgId":52504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwZmVicit1dDhvQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":52510,"prevInTime":52503,"nextInTime":52505,"topicId":52504,"numMessagesInTopic":0,"msgSnippet":"I had a thought recently (and I hope it s ok that I post my ramblings on it) about why it s so hard for some to go from either sending your kids to school or","messageBody":"<div id=\"ygrps-yiv-956762996\">I had a thought recently (and I hope it&#39;s ok that I post my ramblings on it) about why it&#39;s so hard for some to go from either sending your kids to school or school-at-home to unschooling. Unschooling is very very different than what most people are used to.  It&#39;s a lifestyle change.  And for some, if not most people, lifestyle changes require that you admit some flaw in your previous lifestyle.  Switching to Homeschooling only requires an admission that school might not be the best environment for our kids to grow up in.  Unschooling requires much much more.  And I think it&#39;s hardest for some to admit there might have been something wrong with the way our parents raised us.  Which, for some people, means that there is something wrong with them, personally.  <br/>\n<br/>\nI think most people get along with and/or love their parents.  Personally, I love my mom and step-dad but I&#39;m not entirely sure I *like* them.  Ironically, my mother said the same thing to me once.  But that&#39;s another discussion. lol.  It&#39;s not hard for me to admit my parents had it all wrong.  But others who love and respect their parents don&#39;t want to &quot;betray&quot; them by choosing a different lifestyle choice than what they grew up with.  <br/>\n<br/>\nI don&#39;t think this choice is a betrayal, however.  Many of our parents didn&#39;t have any exposure to the ideas of Unschooling when we were kids.  Sure, it was there but information of this nature didn&#39;t get around like it does today.  I think it&#39;s also important to take into account the childhood of our parents.  What type of history is there that may have led them to choose a certain parenting style or school choice.  I&#39;m pretty sure my mother was easy on me compared to her own childhood.  That doesn&#39;t make her choices any less scarring on my inner child, but I can understand them better now that I see the big picture.  Those who had mostly happy childhoods probably had parents with mostly happy childhoods.  Or their parents made the same changes I&#39;m making as a reaction to a miserable childhood.  <br/>\n<br/>\nI guess my thought was that Unschooling doesn&#39;t have to be an insult to your parents or an admission of brokenness in yourself.  And if your parents seem insulted by the choice, it might be prudent to reinforce your respect and love for them (should they deserve it) and try to include them so they can see the kids thriving.  So much of what Unschooling is about is the kids&#39; happiness, but I think a lot of making the decision requires deep introspection and coming to terms with who you are inside as a person and a parent.  Until you can be comfortable with your history looking completely different than your child&#39;s future, it probably won&#39;t be a smooth ride.  It will be easier for some than others, but it&#39;s certainly not a trivial moment in anyone&#39;s life.<br/>\n<br/>\nAnyway, these are just some recent thoughts and I&#39;d welcome further discussion on it.  :)<br/>\n<br/>\n~Camille~</div>","specialLinks":[]}],"prevTopicId":52460,"nextTopicId":52537}}