{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":125056900,"authorName":"ladymagic@mchsi.com","from":"ladymagic@...","profile":"princessdee20012001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:] New Beginnings/Making It Work Help longRE","postDate":"1071697969","msgId":17606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":0,"prevInTime":17605,"nextInTime":17607,"topicId":17606,"numMessagesInTopic":0,"msgSnippet":"I have missed the orgnail post but have read lots of the fallow up and so forth. I am both the grand mother that watches for free and a mother and did run a","messageBody":"<div id=\"ygrps-yiv-1986344725\">I have missed the orgnail post but have read lots of the fallow up and so <br/>\nforth. I am both the grand mother that watches for free and a mother and did <br/>\nrun a home day care for over 11 years.Also have ex in laws and a ex husband.<br/>\n first  when I was a young mother I had my ex mother in law(not ex at time) <br/>\nwatch my child, she was all I had and i wanted so badly to learn from her (why <br/>\nI don&#39;t know problie some part of me wanted that  mother &#39;daughter thing) Big <br/>\nBig mistake in the beginning. to the point that my doctor told me look kid she <br/>\nis having you take her to me for green poop( honestly she told me green meant <br/>\nshe was infected and need imedent help so off to  Doc I went) Doctor laffed <br/>\nsaid ya don&#39;t want it green don&#39;t feed her peas!!<br/>\nLesson for me:  mothers Don&#39;t know every thing and They still family ,( later <br/>\nlesson neither do doctors but that diff story.)<br/>\nIn later years I married a widower with children, We decided to go with out new <br/>\ncars and other things to make it so I could stay at home and raise the kids and <br/>\nI ran a home day care  for on the avrage of 11 children coming and going on a <br/>\ndaily  secduleI always did a 2 week trail to see if the kids could adjust and <br/>\nif the parents and I could communicate and if the family&#39;s could do well <br/>\ntogether. to elmatie the bigger problems like i need to turn into the Big bad <br/>\nmeanie. I may had been the hired help but I also felt I was a partner in <br/>\nraising children the could be a good thing or a bad thing for all <br/>\ninvolved.These children where to be part of my home daily.I became close to <br/>\nthese children and they to me we still get christmas cards and many still come <br/>\nto my home or call many have kids of there own now and others do bragging with <br/>\nthere other freinds. sending a child to a sitter is gr8 for me and the parents <br/>\niof the children I watched as long as we knew that sending them to a sitter for <br/>\n45 hours a week ment we where there to help raise happy children. there where <br/>\ndisagreements and we didt always agree but kept in mind that we did what was <br/>\nbest for the envrioment and children first if they where grounded at home  then <br/>\nthat was at home and if they where grounded from tv there then it was between <br/>\nthem  when they where older it held as i cant spend all my day keeping track <br/>\nof  who is what  one from this or that.<br/>\n I also watched and still watch my grand child this is a lil different we dont <br/>\nalways agree and never will and guess what I am not always right and neither is <br/>\nher mother.and the green poop lady still is in the picture and nuttier than <br/>\never. and still family.<br/>\nThis is how we deal in our family not  by any means  the right way just how it <br/>\nhas worked for us:<br/>\nI watch Destiny (grandchild) and the entire family watches her as I also work <br/>\nwe feel it is a fmily thing for us to do,we still share a lot of the same <br/>\nvalues,we had the oppist when destiny was small I wanted my daughter to nurse <br/>\nlonger and she  got tired of it went to bottle guess what not my choice it was <br/>\nhers. Hard lesson for me I am The grandmother not the mother. My daughter also <br/>\ntok her to a sitter I didnt aprvoe of once or twice when  we couldnt sit and <br/>\nguess what  I am not in charge I am greatful for what time I do have with <br/>\nher.And I still have to bite my tounge alot when I here she is over there.<br/>\nThen there is the green poop lady  she tryed to teach Destiny how to lie to mom <br/>\nand grand ma over something they dis agreed with I opened  my mouth on this one <br/>\nas it wasnt the issue of wether or not 4 was to old for a bottle  (gr8 grandma <br/>\nwas sneeking her one cuz a  sippie cup was inconvent for gr8 gma) I interveined <br/>\nwith the teaching to lie and hide things from mom my opion is and was that <br/>\nteaching to lie and to use the they will be mad at you  as a threat confuses <br/>\nand in my opion sets up other issuses for pretature ext.<br/>\nWe limited time with gr8 grand ma.2 hour streches  my daughter had a long talk <br/>\nwith her on what she was feeling. not that gr8 grandma still does what she <br/>\nlikes but that is the risk and she is family .Destiny will learn  hopefully <br/>\nfrom those she is exposed to the most and will  still maintain a loving <br/>\nrealinship with her bio gr8 gama.<br/>\nThis is same that my paid sitting  children did we  looked for simular values <br/>\nand  ways of dealing with things  in such amanner we could all live with.To <br/>\nhave some one watch your children paid realated or not It was important to us <br/>\nas a family to rember they are in a big sence partnering in parenting. I often <br/>\nhave my grand child 50 or more hours a week just like I did with  baby sitting <br/>\nkids. and then  a lot on week ends.In a lot of ways I know we are luckyer than <br/>\nothers as  my youngest is 13 and oldest is 27  WE are all different in many <br/>\nways  from devote Christens to pagan to agnostic. we all do things a lil <br/>\ndifferent when the christen  watches the pagans kid they dont take off evey <br/>\nthing that says christ and so forth we dont correct each other on belifs we  <br/>\njust know we are different and celbrate those differences and what a wonderful <br/>\nway for US to be. the children choose, the children live and they grow. Despite <br/>\nthe bottles and green poop and learn  thru example, to think for them selves. <br/>\nAnd ya know what  parents get to help  thru example of communcation and showing <br/>\nof love no matter how little(or big)  the children are I for one belive they <br/>\nlearn about stress and conflict mangent  before day one.<br/>\nThese are my opions not to reflect the opions of the group as a whole.I am no <br/>\nexpert  and a newbie to this group myself. and value the opions of this group. <br/>\nthat does not mean I try every lil thing posted here  heck I dont want to darn <br/>\nsocks! I have found this group to be loving helpful opionated and  a gr8 asset <br/>\nto my life.<br/>\nDee</div>","specialLinks":[]}],"prevTopicId":17589,"nextTopicId":17608}}