{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"sharonve@aol.com","from":"sharonve@...","profile":"sharonve","replyTo":"LIST","senderId":"T91LKksn1e63Cdo4s47PtndV36aVsj_2YBXNMztAvuXns8STPOVBQHiobahbCFLNdEH8eZFRxg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] fantasy gaming vs real challenges","postDate":"1006877420","msgId":38,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2LjE4MDg2ZDA0LjI5MzUxNGVjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":37,"nextInTime":39,"topicId":38,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/27/01 1:04:01 AM, SandraDodd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-200120204\">In a message dated 11/27/01 1:04:01 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n&lt;&lt; -=-This is way out there, but I feel like people can never get enough of <br/>\n(be satisfied by) something that isn&#39;t really satisfying. -=-<br/>\n<br/>\nIt seems to be the nature of humans to feel unsatisfied, to want something <br/>\nmore, better, different, and new. &gt;&gt;<br/>\n<br/>\nSatisfaction is having a need met.  It can also be lesson learned, job well <br/>\ndone, confirmation of a path taken.  It can be the feeling of a moment&#39;s <br/>\nreflection, or an overview.  To say that something isn&#39;t really satisfying <br/>\nseems to demand more of the feeling than is necessarily appropriate.  To <br/>\nimply that unless imbued with altruism, the feeling is selfish and of lower <br/>\nquality.  <br/>\n<br/>\nNick (my 12 year old) seems to find real satisfaction in playing D&D.  Go <br/>\nfigure.  What he gets out of it:<br/>\n<br/>\nHe has characters he imbues with characteristics and personality -- he <br/>\ncontrols their actions but not their fate.  He learns to deal with adversity <br/>\nand disappointment, to come up with solutions to unexpected challenges.  He <br/>\nexperiments with responses which have no real life consequences, in the <br/>\ncompany of friends.  He gets to make mistakes and try again, without hurting <br/>\nsomeone &quot;real&quot;.  He and his friends play for hours at a time -- they argue <br/>\nand negotiate, debate the merits of a over b -- these are real skills which <br/>\nwill in future serve them well.  <br/>\n<br/>\nHe&#39;s also the Dungeon Master (the person who develops the story for a group <br/>\nof gamers) for a weekly online group.  He started this group -- and has <br/>\nmembers ranging from 15 to 30 years in age.  His ability to plan a quest in <br/>\nadvance, to decide what problems the groups will face, which monsters they <br/>\nwill encounter, what pitfalls will spring up -- amazes and pleases me.  I <br/>\nvalue his imagination and ability to guide and inspire others.<br/>\n<br/>\nChildhood is short.  I know there&#39;s a mindset which says that we denigrate <br/>\nchildhood by assuming it wants no altruism, to make no real difference in the <br/>\nworld.  That to imply by allowing children to stay at home or in school, <br/>\n&quot;wait until you&#39;re older to make a real difference&quot; invalidates the child as <br/>\na whole and capable person.  Eh.  <br/>\n<br/>\nWhen I was in seventh grade, as a class, we collected money for food, <br/>\npackaged it up, and drove an hour and a half to a small town, and delivered <br/>\nfood packages to families whose fathers were in jail.  I felt both awkward <br/>\nand self-righteous -- awkward because some families seemed uncomfortable with <br/>\nus trooping into their house with boxes of food, and self-righteous because <br/>\nsome famiies lived in &quot;nice&quot; houses and how was it they needed this support?  <br/>\nI did a supportive action, without having the perspective to really <br/>\nunderstand it.  I got the underlying emotions, without awareness of what <br/>\ntheir situations really were.    <br/>\n<br/>\nThat same year, we spent some time playing with children at a penitentiary, <br/>\nduring visiting hours for families, so husbands and wives could talk without <br/>\ninterruption.  There was resentment and hostility swirling around which now, <br/>\nI can certainly understand.  But then, it was confusing and alarming.  <br/>\n<br/>\nThere are children who&#39;ve done amazing things with volunteer efforts.  There <br/>\nare adults as well.  But not all adults do.  Not all children do.  Such is <br/>\nlife.  <br/>\n<br/>\nI want to give my kids time to grow up internally, at their pace, in a <br/>\nsupportive environment geared to who they are.  I contribute to causes which <br/>\nare important to me -- and if my kids decided they wanted to participate in a <br/>\ncause, I&#39;d support that too.  But I&#39;m not going to nudge them into it as <br/>\nsomething which they should be doing now, to be real.  There are gives and <br/>\ngets, as in all things.<br/>\n<br/>\nSharon</div>","specialLinks":[]}],"prevTopicId":17,"nextTopicId":41}}