{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":310848040,"authorName":"Ali Zeljo","from":"Ali Zeljo &lt;azeljo@...&gt;","profile":"azeljo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] joking around/hurtful words","postDate":"1425577533","msgId":75734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUHpoTHF6d1V1ekNONUhvcGZ3YWMrM2NTSFNPU2hCVVY3MTlpTzZrdXo0a3NtME40UUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75733,"nextInTopic":0,"prevInTime":75733,"nextInTime":75735,"topicId":75724,"numMessagesInTopic":0,"msgSnippet":"Hi,  I deal with similar dynamics in my house with 4 kids too.  One thing that I do is physically remove the child who is saying mean things if he won t stop.","messageBody":"<div id=\"ygrps-yiv-1498463703\"><div dir=\"ltr\"><div><div>Hi,  I deal with similar dynamics in my house with 4 kids too.  One thing that I do is physically remove the child who is saying mean things if he won&#39;t stop.  And I am a lot more firm with my words.  I will say &quot;I&#39;m sorry he&#39;s being like this. excuse me while i talk to him&quot; to the child who is being criticized and then I will bring the aggressor out of the room and be very firm with my words saying his words are really hurting his brother and he can not say those things to him anymore.  <br><br>If the time is right, I am sometimes able to have a longer conversation that helps me figure out why he was saying those things.  With my 11 year old, it is often that he wants my attention and is feeling jealous.  So I give him some ideas for nicer and more direct ways to express that to me.  And then I help him think of some things he enjoys doing while waiting for me rather than tormenting a brother.  Sometimes it is that he wants the attention of the little brother, and I help him think about how the mean things he says might be affecting his little brother.  He could choose a friendly invitation instead and get happier results.   I don&#39;t have all these conversations at one time.  But we have also discussed how it makes him (the aggressor) feel inside when he is making fun of someone else.  I think it is helpful to point out the difference in how he feels in his heart when he is saying something nice v. something mean.  <br><br></div>In the case of your daughter, it almost sounds like she is enjoying the adorableness of her little sisters.  But it makes the little sister feel belittled.  So I wonder if you can help her come up with different ways of adoring her sisters.  Maybe she could come up with ideas on her own.  She is taking the time to listen to a sister struggling to find words and taking the time to notice what a sister is wearing.  And even with the brother buttering the toast, she is observing him closely and coming close to trying to help him.  It&#39;s almost like she is just lacking some fine-tuned social skills, or perhaps she is ready to take on a mentor-type role with them..  It may be that she truly doesn&#39;t mean to hurt them!  Maybe you can help her to shift her commentary a little.  She could say, wow, you are still able to fit in to those 4T clothes- it&#39;s like you are inventing a whole new fashion style!  Or, wow that&#39;s a lot of butter. Do you like it that buttery, or do you need some help getting some off?  <br><br></div>~Ali<br><div><br><br><br><div><br><br><div><div class=\"ygrps-yiv-1498463703gmail_extra\"><br><blockquote><span title=\"qreply\"> <div class=\"ygrps-yiv-1498463703gmail_quote\">On Tue, Mar 3, 2015 at 5:58 PM, Sandra Dodd Sandra@... [AlwaysLearning] <span dir=\"ltr\">&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;</span> wrote:<br><blockquote class=\"ygrps-yiv-1498463703gmail_quote\" style=\"margin:0 0 0 .8ex;border-left:1px #ccc solid;padding-left:1ex;\">\n\n\n<u></u>\n\n\n\n\n\n\n\n\n\n \n<div style=\"background-color:#fff;\">\n<span> </span>\n\n\n<div>\n  <div>\n\n\n    <div>\n      \n      \n      <p>The topic should be <br>\n&quot;joking around&quot;/hurtful words<br>\nwith quotation marks, but yahoogroups would&#39;ve messed it up. :-)<br>\n<br>\nThis is being posted anonymously.  It&#39;s an interesting situation, and I hope people will have lots of ideas.  Thanks, anyone who can help.<br>\n______________________________________<br>\n<br>\nOur oldest of four children, 11 y.o. daughter, has a habit of joking around with her other siblings by saying things that are not thought of as funny to them.  Four examples for now:<br>\n<br>\nShe will giggle/laugh when my youngest daughter is trying to get her thoughts out about something while talking to me. My youngest will say &quot;can you please stop laughing while I am talking?&quot;.  I will look at my oldest and say &#39;please stop. let her talk.&#39;  She will respond &quot;I&#39;m sorry, its funny. (meaning how long it takes for my daughter to verbalize her thoughts).  I say &#39;no, it&#39;s not.&#39;<br>\n<br>\nShe will joke that my 7 y.o. daughter still likes wearing her clothes that are size 4T and are tight but she likes wearing them. My daughter will say &#39;ha, you&#39;re wearing size 4T clothes and you&#39;re 7&quot;. I will look at my oldest a say &#39;please stop.&#39;  Lately I say &#39;please stop. You are being mean&#39;. She will say &quot;sorry, its funny&quot;. I say &#39;no, it&#39;s not.&#39;<br>\n<br>\nMy youngest daughter likes to watch a Netflix show called Horseland. My oldest will be with us watching and says &#39;this show is so annoying. How can you watch this?&#39;  I say &#39;she likes it. leave her alone.&#39;  or  I say &#39;we don&#39;t say anything mean about your shows. please stop.&#39;<br>\n<br>\nWhen my son is putting butter on his waffles, she will say &#39;oh my gosh, that is waaaay too much butter.&#39;  My son says &#39;leave me alone.&#39;<br>\nand says it now with more frustration because it has been going on for too long. <br>\n<br>\nWhile my son is playing his computer games, she will walk over to his computer area, stand over him and say &#39;what are you doing? why are you doing that?&#39;.  Nobody else says these things. I don&#39;t understand why she seems to be seeking out a victim to her comments. <br>\n<br>\nThis has been going on for about a year now and I used to say &#39;please stop&#39;,  &#39;please stop&#39;. Now I say &#39;stop&#39; more firmly. Still possibly too gentle? I have been slow to realize how much it is hurting my youngest daughter who recently told her sister &#39;do you realize how much you are hurting my feelings when you say those things?&#39; I hear the &#39;joking&#39; comments and want to say &#39;please stop&#39; to my oldest wishing that it will. However, it is not stopping .  <br>\n<br>\nI am present with all four children and hearing these comments daily is hurtful to me. I spend a lot of time with my eldest, possibly more than I do with the others, thinking that more listening and fun conversations, more time baking together, watching her favorite shows together and watching favorite episodes repeatedly and have entire lines memorized to laugh about together, cooking more foods that she likes, enjoying listening to her sing and telling her she is amazing, making &#39;alone time&#39; for us to go out and clothes shop when we can or get her favorite dessert at a diner, taking her to a Taylor Swift concert-her favorite singer, etc.  <br>\n<br>\nI don&#39;t understand the meanness. There is jealousy between my oldest and youngest daughter because my mother-in-law has inappropriately named our youngest daughter her &#39;ray of sunshine&#39; in front of my oldest and makes it obvious &#39;how cute&#39; she thinks our youngest is. This definitely has not help the situation and has given my oldest daughter more reason to put my youngest down. My mother-in-law has said she &#39;feels bad&#39; for my youngest daughter b/c she thinks the &#39;others&#39; don&#39;t understand her. <br>\n<br>\nSince reading on this list, I&#39;ve realized that I would not want someone coming into our house joking around with my youngest, saying hurtful things so why would I let this happen by my own oldest child. Basically, I don&#39;t know what to do.  I keep hoping that my oldest will soon stop. I sat down with both of my daughters and told my oldest that I would not allow someone to come into our house and speak to our youngest the way that she does, so stop. But in my mind, I am thinking &#39;what if she doesn&#39;t stop, then what...?&#39;.   And she has continued to make her jokes, then follow up her comments with &#39;I&#39;m sorry, I&#39;m joking. I&#39;m kidding.&quot;   I am wishing my oldest could understand being mindful of her words and how they affect people. How can I help her with this? I have been gentle and kind about her &#39;joking&#39; by saying &#39;please stop&#39;. At the same time, I am not being kind to my other children by not stopping the &#39;joking&#39;. <br>\n<br>\nCan you post this anonymously, please? I would appreciate any thoughts/help. <br>\n<br>\n_________<br>\nend of anonymous post</p>\n\n    </div>\n     \n\n    \n    <div style=\"color:#fff;min-height:0;\"></div>\n\n\n</div>\n\n\n\n  \n\n\n\n\n\n\n</div></div></blockquote></div><br></span></blockquote></div></div></div></div></div>\n</div>","specialLinks":[]},{"userId":486569116,"authorName":"Cheri Tilford","from":"Cheri Tilford &lt;cheri.tilford@...&gt;","profile":"boobearcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: joking around/hurtful words","postDate":"1425574816","msgId":75733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5MTBEQjM2LURFMUQtNDhCQS1BMTQyLTk0OEQyRkQzQzhFNEBnbWFpbC5jb20+"},"prevInTopic":75732,"nextInTopic":75734,"prevInTime":75732,"nextInTime":75734,"topicId":75724,"numMessagesInTopic":0,"msgSnippet":"my first thought is there s a control issue here:  by making fun of her siblings, she s subtly and covertly trying to control their behavior. so I might look","messageBody":"<div id=\"ygrps-yiv-1169869622\">my first thought is there&#39;s a control issue here:  by making fun of her siblings, she&#39;s subtly and covertly trying to control their behavior.  <br/>\n<br/>\nso I might look at why she is trying to control things that are not in her control, but they&#39;re in her environment which makes them available.  what leads a person to seek control?  often anxiety of some sort.  she&#39;s 11.  depending on her developmental rate she could be approaching puberty, or fully in it already.  all sorts of changes are happening to her that are completely out of her control.   <br/>\nwhat can be made available to her (objects, events, meals, etc) that gives her more of a sense of power in her world?  maybe then she won&#39;t try to take power inappropriately and in a way that hurts others.  <br/>\n<br/>\nI think it&#39;s helpful to assume she really is sorry and doesn&#39;t in fact want to hurt her siblings, but she&#39;s trying to satisfy a need and she can&#39;t figure out a good way. <br/>\n<br/>\n<br/>\ncheri</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] joking around/hurtful words","postDate":"1425569199","msgId":75732,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0QzRCNEUzLUFCNUMtNENEMC05QjlELUU0QzA2RkY1NDg4NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEZDMjkwOUQ5LTU0QzMtNDA2RC1CRjVDLTAwNUQ2QTdDMjEzREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4gPEZDMjkwOUQ5LTU0QzMtNDA2RC1CRjVDLTAwNUQ2QTdDMjEzREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75731,"nextInTopic":75733,"prevInTime":75731,"nextInTime":75733,"topicId":75724,"numMessagesInTopic":0,"msgSnippet":"Another possible angle that these made me think of: -=-My oldest will be with us watching and says this show is so annoying. How can you watch this?’ ","messageBody":"<div id=\"ygrps-yiv-1276119877\">Another possible angle that these made me think of:<br/>\n<br/>\n<br/>\n-=-My oldest will be with us watching and says &#39;this show is so annoying. How can you watch this?’ <br/>\n<br/>\n-=-When my son is putting butter on his waffles, she will say &#39;oh my gosh, that is waaaay too much butter.’ <br/>\n My son says &#39;leave me alone.’ -=-<br/>\n<br/>\nMAYBE she&#39;s feeling powerless.<br/>\nMaybe the family moved from more controls (with the older girl) to fewer controls, and she resents the siblings&#39; freedom.<br/>\n<br/>\nWhen a family changes their stance and policies, it can be frustrating and resentment-inducing for the older child who was told no much more than the younger ones.<br/>\n<br/>\nIn such cases, the parent might want to have a conversation away from the rest of the family, and express the wish that things had been different, and sweeter.<br/>\n<br/>\nIt might help to ask her for advice on how to make things more peaceful.  When I was teaching Jr. High, if there was a discontent, disruptive kid, sometimes I would ask him to help me keep peace in the room.  <br/>\n<br/>\nIt might help to ask the other kids (individually, casually) for ideas, too.  They might not mind what she&#39;s doing as much as you imagine they do.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\nInstead of a face-to-face conversation, this sort of thing is better side by side.  Not in a grocery store or restaurant, though.  In a car, so there&#39;s privacy and time to just think or be quiet without awkwardness.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] joking around/hurtful words","postDate":"1425568760","msgId":75731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJCMUU4RDgwLUU2MEItNEUxMy04Qzk2LThENkM2REJGMDU2N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDJGMUUwRkE4LTY4MzgtNEZDRi1BQzU4LUNENDY3NkNDNzgzM0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4gPDJGMUUwRkE4LTY4MzgtNEZDRi1BQzU4LUNENDY3NkNDNzgzM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75730,"nextInTopic":75732,"prevInTime":75730,"nextInTime":75732,"topicId":75724,"numMessagesInTopic":0,"msgSnippet":"... Branching off from what Sandra wrote, if you re unconsciously treating your kids differently because of age and order, Siblings Without Rivalry might help","messageBody":"<div id=\"ygrps-yiv-2099121868\"><blockquote><span title=\"ireply\">&gt; On Mar 5, 2015, at 9:39 AM, Sandra Dodd wrote:<br/>\n&gt; <br/>\n&gt; Other parents sometimes use a voice to an oldest child<br/>\n<br/>\n </span></blockquote>Branching off from what Sandra wrote, if you&#39;re unconsciously treating your kids differently because of age and order, Siblings Without Rivalry might help you be more aware of the part you might be playing in the dynamic.<br/>\n<br/>\nSiblings Without Rivalry by Adele Faber and Elaine Mazlish<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://smile.amazon.com/Siblings-Without-Rivalry-Children-Together-ebook/dp/B007HXL1V0/\">http://smile.amazon.com/Siblings-Without-Rivalry-Children-Together-ebook/dp/B007HXL1V0/</a><br/>\n<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] joking around/hurtful words","postDate":"1425566483","msgId":75730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGMkM2NDgzLUJBNDMtNDZDOC1CODE4LTkyRDFBNTAyMTkzM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75729,"nextInTopic":75731,"prevInTime":75729,"nextInTime":75731,"topicId":75724,"numMessagesInTopic":0,"msgSnippet":"In my previous post, I went toward empathy and understanding. What I said when one of my kids was harsh to another was something like this: If a stranger came","messageBody":"<div id=\"ygrps-yiv-1159451901\">In my previous post, I went toward empathy and understanding.<br/>\n<br/>\nWhat I said when one of my kids was harsh to another was something like this:<br/>\n&quot;If a stranger came in here and did this, I would throw him out or call the police.  I can&#39;t let you do it.&quot;<br/>\n<br/>\nand I said often (which should be a reminder that once isn&#39;t enough) over the years &quot;He needs to be safe in his own home.&quot;  <br/>\n<br/>\nI&#39;ve said (in a light-hearted, joking kind of way, but it was still real):  &quot;When you&#39;re grown, invite him over to your house and say that, but don&#39;t say it at MY house.&quot;  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] joking around/hurtful words","postDate":"1425566344","msgId":75729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGMUUwRkE4LTY4MzgtNEZDRi1BQzU4LUNENDY3NkNDNzgzM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75728,"nextInTopic":75730,"prevInTime":75728,"nextInTime":75730,"topicId":75724,"numMessagesInTopic":0,"msgSnippet":"There s no one thing that will immediately change the situation, but a few things that might help turn it another direction. I would apologize to the other","messageBody":"<div id=\"ygrps-yiv-589612605\">There&#39;s no one thing that will immediately change the situation, but a few things that might help turn it another direction.<br/>\n<br/>\nI would apologize to the other kids whose feelings might be hurt, whose peace might be disturbed.  You could say &quot;I&#39;m sorry she&#39;s not being nicer.&quot;  Not in a dramatic way, just a matter-of-fact way.  Casual.  They might want to talk about it.  They might just shrug and say &quot;That&#39;s okay.&quot;  Don&#39;t force a long conversation—that&#39;s like salting a wound, or rubbing ink on a scratch. :-)<br/>\n<br/>\nHaving an outsider talk to her might be helpful.  If you have a friend or relative who might be able to talk to her about being nicer, she might listen better elsewhere.<br/>\nIt might be worth a session or two by skype or e-mail with one of the folks here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/issues/therapy\">http://sandradodd.com/issues/therapy</a><br/>\n<br/>\nBecause I don&#39;t know the family, this is just a guess based on other families I&#39;ve seen.  IF the tone of voice you use to speak with her is any different from the tone of voice you use to speak to an adult friend, there may be an dynamic of her feeling [depending on the tone] babied (on one end) or shamed and pressured (on the other).  <br/>\n<br/>\nSometimes parents use a sing-songy voice to children, and that voice can be a trigger as kids get older for them to ignore the mom, or to bristle at being spoken to like a puppy or a baby.<br/>\nOther parents sometimes use a voice to an oldest child that suggests that the child should really, as the oldest, be doing everything better, and smarter, and never being a problem.<br/>\n<br/>\nIf any of those factors are in ply, try to eliminate them gently, gradually.<br/>\n<br/>\nThink, sometimes, what the child&#39;s life might be like if she were an only child and be compassionate about her loss of that opportunity.   I used to talk to Kirby sometimes about what if he were an only child, if there had been no Marty or Holly.  Just in a wistful sort of way, like we would have had more time together, and more money to spend.  I wasn&#39;t expressing regret or sorrow.  I was saying &quot;Life could have been different, and it would have been another kind of nice,&quot; and I&#39;d hug him and smile and not go all dramatic.  But acknowledging that part of the problem the oldest kid is having was inflicted (not by meanness, but still) by the parents having more children.   <br/>\n<br/>\nIt&#39;s not my analogy, but it works.  A mother who is harsh to an oldest child (perhaps because the mom was not an oldest herself) might benefit from imagining how she might feel if her husband took other wives and she was the first, the older, the replaced one.  Not to dwell on it, just to let it trigger some empathy and compassion.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] joking around/hurtful words","postDate":"1425498442","msgId":75728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZDMjkwOUQ5LTU0QzMtNDA2RC1CRjVDLTAwNUQ2QTdDMjEzREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":75726,"nextInTopic":75729,"prevInTime":75727,"nextInTime":75729,"topicId":75724,"numMessagesInTopic":0,"msgSnippet":"Divia s having a hard time with formatting, so I ve brought this and edited it. From: Divia Eden  Subject: Re: [AlwaysLearning] joking","messageBody":"<div id=\"ygrps-yiv-950639773\">Divia&#39;s having a hard time with formatting, so I&#39;ve brought this and edited it.<br/>\n<br/>\nFrom: Divia Eden &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diviaeden@...\">diviaeden@...</a>&gt;<br/>\nSubject: Re: [AlwaysLearning] joking around/hurtful words<br/>\n<br/>\n<br/>\n-=-This is being posted anonymously. It&#39;s an interesting situation, and I hope people will have lots of ideas. Thanks, anyone who can help.-=-<br/>\n<br/>\nI have a thought that I hope will help. <br/>\n<br/>\n-=- She will giggle/laugh when my youngest daughter is trying to get her thoughts out about something while talking to me. -=-<br/>\n<br/>\n-=-She will joke that my 7 y.o. daughter still likes wearing her clothes that are size 4T and are tight but she likes wearing them. -=-<br/>\n<br/>\n-=-My oldest will be with us watching and says &#39;this show is so annoying. How can you watch this?’ -=-<br/>\n<br/>\n-=-When my son is putting butter on his waffles, she will say &#39;oh my gosh, that is waaaay too much butter.’ <br/>\nMy son says &#39;leave me alone.’-=-<br/>\n<br/>\nThe pattern I’m seeing here is that your daughter seems to have ideas about what is socially acceptable, and is making fun of her younger siblings when they violate the norms she has intuited.<br/>\n<br/>\nMaybe try finding a time when the younger ones aren’t around to to talk to her directly about social norms, violating them, things that young kids are aware of vs. what older kids are aware of, etc. I’d make a point of validating that she does in fact have more social awareness than they do (in so far as it’s true).<br/>\n<br/>\nAs a kid, I remember worrying when I thought I’d figured out a set of social rules and was scrupulously following them, but people close to me weren&#39;t. I worried that I’d be socially punished for their “violations”.<br/>\n<br/>\nMight not be what’s going on with her, but I’d try to check for something in that vicinity. If she thinks you get that she’s a big kid who understands stuff the younger ones don’t, she might not be so attached to expressing her views in a mean way.<br/>\n<br/>\n[end of quote from Divia Eden &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diviaeden@...\">diviaeden@...</a>&gt;]</div>","specialLinks":[]},{"userId":495438666,"authorName":"Sarah Thompson","from":"Sarah Thompson &lt;thompsonisland@...&gt;","profile":"wallacesmum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] joking around/hurtful words","postDate":"1425470947","msgId":75726,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUHYrY1l4S2lFbVRkUWtfc0pTPW1BVzRyVkF6K0JXS3hCZktzTVhad0hUTlQrVWhXUUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEI1MkQ4Njg3LUUxN0EtNDBGNi04Qzk0LUJBN0JENjdGMUNDREBnbWFpbC5jb20+","referencesHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4JPEI1MkQ4Njg3LUUxN0EtNDBGNi04Qzk0LUJBN0JENjdGMUNDREBnbWFpbC5jb20+"},"prevInTopic":75724,"nextInTopic":75728,"prevInTime":75724,"nextInTime":75727,"topicId":75724,"numMessagesInTopic":0,"msgSnippet":"I was thinking about how I felt at that age. I was in school, and very unhappy socially. It got worse and worse. I was testing social behaviors, and getting","messageBody":"<div id=\"ygrps-yiv-1557476300\"><p dir=\"ltr\">I was thinking about how I felt at that age. I was in school, and very unhappy socially. It got worse and worse. I was testing social behaviors, and getting them wrong. The girls I had grown up with were suddenly popular and I was not.</p>\n<p dir=\"ltr\">Outside of a school setting, I wonder if the hormone-induced brain changes that plagued me at that age are also bothering her as she tries to make sense of what her place is in a social order. Does she have friends that she enjoys? Is it possible to give her more social time with people she chooses, rather than siblings? Maybe she needs some pals to be a little cool and exclusive with, go to movies or the mall, stuff like that?</p>\n<p dir=\"ltr\">Sarah</p></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"joking around/hurtful words","postDate":"1425430714","msgId":75724,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFMEM0MDhCLTBFQzAtNDZGNi1CRDc4LTBBNDhDMzdEMjQzQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":75726,"prevInTime":75723,"nextInTime":75726,"topicId":75724,"numMessagesInTopic":0,"msgSnippet":"The topic should be joking around /hurtful words with quotation marks, but yahoogroups would ve messed it up. :-) This is being posted anonymously.  It s an","messageBody":"<div id=\"ygrps-yiv-1636884190\">The topic should be <br/>\n&quot;joking around&quot;/hurtful words<br/>\nwith quotation marks, but yahoogroups would&#39;ve messed it up. :-)<br/>\n<br/>\nThis is being posted anonymously.  It&#39;s an interesting situation, and I hope people will have lots of ideas.  Thanks, anyone who can help.<br/>\n______________________________________<br/>\n<br/>\nOur oldest of four children, 11 y.o. daughter, has a habit of joking around with her other siblings by saying things that are not thought of as funny to them.  Four examples for now:<br/>\n<br/>\nShe will giggle/laugh when my youngest daughter is trying to get her thoughts out about something while talking to me. My youngest will say &quot;can you please stop laughing while I am talking?&quot;.  I will look at my oldest and say &#39;please stop. let her talk.&#39;  She will respond &quot;I&#39;m sorry, its funny. (meaning how long it takes for my daughter to verbalize her thoughts).  I say &#39;no, it&#39;s not.&#39;<br/>\n<br/>\nShe will joke that my 7 y.o. daughter still likes wearing her clothes that are size 4T and are tight but she likes wearing them. My daughter will say &#39;ha, you&#39;re wearing size 4T clothes and you&#39;re 7&quot;. I will look at my oldest a say &#39;please stop.&#39;  Lately I say &#39;please stop. You are being mean&#39;. She will say &quot;sorry, its funny&quot;. I say &#39;no, it&#39;s not.&#39;<br/>\n<br/>\nMy youngest daughter likes to watch a Netflix show called Horseland. My oldest will be with us watching and says &#39;this show is so annoying. How can you watch this?&#39;  I say &#39;she likes it. leave her alone.&#39;  or  I say &#39;we don&#39;t say anything mean about your shows. please stop.&#39;<br/>\n<br/>\nWhen my son is putting butter on his waffles, she will say &#39;oh my gosh, that is waaaay too much butter.&#39;  My son says &#39;leave me alone.&#39;<br/>\nand says it now with more frustration because it has been going on for too long. <br/>\n<br/>\nWhile my son is playing his computer games, she will walk over to his computer area, stand over him and say &#39;what are you doing? why are you doing that?&#39;.  Nobody else says these things. I don&#39;t understand why she seems to be seeking out a victim to her comments. <br/>\n<br/>\nThis has been going on for about a year now and I used to say &#39;please stop&#39;,  &#39;please stop&#39;. Now I say &#39;stop&#39; more firmly. Still possibly too gentle? I have been slow to realize how much it is hurting my youngest daughter who recently told her sister &#39;do you realize how much you are hurting my feelings when you say those things?&#39; I hear the &#39;joking&#39; comments and want to say &#39;please stop&#39; to my oldest wishing that it will. However, it is not stopping .  <br/>\n<br/>\nI am present with all four children and hearing these comments daily is hurtful to me. I spend a lot of time with my eldest, possibly more than I do with the others, thinking that more listening and fun conversations, more time baking together, watching her favorite shows together and watching favorite episodes repeatedly and have entire lines memorized to laugh about together, cooking more foods that she likes, enjoying listening to her sing and telling her she is amazing, making &#39;alone time&#39; for us to go out and clothes shop when we can or get her favorite dessert at a diner, taking her to a Taylor Swift concert-her favorite singer, etc.  <br/>\n<br/>\nI don&#39;t understand the meanness. There is jealousy between my oldest and youngest daughter because my mother-in-law has inappropriately named our youngest daughter her &#39;ray of sunshine&#39; in front of my oldest and makes it obvious &#39;how cute&#39; she thinks our youngest is. This definitely has not help the situation and has given my oldest daughter more reason to put my youngest down. My mother-in-law has said she &#39;feels bad&#39; for my youngest daughter b/c she thinks the &#39;others&#39; don&#39;t understand her. <br/>\n<br/>\nSince reading on this list, I&#39;ve realized that I would not want someone coming into our house joking around with my youngest, saying hurtful things so why would I let this happen by my own oldest child. Basically, I don&#39;t know what to do.  I keep hoping that my oldest will soon stop. I sat down with both of my daughters and told my oldest that I would not allow someone to come into our house and speak to our youngest the way that she does, so stop. But in my mind, I am thinking &#39;what if she doesn&#39;t stop, then what...?&#39;.   And she has continued to make her jokes, then follow up her comments with &#39;I&#39;m sorry, I&#39;m joking. I&#39;m kidding.&quot;   I am wishing my oldest could understand being mindful of her words and how they affect people. How can I help her with this? I have been gentle and kind about her &#39;joking&#39; by saying &#39;please stop&#39;. At the same time, I am not being kind to my other children by not stopping the &#39;joking&#39;. <br/>\n<br/>\nCan you post this anonymously, please? I would appreciate any thoughts/help. <br/>\n<br/>\n_________<br/>\nend of anonymous post</div>","specialLinks":[]}],"prevTopicId":75727,"nextTopicId":75735}}