{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":48651385,"authorName":"athom","from":"&quot;athom&quot; &lt;tessimal@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Testing, Testing & More Testing","postDate":"1050013991","msgId":64034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI3NHJmNytzbHNAZUdyb3Vwcy5jb20+","inReplyToHeader":"PDAwNmMwMWMyZmY2YSQ4NDhhY2I2MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+"},"prevInTopic":63868,"nextInTopic":0,"prevInTime":64033,"nextInTime":64035,"topicId":63854,"numMessagesInTopic":0,"msgSnippet":"... wrote: Many test readers are taking all kinds of medication.  Many are retired teachers and school administrators, supporting the AMA and the American","messageBody":"<div id=\"ygrps-yiv-1325628653\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, &quot;Mary&quot; &lt;mummy124@b...&gt; <br/>\nwrote:<br/>\n&lt;&lt;&gt;&gt;Many test readers are taking all kinds of medication.  Many are<br/>\nretired teachers and school administrators, supporting the AMA and<br/>\nthe American pharmaceutical industry on their retirement incomes with<br/>\na sack full of meds they take daily, if not hourly.  It is difficult <br/>\nenough to do this type of job well with a clear unmedicated mind, but <br/>\nthose on medication may have even more difficulty.&lt;&lt;&gt;&gt;<br/>\n <br/>\n&lt;&gt;Just wondered if the book actually researched this part of it or is <br/>\nit just making a blanket statement about retired people? Just seems <br/>\nvery unfair to say unless they actually know all the people who are <br/>\ntest readers.&lt;&gt;<br/>\n<br/>\nMary B.:<br/>\n<br/>\nThis does not come from a book but from a &quot;mole&quot; working in the <br/>\nbusiness.  And, no, not every senior working on a project is on tons <br/>\nof meds, but plenty of them are.  And, yes, it does effect their <br/>\nability to think clearly sometimes, as do many of the other things I <br/>\nmentioned in my post earlier.  <br/>\n<br/>\nNorma</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Testing, Testing & More Testing","postDate":"1049983647","msgId":63868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNmMwMWMyZmY2YSQ4NDhhY2I2MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PGI3M2szayttaXRhQGVHcm91cHMuY29tPg=="},"prevInTopic":63856,"nextInTopic":64034,"prevInTime":63867,"nextInTime":63869,"topicId":63854,"numMessagesInTopic":0,"msgSnippet":"From: athom  ","messageBody":"<div id=\"ygrps-yiv-1234613978\">From: &quot;athom&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tessimal@...\">tessimal@...</a>&gt;<br/>\n<br/>\n&lt;&lt;Many test readers are taking all kinds of medication.  Many are<br/>\nretired teachers and school administrators, supporting the AMA and<br/>\nthe American pharmaceutical industry on their retirement incomes with<br/>\na sack full of meds they take daily, if not hourly.  It is difficult enough<br/>\nto do this type of job well with a clear unmedicated mind, but those on<br/>\nmedication may have even more difficulty.&gt;&gt;<br/>\n<br/>\n<br/>\nJust wondered if the book actually researched this part of it or is it just<br/>\nmaking a blanket statement about retired people? Just seems very unfair to<br/>\nsay unless they actually know all the people who are test readers.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Testing, Testing & More Testing","postDate":"1049975033","msgId":63856,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNC4yMWE1YTg5My4yYmM2YjJmOUBhb2wuY29tPg=="},"prevInTopic":63855,"nextInTopic":63868,"prevInTime":63855,"nextInTime":63857,"topicId":63854,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/10/2003 7:32:31 AM Eastern Daylight Time, ... Interesting, but there hasn t been a politician who s not BIG into education . Our governor","messageBody":"<div id=\"ygrps-yiv-924095214\">In a message dated 4/10/2003 7:32:31 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sorcha-aisling@...\">sorcha-aisling@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; I read an enlightening article online a few weeks ago about the Bush and<br/>\n&gt; McGraw families, and their vacation homes next to each other, and how<br/>\n&gt; George W. and the President/C.E.O. of McGraw-Hill grew up together and<br/>\n&gt; are close friends.  <br/>\n<br/>\n </span></blockquote>Interesting, but there hasn&#39;t been a politician who&#39;s not BIG into <br/>\n&quot;education&quot;. Our governor just got elected because he wants &quot;tougher&quot; <br/>\nschools---in every sense of the word, in every way! (Testing, discipline, <br/>\nteachers, etc.)<br/>\n<br/>\nI think there is a senator or congressman somewhere out west who said schools <br/>\nsuck, but ecucation is a very common platform. They&#39;re ALL into testing.<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":108173680,"authorName":"Sorcha","from":"&quot;Sorcha&quot; &lt;sorcha-aisling@...&gt;","profile":"sorcha_aisling","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Testing, Testing & More Testing","postDate":"1049974222","msgId":63855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWMyZmY1NCQ5MmVlYmI1MCRiN2ViMTg0MUB5b3VyNmtyNHp4bGQ5MD4=","inReplyToHeader":"PGI3M2szayttaXRhQGVHcm91cHMuY29tPg=="},"prevInTopic":63854,"nextInTopic":63856,"prevInTime":63854,"nextInTime":63856,"topicId":63854,"numMessagesInTopic":0,"msgSnippet":"I read an enlightening article online a few weeks ago about the Bush and McGraw families, and their vacation homes next to each other, and how George W. and","messageBody":"<div id=\"ygrps-yiv-1261545823\">I read an enlightening article online a few weeks ago about the Bush and<br/>\nMcGraw families, and their vacation homes next to each other, and how<br/>\nGeorge W. and the President/C.E.O. of McGraw-Hill grew up together and<br/>\nare close friends.  It chronicled the passing of the No Child Left<br/>\nBehind Act and talked about how much money McGraw-Hill makes from their<br/>\nstandardized tests and their workbooks to prepare kids for standardized<br/>\ntests, and their curriculums teaching to the tests.  You can&#39;t walk into<br/>\na Barnes and Noble or Borders kids&#39; section without seeing dozens of<br/>\nMcGraw-Hill Test Prep workbooks, prominently displayed.  Wish I&#39;d<br/>\nbookmarked the article.  I think it was linked from a site about high<br/>\nschool kids who are protesting standardized tests.<br/>\n <br/>\nSorcha<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":48651385,"authorName":"athom","from":"&quot;athom&quot; &lt;tessimal@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Testing, Testing & More Testing","postDate":"1049973684","msgId":63854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI3M2szayttaXRhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":63855,"prevInTime":63853,"nextInTime":63855,"topicId":63854,"numMessagesInTopic":0,"msgSnippet":"As the weeks whiz by I am learning more and more about the testing industry, more and more about this whole subject.  I know, or hope, that on this list I am","messageBody":"<div id=\"ygrps-yiv-831248173\">As the weeks whiz by I am learning more and more about the testing <br/>\nindustry, more and more about this whole subject.  I know, or hope, <br/>\nthat on this list I am preaching to the choir, but if there is anyone <br/>\nout there still sitting on the fence about testing, or rationalizing <br/>\nthat, well, their kid is good at it so who cares, or telling yourself <br/>\nthat if your kid wants to go to college you are going to have to <br/>\ntest, no choice, so why think about it, here are a few things to <br/>\nthink about:<br/>\n<br/>\n* Most companies in this industry (test scoring, BIG BUSINESS!) only <br/>\ncontract for a 70% agreement rate.  That means that when a specific <br/>\nresponse is read by two different readers that they must agree on the <br/>\nscore 70% of the time.  Which means that they will disagree at least <br/>\n30% of the time.  That means your kid has at least a reasonable <br/>\nprobability of having a 30% fudge rate on any test.  Fine if the <br/>\nfudge goes your way, but not so fine if it goes agin&#39; em.<br/>\n<br/>\n* And that 30% fudge rate is only average.  On some very difficult to <br/>\nscore questions the rate may be closer to a 70% fudge rate.  Because <br/>\nno matter how carefully the readers score the responses, some <br/>\nquestions are so badly written, and some rubrics defined by the <br/>\ntesting institution are so difficult to score, that the rate of <br/>\nagreement drops like a rock.  The odds just keep getting worse.<br/>\n<br/>\n* Depending on what time of day your kid&#39;s test questions are scored <br/>\nthe degree of compliance with the defined rubric will vary <br/>\nconsiderably.  First thing in the morning some readers are likely to <br/>\nbe half asleep, others over-caffeinized.  Don&#39;t know which is worse.  <br/>\nAt other times cyclical low blood sugar could account for all kinds <br/>\nof variations in accuracy on reading and scoring responses.  And a <br/>\nscore of other factors, from room temperature, to barometric <br/>\npressure, to the war in Iraq, to the usual domestic issues in <br/>\nanyone&#39;s life, will all affect the test scorer&#39;s ability.<br/>\n<br/>\n* Depending on when any one child&#39;s test is scanned into the system <br/>\nreaders must meet different scoring goals daily.  During the early <br/>\npart of the reading contract for any one test they will have low <br/>\ndaily goals and may only be reading hundreds of responses a day, thus <br/>\nable to read and score more carefully.  During the later days of the <br/>\ncontract goals may rise to thousands a day and scorers will be <br/>\npressured to read for volume and not accuracy or agreement.  This <br/>\npushes that 30%-70% fudge rate right through the basement.<br/>\n<br/>\n* Handwriting or hand-printing play a big part in scoring.  Those who <br/>\nwrite infinitesimally are extremely difficult to read.  Scorers get <br/>\nannoyed by these and may not read them as carefully (?) as others.  <br/>\nAnd very messy handwriting definitely does not read well.  Test <br/>\nreaders are reading hundreds to thousands of different documents a <br/>\nday and as the day wears on the more difficult they are to read the <br/>\nless likely it is that they will get a fair reading.<br/>\n<br/>\n* Many test readers are taking all kinds of medication.  Many are <br/>\nretired teachers and school administrators, supporting the AMA and <br/>\nthe American pharmaceutical industry on their retirement incomes with <br/>\na sack full of meds they take daily, if not hourly.  It is difficult <br/>\nenough to do this type of job well with a clear unmedicated mind, but <br/>\nthose on medication may have even more difficulty.<br/>\n<br/>\n* Many test scoring contracts have a huge bonus ($$$$) for tests that <br/>\nare completed before a certain date, thus rewarding companies for <br/>\nspeedy scoring rather than accuracy, even though accuracy is a myth <br/>\nto begin with.<br/>\n<br/>\nRead Lemann&#39;s THE BIG TEST for more details on the whole meritrocracy <br/>\nissue and do whatever you can to not only unschool, but to untest <br/>\nyour kids.  When you think about college degrees, therefore, think <br/>\nabout options and schools that do not give grades (Antioch, for one), <br/>\nand ways of earning credit without testing.  And if your state gives <br/>\nhome educators the option of testing or anything else, pick anything <br/>\nelse!  <br/>\n<br/>\nIf you really want a test score to submit here is what I suggest:<br/>\nmake up a bunch of questions of your own by picking some readings and <br/>\nasking questions about those readings.  Tack the answers up on the <br/>\nwall or a tree with numbers around the page.  Throw darts at the <br/>\npages.  Add up the numbers closest to where the darts land.  This <br/>\nshould pretty well give you the same validity as any handscored test <br/>\nyour kid could take.  <br/>\n<br/>\nRemember that many of these issues also apply to machine scored tests <br/>\ndue to poorly worded questions and poorly worded, if not totally <br/>\nwrong, response choices.  <br/>\n<br/>\nSo why do people insist on these tests?  Money, money, money!  And <br/>\nelitism, meritocracy, as in &quot;my kid is better&#39;n your kid.&quot;  No other <br/>\nreason to do this to children, and to waste such huge amounts of <br/>\ntaxpayers&#39; money.  Parents (taxpayers) need to revolt against this.  <br/>\nInstead more and more testing is being mandated by the feds and the <br/>\nstate government.  More and more kids lives and self-esteem are being <br/>\nchallenged, if not seriously eroded, by all kinds of testing.  Who <br/>\nruns this country, anyway?  We need to speak up and let our elected <br/>\nrepresentatives know how we feel about all this.  If anyone knows any <br/>\nother good books on this subject please post info so that others can <br/>\nread what has been written and use those &quot;expert&quot; sources to convince <br/>\nour paid representatives that we aren&#39;t going to fund this kind of <br/>\nrubbish anymore.  <br/>\n<br/>\nThe one book I have consistently referred to is  THE BIG TEST:  THE <br/>\nSECRET HISTORY OF THE AMERICAN MERITOCRACY by Nicholas Lemann.  <br/>\nAnyone know of any other good ones?  The key word is &quot;secrecy.&quot;  All <br/>\nof this industry is shrouded in secrecy so that most who subject <br/>\ntheir kids and themselves to this kind of testing have no idea what <br/>\nis really going on.  You do, at least you know more than most, so I <br/>\nhope that some will speak out and let their representatives know what <br/>\na huge rip-off all this testing is.<br/>\n<br/>\nNorma</div>","specialLinks":[]}],"prevTopicId":63940,"nextTopicId":63858}}