{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":77610158,"authorName":"Bonni Sollars","from":"Bonni Sollars &lt;BSOLLARS@...&gt;","profile":"truuluvv","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Language/speech","postDate":"1014828419","msgId":32177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjI3LjExNDcwNy4tMjUxMDkzLjMuYnNvbGxhcnNAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":32176,"nextInTime":32178,"topicId":32177,"numMessagesInTopic":0,"msgSnippet":"Dar, what an interesting subject you have researched.  I don t think Jester was giving an explanation of ebonics or a separate language, but was saying we do","messageBody":"<div id=\"ygrps-yiv-1453059704\">Dar, what an interesting subject you have researched.  I don&#39;t think<br/>\nJester was giving an explanation of ebonics or a separate language, but<br/>\nwas saying we do end up pronouncing things like what is modeled for us,<br/>\nmostly by our parents.  He did demonstrate how foreigners do have trouble<br/>\npronouncing sounds the same as the natural citizens.  And he said the<br/>\nslaves were surrounded by slaves, not white people, for examples of how<br/>\nto speak.  (His examples were very convincing). He did his best to get<br/>\nwhite choirs to sing like they were black, and to establish rapport with<br/>\nwhat was predominantly white middle class audiences.  He would have the<br/>\nlighting people put the lights on the audience and dim the light on stage<br/>\nsaying, &quot;You are the real show, this is about you.&quot;  I think he was<br/>\nhelping them to not be so afraid of our differences.  Like I said, my<br/>\ncousins would be talking with their gang in their chicano accent, then<br/>\nturn and talk to me in plain English.  They didn&#39;t talk that way because<br/>\nthey didn&#39;t know how to talk better, but to communicate with their pals. <br/>\nI agree there is no need to think one way is better, especially when we<br/>\nsee why people talk the way they do. The kids I went to school with could<br/>\nspeak English well, but around their friends or family spoke with their<br/>\nown unique sounds. Of course, I also knew a lot of them who felt it was<br/>\ndegrading to talk &quot;ebonics&quot; and would even tell their friends, &quot;Speak<br/>\nEnglish when you talk to me!&quot;  Because they felt it made them sound<br/>\nignorant.  I knew a blonde haired, blue eyed girl who lived in a black<br/>\nneighborhood and her step dad was black, and she was totally accepted<br/>\namong her black peers, many of whom were prejudiced of whites, I think<br/>\npartly because if you heard only her voice you would not know she was<br/>\nwhite.  I used to envy her because she always got asked to dance at the<br/>\nschool dances.  I lived in Arkansas for a time and they have their own<br/>\nidioms and speech sounds, so that I often misunderstood what people were<br/>\nsaying to me and they misunderstood me.  I found myself constantly<br/>\nparaphrasing to make sure I understood them.   I read a local historian&#39;s<br/>\nview that their accents came originally from England, believe it or not. <br/>\nMy brother in law is embarrassed by his &quot;hillbilly&quot; talk so he&#39;s rather<br/>\ntaciturn.  I find their way of talking to be charming.  I met a man there<br/>\nwhose parents have very heavy Arkansas accents, yet he sounds like he&#39;s<br/>\nfrom California.  He learned how to talk from watching the news and<br/>\nmimicking the sounds they made.  Why, because he felt ashamed of his<br/>\naccent.  Doctors and lawyers have a way of talking among their peers that<br/>\neveryone in the profession understands, but confuses those outside.  A<br/>\nsmart professional will talk in a simple form to the public and use<br/>\nprofessional jargon among peers.  I guess speech is not just about<br/>\ngetting our point across to one another and hearing one another, but is<br/>\nalso about establishing our common identity with one another.<br/>\nBonni<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":32139,"nextTopicId":32046}}