{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":357126582,"authorName":"Joy","from":"&quot;Joy&quot; &lt;joy_bakker@...&gt;","profile":"joy_bakker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: i feel like the house is in chaos today","postDate":"1320370216","msgId":113561,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo4dmY3OCtuajc0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo4a3I3ZCtjbWZvQGVHcm91cHMuY29tPg=="},"prevInTopic":113560,"nextInTopic":0,"prevInTime":113560,"nextInTime":113562,"topicId":113559,"numMessagesInTopic":0,"msgSnippet":"he s also complaining about the house not being as tidy as usual which makes him stressed bc he thinks more clearly with less clutter. ... According to some","messageBody":"<div id=\"ygrps-yiv-2021592523\">&quot;he&#39;s also complaining about the house not being as tidy as usual which makes him stressed bc he thinks more clearly with less clutter.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;interesting, I have also noticed the connection between clutterd house and cluttered mind.<br/>\n<br/>\n </span></blockquote>According to some psychologists, if you clear your mind (with meditation, yoga, tai chi and the like), then your environment will start to declutter too since our outer experience reflects our inner experience.<br/>\n<br/>\nI have tried this and it does work, to some degree.<br/>\n<br/>\nOr it becomes easier to declutter the house when the mind is decluttered if that makes sense.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] i feel like the house is in chaos today","postDate":"1320024094","msgId":113560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1NjczQzU2LTUyMTgtNDUyQy1BMTBBLTM2NkU4RDgyNDBCMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo4a3I3ZCtjbWZvQGVHcm91cHMuY29tPg==","referencesHeader":"PGo4a3I3ZCtjbWZvQGVHcm91cHMuY29tPg=="},"prevInTopic":113559,"nextInTopic":113561,"prevInTime":113559,"nextInTime":113561,"topicId":113559,"numMessagesInTopic":0,"msgSnippet":"-=-he and i agreed to allow the kids more freedom with bedtime, baths, meals, food choices, where they sleep, what they wear. so i understand that this is all","messageBody":"<div id=\"ygrps-yiv-1016031284\">-=-he and i agreed to allow the kids more freedom with bedtime, baths,  <br/>\nmeals, food choices, where they sleep, what they wear. so i understand  <br/>\nthat this is all new to them and they are probably unsure of whats  <br/>\ngoing on.<br/>\ni&#39;ve talked to my oldest briefly, when it has come up in conversation,  <br/>\nabout why things have changed a little bit around our house. -=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\nIf you&#39;re saying yes lots of times, with some details about why,  <br/>\nrather than one giant, confusing yes, that will help.  Make it all  <br/>\ncase-by-case.<br/>\n<br/>\nNo matter how your kids are, you will need deschooling.  Don&#39;t just be  <br/>\nlooking at bed and food.  Be looking at learning.  Unschooling should  <br/>\nbe your primary thought here.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/howto/precisely\">http://sandradodd.com/howto/precisely</a><br/>\n<br/>\n-=- since we&#39;ve been more flexible with food choices they are eating  <br/>\nmore junk food and less wholesome meals which i feel like is  <br/>\ncontributing to the crankiness. -=-<br/>\n<br/>\nIf you think of some food as &quot;junk food&quot; and other as &quot;wholesome,&quot;  <br/>\nthat&#39;s part of the problem.  Provide good-smelling, good looking food  <br/>\nand let time pass while they make choices.<br/>\n<br/>\nWhile you&#39;re getting used to this, remember (maybe memorize recite)  <br/>\n&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/control\">http://sandradodd.com/eating/control</a><br/>\nHalloween is a good time to try to recover from villifying some foods  <br/>\nand glorifying others.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/eating/halloween\">http://sandradodd.com/eating/halloween</a><br/>\n<br/>\n-=-my 2 yr old is also more tired and throwing temper tantrums which  <br/>\nisn&#39;t really like her. her tantrums today have been bc i haven&#39;t let  <br/>\nher have as many marshmallows as she wanted. i&#39;m using them tomorrow  <br/>\nto make rice krispy treats for our family to take to a halloween party  <br/>\nwe&#39;re going to tomorrow. i&#39;ve tried to explain why she can&#39;t have as  <br/>\nmany as she liked-=-<br/>\n<br/>\nIf you didn&#39;t put them where she couldn&#39;t even see them, that was a  <br/>\nlittle cruel (or at least inefficient).<br/>\n<br/>\n-=-. i just pretty much love on her and tell her i&#39;m sorry but  <br/>\ntomorrow she&#39;ll be happy bc she&#39;ll have some yummy treats.-=-<br/>\n<br/>\nTwo-year-olds know very little about tomorrow.  Distraction,  <br/>\nhappiness, fun-something, carrying her, singing to her...    Help make  <br/>\nher environment peaceful.  Start with hiding food you aren&#39;t willing  <br/>\nto share, or buy more than you need next time, if she&#39;s with you when  <br/>\nyou buy it.<br/>\n<br/>\n-=-also, bc my husband doesn&#39;t quite agree with this yet he&#39;s a little  <br/>\nresentful that i&#39;m doing this &quot;without him&quot; which really i&#39;m not bc  <br/>\nhe&#39;s allowed changes so far. sometimes he says any frustrations i&#39;m  <br/>\nhaving are brought upon me by my own doings. he&#39;s also complaining  <br/>\nabout the house not being as tidy as usual which makes him stressed bc  <br/>\nhe thinks more clearly with less clutter.-=-<br/>\n<br/>\nYou can&#39;t have everything at the same time.  Children aren&#39;t young  <br/>\nforever.  There will be some clutter from having young children at  <br/>\nhome.  this isn&#39;t about unschooling, though, in the case of a two-year- <br/>\nold, who would be home anyway.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/gift\">http://sandradodd.com/chores/gift</a><br/>\nClean up a place for your husband to hang out, without making a big  <br/>\ndeal about it, if you can.<br/>\n<br/>\n-=i&#39;m sorry to complain, i guess i&#39;m just wondering if anyone else  <br/>\ngoes through these things while trying to ease into a more peaceful  <br/>\nway of living. it just doesn&#39;t seem all that peaceful right now. i am  <br/>\nhopeful that it will work though and i&#39;m not willing to throw in the  <br/>\ntowel.-=-<br/>\n<br/>\nAny change is disruptive, even great changes.  You need to ease into  <br/>\nmore gradually, maybe.  Don&#39;t do anything you don&#39;t really understand,  <br/>\nand focus on creating a rich environment.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231743204,"authorName":"Allison","from":"&quot;Allison&quot; &lt;curlyal_1999@...&gt;","profile":"curlyal_1999","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"i feel like the house is in chaos today","postDate":"1320022061","msgId":113559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo4a3I3ZCtjbWZvQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":113560,"prevInTime":113558,"nextInTime":113560,"topicId":113559,"numMessagesInTopic":0,"msgSnippet":"so we re new to unschooling and mindful parenting.  my husband and i aren t completely agreeing on everything surrounding this but for the most part he s on","messageBody":"<div id=\"ygrps-yiv-328995812\">so we&#39;re new to unschooling and mindful parenting.  my husband and i aren&#39;t completely agreeing on everything surrounding this but for the most part he&#39;s on board. it takes him a little while to mull things over.<br/>\nhe and i agreed to allow the kids more freedom with bedtime, baths, meals, food choices, where they sleep, what they wear. so i understand that this is all new to them and they are probably unsure of whats going on.<br/>\ni&#39;ve talked to my oldest briefly, when it has come up in conversation, about why things have changed a little bit around our house. he seems to think this is pretty awesome, so does our 5 yr old.  however, they are tired bc they&#39;ve been staying up later than usual so with that they are also cranky and there is more arguing going on than usual.  since we&#39;ve been more flexible with food choices they are eating more junk food and less wholesome meals which i feel like is contributing to the crankiness.  <br/>\nmy 2 yr old is also more tired and throwing temper tantrums which isn&#39;t really like her. her tantrums today have been bc i haven&#39;t let her have as many marshmallows as she wanted. i&#39;m using them tomorrow to make rice krispy treats for our family to take to a halloween party we&#39;re going to tomorrow.  i&#39;ve tried to explain why she can&#39;t have as many as she liked but she&#39;s still upset. handling her tantrums differently are stressful bc i don&#39;t know if i&#39;m handling it right.  i just pretty much love on her and tell her i&#39;m sorry but tomorrow she&#39;ll be happy bc she&#39;ll have some yummy treats.  we noticed while she was having a tantrum she picked up a book and sat down to tell the story to herself...her way of coping i guess.<br/>\nalso, bc my husband doesn&#39;t quite agree with this yet he&#39;s a little resentful that i&#39;m doing this &quot;without him&quot; which really i&#39;m not bc he&#39;s allowed changes so far. sometimes he says any frustrations i&#39;m having are brought upon me by my own doings.  he&#39;s also complaining about the house not being as tidy as usual which makes him stressed bc he thinks more clearly with less clutter.<br/>\n<br/>\ni&#39;m sorry to complain, i guess i&#39;m just wondering if anyone else goes through these things while trying to ease into a more peaceful way of living.  it just doesn&#39;t seem all that peaceful right now.  i am hopeful that it will work though and i&#39;m not willing to throw in the towel.</div>","specialLinks":[]}],"prevTopicId":113555,"nextTopicId":113562}}