{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":201248820,"authorName":"Sorschasmom","from":"&quot;Sorschasmom&quot; &lt;willowsfortress@...&gt;","profile":"sorschasmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Son&#39;s Explosive Anger","postDate":"1269921310","msgId":52406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFBNzBEMjlBQUJCRTRDRkQ5RDkwOTY1Rjc4MkVDMTZGQFNvcnNjaGFzbW9tUEM+","inReplyToHeader":"PDEyNjk3NzY1MjkuMjY4LjkzNjI2Lm00QHlhaG9vZ3JvdXBzLmNvbT4=","referencesHeader":"PDEyNjk3NzY1MjkuMjY4LjkzNjI2Lm00QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":52382,"nextInTopic":0,"prevInTime":52405,"nextInTime":52407,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"~~~What other things might a family put on a list as a reminder that there are options? Even a child who can t read might be helped by a list of possible","messageBody":"<div id=\"ygrps-yiv-1549874982\">~~~What other things might a family put on a list as a reminder that there <br/>\nare options? Even a child who can&#39;t read might be helped by a list of <br/>\npossible responses to fury, if the parents or someone could help him <br/>\nremember there were choices.~~<br/>\n<br/>\nIf it is night-time, Sorscha goes outside and jumps on the trampoline.  If <br/>\nit&#39;s early enough in the evening, she&#39;ll howl.  She says there is something <br/>\nabout the night air that centers her and releases her anger.<br/>\n<br/>\nIf it is daytime, she will also go outside, jump on the trampoline and howl. <br/>\nLately, she&#39;s been turning on her Japanese music and acting out her <br/>\nemotions.<br/>\n<br/>\nIf we are not at home, she likes to go sit in our Bubble Van and read or <br/>\nplay her DS.<br/>\n<br/>\nShe has found that she needs to be alone when she is angry.  This is a huge <br/>\nstep because she used to lash out at me or others (she just couldn&#39;t seem to <br/>\nstop herself ) and would feel horrible afterwards.  It&#39;s taken me a very <br/>\nlong time to help her navigate these moments and there are still times when <br/>\nI just can&#39;t get her out of a situation soon enough.  But we&#39;re working <br/>\ntogether, step by step, breath by breath, jump by jump, howl by howl and <br/>\nlife is getting easier because of our bond, trust, and patience with one <br/>\nanother.<br/>\n~Crystal in New Mexico~</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s Explosive Anger","postDate":"1269743831","msgId":52382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0NDkwNy45ODUxOC5xbUB3ZWI1MzkwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGhvazhodit1dWU2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhvazhodit1dWU2QGVHcm91cHMuY29tPg=="},"prevInTopic":52381,"nextInTopic":52406,"prevInTime":52381,"nextInTime":52383,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"________________________________ From: joanne.lopers  This is my first post after having been a reader only for the last few months.  I","messageBody":"<div id=\"ygrps-yiv-1204564542\">________________________________<br/>\nFrom: joanne.lopers &lt;wilmalv@...&gt;<br/>\n<br/>\n  <br/>\nThis is my first post after having been a reader only for the last few months.  I have a middle son 6yrs. who will often through objects at other family members, especially his older brother 8yrs., when he gets mad.  It is usually a result of some form of teasing, name calling or wildness that has gotten out of control. <br/>\n<br/>\n*****<br/>\nSo if you know how it starts, think more about how to stop it.  What starts the teasing?  Different ability levels, hunger, boredom?  Try to stop it before this stage.  My ds Eli can be explosive.  I read The Explosive Child http://http://www.amazon.com/Explosive-Child-Understanding-Frustrated-Chronically/dp/0061906190/ref=sr_1_1?ie=UTF8&s=books&qid=1269742918&sr=8-1.  One of the best ideas in the book for me was the idea that anger often stems from a few situations.  In our house it is losing things (especially the remote), things not working the way they should, and rough play(once it starts he has a lot of trouble stopping).  When the situations are predictable, it is much easier to head off blow ups.  Watch for a few days and see if there is a discerniblepattern.  I was able to predict and problem solve much easier once I knew where most of the anger was coming from.<br/>\n<br/>\n******<br/>\nI try and validate his angry feelings and talk to him about other options but I think when he gets fired up he sees revenge as the most satifying one to him. <br/>\n<br/>\n*****<br/>\nRevenge is exactly what Eli looks for when he gets mad at his brother.  So I made the &quot;Get Sam&quot; game.  When Eli gets mad at Sam (younger ds) I take him with me to the bedroom.  Eli stands on one end of the room and I sit on the end of the bed.  We pretend the wall behind me is Sam.  Eli&#39;s objective to get past me and tag the wall.  That counts as hitting Sam.  I have to try and stop him.  Amazingly this works for him.  He feels like he hit Sam, it is not nearly as hard on me as trying to physically restrain Eli, and Sam does not have to be any part of it.  In the past we have tried separation, talking, breathing, spinning on a hanging ladder, and hitting a pillow.  The game is the only thing that really seemed to work for him.  I think he gets out some physical aggression, gets some time with me, takes a break from the situation, and at the same time can be mad for a bit.  <br/>\n<br/>\n<br/>\nAmanda<br/>\nEli 9, Samuel 7<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son&#39;s Explosive Anger","postDate":"1269734892","msgId":52381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQUU5REVDLjgwNjAyQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PGhva3ZjNitzbHA1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhva3ZjNitzbHA1QGVHcm91cHMuY29tPg=="},"prevInTopic":52379,"nextInTopic":52382,"prevInTime":52380,"nextInTime":52382,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"... Sometimes people try to look so deep they ignore the obvious. I really think parents really often have expectations that their kids will spend lots and","messageBody":"<div id=\"ygrps-yiv-1279091411\">On 3/27/2010 5:57 AM, lalow66 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I am trying to look at what both kids are trying to communicate with <br/>\n&gt; their behaviors and not just focus on the behavior. <br/>\n<br/>\n </span></blockquote>Sometimes people try to look so deep they ignore the obvious. I really <br/>\nthink parents really often have expectations that their kids will spend <br/>\nlots and lots of time together, getting along perfectly. But most of US <br/>\nwouldn&#39;t want to spend THAT much time with just one or two other people, <br/>\neither. Day after day, hour after hour. It is a lot - even if we love <br/>\nthe other person. And kids will go through stages where they really <br/>\ndon&#39;t click that well or when one of the kids is really annoying the <br/>\nothers.<br/>\n<br/>\nIf you see this as all very normal and natural, it will make it easier <br/>\nto accept and to help and support the kids. For kids who mostly like <br/>\neach other and like to do a lot of stuff together, just separating them <br/>\na bit can make a HUGE difference. For kids who are being annoyed and <br/>\nirritated by one of the others, separating them can give them the <br/>\ngreatly-needed break so that they have more self-control when they are <br/>\ntogether.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":439731658,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son&#39;s Explosive Anger","postDate":"1269713495","msgId":52379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvbGhvbis4bjczQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwNTY4RjQ2LTY0MTctNDMyNi04RjNGLTBGRkM1QTgxMURFRkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":52378,"nextInTopic":52381,"prevInTime":52378,"nextInTime":52380,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"... My son is a talker, but we ve found over the years that the times when he s angry, and feeling the most compelled to talk, are the times that he SHOULDN T","messageBody":"<div id=\"ygrps-yiv-1691164868\"><blockquote><span title=\"ireply\">&gt; What other things might a family put on a list as a reminder that  <br/>\n&gt; there are options?<br/>\n<br/>\n </span></blockquote>My son is a talker, but we&#39;ve found over the years that the times when he&#39;s angry, and feeling the most compelled to talk, are the times that he SHOULDN&#39;T talk to the person he&#39;s angry with.  He can talk to me until he&#39;s ready, calmer inside.  <br/>\n<br/>\nHe watched that play out with another teenage boy who didn&#39;t take the time to calm down.  His mother was angry too, and it was a disaster, and they came out looking foolish to everyone else around--that was HUGE for my son, and when things really turned around for him.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":439731658,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son&#39;s Explosive Anger","postDate":"1269713059","msgId":52378,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvbGhiMytkZnF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGYzZjZkMzllMTAwMzI3MDUzMXIxMWZlZGU3amE0YzFlNDk3ZTQwMTA2ZjlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":52377,"nextInTopic":52379,"prevInTime":52377,"nextInTime":52379,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"... That s really great!  My daugther, at 8, figured out that she needed to leave the situation for a few minutes, and then she could come back and deal with","messageBody":"<div id=\"ygrps-yiv-810914588\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, kim green &lt;gardenerkim@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; hello, I am a new as well. My son 8yr old has had hard time dealing with<br/>\n&gt; anger. We tried many things with him. What seemed to help the most was we<br/>\n&gt; got a bunch of books on  the subject of anger and i left them on the coffee<br/>\n&gt; table.He loves to read. Eventually he saw them and read them. It worked so<br/>\n&gt; much better for him to read ways to deal with his anger than me as his<br/>\n&gt; parent telling him ways to deal with it. He actually tried several ways on<br/>\n&gt; his own. He discovered that leaving the situation, going to his bed and<br/>\n&gt; reading helped him calm down.  That is what worked for us. It is really hard<br/>\n&gt; dealing with the anger outbursts. I hope you find your way soon.<br/>\n&gt; <br/>\n&gt; -- <br/>\n<br/>\n </span></blockquote>That&#39;s really great!  My daugther, at 8, figured out that she needed to leave the situation for a few minutes, and then she could come back and deal with stuff.  But she needs a few minutes, up to 15 or 20 sometimes, in order to let her system settle back down enough to talk.  I remember Sandra talking about that here--that people have different chemistry around anger, and that some people take longer than others.  That way of looking at it was VERY helpful around my house, because my son--and my daughter&#39;s best friend--are more ready to talk right away, and needed to understand that not everyone is.<br/>\n<br/>\nAfter that all got sorted out, sometimes she&#39;ll come bouncing back out of her room after a few minutes alone, totally ready to resume play--anger gone.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":439731658,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son&#39;s Explosive Anger","postDate":"1269712619","msgId":52377,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvbGd0YitsYm9yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhvazhodit1dWU2QGVHcm91cHMuY29tPg=="},"prevInTopic":52376,"nextInTopic":52378,"prevInTime":52376,"nextInTime":52378,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"I m wondering if the anger explosions are an escalation of his behavior when angry or a continuation.  I m wondering because 6 is a big time for boys going","messageBody":"<div id=\"ygrps-yiv-50305377\">I&#39;m wondering if the anger explosions are an escalation of his behavior when angry or a continuation.  I&#39;m wondering because 6 is a big time for boys going through a big testosterone surge, and he may be having bigger reactions than he did before.  We went through that with my son, and I felt like someone else was inhabiting his body for that year.  At the time it was scary, so I started researching--that answer fit what was happening.  That&#39;s not all to say that you still don&#39;t up your parenting skills to help the situation, but knowing the cause helped me figure out what direction to go in.<br/>\n<br/>\nWhen my youngest was physically expressive toward her older brother (like my euphemism? &lt;g&gt;), I figured out that she was feeling the power imbalance between them and making up for it the only way she knew how.  He would play the mental superiority card, and she would get physical.  Oh boy--when she figured out that licking him sent him over the edge, that was heaven for her!  So I helped him to see why she was doing these things--he really didn&#39;t know.  And then she got older, and stuff just got better between them.  It&#39;s still the biggest source of their fights, though, when they fight--he has plowed over the top of her in some way that is sometimes unconscious to him, and she fights back in a more explosive, obvious way.<br/>\n<br/>\nI don&#39;t have three, but I always hear about the middle child feeling a lack of power--so maybe if you can look at it that way, through his eyes, things might become more clear.<br/>\n<br/>\nJoanna<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;joanne.lopers&quot; &lt;wilmalv@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; This is my first post after having been a reader only for the last few months.  I have a middle son 6yrs. who will often through objects at other family members, especially his older brother 8yrs., when he gets mad.  It is usually a result of some form of teasing, name calling or wildness that has gotten out of control.  I try and always listen to their play to catch things before they reach that level but we have a big yard and it can be difficult to always be there.  I have talked to the older brother about not pushing to the point where his younger brother explodes and I tried a code word they could use to try and avoid those situations. That worked for a while but I feel like I am not getting to the root of what is happening for the middle son.  I try and validate his angry feelings and talk to him about other options but I think when he gets fired up he sees revenge as the most satifying one to him.  I am concerned that he will hurt someone as he will through rocks and heavy objects.  He really hates it when I suggest to breath, maybe I don&#39;t do it in the right way?  This is not really typical of our family though my husband is quicker to anger than I.  Hoping for some wisdom to help us past this to a better way of being from some more experienced mothers.<br/>\n&gt; Joanne<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s Explosive Anger","postDate":"1269712604","msgId":52376,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMTAwMzI3MTA1NmczYjY1YjhkZm82ZDJiNDllZTcxYjk5MThlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDUwNjE2OC44NjYzMi5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+","referencesHeader":"PDUwNjE2OC44NjYzMi5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":52373,"nextInTopic":52377,"prevInTime":52375,"nextInTime":52377,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"It was very hard for me to be present until I started to do it a lot. Then it became easier.  I still gravitate to my own interests but the more I *make* time","messageBody":"<div id=\"ygrps-yiv-652423043\">It was very hard for me to be present until I started to do it a lot. Then<br/>\nit became easier.  I still gravitate to my own interests but the more I<br/>\n*make* time to be with Karl the more peaceful and genuinely able we are to<br/>\ntrust one another.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Mar 27, 2010 at 6:53 AM, Schuyler &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:s.waynforth@...\">s.waynforth@...</a>&gt;wrote:<br/>\n<br/>\n&gt; Deb Lewis recently wrote a wonderful post about spending more time with a<br/>\n&gt; child who was/is being destructive. I&#39;m gonna just rip it from the<br/>\n&gt; unschoolbasics archives and post it here:<br/>\n&gt;<br/>\n&gt; ***My ds is 4 and he takes tools (real, toy, knives, whatever he can<br/>\n&gt; find<br/>\n&gt; that he can alter<br/>\n&gt; something with) and digs, cuts, scrapes<br/>\n&gt; into one of the windowsills and one<br/>\n&gt; particular<br/>\n&gt; part of the living room wall.***<br/>\n&gt;<br/>\n&gt; Where are you when he digs the windowsills or<br/>\n&gt; walls?<br/>\n&gt; If you know he&#39;s likely to do it (because he&#39;s done it before) you should<br/>\n&gt; be<br/>\n&gt; with him.<br/>\n&gt;<br/>\n&gt; ***For the most part he&#39;ll stop<br/>\n&gt; when redirected, or told<br/>\n&gt; why it&#39;s not ok. ***<br/>\n&gt;<br/>\n&gt; But he does it<br/>\n&gt; again? After you told him why it&#39;s not ok?<br/>\n&gt; He needs you with him<br/>\n&gt; more, then.<br/>\n&gt;<br/>\n&gt; ***he will hit or throw things at his sister when she doesn&#39;t want to play<br/>\n&gt; with<br/>\n&gt; him. He won&#39;t be dissuaded by our<br/>\n&gt; attempts to get him focused on something<br/>\n&gt; else, playing with dh or me, helping us with something***<br/>\n&gt;<br/>\n&gt; It seems like he needs more direct<br/>\n&gt; attention from you so that he&#39;s not left<br/>\n&gt; to dig walls or depend on<br/>\n&gt; his sister to be his play mate.<br/>\n&gt;<br/>\n&gt; Busy moms sometimes forget how<br/>\n&gt; much four year olds still need attention.<br/>\n&gt; They can seem so mature<br/>\n&gt; about so many things - able to get snacks and<br/>\n&gt; drinks, able to work<br/>\n&gt; the TV and DVR and computer.  But they really need mom<br/>\n&gt; attention.<br/>\n&gt; If you are doing housework or on the computer while he&#39;s doing<br/>\n&gt; his<br/>\n&gt; own thing, he&#39;s on his own too much.    Play with him a lot while his<br/>\n&gt; sister is in school.   Get out and do things together, even if that&#39;s just<br/>\n&gt; digging a big hole in the garden.  Be right with him, be his companion.<br/>\n&gt; Helping him find appropriate things to bang up and destroy is fine but it<br/>\n&gt; has to come with the attention and companionship he&#39;s craving or it won&#39;t<br/>\n&gt; be<br/>\n&gt; enough.<br/>\n&gt;<br/>\n&gt; If being destructive is his outlet for feelings of frustration or<br/>\n&gt; loneliness<br/>\n&gt; you can change that.  If he has<br/>\n&gt; opportunity to destroy appropriate things<br/>\n&gt; but still feels frustrated or lonely, he might find other, possibly more<br/>\n&gt; destructive outlets.  Don&#39;t expect the act of destruction to fulfill him.<br/>\n&gt; *You* are the<br/>\n&gt; only thing that can fulfill him.   Your time, your attention.<br/>\n&gt;<br/>\n&gt; You&#39;ve said he&#39;s not polite, he&#39;s destructive and he&#39;s hurting his sister,<br/>\n&gt; you should be with him all the time.  If that means leaving housework until<br/>\n&gt; your partner gets home, or waiting to get on the computer until<br/>\n&gt; he&#39;s asleep,<br/>\n&gt; then that&#39;s what it means right now.  He&#39;s growing and<br/>\n&gt; changing and won&#39;t be<br/>\n&gt; four forever.<br/>\n&gt;<br/>\n&gt; Deb Lewis<br/>\n&gt;<br/>\n&gt; ------------<br/>\n&gt;<br/>\n&gt; So, that&#39;s what I&#39;d say, spend more time with your 6 year old son. Don&#39;t<br/>\n&gt; expect your 8 year old to be his playmate. Be present a lot, a lot more.<br/>\n&gt;<br/>\n&gt; Schuyler<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ________________________________<br/>\n&gt; From: joanne.lopers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wilmalv@...\">wilmalv@...</a>&gt;<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n&gt; Sent: Saturday, 27 March, 2010 6:28:15<br/>\n&gt; Subject: [AlwaysLearning] Son&#39;s Explosive Anger<br/>\n&gt;<br/>\n&gt; This is my first post after having been a reader only for the last few<br/>\n&gt; months.  I have a middle son 6yrs. who will often through objects at other<br/>\n&gt; family members, especially his older brother 8yrs., when he gets mad.  It is<br/>\n&gt; usually a result of some form of teasing, name calling or wildness that has<br/>\n&gt; gotten out of control.  I try and always listen to their play to catch<br/>\n&gt; things before they reach that level but we have a big yard and it can be<br/>\n&gt; difficult to always be there.  I have talked to the older brother about not<br/>\n&gt; pushing to the point where his younger brother explodes and I tried a code<br/>\n&gt; word they could use to try and avoid those situations. That worked for a<br/>\n&gt; while but I feel like I am not getting to the root of what is happening for<br/>\n&gt; the middle son.  I try and validate his angry feelings and talk to him about<br/>\n&gt; other options but I think when he gets fired up he sees revenge as the most<br/>\n&gt; satifying one to him.  I am concerned that he will hurt someone as he<br/>\n&gt;  will through rocks and heavy objects.  He really hates it when I suggest<br/>\n&gt; to breath, maybe I don&#39;t do it in the right way?  This is not really typical<br/>\n&gt; of our family though my husband is quicker to anger than I.  Hoping for some<br/>\n&gt; wisdom to help us past this to a better way of being from some more<br/>\n&gt; experienced mothers.<br/>\n&gt; Joanne<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s Explosive Anger","postDate":"1269707307","msgId":52373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQUUzMjJCLjYwNTA5MDRAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGhvazhodit1dWU2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhvazhodit1dWU2QGVHcm91cHMuY29tPg=="},"prevInTopic":52372,"nextInTopic":52376,"prevInTime":52372,"nextInTime":52374,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"... I m assuming there are long periods of time that they do play happily together, right? Which is why you get a bit complacent and then they erupt? I had","messageBody":"<div id=\"ygrps-yiv-1868888874\">On 3/26/2010 11:28 PM, joanne.lopers wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; . I have talked to the older brother about not pushing to the point <br/>\n&gt; where his younger brother explodes and I tried a code word they could <br/>\n&gt; use to try and avoid those situations.<br/>\n<br/>\n </span></blockquote>I&#39;m assuming there are long periods of time that they do play happily <br/>\ntogether, right? Which is why you get a bit complacent and then they erupt?<br/>\n<br/>\nI had three girls who played together really happily much of the time, <br/>\nbut the middle one would sometimes explode in anger. I now know, after <br/>\nyears of trial and error, the solution. More separate time! The more <br/>\ntime they are separated, the more they enjoy the time they have to play <br/>\ntogether. Find reasons to take one with you when you go out. Set up play <br/>\ndates for just one. Invite a friend over for one and do something <br/>\nspecial with the others. And so on.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s Explosive Anger","postDate":"1269706825","msgId":52372,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBNTRCQUY4LTBBQ0MtNEVEOS05NDI2LTdFMjlBOTk1QkFFNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhvazhodit1dWU2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhvazhodit1dWU2QGVHcm91cHMuY29tPg=="},"prevInTopic":52370,"nextInTopic":52373,"prevInTime":52371,"nextInTime":52373,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"-=- I have talked to the older brother about not pushing to the point where his younger brother explodes.-=- That sounds as though you re giving him permission","messageBody":"<div id=\"ygrps-yiv-1637558924\">-=- I have talked to the older brother about not pushing to the point  <br/>\nwhere his younger brother explodes.-=-<br/>\n<br/>\nThat sounds as though you&#39;re giving him permission to push some, just  <br/>\nnot to the point of explosion.<br/>\nIf he&#39;s being mean or teasing at all, that needs to stop, because your  <br/>\nmiddle son needs to feel safe and at peace in his own home, in his own  <br/>\nyard.<br/>\n<br/>\nBut it can&#39;t be his brother&#39;s responsibility to see to his peace,  <br/>\nthough it should be the parents&#39; responsibility to guard against  <br/>\nbullying or harrassment.<br/>\n<br/>\nI used to say &quot;It&#39;s only playing if everyone is playing.&quot;   It&#39;s not  <br/>\nokay for one to say &quot;I was only playing&quot; if the other one was saying  <br/>\n&quot;Stop.&quot;<br/>\n<br/>\n-=- I tried a code word they could use to try and avoid those  <br/>\nsituations. That worked for a while but I feel like I am not getting  <br/>\nto the root of what is happening for the middle son.-=-<br/>\n<br/>\nI agree with the advice of being there more.  Maybe find more  <br/>\nopportunities for each child to be alone with you and maybe you&#39;ll  <br/>\nlearn more that way.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s Explosive Anger","postDate":"1269706029","msgId":52370,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwNTY4RjQ2LTY0MTctNDMyNi04RjNGLTBGRkM1QTgxMURFRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGYzZjZkMzllMTAwMzI3MDUzMXIxMWZlZGU3amE0YzFlNDk3ZTQwMTA2ZjlAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGYzZjZkMzllMTAwMzI3MDUzMXIxMWZlZGU3amE0YzFlNDk3ZTQwMTA2ZjlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":52367,"nextInTopic":52372,"prevInTime":52369,"nextInTime":52371,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"-= My son 8yr old has had hard time dealing with anger. We tried many things with him. What seemed to help the most was we got a bunch of books on the subject","messageBody":"<div id=\"ygrps-yiv-300343280\">-= My son 8yr old has had hard time dealing with<br/>\nanger. We tried many things with him. What seemed to help the most was  <br/>\nwe<br/>\ngot a bunch of books on the subject of anger and i left them on the  <br/>\ncoffee<br/>\ntable.... He actually tried several ways on<br/>\nhis own. He discovered that leaving the situation, going to his bed and<br/>\nreading helped him calm down.-=-<br/>\n<br/>\nSo for kids who are suffering frustration and can&#39;t read, or might not  <br/>\npick books up to read if they could read, what other suggestions did  <br/>\nyour son find in those books?<br/>\n<br/>\nLeave the situation.<br/>\nGo to your room and read.<br/>\n<br/>\nBreathing helped us, but somehow we figured out a way to get Kirby&#39;s  <br/>\nattention and help him breath to be calmer.<br/>\n<br/>\nWhat other things might a family put on a list as a reminder that  <br/>\nthere are options?<br/>\nEven a child who can&#39;t read might be helped by a list of possible  <br/>\nresponses to fury, if the parents or someone could help him remember  <br/>\nthere were choices.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son&#39;s Explosive Anger","postDate":"1269694662","msgId":52366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhva3ZjNitzbHA1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhvazhodit1dWU2QGVHcm91cHMuY29tPg=="},"prevInTopic":52365,"nextInTopic":52367,"prevInTime":52365,"nextInTime":52367,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":" ...  Joanne, I am not more experienced, my oldest(James) is 8 as well but I see the behaviors you described in my kids.  My middle son (Ben) is 7 and out of","messageBody":"<div id=\"ygrps-yiv-184222205\">&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; This is my first post after having been a reader only for the last few months.  I have a middle son 6yrs. who will often through objects at other family members, especially his older brother 8yrs., when he gets mad.  It is usually a result of some form of teasing, name calling or wildness that has gotten out of control.  I try and always listen to their play to catch things before they reach that level but we have a big yard and it can be difficult to always be there.  I have talked to the older brother about not pushing to the point where his younger brother explodes and I tried a code word they could use to try and avoid those situations. That worked for a while but I feel like I am not getting to the root of what is happening for the middle son.  I try and validate his angry feelings and talk to him about other options but I think when he gets fired up he sees revenge as the most satifying one to him.  I am concerned that he will hurt someone as he will through rocks and heavy objects.  He really hates it when I suggest to breath, maybe I don&#39;t do it in the right way?  This is not really typical of our family though my husband is quicker to anger than I.  Hoping for some wisdom to help us past this to a better way of being from some more experienced mothers.<br/>\n&gt; Joanne<br/>\n </span></blockquote>&quot;<br/>\n<br/>\nJoanne,<br/>\nI am not more experienced, my oldest(James) is 8 as well but I see the behaviors you described in my kids.  My middle son (Ben) is 7 and out of all my kids he is the quickest to lash out.. especially at James. One thing I have been thinking about this week is that perhaps I am ignoring something that James is communicating because he is not physically violent and always focusing more on the violence of Ben.  I spend ALOT of time with Ben cause I feel he needs that attention and dont think about how the teasing, pushing the limits, behavior James sometimes exhibits is also his way of communicating frustration with his brother and jealousy etc.. I am trying to look at what both kids are trying to communicate with their behaviors and not just focus on the behavior.</div>","specialLinks":[]},{"userId":391672047,"authorName":"kim green","from":"kim green &lt;gardenerkim@...&gt;","profile":"kimgreen00","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Son&#39;s Explosive Anger","postDate":"1269693074","msgId":52367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYzZjZkMzllMTAwMzI3MDUzMXIxMWZlZGU3amE0YzFlNDk3ZTQwMTA2ZjlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":52366,"nextInTopic":52370,"prevInTime":52366,"nextInTime":52368,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"hello, I am a new as well. My son 8yr old has had hard time dealing with anger. We tried many things with him. What seemed to help the most was we got a bunch","messageBody":"<div id=\"ygrps-yiv-317420351\">hello, I am a new as well. My son 8yr old has had hard time dealing with<br/>\nanger. We tried many things with him. What seemed to help the most was we<br/>\ngot a bunch of books on  the subject of anger and i left them on the coffee<br/>\ntable.He loves to read. Eventually he saw them and read them. It worked so<br/>\nmuch better for him to read ways to deal with his anger than me as his<br/>\nparent telling him ways to deal with it. He actually tried several ways on<br/>\nhis own. He discovered that leaving the situation, going to his bed and<br/>\nreading helped him calm down.  That is what worked for us. It is really hard<br/>\ndealing with the anger outbursts. I hope you find your way soon.<br/>\n<br/>\n-- <br/>\nEducation is not the filling of a pail but the lighting of a fire &quot;~ William<br/>\nButler Yeats~<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s Explosive Anger","postDate":"1269687190","msgId":52365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNjE2OC44NjYzMi5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":52364,"nextInTopic":52366,"prevInTime":52364,"nextInTime":52366,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"Deb Lewis recently wrote a wonderful post about spending more time with a child who was/is being destructive. I m gonna just rip it from the unschoolbasics","messageBody":"<div id=\"ygrps-yiv-689497416\">Deb Lewis recently wrote a wonderful post about spending more time with a child who was/is being destructive. I&#39;m gonna just rip it from the unschoolbasics archives and post it here: <br/>\n<br/>\n***My ds is 4 and he takes tools (real, toy, knives, whatever he can <br/>\nfind <br/>\nthat he can alter<br/>\nsomething with) and digs, cuts, scrapes <br/>\ninto one of the windowsills and one <br/>\nparticular<br/>\npart of the living room wall.***<br/>\n<br/>\nWhere are you when he digs the windowsills or <br/>\nwalls?<br/>\nIf you know he&#39;s likely to do it (because he&#39;s done it before) you should be <br/>\nwith him.<br/>\n<br/>\n***For the most part he&#39;ll stop <br/>\nwhen redirected, or told<br/>\nwhy it&#39;s not ok. ***<br/>\n<br/>\nBut he does it <br/>\nagain? After you told him why it&#39;s not ok?<br/>\nHe needs you with him <br/>\nmore, then.<br/>\n<br/>\n***he will hit or throw things at his sister when she doesn&#39;t want to play <br/>\nwith<br/>\nhim. He won&#39;t be dissuaded by our <br/>\nattempts to get him focused on something<br/>\nelse, playing with dh or me, helping us with something***<br/>\n<br/>\nIt seems like he needs more direct <br/>\nattention from you so that he&#39;s not left <br/>\nto dig walls or depend on <br/>\nhis sister to be his play mate.<br/>\n<br/>\nBusy moms sometimes forget how <br/>\nmuch four year olds still need attention. <br/>\nThey can seem so mature <br/>\nabout so many things - able to get snacks and <br/>\ndrinks, able to work <br/>\nthe TV and DVR and computer.  But they really need mom <br/>\nattention.   <br/>\nIf you are doing housework or on the computer while he&#39;s doing <br/>\nhis <br/>\nown thing, he&#39;s on his own too much.    Play with him a lot while his <br/>\nsister is in school.   Get out and do things together, even if that&#39;s just <br/>\ndigging a big hole in the garden.  Be right with him, be his companion. <br/>\nHelping him find appropriate things to bang up and destroy is fine but it <br/>\nhas to come with the attention and companionship he&#39;s craving or it won&#39;t <br/>\nbe <br/>\nenough.<br/>\n<br/>\nIf being destructive is his outlet for feelings of frustration or loneliness <br/>\nyou can change that.  If he has <br/>\nopportunity to destroy appropriate things <br/>\nbut still feels frustrated or lonely, he might find other, possibly more <br/>\ndestructive outlets.  Don&#39;t expect the act of destruction to fulfill him. <br/>\n*You* are the <br/>\nonly thing that can fulfill him.   Your time, your attention.<br/>\n<br/>\nYou&#39;ve said he&#39;s not polite, he&#39;s destructive and he&#39;s hurting his sister, <br/>\nyou should be with him all the time.  If that means leaving housework until <br/>\nyour partner gets home, or waiting to get on the computer until <br/>\nhe&#39;s asleep, <br/>\nthen that&#39;s what it means right now.  He&#39;s growing and <br/>\nchanging and won&#39;t be <br/>\nfour forever.<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n------------<br/>\n<br/>\nSo, that&#39;s what I&#39;d say, spend more time with your 6 year old son. Don&#39;t expect your 8 year old to be his playmate. Be present a lot, a lot more.<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: joanne.lopers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wilmalv@...\">wilmalv@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Saturday, 27 March, 2010 6:28:15<br/>\nSubject: [AlwaysLearning] Son&#39;s Explosive Anger<br/>\n<br/>\nThis is my first post after having been a reader only for the last few months.  I have a middle son 6yrs. who will often through objects at other family members, especially his older brother 8yrs., when he gets mad.  It is usually a result of some form of teasing, name calling or wildness that has gotten out of control.  I try and always listen to their play to catch things before they reach that level but we have a big yard and it can be difficult to always be there.  I have talked to the older brother about not pushing to the point where his younger brother explodes and I tried a code word they could use to try and avoid those situations. That worked for a while but I feel like I am not getting to the root of what is happening for the middle son.  I try and validate his angry feelings and talk to him about other options but I think when he gets fired up he sees revenge as the most satifying one to him.  I am concerned that he will hurt someone as he<br/>\n will through rocks and heavy objects.  He really hates it when I suggest to breath, maybe I don&#39;t do it in the right way?  This is not really typical of our family though my husband is quicker to anger than I.  Hoping for some wisdom to help us past this to a better way of being from some more experienced mothers.<br/>\nJoanne<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":361639019,"authorName":"joanne.lopers","from":"&quot;joanne.lopers&quot; &lt;wilmalv@...&gt;","profile":"joanne.lopers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Son&#39;s Explosive Anger","postDate":"1269671295","msgId":52364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvazhodit1dWU2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":52365,"prevInTime":52363,"nextInTime":52365,"topicId":52364,"numMessagesInTopic":0,"msgSnippet":"This is my first post after having been a reader only for the last few months.  I have a middle son 6yrs. who will often through objects at other family","messageBody":"<div id=\"ygrps-yiv-753454389\">This is my first post after having been a reader only for the last few months.  I have a middle son 6yrs. who will often through objects at other family members, especially his older brother 8yrs., when he gets mad.  It is usually a result of some form of teasing, name calling or wildness that has gotten out of control.  I try and always listen to their play to catch things before they reach that level but we have a big yard and it can be difficult to always be there.  I have talked to the older brother about not pushing to the point where his younger brother explodes and I tried a code word they could use to try and avoid those situations. That worked for a while but I feel like I am not getting to the root of what is happening for the middle son.  I try and validate his angry feelings and talk to him about other options but I think when he gets fired up he sees revenge as the most satifying one to him.  I am concerned that he will hurt someone as he will through rocks and heavy objects.  He really hates it when I suggest to breath, maybe I don&#39;t do it in the right way?  This is not really typical of our family though my husband is quicker to anger than I.  Hoping for some wisdom to help us past this to a better way of being from some more experienced mothers.<br/>\nJoanne</div>","specialLinks":[]}],"prevTopicId":52141,"nextTopicId":52407}}