{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"p1FZzPSzY8uVNci-hKHkoqQzyTC5tLAIjLYHN_9rXLLSCgyoPKbqBq_1mxdhVYQ9KT8TA8fXyd32LZgpLqFSKvaulg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FW: How Schools ARe Making Big Money On &#39; ADD-ADHD&#39;","postDate":"971131910","msgId":13638,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTcwMWMwMzI2ZiRiMjg5YWUyMCQzOTVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13637,"nextInTime":13639,"topicId":13638,"numMessagesInTopic":0,"msgSnippet":"Anyone seen this one yet? Lynda","messageBody":"<div id=\"ygrps-yiv-1776294439\">Anyone seen this one yet?<br/>\n<br/>\nLynda<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;   How Schools Are Making <br/>\n&gt;   Big Money On &#39;ADD/ADHD&#39;<br/>\n&gt; <br/>\n&gt;   &quot;The so-called learning disorders have, sadly, become a way for<br/>\n&gt;   financially strapped schools to make ends meet.&quot; <br/>\n&gt; <br/>\n&gt;           Testimony of Patti Johnson Colorado State Board of<br/>\n&gt; Education member 2nd Congressional District before the U.S. House of<br/>\n&gt; Representatives Subcommittee on Oversight and Investigations hearing<br/>\n&gt; entitled &quot;Behavioral Drugs in Schools: Questions and Concerns&quot;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.house.gov/ed_workforce/hearings/106th/oi/ritalin92900/johns\">http://www.house.gov/ed_workforce/hearings/106th/oi/ritalin92900/johns</a><br/>\n&gt; on.htm September 29, 2000<br/>\n&gt;            <br/>\n&gt;            <br/>\n&gt;           I have been a member of the Colorado State Board of<br/>\n&gt; Education for the last six years. One of my platforms when I ran for<br/>\n&gt; office was to empower parents in their right to direct the upbringing<br/>\n&gt; and education of their children. <br/>\n&gt;            <br/>\n&gt;           Over the years I was contacted by a number of parents who<br/>\n&gt; had been pressured to put their children on various psychotropic<br/>\n&gt; drugs for a variety of so-called learning disorders, the most common<br/>\n&gt; of which was Attention Deficit Hyperactivity Disorder (ADHD). In some<br/>\n&gt; cases they were told their child would not be allowed to attend<br/>\n&gt; school if he did not begin taking psychotropic drugs. <br/>\n&gt;            <br/>\n&gt;           One parent who was given the option of placing her son on a<br/>\n&gt; stimulant drug or removing him from school elected to home school her<br/>\n&gt; son. She told me that it just didn t make sense that a straight A<br/>\n&gt; student would be labeled &quot;learning disabled.&quot; A Douglas County parent<br/>\n&gt; I spoke with said she was told her son had ADHD. <br/>\n&gt;            <br/>\n&gt;           What she was being told about the behavior her son<br/>\n&gt; supposedly exhibited and what she observed were not consistent. She<br/>\n&gt; investigated the matter and the school s special education director<br/>\n&gt; eventually admitted that she had coaxed the teacher to answer the<br/>\n&gt; questions of the checklist used to determine if the child had ADHD in<br/>\n&gt; a certain manner so her son &quot;would get the help he needed.&quot; This<br/>\n&gt; infuriated her so badly she removed her son from the school. <br/>\n&gt;            <br/>\n&gt;           A Jefferson County parent who contacted me said he at first<br/>\n&gt; complied with the school s direction to have his son take a stimulant<br/>\n&gt; drug. The drug caused his son to become violent, he began taking<br/>\n&gt; steak knives out of the kitchen and stabbing his stuffed animals.<br/>\n&gt; When the parent took him off the drug, the principal of the school<br/>\n&gt; began pressuring him to resume the stimulant -- so much pressure that<br/>\n&gt; the matter is now in court and the father could forfeit parental<br/>\n&gt; rights if he disagrees with the decision of the court on whether or<br/>\n&gt; not to place his child on Ritalin. Many more examples exist. <br/>\n&gt;            <br/>\n&gt;           When I investigated the issue I realized that the so-called<br/>\n&gt; psychiatric learning disorders are an effort to &quot;medicalize&quot; failures<br/>\n&gt; in instruction and discipline at the expense of the child s well<br/>\n&gt; being and the rights of the parent. Some of the learning disorders<br/>\n&gt; listed in the American Psychiatric Association&#39;s Diagnostic and<br/>\n&gt; Statistical Manual of Mental Disorders (DSM) illustrate this point. <br/>\n&gt;            <br/>\n&gt;           For example, the fourth edition lists number &quot;315.1,<br/>\n&gt; Mathematics Disorder.&quot; The diagnostic criteria for this is<br/>\n&gt; &quot;Mathematical ability, as measured by individually administered<br/>\n&gt; standardized tests, is substantially below that expected given the<br/>\n&gt; person s chronological age, measured intelligence, and<br/>\n&gt; age-appropriate education.&quot; Likewise, the diagnostic criteria for<br/>\n&gt; &quot;315.2, Disorder of Written Expression&quot; labels the child with this<br/>\n&gt; disorder if he scores low on written tests. <br/>\n&gt;            <br/>\n&gt;           The label of ADHD is assigned if the child exhibits such<br/>\n&gt; symptoms as not listening when spoken to, is forgetful, fails to<br/>\n&gt; finish homework, fidgets, talks excessively, etc. -- the typical<br/>\n&gt; behavior of a normal child. Parents of children said to have these<br/>\n&gt; disorders are generally told that it is a neurological disorder or a<br/>\n&gt; chemical imbalance in the brain. Yet, at a Consensus Development<br/>\n&gt; Panel conducted by the National Institutes of Health on ADHD in<br/>\n&gt; November 1998, it was reported that &quot;We do not have an independent,<br/>\n&gt; valid test for ADHD, and there are no data to indicate that ADHD is<br/>\n&gt; due to a brain malfunction. Further research to establish the<br/>\n&gt; validity of the disorder continues to be a problem. This is not<br/>\n&gt; unique to ADHD, but applies as well to most psychiatric disorders...&quot; <br/>\n&gt;            <br/>\n&gt;           Educators are not allowed by law to practice medicine. Yet,<br/>\n&gt; the adjudication a child has one of these &quot;disorders&quot; and should be<br/>\n&gt; placed on &quot;medication&quot; and into special education is often done by a<br/>\n&gt; team which includes the parent, a teacher, a social worker, a special<br/>\n&gt; education teacher and the principal. The above factors led me to<br/>\n&gt; introduce a resolution before the Colorado State Board of Education<br/>\n&gt; entitled &quot;Promoting the use of academic solutions to resolve problems<br/>\n&gt; with behavior, attention and learning.&quot; It reminded educators that<br/>\n&gt; their role was to teach and urged them to refrain from advising<br/>\n&gt; parents on medical matters. This was passed by a vote of 6 to 1 by<br/>\n&gt; the Board in November 1999. <br/>\n&gt;            <br/>\n&gt;           Unfortunately, financial incentives exist for schools to<br/>\n&gt; label children with learning disorders. Understanding these<br/>\n&gt; incentives requires a brief review of the laws that affect special<br/>\n&gt; education. <br/>\n&gt;            <br/>\n&gt;           The legislation which is now the Individuals With<br/>\n&gt; Disabilities Education Act (IDEA) was originally the Education for<br/>\n&gt; all Handicapped Children Act of 1975. The intent of this legislation<br/>\n&gt; was to ensure that children with actual physical handicaps -- sight<br/>\n&gt; impairment, hearing loss, etc. -- were given the public education<br/>\n&gt; they are entitled to. This law was reauthorized in 1990 and the name<br/>\n&gt; changed to the Individuals with Disabilities Education Act. There<br/>\n&gt; were few procedural changes but the term &quot;handicapped&quot; was changed to<br/>\n&gt; &quot;disabilities.&quot; The following year a memo was issued by the US Dept.<br/>\n&gt; of Education Office of Special Education and Rehabilitative Services<br/>\n&gt; which stated a child could qualify for special education if he was<br/>\n&gt; determined to have ADHD. <br/>\n&gt;            <br/>\n&gt;           At this time, the IDEA legislation provided schools with an<br/>\n&gt; additional $400 per year for each child in special education. There<br/>\n&gt; followed a dramatic spike in the amount of methylphenidate consumed<br/>\n&gt; in the US. According to the DEA, the production and use of<br/>\n&gt; methylphenidate increased almost 6 fold between 1990 and 1995. <br/>\n&gt;            <br/>\n&gt;           In IDEA as passed in 1999, the impairment category of<br/>\n&gt; &quot;emotional disturbance.&quot; is defined in part to say the child has &quot;An<br/>\n&gt; inability to learn that can not be explained by intellectual,<br/>\n&gt; sensory, or health factors.&quot; There is no mention of the fact that<br/>\n&gt; this may be due to a failure to instruct properly. <br/>\n&gt;            <br/>\n&gt;           In December 1999, the Los Angeles Times reported that tens<br/>\n&gt; of thousands of California s special education students were placed<br/>\n&gt; there not because they have a serious mental or emotional handicap,<br/>\n&gt; but because they were never taught to read properly. Reid Lyon, head<br/>\n&gt; of the federal government s research efforts into reading and writing<br/>\n&gt; told the Times, &quot;It is where children who weren&#39;t taught well go in<br/>\n&gt; many cases.&quot; <br/>\n&gt;            <br/>\n&gt;           The intent of the original law, the Education for all<br/>\n&gt; Handicapped Children Act of 1975, was to ensure those with physical<br/>\n&gt; disabilities received a free and appropriate public education. These<br/>\n&gt; children are now being shortchanged because such a large percentage<br/>\n&gt; of special education funds are being diverted to vague psychiatric<br/>\n&gt; diagnoses. In 1998, 51.1 percent of special education children were<br/>\n&gt; in the category of &quot;specific learning disabilities.&quot; These are the<br/>\n&gt; psychiatric diagnoses such as Mathematics Disorder, Disorder of<br/>\n&gt; Written expression and ADHD. Other disability categories also include<br/>\n&gt; psychiatric diagnoses. IDEA legislation also contains a &quot;child find&quot;<br/>\n&gt; provision which requires states to actively seek out any children who<br/>\n&gt; may qualify for special education in order to receive federal special<br/>\n&gt; education funds. The child find program starts at birth in Colorado.<br/>\n&gt; This, of course, serves to push up the numbers of children labeled<br/>\n&gt; with ADHD. <br/>\n&gt;            <br/>\n&gt;           The so-called learning disorders have, sadly, become a way<br/>\n&gt; for financially strapped schools to make ends meet. In many states,<br/>\n&gt; schools have become authorized Medicaid providers and funds can be<br/>\n&gt; collected in behalf of a child labeled with one of the learning or<br/>\n&gt; behavior disorders. This can be such a lucrative cash cow that in a<br/>\n&gt; letter dated October 8, 1996, the Illinois State Board of Education<br/>\n&gt; strongly encouraged the superintendent of one of its districts to<br/>\n&gt; participate in Medicaid incentives. The letter stated that Illinois<br/>\n&gt; had received $72,500,000 in federal Medicaid money in 1996 and that<br/>\n&gt; Medicaid dollars have been used for a variety of non-medical purposes<br/>\n&gt; and that &quot;the potential for the dollars is limitless.&quot; <br/>\n&gt;            <br/>\n&gt;           To assist schools in identifying children to label with<br/>\n&gt; &quot;learning disorders,&quot; a number of checklists are made available to<br/>\n&gt; schools through the ERIC (Educational Resource and Information<br/>\n&gt; Center) database, which is a federal clearing house for educational<br/>\n&gt; materials. Yet, despite the expense created by such actions, these<br/>\n&gt; children are not receiving the education they are entitled to. Though<br/>\n&gt; the standards set for special education children are often lower,<br/>\n&gt; their graduation rate in the 1995 -1996 year was only 28.9 percent! <br/>\n&gt;            <br/>\n&gt;           To the degree educators are expected to diagnose children,<br/>\n&gt; they are being distracted from their main duty which is to provide<br/>\n&gt; our children a quality education. Our schools are the only<br/>\n&gt; institution entrusted to attend to the academic needs of our children<br/>\n&gt; and their mission must not be diluted. I urge this committee to do<br/>\n&gt; everything in its power to get schools out of the business of<br/>\n&gt; labeling children and back to the job of teaching. <br/>\n&gt;            <br/>\n&gt;           Thank you. Patti Johnson Colorado State Board of Education<br/>\n&gt; Second Congressional District &gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":13637,"nextTopicId":13639}}