{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":117801964,"authorName":"Todd M.","from":"&quot;Todd M.&quot; &lt;Ozarkren@...&gt;","profile":"trozark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Preschool is overhyped","postDate":"1033869740","msgId":45458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4xLjYuMi4yMDAyMTAwNTIxMDIwMi4wMDllYjY3MEBlZGlzb24ucmlwaW50ZXJuZXQuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":45457,"nextInTime":45459,"topicId":45458,"numMessagesInTopic":0,"msgSnippet":"09/18/2002 Preschool is overhyped By David Salisbury http://www.usatoday.com/news/opinion/editorials/2002-09-18-oppose_x.htm Advocates of universal preschool","messageBody":"<div id=\"ygrps-yiv-1345580963\">09/18/2002<br/>\n<br/>\nPreschool is overhyped<br/>\nBy David Salisbury<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.usatoday.com/news/opinion/editorials/2002-09-18-oppose_x.htm\">http://www.usatoday.com/news/opinion/editorials/2002-09-18-oppose_x.htm</a><br/>\n<br/>\nAdvocates of universal preschool claim that starting kids in school earlier <br/>\nis the key to improved academic achievement and higher intelligence. This <br/>\nclaim is made so often that one would expect it to rest on solid evidence. <br/>\nBut that is not the case. Proponents exaggerate the benefits for young <br/>\nchildren, or fail to mention that the benefits fade after a few years. No <br/>\nwide-scale longitudinal study, representative of the American population, <br/>\nhas found long-term positive effects from state-funded preschool.<br/>\n<br/>\nMost mothers like being at home with their children, especially during the <br/>\npreschool years, and many make substantial financial sacrifices to be able <br/>\nto do so. Parents also recognize that it is wrong to make one struggling <br/>\nfamily pay for the child care of other families. According to a report from <br/>\nthe non-partisan Public Agenda, more than seven in 10 parents with children <br/>\n5 or under say they should be responsible for paying the costs of caring <br/>\nfor their own children; only 24% say other taxpayers should help pay the <br/>\ncosts. Even a majority of parents earning less than $25,000 a year believe <br/>\nthat they, not their neighbors, should be responsible for the costs of <br/>\nraising their children.<br/>\n<br/>\nThe push for these programs doesn&#39;t come from parents, but rather from <br/>\npoliticians, who prey on the weaknesses of parents who are often strapped <br/>\nfinancially. Pushing universal preschool may be good for politicians, but <br/>\nit is not good for children, nor does it help build a social structure of <br/>\nindependent, healthy families. Instead of trying to &quot;help&quot; parents by <br/>\noffering &quot;free&quot; preschool, politicians need to adjust current policies so <br/>\nthat parents and extended family members can spend more time with their <br/>\nchildren, not less. Providing non-discriminatory assistance through tax <br/>\ncuts would help all parents, whether or not they choose at-home parental <br/>\ncare, preschool or a combination of both for their children.<br/>\n<br/>\nThe key to producing intelligent, healthy children does not lie in putting <br/>\nmore of them in taxpayer-funded preschools. Although child care outside the <br/>\nhome is necessary for some parents, especially single mothers, it should <br/>\nnot be promoted as the norm for all families. Instead of forcing mothers <br/>\ninto the workplace through heavy taxation, the government should reduce the <br/>\ntax burden on families and, thereby, allow child care to remain in the <br/>\ncapable hands of parents.<br/>\nDavid Salisbury is director of the Center for Educational Freedom at the <br/>\nCato Institute.<br/>\n<br/>\n====================================<br/>\nI was going to join the Paranoids anonymous group,<br/>\nbut they won&#39;t tell me where they&#39;re meeting.</div>","specialLinks":[]}],"prevTopicId":45446,"nextTopicId":45475}}