{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Carli","from":"&quot;Carli&quot; &lt;carli@...&gt;","replyTo":"LIST","senderId":"U_yckEkj27r_BTfdP-8JEWwPoDG3dehB9LWvlwkMQ3URY-36SrJ0LiqtcCRFRpWVQdJcGRsqC9wuQfsdCmgn","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HOT topic of breastfeeding","postDate":"955007261","msgId":7852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":0,"prevInTime":7851,"nextInTime":7853,"topicId":7852,"numMessagesInTopic":0,"msgSnippet":"Hi!  Well, I mostly have been lingering on this list as I have been making some unschooling decisions for our family.   And mostly just don t have much to say.","messageBody":"<div id=\"ygrps-yiv-745111977\">Hi!  Well, I mostly have been lingering on this list as I have been making<br/>\nsome unschooling decisions for our family.   And mostly just don&#39;t have<br/>\nmuch to say.  But I had to put in my 2 cents here since everyone else is. <br/>\nI must say that I feel honored to be among both breastfeeding zealots,<br/>\nfanatics, advocates and whatever else you might call yourself or others<br/>\ncall you.  And equally honored to be here with people like Kim who<br/>\nrecognize breastfeeding is best, but are one of the rare people who<br/>\nphysically were unable to breastfeed.  Personally, I have been<br/>\nbreastfeeding for over 4 1/2 years over 2 of which has been tandem nursing.<br/>\n My 4 1/2 year old daughter just weaned herself last month.  I am aware<br/>\nthat there are a few moms who can not nurse.  I have just never met one of<br/>\nthose moms who could truly not.  So Kim, what you had to share has<br/>\nenlightened me and intrigued me.  I am currently in the process of becoming<br/>\na La Leche League leader.  My attitude towards breastfeeding has changed<br/>\nand grown considerably over the last few years.  While I am more aware than<br/>\never why breastfeeding is so important I have become less judgemental. <br/>\nWhile I use to say to my daughter whenever we saw a bottle feeding baby,<br/>\n&quot;poor baby has to drink from a bottle and can&#39;t have mommy&#39;s milk,&quot; I am<br/>\nmore aware of people having circumstances that I know nothing about. <br/>\nPeople like Kim, or an adoptive mom who either did not know she could<br/>\ninduce lactation or was not successful at it, or others who were simply<br/>\nmisinformed or had no information.  Personally, I have decided to spend<br/>\nless energy attacking women who bottlefeed their children and more energy<br/>\nin informing moms and couples in the importance of breastmilk, the ease of<br/>\nbreastfeeding, and how to overcome obstacles in breastfeeding.  While Kim<br/>\ndid not share why she couldn&#39;t breastfeed, scientific evidence has<br/>\nindicated that few women truly cannot although everywhere I turn, moms are<br/>\ntellling me they couldn&#39;t for reasons that I know are myths.  Even doctors<br/>\nhave incorrectly told women they couldn&#39;t breastfeed.  That scares me.  I<br/>\nhave also known women who have been able to breastfeed when all the worst<br/>\nwas stacked against them.  My own stepmom had a complete blood transfusion<br/>\nafter the birth of my daughter.  She physically should not have been able<br/>\nto produce milk after that (so the doctors said) but she was able to<br/>\nreinduce lactation.  So, I guess I am rambling here, but personally I have<br/>\nrespect for any and every woman who has even attempted breastfeeding. <br/>\nEvery little bit is more than anything.  And like Kim, the fact that she<br/>\nsadly has suffered over not being able to breastfeed, shows her true heart<br/>\nto that fact that she had really wanted to.  I honor and respect those<br/>\nwomen.  Well, kudos to all of us moms who just want the best we can give to<br/>\nour children and families.  Whatever the &quot;best&quot; may be for us as<br/>\nindividuals.</div>","specialLinks":[]}],"prevTopicId":7838,"nextTopicId":7853}}