{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Bonknit@xxx.xxx","from":"Bonknit@...","replyTo":"LIST","senderId":"et1Ko9DiM5qZHNTZ386J1nYEPiRA0qxxCM41d6u7aBXJqHd1Q9mmWMTRo3raUhuXDolVS7CZ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Reassurance","postDate":"942268889","msgId":4419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yOTEuNDQxOS45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4418,"nextInTime":4420,"topicId":4419,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/9/99 11:42:22 PM Eastern Standard Time, Bcadams997@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1543851722\">In a message dated 11/9/99 11:42:22 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Bcadams997@...\">Bcadams997@...</a> writes:<br/>\n<br/>\n&lt;&lt;  My son paused and considered.  &quot;Well,&quot; he said <br/>\n thoughtfully, &quot;we&#39;re unschoolers, so the possibilities are endless!&quot;<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>    We are still working on getting to this point. I decided to try something <br/>\ndifferent with my 11yro. today.I read an essay about a family&#39;s journey <br/>\nthrough hsing. It was a little over his head but he has me so frustrated <br/>\ntrying to figure out what I&#39;m supposed to do with/for him as far as hsing <br/>\ngoes. The woman who wrote the article told how they decided to hs and <br/>\nexpressed the doubts they had along the way. What I really wanted him to hear <br/>\nwas how they came to believe that letting a child find his own way was the <br/>\nbest way to learn. After they had been hsing several years she became a sub. <br/>\nteacher. This really cemented for her that hsing is the best for children. <br/>\nThe story had much more than that but I hope you get the point.<br/>\n    We have had a couple of bad days with the boys bickering, fighting and <br/>\nworst of all older chasing younger around house. UGH! Today was better. <br/>\n    Anyway I think the article did help. He gets angry and accuses me of not <br/>\nteaching him anything. A ridiculous accusation since he has accomplished <br/>\nquite a bit of work and mastered a few things that eluded him in school. <br/>\n    I&#39;ve come to the conclusion that possibly he is acting out of fear. The <br/>\nsame fear we experience day to day on this journey. I think he becomes afraid <br/>\nhe&#39;s missing something or won&#39;t learn something important. <br/>\n    Our conversations led to some very interesting comments by him. He told <br/>\nme why he hated art class. He who is an artist. He would get excited when the <br/>\nteacher would say we are going to draw something today...Then she would ruin <br/>\nit by telling them what they had to draw and continue with how to draw it. He <br/>\nwould have rather she let them draw and be there when they needed help. Wow! <br/>\nHe said the same with clay, why couldn&#39;t they make what they wanted. I guess <br/>\nit&#39;s kind of hard to grade someone&#39;s original work isn&#39;t it. If you have a <br/>\nmodel than one is to copy it.<br/>\n    The other was about the library. He said we looked forward to library, <br/>\nbut when we got there the librarian (at school) would give us these handouts <br/>\nand we had to write over and over for several weeks who was author, when <br/>\nprinted, things about alphabetical order etc. I was so surprised, he had <br/>\nnever told me this before. What a way to ruin the joy of going to the <br/>\nlibrary. I have been wondering why he always says he hates the library when <br/>\nhe used to love it.<br/>\n    I know this is long and I&#39;ve been thinking about it a while how to <br/>\nexplain it. I don&#39;t know if I&#39;ve done a good job or not. I have a hard enough <br/>\ntime reassuring myself so when he explodes I feel panicky. Not because I <br/>\ndoubt what I&#39;m trying to do but because he is having such a time adjusting. I <br/>\ndon&#39;t want to be angry with him since I do believe this is what he is <br/>\nexpressing but some days are so hard.<br/>\n    Has anyone else dealt with this and if so how did give reassurance?<br/>\n<br/>\nLaura</div>","specialLinks":[]}],"prevTopicId":4415,"nextTopicId":4289}}