{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Beth Burnham","from":"&quot;Beth Burnham&quot; &lt;beth2002@...&gt;","replyTo":"LIST","senderId":"hT-rkoLA7nvlo24CbGmRtX9K-CgjPccb4Qle6m3O6Vyq_TRD12rAKIGqUlz14umqrXkI9DGgaFVJLRb6tChIa-VfWX-91i5eqw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re:blue ribbon schools/social conformity","postDate":"949798941","msgId":6220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40MDQuNjIyMC45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":6219,"nextInTopic":0,"prevInTime":6219,"nextInTime":6221,"topicId":6219,"numMessagesInTopic":0,"msgSnippet":"i looked into becoming a waldorf teacher when i lived in northern cal.  but backed away.  for me it s too structured and imposes a reality on to the","messageBody":"<div id=\"ygrps-yiv-2010614548\">i looked into becoming a waldorf teacher when i lived in northern cal.  but backed away.  for me it&#39;s too structured and imposes a reality on to the environment rather than allowing one to develop of it&#39;s own accord.   i&#39;m not as well read on the specific differences between these philosophies because i make mine up as i go and find i&#39;m much happier doing it that way.   it&#39;s hard for me to conform to even the alternative methods and this is why i&#39;m on this list because for me unschooling is more of a philosophical base and methods such as waldorf are more of a structure you &#39;live&#39; in.  just some thoughts <br/>\n  <br/>\nSusan I am in agreement with you too about the structure of the Waldorf way I just like to borrow from what I have appreciated about them esp. their books and art. I would have preferred to become a Waldorf teacher as opposed to a regular elem. teacher in the olden days because I would have liked to further develop that artist that I was ( I realize I still can blossom at home along side my own children) I think lots of parents have trouble out there in Waldorf land and still have to worry about the &quot;waldorf police&quot; who have in some cases literally gone after them! I had a bad experience looking into being a teacher at Antioch was totally dissed by the woman who ran the program and I was over the age of 35 at the time I looked into it. <br/>\nI have also gone to Hampshire College a great place for nonconforming &#39;unschoolers&quot; if you can afford it. I think they give scholarships nowadays. I had trouble with the drug culture that was there but hopefully those days are gone.<br/>\nTell us more about your son he sounds so vibrant and full of self esteem! <br/>\nBeth</div>","specialLinks":[]},{"userId":0,"authorName":"Thad Martin","from":"Thad Martin &lt;tmartin@...&gt;","replyTo":"LIST","senderId":"qXdanib26rzst6Ky7-SWiN_SCIrYpG8kmbxlPxnp-dYfvm5Aztj74pr_7opgcsYNeUN6TQ2UJRcnWwBGAosTFduEiGDd7Ieo2to","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:blue ribbon schools/social conformity","postDate":"949774033","msgId":6219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40MDQuNjIxOS45NTkyNjk3NDZAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":6220,"prevInTime":6218,"nextInTime":6220,"topicId":6219,"numMessagesInTopic":0,"msgSnippet":"... hi, i went to a b-day party for a 4 yo recently,  all the other kids there met in daycare,  we were the only homeschoolers.  i found the dynamic between","messageBody":"<div id=\"ygrps-yiv-633095418\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:megates@...\">megates@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:megates@...\">megates@...</a><br/>\n&gt;<br/>\n&gt; It seems a lot of people think a better school is more strict, &quot;has<br/>\n&gt; higher standards&quot;.  I met a mom who is very proud that her kids<br/>\n&gt; kindergarten class is so strict bc the children know what the rules<br/>\n&gt; are????<br/>\n<br/>\n </span></blockquote>hi,<br/>\n<br/>\ni went to a b-day party for a 4 yo recently,  all the other kids there met in<br/>\ndaycare,  we were the only homeschoolers.  i found the dynamic between the<br/>\nparents and kids really distant, not without love but without closeness.  the<br/>\nparent would stand back and say things like &#39;now uses your words&#39; and the<br/>\nkids would be fighting over the toys.  it was odd to me (not the fighting<br/>\npart:),  the kids do their thing and the parents do theirs and &#39;never the<br/>\n&#39;twain shall meet&#39; just bridged by a bit of vocalization.  it made me think<br/>\nthat people keep themselves so busy so they don&#39;t have to see what&#39;s really<br/>\nhappening and if something bad happens they have a good excuse - they were<br/>\ntoo busy.<br/>\n<br/>\ni have a thing about controlling kids.  boundaries are great but control is a<br/>\ndifferent story.  i didn&#39;t give birth to prove to the world i can spawn the<br/>\ngreatest person that ever lived (though rene&#39; (4) informed me last night that<br/>\nhe wants to become &#39;a legend&#39; -i&#39;m not completely convinced he clearly<br/>\nunderstands what that is &lt;lol&gt;) or the most obedient or the kid with the best<br/>\nmanners or any other of their silly accolades.  i did gave birth to<br/>\nexperience the joy of watching a person develop and find happiness in their<br/>\neveryday life and to be of whatever assistance i am able.  i believe<br/>\ncompassion and good manners are very helpful but only if it is done with<br/>\nsincerity not coercion.  this is my problem with schools.<br/>\n<br/>\ni would be interested in how others step out of the way of their kids and not<br/>\npass on all the issue based in social conformity.  from what i&#39;ve seen some<br/>\nof the greatest injustices perpetrated against kids is in the name of social<br/>\nconformity.  my son is out spoken - for the good or the bad - i make sure he<br/>\nknows his voice carries weight.  i also let him know when he&#39;s driving me<br/>\nnuts with his incessant talking.   i do not use the word &#39;incessant&#39; lightly<br/>\n- he will talk to anyone anytime for as long as they will sit there.  i can<br/>\nnot even count the number of picnics of total strangers (more often than not<br/>\nadult only) he has invited himself to.  he just parks himself without ever<br/>\nquestioning whether he would be wanted, in his mind of course they would want<br/>\nto hear what he has to say:)<br/>\n<br/>\ni am not embarrassed by anything he does.  at first i was tempted to feel he<br/>\nwas a reflection of me and i would be judged by other because of his<br/>\nbehavior,  but you know so what.  i know people judge,  their thoughts are<br/>\nso &#39;loud&#39; you can&#39;t help but know.  what i&#39;ve found is,  trying to control<br/>\n(the use of rules) kids or anyone,  sets you up for a power struggle then you<br/>\nhave to ask yourself &#39;is this really the kind of relationship i want?&#39; and &#39;<br/>\nisn&#39;t this just what i have with my parents (or any other person trying to<br/>\nhave power of you)?&#39;  for me the answers are no and yes respectively.  so i<br/>\naccept that i&#39;m breaking with all my &#39;role models&#39; and that leaves me with<br/>\nalways (at least for now:) having to know why i do what i do and making<br/>\nconscious choices so i don&#39;t fall back into repeating what was done to me and<br/>\ni must afford this right to my kids.  now that i&#39;ve been able to make the<br/>\ntransition i feel life doesn&#39;t need to be scheduled or planned or have a<br/>\ncurriculum to succeed and prosper and be happy but just conscious and sincere<br/>\ninvolvement is needed.<br/>\n<br/>\nthe other thing i wanted to touch on is that there has been a lot of<br/>\ndiscussion about waldorf, which to be honest i only lightly touched on as far<br/>\nas reading the emails.  it&#39;s not a big interest of mine though they do<br/>\nprovide nice products albeit a bit expensive but very good quality.   i<br/>\nlooked into becoming a waldorf teacher when i lived in northern cal.  but<br/>\nbacked away.  for me it&#39;s too structured and imposes a reality on to the<br/>\nenvironment rather than allowing one to develop of it&#39;s own accord.   i&#39;m not<br/>\nas well read on the specific differences between these philosophies because i<br/>\nmake mine up as i go and find i&#39;m much happier doing it that way.   it&#39;s hard<br/>\nfor me to conform to even the alternative methods and this is why i&#39;m on this<br/>\nlist because for me unschooling is more of a philosophical base and methods<br/>\nsuch as waldorf are more of a structure you &#39;live&#39; in.  just some thoughts<br/>\n<br/>\n<br/>\n&lt;&lt;<br/>\n I also know two hs families who live right next to a school.  They use<br/>\n the playground after school hours. &gt;&gt;<br/>\n<br/>\nLOL--same here!<br/>\n<br/>\nMarcie<br/>\n<br/>\nnot only do we live across the street for an elementary school but beside and<br/>\nbehind us is a daycare.  funny how things happen :)<br/>\n<br/>\n-susan<br/>\n<br/>\nps.  someone was talking about other unschooling lists and said they missed<br/>\nthe philosophical topics found there.   personal i would love to see those<br/>\nkinds of topics grow here.  so if anyone is so inclined i would join in<br/>\nthough i must admit i do get behind in the messages presently i&#39;ve got nearly<br/>\n200 just from this group to read:0</div>","specialLinks":[]}],"prevTopicId":6211,"nextTopicId":6233}}