{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Bobbie","from":"Bobbie &lt;insomniaaks@...&gt;","replyTo":"LIST","senderId":"Rb_X6f2is9SIkJ4y1Q2j9CRvSrKYhzP13CzSUAsi-pNDIXTVGO06it-eBqpHEeBkbl_yzI7nzghj7Ps7kCAIVtNr63n6","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Introduction...","postDate":"980205726","msgId":15303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwMTIyMjMyMjA2LjU2NjMyLnFtYWlsQHdlYjEwNjA4Lm1haWwueWFob28uY29tPg=="},"prevInTopic":15161,"nextInTopic":0,"prevInTime":15302,"nextInTime":15304,"topicId":15161,"numMessagesInTopic":0,"msgSnippet":"Ok, well, I am by no means an expert, but I do tend to have control issues and have to stop and remind myself not to try and control the way they learn. The ","messageBody":"<div id=\"ygrps-yiv-1128810236\">Ok, well, I am by no means an expert, but I do tend to<br/>\nhave &quot;control issues&quot; and have to stop and remind<br/>\nmyself not to try and control the way they learn. The<br/>\nonly thing that works for me totally without fail is<br/>\nto really put myself in their shoes. Try to remember<br/>\nback to when you were your sons ages and how proud of<br/>\nyourself and happy you would be if you were just<br/>\nreading a book along all by yourself and then maybe<br/>\nsomething you read reminded you of something else that<br/>\nreminded you of something else that you wanted to go<br/>\ncheck out or learn about or pretend about, and you<br/>\nknew, since you had the power of knowing how to read<br/>\non your own, that you could come back to your book at<br/>\nany time and pick it back up, thanks your mom teaching<br/>\nyou and instilling that love in you, and how it would<br/>\nmake you feel if your mom came and made sure you<br/>\nfinished the chapter, and threw off your groove. <br/>\nBeing a kid with definitely a mind of my own, I know I<br/>\nwould&#39;ve decided I just wasn&#39;t going to finish the<br/>\nchapter, especially if I HAD to. Our kids tend to be<br/>\nalot like we were when we were young and if we try to<br/>\nmentally go back there, it makes it a little easier to<br/>\nlet go and really want to just let them be and learn<br/>\non their own, as opposed to doing it just cuz as<br/>\nadults it makes sense to us as being what&#39;s best for<br/>\nthem. When I don&#39;t do this (thinking like them) I hear<br/>\nmyself -to my horror- telling them they &quot;HAVE to&quot; sit<br/>\ndown and finish whatever it is I was hoping they&#39;d<br/>\nfinish on their own, but maybe their minds have moved<br/>\non. (No! No! That means I&#39;m not in control, darn it!)<br/>\nSince we all are surrounded by supportive voices here<br/>\non this list we tend to make it sound &quot;easy&quot;, but<br/>\nspeaking for myself at least, and I&#39;m sure some others<br/>\nout there, it takes ALOT of effort to let go and<br/>\nreally have faith in our kids own built-in learning<br/>\nabilities and intuitions. <br/>\nIt kind of reminds me of one time when I asked this<br/>\nreally awesome lady (after overhearing a conversation<br/>\nof hers) if she was a Buddhist. She kind of chuckled<br/>\nand said &quot;Well... I try to be.&quot; I thought that was an<br/>\nawesome answer. I don&#39;t think I&#39;m a TOTALLY<br/>\nunschooler, even though I am TOTALLY into it, and<br/>\nbelieve in it in all wayz. All I do is TRY. I really<br/>\nthink that&#39;s all any of us do, as parents, which is<br/>\nstill way more than alot of kids out there get. Bravo<br/>\nto you for caring enough to try, and I&#39;m sure your<br/>\nkids are and will be grateful for it for the rest of<br/>\ntheir lives.<br/>\n-Bobbie <br/>\n<br/>\n--- <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:toshad@...\">toshad@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi, I&#39;m new here and pretty new to unschooling. <br/>\n&gt; Well, really I&#39;ve <br/>\n&gt; probably should really label what I do as Relaxed<br/>\n&gt; schooling instead <br/>\n&gt; of unschooling.  I have to boys who are almost 7 and<br/>\n&gt; almost 3 1/2.  I <br/>\n&gt; started hsing when my oldest was still in preschool.<br/>\n&gt; I just about <br/>\n&gt; worked him to death that yr.  The next yr. was<br/>\n&gt; Kindergarten and I <br/>\n&gt; relaxed a little more.  This yr. he is registered as<br/>\n&gt; 1st gr. and <br/>\n&gt; about 2 1/2 months into the &quot;school yr.&quot; we threw<br/>\n&gt; out all the <br/>\n&gt; workbooks and formal schooling.  I really want to<br/>\n&gt; unschool TOTALLY, <br/>\n&gt; but I&#39;m finding that it is taking ME time to let<br/>\n&gt; TOTALLY go.  My ds <br/>\n&gt; learned to read at an early age and so he is now<br/>\n&gt; reading well above <br/>\n&gt; grade level, so I feel the &quot;need&quot; to make sure he<br/>\n&gt; reads everyday.  I <br/>\n&gt; let him choose what he reads, but I do require it. <br/>\n&gt; Most  days I see <br/>\n&gt; him with books that he has picked up on his own and<br/>\n&gt; he will just read <br/>\n&gt; a page or two(these are usually books that I&#39;ve<br/>\n&gt; already read to <br/>\n&gt; him).  Why do I think that is not reading?  Why do I<br/>\n&gt; think he has to <br/>\n&gt; finish the book or chapter?????  I want to get past<br/>\n&gt; this!! <br/>\n  <br/>\n&gt; I would also like any ideas or advice on how I can<br/>\n&gt; let go that last <br/>\n&gt; little bit and TOTALLY unschool. <br/>\n&gt; Thanks,<br/>\n&gt; Lea <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Auctions - Buy the things you want at great prices. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com/\">http://auctions.yahoo.com/</a></div>","specialLinks":[]},{"userId":0,"authorName":"toshad@bellsouth.net","from":"toshad@...","replyTo":"LIST","senderId":"IQ_JyaIbhufjAU198XRpoXIOldP2iPuX6c8V14dxeCYGthqA4nl9dhpnVhWN1JpGJQOz8yt-SMZTSCk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introduction...","postDate":"979771436","msgId":15161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0NTc3Yyt0ZDJmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":15303,"prevInTime":15160,"nextInTime":15162,"topicId":15161,"numMessagesInTopic":0,"msgSnippet":"Hi, I m new here and pretty new to unschooling.  Well, really I ve probably should really label what I do as Relaxed schooling instead of unschooling.  I have","messageBody":"<div id=\"ygrps-yiv-1317820984\">Hi, I&#39;m new here and pretty new to unschooling.  Well, really I&#39;ve <br/>\nprobably should really label what I do as Relaxed schooling instead <br/>\nof unschooling.  I have to boys who are almost 7 and almost 3 1/2.  I <br/>\nstarted hsing when my oldest was still in preschool. I just about <br/>\nworked him to death that yr.  The next yr. was Kindergarten and I <br/>\nrelaxed a little more.  This yr. he is registered as 1st gr. and <br/>\nabout 2 1/2 months into the &quot;school yr.&quot; we threw out all the <br/>\nworkbooks and formal schooling.  I really want to unschool TOTALLY, <br/>\nbut I&#39;m finding that it is taking ME time to let TOTALLY go.  My ds <br/>\nlearned to read at an early age and so he is now reading well above <br/>\ngrade level, so I feel the &quot;need&quot; to make sure he reads everyday.  I <br/>\nlet him choose what he reads, but I do require it.  Most  days I see <br/>\nhim with books that he has picked up on his own and he will just read <br/>\na page or two(these are usually books that I&#39;ve already read to <br/>\nhim).  Why do I think that is not reading?  Why do I think he has to <br/>\nfinish the book or chapter?????  I want to get past this!!  Math is <br/>\nanother area.  After I threw out the workbooks we started playing <br/>\nmath games.  I&#39;ve purchased some &quot;number&quot; games and some &quot;strategy <br/>\nand logic&quot; games.  He likes a few of the &quot;number&quot; games(loves Phase <br/>\n10 dice game), but he REALLY enjoys the strategy and logic type games <br/>\nthe best.  I&#39;m wanting to purchase more games, so what do you all <br/>\nthink, should I purchase an equal amount of both type games(since he <br/>\ndoes like both).  What do you TOTALLY unschoolers think about these <br/>\nmath games?  <br/>\nI would also like any ideas or advice on how I can let go that last <br/>\nlittle bit and TOTALLY unschool. <br/>\nThanks,<br/>\nLea</div>","specialLinks":[]}],"prevTopicId":15302,"nextTopicId":15292}}