{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":63,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: When a child worries","postDate":"1219606521","msgId":37481,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4c2Q1cCtlYzlmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VCQkNPQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":37480,"nextInTopic":37482,"prevInTime":37480,"nextInTime":37482,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":" It s scary being a parent and nice to know that you re ...... Parenting in a reaction to fear isn t a good place to begin.  Fear based parenting can lead to","messageBody":"<div id=\"ygrps-yiv-908132293\">&quot; It&#39;s scary being a parent and nice to know that you&#39;re ......&quot;<br/>\n<br/>\nParenting in a reaction to fear isn&#39;t a good place to begin.  Fear based<br/>\nparenting can lead to a lot of unnecessary thought hindering the process<br/>\nof natural learning.  If a parent is fearing that a child may not learn<br/>\nto read, a child will pick up on that.  It&#39;s not going to help the<br/>\nnatural process of reading, and worse may hinder it.  Fear puts blocks<br/>\nto learning.  The optimal learning environment is happy and relaxed.<br/>\n<br/>\nIf you know that your child will read eventually, you can relax and then<br/>\nyour kids can relax.  If your focus is on being happy and having fun,<br/>\nhow can a child go wrong with that?  If the mind is open and happy and<br/>\nrelaxed all kinds of learning goes on!<br/>\n<br/>\nWe know a few kids personally that are completely hindered by fear.  The<br/>\nparents don&#39;t see it and the kids don&#39;t see it, it has become so natural<br/>\nfor them to feel it and have it in their lives that they can&#39;t see it<br/>\nfor what it is.  There is a lot of fear in our culture, I won&#39;t go into<br/>\nthat too much.  I guess it&#39;s a choice to focus on a different part of<br/>\nlife, the part of life that is happy and natural and fun, so that when<br/>\nthere is real fear and real things that are unhappy, we can get through<br/>\nthem without it ruining us.<br/>\n<br/>\nMaybe I&#39;m not making sense... I guess I feel pretty strongly that life<br/>\nis in a large part what you make it to be.  Anyone can make it fearful<br/>\nand hard, but it makes life more fulfilling to make it fun and happy.</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: When a child worries","postDate":"1219606382","msgId":37480,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBFNEYyM0U4LUQwRDctNDVDMC05NzdELTg0NUE5MkFCRkQ4NEBtYWMuY29tPg==","inReplyToHeader":"PGc4c2F0ZStjNmJlQGVHcm91cHMuY29tPg==","referencesHeader":"PGc4c2F0ZStjNmJlQGVHcm91cHMuY29tPg=="},"prevInTopic":37479,"nextInTopic":37481,"prevInTime":37479,"nextInTime":37481,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"... People don t even know what these kids are capable of because so very few have been left alone (not forced to try to learn to read) to develop this kind of","messageBody":"<div id=\"ygrps-yiv-1424277389\">On Aug 24, 2008, at 11:56 AM, Jenny C wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This was true for Chamille too.  Even with games that required some  <br/>\n&gt; sort<br/>\n&gt; of memory skill, like Clue, where you had to write it down on paper to<br/>\n&gt; keep track of it, she&#39;d just remember it all in her head.  She  <br/>\n&gt; couldn&#39;t<br/>\n&gt; read, or write out the words.  She ALWAYS won.  She was so good at<br/>\n&gt; keeping it all straight in her head.  Meanwhile everyone else is  <br/>\n&gt; keeping<br/>\n&gt; track on paper and their head, but refering back to paper to keep it  <br/>\n&gt; all<br/>\n&gt; straight.<br/>\n<br/>\n </span></blockquote>People don&#39;t even know what these kids are capable of because so very  <br/>\nfew have been left alone (not forced to try to learn to read) to  <br/>\ndevelop this kind of skill. But it is astounding, isn&#39;t it?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: When a child worries","postDate":"1219605864","msgId":37479,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2MTFENDQ4LTU2MEMtNDQwRi1CNDg5LTBFMEZBRThGREY2OUBtYWMuY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VCQkNPQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VCQkNPQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":37478,"nextInTopic":37480,"prevInTime":37478,"nextInTime":37480,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"... You talk as if that hasn t been said a million times right here on this list. ... Are you new here? Just wondering - because you sound like you don t ","messageBody":"<div id=\"ygrps-yiv-986292736\">On Aug 24, 2008, at 10:04 AM, Clare Kirkpatrick wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I agree...if a parent is new (or not!) to unschooling, surely it&#39;s  <br/>\n&gt; helpful<br/>\n&gt; to the child to say to the parent &#39;keep their environment word-rich  <br/>\n&gt; and<br/>\n&gt; they&#39;ll learn when they&#39;re ready to&#39;.<br/>\n<br/>\n </span></blockquote>You talk as if that hasn&#39;t been said a million times right here on  <br/>\nthis list.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  It&#39;s scary being a parent and nice to<br/>\n&gt; know that you&#39;re not denying the opportunities a child needs to  <br/>\n&gt; learn when<br/>\n&gt; they want/are ready to about anything.<br/>\n<br/>\n </span></blockquote>Are you new here? Just wondering - because you sound like you don&#39;t  <br/>\nrealize that that is what is talked about pretty much nonstop right  <br/>\nhere on this list. Like you don&#39;t think the listowner and other  <br/>\nregular posters know this?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  If you&#39;re child wans&#39;t learning to<br/>\n&gt; read because you had no books in your house and no computer - no  <br/>\n&gt; access to<br/>\n&gt; words - that&#39;s holding them back.<br/>\n<br/>\n </span></blockquote>I doubt anybody reading this list has no books and no computer and no  <br/>\naccess to words - the kid would have to be shut up in the house 24/7,  <br/>\nanyway. Words are EVERYWHERE.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ensuring they have the opportunity to<br/>\n&gt; access what they need, and knowing what that might be, if and when  <br/>\n&gt; they need<br/>\n&gt; it is a good thing...isn&#39;t it?<br/>\n<br/>\n </span></blockquote>Do you really have to ask?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  And letting parents know what that might be,<br/>\n&gt; and reassuring them that children *will* learn unless you ban  <br/>\n&gt; anything with<br/>\n&gt; words on is also a good thing...isn&#39;t it?<br/>\n<br/>\n </span></blockquote>Are you seriously worried that anyone on this list is considering  <br/>\nbanning anything with words on it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Children will automatically<br/>\n&gt; benefit from parents who feel they&#39;re doing the right thing (or at  <br/>\n&gt; least not<br/>\n&gt; doing the wrong thing) and who have relaxed about their concerns  <br/>\n&gt; about the<br/>\n&gt; child not learning to read by a certain age?<br/>\n<br/>\n </span></blockquote>I don&#39;t know about children automatically benefitting from parents  <br/>\nsimply thinking they are doing the right thing. First, we (regular  <br/>\nposters on this list) are not here telling people to &quot;do the right  <br/>\nthing.&quot; We are here saying that you don&#39;t have to &quot;do school&quot; - that  <br/>\nkids can learn without curriculum, lesson plans, tests, grades,  <br/>\nassignments, or being taught in any usual sense of the word - and that  <br/>\nthe same principles that apply to learning conventional school  <br/>\nsubjects apply to other kinds of learning, too.<br/>\n<br/>\nBut, there are plenty of parents who think they&#39;re &quot;doing the right  <br/>\nthing&quot; when they smack their kids around, when they shame them, and  <br/>\nall sorts of things. We&#39;re most definitely not here to help parents  <br/>\nthink they are doing the right (or wrong) thing.<br/>\n<br/>\n<br/>\nUnschooling rests on a foundational set of beliefs about how children  <br/>\nlearn. I say, &quot;beliefs,&quot; because most people don&#39;t believe in them. It  <br/>\nstarted out more as a matter more of faith - it was based on an  <br/>\nunderlying view of human nature. But, there is now a considerable  <br/>\namount of evidence based on modern brain research to support these  <br/>\nbeliefs. We don&#39;t spend a lot of time looking at that research, but it  <br/>\nis out there and pretty much completely ignored by education  <br/>\nprofessionals. These days, though, many of us have grown unschooled  <br/>\nchildren who provide evidence enough to give us tremendous confidence  <br/>\nin unschooling.<br/>\n<br/>\nWe&#39;re here to consider and examine and analyze unschooling principles  <br/>\nand to look at how they may be applied in a wide variety of real  <br/>\nsituations and circumstances. We know that the result of this kind of  <br/>\nanalytical process can be that parents come to more and more deeply  <br/>\nunderstand and embrace unschooling in ways they hadn&#39;t previously. We  <br/>\nknow that parents often become kinder and gentler with their children  <br/>\nas their thinking about how children learn changes. It isn&#39;t about  <br/>\nright or wrong. It isn&#39;t about parents feeling better or worse. It is  <br/>\nabout deepening our understanding of the basic principles and how they  <br/>\nwork.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a child worries","postDate":"1219605202","msgId":37478,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4c2JzaSs5bzMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLTUVCQUNPQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":37477,"nextInTopic":37479,"prevInTime":37477,"nextInTime":37479,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"For anyone who does enjoy reading books to themselves, it s ... to ... books to ... bored. ... do, ... reader?! I don t think that assumption connects with","messageBody":"<div id=\"ygrps-yiv-510973371\">For anyone who does enjoy reading books to themselves, it&#39;s<br/>\n<blockquote><span title=\"ireply\"> &gt; a benefit to do it young...and I would assume that those who do learn<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; read young are likely to be people who are going to enjoy reading<br/>\n </span></blockquote>books to<br/>\n<blockquote><span title=\"ireply\"> &gt; themselves. It&#39;s a lovely way to be by yourself, but not lonely or<br/>\n </span></blockquote>bored.<br/>\n<blockquote><span title=\"ireply\"> &gt; I can quite understand that not everyone loves it, but for those that<br/>\n </span></blockquote>do,<br/>\n<blockquote><span title=\"ireply\"> &gt; then how many more years of that joy you&#39;ll get if you are an early<br/>\n </span></blockquote>reader?!<br/>\n<br/>\nI don&#39;t think that assumption connects with what actually happens.  I<br/>\nthink liking to do things by yourself is more of a personality trait<br/>\nthan anything to do with reading.  My older daughter, now 14 started<br/>\nreading at 11/12 ish.  She reads all the time now.  I don&#39;t think she<br/>\nmissed out on years of joy though, she was doing things that she really<br/>\nliked that were far more important and interesting than reading was at<br/>\nthe time.<br/>\n<br/>\nShe loves stories, really good stories.  You can get stories from many<br/>\nmany sources, like movies and other media.  Her main source for stories<br/>\ncame from her own head.  She most definitely wasn&#39;t missing out on<br/>\ninteresting stories and itricate plots, because she was living them and<br/>\nacting them out in her play, she wasn&#39;t passively reading them.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a child worries","postDate":"1219604206","msgId":37477,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4c2F0ZStjNmJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk2MzM4NS4yMTQ4My5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":37476,"nextInTopic":37478,"prevInTime":37476,"nextInTime":37478,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"He listens so much more intently than I do, I ve read all of the Harry Potter books, he s listened to them, and he knows them better. If I d listened to them","messageBody":"<div id=\"ygrps-yiv-1491018885\">&quot;He listens so much more intently than I do, I&#39;ve read all of the Harry<br/>\nPotter books, he&#39;s listened to them, and he knows them better. If I&#39;d<br/>\nlistened to them I&#39;d have to learn how, as Pam said she needed to do,<br/>\nI&#39;d have to figure out how to stop my mind chattering so much so that I<br/>\ncould hear Stephen Fry or Jim Dale reading to me. I would remember far<br/>\nless than he does. He<br/>\ndoes that a lot, hears or sees a cue that I didn&#39;t see or hear. &quot;<br/>\n<br/>\nThis was true for Chamille too.  Even with games that required some sort<br/>\nof memory skill, like Clue, where you had to write it down on paper to<br/>\nkeep track of it, she&#39;d just remember it all in her head.  She couldn&#39;t<br/>\nread, or write out the words.  She ALWAYS won.  She was so good at<br/>\nkeeping it all straight in her head.  Meanwhile everyone else is keeping<br/>\ntrack on paper and their head, but refering back to paper to keep it all<br/>\nstraight.<br/>\n<br/>\nShe remembers all those details.  I think, in part, because she doesn&#39;t<br/>\nhave her mind filled with things that are irrelevant to her.  She can<br/>\noperate at her best capacity!  She reads a lot now, book after vampire<br/>\nbook.</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: When a child worries","postDate":"1219600315","msgId":37476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2MzM4NS4yMTQ4My5xbUB3ZWI4NjIwMS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":37475,"nextInTopic":37477,"prevInTime":37475,"nextInTime":37477,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"If you re child wans t learning to read because you had no books in your house and no computer - no access to words - that s holding them back. It isn t","messageBody":"<div id=\"ygrps-yiv-1435223270\">&quot;If you&#39;re child wans&#39;t learning to<br/>\nread because you had no books in your house and no computer - no access to<br/>\nwords - that&#39;s holding them back.&quot;<br/>\n<br/>\nIt isn&#39;t holding them back if you live in a world without computers or books. In that world reading is a luxury good that may not help you to gain the skills you need to live life. Lots of people have had lives without reading. Lots of history is about people without books or computers. Now, this lifetime, there are parts of the world without books or computers. David (dh) interviewed Mayans in Belize who didn&#39;t have much schooling, and were illiterate, but knew what they needed to for getting the most money that they could for the produce that they grew and sold.  Lots of people, including those living in the U.S. or the UK or wherever, don&#39;t need to read to get the things that they want out of life. The interesting thing to David was that the people he met in Belize where perfectly capable of reading what they needed to read when they needed to read it, no matter what their age at first reading was. And none of the people he interviewed had reading<br/>\n material beyond the textbooks that their children used for school and for some, maybe, a bible. <br/>\n<br/>\nI&#39;m not being as clear as I would like. My feeling is that if you live in a community without books and computers, for whatever reason, accessing those things is a way to get yourself excluded from that community. Or, at least, for the reading to be really useful, really applicable to your life, you would have to leave that community and find another. Not that I live in such a world. But many people do, not by choice, but by necessity. <br/>\n<br/>\nSimon, my 11 year old son, is not reading yet. He has books and computers that fill our house and his life. I read to him, although not a lot these days, there just aren&#39;t books he wants to hear. He gets books on cd, I think being able to control when they start and stop is much more satisfying than having me read. For a long time I worried, very occasionally I still worry, but I know, and, more importantly, he knows, that reading will happen when it happens. Until then, I&#39;m not waiting or moaning, more than that I am utterly impressed with the things that he sees based on not reading. He listens so much more intently than I do, I&#39;ve read all of the Harry Potter books, he&#39;s listened to them, and he knows them better. If I&#39;d listened to them I&#39;d have to learn how, as Pam said she needed to do, I&#39;d have to figure out how to stop my mind chattering so much so that I could hear Stephen Fry or Jim Dale reading to me. I would remember far less than he does. He<br/>\n does that a lot, hears or sees a cue that I didn&#39;t see or hear. I did that when we lived in Japan and were completely illiterate. David would get the staff at the university to write out some of the Kanji that we needed to recognize for the bus to get home and the rest we had to figure out on our own. I still can&#39;t read or speak Japanese, but we had a full and wonderful life that year. <br/>\n<br/>\nAlso, I don&#39;t read a lot these days. I used to read almost all the time. I would have many books on the go and would forgo many other things to read them. When I had Simon and Linnaea being present was more important than reading and my reading began to wane. Reading, it seems, was about filling the empty spaces, and when I had children I had fewer of those. My reading is beginning to rise again. I am reading a bit more now than I did last year, but my life is still more interesting than other people&#39;s literary view of life. I&#39;m not dismissing reading, but I do think that it is less valuable than it is often considered. Linnaea, my daughter, read at 6. She likes being able to read. But she doesn&#39;t read many books. Mostly it is about comics on the toilet, or quests on WoW. For books, she likes to snuggle up in bed at night and have me read to her. And Simon doesn&#39;t have any sense of less than by not reading as early as she did. <br/>\n<br/>\nSchuyler<br/>\nwww.waynforth.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a child worries","postDate":"1219598175","msgId":37475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4czUwditiYnZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLTUVCQUNPQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":37474,"nextInTopic":37476,"prevInTime":37474,"nextInTime":37476,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"~~I can quite understand that not everyone loves it, but for those that do, then how many more years of that joy you ll get if you are an early reader?!~~ It s","messageBody":"<div id=\"ygrps-yiv-733977458\">~~I can quite understand that not everyone loves it, but for those<br/>\nthat do, then how many more years of that joy you&#39;ll get if you are an<br/>\nearly reader?!~~<br/>\n<br/>\nIt&#39;s not going to matter!<br/>\nWhether someone loves reading for pleasure or not, it doesn&#39;t matter<br/>\nif they read early or late. YOu seem to be equating early reading with<br/>\nmore pleasure. That just doesn&#39;t hold true in an unschooling family.<br/>\n<br/>\nI have one that learned to read at 12 and one that at 11 is just<br/>\ngetting into reading to herself. She&#39;s gotten enjoyment from being<br/>\nread to for many years and now enjoys reading to herself. Who cares<br/>\nwhat form the reading pleasure came in? Who cares what age it started?<br/>\n<br/>\nPeace and joy happen best when natural tendencies are allowed to flow.<br/>\n<br/>\nRen<br/>\nlearninginfreedom.com</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"&quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt;","profile":"cloggsy_sk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: When a child worries","postDate":"1219597445","msgId":37474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VCQkNPQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","inReplyToHeader":"PGc4cnZldCtjNjBvQGVHcm91cHMuY29tPg=="},"prevInTopic":37473,"nextInTopic":37475,"prevInTime":37473,"nextInTime":37475,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"`Joyce has already responded really well, but I want to add that I m not here so much to help parents as I am to help children.~~ I know what you re saying","messageBody":"<div id=\"ygrps-yiv-1751856574\">&quot;`Joyce has already responded really well, but I want to add that I&#39;m<br/>\nnot here so much to help parents as I am to help children.~~<br/>\n<br/>\nI know what you&#39;re saying here...but, by helping the parents it IS<br/>\nhelping the children.:)<br/>\n<br/>\nRen&quot;<br/>\n<br/>\nI agree...if a parent is new (or not!) to unschooling, surely it&#39;s helpful<br/>\nto the child to say to the parent &#39;keep their environment word-rich and<br/>\nthey&#39;ll learn when they&#39;re ready to&#39;.  It&#39;s scary being a parent and nice to<br/>\nknow that you&#39;re not denying the opportunities a child needs to learn when<br/>\nthey want/are ready to about anything.  If you&#39;re child wans&#39;t learning to<br/>\nread because you had no books in your house and no computer - no access to<br/>\nwords - that&#39;s holding them back.  Ensuring they have the opportunity to<br/>\naccess what they need, and knowing what that might be, if and when they need<br/>\nit is a good thing...isn&#39;t it?  And letting parents know what that might be,<br/>\nand reassuring them that children *will* learn unless you ban anything with<br/>\nwords on is also a good thing...isn&#39;t it?  Children will automatically<br/>\nbenefit from parents who feel they&#39;re doing the right thing (or at least not<br/>\ndoing the wrong thing) and who have relaxed about their concerns about the<br/>\nchild not learning to read by a certain age?<br/>\n<br/>\nClare</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"&quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt;","profile":"cloggsy_sk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: When a child worries","postDate":"1219597006","msgId":37473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLTUVCQUNPQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","inReplyToHeader":"PERCNDNGMjM5LUUyMTQtNDJFOS1COUZCLTZGQkU4Q0E1RkRGREBtYWMuY29tPg=="},"prevInTopic":37472,"nextInTopic":37474,"prevInTime":37472,"nextInTime":37474,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":" I have to say I don t like the thought that children ... I think the point was missed. Late readers can spend years and years listening to amazing stories","messageBody":"<div id=\"ygrps-yiv-776691372\">&quot;&gt;&gt;&gt; I have to say I don&#39;t like the thought that children<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; who have a passion for books could be held back from learning to<br/>\n&gt; read<br/>\n&gt;&gt;&gt; because someone&#39;s read somewhere that later readers have this,<br/>\n&gt; that<br/>\n&gt;&gt;&gt; or the<br/>\n&gt;&gt;&gt; other benefit.  Early readers have a lot of benefits too - like<br/>\n&gt;&gt;&gt; being able<br/>\n&gt;&gt;&gt; to spend years and years reading amazing stories.<br/>\n&gt;&gt;<br/>\n&gt;&gt; As opposed to having all those amazing stories read to them?<br/>\n&gt;<br/>\n&gt; No, not opposed to that at all - alongside that<br/>\n<br/>\n<br/>\n </span></blockquote>I think the point was missed.<br/>\n<br/>\nLate readers can spend years and years listening to amazing stories -<br/>\nthey don&#39;t miss out on that &quot;benefit&quot; by reading later. Some of the<br/>\nmost &quot;well-read&quot; young adults I know were much later readers.&quot;<br/>\n<br/>\nApologies!  However, I personally *love* getting engrossed in a book and<br/>\ncan&#39;t switch off enough to sleep if I don&#39;t read beforehand.  I also enjoy<br/>\nsharing books.  For anyone who does enjoy reading books to themselves, it&#39;s<br/>\na benefit to do it young...and I would assume that those who do learn to<br/>\nread young are likely to be people who are going to enjoy reading books to<br/>\nthemselves.  It&#39;s a lovely way to be by yourself, but not lonely or bored.<br/>\nI can quite understand that not everyone loves it, but for those that do,<br/>\nthen how many more years of that joy you&#39;ll get if you are an early reader?!<br/>\n<br/>\n&quot;The biggest benefit of early reading is that it makes schooling<br/>\neasier. But we&#39;re not schooling, so that isn&#39;t a benefit in our<br/>\nfamilies.&quot;<br/>\n<br/>\nThis is certainly why schooled children need to read young, but only if they<br/>\ngo to conventional schools.  It&#39;s not the biggest benefit, though, for<br/>\nchildren who don&#39;t go to school - it&#39;s an irrelevant benefit!<br/>\n<br/>\nClare</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a child worries","postDate":"1219592477","msgId":37472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4cnZldCtjNjBvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ0Q0U2ODExLTI3NUEtNENBRi1BNzM5LUI4Mjk5MDVCQ0IwNUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":37467,"nextInTopic":37473,"prevInTime":37471,"nextInTime":37473,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"~`Joyce has already responded really well, but I want to add that I m not here so much to help parents as I am to help children.~~ I know what you re saying","messageBody":"<div id=\"ygrps-yiv-386844304\">~`Joyce has already responded really well, but I want to add that I&#39;m<br/>\nnot here so much to help parents as I am to help children.~~<br/>\n<br/>\nI know what you&#39;re saying here...but, by helping the parents it IS<br/>\nhelping the children.:)<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: When a child worries","postDate":"1219587097","msgId":37467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0Q0U2ODExLTI3NUEtNENBRi1BNzM5LUI4Mjk5MDVCQ0IwNUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGc4cmt1OStjZ2k3QGVHcm91cHMuY29tPg==","referencesHeader":"PGc4cmt1OStjZ2k3QGVHcm91cHMuY29tPg=="},"prevInTopic":37464,"nextInTopic":37472,"prevInTime":37466,"nextInTime":37468,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"... children want ... Joyce has already responded really well, but I want to add that I m not here so much to help parents as I am to help children. If your","messageBody":"<div id=\"ygrps-yiv-2135466836\"><blockquote><span title=\"ireply\">&gt; Sandra, you say &#39;there&#39;s not much you can do but...&#39; but what you&#39;ve<br/>\n &gt; mentioned is a lot and would be a lot of help to parents whose  <br/>\n </span></blockquote>children want<br/>\n<blockquote><span title=\"ireply\">  &gt; to learn to read but are unsure how to support them.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Joyce has already responded really well, but I want to add that I&#39;m  <br/>\nnot here so much to help parents as I am to help children.<br/>\n<br/>\nIf your child wants to learn to read, assure her that she will.  Then  <br/>\nkeep the world happy and peaceful and instead of arranging your  <br/>\nexpectations in schoolish terms (&quot;she will learn to read by the time  <br/>\nshe&#39;s seven,&quot; or &quot;he will learn multiplication first and then  <br/>\ndivision&quot;), find ways to think of it natural learning terms (&quot;she  <br/>\nwill pick this up naturally as time goes by, just from being in a  <br/>\nstimulating, peaceful environment&quot;).<br/>\n<br/>\nIt seems at the moment you&#39;re focusing on what  you to think about  <br/>\nwhat I can do to help a lot of parents support their children who  <br/>\nwant to learn to read.<br/>\n<br/>\nWhat I would like to focus on is how children learn to read in their  <br/>\nown ways, easily, when they&#39;re ready and able, if and when people  <br/>\nstop trying to teach them.<br/>\n<br/>\nPeople learn many very difficult things naturally.  Perhaps we don&#39;t  <br/>\nsee them as &quot;difficult&quot; when we KNOW for sure they are learned  <br/>\nnaturally.  Walking.  Understanding speech.  Speaking.  Jumping.   <br/>\nClimbing.  Singing.<br/>\n<br/>\nIf we lead children to believe that reading must be &quot;taught&quot; (even by  <br/>\nusing phrases such as &quot;she taught herself&quot;), they will think other  <br/>\nthings have to be &quot;taught&quot; too.   But if a child learns to read on  <br/>\nhis own, he will *know* that he can learn other things on his own.<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/deeper\">http://sandradodd.com/r/deeper</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"&quot;Joyce Fetteroll&quot; &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a child worries","postDate":"1219581705","msgId":37464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4cmt1OStjZ2k3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLRUVBTENPQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":37463,"nextInTopic":37467,"prevInTime":37463,"nextInTime":37465,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"... What s helpful to understand when faced with helping a child learn what they aren t ready to learn is that while a parent can support a child s desire,","messageBody":"<div id=\"ygrps-yiv-2115052939\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Sandra, you say &#39;there&#39;s not much you can do but...&#39; but what you&#39;ve<br/>\n&gt; mentioned is a lot and would be a lot of help to parents whose children want<br/>\n&gt; to learn to read but are unsure how to support them.<br/>\n<br/>\n </span></blockquote>What&#39;s helpful to understand when faced with helping a child learn what they aren&#39;t ready to learn is that while a parent can support a child&#39;s <br/>\ndesire, they probably can&#39;t speed development along.<br/>\n<br/>\nAnd I say probably because we can&#39;t really know. We *can* be certain teaching to read doesn&#39;t work, otherwise the schools wouldn&#39;t be <br/>\nhaving problems. Whether reading to them, playing word games and so on speeds development a little (because the child&#39;s making <br/>\nconnections) is impossible to say. It doesn&#39;t influence development in a large way, otherwise there wouldn&#39;t be unschooling kids in print rich <br/>\natmospheres who don&#39;t read until their teens.<br/>\n<br/>\nA child may desire to ride a bike, but unless they&#39;re developmentally ready for the coordination and everything else needed, they can&#39;t. Does <br/>\nriding a bike with training wheels help them be ready sooner? Once they&#39;re developmentally ready, will having ridden with training wheels <br/>\nfor a year or two get them upright quicker? Maybe. Who knows. But I&#39;m betting there isn&#39;t a huge difference.<br/>\n<br/>\nOh, I do have an anecdote. When Kat was 3 or 4, Carl held a Tae Kwon Do class for little kids. Just a fun thing. Nothing rigorous. Kat did the <br/>\nclasses for a year but she wasn&#39;t all that coordinated. She&#39;d go through the motions of punching and kicking but she looked awkward. (Other <br/>\nkids her age were more coordinated, though not all.) It wasn&#39;t until several years later, without further lessons, that she was playfully <br/>\nkicking and it actually looked coordinated and like a Tae Kwon Do kick. <br/>\n<br/>\nSo, kids can pick up knowledge without being able to use it. But imposing that knowledge against the child&#39;s desire -- as schools do with <br/>\ntrying to make them learn to read -- can be a good way to turn them off of something. What good would learning to punch as a 3 yo do if <br/>\nKat had hated the process? Will she find Tae Kwon Do easier if she takes it up again? I don&#39;t know, but the ease wouldn&#39;t be worth the <br/>\nstruggle of imposing it on her (since it would also run the risk of turning her off).<br/>\n<br/>\nSo, do things because they&#39;re fun, not because you think it will lead somewhere. Expose them to lots of stuff. Keep doing the stuff they <br/>\nenjoy. Drop the stuff they don&#39;t. (It&#39;s so obvious, written out that way ;-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: When a child worries","postDate":"1219562307","msgId":37463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCNDNGMjM5LUUyMTQtNDJFOS1COUZCLTZGQkU4Q0E1RkRGREBtYWMuY29tPg==","inReplyToHeader":"PGc4cXVjaCthNnIzQGVHcm91cHMuY29tPg==","referencesHeader":"PGc4cXVjaCthNnIzQGVHcm91cHMuY29tPg=="},"prevInTopic":37461,"nextInTopic":37464,"prevInTime":37462,"nextInTime":37464,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"... I think the point was missed. Late readers can spend years and years listening to amazing stories - they don t miss out on that benefit by reading later.","messageBody":"<div id=\"ygrps-yiv-1528113474\">On Aug 23, 2008, at 11:16 PM, cloggsy_sk wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I have to say I don&#39;t like the thought that children<br/>\n&gt;&gt;&gt; who have a passion for books could be held back from learning to<br/>\n&gt; read<br/>\n&gt;&gt;&gt; because someone&#39;s read somewhere that later readers have this,<br/>\n&gt; that<br/>\n&gt;&gt;&gt; or the<br/>\n&gt;&gt;&gt; other benefit.  Early readers have a lot of benefits too - like<br/>\n&gt;&gt;&gt; being able<br/>\n&gt;&gt;&gt; to spend years and years reading amazing stories.<br/>\n&gt;&gt;<br/>\n&gt;&gt; As opposed to having all those amazing stories read to them?<br/>\n&gt;<br/>\n&gt; No, not opposed to that at all - alongside that<br/>\n<br/>\n<br/>\n </span></blockquote>I think the point was missed.<br/>\n<br/>\nLate readers can spend years and years listening to amazing stories -  <br/>\nthey don&#39;t miss out on that &quot;benefit&quot; by reading later. Some of the  <br/>\nmost &quot;well-read&quot; young adults I know were much later readers.<br/>\n<br/>\nThe biggest benefit of early reading is that it makes schooling  <br/>\neasier. But we&#39;re not schooling, so that isn&#39;t a benefit in our  <br/>\nfamilies.<br/>\n<br/>\nI almost never read books - I listen to audible books on my ipod nano.  <br/>\nI had to learn to listen - there was most definitely a learning curve.  <br/>\nBut now I much prefer to listen and I choose my listening material  <br/>\nbased at least partially on the narrator&#39;s ratings.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":279436458,"authorName":"cloggsy_sk","from":"&quot;cloggsy_sk&quot; &lt;clare.kirkpatrick@...&gt;","profile":"cloggsy_sk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a child worries","postDate":"1219558609","msgId":37461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4cXVjaCthNnIzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU0MkFDRTk1LTc0Q0UtNEQ2OS1CRDRBLTI1ODdDMkM5MTk1NUBtYWMuY29tPg=="},"prevInTopic":37460,"nextInTopic":37463,"prevInTime":37460,"nextInTime":37462,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"... read ... that ... No, not opposed to that at all - alongside that.  I haven t suddenly stopped reading to her now that she can read.  I loved being read to","messageBody":"<div id=\"ygrps-yiv-1294210559\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pamela Sorooshian <br/>\n&lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Aug 22, 2008, at 11:00 PM, Clare Kirkpatrick wrote:<br/>\n&gt; <br/>\n&gt; &gt; I have to say I don&#39;t like the thought that children<br/>\n&gt; &gt; who have a passion for books could be held back from learning to <br/>\n </span></blockquote>read<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; because someone&#39;s read somewhere that later readers have this, <br/>\n </span></blockquote>that  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; or the<br/>\n&gt; &gt; other benefit.  Early readers have a lot of benefits too - like  <br/>\n&gt; &gt; being able<br/>\n&gt; &gt; to spend years and years reading amazing stories.<br/>\n&gt; <br/>\n&gt; As opposed to having all those amazing stories read to them?<br/>\n<br/>\n </span></blockquote>No, not opposed to that at all - alongside that.  I haven&#39;t suddenly <br/>\nstopped reading to her now that she can read.  I loved being read to <br/>\nwell into my adulthood, and still love audio books etc.  I&#39;d never <br/>\ndream of stopping offering to read to my children or refusing to do <br/>\nso just because they can read themselves.<br/>\n<br/>\nClare</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"&quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt;","profile":"cloggsy_sk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] When a child worries","postDate":"1219558447","msgId":37460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLRUVBTENPQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","inReplyToHeader":"PEM1MzA0MTNFLTg5N0ItNDlCRC1CNEYxLTFCNDQwQjlGNzJBN0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":37453,"nextInTopic":37461,"prevInTime":37459,"nextInTime":37461,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"A child can want to learn to read and not be developmentally ready to do so. And a parent who is in tune with his/her children having paid attention to them","messageBody":"<div id=\"ygrps-yiv-1762053696\">&quot;A child can want to learn to read and not be developmentally ready to<br/>\ndo so.&quot;<br/>\n<br/>\nAnd a parent who is in tune with his/her children having paid attention to<br/>\nthem and respected them and the way they want/need to learn will be able to<br/>\npick up when things are going too fast for the child and  help support them<br/>\nto slow down a bit.  This is one of the things that gets me about school -<br/>\nthe parents who say &#39;what&#39;s wrong with my child?  He keeps wetting the bed.<br/>\nIt&#39;s not school because he loves it there&#39; - of course it&#39;s school!  It&#39;s<br/>\ntoo much for him.  Don&#39;t we all love some things that aren&#39;t good for us<br/>\neither physically or emotionally?<br/>\n<br/>\n&quot;Before he&#39;s reading, there&#39;s not much you can do but keep reading to<br/>\nhim, play games with sounds and words if he likes that, let him watch<br/>\nmovies, go to plays, listen to music--keep his environment word-<br/>\nfilled, and the reading will come.&quot;<br/>\n<br/>\nSandra, you say &#39;there&#39;s not much you can do but...&#39; but what you&#39;ve<br/>\nmentioned is a lot and would be a lot of help to parents whose children want<br/>\nto learn to read but are unsure how to support them.  We&#39;ve never sat down<br/>\nwith our 5yo and said &#39;right, let&#39;s do some learning to read&#39;, partly<br/>\nbecause I don&#39;t believe in doing things that way, but partly because she<br/>\nputs the brakes on the minute we overstep the mark in this respect!<br/>\nHowever, when she said she wanted to learn to read, we just said &#39;well keep<br/>\non doing what you&#39;re doing, because you are learning - you can see you&#39;re<br/>\nlearning because of all the words you recognise&#39;.  What she was doing, off<br/>\nher own back, was looking at books on her own, or with her sister (a *lot*<br/>\nof time spent on this - often I&#39;d hear that silence that usually makes you<br/>\ngo &#39;ok...what on earth are they up to now?  Is my bathroom going to be<br/>\nflooded or something awful like that?&#39;, I&#39;d tentatively go upstairs and find<br/>\nthem both sitting in bed looking at books!  For an hour or so!), doing<br/>\nworkbooks for five or ten minutes at a time - they love them but DD1 is like<br/>\na butterfly and apart from spending time looking at books, doesn&#39;t stick at<br/>\nanything else for very long!, playing on the computer, talking about words,<br/>\nsinging songs, etc - all the things you mention.  Rather than making<br/>\n&#39;learning to read&#39; a thing in itself, instead it&#39;s been very much the way<br/>\nshe learned to talk - an absorption of the skills needed, in her own time<br/>\nand in her own way and on her own terms.<br/>\n<br/>\n&quot;-=-.  There is<br/>\nneed in society for people who are more immersed int he hearing,<br/>\nlistening,<br/>\noral world *and* people who are more immersed in the details of<br/>\nliteracy and<br/>\nnumeracy and the important thing is letting each child develop their own<br/>\ninterests, in their own time without pressure or undue influence to<br/>\neither<br/>\ndo things later or earlier.<br/>\n-=-<br/>\n<br/>\nNo one is recommending keeping kids from learning.&quot;<br/>\n<br/>\nNo, I understand that.  I think I feel a bit of pressure sometimes coming<br/>\nfrom fellow HEors (in the UK, not on this list) who follow Steiner methods<br/>\nbecause DD1 is very young to learn to read autonomously and, being parent<br/>\nwho is passionate about autonomy in childhood, often feel the need to<br/>\nimpress on these people that I didn&#39;t teach her to read and she wasn&#39;t<br/>\nhothoused - she just doesn&#39;t fit the Steiner ideal of children being<br/>\ncreative for the first 7 years of their lives - it&#39;s not who she is.<br/>\n<br/>\nClare</div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a child worries","postDate":"1219531660","msgId":37453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4cTQyYytzanBxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI3YWEyYWU4MDgwODIyMTczMHk0N2U2NjQ2YW1jMDE1MmU2ZGIwMDQzM2U0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":37447,"nextInTopic":37460,"prevInTime":37452,"nextInTime":37454,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"This past summer my son J  descided he should learn to read.  His brother is 5 and can read quite well cause he just can and I think that intimidated J a","messageBody":"<div id=\"ygrps-yiv-1574940629\">This past summer my son J  descided he should learn to read.  His <br/>\nbrother is 5 and can read quite well cause he just can and I think <br/>\nthat intimidated J a little bit.  After exploring the whole thing a <br/>\nlittle with him though I learned several things.. he wanted nothing to <br/>\ndo with &quot;baby books&quot;  or books written specifically for beginning <br/>\nreaders.  He wanted nothing to do with repetive practice like <br/>\nworksheets or 100 easy lessons or anything like that but I did go with <br/>\nhim to the store and we bought several books that he thought looked <br/>\ngood like Captain Underpants and some of other Dav Pilkey books and we <br/>\nread them together.  Mostly I read but sometimes he would want to read <br/>\na little.  Now we are back to my mostly reading but he feels better <br/>\nabout being on his way to learning to read.  I think he can see his <br/>\nown progress in that directions and so he feels better about it <br/>\nagain.  He has asked me before if he would learn more if he was in <br/>\nschool.  I think other kids say things like that because schooled kids <br/>\nare repeatedly told that in order to learn and not grow up to be a bum <br/>\nthey have to go to school.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When a child worries","postDate":"1219528264","msgId":37447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1MzA0MTNFLTg5N0ItNDlCRC1CNEYxLTFCNDQwQjlGNzJBN0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVQTENOQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVQTENOQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":37443,"nextInTopic":37453,"prevInTime":37446,"nextInTime":37448,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"-=-I think the main point is that the child learns when they want to, whether that s early or late.-=- A child can want to learn to read and not be","messageBody":"<div id=\"ygrps-yiv-308164001\">-=-I think the main point is that the child learns when they want to,  <br/>\nwhether that&#39;s early or late.-=-<br/>\n<br/>\nA child can want to learn to read and not be developmentally ready to  <br/>\ndo so.<br/>\nUnless a child is traumatized and afraid and ashamed, you&#39;ll know  <br/>\nwhen he can read because he&#39;ll be reading.<br/>\nBefore he&#39;s reading, there&#39;s not much you can do but keep reading to  <br/>\nhim, play games with sounds and words if he likes that, let him watch  <br/>\nmovies, go to plays, listen to music--keep his environment word- <br/>\nfilled, and the reading will come.<br/>\n<br/>\n-=-.  There is<br/>\nneed in society for people who are more immersed int he hearing,  <br/>\nlistening,<br/>\noral world *and* people who are more immersed in the details of  <br/>\nliteracy and<br/>\nnumeracy and the important thing is letting each child develop their own<br/>\ninterests, in their own time without pressure or undue influence to  <br/>\neither<br/>\ndo things later or earlier.<br/>\n-=-<br/>\n<br/>\nNo one is recommending keeping kids from learning.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":244242275,"authorName":"Joanna Wilkinson","from":"&quot;Joanna Wilkinson&quot; &lt;jbwilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a child worries","postDate":"1219513770","msgId":37443,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4cGlqYStrNDdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc4bm5kMyt1Z2NqQGVHcm91cHMuY29tPg=="},"prevInTopic":37437,"nextInTopic":37447,"prevInTime":37442,"nextInTime":37444,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"... I had the same experience.  I kept expecting my son Jack to hit a place in his reading and just take off.  It s been slow and steady all along.  He didn t","messageBody":"<div id=\"ygrps-yiv-317847287\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; It took &quot;longer&quot; than I expected. with my expecations based on my <br/>\n&gt; faulty thinking about reading. Each year, I&#39;d think, &quot;Ok. She can <br/>\n&gt; recognize these words. She&#39;ll be reading within a few months.&quot; Then a <br/>\n&gt; few months would go by and I&#39;d say, &quot;ok, so NOW she&#39;ll start <br/>\n&gt; reading.&quot; I thought that she&#39;d go from sight <br/>\n&gt; memorization right to reading chapter books and comprehending all of <br/>\n&gt; it <br/>\n&gt; on an equal level.  My school-influenced idea of reading and what was <br/>\n&gt; actually occuring were vastly different. It happened in stages, <br/>\n&gt; stages she was able to <br/>\n&gt; control and manage herself, in her own time and comfort level.<br/>\n&gt; <br/>\n&gt; Kara<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I had the same experience.  I kept expecting my son Jack to hit a place <br/>\nin his reading and just take off.  It&#39;s been slow and steady all <br/>\nalong.  He didn&#39;t have the slightest interest in reading at age 8.  He <br/>\nis now almost 12 and can mostly read.  It&#39;s still slow and he has <br/>\ntrouble with some words, but he can figure a lot out on his own now.  <br/>\nHe mostly reads for gaming.  My dd Jamie is 9 and reads almost as well <br/>\nas Jack.  But, she&#39;s played around with letters and spelling since she <br/>\nwas 4 or 5.  She started reading a Junie B. Jones chapter book by <br/>\nherself this summer and needs help with bigger words, but impressed me <br/>\nwith how much she can read.  She seems to be doing the &quot;take off&quot; thing.<br/>\nJack has an amazing memory and attention to detail.  We listen to books <br/>\non tape in the car a lot, and what he grasps and remembers really <br/>\nfacintates me.  I&#39;m not like him at all that way.  <br/>\n<br/>\nJoanna W.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When a child worries","postDate":"1219496619","msgId":37437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRGRTcyMjkwLTgxMTgtNEQ5MS1CODRBLUQ2RjM4OTRDMjExREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEU0MkFDRTk1LTc0Q0UtNEQ2OS1CRDRBLTI1ODdDMkM5MTk1NUBtYWMuY29tPg==","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVQTENOQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4gPEU0MkFDRTk1LTc0Q0UtNEQ2OS1CRDRBLTI1ODdDMkM5MTk1NUBtYWMuY29tPg=="},"prevInTopic":37432,"nextInTopic":37443,"prevInTime":37436,"nextInTime":37438,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"-=-I have to say I don t like the thought that children ... read-=- No one is recommending holding anyone back from learning to read. No one can make anyone","messageBody":"<div id=\"ygrps-yiv-926411815\">-=-I have to say I don&#39;t like the thought that children<br/>\n<blockquote><span title=\"ireply\">  &gt; who have a passion for books could be held back from learning to  <br/>\n </span></blockquote>read-=-<br/>\n<br/>\n<br/>\n<br/>\nNo one is recommending holding anyone back from learning to read.<br/>\n<br/>\nNo one can make anyone learn to read.  You can press them to  <br/>\nphonetically sound out each work, which can hamper fluent reading.   <br/>\nYou can try to teach them to learn to read before they&#39;re ready so  <br/>\nthat they hate words, books and you.<br/>\n<br/>\n<br/>\n<br/>\nYesterday Joyce Fetteroll and her daughter Kathryn and I went to the  <br/>\nUnser Racing Museum (not sure the exact name of it), a nice new  <br/>\nmuseum in Albuquerque.<br/>\n<br/>\nThere were two men there in their thirties, VERY interested in the  <br/>\nplace, knowledgeable, and sometimes one would read aloud to the other  <br/>\nfrom one of the display boards, enthusiastically but haltingly, very  <br/>\nphonetically until he would recognize the name of a race track or a  <br/>\nrace.   That&#39;s not the kind of reading Kathryn Fetteroll was doing.   <br/>\nShe could silently scan the words and take meaning.  She didn&#39;t need  <br/>\nto sound words out.<br/>\n<br/>\n<br/>\n<br/>\nI have no doubt that those nice men are halting readers because  <br/>\nschool told them very early on that they weren&#39;t reading, that they  <br/>\nweren&#39;t readers.  They believed that the school knew how to teach  <br/>\nreading, and they believed the school that they just were somehow not  <br/>\nbright enough to do it.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When a child worries","postDate":"1219477618","msgId":37429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0MkFDRTk1LTc0Q0UtNEQ2OS1CRDRBLTI1ODdDMkM5MTk1NUBtYWMuY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVQTENOQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVQTENOQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":37427,"nextInTopic":37432,"prevInTime":37428,"nextInTime":37430,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"... As opposed to having all those amazing stories read to them? Everyone ASSUMES that early readers are advantaged. There s no need to defend that. One of my","messageBody":"<div id=\"ygrps-yiv-97739116\">On Aug 22, 2008, at 11:00 PM, Clare Kirkpatrick wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have to say I don&#39;t like the thought that children<br/>\n&gt; who have a passion for books could be held back from learning to read<br/>\n&gt; because someone&#39;s read somewhere that later readers have this, that  <br/>\n&gt; or the<br/>\n&gt; other benefit.  Early readers have a lot of benefits too - like  <br/>\n&gt; being able<br/>\n&gt; to spend years and years reading amazing stories.<br/>\n<br/>\n </span></blockquote>As opposed to having all those amazing stories read to them?<br/>\n<br/>\nEveryone ASSUMES that early readers are advantaged. There&#39;s no need to  <br/>\ndefend that. One of my daughters read fluently at 3 years old and was  <br/>\nreading pretty much anything and everything by 5 years old. She was  <br/>\ntested by the school and maxed out their test at the 11th grade level.  <br/>\nNot a single person ever doubted that she was benefitting from all the  <br/>\nreading she did when she was still very young. And now she&#39;s a college  <br/>\nstudent and considering a major in either linguistics, comparative  <br/>\nliterature, or theater.<br/>\n<br/>\nBut, when kids read later, people assume they are missing out on  <br/>\nsomething. They don&#39;t consider that there are benefits to later  <br/>\nreading because kids who aren&#39;t reading aren&#39;t vegetating - they are  <br/>\nlearning.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"&quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt;","profile":"cloggsy_sk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] When a child worries","postDate":"1219471241","msgId":37427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLSUVQTENOQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","inReplyToHeader":"PDE4RTBBQ0NELTAzQkMtNEYzNy1BMTMyLTFBRjQ0NjYxM0I5RUBtYWMuY29tPg=="},"prevInTopic":37422,"nextInTopic":37429,"prevInTime":37426,"nextInTime":37428,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"I think the main point is that the child learns when they want to, whether that s early or late.  I have to say I don t like the thought that children who have","messageBody":"<div id=\"ygrps-yiv-1747420994\">I think the main point is that the child learns when they want to, whether<br/>\nthat&#39;s early or late.  I have to say I don&#39;t like the thought that children<br/>\nwho have a passion for books could be held back from learning to read<br/>\nbecause someone&#39;s read somewhere that later readers have this, that or the<br/>\nother benefit.  Early readers have a lot of benefits too - like being able<br/>\nto spend years and years reading amazing stories.  It&#39;s the pressure that&#39;s<br/>\nwrong, not the age IMO.  My oldest two are very, very different children.<br/>\nOne learnt her alphabet at 2.5y and is now a nearly fluent reader at 5 with<br/>\nno &#39;teaching&#39; or anything - just lots and lots of books being read to her,<br/>\nas requested, and the odd game on the computer etc. as requested.  My second<br/>\nonly knows the first letter of her name at age 3.5.  She loves books,<br/>\nthough, and always wants to be read to.  But she&#39;s far more &#39;creative&#39; (can<br/>\nnever remember which side of the brain it is!) than her older sister and<br/>\nwill spend literally hours on a painting or something similar.  There is<br/>\nneed in society for people who are more immersed int he hearing, listening,<br/>\noral world *and* people who are more immersed in the details of literacy and<br/>\nnumeracy and the important thing is letting each child develop their own<br/>\ninterests, in their own time without pressure or undue influence to either<br/>\ndo things later or earlier.<br/>\n<br/>\nClare<br/>\nx<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; One result of this is that even though my degrees are in literature<br/>\n &gt; and creative writing, I have really tried to give both my kids space<br/>\n &gt; to develop oral skills before they get swept up into print. I<br/>\n &gt; actually think it&#39;s more important to talk to children constantly and<br/>\n &gt; tell stories than to read to them! Reading, as far as I can tell,<br/>\n &gt; will take care of itself, since reading skills can be learned at any<br/>\n &gt; time with no loss of ability (as far as I know, a person who learns<br/>\n &gt; to read at 50 can read just as well as someone who learns to read at<br/>\n &gt; 5 - there are no benefits mentally speaking to learning to read<br/>\n &gt; sooner rather than later, no developmental &quot;window&quot; during which<br/>\n &gt; reading can more easily be learned).<br/>\n<br/>\n </span></blockquote>  I love the way you put it. This is<br/>\nwhy later reading is very very cool. Kids who read later (who aren&#39;t<br/>\nshamed and aren&#39;t feeling pressured TO read), are more immersed in a<br/>\nhearing, listening, oral world and it shows. The kids I know who read<br/>\nlater are amazingly good at grasping and remembering stuff they hear!<br/>\n<br/>\nOne kid I know, who began to read at 12 or 13 years old, took one of<br/>\nmy college econ classes at 17 years old. He sat in class, never took<br/>\nnotes, remembered EVERY single thing from my lectures and aced all the<br/>\ntests. Remarkable!<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":236161794,"authorName":"nymodels2@aol.com","from":"nymodels2@...","profile":"nymodels2inc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When a child worries","postDate":"1219467613","msgId":37432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQUQyRjQ0MzBCRDYwRC0xM0Q4LTMwMkZARldNLUQ0NC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLRUVQRkNOQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":37429,"nextInTopic":37437,"prevInTime":37431,"nextInTime":37433,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"have you read better late than early ???someone on line was discussing it ?***sim aria***?? ... From: Clare Kirkpatrick  ","messageBody":"<div id=\"ygrps-yiv-727518426\">have you read &quot;better late than early&quot; ???someone on line was discussing it ?***sim&#39;aria***?? <br/>\n<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: Clare Kirkpatrick &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:clare.kirkpatrick@...\">clare.kirkpatrick@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Fri, 22 Aug 2008 3:58 pm<br/>\nSubject: RE: [AlwaysLearning] When a child worries<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI&#39;m a bit confused...it sounds like your daughter wants to learn to read and<br/>\nI&#39;m wondering what&#39;s stopping her. What&#39;s stopping her doing a reading<br/>\nscheme or playing on a website like www.starfall.com ? It doesn&#39;t matter if<br/>\nit seems schooly if it&#39;s what she wants, does it? If she wants to learn to<br/>\nread, then she&#39;ll probably do it fairly quickly with the right support? Or<br/>\nhave I misunderstood your message?<br/>\n<br/>\nMy DD1 wanted to learn to read (she&#39;s 5 now) so we got her, with her help,<br/>\nearly reader books, which she ploughed through very quickly. She hated<br/>\nreading scheme books as they&#39;re so boring, but she loved the starfall<br/>\nwebsite, and also a UK website which you may be able to get access to from<br/>\nthe US - education city. She wasn&#39;t interested in phonics, but has learnt<br/>\nquickly and easily the &#39;whole words&#39; way. She had no confidence at first<br/>\n(we think she was comparing herself to us (her parents) only as she&#39;s the<br/>\noldest) so we decided together to do a reading age test as I knew she knew<br/>\nmore than she thought she did and she came out 2 years older than she<br/>\nactually is, which gave her the confidence to really go for it. I don&#39;t<br/>\nconsider this to be not unschooling because it was all on her terms - we<br/>\njust supported her and provided her with whatever she needed, sometimes<br/>\nsuggesting things she may not have been aware of, and sometimes getting her<br/>\nstuff she&#39;d seen that she asked for.<br/>\n<br/>\nBWs<br/>\n<br/>\nClare<br/>\nx<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>]On Behalf Of Cameron Parham<br/>\nSent: 22 August 2008 19:41<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: Re: [AlwaysLearning] When a child worries<br/>\n<br/>\nMy 11 yo dd sat beside me on her bed 2 nights ago and with tears in her eyes<br/>\nshared her fears about her reading progress.? She said that she knows I&#39;m<br/>\nnot worried.? She knows some kids don&#39;t read until later than age 11.??She<br/>\nremembers Kathleen Gherke saying that a child she knew read at age 14, but<br/>\nwith a wobbly voice says, &quot;what if I don&#39;t even learn then?&quot;? I just<br/>\nlistened to her, and stroked her hair.? Just as she was saying that she<br/>\nfeels &quot;Even Burke is better at it than me (he&#39;s 9), Burke came into her room<br/>\nand she wouldn&#39;t say more.? Can anyone comment on how to help her, to<br/>\nsupport her?? She is a smart and perceptive person and knows so much of why<br/>\nwe have chosen the unschooling?path, and she wants to continue with it.? But<br/>\nhow can I support and encourage her specifically about this?? Thanks so<br/>\nmuch.... Cameron???<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When a child worries","postDate":"1219457995","msgId":37422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1NzAxMTNDLTRCREYtNDdBNC1CNUYzLTRENjQ1NzExN0RBRUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE4RTBBQ0NELTAzQkMtNEYzNy1BMTMyLTFBRjQ0NjYxM0I5RUBtYWMuY29tPg==","referencesHeader":"PDI1Nzg2LjgzMDk2LnFtQHdlYjU5MjA4Lm1haWwucmUxLnlhaG9vLmNvbT4gPDE4RTBBQ0NELTAzQkMtNEYzNy1BMTMyLTFBRjQ0NjYxM0I5RUBtYWMuY29tPg=="},"prevInTopic":37421,"nextInTopic":37427,"prevInTime":37421,"nextInTime":37423,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"-=-The kids I know who read later are amazingly good at grasping and remembering stuff they hear!-=- Holly started reading with a large vocabulary, and she","messageBody":"<div id=\"ygrps-yiv-1150162624\">-=-The kids I know who read<br/>\nlater are amazingly good at grasping and remembering stuff they hear!-=-<br/>\n<br/>\n<br/>\n<br/>\nHolly started reading with a large vocabulary, and she knew what the  <br/>\nwords sounded like, so she didn&#39;t have many &quot;reader&#39;s pronunciation&quot;  <br/>\nproblems.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When a child worries","postDate":"1219457068","msgId":37421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwODIyMTkwNGkyNTI1YTQxMmo1ODM4OGI4YTQwY2EwMjQ5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDUyMzVCN0FBLUQ3NUYtNDUzOS1BNkFELTA0QzM2REZBMjlFNkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDI1Nzg2LjgzMDk2LnFtQHdlYjU5MjA4Lm1haWwucmUxLnlhaG9vLmNvbT4JIDw1MjM1QjdBQS1ENzVGLTQ1MzktQTZBRC0wNEMzNkRGQTI5RTZAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":37420,"nextInTopic":37422,"prevInTime":37420,"nextInTime":37422,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"Karl has been asking about reading.  And we looked at starfall for a while together.  He was happy to read through a bunch of it.  Some of the stories he","messageBody":"<div id=\"ygrps-yiv-451707668\">Karl has been asking about reading.  And we looked at starfall for a while<br/>\ntogether.  He was happy to read through a bunch of it.  Some of the stories<br/>\nhe liked.  I think what he got out of it is understanding that he really did<br/>\nknow a lot more than he thought he did.  Which I knew but he wanted to know.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 8/22/08, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   When Holly was that age she wanted me to help her, so I got a copy of<br/>\n&gt; some workbookish system called 100 Easy Lessons something or other.<br/>\n&gt; I bought one used. She felt better just owning it. I thought it was<br/>\n&gt; goofy, for having different colors of letters, and some system I<br/>\n&gt; didn&#39;t fell like learning. We went through some of the pages of<br/>\n&gt; three letter words, just reading down and finding some she knew, or<br/>\n&gt; me reading a few of them (not &quot;working&quot; and not whole pages, just<br/>\n&gt; kinda looking into the book).<br/>\n&gt;<br/>\n&gt; We didn&#39;t do much with it, but I think her seeing that it involved<br/>\n&gt; comparisons and repetition helped her somehow to understand it.<br/>\n&gt;<br/>\n&gt; What about a game where you label lots of things in the house with<br/>\n&gt; sticky notes or something? Just put up dozens to hundreds of words?<br/>\n&gt; (IF she&#39;s having fun, not if it bugs her.) And maybe (IF she thought<br/>\n&gt; it would be fun) you could put some in the wrong places and see if<br/>\n&gt; she could put them back (or just leave them in the wrong places--that<br/>\n&gt; wouldn&#39;t hurt her.)<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":63441890,"authorName":"kstjonn","from":"&quot;kstjonn&quot; &lt;kara@...&gt;","profile":"kstjonn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: When a child worries","postDate":"1219453155","msgId":37420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc4bm5kMyt1Z2NqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUyMzVCN0FBLUQ3NUYtNDUzOS1BNkFELTA0QzM2REZBMjlFNkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":37417,"nextInTopic":37421,"prevInTime":37419,"nextInTime":37421,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"... of ... other. ... was ... or ... This is one thing I did too when Sophia was asking about reading. The directions were something we ignored and she","messageBody":"<div id=\"ygrps-yiv-1266257842\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; When Holly was that age she wanted me to help her, so I got a copy <br/>\n </span></blockquote>of  <br/>\n<blockquote><span title=\"ireply\"> &gt; some workbookish system called 100 Easy Lessons something or <br/>\n </span></blockquote>other.   <br/>\n<blockquote><span title=\"ireply\"> &gt; I bought one used.  She felt better just owning it.  I thought it <br/>\n </span></blockquote>was  <br/>\n<blockquote><span title=\"ireply\"> &gt; goofy, for having different colors of letters, and some system I  <br/>\n&gt; didn&#39;t fell like learning.  We went through some of the pages of  <br/>\n&gt; three letter words, just reading down and finding some she knew, <br/>\n </span></blockquote>or  <br/>\n<blockquote><span title=\"ireply\"> &gt; me reading a few of them (not &quot;working&quot; and not whole pages, just  <br/>\n&gt; kinda looking into the book).<br/>\n&gt; <br/>\n&gt; We didn&#39;t do much with it, but I think her seeing that it involved  <br/>\n&gt; comparisons and repetition  helped her somehow to understand it.<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>This is one thing I did too when Sophia was asking about reading.  <br/>\nThe <br/>\ndirections were something we ignored and she basically just sat <br/>\nbeside <br/>\nme on the couch and read the bolded words over and over.  I made a <br/>\nlist <br/>\nof the words as she read them and printed it out. &quot;You know how to <br/>\nread <br/>\nthese words&quot; made her feel confident enough that we only got a third <br/>\nof <br/>\nthe way through the book.  She just seemed to need a boost.<br/>\n<br/>\nI also played word family games with her. I also made some word <br/>\nfamily <br/>\ncards where she could put consonants in front of &quot;at&quot; and &quot;in&quot; and <br/>\nsuch <br/>\nin order to make words. <br/>\n<br/>\nAt the same time as this was happening, she was reading words on Zoo <br/>\nTycoon and <br/>\nSpyro.  Then she started reading the subtitles on DVDs.  Then she <br/>\nwent <br/>\non to read chapter books. <br/>\n<br/>\nIt took &quot;longer&quot; than I expected. with my expecations based on my <br/>\nfaulty thinking about reading. Each year, I&#39;d think, &quot;Ok. She can <br/>\nrecognize these words. She&#39;ll be reading within a few months.&quot; Then a <br/>\nfew months would go by and I&#39;d say, &quot;ok, so NOW she&#39;ll start <br/>\nreading.&quot; I thought that she&#39;d go from sight <br/>\nmemorization right to reading chapter books and comprehending all of <br/>\nit <br/>\non an equal level.  My school-influenced idea of reading and what was <br/>\nactually occuring were vastly different. It happened in stages, <br/>\nstages she was able to <br/>\ncontrol and manage herself, in her own time and comfort level.<br/>\n<br/>\nKara</div>","specialLinks":[]},{"userId":214171486,"authorName":"Heather","from":"Heather &lt;swingdancechick@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When a child worries","postDate":"1219451442","msgId":37417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3YWEyYWU4MDgwODIyMTczMHk0N2U2NjQ2YW1jMDE1MmU2ZGIwMDQzM2U0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDUyMzVCN0FBLUQ3NUYtNDUzOS1BNkFELTA0QzM2REZBMjlFNkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDI1Nzg2LjgzMDk2LnFtQHdlYjU5MjA4Lm1haWwucmUxLnlhaG9vLmNvbT4JIDw1MjM1QjdBQS1ENzVGLTQ1MzktQTZBRC0wNEMzNkRGQTI5RTZAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":37416,"nextInTopic":37420,"prevInTime":37416,"nextInTime":37418,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"*When my daughter was about 8, she mentioned wanting to go to school a few times. After talking to her, I found out she thought she wouldn t learn to read ","messageBody":"<div id=\"ygrps-yiv-1367385403\">*When my daughter was about 8, she mentioned wanting to go to school a few<br/>\ntimes.<br/>\nAfter talking to her, I found out she thought she wouldn&#39;t learn to read<br/>\nunless she went to school.  I assured her that she could learn to read<br/>\nwithout school, that some of her schooled-friends didn&#39;t know how to read<br/>\nyet.<br/>\n<br/>\nShe decided she wanted reading &quot;lessons&quot;.  We played school sometimes.<br/>\nI also found the book &quot;Teach your child to read in 100 easy lessons&quot;<br/>\nfrom the library. I personally couldn&#39;t stand the book, so it didn&#39;t get<br/>\nused much.<br/>\n<br/>\nThen I found**  another book at the library...<br/>\n&quot;Reading reflex : the foolproof phono-graphix method for teaching your child<br/>\nto read&quot;<br/>\nIt was much easier for me to read & use. It has some &#39;learn-to-read&quot; type<br/>\ngames that my<br/>\ndaughter really enjoyed.  We just pulled it out when she requested it.<br/>\n**It ended up getting abandoned.<br/>\n<br/>\n**We also checked out a lot of the kits at the library with the book and<br/>\ncassette so<br/>\nshe could read  along in the car.<br/>\n<br/>\nheather<br/>\ntucson<br/>\n<br/>\n*On Fri, Aug 22, 2008 at 4:34 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   When Holly was that age she wanted me to help her, so I got a copy of<br/>\n&gt; some workbookish system called 100 Easy Lessons something or other.<br/>\n&gt; I bought one used. She felt better just owning it.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When a child worries","postDate":"1219449966","msgId":37416,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4RTBBQ0NELTAzQkMtNEYzNy1BMTMyLTFBRjQ0NjYxM0I5RUBtYWMuY29tPg==","inReplyToHeader":"PDI1Nzg2LjgzMDk2LnFtQHdlYjU5MjA4Lm1haWwucmUxLnlhaG9vLmNvbT4=","referencesHeader":"PDI1Nzg2LjgzMDk2LnFtQHdlYjU5MjA4Lm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":37415,"nextInTopic":37417,"prevInTime":37415,"nextInTime":37417,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"Here is something someone else wrote on another list and my response. I wrote something else about the benefits of later reading, but can t find it right now.","messageBody":"<div id=\"ygrps-yiv-258833205\">Here is something someone else wrote on another list and my response.  <br/>\nI wrote something else about the benefits of later reading, but can&#39;t  <br/>\nfind it right now. I&#39;ll keep looking.<br/>\n<br/>\n*****<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; One result of this is that even though my degrees are in literature<br/>\n &gt; and creative writing, I have really tried to give both my kids space<br/>\n &gt; to develop oral skills before they get swept up into print. I<br/>\n &gt; actually think it&#39;s more important to talk to children constantly and<br/>\n &gt; tell stories than to read to them! Reading, as far as I can tell,<br/>\n &gt; will take care of itself, since reading skills can be learned at any<br/>\n &gt; time with no loss of ability (as far as I know, a person who learns<br/>\n &gt; to read at 50 can read just as well as someone who learns to read at<br/>\n &gt; 5 - there are no benefits mentally speaking to learning to read<br/>\n &gt; sooner rather than later, no developmental &quot;window&quot; during which<br/>\n &gt; reading can more easily be learned).<br/>\n<br/>\n </span></blockquote>  I love the way you put it. This is<br/>\nwhy later reading is very very cool. Kids who read later (who aren&#39;t<br/>\nshamed and aren&#39;t feeling pressured TO read), are more immersed in a<br/>\nhearing, listening, oral world and it shows. The kids I know who read<br/>\nlater are amazingly good at grasping and remembering stuff they hear!<br/>\n<br/>\nOne kid I know, who began to read at 12 or 13 years old, took one of<br/>\nmy college econ classes at 17 years old. He sat in class, never took<br/>\nnotes, remembered EVERY single thing from my lectures and aced all the<br/>\ntests. Remarkable!<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Aug 22, 2008, at 11:40 AM, Cameron Parham wrote:<br/>\n<br/>\n&gt;  But how can I support and encourage her specifically about this?   <br/>\n&gt; Thanks so much.... Cameron<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When a child worries","postDate":"1219448090","msgId":37415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyMzVCN0FBLUQ3NUYtNDUzOS1BNkFELTA0QzM2REZBMjlFNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDI1Nzg2LjgzMDk2LnFtQHdlYjU5MjA4Lm1haWwucmUxLnlhaG9vLmNvbT4=","referencesHeader":"PDI1Nzg2LjgzMDk2LnFtQHdlYjU5MjA4Lm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":37404,"nextInTopic":37416,"prevInTime":37414,"nextInTime":37416,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"When Holly was that age she wanted me to help her, so I got a copy of some workbookish system called 100 Easy Lessons something or other. I bought one used.","messageBody":"<div id=\"ygrps-yiv-570298892\">When Holly was that age she wanted me to help her, so I got a copy of  <br/>\nsome workbookish system called 100 Easy Lessons something or other.   <br/>\nI bought one used.  She felt better just owning it.  I thought it was  <br/>\ngoofy, for having different colors of letters, and some system I  <br/>\ndidn&#39;t fell like learning.  We went through some of the pages of  <br/>\nthree letter words, just reading down and finding some she knew, or  <br/>\nme reading a few of them (not &quot;working&quot; and not whole pages, just  <br/>\nkinda looking into the book).<br/>\n<br/>\nWe didn&#39;t do much with it, but I think her seeing that it involved  <br/>\ncomparisons and repetition  helped her somehow to understand it.<br/>\n<br/>\nWhat about a game where you label lots of things in the house with  <br/>\nsticky notes or something?  Just put up dozens to hundreds of words?   <br/>\n(IF she&#39;s having fun, not if it bugs her.)  And maybe (IF she thought  <br/>\nit would be fun) you could put some in the wrong places and see if  <br/>\nshe could put them back (or just leave them in the wrong places--that  <br/>\nwouldn&#39;t hurt her.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"&quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt;","profile":"cloggsy_sk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] When a child worries","postDate":"1219435117","msgId":37404,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLRUVQRkNOQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","inReplyToHeader":"PDI1Nzg2LjgzMDk2LnFtQHdlYjU5MjA4Lm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":37401,"nextInTopic":37415,"prevInTime":37403,"nextInTime":37405,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"I m a bit confused...it sounds like your daughter wants to learn to read and I m wondering what s stopping her.  What s stopping her doing a reading scheme or","messageBody":"<div id=\"ygrps-yiv-156517237\">I&#39;m a bit confused...it sounds like your daughter wants to learn to read and<br/>\nI&#39;m wondering what&#39;s stopping her.  What&#39;s stopping her doing a reading<br/>\nscheme or playing on a website like www.starfall.com ?  It doesn&#39;t matter if<br/>\nit seems schooly if it&#39;s what she wants, does it?  If she wants to learn to<br/>\nread, then she&#39;ll probably do it fairly quickly with the right support?  Or<br/>\nhave I misunderstood your message?<br/>\n<br/>\nMy DD1 wanted to learn to read (she&#39;s 5 now) so we got her, with her help,<br/>\nearly reader books, which she ploughed through very quickly.  She hated<br/>\nreading scheme books as they&#39;re so boring, but she loved the starfall<br/>\nwebsite, and also a UK website which you may be able to get access to from<br/>\nthe US - education city.  She wasn&#39;t interested in phonics, but has learnt<br/>\nquickly and easily the &#39;whole words&#39; way.  She had no confidence at first<br/>\n(we think she was comparing herself to us (her parents) only as she&#39;s the<br/>\noldest) so we decided together to do a reading age test as I knew she knew<br/>\nmore than she thought she did and she came out 2 years older than she<br/>\nactually is, which gave her the confidence to really go for it.  I don&#39;t<br/>\nconsider this to be not unschooling because it was all on her terms - we<br/>\njust supported her and provided her with whatever she needed, sometimes<br/>\nsuggesting things she may not have been aware of, and sometimes getting her<br/>\nstuff she&#39;d seen that she asked for.<br/>\n<br/>\nBWs<br/>\n<br/>\nClare<br/>\nx<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>]On Behalf Of Cameron Parham<br/>\nSent: 22 August 2008 19:41<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: Re: [AlwaysLearning] When a child worries<br/>\n<br/>\n<br/>\nMy 11 yo dd sat beside me on her bed 2 nights ago and with tears in her eyes<br/>\nshared her fears about her reading progress. She said that she knows I&#39;m<br/>\nnot worried. She knows some kids don&#39;t read until later than age 11.She<br/>\nremembers Kathleen Gherke saying that a child she knew read at age 14, but<br/>\nwith a wobbly voice says, &quot;what if I don&#39;t even learn then?&quot; I just<br/>\nlistened to her, and stroked her hair. Just as she was saying that she<br/>\nfeels &quot;Even Burke is better at it than me (he&#39;s 9), Burke came into her room<br/>\nand she wouldn&#39;t say more. Can anyone comment on how to help her, to<br/>\nsupport her? She is a smart and perceptive person and knows so much of why<br/>\nwe have chosen the unschoolingpath, and she wants to continue with it. But<br/>\nhow can I support and encourage her specifically about this? Thanks so<br/>\nmuch.... Cameron<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":299286442,"authorName":"Cameron Parham","from":"Cameron Parham &lt;acsp2205@...&gt;","profile":"acsp2205","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] When a child worries","postDate":"1219430455","msgId":37401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1Nzg2LjgzMDk2LnFtQHdlYjU5MjA4Lm1haWwucmUxLnlhaG9vLmNvbT4="},"prevInTopic":0,"nextInTopic":37404,"prevInTime":37400,"nextInTime":37402,"topicId":37401,"numMessagesInTopic":0,"msgSnippet":"My 11 yo dd sat beside me on her bed 2 nights ago and with tears in her eyes shared her fears about her reading progress. She said that she knows I m not","messageBody":"<div id=\"ygrps-yiv-1549779998\">My 11 yo dd sat beside me on her bed 2 nights ago and with tears in her eyes shared her fears about her reading progress. She said that she knows I&#39;m not worried. She knows some kids don&#39;t read until later than age 11.She remembers Kathleen Gherke saying that a child she knew read at age 14, but with a wobbly voice says, &quot;what if I don&#39;t even learn then?&quot; I just listened to her, and stroked her hair. Just as she was saying that she feels &quot;Even Burke is better at it than me (he&#39;s 9), Burke came into her room and she wouldn&#39;t say more. Can anyone comment on how to help her, to support her? She is a smart and perceptive person and knows so much of why we have chosen the unschoolingpath, and she wants to continue with it. But how can I support and encourage her specifically about this? Thanks so much.... Cameron<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":37888,"nextTopicId":37568}}