{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":129546763,"authorName":"reneejordan2003","from":"&quot;reneejordan2003&quot; &lt;reneejordan2003@...&gt;","profile":"reneejordan2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: was young earth vs. olds earth, now fundy christian","postDate":"1036830138","msgId":49576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFxaWdqcSs5YmVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTYwMWMyODc3MiQ3Mzc3MTI0MCQxOWYyMGJkMEBiYjN0aDAxPg=="},"prevInTopic":49552,"nextInTopic":0,"prevInTime":49575,"nextInTime":49577,"topicId":49549,"numMessagesInTopic":0,"msgSnippet":"Cindy, Try out the new Jonah movie from the Veggie tales people. Jonah totally agreed with you. Thought the ninevites shouldn t get to repent. Check it out if","messageBody":"<div id=\"ygrps-yiv-1299179116\">Cindy, Try out the new Jonah movie from the Veggie tales people. <br/>\nJonah totally agreed with you. Thought the ninevites shouldn&#39;t get to <br/>\nrepent. Check it out if you can.<br/>\n<br/>\nRenee<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In Unschooling-dotcom@y..., &quot;The White&#39;s&quot; &lt;jwwjr@s...&gt; wrote:<br/>\n&gt; On Thu, 7 Nov 2002 21:36:22 &quot;Stephanie Elms&quot; &lt;stephanie.elms@d...&gt; <br/>\nwrote:<br/>\n&gt; <br/>\n&gt; &lt;&lt;And hell is not about being evil...the sole requirement for <br/>\ngetting into heaven is accepting Jesus as the savior. It is not about <br/>\nwhether you are a good or bad person.&gt;&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; This is ONE of many problems I had growing up in a Baptist church.  <br/>\nNo matter how bad a person you are, if you believe there really was a <br/>\nJesus who died for your sins, then you&#39;ll get into heaven.  You can <br/>\nbe someone who never helps out a neighbor, rather ridicules him.  You <br/>\ncan be someone who locks their kids in a closet and demand that he <br/>\npray (yeah, I just watched Carrie again BWG) but never show your kids <br/>\nlove.  You can be someone who hates people who are not like you, who <br/>\nfeel material things are the only sign of success,  but never do <br/>\nanything to help folks down on their luck.  Your idea of helping is <br/>\nsending money to the Lottie Moon fund to pay for missionaries who, in <br/>\nexchange for providing food, schooling and medicine, tell you why <br/>\nyour ancient beliefs are wrong and that you will burn in a place <br/>\ncalled hell if you don&#39;t &quot;accept&quot; Jesus. You might be someone who <br/>\nthinks if someone can say &quot;can you spare some change&quot; then he can <br/>\nalso say &quot;I&#39;d like to apply for a job&quot; without knowing more about <br/>\nhomelessness.  You can be an ax murderer or an active member of KKK, <br/>\nbut as long as you ask forgiveness and believe, you will get to <br/>\nheaven.<br/>\n&gt; <br/>\n&gt; What about those people who ask for forgiveness and really believe <br/>\nyet don&#39;t see their own sins?  Do you ask forgiveness as a blanket <br/>\nstatement, or do you have to be specific?  I&#39;m sure that Jim Jones <br/>\nboth believed and asked for forgiveness, but not for what he caused <br/>\nbecause he was doing that for God.   How does that work?  What if you <br/>\ntruly believe you are living a Godly life,  but are not?<br/>\n&gt; <br/>\n&gt; I think that religion was created as a means to not only control <br/>\nthe masses, but to enrich the leaders.  I see that it was also a way <br/>\nto teach people how to live, i.e. don&#39;t steal, kill, sleep with <br/>\nsomeone&#39;s wife, etc.  Yet if it does not matter how you live your <br/>\nlife as long as you believe Jesus died for your sins.  As long as <br/>\nyou &quot;accept&quot; Jesus as your savior you can live an evil life.  This <br/>\ndon&#39;t wash with me.  <br/>\n&gt; <br/>\n&gt; I&#39;d rather help out my neighbor and strangers.  I&#39;d rather live a <br/>\nlife that is giving and loving, kind and helpful, tolerant and open-<br/>\nminded, rather than worrying about eternity.  I&#39;d rather my eulogy be <br/>\nabout how kind and helpful I was, how much I tried to give to others <br/>\nof my time, how I did all I could to take care of people who can no <br/>\nlonger take care of themselves, how I have made true friends with a <br/>\ntrue heart, than to be eulogized as someone who gave lots of money to <br/>\nhelp build a new church.<br/>\n&gt; <br/>\n&gt; Cindy  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] was young earth vs. olds earth, now fundy christian","postDate":"1036793383","msgId":49552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NS4xMTcyOTI2MC4yYWZkOTAyN0Bhb2wuY29tPg=="},"prevInTopic":49549,"nextInTopic":49576,"prevInTime":49551,"nextInTime":49553,"topicId":49549,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/8/02 2:55:53 PM, jwwjr@sitestar.net writes: ","messageBody":"<div id=\"ygrps-yiv-48132679\">In a message dated 11/8/02 2:55:53 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jwwjr@...\">jwwjr@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Your idea of helping is sending money to the Lottie Moon fund to pay for <br/>\nmissionaries who, in exchange for providing food, schooling and medicine, <br/>\ntell you why your ancient beliefs are wrong and that you will burn in a place <br/>\ncalled hell if you don&#39;t &quot;accept&quot; Jesus.  &gt;&gt;<br/>\n<br/>\nI used to save my allowance for the Lottie Moon Missionary Fund!<br/>\nHaving just read Seven Years in Tibet (well, I have a bit to go, but I&#39;m <br/>\navoiding it, because until I read it the Chinese haven&#39;t run them out yet...) <br/>\nI&#39;m seven times as ashamed.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":65172662,"authorName":"The White&#39;s","from":"&quot;The White&#39;s&quot; &lt;jwwjr@...&gt;","profile":"whitehouseacademy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"was young earth vs. olds earth, now fundy christian","postDate":"1036792914","msgId":49549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTYwMWMyODc3MiQ3Mzc3MTI0MCQxOWYyMGJkMEBiYjN0aDAxPg=="},"prevInTopic":0,"nextInTopic":49552,"prevInTime":49548,"nextInTime":49550,"topicId":49549,"numMessagesInTopic":0,"msgSnippet":"On Thu, 7 Nov 2002 21:36:22 Stephanie Elms  wrote: ","messageBody":"<div id=\"ygrps-yiv-1013904412\"><blockquote><span title=\"qreply\">On Thu, 7 Nov 2002 21:36:22 &quot;Stephanie Elms&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:stephanie.elms@...\">stephanie.elms@...</a>&gt; wrote:<br/>\n<br/>\n&lt;&lt;And hell is not about being evil...the sole requirement for getting into heaven is accepting Jesus as the savior. It is not about whether you are a good or bad person.&gt;&gt;<br/>\n<br/>\n<br/>\nThis is ONE of many problems I had growing up in a Baptist church.  No matter how bad a person you are, if you believe there really was a Jesus who died for your sins, then you&#39;ll get into heaven.  You can be someone who never helps out a neighbor, rather ridicules him.  You can be someone who locks their kids in a closet and demand that he pray (yeah, I just watched Carrie again BWG) but never show your kids love.  You can be someone who hates people who are not like you, who feel material things are the only sign of success,  but never do anything to help folks down on their luck.  Your idea of helping is sending money to the Lottie Moon fund to pay for missionaries who, in exchange for providing food, schooling and medicine, tell you why your ancient beliefs are wrong and that you will burn in a place called hell if you don&#39;t &quot;accept&quot; Jesus. You might be someone who thinks if someone can say &quot;can you spare some change&quot; then he can also say &quot;I&#39;d like to apply for a job&quot; without knowing more about homelessness.  You can be an ax murderer or an active member of KKK, but as long as you ask forgiveness and believe, you will get to heaven.<br/>\n<br/>\nWhat about those people who ask for forgiveness and really believe yet don&#39;t see their own sins?  Do you ask forgiveness as a blanket statement, or do you have to be specific?  I&#39;m sure that Jim Jones both believed and asked for forgiveness, but not for what he caused because he was doing that for God.   How does that work?  What if you truly believe you are living a Godly life,  but are not?<br/>\n<br/>\nI think that religion was created as a means to not only control the masses, but to enrich the leaders.  I see that it was also a way to teach people how to live, i.e. don&#39;t steal, kill, sleep with someone&#39;s wife, etc.  Yet if it does not matter how you live your life as long as you believe Jesus died for your sins.  As long as you &quot;accept&quot; Jesus as your savior you can live an evil life.  This don&#39;t wash with me.  <br/>\n<br/>\nI&#39;d rather help out my neighbor and strangers.  I&#39;d rather live a life that is giving and loving, kind and helpful, tolerant and open-minded, rather than worrying about eternity.  I&#39;d rather my eulogy be about how kind and helpful I was, how much I tried to give to others of my time, how I did all I could to take care of people who can no longer take care of themselves, how I have made true friends with a true heart, than to be eulogized as someone who gave lots of money to help build a new church.<br/>\n<br/>\nCindy  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":49573,"nextTopicId":49518}}