{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Digest Number 163","postDate":"1012277387","msgId":3313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2ZC43ZTMxMTA1LjI5ODc3YThiQGFvbC5jb20+"},"prevInTopic":3309,"nextInTopic":0,"prevInTime":3312,"nextInTime":3314,"topicId":3309,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/28/2002 6:23:01 PM Pacific Standard Time, ... This is the crux of the frustration, to me, of all of these kinds of discussions. They so","messageBody":"<div id=\"ygrps-yiv-1930491630\">In a message dated 1/28/2002 6:23:01 PM Pacific Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There are lots of professional educators we could quote here to refute what <br/>\n&gt; we know from experience works, as unschoolers.  If someone comes here and <br/>\n&gt; quotes some professional educator&#39;s opinion of unschooling, nobody here <br/>\n&gt; bursts into tears and puts a kid in school.  And those who have let loose <br/>\n&gt; the <br/>\n&gt; TV reins will not be swayed by one doctor citing some study that says <br/>\n&gt; someth<br/>\n&gt; ing we see NOT to be true in ourselves and our chilren.<br/>\n<br/>\n </span></blockquote>This is the crux of the frustration, to me, of all of these kinds of <br/>\ndiscussions. They so often boil down to some people deciding to believe some <br/>\n&quot;experts&quot; because, imo, they&#39;re afraid the experts just might be right and <br/>\nthey&#39;re afraid of ruining their kids and that it&#39;ll be all their fault <br/>\nbecause they didn&#39;t listen to the experts. But here we are on an unschooling <br/>\nlist where we&#39;ve not only rejected the traditional educational experts, we&#39;ve <br/>\nrejected most of the homeschooling experts, too. Guess we&#39;re just an arrogant <br/>\nbunch.<br/>\n<br/>\nI also so often get the feeling that there is a certain amount of magical <br/>\nwishful thinking in totally banning tv from kids. It sometimes sounds like a <br/>\nsacrifice parents make that they hope will be rewarded with protection of <br/>\ntheir kids from some sort of danger.<br/>\n<br/>\nAs a mom, I understand the urge to protect our kids, of course. And I <br/>\ncertainly wish there was something magic that I could do to protect them - <br/>\nsomething I could sacrifice that would make them safer in this world. <br/>\n<br/>\nBut the arguments against tv don&#39;t ring true to me - based on my own <br/>\nexperience. (1)The argument that there is nothing good on tv - nothing of <br/>\nvalue, for example. That is so obviously not true - we&#39;ve listed many things <br/>\nof value and that&#39;s just a small sampling of the great stuff on tv. (2)The <br/>\nargument that the commercials are bad for kids is often made - but there is a <br/>\nLOT of noncommercial tv and we usually tape anything on commercial tv and zap <br/>\nthrough the commercials anyway. (3)The argument that tv-watching is sedentary <br/>\nand bad for the kids health is made. But I&#39;ve heard person after person point <br/>\nout that the kids will NOT just sit and watch tv all day every day for years. <br/>\n They&#39;ll go out and play and be active, tv-watching is just a small part of <br/>\ntheir lives. It isn&#39;t logical to argue that tv watching is too sedentary <br/>\nunless you don&#39;t let them sit and read, either. (4)People have argued that it <br/>\nis a passive activity - my first reaction is, so what? It is okay to be <br/>\npassive sometimes. Second, it isn&#39;t all that passive for most of our <br/>\nchildren. We&#39;ve talked about how they interact and dance and sing and most of <br/>\nall they THINK while watching tv. <br/>\n<br/>\nSo - there ya go -- like many people here, I reject the experts who say <br/>\nthings like a kid watching tv is in an almost coma-like state because I&#39;ve <br/>\nseen my kids and other kids and it just is so obviously not true. I reject <br/>\nthe experts who say kids won&#39;t read because I&#39;ve seen my kids and it isn&#39;t <br/>\ntrue. I reject those experts the same way I reject those experts who say kids <br/>\nhave to be taught in a systematic programmed way or they won&#39;t learn. Again, <br/>\nI just look at my kids and it is so obviously untrue that it even  gives me <br/>\nthe confidence to doubt the experts in other areas. Our kids aren&#39;t just <br/>\n&quot;average kids.&quot; Our kids aren&#39;t being &quot;schooled&quot; (at home or in a classroom) <br/>\nand everything is different because of that. We ought to always question <br/>\nwhether any expert&#39;s advice applies to our kids.<br/>\n<br/>\n--pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Digest Number 163","postDate":"1012275920","msgId":3309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1LjFkMWJlMzJjLjI5ODc3NGQwQGNzLmNvbT4="},"prevInTopic":0,"nextInTopic":3313,"prevInTime":3308,"nextInTime":3310,"topicId":3309,"numMessagesInTopic":0,"msgSnippet":"WOW! I m gone for 1/2 the day and come home to a storm of activity here. Those that are newer to unschooling, or have younger children... Can t you see that","messageBody":"<div id=\"ygrps-yiv-344626042\">WOW! I&#39;m gone for 1/2 the day and come home to a storm of activity here.<br/>\n<br/>\nThose that are newer to unschooling, or have younger children...<br/>\nCan&#39;t you see that some people are just standing on the other side right now, <br/>\nand offering the wisdom of years and experience on this? Not to put anyone <br/>\ndown, but if you&#39;re new to Unschooling and/or have very young children then <br/>\nmany of us have stood where you are...you have not stood where we are today.<br/>\nThat&#39;s not a bad thing or a put down. It&#39;s just true. And when someone is <br/>\nstanding on the other side of something, and I trust the person and their <br/>\nadvice, then I try to assimilate what they are telling me and not take <br/>\noffense.<br/>\nSandra and Pam (and others) have been successfully UNSCHOOLING for a long <br/>\ntime, they can offer ways of applying this philosophy to other areas of life <br/>\noutside of the &quot;educational&quot; realm.<br/>\nIt pays to at least think it through and not shun their words of wisdom.<br/>\n<br/>\nSomeone wondered if the tv users could live without one, or if their children <br/>\nwould choose not to have one.<br/>\nWhen there is a tv in your home, the children have total choice at any time <br/>\nto be non tv viewers or tv viewers.<br/>\nWhen there is not a tv in your home the children&#39;s choices have been limited <br/>\nby YOU. And only you. Would you be comfortable letting them choose? If not, <br/>\nwhy?<br/>\nI have lived without one, my children prefer having one. <br/>\n<br/>\nI had a similar experience to Pam (I think it was you Pam??)<br/>\nabout a child that seemed to have a bad reaction to extended tv viewing.<br/>\nAfter a heated debate like this (actually a series of them) I let go of my <br/>\ncontrol.<br/>\nI talked with my son about the times he got aggressive after viewing and we <br/>\nworked on ways of helping him be aware of it.<br/>\nTurns out, any extended period of inactivity brings out the aggressive type <br/>\nbehavior, not just the tv, which I blamed solely for the problem!!<br/>\nIf he&#39;s cooped up in the house too long and can&#39;t get very physical, he gets <br/>\ngrumpy.<br/>\nHe NEEDS physical activity. But he&#39;s learned to recognize his own needs and <br/>\nhe knows how to deal with it with very little verbal prompting to remind him.<br/>\nTaking away the tv would have not taught him any self control.<br/>\n<br/>\nThe mom that is not allowing ANY tv at the expense of others,<br/>\nthe backlash WILL come, believe me.<br/>\nYour child can not be hidden from real life forever.<br/>\nYou are not doing them any service by sheltering your ds from even knowing <br/>\nwhat a tv is. I think the time with Grandma was more important than any <br/>\n&quot;protection&quot; you offered him by hiding in the bedroom while renting a house <br/>\nwith her.<br/>\nYou are hurting his relationship with someone important in his life. THAT is <br/>\nmore damaging than anything he could see on tv. You are sending a huge <br/>\nmessage that Grandma is WRONG and you are right.<br/>\nGreat if you want a self righteous child. And one that is confused about his <br/>\nrelationship and what&#39;s really important in life.<br/>\nI can&#39;t imagine taking control to that extent that you would hide him in the <br/>\nbedroom during a family get together at the expense of his time with her.<br/>\nThat is in direct conflict to Unschooling ideas.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":3308,"nextTopicId":3314}}