{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":49,"messages":[{"userId":321996436,"authorName":"Alex","from":"&quot;Alex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338083398","msgId":67345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwczE4NithazdsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzgwNzE3MjguMjQzMDIuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":67344,"nextInTopic":67347,"prevInTime":67344,"nextInTime":67346,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"  ... Why does it have to be a choice between one and the other? I love the 5 love languages. It was a great thing to talk about, during the time that we","messageBody":"<div id=\"ygrps-yiv-462757046\">  <br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&quot;I really recommend The Seven Principles For Making Marriage Work by John Gottman.&gt; <br/>\n&gt; So this is a formula that this person created.<br/>\n&gt; Maybe it will help some.<br/>\n&gt; <br/>\n&gt; But why not just be nicer, sweeter, find out what language of love your partner responds to. <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.5lovelanguages.com/%c2%a0\">http://www.5lovelanguages.com/%c2%a0</a><br/>\n<br/>\n </span></blockquote>Why does it have to be a choice between one and the other? <br/>\n<br/>\nI love the 5 love languages. It was a great thing to talk about, during the time that we learned we needed to set aside to just talk to each other alone as a couple, every day and every week. <br/>\n<br/>\nNobody&#39;s saying that any couple who does not spend 2 hours alone on a date every week has a marriage that is bound to fail. <br/>\n<br/>\nHowever, someone who has spent a lifetime studying why marriages fail, has identified that as one of the key, concrete steps that you can take to repair a relationship in crisis.<br/>\n<br/>\nYes, love each other, and work on getting better at it, of course. <br/>\n<br/>\nBut you don&#39;t want to drive yourself crazy never knowing if you&#39;re doing enough. It&#39;s nice to have a framework that&#39;s very concrete and proven to work, so you can feel secure that you&#39;re doing a reasonable amount to save your relationship, and have some energy left for your kid. Someone who feels a little trapped doesn&#39;t necessarily want loving attention 24/7. Time is my love language, and I still don&#39;t want my husband up in my business all the time. Knowing how much has, in a huge number of marriages, been clinically shown to be enough time to save a marriage can help someone repair a relationship with someone who has as one of his needs more space. Desperate &quot;Am I doing enough?&quot; energy is not very attractive.<br/>\n<br/>\nAlex<br/>\n(Katya&#39;s mom)</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Raging child was Almost-4-year-old hits,bites parents","postDate":"1338082433","msgId":67342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwczBhMSthbXI3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM0NDg0OTQ0NDc5NTRBQkU4RTIzNTA3RTk5MzQyNTM4QERlYm9yYWhQQz4="},"prevInTopic":67338,"nextInTopic":67343,"prevInTime":67341,"nextInTime":67343,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"=== You want him to stop.  You *need* to be a stable, reliable, peaceful, happy center of his universe. Happy, secure children don t find many reasons to hit.","messageBody":"<div id=\"ygrps-yiv-365904996\">=== You want him to stop.  You *need* to be a stable, reliable, peaceful, happy center of his universe. Happy, secure children don&#39;t find many reasons to hit. ===<br/>\n<br/>\nJayn used to hit me. She would become so filled up with various stresses of just ordinary living, in the absence of the type of upheaval that this other family is experiencing, that she would need to lash out somehow. I would certainly have described her as happy most of the time. I would have described her life as secure, and predictable. She doesn&#39;t like change - even things like moving the sofa used to mean a period of adjustment. (Yet she really enjoys travel and staying at hotels! Go figure.) <br/>\n<br/>\nIf Jayn got hungry suddenly, she would get very cranky and unpleasant until she had food. She would eat, and it would be like a miracle how quickly she became calm and sweet. Always have food right there for your little guy! That was one big part of the answer. Even if you are about to go out for food shortly - don&#39;t make him wait for a snack.<br/>\n<br/>\nJayn almost never hit other people, including when she was visiting friends&#39; homes without me. I can remember the last time she hit a friend in frustration. It was at the park, gosh, 5 years ago. I noticed the changing body language in the two kids playing over there, and started to speak, but both I and the other Mom were too far away to get there in time, darn it. It was talked over and sorted out at the time. <br/>\n<br/>\nEvidently Jayn would save up her frustrations until she was safe at home with me, then have a reaction. We learned not to schedule outings or play dates two days in a row. We learned very early to allow extra time for transitions. We learned to expect outbursts before sleep, if it had been a really big day.  <br/>\n<br/>\nI did not like being hit, and of course, I did let her know that. We always talked things over afterwards. The best talks were when we were both doing something physical aside from the talk, or hugging/snuggling in bed later. We saved talking face to face across the table for other kinds of conversations - her seeking information conversations.<br/>\n<br/>\nHowever talking about anger and violence *in the moment* was futile. Jayn already knew intellectually that lashing out was wrong, unproductive, and ineffective behavior, by which I mean failed to gain her anything positive. But in the grip of her emotions, that knowledge was not accessible to her little child consciousness.<br/>\n<br/>\nAlso unhelpful when Jayn was in the grip of her brief fury, were firmly saying &quot;Stop&quot; or &quot;Don&#39;t hit&quot;, suggesting hitting a pillow instead, or suggesting to Jayn that she and I breath together (although I find deep breaths very helpful for me at any stressful time) - good suggestions that have worked for others here so well. These actions on my part only added to Jayn&#39;s fire. Sometimes I did walk away &quot;for my own protection&quot;. But it was never as helpful to her as when I stayed and worked with her. <br/>\n<br/>\nWhat helped her then, when she was five, six, seven, eight and nine, (when this began noticeably to recede), was to help her express this  emotional overload physically.<br/>\n<br/>\nInstead of letting her hit me wildly, I would hold up my hands in front of me and say &quot;hit here&quot;. That was it. That was the magic thing for Jayn.<br/>\n<br/>\nThis would become pushing against me. Or sometimes I would hold her arms to her body, not so that she couldn&#39;t go away if she wanted, but enough so that she could push and lean.  Then she might say, &quot;Now push on my feet&quot;. And it would become a kind of exercise or wrestle, and become hugging. <br/>\n<br/>\nIf Jayn started snapping, teetering on the edge of an explosion, and assuming she had recently eaten or I&#39;d just get her food ASAP, taking her on to my lap often headed it off. Being held helped her be patient. Not every child wants to be held when they are upset. Jayn did, and still does. She would tell me that she wanted me to hug her when she was hitting. It was hard to remember to hug her sometimes when she was so unpleasant. <br/>\n<br/>\nJayn is perhaps unusual. Every now and then I converse with rare other moms whose kids seem to be angry in spite of stable, happy, centered and secure lives in every other way, for whom the suggestions don&#39;t help like we&#39;d hope. I notice that these kids improve with maturity too, and that these behaviors do seem largely limited to at home - perhaps where the kids do feel safe and secure enough to melt down or explode. <br/>\n<br/>\nSometimes it can seem like unschooling has let you down. I&#39;ve felt that, but then I think about the alternative. In my case at least, I&#39;m convinced that in the absence of unschooling, even in the absence of the suggestions that proved not right *for us*, our situation would have been so much worse. <br/>\n<br/>\nI shudder to think how our life would have been if I had been following traditional/conventional parenting practices, even mere time-outs, with Jayn when she was raging or frustrated. I can&#39;t imagine how our life would have been if she had been at school all this time either. Maybe she would have learnt &quot;self-control&quot;. Maybe she would have turned it all inward, as some kids seem to do. <br/>\n<br/>\nThe principles of observing our own child closely, stopping and thinking about her needs, rethinking the knee jerk reaction, putting the relationship first - these led me to finding a strategy that helped her in the moment, and ultimately allowed Jayn and I to come through a time of &quot;turmoil from immaturity&quot; with our relationship intact. I&#39;ve said before, the solution to Jayn&#39;s problems are always found in a box marked &quot;More focused attention from Mom and Dad&quot; - even more than you think you are giving.<br/>\n<br/>\nThese days, Jayn now 12, it feels like she has returned to being flexible, gentle and patient, even though she has a lot more to frustrate her now that we have made changes in our lifestyle around financial issues. But even when she gets frustrated, a big shouting reaction of any kind is rare.<br/>\n<br/>\nI know a mom whose husband cheated quite seriously in that he wanted to leave her for the other woman. So they separated for a while and he moved out. But she just waited. She apparently did and said nothing permanent. She waited. She watched. She stayed emotionally available to her husband.  They would go on group outings every now and then, like an odd extended family. Sometimes she cried to herself. Eventually it seems the other woman started making the same kinds of emotional demands as a wife might. The husband started to return to his wife. He would talk over his relationship problems with her. (I am in awe of her patience and forbearance actually.) They got back together and he moved back in to the house. They apparently recommitted to each other. There must have been forgiveness. They are still together. They are still home schooling.<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com<br/>\nwww.robyncoburn.blogspot.com</div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338080602","msgId":67344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcnVncStzN2I5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwcjI1cCtoZThsQGVHcm91cHMuY29tPg=="},"prevInTopic":67343,"nextInTopic":67345,"prevInTime":67343,"nextInTime":67345,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"***I ve had friends accuse me of being a doormat because I was also willing to look at how my behavior influenced Michael s*** me too! he cheated, but there","messageBody":"<div id=\"ygrps-yiv-132150716\">***I&#39;ve had friends accuse me of being a &quot;doormat&quot; because I was also willing to look at how my behavior influenced Michael&#39;s***<br/>\n<br/>\nme too! he cheated, but there were things i could have done differently and needs i could have met that would have possibly changed the outcome (he loves to go out socially at night---i just want to be home with our son...i should have realized how important this was to him---there were plenty of hints!).  when i bring this up to my friends, they are like &#39;don&#39;t blame yourself, he&#39;s the one who did the wrong&#39;.  nothing is ever so black-and-white.<br/>\n<br/>\n***I reacted badly when he made mistakes, so he was afraid to admit when he&#39;d messed up, which led to his being dishonest.***<br/>\n<br/>\nyes, me too.  not exactly reacted badly, but not in the way that helps him. i pretty much set the stage for dishonesty.  <br/>\n<br/>\nhow did michael finally realize that if he wanted Noor to be a trustworthy person, that is what he should model?  he came to this on his own? <br/>\n<br/>\nthis was very helpful...everyone is giving me such good ideas.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;sheeboo2&quot; &lt;brmino@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; ---- I have been deeply hurt yet again (read something he wrote to someone else) and I thought I was covering up my feelings.----<br/>\n&gt; <br/>\n&gt; I hope this isn&#39;t too far off-topic; I&#39;ll try to tie it in to unschooling......<br/>\n&gt; <br/>\n&gt; This is where unschooling principles really helped me: just like I have no control over what another person learns, I also have no control over another&#39;s choices.  Feel your feelings--go out to the sea and scream them to the waves (alone).  It&#39;s a tenuous balance: allowing yourself to grieve but then pulling yourself out of that black hole. <br/>\n&gt; <br/>\n&gt; Walking around wounded, in my experience, is far more detrimental than feeling what you feel swiftly and effectively, like squeezing a brand new tube of toothpaste with both hands as forcefully as you can. Get it out and move on.<br/>\n&gt; <br/>\n&gt; I&#39;ve had friends accuse me of being a &quot;doormat&quot; because I was also willing to look at how my behavior influenced Michael&#39;s, but this was key to my getting over the pain and disappointment  I was carrying around like ten tons of bricks in my pockets. I was cold and unsupportive a lot of the time, I reacted badly when he made mistakes, so he was afraid to admit when he&#39;d messed up, which led to his being dishonest. I know in this age, it&#39;s a big no-no to blame the &quot;victim,&quot; but from our experience, it is really clear to me that the saying &quot;it takes two&quot; is usually correct. I wasn&#39;t the victim, and neither was he. We both made mistakes, were in reactionary mode, and selfish. Chicken and egg stuff, you know? He wasn&#39;t the husband I imagined he&#39;d be and I sure as shit wasn&#39;t a dream wife, either.<br/>\n&gt; <br/>\n&gt; Your son&#39;s dad might not be willing to see how his choices are effecting your son, which is why he&#39;s stuck seeing the behavior as &quot;typical 3yo stuff.&#39;  I&#39;d walk carefully here, if you&#39;re thinking about trying to get him to see what you&#39;re now seeing. I&#39;m not sure that pointing it out would be helpful, or if he might see that as more blame being placed on him.  Hopefully someone with more experience can chime in here......<br/>\n&gt; <br/>\n&gt; I know that Michael came to see the other bits on his own, mostly, with a good swift kick in the ass from Sandra as the finale; it still took quite some time.  As far as being dishonest, eventually he realized that if he wanted Noor to be a trustworthy person, he needed to be trustworthy himself. In part, it helped that his mom lies a lot, and he was able to trace that behavior through to his own. But it also helped that I promised not to freak out when he told the truth :-)<br/>\n&gt; <br/>\n&gt; Brie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338079718","msgId":67343,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcnRsNitoZWE2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkwRkZEMEY4MkQ3RDQwNzJCQ0FCNTM4MjFDOUI4MDA2QExhcHB5SFA+"},"prevInTopic":67342,"nextInTopic":67344,"prevInTime":67342,"nextInTime":67344,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"Hi Connie, Thanks for this.  Yes, I m crowding his space. No, I don t think he agreed to shut me up.  He doesn t want me to date or have someone in the house","messageBody":"<div id=\"ygrps-yiv-1742992701\">Hi Connie,<br/>\n<br/>\nThanks for this.  Yes, I&#39;m crowding his space. No, I don&#39;t think he agreed to shut me up.  He doesn&#39;t want me to date or have someone in the house while he is right next door.  His child from the previous marriage is 21 years old and he had custody of him when we got together. We are both 42.  I will work on some of this...thanks again for the thought provoking ideas.<br/>\n<br/>\nsara<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;otherstar&quot; &lt;otherstar@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; From: SaraW <br/>\n&gt; Sent: Saturday, May 26, 2012 2:43 PM<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n&gt; Subject: [AlwaysLearning] Re: Almost-4-year-old hits,bites parents<br/>\n&gt; <br/>\n&gt; &gt;&gt;&gt;&gt;My husband says he has never had his own space and wants it. He says we can be together if he can have this...or rather, he is willing to try. &lt;&lt;&lt;&lt;<br/>\n&gt; Are you crowding his space? (I am not asking with the expectation of an answer.) My husband and I went through some really rough spots early in our marriage. Even now, 14 years later, we have an occasional rough spot. Whenever we hit a rough spot, I try to look at what I am doing to contribute negativity to the situation. The problems we had early in our marriage may have started with my husband but I was not helping the situation because I was not really listening to him and trying to meet him where he was. I had become the stereotypical nagging wife that kept perpetuating a cycle where my husband would âmess upâ, I would nag him about changing, he would promise to change just to shut me up, he would be âgoodâ for a while, and then when he would âmess upâ the whole cycle started all over. At one point, I thought I had âgotten through to himâ because he âchangedâ and was no longer doing the things that pissed me off. What I found out later was that he hadnât really changed his behavior, he had just gotten better at hiding it. I set him up to lie. He couldnât talk to me about his problems because I would back him into a corner until he told me what I wanted to hear. Things didnât change until I stepped up and started creating a situation where he could be honest about his feelings without me trying to judge him or change him. This is a dynamic that happens quite frequently in marriages as well as in the parent/child relationship. Things will not change until the other person feels like they can be totally honest. <br/>\n&gt; &gt;&gt;&gt;&gt;The rule we have agreed on is no dating other people and definitely no others in the house.&lt;&lt;&lt;&lt;<br/>\n&gt; Did you really agree on it or did he agree with it to shut you up? (I donât want an answer to that.) It is simply a question that I am tossing out there to help you think about the situation in a different way. It is a question that I often ask myself when my kids agree to things. Really, anytime another person agrees with me, I try to check myself to be sure that I am not putting them in a position where they have no choice but to agree. I very seldom do it any more but I donât want to get complacent and slip back into old habits and old patterns. It is me trying to be mindful of others, especially my husband and my children. <br/>\n&gt; &gt;&gt;&gt;&gt;&gt;I wish my husband thought like you but he doesn&#39;t----I&#39;ve shown him yours and other writings on this subject and this is about the only one he doesn&#39;t agree with. His parents were miserable together: his father drank too much, his mother raged too much. He wishes they would have divorced. So he has a very different view on things and I am working against it.&lt;&lt;&lt;&lt;<br/>\n&gt; Stop trying to work against it and work with it. Ask him what he would have liked his parents to be like. Ask him what he would have changed if he could. Let him share his hurts with you. I love my parents but they have always had a rocky marriage. I am the only one of my siblings that has had a successful marriage. My siblings and I grew up seeing my parents fight and nag each other. My big sister talks about how she would go to bed at night and pray that our parents would get a divorce. To this day, my parents are still unhappily married. It is really difficult to have a good marriage when all you have ever seen or experienced is a bad marriage. When things get rough, I have to consciously replace all of the bad stuff that I saw as a kid with good stuff. One of the best things my husband and I have ever done was attend premarital counseling and go to a retreat. That gave us access to other couples that valued marriage. More importantly, it gave us a realistic view of marriage and it gave us tools to deal with the rough spots. Even if you canât find other unschoolers, look for couples that have happy marriages and hang out with them. Try to find shows that depict marriages that are good. In my opinion, one of the most important elements of being able to unschool successfully is to have a stable and happy marriage. Without that, trying to unschool is much more difficult. <br/>\n&gt; &gt;&gt;&gt;&gt;So sorry to be off topic, but this is about unschooling as well: we are both committed to it and I don&#39;t see how we can do it without great challenge if we are apart. And, like you mentioned, I DO NOT want another person involved, especially someone who isn&#39;t on board with unschooling. What a mess. I just never thought this would happen to us.&lt;&lt;&lt;&lt;<br/>\n&gt; If he has another child and an ex-wife, then how can you NOT have other people involved? What about his other child? Does he pretend that child does not exist? If he did it to his first wife and his first child, what made you think that he wouldnât do it to you? Again, these are questions for YOU to think about. I donât expect an answer. I am trying not to make this personal and am simply trying to pull out some things that would be helpful to consider because giving these things consideration will also help you in your unschooling journey if that is what you end up doing in the long run. I have seen people say âI never thought this would happen to usâ when talking about their kids. The reason that they never thought it would happen to them is because they buried their heads in the sand and only saw what they wanted to see. <br/>\n&gt; Connie <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Almost-4-year-old hits,bites parents","postDate":"1338071728","msgId":67338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzgwNzE3MjguMjQzMDIuWWFob29NYWlsTmVvQHdlYjgxNTA3Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpwcmlicitzMTNtQGVHcm91cHMuY29tPg==","referencesHeader":"PGpwcmJvNStranFhQGVHcm91cHMuY29tPiA8anByaWJyK3MxM21AZUdyb3Vwcy5jb20+"},"prevInTopic":67337,"nextInTopic":67342,"prevInTime":67337,"nextInTime":67339,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"    ","messageBody":"<div id=\"ygrps-yiv-2070654485\"> <br/>\n  <br/>\n&lt;&lt;&quot;I really recommend The Seven Principles For Making Marriage Work by John Gottman. He&#39;s studied couples interacting in a fully wired apartment for a weekend at a time for something like 30 years, and can predict with 97% accuracy whether relationships were going to survive. Then he studied what the couples did that beat the odds, to repair their marriage. Maybe you don&#39;t have the other warning signs--we sure did!--but in case it would be helpful & you can&#39;t get the book where you are here they are in a nutshell: &quot;&gt;&gt;&gt;<br/>\n<br/>\nSo this is a formula that this person created.<br/>\nMaybe it will help some.<br/>\n<br/>\nBut why not just be nicer, sweeter, find out what language of love your partner responds to. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.5lovelanguages.com/%c2%a0\">http://www.5lovelanguages.com/%c2%a0</a><br/>\n<br/>\n<br/>\nDo more of that. Create a home and environment where your partner feels safe, loved, appreciated, cared and where he loves to be.<br/>\n<br/>\nFor my husband he could care less if we have a 2 hour date a week.<br/>\nFor him  he loves when I help him in the farm, when I am nice and sweet and still my spunky self .<br/>\nFor him being outside doing stuff , even dirty all full of mud, in the farm, or working out when I am with him is much more<br/>\nof a turn on then going on a date.<br/>\nFor my husband I sit and watch sports with him ( usually I am on my laptop or even reading) and talking about it makes him happy.<br/>\nSo he likes companionship. He likes sharing his work and his passion about sports.<br/>\nI know that it makes him happy to go run and bike so I never make him feel bad for going  like I have seem many woman do. I encourage him to go.<br/>\n<br/>\nFor my husband he is happy if I do not nag or treat him like a child, things I used to do a lot.<br/>\nHe felt like he could never do anything right. <br/>\nSo when I ask him to get me a certain bread and he makes the effort and gets me something that is not quite what I wanted. I thank him and I do not complain.<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Almost-4-year-old hits,bites parents","postDate":"1338070464","msgId":67337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwRkZEMEY4MkQ3RDQwNzJCQ0FCNTM4MjFDOUI4MDA2QExhcHB5SFA+","inReplyToHeader":"PGpwcmJvNStranFhQGVHcm91cHMuY29tPg==","referencesHeader":"PGpwcmJvNStranFhQGVHcm91cHMuY29tPg=="},"prevInTopic":67336,"nextInTopic":67338,"prevInTime":67336,"nextInTime":67338,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"From: SaraW Sent: Saturday, May 26, 2012 2:43 PM To: AlwaysLearning@yahoogroups.com Subject: [AlwaysLearning] Re: Almost-4-year-old hits,bites parents ... Are","messageBody":"<div id=\"ygrps-yiv-1730749304\">From: SaraW <br/>\nSent: Saturday, May 26, 2012 2:43 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSubject: [AlwaysLearning] Re: Almost-4-year-old hits,bites parents<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;My husband says he has never had his own space and wants it. He says we can be together if he can have this...or rather, he is willing to try. &lt;&lt;&lt;&lt;<br/>\n </span></blockquote>Are you crowding his space? (I am not asking with the expectation of an answer.) My husband and I went through some really rough spots early in our marriage. Even now, 14 years later, we have an occasional rough spot. Whenever we hit a rough spot, I try to look at what I am doing to contribute negativity to the situation. The problems we had early in our marriage may have started with my husband but I was not helping the situation because I was not really listening to him and trying to meet him where he was. I had become the stereotypical nagging wife that kept perpetuating a cycle where my husband would “mess up”, I would nag him about changing, he would promise to change just to shut me up, he would be “good” for a while, and then when he would “mess up” the whole cycle started all over. At one point, I thought I had “gotten through to him” because he “changed” and was no longer doing the things that pissed me off. What I found out later was that he hadn’t really changed his behavior, he had just gotten better at hiding it. I set him up to lie. He couldn’t talk to me about his problems because I would back him into a corner until he told me what I wanted to hear. Things didn’t change until I stepped up and started creating a situation where he could be honest about his feelings without me trying to judge him or change him. This is a dynamic that happens quite frequently in marriages as well as in the parent/child relationship. Things will not change until the other person feels like they can be totally honest. <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;The rule we have agreed on is no dating other people and definitely no others in the house.&lt;&lt;&lt;&lt;<br/>\n </span></blockquote>Did you really agree on it or did he agree with it to shut you up? (I don’t want an answer to that.) It is simply a question that I am tossing out there to help you think about the situation in a different way. It is a question that I often ask myself when my kids agree to things. Really, anytime another person agrees with me, I try to check myself to be sure that I am not putting them in a position where they have no choice but to agree. I very seldom do it any more but I don’t want to get complacent and slip back into old habits and old patterns. It is me trying to be mindful of others, especially my husband and my children. <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;I wish my husband thought like you but he doesn&#39;t----I&#39;ve shown him yours and other writings on this subject and this is about the only one he doesn&#39;t agree with. His parents were miserable together: his father drank too much, his mother raged too much. He wishes they would have divorced. So he has a very different view on things and I am working against it.&lt;&lt;&lt;&lt;<br/>\n </span></blockquote>Stop trying to work against it and work with it. Ask him what he would have liked his parents to be like. Ask him what he would have changed if he could. Let him share his hurts with you. I love my parents but they have always had a rocky marriage. I am the only one of my siblings that has had a successful marriage. My siblings and I grew up seeing my parents fight and nag each other. My big sister talks about how she would go to bed at night and pray that our parents would get a divorce. To this day, my parents are still unhappily married. It is really difficult to have a good marriage when all you have ever seen or experienced is a bad marriage. When things get rough, I have to consciously replace all of the bad stuff that I saw as a kid with good stuff. One of the best things my husband and I have ever done was attend premarital counseling and go to a retreat. That gave us access to other couples that valued marriage. More importantly, it gave us a realistic view of marriage and it gave us tools to deal with the rough spots. Even if you can’t find other unschoolers, look for couples that have happy marriages and hang out with them. Try to find shows that depict marriages that are good. In my opinion, one of the most important elements of being able to unschool successfully is to have a stable and happy marriage. Without that, trying to unschool is much more difficult. <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;So sorry to be off topic, but this is about unschooling as well: we are both committed to it and I don&#39;t see how we can do it without great challenge if we are apart. And, like you mentioned, I DO NOT want another person involved, especially someone who isn&#39;t on board with unschooling. What a mess. I just never thought this would happen to us.&lt;&lt;&lt;&lt;<br/>\n </span></blockquote>If he has another child and an ex-wife, then how can you NOT have other people involved? What about his other child? Does he pretend that child does not exist? If he did it to his first wife and his first child, what made you think that he wouldn’t do it to you? Again, these are questions for YOU to think about. I don’t expect an answer. I am trying not to make this personal and am simply trying to pull out some things that would be helpful to consider because giving these things consideration will also help you in your unschooling journey if that is what you end up doing in the long run. I have seen people say “I never thought this would happen to us” when talking about their kids. The reason that they never thought it would happen to them is because they buried their heads in the sand and only saw what they wanted to see. <br/>\nConnie <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321996436,"authorName":"Alex","from":"&quot;Alex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338068155","msgId":67336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcmlicitzMTNtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwcmJvNStranFhQGVHcm91cHMuY29tPg=="},"prevInTopic":67335,"nextInTopic":67337,"prevInTime":67335,"nextInTime":67337,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"I really recommend The Seven Principles For Making Marriage Work by John Gottman. He s studied couples interacting in a fully wired apartment for a weekend at","messageBody":"<div id=\"ygrps-yiv-814226441\">I really recommend The Seven Principles For Making Marriage Work by John Gottman. He&#39;s studied couples interacting in a fully wired apartment for a weekend at a time for something like 30 years, and can predict with 97% accuracy whether relationships were going to survive. Then he studied what the couples did that beat the odds, to repair their marriage. Maybe you don&#39;t have the other warning signs--we sure did!--but in case it would be helpful & you can&#39;t get the book where you are here they are in a nutshell: <br/>\n<br/>\nThe Magic Five Hours <br/>\n<br/>\nPartings: 2 minutes of affection & sharing 1 thing upcoming in each of your days X 5 work days<br/>\n<br/>\nReunions<br/>\n20 minutes of stress-reducing conversation, more or less 10 minutes each of listening non-judgementally, X 5 days<br/>\n<br/>\nAdmiration & appreciation <br/>\n5 minutes X 7 days <br/>\n<br/>\nPhysical Affection<br/>\n5 minutes a day X 7 days - make sure to kiss goodnight<br/>\n<br/>\nWeekly date<br/>\nAsk questions to get to know each other better, planning, relaxing<br/>\n2 hours once a week<br/>\n<br/>\nThat&#39;s oversimplified, of course. There&#39;s basically only 3 hours and 40 minutes that pretty much need to be without children. <br/>\n<br/>\nI know it&#39;s hard to find 20 minutes a day, a 2 hours a week, of awake time without your child, but it&#39;s less time consuming than divorce and split custody or single parenthood. <br/>\n<br/>\nFor us the first step has been about getting faithful to this process, to get to the next step, where my husband can make his own non-work-related goals and I can help him achieve them. <br/>\n<br/>\nGood luck-<br/>\nAlex<br/>\nKatya&#39;s mom<br/>\n<br/>\n(By the way thanks to all who commented on my unreliable friends post...I am still processing everything and how my own issues are wrapped up in that!) <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;SaraW&quot; &lt;sarafloating@...&gt; wrote:<br/>\nI am willing to do just about anything to keep us together, thus the house situation.  The last thing I want is another person involved!  I am doing everything I can to prevent this, but I only have so much say.  My husband claims he doesn&#39;t know what he wants and thinks that if he is around every day that we can still parent together and things will be hunky-dory. I am stuck in waiting mode and trying to make changes that will make him happy so my son can have both parents.  <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338061381","msgId":67335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcmJvNStranFhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE2Q0YxN0QyLTRBNEYtNEFGNC1BOTZCLUYyRDY0NUIyMUEzRkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67331,"nextInTopic":67336,"prevInTime":67334,"nextInTime":67336,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"My husband says he has never had his own space and wants it. He says we can be together if he can have this...or rather, he is willing to try.  The house is","messageBody":"<div id=\"ygrps-yiv-36113052\">My husband says he has never had his own space and wants it. He says we can be together if he can have this...or rather, he is willing to try.  The house is really just an extra bedroom.  Our main house is only about 400 square feet with a large veranda. The rule we have agreed on is no dating other people and definitely no others in the house.  I am willing to do just about anything to keep us together, thus the house situation.  The last thing I want is another person involved!  I am doing everything I can to prevent this, but I only have so much say.  My husband claims he doesn&#39;t know what he wants and thinks that if he is around every day that we can still parent together and things will be hunky-dory. I am stuck in waiting mode and trying to make changes that will make him happy so my son can have both parents.  <br/>\n<br/>\nI wish my husband thought like you but he doesn&#39;t----I&#39;ve shown him yours and other writings on this subject and this is about the only one he doesn&#39;t agree with.  His parents were miserable together:  his father drank too much, his mother raged too much.  He wishes they would have divorced. So he has a very different view on things and I am working against it.  He married when he was very young, had a child and divorced 17 years later.  He fell in love with me and I got pregnant the same year he divorced.  We are his unplanned 2nd family.  He has all these fantasies of freedom and thinks (as a semi-depressed person) that he will be happy if he is &quot;free.&quot;  But every moment he is not working, he is spending with me and our child. It is confusing.  This is what I&#39;m dealing with.  We have fun together, we have a good sex life, we have a child we love....why wouldn&#39;t he want it?  I just don&#39;t understand.<br/>\n<br/>\nSo sorry to be off topic, but this is about unschooling as well:  we are both committed to it and I don&#39;t see how we can do it without great challenge if we are apart.  And, like you mentioned, I DO NOT want another person involved, especially someone who isn&#39;t on board with unschooling.  What a mess.  I just never thought this would happen to us.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-Your son&#39;s dad might not be willing to see how his choices are effecting your son, which is why he&#39;s stuck seeing the behavior as &quot;typical 3yo stuff.&#39; I&#39;d walk carefully here, if you&#39;re thinking about trying to get him to see what you&#39;re now seeing. I&#39;m not sure that pointing it out would be helpful, or if he might see that as more blame being placed on him. Hopefully someone with more experience can chime in here......-=-<br/>\n&gt; <br/>\n&gt; If a couple is getting along well enough to live on the same property, perhaps they could be a little more selfless, and live with their child.  It&#39;s not his fault they weren&#39;t getting along better.<br/>\n&gt; <br/>\n&gt; Living in two houses is an invitation for each of them to &quot;start dating.&quot;  To bring in other adults.  Negotiations with two people who were once in love are hard enough.  Negotiating with someone who is:<br/>\n&gt; 1) not your child&#39;s biological parent<br/>\n&gt; 2) having sex with your formerly-in-love-with partner<br/>\n&gt; 3) having private time with and influence over your child<br/>\n&gt; <br/>\n&gt; is not going to be easy.  It might be horrible.<br/>\n&gt; <br/>\n&gt; What if your child really doesn&#39;t like the new love interest of one or the other of the parents?<br/>\n&gt; <br/>\n&gt; It&#39;s rare, nearly non-existent, for two new couple sharing a child to get along and agree.<br/>\n&gt; I&#39;s rare for two couple who ARE child-loving and agreeable not to then have other children.  When there are various-combo children, the negotiations go haywire again.<br/>\n&gt; <br/>\n&gt; Don&#39;t justify anger and separation if there is the option to get back together.<br/>\n&gt; <br/>\n&gt; Consider reading this, or at least reading about it online:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/The-Unexpected-Legacy-Divorce-Landmark/dp/0786886161\">http://www.amazon.com/The-Unexpected-Legacy-Divorce-Landmark/dp/0786886161</a><br/>\n&gt; <br/>\n&gt; Here&#39;s an article with commentary.  You can find others:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://firstthings.org/page/resource-center/for-married-couples/the-legacy-of-divorce\">http://firstthings.org/page/resource-center/for-married-couples/the-legacy-of-divorce</a><br/>\n&gt; <br/>\n&gt; Too many families are in denial about the damage divorce can do.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Almost-4-year-old hits,bites parents","postDate":"1338058300","msgId":67331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2Q0YxN0QyLTRBNEYtNEFGNC1BOTZCLUYyRDY0NUIyMUEzRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpwcjI1cCtoZThsQGVHcm91cHMuY29tPg==","referencesHeader":"PGpwcjI1cCtoZThsQGVHcm91cHMuY29tPg=="},"prevInTopic":67330,"nextInTopic":67335,"prevInTime":67330,"nextInTime":67332,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"-=-Your son s dad might not be willing to see how his choices are effecting your son, which is why he s stuck seeing the behavior as typical 3yo stuff. I d","messageBody":"<div id=\"ygrps-yiv-2096565990\">-=-Your son&#39;s dad might not be willing to see how his choices are effecting your son, which is why he&#39;s stuck seeing the behavior as &quot;typical 3yo stuff.&#39; I&#39;d walk carefully here, if you&#39;re thinking about trying to get him to see what you&#39;re now seeing. I&#39;m not sure that pointing it out would be helpful, or if he might see that as more blame being placed on him. Hopefully someone with more experience can chime in here......-=-<br/>\n<br/>\nIf a couple is getting along well enough to live on the same property, perhaps they could be a little more selfless, and live with their child.  It&#39;s not his fault they weren&#39;t getting along better.<br/>\n<br/>\nLiving in two houses is an invitation for each of them to &quot;start dating.&quot;  To bring in other adults.  Negotiations with two people who were once in love are hard enough.  Negotiating with someone who is:<br/>\n1) not your child&#39;s biological parent<br/>\n2) having sex with your formerly-in-love-with partner<br/>\n3) having private time with and influence over your child<br/>\n<br/>\nis not going to be easy.  It might be horrible.<br/>\n<br/>\nWhat if your child really doesn&#39;t like the new love interest of one or the other of the parents?<br/>\n<br/>\nIt&#39;s rare, nearly non-existent, for two new couple sharing a child to get along and agree.<br/>\nI&#39;s rare for two couple who ARE child-loving and agreeable not to then have other children.  When there are various-combo children, the negotiations go haywire again.<br/>\n<br/>\nDon&#39;t justify anger and separation if there is the option to get back together.<br/>\n<br/>\nConsider reading this, or at least reading about it online:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/The-Unexpected-Legacy-Divorce-Landmark/dp/0786886161\">http://www.amazon.com/The-Unexpected-Legacy-Divorce-Landmark/dp/0786886161</a><br/>\n<br/>\nHere&#39;s an article with commentary.  You can find others:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://firstthings.org/page/resource-center/for-married-couples/the-legacy-of-divorce\">http://firstthings.org/page/resource-center/for-married-couples/the-legacy-of-divorce</a><br/>\n<br/>\nToo many families are in denial about the damage divorce can do.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338051577","msgId":67327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcjI1cCtoZThsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwcXVicCs4YTluQGVHcm91cHMuY29tPg=="},"prevInTopic":67326,"nextInTopic":67330,"prevInTime":67326,"nextInTime":67328,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"... I hope this isn t too far off-topic; I ll try to tie it in to unschooling...... This is where unschooling principles really helped me: just like I have no","messageBody":"<div id=\"ygrps-yiv-1816982046\">---- I have been deeply hurt yet again (read something he wrote to someone else) and I thought I was covering up my feelings.----<br/>\n<br/>\nI hope this isn&#39;t too far off-topic; I&#39;ll try to tie it in to unschooling......<br/>\n<br/>\nThis is where unschooling principles really helped me: just like I have no control over what another person learns, I also have no control over another&#39;s choices.  Feel your feelings--go out to the sea and scream them to the waves (alone).  It&#39;s a tenuous balance: allowing yourself to grieve but then pulling yourself out of that black hole. <br/>\n<br/>\nWalking around wounded, in my experience, is far more detrimental than feeling what you feel swiftly and effectively, like squeezing a brand new tube of toothpaste with both hands as forcefully as you can. Get it out and move on.<br/>\n<br/>\nI&#39;ve had friends accuse me of being a &quot;doormat&quot; because I was also willing to look at how my behavior influenced Michael&#39;s, but this was key to my getting over the pain and disappointment  I was carrying around like ten tons of bricks in my pockets. I was cold and unsupportive a lot of the time, I reacted badly when he made mistakes, so he was afraid to admit when he&#39;d messed up, which led to his being dishonest. I know in this age, it&#39;s a big no-no to blame the &quot;victim,&quot; but from our experience, it is really clear to me that the saying &quot;it takes two&quot; is usually correct. I wasn&#39;t the victim, and neither was he. We both made mistakes, were in reactionary mode, and selfish. Chicken and egg stuff, you know? He wasn&#39;t the husband I imagined he&#39;d be and I sure as shit wasn&#39;t a dream wife, either.<br/>\n<br/>\nYour son&#39;s dad might not be willing to see how his choices are effecting your son, which is why he&#39;s stuck seeing the behavior as &quot;typical 3yo stuff.&#39;  I&#39;d walk carefully here, if you&#39;re thinking about trying to get him to see what you&#39;re now seeing. I&#39;m not sure that pointing it out would be helpful, or if he might see that as more blame being placed on him.  Hopefully someone with more experience can chime in here......<br/>\n<br/>\nI know that Michael came to see the other bits on his own, mostly, with a good swift kick in the ass from Sandra as the finale; it still took quite some time.  As far as being dishonest, eventually he realized that if he wanted Noor to be a trustworthy person, he needed to be trustworthy himself. In part, it helped that his mom lies a lot, and he was able to trace that behavior through to his own. But it also helped that I promised not to freak out when he told the truth :-)<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338051488","msgId":67330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcjIzMCtjb2hvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwcjAwNSsxMGd1OEBlR3JvdXBzLmNvbT4="},"prevInTopic":67327,"nextInTopic":67331,"prevInTime":67329,"nextInTime":67331,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"Thanks Sandra.  Yes, I understand.  I was referring to Alfie Kohn s ideas about discipline, definitely not schooling!  :)  And I shouldn t have been throwing","messageBody":"<div id=\"ygrps-yiv-1009639911\">Thanks Sandra.  Yes, I understand.  I was referring to Alfie Kohn&#39;s ideas about discipline, definitely not schooling!  :)  And I shouldn&#39;t have been throwing that in there nilly-willy the way I did.<br/>\n<br/>\nI am thankful that I found your site and Joyce&#39;s site several years ago and have spent many hours on both sites.  I have so many pages bookmarked that they don&#39;t fit on my laptop screen! I have shared them with many people and I am grateful for you both. <br/>\n<br/>\nsara<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;sandralynndodd&quot; &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-To clarify, I was referring to the book by Alfie Kohn: Unconditional Parenting,<br/>\n&gt; &quot;Moving from Rewards and Punishments to Love and Reason&quot;, which has a lot of<br/>\n&gt; ideas that seem to me to coincide with radical unschooling,at least in regards<br/>\n&gt; to &quot;discipline&quot; and that kind of thinking. I should not have included it in my<br/>\n&gt; post since it seemed to confuse things-=-<br/>\n&gt; <br/>\n&gt; I was hoping my question would clarify things for you.  I think the people already in the discussion are clear about unschooling and peaceful parenting.  You&#39;re the one who&#39;s new to the discussion, and new (with a three year old) to parenting.<br/>\n&gt; <br/>\n&gt; Alfie Kohn wouldn&#39;t let his kids stay home if they wanted to.<br/>\n&gt; He&#39;s quite pro-school.<br/>\n&gt; <br/>\n&gt; Please don&#39;t expect us to defend or even explain what people promote or propose who aren&#39;t even unschooling.  And don&#39;t expect us to support what any and every other unschooler in the world might suggest.  We&#39;re talking about unschooling as described on my site and Joyce Fetteroll&#39;s.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com\">http://sandradodd.com</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"sandralynndodd","from":"&quot;sandralynndodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338049349","msgId":67326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcjAwNSsxMGd1OEBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGpwcXRwdCs3aG5qQGVHcm91cHMuY29tPg=="},"prevInTopic":67325,"nextInTopic":67327,"prevInTime":67325,"nextInTime":67327,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"-=-To clarify, I was referring to the book by Alfie Kohn: Unconditional Parenting, Moving from Rewards and Punishments to Love and Reason , which has a lot of","messageBody":"<div id=\"ygrps-yiv-1512271869\">-=-To clarify, I was referring to the book by Alfie Kohn: Unconditional Parenting,<br/>\n&quot;Moving from Rewards and Punishments to Love and Reason&quot;, which has a lot of<br/>\nideas that seem to me to coincide with radical unschooling,at least in regards<br/>\nto &quot;discipline&quot; and that kind of thinking. I should not have included it in my<br/>\npost since it seemed to confuse things-=-<br/>\n<br/>\nI was hoping my question would clarify things for you.  I think the people already in the discussion are clear about unschooling and peaceful parenting.  You&#39;re the one who&#39;s new to the discussion, and new (with a three year old) to parenting.<br/>\n<br/>\nAlfie Kohn wouldn&#39;t let his kids stay home if they wanted to.<br/>\nHe&#39;s quite pro-school.<br/>\n<br/>\nPlease don&#39;t expect us to defend or even explain what people promote or propose who aren&#39;t even unschooling.  And don&#39;t expect us to support what any and every other unschooler in the world might suggest.  We&#39;re talking about unschooling as described on my site and Joyce Fetteroll&#39;s.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com\">http://sandradodd.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338048574","msgId":67325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcXY3dSs3aW9vQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwcXBycSt1amUxQGVHcm91cHMuY29tPg=="},"prevInTopic":67324,"nextInTopic":67326,"prevInTime":67324,"nextInTime":67326,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"Another very helpful response.  Y all are awesome.  Thank you so much!  I am thinking it is very much his age---he also just started spitting!  But as Brie","messageBody":"<div id=\"ygrps-yiv-1022268715\">Another very helpful response.  Y&#39;all are awesome.  Thank you so much!  I am thinking it is very much his age---he also just started spitting!  But as Brie helped me realize, I have been distracted by another deep hurt for the past 3 weeks and that was about the time that E&#39;s hitting escalated.  I thought I was handling myself better but I suppose I haven&#39;t....he must sense it.<br/>\n<br/>\nAbout the bike...he has his own bike that he rides but lately has chosen to be on my bike.  We live on a tiny island with no cars or buses or paved roads, so it is walking or biking.  He chooses riding the bike over walking and it only takes about 5 minutes to get anywhere. I wish there weren&#39;t little stores on almost every other block!  <br/>\n<br/>\nHe does a lot of rough play and swimming but if I think about the days when the hitting was worse, they were lazy days. More physical activity on the way...<br/>\n<br/>\nI was using the unconditional parenting reference to describe my approach to the ideas of discipline.  I misused it.<br/>\n<br/>\nThank you so very much for this!  It helps to hear that other kids do this and that it is related to age.  Now I need to work on my own joy and not let this other relationship stuff cloud our world.<br/>\n<br/>\nsara<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Meredith&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; I haven&#39;t read the other replies yet, so some of this may be a repeat.<br/>\n&gt; <br/>\n&gt; If you hadn&#39;t mentioned age, just &quot;child hits and bites&quot; I&#39;d have guessed you had a 3yo. That&#39;s valuable to know, right up front. Whatever else is going on, you have a 3yo, and he&#39;s going to act like a 3yo. That&#39;s not to say you should let him hit and bite (or spit...that usually shows up around 3 or 4, too) but be aware it&#39;s a developmentally normal thing. It&#39;s not the unschooling, it&#39;s life with a young child. <br/>\n&gt; <br/>\n&gt; &gt; I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down.<br/>\n&gt; **************<br/>\n&gt; <br/>\n&gt; I wouldn&#39;t describe unschooling as &quot;unconditional parenting&quot; - if you&#39;re thinking they&#39;re the same thing that may be part of the problem, depending on what kind of spin you&#39;re putting on &quot;unconditional&quot;. Keeping family members safe is a Good condition to have in your home, especially if you have a young child Because little kids will experiment with (or default to) hitting and biting. It&#39;s part of how they learn about the world - but in order for them to learn anything useful, they need a good bit of feedback. Unschooling doesn&#39;t mean &quot;it&#39;s all good&quot;. <br/>\n&gt; <br/>\n&gt; &gt;For awhile now, our son reacts to disappointments or just not getting what he wants/needs immediately by physically attacking us.  <br/>\n&gt; ***************<br/>\n&gt; <br/>\n&gt; Minimize disappointments and fill up his days with Yesses. Be more proactive in terms of seeing what&#39;s important to him, so he has more of what he wants Right Now without having to scramble to meet his needs. The more you can do to get ahead of his needs and desires, the less of an issue it will be when Right Now isn&#39;t an option. <br/>\n&gt; <br/>\n&gt; In particular, be sure he&#39;s getting enough attention and enough Big, physical play - the kind of play that uses his whole body, and provides a lot of stimulation, including rough-housing. A kid with a lot of energy can start to feel &quot;antsy&quot; if he or she isn&#39;t getting enough big stimulating play and then is more likely to react very physically to stress. So meeting those big physical needs proactively is really important in terms of helping kids react with something other than &quot;Arrrrgh! Smash!&quot; in the moment. <br/>\n&gt; <br/>\n&gt; &gt; A couple of days ago, E told me he wanted the house to be finished and I told him that it would take a few weeks since they just started building that day.<br/>\n&gt; *****************<br/>\n&gt; <br/>\n&gt; It helps to break the habit of jumping straight to &quot;no, and this is why&quot;. Find something else to say other than &quot;no&quot; - ask him to talk about the house, what excites him, what is he looking forward to? Talk about how nice it will be to have daddy living right there, everyone together. Talk about construction and what&#39;s happening, what he&#39;s going to get to see. Maybe say &quot;oh, I&#39;d love if the house were done today!&quot; without adding &quot;but it won&#39;t be&quot; - talk about something else. One of the things your son is learning about is the gap between wish and fulfillment, but that doesn&#39;t have to be a painful learning process; you can help him focus on happy things and get Some of what he wants right now. <br/>\n&gt; <br/>\n&gt; &gt;this type of thing happens frequently<br/>\n&gt; <br/>\n&gt; If it&#39;s happening frequently, there are either too many obstacles in his life or you have unrealistic expectations of a young child - maybe a combination of both. A sensitive, energetic 3yo might melt down once a day - I wouldn&#39;t call that frequent, especially if you&#39;re going out more than a few days a week. Going out involves multiple transitions, and transitions are stressful for 3yos. <br/>\n&gt; <br/>\n&gt; &gt; When we are riding on my bike with him sitting behind me and I don&#39;t stop for candy at the store when he requests, sometimes he will lean forward and bite me. <br/>\n&gt; ***************<br/>\n&gt; <br/>\n&gt; Don&#39;t ride past that store. Don&#39;t set him up to be disappointed if you can avoid it. If you can&#39;t stop because of time constraints, plan better next time. Or decide that stopping is preferable to a little boy coming apart at the seams and using the only power he has in the whole world. <br/>\n&gt; <br/>\n&gt; &gt;&gt;sometimes it is not possible and he has difficulty handling it.<br/>\n&gt; <br/>\n&gt; Of course he does, he&#39;s 3. He&#39;s totally dependent on you to make things possible for him. If he wants anything at all, what are his options? <br/>\n&gt; <br/>\n&gt; Make sure your home is as kid-friendly as possible. Set him up to have a lot of competence within his own sphere, at least, and look for ways to give him more options any time you go out. Maybe the bike isn&#39;t a great option - he&#39;s pretty confined in terms of what he can do. Can you get a trailer for the bike? At least then he wouldn&#39;t be stuck, bored and restless, unable to even play with a toy or look at a book while you ride. Maybe he&#39;d rather walk or ride a bus. Maybe it would be better to do some car-sharing if you aren&#39;t in a position to own a car. Explore some alternatives. Stuck on the back of a bicycle would have driven either of my kids bonkers at three, so I really feel for your little guy in that regard. <br/>\n&gt; <br/>\n&gt; &gt;The usual &quot;hitting hurts&quot;/&quot;i don&#39;t like being hurt&quot;/&quot;stop, you are hurting me&quot; has zero effect.  I really need him to stop.<br/>\n&gt; ************<br/>\n&gt; <br/>\n&gt; First, be sure you&#39;re projecting a lot of authority when you say &quot;Stop&quot;. Take a deep breath and pitch your voice lower. Be definite. If he&#39;s really lashing out, hold him so he&#39;s facing away from you, maybe face down over your lap to minimize what he can actually hit. Chances are, it will make him more frustrated and upset - this isn&#39;t a way to calm him down so much as a way to keep from getting your eyes blackened while he rages. But that&#39;s emergency management, not parenting. The important thing is to reduce and prevent these kinds of scenarios by making your kid&#39;s life better - being more proactive, giving him more attention, more big-body play, more of a sense of personal power in his life. <br/>\n&gt; <br/>\n&gt; My stepson used to attack people - adults were scared of him when he was 4, he could really hurt people! Giving him more of what he needed helped in biiiiiiiig ways, even though I couldn&#39;t fix his crazy life in so many ways. You don&#39;t have to make your kid&#39;s life perfect, but the more you can do to make it Better, the easier of a time he&#39;ll have, the less he&#39;ll fall apart and lash out - and the less intense his meltdowns will be. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338047673","msgId":67324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcXVicCs4YTluQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwcXRuMytzamwyQGVHcm91cHMuY29tPg=="},"prevInTopic":67323,"nextInTopic":67325,"prevInTime":67323,"nextInTime":67325,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"Thanks Brie.  Yes!  This is what I fear is going on.  My husband doesn t believe it but I do.  This makes me realize that I have indeed slipped back into a","messageBody":"<div id=\"ygrps-yiv-556098166\">Thanks Brie.  Yes!  This is what I fear is going on.  My husband doesn&#39;t believe it but I do.  This makes me realize that I have indeed slipped back into a place of being hurt after making a lot of progress and getting the joy back. Something new happened a few weeks ago and it wasn&#39;t until this moment that I realized it coincided with E&#39;s angry behavior. I have been deeply hurt yet again (read something he wrote to someone else) and I thought I was covering up my feelings. My husband doesn&#39;t seem to have sensed it but obviously E has.  Thanks for your wise words; this really helps me.<br/>\n<br/>\nsara<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;sheeboo2&quot; &lt;brmino@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; When our daughter was around the same age as your son my husband and I separated (it lasted a year).  In a way, the situation was very similar-he moved out, but only a mile and a half away, and still saw Noor almost daily.  He didn&#39;t cheat on me, but &#39;betrayed&#39; me in other ways that I found difficult to live with. We experienced the same rage from Noor. It was so confusing and scary for her, even though we tried hard to never argue when she was with us.<br/>\n&gt; <br/>\n&gt; Her whole life was up-ended.  And even though we didn&#39;t fight in front of her, the tension in both of us seeped out into her like poison.  It didn&#39;t matter that we&#39;d go for walks together or play by the creek with smiles and kind voices, the animosity (mostly mine) oozed out everywhere and she felt it, deeply, painfully.  Without knowing, she knew--dad hurt mom, mom was angry at dad. The two people she loved the most, and whom she expected to surround her with love and safety were volatile and unstable. <br/>\n&gt; <br/>\n&gt; It is a huge lie that children are resilient in the face of family strife. Do whatever you need to do to sooth your own hurt quickly because it is feeding your son&#39;s feelings of powerlessness. <br/>\n&gt; <br/>\n&gt; Brie<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338047101","msgId":67323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcXRwdCs3aG5qQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCRDQ1NjZBLTcwMkUtNEFDNi1BNkZELTVERjVGRDM1RjQ3Q0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67321,"nextInTopic":67324,"prevInTime":67322,"nextInTime":67324,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"Yes, okay, I understand. To clarify, I was referring to the book by Alfie Kohn:  Unconditional Parenting, Moving from Rewards and Punishments to Love and","messageBody":"<div id=\"ygrps-yiv-117456245\">Yes, okay, I understand.<br/>\n<br/>\nTo clarify, I was referring to the book by Alfie Kohn:  Unconditional Parenting, &quot;Moving from Rewards and Punishments to Love and Reason&quot;, which has a lot of ideas that seem to me to coincide with radical unschooling,at least in regards to &quot;discipline&quot; and that kind of thinking.  I should not have included it in my post since it seemed to confuse things (and yes, attachment parenting!).  And I probably shouldn&#39;t have made such a silly, dramatic statement at the beginning since it didn&#39;t really accurately describe what my issue was.  I will try to be more mindful in future posts.<br/>\n<br/>\nthanks again.  sara<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-I am not practicing &quot;unschooling&quot; on a 3 year old. I just now realized that I have posted on the wrong forum! I thought I was posting on the AlwaysUnschooled group. My mistake. My interpretation was that AlwaysUnschooled is for families that believe in the ideas of radical unschooling and try to incorporate these ideas into their lives from the time their children are very young, before traditional schooling would start.-=-<br/>\n&gt; <br/>\n&gt; Yes, but you said it wasn&#39;t working for you, and that you were practicing &quot;unconditional parenting&quot; and I really don&#39;t know where you got that phrase or what it is you&#39;re doing that you came to complain didn&#39;t work.<br/>\n&gt; <br/>\n&gt; We&#39;re willing to discuss it, but you haven&#39;t said what it was.<br/>\n&gt; <br/>\n&gt; What you described was attachment parenting.<br/>\n&gt; That&#39;s great!! It can make things better for any family, whether they plan to send their kids to school or not.  I&#39;m all for attachment parenting.  (Not for the anti-media stance some of them have adopted, but for letting children be with the parents, gently, as much as the kids want.)<br/>\n&gt; <br/>\n&gt; The problem you reported, of an angry child, should be addressed with what he&#39;s angry about first, now what he does when he&#39;s angry.  <br/>\n&gt; That&#39;s probably what will be asked on any list you join.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338047011","msgId":67321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcXRuMytzamwyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwb3UwMCt1NGpxQGVHcm91cHMuY29tPg=="},"prevInTopic":67320,"nextInTopic":67323,"prevInTime":67320,"nextInTime":67322,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"When our daughter was around the same age as your son my husband and I separated (it lasted a year).  In a way, the situation was very similar-he moved out,","messageBody":"<div id=\"ygrps-yiv-978768964\">When our daughter was around the same age as your son my husband and I separated (it lasted a year).  In a way, the situation was very similar-he moved out, but only a mile and a half away, and still saw Noor almost daily.  He didn&#39;t cheat on me, but &#39;betrayed&#39; me in other ways that I found difficult to live with. We experienced the same rage from Noor. It was so confusing and scary for her, even though we tried hard to never argue when she was with us.<br/>\n<br/>\nHer whole life was up-ended.  And even though we didn&#39;t fight in front of her, the tension in both of us seeped out into her like poison.  It didn&#39;t matter that we&#39;d go for walks together or play by the creek with smiles and kind voices, the animosity (mostly mine) oozed out everywhere and she felt it, deeply, painfully.  Without knowing, she knew--dad hurt mom, mom was angry at dad. The two people she loved the most, and whom she expected to surround her with love and safety were volatile and unstable. <br/>\n<br/>\nIt is a huge lie that children are resilient in the face of family strife. Do whatever you need to do to sooth your own hurt quickly because it is feeding your son&#39;s feelings of powerlessness. <br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338046307","msgId":67320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcXQxMytmN2xnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFRjA5OEFELTUwNDMtNDQzMS05MzY4LTE4N0Q3NTIyNEUxMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67319,"nextInTopic":67321,"prevInTime":67319,"nextInTime":67321,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"Thanks Sandra.  It was actually quite clear as soon as I posted.  I don t know if it helps anybody else, but I hope it does.  Possibly something similar has","messageBody":"<div id=\"ygrps-yiv-1137487615\">Thanks Sandra.  It was actually quite clear as soon as I posted.  I don&#39;t know if it helps anybody else, but I hope it does.  Possibly something similar has happened to other people on this forum or to people reading it. <br/>\n<br/>\nWe are the possibly the only people on the island that parent in a peaceful way.  So, when my child was biting and hitting and I didn&#39;t see other children doing it, I guess I panicked and questioned myself and parenting choices. That&#39;s why I posted---to have y&#39;all reel me back in and help me see that it isn&#39;t this lifestyle but other things and maybe give me some good ideas about how to handle it in the moment. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-So that is a typical day, except there was no hitting of the parents! -=-<br/>\n&gt; <br/>\n&gt; Look at the good parts then, and do more of what makes life good.<br/>\n&gt; <br/>\n&gt; Your description the first time was of fury and biting.  Parents, not just one of you.<br/>\n&gt; <br/>\n&gt; People are trying to suggest that unschooling shouldn&#39;t lead to biting.  Something unhappy is happening before the biting.<br/>\n&gt; <br/>\n&gt; And the list isn&#39;t for untangling individual situations, it&#39;s for discussing the larger ideas, so whether you represented your life in a balanced way or not shouldn&#39;t matter to the discussion.  If there are ideas you can use, try them out.  Read a little, try a little, wait a while, watch and see how it goes.<br/>\n&gt; <br/>\n&gt; Others might be benefiting from the discussion in the meantime.<br/>\n&gt; <br/>\n&gt; It often happens that someone expresses things in a post that she didn&#39;t realize she was thinking or feeling, so the way you presented it the first time might be worth looking at again (by you, in a few days).<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Almost-4-year-old hits,bites parents","postDate":"1338045541","msgId":67319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCRDQ1NjZBLTcwMkUtNEFDNi1BNkZELTVERjVGRDM1RjQ3Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpwcXFlbyt1NWh1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwcXFlbyt1NWh1QGVHcm91cHMuY29tPg=="},"prevInTopic":67318,"nextInTopic":67320,"prevInTime":67318,"nextInTime":67320,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"-=-I am not practicing unschooling on a 3 year old. I just now realized that I have posted on the wrong forum! I thought I was posting on the","messageBody":"<div id=\"ygrps-yiv-1052922091\">-=-I am not practicing &quot;unschooling&quot; on a 3 year old. I just now realized that I have posted on the wrong forum! I thought I was posting on the AlwaysUnschooled group. My mistake. My interpretation was that AlwaysUnschooled is for families that believe in the ideas of radical unschooling and try to incorporate these ideas into their lives from the time their children are very young, before traditional schooling would start.-=-<br/>\n<br/>\nYes, but you said it wasn&#39;t working for you, and that you were practicing &quot;unconditional parenting&quot; and I really don&#39;t know where you got that phrase or what it is you&#39;re doing that you came to complain didn&#39;t work.<br/>\n<br/>\nWe&#39;re willing to discuss it, but you haven&#39;t said what it was.<br/>\n<br/>\nWhat you described was attachment parenting.<br/>\nThat&#39;s great!! It can make things better for any family, whether they plan to send their kids to school or not.  I&#39;m all for attachment parenting.  (Not for the anti-media stance some of them have adopted, but for letting children be with the parents, gently, as much as the kids want.)<br/>\n<br/>\nThe problem you reported, of an angry child, should be addressed with what he&#39;s angry about first, now what he does when he&#39;s angry.  <br/>\nThat&#39;s probably what will be asked on any list you join.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338043672","msgId":67318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcXFlbyt1NWh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA1RDQ2MURGLTg5RDQtNEE0RC1CRUM2LTZDNjZDQjQ5MUU4MUB2ZXJpem9uLm5ldD4="},"prevInTopic":67317,"nextInTopic":67319,"prevInTime":67317,"nextInTime":67319,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"Then I guess I am doing everything I can.  Despite our separation we have provided a supportive, loving environment with both parents in his life every day. I","messageBody":"<div id=\"ygrps-yiv-231631953\">Then I guess I am doing everything I can.  Despite our separation we have provided a supportive, loving environment with both parents in his life every day. I think that the fact his father sleeps elsewhere has had an impact.  His father thinks he is just being a normal 3 year old.  Perhaps I have overreacted.  <br/>\n<br/>\nI have provided food, water, security and love, so we are good on the Hierarchy of Needs. Yes, even security during our darker times.<br/>\n<br/>\nI am not practicing &quot;unschooling&quot; on a 3 year old.  I just now realized that I have posted on the wrong forum!  I thought I was posting on the AlwaysUnschooled group.  My mistake.  My interpretation was that AlwaysUnschooled is for families that believe in the ideas of radical unschooling and try to incorporate these ideas into their lives from the time their children are very young, before traditional schooling would start.<br/>\n<br/>\nSorry to bother y&#39;all!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On May 26, 2012, at 12:31 AM, SaraW wrote:<br/>\n&gt; <br/>\n&gt; &gt; You and Sandra say it doesn&#39;t sound like I&#39;m unschooling <br/>\n&gt; <br/>\n&gt; For one thing he&#39;s 3. At 3 they don&#39;t need schooling so how can you unschool? What he needs is a warm, supportive, loving environment.<br/>\n&gt; <br/>\n&gt; For a second thing, have you seen Maslow&#39;s Hierarchy of Needs:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Maslow&#39;s_hierarchy_of_needs\">http://en.wikipedia.org/wiki/Maslow&#39;s_hierarchy_of_needs</a><br/>\n&gt; <br/>\n&gt; In order to learn he needs the lower levels: food, water, security, love. Someone can be the greatest at creating an &quot;academic&quot; unschooling environment but if the child is lacking in the essential needs, your energy is being wasted.<br/>\n&gt; <br/>\n&gt; Right now his biggest need is security. He&#39;s feeling off balance, out of control. <br/>\n&gt; <br/>\n&gt; &gt; Not every day has a hermit crab and a guitar jam, but that&#39;s the drift.<br/>\n&gt; <br/>\n&gt; Even if he had guitar jams and hermit crabs every day, if he doesn&#39;t feel his family is secure, it can&#39;t mean much to him.<br/>\n&gt; <br/>\n&gt; &gt; I don&#39;t get how I&#39;m choosing not to listen. Perhaps you could explain? <br/>\n&gt; <br/>\n&gt; He&#39;s communicating his fear and frustration at the lack of security he&#39;s feeling. And from his point of view you&#39;re acting as though what&#39;s bothering him most isn&#39;t something you can or want to put back to rights. That&#39;s what&#39;s frustrating him and making him lash out.<br/>\n&gt; <br/>\n&gt; Unless your husband&#39;s abusive, the best thing you can do for your child is get back together. If that&#39;s beyond your control, the biggest thing you need to focus on is making him feel loved and secure.<br/>\n&gt; <br/>\n&gt; Joyce<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338043066","msgId":67317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcXBycSt1amUxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpwb3UwMCt1NGpxQGVHcm91cHMuY29tPg=="},"prevInTopic":67315,"nextInTopic":67318,"prevInTime":67316,"nextInTime":67318,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"I haven t read the other replies yet, so some of this may be a repeat. If you hadn t mentioned age, just child hits and bites I d have guessed you had a 3yo.","messageBody":"<div id=\"ygrps-yiv-1277661185\">I haven&#39;t read the other replies yet, so some of this may be a repeat.<br/>\n<br/>\nIf you hadn&#39;t mentioned age, just &quot;child hits and bites&quot; I&#39;d have guessed you had a 3yo. That&#39;s valuable to know, right up front. Whatever else is going on, you have a 3yo, and he&#39;s going to act like a 3yo. That&#39;s not to say you should let him hit and bite (or spit...that usually shows up around 3 or 4, too) but be aware it&#39;s a developmentally normal thing. It&#39;s not the unschooling, it&#39;s life with a young child. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down.<br/>\n </span></blockquote>**************<br/>\n<br/>\nI wouldn&#39;t describe unschooling as &quot;unconditional parenting&quot; - if you&#39;re thinking they&#39;re the same thing that may be part of the problem, depending on what kind of spin you&#39;re putting on &quot;unconditional&quot;. Keeping family members safe is a Good condition to have in your home, especially if you have a young child Because little kids will experiment with (or default to) hitting and biting. It&#39;s part of how they learn about the world - but in order for them to learn anything useful, they need a good bit of feedback. Unschooling doesn&#39;t mean &quot;it&#39;s all good&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;For awhile now, our son reacts to disappointments or just not getting what he wants/needs immediately by physically attacking us.  <br/>\n </span></blockquote>***************<br/>\n<br/>\nMinimize disappointments and fill up his days with Yesses. Be more proactive in terms of seeing what&#39;s important to him, so he has more of what he wants Right Now without having to scramble to meet his needs. The more you can do to get ahead of his needs and desires, the less of an issue it will be when Right Now isn&#39;t an option. <br/>\n<br/>\nIn particular, be sure he&#39;s getting enough attention and enough Big, physical play - the kind of play that uses his whole body, and provides a lot of stimulation, including rough-housing. A kid with a lot of energy can start to feel &quot;antsy&quot; if he or she isn&#39;t getting enough big stimulating play and then is more likely to react very physically to stress. So meeting those big physical needs proactively is really important in terms of helping kids react with something other than &quot;Arrrrgh! Smash!&quot; in the moment. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A couple of days ago, E told me he wanted the house to be finished and I told him that it would take a few weeks since they just started building that day.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nIt helps to break the habit of jumping straight to &quot;no, and this is why&quot;. Find something else to say other than &quot;no&quot; - ask him to talk about the house, what excites him, what is he looking forward to? Talk about how nice it will be to have daddy living right there, everyone together. Talk about construction and what&#39;s happening, what he&#39;s going to get to see. Maybe say &quot;oh, I&#39;d love if the house were done today!&quot; without adding &quot;but it won&#39;t be&quot; - talk about something else. One of the things your son is learning about is the gap between wish and fulfillment, but that doesn&#39;t have to be a painful learning process; you can help him focus on happy things and get Some of what he wants right now. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;this type of thing happens frequently<br/>\n<br/>\n </span></blockquote>If it&#39;s happening frequently, there are either too many obstacles in his life or you have unrealistic expectations of a young child - maybe a combination of both. A sensitive, energetic 3yo might melt down once a day - I wouldn&#39;t call that frequent, especially if you&#39;re going out more than a few days a week. Going out involves multiple transitions, and transitions are stressful for 3yos. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When we are riding on my bike with him sitting behind me and I don&#39;t stop for candy at the store when he requests, sometimes he will lean forward and bite me. <br/>\n </span></blockquote>***************<br/>\n<br/>\nDon&#39;t ride past that store. Don&#39;t set him up to be disappointed if you can avoid it. If you can&#39;t stop because of time constraints, plan better next time. Or decide that stopping is preferable to a little boy coming apart at the seams and using the only power he has in the whole world. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;sometimes it is not possible and he has difficulty handling it.<br/>\n<br/>\n </span></blockquote>Of course he does, he&#39;s 3. He&#39;s totally dependent on you to make things possible for him. If he wants anything at all, what are his options? <br/>\n<br/>\nMake sure your home is as kid-friendly as possible. Set him up to have a lot of competence within his own sphere, at least, and look for ways to give him more options any time you go out. Maybe the bike isn&#39;t a great option - he&#39;s pretty confined in terms of what he can do. Can you get a trailer for the bike? At least then he wouldn&#39;t be stuck, bored and restless, unable to even play with a toy or look at a book while you ride. Maybe he&#39;d rather walk or ride a bus. Maybe it would be better to do some car-sharing if you aren&#39;t in a position to own a car. Explore some alternatives. Stuck on the back of a bicycle would have driven either of my kids bonkers at three, so I really feel for your little guy in that regard. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The usual &quot;hitting hurts&quot;/&quot;i don&#39;t like being hurt&quot;/&quot;stop, you are hurting me&quot; has zero effect.  I really need him to stop.<br/>\n </span></blockquote>************<br/>\n<br/>\nFirst, be sure you&#39;re projecting a lot of authority when you say &quot;Stop&quot;. Take a deep breath and pitch your voice lower. Be definite. If he&#39;s really lashing out, hold him so he&#39;s facing away from you, maybe face down over your lap to minimize what he can actually hit. Chances are, it will make him more frustrated and upset - this isn&#39;t a way to calm him down so much as a way to keep from getting your eyes blackened while he rages. But that&#39;s emergency management, not parenting. The important thing is to reduce and prevent these kinds of scenarios by making your kid&#39;s life better - being more proactive, giving him more attention, more big-body play, more of a sense of personal power in his life. <br/>\n<br/>\nMy stepson used to attack people - adults were scared of him when he was 4, he could really hurt people! Giving him more of what he needed helped in biiiiiiiig ways, even though I couldn&#39;t fix his crazy life in so many ways. You don&#39;t have to make your kid&#39;s life perfect, but the more you can do to make it Better, the easier of a time he&#39;ll have, the less he&#39;ll fall apart and lash out - and the less intense his meltdowns will be. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Almost-4-year-old hits,bites parents","postDate":"1338031552","msgId":67315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1RDQ2MURGLTg5RDQtNEE0RC1CRUM2LTZDNjZDQjQ5MUU4MUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpwcG1iOSs5dWp0QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwcG1iOSs5dWp0QGVHcm91cHMuY29tPg=="},"prevInTopic":67314,"nextInTopic":67317,"prevInTime":67314,"nextInTime":67316,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"... For one thing he s 3. At 3 they don t need schooling so how can you unschool? What he needs is a warm, supportive, loving environment. For a second thing,","messageBody":"<div id=\"ygrps-yiv-914306303\">On May 26, 2012, at 12:31 AM, SaraW wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You and Sandra say it doesn&#39;t sound like I&#39;m unschooling <br/>\n<br/>\n </span></blockquote>For one thing he&#39;s 3. At 3 they don&#39;t need schooling so how can you unschool? What he needs is a warm, supportive, loving environment.<br/>\n<br/>\nFor a second thing, have you seen Maslow&#39;s Hierarchy of Needs:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Maslow&#39;s_hierarchy_of_needs\">http://en.wikipedia.org/wiki/Maslow&#39;s_hierarchy_of_needs</a><br/>\n<br/>\nIn order to learn he needs the lower levels: food, water, security, love. Someone can be the greatest at creating an &quot;academic&quot; unschooling environment but if the child is lacking in the essential needs, your energy is being wasted.<br/>\n<br/>\nRight now his biggest need is security. He&#39;s feeling off balance, out of control. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Not every day has a hermit crab and a guitar jam, but that&#39;s the drift.<br/>\n<br/>\n </span></blockquote>Even if he had guitar jams and hermit crabs every day, if he doesn&#39;t feel his family is secure, it can&#39;t mean much to him.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t get how I&#39;m choosing not to listen. Perhaps you could explain? <br/>\n<br/>\n </span></blockquote>He&#39;s communicating his fear and frustration at the lack of security he&#39;s feeling. And from his point of view you&#39;re acting as though what&#39;s bothering him most isn&#39;t something you can or want to put back to rights. That&#39;s what&#39;s frustrating him and making him lash out.<br/>\n<br/>\nUnless your husband&#39;s abusive, the best thing you can do for your child is get back together. If that&#39;s beyond your control, the biggest thing you need to focus on is making him feel loved and secure.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Almost-4-year-old hits,bites parents","postDate":"1338029866","msgId":67314,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFRjA5OEFELTUwNDMtNDQzMS05MzY4LTE4N0Q3NTIyNEUxMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpwcG1iOSs5dWp0QGVHcm91cHMuY29tPg==","referencesHeader":"PGpwcG1iOSs5dWp0QGVHcm91cHMuY29tPg=="},"prevInTopic":67313,"nextInTopic":67315,"prevInTime":67313,"nextInTime":67315,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"-=-So that is a typical day, except there was no hitting of the parents! -=- Look at the good parts then, and do more of what makes life good. Your description","messageBody":"<div id=\"ygrps-yiv-307363362\">-=-So that is a typical day, except there was no hitting of the parents! -=-<br/>\n<br/>\nLook at the good parts then, and do more of what makes life good.<br/>\n<br/>\nYour description the first time was of fury and biting.  Parents, not just one of you.<br/>\n<br/>\nPeople are trying to suggest that unschooling shouldn&#39;t lead to biting.  Something unhappy is happening before the biting.<br/>\n<br/>\nAnd the list isn&#39;t for untangling individual situations, it&#39;s for discussing the larger ideas, so whether you represented your life in a balanced way or not shouldn&#39;t matter to the discussion.  If there are ideas you can use, try them out.  Read a little, try a little, wait a while, watch and see how it goes.<br/>\n<br/>\nOthers might be benefiting from the discussion in the meantime.<br/>\n<br/>\nIt often happens that someone expresses things in a post that she didn&#39;t realize she was thinking or feeling, so the way you presented it the first time might be worth looking at again (by you, in a few days).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1338006697","msgId":67313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcG1iOSs5dWp0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM0NDg0OTQ0NDc5NTRBQkU4RTIzNTA3RTk5MzQyNTM4QERlYm9yYWhQQz4="},"prevInTopic":67310,"nextInTopic":67314,"prevInTime":67312,"nextInTime":67314,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"Wow, I guess I really misrepresented our life in my post.  We have always had family bed, I spend all day and night with my son and my husband spends much of","messageBody":"<div id=\"ygrps-yiv-1490245393\">Wow, I guess I really misrepresented our life in my post.  We have always had family bed, I spend all day and night with my son and my husband spends much of his day with him.  We moved to a place where we would have to work less to live just so we can be with our son.  My husband cheated on me in a public and humiliating way and initially said he didn&#39;t want to work on it. The cheating came as a total shock to me. There is still love there and my son deserves to have both parents in his home....I have convinced my husband to give us a chance.  It was always my choice for us to be together and work it out, even the day I found out what was going on. <br/>\n<br/>\nWe live in Central America and we are in and out of the house all day, mostly when E wants to go.  If he doesn&#39;t want to go out, we don&#39;t unless it is something very important.  He loves staying at home but he also enjoys going out because he is very social and loves playing with other children.  We went to the restaurant last night because E wanted to play with his friend. <br/>\n<br/>\nI knew posting would be tough, but this is harder than I imagined. Anyhow, yes, I now agree it is not the unschooling. <br/>\n<br/>\nYou and Sandra say it doesn&#39;t sound like I&#39;m unschooling or that it is difficult if there are marital problems.  I will describe our day today to see if that helps you picture our lifestyle better:<br/>\n<br/>\nWe woke up naturally and E nursed for a little while and we talked in bed. E said he wanted some watermelon, so we got out of bed and had some.  E went outside with my husband to plant some plants. I worked on the computer. E found a hermit crab and brought it inside and we played with it for awhile on the couch.  E then went to work with his father (he has a beachfront restaurant/bar) for an hour or so while I caught up on emails at home.  I met E up there and we watched some guys doing construction for awhile, then got some of the wood scraps and played with them like blocks.  We tried to build houses that the hermit crab could not escape from.  After awhile we went to the grocery store and jumped up and down with excitement because they had sugar snap peas and mushrooms!  We rode home and on our way saw his little friend down the street and invited him to come over and play but his mom had other plans.  At home we ate and played more with the hermit crab.  E said he wanted to keep him and asked what hermit crabs eat, so we Googled it and found out. We then spent awhile digging up sand (he was very excited and proud to use the big shovel all by himself) and creating a home for the hermit crab.  We read some books and hung out and eventually went back down to the restaurant for the big Friday Guitar jam (E wanted to because his father was going to be playing and also because his friends are usually at the Jam).  E helped his father play drums and danced a little and rode bikes and built sand castles with his friends.  He was reluctant to leave after 2 hours but we eventually made it home.  We watched part of a movie, took a bath and read books together and I nursed him to sleep.<br/>\n<br/>\nSo that is a typical day, except there was no hitting of the parents!  Not every day has a hermit crab and a guitar jam, but that&#39;s the drift.<br/>\n<br/>\n   ***All he can do is demonstrate his fear or anger physically.  He&#39;s communicating with you and you&#39;re choosing not to listen***<br/>\n<br/>\nI don&#39;t get how I&#39;m choosing not to listen.  Perhaps you could explain?  <br/>\n<br/>\nI feel like I am doing everything in my power to make things as normal for him as possible.<br/>\n<br/>\nThanks for taking the time to respond.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Deb Lewis&quot; &lt;d.lewis@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; ***I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down. ***<br/>\n&gt; <br/>\n&gt; Itâs not the unschooling. I donât think youâre unschooling.  You and your partner have let your child down. <br/>\n&gt; <br/>\n&gt; ***I don&#39;t want to be abused by my son ...***<br/>\n&gt; <br/>\n&gt; Youâve created a situation where a child feels powerless, uncertain and afraid and you should not call his reaction to that âabuse.â   He has no coping skills at his disposal, no experience to tell him that things will get better.  All he knows is that nothing is like it used to be.  <br/>\n&gt; <br/>\n&gt; Iâm very sorry for your trouble and sincerely hope you can work a peaceful solution.  You get along fine and have a child and I think thatâs reason for staying together and finding solutions.  Your choices now will have life long consequences for your child.  Youâre seeing some of them now.  <br/>\n&gt; <br/>\n&gt; ***I really need him to stop. ***<br/>\n&gt; <br/>\n&gt; You want him to stop.  You *need* to be a stable, reliable, peaceful, happy center of his universe. Happy, secure children donât find many reasons to hit.  <br/>\n&gt; <br/>\n&gt; ***We have never hit him or each other but for some reason this is his go-to form of expression. I am feeling desperate. ***<br/>\n&gt; <br/>\n&gt; Itâs all he has!  If youâre having a difficult time with your uncertain relationship with his father, and youâre an adult,  how can you expect a three year old to have better coping skills?  All he can do is demonstrate his fear or anger physically.  Heâs communicating with you and youâre choosing not to listen.  <br/>\n&gt; <br/>\n&gt; Be as calm and peaceful as you can.  Since you know heâs especially sensitive avoid places and situations that are likely to stress him, for now.   About the tattoos, you might have stopped and picked up some new ones and some other little gift to occupy him on your way to the restaurant.  You know heâs having a hard time.  Think ahead.  Anticipate possible problems and have a plan.   It wonât work every time but it can help. Stay home more if thatâs what he needs.   Make a safe and cozy nest at home and settle in.  Watch his favorite shows together.  Eat good food together, play, hold him, be with him.  Sleep with him if you donât already.  <br/>\n&gt; <br/>\n&gt; Deb Lewis<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Almost-4-year-old hits,bites parents","postDate":"1337996891","msgId":67310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0NDg0OTQ0NDc5NTRBQkU4RTIzNTA3RTk5MzQyNTM4QERlYm9yYWhQQz4=","inReplyToHeader":"PGpwb3UwMCt1NGpxQGVHcm91cHMuY29tPg==","referencesHeader":"PGpwb3UwMCt1NGpxQGVHcm91cHMuY29tPg=="},"prevInTopic":67309,"nextInTopic":67313,"prevInTime":67309,"nextInTime":67311,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"***I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down. *** It’s not the","messageBody":"<div id=\"ygrps-yiv-303070965\">***I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down. ***<br/>\n<br/>\nIt’s not the unschooling. I don’t think you’re unschooling.  You and your partner have let your child down. <br/>\n<br/>\n***I don&#39;t want to be abused by my son ...***<br/>\n<br/>\nYou’ve created a situation where a child feels powerless, uncertain and afraid and you should not call his reaction to that “abuse.”   He has no coping skills at his disposal, no experience to tell him that things will get better.  All he knows is that nothing is like it used to be.  <br/>\n<br/>\nI’m very sorry for your trouble and sincerely hope you can work a peaceful solution.  You get along fine and have a child and I think that’s reason for staying together and finding solutions.  Your choices now will have life long consequences for your child.  You’re seeing some of them now.  <br/>\n<br/>\n***I really need him to stop. ***<br/>\n<br/>\nYou want him to stop.  You *need* to be a stable, reliable, peaceful, happy center of his universe. Happy, secure children don’t find many reasons to hit.  <br/>\n<br/>\n***We have never hit him or each other but for some reason this is his go-to form of expression. I am feeling desperate. ***<br/>\n<br/>\nIt’s all he has!  If you’re having a difficult time with your uncertain relationship with his father, and you’re an adult,  how can you expect a three year old to have better coping skills?  All he can do is demonstrate his fear or anger physically.  He’s communicating with you and you’re choosing not to listen.  <br/>\n<br/>\nBe as calm and peaceful as you can.  Since you know he’s especially sensitive avoid places and situations that are likely to stress him, for now.   About the tattoos, you might have stopped and picked up some new ones and some other little gift to occupy him on your way to the restaurant.  You know he’s having a hard time.  Think ahead.  Anticipate possible problems and have a plan.   It won’t work every time but it can help. Stay home more if that’s what he needs.   Make a safe and cozy nest at home and settle in.  Watch his favorite shows together.  Eat good food together, play, hold him, be with him.  Sleep with him if you don’t already.  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Almost-4-year-old hits,bites parents","postDate":"1337995557","msgId":67309,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhCQTc5QjM3LUI5RjItNEZEQy04NTY2LTM3MTQ0ODc2Njg0Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpwcGFsMCtuZzNoQGVHcm91cHMuY29tPg==","referencesHeader":"PGpwcGFsMCtuZzNoQGVHcm91cHMuY29tPg=="},"prevInTopic":67308,"nextInTopic":67310,"prevInTime":67308,"nextInTime":67310,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"-=- I was blaming our lifestyle and it wasn t until I posted that it became clear his behavior is because of our family situation.-=- I think I was trying to","messageBody":"<div id=\"ygrps-yiv-729615571\">-=- I was blaming our lifestyle and it wasn&#39;t until I posted that it became clear his behavior is because of our family situation.-=-<br/>\n<br/>\nI think I was trying to say that your &quot;lifestyle&quot; involves strife and separation.<br/>\n<br/>\nI don&#39;t even know what &quot;unconditional parenting&quot; is.  If you&#39;ve been gathering bits and pieces of ideas from various places and trying to implement them all (yourself?  with your ex-husband?) that might be the problem.<br/>\n<br/>\nIf your unschooling theories (however vague and unworkable they might be, with a three-year-old) has contributed in ANY way to your separation, I think you should re-examine your intentions and look at the bigger picture.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce\">http://sandradodd.com/divorce</a><br/>\n<br/>\nYou might want to consider solidifying your family, for your son&#39;s benefit, and see if you can get to unschooling later. <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1337994720","msgId":67308,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcGFsMCtuZzNoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFRUJDODIzLTQ3NzItNDRBMS1CMDRELTQyREFBNDE0MTVDMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":67304,"nextInTopic":67309,"prevInTime":67307,"nextInTime":67309,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"As I said in my response to Alex, I agree.  I am feeling helpless that I can t seem to make any progress in getting my child to stop hitting us.  I was blaming","messageBody":"<div id=\"ygrps-yiv-1459357788\">As I said in my response to Alex, I agree.  I am feeling helpless that I can&#39;t seem to make any progress in getting my child to stop hitting us.  I was blaming our lifestyle and it wasn&#39;t until I posted that it became clear his behavior is because of our family situation.<br/>\n<br/>\nBut if we don&#39;t work it out and stay together, I still cannot imagine sending my child to school.  But that is a challenge for another day...<br/>\n<br/>\nThanks for responding.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down. J-=-<br/>\n&gt; <br/>\n&gt; A divorce and a pre-school-age child is not an unschooling situation.<br/>\n&gt; <br/>\n&gt; No one on this list has promoted &quot;unconditional parenting.&quot;<br/>\n&gt; <br/>\n&gt; If you put your child in school will things get better?<br/>\n&gt; I don&#39;t think unschooling is the problem.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Almost-4-year-old hits,bites parents","postDate":"1337989697","msgId":67302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFRUJDODIzLTQ3NzItNDRBMS1CMDRELTQyREFBNDE0MTVDMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpwb3UwMCt1NGpxQGVHcm91cHMuY29tPg==","referencesHeader":"PGpwb3UwMCt1NGpxQGVHcm91cHMuY29tPg=="},"prevInTopic":67298,"nextInTopic":67304,"prevInTime":67301,"nextInTime":67303,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"-=-I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down. J-=- A divorce and a","messageBody":"<div id=\"ygrps-yiv-1482486892\">-=-I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down. J-=-<br/>\n<br/>\nA divorce and a pre-school-age child is not an unschooling situation.<br/>\n<br/>\nNo one on this list has promoted &quot;unconditional parenting.&quot;<br/>\n<br/>\nIf you put your child in school will things get better?<br/>\nI don&#39;t think unschooling is the problem.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Almost-4-year-old hits,bites parents","postDate":"1337986191","msgId":67304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwcDJhZitpc2NlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzc5ODUxMTguNTQwMDQuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":67302,"nextInTopic":67308,"prevInTime":67303,"nextInTime":67305,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"Thanks Alex.  I have read the first two links, but not the third.  I will look at all of them! Thanks for pointing that out.  After posting, I re-read it and","messageBody":"<div id=\"ygrps-yiv-58305274\">Thanks Alex.  I have read the first two links, but not the third.  I will look at all of them!<br/>\n<br/>\nThanks for pointing that out.  After posting, I re-read it and had the same thought myself....seeing it written there made me realize that it is probably our unstable home and that no matter what kind of parenting style we use, we&#39;d likely have similar issues.  I do take his hands and stop him but he squirms and freaks out and then it feels like I am hurting him. <br/>\n<br/>\nI agree, saying he is abusing me was over-dramatic.  Thanks for your help.<br/>\n<br/>\nsara<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; &lt;&lt;&lt;&quot;I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down.&quot;&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; It sounds like your home has been unstable and your son is feeling out of control. Dad is gone and life has changed and he does not know when dad will be there or not. |It does not sound like it has anything to do with unschooling at all.<br/>\n&gt; <br/>\n&gt; Parents separating is a really big issue for kids all. Dad being gone is probably really making him feel scared.<br/>\n&gt; Life has changed and that affects him a huge deal.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &lt;&lt;&lt;&quot;I don&#39;t want to be abused by my son (or anyone). &quot;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; That is really strong and dramatic words to describe a three year old that is feeling scared and out of control of his life. Three is already a very intense age , at least it was for my son.  <br/>\n&gt; I would not sit there and take being hit or having my hair pulled. I would remove the child to a safe place and stop it. <br/>\n&gt; I would try to prevent what I could but I would not just sit there and let him hit me or punch me.<br/>\n&gt; Say no or stop firmly. Hold his hands. Stop it.<br/>\n&gt; <br/>\n&gt; I would  say you need to focus on a more stable, joyful and less dramatic life.<br/>\n&gt; <br/>\n&gt; It is very difficult to unschool a child when the parents are no longer together.<br/>\n&gt; When the home does not feel safe a child will not feel safe to learn and blossom.<br/>\n&gt; <br/>\n&gt; This three links should help you a lot. In the third one listen to the audio file in the bottom of the page( it is awesome).<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce%c2%a0\">http://sandradodd.com/divorce%c2%a0</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/noisy%c2%a0\">http://sandradodd.com/peace/noisy%c2%a0</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully%c2%a0\">http://sandradodd.com/parentingpeacefully%c2%a0</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Alex Polikowsky<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Almost-4-year-old hits,bites parents","postDate":"1337985118","msgId":67298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzc5ODUxMTguNTQwMDQuWWFob29NYWlsTmVvQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpwb3UwMCt1NGpxQGVHcm91cHMuY29tPg==","referencesHeader":"PGpwb3UwMCt1NGpxQGVHcm91cHMuY29tPg=="},"prevInTopic":67297,"nextInTopic":67302,"prevInTime":67297,"nextInTime":67299,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"   It sounds like your","messageBody":"<div id=\"ygrps-yiv-1193145494\">  <br/>\n&lt;&lt;&lt;&quot;I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down.&quot;&gt;&gt;&gt;&gt;<br/>\n<br/>\nIt sounds like your home has been unstable and your son is feeling out of control. Dad is gone and life has changed and he does not know when dad will be there or not. |It does not sound like it has anything to do with unschooling at all.<br/>\n<br/>\nParents separating is a really big issue for kids all. Dad being gone is probably really making him feel scared.<br/>\nLife has changed and that affects him a huge deal.<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&quot;I don&#39;t want to be abused by my son (or anyone). &quot;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nThat is really strong and dramatic words to describe a three year old that is feeling scared and out of control of his life. Three is already a very intense age , at least it was for my son.  <br/>\nI would not sit there and take being hit or having my hair pulled. I would remove the child to a safe place and stop it. <br/>\nI would try to prevent what I could but I would not just sit there and let him hit me or punch me.<br/>\nSay no or stop firmly. Hold his hands. Stop it.<br/>\n<br/>\nI would  say you need to focus on a more stable, joyful and less dramatic life.<br/>\n<br/>\nIt is very difficult to unschool a child when the parents are no longer together.<br/>\nWhen the home does not feel safe a child will not feel safe to learn and blossom.<br/>\n<br/>\nThis three links should help you a lot. In the third one listen to the audio file in the bottom of the page( it is awesome).<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/divorce%c2%a0\">http://sandradodd.com/divorce%c2%a0</a><br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/noisy%c2%a0\">http://sandradodd.com/peace/noisy%c2%a0</a><br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully%c2%a0\">http://sandradodd.com/parentingpeacefully%c2%a0</a><br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":374487427,"authorName":"SaraW","from":"&quot;SaraW&quot; &lt;sarafloating@...&gt;","profile":"sarafloat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Almost-4-year-old hits,bites parents","postDate":"1337981760","msgId":67297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpwb3UwMCt1NGpxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67298,"prevInTime":67296,"nextInTime":67298,"topicId":67297,"numMessagesInTopic":0,"msgSnippet":"I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down.  Just at this tiny moment in","messageBody":"<div id=\"ygrps-yiv-398909485\">I feel like our lifestyle of radical unschooling/unconditional parenting is letting us all (my son E, myself, his father) down.  Just at this tiny moment in time, but that&#39;s how it feels.  For awhile now, our son reacts to disappointments or just not getting what he wants/needs immediately by physically attacking us.  <br/>\n<br/>\nWe&#39;ve had some family problems that have likely set the stage for all this:  Since January, my husband and I have been separated and then having an on-again-off-again relationship. E and I went out of town for a month and during that time, in late February I had a cancer scare and a hospital stay. Husband moved out in late March. He still came by almost every day and E saw him a lot.  But he wasn&#39;t there when we would wake up.  For the last month or so, we&#39;ve been spending a lot of time together as a family and my husband is here a LOT...sleeping over about half the time.  We are up in the air about whether it will work out but we are trying.  We get along very well and enjoy each others company but I am still working on dealing with big hurts and trust issues. Obviously this unsure environment has had an effect on E. I&#39;m sure we made a ton of mistakes in how we handled things. So...that&#39;s the short, vague story on our family drama.<br/>\n<br/>\nWe are building a little guest house right next to our house with an attached veranda.  My husband is going to live in it and E is very excited.<br/>\n<br/>\nA couple of days ago, E told me he wanted the house to be finished and I told him that it would take a few weeks since they just started building that day. He responded by pulling my hair and refusing to let go.  It was extremely painful.  We were in a public place.  As soon as I pried his fingers off, he pulled another chunk of hair, saying that he wanted the house to be ready RIGHT NOW. It took a few minutes to get him to stop and to get safe.<br/>\n<br/>\nLast night, my husband went ahead to a restaurant with E hoping to get a bite while E played with the owner&#39;s son.  We couldn&#39;t find his temporary tattoos before he left and apparently he got it in his head that I was coming later to bring them (rather than just to join them).  The friend he was looking forward to playing with was unavailable. When I rode up, E asked me for the tattoos.  I told him I couldn&#39;t find them but that we could look really hard together when we got back.  He started hitting me and trying to bite me and started screaming that he wanted to go home.  <br/>\n<br/>\nWhen we are riding on my bike with him sitting behind me and I don&#39;t stop for candy at the store when he requests, sometimes he will lean forward and bite me.  Or hit me and just scream and cry.  We usually do stop when he requests but sometimes it is not possible and he has difficulty handling it.<br/>\n<br/>\nThese are just a few examples, but this type of thing happens frequently and it has been going on for a few weeks.  E must be so angry about all that has happened to disrupt his idyllic life and I don&#39;t know how to make it better. He&#39;s a sweet, funny, clever and loving boy. <br/>\n<br/>\nI don&#39;t want to be abused by my son (or anyone). I don&#39;t like the ideas of &quot;discipline&quot;, etc, so what I am to do?  The usual &quot;hitting hurts&quot;/&quot;i don&#39;t like being hurt&quot;/&quot;stop, you are hurting me&quot; has zero effect.  I really need him to stop. We have never hit him or each other but for some reason this is his go-to form of expression. I am feeling desperate. <br/>\n<br/>\nThoughts?</div>","specialLinks":[]}],"prevTopicId":67228,"nextTopicId":67439}}