{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"JLTFH26j7BaqMXwQ7LCZDaxI34jy8fXgSzvp4fcO1GAWitry2oIIQd_67pSAInhSeUpnJg5AmGa1YGwekbQ-xE___gmTViM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japanese TV documentary","postDate":"959315901","msgId":8651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNTI2MDQyOS5OQUExMDUyOEBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":8650,"nextInTime":8652,"topicId":8651,"numMessagesInTopic":0,"msgSnippet":"Friday, 26 May Hi everybody, Here s a piece of good news from Japan to share for a change.... Last night, the NHK public television network here in Japan aired","messageBody":"<div id=\"ygrps-yiv-1135326247\">Friday, 26 May<br/>\n<br/>\n<br/>\nHi everybody,<br/>\n<br/>\nHere&#39;s a piece of good news from Japan to share for a change....<br/>\n<br/>\nLast night, the NHK public television network here in Japan aired an <br/>\noriginal documentary on homelearning in the United States. It was covered <br/>\ncompletely from the angle of the homelearners themselves, with no other <br/>\ndissenting skeptics. On a scale of 1 to 10, overall I&#39;d personally give <br/>\nthe documentary an 8 on the positive side.<br/>\n<br/>\nThe 45-minute program, which ran from 10:00 p.m., was titled &quot;I&#39;m Not <br/>\nGoing to School Anymore: America&#39;s Rapidly Rising Homeschoolers&quot; (rough <br/>\ntranslation). The documentary basically profiled the lives of three <br/>\nhomelearning youths (their names initialized here out of respect for <br/>\nprivacy):<br/>\n<br/>\n-- &quot;S,&quot; age 8, of New York state, whose mother took her out of school and <br/>\nbegan homelearning with her after the girl started showing signs of <br/>\nstress and lack of confidence. This was due to S&#39;s cramming for the <br/>\nstandardized state test that is required for second graders of primary <br/>\nschool. S has two younger siblings, with Mother raising them and doing <br/>\nmost of the homelearning activities. Father works outside the home, and <br/>\nis a bit cautious about the family&#39;s homelearning endeavor, but supports <br/>\nit nonetheless.  <br/>\n<br/>\n-- &quot;J,&quot; age 12, also of New York, who has been homelearning several years <br/>\nunder his parents&#39; guidance and says he has grown closer to his mother <br/>\nbecause of it. J, of middle-school age, belongs to the same homelearning <br/>\nsupport network as S, above. J&#39;s dream is to study astrophysics someday. <br/>\nAfter homelearning for several years, he is now contemplating whether or <br/>\nnot he should enter public school in the near future (three of his seven <br/>\nhomelearning friends have already done so). Mother is a bit wary of this, <br/>\nbut will respect and support J&#39;s decision either way.<br/>\n<br/>\n-- &quot;C,&quot; age 18, a former homelearner and now a student at the Naval <br/>\nAcademy in Maryland. His dream is to become a pilot someday. He is facing <br/>\na bit of a challenge in having to live such a regimented military life, <br/>\nsince his years of learning at home were a lot less unstructured. But he <br/>\nnevertheless appreciates his homelearning years, and he stands out as a <br/>\npositive role model for his peers and staff at the academy.<br/>\n<br/>\nThe documentary showed impressive scenes of homelearning meetings, <br/>\nsupport group functions, parents and children learning together in the <br/>\nhome, as well as children teaching each other in support group activities.<br/>\n<br/>\nThere were a few other &quot;experts&quot; also featured, but their presence only <br/>\nserved to strengthen the underlying &quot;homelearning is good&quot; premise of the <br/>\ndocumentary.<br/>\n<br/>\nOne such expert was a child psychologist, who has done studies comparing <br/>\nthe social behavior of schooled children vs. homelearning children. He <br/>\nshowed and compared his videotaped research sessions, in which two <br/>\nseparate groups of children -- schooled and homelearners -- were put into <br/>\na room with toys and things to do. In both groups, the children were <br/>\nmeeting each other for the first time.<br/>\n<br/>\nThe videotapes showed us that in the schooled children&#39;s session, the <br/>\nkids quickly segregated themselves by gender, ignoring each other&#39;s <br/>\nsubgroups and never once looking up at the lone boy who was too shy to <br/>\napproach the subgroups. Then the psychologist showed a tape of the <br/>\nhomelearning children&#39;s session: The boys and girls all soon worked <br/>\ntogether on something in the center of the room, and when one shy boy <br/>\napproached them, they warmly invited him into their group. The doctor&#39;s <br/>\nassertion: Homelearning children on the whole react much more naturally <br/>\nand openly to &quot;socialization&quot; than schooled children.<br/>\n<br/>\nThen there was The Educrat -- an employee of the New York education board <br/>\nwho is in charge of making sure that all homelearners in the state take <br/>\nthe required standardized tests and file regular reports on the progress <br/>\nof their children. Interviewed at his cramped office, walls lined with <br/>\nfile cabinets, Mr. Sam O. (New Yorkers will instantly know who this is!) <br/>\nunwittingly gave the most memorable quote of the whole program: &quot;Progress <br/>\nis so important for us -- so that I know the kid isn&#39;t watching TV or <br/>\neating lollipops all day.&quot; It&#39;s a good thing this show was aired on <br/>\nJapanese TV and not in the US; this guy would surely never be able to <br/>\nlive down all the &quot;sucker patrol&quot; jokes that would haunt him for the rest <br/>\nof his days.<br/>\n<br/>\nBut that was a bad as it got in this documentary. This guy represented <br/>\nBig Brother harassing innocent people, and he turned out to be such a <br/>\nbureaucratic clown on camera that he only made the homelearners in the <br/>\nshow look that much better.<br/>\n<br/>\nPolitical activities were featured as well. The controversial Home School <br/>\nLegal Defense Association was shown at work, both at its offices and in <br/>\nthe halls of the US Congress. In the latter, HSLDA-member families broke <br/>\nup into groups and went to visit politicians face to face, pressing them <br/>\nfor more freedoms for homelearning families. The camera caught one such <br/>\npolitician, Mark Foley of Florida, being confronted in his congressional <br/>\noffice by a group of these HSLDA adults and children who had come to <br/>\npetition his support for home education. He was put on the spot, and came <br/>\nacross as recognizing the power of homelearners and acknowledging their <br/>\ncause.<br/>\n<br/>\nThe NHK documentary ended on an upbeat note, with encouraging words from <br/>\nthe mother of 8-year-old S, on why homelearning is so important to people <br/>\nlike them: &quot;I look to my children, too, to give *me* direction. It&#39;s not <br/>\nme just giving *them* direction. [I&#39;m] hoping that that will help them in <br/>\nthe long run. And I&#39;m hoping that that will also help them feel that they <br/>\nare confident in decisions that they make, in the directions that they&#39;re <br/>\ngoing -- and knowing that I trust their decisions and that I trust their <br/>\nhelp, their intelligence, their creativity....&quot;<br/>\n<br/>\nAll in all, not a bad program. This I say, despite the reservations I <br/>\nhave about the military and HSLDA portrayed as leading the way for <br/>\nhomelearners Stateside.<br/>\n<br/>\nBut the most important thing to remember here is that the homelearning <br/>\nmovement in Japan is still in its infancy, and for many Japanese viewers <br/>\nnationwide, this NHK program may be the first time they&#39;ve ever heard of <br/>\nlearning at home as an alternative to school. Hopefully, this program <br/>\nwill help them explore that alternative more in the future.<br/>\n<br/>\nThough Japanese homelearners don&#39;t have the strength in numbers (yet) of <br/>\nour counterparts in other countries, there is one advantage over the US <br/>\nor other countries that we do have: a news media in Japan that is not <br/>\nopenly hostile to homelearning. In fact, at this early stage, the <br/>\nJapanese media seem to be giving a surprisingly fair shake in exploring <br/>\nhomelearning and alternative schools as viable educational choices. This <br/>\nNHK documentary is proof of that.<br/>\n<br/>\nThere are many theories about why such neutral-to-positive coverage of <br/>\nhomelearning is appearing in Japan right now, and all the theories <br/>\nprobably have some merit. But I think the best answer is close to home: <br/>\nLots of reporters and editors in the Japanese mass media have children, <br/>\nand they seem to be desperately searching for answers for their own <br/>\nfamilies where school is concerned. If this personal searching in the <br/>\nJapanese mass media helps advance the cause of homelearning in Japan and <br/>\nbrings the positive message of alternative education to a much wider <br/>\naudience, then long may this coverage continue.<br/>\n<br/>\nThings may change as time goes on and alternative education in Japan <br/>\nactually begins to threaten the foundations of the country&#39;s <br/>\neducation/industrial complex (as it most certainly will). But for now, at <br/>\nleast, we have a lot to be thankful for where Japanese media coverage of <br/>\nhomelearning is concerned.<br/>\n<br/>\nNow, if we could only get them to point their TV cameras more at <br/>\nhomelearning families right here IN Japan....!<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan</div>","specialLinks":[]}],"prevTopicId":8633,"nextTopicId":8652}}