{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Thank You cards was Re: Manners, rank","postDate":"1055867953","msgId":74625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMzLjM0ZmY0ZDhhLjJjMjA5ZTMxQGFvbC5jb20+"},"prevInTopic":74463,"nextInTopic":0,"prevInTime":74624,"nextInTime":74626,"topicId":74441,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/16/2003 5:14:56 PM Eastern Daylight Time, ... My children are older now but have ALWAYS sent thank you cards, just a part of their lives.","messageBody":"<div id=\"ygrps-yiv-386865573\">In a message dated 6/16/2003 5:14:56 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tmthomas@...\">tmthomas@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do you all handle Thank You cards? <br/>\n&gt; I remember my dad always forcing us to write them, and we thought it was <br/>\n&gt; silly. Now as an adult, I can see how thoughtless it is for someone (say a <br/>\n&gt; bride) to overlook any money and time spent in choosing a gift by not responding <br/>\n&gt; with a card. In cases of gifts sent long-distance, a card let&#39;s the sender <br/>\n&gt; know that the gift was received. How do we teach our kids to show appreciation <br/>\n&gt; for gifts without forcing Thank You cards?<br/>\n&gt; Shalom,<br/>\n&gt; Raine<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>My children are older now but have ALWAYS sent thank you cards, just a part <br/>\nof their lives.  When they were little it was just what we did a day or two <br/>\nafter a birthday party, Christmas, or a visit to someone.  We choose a special <br/>\ncard and expressed our thanks for whatever it happened to be, a special lunch at <br/>\nChuck E. Cheese, a sparkly new pair of PJ&#39;s, whatever it was.  Of course I <br/>\nwas the one writing them at first, asking what would you like to say to Aunt <br/>\n________ or Grandma ________ about our visit or their visit or the _____________? <br/>\n Sometimes THEY wanted to &quot;write&quot; the note, having no clue about spelling or <br/>\norder of words so they &quot;wrote&quot; in their two or three year old hand and then I <br/>\ndeciphered it for the recipient.  One of my sisters still has every little <br/>\nhand scribble note they&#39;ve ever sent her.<br/>\n<br/>\nJust as you say &quot;thank you&quot; to someone if they are brought up with notes <br/>\nbeing a part of the event or process they continue it.  Flushing the toilet after <br/>\nyou use it is just something you do, writing a note just comes after a gift or <br/>\nkindness the same way if that&#39;s how it&#39;s always been.<br/>\n<br/>\nMy oldest graduated from high school and wrote her thank you notes for the <br/>\ngifts and cards and money as each arrived.  I didn&#39;t remind her or ask her if <br/>\nshe&#39;d done it, I did buy her stamps when she asked.  My older boy kept a list as <br/>\nhis gifts and cards came in the mail and did his thank you&#39;s all at once, <br/>\nagain no reminders but I did mail them for him.<br/>\n<br/>\nMy neighbor complained to the high heavens about begging and prodding and <br/>\ndemanding her son write thank you notes for the very generous gifts he had <br/>\nreceived.  He never did and finally she did it herself.<br/>\n<br/>\nShe asked how I got MY children to do it, I didn&#39;t &quot;get&quot; them to do it.  If <br/>\nthank you notes are important to you, then just let your children see YOU doing <br/>\nit early on as a natural consequence of a gift or kindness.<br/>\n<br/>\nWe always send flowers to our hostess after returning from a visit with <br/>\nanyone as well.  My children still do this too.  My sons rarely stay overnight with <br/>\nanyone but my older daughter often visits friends from college or a weekend <br/>\nwith another friends parents at the beach.  My sons might ask that I go online <br/>\nand send _________ some flowers because (usually a Mom of a friend) put up <br/>\nwith them all weekend or cooked for them or something.  My daughter just does it <br/>\non her own. So it&#39;s just a nice thing to do when others have been kind to you <br/>\nwhen they didn&#39;t have to at all.<br/>\n<br/>\nPeople like it when you remember kindness.  I&#39;m not saying a genuine thank <br/>\nyou given in person isn&#39;t enough, for some people it is.  I also don&#39;t think a <br/>\nwritten note is any less genuine.  Are there gifts you are really unthankful <br/>\nfor?  I&#39;ve had gift that I didn&#39;t like or couldn&#39;t wear or use, but I&#39;ve always <br/>\nbeen able to say &quot;thank you for the gift, it was very thoughtful of you to <br/>\nthink of me&quot; or &quot;thank you for remembering me on my birthday, it was very <br/>\nspecial&quot;.  There are ways to get around sounding less than genuine if you absolutely <br/>\nhated a gift.  Kids almost always LOVE every gift in someway.<br/>\n<br/>\nSo the best way to get your kids to WANT to send notes?  Just have it be a <br/>\npart of their growing up years.  It doesn&#39;t have to be a burden to send them but <br/>\njust a part of receiving a kindness or gift.<br/>\n<br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Thank You cards was Re: Manners, rank","postDate":"1055804398","msgId":74463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIwLjNhYTFmZjNhLjJjMWZhNWVlQGFvbC5jb20+"},"prevInTopic":74441,"nextInTopic":74625,"prevInTime":74462,"nextInTime":74464,"topicId":74441,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/16/03 3:15:31 PM, tmthomas@shaw.ca writes:  Now.... I LOVE","messageBody":"<div id=\"ygrps-yiv-1818013360\">In a message dated 6/16/03 3:15:31 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tmthomas@...\">tmthomas@...</a> writes:<br/>\n<br/>\n&lt;&lt;  So useless cards with their thin/not-genuine communication - HUMBUG! &gt;&gt;<br/>\n<br/>\nNow....   <br/>\nI LOVE Christmas cards.  I&#39;ve saved every one I&#39;ve ever gotten.  Some years I <br/>\nsend lots.  This year I was stuck on the couch and sent zero.<br/>\n<br/>\nAnd Christmas cards can be THICK fat wonderful communication.<br/>\nSo can e-mail, y&#39;humbuggler!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":93802122,"authorName":"tmthomas@shaw.ca","from":"tmthomas@...","profile":"wisdom0007","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Thank You cards was Re: Manners, rank","postDate":"1055797931","msgId":74441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4ZGJhYjI4OWRhNy4yODlkYTcyOGRiYWJAc2hhdy5jYT4="},"prevInTopic":0,"nextInTopic":74463,"prevInTime":74440,"nextInTime":74442,"topicId":74441,"numMessagesInTopic":0,"msgSnippet":"I find this form of communication THIN to say the least.  Me, I d phone them all.  But my wedding was small and special, so not too onerous. We never send Xmas","messageBody":"<div id=\"ygrps-yiv-1211772920\">I find this form of communication THIN to say the least.  Me, I&#39;d phone them all.  But my wedding was small and special, so not too onerous.<br/>\n<br/>\nWe never send Xmas cards - dead trees aren&#39;t THAT pretty and I live next door to millions of hectares of cut forests.  (Let&#39;s not even go there unless willing to stop using T. Paper too, and I&#39;m not!)  So useless cards with their thin/not-genuine communication - HUMBUG!<br/>\n<br/>\nFor the kids, ASK them if they&#39;d like to do cards.  Grama/other person might enjoy hearing from them, whaddya think?  If they aren&#39;t into it, carry on with life. We only serve up society&#39;s expectations, we don&#39;t enforce them, IMHO!<br/>\n<br/>\nMy, but these are ramblin&#39; thots,<br/>\nTim T<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I have a question along these lines...<br/>\n </span></blockquote>How do you all handle Thank You cards? <br/>\nI remember my dad always forcing us to write them, and we thought it was silly. Now as an adult, I can see how thoughtless it is for someone (say a bride) to overlook any money and time spent in chosing a gift by not responding with a card. In cases of gifts sent long-distance, a card let&#39;s the sender know that the gift was received. How do we teach our kids to show appreciation for gifts without forcing Thank You cards?<br/>\nShalom,<br/>\nRaine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":74618,"nextTopicId":74422}}