{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"LASaliger@aol.com","from":"LASaliger@...","replyTo":"LIST","senderId":"KevLbSoAKbigky3j_jlX9wC__4lacwP3EyAzonZYcVQ8EM70jo4Q4taj_ouvEOfrkNdptsykk44","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Maybe of interest...","postDate":"989109279","msgId":20623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMTYzODAzMTMuMjgyNWY2MWZAYW9sLmNvbT4="},"prevInTopic":20620,"nextInTopic":0,"prevInTime":20622,"nextInTime":20624,"topicId":20620,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/5/01 5:26:59 PM Pacific Daylight Time, jsdahlem@bellsouth.net writes: ","messageBody":"<div id=\"ygrps-yiv-696756606\">In a message dated 5/5/01 5:26:59 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jsdahlem@...\">jsdahlem@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Susan<br/>\n <br/>\n I went to the woods because I wished to live deliberately, to front only the<br/>\n essential facts of life, and see if I could not learn what it had to teach,<br/>\n and not, when I came to die, discover that I had not lived.<br/>\n Thoreau<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>Susan,<br/>\n     I enjoyed it very much!  Thanks for sharing it.  And I LOVE <br/>\nThoreau...nothing quite like him!  His writing has inspired me more than any <br/>\nother author&#39;s.<br/>\n<br/>\n         Lucy</div>","specialLinks":[]},{"userId":0,"authorName":"The Soap Maven","from":"&quot;The Soap Maven&quot; &lt;jsdahlem@...&gt;","replyTo":"LIST","senderId":"3O-dbfy_nzgaVh3KKtsL3rA08V3IL1fNKIZsP_9W7oULbly-LBkIr5O5lHDdC_Le2fOCWQCX5SXXHYBVxzHpWKKJe1tWg7LRNoVmwrBpf_I","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Maybe of interest...","postDate":"989108623","msgId":20620,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWQwMWMwZDVjMiRkMDBkYTIyMCQ5ZWNlNGZkOEBvZW1jb21wdXRlcj4=","referencesHeader":"PDk4OTEwNzUwNC4yMTMwLjkwNjc5Lmw5QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":20623,"prevInTime":20619,"nextInTime":20621,"topicId":20620,"numMessagesInTopic":0,"msgSnippet":"Thought some of you might enjoy reading it...feel free to comment if you like.it is an essay I wrote for our homeschool newsletter.  I thought someone might","messageBody":"<div id=\"ygrps-yiv-1864686715\">Thought some of you might enjoy reading it...feel free to comment if you<br/>\nlike.it is an essay I wrote for our homeschool newsletter.  I thought<br/>\nsomeone might find it interesting...I am much more comfortable with you all<br/>\nreading<br/>\nit than my local group...they already think us strange...we have a lot of<br/>\nfamilies that have &quot;school at home&quot; and think those of us that &quot;color<br/>\noutside the lines&quot; are somehow not up to par. Oh well...<br/>\n<br/>\nMeet An Unschooling Family<br/>\nSusan Dahlem<br/>\n<br/>\n     In our life, we are in a constant state of learning and have found that<br/>\nwe fit best into the &quot;unschoolers&quot; category and strive to do as little &quot;time<br/>\nwasting&quot; as possible. We truly feel (from experience of course Ü) that<br/>\nschool as the masses know it is a serious waste of childhood and not only<br/>\ncontributes to the ills of our society, but has resulted in the mass<br/>\nproduction of illiterate, unimaginative, uncreative clones of not-so-great<br/>\nminds.  If you don&#39;t believe me try to get a correct order at your local<br/>\nfast food place two days in a row!<br/>\n<br/>\nWe are trying so very hard to instruct our children to live life, love<br/>\nit...learn from it.  Do what they love and love what they do. And NEVER<br/>\ngauge their success by anyone&#39;s standards but their own.  Financial gain<br/>\ndoes not = happiness!  Our goals from the beginning of our parenting<br/>\nadventure has been to raise our children to be thinkers, as well as doers.<br/>\nWe want them to respectfully question authority, to do what is right because<br/>\nit IS right, take very little at face value, to have a working knowledge of<br/>\nnumbers and their purpose, and to be able to write out their thoughts<br/>\nwithout hesitation so that they will be understood and their opinions<br/>\nrespected. We want them to appreciate art for art&#39;s sake, literature or the<br/>\njoy of reading and gaining knowledge, and music just because we don&#39;t trust<br/>\nanyone who doesn&#39;t love music!!  Ü We want them to be able to orally convey<br/>\ntheir thoughts and opinions as well as being able to write them down so as<br/>\nto demand the respect they<br/>\ndeserve.<br/>\n<br/>\n     We have never told any one of our 6 children that they were incapable<br/>\nof doing anything. We have told them at times they may should try something<br/>\nfrom a different approach.  We have some very confident, strong family<br/>\nmembers who are people with minds, opinions and choices of their own. Our<br/>\napproach to learning has always been a little unorthodox doing mostly<br/>\nresearch type learning. You know, getting on a subject and reading, digging<br/>\nand reading some more until your curiosity is satisfied. That is how you<br/>\nretain things...being interested in it. We have NEVER spoon fed our children<br/>\ninformation and never will. It is a ridiculous tiresome act that is<br/>\ncompletely fruitless--kind of like trying to teach a pig to sing.<br/>\n<br/>\n     We have tried to stay away from &quot;What Your Fifth Grader Should Know&quot;<br/>\nkind of mentality.  Who knows what my fifth grader should know better than<br/>\nme and his/her father?  Jessica at 10 years old (approximate 5th grade age)<br/>\ncould NOT write, recite or grasp multiplication tables.  Couldn&#39;t, wouldn&#39;t<br/>\nor what ever the case was.  BUT, she designed, cut, pieced and put together<br/>\na lovely quilt.  So she obviously inadvertently understood some Geometry.  I<br/>\nadmit being a tad concerned that maybe I had presented the material in a way<br/>\nshe didn&#39;t understand...and I admit I have little patience with those who do<br/>\nnot &quot;get&quot; math.... but suddenly almost three years later she woke one day<br/>\nand could, and did, do multiplication - short ways, long ways, side ways!<br/>\nAnd as far as I know she still can.<br/>\n<br/>\n    We have three who have &quot;graduated&quot; and gone on to be productive, decent<br/>\ncitizens.  No one has been arrested as of this writing... though I admit I<br/>\nalways saw myself being dragged off with those little twisty ties around my<br/>\nwrists, all the while shouting at the top of my lungs some protester&#39;s<br/>\nmantra. No I am not disappointed - just surprised - they are their mother&#39;s<br/>\nchildren you know! And their father&#39;s.  They certainly inherited my<br/>\nverbosity and Jerry&#39;s bent towards belligerence.  They all have wage earning<br/>\njobs... even old married Jessica has started her own catering business<br/>\n(Kneadful Things - want to know more just ask me!).<br/>\n<br/>\n    We joke sometimes about the amount of useless knowledge we have in our<br/>\nheads with Zach and Jerry regularly vying for the crown and title King of<br/>\nTrivial Information.  But, you know what is useless to some is useful to<br/>\nothers.  Analytical Geometry would be completely a waste of brain RAM for<br/>\nZach but, how many bell peppers to a case...now THAT he knows.<br/>\n<br/>\n     Susan<br/>\n<br/>\nI went to the woods because I wished to live deliberately, to front only the<br/>\nessential facts of life, and see if I could not learn what it had to teach,<br/>\nand not, when I came to die, discover that I had not lived.<br/>\nThoreau<br/>\n<br/>\nBlessings,<br/>\nSusan<br/>\nwife to Jerry<br/>\nmom to Zach, Jessica, Nathan, Hannah, Rachel and Benjamin<br/>\n<br/>\nDahlem&#39;s Handcrafted Soaps<br/>\nwww.dahlemshandcraftedsoap.com<br/>\n<br/>\n~*~*~*Motherhood is a Sacred Journey*~*~*~</div>","specialLinks":[]}],"prevTopicId":20471,"nextTopicId":20625}}