{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"discovery6@aol.com","from":"discovery6@...","replyTo":"LIST","senderId":"ooPj9Z2DHeYAmcNUf-5ocSQ6NrwjWEcFEyM3uN0EbUPpFLpTJ1DO93yy9Pj08G-H5BFkNH2gs21M","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[Unschooling-dotcom] Unschooling and wandering thoughts","postDate":"981938143","msgId":16295,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1LmZiMGU5NzUuMjdiODg5ZGZAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":16294,"nextInTime":16296,"topicId":16295,"numMessagesInTopic":0,"msgSnippet":"About unschooling  :) I have been reading the book The Teenage Liberation Handbook. I am sure that everyone else has already read it as I always kept hearing","messageBody":"<div id=\"ygrps-yiv-1830104608\">About unschooling  :)<br/>\nI have been reading the book The Teenage Liberation Handbook. I am sure that <br/>\neveryone else has already read it as I always kept hearing about how great it <br/>\nwas. Then I ran across it on ebay for a $1 and jumped on it. I love it. I <br/>\nwish, wish, wish that I would have read it when I was 12 or 13. That was when <br/>\nmy BAD school years really started. I wonder how different my life would have <br/>\nbeen and my husband&#39;s too. As I read I began to remember the times in our <br/>\nunschooling past where I became concerned about whether the kids were <br/>\nlearning enough. I thought I was a good parent, wanting them to have great <br/>\nadult lives someday. To be a success. Now I see that what I was thinking was <br/>\nthat they would not have great adult lives if they were not making lots of <br/>\nmoney in some super career. I wanted them to make lots of money so their <br/>\nlives would be easier. I was limiting my children. My husband is in <br/>\nconstruction. We do not have a lot of money. My family has been in <br/>\nconstruction since they used mules with the machinery. (which is something I <br/>\nwould still like to see), I have never know lots of money. Have I always <br/>\nrelated that to failure? When I was a little kids I always thought that my <br/>\nDad had the greatest job in the whole world. He owned and ran those big neat <br/>\nmachines. I was so proud. I had a wonderful (not!) teacher in jr high that <br/>\nloved to tell me how I would never amount to anything, be a ditch digger all <br/>\nmy life. Boy I hated him. Coming from a family of &quot;ditch diggers&quot; he was <br/>\nlinking that with failure. Great huh! The Teenage Liberation Handbook has <br/>\nhelped me to see that whatever, and I mean whatever my kids want to be as <br/>\nadults is ok. I so wish I would not had so much emotional garbage inside when <br/>\nI started raising my kids. I would have been a better parent. And it came <br/>\nfrom public school. Twelve long years of gabage collecting<br/>\nJust thinking aloud...<br/>\nCandy</div>","specialLinks":[]}],"prevTopicId":16293,"nextTopicId":16260}}