{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":122146524,"authorName":"angelwings14513","from":"&quot;angelwings14513&quot; &lt;angelwings14513@...&gt;","profile":"angelwings14513","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"( NY) Senate bill ( homeschooling)","postDate":"1055424759","msgId":73814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJjOXZkbitsZWpmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":73813,"nextInTime":73815,"topicId":73814,"numMessagesInTopic":0,"msgSnippet":"THIS IS FROM ANOTHER LIST! Hi everyone, If you are against A4598, now is the time to act!!! I ve been writing letters regarding this bill for over a year now.","messageBody":"<div id=\"ygrps-yiv-689828581\">THIS IS FROM ANOTHER LIST!<br/>\n<br/>\n&quot;Hi everyone,<br/>\n   If you are against A4598, now is the time to act!!!<br/>\nI&#39;ve been writing letters regarding this bill for<br/>\nover a year now.  Today I took the time to call all of<br/>\nthe assemblymembers involved to say our family is<br/>\nopposed.  The assemblymember assistants told me that<br/>\nthe majority of letters and calls they have received<br/>\nare for those in favor of the bill.<br/>\n   Take the time to read this and decide what is best<br/>\nfor your family.  If you are opposed, act now!  If<br/>\nthis bill passes, it will change the way we do things<br/>\nas homeschoolers...and in way you may not support! &quot;<br/>\n____________________________________________________________-<br/>\n_____________________________________________________________<br/>\nSubject: Opposing the proposed homeschooling bill--quickly!<br/>\n<br/>\nWell, now is the time to let our voices be heard in the NY State<br/>\nAssembly, because the homeschooling bill has already passed in the<br/>\nSenate<br/>\n(S2060) and could come up for a vote any day now in the Assembly (as <br/>\n#<br/>\nA4598) because adjournment is scheduled for the 19th! So if we want <br/>\nto<br/>\nlet our representatives know that we don&#39;t support this bill, we have<br/>\nto<br/>\nspeak up immediately. (Basic contact information is listed below as<br/>\nwell<br/>\nas in the latest newsletter.)<br/>\n<br/>\n( SNIP)  board has sent the letter printed below (similar to longer <br/>\nones<br/>\nwe&#39;ve sent in the past), but a letter from the group is no substitute<br/>\nfor<br/>\nall of those quick individual calls and postal notes that can add up <br/>\nto<br/>\nlet our representatives know that we&#39;re watching what is happening <br/>\nand<br/>\nwe<br/>\nare concerned.<br/>\n<br/>\nThe problems that could be caused by this bill (if it passed) have <br/>\nbeen<br/>\ndescribed in the past in the newsletter, on the loop, in issues of <br/>\nHome<br/>\nFree, and also on some statewide websites (like www.nyhen.org), but<br/>\nthere<br/>\nare too many distinct points to describe all of them here.<br/>\n<br/>\n Just off the top of my head, here are a few of the problems with the<br/>\nproposed bill: though the bill appears at first glance to relieve us <br/>\nof<br/>\nmany of the reporting requirements under the current regs, it is <br/>\nbadly<br/>\nwritten, creates some new areas of confusion (which could lead to <br/>\nmessy<br/>\nand dangerous legal challenges), and would put some undesirable <br/>\naspects<br/>\nof the current regs into law for the first time, where the <br/>\nlegislature<br/>\ncan pretty much tinker with our rights at will. At least the current<br/>\nregs<br/>\nhave remained stable for a very long time, which has so far protected<br/>\nus,<br/>\nfor instance, from being swept up in the high-stakes testing craze <br/>\nthat<br/>\nis wreaking such havoc in NY&#39;s public schools.<br/>\n<br/>\nFurthermore, most NY homeschoolers disagree with the pushing of this<br/>\nbill<br/>\nas the answer to our difficulties with the regs. There are a number <br/>\nof<br/>\nother approaches that various groups of homeschoolers feel could<br/>\nproduce<br/>\nbetter and safer results; but a small group of homeschoolers, with <br/>\nthe<br/>\nbacking of (some say pressure from) HSLDA, has been pushing this bill<br/>\nover the loud objections of their fellow New Yorkers. That alone <br/>\nwould<br/>\nbe<br/>\nreason enough to slow down, stop this bill, and then try to reach <br/>\nsome<br/>\nagreement across the state about how best to proceed.<br/>\n<br/>\nEven a quick phone call to register opposition could mean a lot. E-<br/>\nmail<br/>\nis said to be less effective, but a quick e-mail could be followed up<br/>\nwith a hard copy via the post. Contacting your own local<br/>\nrepresentatives<br/>\nwould be a good idea, but the two primary contacts in the Education<br/>\nCommittee,  are:<br/>\n<br/>\n(The Honorable) Steven Sanders (chair of the committee)<br/>\nLegislative Office Building 836<br/>\nAlbany, NY 12248<br/>\n518-455-5506<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sanders@...\">sanders@...</a><br/>\n<br/>\nand (The Honorable) Harvey Weisenberg (bill sponsor)<br/>\nLOB 731<br/>\nAlbany, NY 12248<br/>\n518-455-3028<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:weisenh@...\">weisenh@...</a><br/>\n<br/>\n<br/>\n<br/>\n( SNIP)  letter follows:<br/>\n<br/>\nDear Assemblyman Sanders (or Assemblyman Weisenberg):<br/>\n<br/>\nOn behalf of ( SNIP) ( HOMESCHOOL GROUP) , we are<br/>\nwriting to express our opposition to Senate Bill S2060/Assembly Bill<br/>\nA4598, which provides for the imposition of certain procedures and<br/>\nstandards regarding home instruction.  ( SNIP) , founded in 1984, is <br/>\none of the largest and oldest independent support groups for <br/>\nhomeschooling<br/>\nfamilies in NYS.<br/>\n<br/>\nThis flawed legislation would create more problems than it attempts <br/>\nto<br/>\nalleviate.<br/>\n<br/>\nOn its surface, A4598 appears to lessen the reporting burden of<br/>\nhomeschoolers, as compared to the current regulations governing home<br/>\ninstruction found at NYCRR A7100.10; but its poor draftsmanship would<br/>\ncodify unclear mandates of questionable constitutionality.  As a<br/>\nresult, school districts and families would likely be forced to <br/>\nexpend<br/>\nsubstantial resources to determine the new law&#39;s meaning and effects,<br/>\nresources in time and expenditures that neither districts nor parents<br/>\nhave to spare.  While burdensome, the present regulations have been <br/>\nin<br/>\nplace since 1988.  Local school districts and their resident families<br/>\nhave spent decades  establishing manageable practices under the <br/>\npresent<br/>\nsystem.  This legislation undoes all that work without the certainty <br/>\nof<br/>\nimprovement.<br/>\n<br/>\nThere is no widespread support for this proposed legislation.  We <br/>\nknow<br/>\nof over 35 independent local support groups for homeschooling <br/>\nfamilies<br/>\nin NYS; yet, to our knowledge, only one of them has come out in <br/>\nsupport<br/>\nof this bill.  There is [in italics] widespread, statewide opposition<br/>\nto<br/>\nit.  We<br/>\nhave made repeated requests of Senator Kuhl, as the measure&#39;s <br/>\nsponsor,<br/>\nto open a dialogue regarding the advantages and drawbacks of<br/>\nhomeschooling legislation, but we are still waiting for an open<br/>\nexamination of this issue.  A more serious inquiry into the need, if<br/>\nany, for legislation regarding home instruction, is warranted before<br/>\nany such bill is brought to the floor of the legislature for<br/>\nconsideration.<br/>\n<br/>\nIf you are eager to support families in pursuing educational<br/>\nexcellence, we urge you instead to end the imposition of high-stakes<br/>\ntesting on all children in NY.  Homeschooling families know first <br/>\nhand<br/>\nthat a key component of high achievement is the freedom to determine<br/>\nindividually what constitutes a high quality education.  <br/>\nHomeschooling<br/>\nfamilies care deeply about the fundamental freedom of all families to<br/>\nchoose an education for their children consistent with their <br/>\nprinciples<br/>\nand beliefs.  When a wide variety of learning and assessment methods<br/>\nare accepted, then all children, including those who homeschool, will<br/>\nbenefit.<br/>\n<br/>\nWe respectfully request that you oppose S2060/A4598. The inevitable<br/>\nproblems with this bill outweigh the difficulties that still exist <br/>\nwith<br/>\nthe present system of oversight of homeschoolers.  Thank you for your<br/>\nconsideration.  We look forward to learning your response.</div>","specialLinks":[]}],"prevTopicId":73758,"nextTopicId":70338}}