{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"hsmominoz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[Unschooling-dotcom] just a few words","postDate":"1029955487","msgId":41680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIyLjEwNmE2NmVlLjJhOTUzOTlmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":41679,"nextInTime":41681,"topicId":41680,"numMessagesInTopic":0,"msgSnippet":"Hi everyone! I just have a few things to say, then back to my self imposed lurkedom! (I just couldn t resist!) First on Emenim and other musical artists.","messageBody":"<div id=\"ygrps-yiv-854726147\">Hi everyone! I just have a few things to say, then back to my self imposed <br/>\nlurkedom! (I just couldn&#39;t resist!) <br/>\nFirst on Emenim and other musical artists. Choosing to restrict a child&#39;s <br/>\ninterest in music which has content that *you* may find objectionable is of <br/>\ncourse a parental issue. You may have moral or religious issues with the <br/>\nlanguage. But educating yourself on the whys and wherefores would be a good <br/>\nthing. I could go on and on about how Marshal Mathers (Emenim) had a horrible <br/>\nchildhood, raised by a mother with serious issues, married a woman who, long <br/>\nstory short, took advantage, and used her child as a pawn.... I will say that <br/>\nhe writes about what he knows, he has made a market for himself, and is <br/>\nlearning along the way. (His music reflects that learning) He tells a great <br/>\nstory through his music, and if you can get past the language, (there are <br/>\ncensored/clean copies of his music available, you don&#39;t have to buy the <br/>\noriginal version!) and know a little about his life, his music is really deep <br/>\nand moving. All this, and I am not really a big rap fan! &lt;g&gt;<br/>\n<br/>\nOn painting windows, or putting signs up. The town I live in is really weird. <br/>\nIt is the capitol city and we have more than our share of politicians and <br/>\nlawyers. We also have our share of weird/way-out-there religious element too. <br/>\nOne thing that we have way too much of is signs. A man named Fred Phelps <br/>\nlives here with his family/religious community, he is a disbarred <br/>\nlawyer/preacher extrodinare! Our town will have seminars on how to &quot;combat&quot; <br/>\nthe (soon to be held) KKK/arian nation rally on the capital steps, but sits <br/>\nidly by for years as Mr. Phelps preaches hate from the street corner daily. I <br/>\nknow from experience that the one way to draw people away from your cause is <br/>\nto put up signs telling everyone how what they are doing is wrong. So with <br/>\nthat background, I think putting up signs or painting on windows could be <br/>\nvery tacky, and that is just my opinion and not an attempt to make anyone <br/>\nfeel bad. I guess my point is, if you want to educate the educators about <br/>\nunschooling, painting negative and blasting quotes about how bad school is <br/>\nwon&#39;t get the job done. And it just might make you look like some fanatical, <br/>\nkooky, nut. <br/>\n<br/>\nOne last bit... Sandra, I really enjoyed hearing about the conference! I hope <br/>\nothers who went will share too!!! (More! More! Give me More!) I also liked <br/>\nhearing about the video game talk. I think I need a copy of that to share <br/>\nwith certain members of my family. (myself included, as sometimes I slip and <br/>\nwonder what the kids really learn from the PS2!) Jack would be a good kid to <br/>\nshow his skills off. Only being 6, he really amazes me with his ability. He <br/>\nloves to play Spiderman and a role-playing game for kids called Jak and <br/>\nDaxter. I love to sit and watch him play, he is so animated, he gives me blow <br/>\nby blow descriptions of what he has just done. (even though I am sitting <br/>\nright there! &lt;g&gt;) He will even pause the game, jump up, run to me and reenact <br/>\nthe game for me, complete with descriptions that go like this, &quot;Then I jumped <br/>\nup and BOOM! I fell into dark eco and died! then i came back and had to get <br/>\nsome more powercells so I went to the farmer and chased his cows back to the <br/>\nfence and he gave me his cell and did you know you have to slap the cows to <br/>\nget them to go? Did you have to slap your cows to get them to go <br/>\nalong-time-ago-back-when-you-were-little? I bet you didn&#39;t live on the beach <br/>\nwith your cows...&quot; All the time his face is glowing, and you can tell his <br/>\nbrain is going faster then he can get the words out! How do I get a copy of <br/>\nthat tape?!!? &lt;g&gt;<br/>\n~Nancy~back to lurkedom <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":41439,"nextTopicId":41681}}