{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Home-schooling standoff - Fini","postDate":"1056116693","msgId":74983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCMTg4ODE0LjFCMEE4JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDUuMS4wLjE0LjAuMjAwMzA2MTgyMDI1MDcuMDBiZDYxMDBAbWFpbC5keWtlbWEubmV0Pg=="},"prevInTopic":74820,"nextInTopic":0,"prevInTime":74982,"nextInTime":74984,"topicId":74820,"numMessagesInTopic":0,"msgSnippet":"... I heard you. But if you want to be paid attention to it s helpful to be more aware of the environment you re speaking in and the subtext you re ","messageBody":"<div id=\"ygrps-yiv-1472728162\">on 6/18/03 11:25 PM, Heidi Wordhouse-Dykema at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heidi@...\">heidi@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To be fair <br/>\n&gt; though, frankly, you don&#39;t seem to get what *I&#39;m* saying either. (and I<br/>\n&gt; won&#39;t be going on about this anymore after this, &#39;cause if we don&#39;t &#39;hear&#39;<br/>\n&gt; each other now, it&#39;s probably not going to improve anytime soon!)<br/>\n<br/>\n </span></blockquote>I heard you. But if you want to be paid attention to it&#39;s helpful to be more<br/>\naware of the environment you&#39;re speaking in and the subtext you&#39;re<br/>\ncommunicating.<br/>\n<br/>\nIf you want to talk about the aspects of homeschooling this case reminds you<br/>\nof, then the discussion is going to be frustrating for someone who is trying<br/>\nto get across the point that the case has nothing to do with homeschooling.<br/>\n<br/>\nThere are *plenty* of other relevant branching off points to talk about what<br/>\nyou want to talk about. You could even bring the subjects up out of the<br/>\nblue.<br/>\n<br/>\nUsing this case to discuss homeschooling only ties it more firmly in<br/>\npeople&#39;s minds that it is about homeschooling. And it can *only* be about<br/>\nhomeschooling if people make up fantastical scenarios about why what<br/>\nhappened happened that have no basis in what really happened.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Even though I don&#39;t live in MA, somehow what you wrote is already my<br/>\n&gt; understanding of what happened in the Waltham case.  (except for the part<br/>\n&gt; about was/wasn&#39;t the assessment received.  I&#39;d thought it wasn&#39;t sent in<br/>\n&gt; the first place.)<br/>\n<br/>\n </span></blockquote>Originally they refused to submit an ed plan (not an assessment). And I<br/>\nthink they didn&#39;t submit an ed plan until ordered to do so by a judge or<br/>\nsome mediator. Then it gets confusing on what happened. From my<br/>\nunderstanding they were asked many times for the ed plan -- actually many ed<br/>\nplans since the case dragged out over 4 yeras and they have 2 kids -- with a<br/>\nvariety of outcomes: ignoring it, never received the request, town never<br/>\nreceived their ed plan, town rejected the ed plan. (But MA case law says if<br/>\nthe town rejects a plan they need to prove how, not just say, it&#39;s<br/>\ninadequate.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (As a side note, it&#39;s a little unfortunate to think that<br/>\n&gt; a person has to live somewhere to have empathy for or know something about<br/>\n&gt; someone in a bad spot legally.)  (Yes, even if that person put themselves<br/>\n&gt; there.)<br/>\n<br/>\n </span></blockquote>Nothing wrong with having empathy for the Bryants. I hope everyone who is<br/>\nconcerned will join the MA state list<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/MAhomeschoolers/)\">http://groups.yahoo.com/group/MAhomeschoolers/)</a> or visit the website<br/>\nsupporting the Bryants and do what they can to help them.<br/>\n<br/>\nIf all you were expressing was empathy, there wouldn&#39;t be much to argue<br/>\nabout. But you weren&#39;t just expressing empathy. You were using the case to<br/>\ntalk about homeschooling. (Much as the Bryants used homeschooling to &quot;get a<br/>\ndialog going&quot; about the state constitutution.)<br/>\n<br/>\nBut the case can&#39;t be a useful rallying point for homeschooling discussion<br/>\nwithout making up motivations for the Bryants and the state that don&#39;t match<br/>\nreality in order to turn the case into something about homeschooling.<br/>\n<br/>\nThat&#39;s one of the subtext&#39;s I&#39;m talking about. You may have valid general<br/>\npoints but there can&#39;t be a meaningful dialog about those points when you<br/>\nhave to make up the motivations and facts in order for your points to make<br/>\nsense. There are real motivations. There are real facts. And those<br/>\nmotivations and facts can&#39;t be ignored in order to make a point without<br/>\nfrustrating the heck out of someone who&#39;s trying to point out that you&#39;re<br/>\nusing a false foundation to argue your points from.<br/>\n<br/>\nYou&#39;re basing your opinions on what obviously must be true for the case to<br/>\nhave happened. But the obvious isn&#39;t true in MA. Your understanding of how<br/>\nhomeschooling works in MA is wrong so the sensible scenario you&#39;ve created<br/>\nis wrong. And, therefore, your points, when you use the case to support<br/>\nthem, are meaningless.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; While it may cause you to tear out large patches of your beautiful glossy<br/>\n&gt; hair, I still think the family is gutsy in doing what they feel is<br/>\n&gt; right.<br/>\n<br/>\n </span></blockquote>If you&#39;ve been following what I&#39;m saying there&#39;s no logical connection<br/>\nbetween the idea of what is upsetting me and you thinking the Bryants are<br/>\ngutsy. Your sentence says I&#39;m irritated that anyone would think the Bryants<br/>\ngutsy. Where did I say that? It suggests -- it&#39;s one of those subtexts I<br/>\nmentioned above -- that you haven&#39;t understood what I&#39;m saying.<br/>\n<br/>\nHopefully you have understood. Hopefully those were words that just sounded<br/>\ngood cobbled together. And you cobble words together well. But the ideas<br/>\nneed to hang together as well as the words for meaning to come through.<br/>\n<br/>\nSince you&#39;ve used many sentences throughout your posts that don&#39;t hang<br/>\ntogether logically based on what I&#39;m trying to get across, it&#39;s frustrating<br/>\nto respond.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I happen to believe that it is not (or<br/>\n&gt; rather, should not be?) the business of the state (ANY state!) to &#39;assess&#39;<br/>\n&gt; or to require assessment or to take legal guardianship of homeschooling<br/>\n&gt; kids away should there not be state-deemed-suitable &#39;assessment&#39; of a<br/>\n&gt; homeschooled kid&#39;s education, be it in any form, yes, even a few sentences<br/>\n&gt; from the parent on thier ed plan.<br/>\n<br/>\n </span></blockquote>Again, you&#39;re trying to point out how wrong a regulation is and using the<br/>\ncase to discuss that point.<br/>\n<br/>\nBut the regulation to take children away from homeschooling parents for<br/>\nnoncompliance doesn&#39;t exist in MA. We don&#39;t have regulations. We have case<br/>\nlaw. So there isn&#39;t a way to discuss a regulation like that based on the<br/>\nBryant case. (And no, I&#39;m not just word wrangling. Regulations and case law<br/>\nare different.)<br/>\n<br/>\nThe Bryants *forced* the state to examine a situation the state hadn&#39;t<br/>\nexamined. No one had set down in writing what would happen if homeschoolers<br/>\nrefused. When the Bryants refused to comply, the state was backed into a<br/>\ncorner and forced to use *other* regulations that were written for *other*<br/>\nsituations, like child neglect, to apply to a situtation it hadn&#39;t handled<br/>\nbefore. (And had the state followed the letter of those regulations, they<br/>\nwould have taken physical custody of the children too.)<br/>\n<br/>\nOur homeschooling &quot;requirements&quot; are based on case law. There isn&#39;t anything<br/>\ncarved in stone about what we must do and what will happen if we don&#39;t. All<br/>\nwe have is what a judges decided in two cases: Charles and Brunell. It&#39;s<br/>\nbasically a lot of &quot;this seems reasonable&quot; type of stuff. MA homeschoolers<br/>\nare able make the judge&#39;s decisions work with minimal trouble to ourselves.<br/>\n<br/>\nThe Bryants threatened what works by using homeschooling to make arguments<br/>\nabout the state constitution. What they did could have forced the state into<br/>\nmaking state laws about homeschooling. And those laws could easily be not<br/>\nfriendly. Especially to unschoolers which the Bryants claim to be.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If some folks don&#39;t mind submitting a<br/>\n&gt; state-deemed-suitable assessment or plan, then no bother.  If some folks<br/>\n&gt; find that state-deemed-suitable assessments or plans go against their<br/>\n&gt; educational beliefs (or constitutional rights), then I support their right<br/>\n&gt; to challenge such.<br/>\n<br/>\n </span></blockquote>And had easier homeschooling regulations been their goal, that would have<br/>\nbeen fine. But that wasn&#39;t their goal. Their goal was to make the state<br/>\nrealize the state didn&#39;t have a right to create laws beyond the<br/>\nconstitution. Though I assume the Bryants had no intention of harming<br/>\nhomeschooling, or making their lives more difficult, their primary goal was<br/>\nabout the constitution. Which means if faced with a decision between making<br/>\ntheir point and harming homeschooling, they could easily have determined<br/>\ntheir goal was more important.<br/>\n<br/>\nAnd they *did* end up making homeschooling more difficult for themselves.<br/>\nThey could have backed off at many points over the 4 years. But they chose<br/>\nthe route that led to more difficult homeschooling because their goal wasn&#39;t<br/>\neasier homeschooling.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A model of how to handle homeschoolers who challenge educational laws<br/>\n&gt; they believe to be unconstitutional or just plain wrong.  A model of which<br/>\n&gt; educational laws they &#39;should&#39; consider having.<br/>\n<br/>\n </span></blockquote>And this case can&#39;t be used as a model for that. The case is more akin to a<br/>\nsituation where someone was challeging dog regulations in order to make a<br/>\npoint about car regulations. They in essence saw a path to easier car<br/>\nregulations but taking that path meant they might end up making their lives<br/>\n(and perhaps other&#39;s lives) as dog owners more difficult. They chose the<br/>\npath that threatened their relatively easy lives as dog owners. And they<br/>\nlost.<br/>\n<br/>\nHopefully the Bryants choice of path won&#39;t negatively impact the rest of us<br/>\nhomeschoolers.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":50009731,"authorName":"Heidi Wordhouse-Dykema","from":"Heidi Wordhouse-Dykema &lt;heidi@...&gt;","profile":"heidi_wd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Home-schooling standoff - Fini","postDate":"1055993119","msgId":74820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjAuMjAwMzA2MTgyMDI1MDcuMDBiZDYxMDBAbWFpbC5keWtlbWEubmV0Pg=="},"prevInTopic":0,"nextInTopic":74983,"prevInTime":74819,"nextInTime":74821,"topicId":74820,"numMessagesInTopic":0,"msgSnippet":"To make this conversation on one family s struggle with the constitutionalism of homeschooling in MA more palatable to anyone on the unschooling list who","messageBody":"<div id=\"ygrps-yiv-1717363423\">To make this conversation on one family&#39;s struggle with the <br/>\nconstitutionalism of homeschooling in MA more palatable to anyone on the <br/>\nunschooling list who hasn&#39;t been interested to date:  I don&#39;t find anyone <br/>\ninvolved in the case &#39;doable&#39;.  My hubby just got home though, and he is <br/>\neminently doable!  (grin)<br/>\n<br/>\n&lt;Heidi hands Joyce a bag of ice to lower the swelling from banging her head <br/>\non the monitor.)<br/>\n<br/>\nJoyce, I&#39;m sorry if what I&#39;m writing seems dense to you.  To be fair <br/>\nthough, frankly, you don&#39;t seem to get what *I&#39;m* saying either. (and I <br/>\nwon&#39;t be going on about this anymore after this, &#39;cause if we don&#39;t &#39;hear&#39; <br/>\neach other now, it&#39;s probably not going to improve anytime soon!)<br/>\n<br/>\nJoyce said: Waltham&#39;s original position was not that the Bryant children <br/>\nhad to test. It<br/>\n<blockquote><span title=\"ireply\"> &gt;was that the Bryant parents needed to submit an education plan each year.<br/>\n&gt;The Bryants refused. There were legal procedings and the Bryants were<br/>\n&gt;ordered to submit a plan. The Bryants said they did. Waltham said they<br/>\n&gt;didn&#39;t. The Bryants said they did. Waltham said it was inadequate. The whole<br/>\n&gt;story there is a mess and involves whether or not they received<br/>\n&gt;notifications for this and that or not. The information was filtered by the<br/>\n&gt;Bryants so who knows what the truth was.<br/>\n&gt;<br/>\n&gt;The Bryants ended up back in court. They lost again. For whatever reason.<br/>\n&gt;Since they weren&#39;t complying the state ended up taking legal custody of the<br/>\n&gt;children.<br/>\n<br/>\n </span></blockquote>Even though I don&#39;t live in MA, somehow what you wrote is already my <br/>\nunderstanding of what happened in the Waltham case.  (except for the part <br/>\nabout was/wasn&#39;t the assessment received.  I&#39;d thought it wasn&#39;t sent in <br/>\nthe first place.)  (As a side note, it&#39;s a little unfortunate to think that <br/>\na person has to live somewhere to have empathy for or know something about <br/>\nsomeone in a bad spot legally.)  (Yes, even if that person put themselves <br/>\nthere.)<br/>\n<br/>\nWhile it may cause you to tear out large patches of your beautiful glossy <br/>\nhair, I still think the family is gutsy in doing what they feel is <br/>\nright.  (Naive, maybe.  Optimistic, maybe.  Unfortunate in short-term <br/>\noutcome, definitely.)  I understand that you believe adamantly that the <br/>\nissue is a constitutional one, and only educational by chance.  Okay.  I <br/>\ncan see your point.  Unfortunate that the chance landed on educational <br/>\nchoice and it&#39;s relationship to the possible differences between a state <br/>\nand its constitution, but there it is.  It has impact on home education <br/>\nlegalities, even if the main gist is constitutionalism.<br/>\n<br/>\nPart of my whole Unschooling thing is supporting complete freedom in <br/>\neducational pursuits for both my kids and other families.  This can <br/>\nsometimes have legal implications.  I happen to believe that it is not (or <br/>\nrather, should not be?) the business of the state (ANY state!) to &#39;assess&#39; <br/>\nor to require assessment or to take legal guardianship of homeschooling <br/>\nkids away should there not be state-deemed-suitable &#39;assessment&#39; of a <br/>\nhomeschooled kid&#39;s education, be it in any form, yes, even a few sentences <br/>\nfrom the parent on thier ed plan.  That the state required std. testing <br/>\nafter presuming to foist themselves as legal guardians (when the DSS <br/>\nreportedly admits that the kids are loved and well-taken care of) adds only <br/>\ninsult to injury.  If some folks don&#39;t mind submitting a <br/>\nstate-deemed-suitable assessment or plan, then no bother.  If some folks <br/>\nfind that state-deemed-suitable assessments or plans go against their <br/>\neducational beliefs (or constitutional rights), then I support their right <br/>\nto challenge such.  My only hope is that it doesn&#39;t legally adversely <br/>\naffect other homeschoolers in that state or any other state.<br/>\n<br/>\nDo I deify them or put them on a pedestal?  Naw.  Admire them <br/>\nsome?  Sure.  They&#39;ve got fortitude, that&#39;s for sure.  But I admire the <br/>\nactions of lots of folks, some mainstream, some not, mostly obscure folks <br/>\nwho just struggle through life.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Many states<br/>\n&gt; &gt; look at other states as a model.<br/>\n&gt;<br/>\n&gt;A model of what? The state constitution?<br/>\n<br/>\n </span></blockquote>No.  A model of how to handle homeschoolers who challenge educational laws <br/>\nthey believe to be unconstitutional or just plain wrong.  A model of which <br/>\neducational laws they &#39;should&#39; consider having.<br/>\n<br/>\nI&#39;m sorry it all upsets you so.<br/>\nFini.<br/>\nHeidiWD<br/>\n<br/>\n<br/>\n&quot;Self-reliance is the antidote to institutional stupidity.&quot; JTGatto, <br/>\nMonarch Notes guide to One Flew Over the Cuckoo&#39;s Nest.</div>","specialLinks":[]}],"prevTopicId":74982,"nextTopicId":74945}}