{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":392629073,"authorName":"Natarsha Marr","from":"Natarsha Marr &lt;yeshi_khadro@...&gt;","profile":"unschooling_permission2enjoylife","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Defending families and the partnership of parents","postDate":"1300464104","msgId":60281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2MTE2OS42NzAyNi5xbUB3ZWI1NzUwNy5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":60280,"nextInTime":60282,"topicId":60281,"numMessagesInTopic":0,"msgSnippet":"Defending families and the partnership of parents -=-I m constantly stepping in against the reward-and-punishment stuff and general disdain [the wife/mom]","messageBody":"<div id=\"ygrps-yiv-2113174151\">&quot;Defending families and the partnership of parents&quot;<br/>\n<br/>\n-=-I&#39;m constantly stepping in against the reward-and-punishment stuff and <br/>\ngeneral disdain [the wife/mom] treats them with -=-<br/>\n<br/>\nUnfortunately I have been there too! It was unfortunate as my partner felt as <br/>\nthough he was always wrong and couldn&#39;t do it &#39;right&#39; to the point where he <br/>\nwould abandon the situation and nothing would be resolved, let alone in a <br/>\n&#39;joyful&#39; manner! In trying to respect the kids, I definitely wasn&#39;t respecting <br/>\nhim. I had to slow down enough to really see what it washe needed and begin to <br/>\nrespect his needs just as much as the kids. <br/>\n<br/>\n<br/>\n-=-&quot;I need to clarify on what Dayna has said. I don&#39;t think she was suggesting <br/>\ngo &#39;against&#39; your wife, and even less so &#39;constantly&#39; . She just meant that <br/>\nwe&#39;re better off than most in that one of us has taken up these ideas in <br/>\nalternative learning, perceptions of children on board, but as you say, she was <br/>\nclear you go for a better, loving relationship between the parents first. &quot;-=-<br/>\n<br/>\nThis brings me to the following note. At a conference of Dayna&#39;s I attended last <br/>\nyear, this statement came up, it was followed with discussions about respecting <br/>\nthat the children will have different relationships with different people, <br/>\nincluding their parents (as with any family). I had to really remind myself of <br/>\nthis, and while trying to find solutions for &#39;everybody&#39; in a respectful way I <br/>\nalso had to accept that their relationship was going to be what it was and I <br/>\ncouldn&#39;t control that. I had to learn to let go of this twice, the first time <br/>\nwith my ex-husband and his relationship with our daughter and more recently <br/>\nagain with my partner and his relationship with my now daughter&#39;s&#39;. =)Also the <br/>\n&#39;united front&#39; issue of parenting: that it isn&#39;t natural &#39;in the real <br/>\nworld&#39; that everyone agrees all of the time.<br/>\n<br/>\nI posted a few months ago as I was having difficulties with my <br/>\nex-husband accepting &#39;unschooling&#39;. We discussed things and all seemed to be OK, <br/>\nthen the cracks started appearing again. Long story short, his discomfort with <br/>\nunschooling is starting to effect his time with our daughter. After many months <br/>\nof providing him information and hoping he will feel OK, this did not happen and <br/>\nleft me with the only option I could see presently: I let him know I would <br/>\n&#39;teach her math&#39; (Math-U-See units) and &#39;do reading lessons&#39; daily (she is 8 and <br/>\nhe is worried as she isn&#39;t at the same level as other children her age). He is <br/>\nnot in a place yet (if ever at all) that he can feel comfortable about our <br/>\nnon-lesson schooling, regardless of all other things she is learning. Out of <br/>\nrespect for his relationship with our daughter, I am about to start lessons in <br/>\nthese two &#39;subjects&#39; so that their relationship survives. Knowing (as best I <br/>\ncan) that this will take the pressure off their relationship (hopefully) I have <br/>\naccepted that I will not be a total unschooler, for now. I have discussed these <br/>\nlessons with Pema, letting her know that her father is concerned and that he is <br/>\nhaving trouble understanding our unschooling life. She just says &#39;OK, I&#39;ll do <br/>\nthe lessons.&#39; In a very nonchalant manner (her tone may change when our <br/>\ncurriculum arrives).  =) All I can do in that case is try and carve out some <br/>\n&#39;progress&#39; to &#39;report&#39; in the most sparkly way possible or get extra creative on <br/>\naccomplishing daily lessons!<br/>\n<br/>\nSo, yes. With a different slant, families are not worth being torn apart in the <br/>\nname of &#39;unschooling&#39;. I sincerely hope that our changes will have a positive <br/>\naffect on my ex-husband as it would sincerely break my heart to have to live our <br/>\nlives separated by school 35 hours a week + the rest that goes with it. <br/>\n<br/>\n<br/>\n-=-It&#39;s more important for the children that their parents love and respect each <br/>\nother than where and how they learn to read.-=-<br/>\n<br/>\nI always feel sad when I hear this. Perhaps because it would mean I would have <br/>\nto let go of more than I really truly want to, more than I would want to endure. <br/>\nA voice in me cries out that I would want my partner to respect what being with <br/>\nmy kids really means to me, I feel that their love for me and my <br/>\nhappiness should be enough to trust me in unschooling. (Unfortunately though <br/>\nhaving an ex-husband, I am no longer in such standing with him!). But with my <br/>\npartner this is how I feel. If you were to compromise something that was such a <br/>\nhuge part of you, something that resonated with your being on such a truthful <br/>\nand profound level, I wonder if I would be able to withstand any resentment that <br/>\nmost likely would arise... I certainly hope that I never have to find out. <br/>\n<br/>\nKindest Regards<br/>\nNatarsha<br/>\nThank you all so very, very much for all of your time, patience and blunt <br/>\nhonesty!<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":60253,"nextTopicId":60275}}