{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":71,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257271912","msgId":48351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0NTcwMTFCLTA2MEUtNEYzRi1COTIyLUM4QTNFRTM2NkQ2RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDUzODA3Ny41NDQ5Ny5xbUB3ZWIxMTA0MDgubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPiAgPEY5Q0EwMzI3LTFBMjYtNDVCRS04Mjg5LUQxMUU0OTk1MEEwNEBTYW5kcmFkb2RkLmNvbT4gIDw3OTc3MDU5NDA5MTEwMjExMzdzNzUxYzk0YjVpNmZkNzkzOTQ1MGExNWYwYkBtYWlsLmdtYWlsLmNvbT4gIDxFRkZDNDRBOS0xMUE4LTQxNEQtQjNBNy1FRjRGMEM2NTdDMzRAU2FuZHJhZG9kZC5jb20+IDw3M2M3NmMwYTA5MTEwMjE0Mzh0MWEzNDhjZjVyYTRmNjkyNGExYjhhMDUwY0BtYWlsLmdtYWlsLmNvbT4gPDUzODA3Ny41NDQ5Ny5xbUB3ZWIxMTA0MDgubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":48349,"nextInTopic":48353,"prevInTime":48350,"nextInTime":48352,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=-Which goes back to my own childhood and issues around food and not learning about, and not being able to listen to my own body s cues because my own parents","messageBody":"<div id=\"ygrps-yiv-1738107924\">-=-Which goes back to my own childhood and issues around food and not  <br/>\nlearning about, and not being able to listen to my own body&#39;s cues  <br/>\nbecause my own parents were quite sure they new what was best and  <br/>\nhealthiest for my body.=-<br/>\n<br/>\nI remember the school cafeteria and kids being made to eat canned  <br/>\nspinach, and to drink all their milk, and to eat stewed plums and  <br/>\n(because we were in New Mexico) enchiladas, which I thought were  <br/>\nawesome, but any kids who were squeamish about ground beef or didn&#39;t  <br/>\ndo well with cheese or oil would&#39;ve been made ill.<br/>\n<br/>\nSomeone was sure because a book said so that milk was crucial for  <br/>\nchildren and there was no thought that some would gag and some would  <br/>\nget the runs later, or that the stress of being pressed to choke down  <br/>\nscary food or else they couldn&#39;t go out and play was NOT good for  <br/>\npeople.<br/>\n<br/>\nIt&#39;s only fairly recently that people stopped telling pregnant women  <br/>\nthat they had to drink milk so they could make milk.  How nonsensical  <br/>\nis that!?  But because doctors and nurses were saying it, people took  <br/>\nit as scientific fact.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How long did it take your kids to eat &quot;real&quot; food?","postDate":"1257269453","msgId":48349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERFMUMxNjE0LTRDMDMtNEJFNi1BNzY5LTQzOUNDREE3NzRCREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhjb2JjbiticmVrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhjb2JjbiticmVrQGVHcm91cHMuY29tPg=="},"prevInTopic":48348,"nextInTopic":48351,"prevInTime":48348,"nextInTime":48350,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=- Thanks, though, for making me realize that someone I really looked up to prior to this is actually only looking for apostles to nod on cue.-=- While we re","messageBody":"<div id=\"ygrps-yiv-774062947\">-=- Thanks, though, for making me realize that<br/>\n  someone I really looked up to prior to this is actually only looking  <br/>\nfor<br/>\n  apostles to nod on cue.-=-<br/>\n<br/>\nWhile we&#39;re being analytical anyway, the first part is manipulative,  <br/>\nand it&#39;s the kind of thinking that screws parents up in the area of  <br/>\nseeing their kids clearly and lovingly.<br/>\n<br/>\nIf a parent says &quot;I really loved you (to the child) until you (touched  <br/>\nyour weenie/told a fib/were gay).&quot;  It&#39;s &quot;I loved the image I had of  <br/>\nyou but now you&#39;ve strayed from it.&quot;<br/>\n<br/>\nAnd that person wasn&#39;t even my mom, and I didn&#39;t even fib, touch my  <br/>\nweenie or be gay.<br/>\n<br/>\nSo if I&#39;m only worthy of &quot;being looked up to&quot; when I fulfill the  <br/>\nfantasy image each individual reader has of me, then there&#39;s no value  <br/>\nin integrity or honesty.   But each person who decides what and whom  <br/>\nto respect (look up to) or to consider sensible is deciding on his or  <br/>\nher own.  It&#39;s a decision we each make.<br/>\n<br/>\nThere are people in the world I think are awesome, and some I think  <br/>\nare kooks.   My admiration of a person is non-transferable, though.   <br/>\nOthers will admire or not based on their own needs and values and  <br/>\nindividual principles.<br/>\n<br/>\nSo that&#39;s about the first part.   It says more about the one who was  <br/>\nlooking up than the one who was looked up to, and it was an attempt  <br/>\n(not conscious, but it&#39;s good to see what we&#39;re doing unconsciously,  <br/>\nout of habit, too) to get me to back down, to apologize, to change in  <br/>\nhopes that one person would continue to &quot;really look up to me.&quot;<br/>\n<br/>\nSo the second part:<br/>\nWhat on earth would I do with apostles nodding on cue!??  Seriously.   <br/>\nWhat good does it do Keith or Marty or Kirby or Holly for people to  <br/>\n&quot;nod&quot; at some great distance where I can&#39;t see them?  What good could  <br/>\nit possibly do me!?    I&#39;m \tquite past the stage of finding my worth  <br/>\nin the acceptance of the other teens.   Been there.  Lived through  <br/>\nit.    And in my 20&#39;s and 30&#39;s, it was kinda nice to have people name  <br/>\nme as someone who had helped organize an event, or someone who worked  <br/>\nwell with others on the job.  But even then I was starting to see that  <br/>\nthose were flashes in the pan of life, and not what made me reliable  <br/>\nor &quot;nice.&quot;<br/>\n<br/>\nIf everyone on this list decided that enough unschooling words had  <br/>\nflowed and they could go and just live their unschooling lives, and if  <br/>\nevery week ten or twelve people dropped off, instead of joined, I  <br/>\nwouldn&#39;t cry myself to sleep even ONCE!  If I came in one day and I  <br/>\nwas the only one here, I&#39;d just think &quot;Cool!  Another project  <br/>\nfinished.&quot;   I&#39;d delete the list and go collect seeds in the yard, or  <br/>\ngo to a movie with Marty or bake a cake or something.  I really do  <br/>\nhave a life.  I had a big life before I had children, and I&#39;m sure  <br/>\nI&#39;ll have a rich, full life when they&#39;ve all moved away.  I had  great  <br/>\nunschooling discussions on bulletin boards online when I first got a  <br/>\n*Prodigy e-mail account, and I&#39;ll probably keep up with my friends and  <br/>\nkids online in whatever way is provided in ten or twenty years from  <br/>\nnow.  No one has ever been court-ordered to go on line and discuss  <br/>\nunschooling.  Each person made a choice to join this list and makes a  <br/>\nchoice to read the posts or not.  Each person who writes a post has  <br/>\nother choices right then:  Edit or not?  Send or not?  Follow up with  <br/>\na &quot;Sorry; what was I thinking!?&quot; or not?<br/>\n<br/>\nLife is about making choices.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How long did it take your kids to eat &quot;real&quot; food?","postDate":"1257260212","msgId":48346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjcGdiayszMXA4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwNTA1ODU0NC4zNzExMzExMjU3MjAyNzg1MzMwLkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+"},"prevInTopic":48345,"nextInTopic":48348,"prevInTime":48345,"nextInTime":48347,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"Have you read Beyond Consequences, Logic and Control by Heather Forbes. She also has a web site and a yahoo list.  Might be helpful. Approaches these kinds of","messageBody":"<div id=\"ygrps-yiv-1872152075\">Have you read Beyond Consequences, Logic and Control by Heather Forbes.<br/>\nShe also has a web site and a yahoo list.  Might be helpful. Approaches these kinds of issues from an attachment view point.   <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://search.barnesandnoble.com/booksearch/isbnInquiry.asp?r=1&ISBN=9780977704002&ourl=Beyond-Consequences-Logic-and-Control%2FHeather-T-Forbes&cm_mmc=yahoossp-_-plp-_-books2-_-Beyond-Consequences-Logic-and-Control-9780977704002\">http://search.barnesandnoble.com/booksearch/isbnInquiry.asp?r=1&ISBN=9780977704002&ourl=Beyond-Consequences-Logic-and-Control%2FHeather-T-Forbes&cm_mmc=yahoossp-_-plp-_-books2-_-Beyond-Consequences-Logic-and-Control-9780977704002</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, tiffermom@... wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I have 4 boys by birth.Â  They have always been allowed to eat whenever and whatever they want.Â  Food have not been an issue in our house.Â  Now that being said we adopted a little girl at the age of 8. She has suffered starvation and food restrictions.Â  Since she has been with us (two years)Â she has doubled her weight.Â  She is now 5&#39;2&quot; and weighs 170lbs.Â  I feel like I am hurting her by allowing her free reign over her intake.Â  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; She is very sneaky with food.Â  She takes food or drinks from other people.Â Example: We went to the movies withÂ their Nana who bought drinks andÂ sweets and popcorn for everyone.Â  I looked overÂ and saw her drinking from her Nana&#39;s cup several times. ( I did not acknowledge this to her)Â Â Â If I get them something to share she gets extremely upset.Â Example: The other day we were out longer then I expected.Â  I only had enough money to buy 2 sub sandwiches from Subway.Â  There were 4 of us.Â  I offered this choice to everyone and they all agreed.Â  But then once inside when she really realized she was sharing ( I explained this in the car)Â she fell to pieces.Â  She refused to make any choices.Â  So I made the choices taking into consideration her likes and by the time we were in the car she was in tears.Â  I was not mean to her and I stayed calm.Â  She did eat herÂ half ofÂ the sandwich.Â  She has to control food for others too she will yell at our 5 year old for eating chips in the morning, I have always allowed chips in the morning.Â Â Â  We do not limit the kids candy after HalloweenÂ after a few days I have always put their left over candy into one bowl and that works for everyone except for her.Â  She will get upset so last year I kept her candy separate and combined the others and she ate theirs till it was gone before going to hers.Â  This created a situation where she had candy and no one else did.Â  She likes to hold it over their heads.Â Â This is the same for things like cereal too.Â  Everyone will choose a cereal and she will pick something noÂ one else likes and then will not even open it till all the otherÂ cereal is gone.Â  I have thoughts of only letting her eatÂ her choice but I think that is mean too.Â  I would really like to defuse this situations.Â  I am at a loss for what to do.Â  I know that she is picking up negative attitude from me in this regard and that I think isÂ due to the fact that IÂ feel I have to protect the boys fare share.Â  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; My thinking was that given every opportunity to control her own intake some of these behaviors would subside.Â  The major improvement I have seen is she no longer eats till she throws up.Â Â  I would really like to hear what you all observe about this.Â  Perhaps I need an attitude adjustment or maybe this will take more time that I thought.Â  Has anyone else dealt with this type of behavior?Â  I do not want her to grow upÂ having food issues, and I especially do not want to beÂ a person in her life to addÂ or create food issues.Â  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Tiffani <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ----- Original Message ----- <br/>\n&gt; From: &quot;Sandra Dodd&quot; &lt;Sandra@...&gt; <br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n&gt; Sent: Monday, November 2, 2009 1:15:41 PM GMT -08:00 US/Canada Pacific <br/>\n&gt; Subject: Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot; Â food? <br/>\n&gt; <br/>\n&gt; Â  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -=-How long did it take your kids to eat &quot;real&quot; food?-=- <br/>\n&gt; <br/>\n&gt; Thinking of some foods as &quot;real&quot; and others as any form of unreal is <br/>\n&gt; going to be as much a problem as dividing the world into fun and <br/>\n&gt; learning, as though they were separate things. <br/>\n&gt; <br/>\n&gt; A point like that shouldn&#39;t crush the feelings of anyone old enough to <br/>\n&gt; be a mother, or anyone bright enough to consider unschooling. A <br/>\n&gt; point like that can, and will, and does regularly help someone make <br/>\n&gt; another level toward &quot;beating the game&quot; of deschooling. It&#39;s not <br/>\n&gt; easy for people to recover from ten or twenty years of schooling, but <br/>\n&gt; people do it. They don&#39;t do it from being supported to stay where <br/>\n&gt; they are and be satisfied with muddly thinking and negativity, though. <br/>\n&gt; <br/>\n&gt; My children ate real food when they started nursing. They ate real <br/>\n&gt; food when they tasted mashed foods off the ends of people&#39;s fingers, <br/>\n&gt; or strained fruit. They ate real food when they tasted other people&#39;s <br/>\n&gt; food when they were toddlers but weren&#39;t forced to taste it, nor <br/>\n&gt; pressed to finish it. They have always eaten real food, their whole <br/>\n&gt; lives. <br/>\n&gt; <br/>\n&gt; Stories of hundreds of kids are here and at links from this: <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a> <br/>\n&gt; <br/>\n&gt; Sandra <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":311075098,"authorName":"Mandy Ray-Jones","from":"Mandy Ray-Jones &lt;shebrakes4rainbows@...&gt;","profile":"shebrakes4rainbows","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How long did it take your kids to eat &quot;real&quot; \tfood?","postDate":"1257259251","msgId":48348,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczYzc2YzBhMDkxMTAzMDY0MGo2NzFjZTM1Nm5hMGFjNjM0MzU2OGE4YjdmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQxNGYzNzhjMDkxMTAzMDQ0MmsxZWZhYjA2Ym4xMDBkN2M3MWI0ZmI1ZGE2QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDIwNTA1ODU0NC4zNzExMzExMjU3MjAyNzg1MzMwLkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+CSA8aGNvODg0KzY5M29AZUdyb3Vwcy5jb20+CSA8NDE0ZjM3OGMwOTExMDMwNDQyazFlZmFiMDZibjEwMGQ3YzcxYjRmYjVkYTZAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":48346,"nextInTopic":48349,"prevInTime":48347,"nextInTime":48349,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"Thank you for these ideas and thoughts.  I agree that I could start making our eating choices more of a group effort.  I certainly love the idea of making","messageBody":"<div id=\"ygrps-yiv-1411726982\">Thank you for these ideas and thoughts.  I agree that I could start making<br/>\nour eating choices more of a group effort.  I certainly love the idea of<br/>\nmaking reading the ingredients in order to to pick the healthiest<br/>\ningredients for our bodies with the children is a great idea.  Trips to the<br/>\nstore do always include their choices but letting them help with the meal<br/>\nplanning and making a grocery list would be lots of fun and a great tool for<br/>\nthem.  Lately I&#39;ve been learning about safe alternative sweeteners and that<br/>\nis certainly something they can help me with... taste tests and<br/>\nexperimenting is a fun idea!  My son loves to make charts and that would be<br/>\na fun way to use charts.  I have found myself making statements that are<br/>\nsimply not true and are scare tactics and I absolutely want to abolish that<br/>\nbehavior.  I&#39;ve gotten better but I need improvement.  Hopefully I&#39;ve not<br/>\nruined them for life!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Nov 3, 2009 at 6:42 AM, kim meltzer &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kimcronin.meltzer@...\">kimcronin.meltzer@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I&#39;ve read some attachment theory on adoption. Some of the new families<br/>\n&gt; would work together to nurture the big children as if they were babies.<br/>\n&gt; Holding like a new born, feeding with a bottle, and cuddling. I read about<br/>\n&gt; 8-12 year olds being nurtured with bottles, and the parent and child worked<br/>\n&gt; up to the intimacy over time. Perhaps the parent would sit near the child<br/>\n&gt; while eating, and then start with an arm draped over child. As the duo<br/>\n&gt; worked up trust and started to bond, the parent would eventually sit on the<br/>\n&gt; couch with the child cuddling and feeding with a bottle. Doing this has<br/>\n&gt; led to some amazing instances of healing for the child.<br/>\n&gt;<br/>\n&gt; Often times, babies who had been put up for adoption were not nurtured at<br/>\n&gt; all with affection and touch, and it is really important to help the child<br/>\n&gt; form attachment bonds.<br/>\n&gt;<br/>\n&gt; Read this link<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.attachmentparenting.org/support/articles/artadoption.php\">http://www.attachmentparenting.org/support/articles/artadoption.php</a><br/>\n&gt;<br/>\n&gt; I&#39;ve read about great recoveries...I wish you good wishes, and you have<br/>\n&gt; done<br/>\n&gt; a wonderful thing to give this child a home. I wish I could find that<br/>\n&gt; article that I read about the older children and bottles---it was<br/>\n&gt; fascinating and the website had all kinds of other helpful articles and<br/>\n&gt; advice.<br/>\n&gt;<br/>\n&gt; Kim<br/>\n&gt; Baltimore<br/>\n&gt;<br/>\n&gt; On Mon, Nov 2, 2009 at 10:32 PM, mizelenius &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mizelenius@...\">mizelenius@...</a>&lt;mizelenius%40gmail.com&gt;&gt;<br/>\n&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> &lt;AlwaysLearning%40yahoogroups.com&gt;&lt;AlwaysLearning%<br/>\n&gt; 40yahoogroups.com&gt;,<br/>\n&gt; &gt; tiffermom@... wrote:<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; I have 4 boys by birth.Â They have always been allowed to eat whenever<br/>\n&gt; &gt; and whatever they want.Â Food have not been an issue in our house.Â Now<br/>\n&gt; &gt; that being said we adopted a little girl at the age of 8. She has<br/>\n&gt; suffered<br/>\n&gt; &gt; starvation and food restrictions.Â Since she has been with us (two<br/>\n&gt; &gt; years)Â she has doubled her weight.Â She is now 5&#39;2&quot; and weighs 170lbs.Â<br/>\n&gt; I<br/>\n&gt; &gt; feel like I am hurting her by allowing her free reign over her intake.Â<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; My take when it comes to this type of thing is that it isn&#39;t about food--<br/>\n&gt; &gt; it is about &quot;enough.&quot; It is about not having had enough in her life . .<br/>\n&gt; .in<br/>\n&gt; &gt; her case, it sounds like she had far from enough of even the most basic<br/>\n&gt; of<br/>\n&gt; &gt; needs. She suffered for 6 critical years of her development, and has only<br/>\n&gt; &gt; been with you two-- not even half the time of what she endured.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I would say, continue not focusing on food, her weight, etc. and instead<br/>\n&gt; &gt; remember that she is still going through and testing that &quot;trust vs.<br/>\n&gt; &gt; mistrust stage&quot; (according to Erikson, the very first conflict we deal<br/>\n&gt; with<br/>\n&gt; &gt; in life!) because her needs have not been met for so long. Anything you<br/>\n&gt; do<br/>\n&gt; &gt; in terms of restricting food is only going to set her back-- she will<br/>\n&gt; again<br/>\n&gt; &gt; fear that she will not get enough.<br/>\n&gt; &gt;<br/>\n&gt; &gt; -Elena<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMandy Ray-Jones<br/>\nArtsy Mamas Executive Director and Founder<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://artsymamas.org/\">http://artsymamas.org/</a><br/>\nChild of God, Supermom, Wife, Aspiring Natural Nutritionist, Truth Seeker,<br/>\nLover of Life, Friend, and Geeky Blogger<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bonafidemama.com/\">http://www.bonafidemama.com/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;\tfood?","postDate":"1257256470","msgId":48340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENGREYyNkY2LUVFMDktNDhEMS04OUM4LTRCRjhDNTYzQUNEQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDczYzc2YzBhMDkxMTAyMTc0MG0zMTVkMTY5Nm4yZmY1MTM0Y2M3NTFkNDFkQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPiA8RjlDQTAzMjctMUEyNi00NUJFLTgyODktRDExRTQ5OTUwQTA0QFNhbmRyYWRvZGQuY29tPiA8Nzk3NzA1OTQwOTExMDIxMTM3czc1MWM5NGI1aTZmZDc5Mzk0NTBhMTVmMGJAbWFpbC5nbWFpbC5jb20+IDxFRkZDNDRBOS0xMUE4LTQxNEQtQjNBNy1FRjRGMEM2NTdDMzRAU2FuZHJhZG9kZC5jb20+IDw3M2M3NmMwYTA5MTEwMjE0Mzh0MWEzNDhjZjVyYTRmNjkyNGExYjhhMDUwY0BtYWlsLmdtYWlsLmNvbT4gPEVEODI2ODU3LTIxRjgtNDI1NS05N0NGLUY4NzlFRTE0RjRCMkBTYW5kcmFkb2RkLmNvbT4gPDczYzc2YzBhMDkxMTAyMTc0MG0zMTVkMTY5Nm4yZmY1MTM0Y2M3NTFkNDFkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48338,"nextInTopic":48345,"prevInTime":48339,"nextInTime":48341,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"... I worked with a woman with a 20ish yo son who was diabetic and self- destructive about it. When allowed to he made all sorts of deadly choices. He also had","messageBody":"<div id=\"ygrps-yiv-1519141138\">On Nov 2, 2009, at 8:40 PM, Mandy Ray-Jones wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We use low glycemic sweeteners in our home. I feel that<br/>\n&gt; it&#39;s my job to keep him healthy and for him to not end up in a  <br/>\n&gt; diabetic<br/>\n&gt; coma.<br/>\n<br/>\n </span></blockquote>I worked with a woman with a 20ish yo son who was diabetic and self- <br/>\ndestructive about it. When allowed to he made all sorts of deadly  <br/>\nchoices. He also had a mother who saw her role as the keeper of his  <br/>\nhealth. The connection between the two is pretty obvious! He wasn&#39;t  <br/>\nfighting health. He was fighting for the freedom to decide. But since  <br/>\nhis mom had limited his choices to her choices and bad choices, his  <br/>\nneed to own his decisions made the bad choices the only other choice  <br/>\nhe could make for himself.<br/>\n<br/>\nMoms have helped their 3 yos with strategies on how to handle  <br/>\nallergies. It can become a natural part of eating to say &quot;Let&#39;s check  <br/>\nthe ingredients to see if there are peanuts in this,&quot; and then  <br/>\nhelping a child acquire something that&#39;s as good or even better if it  <br/>\ndoes have peanuts. The more information kids gather, the more they  <br/>\nget a feel for what foods are typically safe and which need to be  <br/>\nchecked.<br/>\n<br/>\nThe problem in these discussions is that controllers seem to limit  <br/>\nthemselves to two choices: control or total child anarchy with the  <br/>\npowerless parent watching from the background wringing her hands.  <br/>\nThere *are* more choices. Just because the suggestion is to give kids  <br/>\nchoices it doesn&#39;t mean load the house up with snack foods! It means  <br/>\nwriting down on the shopping list what the kids would like you to buy  <br/>\nfor them.  It means adopting the attitude of an adventurer about  <br/>\ntrying different foods. It means helping them decide for themselves  <br/>\nwhat they like and don&#39;t like -- without Mom loading the experience  <br/>\nwith messages about the choice she thinks is right.<br/>\n<br/>\nIf the kids want to try Oreos, say yes. You could buy several  <br/>\ndifferent brands including organice and taste test. You could look at  <br/>\nthe ingredients in an investigative way rather than a &quot;look how much  <br/>\njunk is in this&quot; way. I read ingredients in the store because they  <br/>\nare important to *my* choices. When comparing two items for myself, I  <br/>\nlook for the fewest &quot;unpronounceables.&quot; The attitude *for my choices*  <br/>\nhas always been &quot;Why choose something with all those chemicals when  <br/>\nyou don&#39;t have to?&quot;<br/>\n<br/>\nSometimes the answer is because there isn&#39;t something else like it.  <br/>\nSometimes the answer is, let&#39;s try it and see.  I do it because I  <br/>\nthink it&#39;s practical and sensible. There&#39;s no fear involved.<br/>\n<br/>\nBecause I didn&#39;t make my daughter check the ingredients in her  <br/>\nchoices, because it was a natural part of shopping and seemed to make  <br/>\nsense to her, she has often checked the ingredients and tended to  <br/>\navoid chemicals when there were options. But she also doesn&#39;t feel  <br/>\nguilty if she does choose something with an ingredient list  <br/>\npractically too large for the package ;-)<br/>\n<blockquote><span title=\"ireply\"> &gt; I meant that in my home as long as they are in my home they won&#39;t  <br/>\n&gt; be eating<br/>\n&gt; it simply because it&#39;s not here.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>&quot;I meant that in my home as long as she&#39;s in my home, my wife won&#39;t  <br/>\nbe reading bodice busters because they simply aren&#39;t there.&quot;<br/>\n<br/>\n&quot;I meant that in my home as long as she&#39;s in my home, my wife won&#39;t  <br/>\nbe watching secular TV because it simply isn&#39;t there.&quot;<br/>\n<br/>\nDoes that feel like a loving partnership? No matter how convinced  <br/>\nyour husband is that those things are damaging, no matter how loving  <br/>\nhe feels in protecting you from them, controlling them for someone  <br/>\nelse doesn&#39;t feel like love. It feels like &quot;I don&#39;t care what you  <br/>\nwant. What I want for you is more important.&quot; &quot;I don&#39;t trust that  <br/>\nyou&#39;re strong enough to handle the world so I need to limit you to  <br/>\nwhat  I think you&#39;re capable of handling.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s true that I can&#39;t control what<br/>\n&gt; happens when they are out of my sight but it will be a while until  <br/>\n&gt; I need to<br/>\n&gt; contend with that.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Rather than being let loose into the world with someone&#39;s checklist  <br/>\nof healthy eating, wouldn&#39;t knowing how to make choices that are  <br/>\nimportant to them be more helpful? Isn&#39;t exploring freely to discover  <br/>\nwhat they like and what they don&#39;t like a more useful life skill than  <br/>\nabsorbing your beliefs about what&#39;s good for them?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; which happens organically for our family since we just don&#39;t keep  <br/>\n&gt; that stuff<br/>\n&gt; around the house. If we are out and about we might have a little.  <br/>\n&gt; As long<br/>\n&gt; as we don&#39;t make a big deal out of it, it&#39;s really a nonissue.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Be honest in your thoughts and thinking will be clearer. *You* don&#39;t  <br/>\nkeep that stuff around the house, not &quot;we&quot;. Are you a  monolithic  <br/>\nbeing so that when one person has a little, you all have a little?  <br/>\nYour kids are individuals. You&#39;re an individual. If all of you are  <br/>\nchoosing a sweet when out of the house, then your attitude has turned  <br/>\nwhat could be a food to choose or not choose based on what someone  <br/>\nfeels like into a desired treat that needs taken advantage of because  <br/>\nit&#39;s available right now. (That&#39;s not a bad or good thing, but  <br/>\nsomething to be aware of.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Just maybe a little bargaining and a<br/>\n&gt; reminder that we want to stay healthy with our blood sugar and  <br/>\n&gt; ALWAYS a safe<br/>\n&gt; alternative.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>What if your husband were convinced that secular novels where the  <br/>\ntools of the devil? What if he might let you read a short story  <br/>\noutside the house under his supervision? What if when you went into  <br/>\nthe book store, he steered you toward the safe alternatives: the  <br/>\nChristian versions of the genres you wanted to read?<br/>\n<br/>\nAt one time maps were marked with &quot;Here there be dragons.&quot; (Or it  <br/>\nmakes a good story, anyway ;-) It kept most people in line and &quot;safe&quot;  <br/>\nto believe that. But some set off on their own and found there  <br/>\nweren&#39;t dragons. And it&#39;s doubtful that they&#39;d think kind thoughts of  <br/>\nthose who wrote &quot;Here there be dragons.&quot; Controlling ignoramuses  <br/>\nwould be more like it ;-)<br/>\n<br/>\nYour kids *will* meet plenty of seemly perfectly healthy kids who are  <br/>\neating what you consider crap. What will your kids conclude from  <br/>\nthat? That maybe mom isn&#39;t the expert that she thinks she is? Or  <br/>\nmaybe that their own judgement is faulty and that experts have it all  <br/>\nsorted out so it&#39;s just easier to listen to the experts than to think  <br/>\nabout things? (Kids in school often learn this lesson well!) Or  <br/>\nthey&#39;ll feel guilty when they find they like some &quot;crap&quot; food the  <br/>\nkids give them? Or they&#39;ll feel the need to pass on the right way to  <br/>\neat because obviously the kids&#39; parents are clueless and don&#39;t care?  <br/>\n(Some kids have been told by fundamentalist kids that they&#39;re going  <br/>\nto hell for liking Harry Potter.)<br/>\n<br/>\nThat all seems extreme, but the extremes tend to illuminate the  <br/>\nfeelings that rumble beneath the surface. When the world is divided  <br/>\nbetween good food and crap food, it&#39;s hard to avoid feeling some  <br/>\nguilt about eating crap! When it&#39;s all food and kids can decide  <br/>\nwhat&#39;s right for them right now, then make  choices based on what  <br/>\ntheir body needs, not on what they&#39;ve memorized that some expert  <br/>\ndecided their body needs.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":255246581,"authorName":"kim meltzer","from":"kim meltzer &lt;kimcronin.meltzer@...&gt;","profile":"kimcroninmeltzer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How long did it take your kids to eat &quot;real&quot; \tfood?","postDate":"1257252145","msgId":48345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxNGYzNzhjMDkxMTAzMDQ0MmsxZWZhYjA2Ym4xMDBkN2M3MWI0ZmI1ZGE2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhjbzg4NCs2OTNvQGVHcm91cHMuY29tPg==","referencesHeader":"PDIwNTA1ODU0NC4zNzExMzExMjU3MjAyNzg1MzMwLkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+CSA8aGNvODg0KzY5M29AZUdyb3Vwcy5jb20+"},"prevInTopic":48340,"nextInTopic":48346,"prevInTime":48344,"nextInTime":48346,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"I ve read some attachment theory on adoption.  Some of the new families would work together to nurture the big children as if they were babies. Holding like a","messageBody":"<div id=\"ygrps-yiv-2012964122\">I&#39;ve read some attachment theory on adoption.  Some of the new families<br/>\nwould work together to nurture the big children as if they were babies.<br/>\nHolding like a new born, feeding with a bottle, and cuddling.  I read about<br/>\n8-12 year olds being nurtured with bottles, and the parent and child worked<br/>\nup to the intimacy over time.  Perhaps the parent would sit near the child<br/>\nwhile eating, and then start with an arm draped over child.  As the duo<br/>\nworked up trust and started to bond, the parent would eventually sit on the<br/>\ncouch with the child cuddling and feeding with a bottle.   Doing this has<br/>\nled to some amazing instances of healing for the child.<br/>\n<br/>\nOften times, babies who had been put up for adoption were not nurtured at<br/>\nall with affection and touch, and it is really important  to help the child<br/>\nform attachment bonds.<br/>\n<br/>\nRead this link<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.attachmentparenting.org/support/articles/artadoption.php\">http://www.attachmentparenting.org/support/articles/artadoption.php</a><br/>\n<br/>\nI&#39;ve read about great recoveries...I wish you good wishes, and you have done<br/>\na wonderful thing to give this child a home.  I wish I could find that<br/>\narticle that I read about the older children and bottles---it was<br/>\nfascinating and the website had all kinds of other helpful articles and<br/>\nadvice.<br/>\n<br/>\nKim<br/>\nBaltimore<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Nov 2, 2009 at 10:32 PM, mizelenius &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mizelenius@...\">mizelenius@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> &lt;AlwaysLearning%40yahoogroups.com&gt;,<br/>\n&gt; tiffermom@... wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I have 4 boys by birth.Â  They have always been allowed to eat whenever<br/>\n&gt; and whatever they want.Â  Food have not been an issue in our house.Â  Now<br/>\n&gt; that being said we adopted a little girl at the age of 8. She has suffered<br/>\n&gt; starvation and food restrictions.Â  Since she has been with us (two<br/>\n&gt; years)Â she has doubled her weight.Â  She is now 5&#39;2&quot; and weighs 170lbs.Â  I<br/>\n&gt; feel like I am hurting her by allowing her free reign over her intake.Â<br/>\n&gt;<br/>\n&gt; My take when it comes to this type of thing is that it isn&#39;t about food--<br/>\n&gt; it is about &quot;enough.&quot; It is about not having had enough in her life . . .in<br/>\n&gt; her case, it sounds like she had far from enough of even the most basic of<br/>\n&gt; needs. She suffered for 6 critical years of her development, and has only<br/>\n&gt; been with you two-- not even half the time of what she endured.<br/>\n&gt;<br/>\n&gt; I would say, continue not focusing on food, her weight, etc. and instead<br/>\n&gt; remember that she is still going through and testing that &quot;trust vs.<br/>\n&gt; mistrust stage&quot; (according to Erikson, the very first conflict we deal with<br/>\n&gt; in life!) because her needs have not been met for so long. Anything you do<br/>\n&gt; in terms of restricting food is only going to set her back-- she will again<br/>\n&gt; fear that she will not get enough.<br/>\n&gt;<br/>\n&gt; -Elena<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257243682","msgId":48338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzODA3Ny41NDQ5Ny5xbUB3ZWIxMTA0MDgubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDczYzc2YzBhMDkxMTAyMTQzOHQxYTM0OGNmNXJhNGY2OTI0YTFiOGEwNTBjQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPiAgPEY5Q0EwMzI3LTFBMjYtNDVCRS04Mjg5LUQxMUU0OTk1MEEwNEBTYW5kcmFkb2RkLmNvbT4gIDw3OTc3MDU5NDA5MTEwMjExMzdzNzUxYzk0YjVpNmZkNzkzOTQ1MGExNWYwYkBtYWlsLmdtYWlsLmNvbT4gIDxFRkZDNDRBOS0xMUE4LTQxNEQtQjNBNy1FRjRGMEM2NTdDMzRAU2FuZHJhZG9kZC5jb20+IDw3M2M3NmMwYTA5MTEwMjE0Mzh0MWEzNDhjZjVyYTRmNjkyNGExYjhhMDUwY0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48335,"nextInTopic":48340,"prevInTime":48337,"nextInTime":48339,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"***One thing that has really helped me to let go is to only have what I consider to be real food in my home. If I don t buy what I would label as crap then","messageBody":"<div id=\"ygrps-yiv-996997186\">***One thing that has really helped me to let go is to only have what I<br/>\nconsider to be &quot;real&quot; food in my home. If I don&#39;t buy what I would label as<br/>\n&quot;crap&quot; then it&#39;s impossible for my kids to eat it... ***<br/>\n <br/>\nThat works for a while with very young children.  As long as you don&#39;t visit other people&#39;s houses who consider different food to be &quot;real&quot;, or go to family gatherings and potlucks.  This is very much how I grew up, and let me tell you that it didn&#39;t help me learn how to listen to my body at all.  I chose not to repeat that with my own children.<br/>\n <br/>\n*** My children are almost four and 5.5 and<br/>\nthey eat only healthy foods.***<br/>\n <br/>\nOr another way to rephrase that is that they only eat foods that mom considers healthy, it seems clear that the kids don&#39;t get to decide this for themselves.<br/>\n <br/>\n ***They don&#39;t seem to mind this.***<br/>\n <br/>\nNot yet perhaps.<br/>\n <br/>\n***I&#39;ve even asked<br/>\nthem before if they would like to eat other types of food and they say no.<br/>\nI don&#39;t even think that they would like the &quot;crap&quot;.***<br/>\n <br/>\nThat seems like entrapment.  What kind of &quot;other&quot; foods are being offered?  Really think about that... You are offering food, or &quot;other&quot; food.  It&#39;s all food.  Some of it has been given a value with positive and some of it has been given a negative value.  How are kids to grow up learning how to make good choices for themselves if someone else is always doing it for them? <br/>\n<br/>\n***I think that it is important to help mentor our children about the food they<br/>\neat.***<br/>\n <br/>\nWhat&#39;s important is to help our kids learn how to make good choices for themselves.  I don&#39;t want my children to parrot everything I say, I want them to think their own thoughts and have their own ideas.  Sometimes you have kids that actually agree with you on lots of things, but that&#39;s not going to happen if parents try to control or restrict children, even if it&#39;s &quot;for their own good&quot;, like eating some foods and avoiding others to help our immune system. <br/>\n  <br/>\n***If I don&#39;t want my kids to eat for instance McDonalds then they will never see<br/>\nme eating that food. ***<br/>\n <br/>\nI never eat at McDonalds, but my kids have both enjoyed many a happy meal over the years, largely because of the toys, and each of them have eaten what they liked and discarded the rest.  My 15 yr old hasn&#39;t eaten at McD&#39;s in years and my youngest has eaten a few bites of food from there a few times in the last 6 mos.  Both of them would choose Subway over most places for fastfood, or a bento place or sushi place.  <br/>\n <br/>\nMy goal for not eating at McD&#39;s myself was not to encourage my kids not to eat, it was because I can&#39;t eat most things from there.  Which goes back to my own childhood and issues around food and not learning about, and not being able to listen to my own body&#39;s cues because my own parents were quite sure they new what was best and healthiest for my body.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How long did it take your kids to eat &quot;real&quot; food?","postDate":"1257225444","msgId":48335,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM2NDlBRThELTU3MjUtNDc3Ny1CQzJCLUM3OEU3NDE2Mzk4N0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGhjb2JjbiticmVrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhjb2JjbiticmVrQGVHcm91cHMuY29tPg=="},"prevInTopic":48333,"nextInTopic":48338,"prevInTime":48334,"nextInTime":48336,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"... Ha, I miss hearing that - spit the dummy. Thanks, Bob! In case folks don t know what it means, think spitting out a soother or pacifier in indignation","messageBody":"<div id=\"ygrps-yiv-190446049\"><blockquote><span title=\"ireply\">&gt; Jeez, mate, if you&#39;re gonna spit the dummy every time somebody calls  <br/>\n&gt; you on sloppy thinking, good luck with living successfully outside  <br/>\n&gt; the sheepstream.<br/>\n<br/>\n </span></blockquote>Ha, I miss hearing that - &quot;spit the dummy.&quot; Thanks, Bob!<br/>\n<br/>\nIn case folks don&#39;t know what it means, think spitting out a soother  <br/>\nor pacifier in indignation &lt;g&gt;.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How long did it take your kids to eat &quot;real&quot; food?","postDate":"1257223095","msgId":48333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBRDgzODVGLTE5RkUtNDJDMi1BOEYyLUEyRDBFOTY0MkJGN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhjbzg4NCs2OTNvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhjbzg4NCs2OTNvQGVHcm91cHMuY29tPg=="},"prevInTopic":48332,"nextInTopic":48335,"prevInTime":48332,"nextInTime":48334,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=-My take when it comes to this type of thing is that it isn t about food-- it is about enough. It is about not having had enough in her life . . .in her","messageBody":"<div id=\"ygrps-yiv-810416246\">-=-My take when it comes to this type of thing is that it isn&#39;t about  <br/>\nfood-- it is about &quot;enough.&quot; It is about not having had enough in her  <br/>\nlife . . .in her case, it sounds like she had far from enough of even  <br/>\nthe most basic of needs-=-<br/>\n<br/>\nI agree.<br/>\n<br/>\nWould giving her more opportunities to make decisions that affect you  <br/>\nor the house or the schedule?  Maybe she needs power and influence.<br/>\n<br/>\nWhen she has money what does she like to buy?<br/>\n<br/>\nDoes she have any interest in sports or dance or hiking or anything  <br/>\nphysical?  Maybe exertion of large muscles would help her be relaxed  <br/>\nand tired.  If she has a lot of  angst and energy it might distract  <br/>\nher from thinking about food.  Not in a manipulative way, but just to  <br/>\nsee if there are other ways for her to feel focussed.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How long did it take your kids to eat &quot;real&quot; food?","postDate":"1257222359","msgId":48332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjb2JjbiticmVrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5NzcwNTk0MDkxMTAyMTEzN3M3NTFjOTRiNWk2ZmQ3OTM5NDUwYTE1ZjBiQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48330,"nextInTopic":48333,"prevInTime":48331,"nextInTime":48333,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"... Jeez, mate, if you re gonna spit the dummy every time somebody calls you on sloppy thinking, good luck with living successfully outside the sheepstream. ","messageBody":"<div id=\"ygrps-yiv-444458024\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Jerritt Dayhoff &lt;jerritthooper@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Wow!  Thanks for the &quot;support.&quot;  Not sure that I&#39;m gonna stick around.  I<br/>\n&gt; enjoy unschooling too much to be beat up because I can&#39;t measure up to your<br/>\n&gt; idea of unschooling perfection.  Thanks, though, for making me realize that<br/>\n&gt; someone I really looked up to prior to this is actually only looking for<br/>\n&gt; apostles to nod on cue.<br/>\n&gt; <br/>\n&gt; On Mon, Nov 2, 2009 at 10:54 AM, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Jeez, mate, if you&#39;re gonna spit the dummy every time somebody calls you on sloppy thinking, good luck with living successfully outside the sheepstream.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":304763189,"authorName":"cookiesforthree@verizon.net","from":"&quot;cookiesforthree@...&quot; &lt;cookiesforthree@...&gt;","profile":"cookiesforthree@verizon.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257219468","msgId":48330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjbzhpYytmc3EzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA0QUM4MEE2LTQ2MDUtNDBEMS1CNDY5LTk0NTJDQTk5REM1M0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48329,"nextInTopic":48332,"prevInTime":48329,"nextInTime":48331,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"I have two comments on this subject... Someone just posted about the guy who eats a lot of sugar and candy etc.  I loved that article!!  My experience with","messageBody":"<div id=\"ygrps-yiv-776649087\">I have two comments on this subject...<br/>\n<br/>\nSomeone just posted about the guy who eats a lot of sugar and candy etc.  I loved that article!!  My experience with foods have lead me to sickness and near death (cancer).  My grandparents who mostly raised me, allowed me to eat whatever I wanted, whenever I wanted.  They did at one point try and restrict sugar foods for a bit because they believed it was making my touretts worse.  Thankfully they gave up on this!!  Anyhow, we all sat down together for dinner, no matter what, but it was more about being together and talking then eating veggies.  I was always really healthy and at a perfect weight!!  It wasn&#39;t until I grew older and let &quot;society&quot; into my head that I started to try and eat healthy.  I started getting sick all the time, etc.  My weight ballooned.  I even asked my doctor if I could be allergic to vegetables.  He, of course, scoffed this idea.  Then... finally I got it!!!  I started eating foods that I wanted to eat.  Foods that my body wanted me to eat, and I am finally healing.  I have some bowel issues that are healing, but I know that if I continue to do what my body tells me, I will be back on the path of my dreams.  I don&#39;t eat meals, I eat breakfast later in the day and sometimes even have cereal for dinner.  Sometimes I crave a salad or some steamed veggies.  I love fruit and totally love chocolate!!  My grandfather, who is 85 eats either a whole pie, cake, a pan of cinnamon rolls, a package of cookies, etc. everyday!!!  He is fit as a fiddle.  He swears that water will rust his insides so he drinks coffee and koolaid when he&#39;s thirsty.  Here&#39;s the kicker... he has smoked since he was 8 years old!!!  (He grew up on a farm where it was execeptable for boys to smoke early.)  I believe that he has a firm believe that he is healthy and no matter what, food nor smoking, etc. will kill him.  He&#39;ll go when he&#39;s ready to.  Amazing!!<br/>\n<br/>\nSecondly...  I do hope that Jerritt will come back eventually.  I know when I first started reading and asking questions here, I felt rebuked or rebuffed myself.  Now that I have let unschooling sink in and have learned that when I feel contrast, there is probably a good reason, and that it is within myself.  I investigate and see why I feel contrast and make sure I&#39;m not swimming up stream instead of floating downstream where life is easier.  <br/>\n<br/>\n*Jerritt can be found earlier in the postings of this topic and felt offended.</div>","specialLinks":[]},{"userId":317975928,"authorName":"mizelenius","from":"&quot;mizelenius&quot; &lt;mizelenius@...&gt;","profile":"mizelenius","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How long did it take your kids to eat &quot;real&quot; food?","postDate":"1257219140","msgId":48329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjbzg4NCs2OTNvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwNTA1ODU0NC4zNzExMzExMjU3MjAyNzg1MzMwLkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+"},"prevInTopic":48325,"nextInTopic":48330,"prevInTime":48328,"nextInTime":48330,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"... My take when it comes to this type of thing is that it isn t about food-- it is about enough.  It is about not having had enough in her life . . .in her","messageBody":"<div id=\"ygrps-yiv-708415848\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, tiffermom@... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I have 4 boys by birth.Â  They have always been allowed to eat whenever and whatever they want.Â  Food have not been an issue in our house.Â  Now that being said we adopted a little girl at the age of 8. She has suffered starvation and food restrictions.Â  Since she has been with us (two years)Â she has doubled her weight.Â  She is now 5&#39;2&quot; and weighs 170lbs.Â  I feel like I am hurting her by allowing her free reign over her intake.Â  <br/>\n<br/>\n </span></blockquote>My take when it comes to this type of thing is that it isn&#39;t about food-- it is about &quot;enough.&quot;  It is about not having had enough in her life . . .in her case, it sounds like she had far from enough of even the most basic of needs.  She suffered for 6 critical years of her development, and has only been with you two-- not even half the time of what she endured.<br/>\n<br/>\nI would say, continue not focusing on food, her weight, etc. and instead remember that she is still going through and testing that &quot;trust vs. mistrust stage&quot; (according to Erikson, the very first conflict we deal with in life!) because her needs have not been met for so long.  Anything you do in terms of restricting food is only going to set her back-- she will again fear that she will not get enough.  <br/>\n<br/>\n-Elena</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257216786","msgId":48325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0QUM4MEE2LTQ2MDUtNDBEMS1CNDY5LTk0NTJDQTk5REM1M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDczYzc2YzBhMDkxMTAyMTc0MG0zMTVkMTY5Nm4yZmY1MTM0Y2M3NTFkNDFkQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPiA8RjlDQTAzMjctMUEyNi00NUJFLTgyODktRDExRTQ5OTUwQTA0QFNhbmRyYWRvZGQuY29tPiA8Nzk3NzA1OTQwOTExMDIxMTM3czc1MWM5NGI1aTZmZDc5Mzk0NTBhMTVmMGJAbWFpbC5nbWFpbC5jb20+IDxFRkZDNDRBOS0xMUE4LTQxNEQtQjNBNy1FRjRGMEM2NTdDMzRAU2FuZHJhZG9kZC5jb20+IDw3M2M3NmMwYTA5MTEwMjE0Mzh0MWEzNDhjZjVyYTRmNjkyNGExYjhhMDUwY0BtYWlsLmdtYWlsLmNvbT4gPEVEODI2ODU3LTIxRjgtNDI1NS05N0NGLUY4NzlFRTE0RjRCMkBTYW5kcmFkb2RkLmNvbT4gPDczYzc2YzBhMDkxMTAyMTc0MG0zMTVkMTY5Nm4yZmY1MTM0Y2M3NTFkNDFkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48319,"nextInTopic":48329,"prevInTime":48324,"nextInTime":48326,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=-I meant that in my home as long as they are in my home they won t be eating it simply because it s not here.-=- I knew what you meant.  I wanted to make","messageBody":"<div id=\"ygrps-yiv-2052702471\">-=-I meant that in my home as long as they are in my home they won&#39;t  <br/>\nbe eating<br/>\nit simply because it&#39;s not here.-=-<br/>\n<br/>\nI knew what you meant.  I wanted to make sure you saw what you had said.<br/>\n<br/>\nYou could do the same thing for games or TV or plastic toys or rock  <br/>\nand roll.<br/>\nI don&#39;t think it&#39;s as simple as you think it is.  (&quot; they won&#39;t be  <br/>\neating it simply because ...&quot;)<br/>\n<br/>\n-=-It&#39;s true that I can&#39;t control what happens when they are out of my  <br/>\nsight but it will be a while until I need to contend with that. -=-<br/>\n<br/>\nWhat if it&#39;s twenty years before the backlash?  What if it&#39;s ten?  Five?<br/>\nWhat if you could live in such a way that there would never be one at  <br/>\nall?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":311075098,"authorName":"Mandy Ray-Jones","from":"Mandy Ray-Jones &lt;shebrakes4rainbows@...&gt;","profile":"shebrakes4rainbows","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot; \tfood?","postDate":"1257212401","msgId":48319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczYzc2YzBhMDkxMTAyMTc0MG0zMTVkMTY5Nm4yZmY1MTM0Y2M3NTFkNDFkQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEVEODI2ODU3LTIxRjgtNDI1NS05N0NGLUY4NzlFRTE0RjRCMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPgkgPEY5Q0EwMzI3LTFBMjYtNDVCRS04Mjg5LUQxMUU0OTk1MEEwNEBTYW5kcmFkb2RkLmNvbT4JIDw3OTc3MDU5NDA5MTEwMjExMzdzNzUxYzk0YjVpNmZkNzkzOTQ1MGExNWYwYkBtYWlsLmdtYWlsLmNvbT4JIDxFRkZDNDRBOS0xMUE4LTQxNEQtQjNBNy1FRjRGMEM2NTdDMzRAU2FuZHJhZG9kZC5jb20+CSA8NzNjNzZjMGEwOTExMDIxNDM4dDFhMzQ4Y2Y1cmE0ZjY5MjRhMWI4YTA1MGNAbWFpbC5nbWFpbC5jb20+CSA8RUQ4MjY4NTctMjFGOC00MjU1LTk3Q0YtRjg3OUVFMTRGNEIyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":48311,"nextInTopic":48325,"prevInTime":48318,"nextInTime":48320,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"I meant that in my home as long as they are in my home they won t be eating it simply because it s not here.  It s true that I can t control what happens when","messageBody":"<div id=\"ygrps-yiv-1595199558\">I meant that in my home as long as they are in my home they won&#39;t be eating<br/>\nit simply because it&#39;s not here.  It&#39;s true that I can&#39;t control what<br/>\nhappens when they are out of my sight but it will be a while until I need to<br/>\ncontend with that.  My son and I both have some health issues which make it<br/>\npretty important that we avoid sugars... including large amounts of honey<br/>\nand maple syrup.  We use low glycemic sweeteners in our home.  I feel that<br/>\nit&#39;s my job to keep him healthy and for him to not end up in a diabetic<br/>\ncoma.<br/>\n<br/>\nAnd my children have had refined sweeteners.  Just in moderation... which<br/>\nhappens organically for our family since we just don&#39;t keep that stuff<br/>\naround the house.  If we are out and about we might have a little.  As long<br/>\nas we don&#39;t make a big deal out of it, it&#39;s really a nonissue.  Certainly no<br/>\nbreak downs or fights or leg biting!  Just maybe a little bargaining and a<br/>\nreminder that we want to stay healthy with our blood sugar and ALWAYS a safe<br/>\nalternative.<br/>\n<br/>\nI think we&#39;ve all heard stories about children who have binged on<br/>\nsugar/sweets as a result of being restricted.  I hate that that happened.  I<br/>\nknow that my mom told me a story of hiding out with a bag of cookies when<br/>\nshe was a kid.  She was allowed to eat sugar.  She just wanted to eat all of<br/>\nthe centers from the cookies so she took the bag, hid, and ate them all.  It<br/>\nwas just something that happened.  Not because she was restricted but<br/>\nbecause she had a mission!  Just this weekend my son ate a large amount of<br/>\nthe low sugar &quot;healthier&quot; snacks and he complained of a tummy ache.  I asked<br/>\nhim if maybe it was because he had eaten more treats than normal and he<br/>\nagreed that it could have been that and he&#39;d back off for a little while.<br/>\nNo tears.  Tummy ache went away.  Lesson learned.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Nov 2, 2009 at 6:23 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-One thing that has really helped me to let go is to only have what I<br/>\n&gt; consider to be &quot;real&quot; food in my home. If I don&#39;t buy what I would<br/>\n&gt; label as<br/>\n&gt; &quot;crap&quot; then it&#39;s impossible for my kids to eat it...-=-<br/>\n&gt;<br/>\n&gt; Please back away from dividing food into &quot;real&quot; and &quot;crap.&quot; It&#39;s not<br/>\n&gt; getting nearer to useful unschooling discussion.<br/>\n&gt;<br/>\n&gt; Unless you don&#39;t expect your kids to grow to adulthood, your theory<br/>\n&gt; that it&#39;s &quot;impossible&quot; for them to get what you consider to be bad is<br/>\n&gt; a very bad theory.<br/>\n&gt;<br/>\n&gt; I had a niece stay with us many years ago whose parents were natural<br/>\n&gt; food fanatics. She was never EVER allowed to even taste anything that<br/>\n&gt; had refined sugar in it. Not even a little bit. She was five, and we<br/>\n&gt; lost her. It was a six-acre property so I wasn&#39;t too worried about<br/>\n&gt; finding her, but when I did I discovered why she hadn&#39;t answered when<br/>\n&gt; we called her. She was squatting in the garden between rows of<br/>\n&gt; vegetables, with a paper bag of sugar she&#39;d gotten from the pantry,<br/>\n&gt; and she was eating it as fast as she could, one hand at her mouth and<br/>\n&gt; the other in the bag, back and forth, knowing she would be caught and<br/>\n&gt; it would be taken away from her.<br/>\n&gt;<br/>\n&gt; Her mom wasn&#39;t there. I didn&#39;t yell at her at all. I was kind to<br/>\n&gt; her. It was a huge example of what comes of limits, though.<br/>\n&gt; Desperation, sneakiness, and the wild desire to eat sugar straight<br/>\n&gt; from the bag.<br/>\n&gt;<br/>\n&gt; My kids haven&#39;t been limited or deprived, and they don&#39;t open the<br/>\n&gt; little sugar packets at restaurants and eat them.<br/>\n&gt;<br/>\n&gt; -=-I think that it is important to help mentor our children about the<br/>\n&gt; food they eat.-=-<br/>\n&gt;<br/>\n&gt; I don&#39;t think of myself as my children&#39;s food mentor. I&#39;ve been their<br/>\n&gt; provider and comfort and partner. The youngest of three turned 18<br/>\n&gt; today. They&#39;re healthy and bright.<br/>\n&gt;<br/>\n&gt; There are stories here about unschooling and food:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n&gt; There are countless stories here about limits and controls:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://google.com\">http://google.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMandy Ray-Jones<br/>\nArtsy Mamas Executive Director and Founder<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://artsymamas.org/\">http://artsymamas.org/</a><br/>\nChild of God, Supermom, Wife, Aspiring Natural Nutritionist, Truth Seeker,<br/>\nLover of Life, Friend, and Geeky Blogger<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bonafidemama.com/\">http://www.bonafidemama.com/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257211343","msgId":48311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0NzYzOC43MjUyMy5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PEVEODI2ODU3LTIxRjgtNDI1NS05N0NGLUY4NzlFRTE0RjRCMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPiA8RjlDQTAzMjctMUEyNi00NUJFLTgyODktRDExRTQ5OTUwQTA0QFNhbmRyYWRvZGQuY29tPiA8Nzk3NzA1OTQwOTExMDIxMTM3czc1MWM5NGI1aTZmZDc5Mzk0NTBhMTVmMGJAbWFpbC5nbWFpbC5jb20+IDxFRkZDNDRBOS0xMUE4LTQxNEQtQjNBNy1FRjRGMEM2NTdDMzRAU2FuZHJhZG9kZC5jb20+IDw3M2M3NmMwYTA5MTEwMjE0Mzh0MWEzNDhjZjVyYTRmNjkyNGExYjhhMDUwY0BtYWlsLmdtYWlsLmNvbT4gPEVEODI2ODU3LTIxRjgtNDI1NS05N0NGLUY4NzlFRTE0RjRCMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48305,"nextInTopic":48319,"prevInTime":48310,"nextInTime":48312,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"this is what food control and limitd does ( a study): http://www.youtube.com/watch?v=CNA3zltptmk Alex Polikowsky http://polykow.blogspot.com/ ","messageBody":"<div id=\"ygrps-yiv-128626018\">this is what food control and limitd does ( a study):<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=CNA3zltptmk\">http://www.youtube.com/watch?v=CNA3zltptmk</a><br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/CNA3zltptmk?wmode=opaque","type":"VIDEO"}]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257209156","msgId":48305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwQTMwMENBLTBENjgtNEY5NC04MUE2LTdBNzE2MUJBM0MzQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEM3MTUxQTk4LjNEQkEla2F6emFyYXRAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PEM3MTUxQTk4LjNEQkEla2F6emFyYXRAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":48303,"nextInTopic":48311,"prevInTime":48304,"nextInTime":48306,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=-Oh and sandra – I loved that support link – was really funny!=- Thanks. I just got tired of people saying I came here for support, and you re telling","messageBody":"<div id=\"ygrps-yiv-110223648\">-=-Oh and sandra � I loved that support link � was really funny!=-<br/>\n<br/>\nThanks.<br/>\nI just got tired of people saying &quot;I came here for support, and you&#39;re  <br/>\ntelling me what I&#39;m doing wrong.&quot;<br/>\n<br/>\nWell...  yeah.  Because people come here (if they&#39;ve read the intro)  <br/>\nto get help to move toward unschooling and away from traditional  <br/>\nparenting.<br/>\n<br/>\nSome people do love to be told that what they&#39;re doing is just as good  <br/>\nas anything anyone has ever done or ever could, and that unschooling  <br/>\nis just whatever anyone wants it to be.<br/>\n<br/>\nWhy would I spend years of time to give people that worthless pap?   <br/>\nThere&#39;s no joy in putting smiley-face bandaids on gaping wounds.<br/>\n<br/>\nI&#39;m not here to &quot;support&quot; mothers who are badmouthing their children.   <br/>\nI&#39;m here to support children whose mothers think maybe there&#39;s a  <br/>\nbetter way to be generous and peaceful and mindful with their children.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257207821","msgId":48303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEODI2ODU3LTIxRjgtNDI1NS05N0NGLUY4NzlFRTE0RjRCMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDczYzc2YzBhMDkxMTAyMTQzOHQxYTM0OGNmNXJhNGY2OTI0YTFiOGEwNTBjQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPiA8RjlDQTAzMjctMUEyNi00NUJFLTgyODktRDExRTQ5OTUwQTA0QFNhbmRyYWRvZGQuY29tPiA8Nzk3NzA1OTQwOTExMDIxMTM3czc1MWM5NGI1aTZmZDc5Mzk0NTBhMTVmMGJAbWFpbC5nbWFpbC5jb20+IDxFRkZDNDRBOS0xMUE4LTQxNEQtQjNBNy1FRjRGMEM2NTdDMzRAU2FuZHJhZG9kZC5jb20+IDw3M2M3NmMwYTA5MTEwMjE0Mzh0MWEzNDhjZjVyYTRmNjkyNGExYjhhMDUwY0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48302,"nextInTopic":48305,"prevInTime":48302,"nextInTime":48304,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=-One thing that has really helped me to let go is to only have what I consider to be real food in my home. If I don t buy what I would label as crap then","messageBody":"<div id=\"ygrps-yiv-1824734660\">-=-One thing that has really helped me to let go is to only have what I<br/>\nconsider to be &quot;real&quot; food in my home. If I don&#39;t buy what I would  <br/>\nlabel as<br/>\n&quot;crap&quot; then it&#39;s impossible for my kids to eat it...-=-<br/>\n<br/>\nPlease back away from dividing food into &quot;real&quot; and &quot;crap.&quot;  It&#39;s not  <br/>\ngetting nearer to useful unschooling discussion.<br/>\n<br/>\nUnless you don&#39;t expect your kids to grow to adulthood, your theory  <br/>\nthat it&#39;s &quot;impossible&quot; for them to get what you consider to be bad is  <br/>\na very bad theory.<br/>\n<br/>\nI had a niece stay with us many years ago whose parents were natural  <br/>\nfood fanatics.  She was never EVER allowed to even taste anything that  <br/>\nhad refined sugar in it.  Not even a little bit.  She was five, and we  <br/>\nlost her.  It was a six-acre property so I wasn&#39;t too worried about  <br/>\nfinding her, but when I did I discovered why she hadn&#39;t answered when  <br/>\nwe called her.  She was squatting in the garden between rows of  <br/>\nvegetables, with a paper bag of sugar she&#39;d gotten from the pantry,  <br/>\nand she was eating it as fast as she could, one hand at her mouth and  <br/>\nthe other in the bag, back and forth, knowing she would be caught and  <br/>\nit would be taken away from her.<br/>\n<br/>\nHer mom wasn&#39;t there.  I didn&#39;t yell at her at all.  I was kind to  <br/>\nher.  It was a huge example of what comes of limits, though.    <br/>\nDesperation, sneakiness, and the wild desire to eat sugar straight  <br/>\nfrom the bag.<br/>\n<br/>\nMy kids haven&#39;t been limited or deprived, and they don&#39;t open the  <br/>\nlittle sugar packets at restaurants and eat them.<br/>\n<br/>\n-=-I think that it is important to help mentor our children about the  <br/>\nfood they eat.-=-<br/>\n<br/>\nI don&#39;t think of myself as my children&#39;s food mentor.  I&#39;ve been their  <br/>\nprovider and comfort and partner.  The youngest of three turned 18  <br/>\ntoday.  They&#39;re healthy and bright.<br/>\n<br/>\nThere are stories here about unschooling and food:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\nThere are countless stories here about limits and controls:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://google.com\">http://google.com</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot; food?","postDate":"1257207303","msgId":48302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0N0MyNEJBLTk3REUtNDA1NC05RUM5LUZCMzYxRjY2NTk4NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwNTA1ODU0NC4zNzExMzExMjU3MjAyNzg1MzMwLkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+","referencesHeader":"PDIwNTA1ODU0NC4zNzExMzExMjU3MjAyNzg1MzMwLkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+"},"prevInTopic":48299,"nextInTopic":48303,"prevInTime":48301,"nextInTime":48303,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=My thinking was that given every opportunity to control her own intake some of these behaviors would subside.  The major improvement I have seen is she no","messageBody":"<div id=\"ygrps-yiv-1368562911\">-=My thinking was that given every opportunity to control her own  <br/>\nintake some of these behaviors would subside.  The major improvement I  <br/>\nhave seen is she no longer eats till she throws up.   I would really  <br/>\nlike to hear what you all observe about this.  Perhaps I need an  <br/>\nattitude adjustment or maybe this will take more time that I thought.   <br/>\nHas anyone else dealt with this type of behavior? -=-<br/>\n<br/>\nMy younger cousin.  She was a food hoarder as a kid.  We had six  <br/>\npeople and when there were a dozen of something, each person could  <br/>\nhave two, and only two.  She would eat one and save her other (donut  <br/>\nor cookie or whatever) until all the rest were gone, and would eat it  <br/>\nin front of us.  There was a cruelty to it, kind of a sadistic &quot;AHA!    <br/>\nI am making you hungry!&quot; but I think it was because she had suffered a  <br/>\nlot of hurt and deprivation and was passing it back out.<br/>\n<br/>\nI think your daughter already has food issues and they&#39;re not of your  <br/>\nmaking.  Just because she gets fat for a while doesn&#39;t mean she&#39;ll  <br/>\nalways be.  Or maybe she will always be.  But it&#39;s not your doing.<br/>\n<br/>\nI&#39;m sorry for your boys, though.  My parents didn&#39;t &quot;save&quot; my cousins  <br/>\nby bringing them into our home, and it made my life and my sisters&#39;  <br/>\nvery hard.<br/>\n<br/>\n-=- Everyone will choose a cereal and she will pick something no one  <br/>\nelse likes and then will not even open it till all the other cereal is  <br/>\ngone.  I have thoughts of only letting her eat her choice but I think  <br/>\nthat is mean too.  I would really like to defuse this situations.  I  <br/>\nam at a loss for what to do.  I know that she is picking up negative  <br/>\nattitude from me in this regard and that I think is due to the fact  <br/>\nthat I feel I have to protect the boys fare share.  -=-<br/>\n<br/>\nAre the boys all older than the ten year old girl?<br/>\n<br/>\nMaybe you could ask whether she would like to have her own food  <br/>\nseparate or to share.  Dont&#39; let her say &quot;both.&quot;  Or let her, but  <br/>\ngradually point out the unfairness of it.  If she wants hers separate,  <br/>\nthen mark hers and tell her to leave the shared bowl of candy or  <br/>\ncereal alone.   She&#39;ll get tired of that pretty soon, I bet.  But  <br/>\n&quot;pretty soon&quot; in her case might still be years.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269037874,"authorName":"Karen Norman","from":"Karen Norman &lt;kazzarat@...&gt;","profile":"kazglc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257204248","msgId":48299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM3MTUxQTk4LjNEQkEla2F6emFyYXRAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":48297,"nextInTopic":48302,"prevInTime":48298,"nextInTime":48300,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"I¹ve been thinking this for the last 8months or so since I came properly to take unschooling on board.  I have a 4.5 year old and a 16mth old.  Its just about","messageBody":"<div id=\"ygrps-yiv-1567912759\">I¹ve been thinking this for the last 8months or so since I came properly to<br/>\ntake unschooling on board.  I have a 4.5 year old and a 16mth old.  Its just<br/>\nabout the notion of support¹.    I have been on attachment<br/>\nparenting/alternative mothering lists/sites since my 4 year old was born.<br/>\nHe is what some would call highly spirited¹ so I have had lots of questions<br/>\nand heart aches and confusion surrounding him and have sought out lots of<br/>\nadvice and support from these lovely lists and sites and although I have had<br/>\nhelp from them and spoke to many helpful and supportive women ­ I was<br/>\nactually beginning to get frustrated with support¹ - I really wanted<br/>\nanswers to help me sort out this confusing messy mothering life ­ more than<br/>\nsupport.<br/>\n<br/>\nThen I stubble across sandras site and join up to the lists and do lots of<br/>\nreading and start to implement what I am learning ­ all starting 8mths ago.<br/>\nWell I can say that in those 8mths I have moved on 10times more in my<br/>\nparenting than I have for the previous 3+ years were I was getting lots of<br/>\nlovely support.  Our family is far from perfect and I have so much more to<br/>\nlearn ­ I feel I have but scratched the surface as yet.  I have had the<br/>\nhorrible uncomfortable challenged feelings etc ­ its not nice, its hard to<br/>\nface, but it does make you grow and stretch if you can bear the<br/>\nuncomfortableness of it!<br/>\n<br/>\nOh and sandra ­ I loved that support link ­ was really funny!<br/>\n<br/>\nHope that ok for me to say all that!<br/>\n<br/>\nKaren x<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":352545834,"authorName":"tiffermom@comcast.net","from":"tiffermom@...","profile":"tiffermomof5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257202785","msgId":48294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwNTA1ODU0NC4zNzExMzExMjU3MjAyNzg1MzMwLkphdmFNYWlsLnJvb3RAc3owMDM5YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+","inReplyToHeader":"PEVGRkM0NEE5LTExQTgtNDE0RC1CM0E3LUVGNEYwQzY1N0MzNEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48293,"nextInTopic":48297,"prevInTime":48293,"nextInTime":48295,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"I have 4 boys by birth.  They have always been allowed to eat whenever and whatever they want.  Food have not been an issue in our house.  Now that being","messageBody":"<div id=\"ygrps-yiv-170601468\">I have 4 boys by birth.  They have always been allowed to eat whenever and whatever they want.  Food have not been an issue in our house.  Now that being said we adopted a little girl at the age of 8. She has suffered starvation and food restrictions.  Since she has been with us (two years) she has doubled her weight.  She is now 5&#39;2&quot; and weighs 170lbs.  I feel like I am hurting her by allowing her free reign over her intake.  <br/>\n<br/>\n<br/>\n<br/>\nShe is very sneaky with food.  She takes food or drinks from other people. Example: We went to the movies with their Nana who bought drinks and sweets and popcorn for everyone.  I looked over and saw her drinking from her Nana&#39;s cup several times. ( I did not acknowledge this to her)   If I get them something to share she gets extremely upset. Example: The other day we were out longer then I expected.  I only had enough money to buy 2 sub sandwiches from Subway.  There were 4 of us.  I offered this choice to everyone and they all agreed.  But then once inside when she really realized she was sharing ( I explained this in the car) she fell to pieces.  She refused to make any choices.  So I made the choices taking into consideration her likes and by the time we were in the car she was in tears.  I was not mean to her and I stayed calm.  She did eat her half of the sandwich.  She has to control food for others too she will yell at our 5 year old for eating chips in the morning, I have always allowed chips in the morning.    We do not limit the kids candy after Halloween after a few days I have always put their left over candy into one bowl and that works for everyone except for her.  She will get upset so last year I kept her candy separate and combined the others and she ate theirs till it was gone before going to hers.  This created a situation where she had candy and no one else did.  She likes to hold it over their heads.  This is the same for things like cereal too.  Everyone will choose a cereal and she will pick something no one else likes and then will not even open it till all the other cereal is gone.  I have thoughts of only letting her eat her choice but I think that is mean too.  I would really like to defuse this situations.  I am at a loss for what to do.  I know that she is picking up negative attitude from me in this regard and that I think is due to the fact that I feel I have to protect the boys fare share.  <br/>\n<br/>\n<br/>\n<br/>\nMy thinking was that given every opportunity to control her own intake some of these behaviors would subside.  The major improvement I have seen is she no longer eats till she throws up.   I would really like to hear what you all observe about this.  Perhaps I need an attitude adjustment or maybe this will take more time that I thought.  Has anyone else dealt with this type of behavior?  I do not want her to grow up having food issues, and I especially do not want to be a person in her life to add or create food issues.  <br/>\n<br/>\n<br/>\n<br/>\nTiffani <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Sandra Dodd&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Monday, November 2, 2009 1:15:41 PM GMT -08:00 US/Canada Pacific <br/>\nSubject: Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food? <br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-=-How long did it take your kids to eat &quot;real&quot; food?-=- <br/>\n<br/>\nThinking of some foods as &quot;real&quot; and others as any form of unreal is <br/>\ngoing to be as much a problem as dividing the world into fun and <br/>\nlearning, as though they were separate things. <br/>\n<br/>\nA point like that shouldn&#39;t crush the feelings of anyone old enough to <br/>\nbe a mother, or anyone bright enough to consider unschooling. A <br/>\npoint like that can, and will, and does regularly help someone make <br/>\nanother level toward &quot;beating the game&quot; of deschooling. It&#39;s not <br/>\neasy for people to recover from ten or twenty years of schooling, but <br/>\npeople do it. They don&#39;t do it from being supported to stay where <br/>\nthey are and be satisfied with muddly thinking and negativity, though. <br/>\n<br/>\nMy children ate real food when they started nursing. They ate real <br/>\nfood when they tasted mashed foods off the ends of people&#39;s fingers, <br/>\nor strained fruit. They ate real food when they tasted other people&#39;s <br/>\nfood when they were toddlers but weren&#39;t forced to taste it, nor <br/>\npressed to finish it. They have always eaten real food, their whole <br/>\nlives. <br/>\n<br/>\nStories of hundreds of kids are here and at links from this: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a> <br/>\n<br/>\nSandra <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":311075098,"authorName":"Mandy Ray-Jones","from":"Mandy Ray-Jones &lt;shebrakes4rainbows@...&gt;","profile":"shebrakes4rainbows","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot; \tfood?","postDate":"1257201516","msgId":48297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczYzc2YzBhMDkxMTAyMTQzOHQxYTM0OGNmNXJhNGY2OTI0YTFiOGEwNTBjQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEVGRkM0NEE5LTExQTgtNDE0RC1CM0E3LUVGNEYwQzY1N0MzNEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPgkgPEY5Q0EwMzI3LTFBMjYtNDVCRS04Mjg5LUQxMUU0OTk1MEEwNEBTYW5kcmFkb2RkLmNvbT4JIDw3OTc3MDU5NDA5MTEwMjExMzdzNzUxYzk0YjVpNmZkNzkzOTQ1MGExNWYwYkBtYWlsLmdtYWlsLmNvbT4JIDxFRkZDNDRBOS0xMUE4LTQxNEQtQjNBNy1FRjRGMEM2NTdDMzRAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":48294,"nextInTopic":48299,"prevInTime":48296,"nextInTime":48298,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"I m really sorry that food is stressing you out.  I can truly relate to this issue.  One thing that has really helped me to let go is to only have what I ","messageBody":"<div id=\"ygrps-yiv-1589590887\">I&#39;m really sorry that food is stressing you out.  I can truly relate to this<br/>\nissue.  One thing that has really helped me to let go is to only have what I<br/>\nconsider to be &quot;real&quot; food in my home.  If I don&#39;t buy what I would label as<br/>\n&quot;crap&quot; then it&#39;s impossible for my kids to eat it... at least when we are at<br/>\nhome which is most of the time.  My children are almost four and 5.5 and<br/>\nthey eat only healthy foods.  They don&#39;t seem to mind this.  I&#39;ve even asked<br/>\nthem before if they would like to eat other types of food and they say no.<br/>\nI don&#39;t even think that they would like the &quot;crap&quot;.<br/>\n<br/>\nI would also agree with some of the others on this thread that kids do tend<br/>\nto eat more of certain foods at times than they do at other times.  But<br/>\nagain if they are craving and asking for carbs then have lots of healthy<br/>\ncarbs on hand.<br/>\n<br/>\nI think that it is important to help mentor our children about the food they<br/>\neat.  Food is a very important factor when it comes to our immune systems.<br/>\nI explain this to my children.  I model good eating habits for my kids.  If<br/>\nI don&#39;t want my kids to eat for instance McDonalds then they will never see<br/>\nme eating that food.  I blog &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bonafidemama.com/\">http://www.bonafidemama.com/</a>&gt; a great deal<br/>\nabout healthy foods and I&#39;d be happy to talk privately with you as well.<br/>\n<br/>\nBest of luck!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Nov 2, 2009 at 3:15 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-How long did it take your kids to eat &quot;real&quot; food?-=-<br/>\n&gt;<br/>\n&gt; Thinking of some foods as &quot;real&quot; and others as any form of unreal is<br/>\n&gt; going to be as much a problem as dividing the world into fun and<br/>\n&gt; learning, as though they were separate things.<br/>\n&gt;<br/>\n&gt; A point like that shouldn&#39;t crush the feelings of anyone old enough to<br/>\n&gt; be a mother, or anyone bright enough to consider unschooling. A<br/>\n&gt; point like that can, and will, and does regularly help someone make<br/>\n&gt; another level toward &quot;beating the game&quot; of deschooling. It&#39;s not<br/>\n&gt; easy for people to recover from ten or twenty years of schooling, but<br/>\n&gt; people do it. They don&#39;t do it from being supported to stay where<br/>\n&gt; they are and be satisfied with muddly thinking and negativity, though.<br/>\n&gt;<br/>\n&gt; My children ate real food when they started nursing. They ate real<br/>\n&gt; food when they tasted mashed foods off the ends of people&#39;s fingers,<br/>\n&gt; or strained fruit. They ate real food when they tasted other people&#39;s<br/>\n&gt; food when they were toddlers but weren&#39;t forced to taste it, nor<br/>\n&gt; pressed to finish it. They have always eaten real food, their whole<br/>\n&gt; lives.<br/>\n&gt;<br/>\n&gt; Stories of hundreds of kids are here and at links from this:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMandy Ray-Jones<br/>\nArtsy Mamas Executive Director and Founder<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://artsymamas.org/\">http://artsymamas.org/</a><br/>\nChild of God, Supermom, Wife, Aspiring Natural Nutritionist, Truth Seeker,<br/>\nLover of Life, Friend, and Geeky Blogger<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bonafidemama.com/\">http://www.bonafidemama.com/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257201075","msgId":48293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwMTVBMkNBLTVBQjQtNDlCRS1CQTY3LTgwMTg4NzQ4RENDOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGU2OGY4YWEwOTExMDIxMzMxbzIwNDMwNDQ2aDk4NzRmMmU5N2ZlZDk2ZDRAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPiA8ZTY4ZjhhYTA5MTEwMjEzMzFvMjA0MzA0NDZoOTg3NGYyZTk3ZmVkOTZkNEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":48292,"nextInTopic":48294,"prevInTime":48292,"nextInTime":48294,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=I m sorry this turned out long.-=- I didn t think it was long at all.  It was really interesting. The idea that a child can just feel instinctively whether a","messageBody":"<div id=\"ygrps-yiv-340117272\">-=I&#39;m sorry this turned out long.-=-<br/>\n<br/>\nI didn&#39;t think it was long at all.  It was really interesting.<br/>\n<br/>\nThe idea that a child can just feel instinctively whether a food is  <br/>\ngood for her at that time or not isn&#39;t anything I had ever heard at  <br/>\nall until I read an article in Mothering Magazine (don&#39;t know which  <br/>\nissue or who wrote it, but would like to know!  I gave away all my old  <br/>\nmagazines once) that said if you get a balanced diet&#39;s worth of a  <br/>\nweek&#39;s worth of food (awkwardly stated; sorry) and let a toddler  <br/>\nchoose what to eat when, it will balance out within the space of that  <br/>\nweek.<br/>\n<br/>\nSomething like that.&lt;g&gt;<br/>\nAnd Kirby was a baby, and it gave me a lot of confidence that maybe he  <br/>\nwas smart beyond his verbalization, so we never forced food on him,  <br/>\nnor prohibited any.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":221591978,"authorName":"Bernadette Lynn","from":"Bernadette Lynn &lt;bernadette.lynn@...&gt;","profile":"bwalyalynn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot; \tfood?","postDate":"1257197484","msgId":48290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2OGY4YWEwOTExMDIxMzMxbzIwNDMwNDQ2aDk4NzRmMmU5N2ZlZDk2ZDRAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPg=="},"prevInTopic":48287,"nextInTopic":48292,"prevInTime":48289,"nextInTime":48291,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"2009/11/2 Jerritt jerritthooper@gmail.com ... Protein and carbohydrates aren t crap . They re essential parts of the human diet. I can ony speak for my own","messageBody":"<div id=\"ygrps-yiv-883069654\">2009/11/2 Jerritt <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jerritthooper@...\">jerritthooper@...</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I guess I am just looking for some reassurance that at some point a<br/>\n&gt; vegetable may pass their lips again.  I wasn&#39;t a great veggie eater when I<br/>\n&gt; was young.  My parents were hippies and very hands off -- no rules, no<br/>\n&gt; restrictions.  Eventually, I learned to like veggies, so I am probably<br/>\n&gt; worrying for nothing, but I worry nonetheless because they are living on<br/>\n&gt; crap right now.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Protein and carbohydrates aren&#39;t &#39;crap&#39;. They&#39;re essential parts of the<br/>\nhuman diet.<br/>\n<br/>\nI can ony speak for my own children, and my eldest is only ten, but in my<br/>\nexperience children eat different things according to their growth cycle: at<br/>\ntimes they will eat vast amounts of carbs, put on a lot of weight, then<br/>\nsuddenly shoot up - at which point they&#39;ll eat more protein. that<br/>\nobservation really helped me trust that they know far better than I what<br/>\nthey need to eat. But something else helped me as well.<br/>\n<br/>\nMy eldest daughter was diagnosed with PDA when she was just nine; it was an<br/>\neasily fixed problem but because her heart, for nine years, was working far<br/>\nharder than normal it was using up every bit of energy she had to spare. I<br/>\n&#39;controlled&#39; what she ate for five years, feeling vaguely guilty about<br/>\n&#39;giving in&#39; and letting her fill up on biscuits and sweetened yoghurts when<br/>\nI couldn&#39;&#39;t persuade her to eat the &#39;good&#39; stuff. She was tiny at four, even<br/>\nthe smallest size school uniform had to be taken up four inches to fit her<br/>\nand most of a school year later it still fitted easily. She came out of<br/>\nschool every day crying with exhaustion and had to be fed chocolate even to<br/>\nget the energy to walk to the car.<br/>\n<br/>\nThen, two and a half terms after she started school we deregistered her to<br/>\nhome educate, and a couple of months after that I came across Schuyler<br/>\nonline, with her (what seemed to me) radical ideas about not restricting<br/>\nfood. Shortly after we stopped controlling her food Charlotte had the first<br/>\nreal growth spurt she&#39;d ever had. We worried that she seemed to eat mostly<br/>\nchocolate and cake but kept our worries to ourselves since she stayed (very)<br/>\nslim and was healthier than she&#39;d ever been before though still lacking in<br/>\nenergy.<br/>\n<br/>\nShe&#39;s still really small and only started putting on weight and growing<br/>\nproperly after the operation to fix her heart, but the surgeon was surprised<br/>\nat how little damage her condition had done - apart from her small size and<br/>\na barely noticeable enlargement of one chamber of her heart she&#39;s normal,<br/>\nhealthy and strong.<br/>\n<br/>\n If we&#39;d stuck with controlling how much sugar she ate and making her go to<br/>\nschool and run around with the other children we could actually have made<br/>\nher very, very sick - all with the best intentions of course. Instead we<br/>\nspent several years supporting her in what she felt she needed, even when it<br/>\ndidn&#39;t look &#39;normal&#39; to us, and it turned out to be the best thing we could<br/>\npossibly have done. And she turned out pretty brilliant at dealing with her<br/>\nneeds, once we gave her a chance.<br/>\n<br/>\nI&#39;m sorry this turned out long.<br/>\n<br/>\n<br/>\nBernadette.<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/dna/h2g2/U15459\">http://www.bbc.co.uk/dna/h2g2/U15459</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257197038","msgId":48287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0OTk3My41NzUyMy5xbUB3ZWIxMTA0MTMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDc5NzcwNTk0MDkxMTAyMTEzN3M3NTFjOTRiNWk2ZmQ3OTM5NDUwYTE1ZjBiQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPiAgPEY5Q0EwMzI3LTFBMjYtNDVCRS04Mjg5LUQxMUU0OTk1MEEwNEBTYW5kcmFkb2RkLmNvbT4gPDc5NzcwNTk0MDkxMTAyMTEzN3M3NTFjOTRiNWk2ZmQ3OTM5NDUwYTE1ZjBiQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":48283,"nextInTopic":48290,"prevInTime":48286,"nextInTime":48288,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"***Wow! Thanks for the support. Not sure that I m gonna stick around. I enjoy unschooling too much to be beat up because I can t measure up to your idea of","messageBody":"<div id=\"ygrps-yiv-655167975\">***Wow! Thanks for the &quot;support.&quot; Not sure that I&#39;m gonna stick around. I<br/>\nenjoy unschooling too much to be beat up because I can&#39;t measure up to your<br/>\nidea of unschooling perfection. Thanks, though, for making me realize that<br/>\nsomeone I really looked up to prior to this is actually only looking for<br/>\napostles to nod on cue.***<br/>\n <br/>\nWow!  Really?  You&#39;re a few months into it and you&#39;re being very defensive.  Unschooling takes a while to really get into practice, it takes many defensive moments to learn from and change.  My oldest is 15.  We came to unschooling when she was 5, it&#39;s been years in the making.<br/>\n<br/>\nThere have been many times when I&#39;ve said something and people have called me on it.... THOSE are the learning moments, those are the things that I need to examine the most.  That feeling of defensiveness is the first clue that I&#39;m onto something that I need to change big time!<br/>\n <br/>\nIf Sandra hadn&#39;t said what she said, I would&#39;ve said something VERY similar, because I had the very same thoughts go through my head about how you described food and how you portrayed what was happening in your household.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257196541","msgId":48292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGRkM0NEE5LTExQTgtNDE0RC1CM0E3LUVGNEYwQzY1N0MzNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5NzcwNTk0MDkxMTAyMTEzN3M3NTFjOTRiNWk2ZmQ3OTM5NDUwYTE1ZjBiQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPiA8RjlDQTAzMjctMUEyNi00NUJFLTgyODktRDExRTQ5OTUwQTA0QFNhbmRyYWRvZGQuY29tPiA8Nzk3NzA1OTQwOTExMDIxMTM3czc1MWM5NGI1aTZmZDc5Mzk0NTBhMTVmMGJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":48290,"nextInTopic":48293,"prevInTime":48291,"nextInTime":48293,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=-How long did it take your kids to eat real  food?-=- Thinking of some foods as real and others as any form of unreal is going to be as much a problem as","messageBody":"<div id=\"ygrps-yiv-2117606481\">-=-How long did it take your kids to eat &quot;real&quot;  food?-=-<br/>\n<br/>\nThinking of some foods as &quot;real&quot; and others as any form of unreal is  <br/>\ngoing to be as much a problem as dividing the world into fun and  <br/>\nlearning, as though they were separate things.<br/>\n<br/>\nA point like that shouldn&#39;t crush the feelings of anyone old enough to  <br/>\nbe a mother, or anyone bright enough to consider unschooling.   A  <br/>\npoint like that can, and will, and does regularly help someone make  <br/>\nanother level toward &quot;beating the game&quot; of deschooling.   It&#39;s not  <br/>\neasy for people to recover from ten or twenty years of schooling, but  <br/>\npeople do it.  They don&#39;t do it from being supported to stay where  <br/>\nthey are and be satisfied with muddly thinking and negativity, though.<br/>\n<br/>\nMy children ate real food when they started nursing.  They ate real  <br/>\nfood when they tasted mashed foods off the ends of people&#39;s fingers,  <br/>\nor strained fruit.  They ate real food when they tasted other people&#39;s  <br/>\nfood when they were toddlers but weren&#39;t forced to taste it, nor  <br/>\npressed to finish it.   They have always eaten real food, their whole  <br/>\nlives.<br/>\n<br/>\nStories of hundreds of kids are here and at links from this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot;  food?","postDate":"1257195611","msgId":48283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5MzczN0ZDLUIyNkUtNEFERi1CNEQxLThFREFERDNFMUQ0MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5NzcwNTk0MDkxMTAyMTEzN3M3NTFjOTRiNWk2ZmQ3OTM5NDUwYTE1ZjBiQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPiA8RjlDQTAzMjctMUEyNi00NUJFLTgyODktRDExRTQ5OTUwQTA0QFNhbmRyYWRvZGQuY29tPiA8Nzk3NzA1OTQwOTExMDIxMTM3czc1MWM5NGI1aTZmZDc5Mzk0NTBhMTVmMGJAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":48282,"nextInTopic":48287,"prevInTime":48282,"nextInTime":48284,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=-Wow! Thanks for the support. -=- This list is for the discussion of ideas. The support is here: http://sandradodd.com/support Seriously, that s the kind","messageBody":"<div id=\"ygrps-yiv-1568012732\">-=-Wow! Thanks for the &quot;support.&quot;-=-<br/>\n<br/>\nThis list is for the discussion of ideas.<br/>\n<br/>\nThe &quot;support&quot; is here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/support\">http://sandradodd.com/support</a><br/>\n<br/>\nSeriously, that&#39;s the kind of support people often think they want.   <br/>\nThen they come back here for some useful information and ideas.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288459805,"authorName":"Jerritt Dayhoff","from":"Jerritt Dayhoff &lt;jerritthooper@...&gt;","profile":"jerrittdayhoff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot; \tfood?","postDate":"1257190654","msgId":48282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5NzcwNTk0MDkxMTAyMTEzN3M3NTFjOTRiNWk2ZmQ3OTM5NDUwYTE1ZjBiQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEY5Q0EwMzI3LTFBMjYtNDVCRS04Mjg5LUQxMUU0OTk1MEEwNEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPgkgPEY5Q0EwMzI3LTFBMjYtNDVCRS04Mjg5LUQxMUU0OTk1MEEwNEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48275,"nextInTopic":48283,"prevInTime":48281,"nextInTime":48283,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"Wow!  Thanks for the support.  Not sure that I m gonna stick around.  I enjoy unschooling too much to be beat up because I can t measure up to your idea of","messageBody":"<div id=\"ygrps-yiv-708694090\">Wow!  Thanks for the &quot;support.&quot;  Not sure that I&#39;m gonna stick around.  I<br/>\nenjoy unschooling too much to be beat up because I can&#39;t measure up to your<br/>\nidea of unschooling perfection.  Thanks, though, for making me realize that<br/>\nsomeone I really looked up to prior to this is actually only looking for<br/>\napostles to nod on cue.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Nov 2, 2009 at 10:54 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-I wasn&#39;t a great veggie eater when I was young. My parents were<br/>\n&gt; hippies and very hands off -- no rules, no restrictions-=-<br/>\n&gt;<br/>\n&gt; Do you think there are, in the world some &quot;Great Veggie Eaters&quot;? I<br/>\n&gt; was thinking more about the odd disjointness of the descriptions of<br/>\n&gt; food. It was like a swirl of attitudes and emotions. And many people<br/>\n&gt; do live in a swirl of contradictory messages about what is &quot;good food&quot;<br/>\n&gt; and &quot;bad food&quot; and about &quot;self control&quot; and &quot;good eaters.&quot; Eating<br/>\n&gt; shouldn&#39;t be a contest. Sometimes it is.<br/>\n&gt;<br/>\n&gt; I was at rehab this morning, for my leg. Two more sessions and I<br/>\n&gt; &quot;graduate.&quot;<br/>\n&gt; That&#39;s the only place I see the news. Last week some people died of<br/>\n&gt; dehydration, and someone&#39;s in trouble.<br/>\n&gt; This week, someone died of drinking too much water, and someone&#39;s in<br/>\n&gt; trouble.<br/>\n&gt;<br/>\n&gt; When people accept the skewed idea that they should eat or drink what<br/>\n&gt; others tell them to, when others tell them to, because others told<br/>\n&gt; them to (or not to) that&#39;s not healthy. But our culture is so<br/>\n&gt; screwed up with what&#39;s okay for which people when, where and why that<br/>\n&gt; many people don&#39;t have a CLUE what their body needs.<br/>\n&gt;<br/>\n&gt; One of the stories I learned in a psychology class in college was that<br/>\n&gt; any substance can kill a person, even drinking too much water. The<br/>\n&gt; case study was a woman whose father had died, and she started drinking<br/>\n&gt; water. I don&#39;t know why. I don&#39;t think he died of dehydration. But<br/>\n&gt; she drank water in such quantity and so quickly in those first two<br/>\n&gt; days after he died that she drowned from the inside, basically. So<br/>\n&gt; there&#39;s something I learned in college that would have saved my<br/>\n&gt; life. And maybe saved some other people&#39;s lives if I had been where<br/>\n&gt; there was a water drinking contest. I would have had no hesitation at<br/>\n&gt; all about walking up and telling the DJs that one of those people<br/>\n&gt; could die.<br/>\n&gt;<br/>\n&gt; Most people are afraid and so used to being controlled and so used to<br/>\n&gt; letting other people do their thinking that they have forgotten how to<br/>\n&gt; think clearly (if they ever could) and how to make simple little<br/>\n&gt; decisions (if they ever had the chance to even try it, as kids or<br/>\n&gt; young adults).<br/>\n&gt;<br/>\n&gt; I was very happy at rehab and could do all the exercises they had me<br/>\n&gt; do, and they added some new ones. I don&#39;t mind watching TV while I&#39;m<br/>\n&gt; there doing them, either, but I wish there were more shows about<br/>\n&gt; people thinking clearly and making great decisions.<br/>\n&gt;<br/>\n&gt; Here are some stories to take the bad taste of too much or too little<br/>\n&gt; water out of your mouth, if you need:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.goodnewsnetwork.org/\">http://www.goodnewsnetwork.org/</a><br/>\n&gt; The archive of some of the recent e-mail newsletters is here:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aweber.com/z/article/?gnn-newsletter\">http://www.aweber.com/z/article/?gnn-newsletter</a><br/>\n&gt;<br/>\n&gt; (I don&#39;t think &quot;a cure for grey hair&quot; is necessarily good news,<br/>\n&gt; though. A &quot;cure&quot; for people scrambling to pretend to be younger than<br/>\n&gt; they are might be better. Surely would involve fewer dangerous<br/>\n&gt; chemicals, I&#39;m sure.)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot; food?","postDate":"1257180840","msgId":48275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY5Q0EwMzI3LTFBMjYtNDVCRS04Mjg5LUQxMUU0OTk1MEEwNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPg=="},"prevInTopic":48274,"nextInTopic":48282,"prevInTime":48274,"nextInTime":48276,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=-I wasn t a great veggie eater when I was young. My parents were hippies and very hands off -- no rules, no restrictions-=- Do you think there are, in the","messageBody":"<div id=\"ygrps-yiv-821017468\">-=-I wasn&#39;t a great veggie eater when I was young. My parents were  <br/>\nhippies and very hands off -- no rules, no restrictions-=-<br/>\n<br/>\nDo you think there are, in the world some &quot;Great Veggie Eaters&quot;?  I  <br/>\nwas thinking more about the odd disjointness of the descriptions of  <br/>\nfood.  It was like a swirl of attitudes and emotions.  And many people  <br/>\ndo live in a swirl of contradictory messages about what is &quot;good food&quot;  <br/>\nand &quot;bad food&quot; and about &quot;self control&quot; and &quot;good eaters.&quot;   Eating  <br/>\nshouldn&#39;t be a contest.  Sometimes it is.<br/>\n<br/>\nI was at rehab this morning, for my leg.  Two more sessions and I  <br/>\n&quot;graduate.&quot;<br/>\nThat&#39;s the only place I see the news.  Last week some people died of  <br/>\ndehydration, and someone&#39;s in trouble.<br/>\nThis week, someone died of drinking too much water, and someone&#39;s in  <br/>\ntrouble.<br/>\n<br/>\nWhen people accept the skewed idea that they should eat or drink what  <br/>\nothers tell them to, when others tell them to, because others told  <br/>\nthem to (or not to) that&#39;s not healthy.   But our culture is so  <br/>\nscrewed up with what&#39;s okay for which people when, where and why that  <br/>\nmany people don&#39;t have a CLUE what their body needs.<br/>\n<br/>\nOne of the stories I learned in a psychology class in college was that  <br/>\nany substance can kill a person, even drinking too much water.  The  <br/>\ncase study was a woman whose father had died, and she started drinking  <br/>\nwater.  I don&#39;t know why.  I don&#39;t think he died of dehydration.  But  <br/>\nshe drank water in such quantity and so quickly in those first two  <br/>\ndays after he died that she drowned from the inside, basically. So  <br/>\nthere&#39;s something I learned  in college that would have saved my  <br/>\nlife.  And maybe saved some other people&#39;s lives if I had been where  <br/>\nthere was a water drinking contest.  I would have had no hesitation at  <br/>\nall about walking up and telling the DJs that one of those people  <br/>\ncould die.<br/>\n<br/>\nMost people are afraid and so used to being controlled and so used to  <br/>\nletting other people do their thinking that they have forgotten how to  <br/>\nthink clearly (if they ever could) and how to make simple little  <br/>\ndecisions (if they ever had the chance to even try it, as kids or  <br/>\nyoung adults).<br/>\n<br/>\nI was very happy at rehab and could do all the exercises they had me  <br/>\ndo, and they added some new ones.   I don&#39;t mind watching TV while I&#39;m  <br/>\nthere doing them, either, but I wish there were more shows about  <br/>\npeople thinking clearly and making great decisions.<br/>\n<br/>\nHere are some stories to take the bad taste of too much or too little  <br/>\nwater out of your mouth, if you need:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.goodnewsnetwork.org/\">http://www.goodnewsnetwork.org/</a><br/>\nThe archive of some of the recent e-mail newsletters is here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aweber.com/z/article/?gnn-newsletter\">http://www.aweber.com/z/article/?gnn-newsletter</a><br/>\n<br/>\n(I don&#39;t think &quot;a cure for grey hair&quot; is necessarily good news,  <br/>\nthough.  A &quot;cure&quot; for people scrambling to pretend to be younger than  <br/>\nthey are might be better.  Surely would involve fewer dangerous  <br/>\nchemicals, I&#39;m sure.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How long did it take your kids to eat &quot;real&quot; food?","postDate":"1257180031","msgId":48274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwRDFDNDVCLTI3NDItNDBEMC1BRUZGLUU5QzA4RDA2QTA0OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPg==","referencesHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPg=="},"prevInTopic":48268,"nextInTopic":48275,"prevInTime":48273,"nextInTime":48275,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"-=- We love the outcome. Love what it is doing for our family. Love the togetherness.-=- You ve contradicted yourself all in one paragraph.   I was pretty ","messageBody":"<div id=\"ygrps-yiv-718728446\">-=- We love the outcome. Love what it is doing for our family. Love  <br/>\nthe togetherness.-=-<br/>\n<br/>\nYou&#39;ve contradicted yourself all in one paragraph.   I was pretty  <br/>\nhappy to read that you were loving the outcome.<br/>\nI was confused, then to read this:<br/>\n<br/>\n-=-Eventually, I learned to like veggies, so I am probably worrying  <br/>\nfor nothing, but I worry nonetheless because they are living on crap  <br/>\nright now.<br/>\n-=-<br/>\n<br/>\nIf you&#39;re thinking of any food as &quot;crap&quot; and if you&#39;re thinking your  <br/>\nkids are eating &quot;crap,&quot; things aren&#39;t going as well as you think they  <br/>\nare.  Or maybe, as often happens, your understanding has moved ahead  <br/>\nof your verbal ability.  It happens with little kids all the time. &lt;g&gt;<br/>\n<br/>\nHere&#39;s how it happens with moms:  We have voices and phrases in our  <br/>\nheads that aren&#39;t coming from a mindful place of actual thought.  It&#39;s  <br/>\nas though there are scripts we can fall into and continue a  <br/>\nconversation on auto-pilot.   It&#39;s as dangerous to do that as it is to  <br/>\ndrive a car without remembering where you meant to go.  It&#39;s not as  <br/>\nphysically dangerous; you&#39;re unlikely to kill a stranger or destroy a  <br/>\ncar.   You&#39;re in danger of ruining unschooling&#39;s chance of survival at  <br/>\nyour house, though, and of wounding your children and your family&#39;s  <br/>\npeace.<br/>\n<br/>\nYour children are not living on crap.  Take that back, in your head  <br/>\nand in your heart.   You told a thousand strangers your kids are  <br/>\nliving on crap, even though you were a kid who wasn&#39;t crazy about  <br/>\nvegetables either.  You said when you put a monkey platter out (when  <br/>\nyou &quot;tried&quot; one--what&#39;s to try?  DO IT!  More than once) they ate the  <br/>\nmeat and crackers.  That&#39;s good!  There are people forcing their kids  <br/>\nto eat meat and crackers all over the world right now.  Yours did it  <br/>\njoyfully.<br/>\n<br/>\nHere are some examples of the kinds of things moms will think, and say  <br/>\nand write (and re-read and still post) about their own beloved children:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/phrases\">http://sandradodd.com/phrases</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifilet\">http://sandradodd.com/ifilet</a><br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":288459805,"authorName":"Jerritt","from":"&quot;Jerritt&quot; &lt;jerritthooper@...&gt;","profile":"jerrittdayhoff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"How long did it take your kids to eat &quot;real&quot; food?","postDate":"1257169151","msgId":48268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjbW5kditiaGRzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48274,"prevInTime":48267,"nextInTime":48269,"topicId":48268,"numMessagesInTopic":0,"msgSnippet":"So about two months ago we lifted pretty much any and all restrictions, including food.  Complete foray into radical unschooling.  We love the outcome.  Love","messageBody":"<div id=\"ygrps-yiv-1281202760\">So about two months ago we lifted pretty much any and all restrictions, including food.  Complete foray into radical unschooling.  We love the outcome.  Love what it is doing for our family.  Love the togetherness.  My kids, though, are still pretty much eating like they are at a carnival everyday.  Lots of fruit snacks (when we have them), candy, popcorn, chips, treats.  They really never eat an actual meal.  Never eat vegetables, and only occasionally eat fruit. We tried the monkey platter.  They tend to pick off any meats and/or crackers on there and leave the rest.  Sometimes they will eat the apples.  I guess I am just looking for some reassurance that at some point a vegetable may pass their lips again.  I wasn&#39;t a great veggie eater when I was young.  My parents were hippies and very hands off -- no rules, no restrictions.  Eventually, I learned to like veggies, so I am probably worrying for nothing, but I worry nonetheless because they are living on crap right now.</div>","specialLinks":[]}],"prevTopicId":48506,"nextTopicId":48446}}