{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"HEM-Online-Newsletter  by way of Home Ed","from":"HEM-Online-Newsletter &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  June 2002","postDate":"1022950514","msgId":38021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk0MGI5MWVhY2UxNWFkNkBbMjA4LjI2LjIzNS40M10+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":38020,"nextInTime":38022,"topicId":38021,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS June 2002 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS! For more","messageBody":"<div id=\"ygrps-yiv-359590312\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nJune 2002<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS! For more information on Home Education <br/>\nMagazine, visit our web site at http://home-ed-magazine.com. Send <br/>\nyour comments and questions to editor Carol Narigon at <br/>\nHEM-Newsletter@....<br/>\n<br/>\nIn the June issue:<br/>\n<br/>\n~ H is for Homeschooling ~<br/>\n~ Congratulations, Calvin! ~<br/>\n~ Advice Needed ~<br/>\n~ Bad Science? ~<br/>\n~ Unschooling ~<br/>\n~ HEM Lists-New and Revised ~<br/>\n~ Beyond the Movie ~<br/>\n~ Building a Website ~<br/>\n~ The Final Word ~<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\n&quot;I tell you one thing, if you learn it by yourself, if you have to <br/>\nget down and dig for it, it never leaves you. It stays there as long <br/>\nas you live because you had to dig it out of the mud before you <br/>\nlearned what it was.&quot; ~ Aunt Adie ~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nH IS FOR HOMESCHOOLING<br/>\nhttp://www.home-ed-magazine.com/HEM/193.html<br/>\n<br/>\n&quot;A is for the Adults who can share their talents with children and <br/>\nhelp them discover the joy of learning. They are parents, neighbors, <br/>\nfriends, grandparents, teachers, aunts, uncles, and anyone else <br/>\nwilling to share their gifts with children.<br/>\n<br/>\nB is for the thousands of Books that we can read and learn from. Quot <br/>\nlibros, quam breve tempus! (So many books, so little time!)<br/>\n<br/>\nC is for College. Yes, homeschoolers can go to college without a <br/>\ndiploma from a public or private school. If it is your goal to attend <br/>\ncollege, it is possible. Many colleges actively seek homeschool <br/>\napplicants.<br/>\n<br/>\nD is for the Dictionary that is always available to help us learn how <br/>\nto spell a word or understand the meaning of a new word that we find <br/>\nin one of the thousands of books that we read as homeschoolers.<br/>\n<br/>\nE is for Experiences. Education as a homeschooler is full of real <br/>\nlearning experiences like swimming with manatees, banding wood ducks, <br/>\nturning your garage into a puppet theater, starting your own <br/>\nbusiness, writing things that are important to you in your journal, <br/>\ncreating a chemistry lab in your kitchen, using a dictionary to spell <br/>\nwords with, and reading books for fun.<br/>\n<br/>\nF is for Family. Homeschool families have a closer relationship with <br/>\neach other. They enjoy spending time together. They do many things <br/>\ntogether. They read together. They play games together. They go <br/>\nhiking together. They do puzzles together. They play music together. <br/>\nThey cook dinner together.<br/>\n<br/>\nG is for the Grades that homeschoolers do not have to worry about. <br/>\nYou do not have to learn to spell to get a passing grade. You learn <br/>\nto spell because you ask your parent how do you spell &quot;chocolate.&quot; <br/>\nYou can make a mistake on a math problem, learn from it and not worry <br/>\nabout failing the test. You do not have to memorize and regurgitate <br/>\nfacts for a history test grade, but you can study and learn about any <br/>\ntopic in history that interests you.<br/>\n<br/>\nH is for Homeschoolers, from those who have been teaching their <br/>\nchildren from before there were school institutions to modern day <br/>\nhomeschoolers who have eased the way for new parents to regain the <br/>\nfreedom of choice for the education of their children...&quot; ~ Scott <br/>\nStevens ~<br/>\n<br/>\nYou can read the rest of this alphabet, as well as some of the <br/>\narticles and columns from the May/June issue at the address above, <br/>\nbut you&#39;ll have to get the magazine--the one you hold in your <br/>\nhands--to read them all! See subscription information at the end of <br/>\nthis newsletter or visit your local bookseller to get your copy today.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\nhttp://www.home-ed-magazine.com<br/>\n<br/>\nWith the May/June issue of HEM, we welcome Elizabeth McCullough as <br/>\nour homeschool books columnist. In her first column, Elizabeth <br/>\nreviews books on homeschooling an ADD child, unschooling and <br/>\nhomeschooling on a shoestring. Welcome, Elizabeth!<br/>\n<br/>\nThe May/June issue also features articles on Riding the Rainbow, <br/>\nLeaping into Brambles, help calls, focusing on your child&#39;s strengths <br/>\nand more.  From the columnists: the Kaseman&#39;s highlight problems with <br/>\npublic e-schools; Becky Rupp is full of beans; David Albert tests <br/>\n1...2...3...; Sandra Dodd stays up late to learn; and Carol Narigon <br/>\n(that&#39;s me) discusses unschooling. Other columnists include Barbara <br/>\nTheisen, Ann Zeise, Peter Kowalke, Linda Dobson, and Laura Weldon.<br/>\n<br/>\nSPECIAL FATHER&#39;S DAY OFFER!!!<br/>\n<br/>\nIf Dad works out of the house it&#39;s not going to be easy for him to <br/>\ngain an understanding of homeschooling. A subscription to HEM can <br/>\nhelp. HEM is offering the best discount of the year on a subscription <br/>\nto Home Education Magazine: HEM Online News readers can start a one <br/>\nyear subscription for only $20.00! (Reg. $32.00) Write to Home <br/>\nEducation Magazine, PO Box 1083, Tonasket WA 98855; for orders: <br/>\ntoll-free 1-800-236-3278; email orders@.... MC/Visa <br/>\ncards accepted. Or see <br/>\nhttp://www.home-ed-magazine.com/ORD/_fathersday.html<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nCONGRATULATIONS, CALVIN!<br/>\nhttp://www.nationalgeographic.com/geographybee/2002.html<br/>\n<br/>\nCongratulations to 10-year-old homeschooler Calvin McCarter, winner <br/>\nof the National Geographic Bee. Calvin hails from Grand Rapids, <br/>\nMichigan and was the youngest competitor in the contest. He won a <br/>\n$25,000 scholarship and a lifetime membership to the National <br/>\nGeographic Society. Look for the televised finals on your local PBS <br/>\nstation.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nADVICE NEEDED<br/>\n<br/>\nQuestions for the September/October issue of Home Education <br/>\nMagazine&#39;s Questions and Answers column:<br/>\n<br/>\n&quot;We had to take our son out of school two years ago due to a chronic <br/>\ndigestive disease.  The school system provides an in-home tutor. <br/>\nDespite our efforts his former school pals have gone on with their <br/>\nown busy lives and left him behind. He&#39;s 11 years old now. I&#39;m <br/>\nconcerned he may become depressed as adolescence approaches. Are <br/>\nthere safe &#39;chat rooms&#39; for homeschooled kids? How could we invite <br/>\nhomeschooled kids his age over to swim in our pool over the summer if <br/>\nthe school system won&#39;t release the names of other homeschoolers?&quot; ~ <br/>\nColton Sellers ~<br/>\n<br/>\n&quot;We approach most subjects actively, but my kids prefer watching <br/>\nmovies for history and social studies. When we watched &#39;The Patriot,&#39; <br/>\nthey talked about the Revolutionary War and imagined themselves there <br/>\nfar more effectively than after any book we&#39;ve read.  (Caution: It <br/>\nwas violent, as could be expected in a war movie.) Anyone have other <br/>\nsuggestions for movies?&quot; ~ Karen ~<br/>\n<br/>\nTo answer a question, or propose your own question, please write to <br/>\nLaura Weldon via ReaderResponse@... or Questions & <br/>\nAnswers, c/o Home Education Magazine, PO Box 1083, Tonasket, WA <br/>\n98855. Your responses must meet our deadline of the 1st. Please <br/>\nrecognize that your submission may be edited for length or clarity. <br/>\nIndicate how you prefer your question or answer signed. Questions and <br/>\nAnswers runs in each issue of Home Education Magazine and can be <br/>\nfound on our website.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBAD SCIENCE?<br/>\n<br/>\nI&#39;m so grateful for those smart people who find the mistakes in <br/>\nscience textbooks and even commonly held knowledge and let the rest <br/>\nof us know how the real science works. I really thought friction was <br/>\ncaused by the roughness; turns out I was wrong! And how about zero <br/>\ngravity in space? Do you believe that one? I did too!  Ben Franklin&#39;s <br/>\nkite was struck by lightning, right? Nope. Not true.<br/>\n<br/>\nIf you really want to know your science, take a look at this <br/>\ndebunking site. Your kids will be so impressed with your new <br/>\nknowledge, but you may have to take them there to prove you&#39;re right! <br/>\nhttp://www.amasci.com/miscon/miscon.html<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\nhttp://www.unschooling.com<br/>\n<br/>\n&quot;&#39;What do you hope your kids will have gotten from unschooling by the <br/>\ntime they&#39;re ready to move on from home?&#39;<br/>\n<br/>\nMy main goal is that their sense of self remain so strongly intact <br/>\nthe world can&#39;t rob their joy, their uniqueness and their natural <br/>\ncuriosity. Beyond that...<br/>\n<br/>\n...the status quo won&#39;t matter so much to them as what is good and right.<br/>\n<br/>\n...they will have a deep-seated knowledge in their hearts that they <br/>\nare intelligent, capable human beings and can learn anything they <br/>\nwish and a sense of wonder so awesome they will never quit seeing how <br/>\nmagical the world truly is.<br/>\n<br/>\n...their idealism be tempered with realism and spirituality will flow <br/>\nnaturally and freely from a loving heart and kindness rare.<br/>\n<br/>\n...they will be able to follow their dreams and goals, whatever those may be.<br/>\n<br/>\n&#39;And how do you plan to help that along?&#39;<br/>\n<br/>\nIt humbles me to think about this. I came out of high school <br/>\nemotionally battered, not knowing who I was or what I really wanted. <br/>\nFifteen years later, I&#39;m spouting ideals for my children I couldn&#39;t <br/>\nhave dreamed of then. I will help that along by becoming a better <br/>\nperson myself...<br/>\n<br/>\n...by reading, watching, searching and regaining that sense of wonder <br/>\n(they&#39;ve helped me do this already).<br/>\n<br/>\n...by being willing to set everything aside, change plans midstream <br/>\nand go off in a new direction when necessary.<br/>\n<br/>\n...by listening carefully and responding appropriately.<br/>\n<br/>\n...by dialoguing with them about these matters of the heart and <br/>\nshowing love to the earth and my fellow human beings.<br/>\n<br/>\n...by filling my home with books, movies, music, instruments, nature, <br/>\ntoys, art materials and whatever oddities my children bring home.<br/>\n<br/>\n...by taking them to the places they want to go and ones they never <br/>\nknew existed, fixing them new and exciting foods from other countries <br/>\nand making trips to the grocery store an adventure.<br/>\n<br/>\nHealing myself has definitely been the most important step in <br/>\nassisting these worthy individuals in their unschooling journey. I <br/>\nhave learned much from them; thank the heavens they came here to <br/>\nteach me.&quot; ~~ Ren, on the uschooling.com message boards ~~<br/>\n<br/>\nUnschooling.com offers a free monthly newsletter, message boards, an <br/>\nemail list and more just for unschoolers. To subscribe to the email <br/>\nlist send a blank email to: <br/>\nUnschooling-dotcom-subscribe@yahoogroups.com<br/>\nOr visit the email list website at: <br/>\nhttp://groups.yahoo.com/group/Unschooling-dotcom .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nTRUSTING THE CHILDREN, TRUSTING OURSELVES<br/>\nThe 2002 California Home=Education Conference<br/>\nAugust 16-18, Radisson Hotel Sacramento.<br/>\n<br/>\nA weekend of inspiring talks, workshops, and fun activities for <br/>\neveryone in the family! Keynotes: Jane Healy and Frank Smith. <br/>\nFeatured speakers: Mary Griffith, David Albert, Sandra Dodd, Richard <br/>\nPrystowsky, Marty Layne, Laurel Schmidt, Donald Asher, Wes Beach, <br/>\nLenore Hayes and Roneale Berry.  Delightful programs for teens, <br/>\ntweens and kids, as well as new panels and lots of round table <br/>\ndiscussions among homeschoolers. http://conference.hsc.org, or email <br/>\nconference@... or info@....<br/>\n<br/>\n  &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM LISTS-NEW AND OLD<br/>\n<br/>\nHEM is offering two new email lists for those who are interested in <br/>\ndiscussing unschooling or national news. Please feel welcome to join <br/>\nin!<br/>\n<br/>\nHEM-Unschooling<br/>\nThis list is for discussion of unschooling hows and whys, wherefores <br/>\nand methods, sharing good resources, and so on and so forth. <br/>\nSponsored by Home Education Magazine. <br/>\nhttp://www.groups.yahoo.com/group/HEM-Unschooling<br/>\n<br/>\nHEM-NationalNews<br/>\nThis list is for the discussion of news not necessarily related to <br/>\nhomeschooling. Have you read something in your local newspaper or a <br/>\nnational magazine, or found something online recently which might not <br/>\nhave had much to do with homeschooling but which really made you <br/>\nthink? Share it with other homeschooling parents on this list.<br/>\nhttp://www.groups.yahoo.com/group/HEM-NationalNews<br/>\n<br/>\nSeveral of HEM&#39;s other email lists have undergone a name change or <br/>\nhave been pulled and archived. If you are on those lists, you were <br/>\nnotified a couple of weeks ago and your subscription automatically <br/>\nswitched over. If you haven&#39;t joined and you&#39;d like to, here&#39;s how to <br/>\nfind these updated lists.<br/>\n<br/>\nThe PPSP-H (Public and Private School Programs and Homeschooling) <br/>\nlist is now HEM-EdPrograms. <br/>\nhttp://www.groups.yahoo.com/group/HEM-EdPrograms<br/>\n<br/>\nThe HomeschoolingMovieLovers list is now HEM-MovieLovers.<br/>\nhttp://www.groups.yahoo.com/group/HEM-MovieLovers<br/>\n<br/>\nThe HomeschoolingResources list is now HEM-Resources.<br/>\nhttp://www.groups.yahoo.com/group/HEM-Resources<br/>\n<br/>\nThe History of Homeschooling list is now HEM-HomeschoolHistory.<br/>\nhttp://www.groups.yahoo.com/group/HEM-HomeschoolHistory<br/>\n<br/>\nOne list, the Homeschool History-Politics-Religion list, is being <br/>\narchived and will eventually be deleted. Both this one and History of <br/>\nHomeschooling have been dormant for several months now, but I&#39;d like <br/>\nto take the whole conversation back to the HomeschoolHistory list at <br/>\nsome point.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBEYOND THE MOVIE<br/>\nhttp://www.nationalgeographic.com/ngbeyond <br/>\nhttp://plasma.nationalgeographic.com/pearlharbor/ngbeyond<br/>\n<br/>\nNational Geographic offers a cool section on their website called <br/>\nBeyond the Movie. Right now you can explore Lord of the Rings and <br/>\nPearl Harbor. For example, on the Lord of the Rings page on the <br/>\nauthor, the mythology that influenced the books, where particular <br/>\nnames came from and more.<br/>\n<br/>\nI&#39;m not sure why only 2 movies are offered, but I hope they&#39;ll <br/>\ncontinue to investigate other popular movies in the future.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBUILDING A WEBSITE<br/>\n<br/>\nSo it&#39;s too hot to play outside and your kids want to stay cool <br/>\ninside creating a web page, and you don&#39;t know the first thing about <br/>\nit? You can find lots of help on the Internet for both you and your <br/>\nkids. For learning HTML, check out Learning HTML for Kids at <br/>\nhttp://www.goodellgroup.com/tutorial . You know how kids&#39; books are <br/>\noften the best way to learn about a particular topic? Same with <br/>\nwebsites. This one is easy to understand and will give you a good <br/>\nstart on learning the language.<br/>\n<br/>\nIf you&#39;re ready to move on to a site that&#39;s a little more advanced, <br/>\ncheck out the monkey at http://hotwired.lycos.com/webmonkey/kids . <br/>\nThere&#39;s even a planning guide on this site so adults can act like <br/>\nthey know what they&#39;re doing.<br/>\n<br/>\nFinally, for a really cute, yet informational site, try Lissa <br/>\nExplains It All at http://www.lissaexplains.com . I think this site <br/>\nwould especially appeal to girls, but the information is good for <br/>\neveryone.<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at <br/>\nHEM-Newsletter@....<br/>\n<br/>\n________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nNew science and art books for spring and summer are in...several new <br/>\nseries to engage and delight your children and you. Shop online and <br/>\nearn FREE books at: http://www.UsborneAmerica.com. For personal <br/>\nshopping service, email SharonVE@... or call 888-474-8499 toll <br/>\nfree. Sharon Vander Ende, Supervisor, Usborne America.<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\ngnarlymath.com<br/>\n<br/>\nMATH IN ANCIENT CAVE PAINTINGS, 26172 BC. The latest issue of our <br/>\nfree hilarious math newsletter shows that the cave paintings in <br/>\nancient France prove Cro-Magnon men computed areas! Show your <br/>\nchildren how much fun math can be, and refresh your own math by <br/>\nsubscribing to our free newsletter and by downloading  free examples <br/>\nof our CD-ROM Solid Gold Gnarly Math. It&#39;s all at <br/>\nhttp://www.gnarlymath.com . Our moneyback-guaranteed CD will help you <br/>\nreview Algebra, Geometry, Trig, Topology, and Probability.<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nAttention unschoolers and eclectic homeschoolers! Looking for <br/>\nsomething to do? The Resourceful Homeschooler carries great books, <br/>\nscience materials and kits, learning games, and the most interesting <br/>\nsoftware. AND here is your opportunity to clear some shelf space! <br/>\nList or consign your surplus or used homeschooling materials. Store <br/>\ncredit available for consignments. Visit <br/>\nhttp://www.resourcefulhomeschooler.com or call (877)523-0494. <br/>\nMaterials to involve, inspire and support independent learners of all <br/>\nages!<br/>\n_________<br/>\n<br/>\n<br/>\nTEACH YOUR CHILD TO READ!  TRY ONLINE LESSONS NOW FOR FREE!<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading <br/>\nprogram that will give your child a real advantage by systematically <br/>\nteaching essential skills and strategies ensuring reading success and <br/>\nconfidence. Outstanding fast results!  After just five 20-minute <br/>\nanimated, interactive episodes, children read their first Headsprout <br/>\nbook. Act quickly! For a limited time you can try out Headsprout <br/>\nReading FOR FREE!<br/>\nhttp://www.headsprout.com Please enter the promotional code: HENF6<br/>\n_________<br/>\n<br/>\nFREE ONLINE VEGETABLE GARDENING TRAINING FOR HOMESCHOOLERS!<br/>\ngrowfood.com<br/>\n<br/>\nGet world renowned Dr. Jacob R. Mittleider&#39;s &#39;Mittleider Basics <br/>\nCourse&#39; free at www.growfood.com.  Go to Online Education section and <br/>\nenjoy.  Books, Natural Mineral Nutrients & CD ROM&#39;s also available. <br/>\nAlso, look at the Garden Master CD, with $70 in Mittleider gardening <br/>\nbooks and manuals and a great program to take your children through <br/>\nevery step of the gardening process.  Took 3 years & $100,000 to <br/>\ncreate and costs only $29.95.  Look in Products under Garden Master.<br/>\n_________<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\nhttp://www.mamselle.ca/error.html<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To <br/>\nsubscribe, visit our web site at <br/>\nhttp://www.home-ed-magazine.com/wlcm_hemnewsltr.html or send an email <br/>\nto majordomo@... with the words subscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. subscribe hem-online-newsletter <br/>\nyouremailaddress). To unsubscribe, send an email to <br/>\nmajordomo@... with the words unsubscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter <br/>\nyouremailaddress). To change the address at which you receive the <br/>\nnewsletter, unsubscribe your old address and then subscribe to your <br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\nHEM-Newsletter@...<br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":37966,"nextTopicId":38002}}