{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":64419796,"authorName":"Nichole Fausey-Khosraviani","from":"&quot;Nichole Fausey-Khosraviani&quot; &lt;ms_fausey@...&gt;","profile":"ms_fausey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Any input would be helpful","postDate":"1104350890","msgId":101884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMGMwMWM0ZWRlMiQxZWM2ZTZjMCQyZjAyYThjMEBGcmVlZG9tPg==","referencesHeader":"PDAwNTcwMWM0ZTkxNyQ3OTkxNDY2MCQxMjU4YTg0MkBjaGFydGVydG4ubmV0PiA8NDFEMUVEMjYuMzAxMDcwMEBzYmNnbG9iYWwubmV0PiA8MDA1NjAxYzRlZGMyJGEyZmQ4YWUwJDJmMDJhOGMwQEZyZWVkb20+"},"prevInTopic":101874,"nextInTopic":0,"prevInTime":101883,"nextInTime":101885,"topicId":101713,"numMessagesInTopic":0,"msgSnippet":"... From: Nichole Fausey-Khosraviani ******* My husband has been doing mystery shopping for a few months and usually makes close to $400.***** Responding to my","messageBody":"<div id=\"ygrps-yiv-1287981548\"><blockquote><span title=\"qreply\">----- Original Message ----- <br/>\n  From: Nichole Fausey-Khosraviani <br/>\n<br/>\n<br/>\n  ******* My husband has been doing mystery shopping for a few months and usually makes close to $400.*****<br/>\n    <br/>\n<br/>\n  Responding to my own post.  That should have said he makes close to $400/month.  Sorry for any confusion.<br/>\n<br/>\n  Nichole<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":64419796,"authorName":"Nichole Fausey-Khosraviani","from":"&quot;Nichole Fausey-Khosraviani&quot; &lt;ms_fausey@...&gt;","profile":"pseudonna","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Any input would be helpful","postDate":"1104337368","msgId":101874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTYwMWM0ZWRjMiRhMmZkOGFlMCQyZjAyYThjMEBGcmVlZG9tPg==","referencesHeader":"PDAwNTcwMWM0ZTkxNyQ3OTkxNDY2MCQxMjU4YTg0MkBjaGFydGVydG4ubmV0PiA8NDFEMUVEMjYuMzAxMDcwMEBzYmNnbG9iYWwubmV0Pg=="},"prevInTopic":101855,"nextInTopic":101884,"prevInTime":101873,"nextInTime":101875,"topicId":101713,"numMessagesInTopic":0,"msgSnippet":"... From: julie w ****It takes a month or two to get good and you may make on average $10 an hour**** Brandi, I think Julie s advice is great.  Some other","messageBody":"<div id=\"ygrps-yiv-2146818993\"><blockquote><span title=\"qreply\">----- Original Message ----- <br/>\n  From: julie w <br/>\n<br/>\n<br/>\n<br/>\n  ****It takes a month or two to get good and you may make on average $10 an hour****<br/>\n<br/>\n  Brandi, I think Julie&#39;s advice is great.  Some other options you might want to try are eBay, Half.com, and mystery shopping.  Try looking on Volition.com--use their message boards.  My husband has been doing mystery shopping for a few months and usually makes close to $400.  He&#39;s a programmer and has a good job, but has fun doing the mystery shopping.  I don&#39;t know where in TN you live, we live outside a Dallas, but it&#39;s worth a shot.  You can also get free food sometimes, like pizzas, or you can get your meal and one other adult meal reimbursed as some restaurants.  You can get reimbursed haircuts for the kids.  It&#39;s fun for the kids, too.  My daughter is very into spies and she gets a kick out this stuff.  Sometimes the reports are long, so you&#39;ll have to weigh that into the deal, but I bet you&#39;d like it.<br/>\n<br/>\n  For eBay and Half.com.... I lived off of these two sites as a single mom for more than a year.  The turn-around is fast and sometimes you can make a lot of money depending on what you&#39;re selling.  You might want to investigate that, if you haven&#39;t already.  I&#39;m pretty sure you could sell your scrapbooking supplies through eBay too, if you haven&#39;t already.<br/>\n<br/>\n  Don&#39;t give up hope, but really...fast food is the pit of the service industry.  There&#39;s so much more enjoyable work you could do that would benefit your children and yourself.<br/>\n<br/>\n  Warmest regards,<br/>\n  Nichole, in TX<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":135609248,"authorName":"julie w","from":"julie w &lt;jjjwoolfolk@...&gt;","profile":"juliewinar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Any input would be helpful","postDate":"1104276774","msgId":101855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRDFFRDI2LjMwMTA3MDBAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PDAwNTcwMWM0ZTkxNyQ3OTkxNDY2MCQxMjU4YTg0MkBjaGFydGVydG4ubmV0Pg==","referencesHeader":"PDAwNTcwMWM0ZTkxNyQ3OTkxNDY2MCQxMjU4YTg0MkBjaGFydGVydG4ubmV0Pg=="},"prevInTopic":101729,"nextInTopic":101874,"prevInTime":101854,"nextInTime":101856,"topicId":101713,"numMessagesInTopic":0,"msgSnippet":"I wait tables at Cracker Barrel (hate it, chain restaurants have just some of the stupidest rules and I have a hard time keeping my mouth shut) but the money","messageBody":"<div id=\"ygrps-yiv-438033131\">I wait tables at Cracker Barrel (hate it, chain restaurants have just <br/>\nsome of the stupidest rules and I have a hard time keeping my mouth <br/>\nshut) but the money is good. I work wed. 5-9, Sat 8-2, Sun 8-2. Any <br/>\ngiven week I will make anywhere from $150-$200. I only get paid $2.85 an <br/>\nhour but with tips I average about $15 an hour. At a nicer (not &quot;family&quot; <br/>\ntype but with alcohol and more expensive food) you could make even more. <br/>\nI&#39;m not even one of the &quot;cute&quot; gals (skinny, sweet, young things) they <br/>\nmake even more then me.....<br/>\nIf you are already working fast food you are used to being on your feet <br/>\nand manual labor so.....<br/>\nIt takes a month or two to get good and you may make on average $10 an <br/>\nhour that&#39;s still more then fast food or WalMart.<br/>\nI hate my job but I could not go anywhere and make what I do with out <br/>\nmore &quot;skills&quot; or a degree so I stay and play their silly, silly games.<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.298 / Virus Database: 265.6.6 - Release Date: 12/28/2004</div>","specialLinks":[]},{"userId":90027250,"authorName":"Penne & Buddies","from":"&quot;Penne & Buddies&quot; &lt;crrbuddy@...&gt;","profile":"crrbuddy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Any input would be helpful","postDate":"1103929628","msgId":101729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNxaTdldCs3c3VtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNTcwMWM0ZTkxNyQ3OTkxNDY2MCQxMjU4YTg0MkBjaGFydGVydG4ubmV0Pg=="},"prevInTopic":101713,"nextInTopic":101855,"prevInTime":101728,"nextInTime":101730,"topicId":101713,"numMessagesInTopic":0,"msgSnippet":"My DIL is going through this as a new mom -- she s been a floral designer for the past ten years, but got laid off right before the baby was born.  She s been","messageBody":"<div id=\"ygrps-yiv-37635452\">My DIL is going through this as a new mom -- she&#39;s been a floral <br/>\ndesigner for the past ten years, but got laid off right before the <br/>\nbaby was born.  She&#39;s been freelancing and taking the baby with her, <br/>\nbut it&#39;s been difficult, and it&#39;s definitely not paying the bills.  <br/>\nHer cousin recruited her to the Pampered Chef last summer, and she <br/>\ntried that route until the party crowd fizzled out.  We took it up <br/>\npartly to support her efforts and partly as a <br/>\nhomeschool/philanthropy project.  <br/>\n<br/>\nI&#39;ve been a SAHM since my husband gave me the gift of instant <br/>\nmotherhood on our wedding day (he had fulltime custody of his <br/>\npreschooler.)  We tried switching roles a few years later when our <br/>\ndaughter was nearly a year old (I thought they automatically weaned <br/>\non their first birthday...) but I was miserable being away from the <br/>\nkids.  DH got a chance to bond with them for a year, but he knew I <br/>\nwanted to be with the kids and he was restless to get back to work --<br/>\n so we switched back.  <br/>\n<br/>\nFinancially, we&#39;ve only had a couple of rough spots in the past <br/>\ntwenty years of family life (while I was working at a much lower-<br/>\npaying job than his, and another time when we were having some major <br/>\ncommunication problems and outgo outpaced income.)  Both times, we <br/>\nmade the decision to ask our extended family for support (monetarily <br/>\nand/or otherwise) until we could get back on our feet again and <br/>\nfigure out how to make it on one income.  It was tough to do as a <br/>\nmatter of pride, but the alternative (leaving the nursing babies to <br/>\nreturn to work) was unthinkable.<br/>\n<br/>\nNow that our grand-daughter has arrived, our DIL has decided that <br/>\nthe field of floral design is simply not secure enough to provide <br/>\nfor the future and plans to start nursing school in January.  She&#39;s <br/>\nstill nursing the baby (9 months,) believes in attachment parenting, <br/>\nis impressed with homeschooling, but still feels a strong need for <br/>\nindependence, both financially and otherwise.  It&#39;s a tradeoff for <br/>\nher, missing this time with her daughter in order to make sure <br/>\nthings are good for the family later down the road.  <br/>\n<br/>\nI&#39;m personally heartsick to see her make the same mistake that I <br/>\nmade by returning to work/school before the baby has even weaned -- <br/>\nand I was working forty hour weeks with no overtime.  Nursing school <br/>\nis a whole &#39;nother story!  I&#39;ve tried to encourage her to relax and <br/>\nrely on family, both immediate and extended, and enjoy her role as <br/>\nmom for now -- parenting in itself being something that doesn&#39;t get <br/>\nnear enough recognition for its importance to society, let along our <br/>\nown offspring -- but the idea of being out of control amongst so <br/>\nmany unknowns seems too great.  <br/>\n<br/>\nWe&#39;ve learned from our financial ups & downs that once we make up <br/>\nour mind to do what we love and the money will follow -- it always <br/>\ndoes, without fail.  Proof positive that Mrs. Eddy (discoverer of <br/>\nChristian Science) was right when she wrote, &quot;Divine Love always has <br/>\nmet, and always will meet, every human need.&quot; -- Science & Health <br/>\nwith Key to the Scriptures <br/>\n<br/>\nThere&#39;s some great articles along this line of thinking at Healing <br/>\nUnlimited:<br/>\n<br/>\nPLACE <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.christianscience.org/MBE2AHD.htm\">http://www.christianscience.org/MBE2AHD.htm</a><br/>\nSUPPLY <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.christianscience.org/Supply.htm\">http://www.christianscience.org/Supply.htm</a><br/>\nWONDERFUL THINGS ARE HAPPENING<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.christianscience.org/Wonder.html\">http://www.christianscience.org/Wonder.html</a><br/>\n <br/>\nHey, it can&#39;t hurt to think positive, and I think you are on the <br/>\nright track back to fulltime SAHM.  Unschooling&#39;s all about freedom <br/>\nand creativity, not only for our kids, but for ourselves -- and you <br/>\nknow what they say -- if Mama ain&#39;t happy, ain&#39;t nobody happy!  I&#39;m <br/>\npositive that you can work it out.  In the meantime, it sounds like <br/>\nyou could use a little self-empathy and your supervisor could stand <br/>\nfor an introduction to Nonviolent (self-destructive and other <br/>\nhurtful words included) Communication <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cnvc.org\">http://www.cnvc.org</a> <br/>\n<br/>\nHopefully, my DIL will find a way to make things work without <br/>\nleaving her daughter to be raised by relatives and babysitters while <br/>\nshe&#39;s putting in overtime with a demanding career.  Unfortunately, <br/>\nit looks like they&#39;ll be learning the hard way like the rest of <br/>\nus... perhaps our experiences are enough to convince you that there <br/>\nare no &quot;awful&quot; moms, just those of us trying to meet our needs in <br/>\nthe best way we know how.  <br/>\n<br/>\nKeep the faith, hope, and most of all, Love ~ <br/>\nPenne & the Crew<br/>\n<br/>\n&#39;Tis the Season for Giving from the Heart<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://kitchencrew.ardfamilyco-op.net\">http://kitchencrew.ardfamilyco-op.net</a><br/>\n<br/>\nP.S.  The Pampered Chef offers its consultants some excellent <br/>\nmaterials to help with relocating the business, plus a reprieve upon <br/>\nrequest during the transition period.  If you haven&#39;t already taken <br/>\nadvantage of these resources with your Scrapbook/Home Design <br/>\ncompany -- perhaps this will give you another boost in the right <br/>\ndirection.  All the best-PA, aka Ma to all my buddies here at home<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &lt;brandie@s...&gt; wrote:<br/>\n&gt; <br/>\n&gt; I used to be a sahm.  I worked from home designing products for <br/>\nthe scrapbook industry and freelance writing.  I certainly didn&#39;t <br/>\nget rich, but it brought a little money to help.  Last summer, our <br/>\nfamily moved from CA to TN.  The move wiped us out financially, so I <br/>\ntook a job at a local fast food restaurant.  I am miserable -- <br/>\nwithout sounding too childish, my boss is cruel...even borderline <br/>\nabusive.  If I work with her in a given shift (which I usually do), <br/>\nI usually leave work feeling worthless.<br/>\n&gt; <br/>\n&gt; We unschool our three children (ages 14, 12, and 4) -- we love <br/>\nit.  My husband works nights so he is home during the day -- but a <br/>\nasleep until about 1-2pm.  I am usually at work from 9-5 -- give or <br/>\ntake.  But everything is crammed into my days or hours away from <br/>\nwork.  <br/>\n&gt; <br/>\n&gt; While I have been unhappy at work (I miss my children terribly) <br/>\nfor quite some time,  have just started to realize so much more.  I <br/>\nread recently about making our lives rich...not rich with money but <br/>\ndays that are fun and full of opportunity.  My children don&#39;t have <br/>\nthat anymore.  I don&#39;t spend much time with my husband.  We don&#39;t <br/>\ntake part in field trips or other outings much because I work.  I <br/>\noften cry on my way to work because I am so sad leaving them. <br/>\n&gt; <br/>\n&gt; So, I have made the decision to work much less.  I have already <br/>\nwent down to 20 hours per week at work, but things have been so slow <br/>\nthere, that I have worked even less than 20 hours.  I am around my <br/>\nkids so much more (LOVING IT!), BUT I want more and am trying to <br/>\nfind a way to quit altogether.  <br/>\n&gt; <br/>\n&gt; The problem is financially -- I don&#39;t know how we would make it <br/>\nwithout my money (I don&#39;t make a lot -- only $5.25 per hour, but it <br/>\nstill helps) -- the only good thing is that I am again working at <br/>\nhome designing (something I put on the back burner when we moved to <br/>\nTN) but while my designs are selling, I am only paid quarterly and <br/>\nthings are slow to get going again.  I know that in time I can <br/>\nreplace my &quot;work outside the home&quot; income, but it may take a few <br/>\nmonths.  And I can&#39;t stay working at the restaurant until I replace <br/>\nthe income because I don&#39;t have enough time to work at home <br/>\ndesigning if I am working (did that make sense?).<br/>\n&gt; <br/>\n&gt; I am not looking for solutions really....I guess I just wanted to <br/>\nvent and see if anyone else has been in my shoes and what you did.  <br/>\nSometimes I think I am an awful mom because I go to work and then I <br/>\nthink I am an awful mom because I am on the verge of leaving my job, <br/>\nmaking things very hard on us financially.  I just don&#39;t know what <br/>\nto do.<br/>\n&gt; <br/>\n&gt; ~~Brandie~~<br/>\n&gt; Scrapbook Designer<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scrapbookingwithbrandie.com\">http://www.scrapbookingwithbrandie.com</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://scrapblogging.blogspot.com\">http://scrapblogging.blogspot.com</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":188356965,"authorName":"brandie@scrapgirls.com","from":"&lt;brandie@...&gt;","profile":"scrapdiva73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Any input would be helpful","postDate":"1103824050","msgId":101713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTcwMWM0ZTkxNyQ3OTkxNDY2MCQxMjU4YTg0MkBjaGFydGVydG4ubmV0Pg=="},"prevInTopic":0,"nextInTopic":101729,"prevInTime":101712,"nextInTime":101714,"topicId":101713,"numMessagesInTopic":0,"msgSnippet":"I used to be a sahm.  I worked from home designing products for the scrapbook industry and freelance writing.  I certainly didn t get rich, but it brought a","messageBody":"<div id=\"ygrps-yiv-404329851\">I used to be a sahm.  I worked from home designing products for the scrapbook industry and freelance writing.  I certainly didn&#39;t get rich, but it brought a little money to help.  Last summer, our family moved from CA to TN.  The move wiped us out financially, so I took a job at a local fast food restaurant.  I am miserable -- without sounding too childish, my boss is cruel...even borderline abusive.  If I work with her in a given shift (which I usually do), I usually leave work feeling worthless.<br/>\n<br/>\nWe unschool our three children (ages 14, 12, and 4) -- we love it.  My husband works nights so he is home during the day -- but a asleep until about 1-2pm.  I am usually at work from 9-5 -- give or take.  But everything is crammed into my days or hours away from work.  <br/>\n<br/>\nWhile I have been unhappy at work (I miss my children terribly) for quite some time,  have just started to realize so much more.  I read recently about making our lives rich...not rich with money but days that are fun and full of opportunity.  My children don&#39;t have that anymore.  I don&#39;t spend much time with my husband.  We don&#39;t take part in field trips or other outings much because I work.  I often cry on my way to work because I am so sad leaving them. <br/>\n<br/>\nSo, I have made the decision to work much less.  I have already went down to 20 hours per week at work, but things have been so slow there, that I have worked even less than 20 hours.  I am around my kids so much more (LOVING IT!), BUT I want more and am trying to find a way to quit altogether.  <br/>\n<br/>\nThe problem is financially -- I don&#39;t know how we would make it without my money (I don&#39;t make a lot -- only $5.25 per hour, but it still helps) -- the only good thing is that I am again working at home designing (something I put on the back burner when we moved to TN) but while my designs are selling, I am only paid quarterly and things are slow to get going again.  I know that in time I can replace my &quot;work outside the home&quot; income, but it may take a few months.  And I can&#39;t stay working at the restaurant until I replace the income because I don&#39;t have enough time to work at home designing if I am working (did that make sense?).<br/>\n<br/>\nI am not looking for solutions really....I guess I just wanted to vent and see if anyone else has been in my shoes and what you did.  Sometimes I think I am an awful mom because I go to work and then I think I am an awful mom because I am on the verge of leaving my job, making things very hard on us financially.  I just don&#39;t know what to do.<br/>\n<br/>\n~~Brandie~~<br/>\nScrapbook Designer<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scrapbookingwithbrandie.com\">http://www.scrapbookingwithbrandie.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://scrapblogging.blogspot.com\">http://scrapblogging.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":101823,"nextTopicId":101827}}