{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Jill","from":"&quot;Jill&quot; &lt;jillmca@...","replyTo":"LIST","senderId":"Odr_9KSgCCKe2WFZ5aMOCPrhD3GhDnrpRyBXMLmXeweYVlYzq-LH88CRAoZaMcA8ccwH3sTC7IuZvxPVeiFA0m2_O2vvMe-1","spamInfo":{"isSpam":false,"reason":"0"},"subject":":  sibling fighting","postDate":"935125589","msgId":2135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNjEuMjEzNS45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2134,"nextInTime":2136,"topicId":2135,"numMessagesInTopic":0,"msgSnippet":"I have two boys who are close in age and at various times fight a lot and other times less.  The thing that helped me most when they were young is difficult to","messageBody":"<div id=\"ygrps-yiv-664167234\">I have two boys who are close in age and at various times fight a lot and<br/>\nother times less.  The thing that helped me most when they were young is<br/>\ndifficult to achieve in a homeschooling environment.  What helped was having<br/>\none on one time with each child.  At that stage I had my children in<br/>\npreschool so I put them in on a different day.  Made such a difference.  I<br/>\nhave tried to have one child go on a play date and the other stay with me<br/>\nbut being close in age that is difficult.  If you can work out a way to<br/>\naccomplish this I would recommend it.<br/>\nIn the short term - I find separating them works well.  If they fight they<br/>\ngo to different areas of the house and when they are ready to play together<br/>\ncooperatively they can be together.<br/>\nIn general, I find the more I can stay out of the disputes the better.<br/>\nI have also found it helpful to try to step in before they fight but when I<br/>\nsee the play becoming boring or changing.  Its been good to start some floor<br/>\nplay - playful wrestling, tickling at this time and it seems to give them<br/>\npositive attention and helps with transitions.  This isn&#39;t easy to do but<br/>\nworks very well.  It also reduces the interruptions to my activities.  I can<br/>\nspend a few minutes pro-actively or be irritated with them later.<br/>\nWhen I intervene successfully in a dispute it has been because I haven&#39;t<br/>\ntaken sides.  I haven&#39;t done this in a while but it worked well - I would<br/>\nintervene and just hold each of the boys - one arm each and be quiet until<br/>\nthey settled.  Harder to get them to sit now they are older - often one<br/>\nremoves themselves.  When/If they quiet and each give their version they<br/>\nusually work it out themselves.  I often tell them that I will take the toy<br/>\nor game away from them if they can&#39;t work it out - it puts them on the same<br/>\nside against me.  They nearly always figure a way out.<br/>\nThe rest of the time I take heart in the research that shows that siblings<br/>\nlearn a lot about getting along with people and working out who they are<br/>\nbased on their interactions with children.<br/>\nI also like the book, &quot;Siblings without rivalry&quot;.  Good luck.<br/>\nJill</div>","specialLinks":[]}],"prevTopicId":2131,"nextTopicId":2148}}