{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Learning all the time but Now what?","postDate":"1245115921","msgId":45922,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0ODdCNDA5LTRGNDUtNDY1OC04MkVGLUFBMzE3OTFFRjdFQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDhDQkJDMUU1NDdDOUM1Qy00NjAtMThFQkBXRUJNQUlMLU1CMDMuc3lzb3BzLmFvbC5jb20+","referencesHeader":"PDhDQkJDMUU1NDdDOUM1Qy00NjAtMThFQkBXRUJNQUlMLU1CMDMuc3lzb3BzLmFvbC5jb20+"},"prevInTopic":45917,"nextInTopic":0,"prevInTime":45921,"nextInTime":45923,"topicId":45873,"numMessagesInTopic":0,"msgSnippet":"-=-My husband works out of state and can be gone 3, 4, even 5 weeks at a stretch. Sometimes more. When he first started doing traveling work years ago and I","messageBody":"<div id=\"ygrps-yiv-1062906016\">-=-My husband works out of state and can be gone 3, 4, even 5 weeks at  <br/>\na stretch. Sometimes more. When he first started doing traveling work  <br/>\nyears ago and I would get stressed out and bummed and my oldest (my  <br/>\nyoungest was not born yet) would get bummed and sad and it seemed like  <br/>\na long time, I found it helpful to think about who had it worse than I  <br/>\ndid/do. -=-<br/>\n<br/>\nFor nearly four years, we only saw Keith one week a month.<br/>\n<br/>\nI used to remind myself that it was very cool that I could call him at  <br/>\nhis own desk in the daytime or his apartment at night, and that if it  <br/>\nwere really an emergency he could come home.   He wasn&#39;t in the  <br/>\nmilitary.  He wasn&#39;t in jail.  He was doing something that enabled us  <br/>\nto buy a bigger house.<br/>\n<br/>\nKirby was getting bigger and was 12 or 13 when Keith came back, and  <br/>\nthey weren&#39;t very buddy buddy anymore.  (They are now.)  That was  <br/>\nrough, so I called for it to end.  He kept agreeing to another six  <br/>\nmonths, but I was worried that he and Kirby would lose their  <br/>\nrelationship entirely.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":77070457,"authorName":"Sanguinegirl83@aol.com","from":"Sanguinegirl83@...","profile":"sanguinegirl83","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Learning all the time but Now what?","postDate":"1245104302","msgId":45917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQkJDMUU1NDdDOUM1Qy00NjAtMThFQkBXRUJNQUlMLU1CMDMuc3lzb3BzLmFvbC5jb20+","inReplyToHeader":"PGgxNjE2aitiNm1mQGVHcm91cHMuY29tPg=="},"prevInTopic":45903,"nextInTopic":45922,"prevInTime":45916,"nextInTime":45918,"topicId":45873,"numMessagesInTopic":0,"msgSnippet":"OP wrote:  I have three kids and my hubby works 55+ hrs a week so some weeks are long and I do it all...... Jen. C. wrote: Doing it all, sounds like","messageBody":"<div id=\"ygrps-yiv-2000365260\">OP wrote: &gt;&gt;&gt; I have three kids and my hubby works 55+ hrs a week so some weeks<br/>\nare long and I do it all......&gt;&gt;&gt;<br/>\n<br/>\nJen. C. wrote: Doing it all, sounds like martyrdom. Perhaps see it as choosing to do<br/>\nthings for your family to make their life better. If you are doing too<br/>\nmuch, and it&#39;s not really making your life better, do something<br/>\ndifferent.<br/>\n<br/>\n<br/>\nMy husband works out of state and can be gone 3, 4, even 5 weeks at a stretch. Sometimes more. When he first started doing traveling work years ago and I would get stressed out and bummed and my oldest (my youngest was not born yet) would get bummed and sad and it seemed like a long time, I found it helpful to think about who had it worse than I did/do. It made me feel better and even grateful for what we have. There are wives who have husbands in the armed services who don&#39;t get to live in the same *country* as their spouse and only get to see them for a few weeks every 6 months, maybe every year, maybe longer. They don&#39;t even get to talk to their spouse on the phone every day.?We can call Dave pretty much any time we want to talk to him. We&#39;re setting up the computers and have cameras now, so we can Skype and it will be almost like him being here. Servicemen and women have very limited calls home, sometimes. <br/>\n<br/>\nIf I none of that helps change my perspective, I remember that we *have* a husband and father and while not wealthy, we are able to live on Dave&#39;s salary. He is a sweet, wonderful guy who helps out *loads* when he&#39;s home, he is full on board with unschooling, he supports each of us and all of us in what we do and when we need support. When I look at all all we have, compared to what we *could* be without.... Well, heck. I feel rich and happy and wonderful.<br/>\n<br/>\nSome times we need to &quot;busy up&quot; and fill our schedules with fun and new things to do so that we don&#39;t miss him so much. Sometimes, that is too much when the boys are missing him and &quot;busying up&quot; would be overwhelming, so we nest and snuggle and eat comfort foods and we do lots for each other. We do what we need to do to make it work and feel as good as we can. It takes paying attention, clueing in to the signs, listening and sometimes it takes talking things through and/or asking. <br/>\n<br/>\nWe all have a vested interest in making things be the best they can be, because it&#39;s just too hard to live with someone that&#39;s grouchy or depressed or angry for long. It doesn&#39;t do anyone much of any good to stand and complain that the bicycle has a flat tire and kick the wheel and rant at the tack on the sidewalk or the world in general-you just get the tire fixed so you can move on. Or walk. Or catch the bus. Or make a unicycle out of the parts you have that do work. ;~)<br/>\n<br/>\nPeace,<br/>\nDe<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Learning all the time but Now what?","postDate":"1245087763","msgId":45903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgxNjE2aitiNm1mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgxMzlqbitpc2hrQGVHcm91cHMuY29tPg=="},"prevInTopic":45879,"nextInTopic":45917,"prevInTime":45902,"nextInTime":45904,"topicId":45873,"numMessagesInTopic":0,"msgSnippet":"... to plan our day to feel fulfilled with my kids. Do your kids want planned days?  What about just playing and hanging out together?  What about inviting","messageBody":"<div id=\"ygrps-yiv-173061221\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Having said all this I am feeling stuck at the fact I don&#39;t know how<br/>\n </span></blockquote>to plan our day to feel fulfilled with my kids.&gt;&gt;&gt;<br/>\n<br/>\nDo your kids want planned days?  What about just playing and hanging out<br/>\ntogether?  What about inviting friends over?  What about going to<br/>\ndifferent stores or taking different roads and visiting different parks?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; We sometimes get caught up in the meals and a few animals chores<br/>\n </span></blockquote>that I see it in them too that they are lost. &gt;&gt;&gt;<br/>\n<br/>\nHow much time in each day is taken up with meals and animal chores?  Are<br/>\nyou doing the meals and animal chores, or are the kids, or maybe all of<br/>\nyou together?  If they are involved in these things, do they want to be?<br/>\nIf they aren&#39;t, what are they doing instead?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;As my 9yo is getting so much more major I feel somewhat dis-connected<br/>\n </span></blockquote>from her too.<br/>\nHow do we keep the day going if the child is not sending a signal for me<br/>\nto pick up on?&gt;&gt;&gt;<br/>\n<br/>\nWhat are YOU doing to engage her?  What new and sparkling thing have you<br/>\nintroduced?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I have three kids and my hubby works 55+ hrs a week so some weeks<br/>\n </span></blockquote>are long and I do it all......&gt;&gt;&gt;<br/>\n<br/>\nDoing it all, sounds like martyrdom.  Perhaps see it as choosing to do<br/>\nthings for your family to make their life better.  If you are doing too<br/>\nmuch, and it&#39;s not really making your life better, do something<br/>\ndifferent.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I am very blessed and grateful to have chosen to raise my kids and<br/>\n </span></blockquote>not work but sometimes I miss that world too. &gt;&gt;&gt;<br/>\n<br/>\nWhat world?  Really.  Sandra said something a long time ago about<br/>\nchoosing to be the best parent she could be.  Some people want to be a<br/>\ngreat musician, or accountant, or &quot;whatever&quot; and really focus on that,<br/>\nand kids are a side part of life.  If you are choosing to stay at home<br/>\nand raise kids, then make that be something you are great at, and<br/>\nsuccessful at.  BE the best mom you can be, make that your talent and<br/>\nyour world!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Learning all the time but Now what?","postDate":"1245015743","msgId":45879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdBQjBDNjNCLTU0QUYtNDJEQy04Q0E4LTA5MTVBMUJDM0ZCRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGgxMzlqbitpc2hrQGVHcm91cHMuY29tPg==","referencesHeader":"PGgxMzlqbitpc2hrQGVHcm91cHMuY29tPg=="},"prevInTopic":45873,"nextInTopic":45903,"prevInTime":45878,"nextInTime":45880,"topicId":45873,"numMessagesInTopic":0,"msgSnippet":"-=-How do we keep the day going if the child is not sending a signal for me to pick up on?-=- I wish you had read a while before posting, because you might","messageBody":"<div id=\"ygrps-yiv-1641946888\">-=-How do we keep the day going if the child is not sending a signal  <br/>\nfor me to pick up on?-=-<br/>\n<br/>\nI wish you had read a while before posting, because you might have  <br/>\nbeen more prepared for the responses.<br/>\n<br/>\n-=- I am new to this group but have lived the unschooling life for a  <br/>\nfew years (even before that just didn&#39;t realize it) -=-<br/>\n<br/>\nIt does bother me when someone says &quot;I&#39;ve been unschooling for years&quot;  <br/>\nand then asks a very, very basic question, because it will be  <br/>\nconfusing for those who are truly new to the ideas, for one thing, and  <br/>\nwhen someone comes in with &quot;Yeah, I&#39;ve been doing this for years, I  <br/>\njust didn&#39;t know what it was called,&quot; it seems to be a signal that we  <br/>\nshould not start at the beginning, but only fine tune the questions  <br/>\nasked, or accept the suggestions brought, because the person is an  <br/>\nexperienced unschooler.<br/>\n<br/>\n-=-How do we keep the day going if the child is not sending a signal  <br/>\nfor me to pick up on?-=-<br/>\n<br/>\nSend signals your child can pick up on.  Why should the child be doing  <br/>\nall the idea getting and initiating?<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<br/>\n-=-As my 9yo is getting so much more major I feel somewhat dis- <br/>\nconnected from her too. -=-<br/>\n<br/>\n&quot;Major&quot;?  I don&#39;t understand.<br/>\n<br/>\n-=Anyone else out there that follow a more raw diet? Make yogurt, raw  <br/>\nmilk?-=-<br/>\n<br/>\nI&#39;m sure lots of people do, but it&#39;s not the topic of this list.     <br/>\nThere are many places to discuss dietary interests, but few to discuss  <br/>\nunschooling.  Keep this one on topic, please.<br/>\n<br/>\nSandra <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":196381819,"authorName":"berryajj@prodigy.net","from":"&quot;berryajj@...&quot; &lt;berryajj@...&gt;","profile":"berryajj@prodigy.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Learning all the time but Now what?","postDate":"1244998071","msgId":45873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgxMzlqbitpc2hrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45879,"prevInTime":45872,"nextInTime":45874,"topicId":45873,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone, I know Sandra said to wait and read before coming on but I have been looking for the next step for a long time and couldn t wait to find out some","messageBody":"<div id=\"ygrps-yiv-1056884900\">Hi Everyone,<br/>\n<br/>\nI know Sandra said to wait and read before coming on but I have been looking for the next step for a long time and couldn&#39;t wait to find out some answers.  ;o) I am new to this group but have lived the unschooling life for a few years (even before that just didn&#39;t realize it) followed my heart while being surrounded with dominate parenting from my family and my husbands family with no support as to anyone wanting to understand to change even when it is for the better.  ;o) I am amazed at my kids growth and friendly personality has bloomed and how much they enjoy being with other adults.  Which is whole other discussion on how much that surprises adults and how other adults don&#39;t know how to respond to such an interested little person.  Having said all this I am feeling stuck at the fact I don&#39;t know how to plan our day to feel fulfilled with my kids.  We sometimes get caught up in the meals and a few animals chores that I see it in them too that they are lost.  As my 9yo is getting so much more major I feel somewhat dis-connected from her too.  <br/>\n<br/>\nHow do we keep the day going if the child is not sending a signal for me to pick up on?<br/>\n<br/>\nI have three kids and my hubby works 55+ hrs a week so some weeks are long and I do it all......<br/>\n<br/>\nAnyone else out there that follow a more raw diet?  Make yogurt, raw milk?<br/>\n<br/>\nI am very blessed and grateful to have chosen to raise my kids and not work but sometimes I miss that world too.  <br/>\n<br/>\nEnjoy your Sunday ~ Angela</div>","specialLinks":[]}],"prevTopicId":45919,"nextTopicId":45945}}