{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":74604204,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"How to dig the heat","postDate":"1026709957","msgId":7868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNzE1LjA2NDMwNy4tNjc4MTcuMC5kZHppbWxld0BqdW5vLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7867,"nextInTime":7869,"topicId":7868,"numMessagesInTopic":0,"msgSnippet":"The Mineral Museum of MT Tech of the University of Montana, hosts summer programs for kids and adults like some other colleges are doing these days.    This","messageBody":"<div id=\"ygrps-yiv-389173530\">The Mineral Museum of MT Tech of the University of Montana, hosts summer<br/>\nprograms for kids and adults like some other colleges are doing these<br/>\ndays.    This one especially &quot;rocks&quot; &lt;snort&gt; because they&#39;re always<br/>\ngeology programs and field trips and my son is a born prospector. <br/>\nSaturday we went on one of their field trips.  <br/>\nThe man who&#39;s lately been the guide on these trips is Ed Laird, a self<br/>\ntaught rock hound who found the 400lb smokey quartz crystal  now on<br/>\ndisplay at the Museum.<br/>\nIf you&#39;ve never seen a 400 pound smokey quartz crystal, well, it&#39;s big.  <br/>\nHe found it at a place called Pipestone Flats, which is where he led this<br/>\nfield trip with the hope of seeing all the little kids find a good<br/>\ncrystal or two.  The trouble was, most of the folks on the trip were<br/>\nadults and geologists, a happy accident for my son and pretty interesting<br/>\nfor Mr. Laird too, it seemed.   Last year when we went there were a lot<br/>\nof homeschool kids and some adults who were, yes, geologist, so Dylan<br/>\nremembered that, and when he saw all the adults this time he simply asked<br/>\n&quot;Excuse me, are you a geologist?&quot;   Yup.<br/>\nThe guy who drove our van was a (guess!) geologist at the Dept. of Mines<br/>\nand Geology. A very cool guy.  The museum director, also on the trip, was<br/>\na hydro geologist. So, for six hours Dylan had direct access to smart<br/>\nfolks who loved talking about rocks.  Nothing is better when you&#39;re ten<br/>\nand you have a rock pick and a big idea that you can dig up anything.<br/>\nPipestone Flats is just spitting distance from the continental divide, if<br/>\nyou know how to really launch one, and high elevation, open sage-brushy<br/>\ncountry with some junipers and Douglas fir, but sparse.  Turns out it&#39;s<br/>\nthe perfect place to find crystals, where granite meets feldspar in bony<br/>\nridges that jut out of the ground like a dragons back.   If any of you<br/>\nhave ever been over  Homestake pass you&#39;ll know what I mean about the<br/>\ngranite.  Massive ancient boulders have weathered out of the ground here<br/>\nlike giant vertebrae, spectacular and rugged.<br/>\nIt was hideously hot.  I know you folks who live where it&#39;s 100 degrees<br/>\nand 100% humidity can&#39;t abide whiners like me, but 107 in Montana is hot<br/>\nbecause it&#39;s just not supposed to get 107 in Montana.  Not where I live<br/>\nanyway, up north and down south some, Great Falls and Billings ( hello<br/>\nLisa and Dana ) but not here.  Really, it just doesn&#39;t happen.   <br/>\nWe walked and poked and dug and sweated and crowded into the shade when<br/>\nwe found some and told stories about finding great rocks or, like<br/>\nfishermen, about losing the big one to some other rock hound.   <br/>\nIt was a marvelous day, and we did find crystals!  Dylan found a pocket<br/>\nfull of smoky quarts - two rather large ones, a nice clear quartz crystal<br/>\nabout three inches long,  and others that were smaller, some green<br/>\nepidote, and two very nice axinite.  We filled up another egg carton and<br/>\nstarted a new dish of rocks on the bookshelf and decided to go dig<br/>\nsapphires or pan for gold next weekend.  It&#39;s supposed to cool off to the<br/>\nfrosty mid eighties.  Yea Haw! <br/>\nAnyway, this was going somewhere, Ed Laird is in the early, beginning<br/>\nstages of writing a book about his adventures digging for rocks.  About<br/>\nhow he learned by doing, and by being curious and patient and observant<br/>\nand about how he taught himself to cut gemstones and make jewelry and<br/>\ntake little kids and big geologist on hot field trips.  And about digging<br/>\n400 pound crystals out of Pipestone Flats.<br/>\nIt should be a good book for unschoolers.  <br/>\n<br/>\nDeb L</div>","specialLinks":[]}],"prevTopicId":7863,"nextTopicId":7873}}