{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Vouchers, a question","postDate":"1029219214","msgId":40868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5N0RFODVFLjEzMEElbmVkdmFyZUBudHBseC5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":40867,"nextInTime":40869,"topicId":40868,"numMessagesInTopic":0,"msgSnippet":"The following came privately, so I m omitting the sender info for privacy. ... This was my (Ned s post, in part) ... Ned answers: Yes, the state employees will","messageBody":"<div id=\"ygrps-yiv-1297458604\">The following came privately, so I&#39;m omitting the sender info for privacy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What about the fact that if the State provides Vouchers then it will<br/>\n&gt;expect accountability through various means such as Standardized testing<br/>\n&gt;which in turn determines what is taught?<br/>\n<br/>\n </span></blockquote>This was my (Ned&#39;s post, in part)<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; That&#39;s what vouchers are proving. Those who believe that parents would<br/>\n&gt;&gt; not educate their kids or find decent schools for them, are believing<br/>\n&gt;&gt; a state schoolers&#39; (usually racist) lie. Sure, there are exceptions,<br/>\n&gt;&gt; and the schools use them to throw their net over all of us.<br/>\n<br/>\n </span></blockquote>Ned answers: <br/>\nYes, the state employees will always seek control.<br/>\nLet&#39;s go back to about 1946 when the federal government gave vouchers to<br/>\nWWII soldiers that they could use at ANY educational institution in the<br/>\ncountry. The government did not certify institutions in order for the<br/>\nvouchers to be used -- at least not back then. The vouchers eventually had<br/>\nadverse effects on many colleges (they got used to being on the gov&#39;t dole<br/>\nand so the money never stopped and certain controls have been applied to the<br/>\nschools&#39; activities), but originally, nobody had to worry about how they<br/>\nused their voucher -- it was good anywhere, including religious colleges, to<br/>\nwhich virtually no one objected.<br/>\n<br/>\nThe catch was that the vouchers were given to individual citizens to use as<br/>\nthey chose, and so not a penny was spent by the gov&#39;t directly to favor<br/>\nreligion. The vouchers were educational in intent.<br/>\n<br/>\nThe same is true with the voucher programs that were in June declared legal<br/>\nby the Supreme Court. They are not given to schools, but to parents so that<br/>\nthey can choose any school they want for their children. In no way, so far,<br/>\ncan the school system seek to control the private schools that accept those<br/>\nvouchers...the state does not control private schools at all, without their<br/>\nconsent -- as I understand it.<br/>\n<br/>\nThe fact that most of the vouchers in Cleveland are used at religious<br/>\nschools is not relevant to the situation, mostly because those are the only<br/>\nprivate schools available. Word has come recently, that since this federal<br/>\ndecision, many groups are working to open new schools and make more choices<br/>\navailable to the children who are trapped in the public schools of<br/>\nCleveland, and Milwaukee, and now other locations.<br/>\n<br/>\nThe only people who are accountable are the receiving schools, and they are<br/>\naccountable only to the parents who decide where the voucher goes once it&#39;s<br/>\nin their hands. The schools need to meet the parents&#39; requirements, not<br/>\nanyone else&#39;s, in order to get the vouchers.<br/>\n<br/>\nNed Vare<br/>\nHow is it that little children are so intelligent and men so stupid? It must<br/>\nbe education that does it.  -- Alexandre Dumas</div>","specialLinks":[]}],"prevTopicId":40867,"nextTopicId":40871}}