{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: testing (was blah blah friggin blah)","postDate":"1244702088","msgId":45824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5RDdDODg3N0Q3RTRFMzM5NjdGNUNDQUQ3OTRGMkVBQFJvYnluUEM+","inReplyToHeader":"PGgwcG9jOCtmbXE0QGVHcm91cHMuY29tPg==","referencesHeader":"PGgwcG9jOCtmbXE0QGVHcm91cHMuY29tPg=="},"prevInTopic":45823,"nextInTopic":0,"prevInTime":45823,"nextInTime":45825,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"... What are the real legally enforcable consequences for not testing? What are the real legally enforcable consequences if a child fails the tests? Robyn L.","messageBody":"<div id=\"ygrps-yiv-548378250\"><blockquote><span title=\"ireply\">&gt;&gt; -=- here in italy, the dept of education decides the nationwide<br/>\n&gt;&gt; curriculum, from elementary thru university. -=-&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>What are the real legally enforcable consequences for not testing?<br/>\n<br/>\nWhat are the real legally enforcable consequences if a child fails the <br/>\ntests?<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":205658009,"authorName":"space_and_freedom","from":"&quot;space_and_freedom&quot; &lt;space_and_freedom@...&gt;","profile":"space_and_freedom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: testing (was blah blah friggin blah)","postDate":"1244693712","msgId":45823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwcTBjZys4ajBtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgwcG9jOCtmbXE0QGVHcm91cHMuY29tPg=="},"prevInTopic":45822,"nextInTopic":45824,"prevInTime":45822,"nextInTime":45824,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"... I d try really hard not to worry about future tests (other than school shopping for a more sympathetic principal like you mentioned). Your daughter will be","messageBody":"<div id=\"ygrps-yiv-480534981\"><blockquote><span title=\"ireply\">&gt; Im not so worried about this year. Im worried about the future years &gt; as testing gets more and more difficult.<br/>\n<br/>\n </span></blockquote>I&#39;d try really hard not to worry about future tests (other than school shopping for a more sympathetic principal like you mentioned). Your daughter will be older with each subsequent test, and so likely to better handle the challenge.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; I dont trust the effects of the system.<br/>\n&gt; And I am wondering if the one test, and its possible negative <br/>\n&gt; effects are a fair trade for unschooling well the rest of the year.<br/>\n&gt; What do you all think? Sandra? Pam?  She doesnt want to be in <br/>\n&gt; school. No doubts about that.<br/>\n<br/>\n </span></blockquote>Since your daughter doesn&#39;t want to be in school it seems to me that the negative effects of school would far outweigh the negative effects of one yearly test. <br/>\n<br/>\nIn school she would be tested in many different ways throughout the year. Of course one test a year would be less harmful than that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What do you think if this test is a &quot;pass into the next grade&quot; or <br/>\n&gt; &quot;remains in the present grade&quot;? Does that make a difference? There <br/>\n&gt; are no results except that decision.  The test is to decide if she <br/>\n&gt; is ready for the next grade.<br/>\n<br/>\n </span></blockquote>Can you get to a place where it truly doesn&#39;t matter to you if she doesn&#39;t pass? Maybe you can convey to her that this is a necessary hoop to let her be home, so she has to get tested, but it&#39;s no big deal to you how it turns out.<br/>\n<br/>\nAlso, can you get your husband to get your two sons to knock off the meanness to your daughter? Maybe since they are so immersed in schoolish things they would respond better to a stern authority (aka their Dad).<br/>\n<br/>\nGood luck, <br/>\n<br/>\nJen H.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crazychicknlady.livejournal.com/\">http://crazychicknlady.livejournal.com/</a></div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: testing (was blah blah friggin blah)","postDate":"1244692641","msgId":45822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDkwNjEwMjA1N3A2ZmRjZmNhMHRlNWEzMmNlYjZkNTBlM2UxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDRBMzAwNjEwLjYwMjA3MDZAbWFjLmNvbT4=","referencesHeader":"PGgwb3BrNytybjh1QGVHcm91cHMuY29tPgkgPEZGNjNGRTU1LTM0MkYtNDcyRC05M0YxLTk0Q0ZCOTg5RTQ5NUBTYW5kcmFkb2RkLmNvbT4JIDw0QTMwMDYxMC42MDIwNzA2QG1hYy5jb20+"},"prevInTopic":45820,"nextInTopic":45823,"prevInTime":45821,"nextInTime":45823,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"Sometimes the only thing you can change is your perspective, your own attitude.  If the test is the cost of being home together and being together is a valued","messageBody":"<div id=\"ygrps-yiv-995497898\">Sometimes the only thing you can change is your perspective, your own<br/>\nattitude.  If the test is the cost of being home together and being together<br/>\nis a valued opportunity, then decide the test is a worthy price to pay.  (I<br/>\nhave strong feelings about *paying* any price to raise my own kid, too,<br/>\nthough I&#39;d put them aside, should the need arise - it&#39;s obviously arisen in<br/>\nyour life!)<br/>\n<br/>\nI&#39;d be sure to be honest with my child; explaining this is the hoop we jump<br/>\nthrough to have this amazing free life, 99% of the time. 99% is waaaay<br/>\nbetter than anything less!  I&#39;d toss it about while we were into a project,<br/>\n(our upcoming treehouse is in the forefront of my mind, so I&#39;ll use it as an<br/>\nexample) &quot;Should they ask you about angles on the test, you can mention how<br/>\nwe figured out this floor&quot; or &quot;designing this dumb waiter includes lots of<br/>\nspecific engineering, it might be good to talk about for the test, when<br/>\nthey&#39;re talking about science&quot; For Hayden, especially, I&#39;d mention that his<br/>\nbudgeting for his Independence Day fireworks might be worth mentioning<br/>\nduring the math or economics portions... etc, etc... I think it&#39;s fair to<br/>\nboth be nonchalant about the test & give enough information for the child to<br/>\nfeel confident in the process.  If you find value, you can at least share<br/>\nthat view with them!<br/>\n<br/>\nMaybe you can share the world book information with them:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.worldbook.com/wb/Students?curriculum\">http://www.worldbook.com/wb/Students?curriculum</a><br/>\nPerhaps someone in the system may know where the same information is<br/>\navailable for Italy?  At least this is an example of your request for &quot;what<br/>\nto expect&quot; from the testing.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Jun 10, 2009 at 12:14 PM, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   So as Shanti is getting older, Melissa is afraid the questions will be<br/>\n&gt; more about specific subjects - &quot;What was the biggest dinosaur or what did<br/>\n&gt; the T-Rex eat?&quot; types of questions, about things Shanti has had no interest<br/>\n&gt; in and knows little about.<br/>\n&gt;<br/>\n&gt; Melissa - I just want to say - I think you need to trust Shanti a little<br/>\n&gt; more. Talk to HER about what the deal is - how you feel about it - and ask<br/>\n&gt; her about how she&#39;s feeling. At least from what you&#39;ve told us, you&#39;re doing<br/>\n&gt; a lot of fear-based guessing that she&#39;ll take the experience in and begin to<br/>\n&gt; think badly of herself. But, from other things you&#39;ve said, she doesn&#39;t<br/>\n&gt; really sound like the kind of girl who will meekly absorb negative ideas<br/>\n&gt; about herself.<br/>\n&gt;<br/>\n&gt; Arm her in advance by helping her understand why you don&#39;t &quot;do school&quot; and<br/>\n&gt; why they think it is important, but you don&#39;t, that she cover the exact same<br/>\n&gt; information as every other kid in the country, at the same time.<br/>\n&gt;<br/>\n&gt; Also, what they&#39;re likely to do, even if they are very unhappy with her<br/>\n&gt; progress, is to tell you to teach her more. So - agree to that and do a<br/>\n&gt; little more subject preparation for the next test, if that seems necessary.<br/>\n&gt;<br/>\n&gt; Melissa - get a grip &lt;G&gt;. I think you&#39;re getting yourself worked up over<br/>\n&gt; what you imagine might be terrible harm to Shanti&#39;s self-esteem if they ask<br/>\n&gt; her a bunch of stuff she doesn&#39;t know. Kids in school have parents who are<br/>\n&gt; taking the testing extremely seriously. I sit on the soccer sidelines with<br/>\n&gt; lots of other parents who are constantly talking about school. They think it<br/>\n&gt; is their duty to instill in their kids the extreme importance of the tests.<br/>\n&gt; You&#39;re not doing that - you&#39;re doing the<br/>\n&gt; opposite. You&#39;re giving your child real honest information about the<br/>\n&gt; reasons for the tests and what you think about them.<br/>\n&gt;<br/>\n&gt; Do they actually even give her a pass or not-pass grade? Or do they talk to<br/>\n&gt; you, afterward, about the results. You can tell her how impressed they were<br/>\n&gt; with her, etc., because I&#39;m sure they will be impressed with some things,<br/>\n&gt; even if they are totally appalled that she doesn&#39;t remember much about<br/>\n&gt; dinosaurs. You can just say, &quot;Yeah, weird how they think all 8 year olds<br/>\n&gt; ought to know about dinosaurs. It is like if we said ALL 8 year olds should<br/>\n&gt; know a lot about ____________________ fill in the blank with something SHE<br/>\n&gt; knows a lot about.<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\nThat whole thing was worth another read-through!<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: testing (was blah blah friggin blah)","postDate":"1244686706","msgId":45820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NjgzRkI0LTRGNEEtNDNBOC1BOUZCLTc1NzE2MzFBMTc5NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGgwcG9jOCtmbXE0QGVHcm91cHMuY29tPg==","referencesHeader":"PGgwcG9jOCtmbXE0QGVHcm91cHMuY29tPg=="},"prevInTopic":45819,"nextInTopic":45822,"prevInTime":45819,"nextInTime":45821,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"-=-He is adamant that they must happen though this is disputable as it is only a regulation, not a law -=- Maybe the law says you must comply with","messageBody":"<div id=\"ygrps-yiv-1275429845\">-=-He is adamant that they must happen though this is disputable as it  <br/>\nis &quot;only&quot; a regulation, not a law -=-<br/>\n<br/>\nMaybe the law says you must comply with regulations.<br/>\n<br/>\nAs to the effect the grade will have on her treatment by her brothers,  <br/>\nthat seems far beyond the scope of this list.   If you can&#39;t persuade  <br/>\nthem to respect what you&#39;re doing and be kind, that might be one more  <br/>\neffect of school on them to keep in mind when others ask you about  <br/>\ngiving children choices about school.   Maybe you should tell them  <br/>\nthey can continue to go to school only IF they stop bringing the  <br/>\nbullying behavior home or something.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":286713246,"authorName":"Melissa Dietrick","from":"&quot;Melissa Dietrick&quot; &lt;melissa.dietrick@...&gt;","profile":"melidi7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: testing (was blah blah friggin blah)","postDate":"1244685512","msgId":45819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwcG9jOCtmbXE0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZGNjNGRTU1LTM0MkYtNDcyRC05M0YxLTk0Q0ZCOTg5RTQ5NUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":45814,"nextInTopic":45820,"prevInTime":45818,"nextInTime":45820,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"... Im sorry sandra, I dont understand what you mean by and if the test isnt an option? do you mean not optional? I will answer as if thats what you","messageBody":"<div id=\"ygrps-yiv-1907010737\"><blockquote><span title=\"ireply\">&gt; -=- here in italy, the dept of education decides the nationwide  <br/>\n&gt; curriculum, from elementary thru university. -=-<br/>\n <br/>\n&gt;&lt;&lt;&lt;&lt;&lt; Is that set of expectations available to you?  If you know what the nationwide curriculum is for third grade, and if the test isn&#39;t an option, I don&#39;t understand the problem.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Im sorry sandra, I dont understand what you mean by &quot;and if the test isnt an option?&quot; do you mean not optional?<br/>\n<br/>\nI will answer &quot;as if&quot; thats what you mean...<br/>\nwell, I do know the curriculum expected of the PS, it is clearly written in the school books we have to buy each year.  Ive sent 4 kids thru and have also seen it in actionlol!  I have gotten the school books  the local school choose to use yearly, so if she chooses there are fresh worksheets available for her, but mostly she likes to read the older ones that are in huge abundance (she tends to like to read the upper levels).<br/>\n<br/>\nThe year she started homeschooling was the year they changed the &quot;rules&quot;- it used to be required to test only upon re entry of the public school system. However I am thinking there are more and more people exercising this constitutional right to homeschool so the govt. decided to make sure the immigrants are not isolating their children (a big issue here in italy)...this is the general opinion.<br/>\n<br/>\nwhat I see as a problem is this &quot;having&quot; to take an exam.<br/>\nClearly, if one could get around it, it would be better for my dd, and the family atmosphere. I am still looking for ways to avoid it, or at least mitigate the negative effects of testing.  I am philosophically questioning the possibilities of unschooling in such an atmosphere. There is alot of discussion about doing &quot;pure&quot; unschooling (conceived by many as nothing schoolish, ever) and letting the test come as will.  again, these discussions are with in our meager online groups, lol, and elsewhere in real life--not w/me tho, I dont know anybody else who thinks IRL about unschooling principles. <br/>\n<br/>\nI worry because a 9 year old is not stupid, obviously. Having people question you, doing an exam, having to write some sort of composition...she can feel whether things are going &quot;well&quot; or not.  by whether things feel easy, by the vibes being sent out.  Of course it could be easy for her, just as she might be feeling nervouse or with a stuffy head or just confused by the questions asked.  I did notice last year that the vice principal (who was present as one of the 3 teachers) was very generous in prompting her along. It was a very human process. I am just worried this humanity may give way to &quot;she old enough&quot; or some such mentality.<br/>\n<br/>\nBut doing things more schoolishly than what we are, I just cannot muster: it would be putting my relationship with dd in jeapardy, and more even, it would be putting my own convictions in the garbage can.<br/>\nIt isnt an easy thing to work out alone. I need some feed back from experienced people like you and others here.<br/>\n<br/>\nthats my problem, I guess.  Does it seem like a valid issue to you?<br/>\n<br/>\nalso jsut to throw this out there, It seems alot of would be unschoolers decide not to even homeschool because of this testing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=But I do have to submit for testing, as would any private school  <br/>\n&gt; that doesnt adopt the p.s. curriculum (such as waldorf/stienerschools  <br/>\n&gt; for ex.).-=-<br/>\n&gt; <br/>\n&gt; Can you test her in with the waldorf or some other private school,  <br/>\n&gt; rather than all by herself?<br/>\n<br/>\n </span></blockquote>This is an interesting idea. I dont know: the &quot;regulations&quot; (which many here are quick to point out are not laws in the slightest, nor legislations so in theory could be refused) state that the exam must take place at the public school where registered. Registering, whether homeschooling or not, is required by law. I state I am homeschooling rather that publicschooling.<br/>\n<br/>\nI know if I want to test with another school I would have to transfer to that school, declare the homeschooling afterwards...I looked into this option this year, but the principal that I liked so much is retiring and then we would be back to the drawing board.  I was feeling very optimistic back in Feb...so I left us where we were. Im not so worried about this year. Im worried about the future years as testing gets more and more difficult, always being based on what is the national exam for 8th graders, watered down for the grade at hand.<br/>\n<br/>\nIm worried about all these unschoolers that have to put their kids to test...I want to really see if there are other ways out of this...and if these options are possible within our particular situation. Dh doesnt want any legal hassles, hes got too much on his plate right now, I guess.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;If it&#39;s NOT a standardized test, why can&#39;t you tell them what she&#39;s been doing and interested in and maybe they CAN lean more toward  that.   I really figured if there was national curriculum that there would be tests to go with it.&lt;&lt;&lt;&lt; <br/>\n<br/>\n </span></blockquote>Well, this is what I am wondering.  Really, if they had contacted me this year as they did last year (very officially, in april with formal letters that I must send, with programs etc) I would have done so.  But this year they seem to have forgotten me altogether...I have been really busy with family and issues (the same stuff dh has on his plate, lol) and let it slide. Also, this principal is not so easy for me to communicate with. he is very kind, polite, but not very open minded. He&#39;s scared, basically. I probably will go school shopping this comming year. Unless he retires... Its hard, because the principals sort of go hopping from school to school, often.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Im not sure what you mean by ignoring that detail?-=-<br/>\n&gt; <br/>\n </span></blockquote>&lt;&lt;&lt;&lt;&lt; Not show up, or take the tests in such a way that the scores  themselves are invalidated, so whether she tests high or low you don&#39;t take it to heart (nor allow the relatives to do so, if they know there was a purposeful invalidation.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/testing/tests\">http://sandradodd.com/testing/tests</a><br/>\nThat might not work, though, without a standardized, computer-scored  test.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nthanks for clarifying that. Yes, it would be nice to not know the results. BUt I worry about my own capacity at conveying this non importance to my two teaser boys. suggestions here?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&lt;&lt;&lt; Maybe you could say &quot;They might ask you about dinosaurs.  I don&#39;t care  if you know about them or not, but they might ask because that&#39;s what   the school kids learn about at your age.&quot;   But if you coach and tutor her, she might feel she didn&#39;t learn enough. &lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Yes, this is my worry. She says looking at the books, &quot;I know this stuff already,&quot; or, &quot;Im not interested in it.&quot; And mostly what she is not interested in is stuff she has explored in more interesting ways before. I do trust her. I dont trust the effects of the system.<br/>\nAnd I am wondering if the one test, and its possible negatie effects are a fair trade for unschooling well the rest of the year.<br/>\nWhat do you all think? Sandra? Pam?  She doesnt want to be in school. No doubts about that.<br/>\n<br/>\n<br/>\n Or you might coach her  <br/>\n<blockquote><span title=\"ireply\"> &gt; and she&#39;ll do great!  Kinda depends on her personality and your  <br/>\n&gt; intentions and that, but I think it&#39;s impossible for a parent of a  <br/>\n&gt; child who tool a legit test in a legitimate way NOT to be affected by  <br/>\n&gt; the results.  I don&#39;t think you will treat her the same way  <br/>\n&gt; afterwards, whether the score is low, medium or high, and that&#39;s a  <br/>\n&gt; shame.  But that&#39;s how people are.<br/>\n<br/>\n<br/>\n </span></blockquote>What do you think if this test is a &quot;pass into the next grade&quot; or &quot;remains in the present grade&quot;? Does that make a difference? There are no results except that decision.  The test is to decide if she is ready for the next grade.<br/>\n<br/>\nwhich now is getting me to wonder whether your idea to &quot;hold her back a year&quot; would work in this case?  I would maybe get to skip this year or the next and she could take any &quot;easier&quot; test... I dont know about this principal...but I could ask. <br/>\n<br/>\nI really need some articles on the negative effects of testing tho, to sort of back me up. Ive been sounding him out all year (and last year) for ways to avoid the tests.  He is adamant that they must happen though this is disputable as it is &quot;only&quot; a regulation, not a law .  I am pretty sure he thinks I am an overprotective mother, who doesnt want to test her child to protect her. Lol, which is true, but I see this as positive, he maybe seeing this in a negative way.<br/>\n<br/>\nokay, Im going to go and read the other posts...<br/>\nthanks again.<br/>\nmelissa in italy<br/>\nmammadi7</div>","specialLinks":[]},{"userId":208961162,"authorName":"Kim Zerbe","from":"&quot;Kim Zerbe&quot; &lt;kim.zerbe@...&gt;","profile":"zerbe2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: testing","postDate":"1244665324","msgId":45814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzNGQwMWM5ZWEwOSQxZjYzYThjMCQ2NDBhYTlhOUBHb256bz4=","inReplyToHeader":"PEZGNjNGRTU1LTM0MkYtNDcyRC05M0YxLTk0Q0ZCOTg5RTQ5NUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGgwb3BrNytybjh1QGVHcm91cHMuY29tPiA8RkY2M0ZFNTUtMzQyRi00NzJELTkzRjEtOTRDRkI5ODlFNDk1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":45813,"nextInTopic":45819,"prevInTime":45813,"nextInTime":45815,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2081634701\">&lt;&lt; I don&#39;t think you will treat her the same way afterwards, whether the<br/>\nscore is low, medium or high, and that&#39;s a shame. But that&#39;s how people are.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; <br/>\n <br/>\n </span></blockquote>When I was 9 (in 4th grade) we took an IQ test and my parents would not let<br/>\nme see the results. All of my friends knew their scores, but I didn&#39;t. I was<br/>\nso mad that I wasn&#39;t allowed to know! I was sure my best friend scored<br/>\nhigher than me (she always did), so at the time I just wanted to know how<br/>\nclose I got to her score!<br/>\n <br/>\nYears later I found the IQ test results in a folder my mom kept of all of my<br/>\nachievements and I asked her about why they wouldn&#39;t let me know the score.<br/>\nTurned out that they didn&#39;t want me to brag or have a big head about my<br/>\nscore because it was (what they considered) high. I don&#39;t remember it now<br/>\nbut I don&#39;t really think it was even all that high, not genius level or<br/>\nanything. Surely they already knew I was &quot;smart&quot; by age 9? So a high score<br/>\nshould not have been a surprise. I&quot;ve always wondered what that was about.<br/>\n <br/>\nAt the time though, I thought it was because I hadn&#39;t scored well enough and<br/>\nthey were disappointed. I thought they were protecting me from my failure.<br/>\nFrom then on I had an internal voice telling me I was not good at test<br/>\ntaking. Therefore I became not good at test taking. If I did well, I figured<br/>\nthe test must have been easy if even *I* could score well on it! If I scored<br/>\npoorly, I wasn&#39;t surprised, since I was not good at taking tests. (I think I<br/>\nstill knew I was smart, but somehow was OK that no test could accurately<br/>\nprove it.)<br/>\n <br/>\nI was a wreck by the time I had to take the SATs! Top that off by having to<br/>\ntake it in a strange town (where my cousin was getting married) at a strange<br/>\nschool far from home. I didn&#39;t know my way around or know anyone there and<br/>\nwas so completely nervous about that, plus the actual test, plus the<br/>\nwedding, plus the knowledge that all of my friends were standing around<br/>\ntogether before taking their tests at our school. The whole thing was<br/>\nincredibly cruel. <br/>\n <br/>\nSo I scored over 1000, but nothing impressive. I thought I should have done<br/>\nbetter and blamed it on the extenuating circumstances. Plus the known fact<br/>\nthat I am just not a good test taker. ;p<br/>\n <br/>\nKim<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: testing (was blah blah friggin blah)","postDate":"1244662399","msgId":45813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwcDFwdit0NTQ3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBMzAwNjEwLjYwMjA3MDZAbWFjLmNvbT4="},"prevInTopic":45812,"nextInTopic":45814,"prevInTime":45812,"nextInTime":45814,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"I think the deal is that Melissa has no way to know what these ... Ah, well, perhaps coaching Melissa on how to answer questions that she doesn t know the","messageBody":"<div id=\"ygrps-yiv-1355870495\">I think the deal is that Melissa has no way to know what these<br/>\n<blockquote><span title=\"ireply\"> &gt; three teachers might decide to ask. So as Shanti is getting older,<br/>\n&gt; Melissa is afraid the questions will be more about specific subjects -<br/>\n&gt; &quot;What was the biggest dinosaur or what did the T-Rex eat?&quot; types of<br/>\n&gt; questions, about things Shanti has had no interest in and knows little<br/>\n&gt; about.<br/>\n<br/>\n<br/>\n </span></blockquote>Ah, well, perhaps coaching Melissa on how to answer questions that she<br/>\ndoesn&#39;t know the answer to would be a good idea.<br/>\n<br/>\n&quot;I&#39;m not sure what the answer to that is, but I will be looking that<br/>\nup.&quot;<br/>\n<br/>\n&quot;Do you mean ________, if you do, I think the answer is__________&quot;<br/>\n<br/>\n&quot;Can you give me an example?&quot;<br/>\n<br/>\n&quot;I think, based on my best guess, that the answer is ____________, but I<br/>\ncould be wrong.&quot;<br/>\n<br/>\nAnswers that let the over seers know that she is thinking about the<br/>\nanswers and the questions and thoughtfully considering them.</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: testing (was blah blah friggin blah)","postDate":"1244661264","msgId":45812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMzAwNjEwLjYwMjA3MDZAbWFjLmNvbT4=","inReplyToHeader":"PEZGNjNGRTU1LTM0MkYtNDcyRC05M0YxLTk0Q0ZCOTg5RTQ5NUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGgwb3BrNytybjh1QGVHcm91cHMuY29tPiA8RkY2M0ZFNTUtMzQyRi00NzJELTkzRjEtOTRDRkI5ODlFNDk1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":45808,"nextInTopic":45813,"prevInTime":45811,"nextInTime":45813,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"... Her daughter sits in a room with three teachers and they ask her questions, supposedly about the material for her grade level in the national curriculum.","messageBody":"<div id=\"ygrps-yiv-1724602695\">On 6/10/2009 10:42 AM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Not show up, or take the tests in such a way that the scores<br/>\n&gt; themselves are invalidated, so whether she tests high or low you don&#39;t<br/>\n&gt; take it to heart (nor allow the relatives to do so, if they know there<br/>\n&gt; was a purposeful invalidation.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/testing/tests\">http://sandradodd.com/testing/tests</a><br/>\n&gt;<br/>\n&gt; That might not work, though, without a standardized, computer-scored<br/>\n&gt; test.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Her daughter sits in a room with three teachers and they ask her <br/>\nquestions, supposedly about the material for her grade level in the <br/>\nnational curriculum. Ideally, her daughter gets started talking about <br/>\nwhat she DOES know about and they listen and determine that she&#39;s <br/>\nlearning pretty much at what they consider her grade level. I think you <br/>\nalready did this before, Melissa, right? And it went well and the <br/>\nteachers were actually quite impressed with her vocabulary and thinking <br/>\nability?  I think the deal is that Melissa has no way to know what these <br/>\nthree teachers might decide to ask. So as Shanti is getting older, <br/>\nMelissa is afraid the questions will be more about specific subjects - <br/>\n&quot;What was the biggest dinosaur or what did the T-Rex eat?&quot; types of <br/>\nquestions, about things Shanti has had no interest in and knows little <br/>\nabout.<br/>\n<br/>\nMelissa - I just want to say - I think you need to trust Shanti a little <br/>\nmore. Talk to HER about what the deal is - how you feel about it - and <br/>\nask her about how she&#39;s feeling. At least from what you&#39;ve told us, <br/>\nyou&#39;re doing a lot of fear-based guessing that she&#39;ll take the <br/>\nexperience in and begin to think badly of herself. But, from other <br/>\nthings you&#39;ve said, she doesn&#39;t really sound like the kind of girl who <br/>\nwill meekly absorb negative ideas about herself.<br/>\n<br/>\nArm her in advance by helping her understand why you don&#39;t &quot;do school&quot; <br/>\nand why they think it is important, but you don&#39;t, that she cover the <br/>\nexact same information as every other kid in the country, at the same time.<br/>\n<br/>\nAlso, what they&#39;re likely to do, even if they are very unhappy with her <br/>\nprogress, is to tell you to teach her more. So - agree to that and do a <br/>\nlittle more subject preparation for the next test, if that seems necessary.<br/>\n<br/>\nMelissa - get a grip &lt;G&gt;. I think you&#39;re getting yourself worked up over <br/>\nwhat you imagine might be terrible harm to Shanti&#39;s self-esteem if they <br/>\nask her a bunch of stuff she doesn&#39;t know. Kids in school have parents <br/>\nwho are taking the testing extremely seriously. I sit on the soccer <br/>\nsidelines with lots of other parents who are constantly talking about <br/>\nschool. They think it is their duty to instill in their kids the extreme <br/>\nimportance of the tests. You&#39;re not doing that - you&#39;re doing the <br/>\nopposite. You&#39;re giving your child real honest information about the <br/>\nreasons for the tests and what you think about them.<br/>\n<br/>\nDo they actually even give her a pass or not-pass grade? Or do they talk <br/>\nto you, afterward, about the results. You can tell her how impressed <br/>\nthey were with her, etc., because I&#39;m sure they will be impressed with <br/>\nsome things, even if they are totally appalled that she doesn&#39;t remember <br/>\nmuch about dinosaurs. You can just say, &quot;Yeah, weird how they think all <br/>\n8 year olds ought to know about dinosaurs. It is like if we said ALL 8 <br/>\nyear olds should know a lot about _____________________ fill in the <br/>\nblank with something SHE knows a lot about.<br/>\n<br/>\n<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: testing (was blah blah friggin blah)","postDate":"1244655738","msgId":45808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZGNjNGRTU1LTM0MkYtNDcyRC05M0YxLTk0Q0ZCOTg5RTQ5NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGgwb3BrNytybjh1QGVHcm91cHMuY29tPg==","referencesHeader":"PGgwb3BrNytybjh1QGVHcm91cHMuY29tPg=="},"prevInTopic":45806,"nextInTopic":45812,"prevInTime":45807,"nextInTime":45809,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"-=- here in italy, the dept of education decides the nationwide curriculum, from elementary thru university. -=- Is that set of expectations available to you?","messageBody":"<div id=\"ygrps-yiv-634351345\">-=- here in italy, the dept of education decides the nationwide  <br/>\ncurriculum, from elementary thru university. -=-<br/>\n<br/>\nIs that set of expectations available to you?  If you know what the  <br/>\nnationwide curriculum is for third grade, and if the test isn&#39;t an  <br/>\noption, I don&#39;t understand the problem.<br/>\n<br/>\n-=But I do have to submit for testing, as would any private school  <br/>\nthat doesnt adopt the p.s. curriculum (such as waldorf/stienerschools  <br/>\nfor ex.).-=-<br/>\n<br/>\nCan you test her in with the waldorf or some other private school,  <br/>\nrather than all by herself?<br/>\n<br/>\n-=-yes we do this...but for ex. science this year is dinosaurs and big  <br/>\nbang (in proper order tho)...but shanti is rather tired of that--her  <br/>\nbig bro was super into this for years and she tagged along for the  <br/>\nride :o). This year they are totally into other stuff, that is not on  <br/>\nthe curriculum at all. -=-<br/>\n<br/>\nIf it&#39;s NOT a standardized test, why can&#39;t you tell them what she&#39;s  <br/>\nbeen doing and interested in and maybe they CAN lean more toward  <br/>\nthat.   I really figured if there was national curriculum that there  <br/>\nwould be tests to go with it.<br/>\n<br/>\n<br/>\n-=-&lt;&lt;&lt;&lt;or you can knowingly ignore that detail (which<br/>\n<blockquote><span title=\"ireply\">  &gt; I&#39;ve also done in several ways),&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Im not sure what you mean by ignoring that detail?-=-<br/>\n<br/>\nNot show up, or take the tests in such a way that the scores  <br/>\nthemselves are invalidated, so whether she tests high or low you don&#39;t  <br/>\ntake it to heart (nor allow the relatives to do so, if they know there  <br/>\nwas a purposeful invalidation.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/testing/tests\">http://sandradodd.com/testing/tests</a><br/>\n<br/>\nThat might not work, though, without a standardized, computer-scored  <br/>\ntest.<br/>\n<br/>\n-=-the italian group Im talking with online thing that I should just  <br/>\nact as if the exams didnt exist. let my dd take them, irregardless of  <br/>\nwhether she is familiar with the terminology used etc. I feel that is  <br/>\nvery unfair to the child. Never exposing him to at least some of the  <br/>\nconcepts hes going to come across. It doesnt have to be &quot;taught&quot; but  <br/>\nstrewing it out there, no?<br/>\n-=-<br/>\n<br/>\nMaybe you could say &quot;They might ask you about dinosaurs.  I don&#39;t care  <br/>\nif you know about them or not, but they might ask because that&#39;s what  <br/>\nthe school kids learn about at your age.&quot;   But if you coach and tutor  <br/>\nher, she might feel she didn&#39;t learn enough.  Or you might coach her  <br/>\nand she&#39;ll do great!  Kinda depends on her personality and your  <br/>\nintentions and that, but I think it&#39;s impossible for a parent of a  <br/>\nchild who tool a legit test in a legitimate way NOT to be affected by  <br/>\nthe results.  I don&#39;t think you will treat her the same way  <br/>\nafterwards, whether the score is low, medium or high, and that&#39;s a  <br/>\nshame.  But that&#39;s how people are.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":286713246,"authorName":"Melissa Dietrick","from":"&quot;Melissa Dietrick&quot; &lt;melissa.dietrick@...&gt;","profile":"melidi7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: testing (was blah blah friggin blah)","postDate":"1244654558","msgId":45806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwb3E0dSsyZGMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGgwb3BrNytybjh1QGVHcm91cHMuY29tPg=="},"prevInTopic":45805,"nextInTopic":45808,"prevInTime":45805,"nextInTime":45807,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"... ","messageBody":"<div id=\"ygrps-yiv-2131638236\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Melissa Dietrick&quot; wrpte:<br/>\n<br/>\n&lt;&lt; I am worrying. The<br/>\nitalian unschooler types (we are a mangled mangy group, lol)&lt;&lt;<br/>\n<br/>\nI didnt finish that sentence....the italian group Im talking with online thing that I should just act as if the exams didnt exist. let my dd take them, irregardless of whether she is familiar with the terminology used etc.  I feel that is very unfair to the child. Never exposing him to at least some of the concepts hes going to come across. It doesnt have to be &quot;taught&quot; but strewing it out there, no?<br/>\n<br/>\nIve really gotta go now...but I wanted to correct that unfinished sentence-<br/>\nmeliisa</div>","specialLinks":[]},{"userId":286713246,"authorName":"Melissa Dietrick","from":"&quot;Melissa Dietrick&quot; &lt;melissa.dietrick@...&gt;","profile":"melidi7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: testing (was blah blah friggin blah)","postDate":"1244654023","msgId":45805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgwb3BrNytybjh1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBNTczQkNFLTIwMTctNDRBQy1BQTkwLUYxMzU1M0I2NkMxQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":45804,"nextInTopic":45806,"prevInTime":45804,"nextInTime":45806,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-994936006\">&lt;&lt;&lt;&lt; I doubt they design their own exams. They&#39;re probably government   mandated standardized tests.&lt;&lt;&lt;&lt;<br/>\n<br/>\nthey do design their own exams, because homesschooling is so very uncommon here the dept. of education cant be bothered.<br/>\n<br/>\n&lt;&lt;&lt;&lt; They didn&#39;t &quot;choose&quot; the material, probably. And it&#39;s not &quot;what the government wants,&quot; it&#39;s what the board of education at the state level has approved as the curriculum.&lt;&lt;&lt;&lt;<br/>\n<br/>\nyes I realize this is how it is in the US but here in italy, the dept of education decides the nationwide curriculum, from elementary thru university.  :o( and it changes from mandate to mandate, which in italy, is usually pretty quick.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; And NO, hell no, your personal approach is not taken into account.    <br/>\n&gt; Unschooling isn&#39;t above or beyond the law.  If the law specifies that  <br/>\n&gt; home education will be the equivalent of school (and most do), then  <br/>\n&gt; you are responsible to know that.<br/>\n<br/>\n </span></blockquote>thanks for walking me thru this...let me see, the law in italy (Im sorry sandra, I realise Im bringing issues that are particular to my country whic you try to avoid doing, but I really do need some philosophical and practical moral support) says that I may home educate my child, but it doesnt &quot;have&quot; to be the same as public school curriculum. But I do have to submit for testing, as would any private school that doesnt adopt the p.s. curriculum (such as waldorf/stienerschools for ex.).  The difference with a private school is that the school can decide not to adhere to the test results for grade placement (what many homeschoolers are doing now) but I am all alone here...so for the moment Creating a school ad hoc is not within my possiblities. maybe in the future.<br/>\n<br/>\n<br/>\n  &lt;&lt;&lt;And you can either try to work those kinds of things in to what you do in your life (especially if you live where kids will be tested, but I did it even without that, generally speaking) &lt;&lt;&lt;&lt;<br/>\n<br/>\nyes we do this...but for ex. science this year is dinosaurs and big bang  (in proper order tho)...but shanti is rather tired of that--her big bro was super into this for years and she tagged along for the ride :o). This year they are totally into other stuff, that is not on the curriculum at all. <br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;or you can knowingly ignore that detail (which  <br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve also done in several ways),&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Im not sure what you mean by ignoring that detail?<br/>\n<br/>\n<br/>\n &lt;&lt;&lt;&lt;but you can&#39;t tell the school that  <br/>\n<blockquote><span title=\"ireply\"> &gt; they should take your approach into account.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I see your point,  however I was not &quot;telling them&quot; but rather asking them whether it would be possible for me to collaborate in creating the exam. My idea is this: if I am the teacher (according to law I am) then I would like to have a good idea as to what will be on the exam.  That way I am able to strew (if that can be called strewing!) a little more specifically...a program covers alot of ground in a year. Normally a child would not be expected to remember it all by heart. yet that is how it works. No multiple choice exams...those are easy for her! she likes to do worksheets etc if the topic is of interest...(not that we do them very much...but they come up once in a while thru the internet)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Do you have the option to test the kids yourself with a purchased  <br/>\n&gt; test, or to have a private test session with a psychologist or  <br/>\n&gt; certified teacher?<br/>\n<br/>\n </span></blockquote>Nothing like that. It is a test session with 3 teachers present, her alone (i insist on my presence, they didnt have trouble last year with that), in the local public school.<br/>\n<br/>\n  &lt;&lt;Do you have the option to use a portfolio instead?  &lt;&lt;&lt;<br/>\n<br/>\nI asked if doing a daily portfolio could take the place of an annual exam, and was told that the portfolio is appreciated but the exam happens anyway.  I decided not to do a daily log, but I do save the bits and pieces that she creates along the way.  I wont be showing them her writing tho-she considers that personal and private.  <br/>\n<br/>\n &lt;&lt;&lt;Do you have the option to sign them up with a covering  <br/>\n<blockquote><span title=\"ireply\"> &gt; school (or Clonlara or some such) to change testing options?&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I tried that (clonlara or 12K) but she would still be subject to annual testing because it is not using the govt. approved curriculum.<br/>\nwe are trying to organise an online govt approved school here in italy, but it wont be happening very fast.<br/>\n<br/>\n  &lt;&lt;Could they be hooked up with a school outside of Italy?&lt;&lt;<br/>\nno, for the govt. approved curric. being needed.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; You could leave the country and just not be there on Monday. &lt;g&gt;<br/>\n<br/>\n </span></blockquote>I would love to beable to do this.  Yet not showing up just postpones the exam to sept. with possible complications of ASL (the social services in italy) showing up on my doorstep.  I also would like to maintain at least polite if not amicable relations with the local school (who are in charge of our plight :o/)<br/>\n<br/>\n<br/>\n<br/>\n  &lt;&lt;When Kirby was going to have a third grade test, I just didn&#39;t take him.    When they contacted me about a makeup test, we left the county and  stayed gone for two days so I could honestly say &quot;We were out of  town.&quot;  There was no more follow up.  I knew from having taught in the   schools that the tests weren&#39;t for individuals, but for group  statistics, and those who missed the test date and makeup date wouldn&#39;t be hunted down unless there was the change of federal funding  from them testing very high or low, and they&#39;re not getting any money from homeschoolers.&lt;&lt;&lt;<br/>\n<br/>\nit wont work for me here in italy...Shanti is probably the only test taker in the province. The school receives funding for taking care of her paper work.  She counts even if homeschooled.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I dont like that she has to sit down to do all these subjects for  hours on end...-=-<br/>\n&gt; <br/>\n&gt; Don&#39;t say &quot;has to&quot; if it&#39;s not a &quot;has to.&quot;<br/>\n&gt; <br/>\n </span></blockquote>(Just to clarify, I was referring to the exam, sitting there for  hours, not to the unschooling gone homeschooling).<br/>\nWhat do you think, sandra? honestly? My guess is that it is a has to.  Id love to be jumping countries, go to the french riviera for a week...but dh is worried about the soc. services.  I cant really go against his fears, can I? would you? <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-She isnt always into it and if she doesnt answer,<br/>\n&gt; they taunt her rather mercelessly (they are in school--their choice).-=-<br/>\n&gt; <br/>\n&gt; Tell them they can be in school but they can&#39;t bring school home.   <br/>\n&gt; &quot;Mercilessly&quot; is not a reasonable option here.  You need to protect  <br/>\n&gt; your daughter in your own home from any merciless behavior.<br/>\n<br/>\n </span></blockquote>In fact! this is a definite priority. I love this :&quot; Tell them they can be in school but they can&#39;t bring school home.&quot;<br/>\nThis is a nice way to say it.  I dont even mind the &quot;testing&quot;, nor does she, but because it sometimes turns into taunting Ive been cutting it short, and not being very nice :o(.  But Ive been wondering where talking gets in the way.  I like saying it like that.<br/>\n(that was why I put su pen&#39;s  quote up there, it inspired me to write you).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-I sometimes wonder whether it would be better to prepare her more  for these tests. If she doesnt &quot;pass&quot; I will have to keep it secret from the whole family, basically.-=-<br/>\n&gt; <br/>\n&gt;&lt;&lt;&lt;&lt; Absolutely.  If she &quot;has to&quot; take the tests, if it&#39;s really a &quot;have  to&quot; situation you can&#39;t avoid, then prepare her for them.  If she&#39;s  being taunted and tested, unschooling might not work for you.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>So that is it? prepare her for them?  The taunting is much much better lately (past 4 months), really, but in combination with the exams, I am worrying.  The italian unschooler types (we are a mangled mangy group, lol). But she is a tough girl. She is doing this because *she* doesnt want to be in school. She has weathered alot of teasing from her bro&#39;s over the past 3 years...this year they are finally getting that she means it. :o)<br/>\n<br/>\nShe knows she is testing each year...and pulls out her &quot;school stuff&quot; once in awhile.  She likes math and grammar alot...matter of fact stuff I guess...logic...she has done the whole &quot;curric&quot; with those subjects on her own, following the books, asking me for help once in a while.  But she doesnt memorise stuff like they do in italy. ANd I dont intend on recommending it. I find it difficult to &quot;betray&quot; what I believe in. I dont know how to explain it.<br/>\n<br/>\nyou talk alot about buying the yaht alot, that both partners need to agree here, dh is okay, alittle scared but agrees but how about 2 out of 7 kids?...I have to let go of the yaht because two of my kids dont like it? because they cant bring their friends on it too? <br/>\n<br/>\nI feel like that sort of sucks, lol. I wonder what others think here?<br/>\n <br/>\n<br/>\n   &lt;&lt;&lt;If the country you&#39;re in doesn&#39;t allow for homeschooling, and if you can&#39;t leave, then don&#39;t homeschool.  &lt;&lt;&lt;<br/>\n<br/>\nItaly allows for homeschooling (they call it in the constitution &quot;paternal schooling&quot; ).<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;There are ways to make school easier and more fun for your kids if that&#39;s an easier and less  stressful option than trying to homeschool where there&#39;s no support at all.&lt;&lt;&lt;&lt;<br/>\n<br/>\nThats nice of you to say that, and we did do this when we thought we could not homeschool, and still do with those that choose to attend school: we have been a very free home around schooly stuff, really!. But now we know we can (because basically, our dd forced us to find out).<br/>\n<br/>\nbut I wonder what all you &quot;oldtime&quot; homeschooler dealed with these sort of situations way back when homeschooling was unheard of?<br/>\nI feel like this is sort of a cop out, renouncing on our desire to unschool, just because no one in italy does it.  It is on the move, homeschooling and unschooling is growing exponentially.  Id like to help out a bit so my children can feel free to unschool their kids if they like. I dont mind sweating it out a bit, but I do want to protect my dd.  Ive let go of &quot;totally pure&quot; but Im not going to let go of the principles involved.<br/>\n<br/>\nIve gotta run now, and Ive noticed that others have written. Ill drop back in this evening (italian time, that is)<br/>\nxxmelissa<br/>\nin italy<br/>\nmamma di 7</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] testing (was blah blah friggin blah)","postDate":"1244653347","msgId":45804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1OEEyQzk5NzM1MzRFMkU4OERGRjk2QUYxRjY3RTREQExZTEFMQVAyPg==","inReplyToHeader":"PDRBMkZFMjRCLjcwNDA1MDFAbWFjLmNvbT4=","referencesHeader":"PDZhZjJhZDY2MDkwNjEwMDY1MXY2YTcwMmM3MHY5NWMzZTIzOWUxMGY2NDI5QG1haWwuZ21haWwuY29tPiA8NEEyRkUyNEIuNzA0MDUwMUBtYWMuY29tPg=="},"prevInTopic":45802,"nextInTopic":45805,"prevInTime":45803,"nextInTime":45805,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"www.alfiekohn.org has lots on the detrimental effects of testing Lyla [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-453847104\">www.alfiekohn.org has lots on the detrimental effects of testing<br/>\n<br/>\nLyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] testing (was blah blah friggin blah)","postDate":"1244652107","msgId":45802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMkZFMjRCLjcwNDA1MDFAbWFjLmNvbT4=","inReplyToHeader":"PDZhZjJhZDY2MDkwNjEwMDY1MXY2YTcwMmM3MHY5NWMzZTIzOWUxMGY2NDI5QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDZhZjJhZDY2MDkwNjEwMDY1MXY2YTcwMmM3MHY5NWMzZTIzOWUxMGY2NDI5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":45800,"nextInTopic":45804,"prevInTime":45801,"nextInTime":45803,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"... It is bad for learning because it puts your focus on what someone else thinks should be learned right now, rather than on where the child really is in her","messageBody":"<div id=\"ygrps-yiv-1438591655\">On 6/10/2009 6:51 AM, Melissa Dietrick wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I also would love any pointers to writings/llinks that talk about the<br/>\n&gt; futility of testing.  Why it is bad for learning...<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>It is bad for learning because it puts your focus on what someone else <br/>\nthinks should be learned right now, rather than on where the child <br/>\nreally is in her own learning and development. It means parents, like <br/>\nyou, or teachers, more often, try to teach kids things that the kids <br/>\naren&#39;t interested in or developmentally read for. That creates <br/>\nresistance or apathy. Resistance can be active or passive, but either <br/>\nway it is a child feeling the parent (or teacher) is an adversary who is <br/>\ntrying to shove something down their throat (lovely image, isn&#39;t it?). <br/>\nSome kids become apathetic - they &quot;give in&quot; and try to do as they&#39;re <br/>\ntold. They become passive and lose their sense of self - they lose their <br/>\nenthusiasm for learning, their curiosity about the wonders of the world <br/>\njust fades away, their eyes lose the sparkle of the love of life that <br/>\nall children have at 3 years old, before it is schooled out of them.<br/>\n<br/>\nA test, in and of itself, isn&#39;t a bad or a good thing. Lots of us take <br/>\n&quot;tests&quot; for fun on FaceBook, right? And kids often test themselves: <br/>\n&quot;Mom, count how many times I can do this in 1 minute.&quot;<br/>\n<br/>\nFor some children, being tested on material they may have been taught, <br/>\nbut never really felt they &quot;owned,&quot; is very stressful and they <br/>\nexperience a brain-shutdown. They feel stupid. They become convinced <br/>\nthat they are not good at learning. This leads to a vicious cycle that <br/>\ncan affect them the rest of their lives.<br/>\n<br/>\nFor other children, testing is very mechanical - they go through the <br/>\nmotions and don&#39;t care much about the test. These kids have already <br/>\nreacted to forced education by giving up caring about what is being done <br/>\nto them. They just go along with the program with little to no <br/>\ninitiative or even awareness.<br/>\n<br/>\nSome kids are good at test-taking - they can eliminate some answers in <br/>\nmultiple choice tests through logic, sometimes based only on how the <br/>\nanswers are written, not through prior knowledge of the material. Some <br/>\nkids just happen to have been interested enough to learn, or they are <br/>\ncompliant enough to force themselves to memorize stuff they weren&#39;t <br/>\ninterested in. They do well on the tests and think highly of themselves <br/>\nand think other students are lazy or stupid - or both. Yeah, there is a <br/>\ngood attitude to be fostering in children.<br/>\n<br/>\nIf testing is truly legally required and there is really no way around <br/>\nit, then I think it is essential that the child be helped to understand <br/>\nwhat&#39;s really going on. &quot;The government says kids are supposed to learn <br/>\ncertain things at certain times. THEY want to control your learning. But <br/>\nwe disagree with them. You don&#39;t need to learn what they say, when they <br/>\nsay,&quot; etc. I&#39;d want my child to be clear on why she was being tested on <br/>\nstuff that she probably didn&#39;t even have the chance to learn if you&#39;re <br/>\nnot following the official curriculum. Otherwise, it is a dirty trick to <br/>\nplay on her, right?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] testing (was blah blah friggin blah)","postDate":"1244645940","msgId":45800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNTAyMURELUI1OUYtNEFDRi1BNDdDLTNEMDJCQTE1NDI0Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDlENTJBMkNELUVGMTEtNDdGRC1BQ0VDLUIyNzU0NUI5Q0FCNkBzdXBlbm4uY29tPg==","referencesHeader":"PDZhZjJhZDY2MDkwNjEwMDY1MXY2YTcwMmM3MHY5NWMzZTIzOWUxMGY2NDI5QG1haWwuZ21haWwuY29tPiA8Q0E1NzNCQ0UtMjAxNy00NEFDLUFBOTAtRjEzNTUzQjY2QzFCQFNhbmRyYWRvZGQuY29tPiA8OUQ1MkEyQ0QtRUYxMS00N0ZELUFDRUMtQjI3NTQ1QjlDQUI2QHN1cGVubi5jb20+"},"prevInTopic":45799,"nextInTopic":45802,"prevInTime":45799,"nextInTime":45801,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"-=-This wouldn t work if annual testing is required, but I remember hearing one mom tell the story of how in her state kids were required to be tested in third","messageBody":"<div id=\"ygrps-yiv-1330163300\">-=-This wouldn&#39;t work if annual testing is required, but I remember<br/>\nhearing one mom tell the story of how in her state kids were required<br/>\nto be tested in third grade. She responded by never having a third-<br/>\ngrader. Sadly, all of her children had to repeat second grade--but<br/>\nhaving gone through the material a second time, had advanced so much<br/>\nthat they could then move directly to fourth.=-<br/>\n<br/>\nIn New Mexico when we had testing requirements in three of twelve  <br/>\ngrades (they changed which three years after a while, and then dropped  <br/>\nthe whole thing), we stated each year what grade the kids were in.   <br/>\nThere were very few kids in those grades, among the unschoolers. &lt;g&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] testing (was blah blah friggin blah)","postDate":"1244644171","msgId":45799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENTJBMkNELUVGMTEtNDdGRC1BQ0VDLUIyNzU0NUI5Q0FCNkBzdXBlbm4uY29tPg==","inReplyToHeader":"PENBNTczQkNFLTIwMTctNDRBQy1BQTkwLUYxMzU1M0I2NkMxQkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDZhZjJhZDY2MDkwNjEwMDY1MXY2YTcwMmM3MHY5NWMzZTIzOWUxMGY2NDI5QG1haWwuZ21haWwuY29tPiA8Q0E1NzNCQ0UtMjAxNy00NEFDLUFBOTAtRjEzNTUzQjY2QzFCQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":45798,"nextInTopic":45800,"prevInTime":45798,"nextInTime":45800,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"... This wouldn t work if annual testing is required, but I remember hearing one mom tell the story of how in her state kids were required to be tested in","messageBody":"<div id=\"ygrps-yiv-1161642046\">On Jun 10, 2009, at 10:09 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You could leave the country and just not be there on Monday. &lt;g&gt;  When<br/>\n&gt; Kirby was going to have a third grade test, I just didn&#39;t take him.<br/>\n&gt; When they contacted me about a makeup test, we left the county and<br/>\n&gt; stayed gone for two days so I could honestly say &quot;We were out of<br/>\n&gt; town.&quot;  There was no more follow up.  I knew from having taught in the<br/>\n&gt; schools that the tests weren&#39;t for individuals, but for group<br/>\n&gt; statistics, and those who missed the test date and makeup date<br/>\n&gt; wouldn&#39;t be hunted down unless there was the change of federal funding<br/>\n&gt; from them testing very high or low, and they&#39;re not getting any money<br/>\n&gt; from homeschoolers.<br/>\n<br/>\n<br/>\n </span></blockquote>This wouldn&#39;t work if annual testing is required, but I remember  <br/>\nhearing one mom tell the story of how in her state kids were required  <br/>\nto be tested in third grade. She responded by never having a third- <br/>\ngrader. Sadly, all of her children had to repeat second grade--but  <br/>\nhaving gone through the material a second time, had advanced so much  <br/>\nthat they could then move directly to fourth.<br/>\n<br/>\nSu<br/>\n<br/>\nMom of Eric, 8; Carl, 5; Yehva, 22 months</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] testing (was blah blah friggin blah)","postDate":"1244642995","msgId":45798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBNTczQkNFLTIwMTctNDRBQy1BQTkwLUYxMzU1M0I2NkMxQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDZhZjJhZDY2MDkwNjEwMDY1MXY2YTcwMmM3MHY5NWMzZTIzOWUxMGY2NDI5QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDZhZjJhZDY2MDkwNjEwMDY1MXY2YTcwMmM3MHY5NWMzZTIzOWUxMGY2NDI5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":45797,"nextInTopic":45799,"prevInTime":45797,"nextInTime":45799,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"-=-I let her know that I was interested in participated the next time around in the making or planning of the exam (not okay it seems)...I explained that it ","messageBody":"<div id=\"ygrps-yiv-1472620830\">-=-I let her know that I was interested in participated the next time  <br/>\naround in<br/>\nthe making or planning of the exam (not okay it seems)...I explained  <br/>\nthat it<br/>\nwas a little strange to be testing a person so arbitrarily. They are<br/>\nchoosing the material on what the government wants, yet our personal<br/>\napproach is not taken into account.-=-<br/>\n<br/>\nI doubt they design their own exams. They&#39;re probably government  <br/>\nmandated standardized tests.<br/>\n<br/>\nThey didn&#39;t &quot;choose&quot; the material, probably.   And it&#39;s not &quot;what the  <br/>\ngovernment wants,&quot; it&#39;s what the board of education at the state level  <br/>\nhas approved as the curriculum.<br/>\n<br/>\nAnd NO, hell no, your personal approach is not taken into account.    <br/>\nUnschooling isn&#39;t above or beyond the law.  If the law specifies that  <br/>\nhome education will be the equivalent of school (and most do), then  <br/>\nyou are responsible to know that.  And you can either try to work  <br/>\nthose kinds of things in to what you do in your life (especially if  <br/>\nyou live where kids will be tested, but I did it even without that,  <br/>\ngenerally speaking) or you can knowingly ignore that detail (which  <br/>\nI&#39;ve also done in several ways), but you can&#39;t tell the school that  <br/>\nthey should take your approach into account.<br/>\n<br/>\nDo you have the option to test the kids yourself with a purchased  <br/>\ntest, or to have a private test session with a psychologist or  <br/>\ncertified teacher?  Do you have the option to use a portfolio  <br/>\ninstead?   Do you have the option to sign them up with a covering  <br/>\nschool (or Clonlara or some such) to change testing options?  Could  <br/>\nthey be hooked up with a school outside of Italy?<br/>\n<br/>\nYou could leave the country and just not be there on Monday. &lt;g&gt;  When  <br/>\nKirby was going to have a third grade test, I just didn&#39;t take him.   <br/>\nWhen they contacted me about a makeup test, we left the county and  <br/>\nstayed gone for two days so I could honestly say &quot;We were out of  <br/>\ntown.&quot;  There was no more follow up.  I knew from having taught in the  <br/>\nschools that the tests weren&#39;t for individuals, but for group  <br/>\nstatistics, and those who missed the test date and makeup date  <br/>\nwouldn&#39;t be hunted down unless there was the change of federal funding  <br/>\nfrom them testing very high or low, and they&#39;re not getting any money  <br/>\nfrom homeschoolers.<br/>\n<br/>\n-=-I dont like that she has to sit down to do all these subjects for  <br/>\nhours on<br/>\nend...-=-<br/>\n<br/>\nDon&#39;t say &quot;has to&quot; if it&#39;s not a &quot;has to.&quot;<br/>\n<br/>\n-=-She isnt always into it and if she doesnt answer,<br/>\nthey taunt her rather mercelessly (they are in school--their choice).-=-<br/>\n<br/>\nTell them they can be in school but they can&#39;t bring school home.   <br/>\n&quot;Mercilessly&quot; is not a reasonable option here.  You need to protect  <br/>\nyour daughter in your own home from any merciless behavior.<br/>\n<br/>\n-=-I sometimes wonder whether it would be better to prepare her more  <br/>\nfor these<br/>\ntests. If she doesnt &quot;pass&quot; I will have to keep it secret from the whole<br/>\nfamily, basically.-=-<br/>\n<br/>\nAbsolutely.  If she &quot;has to&quot; take the tests, if it&#39;s really a &quot;have  <br/>\nto&quot; situation you can&#39;t avoid, then prepare her for them.  If she&#39;s  <br/>\nbeing taunted and tested, unschooling might not work for you.    If  <br/>\nthe country you&#39;re in doesn&#39;t allow for homeschooling, and if you  <br/>\ncan&#39;t leave, then don&#39;t homeschool.  There are ways to make school  <br/>\neasier and more fun for your kids if that&#39;s an easier and less  <br/>\nstressful option than trying to homeschool where there&#39;s no support at  <br/>\nall.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":286713246,"authorName":"Melissa Dietrick","from":"Melissa Dietrick &lt;melissa.dietrick@...&gt;","profile":"melidi7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"testing (was blah blah friggin blah)","postDate":"1244641890","msgId":45797,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZhZjJhZDY2MDkwNjEwMDY1MXY2YTcwMmM3MHY5NWMzZTIzOWUxMGY2NDI5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":45798,"prevInTime":45796,"nextInTime":45798,"topicId":45797,"numMessagesInTopic":0,"msgSnippet":"su penn wrote: ","messageBody":"<div id=\"ygrps-yiv-774979591\">su penn wrote:<br/>\n&lt;&lt;&lt;&lt;So I don&#39;t give my kids my radical ideological version of things (not<br/>\neven about unschooling!), and I stay open to the possibility that they<br/>\nwill disagree with me about some things.&lt;&lt;&lt;&lt;<br/>\n<br/>\nand John Holt :<br/>\n&lt;&lt;&lt;&lt;&lt; &quot;To parents I say, above all else, don&#39;t let your home become some<br/>\nterrible miniature copy of the school. No lesson plans! No quizzes! No<br/>\ntests! No report cards! Even leaving your kids alone would be better; at<br/>\nleast they could figure out some things on their own. Live together, as well<br/>\nas you can; enjoy life together, as much as you can.&quot; &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nso I am here again:  on monday Shanti will be having her annual exam for the<br/>\n3rd grade.  Ive not even been a bit nervous this year...til today, that is.<br/>\nToday I spoke on the phone to the vice principal(she called to give me the<br/>\ndate and time)...she was in a &quot;warning&quot; way: letting me know that this year<br/>\nwont be like last years exam (doh) but when I ask what we can expect, &quot;well,<br/>\nit will be similar but...&quot;(!)<br/>\nI let her know that I was interested in participated the next time around in<br/>\nthe making or planning of the exam (not okay it seems)...I explained that it<br/>\nwas a little strange to be testing a person so arbitrarily.  They are<br/>\nchoosing the material on what the government wants, yet our personal<br/>\napproach is not taken into account.<br/>\n<br/>\nI am not feeling comfortable for several reasons...mainly I dont want to<br/>\ntest shanti.<br/>\nI dont like that she has to sit down to do all these subjects for hours on<br/>\nend...and she is able to figure out if she isnt able to do something...and I<br/>\nworry about this.  Her older brothers are often &quot;testing&quot; her already, and<br/>\ncreates alot of friction.  She isnt always into it and if she doesnt answer,<br/>\nthey taunt her rather mercelessly (they are in school--their choice).<br/>\n<br/>\nI sometimes wonder whether it would be better to prepare her more for these<br/>\ntests.  If she doesnt &quot;pass&quot; I will have to keep it secret from the whole<br/>\nfamily, basically.  This bothers me, I guess.<br/>\nI dont care about the passing or not, but I worry: she will have a good idea<br/>\nwhether she did or not.<br/>\nI will know and am not very good at lying.  If I dont look, or say that I<br/>\ndont look, my olders will just assume, for the fun of teasing, that she<br/>\nfailed.<br/>\n<br/>\nThis is definitely bothering me.   Can you all help me out of this hole I am<br/>\ndigging for myself?<br/>\n<br/>\nI also would love any pointers to writings/llinks that talk about the<br/>\nfutility of testing.  Why it is bad for learning...<br/>\nI think it would be nice to have something to translate.<br/>\n<br/>\nthanks alot,<br/>\nmelissa<br/>\nin italy<br/>\nmamma di 7<br/>\nunschooling in heart and soul the whole family, but unschooling in reality<br/>\nonly shanti (9), giacomo leo(6)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":45815,"nextTopicId":45768}}