{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":126034479,"authorName":"juliedaniel.email","from":"&quot;juliedaniel.email&quot; &lt;Julie@...&gt;","profile":"juliedaniel.email","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: About sweets, homemade or storebought","postDate":"1326436045","msgId":64995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplb2lzZCt0cDdrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMjYzMDE0MTEuMzUwMTIuWWFob29NYWlsTmVvQHdlYjg3MzEwLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":64975,"nextInTopic":0,"prevInTime":64994,"nextInTime":64996,"topicId":64919,"numMessagesInTopic":0,"msgSnippet":"-=- In AlwaysLearning@yahoogroups.com, Schuyler  wrote: Oh, and the sugar cube story isn t mine, although I play a role. It is a story that","messageBody":"<div id=\"ygrps-yiv-1774010485\">-=- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\nOh, and the sugar cube story isn&#39;t mine, although I play a role. It is a story that Julie tells and I only learned about in great retrospect.-=-<br/>\n<br/>\nThe story was that Adam (when he was four maybe) started to eat packets of sugar in cafes and coffee shops - he would just open them and tip them into his mouth. I was feeling really anxious about it and thinking that it couldn&#39;t be good for him and I would try to move/hide the sugar pots before he sat down so that he wouldn&#39;t see them. Or I would say &quot;That&#39;s enough sugar now&quot; after he had eaten a few packets. We weren&#39;t limiting other things at home and that was all working fine. I thought that I had &quot;got it&quot; about the economics of restricting food but now I think that maybe I felt particularly bothered about the sugar in coffee shops because I imagined that other people might be looking at me and thinking what a bad mother I was for allowing my child to eat refined sugar right out of the packet! And the more anxious I was the more he seemed to want to eat it (duh!)<br/>\n<br/>\nAround that time we visited Schuyler and she said to me that she remembered eating sugar as a child (I did too but I had somehow managed to forget that.) and she said she remembered that it was really nice, it felt good on your tongue. And she suggested I buy a box of sugar cubes and put them somewhere where Adam could access them freely, just like the food at home. So I bought two boxes and put one on his small table in the kitchen. The first day he ate *lots and lots* of sugar cubes (maybe fifteen or more). I though &quot;oh no, this isn&#39;t working&quot; but I breathed and waited. The next day he ate quite a lot but not as many as the first day. By about day five or six he was eating maybe a couple of sugar cubes a day and after that he just stopped! He hadn&#39;t finished the box at that point and it sat on his table for several weeks. I used it up in cups of tea for visitors and the second box is still in the cupboard in case he wants it someday. <br/>\n<br/>\nOccasionally he still eats a packet of sugar in a coffee shop. Sometimes if I am ordering at the counter and the sugar is up there rather than on the tables I pick up a couple of sachets and bring them back to the table for him. Sometimes he eats the ones I bring, sometimes he doesn&#39;t. <br/>\n<br/>\nThat&#39;s it really. I don&#39;t think my anxiety / hiding the sugar was helpful to either of us and I much prefer it this way.</div>","specialLinks":[]},{"userId":76589361,"authorName":"Angela","from":"&quot;Angela&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: About sweets, homemade or storebought","postDate":"1326392510","msgId":64975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplbjhidStuMXFvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYxNTlGNUY0LTA0RjQtNENFNS1COENCLTQyODMyMUE3QTZGNUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":64945,"nextInTopic":64995,"prevInTime":64974,"nextInTime":64976,"topicId":64919,"numMessagesInTopic":0,"msgSnippet":"This is something I ve struggled with a little bit. Sometimes a lot. My oldest two kids definitely have a sensitivity  -- mood reactions -- to artificial food","messageBody":"<div id=\"ygrps-yiv-1036236183\">This is something I&#39;ve struggled with a little bit. Sometimes a lot. My oldest two kids definitely have a sensitivity  -- mood reactions -- to artificial food coloring, and my middle child twice had an anaphylactic reaction to something we strongly suspect was food coloring.<br/>\n<br/>\nI make a lot of treats because I like to bake. Also, it&#39;s cheaper, and things are pretty tight for us. My 9YO son goes through phases where he likes to make up recipes for both baked goods and candies. But they also love, love the brightly colored candies at the store.<br/>\n<br/>\nMy solution has been to do our regular shopping at stores that don&#39;t sell things with artificial colors. Whole Foods and Trader Joe&#39;s in my area have plenty of candies and baked goods that are pretty and enticing and yummy, and I can say yes to my kids asking for it without having to worry about the aftermath.<br/>\n<br/>\nAnd when they do have something with the artificial coloring -- whether they get it at a friend&#39;s house or we go shopping at the regular store and they buy something that catches their eye -- I just know it means I&#39;ll need to stick extra close to them the next 24 hours or so to help them not kill each other.<br/>\n<br/>\nAs a bonus to this approach my 9YO has gotten very good at recognizing when his mood is a little out of his control and he often removes himself, picks different activities, etc. Or sometimes he will say, &quot;I want to buy this today, but will you save it for me until Thursday?&quot; because he knows there&#39;s something coming up the next day that he doesn&#39;t want to feel &quot;off&quot; for.<br/>\n<br/>\nAngela in NJ<br/>\nwith Joseph, 9; Hannah, 6; and Miriam, 4<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;m bringing an anonymous question here.   I&#39;m hoping some of you will remember similar discussions and a phrase to search by, and am also hoping Schuyler Waynforth or Julie Daniel could tell the story of the sugar cubes, or someone can find or retell the bowl-of-M&Ms account.  Thanks!<br/>\n&gt; <br/>\n&gt; -=-I have been baking a lot of goodies for my daughter kind of so she does&#39;nt have the store bought stuff- she seems satisfied with that for now and definitely likes whatever I bake- but I am having some kind of mental block against store bought candy and sweets- I fear that&#39;s not healthy for our relationship- so looking for some suggestions on how I could get over this hurdle. I know it could be as simple as just going out and getting some candy and stocking it at home- are there threads about unschoolers who kind of try to &quot;make&quot; more treats instead of &quot;buy&quot; and wondering if in a way I am being manipulative.-=-<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] About sweets, homemade or storebought","postDate":"1326324326","msgId":64945,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDRUUyRjJDLUNGREEtNEI1QS05MUU4LTA0N0E3M0Y4MDk5MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMjYzMTY5ODYuNjYxNjkuWWFob29NYWlsTmVvQHdlYjEyMjUxOC5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDYxNTlGNUY0LTA0RjQtNENFNS1COENCLTQyODMyMUE3QTZGNUBTYW5kcmFEb2RkLmNvbT4gPDEzMjYzMTY5ODYuNjYxNjkuWWFob29NYWlsTmVvQHdlYjEyMjUxOC5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":64938,"nextInTopic":64975,"prevInTime":64944,"nextInTime":64946,"topicId":64919,"numMessagesInTopic":0,"msgSnippet":"-=-If her reaction to her child asking, in an innocent curiosity and wonderment, to try a Little Debbie treat, was to bash it harshly, I d say her reaction is","messageBody":"<div id=\"ygrps-yiv-630372254\">-=-If her reaction to her child asking, in an innocent curiosity and wonderment, to try a Little Debbie treat, was to bash it harshly, I&#39;d say her reaction is just about as poisonous as any kind of &quot;poison&quot; that might be in the actual snack.-=-<br/>\n<br/>\nMuch worse, I think.  Longer lasting.  Nowhere to turn for comfort.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] About sweets, homemade or storebought","postDate":"1326316986","msgId":64938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjYzMTY5ODYuNjYxNjkuWWFob29NYWlsTmVvQHdlYjEyMjUxOC5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDYxNTlGNUY0LTA0RjQtNENFNS1COENCLTQyODMyMUE3QTZGNUBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDYxNTlGNUY0LTA0RjQtNENFNS1COENCLTQyODMyMUE3QTZGNUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":64930,"nextInTopic":64945,"prevInTime":64937,"nextInTime":64939,"topicId":64919,"numMessagesInTopic":0,"msgSnippet":"***but I am having some kind of mental block against store bought candy and sweets- I fear that s not healthy for our relationship-*** A couple of years ago,","messageBody":"<div id=\"ygrps-yiv-1479643302\">***but I am having some kind of mental block against store bought candy and sweets- I fear that&#39;s not healthy for our relationship-***<br/>\n<br/>\nA couple of years ago, in a local unschooling group, a mom completely freaked out over Little Debbie snacks.  She was clearly very upset about the very notion that someone would be okay with buying these things for their kids and she would NEVER do that.  She alluded to them as somehow poisonous and terrible and as the mom it was her job to protect her children from this evil.<br/>\n<br/>\nIf her reaction to her child asking, in an innocent curiosity and wonderment, to try a Little Debbie treat, was to bash it harshly, I&#39;d say her reaction is just about as poisonous as any kind of &quot;poison&quot; that might be in the actual snack.<br/>\n<br/>\nI make all kinds of goodies and buy all kinds of goodies.  There is one thing that I don&#39;t do, and that is buy things simply for the sake of having it around.  My kids have discriminating tastes, even, and especially, when it comes to things on the dessert spectrum!  They will not eat whatever candy or cookie or treat there is.  Even if they are craving chocolate, if the chocolate we have isn&#39;t great, they won&#39;t eat it.<br/>\n<br/>\nMy youngest kid is the one who LOVES all things sweet!  One thing that helped me love what she loves and see it from her perspective, was Food Network shows.  We have watched all kinds of things like Unwrapped.  They go into how they are made, the history of well known candies and treats, and the evolution of their products.  One thing really obvious, especially for the really old companies, is how incredibly passionate these folks are about what they do!  They LOVE their products and they LOVE that people enjoy them, you can see it in the interviews.<br/>\n<br/>\nThe movie Chocolate, not only has Johnny Depp in it, but it also has a chocolatier and it&#39;s interesting to watch her build her shop of deliciousness!  Making candies is an ART.  There is beauty in it and I&#39;m very certain that one must LOVE chocolate to be passionate enough to be artful in it!  The same could be said for any candy or cookie or cake.  Somewhere, someone is in a kitchen creating something that someone will love to eat.  Even in a factory that creates mass quantities of things, there is someone that conceived of it and loved it so much that they wanted to make it a business.  To me, that&#39;s really cool!  <br/>\n<br/>\nSo, every time my kids eat and enjoy what they eat, it&#39;s a small statement about the creator of that item, whether it be me or some other person in an office surrounded by paper work from their candy factory.  It reminds me of Willie Wonka, but he never has paper work, he has oompa loompas to do that stuff.  I don&#39;t like the preachy stuff in that book/movie, but I do like the passion of Willie Wonka and Charlie, who love chocolate.  They bash Violet and Augustus and all those other kids pretty harshly, yet the business depends on kids and others like them to buy and enjoy those things.  Interestingly, to me, is that those kids&#39; parents don&#39;t delight in their enjoyment of chocolate like Charlie&#39;s family.  Too bad THAT wasn&#39;t the lesson to be learned from the book/movie, that parents should delight in what their children love, instead of doing what they did, placate, buy love, and manipulate their kids through candy.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: About sweets, homemade or storebought","postDate":"1326305297","msgId":64930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpla2o2aCtyMzU5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYxNTlGNUY0LTA0RjQtNENFNS1COENCLTQyODMyMUE3QTZGNUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":64926,"nextInTopic":64938,"prevInTime":64929,"nextInTime":64931,"topicId":64919,"numMessagesInTopic":0,"msgSnippet":"We make a lot of foods, not just sweet ones, at home too, mostly because it is less expensive, Noor has a few sensitivities to things, and she also enjoys","messageBody":"<div id=\"ygrps-yiv-283500645\">We make a lot of foods, not just sweet ones, at home too, mostly because it is less expensive, Noor has a few sensitivities to things, and she also enjoys cooking and baking, so we have a lot of fun too.<br/>\n<br/>\nYears ago, after we had begun unschooling and then became aware of her sensitivity, Meredith suggested that part of leveling the playing field between homemade and store-bought options was looking at what it was that was appealing about store-bought ones. For young children that may well be the fun packaging. You&#39;re daughter may not be at the point yet of noticing all the bright things on store shelves, but if/when she does, doing things like wrapping cookies in colorful paper, using fun shaped molds, etc. might help her not feel like she&#39;s missing out on something cooler.<br/>\n<br/>\nWe buy Noor the things she asks for in the store too, though, and don&#39;t insist on her only eating things we make at home. I can honestly say that while there are things she loves to get out, she doesn&#39;t prefer store-bought foods over homemade ones, except for our local Mexican restaurant&#39;s refried beans.  No matter what I do, I can&#39;t make them as yummy according to her taste as the restaurant does. Since it is one of her main food staples, the restaurant makes us a huge triple side-order that we pick up every week. It is $9 well spent!<br/>\n<br/>\nI think so long as you don&#39;t make store-bought foods *more* appealing by limiting them, which will make them seem more valuable, you should be a-ok.<br/>\n<br/>\nPam Sorooshain&#39;s essay, &quot;The Economics of Restricting TV&quot; is about that point exactly:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/economics\">http://sandradodd.com/t/economics</a><br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] About sweets, homemade or storebought","postDate":"1326301411","msgId":64926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjYzMDE0MTEuMzUwMTIuWWFob29NYWlsTmVvQHdlYjg3MzEwLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDYxNTlGNUY0LTA0RjQtNENFNS1COENCLTQyODMyMUE3QTZGNUBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDYxNTlGNUY0LTA0RjQtNENFNS1COENCLTQyODMyMUE3QTZGNUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":64921,"nextInTopic":64930,"prevInTime":64925,"nextInTime":64927,"topicId":64919,"numMessagesInTopic":0,"msgSnippet":"I ve made lots of sweets in my time. I still do. They are often preferred to store bought sweets, although not always. I ve never been unnerved by the idea of","messageBody":"<div id=\"ygrps-yiv-1031363941\">I&#39;ve made lots of sweets in my time. I still do. They are often preferred to store bought sweets, although not always. I&#39;ve never been unnerved by the idea of store bought candy and sweets, though. I remember the pleasure of snickers and three musketeers and red hots and bubble gum bubble chew with such detail denying that to Simon and Linnaea just seems wrong. I loved the two colour lollies that were 5 cents each down at the corner store, Kirk&#39;s Drugstore. I loved lik-m-aid&#39;s, although the powdered sherbet was merely a necessary evil to get the lik-m-sticks. I still love gobstoppers and sugar coated almonds and pop rocks, just for the sensation. <br/>\n<br/>\n<br/>\nHome made is often cheaper than store bought. I wouldn&#39;t worry too much about it, unless store bought are preferred and you are limiting access because of your own fears. I would try and remember a pleasure you had with candy and see it as the gift you aren&#39;t excluding from your children&#39;s experience. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\nOh, and the sugar cube story isn&#39;t mine, although I play a role. It is a story that Julie tells and I only learned about in great retrospect. I believe that Joyce tells a story about Dove chocolates that&#39;s a personal take on food accessibilty and Kelly Lovejoy is the M&M story teller. I can say that Simon has requested that I not make carrot cake too frequently or it isn&#39;t as special. A sort of reverse take on how limiting a food can make it special. Or the other side. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n <br/>\n-=-I have been baking a lot of goodies for my daughter kind of so she does&#39;nt have the store bought stuff- she seems satisfied with that for now and definitely likes whatever I bake- but I am having some kind of mental block against store bought candy and sweets- I fear that&#39;s not healthy for our relationship- so looking for some suggestions on how I could get over this hurdle. I know it could be as simple as just going out and getting some candy and stocking it at home- are there threads about unschoolers who kind of try to &quot;make&quot; more treats instead of &quot;buy&quot; and wondering if in a way I am being manipulative.-=-<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] About sweets, homemade or storebought","postDate":"1326298786","msgId":64921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4MUM0OUMwLUVGQjAtNEYzNi05MjJDLUQ0MUY2QTVERUQxNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDYxNTlGNUY0LTA0RjQtNENFNS1COENCLTQyODMyMUE3QTZGNUBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDYxNTlGNUY0LTA0RjQtNENFNS1COENCLTQyODMyMUE3QTZGNUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":64919,"nextInTopic":64926,"prevInTime":64920,"nextInTime":64922,"topicId":64919,"numMessagesInTopic":0,"msgSnippet":"... Is she asking for store bought candy? ... Kids can grow up whole and healthy without store bought candy. :-) What damages relationships is mom overriding a","messageBody":"<div id=\"ygrps-yiv-422855648\">On Jan 11, 2012, at 11:09 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but I am having some kind of mental block against store bought candy and sweets<br/>\n<br/>\n </span></blockquote>Is she asking for store bought candy?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - I fear that&#39;s not healthy for our relationship-<br/>\n<br/>\n </span></blockquote>Kids can grow up whole and healthy without store bought candy. :-) What damages relationships is mom overriding a child&#39;s curiosity and explorations with her own agenda, to, in effect, say the child is wrong to try things to decide for herself and she just needs to do it mom&#39;s way.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; are there threads about unschoolers who kind of try to &quot;make&quot; more treats instead of &quot;buy&quot; and wondering if in a way I am being manipulative.-=-<br/>\n<br/>\n </span></blockquote>Why does it need to be either/or? Why not both? Buy what she&#39;s asking for. If she wants more, buy more. If she wants more, buy enough that she doesn&#39;t feel it&#39;s a scarce commodity. The only people who fight over water are people for whom water is limited ;-)<br/>\n<br/>\nAnd then *also* make your own.<br/>\n<br/>\nOptions are good :-) Choice is good. Good for unschooling and good for relationships :-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"About sweets, homemade or storebought","postDate":"1326298172","msgId":64919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxNTlGNUY0LTA0RjQtNENFNS1COENCLTQyODMyMUE3QTZGNUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":64921,"prevInTime":64918,"nextInTime":64920,"topicId":64919,"numMessagesInTopic":0,"msgSnippet":"I m bringing an anonymous question here.   I m hoping some of you will remember similar discussions and a phrase to search by, and am also hoping Schuyler","messageBody":"<div id=\"ygrps-yiv-1835675837\">I&#39;m bringing an anonymous question here.   I&#39;m hoping some of you will remember similar discussions and a phrase to search by, and am also hoping Schuyler Waynforth or Julie Daniel could tell the story of the sugar cubes, or someone can find or retell the bowl-of-M&Ms account.  Thanks!<br/>\n<br/>\n-=-I have been baking a lot of goodies for my daughter kind of so she does&#39;nt have the store bought stuff- she seems satisfied with that for now and definitely likes whatever I bake- but I am having some kind of mental block against store bought candy and sweets- I fear that&#39;s not healthy for our relationship- so looking for some suggestions on how I could get over this hurdle. I know it could be as simple as just going out and getting some candy and stocking it at home- are there threads about unschoolers who kind of try to &quot;make&quot; more treats instead of &quot;buy&quot; and wondering if in a way I am being manipulative.-=-<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":64895,"nextTopicId":64998}}