{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":59469462,"authorName":"Gerard Westenberg","from":"&quot;Gerard Westenberg&quot; &lt;westen@...&gt;","profile":"leonieann2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] easing into unschooling","postDate":"1029450669","msgId":41217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWQwMWMyNDRhYiQ3NzZmYjBhMCQ3MmY0OGE5MEBwYz4=","referencesHeader":"PGU2LjJjOWM1YzVhLjJhOGNmNThkQGFvbC5jb20+"},"prevInTopic":41162,"nextInTopic":0,"prevInTime":41216,"nextInTime":41218,"topicId":41139,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-679627417\">&lt;Because each school-bit is training in what is and is not &quot;work&quot; or &quot;fun&quot; or &quot;educational,&quot; and with some kids each bit of that calcifies and has to be slowly undone.&gt;<br/>\n<br/>\nI agree - had I not just jumped into unschooling  my youngest four this year, I would have instead, just been continuing with the relaxed homeschooling experienced by our older three boys - you know, &quot;unschooling with light structure&quot;! lol! An oxymoron. It was better for us to just jump in , enjoy ourselves and see where life takes us. Of course,  to inspire me in unschooling,I  had the memory of  relaxed homeschooling with the older boys and realising that they learned most on their own...And my 10 yo was saying he hated Maths and yet maths is everywhere!  And fun! I realised that if I continued to request some written maths work each week, I would be intensifying the idea that work is not play...So, jumping in worked best for us!..Leonie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] easing into unschooling","postDate":"1029429533","msgId":41162,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENUJEOTFFLkJBQUU1MTgxQGVhcnRobGluay5uZXQ+","referencesHeader":"PGU2LjJjOWM1YzVhLjJhOGNmNThkQGFvbC5jb20+"},"prevInTopic":41139,"nextInTopic":41217,"prevInTime":41161,"nextInTime":41163,"topicId":41139,"numMessagesInTopic":0,"msgSnippet":"** After people s ten to twenty years of school (ten if they drop out and get an early start on real life, more than twenty if they do the professional student","messageBody":"<div id=\"ygrps-yiv-1655820359\">**<br/>\nAfter people&#39;s ten to twenty years of school (ten if they drop out and<br/>\nget an early start on real life, more than twenty if they do the<br/>\nprofessional <br/>\nstudent thing or doctor-stuff), one of the best deschooling tools is <br/>\nhearing/reading other people&#39;s tangents and &quot;what if&#39;s&quot; and I thought<br/>\nyour <br/>\nsuggestions about what might be done with a little boy WOULD be an<br/>\neasing in.**<br/>\n<br/>\nI never thought of it that way.  Cool.<br/>\n<br/>\nWe help cultivate non-linear thinking on this list.  We take the<br/>\nquestions and tangents of our fellow posters as seriously as we take the<br/>\nquestions and  tangents of our children.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"easing into unschooling","postDate":"1029413773","msgId":41139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2LjJjOWM1YzVhLjJhOGNmNThkQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":41162,"prevInTime":41138,"nextInTime":41140,"topicId":41139,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/14/02 10:32:28 PM, nedvare@ntplx.net writes: ","messageBody":"<div id=\"ygrps-yiv-1268817324\">In a message dated 8/14/02 10:32:28 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nedvare@...\">nedvare@...</a> writes:<br/>\n<br/>\n&lt;&lt; Somebody stop me, please... let the poor woman think up her own damn<br/>\nquestions for her poor son.&gt;&gt;<br/>\n<br/>\nI was really into the thoughts about why things go on store shelves why, <br/>\nthough, and remembering that some parents wouldn&#39;t know, wouldn&#39;t car, and <br/>\nwould just tell a kid it was none of his business unless he was a failure and <br/>\nhad to work in a grocery store.<br/>\n<br/>\nBut store placement is not just practicality (what has to be cold and what <br/>\ndoesn&#39;t), but a science involving applied psychology involving market <br/>\nresearch, and research into physical human perception--what draws the eye, <br/>\nwhat makes people feel soothed so they&#39;ll hang around more?  Stores have <br/>\nsoundtracks.  That music isn&#39;t just some random radio station.  They&#39;re not <br/>\ngoing to play &quot;Born to be Wild&quot; or anything that makes you need to pee or go <br/>\nhome.   And WHY are there so many kinds of one cereal?  Eight kinds of Chex?  <br/>\nShelf space.  <br/>\n<br/>\nOh.  Back to Ned&#39;s request to stop him...<br/>\n<br/>\nAfter people&#39;s ten to twenty years of school (ten if they drop out and get an <br/>\nearly start on real life, more than twenty if they do the professional <br/>\nstudent thing or doctor-stuff), one of the best deschooling tools is <br/>\nhearing/reading other people&#39;s tangents and &quot;what if&#39;s&quot; and I thought your <br/>\nsuggestions about what might be done with a little boy WOULD be an easing in.<br/>\n<br/>\nI talked a long time with a local mom yesterday who has a problematical 14 <br/>\nyear old boy.  Single mom.  I had pictured the worst, but she had some great <br/>\nadvantages.  He reads well.  Doesn&#39;t love it, but has the skill.   He isn&#39;t <br/>\nrunning around with troublemakers, and is content and safe to be left home to <br/>\ndo internet-stuff.  He has an interest about which there are magazines and <br/>\nactivities:  dirt bikes.  He wasn&#39;t in public school, but in a private little <br/>\nChristian school.   So not registering (if the mom chooses to go that way) <br/>\nisn&#39;t even going to be noticeable.  She has no hostile relatives or formal <br/>\nrelatives.  They both have e-mail and can e-mail back and forth while she&#39;s <br/>\nat work.  One problem she DOES have is that if she just jumps straight to <br/>\nunschooling, he&#39;s going to feel abandoned and think she doesn&#39;t care whether <br/>\nhe learns anything.   So we talked about things to do that will be <br/>\nrecognizeably educational to him until he starts to see what the game plan is <br/>\nand until he starts to find his own things of interest.  He&#39;s frozen up about <br/>\nwhat his options are.  He&#39;s tight, not loose.  He&#39;s afraid. <br/>\n<br/>\nI sent her some websites and we worked on a possible easing-in plan.  From my <br/>\npoint of view it&#39;s a jumping in.  From hers it&#39;s easing.  It involves sending <br/>\nhim little bits of unschooling stuff to read, and getting him magazines about <br/>\nwhat he&#39;s interested in, going places where they can leisurely hang out.  <br/>\nHe&#39;s interested in alternative medicine.  There are some places in town with <br/>\naisles and aisles of books and &quot;stuff&quot; which he could touch and ask about.   <br/>\nShe&#39;s thinking of making checklists of kinds of things he should try to do.  <br/>\nVague, but organized looking.  Like for him to tell her in a week what cool <br/>\nhistory stuff he&#39;s seen or to look for some websites about science he&#39;s <br/>\ninterested in.  So part of it is him finding what his resources are from the <br/>\nhouse while she&#39;s gone.  I talked her into NOT making him write for exercise. <br/>\n She understood that easily.  I invited her to a conference here in three <br/>\nweeks.  <br/>\n<br/>\nThat&#39;s easing.<br/>\n<br/>\nBut to ease into unschooling over a period of a year or more I always advise <br/>\nagainst, IF the family means &quot;we&#39;re going to use structure in a school-style <br/>\nway with an eye toward unschooling next year.&quot;   Because each school-bit is <br/>\ntraining in what is and is not &quot;work&quot; or &quot;fun&quot; or &quot;educational,&quot; and with <br/>\nsome kids each bit of that calcifies and has to be slowly undone.<br/>\n<br/>\nI liked that post, Ned.  I think you were giving great ideas.   <br/>\n<br/>\nThere was another kid whose dad I talked to yesterday.  They&#39;re in Grants.  <br/>\nHis boy is six.  They are jumping straight to unschooling, but it&#39;s easier <br/>\nfor them.  Their problem is relatives.  We talked about strategies and <br/>\nreminders and threats effective on local, established families in small towns <br/>\nin New Mexico.  <br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":41213,"nextTopicId":41209}}