{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":0,"authorName":"Marbleface@xxx.xxx","from":"Marbleface@...","replyTo":"LIST","senderId":"OYhD52xupqv0S-ohePKYa9WZ5wM5N0Rac1_45QwN5iMlwJVE5ylflYlMHb61giLPxtBgKqMvACBt","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: How much is &quot;enough&quot;?","postDate":"947351414","msgId":5538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNjUuNTUzOC45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":5536,"nextInTopic":0,"prevInTime":5537,"nextInTime":5539,"topicId":5532,"numMessagesInTopic":0,"msgSnippet":"In a message dated 01/08/2000 3:54:43 PM !!!First Boot!!!, ECSamHill@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-2020279347\">In a message dated 01/08/2000 3:54:43 PM !!!First Boot!!!, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ECSamHill@...\">ECSamHill@...</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt;  I think she wants to know how many hours and <br/>\n minutes she needs to give her kids each day before she turns off the guilt <br/>\n button and attends to her other priorities.&gt;&gt;<br/>\n<br/>\n12 -- the answer is 12.  This is what I always tell the kids when they ask me <br/>\nsomething that has no answer -- and once in a blue moon I am right.  <br/>\n<br/>\nAnyway, the answer is that there is no answer.  Unschooling (even <br/>\nnon-unschooling) doesn&#39;t just stop because it gets to be 11:00.  But is <br/>\ndoesn&#39;t have to start because it is 8:00 either.  <br/>\n<br/>\nYou set up your days as you like.  She doesn&#39;t need to become completely <br/>\nunstructured just because that&#39;s how I am -- or more structured because <br/>\nsomeone else is. <br/>\n <br/>\n&lt;&lt;  My friend <br/>\n really likes long, uninterrupted blocks of time to think and do.  Does this <br/>\n make her a bad fit for homeschooling in general and unschooling in <br/>\n particular?  Her kids are 1, 4.5 and 6.5.<br/>\n <br/>\n Thanks, Betsy<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>I like long, uninterrupted blocks of time too.  Don&#39;t get them very often -- <br/>\nbut I do like them.  <br/>\n<br/>\nI take my time.  Take it.  Don&#39;t wait for everything to be done -- it never <br/>\nis.  <br/>\nI prioritize -- kids, then me & hubby, then errands, then business stuff, <br/>\nthen, way down the list, housework.   In the me part is where I get to sit <br/>\noutside and read, type on the internet way too long, watch dumb TV to wind <br/>\ndown, take a long bath, etc.  Sometimes I feel deprived that I don&#39;t get more <br/>\ntime, but it&#39;s enough.  It really is.<br/>\n<br/>\nAlso, this is balanced against the time I would be spending driving the kids <br/>\nback and forth to school, doing homework, attending PTA and teacher meetings, <br/>\netc.  <br/>\n<br/>\nI don&#39;t think you have to be a whirlwind of a hser to be a success.  <br/>\nSometimes quiet reflection is a good thing.  Maybe her kids will get a chance <br/>\nto see it in action as they observe her. <br/>\n<br/>\nIt&#39;s a big commitment but well worth it, imo.<br/>\n<br/>\nNance</div>","specialLinks":[]},{"userId":0,"authorName":"ECSamHill@xxx.xxx","from":"ECSamHill@...","replyTo":"LIST","senderId":"cGBfEC5E974MAk5Vw3b56dxgsVmWpzuFpEXWlg8JEaenZ7X78fRygVWHSSaYVVnAkeD_SNIuOzY","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: How much is &quot;enough&quot;?","postDate":"947346862","msgId":5532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNjUuNTUzMi45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":5536,"prevInTime":5531,"nextInTime":5533,"topicId":5532,"numMessagesInTopic":0,"msgSnippet":"I have a friend who is teetering on the brink of removing her kids from school.  She has a pretty progressive ideas about education, but is a little afraid of","messageBody":"<div id=\"ygrps-yiv-337492877\">I have a friend who is teetering on the brink of removing her kids from <br/>\nschool.  She has a pretty progressive ideas about education, but is a little <br/>\nafraid of unschooling because she thinks she would have to do it 24 hours a <br/>\nday, 7 days a week, 52 weeks a year.  She&#39;s afraid her 3 kids wouldn&#39;t give <br/>\nher a minute&#39;s peace and that if she was trying to paint, sew or cook when a <br/>\nkid came up and wanted a book read to him or a frog dissected she would feel <br/>\nguilty if she said &quot;Not now.&quot;  I think she wants to know how many hours and <br/>\nminutes she needs to give her kids each day before she turns off the guilt <br/>\nbutton and attends to her other priorities.<br/>\n<br/>\nFor me, sometimes I find my son&#39;s questions thrilling enough that I have the <br/>\nstrength to push back my bedtime and participate in what he&#39;s doing while <br/>\nyawning, and other times I tell him that I&#39;ll be available to do what he <br/>\nwants in the morning, but now I&#39;ve collapsed.  Interruptions when I&#39;m awake <br/>\nand working are not much of a problem for me.  I&#39;m not a linear person, and <br/>\nit&#39;s pretty easy for me to handle a brief interruption and go back to what I <br/>\nwas doing.  (And sometimes I download mail or hunt for something on the <br/>\ninternet with a kid in my lap while reading a picture book.)  My friend <br/>\nreally likes long, uninterrupted blocks of time to think and do.  Does this <br/>\nmake her a bad fit for homeschooling in general and unschooling in <br/>\nparticular?  Her kids are 1, 4.5 and 6.5.<br/>\n<br/>\nThanks, Betsy</div>","specialLinks":[]},{"userId":0,"authorName":"Thad Martin","from":"Thad Martin &lt;tmartin@...","replyTo":"LIST","senderId":"LucEDFPYxbWaAKAB4Y_uSzdD6hxZRRnuvgD6vTPl0AApOUDpSbG9twoKyg4PYgyFFzXJVJzXtEztKbKdHdcYdtTgxEgbkPJOBoc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: How much is &quot;enough&quot;?","postDate":"947328263","msgId":5536,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNjUuNTUzNi45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":5532,"nextInTopic":5538,"prevInTime":5535,"nextInTime":5537,"topicId":5532,"numMessagesInTopic":0,"msgSnippet":"ECSamHill@aol.com wrote: My friend  really likes long, uninterrupted blocks of time to think and do. Does this  make her a bad fit for homeschooling in general","messageBody":"<div id=\"ygrps-yiv-1649033585\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ECSamHill@...\">ECSamHill@...</a> wrote:<br/>\nMy friend  really likes long, uninterrupted blocks of time to think and do.<br/>\nDoes this  make her a bad fit for homeschooling in general and unschooling in<br/>\nparticular?  Her kids are 1, 4.5 and 6.5.<br/>\n<br/>\ni&#39;m like this though i only have one son, who is 4 and we manage.   it may take<br/>\na bit of time because the kids will need to make an adjustment but if she&#39;s<br/>\nhonest with them i believe respect for everyone&#39;s needs can be reciprocal.   we<br/>\ndo have days when we drive each other nuts but much more often than not we just<br/>\nwork things out.  i&#39;m forwarding some excerpts (which i sent under a different<br/>\nthread but i think it fits here as well) that you might want to pass on.   if<br/>\nthere is enough interesting things around the kids, eventually, will happily<br/>\ninvolve themselves and become self-directed.   who knows maybe her kids are a<br/>\nbit like her and will enjoy the time alone.<br/>\n<br/>\n-susan<br/>\naustin,tx<br/>\n<br/>\n<br/>\n<br/>\ni thought i would pass on some excerpts from and article &quot;an unschooler&#39;s<br/>\nlament:  what&#39;s so hard to<br/>\nunderstand&quot; by mary griffith (the author of two handbooks for homeschooling and<br/>\nunschooling).  the article<br/>\nwas published in the mag paths of learning.<br/>\n<br/>\n&#39;i discovered three elements common to unschooling families:<br/>\n<br/>\nan environment conducive to exploration and experimentation.  to put the matter<br/>\nbluntly, we unschoolers<br/>\nhave lots of stuff around to play with.   the nature of that stuff varies with<br/>\nthe interests and needs of each<br/>\nfamily; from books overflowing their shelves, to pots and pans to stack and<br/>\nbang, to backyard garden to<br/>\ncultivate, to a screaming fast computer, our homes have lots of easily<br/>\naccessible materials around for children<br/>\nto investigate.   if we want our kids to learn by following their own<br/>\ninterests, we need to offer them plenty to<br/>\ncatch those interests.<br/>\n<br/>\nadults as models and facilitators.  unschooling parents, like most other<br/>\nparents, learn rapidly that &quot;do as i say,<br/>\nnot as i do&quot; does not work very well with children.   unschooling kids need<br/>\npeople around them who provide<br/>\nmodels of learning by the way they live and in activities they pursue.   if we<br/>\nparents are not obviously<br/>\ncurious about and interested in the world around us, if we ourselves never ask<br/>\nquestions and search for<br/>\nanswers, if we never just try things and see what happens, it&#39;s unlikely that<br/>\nour kids will do so, either.<br/>\n<br/>\ntrust that children will learn.   for most people, this is the big obstacle to<br/>\nunderstanding unschooling and<br/>\nallowing it to work.   perhaps the conventional school education that created<br/>\nour own model of learning<br/>\ncreates an impression that learning is supposed to be difficult or boring, or<br/>\nthat learning cannot and will not<br/>\noccur unless someone is explicitly teaching, providing information in little<br/>\nage-appropriate packets, giving<br/>\nquizzes on wednesdays and tests on fridays.   eventually, once we&#39;ve bitten our<br/>\ntongues and sat on our hands<br/>\nand held our breaths long enough to let our kids learn to trust their own<br/>\nabilities, we discover that we can<br/>\ntrust their abilities as well.   in fact, we discover that it&#39;s almost<br/>\nimpossible to stop our kids from learning, that<br/>\nkids, already intensely curious, are eager to indulge their curiosity.&#39;<br/>\n<br/>\nshe goes on to say:<br/>\n<br/>\n&#39;of course,  even better than applying manufacturing models of more recent<br/>\nvintage than the industrial<br/>\nrevolution to education and learning would be to drop the dehumanizing<br/>\nindustrial models entirely and start<br/>\ntreating both children and adult learners as full, active participants in the<br/>\neducational process.   in other<br/>\nwords, instead of looking at improving instructional delivery systems or<br/>\naccountability procedures, shouldn&#39;t<br/>\nwe talk seriously with our kids about their particular educational paths,<br/>\nlearning from them how they learn<br/>\nbest and what they find helpful or obstructive to their learning processes?<br/>\naren&#39;t our kids entitled to direct a<br/>\nprocess that prepares them for their own future?&#39;<br/>\n<br/>\nshe concludes by saying:<br/>\n<br/>\n&#39;however, let me be clear: &quot;because it works&quot; isn&#39;t a sound enough reason for<br/>\nme to advocate unschooling in<br/>\nparticular and, more generally, treating our children as full partners in our<br/>\nlives.   our children are fellow<br/>\nhuman beings - they are our colleagues in the making of the world, in the<br/>\ncreation of our joint future.<br/>\ntreating them as fully human, with respect and decency, recognizing them as<br/>\npeople just like us, is what we<br/>\nowe them and what we owe ourselves.   it&#39;s simply the right thing to do.&#39;<br/>\n<br/>\nthough this is purely philosophical  i hope it will be of some use to you.  for<br/>\nme having a strong grasp of the<br/>\nunderlining concept helps me work with all the many of variables we face each<br/>\nday.</div>","specialLinks":[]}],"prevTopicId":5451,"nextTopicId":5541}}