{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":61,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181227527","msgId":29152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM3NTRFN0I3LUREMDEtNDY3RS1CQkE5LTU5NDI5NzhERDgxREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwMDAwMWM3YThlNCQyZTYxZjUxMCQwMzAyYThjMEBDcmFpZz4=","referencesHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPiA8ZjQ3MWUzK2lxMHBAZUdyb3Vwcy5jb20+IDwwMGM3MDFjN2E4ODkkOWNhN2ZmNzAkMDIwMmE4YzBAQ3JhaWc+IDxBNjQ1Q0FGOS03Q0UyLTQxNkMtODlDMS0wOUNERUY2MkZGMTNAc2FuZHJhZG9kZC5jb20+IDwwMDAwMDFjN2E4ZTQkMmU2MWY1MTAkMDMwMmE4YzBAQ3JhaWc+"},"prevInTopic":29151,"nextInTopic":29153,"prevInTime":29151,"nextInTime":29153,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"-=-I think the same could be said of my earlier example of horses. I come across a lot of people who are scared of horses and of what could happen around them","messageBody":"<div id=\"ygrps-yiv-90049378\">-=-I think the same could be said of my earlier<br/>\nexample of horses. I come across a lot of people who are scared of  <br/>\nhorses<br/>\nand of what could happen around them and who therefore don&#39;t let their<br/>\nchildren have access to them. -=-<br/>\n<br/>\nIf there were  horses in most buildings and homes, if people couldn&#39;t  <br/>\nget around without horses, if horses were a vital part of everyday  <br/>\nculture, then fear of horses would be a bigger problem.   In 1850,  <br/>\nfear of horses would be a serious disadvantage.  In 2007, fear of TV  <br/>\nis a serious disadvantage.<br/>\n<br/>\n-=-I still don&#39;t see why TV should be in a special category. To me it<br/>\nis in the same category as the things you mention, or horses, or  <br/>\nwhatever<br/>\ninterests anyone.<br/>\n-=-<br/>\n<br/>\nBecause TV isn&#39;t just one thing.  It&#39;s access to a world of different  <br/>\nkinds of information, music, stories, geography, history, humor,  <br/>\nshows about horses!<br/>\n<br/>\nTo say &quot;no TV&#39; is parallel to saying &quot;no books&quot; or &quot;no magazines&quot; or  <br/>\n&quot;no toys.&quot;  To prohibit a class of things without regard to the  <br/>\nbenefit and value of parts of them is prejudice and ignorance and  <br/>\nlimitation.<br/>\n<br/>\nA better analogy with horses would be for someone to say &quot;NO ANIMALS&quot;  <br/>\nbecause they were afraid of horses, and keep their kids away from  <br/>\ncats, from watching birds in the yard, from going to the zoo, from  <br/>\nhaving stuffed animals, from drawing pictures of elephants...<br/>\n<br/>\n-=-If it is important to have a TV in the house, available for people  <br/>\nto use if<br/>\nthey choose, then why is it not equally important to have a reed  <br/>\norgan (or a<br/>\nhorse) available for the same reason? -=-<br/>\n<br/>\nIt takes way more than musical intelligence to use or need (or want)  <br/>\nan organ or a guitar.  It takes desire and ability and time and  <br/>\npractice to be able to play the instrument, and keep it in repair (or  <br/>\nwillingness to pay someone else for repairs when needed).  It&#39;s a big  <br/>\ninvestment of space and time.<br/>\n<br/>\nIt takes more than a vague interest in horses to own one.  You need  <br/>\nspace, physical ability, zoning, HOURS of attention, willingess to  <br/>\nspend money on tack and vets and that&#39;s all even before desire,  <br/>\nability and time to train the horse and give it all the attention it  <br/>\nneeds.<br/>\n<br/>\nA TV can be bought for $80 and just sit there.  Anyone can press &quot;on&quot;  <br/>\nand maybe watch Hamlet or Sesame Street or Boston Legal or Eddie  <br/>\nIzzard, and any one of those things will lead them to music, costume,  <br/>\nculture, geography, history, clever turns of phrases, politics...<br/>\n<br/>\nlike this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections\">http://sandradodd.com/connections</a><br/>\n<br/>\nIf the person who pressed &quot;on&quot; doesn&#39;t like what&#39;s there, she can  <br/>\npress &quot;off.&quot;<br/>\nNot so with a horse.<br/>\nNot so with musical instruments.  (They can be set down to gather  <br/>\ndust, though, while a horse can&#39;t ethically be.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181226911","msgId":29151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDQjhFQzQwLUQ0RkEtNDM4QS1BNTkxLTQ1QTBGMzcyQUQwMUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGY0OGR1NCs3Y2g2QGVHcm91cHMuY29tPg==","referencesHeader":"PGY0OGR1NCs3Y2g2QGVHcm91cHMuY29tPg=="},"prevInTopic":29150,"nextInTopic":29152,"prevInTime":29150,"nextInTime":29152,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"-=-I don t feel like I was deprived without a tv. As I got older I sure wanted a telephone. -=-My passsion in life is to expand my awareness. -=- Had you  had","messageBody":"<div id=\"ygrps-yiv-854092627\">-=-I don&#39;t feel like I was deprived<br/>\nwithout a tv. As I got older I sure wanted a telephone.<br/>\n<br/>\n-=-My passsion in life is to expand my awareness. -=-<br/>\n<br/>\nHad you  had TV and phone as a 20th century child, your awareness  <br/>\nwould be expanded quite a bit already.<br/>\n<br/>\n-=-I ask her if she wants to play and<br/>\nshe says yes and I am trying to distract her away from the tv news. I<br/>\nthought that was a good thing.-=-<br/>\n<br/>\nThat was probably a good thing, to give her a better option than  <br/>\nwatching the news.<br/>\nIf she had free access to TV at home, she probably would NOT have  <br/>\nbeen watching news (one of the least interesting things to kids) at  <br/>\nall, anywhere, but would&#39;ve been choosing (being used to choice) to  <br/>\ndo a better thing.<br/>\n<br/>\nWhen children can choose to do a better thing, they do, but children  <br/>\nWANT to learn (unless and until that spark of curiosity is snuffed  <br/>\nout with pressure or shame or ragging about them not learning well  <br/>\nand right, as school so often does, as parents can replicate at home  <br/>\nif they&#39;re not careful).  When a child wants to learn, and TV is new  <br/>\nand unfamiliar, she WILL watch whatever&#39;s on, to find out what&#39;s so  <br/>\ndangerous and bad about the thing that&#39;s been forbidden in her life.   <br/>\nWhat is so powerful that her mother&#39;s afraid of it or scorns it?<br/>\n<br/>\nParents who prevent TV send the message that the TV is stronger than  <br/>\nthe child.  Someone else made that point here a while back, and I  <br/>\nthought it very, very true.<br/>\n<br/>\n-=-What about the warning by even mainstreem pediatrics that there<br/>\nshould be no tv for children under the age of two because it will<br/>\ninhibit their developement? Why wouldn&#39;t you be concerned about that?-=-<br/>\n<br/>\nOn this page<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv/anti\">http://sandradodd.com/tv/anti</a><br/>\nI have a link to that recommendation, and some commentary.<br/>\n<br/>\nI&#39;m thinking you haven&#39;t gone and looked at the TV links, but are  <br/>\njust responding to e-mails.<br/>\nOne way to expand awareness and to understand where longtime  <br/>\nunschoolers are coming from is to read those collections of the good  <br/>\nparts of prior discussions.<br/>\n<br/>\n-=-For me watching tv puts me in tunnel vision and takes me away from<br/>\nhearing my inner voices (messages from my spirit guides)Not that I<br/>\ncan always hear them and I will agree that there are some very good<br/>\nshows on tv.-=-<br/>\n<br/>\nThere are some good shows and some bad shows.<br/>\nThere are some good voices in people&#39;s heads and some bad voices.<br/>\n<br/>\nYou&#39;re quoting and citing people and their studies and their fears  <br/>\n(Naomi Aldort, Tom Brown, John Young, &quot;mainstream pediatrics&quot;) but it  <br/>\nseems you&#39;re listening to them without wondering why they&#39;re saying  <br/>\nwhat they&#39;re saying, but just accepting it.<br/>\n<br/>\nCritical thinking, analytical thinking, mindful thinking is all very  <br/>\nimportant for learning to make your own choices.  If you choose to  <br/>\nfollow someone else&#39;s advice, it should be because you really looked  <br/>\nat it from many angles, compared it to all the advice you had already  <br/>\nheard, formed an internal grid of comparisons and relative merit and  <br/>\nvalue and then turned the decision into your own decision.<br/>\n<br/>\nA man in an online unschooling chat once challenged me with &quot;Are you  <br/>\nwilling to risk your child&#39;s future on your &#39;theories&#39;?&quot; and I shot  <br/>\nback immediately, &quot;Yes, aren&#39;t you?&quot;<br/>\n<br/>\nIf my &quot;theory&quot; (my beliefs and convictions, really, as I had been  <br/>\nunschooling for some years then and didn&#39;t consider it a flimsy  <br/>\n&quot;theory&quot;) was that choice helps kids learn to think well and to live  <br/>\nresponsibly, I was absolutely willing to live my life that way.  And  <br/>\nif his theory was that going along with the vague mainstream  <br/>\nrecommendations perceived out of the corner of his eye or read in  <br/>\nNewsweek or heard on the news was the way to avoid &quot;risking his  <br/>\nchild&#39;s future,&quot; then he was willing to risk his child&#39;s future on that.<br/>\n<br/>\n-=-A man named John Young who was his student for 10years taught<br/>\na class on Cayote teaching(basically unschooling by answering a<br/>\nchilds questions with another question) -=-<br/>\n<br/>\nAnswering questions with questions is called &quot;Socratic method,&quot;  <br/>\nusually.  It&#39;s been a mainstay of the way Jewish children are dealt  <br/>\nwith for ----started to say &quot;a long time,&quot; but I figure the answer is  <br/>\n&quot;thousands of years.&quot;  It&#39;s not &quot;coyote teaching.&quot;  It&#39;s drawing out  <br/>\nthought and conversation.<br/>\n<br/>\nIt&#39;s what happens on this list.<br/>\n<br/>\nIt&#39;s not &quot;unschooling,&quot; though, it&#39;s helping someone discover  <br/>\nanswers, or bringing their questions into clearer forms.<br/>\n<br/>\n-=-He showed us that tv and more<br/>\nso video games limit the mind to the point where they did studies on<br/>\nkids that played alot of video games and were only using 5% of there<br/>\nbrains.-=--=-<br/>\n<br/>\nHe didn&#39;t &quot;show you.&quot;<br/>\nHe made an unfounded statement and you believed it.<br/>\n<br/>\n-=-How exactly they test that I am not sure...-=-<br/>\n<br/>\nDid you stop to consider that maybe they could NOT test it?<br/>\nWhat would &quot;only using 5% of their brains&quot; look like?  How might it  <br/>\nbe proven, even with an autopsy?<br/>\nIf you&#39;d been watching Nova on PBS as you grew up, you&#39;d&#39;ve watched  <br/>\nshows about brain research, I bet, and would have been more skeptical  <br/>\nof a claim like that and not summarized someone&#39;s wild claim as &quot;he  <br/>\nshowed us.&quot;<br/>\n<br/>\n<br/>\n  &quot;...  except that I know<br/>\nthat some kids lost the ability to see in three D and an Art teacher<br/>\nhad to take them out side and show them that this tree was actually<br/>\nfarther away then that tree. -=-<br/>\n<br/>\nWhoa!!!!  Wait.<br/>\nHow do you &quot;know&quot; that?<br/>\n<br/>\n-=-How exactly they test that I am not sure except that I know -=-<br/>\n<br/>\nYou admit you don&#39;t understand, but then you say you know.<br/>\n<br/>\n-=-How exactly they test that I am not sure except that I know<br/>\nthat some kids lost the ability to see in three D and an Art teacher<br/>\nhad to take them out side and show them that this tree was actually<br/>\nfarther away then that tree. -=-<br/>\n<br/>\nSo you&#39;re unfamiliar with kids who have played a lot of video games,  <br/>\nyet you use the words &quot;showed&quot; and &quot;know.&quot;<br/>\n<br/>\nI am familiar with kids who have played a lot of video games, and  <br/>\nwith adults who play video games, and they are artists themselves,  <br/>\nand engineers, and construction workers and professional drivers and  <br/>\nphone techs and one&#39;s a med student, and if they&#39;ve lost their  <br/>\nability to see in 3D, we&#39;re all in trouble (and they&#39;ll be hammering  <br/>\nand incising their own thumbs).<br/>\n<br/>\n-=-For me watching tv puts me in tunnel vision and takes me away from<br/>\nhearing my inner voices -=-<br/>\n<br/>\nIf you grew up without TV, and you don&#39;t have TV, then when you see  <br/>\nTV you&#39;re probably hearing LOTS of voices in your head, saying things  <br/>\nlike  &quot;I shouldn&#39;t be doing this&quot; or &quot;What if I had watched this my  <br/>\nwhole life?&quot; or &quot;Where if the subliminal boogey man?&quot; and it would be  <br/>\nhard to relax and see the show receptively with all that brainwave  <br/>\nnoise.<br/>\n<br/>\n-=-Is it really allowing<br/>\nfor a young child to choose for themself when they are bombarded with<br/>\ncommertials that push hard for kids to get addicted to say soda etc?<br/>\nIs that really freedom of choice for them?. Those advertising<br/>\ncompanies study extensively how to brainwash kids into wanting there<br/>\nstuff and the government does not protect the people from very toxic<br/>\ningredients in some so called food that is directly targeted towards<br/>\nchildren.(Aspertame, propalene glysol etc.)-=-<br/>\n<br/>\nYour thinking is very, very muddled.  You can&#39;t tell the broadcast of  <br/>\na Shakespeare play from aspertane.  You can&#39;t spell &quot;aspartane,&quot; but  <br/>\nyou&#39;re basing your life on fear of it.<br/>\n<br/>\naspartame |ˈaspärˌtām| |ˌøspɑrˈteɪm| |əˌspɑːteɪm|<br/>\nnoun<br/>\na very sweet substance used as an artificial sweetener, chiefly in  <br/>\nlow-calorie products. It is a derivative of aspartic acid and  <br/>\nphenylalanine.<br/>\n------------------------------------------------------------------<br/>\n<br/>\nMy kids watch TV, but they don&#39;t use aspartame or any artificial  <br/>\nsweeteners.<br/>\n<br/>\n-=-Now I am all about letting go of fear and expanding my awareness..<br/>\nFirst you have to be aware of the fear. I did not see myself as<br/>\nfearing tv for my children before, but now I see where the fear has<br/>\nbeen instilled in me.-=-<br/>\n<br/>\nWe&#39;re going to make counter arguments not just for your own sake, but  <br/>\nfor the other hundreds who read here, so we don&#39;t &quot;have to be aware&quot;  <br/>\nof your fear, we just need to be honest with our responses.    <br/>\nRemember that this is not just about you.  The questions are asked so  <br/>\nthat you will think about your own arguments more clearly (and others  <br/>\nwho are reading the exchange will think about their own beliefs more  <br/>\nclearly).<br/>\n<br/>\n-=-I have never heard anything that challenged thier validity until  <br/>\nnow.-=-<br/>\n<br/>\nWithout knowing both sides of an argument, how could you have fairly  <br/>\njudged the one side you did hear?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181215329","msgId":29150,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzOURFMTQ3LUNFOEUtNDkxRi1BQkVELTEzOUIzMzcxRDA1RUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMDAwMWM3YThlNCQyZTYxZjUxMCQwMzAyYThjMEBDcmFpZz4=","referencesHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPiA8ZjQ3MWUzK2lxMHBAZUdyb3Vwcy5jb20+IDwwMGM3MDFjN2E4ODkkOWNhN2ZmNzAkMDIwMmE4YzBAQ3JhaWc+IDxBNjQ1Q0FGOS03Q0UyLTQxNkMtODlDMS0wOUNERUY2MkZGMTNAc2FuZHJhZG9kZC5jb20+IDwwMDAwMDFjN2E4ZTQkMmU2MWY1MTAkMDMwMmE4YzBAQ3JhaWc+"},"prevInTopic":29149,"nextInTopic":29151,"prevInTime":29149,"nextInTime":29151,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"... No. What s essential for unschooling is helping children explore what interests them, free from parents personal opinions on its worth. Some people love","messageBody":"<div id=\"ygrps-yiv-894340336\">On Jun 7, 2007, at 5:13 AM, Cathy wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It is the strong and united sense that comes<br/>\n&gt; through from veteran unschoolers that TV is indispensable that I am  <br/>\n&gt; puzzling<br/>\n&gt; over.<br/>\n<br/>\n </span></blockquote>No.<br/>\n<br/>\nWhat&#39;s essential for unschooling is helping children explore what  <br/>\ninterests them, free from parents&#39; personal opinions on its worth.<br/>\n<br/>\nSome people love ice cream. Some can take it or leave it.<br/>\n<br/>\nThe issue isn&#39;t whether or not a home has ice cream. The issue is how  <br/>\nfree the children feel to have ice cream if they like it. Children  <br/>\nwhose parents think ice cream is the path to obesity can&#39;t choose as  <br/>\nfreely as children whose parents can take ice cream or leave it.<br/>\n<br/>\nWhether or not a family has TV, isn&#39;t the point. The point is *why* a  <br/>\nfamily doesn&#39;t have a TV.<br/>\n<br/>\nAnd why a particular family is making a choice is difficult to  <br/>\ndiscuss on a board. (And totally irrelevant on a board oriented  <br/>\ntowards discussing philosophy. The focus is on idea not on the  <br/>\npractices of individual families.) Parents can easily say the family  <br/>\ncan get a TV anytime they want, setting that up as a general idea for  <br/>\nother families. But parents can also be self delusional. If they  <br/>\npersonally don&#39;t care for TV, they can be willfully blind to the  <br/>\ninfluence they&#39;re having on the kids. Kids can say they don&#39;t want  <br/>\nit, but they may not feel as free to say they do want it as parents  <br/>\nthink.<br/>\n<br/>\nI&#39;m not saying that&#39;s happening in your family. I&#39;m saying that&#39;s the  <br/>\nsituation that can be behind anyone who wants to present the idea of  <br/>\na family choosing not to have a TV. We can&#39;t know if the parents are  <br/>\ntruly thoughtful and aware and sensitive to their kids. We can&#39;t know  <br/>\nif that idea is going out to parents who think they&#39;re thoughtful but  <br/>\nare really relieved they&#39;re able to get the family to agree to what  <br/>\nthe parents want.<br/>\n<br/>\nIt&#39;s much more helpful to discuss the philosophy of helping children  <br/>\nfind ways to explore their interests. What that looks like in a  <br/>\nparticular family -- and it might be the children are completely  <br/>\ndisinterested in TV so it&#39;s never on -- will be different from family  <br/>\nto family.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If it is important to have a TV in the house, available for people  <br/>\n&gt; to use if<br/>\n&gt; they choose, then why is it not equally important to have a reed  <br/>\n&gt; organ (or a<br/>\n&gt; horse) available for the same reason?<br/>\n<br/>\n </span></blockquote>What children have access to through TV is a lot broader than a reed  <br/>\norgan. A TV is more akin to a library than a horse. There are stories  <br/>\nranging from Akira to CSI to Hamlet. There are instructional shows  <br/>\nlike cooking and yoga. There are informational shows on volcanos and  <br/>\ncheetas and The Battle of Thermopylae. There&#39;s as much to watch on TV  <br/>\nas there is to explore in a library.<br/>\n<br/>\nSaying &quot;We don&#39;t have a reed organ&quot; is worlds away from saying &quot;We  <br/>\ndon&#39;t have access to books.&quot;<br/>\n<br/>\nI think it&#39;s more helpful in terms of unschooling to have a TV that  <br/>\nno one chooses to watch than to not have a TV at all.<br/>\n<br/>\nEven that&#39;s a bit iffy in terms of freedom. Having books in the house  <br/>\nand never reading them to kids doesn&#39;t give them the same freedom as  <br/>\nparents who occasionally attempt to read to their kids who&#39;ve shown  <br/>\nthey&#39;re not (yet) interested. There&#39;s a huge barrier for kids who are  <br/>\ncurious about TV in a home that doesn&#39;t have one. It&#39;s like saying  <br/>\nwe&#39;ll build doors to the outside world if kids ever ask for them.<br/>\n<br/>\nIt isn&#39;t a requirement that a home have TV. It&#39;s helpful if parents  <br/>\nare fully aware of the barriers they may be putting between their  <br/>\nchildren and their interests. *Any* interests, whether it be horses  <br/>\nor reed organs. And though I almost included TV in that list, TV  <br/>\nisn&#39;t really an interest. It&#39;s a portal to things children might be  <br/>\ninterested in. People aren&#39;t interested in TV so much as they&#39;re  <br/>\ninterested in programs they can access through TV.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181212815","msgId":29149,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNEZBRDE3QTcyMDRGMURBRUVDMzk2N0E5MkFFODM1QFJvYnluUEM+","inReplyToHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPg==","referencesHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPg=="},"prevInTopic":29148,"nextInTopic":29150,"prevInTime":29148,"nextInTime":29150,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":" From the house full of smoke, yes, especially since you","messageBody":"<div id=\"ygrps-yiv-1582993230\">&lt;&lt;&lt;&lt; Wouldn&#39;t you want to protect your young child from say an environment <br/>\nsuch as Gandpa&#39;s house? &gt;&gt;&gt;&gt;<br/>\n<br/>\nFrom the house full of smoke, yes, especially since you imply that Grandpa <br/>\nis not willing or able to take his cigarette outside while you visit. This <br/>\nis not something that Jayn could choose to ignore or ask for a different <br/>\nchannel over. That is enough of a deal breaker.<br/>\n<br/>\nFrom the tv, no, since Jayn is perfectly able to protect herself from any <br/>\nimages/sounds she finds scary - and has done so since being able to cry or <br/>\ncrawl or move or turn her head away or go to sleep. All of these were cues <br/>\nthat I noticed and acted on.<br/>\n<br/>\nHowever Jayn would probably ask for her own channels, and if Grandpa were <br/>\nunable to change the channel - well it just doesn&#39;t sound like much of a <br/>\nvisit somehow. It also sounds like Grandpa may not be emotionally up to <br/>\nvisits with his grandkids after his stroke if he needs to focus on the tv <br/>\nduring his waking hours.<br/>\n<br/>\nI can certainly say that at 1 or 4 Jayn had zero interest in violent or <br/>\nadult themed television or movies - her favorites were Max and Ruby and Bob <br/>\nthe Builder, later the Disney channel. At the moment at 7.5 she has become <br/>\nvery interested in the Discovery Kids programming, craft shows and the Food <br/>\nNetwork cooking shows.<br/>\n<br/>\nI have responded to what might be called &quot;content concerns&quot; in the past and <br/>\nSandra kindly kept it here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/whatif#robyn\">http://sandradodd.com/t/whatif#robyn</a><br/>\n<br/>\nalong with some other people&#39;s experiences with tv and their kids.<br/>\n<br/>\nI guess this is partly one of those situations where there isn&#39;t any need to <br/>\nfix what isn&#39;t broken. You don&#39;t have a tv, but you do have the capacity to <br/>\nprovide dvd&#39;s on the computer. Jayn preferred to watch a narrow range of <br/>\nprogramming including movies over and over again, so dvd&#39;s were a perfect <br/>\nsolution for us then.<br/>\n<br/>\nMy only concern is that the kids sensing a generalized disapproval about the <br/>\ntv as being not &quot;natural&quot; or against their parent&#39;s philosophies in <br/>\nprinciple, in the fullness of time may not feel free to ask for their own <br/>\ntv. The problem occurs if they then feel the need to sneak it as a forbidden <br/>\nfruit, or seek it outside of the home. It could become a big barrier between <br/>\nparent and child because of the disapproval.<br/>\n<br/>\nOur kids need to be able to come to us with the really hard questions, and <br/>\nprocess the hard emotions in our supportive presence. Our tv watching has <br/>\nrepeatedly been the catalyst for many wonderful discussions, and it is the <br/>\ncontent that might be seen as objectionable that has been the most useful.<br/>\n<br/>\nTV provides me a wonderful conucopia, especially with all the specialist <br/>\ncable channels. Jayn and I are currently developing a series proposal about <br/>\ndoll crafting.<br/>\n<br/>\nRobyn L. Coburn</div>","specialLinks":[]},{"userId":229396800,"authorName":"Cathy","from":"&quot;Cathy&quot; &lt;cathy@...&gt;","profile":"cathykoetsier","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181207638","msgId":29148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM3YThlNCQyZTYxZjUxMCQwMzAyYThjMEBDcmFpZz4=","inReplyToHeader":"PEE2NDVDQUY5LTdDRTItNDE2Qy04OUMxLTA5Q0RFRjYyRkYxM0BzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPiA8ZjQ3MWUzK2lxMHBAZUdyb3Vwcy5jb20+IDwwMGM3MDFjN2E4ODkkOWNhN2ZmNzAkMDIwMmE4YzBAQ3JhaWc+IDxBNjQ1Q0FGOS03Q0UyLTQxNkMtODlDMS0wOUNERUY2MkZGMTNAc2FuZHJhZG9kZC5jb20+"},"prevInTopic":29147,"nextInTopic":29149,"prevInTime":29147,"nextInTime":29149,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"Hi Are you not getting that the same topics will come up, always, because there are always new unschoolers? Yes, I do understand that. It is the strong and","messageBody":"<div id=\"ygrps-yiv-1844330435\">Hi <br/>\n<br/>\n <br/>\n<br/>\n&quot;Are you not getting that the same topics will come up, always, because<br/>\nthere are always new unschoolers?&quot;<br/>\n<br/>\n <br/>\n<br/>\nYes, I do understand that. It is the strong and united sense that comes<br/>\nthrough from veteran unschoolers that TV is indispensable that I am puzzling<br/>\nover. I &#39;think&#39; that we are unschooling successfully without it. And I am<br/>\nquestioning the idea that any one thing is indispensable to unschool - I<br/>\nfeel that it is what I understand, not what I have that makes the<br/>\ndifference. <br/>\n<br/>\n <br/>\n<br/>\nI agree that if I don&#39;t have a TV and deny my children access to one because<br/>\nof fear, this is a problem. I think the same could be said of my earlier<br/>\nexample of horses. I come across a lot of people who are scared of horses<br/>\nand of what could happen around them and who therefore don&#39;t let their<br/>\nchildren have access to them. The more I look at it, I realize that fear is<br/>\nthe opposite of freedom, and thus we are forced to confront those fears if<br/>\nwe want to unschool - which is an incredible expression of freedom.<br/>\n<br/>\n <br/>\n<br/>\nI believe (I&#39;m hopelessly biased) that horses are wonderful for people in<br/>\ngeneral, and especially for children, and most especially for teenage girls,<br/>\nand I could write pages about the benefits and advantages and about what<br/>\nhorses have done for me etc etc, but it doesn&#39;t change it from being a<br/>\nbenefit that not all will enjoy.<br/>\n<br/>\n&quot;I have three guitars, a piano, three electric keyboards, a reed organ and a<br/>\ndozen recorders in five different voices, but I don&#39;t expect others to have<br/>\nall those instruments. I wouldn&#39;t do well without at least one recorder and<br/>\na guitar, but others do fine.&quot;<br/>\n<br/>\nI agree. I still don&#39;t see why TV should be in a special category. To me it<br/>\nis in the same category as the things you mention, or horses, or whatever<br/>\ninterests anyone. <br/>\n<br/>\nIf it is important to have a TV in the house, available for people to use if<br/>\nthey choose, then why is it not equally important to have a reed organ (or a<br/>\nhorse) available for the same reason? <br/>\n<br/>\nRegards<br/>\n<br/>\nCathy<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":55930256,"authorName":"donannedean","from":"&quot;donannedean&quot; &lt;ibex@...&gt;","profile":"donannedean","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and TV","postDate":"1181203204","msgId":29147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0OGR1NCs3Y2g2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY0NzFlMytpcTBwQGVHcm91cHMuY29tPg=="},"prevInTopic":29145,"nextInTopic":29148,"prevInTime":29146,"nextInTime":29148,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"Thank you for your response. It was gentle and kind and easier for me to hear. The girls do not ask to go to see Grandpa anymore. He was mean to Avalon last","messageBody":"<div id=\"ygrps-yiv-432436173\">Thank you for your response. It was gentle and kind and easier for me <br/>\nto hear. <br/>\nThe girls do not ask to go to see Grandpa anymore. He was mean to <br/>\nAvalon last time we went. We used to try to meet him at a restaruant. <br/>\nHe does get very angry and hard to deal with. It makes him very angry <br/>\nwhen I go to hold Avalon when she is crying and asking to be held. I <br/>\nhave given up on having a relationship with him. He cannot speak and <br/>\ncannot understand very much. He has less and less time of clearity. <br/>\nIt is sad because he used to be a really fun person. He would have <br/>\nloved to play with the girls before the stroke. When I saked Avalon <br/>\nif she wanted to see him she used to say yes but now she doesn&#39;t. She <br/>\nwould sit in front of the tv some at his house and I have seen her <br/>\nbegging her father to come play. I ask her if she wants to play and <br/>\nshe says yes and I am trying to distract her away from the tv news. I <br/>\nthought that was a good thing.<br/>\n<br/>\nI grew up going to a Free school and with out electricity in the deep <br/>\nwoods with a composting toilet. I don&#39;t feel like I was deprived <br/>\nwithout a tv.  As I got older I sure wanted a telephone.<br/>\n<br/>\nMy passsion in life is to expand my awareness. That is why I am open <br/>\nenough to hear about the radical unschooling ideas around tv. I am <br/>\nnot ready to go out and buy tv yet.<br/>\n<br/>\nI have more questions:<br/>\nWhat about the warning by even mainstreem pediatrics that there <br/>\nshould be no tv for children under the age of two because it will <br/>\ninhibit their developement? Why wouldn&#39;t you be concerned about that?<br/>\n<br/>\nIf you have ever read Naomi Aldort or listened to her CD&#39;s you know <br/>\nthat she highly recommends unschooling and yet she says no tv until <br/>\nage 9. <br/>\nI have taken many classes from Tom Brown at his willderness Awareness <br/>\nschool. A man named John Young who was his student for 10years taught <br/>\na class on Cayote teaching(basically unschooling by answering a <br/>\nchilds questions with another question) He showed us that tv and more <br/>\nso video games limit the mind to the point where they did studies on <br/>\nkids that played alot of video games and were only using 5% of there <br/>\nbrains. How exactly they test that I am not sure except that I know <br/>\nthat some kids lost the ability to see in three D and an Art teacher <br/>\nhad to take them out side and show them that this tree was actually <br/>\nfarther away then that tree. <br/>\nFor me watching tv puts me in tunnel vision and takes me away from <br/>\nhearing my inner voices (messages from my spirit guides)Not that I <br/>\ncan always hear them and I will agree that there are some very good <br/>\nshows on tv.<br/>\nWhat about the power of subliminal over the tv. Is it really allowing <br/>\nfor a young child to choose for themself when they are bombarded with <br/>\ncommertials that push hard for kids to get addicted to say soda etc? <br/>\nIs that really freedom of choice for them?. Those advertising <br/>\ncompanies study extensively how to brainwash kids into wanting there <br/>\nstuff and the government does not protect the people from very toxic <br/>\ningredients in some so called food that is directly targeted towards <br/>\nchildren.(Aspertame, propalene glysol etc.)<br/>\nWhat about these issues? Do you think that if you are able to <br/>\ncompletely let go of these fears even subconsiously that none of <br/>\nthese will effect you or your children? I believe that could be true <br/>\nbut I am not sure how to do that?<br/>\nThese are all the deepest darkest fears I have about tv. I have never <br/>\nheard anything that challenged thier validity until now.<br/>\n<br/>\nNow I am all about letting go of fear and expanding my awareness.. <br/>\nFirst you have to be aware of the fear. I did not see myself as <br/>\nfearing tv for my children before, but now I see where the fear has <br/>\nbeen instilled in me. I did not miss tv as a child tho. My dad would <br/>\nread us esp stories around the table after dinner.<br/>\n<br/>\nThank you all for your honest input<br/>\nDonanne<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Meredith&quot; &lt;meredith@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;donannedean&quot; &lt;ibex@&gt; <br/>\n&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; What about unschooling without a tv?.<br/>\n&gt; <br/>\n&gt; Keep in mind that your options are more varied than no-tv-at-all <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; 900 channels of everything all the time. Your 4yo is already <br/>\n&gt; watching some movies on the computer. At some point you might <br/>\n&gt; consider getting a separate tv with a dvd player, or maybe just a <br/>\n&gt; portable dvd player, to expand the options a little. That way one <br/>\n&gt; kid could play a computer game while the other watches a movie, or <br/>\n&gt; they could watch separate movies, or they could watch a kid-movie <br/>\n&gt; while mom and dad snuggle up with something they would find dull. <br/>\n&gt; You could subscribe to a dvd service so your kids could watch some <br/>\n&gt; kids shows that way. Its about options.<br/>\n&gt; <br/>\n&gt; &gt; sometimes we watch it if we are at someone elses house.<br/>\n&gt; <br/>\n&gt; Its a good idea to see how they are relating to tv at others&#39; homes <br/>\n&gt; to get an idea if broadcast or cable tv is something you should be <br/>\n&gt; offerring. Kids don&#39;t always come right out and ask - especially if <br/>\n&gt; its something they know mom is uncomfortable about. I could see my <br/>\n&gt; dd was easily frustrated by broadcast tv at others&#39; homes, so I <br/>\n&gt; didn&#39;t offer. We live on a pretty tight budget, and there&#39;s no free <br/>\n&gt; tv where I live. I suspected at some point her interest level would <br/>\n&gt; exceed her frustration level, though.  <br/>\n&gt; <br/>\n&gt; My stepson moving in changed the issues somewhat - he *wanted* <br/>\n&gt; satellite, so we got it. He had only had basic broadcast at his <br/>\n&gt; mom&#39;s house, and &quot;knew&quot; not to ask for more than that, so I <br/>\n&gt; suggested the satellite option to him - he jumped up and down and <br/>\n&gt; hooted with joy.<br/>\n&gt; <br/>\n&gt; &gt; I believe in moving in a direction of a more naturel lifestyle. <br/>\n </span></blockquote>It <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; feels good to me and to Mother Earth.<br/>\n&gt; <br/>\n&gt; Well, I live in the woods, in a cabin I built myself, with spring <br/>\n&gt; water, a wood-stove and a composting toilet. In the past I&#39;ve lived <br/>\n&gt; with no electricity or running water, and if you take a walk with <br/>\n </span></blockquote>me <br/>\n<blockquote><span title=\"ireply\"> &gt; in the woods, get ready to hear &quot;hey, you can eat that!&quot; a <br/>\n </span></blockquote>gazillion <br/>\n<blockquote><span title=\"ireply\"> &gt; times. So I do understand about wanting to live close to nature. <br/>\n&gt; Having a tv - even having a satellite dish - doesn&#39;t necessarily <br/>\n&gt; hamper that.<br/>\n&gt; <br/>\n&gt; This morning, for example, my 5yo got up, watched one tv program <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; then went outside to climb trees. Right now, she and her dad are <br/>\n </span></blockquote>out <br/>\n<blockquote><span title=\"ireply\"> &gt; working on a simple treehouse that she designed. Pretty <br/>\n </span></blockquote>picturesque. <br/>\n<blockquote><span title=\"ireply\"> &gt; She *could* be inside watching tv but is choosing not to. <br/>\n&gt; <br/>\n&gt; &gt; I guess I do have fear around my children watching violent tv at <br/>\n </span></blockquote>a <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; young age. And my question is: Is there not a ballance where you <br/>\n&gt; could <br/>\n&gt; &gt; listen to your inner vision about whether an environment is safe <br/>\n&gt; for <br/>\n&gt; &gt; your children or not?<br/>\n&gt; <br/>\n&gt; Rather than listening to your &quot;inner vision&quot; listen to and watch <br/>\n&gt; your kids. Its possible to empower kids to make their own decisions <br/>\n&gt; about what&#39;s &quot;too much&quot; for them, personally. My 5yo doesn&#39;t like <br/>\n&gt; dramatic tension in live-action shows and movies *at all*. I know <br/>\n&gt; this from watching with her and being really responsive to her <br/>\n&gt; statements, sounds and body language. I don&#39;t expect her to watch <br/>\n&gt; something that makes her uncomfortable. I&#39;ve helped her find ways <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; turn things off either on her own or asking someone else, or look <br/>\n&gt; for other solutions. <br/>\n&gt; <br/>\n&gt; Last summer she decided she Really wanted to watch one of the Harry <br/>\n&gt; Potter movies - she fell in love with a magical creature she saw on <br/>\n&gt; the cover of the movie case. We borrowed a friend&#39;s copy but she <br/>\n&gt; couldn&#39;t stand to watch more than a few minutes of it. She didn&#39;t <br/>\n&gt; want to give it up, though. She devised a plan for watching it - <br/>\n </span></blockquote>she <br/>\n<blockquote><span title=\"ireply\"> &gt; watched the extras, then watched it scene by scene in different <br/>\n&gt; languages. Finally she was able to watch the whole thing, beginning <br/>\n&gt; to end, in English. It was a pretty amazing process, and one that <br/>\n&gt; wouldn&#39;t have happened if her dad or I had made the decision &quot;too <br/>\n&gt; scary&quot; for her. <br/>\n&gt; <br/>\n&gt; &gt; Wouldn&#39;t you want to protect <br/>\n&gt; &gt; your young child from say an environment such as Gandpa&#39;s house?<br/>\n&gt; <br/>\n&gt; This goes right along with empowering them to make decisions about <br/>\n&gt; what to watch. Do your kids *want* to visit their grandpa? How long <br/>\n&gt; do they want to stay? Do you tell them &quot;we&#39;re going&quot; or ask? If <br/>\n </span></blockquote>they <br/>\n<blockquote><span title=\"qreply\"> &gt; aren&#39;t interested in being there, don&#39;t take them. If they want to <br/>\n&gt; see him, but not in his home, make arrangements to meet him <br/>\n&gt; elsewhere. Chuck E Cheese is a nice, busy environment that he might <br/>\n&gt; find very stimulating.<br/>\n&gt; <br/>\n&gt; ---Meredith (Mo 5.5, Ray 13)<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181191208","msgId":29145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4MzEyQ0NCLUQ4MDEtNDgxMC1CRDMyLTcwRjk3MzBGREEwNUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwYzcwMWM3YTg4OSQ5Y2E3ZmY3MCQwMjAyYThjMEBDcmFpZz4=","referencesHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPiA8ZjQ3MWUzK2lxMHBAZUdyb3Vwcy5jb20+IDwwMGM3MDFjN2E4ODkkOWNhN2ZmNzAkMDIwMmE4YzBAQ3JhaWc+"},"prevInTopic":29143,"nextInTopic":29147,"prevInTime":29144,"nextInTime":29146,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"I d love to have a couple of horses, but they cost too much and take up a whole lot of obligatory time, every day. M;y daughter rode horses through her 4H","messageBody":"<div id=\"ygrps-yiv-1650865777\">I&#39;d love to have a couple of horses, but they cost too much and take  <br/>\nup a whole lot of obligatory time, every day. M;y daughter rode  <br/>\nhorses through her 4H club, which had 26 horses, for four years and I  <br/>\nknow, first-hand, how much work it is and how much it costs.<br/>\n<br/>\nSo we, rather reluctantly, have decided we can&#39;t afford horses these  <br/>\ndays.<br/>\n<br/>\nA tv does NOT require stabling and doesn&#39;t require twice a day  <br/>\nfeeding and doesn&#39;t get lonely and weird when it isn&#39;t watched  <br/>\nregularly and it doesn&#39;t need to be washed and cleaned and, oh yeah,  <br/>\nno mucking out its stall &lt;G&gt;.<br/>\n<br/>\nA tv sits in the corner minding its own business, coming to life only  <br/>\nwhen we choose to click the remote!<br/>\n<br/>\nAs wonderful as a horse is, and I love them, it doesn&#39;t open up the  <br/>\nkinds of worlds that a tv does.<br/>\n<br/>\nCan a family happily unschool without a tv? Of course. It isn&#39;t some  <br/>\nkind of essential tool.<br/>\n<br/>\nBut if a family is restricting tv because they are fearful of what  <br/>\nthe kids will learn by watching it - that attitude is  <br/>\ncounterproductive to unschooling. It is the fear and lack of trust in  <br/>\nthe children and that parents are making an arbitrary choice to  <br/>\nrestrict something that could be wonderful, could open all kinds of  <br/>\nlearning opportunities to the kids, that is the problem, not the lack  <br/>\nof tv.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 6, 2007, at 3:25 PM, Cathy wrote:<br/>\n<br/>\n&gt; From the recent posts on the matter, it seems that unschoolers feel  <br/>\n&gt; that a<br/>\n&gt; TV is an essential item for successful unschooling.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181178080","msgId":29143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENEMEIwODI2LTEwQzYtNDZCQS1COEE2LTU2MjkwRTgzQkU4QUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGY0N2lhcis0azZvQGVHcm91cHMuY29tPg==","referencesHeader":"PGY0N2lhcis0azZvQGVHcm91cHMuY29tPg=="},"prevInTopic":29141,"nextInTopic":29145,"prevInTime":29142,"nextInTime":29144,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"-=-I think it says something pretty sad and significant that these stores seem to be closing everywhere. We ve only been unschooling for three years, and used","messageBody":"<div id=\"ygrps-yiv-1461811689\">-=-I think it says something pretty sad and significant that these  <br/>\nstores<br/>\nseem to be closing everywhere. We&#39;ve only been unschooling for three<br/>\nyears, and used to go to these kind of places, but now have to drive<br/>\npretty far to find a &quot;good&quot; teacher supply place.<br/>\n-=-<br/>\n<br/>\nTeachers used to drive from all over New Mexico to Albuquerque to get  <br/>\nsupplies, and now anyone anywhere can get more, better and less  <br/>\nexpensive stuff off the internet.  It&#39;s sad for me because that was  <br/>\nsomething familiar to me and change can be sad and nostalgia can be  <br/>\nsweet.<br/>\n<br/>\nThose places aren&#39;t needed the same way they once were.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":189611316,"authorName":"huntmom1996","from":"&quot;huntmom1996&quot; &lt;jechunt@...&gt;","profile":"huntmom1996","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and TV","postDate":"1181174939","msgId":29141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0N2lhcis0azZvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFBQTlEQUExLTMxQUYtNDM5Ny1CNTVFLUZCOTFERkM1ODc5NUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":29140,"nextInTopic":29143,"prevInTime":29140,"nextInTime":29142,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"... I think it says something pretty sad and significant that these stores seem to be closing everywhere.  We ve only been unschooling for three years, and","messageBody":"<div id=\"ygrps-yiv-1379776731\">***There was a teachers&#39; supply store in Albuquerque that we LOVED  <br/>\n<blockquote><span title=\"ireply\"> &gt; called Colburn&#39;s, and we&#39;d get games and counters and fancy pencils  <br/>\n&gt; posters and paints and individual crayons and Dover books and other  <br/>\n&gt; coloring books.  But it closed.***<br/>\n<br/>\n </span></blockquote>I think it says something pretty sad and significant that these stores <br/>\nseem to be closing everywhere.  We&#39;ve only been unschooling for three <br/>\nyears, and used to go to these kind of places, but now have to drive <br/>\npretty far to find a &quot;good&quot; teacher supply place.<br/>\n<br/>\nSorry, I know that&#39;s a bit off topic :)<br/>\n<br/>\nPeace~Jessica</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181173206","msgId":29140,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2NDVDQUY5LTdDRTItNDE2Qy04OUMxLTA5Q0RFRjYyRkYxM0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwYzcwMWM3YTg4OSQ5Y2E3ZmY3MCQwMjAyYThjMEBDcmFpZz4=","referencesHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPiA8ZjQ3MWUzK2lxMHBAZUdyb3Vwcy5jb20+IDwwMGM3MDFjN2E4ODkkOWNhN2ZmNzAkMDIwMmE4YzBAQ3JhaWc+"},"prevInTopic":29139,"nextInTopic":29141,"prevInTime":29139,"nextInTime":29141,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"-=-Why does this TV issue keep coming up? Am I just not getting something here? -=- Are you not getting that the same topics will come up, always, because","messageBody":"<div id=\"ygrps-yiv-1999013391\">-=-Why does this TV issue keep coming up? Am I just not getting  <br/>\nsomething here? -=-<br/>\n<br/>\nAre you not getting that the same topics will come up, always,  <br/>\nbecause there are always new unschoolers?  We&#39;ve had 20 people join  <br/>\nthe list since the beginning of June.<br/>\n<br/>\nThe first time someone&#39;s in a discussion she might just ignore it  <br/>\nbecause she believes what she believes.<br/>\nAs she gets more experience with unschooling and some things aren&#39;t  <br/>\nworking, she&#39;ll be looking to discard and rearrange some beliefs.<br/>\n<br/>\nOnce things start to work well and the changes come, some people  <br/>\nstick around to help others.<br/>\n<br/>\nThat&#39;s the pattern.<br/>\n<br/>\n-=-From the recent posts on the matter, it seems that unschoolers  <br/>\nfeel that a<br/>\nTV is an essential item for successful unschooling.<br/>\n<br/>\n-=-We have horses, and we would argue that unschoolers (actually all  <br/>\npeople)<br/>\nneed horses.-=-<br/>\n<br/>\nSomeone made a similar argument a while back (maybe on  <br/>\nUnschoolingDiscussion, maybe here) about a backhoe.<br/>\nI have three guitars, a piano, three electric keyboards, a reed organ  <br/>\nand a dozen recorders in five different voices, but I don&#39;t expect  <br/>\nothers to have all those instruments.  I wouldn&#39;t do well without at  <br/>\nleast one recorder and a guitar, but others do fine.<br/>\n<br/>\n-=-but when someone doesn&#39;t<br/>\nhave a TV, it seems that they are missing out - and people are quite  <br/>\nquick<br/>\nto say so.<br/>\n<br/>\n-=-Please explain.-=-<br/>\n<br/>\nThe explanation is in Pam&#39;s post earlier today, and more is here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181172252","msgId":29137,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2RjhFOTQ5LTA1QTEtNDFBNS04NjQ1LTA2RTJCN0VBQUJBMUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGY0NzFlMytpcTBwQGVHcm91cHMuY29tPg==","referencesHeader":"PGY0NzFlMytpcTBwQGVHcm91cHMuY29tPg=="},"prevInTopic":29136,"nextInTopic":29138,"prevInTime":29136,"nextInTime":29138,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"-=-Rather than listening to your inner vision listen to and watch your kids.-=- Great advice. Sandra [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-2084622053\">-=-Rather than listening to your &quot;inner vision&quot; listen to and watch<br/>\nyour kids.-=-<br/>\n<br/>\nGreat advice.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181172124","msgId":29136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFBQTlEQUExLTMxQUYtNDM5Ny1CNTVFLUZCOTFERkM1ODc5NUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGY0NzBuNis2NDdpQGVHcm91cHMuY29tPg==","referencesHeader":"PGY0NzBuNis2NDdpQGVHcm91cHMuY29tPg=="},"prevInTopic":29135,"nextInTopic":29137,"prevInTime":29135,"nextInTime":29137,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"-=-When we were at that phase, I reassured my husband by taking the kids to one of those teacher stores and letting them pick out what they wanted. It saved $","messageBody":"<div id=\"ygrps-yiv-997116365\">-=-When we were at that phase, I reassured my husband by taking the kids<br/>\nto one of those teacher stores and letting them pick out what they<br/>\nwanted. It saved $ and he thought it was good cause it was the same<br/>\nstuff the teachers buy. It ended up to work out ok, I&#39;m not saying<br/>\nthats true unschooling, I&#39;m saying it was a bridge to unschooling. -=-<br/>\n<br/>\nThere was a teachers&#39; supply store in Albuquerque that we LOVED  <br/>\ncalled Colburn&#39;s, and we&#39;d get games and counters and fancy pencils  <br/>\nposters and paints and individual crayons and Dover books and other  <br/>\ncoloring books.  But it closed.  When it was open we used to go in  <br/>\njust to look at things, like the globes of the moon, and the charts  <br/>\nteachers used to track kids and &quot;reward&quot; them with stars and stuff.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":229396800,"authorName":"Cathy","from":"&quot;Cathy&quot; &lt;cathy@...&gt;","profile":"cathykoetsier","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181168739","msgId":29135,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYzcwMWM3YTg4OSQ5Y2E3ZmY3MCQwMjAyYThjMEBDcmFpZz4=","inReplyToHeader":"PGY0NzFlMytpcTBwQGVHcm91cHMuY29tPg==","referencesHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPiA8ZjQ3MWUzK2lxMHBAZUdyb3Vwcy5jb20+"},"prevInTopic":29134,"nextInTopic":29136,"prevInTime":29134,"nextInTime":29136,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"Hiya I m puzzled. Why does this TV issue keep coming up? Am I just not getting something here? By choice, we (hubby, me and all 5 kids ages 5,10,12,15 and 17 -","messageBody":"<div id=\"ygrps-yiv-1391548312\">Hiya<br/>\n<br/>\nI&#39;m puzzled. Why does this TV issue keep coming up? Am I just not getting<br/>\nsomething here? <br/>\n<br/>\nBy choice, we (hubby, me and all 5 kids ages 5,10,12,15 and 17 - although to<br/>\nbe absolutely honest I guess the 5 year old has not had too much say about<br/>\nit) don&#39;t have a TV and it has not been an issue for any of us, although we<br/>\ndo discuss the option of getting one from time to time. We don&#39;t miss having<br/>\none and we honestly don&#39;t feel we have the time for one; our lives are so<br/>\nbusy. We do have a digital projector, and we enjoy watching DVD&#39;s,<br/>\nespecially on those early winter nights.<br/>\n<br/>\nFrom the recent posts on the matter, it seems that unschoolers feel that a<br/>\nTV is an essential item for successful unschooling. <br/>\n<br/>\nWe have horses, and we would argue that unschoolers (actually all people)<br/>\nneed horses. But most people don&#39;t have horses and don&#39;t particularly care<br/>\nthat they don&#39;t either. And I don&#39;t read mails on the list about how kids<br/>\nare missing out because they don&#39;t have horses, but when someone doesn&#39;t<br/>\nhave a TV, it seems that they are missing out - and people are quite quick<br/>\nto say so.<br/>\n<br/>\nPlease explain.<br/>\n<br/>\nRegards<br/>\n<br/>\nCathy<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185618401,"authorName":"cyrusnmayasmama","from":"&quot;cyrusnmayasmama&quot; &lt;bluemoon@...&gt;","profile":"cyrusnmayasmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and TV","postDate":"1181166578","msgId":29138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0N2E1aStkZDRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM1MUE2NDhELTIxMjYtNDlDRi05MkMxLTZDRkQ0QjUyODIwNkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":29137,"nextInTopic":29139,"prevInTime":29137,"nextInTime":29139,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"I have been thinking about this a lot lately because we have recently moved into a house that has cable TV and came partially furnished with 2 TV sets. At the","messageBody":"<div id=\"ygrps-yiv-195031838\">I have been thinking about this a lot lately because we have recently<br/>\nmoved into a house that has cable TV and came partially furnished with<br/>\n2 TV sets. At the same time that we moved we were given another TV set<br/>\nand in the past 6 months we bought a gaming system that required<br/>\nbuying a TV to play on. Suddenly we have 4 TVs and lots of channels.<br/>\nBefore all of this we had only computers and a portable DVD player to<br/>\nwatch movies on (unrestricted). My kids (ages 4,7,&10) had not asked<br/>\nfor TV but I was in no hurry to get one either because where we live<br/>\nyou must pay for a service to get any reception. I knew we would have<br/>\nTV eventually so I had really been trying to work through all of my<br/>\nissues. I grew up with severe TV restrictions and very blatant<br/>\nnegative judgements regarding programming so that even when I was<br/>\nallowed to watch I felt guilty for enjoying things like &quot;Love Boat&quot;<br/>\nand &quot;Three&#39;s Company&quot; and  &quot;General Hospital&quot; because I knew they were<br/>\n&quot;crap&quot;.<br/>\n<br/>\nWhen the kids were younger I really liked that we had no TV, but it<br/>\nwas very true that every time the grandparents visited and stayed at<br/>\nthe resorts it was difficult to get them away from the TV to do other<br/>\nthings. Same when we would visit my parents on the mainland or friends<br/>\nwhere they would watch. There was a part of me that feared that they<br/>\nwould be the same way at home. Well, guess what? I was right!!;) We<br/>\nhave had the TVs and cable for (only)1 month  and they watch A LOT of<br/>\nTV. Unless they have friends over (none of their friends are limited<br/>\nin their watching so they don&#39;t want to watch when they are here:)<br/>\nthey are most likely to be watching TV. And the shows they want to<br/>\nwatch the most? GAME SHOWS!! Did you know that there is a game show<br/>\nnetwork (GSN) that plays gameshows 24/7?!<br/>\n<br/>\nMy oldest 2 spend quite a bit of time with their friends and our house<br/>\nhas always been the &quot;fun&quot; house where they can try crazy experiments<br/>\nand create giant messes and jump on the trampoline and go prawning in<br/>\nthe ditch and help themselves to whatever they are hungry for.  We got<br/>\nthe gaming system because we knew it would be great fun and our son<br/>\nwas wanting to spend time at other kid&#39;s houses because they had video<br/>\ngames. I want our house to be an equally attractive option. This<br/>\nsummer we are setting up an above the ground pool and a batting cage<br/>\npartially with that in mind. <br/>\n<br/>\nI don&#39;t think that they will always want to watch game shows for most<br/>\nof the day and I am grateful to lists like this one that have helped<br/>\nme examine my fears and controls of TV and food (and  to see them for<br/>\nwhat they really were - fears) because to be honest, I am having a<br/>\nblast watching game shows too- something I would not have allowed<br/>\nmyself a couple of years ago! The 70&#39;s and 80&#39;s hairdos and clothes<br/>\ncrack us up - my kids can&#39;t believe that I used to dress like that!<br/>\nAnd the connections that happen every day because of this new exposure<br/>\nis so fun!<br/>\n<br/>\nMy 10 yr old DS has just blossomed with self confidence and exudes<br/>\nthis calm inner sense of himself lately that completely coincides with<br/>\nhis acceptance of the trust that I have shown in him as a result of my<br/>\nown unschooling wrt TV.<br/>\n<br/>\nOne last note on this. My DH just finished reading a novel where one<br/>\nof the characters comes to the US from the Marshall Islands (very 3rd<br/>\nworld) and is obsessed with watching &quot;The Price is Right&quot;. It is how<br/>\nshe learns to speak English. We had a good laugh about the<br/>\nsimilarities between this character and our own children. It is as if<br/>\nthey are learning a new language having been cut off from a huge part<br/>\nof our culture for a long time. The result is that they are even more<br/>\ninteresting people now and they get even more jokes and they can<br/>\nparticipate more fully in conversations with this new cultural<br/>\nknowledge. I am now having a difficult time remembering what it was<br/>\nthat I feared - except maybe that they would watch game shows all day<br/>\nlong ;) - Alyse</div>","specialLinks":[]},{"userId":239974035,"authorName":"Tina","from":"&quot;Tina&quot; &lt;kunjaana@...&gt;","profile":"kunjaana","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and TV","postDate":"1181162148","msgId":29139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0NzVyNStiaGVmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM1MUE2NDhELTIxMjYtNDlDRi05MkMxLTZDRkQ0QjUyODIwNkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":29138,"nextInTopic":29140,"prevInTime":29138,"nextInTime":29140,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"I used to have my fears about the tv. There were so may experts that said tv does more harm that good. And I used to be very limiting on how much tv I let","messageBody":"<div id=\"ygrps-yiv-1653347522\">I used to have my fears about the tv. There were so may &quot;experts&quot; <br/>\nthat said tv does more harm that good. And I used to be very <br/>\nlimiting on how much tv I let the kids watch. <br/>\nBut my son loves to watch tv and I let go of all the limits. He <br/>\nreally enjoys it and I enjoy watching it with him. I wished there <br/>\nwere shows on like that on when I was a kid. Jimmy Nuetron, Avatar, <br/>\nSponge Bob, and my all time fav-Pucca. They all rock and we have so <br/>\nmuch fun watching them together. <br/>\nI can understand where the other family is coming from with their <br/>\nfears b/c I was there once. Even though I dont know them I assume <br/>\nthey are trying to do whats best for their children. Sometimes <br/>\npeople make these kind of decisions not b/c they are mean control <br/>\nfreak parents but out of fear and ignorance on the subject. <br/>\nDo you think your freedom with tv and the good experiences you have <br/>\ncan show them that it is a good?<br/>\nBeing exosed to other peoples experiences and remembering my own <br/>\nchildhood really helped me let go of that issue.<br/>\nUsually when my kids are visiting over someone else house they are <br/>\ntoo busy exploring all the new toys and surroundings and dont really <br/>\ncare if the tv is on or not. But mine are all younger. I dont know <br/>\nif it is different with older children. And when we have people over <br/>\nand they dont want thier children watching a certain show or tv in <br/>\ngeneral and my children are watching something I will put it on our <br/>\nroom and let them watch it in there-which they dont mind. I have <br/>\nnever had anyone comment on our freedom with the tv yet so I dont <br/>\nreally know how I would handle that. Probably with an answer <br/>\nlike &quot;they learn alot from the tv&quot; and &quot;We love to watch it together <br/>\nand talk about the things we seen&quot;.<br/>\nBut when I was a child-I was left alone at home with my siblings all <br/>\nthe time after school and in the summer. No one was there to control <br/>\nus while our parents were at work and we watched whatever we wanted. <br/>\nAnd I can say that it didnt affect me in a negetive way at all. In <br/>\nfact it revealed to me many opportunities and ideas and exposed <br/>\ndifferences in people and situations. I loved MTV and watched it as <br/>\nmuch as I could. Do any of you remember Liquid Television? That <br/>\nplayed a huge roll in shaping my artistic abilities. <br/>\nAnd we never watched any thing like taxas chainsaw massacre. I think <br/>\nthe most violent show we watched was Power Rangers ^-^.Well. Im not <br/>\ntrying to drag this out. We havent been doing this very long but <br/>\nthis has been our experience so far and all the changes we have made <br/>\nhave had positive effects.I hope it was helpful.<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pamela Sorooshian <br/>\n&lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Jun 6, 2007, at 8:49 AM, donannedean wrote:<br/>\n&gt; <br/>\n&gt; &gt; What about unschooling without a tv?.<br/>\n&gt; <br/>\n&gt; Big loss of a LOT of wonderful stuff.<br/>\n&gt; <br/>\n&gt; &gt; I have 2 daughters ages 4 and<br/>\n&gt; &gt; 1.<br/>\n&gt; <br/>\n&gt; They&#39;re young. But there are some pretty wonderful things that a <br/>\n </span></blockquote>4  <br/>\n<blockquote><span title=\"ireply\"> &gt; year old would be likely to get a lot out of.<br/>\n&gt; <br/>\n&gt; &gt; TV is very boring to me<br/>\n&gt; <br/>\n&gt; Too broad a generalization (even applied only to oneself). Making  <br/>\n&gt; such absolute statements is a sign of a lack of conscious <br/>\n </span></blockquote>decision  <br/>\n<blockquote><span title=\"ireply\"> &gt; making. It ignores all the complexities of what constitutes &quot;tv&quot; <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; lumps together all of what is shown on tv as if it is all the <br/>\n </span></blockquote>same -  <br/>\n<blockquote><span title=\"ireply\"> &gt; all boring. If you were at a zoo and happened to be there when <br/>\n </span></blockquote>lion  <br/>\n<blockquote><span title=\"ireply\"> &gt; cubs were playing? Why would it become boring if it is shown on tv?<br/>\n&gt; <br/>\n&gt; &gt; and I know I prefer to provide my young<br/>\n&gt; &gt; children with a naturel environment.<br/>\n&gt; <br/>\n&gt; They can be provided with a vastly expanded environment through <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; magic of tv. You&#39;re limiting their exposure to only what they can  <br/>\n&gt; experience first-hand in your own area or where you can manage to  <br/>\n&gt; travel.<br/>\n&gt; <br/>\n&gt; &gt; We just don&#39;t have tv.<br/>\n&gt; <br/>\n&gt; Again, there is that flat absolute quality to what you&#39;ve said - <br/>\n </span></blockquote>as  <br/>\n<blockquote><span title=\"ireply\"> &gt; if &quot;just&quot; happens that you don&#39;t have tv.<br/>\n&gt; <br/>\n&gt; &gt; We play<br/>\n&gt; &gt; instead<br/>\n&gt; <br/>\n&gt; We play, too, and often our play has been enhanced by things <br/>\n </span></blockquote>learned  <br/>\n<blockquote><span title=\"ireply\"> &gt; watching tv.<br/>\n&gt; <br/>\n&gt; &gt; and sometimes we watch it if we are at someone elses house.<br/>\n&gt; <br/>\n&gt; It has always been annoying to my kids that other children would <br/>\n </span></blockquote>come  <br/>\n<blockquote><span title=\"ireply\"> &gt; to play, here, and want to watch tv all the time. It is VERY <br/>\n </span></blockquote>apparent  <br/>\n<blockquote><span title=\"ireply\"> &gt; that kids who live in tv-restricted homes are much more attracted <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"ireply\"> &gt; watching &quot;just anything that is on.&quot; My kids, with unlimited <br/>\n </span></blockquote>access  <br/>\n<blockquote><span title=\"ireply\"> &gt; to tv, were far more selective and thoughtful about their choices.<br/>\n&gt; <br/>\n&gt; &gt; I<br/>\n&gt; &gt; do choose to limit the stay at grandpas house because he has the <br/>\n </span></blockquote>tv on<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; 24/7 and will not budge from it and watches violent shows.<br/>\n&gt; <br/>\n&gt; Do the girls want to watch what he is watching? My kids would not  <br/>\n&gt; have wanted to watch it - but, then, they had tv at home to <br/>\n </span></blockquote>whatever  <br/>\n<blockquote><span title=\"ireply\"> &gt; extent they wanted, so there was no reason for them to watch <br/>\n </span></blockquote>stuff  <br/>\n<blockquote><span title=\"ireply\"> &gt; they didn&#39;t much enjoy, just because it was on at the grandparents.<br/>\n&gt; <br/>\n&gt; &gt; He had a<br/>\n&gt; &gt; stroke and is very brain damaged and is afraid to turn off the <br/>\n </span></blockquote>tv.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; You could get him a pair of wireless headphones - then only he <br/>\n </span></blockquote>would  <br/>\n<blockquote><span title=\"ireply\"> &gt; hear the sound and it wouldn&#39;t be so pervasive. Or meet them  <br/>\n&gt; somewhere else, if he goes out.<br/>\n&gt; <br/>\n&gt; &gt; Also<br/>\n&gt; &gt; he smokes alot and the house is full of smoke and the kids don&#39;t <br/>\n </span></blockquote>mind<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; leaving at all.<br/>\n&gt; <br/>\n&gt; I would not let my kids be in a house where a brain-damaged <br/>\n </span></blockquote>person  <br/>\n<blockquote><span title=\"ireply\"> &gt; was smoking. We had a fire in our house a year and a half ago  <br/>\n&gt; (started in the clothes dryer) and I wouldn&#39;t risk my kids being <br/>\n </span></blockquote>in a  <br/>\n<blockquote><span title=\"ireply\"> &gt; place where there is fire danger. Also, one of mine has asthma - <br/>\n </span></blockquote>so  <br/>\n<blockquote><span title=\"ireply\"> &gt; we tried to stay out of smoke-filled spaces, for her sake, as <br/>\n </span></blockquote>well.  <br/>\n<blockquote><span title=\"ireply\"> &gt; But, what does that have to do with tv? Mushing these together in  <br/>\n&gt; your head isn&#39;t useful for making conscious decisions.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; I play with them when we are there(which they prefer<br/>\n&gt; &gt; anyway) so they are not watching about the brutal murder of <br/>\n </span></blockquote>some  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; child.<br/>\n&gt; &gt; I don&#39;t consider it prohibiting them from watching tv because <br/>\n </span></blockquote>they are<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; not asking to watch it.<br/>\n&gt; <br/>\n&gt; So - why bring it up? Do you think that the long-time unschooling  <br/>\n&gt; families on this list who are recommending not restricting tv are, <br/>\n </span></blockquote>in  <br/>\n<blockquote><span title=\"ireply\"> &gt; fact, recommending that 1 and 4 year old children should be made <br/>\n </span></blockquote>to  <br/>\n<blockquote><span title=\"ireply\"> &gt; watch news of brutal child murders? This isn&#39;t clear thinking.<br/>\n&gt; <br/>\n&gt; &gt; Sometimes Avalon wants to watch a movie on the<br/>\n&gt; &gt; computer. I have bought her some movies but we just don&#39;t have <br/>\n </span></blockquote>very<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; many.<br/>\n&gt; <br/>\n&gt; &quot;Just don&#39;t?&quot; (You choose not to - using the word &quot;just&quot; over and  <br/>\n&gt; over makes it sound inevitable or like it &quot;just&quot; happens.)<br/>\n&gt; <br/>\n&gt; &gt; I believe in moving in a direction of a more naturel lifestyle.<br/>\n&gt; <br/>\n&gt; If you want your kids to really appreciate &quot;Mother Earth,&quot; then <br/>\n </span></blockquote>watch  <br/>\n<blockquote><span title=\"ireply\"> &gt; National Geographic specials and PBS &quot;Nature&quot; and   Nova and  <br/>\n&gt; Scientific American Frontiers. You&#39;re missing out on exposure of <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; grandeur and diversity of Mother Earth, otherwise.<br/>\n&gt; <br/>\n&gt; &gt; It<br/>\n&gt; &gt; feels good to me and to Mother Earth.<br/>\n&gt; <br/>\n&gt; Huh?<br/>\n&gt; <br/>\n&gt; &gt; I feel like we do not watch tv<br/>\n&gt; &gt; not out of fear but out of love.<br/>\n&gt; <br/>\n&gt; Sounds like it is out of limited thinking, to me. It is looking <br/>\n </span></blockquote>at  <br/>\n<blockquote><span title=\"ireply\"> &gt; the worst stuff on tv and thinking that is all there is to it.<br/>\n&gt; <br/>\n&gt; &gt; I do see how it would be different if<br/>\n&gt; &gt; my daughters were asking.<br/>\n&gt; <br/>\n&gt; They<br/>\n&gt; &gt; We also have organic healthy food to choose from at our house.<br/>\n&gt; <br/>\n&gt; So do we.<br/>\n&gt; <br/>\n&gt; &gt; It has<br/>\n&gt; &gt; always been that way so they love the food we eat and have never <br/>\n </span></blockquote>asked<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; for or even know what candy is.<br/>\n&gt; <br/>\n&gt; Not saying kids need candy, I&#39;m pretty sure mine had never had <br/>\n </span></blockquote>soda,  <br/>\n<blockquote><span title=\"ireply\"> &gt; for example, when they were your kids&#39; ages, but it seems the  <br/>\n&gt; environment would have to be pretty darn restricted to prevent a 4 <br/>\n </span></blockquote>yo  <br/>\n<blockquote><span title=\"ireply\"> &gt; from even knowing what candy is. No playing at other people&#39;s <br/>\n </span></blockquote>houses?  <br/>\n<blockquote><span title=\"ireply\"> &gt; No homeschool park days? No pinatas? No reading books in which <br/>\n </span></blockquote>kids  <br/>\n<blockquote><span title=\"ireply\"> &gt; have candy?<br/>\n&gt; <br/>\n&gt; &gt; Soon enough they will be exposed and<br/>\n&gt; &gt; see other kids eating it.<br/>\n&gt; <br/>\n&gt; And adults.<br/>\n&gt; <br/>\n&gt; &gt; I have had a lot of my own issues to deal<br/>\n&gt; &gt; with around food. I had terrible dairy allergies as a child. I <br/>\n </span></blockquote>have<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; avoided some gatherings because of the massive junk food, but <br/>\n </span></blockquote>never<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; gatherings my daughter was asking to go to.<br/>\n&gt; <br/>\n&gt; Waiting for kids to ask for things is not a useful unschooling  <br/>\n&gt; policy, in general. It is an unschooling parent&#39;s role to offer <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; extend and expand a child&#39;s experience, not to restrict it and <br/>\n </span></blockquote>hope  <br/>\n<blockquote><span title=\"ireply\"> &gt; the child won&#39;t ask for as long as possible. Again, I&#39;m not <br/>\n </span></blockquote>saying  <br/>\n<blockquote><span title=\"ireply\"> &gt; you have to give your kids candy, just saying that there is an  <br/>\n&gt; attitude of restriction that comes across clearly in your post as  <br/>\n&gt; being out of fear, in spite of your disclaimer.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Do you disagree with unschoolers providing a healthy environment <br/>\n </span></blockquote>for<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; there kids ( always researching if you are doing it out of fear <br/>\n </span></blockquote>or if<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; it is really a healthy environment) and then allowing them free <br/>\n </span></blockquote>rein<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; with in that?<br/>\n&gt; <br/>\n&gt; I think I provided an extraordinary environment for my kids (now <br/>\n </span></blockquote>16,  <br/>\n<blockquote><span title=\"ireply\"> &gt; 19, and 22). Mine had no tv restrictions and no specific food  <br/>\n&gt; restrictions. We &quot;protected&quot; them in a different way than you are  <br/>\n&gt; talking about, though. We didn&#39;t watch violent gruesome tv or <br/>\n </span></blockquote>movies  <br/>\n<blockquote><span title=\"ireply\"> &gt; when they were around. We watched stuff we thought they&#39;d enjoy, <br/>\n </span></blockquote>too.  <br/>\n<blockquote><span title=\"ireply\"> &gt; We watched a LOT of nature shows, because they liked them and so <br/>\n </span></blockquote>did  <br/>\n<blockquote><span title=\"ireply\"> &gt; we. We watched Sesame Street and Mr. Rogers and I cannot for the <br/>\n </span></blockquote>life  <br/>\n<blockquote><span title=\"ireply\"> &gt; of me imagine preventing children from watching Reading Rainbow - <br/>\n </span></blockquote>my  <br/>\n<blockquote><span title=\"ireply\"> &gt; kids absolutely loved it. They made their own versions - used our  <br/>\n&gt; video recorder and did book reviews like Reading Rainbow has.<br/>\n&gt; <br/>\n&gt; These days - my oldest daughter just called - she&#39;s in Alaska and  <br/>\n&gt; will be working as a back-country ranger in the wilds of the <br/>\n </span></blockquote>Alaskan  <br/>\n<blockquote><span title=\"ireply\"> &gt; wilderness. Nobody could &quot;love Mother Earth&quot; more. I don&#39;t see <br/>\n </span></blockquote>that  <br/>\n<blockquote><span title=\"ireply\"> &gt; tv-watching did anything but enhance that love.<br/>\n&gt; <br/>\n&gt; &gt; I am talking about younger children who are just learning<br/>\n&gt; &gt; about the world.<br/>\n&gt; <br/>\n&gt; Not learning as much about the world as they could if they were  <br/>\n&gt; seeing more of it.<br/>\n&gt; <br/>\n&gt; &gt; I learned about unschooling from Naomi Aldort. I am so <br/>\n </span></blockquote>greatfull.  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; And I<br/>\n&gt; &gt; am always working on being less controlling. I am a very lenient <br/>\n </span></blockquote>mom<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; and I find myself really having to get creative to allow my kids<br/>\n&gt; &gt; outlets for whatever it is I won&#39;t allow them to do because of <br/>\n </span></blockquote>safety<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; or major property damage.<br/>\n&gt; <br/>\n&gt; &gt; I guess I do have fear around my children watching violent tv at <br/>\n </span></blockquote>a<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; young age.<br/>\n&gt; <br/>\n&gt; So - can you not envision that they might not want to watch <br/>\n </span></blockquote>violent  <br/>\n<blockquote><span title=\"ireply\"> &gt; tv? Why would they want to watch it?<br/>\n&gt; <br/>\n&gt; &gt; And my question is: Is there not a ballance where you could<br/>\n&gt; &gt; listen to your inner vision about whether an environment is safe <br/>\n </span></blockquote>for<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; your children or not?<br/>\n&gt; <br/>\n&gt; Too much black or white thinking. It isn&#39;t a choice of &quot;gruesome/ <br/>\n&gt; violent tv&quot; versus &quot;no tv.&quot;<br/>\n&gt; <br/>\n&gt; &gt; You can always ask them ,which I do quite often,<br/>\n&gt; &gt; but there are some environments I cannot explain to them. Is it <br/>\n </span></blockquote>all my<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; stuff? What about mothering instincts. Wouldn&#39;t you want to <br/>\n </span></blockquote>protect<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; your young child from say an environment such as Gandpa&#39;s house?<br/>\n&gt; <br/>\n&gt; Your thinking will be more clear if you don&#39;t mentally mix up tv- <br/>\n&gt; watching at home with what goes on at grandpa&#39;s house and with <br/>\n </span></blockquote>eating  <br/>\n<blockquote><span title=\"ireply\"> &gt; candy and so on. Too many different situations all being <br/>\n </span></blockquote>considered  <br/>\n<blockquote><span title=\"ireply\"> &gt; as one and the same - think realistically about your own house. <br/>\n </span></blockquote>Would  <br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;you&quot; be watching violent shows when your kids were around? You&#39;d <br/>\n </span></blockquote>be  <br/>\n<blockquote><span title=\"ireply\"> &gt; cuddled up together watching something sweet and wonderful, I&#39;m <br/>\n </span></blockquote>sure!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Are you also saying, &quot;We just have no music at our house,&quot; <br/>\n </span></blockquote>because  <br/>\n<blockquote><span title=\"ireply\"> &gt; somebody else listens to music with violent lyrics?<br/>\n&gt; <br/>\n&gt; &quot;We just have no magazines here,&quot; because there are porn magazines?<br/>\n&gt; <br/>\n&gt; &quot;We just have no books,&quot; because there are graphically violent <br/>\n </span></blockquote>books  <br/>\n<blockquote><span title=\"ireply\"> &gt; in the world?&quot;<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@&gt; <br/>\n </span></blockquote>wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;<br/>\n&gt; &gt;&gt; -=-What do you guys do when you meet unschoolers who don&#39;t let <br/>\n </span></blockquote>their<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt; kids<br/>\n&gt; &gt;&gt; watch TV? It&#39;s hard for me to be around people like this. <br/>\n </span></blockquote>People  <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt; being<br/>\n&gt; &gt;&gt; driven into controlling things out of fear, but I am around <br/>\n </span></blockquote>these<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; types<br/>\n&gt; &gt;&gt; of people alot. I&#39;m wondering how you guys handle this?-=-<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; We planned non-TV things when their kids were over, or went to <br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; park.<br/>\n&gt; &gt;&gt; Overall, though, if they&#39;ll prohibit TV, they&#39;re prohibiting <br/>\n </span></blockquote>other<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt; things, and the parents&#39; fears kept them from trusting a family <br/>\n </span></blockquote>like<br/>\n<blockquote><span title=\"qreply\"> &gt; &gt;&gt; ours, so it was never a problem for very long.  :-/<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; Sandra<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Yahoo! Groups Links<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210259120,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;meredith@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and TV","postDate":"1181157635","msgId":29134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0NzFlMytpcTBwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPg=="},"prevInTopic":29133,"nextInTopic":29135,"prevInTime":29133,"nextInTime":29135,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"... Keep in mind that your options are more varied than no-tv-at-all and 900 channels of everything all the time. Your 4yo is already watching some movies on","messageBody":"<div id=\"ygrps-yiv-1302578456\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;donannedean&quot; &lt;ibex@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; What about unschooling without a tv?.<br/>\n<br/>\n </span></blockquote>Keep in mind that your options are more varied than no-tv-at-all and <br/>\n900 channels of everything all the time. Your 4yo is already <br/>\nwatching some movies on the computer. At some point you might <br/>\nconsider getting a separate tv with a dvd player, or maybe just a <br/>\nportable dvd player, to expand the options a little. That way one <br/>\nkid could play a computer game while the other watches a movie, or <br/>\nthey could watch separate movies, or they could watch a kid-movie <br/>\nwhile mom and dad snuggle up with something they would find dull. <br/>\nYou could subscribe to a dvd service so your kids could watch some <br/>\nkids shows that way. Its about options.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; sometimes we watch it if we are at someone elses house.<br/>\n<br/>\n </span></blockquote>Its a good idea to see how they are relating to tv at others&#39; homes <br/>\nto get an idea if broadcast or cable tv is something you should be <br/>\nofferring. Kids don&#39;t always come right out and ask - especially if <br/>\nits something they know mom is uncomfortable about. I could see my <br/>\ndd was easily frustrated by broadcast tv at others&#39; homes, so I <br/>\ndidn&#39;t offer. We live on a pretty tight budget, and there&#39;s no free <br/>\ntv where I live. I suspected at some point her interest level would <br/>\nexceed her frustration level, though.  <br/>\n<br/>\nMy stepson moving in changed the issues somewhat - he *wanted* <br/>\nsatellite, so we got it. He had only had basic broadcast at his <br/>\nmom&#39;s house, and &quot;knew&quot; not to ask for more than that, so I <br/>\nsuggested the satellite option to him - he jumped up and down and <br/>\nhooted with joy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I believe in moving in a direction of a more naturel lifestyle. It <br/>\n&gt; feels good to me and to Mother Earth.<br/>\n<br/>\n </span></blockquote>Well, I live in the woods, in a cabin I built myself, with spring <br/>\nwater, a wood-stove and a composting toilet. In the past I&#39;ve lived <br/>\nwith no electricity or running water, and if you take a walk with me <br/>\nin the woods, get ready to hear &quot;hey, you can eat that!&quot; a gazillion <br/>\ntimes. So I do understand about wanting to live close to nature. <br/>\nHaving a tv - even having a satellite dish - doesn&#39;t necessarily <br/>\nhamper that.<br/>\n<br/>\nThis morning, for example, my 5yo got up, watched one tv program and <br/>\nthen went outside to climb trees. Right now, she and her dad are out <br/>\nworking on a simple treehouse that she designed. Pretty picturesque. <br/>\nShe *could* be inside watching tv but is choosing not to. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess I do have fear around my children watching violent tv at a <br/>\n&gt; young age. And my question is: Is there not a ballance where you <br/>\n </span></blockquote>could <br/>\n<blockquote><span title=\"ireply\"> &gt; listen to your inner vision about whether an environment is safe <br/>\n </span></blockquote>for <br/>\n<blockquote><span title=\"ireply\"> &gt; your children or not?<br/>\n<br/>\n </span></blockquote>Rather than listening to your &quot;inner vision&quot; listen to and watch <br/>\nyour kids. Its possible to empower kids to make their own decisions <br/>\nabout what&#39;s &quot;too much&quot; for them, personally. My 5yo doesn&#39;t like <br/>\ndramatic tension in live-action shows and movies *at all*. I know <br/>\nthis from watching with her and being really responsive to her <br/>\nstatements, sounds and body language. I don&#39;t expect her to watch <br/>\nsomething that makes her uncomfortable. I&#39;ve helped her find ways to <br/>\nturn things off either on her own or asking someone else, or look <br/>\nfor other solutions. <br/>\n<br/>\nLast summer she decided she Really wanted to watch one of the Harry <br/>\nPotter movies - she fell in love with a magical creature she saw on <br/>\nthe cover of the movie case. We borrowed a friend&#39;s copy but she <br/>\ncouldn&#39;t stand to watch more than a few minutes of it. She didn&#39;t <br/>\nwant to give it up, though. She devised a plan for watching it - she <br/>\nwatched the extras, then watched it scene by scene in different <br/>\nlanguages. Finally she was able to watch the whole thing, beginning <br/>\nto end, in English. It was a pretty amazing process, and one that <br/>\nwouldn&#39;t have happened if her dad or I had made the decision &quot;too <br/>\nscary&quot; for her. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Wouldn&#39;t you want to protect <br/>\n&gt; your young child from say an environment such as Gandpa&#39;s house?<br/>\n<br/>\n </span></blockquote>This goes right along with empowering them to make decisions about <br/>\nwhat to watch. Do your kids *want* to visit their grandpa? How long <br/>\ndo they want to stay? Do you tell them &quot;we&#39;re going&quot; or ask? If they <br/>\naren&#39;t interested in being there, don&#39;t take them. If they want to <br/>\nsee him, but not in his home, make arrangements to meet him <br/>\nelsewhere. Chuck E Cheese is a nice, busy environment that he might <br/>\nfind very stimulating.<br/>\n<br/>\n---Meredith (Mo 5.5, Ray 13)</div>","specialLinks":[]},{"userId":312468553,"authorName":"bigmamma.bigmamma","from":"&quot;bigmamma.bigmamma&quot; &lt;bigmamma.bigmamma@...&gt;","profile":"bigmamma.bigmamma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and TV","postDate":"1181157035","msgId":29133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0NzByYitobGkxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI2QzE5MjI3LTQyNkEtNDA3QS04RUUwLTk4MTQwNzYxNDU3REBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":29132,"nextInTopic":29134,"prevInTime":29132,"nextInTime":29134,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"Oh, the best place to find good stories is the Library, got to get our tax $$ working for us. Free is always good! Lyn ... to ... your","messageBody":"<div id=\"ygrps-yiv-1367740785\">Oh, the best place to find good stories is the Library, got to get <br/>\nour tax $$ working for us. Free is always good! Lyn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-I agree it will be useful. There might be interesting stories <br/>\nto  <br/>\n&gt; read. Sometimes dd7 likes to do math worksheets so having them  <br/>\n&gt; available for her to choose will be handy.-=-<br/>\n&gt; <br/>\n&gt; I disagree.<br/>\n&gt; <br/>\n&gt; There aren&#39;t going to be $500 worth of interesting stories or math  <br/>\n&gt; worksheets.<br/>\n&gt; <br/>\n&gt; You can get math workbooks at the grocery store or toy store.  You  <br/>\n&gt; can get storybooks at any thrift shop.  With $500 you could take <br/>\nyour  <br/>\n&gt; family to do something VERY COOL and memorable.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":312468553,"authorName":"bigmamma.bigmamma","from":"&quot;bigmamma.bigmamma&quot; &lt;bigmamma.bigmamma@...&gt;","profile":"bigmamma.bigmamma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and TV","postDate":"1181156902","msgId":29132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0NzBuNis2NDdpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc3MTEzLjk3NzkucW1Ad2ViMzE5MTAubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":29131,"nextInTopic":29133,"prevInTime":29131,"nextInTime":29133,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"When we were at that phase, I reassured my husband by taking the kids to one of those teacher stores and letting them pick out what they wanted. It saved $ and","messageBody":"<div id=\"ygrps-yiv-1393919569\">When we were at that phase, I reassured my husband by taking the kids <br/>\nto one of those teacher stores and letting them pick out what they <br/>\nwanted. It saved $ and he thought it was good cause it was the same <br/>\nstuff the teachers buy. It ended up to work out ok, I&#39;m not saying <br/>\nthats true unschooling, I&#39;m saying it was a bridge to unschooling. <br/>\nLyn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Nicole Willoughby <br/>\n&lt;cncnawilloughby@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; It&#39;s very generous of Ren to leave her former beliefs out there as <br/>\n </span></blockquote>a <br/>\n<blockquote><span title=\"ireply\"> &gt; warning for people, and so they can see how and why she changed, <br/>\n </span></blockquote>and <br/>\n<blockquote><span title=\"ireply\"> &gt; what the results were. Ren&#39;s great.<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;    <br/>\n&gt;   Its fantastic to have things like this to show to my <br/>\n </span></blockquote>dh .......who still thinks that unschooling is fine for the last few <br/>\nmonths when we pulled them out and over the summer but we need a <br/>\ncurriculum starting fall. He still thinks a curriculum will be useful.<br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;   I agree it will be useful. There might be interesting stories to <br/>\n </span></blockquote>read. Sometimes dd7 likes to do math worksheets so having them <br/>\navailable for her to choose will be handy. We definetly need more <br/>\nbooks for all the paths, towers etc dd4 likes to build. We always <br/>\nneed paper for oragami and just think of all the kewl cut and paste <br/>\ncolages we could make from neat pictures we might find. <br/>\n<blockquote><span title=\"ireply\"> &gt;   Really though it has gotten him to &quot;well see how things go&quot; <br/>\n </span></blockquote>from &quot; what do you think of getting switched on schoolhouse?&quot;.<br/>\n<blockquote><span title=\"ireply\"> &gt;    <br/>\n&gt;    <br/>\n&gt;    <br/>\n&gt;    <br/>\n&gt; <br/>\n&gt;        <br/>\n&gt; ---------------------------------<br/>\n&gt; Get the free Yahoo! toolbar and rest assured with the added <br/>\n </span></blockquote>security of spyware protection. <br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling and TV","postDate":"1181154685","msgId":29131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2QzE5MjI3LTQyNkEtNDA3QS04RUUwLTk4MTQwNzYxNDU3REBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc3MTEzLjk3NzkucW1Ad2ViMzE5MTAubWFpbC5tdWQueWFob28uY29tPg==","referencesHeader":"PDc3MTEzLjk3NzkucW1Ad2ViMzE5MTAubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":29130,"nextInTopic":29132,"prevInTime":29130,"nextInTime":29132,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"-=-I agree it will be useful. There might be interesting stories to read. Sometimes dd7 likes to do math worksheets so having them available for her to choose","messageBody":"<div id=\"ygrps-yiv-515450887\">-=-I agree it will be useful. There might be interesting stories to  <br/>\nread. Sometimes dd7 likes to do math worksheets so having them  <br/>\navailable for her to choose will be handy.-=-<br/>\n<br/>\nI disagree.<br/>\n<br/>\nThere aren&#39;t going to be $500 worth of interesting stories or math  <br/>\nworksheets.<br/>\n<br/>\nYou can get math workbooks at the grocery store or toy store.  You  <br/>\ncan get storybooks at any thrift shop.  With $500 you could take your  <br/>\nfamily to do something VERY COOL and memorable.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181153722","msgId":29129,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2REE3QkQ0LTlGNTAtNDQ0NC1BNzIwLTE3QUU1M0MwQTlFNEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGY0NnJmaSs1OWhqQGVHcm91cHMuY29tPg==","referencesHeader":"PGY0NnJmaSs1OWhqQGVHcm91cHMuY29tPg=="},"prevInTopic":29128,"nextInTopic":29130,"prevInTime":29128,"nextInTime":29130,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"... Depends of whether or not you think they might want to hear an alternative point of view. I usually let it go. When I m present and hear other people","messageBody":"<div id=\"ygrps-yiv-1296165907\">On Jun 6, 2007, at 10:38 AM, bigmamma.bigmamma wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Really interesting conversation. Yeah, I am glad that Rens old (2001)<br/>\n&gt; post was brought up. Many parents change along the way, especially<br/>\n&gt; AWARE parents who are willing to look at their own stuff  <br/>\n&gt; (conditioning)<br/>\n&gt; and make informed decisions for the future. Thats kind of my  <br/>\n&gt; delima, do<br/>\n&gt; I want to &quot;inform&quot; these anti TV people that they might want to  <br/>\n&gt; look at<br/>\n&gt; their reasoning behind no TV or do I just let it go,<br/>\n<br/>\n </span></blockquote>Depends of whether or not you think they might want to hear an  <br/>\nalternative point of view.<br/>\n<br/>\nI usually let it go.<br/>\n<br/>\nWhen I&#39;m present and hear other people giving advice, &quot;Just get rid  <br/>\nof the tv,&quot; etc., I will speak up.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When I was worried<br/>\n&gt; about TV/video games (years ago) I would have been happy to meet<br/>\n&gt; someone like me who had a different opinion than what the mainstream<br/>\n&gt; public was thinking. Got to run, my kids who choose not to watch to<br/>\n&gt; much TV want to go to the pool. Bye, Lyn<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling and TV","postDate":"1181153109","msgId":29130,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3MTEzLjk3NzkucW1Ad2ViMzE5MTAubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PEUzRDhFMTE3LUVBQzUtNDVCOC04MjUxLUJEQjJEODExNkY5OUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":29129,"nextInTopic":29131,"prevInTime":29129,"nextInTime":29131,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"It s very generous of Ren to leave her former beliefs out there as a warning for people, and so they can see how and why she changed, and what the results","messageBody":"<div id=\"ygrps-yiv-1230448554\">It&#39;s very generous of Ren to leave her former beliefs out there as a <br/>\nwarning for people, and so they can see how and why she changed, and <br/>\nwhat the results were. Ren&#39;s great.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n   <br/>\n </span></blockquote>  Its fantastic to have things like this to show to my dh .......who still thinks that unschooling is fine for the last few months when we pulled them out and over the summer but we need a curriculum starting fall. He still thinks a curriculum will be useful.<br/>\n   <br/>\n  I agree it will be useful. There might be interesting stories to read. Sometimes dd7 likes to do math worksheets so having them available for her to choose will be handy. We definetly need more books for all the paths, towers etc dd4 likes to build. We always need paper for oragami and just think of all the kewl cut and paste colages we could make from neat pictures we might find. <br/>\n  Really though it has gotten him to &quot;well see how things go&quot; from &quot; what do you think of getting switched on schoolhouse?&quot;.<br/>\n   <br/>\n   <br/>\n   <br/>\n   <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nGet the free Yahoo! toolbar and rest assured with the added security of spyware protection. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":312468553,"authorName":"bigmamma.bigmamma","from":"&quot;bigmamma.bigmamma&quot; &lt;bigmamma.bigmamma@...&gt;","profile":"bigmamma.bigmamma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and TV","postDate":"1181151538","msgId":29128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0NnJmaSs1OWhqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEUzRDhFMTE3LUVBQzUtNDVCOC04MjUxLUJEQjJEODExNkY5OUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":29127,"nextInTopic":29129,"prevInTime":29127,"nextInTime":29129,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"Really interesting conversation. Yeah, I am glad that Rens old (2001) post was brought up. Many parents change along the way, especially AWARE parents who are","messageBody":"<div id=\"ygrps-yiv-1635187208\">Really interesting conversation. Yeah, I am glad that Rens old (2001) <br/>\npost was brought up. Many parents change along the way, especially <br/>\nAWARE parents who are willing to look at their own stuff (conditioning) <br/>\nand make informed decisions for the future. Thats kind of my delima, do <br/>\nI want to &quot;inform&quot; these anti TV people that they might want to look at <br/>\ntheir reasoning behind no TV or do I just let it go, When I was worried <br/>\nabout TV/video games (years ago) I would have been happy to meet <br/>\nsomeone like me who had a different opinion than what the mainstream <br/>\npublic was thinking. Got to run, my kids who choose not to watch to <br/>\nmuch TV want to go to the pool. Bye, Lyn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-&gt;&gt;&gt;&gt;By ren on Monday, August 6, 2001 - 03:15 am:<br/>\n&gt; I&#39;m probably one of the only other people here that do believe it&#39;s  <br/>\n&gt; ok to limit TV when necessary.-=-<br/>\n&gt; <br/>\n&gt; It&#39;s very generous of Ren to leave her former beliefs out there as a  <br/>\n&gt; warning for people, and so they can see how and why she changed, and  <br/>\n&gt; what the results were.   Ren&#39;s great.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/renallen\">http://sandradodd.com/renallen</a><br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181151144","msgId":29127,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1MUE2NDhELTIxMjYtNDlDRi05MkMxLTZDRkQ0QjUyODIwNkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPg==","referencesHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPg=="},"prevInTopic":29126,"nextInTopic":29128,"prevInTime":29126,"nextInTime":29128,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"... Big loss of a LOT of wonderful stuff. ... They re young. But there are some pretty wonderful things that a 4 year old would be likely to get a lot out of. ","messageBody":"<div id=\"ygrps-yiv-1641653031\">On Jun 6, 2007, at 8:49 AM, donannedean wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What about unschooling without a tv?.<br/>\n<br/>\n </span></blockquote>Big loss of a LOT of wonderful stuff.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have 2 daughters ages 4 and<br/>\n&gt; 1.<br/>\n<br/>\n </span></blockquote>They&#39;re young. But there are some pretty wonderful things that a 4  <br/>\nyear old would be likely to get a lot out of.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; TV is very boring to me<br/>\n<br/>\n </span></blockquote>Too broad a generalization (even applied only to oneself). Making  <br/>\nsuch absolute statements is a sign of a lack of conscious decision  <br/>\nmaking. It ignores all the complexities of what constitutes &quot;tv&quot; and  <br/>\nlumps together all of what is shown on tv as if it is all the same -  <br/>\nall boring. If you were at a zoo and happened to be there when lion  <br/>\ncubs were playing? Why would it become boring if it is shown on tv?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and I know I prefer to provide my young<br/>\n&gt; children with a naturel environment.<br/>\n<br/>\n </span></blockquote>They can be provided with a vastly expanded environment through the  <br/>\nmagic of tv. You&#39;re limiting their exposure to only what they can  <br/>\nexperience first-hand in your own area or where you can manage to  <br/>\ntravel.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We just don&#39;t have tv.<br/>\n<br/>\n </span></blockquote>Again, there is that flat absolute quality to what you&#39;ve said - as  <br/>\nif &quot;just&quot; happens that you don&#39;t have tv.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We play<br/>\n&gt; instead<br/>\n<br/>\n </span></blockquote>We play, too, and often our play has been enhanced by things learned  <br/>\nwatching tv.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and sometimes we watch it if we are at someone elses house.<br/>\n<br/>\n </span></blockquote>It has always been annoying to my kids that other children would come  <br/>\nto play, here, and want to watch tv all the time. It is VERY apparent  <br/>\nthat kids who live in tv-restricted homes are much more attracted to  <br/>\nwatching &quot;just anything that is on.&quot; My kids, with unlimited access  <br/>\nto tv, were far more selective and thoughtful about their choices.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I<br/>\n&gt; do choose to limit the stay at grandpas house because he has the tv on<br/>\n&gt; 24/7 and will not budge from it and watches violent shows.<br/>\n<br/>\n </span></blockquote>Do the girls want to watch what he is watching? My kids would not  <br/>\nhave wanted to watch it - but, then, they had tv at home to whatever  <br/>\nextent they wanted, so there was no reason for them to watch stuff  <br/>\nthey didn&#39;t much enjoy, just because it was on at the grandparents.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He had a<br/>\n&gt; stroke and is very brain damaged and is afraid to turn off the tv.<br/>\n<br/>\n </span></blockquote>You could get him a pair of wireless headphones - then only he would  <br/>\nhear the sound and it wouldn&#39;t be so pervasive. Or meet them  <br/>\nsomewhere else, if he goes out.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also<br/>\n&gt; he smokes alot and the house is full of smoke and the kids don&#39;t mind<br/>\n&gt; leaving at all.<br/>\n<br/>\n </span></blockquote>I would not let my kids be in a house where a brain-damaged person  <br/>\nwas smoking. We had a fire in our house a year and a half ago  <br/>\n(started in the clothes dryer) and I wouldn&#39;t risk my kids being in a  <br/>\nplace where there is fire danger. Also, one of mine has asthma - so  <br/>\nwe tried to stay out of smoke-filled spaces, for her sake, as well.  <br/>\nBut, what does that have to do with tv? Mushing these together in  <br/>\nyour head isn&#39;t useful for making conscious decisions.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I play with them when we are there(which they prefer<br/>\n&gt; anyway) so they are not watching about the brutal murder of some  <br/>\n&gt; child.<br/>\n&gt; I don&#39;t consider it prohibiting them from watching tv because they are<br/>\n&gt; not asking to watch it.<br/>\n<br/>\n </span></blockquote>So - why bring it up? Do you think that the long-time unschooling  <br/>\nfamilies on this list who are recommending not restricting tv are, in  <br/>\nfact, recommending that 1 and 4 year old children should be made to  <br/>\nwatch news of brutal child murders? This isn&#39;t clear thinking.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sometimes Avalon wants to watch a movie on the<br/>\n&gt; computer. I have bought her some movies but we just don&#39;t have very<br/>\n&gt; many.<br/>\n<br/>\n </span></blockquote>&quot;Just don&#39;t?&quot; (You choose not to - using the word &quot;just&quot; over and  <br/>\nover makes it sound inevitable or like it &quot;just&quot; happens.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I believe in moving in a direction of a more naturel lifestyle.<br/>\n<br/>\n </span></blockquote>If you want your kids to really appreciate &quot;Mother Earth,&quot; then watch  <br/>\nNational Geographic specials and PBS &quot;Nature&quot; and   Nova and  <br/>\nScientific American Frontiers. You&#39;re missing out on exposure of the  <br/>\ngrandeur and diversity of Mother Earth, otherwise.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It<br/>\n&gt; feels good to me and to Mother Earth.<br/>\n<br/>\n </span></blockquote>Huh?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel like we do not watch tv<br/>\n&gt; not out of fear but out of love.<br/>\n<br/>\n </span></blockquote>Sounds like it is out of limited thinking, to me. It is looking at  <br/>\nthe worst stuff on tv and thinking that is all there is to it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do see how it would be different if<br/>\n&gt; my daughters were asking.<br/>\n<br/>\n </span></blockquote>They<br/>\n<blockquote><span title=\"ireply\"> &gt; We also have organic healthy food to choose from at our house.<br/>\n<br/>\n </span></blockquote>So do we.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It has<br/>\n&gt; always been that way so they love the food we eat and have never asked<br/>\n&gt; for or even know what candy is.<br/>\n<br/>\n </span></blockquote>Not saying kids need candy, I&#39;m pretty sure mine had never had soda,  <br/>\nfor example, when they were your kids&#39; ages, but it seems the  <br/>\nenvironment would have to be pretty darn restricted to prevent a 4 yo  <br/>\nfrom even knowing what candy is. No playing at other people&#39;s houses?  <br/>\nNo homeschool park days? No pinatas? No reading books in which kids  <br/>\nhave candy?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Soon enough they will be exposed and<br/>\n&gt; see other kids eating it.<br/>\n<br/>\n </span></blockquote>And adults.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have had a lot of my own issues to deal<br/>\n&gt; with around food. I had terrible dairy allergies as a child. I have<br/>\n&gt; avoided some gatherings because of the massive junk food, but never<br/>\n&gt; gatherings my daughter was asking to go to.<br/>\n<br/>\n </span></blockquote>Waiting for kids to ask for things is not a useful unschooling  <br/>\npolicy, in general. It is an unschooling parent&#39;s role to offer and  <br/>\nextend and expand a child&#39;s experience, not to restrict it and hope  <br/>\nthe child won&#39;t ask for as long as possible. Again, I&#39;m not saying  <br/>\nyou have to give your kids candy, just saying that there is an  <br/>\nattitude of restriction that comes across clearly in your post as  <br/>\nbeing out of fear, in spite of your disclaimer.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Do you disagree with unschoolers providing a healthy environment for<br/>\n&gt; there kids ( always researching if you are doing it out of fear or if<br/>\n&gt; it is really a healthy environment) and then allowing them free rein<br/>\n&gt; with in that?<br/>\n<br/>\n </span></blockquote>I think I provided an extraordinary environment for my kids (now 16,  <br/>\n19, and 22). Mine had no tv restrictions and no specific food  <br/>\nrestrictions. We &quot;protected&quot; them in a different way than you are  <br/>\ntalking about, though. We didn&#39;t watch violent gruesome tv or movies  <br/>\nwhen they were around. We watched stuff we thought they&#39;d enjoy, too.  <br/>\nWe watched a LOT of nature shows, because they liked them and so did  <br/>\nwe. We watched Sesame Street and Mr. Rogers and I cannot for the life  <br/>\nof me imagine preventing children from watching Reading Rainbow - my  <br/>\nkids absolutely loved it. They made their own versions - used our  <br/>\nvideo recorder and did book reviews like Reading Rainbow has.<br/>\n<br/>\nThese days - my oldest daughter just called - she&#39;s in Alaska and  <br/>\nwill be working as a back-country ranger in the wilds of the Alaskan  <br/>\nwilderness. Nobody could &quot;love Mother Earth&quot; more. I don&#39;t see that  <br/>\ntv-watching did anything but enhance that love.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am talking about younger children who are just learning<br/>\n&gt; about the world.<br/>\n<br/>\n </span></blockquote>Not learning as much about the world as they could if they were  <br/>\nseeing more of it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I learned about unschooling from Naomi Aldort. I am so greatfull.  <br/>\n&gt; And I<br/>\n&gt; am always working on being less controlling. I am a very lenient mom<br/>\n&gt; and I find myself really having to get creative to allow my kids<br/>\n&gt; outlets for whatever it is I won&#39;t allow them to do because of safety<br/>\n&gt; or major property damage.<br/>\n<br/>\n&gt; I guess I do have fear around my children watching violent tv at a<br/>\n&gt; young age.<br/>\n<br/>\n </span></blockquote>So - can you not envision that they might not want to watch violent  <br/>\ntv? Why would they want to watch it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And my question is: Is there not a ballance where you could<br/>\n&gt; listen to your inner vision about whether an environment is safe for<br/>\n&gt; your children or not?<br/>\n<br/>\n </span></blockquote>Too much black or white thinking. It isn&#39;t a choice of &quot;gruesome/ <br/>\nviolent tv&quot; versus &quot;no tv.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You can always ask them ,which I do quite often,<br/>\n&gt; but there are some environments I cannot explain to them. Is it all my<br/>\n&gt; stuff? What about mothering instincts. Wouldn&#39;t you want to protect<br/>\n&gt; your young child from say an environment such as Gandpa&#39;s house?<br/>\n<br/>\n </span></blockquote>Your thinking will be more clear if you don&#39;t mentally mix up tv- <br/>\nwatching at home with what goes on at grandpa&#39;s house and with eating  <br/>\ncandy and so on. Too many different situations all being considered  <br/>\nas one and the same - think realistically about your own house. Would  <br/>\n&quot;you&quot; be watching violent shows when your kids were around? You&#39;d be  <br/>\ncuddled up together watching something sweet and wonderful, I&#39;m sure!<br/>\n<br/>\nAre you also saying, &quot;We just have no music at our house,&quot; because  <br/>\nsomebody else listens to music with violent lyrics?<br/>\n<br/>\n&quot;We just have no magazines here,&quot; because there are porn magazines?<br/>\n<br/>\n&quot;We just have no books,&quot; because there are graphically violent books  <br/>\nin the world?&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; -=-What do you guys do when you meet unschoolers who don&#39;t let their<br/>\n&gt;&gt; kids<br/>\n&gt;&gt; watch TV? It&#39;s hard for me to be around people like this. People  <br/>\n&gt;&gt; being<br/>\n&gt;&gt; driven into controlling things out of fear, but I am around these<br/>\n&gt; types<br/>\n&gt;&gt; of people alot. I&#39;m wondering how you guys handle this?-=-<br/>\n&gt;&gt;<br/>\n&gt;&gt; We planned non-TV things when their kids were over, or went to the<br/>\n&gt; park.<br/>\n&gt;&gt; Overall, though, if they&#39;ll prohibit TV, they&#39;re prohibiting other<br/>\n&gt;&gt; things, and the parents&#39; fears kept them from trusting a family like<br/>\n&gt;&gt; ours, so it was never a problem for very long.  :-/<br/>\n&gt;&gt;<br/>\n&gt;&gt; Sandra<br/>\n&gt;&gt;<br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181148560","msgId":29126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlGNjZFRjY0LUQ2NTgtNDAyQy05MEZELTkyNjYzRDE2NENEOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEQ4REQwRkQwLUREQTUtNDM2My1CRDk5LTdCOTM0OTQ1Mzc0MkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPiA8RDhERDBGRDAtRERBNS00MzYzLUJEOTktN0I5MzQ5NDUzNzQyQHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":29125,"nextInTopic":29127,"prevInTime":29125,"nextInTime":29127,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"-=-You have a computer. How natural is that?-=- I want to answer my own question.  In the year 2007, in the modern English speaking world, having a computer","messageBody":"<div id=\"ygrps-yiv-156955138\">-=-You have a computer. How natural is that?-=-<br/>\n<br/>\nI want to answer my own question. &lt;g&gt;<br/>\n<br/>\nIn the year 2007, in the modern English speaking world, having a  <br/>\ncomputer is as natural as having a horse was 150 years ago.<br/>\nIt&#39;s as natural as having a TV, in our culture, these days.  It&#39;s as  <br/>\nnatural as listening to recorded music.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Unschooling and TV","postDate":"1181147123","msgId":29125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4REQwRkQwLUREQTUtNDM2My1CRDk5LTdCOTM0OTQ1Mzc0MkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPg==","referencesHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPg=="},"prevInTopic":29124,"nextInTopic":29126,"prevInTime":29124,"nextInTime":29126,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"These questions aren t asked to be critical, but to dissect statements and arguments, and to respond to questions asked. -=-What about unschooling without a","messageBody":"<div id=\"ygrps-yiv-2021700703\">These questions aren&#39;t asked to be critical, but to dissect  <br/>\nstatements and arguments, and to respond to questions asked.<br/>\n<br/>\n-=-What about unschooling without a tv?-=-<br/>\n<br/>\nWhat about unschooling without books or without puzzles?<br/>\n<br/>\n-=- I have 2 daughters ages 4 and 1.<br/>\nTV is very boring to me...-=-<br/>\n<br/>\nAre those statements related?  Part of what created a good  <br/>\nrelationship between me and my kids was finding things we both liked  <br/>\nto do together, not my keeping them away from things I found boring.   <br/>\nTwo things I never managed to appreciate:  playing Barbies and  <br/>\nwatching Pokemon.  Other than that, I did pretty well at being with  <br/>\nmy kids, not just physically, but mentally and emotionally, exploring  <br/>\nwith them what caught their interest, and learning about why they  <br/>\nliked it.<br/>\n<br/>\n  -=-...and I know I prefer to provide my young children with a  <br/>\nnaturel environment-=-<br/>\n<br/>\nYour children aren&#39;t school-age yet, so in one way they&#39;re not  <br/>\nunschooling kids.  You could still opt for school.<br/>\nThe only reason I say that is that there are lots of things they&#39;ll  <br/>\nwant to know or need to know that they can&#39;t learn in a &quot;natural  <br/>\nenvironment.&quot;  You have a computer.  How natural is that?<br/>\n<br/>\n-=-I believe in moving in a direction of a more naturel lifestyle. It<br/>\nfeels good to me and to Mother Earth.-=-<br/>\n<br/>\nIt&#39;s common here for people to be requested not to speak for all moms  <br/>\nor all unschoolers.  Maybe you shouldn&#39;t speak for Mother Earth   But  <br/>\nin any case, at some point your daughters will be 14 and 11 and  <br/>\nsometime before then it might be good to transition to what they want  <br/>\nto do and what isn&#39;t boring to them instead of ganging up on them  <br/>\nwith Mother Earth.<br/>\n<br/>\n-=-I have had a lot of my own issues to deal with around food.-=-<br/>\n<br/>\nIssues seem more often to come from limitations and rules and lack of  <br/>\nchoices than from open communication and options.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/food\">http://sandradodd.com/food</a><br/>\n<br/>\n-=-<br/>\nDo you disagree with unschoolers providing a healthy environment for<br/>\nthere kids ( always researching if you are doing it out of fear or if<br/>\nit is really a healthy environment)-=-<br/>\n<br/>\nNot at all, but where will you research whether you&#39;re doing  <br/>\nsomething out of fear?  Or personal preference?  Or boredom?  Or  <br/>\nsuperstition?<br/>\n<br/>\nIf you look at the principles behind unschooling and natural  <br/>\nlearning, it might make less sense then to you to limit your  <br/>\nchildren&#39;s world.  If you read about families whose unschooling has  <br/>\nreally taken off and lasted, I don&#39;t think you&#39;ll find many who are  <br/>\nfearful.<br/>\n<br/>\n-=-there are some environments I cannot explain to them. Is it all my  <br/>\nstuff? -=-<br/>\n<br/>\nI&#39;ve never taken my kids to the bowling alley when I hear shouting  <br/>\nthat sounds like a fight in the parking lot, though it&#39;s just a  <br/>\nhundred yards from our back gate.   We don&#39;t watch the news.  Every  <br/>\nTV comes with a channel changing apparatus and an on-off switch (or  <br/>\nif not, can be unplugged when violent news stories come).<br/>\n<br/>\nThere are accounts of violence in books and magazines.  Will you  <br/>\nprohibit all those?  There are books at the library with photos of  <br/>\nmutilations and murders.  Will you not go to the library?<br/>\n<br/>\n-=-What about mothering instincts. Wouldn&#39;t you want to protect<br/>\nyour young child from say an environment such as Gandpa&#39;s house?-=--<br/>\n<br/>\nMy kids don&#39;t have the grandpa yours do.  That&#39;s such a slanted  <br/>\nquestion it doesn&#39;t really belong with the rest of the post, I think.<br/>\n<br/>\nAt any point when you&#39;re making a decision to say yes or no to a  <br/>\nchild, if you&#39;re considering what will help the child understand the  <br/>\nworld better, or what will be more pleasant or intriguing or  <br/>\npeaceful, then that would be cool.<br/>\n<br/>\nMaybe watching  Teletubbies or BoohBah would be more peaceful for a  <br/>\nyoung child than hearing an adult complain about grandpa.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":55930256,"authorName":"donannedean","from":"&quot;donannedean&quot; &lt;ibex@...&gt;","profile":"donannedean","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Unschooling and TV","postDate":"1181144958","msgId":29124,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0NmwxdSs1YmM3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEVGQ0UzNkNBLTNDQkMtNDEwQS1BRDQzLTVBNURFRjRCMEIyMEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":29123,"nextInTopic":29125,"prevInTime":29123,"nextInTime":29125,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"What about unschooling without a tv?. I have 2 daughters ages 4 and 1.TV is very boring to me and I know I prefer to provide my young children with a naturel","messageBody":"<div id=\"ygrps-yiv-48067314\">What about unschooling without a tv?. I have 2 daughters ages 4 and <br/>\n1.TV is very boring to me and I know I prefer to provide my young <br/>\nchildren with a naturel environment. We just don&#39;t have tv. We play <br/>\ninstead and sometimes we watch it if we are at someone elses house. I <br/>\ndo choose to limit the stay at grandpas house because he has the tv on <br/>\n24/7 and will not budge from it and watches violent shows.He had a <br/>\nstroke and is very brain damaged and is afraid to turn off the tv. Also <br/>\nhe smokes alot and the house is full of smoke and the kids don&#39;t mind <br/>\nleaving at all. I play with them when we are there(which they prefer <br/>\nanyway) so they are not watching about the brutal murder of some child. <br/>\nI don&#39;t consider it prohibiting them from watching tv because they are <br/>\nnot asking to watch it. Sometimes Avalon wants to watch a movie on the <br/>\ncomputer. I have bought her some movies but we just don&#39;t have very <br/>\nmany. <br/>\nI believe in moving in a direction of a more naturel lifestyle. It <br/>\nfeels good to me and to Mother Earth. I feel like we do not watch tv <br/>\nnot out of fear but out of love. I do see how it would be different if <br/>\nmy daughters were asking. <br/>\nWe also have organic healthy food to choose from at our house. It has <br/>\nalways been that way so they love the food we eat and have never asked <br/>\nfor or even know what candy is. Soon enough they will be exposed and <br/>\nsee other kids eating it. I have had a lot of my own issues to deal <br/>\nwith around food. I had terrible dairy allergies as a child. I have <br/>\navoided some gatherings because of the massive junk food, but never <br/>\ngatherings my daughter was asking to go to.<br/>\n<br/>\nDo you disagree with unschoolers providing a healthy environment for <br/>\nthere kids ( always researching if you are doing it out of fear or if <br/>\nit is really a healthy environment) and then allowing them free rein <br/>\nwith in that? I am talking about younger children who are just learning <br/>\nabout the world. <br/>\nI learned about unschooling from Naomi Aldort. I am so greatfull. And I <br/>\nam always working on being less controlling. I am a very lenient mom <br/>\nand I find myself really having to get creative to allow my kids <br/>\noutlets for whatever it is I won&#39;t allow them to do because of safety <br/>\nor major property damage. <br/>\nI guess I do have fear around my children watching violent tv at a <br/>\nyoung age. And my question is: Is there not a ballance where you could <br/>\nlisten to your inner vision about whether an environment is safe for <br/>\nyour children or not? You can always ask them ,which I do quite often, <br/>\nbut there are some environments I cannot explain to them. Is it all my <br/>\nstuff? What about mothering instincts. Wouldn&#39;t you want to protect <br/>\nyour young child from say an environment such as Gandpa&#39;s house?<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-What do you guys do when you meet unschoolers who don&#39;t let their  <br/>\n&gt; kids<br/>\n&gt; watch TV? It&#39;s hard for me to be around people like this. People being<br/>\n&gt; driven into controlling things out of fear, but I am around these <br/>\ntypes<br/>\n&gt; of people alot. I&#39;m wondering how you guys handle this?-=-<br/>\n&gt; <br/>\n&gt; We planned non-TV things when their kids were over, or went to the <br/>\npark.<br/>\n&gt; Overall, though, if they&#39;ll prohibit TV, they&#39;re prohibiting other  <br/>\n&gt; things, and the parents&#39; fears kept them from trusting a family like  <br/>\n&gt; ours, so it was never a problem for very long.  :-/<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling and TV","postDate":"1181142305","msgId":29123,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUzRDhFMTE3LUVBQzUtNDVCOC04MjUxLUJEQjJEODExNkY5OUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDkxNDk1LjI2NzcwLnFtQHdlYjMxOTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PDkxNDk1LjI2NzcwLnFtQHdlYjMxOTAxLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":29122,"nextInTopic":29124,"prevInTime":29122,"nextInTime":29124,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"-=- By ren on Monday, August 6, 2001 - 03:15 am: I m probably one of the only other people here that do believe it s ok to limit TV when necessary.-=- It s","messageBody":"<div id=\"ygrps-yiv-1658518445\">-=-&gt;&gt;&gt;&gt;By ren on Monday, August 6, 2001 - 03:15 am:<br/>\nI&#39;m probably one of the only other people here that do believe it&#39;s  <br/>\nok to limit TV when necessary.-=-<br/>\n<br/>\nIt&#39;s very generous of Ren to leave her former beliefs out there as a  <br/>\nwarning for people, and so they can see how and why she changed, and  <br/>\nwhat the results were.   Ren&#39;s great.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/renallen\">http://sandradodd.com/renallen</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling and TV","postDate":"1181141780","msgId":29122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxNDk1LjI2NzcwLnFtQHdlYjMxOTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGY0NmRkYytlMzZiQGVHcm91cHMuY29tPg=="},"prevInTopic":29121,"nextInTopic":29123,"prevInTime":29121,"nextInTime":29123,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"It s hard for me to be around people like this. People being driven into controlling things out of fear, but I am around these types of people alot. I m","messageBody":"<div id=\"ygrps-yiv-1754901193\">It&#39;s hard for me to be around people like this. People being <br/>\ndriven into controlling things out of fear, but I am around these types <br/>\nof people alot. I&#39;m wondering how you guys handle this?&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n   <br/>\n  It isnt really an answer on how to handle it but I was just having breakfast and reading this before I came to check my e-mail ......<br/>\n   <br/>\n   <br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;&gt;By ren on Monday, August 6, 2001 - 03:15 am: <br/>\n </span></blockquote>  I&#39;m probably one of the only other people here that do believe it&#39;s ok to limit TV when necessary. I find my one son getting very lazy and not interested in other activities for DAYS on end if I don&#39;t say anything. If I say &quot;ok, enough TV for today&quot; and suggest that we do something, he is usually glad for it. If he&#39;s in the middle of something he really wants to watch I just say &quot;ok, when that&#39;s over do you think we could go do something?&quot; and he always is fine with that. I have relaxed a lot over the whole issue but I think there are some kids that are more addictive and affected by it than others. I just disagree with total self regulation on that topic....sorry. I do believe it is best to be relaxed over it and I&#39;m glad that self-regulation works for all of you. Ren changed her mind about this later.read about her change of heart &gt;&gt;&gt;&gt;&gt;<br/>\n   <br/>\n   <br/>\n  and then this ...<br/>\n   <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/sharing\">http://sandradodd.com/t/sharing</a><br/>\n<br/>\n <br/>\n---------------------------------<br/>\nWe won&#39;t tell. Get more on shows you hate to love<br/>\n(and love to hate): Yahoo! TV&#39;s Guilty Pleasures list.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Unschooling and TV","postDate":"1181138149","msgId":29121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGQ0UzNkNBLTNDQkMtNDEwQS1BRDQzLTVBNURFRjRCMEIyMEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGY0NmRkYytlMzZiQGVHcm91cHMuY29tPg==","referencesHeader":"PGY0NmRkYytlMzZiQGVHcm91cHMuY29tPg=="},"prevInTopic":29120,"nextInTopic":29122,"prevInTime":29120,"nextInTime":29122,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"-=-What do you guys do when you meet unschoolers who don t let their kids watch TV? It s hard for me to be around people like this. People being driven into","messageBody":"<div id=\"ygrps-yiv-321858014\">-=-What do you guys do when you meet unschoolers who don&#39;t let their  <br/>\nkids<br/>\nwatch TV? It&#39;s hard for me to be around people like this. People being<br/>\ndriven into controlling things out of fear, but I am around these types<br/>\nof people alot. I&#39;m wondering how you guys handle this?-=-<br/>\n<br/>\nWe planned non-TV things when their kids were over, or went to the park.<br/>\nOverall, though, if they&#39;ll prohibit TV, they&#39;re prohibiting other  <br/>\nthings, and the parents&#39; fears kept them from trusting a family like  <br/>\nours, so it was never a problem for very long.  :-/<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":312468553,"authorName":"bigmamma.bigmamma","from":"&quot;bigmamma.bigmamma&quot; &lt;bigmamma.bigmamma@...&gt;","profile":"bigmamma.bigmamma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Unschooling and TV","postDate":"1181137132","msgId":29120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0NmRkYytlMzZiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":29121,"prevInTime":29119,"nextInTime":29121,"topicId":29120,"numMessagesInTopic":0,"msgSnippet":"Hi, What do you guys do when you meet unschoolers who don t let their kids watch TV? It s hard for me to be around people like this. People being driven into","messageBody":"<div id=\"ygrps-yiv-1150184989\">Hi,<br/>\n<br/>\nWhat do you guys do when you meet unschoolers who don&#39;t let their kids <br/>\nwatch TV? It&#39;s hard for me to be around people like this. People being <br/>\ndriven into controlling things out of fear, but I am around these types <br/>\nof people alot. I&#39;m wondering how you guys handle this? thanks, <br/>\nLyn</div>","specialLinks":[]}],"prevTopicId":29235,"nextTopicId":29242}}