{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: chores/routines","postDate":"1009924548","msgId":30562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWEwMWMxOTMxNCRhOWU4N2Y2MCQwMjAxYThjMEBkZXNrdG9wPg==","referencesHeader":"PDIwMDIwMTAxMTQzMS5nMDFFVkNZaTAyNzQ4M0BueWNzbXRwMm91dC5yZGMtbnljLnJyLmNvbT4="},"prevInTopic":30516,"nextInTopic":0,"prevInTime":30561,"nextInTime":30563,"topicId":30516,"numMessagesInTopic":0,"msgSnippet":"... Well Kolleen maybe your guy was just looking for someone like his mother that would do everything for him.  I guess you weren t looking for someone to","messageBody":"<div id=\"ygrps-yiv-443952567\">Kolleen wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Nobody was given chores around the house when they were young (sisters <br/>\n&gt;included) because the mother did everything and grandmother too when she <br/>\n&gt;was able.. mostly she was there to watch the kids.<br/>\n<br/>\n </span></blockquote>Well Kolleen maybe your guy was just looking for someone like his mother that would do everything for him.  I guess you weren&#39;t looking for someone to mother :-).  When my husband and I were first married, we both worked full time yet I made his breakfast, packed his lunch, made lots of homecooked dinners and just was this super woman, I guess I did this because I liked nurturing and he liked being nurtured.  When the kids were born I had enough to nurture so he was put into a different role.  He has slowly adjusted and come a long way in being an equal partner but it has been difficult.  I still put out the garbage, cut the lawn and do all the day to day jobs around the house.  It works out better for us if I make suggestions for a to-do list of household maintenance chores.  He is very handy - just doesn&#39;t like regular mundane stuff.  I often wonder if his mother had not done as much for him if things would have been different.  What can we learn from this for our own children?  I do agree with what most were saying about people&#39;s nature but to me it just means that certain life skills do not come easily to some.  It doesn&#39;t mean they don&#39;t ever have to learn to do them.  Some people are not organized but most people still need to learn some organizational skills to accomplish the things they want to accomplish.<br/>\n<br/>\nPat<br/>\n<br/>\n<br/>\n      Yahoo! Groups Sponsor <br/>\n            ADVERTISEMENT<br/>\n           <br/>\n     <br/>\n     <br/>\n<br/>\nMessage boards, timely articles, a free newsletter and more!<br/>\nCheck it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nTo unsubscribe, set preferences, or read archives:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a><br/>\n<br/>\nAnother great list sponsored by Home Education Magazine!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a> <br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":85994576,"authorName":"Kolleen","from":"Kolleen &lt;Kolleen@...&gt;","profile":"kaydeecross","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: chores/routines","postDate":"1009895489","msgId":30516,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTAxMTQzMS5nMDFFVkNZaTAyNzQ4M0BueWNzbXRwMm91dC5yZGMtbnljLnJyLmNvbT4="},"prevInTopic":0,"nextInTopic":30562,"prevInTime":30515,"nextInTime":30517,"topicId":30516,"numMessagesInTopic":0,"msgSnippet":"... You know, if the entire modeling was via culture, then I would tend to agree here. The differences I see is that the two sisters were only responsible for ","messageBody":"<div id=\"ygrps-yiv-473191686\"><blockquote><span title=\"ireply\">&gt;&gt;Kolleen wrote:<br/>\n&gt;&gt;I can&#39;t help but wonder... his mother and grandmother were clean<br/>\n&gt;&gt; freaks... so he was getting the modeling there... BUT what happened? &gt;&gt;<br/>\n&gt;<br/>\n&gt;Andrea Kim wrote:<br/>\n&gt;What happened is that he was taught that WOMEN cleaned<br/>\n&gt;up these messes, not men.  My husband (Korean) was brought<br/>\n&gt;up the very same way as your husband. <br/>\n<br/>\n&gt;Mimi wrote:<br/>\n&gt;You mentioned this man was brought up in Albanian household.  Don&#39;t you <br/>\n&gt;think that their CULTURE and his parents&#39; expectations of him played a <br/>\n&gt;part in his sloppiness? <br/>\n<br/>\n<br/>\n </span></blockquote>You know, if the entire modeling was via culture, then I would tend to <br/>\nagree here.<br/>\n<br/>\nThe differences I see is that the two sisters were only responsible for <br/>\nthe cleanliness of their room as he was also.<br/>\n<br/>\nSister #1 married a darling Croatian man (8 years her younger - he 21 her <br/>\n29) and they worked together to keep the house clean. He *does* things <br/>\naround the house and genuinely wants a nice home.<br/>\n<br/>\nSister #2 is pushing 30 and is a career woman (pharmacist) and is revered <br/>\nby the dad for <br/>\n*likeing* money so much. No need or push for her to settle down and be <br/>\n*controlled*.<br/>\n<br/>\nMy guy *hates* anything that is considered manly duties, like garbage, <br/>\nrecycling, fixing things. He is incapable of fixing things, most of the <br/>\ntime I do the fixing.<br/>\n<br/>\nHe also was home with the kid in the beginning while I worked. Even <br/>\nduring pregnacy he was home a lot putzing around the kitchen cooking <br/>\nwhile I worked right up until 3 days before birthing.<br/>\n<br/>\nI used to come home for lunch to nurse and go back to work.<br/>\n<br/>\nHe also likes to cook - and is so damn messy at it, that I dont&#39; find the <br/>\n*nice* meal worth it. He can&#39;t understand why. I guess we both have our <br/>\nissues as to what role food should play in one&#39;s life.<br/>\n<br/>\nIf he were true to his culture, then me being the breadwinner would of <br/>\nbeen an issue.<br/>\n<br/>\nNobody was given chores around the house when they were young (sisters <br/>\nincluded) because the mother did everything and grandmother too when she <br/>\nwas able.. mostly she was there to watch the kids.<br/>\n<br/>\nAs the sisters got older, they would help around the house because the <br/>\nmother was working (as a cleaning woman) and they didn&#39;t like SEEING <br/>\ntheir own mess.<br/>\n<br/>\nAs far as my son goes.. technically he would *see* his father cooking and <br/>\nwashing dishes as a toddler.. because I was working.. so there was <br/>\nmodeling (and toddlers don&#39;t see half-ass attempts at cleaning - they <br/>\njust see the attempt).<br/>\n<br/>\nI truly think this is beyond culture.. like a *messy gene* or something.. <br/>\nbecause *he* doesn&#39;t mind if the house is filthy or not.. he doesn&#39;t mind <br/>\nif I clean or not.. and he cannot relate as to how a messy house throws <br/>\nmy entire emotional grid offline..<br/>\n<br/>\nHis mother is another story - she used to tell people that she couldn&#39;t <br/>\nunderstand how I kept the house so messy - neglecting to tell them that I <br/>\nwas working and her son wasn&#39;t.<br/>\n<br/>\nAlthough, I&#39;m still semi-tempted to ask the mother if he had chores when <br/>\nyoung - but I don&#39;t know if I wanted to be jumped on for started troubled <br/>\nagain *smirk*.<br/>\n<br/>\nregards,<br/>\nkolleen<br/>\n<br/>\nps. mimi, I am very familiar with the Greek culture. I dated one for 5 <br/>\nyears way back when and I worked in the restaurant business for 18 years.</div>","specialLinks":[]}],"prevTopicId":30325,"nextTopicId":30559}}