{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":59432230,"authorName":"joanna514","from":"&quot;joanna514&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"postDate":"1011546535","msgId":2829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEyZXRqNys2bGJmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":2828,"nextInTime":2830,"topicId":2829,"numMessagesInTopic":0,"msgSnippet":"I m wondering if I took the right approach on an issue with my SIL and niece, so I thought I d throw it out to you all, and get opinions. My niece goes to PS","messageBody":"<div id=\"ygrps-yiv-722865673\">I&#39;m wondering if I took the right approach on an issue with my SIL <br/>\nand niece, so I thought I&#39;d throw it out to you all, and get opinions.<br/>\nMy niece goes to PS and my SIL teaches 4th grade.  My SIL and I <br/>\nstarted out with the same parenting beliefs (fam bed, BF...) in fact, <br/>\nshe influenced me a lot.  Ordered me Mothering, told me about LLL. <br/>\nAnyway, over the years, we have gone in different directions, but <br/>\nhave remained good friends, though our busy separate lives, keep us <br/>\nfrom seeing each other very much.  <br/>\nTheir family dynamics are pretty different from ours. My niece is in <br/>\n7th grade and is going through all that stuff(crap) that goes on <br/>\nsocially for kids in school.  She has been dealing with lots of <br/>\nschool/social stuff for years, but they think it&#39;s all normal, and <br/>\nnecessary for a healthy upbringing..yada,yada...  My niece just made <br/>\nthe honor role.  She excels academically. <br/>\nI have a good relationship with my niece.  I like her a lot, and we <br/>\nget along well.  We talk a lot, and joke around a lot.  She comes <br/>\nover just to hang out and play with my little ones.  But we&#39;ve had <br/>\none issue that keeps coming between us.  My mother!  My mom and I <br/>\nhave gotten really close over the past 5 years or so.  She stopped <br/>\nworking, I started homeschooling and we have been able to get <br/>\ntogether quite a bit because of this.  My mom lives in FL(I live in <br/>\nMD), so I visit every winter, sometimes twice(this year, it looks <br/>\nlike 3 times.  She comes up and spends the summer in our resort town <br/>\nin her own apt. and we spend most days at the beach with her.  My <br/>\nchildren adore her, and so do I really.  My niece has a lot of <br/>\nproblems with all the time we get to spend with her, and she doesn&#39;t.<br/>\nShe has made it clear over the years that we have infringed on her <br/>\nprivate Grandmom time.  We&#39;ll come to the beach one day, and she&#39;ll <br/>\nroll her eyes at the fact that we are there.  She complains loudly <br/>\nabout the fact that we always get to go to FL and visit.  My mom <br/>\ntries to make special times with just her, but has come to feel that <br/>\nmy niece can be a little obnoxious about the way she expresses her <br/>\nrights to have her to herself, orto  have equal time.  So every time <br/>\nmy kids get to see her,  my mother is suppose to make sure my niece <br/>\ngets as many times spent with her too.<br/>\nI can understand this, coming from the mind of a 12 year old, but my <br/>\nSIL seems to encourage this behavior.  She makes comments to me about <br/>\nmy nieces feelings, and how much time we get to spend with my mom.  <br/>\nShe seems to be implying I should purposely spend less time with my <br/>\nmom to make it fair for her daughter.  <br/>\nMy first thoughts to these incedents are, &quot;tough!&quot;.  We chose to have <br/>\na free lifestyle,  my mother encourages us to come, and invites us to <br/>\ndo things, and loves being with my kids, and has always made that <br/>\nclear, why should I change anything!?<br/>\nBoy this is getting long.  <br/>\nWell the latest is, my mom suggested we come for Easter this year.  <br/>\nMy 11yo dd said she wanted to have Easter at our house, so we said we <br/>\nwould come a different time.  Then we found out my dh was going to be <br/>\naway for Easter, and my dd siad that going to FL would be better than <br/>\nbeing here without dad.  My mother was here for a funeral, and I had <br/>\ntaken my dd and my niece to the funeral 1 1/2 hrs away and met my <br/>\nmother there.  The girls drove back with her, and my niece made plans <br/>\nto come to FL over Easter for her spring break.  She wanted my dd to <br/>\ncome too, but my dd didn&#39;t want to.  So a few days after this, we <br/>\ndeide that going for Easter would be fun, and I didn&#39;t realize my<br/>\n niece was planning on going(niether did my mother, because they had <br/>\nhad the one conversation, and she hadn&#39;t heard from her or my SIL <br/>\nagain about it.  So when I called to say, that we changed our minds <br/>\nand would be coming, she was very happy.  Then last night my SIL <br/>\ncalled and when I told her we were going for Easter, she told my <br/>\nniece, and my niece stormed off into her room, apparently devistated <br/>\nby the fact that we all would bbe there too, and that would RUIN her <br/>\ntime.<br/>\nMy SIL was telling me all of this, and I didn&#39;t know what to say.  I <br/>\nwas kind of ticked and thought she was being rude to imply that maybe <br/>\nwe should change our plans now.  I have 4 kids and we had already <br/>\ndiscussed that we would be going for Easter.  My 11yo was infuriated <br/>\nthat my niece would act like this(once again) and she was saying that <br/>\nif we changed our plans for someone who was being rude and selfish, <br/>\nthat SHE would have a fit to.  Well, she did.  We spent the entire <br/>\nevening discussing it, and I decided I would have no fun being there, <br/>\nknowing my niece wouldn&#39;t want us there.  My niece called and talked <br/>\nto my dd, and said she wasn&#39;t going to go at Easter and would pick <br/>\nanother time to go (my dd thought she was being a big baby, but I <br/>\nthought she actually made a good decision, probably with the help of <br/>\nher mother)I decided that since we are the ones that have the <br/>\nfreedom, that we could choose another time to go, since it was so <br/>\nimportant to her, to not have all of us there.  My dd reluctantly <br/>\nagreed, with the promise of us getting to go twice(once when my <br/>\nparents wouldn&#39;t be there and we would house sit, then again, after <br/>\nEaster.  My niece immediately felt bad, that we changed our plans for <br/>\nher.  I think my SIL did too.  She told me that my niece said &quot;now I <br/>\ndon&#39;t want to go at all! and started to cry.<br/>\nThey called this morning with new plans and we are still working out <br/>\nthe details.  Though we&#39;re still not going for Easter.<br/>\nI was a little hurt by my niece, and angry at my SIL handling of her <br/>\ndaughters attitude about it all, but I bit the bullet and put on a <br/>\nhappy face and said it was all fine.  And really it mostly is.  I <br/>\nfeel better.  The behavoir and attitude is theirs to deal with now, <br/>\nand it will all work out fine.<br/>\nI just have a nagging feeling, I have just justified my nieces <br/>\nbehavior, and I still feel hurt at the fact that she can so easily <br/>\nlet us know how much she doesn&#39;t want us around at times.<br/>\nI can see how having 4 kids around ages 2 to 11 can very much change <br/>\nthe dynamics of any environment, but I still think it&#39;s rude to <br/>\nexpress those feelings.  <br/>\nAnyway, it&#39;s pretty much over now, and I am doing my best to not have <br/>\nany hard feelings about it all.  They are still very important to me, <br/>\nand I guess that is why it hurts a little.  <br/>\nIt always makes me feel better to type it all out.  I usually end up <br/>\ndeleting what I write, because I figure out my feelings by the end, <br/>\nbut I&#39;m still going to send this one.<br/>\nJoanna</div>","specialLinks":[]}],"prevTopicId":2637,"nextTopicId":2819}}