{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":8226888,"authorName":"the_clevengers &lt;diamondair@email.msn.com&gt;","from":"&quot;the_clevengers &lt;diamondair@...&gt;&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What do you say to nay-sayers?","postDate":"1042141936","msgId":54109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGF2a2p0Zyt2bnRlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGF2aWFkZys0bW5oQGVHcm91cHMuY29tPg=="},"prevInTopic":54086,"nextInTopic":0,"prevInTime":54108,"nextInTime":54110,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"... I guess I would say that I m sure there are dysfunctional families in all walks of life. I certainly knew more than a few when I was in school. I m sure","messageBody":"<div id=\"ygrps-yiv-674573724\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, &quot;Julie Bogart <br/>\n&lt;julie@b...&gt;&quot; &lt;julie@b...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you deal with these broad stereotypes about unschooling? <br/>\n&gt; What do you say to them?<br/>\n<br/>\n </span></blockquote>I guess I would say that I&#39;m sure there are dysfunctional families in <br/>\nall walks of life. I certainly knew more than a few when I was in <br/>\nschool. I&#39;m sure homeschoolers aren&#39;t immune. But I don&#39;t personally <br/>\nknow any unschooling families like that. The unschoolers I know run <br/>\nthe gamut from cluttered to neat-as-a-pin houses, and immaculately <br/>\ndressed to whatever-works, but none of them are hazardously messy or <br/>\nneglectful.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, there is a fairly popular philosophy that kids do better when <br/>\n&gt; pushed to perform (think of the strict teacher or the intense <br/>\n&gt; football coach, or the passionate and demanding theater <br/>\n&gt; director). <br/>\n<br/>\n </span></blockquote>I think that can be really great, if that&#39;s what the person (meaning <br/>\nthe child, not the parent) is looking for. I had a great swimming <br/>\ncoach like that in college. He was one of the most influential people <br/>\nin my life. But I was looking for, and ready for, the lessons he was <br/>\nimparting. At another time in my life, I suspect I would&#39;ve just <br/>\nregarded him as a major PITA. *Especially* if I was being forced to <br/>\nwork with him, instead of choosing to.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Have you found that your kids generate enough <br/>\n&gt; self-motivation to achieve their goals? <br/>\n<br/>\n </span></blockquote>Definitely. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you urge completion of <br/>\n&gt; projects? <br/>\n<br/>\n </span></blockquote>No. Some projects around here get completed immediately. Some get <br/>\nabandoned. Some get shelved and finished later. Since my kids are <br/>\nyoung, I&#39;ll sometimes remind them of things that they&#39;ve shelved, <br/>\njust in case they&#39;ve forgotten. Sometimes they&#39;re eager to work on it <br/>\nagain, sometimes they could care less. I&#39;ve found that sometimes they <br/>\ndo things I completely wouldn&#39;t expect. Like my son (who loves math <br/>\nworksheets and has begged me to buy them for him) will actually take <br/>\nthem out later when he&#39;s learned more math, and self-correct them. <br/>\nSince he&#39;s never seen one corrected, and I&#39;ve certainly never done <br/>\nthis (or even told him which answers weren&#39;t correct in the first <br/>\nplace), I think it&#39;s an interesting insight into his feeling that he <br/>\nwants completion of that particular task. It&#39;s also interesting in <br/>\nthat, since we don&#39;t have any concept of levels or grades around <br/>\nhere, he&#39;s tuned in enough to his own progression to know when he has <br/>\nlearned enough to go back and fix previous mistakes.<br/>\n<br/>\nBTW, I&#39;m the same way. I&#39;ve got a folder with about twenty articles <br/>\non various subjects that I&#39;ve been meaning to finish writing. Most <br/>\nare only one or two paragraphs or an outline, or some random <br/>\nthoughts. I&#39;ve never completed one until this week, when I had a <br/>\nspare hour and I dusted one off and finished it! But, OTOH, once I <br/>\nstarted writing my novel, I went straight through to the end, writing <br/>\n120,000 words in a matter of a couple of months. I don&#39;t know why <br/>\nthat was easier for me than finishing a 2,000 word article or two, <br/>\nbut it was. My second novel is currently languishing at the 35,000 <br/>\nword level, but I&#39;m sure I&#39;ll finish it sometime later this year. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you provide outside motivation (by coaching or <br/>\n&gt; pushing) when the child has expressed interest in a certain <br/>\n&gt; area?<br/>\n<br/>\n </span></blockquote>Yes, and I do so for myself as well. I seek out coaching or teachers <br/>\nor mentors when I need them, and when my kids have asked for them <br/>\nI&#39;ve done that for them as well.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m inclined at this point to offer support more than a push but I <br/>\n&gt; have friends who disagree with this ideology and I thought I&#39;d <br/>\n&gt; find out your experiences and what you think about it.<br/>\n<br/>\n </span></blockquote>I saw a lot of kids on the swim team in college that were only there <br/>\nbecause their parents pushed them to be there. They hated to swim, <br/>\nand once they were done, they never wanted to swim again. OTOH, my <br/>\nparents let me quit the swim team when I was a kid, and quit it again <br/>\nin high school (I had the same awful coach both times), and when I <br/>\nswam in college it was because *I* wanted to. I still swim every <br/>\nweek, and I still really love the sport. I compete when and where I <br/>\nwant to, and don&#39;t for years at a time, only to return to it again <br/>\nand again. I think if what you&#39;re looking for is short-term glory, <br/>\nthen pushing is the way to go. Certainly, I never made it to the <br/>\nOlympics with my sporadic swimming approach. But if you&#39;re looking <br/>\nfor a lifelong love or enjoyment of a particular discipline, then <br/>\nletting it be guided by the child&#39;s internal drive is the way to go. <br/>\nPersonally, I&#39;d rather have a child who loves to swim, or play music, <br/>\nor write than one who hates it but does it for the sake of a medal or <br/>\ntrophy.<br/>\n<br/>\nBlue Skies,<br/>\n<br/>\n-Robin-</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: What do you say to nay-sayers?","postDate":"1042136287","msgId":54086,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyYS4xZjljODcxNS4yYjRmMTZkZkBhb2wuY29tPg=="},"prevInTopic":54079,"nextInTopic":54109,"prevInTime":54085,"nextInTime":54087,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/9/03 1:12:20 AM, sheran@ptd.net writes: ","messageBody":"<div id=\"ygrps-yiv-1564895218\">In a message dated 1/9/03 1:12:20 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I told her that we homeschool.  She said, &quot;Oh, well he&#39;s <br/>\nstill in kindergarten then.  School is school, whether it is at <br/>\nschool or home!&quot;  &gt;&gt;<br/>\n<br/>\nMy brother-in-law (Keith&#39;s oldest brother) insists on this kind of banter <br/>\nwith kids.<br/>\n<br/>\nOnce it was &quot;How do you like your teacher?&quot;<br/>\n<br/>\n&quot;I don&#39;t have a teacher.&quot;<br/>\n<br/>\n&quot;Well sure you do.  Your mom&#39;s your teacher.&quot;<br/>\n<br/>\nMarty just looked at him lamely like sad old Uncle Gerry should really get <br/>\nonto an actual subject of conversation.   <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":132394532,"authorName":"Have a Nice Day!","from":"Have a Nice Day! &lt;litlrooh@...&gt;","profile":"bry2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] What do you say to nay-sayers?","postDate":"1042134867","msgId":54079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODEwMWMyYjgwOCQyNzY1NjIwMCRiNTU3NTI0NEBjZWxlcm9uMTc+","referencesHeader":"PGF2aWFkZys0bW5oQGVHcm91cHMuY29tPiA8MDAwNzAxYzJiNzczJDM2MTcxNjgwJGI1NTc1MjQ0QGNlbGVyb24xNz4gPDAwODMwMWMyYjdhNCQ2OTYxNTA2MCQwOTAwYThjMEB3ZXN0Pg=="},"prevInTopic":53960,"nextInTopic":54086,"prevInTime":54078,"nextInTime":54080,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"... corrected why would he even need braces?  Maybe I m missing something.","messageBody":"<div id=\"ygrps-yiv-1474363537\"><blockquote><span title=\"ireply\">&gt;&gt;I don&#39;t understand.  If his teeth are straight, and his bite has been<br/>\n </span></blockquote>corrected why would he even need braces?  Maybe I&#39;m missing something.&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nI knew someone would ask!! LOL.<br/>\n<br/>\nMy son originally had an overbite where his top jaw grew faster than his lower jaw.  HIs bite is corrected because the molars are in the correct position.  His teeth are straight but there is still space between the molars and the other teeth so it still appears as if there is an overbite.  As long as the bite is corrected, the jaws will continue to grow in proportion to each other.<br/>\nWithout braces the molars will drift back to where they were and he could end up with an overbite again.  <br/>\n<br/>\nThe braces are to pull the other teeth closer to the molars to &quot;stabilize the bite&quot; so that both jaws grow proportionally together.  Theoretically, with the spaces closed, he would eventually not need a retainer.<br/>\n<br/>\nWell, I got to thinking about that.  It seems to me that with a retainer, he would not need to worry about teeth drifting.  AND, when he is done *growing*, it seems to me that even if his teeth drift, he will not develop an overbite.  AND most kids who have had braces STILL have to wear a retainer anyway, so what is the point,  in *his* case of getting braces?<br/>\n<br/>\nNeedless to say, when I asked if he would have to wear a retainer after braces anyway, he said yes.  And when I asked him if a retainer would maintain his bite, he said yes.  So, thats what we did.  I will have to ask him about what happens when he is done growing.<br/>\n<br/>\nMy goal was only to correct the bite.  If we hadn&#39;t corrected the bite, and he later wanted to pursue orthodontics, he would have had to have jaw surgery.  Now, because his bite is corrected, he has the choice to get braces or not as long as he wears the retainer as prescribed.  <br/>\n<br/>\nThe other reason I want him to wait until he is done growing for braces now is because in his case, he can opt for Invisalign as an adult.  I&#39;m using Invisalign myself, and you can remove them to eat, brush, and floss.  With braces, you have to be careful WHAT you eat, and brushing and flossing are harder.<br/>\n<br/>\nKristen<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Tia Leschke <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Thursday, January 09, 2003 12:58 AM<br/>\n  Subject: Re: [Unschooling-dotcom] What do you say to nay-sayers?<br/>\n<br/>\n<br/>\n  &gt;<br/>\n  &gt; Regarding hygiene, my kids are all big into showers, sometimes 2x day.  My<br/>\n  oldest two brush their teeth, though there was a time when my oldest wasn&#39;t<br/>\n  interested.  We still haven&#39;t gotten braces for him because I don&#39;t feel he<br/>\n  takes good enough care of his teeth. (and there are other reasons, like his<br/>\n  teeth are straight and his bite has been corrected so a retainer will hold<br/>\n  his teeth in position till he can get his own braces..when *he* wants).  But<br/>\n  he *is* getting better at it.  He&#39;s decided its easiest to brugh his teeth<br/>\n  when he&#39;s in the shower, so his toothbrush is hanging in there now.<br/>\n<br/>\n  I don&#39;t understand.  If his teeth are straight, and his bite has been<br/>\n  corrected why would he even need braces?  Maybe I&#39;m missing something.<br/>\n  Tia<br/>\n<br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85 &lt;sheran@ptd.net&gt;","from":"&quot;kayb85 &lt;sheran@...&gt;&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What do you say to nay-sayers?","postDate":"1042099293","msgId":53960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGF2amE4dCs0OW04QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGF2aWFkZys0bW5oQGVHcm91cHMuY29tPg=="},"prevInTopic":53952,"nextInTopic":54079,"prevInTime":53959,"nextInTime":53961,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"We were at the dentist today, and I was in with my 5 year old.  She asked him if he was in kindergarden, and he just looked at her funny.  I told her that we","messageBody":"<div id=\"ygrps-yiv-2079688472\">We were at the dentist today, and I was in with my 5 year old.  She <br/>\nasked him if he was in kindergarden, and he just looked at her <br/>\nfunny.  I told her that we homeschool.  She said, &quot;Oh, well he&#39;s <br/>\nstill in kindergarten then.  School is school, whether it is at <br/>\nschool or home!&quot;  Inside I was chuckling, but I didn&#39;t want to get <br/>\ninto it.  Then she asked what type of curriculum homeschoolers use <br/>\nfor kindergarten.  I just told her I don&#39;t use any, but that we just <br/>\nplay around with stuff.  She said, &quot;Oh, well then, what about first <br/>\ngrade?  Do you use a curriculum then?&quot;  I told her that some <br/>\nhomeschoolers do, but that I just follow my kids&#39; interests.  She <br/>\ndidn&#39;t say anything.<br/>\n<br/>\nWhen we got home I asked my 9 year old if the dentist had asked her <br/>\nabout homeschooling at all.  (I just had that feeling!)  She said <br/>\nyes, that the dentist had asked her about school and she had told her <br/>\nthat she was homeschooled.  The dentist asked her what kinds of <br/>\nthings she does at homeschool, and dd told her, &quot;I just do whatever I <br/>\nwant&quot;.  The dentist laughed and said &quot;Oh, well, that sounds good!&quot;  <br/>\n<br/>\nI think that the conversation she had with my daughter explained all <br/>\nthe questions she asked me about homeschooling!  My daughter was seen <br/>\nright before my son and I were.  <br/>\n<br/>\nBut I do wonder sometimes that people like that will think that I&#39;m <br/>\ntotally neglecting my kids.  How do you explain to someone like that <br/>\nwhat unschooling really is?  That it&#39;s a totally different lifestyle, <br/>\nand that it really works.  How do you leave the dentist, who is <br/>\nreally just making polite conversation and isn&#39;t willing/able to sit <br/>\ndown and discuss educational philosophy, without a bad impression? I <br/>\ndon&#39;t think you can, unless you have a few hours to sit and talk with <br/>\nthem about it.  And maybe unless they are willing to read through a <br/>\nfew different books that you recommend to them.  <br/>\n<br/>\nSheila<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, &quot;Julie Bogart <br/>\n&lt;julie@b...&gt;&quot; &lt;julie@b...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; Thanks for all your thoughts on rebellion. Today on another <br/>\n&gt; board, someone spoke of the unschoolers she knows as being <br/>\n&gt; poorly dressed, unhealthy emotionally, unprepared for life and <br/>\n&gt; the homes of these families as being chaotic and dirty. I <br/>\n&gt; remember in LLL occasionally running into families who took the <br/>\n&gt; views of demand feeding so seriously that they completely <br/>\n&gt; neglected hygiene, housework and ordinary routines for children <br/>\n&gt; (kids sleeping in clothes, brushing their teeth only when they felt <br/>\n&gt; like it and so on).<br/>\n&gt; <br/>\n&gt; The unschoolers I&#39;ve known haven&#39;t been like that. But I have <br/>\n&gt; known very unhealthy families whose mothers are perennially <br/>\n&gt; sick or where the family lives from crisis to crisis and <br/>\n&gt; homeschooling looks dysfunctional at that point (to me).<br/>\n&gt; <br/>\n&gt; Do you deal with these broad stereotypes about unschooling? <br/>\n&gt; What do you say to them?<br/>\n&gt; <br/>\n&gt; Also, there is a fairly popular philosophy that kids do better when <br/>\n&gt; pushed to perform (think of the strict teacher or the intense <br/>\n&gt; football coach, or the passionate and demanding theater <br/>\n&gt; director). Have you found that your kids generate enough <br/>\n&gt; self-motivation to achieve their goals? Do you urge completion of <br/>\n&gt; projects? Do you provide outside motivation (by coaching or <br/>\n&gt; pushing) when the child has expressed interest in a certain <br/>\n&gt; area?<br/>\n&gt; <br/>\n&gt; I&#39;m inclined at this point to offer support more than a push but I <br/>\n&gt; have friends who disagree with this ideology and I thought I&#39;d <br/>\n&gt; find out your experiences and what you think about it.<br/>\n&gt; <br/>\n&gt; Julie B </span></blockquote></div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] What do you say to nay-sayers?","postDate":"1042091907","msgId":53952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwODMwMWMyYjdhNCQ2OTYxNTA2MCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PGF2aWFkZys0bW5oQGVHcm91cHMuY29tPiA8MDAwNzAxYzJiNzczJDM2MTcxNjgwJGI1NTc1MjQ0QGNlbGVyb24xNz4="},"prevInTopic":53938,"nextInTopic":53960,"prevInTime":53951,"nextInTime":53953,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"... oldest two brush their teeth, though there was a time when my oldest wasn t interested.  We still haven t gotten braces for him because I don t feel he ","messageBody":"<div id=\"ygrps-yiv-884184798\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Regarding hygiene, my kids are all big into showers, sometimes 2x day.  My<br/>\n </span></blockquote>oldest two brush their teeth, though there was a time when my oldest wasn&#39;t<br/>\ninterested.  We still haven&#39;t gotten braces for him because I don&#39;t feel he<br/>\ntakes good enough care of his teeth. (and there are other reasons, like his<br/>\nteeth are straight and his bite has been corrected so a retainer will hold<br/>\nhis teeth in position till he can get his own braces..when *he* wants).  But<br/>\nhe *is* getting better at it.  He&#39;s decided its easiest to brugh his teeth<br/>\nwhen he&#39;s in the shower, so his toothbrush is hanging in there now.<br/>\n<br/>\nI don&#39;t understand.  If his teeth are straight, and his bite has been<br/>\ncorrected why would he even need braces?  Maybe I&#39;m missing something.<br/>\nTia</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] What do you say to nay-sayers?","postDate":"1042085131","msgId":53938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3OGhVWUxxVnBVT0Y5dkpaVHUwMDAwMDZhNUBob3RtYWlsLmNvbT4="},"prevInTopic":53903,"nextInTopic":53952,"prevInTime":53937,"nextInTime":53939,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"From: Julie Bogart   Well I actually haven t","messageBody":"<div id=\"ygrps-yiv-638785587\">From: Julie Bogart &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a>&gt;<br/>\n<br/>\n&lt;&lt;Do you deal with these broad stereotypes about unschooling?<br/>\nWhat do you say to them?&gt;&gt;<br/>\n<br/>\n<br/>\nWell I actually haven&#39;t heard of this being a stereotype for unschoolers. <br/>\nBut it certainly wouldn&#39;t hold water here. My kids are always well put <br/>\ntogether. The clothes are new and clean and matched. Something I&#39;m anal <br/>\nabout for my family. You can show up mismatched and I&#39;d be fine with it, but <br/>\nnot for my kids. My kids will actually ask me if what they want to wear <br/>\nmatches so it&#39;s never a struggle. I&#39;ve never had a kid want to wear a <br/>\nfavorite anything until it was falling apart or dirty. (a fate worse than <br/>\ndeath!)<br/>\n<br/>\nI guess it just goes along with how we were with them from a young age. It&#39;s <br/>\nnever a struggle here to have them look nice and keep clean. Bath or shower <br/>\ntime has been a ritual every night since birth. Not one of them has ever <br/>\nbalked at doing so. Same with teeth brushing, it&#39;s just something we all do. <br/>\nNo fuss or fight, ever.<br/>\n<br/>\nAs far as the house stuff goes, we all work here to keep a tidy house. <br/>\nAnother really anal thing for me. Aside from it being a thing of mine, it&#39;s <br/>\nalso necessary for us all here. We have a fairly large house with 6 people <br/>\nin it, 2 cats, and 2 dogs. It&#39;s necessary to pick up. If not, things gets <br/>\nstepped on and more often than not, not broken but the foot gets hurt. The <br/>\nbaby gets into things she shouldn&#39;t, the dogs get things they shouldn&#39;t. <br/>\nSome of it is more of a safety matter than a neat one. But I won&#39;t <br/>\ncomplain!! Every night, either before or after shower, the playroom gets <br/>\ncleaned up. Meaning everything gets picked up off of the floor. The counter <br/>\ncan be cluttered and the table and shelves, but the floor has to be <br/>\nsweepable. I vacuum every day and most days twice. Toys have to be up. No <br/>\ntoys are to be brought in the living room. The dogs eat stuff and not only <br/>\nis it broken but I have to worry about them choking on it. (they are still <br/>\nboth puppies) Bedrooms can be cluttered and messy as long as I can get in <br/>\nand to each bed and back out again in the dark. (i.e. path) There comes a <br/>\ntime when the kids clean their rooms again out of necessity, wanting to find <br/>\nsomething or to have more room to spread more stuff!!<br/>\n<br/>\nI go around every day and pick up food. My 2 year old is notorious for <br/>\neating on the run. Hubby just found a chicken wing on the floor. I have a <br/>\nhysterical story of a left on the floor lollipop!! I do the sweeping, <br/>\nmopping, cleaning etc. My kids help strip their beds mostly because it&#39;s fun <br/>\nand they play tent afterwards. They all put away their own clothes after I <br/>\nwash them, sometimes I do it myself. I usually get their food and drinks <br/>\nonly because we have some of the house gated off to keep the puppies <br/>\ncontained and it&#39;s easier for me to pass through the stuff from the kitchen <br/>\nto playroom instead of having little ones straddle gates. No big deal.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;Also, there is a fairly popular philosophy that kids do better when<br/>\npushed to perform (think of the strict teacher or the intense<br/>\nfootball coach, or the passionate and demanding theater<br/>\ndirector). Have you found that your kids generate enough self-motivation to <br/>\nachieve their goals? Do you urge completion of<br/>\nprojects? Do you provide outside motivation (by coaching or pushing) when <br/>\nthe child has expressed interest in a certain area?&gt;&gt;<br/>\n<br/>\n<br/>\nI don&#39;t think kids do better, or at least my kids do better when pushed. In <br/>\nfact, they would go the other way. My oldest goes to a private high school, <br/>\nher choice. She knows she can stay home whenever she wants. She knows she <br/>\ncan quit whenever she wants.  She goes to school regularly. Misses when <br/>\nshe&#39;s sick. Once in a great while she&#39;ll want to take off a day to hang with <br/>\nme and the kids at the park. Once a year her sister takes her to Orlando for <br/>\nher birthday and she misses a day or two at the most. She just asked if she <br/>\ncan stay out late this year for her birthday and miss school the next day as <br/>\nit&#39;s on a weekday. The answer was sure, she knew it but asked anyway. That&#39;s <br/>\nhow she is. Her grades are better than ever, she works 5 days a week <br/>\n(sometimes more) and just got above and beyond employee of the month. She <br/>\nhas a bank account she saves for herself and money she manages herself. She <br/>\nhas a wonderful boyfriend and is even talking community college. This all <br/>\nfrom a girl who 2 years ago wanted nothing more than to be 21, rich and a <br/>\npartyer as a living. We went with it and well, look where it got us. Pushing <br/>\nwould have been disasterous.<br/>\n<br/>\nTwo of the 3 younger ones are never pushed to do anything. If they want to <br/>\nplay or try something, we make it so they can. So far, they have finished <br/>\nwhat they started as far as organized stuff. We always told them they could <br/>\nquit if they wanted, they never have. Sometimes they chose not to do it <br/>\nagain, no problem. We are cheerleaders here in whatever they do, but it&#39;s <br/>\nalways their choice.<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nMSN 8 helps eliminate e-mail viruses. Get 2 months FREE* <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/virus\">http://join.msn.com/?page=features/virus</a></div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart &lt;julie@bravewriter.com&gt;","from":"&quot;Julie Bogart &lt;julie@...&gt;&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: What do you say to nay-sayers?","postDate":"1042074946","msgId":53903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGF2aWlnMitwNWhsQGVHcm91cHMuY29tPg=="},"prevInTopic":53899,"nextInTopic":53938,"prevInTime":53902,"nextInTime":53904,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1106114984\">&lt;&lt;But I have <br/>\nknown very unhealthy families whose mothers are perennially <br/>\nsick or where the family lives from crisis to crisis and <br/>\nhomeschooling looks dysfunctional at that point (to me).&gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If their kids are in school doesn&#39;t it look just as dysfunctional?<br/>\n&gt;Would kids from a problematical situation necessarily be better <br/>\n&gt;off in school?<br/>\n<br/>\n </span></blockquote>The reason i think this is worse in homeschooling is that at <br/>\ntimes, the kids have no escape from chaos and unhealthiness. I <br/>\nrecall one friend (Son was best friends with my son) whose <br/>\nhouse was so filthy and unkempt that literally there were never <br/>\nany clean dishes, nowhere to walk, and laundry strewn up and <br/>\ndown the halls. (Kids would grab shirts from the unending piles <br/>\nof laundry that littered the halls.)<br/>\n<br/>\nThis boy rarely had friends over because it was so bad. She&#39;s <br/>\nhad Child Protective services called on her several times.<br/>\n<br/>\nI always felt that that boy deserved to go to school--to have a <br/>\nplace of order, a place with some level of control where he could <br/>\nwork on a cleared desk with people who came prepared to be <br/>\nwith him.<br/>\n<br/>\nMy dh grew up in an even worse environment and is so grateful <br/>\nfor school. It was his one escape.<br/>\n<br/>\nSo, yes, that&#39;s why I see homeschool combined with <br/>\nunhealthiness in families as more dangerous.<br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] What do you say to nay-sayers?","postDate":"1042074367","msgId":53899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMUNDQUZGLkEzODQ0N0QzQGVhcnRobGluay5uZXQ+","referencesHeader":"PGF2aWFkZys0bW5oQGVHcm91cHMuY29tPg=="},"prevInTopic":53898,"nextInTopic":53903,"prevInTime":53898,"nextInTime":53900,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"**Also, there is a fairly popular philosophy that kids do better when pushed to perform (think of the strict teacher or the intense football coach, or the","messageBody":"<div id=\"ygrps-yiv-141430880\">**Also, there is a fairly popular philosophy that kids do better when <br/>\npushed to perform (think of the strict teacher or the intense <br/>\nfootball coach, or the passionate and demanding theater <br/>\ndirector). Have you found that your kids generate enough <br/>\nself-motivation to achieve their goals?**<br/>\n<br/>\nGreat questions.<br/>\n<br/>\nI don&#39;t know.  If anyone pushes my kid he balks like a mule and seems to<br/>\nbe intensely uncomfortable.  Not pushing him seems like the only<br/>\npossible strategy to me.<br/>\n<br/>\nGentle nudging has a very low success rate with him.  I mostly don&#39;t do<br/>\nthat either, but maybe I should do more.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] What do you say to nay-sayers?","postDate":"1042073730","msgId":53898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1LjM1YWM1MmI1LjJiNGUyMjgyQGFvbC5jb20+"},"prevInTopic":53896,"nextInTopic":53899,"prevInTime":53897,"nextInTime":53899,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/8/03 4:00:07 PM, julie@bravewriter.com writes: ","messageBody":"<div id=\"ygrps-yiv-1988911595\">In a message dated 1/8/03 4:00:07 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a> writes:<br/>\n<br/>\n&lt;&lt; . . .  so seriously that they completely <br/>\nneglected hygiene, housework and ordinary routines for children <br/>\n(kids sleeping in clothes, brushing their teeth only when they felt <br/>\nlike it and so on). &gt;&gt;<br/>\n<br/>\nWe don&#39;t have &quot;ordinary routines,&quot; but I don&#39;t consider that complete neglect.<br/>\n<br/>\nKirby and Marty went through years of only wearing clothes they could sleep <br/>\nin.  Cool little all-cotton sweat suits from After the Stork, so they could <br/>\nsleep and live in the same kinds of clothes.  They didn&#39;t wear them for days, <br/>\nbut they didn&#39;t change to sleep or wake up.<br/>\n<br/>\nHolly wears real clothes now to sleep in, but different clothes--leggings and <br/>\noversized t-shirts.  So if she wakes up and wears those a while, it&#39;s not <br/>\nlike being undressed or in pajamas.<br/>\n<br/>\nI don&#39;t make them brush their teeth on a schedule, but they all do it for <br/>\nreal reasons (their mouths don&#39;t taste or smell &quot;minty fresh,&quot; or they&#39;re <br/>\ngoing out and it&#39;s part of primping, or whatever.<br/>\n<br/>\n&lt;&lt;But I have <br/>\nknown very unhealthy families whose mothers are perennially <br/>\nsick or where the family lives from crisis to crisis and <br/>\nhomeschooling looks dysfunctional at that point (to me).&gt;&gt;<br/>\n<br/>\nIf their kids are in school doesn&#39;t it look just as dysfunctional?<br/>\nWould kids from a problematical situation necessarily be better off in school?<br/>\n<br/>\n&lt;&lt;Do you deal with these broad stereotypes about unschooling? <br/>\nWhat do you say to them?&gt;&gt;<br/>\n<br/>\nI say I know lots of unschoolers who aren&#39;t that way.  And I make solid and <br/>\ninterested eye-contact awaiting their next move.  And they never have one.<br/>\n<br/>\n&lt;&lt;Also, there is a fairly popular philosophy that kids do better when <br/>\npushed to perform (think of the strict teacher or the intense <br/>\nfootball coach, or the passionate and demanding theater <br/>\ndirector). &gt;&gt;<br/>\n<br/>\nI think everyone knows kids who have killed themselves from overmuch pressure <br/>\nabout something relatively unimportant, like high school football or being a <br/>\ncheerleader or making all-state something-or-other.  <br/>\n<br/>\n&lt;&lt; Have you found that your kids generate enough self-motivation to achieve <br/>\ntheir goals?&gt;&gt;<br/>\n<br/>\nTheir goals so far are to be good friends to their friends, to have fun, to <br/>\nbe helpful, to skate, to build things, to show up where they need to be on <br/>\ntime...  Yeah, they have LOTS of self motivation for the things they want to <br/>\ndo.<br/>\n<br/>\n&lt;&lt;Do you urge completion of projects? &gt;&gt;<br/>\n<br/>\nCompletion of a project someone has lost interest in or which is stressing <br/>\nthem out is one of the worst things to urge.  If others are depending on them <br/>\nto do their part in a group project, yes.  That&#39;s different.  But if they <br/>\nstart to dig a big hole in the  yard and decide they&#39;re done, or they start <br/>\nto write a story and decide they&#39;d rather do something else, or they had a <br/>\nplan to make something and they think they&#39;re not ready to do it, no.  I <br/>\nencourage them to stop if they&#39;re not having fun.   <br/>\n<br/>\nI encourage everyone else to complete projects later if they&#39;ve lost interest <br/>\ntoo.  The person is almost always more important than the project.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/empowerment\">http://sandradodd.com/empowerment</a><br/>\n<br/>\n&lt;&lt;Do you provide outside motivation (by coaching or <br/>\npushing) when the child has expressed interest in a certain <br/>\narea?&gt;&gt;<br/>\n<br/>\nYes.  But I would do that for anyone.  I&#39;ve done it for my husband and for my <br/>\nfriends, when they need assistance or reminders or a witness or someone to <br/>\ncheck in with them to remind them to take meds or not overeat or to finish a <br/>\nreport or an article or whatever.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":133996021,"authorName":"Colonel Newton","from":"&quot;Colonel Newton&quot; &lt;colnewt@...&gt;","profile":"lambet","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] What do you say to nay-sayers?","postDate":"1042072681","msgId":53896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjcwMWMyYjc3NyQ1ZWM5Y2QzMCRjNGUxYmQzZkBqZWZmZnlqdG51OHQ2OT4=","referencesHeader":"PGF2aWFkZys0bW5oQGVHcm91cHMuY29tPg=="},"prevInTopic":53892,"nextInTopic":53898,"prevInTime":53895,"nextInTime":53897,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"The unschoolers I ve known haven t been like that. But I have known very unhealthy families whose mothers are perennially sick or where the family lives from","messageBody":"<div id=\"ygrps-yiv-1319127529\">The unschoolers I&#39;ve known haven&#39;t been like that. But I have <br/>\nknown very unhealthy families whose mothers are perennially <br/>\nsick or where the family lives from crisis to crisis and <br/>\nhomeschooling looks dysfunctional at that point (to me).<br/>\n<br/>\nDo you deal with these broad stereotypes about unschooling? <br/>\nWhat do you say to them?<br/>\n--------------<br/>\n<br/>\nBut you know what, Julie?  There are families like this of EVERY type.  I have about 6 formerly home schooled kids in my class this year, one of whom was unschooled, and two of whom (I believe) were neglected-- hygienically, physically, etc.  I don&#39;t think it was the *home schooling* that was related to the parents being neglectful of basic cleanliness/ doctor&#39;s visits (or, if not a dr., some attention to things like illnesses, having physical deformities, etc.)/ personal care issues... because the parents are STILL neglectful of these things now.  And I have other parents whose kids have always been in PS who are living similarly.<br/>\n<br/>\nTo me, there are as many flavors of home schoolers as there are flavors of parents in PS.  I think that whatever the group, it&#39;s ALWAYS false to generalize about them. :)<br/>\n<br/>\nTeresa G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":132394532,"authorName":"Have a Nice Day!","from":"Have a Nice Day! &lt;litlrooh@...&gt;","profile":"bry2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] What do you say to nay-sayers?","postDate":"1042070897","msgId":53892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDcwMWMyYjc3MyQzNjE3MTY4MCRiNTU3NTI0NEBjZWxlcm9uMTc+","referencesHeader":"PGF2aWFkZys0bW5oQGVHcm91cHMuY29tPg=="},"prevInTopic":53890,"nextInTopic":53896,"prevInTime":53891,"nextInTime":53893,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"Wellllll  Here is my experience. Regarding hygiene, my kids are all big into showers, sometimes 2x day.  My oldest two brush their teeth, though there was a","messageBody":"<div id=\"ygrps-yiv-806276716\">Wellllll  Here is my experience.<br/>\n<br/>\nRegarding hygiene, my kids are all big into showers, sometimes 2x day.  My oldest two brush their teeth, though there was a time when my oldest wasn&#39;t interested.  We still haven&#39;t gotten braces for him because I don&#39;t feel he takes good enough care of his teeth. (and there are other reasons, like his teeth are straight and his bite has been corrected so a retainer will hold his teeth in position till he can get his own braces..when *he* wants).  But he *is* getting better at it.  He&#39;s decided its easiest to brugh his teeth when he&#39;s in the shower, so his toothbrush is hanging in there now.<br/>\n<br/>\nMy youngest needs reminded continually to brush her teeth.  She does have cavities and has had fillings, etc.  I *want* to remember to check on her, but my own schedule is somewhat chaotic and so I often forget.  Thats one of my New Year&#39;s resolutions :o).<br/>\n<br/>\nMy house is not usually &quot;dirty&quot;, but it does get very cluttered.  Over the holidays it was an absolute MESS.  I truly just did not have the time to clean it.  Most of the time though I try to keep things swept up, wiped down, and the bathroom clean.  I do laundry usually once/week and the dishes get done every day.<br/>\n<br/>\nWe live in a small house and there are 5 of us (PLUS all the friends that hang out here along with the winter slop, ashes from the woodstove, etc), so its a constant battle.  If I&#39;m down for even one day, or had to work the weekend, it means starting all over behind the 8-ball when I am able to get back to it.  And sometimes I get so overwhelmed by it all that I don&#39;t even want to get out of bed.  It makes it hard for me to funciton.  For my own personal peace of mind, I do need to keep after it but I don&#39;t require my kids to help anymore.  I do ask them to help out sometimes but its voluntary.<br/>\n<br/>\nMy oldest daughter does her own laundery now because she is tired of not having her favorite stuff to wear.  She is also an expert at vaccuuming.<br/>\n<br/>\nMy youngest is an expert at cleaning the bathroom and dusting.<br/>\n<br/>\nMy oldest is adept at cooking.  But he&#39;s not so great about cleaning up after himself :o).  He will when he is on his own thought, I&#39;m sure of that.  He already has gone from having the messiest room in the house to having almost the most organized.<br/>\n<br/>\nAll in all, I would say my kids are very prepared to live on their own in the home-ec sense of things.<br/>\n<br/>\nMy youngest does sleep in her clothes quite often.  I don&#39;t much care.  As long as her clothes are clean and she is clean that is fine by me.  Most of the time she is just too engaged in whatever she is doing to be bothered with worrying about her clothes (unless we are going out somewhere).<br/>\n<br/>\nShould we push our kids?<br/>\n<br/>\nWell, I *did* do that and it was the worst thing I ever did.  I *do* strongly encourage sometimes, but usually only when their decisions affect someone other than themselves.  <br/>\n<br/>\nFor example, they are on the swim team and talk about quitting.  But my son&#39;s age group only has 4 boys so if he quits they will no longer be able to have a relay team (and their relay team is doing pretty well).  In that case, the other boys are counting on him, so I&#39;ve asked him to finish the season...and then if he doens&#39;t want to swim after that, thats fine.  I don&#39;t get too hung up on the practices anymore though, but I strongly encourage them to go at least 3 times/week.<br/>\n<br/>\nHope that helps!<br/>\nKristen<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Julie Bogart &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:julie@...\">julie@...</a>&gt; <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Wednesday, January 08, 2003 5:57 PM<br/>\n  Subject: [Unschooling-dotcom] What do you say to nay-sayers?<br/>\n<br/>\n<br/>\n  Thanks for all your thoughts on rebellion. Today on another <br/>\n  board, someone spoke of the unschoolers she knows as being <br/>\n  poorly dressed, unhealthy emotionally, unprepared for life and <br/>\n  the homes of these families as being chaotic and dirty. I <br/>\n  remember in LLL occasionally running into families who took the <br/>\n  views of demand feeding so seriously that they completely <br/>\n  neglected hygiene, housework and ordinary routines for children <br/>\n  (kids sleeping in clothes, brushing their teeth only when they felt <br/>\n  like it and so on).<br/>\n<br/>\n  The unschoolers I&#39;ve known haven&#39;t been like that. But I have <br/>\n  known very unhealthy families whose mothers are perennially <br/>\n  sick or where the family lives from crisis to crisis and <br/>\n  homeschooling looks dysfunctional at that point (to me).<br/>\n<br/>\n  Do you deal with these broad stereotypes about unschooling? <br/>\n  What do you say to them?<br/>\n<br/>\n  Also, there is a fairly popular philosophy that kids do better when <br/>\n  pushed to perform (think of the strict teacher or the intense <br/>\n  football coach, or the passionate and demanding theater <br/>\n  director). Have you found that your kids generate enough <br/>\n  self-motivation to achieve their goals? Do you urge completion of <br/>\n  projects? Do you provide outside motivation (by coaching or <br/>\n  pushing) when the child has expressed interest in a certain <br/>\n  area?<br/>\n<br/>\n  I&#39;m inclined at this point to offer support more than a push but I <br/>\n  have friends who disagree with this ideology and I thought I&#39;d <br/>\n  find out your experiences and what you think about it.<br/>\n<br/>\n  Julie B<br/>\n<br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart &lt;julie@bravewriter.com&gt;","from":"&quot;Julie Bogart &lt;julie@...&gt;&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What do you say to nay-sayers?","postDate":"1042066672","msgId":53890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGF2aWFkZys0bW5oQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":53892,"prevInTime":53889,"nextInTime":53891,"topicId":53890,"numMessagesInTopic":0,"msgSnippet":"Thanks for all your thoughts on rebellion. Today on another board, someone spoke of the unschoolers she knows as being poorly dressed, unhealthy emotionally,","messageBody":"<div id=\"ygrps-yiv-211321583\">Thanks for all your thoughts on rebellion. Today on another <br/>\nboard, someone spoke of the unschoolers she knows as being <br/>\npoorly dressed, unhealthy emotionally, unprepared for life and <br/>\nthe homes of these families as being chaotic and dirty. I <br/>\nremember in LLL occasionally running into families who took the <br/>\nviews of demand feeding so seriously that they completely <br/>\nneglected hygiene, housework and ordinary routines for children <br/>\n(kids sleeping in clothes, brushing their teeth only when they felt <br/>\nlike it and so on).<br/>\n<br/>\nThe unschoolers I&#39;ve known haven&#39;t been like that. But I have <br/>\nknown very unhealthy families whose mothers are perennially <br/>\nsick or where the family lives from crisis to crisis and <br/>\nhomeschooling looks dysfunctional at that point (to me).<br/>\n<br/>\nDo you deal with these broad stereotypes about unschooling? <br/>\nWhat do you say to them?<br/>\n<br/>\nAlso, there is a fairly popular philosophy that kids do better when <br/>\npushed to perform (think of the strict teacher or the intense <br/>\nfootball coach, or the passionate and demanding theater <br/>\ndirector). Have you found that your kids generate enough <br/>\nself-motivation to achieve their goals? Do you urge completion of <br/>\nprojects? Do you provide outside motivation (by coaching or <br/>\npushing) when the child has expressed interest in a certain <br/>\narea?<br/>\n<br/>\nI&#39;m inclined at this point to offer support more than a push but I <br/>\nhave friends who disagree with this ideology and I thought I&#39;d <br/>\nfind out your experiences and what you think about it.<br/>\n<br/>\nJulie B</div>","specialLinks":[]}],"prevTopicId":53993,"nextTopicId":53932}}