{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"7 year old girl narrative","postDate":"1092255360","msgId":97730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmZHVxMStlb2NrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":97729,"nextInTime":97731,"topicId":97730,"numMessagesInTopic":0,"msgSnippet":"I decided to post the one I ve sent to a few of you via email. I ve taken o= ut the names. Since \nseveral more have asked, and I have had a bit of time to sit","messageBody":"<div id=\"ygrps-yiv-742283462\">I decided to post the one I&#39;ve sent to a few of you via email. I&#39;ve taken o=\r<br/>\nut the names. Since <br/>\nseveral more have asked, and I have had a bit of time to sit with it, I fee=\r<br/>\nl okay about <br/>\nposting this one.<br/>\n<br/>\nJulie Bogart<br/>\n<br/>\n--<br/>\n________Bogart<br/>\n<br/>\nProgram for 2003-2004<br/>\n<br/>\nIn the last 18 mos., we embarked on a program of unschooling. C has always =\r<br/>\nbeen a <br/>\nwilling student, eager to do whatever asked of her. Still, we decided that =\r<br/>\nshe thrives when <br/>\nallowed to follow her particular fascinations (of which she has many).<br/>\n<br/>\nIn the school year of 2003-2004, C spent her time in the following ways:<br/>\n<br/>\nTV Viewing<br/>\nC is keenly interested in the construction of the situation-comedy. She can=\r<br/>\n be heard <br/>\nthroughout the house imitating her favorite characters and actors. She has =\r<br/>\nbeen known to <br/>\ntell me what makes one show effective and what makes another trite or predi=\r<br/>\nctable. She is <br/>\nable to identify stereotypical characters, caricature and bad dialog. She a=\r<br/>\nlso has developed <br/>\nan unbelievable vocabulary that I can only attribute to TV. She&#39;s really cl=\r<br/>\never with irony <br/>\nand puns. One of my favorite comments of hers: &quot;All the Disney villains are=\r<br/>\n so <br/>\npredictable.&quot; She went on to elucidate the qualities that make a Disney vil=\r<br/>\nlain. J Go C!<br/>\n<br/>\nBird Watching<br/>\nC loved watching birds with us this year (Project Feeder Watch). She has le=\r<br/>\narned to identify <br/>\nmost backyard birds and helped with recording which ones visited the feeder=\r<br/>\n. She also <br/>\nhelped us stock the feeder with seed.<br/>\n<br/>\nReading and Language Arts<br/>\nC is learning to read. She is still working on the phonics of reading and h=\r<br/>\nas made lots of <br/>\nprogress, though she still isn&#39;t reading fluently.  We&#39;ve used some workboo=\r<br/>\nks (Explode the <br/>\nCode) because she likes to write in them, but mostly learn phonetics using =\r<br/>\ntechniques <br/>\nshown to me by a reading specialist.  She loves to write and has filled ood=\r<br/>\nles of notebooks <br/>\nwith letters and &quot;writing&quot; that is her own. She&#39;s working through the Frog =\r<br/>\nand Toad series <br/>\nright now reading a little bit each week.<br/>\n<br/>\nI&#39;ve read aloud to her from the Girls of Many Lands books (from American Gi=\r<br/>\nrl) and we&#39;ve <br/>\nenjoyed creating question and answer games for those. She easily narrates t=\r<br/>\nhe contents <br/>\nwhen asked about the stories.<br/>\n<br/>\nOne of my favorite moments came when she set up her five dolls on a special=\r<br/>\nly designed, <br/>\ntiered stand. She put the English doll in the middle and at first had the I=\r<br/>\nndian (India) doll <br/>\nnext to her. C exclaimed: &quot;Wait. I can&#39;t put the India doll next to England=\r<br/>\n. They hate each <br/>\nother.&quot; She began to remind me of the conflicts between India and England t=\r<br/>\nhat we had <br/>\nread about in the book. Then she had to decide who could be next to England=\r<br/>\n since China <br/>\nand France also had histories with the British that included war.<br/>\n<br/>\nShe enjoys a wide variety of literature and we read aloud every day.<br/>\n<br/>\nShe also participated in our language games that produced limericks and scr=\r<br/>\nounged <br/>\npoetry. She loves to read and learn poems.<br/>\n<br/>\nI read the last three Harry Potter books aloud to the kids during our read =\r<br/>\naloud times in <br/>\naddition to reading poetry. And we make nearly weekly library visits.<br/>\n<br/>\nIn co-op, she studied the Beatrix Potter books and created several projects=\r<br/>\n that detailed <br/>\nBP&#39;s work. She easily narrated to me what she learned and what she enjoyed.=\r<br/>\n She also took <br/>\n&quot;Let&#39;s Read and Write.&quot;<br/>\n<br/>\nMath<br/>\nFor math, we took an eclectic approach. C did do some of the Miquon math bo=\r<br/>\noks I have <br/>\nfor her and J bought her two traditional math books from the supermarket. B=\r<br/>\nut C finds the <br/>\nabstract concepts harder to grasp that way so we use them only intermittent=\r<br/>\nly (she likes <br/>\nwriting in &quot;official books&quot; but they often hinder more than help). More oft=\r<br/>\nen, we used math <br/>\nbooks like: [I]Family Math[/I], [I]The I Hate Mathematics Book[/I] and othe=\r<br/>\nr resources from <br/>\nthe library. We also used the Internet for creative math ideas. <br/>\n<br/>\nSeveral games helped to reinforce math concepts:<br/>\nMonopoly<br/>\nPoison<br/>\nDots<br/>\nYahtzee<br/>\nLentil Measuring<br/>\nManaging her money<br/>\nCounting games<br/>\n<br/>\nC is also endlessly fascinated with patterns. Currently she has an entire c=\r<br/>\nollection of cut <br/>\nouts from magazines that she pins to a bulletin board in endless arrangemen=\r<br/>\nts based on <br/>\ntheir similarities and differences. She might put all the long skinny model=\r<br/>\ns in one corner <br/>\nand all the short square ones in another. Then she matches the &quot;bling bling=\r<br/>\n&quot; (jewelry) to <br/>\ngo with them based on color or shape or size.<br/>\n<br/>\nShe constantly organizes the house, her room and her belongings into arrang=\r<br/>\nements <br/>\nbased on her need to see patterns.<br/>\n<br/>\nGreek<br/>\nAmazingly, though C can&#39;t yet read English fluently, she is fascinated by a=\r<br/>\nncient Greek and <br/>\nhas learned the alphabet. We&#39;ve worked on both lower case and upper case le=\r<br/>\ntters as well <br/>\nas knowing how to pronounce the names of the letters. She has her own Greek=\r<br/>\n notebook <br/>\nand keeps a list of our names written in Greek. We sometimes spend several =\r<br/>\ndays in a row <br/>\nworking on Greek and then take some time off. She&#39;s always interested in do=\r<br/>\ning more.<br/>\n<br/>\nSports<br/>\nC played soccer in both fall and spring. And she took gym during co-op. She=\r<br/>\n swims at the <br/>\nYMCA and she danced this summer in a ballet five-week workshop as well. One=\r<br/>\n thing I like <br/>\nabout C and sports is that she is highly motivated to practice at home. We =\r<br/>\nplay soccer in <br/>\nthe backyard and she loves to dance in the living room using books from the=\r<br/>\n library to <br/>\nguide her.<br/>\n<br/>\nHistory/Geography<br/>\nThe American Girl books from India, China, and Turkey were our primary reso=\r<br/>\nurces for <br/>\nhistory this year. We learned about the Indian revolt against Britain (1939=\r<br/>\n), the Opium War <br/>\nin Canton (1857), and we studied life in a harem in Turkey (1720).<br/>\n<br/>\nC turned her knowledge into a card game making questions and answers for th=\r<br/>\ne details of <br/>\nthe books. She played with the dolls as well as identified the places menti=\r<br/>\noned in the <br/>\nbooks on the globe.<br/>\n<br/>\nWe watched &quot;Bend It Like Beckham&quot; many, many times too. J That movie combin=\r<br/>\ned her love <br/>\nof Britain, soccer and India. <br/>\n<br/>\nShe participated in our geography work from &quot;Map the World by Heart.&quot; She l=\r<br/>\nearned about <br/>\nlongitude and latitude as well as flags. She tasted Chinese food for the fi=\r<br/>\nrst time this year <br/>\nas well.<br/>\n<br/>\nWe read several chapters from Story of the World and took time to read stor=\r<br/>\nies from 1001 <br/>\nArabian nights. The kids loved these. We did several of the projects that a=\r<br/>\nre a part of <br/>\nSOTW including a Roman banner, Chinese lanterns and clay pots. We also look=\r<br/>\ned at maps.<br/>\n<br/>\nArt<br/>\nC loves art so we watched the Sister Wendy video series again. We visited t=\r<br/>\nhe art museum <br/>\nmany times and she took art at the co-op. She&#39;s prolific with design type d=\r<br/>\nrawings <br/>\npreferring them to portraits and people.<br/>\n<br/>\nFilms/TV<br/>\n&quot;Pride and Prejudice&quot;<br/>\n&quot;Lord of the Rings: Return of the King&quot; (and a repeat of the whole trilogy =\r<br/>\nincluding hours <br/>\nand hours and hours of behind the scenes material about film making, script=\r<br/>\n writing etc.)<br/>\n&quot;Harry Potter and the Prisoner of Azkaban&quot;<br/>\n&quot;Newsies&quot; (musical about the history of newspapers in the late 1800s in NYC=\r<br/>\n)<br/>\n&quot;Tornadoes&quot;  History of tornadoes<br/>\n&quot;Sinbad&quot;  she loves mythology so we had fun with this since it related to =\r<br/>\nour reading of <br/>\nthe 1001 Arabian Nights.</div>","specialLinks":[]}],"prevTopicId":97139,"nextTopicId":97739}}