{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Helen","from":"Helen &lt;Helen@...","replyTo":"LIST","senderId":"1qFKteWYkoKQ-BHOvepGELuMdCmuJGT9l9s9MUA7Xw5iErnggU-Bs7eVPNHNQOuBVQrK8HUtSIxaHiID0nN1QD7VwcM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"SPECIAL REPRINT - HSLDA  Study:  Embarrassing and Dangerous","postDate":"929059318","msgId":925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43Mi45MjUuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":924,"nextInTime":926,"topicId":925,"numMessagesInTopic":0,"msgSnippet":"SPECIAL REPRINT - HSLDA  Study:  Embarrassing and Dangerous A new study of a narrow segment of the homeschooling community was recently designed, financed, and","messageBody":"<div id=\"ygrps-yiv-1880845822\">SPECIAL REPRINT - HSLDA  Study:  Embarrassing and Dangerous<br/>\n<br/>\nA new study of a narrow segment of the homeschooling community was recently<br/>\ndesigned, financed, and promoted by the Home School Legal Defense<br/>\nAssociation (HSLDA). Both common sense and an analysis based on criteria<br/>\nused by social scientists show that this study is seriously flawed, but<br/>\nmost of the report of the study, including its &quot;Summary of Major Findings,&quot;<br/>\nsays the findings apply to homeschoolers without qualification.<br/>\n<br/>\nThis study has the potential to undermine our homeschooling freedoms by<br/>\npresenting a very narrow and limiting stereotype of what a homeschooler<br/>\nshould be and by providing assistance to critics of homeschooling who want<br/>\nto increase the regulation of homeschoolers. Please read this Special<br/>\nReprint, and share it with your friends, support group members, email<br/>\nlistmembers, and other interested parties. Please note: If you wish to<br/>\nshare this information with others via your support group or local library<br/>\nwe request that you share it in its entirety, referencing the source and<br/>\ncredits.<br/>\n<br/>\nThis Special Reprint was originally published in the July-August 1999 issue<br/>\nof Home Education Magazine (Taking Charge, page 12) and has been made<br/>\navailable by the column authors and the publishers of Home Education<br/>\nMagazine.<br/>\n<br/>\nAdditional PDF copies are available online at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/dangerous-study.pdf\">http://www.home-ed-magazine.com/dangerous-study.pdf</a><br/>\n<br/>\nThis Reprint is available via email by sending an message to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Lists@...\">HEM-Lists@...</a> with the words &quot;dangerous-study&quot; in the<br/>\nsubject line.<br/>\n<br/>\nFor ftp access go to: ftp://home-ed-magazine.com/study/dangerous-study.txt<br/>\n<br/>\nFor a copy of the July-August 1999 issue of Home Education Magazine<br/>\ncontaining the original Taking Charge column send $4.50 to: Home Education<br/>\nMagazine, PO Box 1083, Tonasket, WA 98855.<br/>\n<br/>\nIf you wish to share this information with others via your support group or<br/>\nlocal library we request that you share it in its entirety, referencing the<br/>\nsource and credits.<br/>\n<br/>\n**********<br/>\n<br/>\nKEY POINTS<br/>\n<br/>\nA study of homeschooling families was recently designed, financed, and<br/>\npromoted by HSLDA.  However, as homeschoolers, we should not use this<br/>\nstudy, publicize it in our newsletters, or send copies to legislators or<br/>\nthe media for several reasons.<br/>\n<br/>\n(1)  The sample used in this study is so narrow and unrepresentative of the<br/>\nhomeschooling population that its findings can only be applied to the<br/>\nhomeschoolers who participated in the study.  Despite this fact, most of<br/>\nthe report of the study, including its &quot;Summary of Major Findings,&quot; says<br/>\nthe findings apply to homeschoolers without qualification.  The result is<br/>\nan inaccurate and dangerous report.  (See Part II.)<br/>\n<br/>\n(2)  The study undermines our homeschooling freedoms in several ways.<br/>\n<br/>\n*  The study increases the likelihood that homeschoolers will be required<br/>\nto take state-mandated standardized tests.  People who are pushing for<br/>\nincreased state regulation of homeschoolers can say, &quot;Look.  This study<br/>\nshows that homeschoolers don&#39;t mind taking standardized tests required of<br/>\npublic school students.  So let&#39;s require them.&quot;<br/>\n<br/>\n*  The study measures homeschooling by the standards of conventional<br/>\neducation:  standardized test scores, money spent on educational materials,<br/>\nfamily income, parents&#39; education, teacher certification, etc.  Most of us<br/>\nare homeschooling so we can provide our children and our society with an<br/>\nalternative to conventional education.  We do not want to be required to<br/>\nuse these standards.<br/>\n<br/>\n*  For additional information, see Part III.<br/>\n<br/>\nIt is hard to believe that this study was designed, financed, and promoted<br/>\nby a homeschooling organization, but it&#39;s a fact worth keeping in mind as<br/>\nwe decide which organizations we will join and support as we continue the<br/>\nwork we must to do maintain our homeschooling freedoms.  See Part IV.<br/>\n<br/>\n****************************************<br/>\n****************************************</div>","specialLinks":[]}],"prevTopicId":720,"nextTopicId":938}}