{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":128153256,"authorName":"shirlinda_momof3","from":"&quot;shirlinda_momof3&quot; &lt;savahl@...&gt;","profile":"shirlinda_momof3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Interesting encounter today","postDate":"1268583816","msgId":52054,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuajJpOCtyNGNxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuZTdzaSs0YTFsQGVHcm91cHMuY29tPg=="},"prevInTopic":51988,"nextInTopic":0,"prevInTime":52053,"nextInTime":52055,"topicId":51988,"numMessagesInTopic":0,"msgSnippet":"That is awesome!  It is always nice when people share our opinions of public school. ;) We also get compliments on our children s behavior in public.  My","messageBody":"<div id=\"ygrps-yiv-726662168\">That is awesome!  It is always nice when people share our opinions of public school. ;) We also get compliments on our children&#39;s behavior in public.  My husband is very involved in our kids&#39; lives; and I feel very blessed for this.  We have always unschooled and will continue to do so until there is a school environment that can match our loving home.  I do not see that happening anytime soon.  I know my kids would not survive in the current public or private school settings.  They are too open and friendly.  I have no doubt that their personalities would be altered for the worse if we were to choose that route for their education.<br/>\n<br/>\nCongrats on finding not only a great restaurant, but a homeschool-friendly one as well!</div>","specialLinks":[]},{"userId":343678504,"authorName":"goodgirl659","from":"&quot;goodgirl659&quot; &lt;daisyeyes@...&gt;","profile":"goodgirl659","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Interesting encounter today","postDate":"1268425426","msgId":51988,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZTdzaSs0YTFsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":52054,"prevInTime":51987,"nextInTime":51989,"topicId":51988,"numMessagesInTopic":0,"msgSnippet":"I went to town today with my two girls (10&11), my nephew (4), and my husband. It was about 12 so we went to a local privately owned sub shop that we resently","messageBody":"<div id=\"ygrps-yiv-1963890358\">I went to town today with my two girls (10&11), my nephew (4), and my husband. It was about 12 so we went to a local privately owned sub shop that we resently fell in love with. I am a pretty quiet person as far as chatting up people in town. I leave that to my husband who never meets a stranger. Anyways the owner at the shop has an accent so I cant really tell where he is from or what he is saying very well.<br/>\n<br/>\nOk to the topic of the email. LOL Today we go there and he asked if the kids were out of school today. We said that we home schooled (moving into unschooling) them. His face lit up and he said that he and his wife had home schooled their children. He kept saying dont send them to public school. That we would regret it if we did. He said that he home schooled them thru their elementary years and once they were in middle school and high school it has been a nightmare. He said they finally put them in a local private school but he said its still hard to deal with. He said that his middle schooled child informed her parents that the teachers in her school were going to the restrooms with the children to make sure they were safe and behaving. That &quot;bad stuff&quot; was going on in the restrooms in the schools systems and that they werent aware of it until their daughter told them.<br/>\n<br/>\n He couldnt say much about it because my kids were sitting there and to be honest I have a hard time understand what he is saying but this is what I got from the most part. I am sure its sexual activity, fighting, and drug use all together tho. I have heard from a group of teens here and there that that kind of stuff goes on in the schools around here anyways. I mean it did when I was in public school so I am sure its worse out there now.<br/>\n<br/>\nHe was also talking about how he has a B student and an A student and how their school (not sure if he was talking about the public or the private) showed a lot of favoritism towards the A student. He was talking about how the kids are running the schools as far as doing what they want and the schools were only interested themselves looking good and that favored the children who could keep their scores up. He kept just saying dont give up and quit like they did. Keep going with it or you will regret it. Things like that.<br/>\n<br/>\nI have to say I felt great.My girls are always getting compliments in town about how well behaved they are. Its nice to meet a fellow supporter out there. I just thought I would share this story tho because it lifted my spirits to know that I was doing the right thing. I couldnt imagine putting my kids in that kind of environment. I have some other nephews and a niece and when they entered public school their whole personality changed. I was just talking about that the other day. About how they dont play very well, their manners went out the window and home and in public, and they are so moody and rude. I think its because they have so many kids to deal with and then arent free to take a break when they need, go to the bathroom when they need to, or even be talked to on a personal level.<br/>\n<br/>\nMy husband is pretty uninvolved with our kids. He has his own agenda to give all of his attention too (thats another story tho) but he doesnt know anything about our kids or what I do with them. Even he seemed like it scared him to death to know that the girls could be in that kind of place. He did give me the credit that was due for taking on this role with the girls. He knew he couldnt keep up with acting like he knew what he was talking about. LOL I have to say tho I felt great :)</div>","specialLinks":[]}],"prevTopicId":52015,"nextTopicId":52028}}