{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I need inspiration","postDate":"1112282332","msgId":21921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyN2NhM2NmZTc0OGEwOGJkOWJhOTJjZThlZDhlMWM5QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDI0ZjlmNzA5NTkzZmU2Mzk4MDYzYTFkMzM0MzM0ZDg0QGNveC5uZXQ+","referencesHeader":"PGQyZGQxNSs4ZjB0QGVHcm91cHMuY29tPiA8MjRmOWY3MDk1OTNmZTYzOTgwNjNhMWQzMzQzMzRkODRAY294Lm5ldD4="},"prevInTopic":21917,"nextInTopic":0,"prevInTime":21920,"nextInTime":21922,"topicId":21910,"numMessagesInTopic":0,"msgSnippet":"... Maybe the others, those whose lives look more exiting, are people who view the mundane things, the ordinary family-centered everyday things, as more","messageBody":"<div id=\"ygrps-yiv-1580113164\"><blockquote><span title=\"ireply\">&gt;&gt;  It just seems like everyone<br/>\n&gt;&gt; else has more exciting things going on.<br/>\n<br/>\n </span></blockquote>Maybe the others, those whose lives look more exiting, are people who <br/>\nview the mundane things, the ordinary family-centered everyday things, <br/>\nas more exciting? Maybe it is a difference in perspective?<br/>\n<br/>\nIt really makes a huge difference how the parent is feeling about what <br/>\nthe kids are doing.<br/>\n<br/>\nMy sister inadvertently taught me this when her now-24 yo son was only <br/>\nabout 4 years old. They had old very beat-up furniture and her son, <br/>\nAlex, was standing next to a couch with holes in it. He was pulling out <br/>\nlittle bits of stuffing and rolling it in his fingers, feeling the <br/>\ntexture, stuffing it back in, pulling out another tuft, feeling it, and <br/>\nso on. He had a faraway look in his eyes and was clearly really focused <br/>\non experiencing the sensation of the texture of those tufts of couch <br/>\nstuffing.<br/>\n<br/>\nShe and I walked in and saw him at the same moment. MY reaction would <br/>\nhave been to stop him from pulling stuffing out of the old couch. Julie <br/>\nstopped and smiled and said, quietly to me, &quot;Look at that - he is <br/>\nhaving such a deep sensual experience just with a bit of stuffing from <br/>\nan old couch. How wonderful!&quot;<br/>\n<br/>\nAnother parent might have complained, &quot;My kid is so bored he&#39;s <br/>\nliterally pulling the stuffing out of our old couch. That&#39;s the best <br/>\nthing he can find to do?&quot;<br/>\n<br/>\nThis might sound sort of phony or silly and unimportant - I&#39;m just <br/>\nrecommending that people look at what their kids ARE doing and see if <br/>\nthey can change their own thinking about it - see it in the best <br/>\npossible way. It doesn&#39;t change what they&#39;re doing, but it changes the <br/>\n&quot;tone&quot; in the home and that is so all-important it can&#39;t be <br/>\noveremphasized.<br/>\n<br/>\nI guess, to be honest, I don&#39;t think people who are negative, <br/>\npessimistic, or cynical are going to make great unschooling parents and <br/>\nthat if they know themselves to be that way, they owe it to their kids <br/>\nto work on being more positive, optimistic, and especially at not <br/>\nexpressing even minimal scorn. They&#39;ll do better by choosing to be more <br/>\nchild-like themselves, more filled with wonder at even little ordinary <br/>\naspects of life.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":136227309,"authorName":"deirdreaycock","from":"&quot;deirdreaycock&quot; &lt;aycock@...&gt;","profile":"deirdreaycock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I need inspiration","postDate":"1112240648","msgId":21917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyZnJtOCtrZTJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQyZGQxNSs4ZjB0QGVHcm91cHMuY29tPg=="},"prevInTopic":21913,"nextInTopic":21921,"prevInTime":21916,"nextInTime":21918,"topicId":21910,"numMessagesInTopic":0,"msgSnippet":"... feel ... Amie - You could be describing my kids, ds 12 and dd 10.  Sometimes when one interest is winding down, and the new interest hasn t started yet, I","messageBody":"<div id=\"ygrps-yiv-2064899791\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;mascire2&quot; &lt;amiersa2@c...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; I need some inspiration. I have almost 8 year old twin boys. I <br/>\n </span></blockquote>feel <br/>\n<blockquote><span title=\"ireply\"> &gt; like they are bored, and quite frankly, so am I. <br/>\n<br/>\n&gt; Any inspiration you can offer me? Please?!<br/>\n&gt; <br/>\n&gt; Thank you!<br/>\n&gt; Amie<br/>\n<br/>\n </span></blockquote>Amie - You could be describing my kids, ds 12 and dd 10.  Sometimes <br/>\nwhen one interest is winding down, and the new interest hasn&#39;t <br/>\nstarted yet, I hear them say they are bored.  But they don&#39;t want to <br/>\ngo anywhere, and the things I suggest don&#39;t interest them.  But I <br/>\njust go about my business (my busy-ness), checking in with them <br/>\nfrequently during the day, and before I know it they are totally <br/>\ninto something new.  Now, that something isn&#39;t looking up <br/>\ninformation about whales or volcanoes or dinosaurs or anything <br/>\nschooly, but I can assure you, they are using their brains, their <br/>\ncreativity.  <br/>\n<br/>\nPretend they are on summer vacation--one that never ends.  That <br/>\nusually helps me because I can still remember what summer vacation <br/>\nfelt like.  About a week or two into it, I would get bored, <br/>\nrestless.  And then I would realize that I had weeks and weeks to do <br/>\nwhatever I wanted!!!  And I could do nothing at all if I wanted!!!  <br/>\nWere your summers like that?  I loved it.  My kids have it even <br/>\nbetter than that &#39;cause they have a grown-up (me) at their beck and <br/>\ncall to help them bake those cookies they are in the mood for, or <br/>\nsit down and chat with them, and cheer them on when they hit the <br/>\nnext level with a video game they have been working on.   Both my <br/>\nparents were gone all day to work and I stayed home with a <br/>\nbabysitter and 3 siblings.  <br/>\n<br/>\nThe amazing thing about unschooling is that &quot;doing nothing&quot; is so <br/>\nproductive.  I think I have interesting, educated kids, and they got <br/>\nthat way playing video games, playing with cars and stuffed animals, <br/>\nwatching cartoons on TV.  I don&#39;t know what you visualize other <br/>\nunschooled kids doing all day, but I can assure you mine aren&#39;t  <br/>\nresearching ancient Egypt.   My kids know about pyramids and <br/>\nmummies, and I can&#39;t tell you how!  I read Smithsonian magazine <br/>\nevery month, but I have never seen them so much as flip the pages of <br/>\nit.   <br/>\n<br/>\nGood luck!<br/>\nDeirdre in Alabama</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I need inspiration","postDate":"1112207373","msgId":21913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMy41ZTQ5ZjUyNy4yZjdjNGEwZEBhb2wuY29tPg=="},"prevInTopic":21912,"nextInTopic":21917,"prevInTime":21912,"nextInTime":21914,"topicId":21910,"numMessagesInTopic":0,"msgSnippet":"Good suggestions so far. Here s a list new to my site, by Deb Lewis.  It s a far-north-winter list, but still... http://sandradodd.com/strew/deblist If you re","messageBody":"<div id=\"ygrps-yiv-1816811433\">Good suggestions so far.<br/>\n<br/>\nHere&#39;s a list new to my site, by Deb Lewis.  It&#39;s a far-north-winter list, <br/>\nbut still...<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strew/deblist\">http://sandradodd.com/strew/deblist</a><br/>\n<br/>\nIf you&#39;re pretty new to unschooling, maybe look again at deschooling:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nWill your boys watch movies with you?  The more common knowledge you have <br/>\nbetween and among you--music, jokes, sights, experiences--the better your <br/>\nrelationship will be, the more conversant you&#39;ll be in their lives.  Hang out with <br/>\nthem and do what they want to do rather than try to draw them out to do what you <br/>\nwant to do.  BE with *them.*<br/>\n<br/>\nWhen people say &quot;be with them&quot; they too often emphasize the &#39;with,&#39; but I <br/>\nthink the BEing is the most important part.   Be interested with them and excited <br/>\nwith them and sad with them.  Be with them emotionally and intellectually, at <br/>\ntheir level.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S","from":"&quot;Angela S&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] I need inspiration","postDate":"1112183814","msgId":21912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMzMwMTE1NjUzLlVGWloyMTkyLm10YTkuYWRlbHBoaWEubmV0QGxlaWdoPg==","inReplyToHeader":"PDI0ZjlmNzA5NTkzZmU2Mzk4MDYzYTFkMzM0MzM0ZDg0QGNveC5uZXQ+"},"prevInTopic":21911,"nextInTopic":21913,"prevInTime":21911,"nextInTime":21913,"topicId":21910,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1664039586\">&lt;&lt;Mine *hated* group activities; if the outing was a field trip with <br/>\nother homeschoolers, they wouldn&#39;t go.  They preferred to go at their <br/>\nown pace, lingering as long as they wanted or skipping other parts of, <br/>\nsay, a museum; waiting for other kids was torture.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nMy kids were never big on group activities either.  They would only want to<br/>\ngo to a group thing once in a while (if they really thought they&#39;d love the<br/>\nplace) and only if it was something that we couldn&#39;t do without a group.<br/>\nSometimes things are much more affordable with a group too.  <br/>\n<br/>\n <br/>\n<br/>\nUnschooling isn&#39;t just about going places.  It&#39;s also about exposing them to<br/>\nthings through books, movies, conversation, TV, etc.  It felt to me that my<br/>\nkids didn&#39;t have a passion for a long time.  I&#39;d see other homeschoolers who<br/>\ndid all these great things that they were passionate about (karate, dance,<br/>\nvolunteering, etc.) and it seemed like my kids just played, for a long time.<br/>\nWe didn&#39;t go to a LOT of things then, but we did plod along, going to the<br/>\nthings that interested the kids here and there.  Like you, I felt it was my<br/>\njob to expose them to stuff but it was only fun if they wanted to be there.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nWell, one trip to a riding stable and the kids found their passion and we&#39;ve<br/>\nbeen on a great ride ever since.  :-)  Before the horse obsession, we played<br/>\nlots of board games, played outside a lot, (in winter cross country skiing,<br/>\nsnow shoeing, sliding), (in summer, camping, swimming, going to beaches,<br/>\nlakes, state parks, etc.), we walked to the farms nearby a lot to visit the<br/>\nanimals, read aloud a lot, and the kids just played pretend a lot, and we<br/>\ndid the occasional field trip (sometimes alone, sometimes with a group).<br/>\nPost horse obsession, we do the horse thing twice a day and fit the other<br/>\nstuff in around the edges if we have time.  Some things my kids enjoyed<br/>\ndoing alone were local animal rescues/parks, forts, museums, children&#39;s<br/>\nmuseums, going on picnics in the woods, hiking small mountains, swimming<br/>\nwhere we had a membership, cooking, gosh, I can&#39;t remember what else.  Some<br/>\nthings we did with groups in the past were theater, small zoo, art class,<br/>\ngoing to the ballet, stable tour, hiking, playing baseball, going to living<br/>\nhistory places (did that alone too), can&#39;t think what else right now, but a<br/>\nfair amount of things. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We rarely even do anything with them. And there are a<br/>\n&gt; couple of boys that they do enjoy playing with when we do go. So, I<br/>\n&gt; don&#39;t get it. I know I don&#39;t want them to go to school, but at the<br/>\n&gt; same time, I am not enjoying this &quot;journey&quot; so far.<br/>\n<br/>\n <br/>\n<br/>\n </span></blockquote>What about having the kids over to play, rather than seeing them in a group?<br/>\nI say, just try to enjoy your day.  Follow your own passions.  Make<br/>\nopportunities available to the boys and they will find their passion one day<br/>\nand if they never have a passion that&#39;s o.k. too.  They might just enjoy<br/>\ndoing a lot of different things or just using their imaginations for a long<br/>\ntime.  <br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":99944316,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;ikonstitcher@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I need inspiration","postDate":"1112169260","msgId":21911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0ZjlmNzA5NTkzZmU2Mzk4MDYzYTFkMzM0MzM0ZDg0QGNveC5uZXQ+","inReplyToHeader":"PGQyZGQxNSs4ZjB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGQyZGQxNSs4ZjB0QGVHcm91cHMuY29tPg=="},"prevInTopic":21910,"nextInTopic":21912,"prevInTime":21910,"nextInTime":21912,"topicId":21910,"numMessagesInTopic":0,"msgSnippet":"... Some examples of what you think they would enjoy, of what you consider exciting new things to learn about, please? ... Let Them Be Bored.  They ll find","messageBody":"<div id=\"ygrps-yiv-1923900313\">On Mar 29, 2005, at 9:21 PM, mascire2 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I need some inspiration. I have almost 8 year old twin boys. I feel<br/>\n&gt; like they are bored, and quite frankly, so am I. I wholeheartedly<br/>\n&gt; agree and understand unschooling, but it just doesn&#39;t seem to be<br/>\n&gt; working here. My kids are reluctant to try new things that I<br/>\n&gt; suggest, and usually if I plan something(that I really think they<br/>\n&gt; would enjoy)  it turns into a fight as to whether we will go. So, I<br/>\n&gt; usually give up. I just don&#39;t feel like they are finding all of<br/>\n&gt; these exciting new things to learn about, asking me to help them<br/>\n&gt; find information,etc.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Some examples of what you think they would enjoy, of what you consider <br/>\nexciting new things to learn about, please?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know that they are learning, but it just seems like they are<br/>\n&gt; bored, and I am not sure what to do.<br/>\n<br/>\n </span></blockquote>Let Them Be Bored.  They&#39;ll find something to do.  Boredom is a great <br/>\ncatalyst to learning.  In the meantime, you find something interesting <br/>\nto do.  Model self-starting.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t want to push them into<br/>\n&gt; doing things, but at the same time, how do they learn about things<br/>\n&gt; that they might enjoy if we are not exposing them to new things?<br/>\n&gt; This is where I get confused. It seems I should be constantly<br/>\n&gt; exposing them to new things,<br/>\n<br/>\n </span></blockquote>Why?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  but how do I do this if they complain<br/>\n&gt; about going places.<br/>\n<br/>\n </span></blockquote>My kids always hated going places, too.  They were reluctant to leave <br/>\nwhatever they were doing in order to do something else, including <br/>\neating meals.  Usually, they enjoyed an outing once they got there.  I <br/>\nhad to make sure they understood that they truly did have a choice; if <br/>\nthey didn&#39;t want to go, we didn&#39;t go, with no shaming repercussions for <br/>\nthat choice.  (I didn&#39;t buy tickets in advance to anything ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It seems they have an attitude about<br/>\n&gt; homeschoolers too. They say I don&#39;t want to go if we are going with<br/>\n&gt; the HS group.<br/>\n<br/>\n </span></blockquote>Mine *hated* group activities; if the outing was a field trip with <br/>\nother homeschoolers, they wouldn&#39;t go.  They preferred to go at their <br/>\nown pace, lingering as long as they wanted or skipping other parts of, <br/>\nsay, a museum; waiting for other kids was torture.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We rarely even do anything with them. And there are a<br/>\n&gt; couple of boys that they do enjoy playing with when we do go. So, I<br/>\n&gt; don&#39;t get it. I know I don&#39;t want them to go to school, but at the<br/>\n&gt; same time, I am not enjoying this &quot;journey&quot; so far.<br/>\n<br/>\n </span></blockquote>How long have you been living it?  Not &quot;doing&quot; it, but living it?  <br/>\nUnschooling has less to do with activities than with philosophy, I <br/>\nthink.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t like<br/>\n&gt; admitting that, but it is the truth. I know people that are<br/>\n&gt; unschooling IRL, but they struggle too. It just seems like everyone<br/>\n&gt; else has more exciting things going on.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Excitement is overrated.  Too much stimulation is just exhausting to <br/>\nsome of us, and is counter-productive for learning.  Long periods of <br/>\njust hanging out, daydreaming, contemplating, and digesting are <br/>\nessential.  What are these unschoolers you know struggling with?  And <br/>\nby unschoolers, do you mean the parents or the kids?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Any inspiration you can offer me? Please?!<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Read &quot;The Book of Learning and Forgetting,&quot; by Frank Smith.<br/>\n<br/>\nForget &quot;learning&quot; ;-)  You have lots of time; your boys should be <br/>\nspending it playing -- Humans learn by playing.  My 17 y.o. daughter <br/>\njust said to tell you &quot;let &#39;em outside to find bugs.&quot;  Bugs are great:  <br/>\nI have a spider living on the outside of my kitchen window; we&#39;ve <br/>\nwatched her catch and eat several large insects, and now she&#39;s guarding <br/>\nher egg sac.  We&#39;re looking forward to spiderlings.  Every fall we <br/>\nwatch the orb web spiders spin a new web each evening; my kids like to <br/>\ntoss moths into them (we also have a pet tarantula, I should confess!).<br/>\n<br/>\nIf your boys aren&#39;t into bugs, I&#39;m sure they have lots of other things <br/>\nthey like; let them show you, without you trying to direct them into <br/>\nsomething &quot;edumacational&quot; ;-)  (That&#39;s Homer Simpson, fyi.)<br/>\n<br/>\nHope that helps,<br/>\nNancy  (with a 17 y.o. dd and a 15 y.o. ds, both unschooled)</div>","specialLinks":[]},{"userId":133126509,"authorName":"mascire2","from":"&quot;mascire2&quot; &lt;amiersa2@...&gt;","profile":"mascire2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"I need inspiration","postDate":"1112160101","msgId":21910,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyZGQxNSs4ZjB0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":21911,"prevInTime":21909,"nextInTime":21911,"topicId":21910,"numMessagesInTopic":0,"msgSnippet":"I need some inspiration. I have almost 8 year old twin boys. I feel like they are bored, and quite frankly, so am I. I wholeheartedly agree and understand","messageBody":"<div id=\"ygrps-yiv-2055037985\">I need some inspiration. I have almost 8 year old twin boys. I feel <br/>\nlike they are bored, and quite frankly, so am I. I wholeheartedly <br/>\nagree and understand unschooling, but it just doesn&#39;t seem to be <br/>\nworking here. My kids are reluctant to try new things that I <br/>\nsuggest, and usually if I plan something(that I really think they <br/>\nwould enjoy)  it turns into a fight as to whether we will go. So, I <br/>\nusually give up. I just don&#39;t feel like they are finding all of <br/>\nthese exciting new things to learn about, asking me to help them <br/>\nfind information,etc. <br/>\n<br/>\nI know that they are learning, but it just seems like they are <br/>\nbored, and I am not sure what to do. I don&#39;t want to push them into <br/>\ndoing things, but at the same time, how do they learn about things <br/>\nthat they might enjoy if we are not exposing them to new things? <br/>\nThis is where I get confused. It seems I should be constantly <br/>\nexposing them to new things, but how do I do this if they complain <br/>\nabout going places. It seems they have an attitude about <br/>\nhomeschoolers too. They say I don&#39;t want to go if we are going with <br/>\nthe HS group. We rarely even do anything with them. And there are a <br/>\ncouple of boys that they do enjoy playing with when we do go. So, I <br/>\ndon&#39;t get it. I know I don&#39;t want them to go to school, but at the <br/>\nsame time, I am not enjoying this &quot;journey&quot; so far. I don&#39;t like <br/>\nadmitting that, but it is the truth. I know people that are <br/>\nunschooling IRL, but they struggle too. It just seems like everyone <br/>\nelse has more exciting things going on.<br/>\n<br/>\nAny inspiration you can offer me? Please?!<br/>\n<br/>\nThank you!<br/>\nAmie</div>","specialLinks":[]}],"prevTopicId":21902,"nextTopicId":21925}}