{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Carli","from":"&quot;Carli&quot; &lt;carli@...&gt;","replyTo":"LIST","senderId":"RVmR4r4XwjBmbCe7oYKT8R6qH95XkbHNUTDqLUWl5cvsTGPnggDdDp6cATNhm3RsrVWqRXYAIQeexQWTSG1S","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: breastfeeding - Stephanie, Bridget and Wendy","postDate":"955350428","msgId":7968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{},"prevInTopic":0,"nextInTopic":0,"prevInTime":7967,"nextInTime":7969,"topicId":7968,"numMessagesInTopic":0,"msgSnippet":"Tracy, thank you for sharing that article.  I will save it and pass it on to some of my friends.  It was very enlightening to me. ~Carli ... From: Tracy","messageBody":"<div id=\"ygrps-yiv-1536647881\">Tracy, thank you for sharing that article.  I will save it and pass it on<br/>\nto some of my friends.  It was very enlightening to me.<br/>\n~Carli<br/>\n<br/>\n----------<br/>\nFrom: Tracy Oldfield &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Tracy@...\">Tracy@...</a>-online.co.uk&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a><br/>\nSubject: [Unschooling-dotcom] Re: breastfeeding - Stephanie, Bridget and<br/>\nWendy <br/>\nDate: Sunday, April 09, 2000 9:21 PM<br/>\n<br/>\nIf this looks odd, it&#39;s cos it was 3 separate emails that I decided should<br/>\ngo together, but I don&#39;t want to spend time editing them now.  Hope no-one<br/>\nminds :-)<br/>\n<br/>\nBridget, I know what you mean.  I don&#39;t want to get offensive, but I don&#39;t<br/>\nmean that formula is &#39;just as good.&#39;  It&#39;s an inferior product, but babies<br/>\ncan still thrive on it, my own daughter, touch wood, has no physical<br/>\nproblems with it.  The point is that unless people take breastfeeding down<br/>\nfrom it&#39;s pedestal and say &#39;This is the natural thing to do,&#39; some people<br/>\nare going to hold it up as an unapproachable ideal, which I did to an<br/>\nextent with the general lifestyle portrayed in the Art of Breastfeeding (GB<br/>\nand NZ version from about 10 years ago.)  I was heartbroken when I couldn&#39;t<br/>\ncontinue breastfeeding Heather, partly because I&#39;d held it up so high. <br/>\nAnyway, I&#39;ve been sent the article I was talking about, I&#39;ll attach it.  If<br/>\nthe group doesn&#39;t accept attachments, I can send it privately to anyone who<br/>\nwants it, or if the consensus of the list agrees, I can cut-and-paste it to<br/>\nthe list.  It explains what I mean much better than I can :-)<br/>\n<br/>\nTracy<br/>\n<br/>\nPS  Support for parents interested in child-led weaning can be found at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:naturalweaners@egroups.com\">naturalweaners@egroups.com</a> <br/>\n<br/>\n--------------------------------------------------<br/>\n<br/>\nStephanie, you both deserve a big round of applause for being open to<br/>\ndiscussion, with your past experiences, and your dh&#39;s reservations about<br/>\nthe benefits.  I know you wanted the discussion closed, but I would like to<br/>\nadd a few more thoughts.  You don&#39;t have to read them if you don&#39;t want :-)<br/>\n <br/>\nI am glad that you have reached a decision that works for you both.  And<br/>\nwhile I understand the desire for the husband to bond with the child, I<br/>\nthink I have to point out that there are so many ways that we bond with our<br/>\nbabies, feeding is only one of them.  There are many breastfeeding fathers<br/>\nwho feel well-connected to their children, and their partners no doubt feel<br/>\nindebted for their commitment to their families&#39; well-being.  Yes,<br/>\nexpressing milk is the next best thing to breastfeeding, with, according to<br/>\nthe WHO other mothers&#39; expressed milk next and formula fourth and last on<br/>\nthe priority list.  I would add other mother breastfeeding (in cases where<br/>\nmaternal breastfeeding is not possible, rather than not desired) &#39;wet<br/>\nnursing,&#39; below maternal breastfeeding in this list, because there is much<br/>\nmore to breastfeeding than nutritional content.  This is what was so<br/>\nupsetting for me. I knew that while some babies have allergic reactions to<br/>\nformula, some babies suffer medical problems later in life due to<br/>\nbottlefeeding, I have not suffered any visible effects (yet) from being<br/>\nbottlefed.  I wanted my children to experience the whole experience of<br/>\nbreastfeeding, the skin contact, the physical developmental differences... <br/>\nI wanted to experience breastfeeding, the hormonal rush, the skin contact. <br/>\nIt was particularly important for me since Heather had spent time in SCBU<br/>\nthat I become the only person who could provide this for my daughter. <br/>\nOther people can do anything else for a baby, and in some societies, even<br/>\nbreastfeeding is widely shared.  But it is a very special thing for a<br/>\nmother to share with her baby, and I am glad that I experienced it, and<br/>\nstill do, with my second child.  Now, if only I could persuade her to<br/>\nstop.... &lt;g&gt;<br/>\n<br/>\nThanks for listening here, and I hope your dialogue continues, since I<br/>\nthink that parenting issues are never really closed.<br/>\n<br/>\nTracy<br/>\n<br/>\nPS  I have to admire your commitment to expressing, I found it to be very<br/>\ndifficult and did not produce enough to feed my daughter fully after a few<br/>\nweeks, even though I had provided for her completely while she was on the<br/>\nSCBU.<br/>\n<br/>\n-----------------------------------<br/>\n<br/>\nWendy, you&#39;re right, that&#39;s why I made the point that I don&#39;t speak for LLL<br/>\nearlier :-)<br/>\n<br/>\nBut I&#39;d be interested to know what exactly you think gave LLL a bad name,<br/>\neither on or off list.<br/>\n<br/>\nTracy</div>","specialLinks":[]}],"prevTopicId":7966,"nextTopicId":7950}}