{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Childrens rooms","postDate":"1067829669","msgId":83667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzUwMWMzYTFiOSQ4Y2QxZmVhMCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PGFjLjRhMjFkM2ZlLjJjZDcxYzI2QGFvbC5jb20+"},"prevInTopic":82796,"nextInTopic":0,"prevInTime":83666,"nextInTime":83668,"topicId":82769,"numMessagesInTopic":0,"msgSnippet":"We have made a (very) little bit of progress.  I decided to tackle my office this weekend.  I moved a bunch of stuff out, then put things back where I wanted","messageBody":"<div id=\"ygrps-yiv-1486483756\">We have made a (very) little bit of progress.  I decided to tackle my office this weekend.  I moved a bunch of stuff out, then put things back where I wanted them, threw some stuff away, and have stuff to give away.<br/>\n<br/>\nI would like to have the office be &quot;my&quot; room, but the girls want to have their desks in here too.  The room also has the hamsters, a piano and &quot;my&quot; computer.  (Gosh, I sound so greedy!)  Since there was so much room in here today, they both spent a bunch of time in here, but already it is messy again.  They did pick up some of it when I asked.  I did not say it, but I so felt like saying &quot;if you&#39;re going to have your stuff in my office then it has to always be kept clean!&quot;<br/>\n<br/>\nBesides the girl&#39;s rooms, all the other rooms have furniture that my husband really loves and isn&#39;t willing to part with.  It&#39;s not that I don&#39;t like it, it&#39;s just that I didn&#39;t pick it and due to sizes of furniture and shape of the house, I don&#39;t feel like I have too many options on how those rooms are furnished and arranged.  I did say something to Lisa about my wanting to feel like one room in the house is mine and she replied that I had my bedroom.  But it is one of the rooms that was arranged by dh for the most part.  It doesn&#39;t feel like &#39;my&#39; room.<br/>\n<br/>\nI had a conversation with dh about lightening up on the condition of the girl&#39;s rooms.  He doesn&#39;t go overboard with needing them super tidy, but hasn&#39;t bought into the idea of unchoring.  He thinks we need to &#39;teach&#39; them how to have their rooms a certain way.  He doesn&#39;t make time to help them though.  He thinks that is my job.<br/>\n<br/>\nLisa and I have began to work on her room.  I gave her a box to store things that she doesn&#39;t use anymore but doesn&#39;t want to give away either.  She does want me to help and is usually willing to try different things.<br/>\n<br/>\nJackie says she wants me to help, but poo poos just about every thing I suggest.  I had a couple extra storage cubes that I moved into her room, thinking that would be great for her stuffed animals.  She immediately saw how it could be a toy McDonalds!  I gotta love her imagination, but it ended up making her room more crowded rather than solving a storage problem.  Sigh....<br/>\n<br/>\nMary Ellen <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Childrens rooms","postDate":"1065964056","msgId":82796,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3Yy4yMTk1MmFkNi4yY2JhYWMxOEBhb2wuY29tPg=="},"prevInTopic":82795,"nextInTopic":83667,"prevInTime":82795,"nextInTime":82797,"topicId":82769,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/11/03 10:01:39 PM, mccluskieo@bellsouth.net writes: ","messageBody":"<div id=\"ygrps-yiv-1566319535\">In a message dated 10/11/03 10:01:39 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mccluskieo@...\">mccluskieo@...</a> writes:<br/>\n<br/>\n&lt;&lt; The big lesson I learned was to  buy very practical furniture.  No <br/>\n<br/>\nglass tables, everything with some storage.  This way the majority <br/>\n<br/>\nof furniture is dual functioning. &gt;&gt;<br/>\n<br/>\nA glass coffeetable serves a dual function if you have artists or <br/>\ncalligraphers who could use a light table.  Just set a desk lamp under it.   Those with <br/>\nheavy wooden frames and two separate panes of heavy glass (no glass edges to <br/>\nhurt kids) are in the thrift stores these days.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Childrens rooms","postDate":"1065963838","msgId":82795,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE5LjQ5YTBiZjQ4LjJjYmFhYjNlQGFvbC5jb20+"},"prevInTopic":82792,"nextInTopic":82796,"prevInTime":82794,"nextInTime":82796,"topicId":82769,"numMessagesInTopic":0,"msgSnippet":"When our kids were young and sharing a room, we couldn t afford cool plastic bins, but what we did was my  husband made a shelf designed to hold Xerox boxes,","messageBody":"<div id=\"ygrps-yiv-708034001\">When our kids were young and sharing a room, we couldn&#39;t afford cool plastic <br/>\nbins, but what we did was my  husband made a shelf designed to hold Xerox <br/>\nboxes, which we could get free.  We would put a picture of the kind of toy that <br/>\nwent in there on the box, and use them kind of like drawers.  The shelf was low <br/>\nenough to go under the window, strong enough for toddler boys to climb up on, <br/>\nand so they had the top to put stuff on, and there was the base (enclosed so <br/>\ntoys wouldn&#39;t go under) and two shelves, and a middle divider.  It could hold <br/>\ntwelve Xerox boxes, end in.  Usually it was some xerox boxes and some toys with <br/>\ntheir own boxes, or things stuffed in.   When a box wore out, we could <br/>\nreplace it with a better box.  A box could be pulled and and taken into the living <br/>\nroom or into the yard, left there a  while, used for storage in there, and then <br/>\npickup, and eventually taken back to the shelf.<br/>\n<br/>\nThat shelf is now in my sewing room, as we&#39;re in a bigger house and the kids <br/>\nhave their own rooms with other shelves and systems.<br/>\n<br/>\nWe still have some of those boxes, or their successors, with the same stuff <br/>\nin:  <br/>\n<br/>\n&quot;the costume box&quot; (not lives on a really high shelf, but still comes down a <br/>\nfew times a year==Kirby mined it for pirate parts before the anime convention <br/>\nlast month)<br/>\n<br/>\nthe dinosaur box (we pulled a two-headed dragon out of there as part of a <br/>\ngift for a party Holly went to in August==it never was a dinosaur anyway, but it <br/>\nwas closer to that than other box-contents)<br/>\n<br/>\nThe puppet box survives, still, full of hand puppets. It&#39;s in a shared <br/>\nstorage room, near the costumes.<br/>\n<br/>\nthe doll box<br/>\n<br/>\nWe have three boxes of &quot;McDonald toys&quot; now lidded and stacked.  We never used <br/>\nto use lids on the shelf--I have another shelf in my office which was <br/>\ndesigned to hold box lids, and I could sort projects so that I could clean and mess <br/>\nup my desk with different sets of stuff.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":159022987,"authorName":"Olga","from":"&quot;Olga&quot; &lt;mccluskieo@...&gt;","profile":"britcontoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Childrens rooms","postDate":"1065931231","msgId":82792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJtYWprdiszbG4zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMjQwMWMzOTA0YyQxZWVmMDE0MCQ2NDAxYThjMEBvZW1jb21wdXRlcj4="},"prevInTopic":82781,"nextInTopic":82795,"prevInTime":82791,"nextInTime":82793,"topicId":82769,"numMessagesInTopic":0,"msgSnippet":"Mary Ellen, Our old house was really small and we had lots of big furniture (everyone s hand-me-downs).  Minimizing furniture and clutter madea huge","messageBody":"<div id=\"ygrps-yiv-949453847\">Mary Ellen,<br/>\n<br/>\nOur old house was really small and we had lots of big furniture <br/>\n(everyone&#39;s hand-me-downs).  Minimizing furniture and clutter madea <br/>\nhuge difference.  Are you a pack rat?  Because that breeds clutter.  <br/>\nI would start with a major &quot;spring cleaning&quot; to at least reduce your <br/>\npiles.  It is painful, but it changes your enviornment more than <br/>\nanything.<br/>\n<br/>\nMy sons&#39; old room had them and all their stuff.  We bought the cheap <br/>\nwhite armoire/cabinet from home depot for about $100 (the really big <br/>\none).  I bought bins and put the majority of toys in there and a <br/>\nshelf in the closet and under the bed.  This way the clutter was not <br/>\nnoticable.  Just having doors on things makes the mess go away!  For <br/>\narts and crafts supplies hang a plastic shoe rack/holder over the <br/>\ndoor and you can put all the things in the pockets.  Same for the <br/>\nbathroom which can hold lots of little things the girls need <br/>\n(barettes, toothpaste, lotions, etc.)  Also, you can build a shelf <br/>\nin their rooms that goes across the perimeter of the room way up <br/>\nhigh for all the stuffed animals and toys they don&#39;t play with <br/>\nmuch.  That way it acts more as decor and less as mess.  For the <br/>\nbathroom, buy a magazine rack to hang on the wall and use some of <br/>\nthat vertical space instead of a basket taking up floor space.  <br/>\nPeople forget the vertical space, but even for there dolls it may <br/>\nhelp to hang a few shelves (maybe 3) where they can place them when <br/>\nthey are not playing with them and that way they are not cluttering <br/>\nup the floor.<br/>\n<br/>\nThe big lesson I learned was to  buy very practical furniture.  No <br/>\nglass tables, everything with some storage.  This way the majority <br/>\nof furniture is dual functioning.  It looks nice and hides things!  <br/>\nYou can put large baskets under the coffee or end tables for storage <br/>\nas well.  <br/>\n<br/>\nI hope this helps a bit!!<br/>\n<br/>\nOlga :)<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;nellebelle&quot; <br/>\n&lt;nellebelle@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I need some help in getting my house more organized.  I&#39;m de-<br/>\n </span></blockquote>choring and working on accepting the fact that it will never be <br/>\nhouse beautiful.  However, I am frustrated with it always looking <br/>\nsooo messy.  I am hoping that some reorganization will help the <br/>\nhouse look wonderfully lived in, rather than as if a tornado just <br/>\nhit.  We don&#39;t have a family room.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Each girl has her own room, tho they both sleep together in the <br/>\n </span></blockquote>one with the double bed.  The rooms are good size 12x12.  Closets <br/>\nare pretty standard.  Each closet has two low shelves and a hanging <br/>\nshoe rack.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Clothing is more or less under control, but I could use some ideas <br/>\n </span></blockquote>for how to store/display dolls, craft supplies/kits, and stuffed <br/>\nanimals.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; There is a small bathroom in between the rooms, which is also the <br/>\n </span></blockquote>guest bathroom, due to it&#39;s location.  The counter is tiny.  I hung <br/>\nan organizer on the back of the door, which helps a lot for <br/>\nassorted &quot;beauty supplies&quot;.  Towels fit under the sink, but not much <br/>\nmore.  There is a laundry basket and a basket of reading material in <br/>\nthere.  We have a stool in there, but it occurs to me that they <br/>\ndon&#39;t really need that anymore.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; We have a small office with 3 desks and a piano.  Each girl has a <br/>\n </span></blockquote>box and a file box, but still stuff ends up piled all over the <br/>\nfloor.  A small bookshelf hosts the printer, art supplies, and <br/>\noffice supplies.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I think we may have too much furniture, or perhaps just the wrong <br/>\n </span></blockquote>types.  To me, the house looks like it is wall to wall furniture.  A <br/>\nlot of it is antique mix and match stuff that was acquired through <br/>\nmy in-laws auction or hand me downs from his folks or mine.  When I <br/>\nthink about rearranging, I end up going in circles because anyplace <br/>\nI think to move something, already has something there.  Dh is very <br/>\nattached to most of the furniture.  I&#39;ve suggested selling some of <br/>\nthe pieces that we don&#39;t really use, but haven&#39;t gotten very far <br/>\nwith that idea.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My budget is limited, so I can&#39;t go out and buy too much to help <br/>\n </span></blockquote>with this project.  The garage is already stuffed.  I&#39;m thinking <br/>\nabout storing some things under the house.  It stays dry, but is <br/>\nreally dusty.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Any ideas?  Anybody want to share things you&#39;ve done to increase <br/>\n </span></blockquote>storage or better organize yours and your kid&#39;s stuff?<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Mary Ellen<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Childrens rooms","postDate":"1065920596","msgId":82781,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTkwMWMzOTA1YyQ5ZWFkZmYyMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDNkLjM2MWM3NGE2LjJjYjlkNDY0QGFvbC5jb20+IDwwMDI0MDFjMzkwNGMkMWVlZjAxNDAkNjQwMWE4YzBAb2VtY29tcHV0ZXI+IDwwMGExMDFjMzkwNTkkMWJlYjRiNDAkNjEwMWE4YzBAbGF1bmNobW9kZW0uY29tPg=="},"prevInTopic":82779,"nextInTopic":82792,"prevInTime":82780,"nextInTime":82782,"topicId":82769,"numMessagesInTopic":0,"msgSnippet":"Forgot one other thing that I love for the stuffed animals. The nets that hang from above in the corner of a room. If there are a lot of animals, you can hang","messageBody":"<div id=\"ygrps-yiv-340761577\">Forgot one other thing that I love for the stuffed animals. The nets that<br/>\nhang from above in the corner of a room. If there are a lot of animals, you<br/>\ncan hang a few, still have them displayed and easily accessible and yet<br/>\nstill out of the way.<br/>\n<br/>\nMary B.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolingtshirts.com\">http://www.homeschoolingtshirts.com</a></div>","specialLinks":[]},{"userId":10722572,"authorName":"Nora or Devereaux Cannon","from":"&quot;Nora or Devereaux Cannon&quot; &lt;dcannon@...&gt;","profile":"thatincase","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Childrens rooms","postDate":"1065919570","msgId":82779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTgwMWMzOTA1YSQzZjJiZDc0MCQyNzI4MjY0MkBkYnE1MjBiPg==","referencesHeader":"PDNkLjM2MWM3NGE2LjJjYjlkNDY0QGFvbC5jb20+IDwwMDI0MDFjMzkwNGMkMWVlZjAxNDAkNjQwMWE4YzBAb2VtY29tcHV0ZXI+"},"prevInTopic":82778,"nextInTopic":82781,"prevInTime":82778,"nextInTime":82780,"topicId":82769,"numMessagesInTopic":0,"msgSnippet":"A couple of things occur to me from what you posted.  First would the girls be able to share the one bed room as a bedroom, while converting the other to","messageBody":"<div id=\"ygrps-yiv-58913191\">A couple of things occur to me from what you posted.  First<br/>\nwould the girls be able to share the one bed room as a bedroom,<br/>\nwhile converting the other to play/workspace of their own?  4<br/>\ndesks and a piano in one room is an invitation to feeling<br/>\nclutter.  If you can consolidate the bedrooms, take the non<br/>\nsleeping one and add lots of shelves, with plastic see through<br/>\nbins for storage.  It is easy to take a bin of all the clay<br/>\nsupplies or all the doll clothes down and use it where ever the<br/>\nmood strikes.  And it is easy to put them all back in the bin<br/>\nfrom which they came.  Zip lock Freezer bags are a great adjunct<br/>\nto those, for further sub dividing.  Also look at where<br/>\n&quot;clutter&quot; accumulates and what the clutter is.  A box and a file<br/>\ndrawer may not be useful ways to organize what they are doing at<br/>\ntheir desks - evaluating what doesn&#39;t make it back to the box<br/>\nmight help.  A bulletin board might work better for them - or a<br/>\nvertical file holder - or an empty shelf for more acceptable<br/>\ntemporary storage than the floor provides.<br/>\n<br/>\nWe have a bin of &quot;display items&quot; for dd&#39;s room (actually for a<br/>\nnumber of rooms, but we are talking about kids, LOL).  There is<br/>\nlimited space for &quot;knick-knacks&quot; so the bin lets her rotate the<br/>\ndisplay and also holds holiday specific objects so she can<br/>\nre-decorate for the season at will.  A duffle bag hanging in the<br/>\ncloset holds a wonderful number of stuffed animals too beloved<br/>\nto part with but too numerous to display.<br/>\n<br/>\nWould a vanity in the bedroom reduce the need for beauty<br/>\nsupplies in the bathroom - and the storage problem?  All that is<br/>\nreally necessary for a vanity is a small console table and a<br/>\nmirror - light strips are nice, but if you cover the table with<br/>\na froth of pretty girl fabric and put a similarly draped stool<br/>\nin from of it, it will meet the needs until serious make up<br/>\napplication is underway.  Get a piece of glass cut to match the<br/>\nsize of the top, then let them arrange some brushes, hand<br/>\nmirrors and perfumes on top - the rest goes in a caddy under the<br/>\ntable - one for each.  I call mine, rescued from a far too small<br/>\nto be useful linen closet, my altar to estrogen, LOL.  Quite<br/>\nimportantly for my messiness, there is something sorta  charming<br/>\nabout spilled powder on a vanity that is entirely missing when<br/>\npowder is spilled on the sink counter and left.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;nellebelle&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nellebelle@...\">nellebelle@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, October 11, 2003 5:55 PM<br/>\nSubject: [UnschoolingDiscussion] Childrens rooms<br/>\n<br/>\n<br/>\n| I need some help in getting my house more organized.  I&#39;m<br/>\nde-choring and working on accepting the fact that it will never<br/>\nbe house beautiful.  However, I am frustrated with it always<br/>\nlooking sooo messy.  I am hoping that some reorganization will<br/>\nhelp the house look wonderfully lived in, rather than as if a<br/>\ntornado just hit.  We don&#39;t have a family room.<br/>\n|<br/>\n| Each girl has her own room, tho they both sleep together in<br/>\nthe one with the double bed.  The rooms are good size 12x12.<br/>\nClosets are pretty standard.  Each closet has two low shelves<br/>\nand a hanging shoe rack.<br/>\n|<br/>\n| Clothing is more or less under control, but I could use some<br/>\nideas for how to store/display dolls, craft supplies/kits, and<br/>\nstuffed animals.<br/>\n|<br/>\n| There is a small bathroom in between the rooms, which is also<br/>\nthe guest bathroom, due to it&#39;s location.  The counter is tiny.<br/>\nI hung an organizer on the back of the door, which helps a lot<br/>\nfor assorted &quot;beauty supplies&quot;.  Towels fit under the sink, but<br/>\nnot much more.  There is a laundry basket and a basket of<br/>\nreading material in there.  We have a stool in there, but it<br/>\noccurs to me that they don&#39;t really need that anymore.<br/>\n|<br/>\n| We have a small office with 3 desks and a piano.  Each girl<br/>\nhas a box and a file box, but still stuff ends up piled all over<br/>\nthe floor.  A small bookshelf hosts the printer, art supplies,<br/>\nand office supplies.<br/>\n|<br/>\n| I think we may have too much furniture, or perhaps just the<br/>\nwrong types.  To me, the house looks like it is wall to wall<br/>\nfurniture.  A lot of it is antique mix and match stuff that was<br/>\nacquired through my in-laws auction or hand me downs from his<br/>\nfolks or mine.  When I think about rearranging, I end up going<br/>\nin circles because anyplace I think to move something, already<br/>\nhas something there.  Dh is very attached to most of the<br/>\nfurniture.  I&#39;ve suggested selling some of the pieces that we<br/>\ndon&#39;t really use, but haven&#39;t gotten very far with that idea.<br/>\n|<br/>\n| My budget is limited, so I can&#39;t go out and buy too much to<br/>\nhelp with this project.  The garage is already stuffed.  I&#39;m<br/>\nthinking about storing some things under the house.  It stays<br/>\ndry, but is really dusty.<br/>\n|<br/>\n| Any ideas?  Anybody want to share things you&#39;ve done to<br/>\nincrease storage or better organize yours and your kid&#39;s stuff?<br/>\n|<br/>\n| Mary Ellen<br/>\n|<br/>\n| [Non-text portions of this message have been removed]<br/>\n|<br/>\n|<br/>\n| ------------------------ Yahoo! Groups<br/>\nSponsor ---------------------~--&gt;<br/>\n| Rent DVDs Online - Over 14,500 titles.<br/>\n| No Late Fees & Free Shipping.<br/>\n| Try Netflix for FREE!<br/>\n| <a rel=\"nofollow\" target=\"_blank\" href=\"http://us.click.yahoo.com/JYdFFC/XP.FAA/ySSFAA/0xXolB/TM\">http://us.click.yahoo.com/JYdFFC/XP.FAA/ySSFAA/0xXolB/TM</a><br/>\n| --------------------------------------------------------------<br/>\n-------~-&gt;<br/>\n|<br/>\n| &quot;List Posting Policies&quot; are provided in the files area of this<br/>\ngroup.<br/>\n|<br/>\n| To unsubscribe from this send an email to:<br/>\n| <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n|<br/>\n| Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n|<br/>\n| Your use of Yahoo! Groups is subject to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n|<br/>\n|<br/>\n| </span></blockquote></div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Childrens rooms","postDate":"1065919088","msgId":82776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTEwMWMzOTA1OSQxYmViNGI0MCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDNkLjM2MWM3NGE2LjJjYjlkNDY0QGFvbC5jb20+IDwwMDI0MDFjMzkwNGMkMWVlZjAxNDAkNjQwMWE4YzBAb2VtY29tcHV0ZXI+"},"prevInTopic":82772,"nextInTopic":82778,"prevInTime":82775,"nextInTime":82777,"topicId":82769,"numMessagesInTopic":0,"msgSnippet":"I have a fairly large house so not sure if any of this will help. But when the 5 of us were in a much smaller house, I still made it all work and things were","messageBody":"<div id=\"ygrps-yiv-550483370\">I have a fairly large house so not sure if any of this will help. But when<br/>\nthe 5 of us were in a much smaller house, I still made it all work and<br/>\nthings were rather organized.<br/>\n<br/>\nI make a point to go through clothes at least twice a year and get rid of<br/>\nthings too small and those that are never worn, no matter if they fit or<br/>\nnot. I do the same thing with other closets, drawers and storage spaces. I<br/>\nget rid of anything not used within 6 months. (holiday decorations aside)<br/>\nI&#39;ll consign, sell or give things away that aren&#39;t used. It&#39;s just not worth<br/>\nthem taking up space. And I find most homes have tons of stuff in them that<br/>\nare hardly ever used. I don&#39;t believe in keeping something just in case it&#39;s<br/>\nneeded.<br/>\n<br/>\nThe other thing I love is storage crates and bins for the childrens things.<br/>\nBoth Joseph and Sierra have wooden shelving with plastic bins that go into<br/>\nthe shelving. Joseph keeps his in his room and Sierra&#39;s is in the playroom.<br/>\nThere are 4 rows with 3 open bins on each one. It&#39;s easy to throw toys in<br/>\nand yet keep certain ones separate.<br/>\n<br/>\nWe also have a stack of 3 plastic crates that are on wheels. Open also. Bins<br/>\nwith lids makes it harder to get things in and out. I have also bought<br/>\nindividual plastic crates that can stack and keep various things in them for<br/>\nthe kids. Not really big on shelves although we have one large set in the<br/>\nplayroom. I love the plastic storage bins for under the bed also. Each child<br/>\nhas two under their beds.<br/>\n<br/>\nThey take up small amounts of space and you can get tons of things in them<br/>\nwithout making them so cluttered the kids don&#39;t want to play with what&#39;s<br/>\ninside.<br/>\n<br/>\nMary B.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolingtshirts.com\">http://www.homeschoolingtshirts.com</a></div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Childrens rooms","postDate":"1065918511","msgId":82778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2YwMWMzOTA1OCRmMjhhYTQ4MCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDAwMDAwMWMzOTA1MCQzZjdlZTRkMCQzNDAwYThjMEByb2J5bm1hY2hpbmU+"},"prevInTopic":82776,"nextInTopic":82779,"prevInTime":82777,"nextInTime":82779,"topicId":82769,"numMessagesInTopic":0,"msgSnippet":"That would be so cool!  Lisa saw an ad for one that sends the parents out of town, then redoes the kid s room.  I ll see if I can find that.  It sounds like a","messageBody":"<div id=\"ygrps-yiv-1833004091\">That would be so cool!  Lisa saw an ad for one that sends the parents out of town, then redoes the kid&#39;s room.  I&#39;ll see if I can find that.  It sounds like a WIN WIN situation!<br/>\n<br/>\nMary Ellen <br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- I&#39;m not being facetious - what about getting on one of those TV makeover<br/>\n  shows - like &quot;Clean House&quot; (Style Network) or &quot;Organize This&quot; (HGTV?) -<br/>\n  that specialize in helping people declutter and reorganize, rather than<br/>\n  just redecorate.<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Childrens rooms","postDate":"1065915277","msgId":82772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMzOTA1MCQzZjdlZTRkMCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PDAwMjQwMWMzOTA0YyQxZWVmMDE0MCQ2NDAxYThjMEBvZW1jb21wdXRlcj4="},"prevInTopic":82769,"nextInTopic":82776,"prevInTime":82771,"nextInTime":82773,"topicId":82769,"numMessagesInTopic":0,"msgSnippet":" I m not being facetious - what about getting on one of those TV makeover shows - like Clean House","messageBody":"<div id=\"ygrps-yiv-915828016\">&lt;&lt;I need some help in getting my house more organized. &gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI&#39;m not being facetious - what about getting on one of those TV makeover<br/>\nshows - like &quot;Clean House&quot; (Style Network) or &quot;Organize This&quot; (HGTV?) -<br/>\nthat specialize in helping people declutter and reorganize, rather than<br/>\njust redecorate. <br/>\n<br/>\nRobyn Coburn<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Childrens rooms","postDate":"1065912943","msgId":82769,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjQwMWMzOTA0YyQxZWVmMDE0MCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDNkLjM2MWM3NGE2LjJjYjlkNDY0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":82772,"prevInTime":82768,"nextInTime":82770,"topicId":82769,"numMessagesInTopic":0,"msgSnippet":"I need some help in getting my house more organized.  I m de-choring and working on accepting the fact that it will never be house beautiful.  However, I am","messageBody":"<div id=\"ygrps-yiv-2036384764\">I need some help in getting my house more organized.  I&#39;m de-choring and working on accepting the fact that it will never be house beautiful.  However, I am frustrated with it always looking sooo messy.  I am hoping that some reorganization will help the house look wonderfully lived in, rather than as if a tornado just hit.  We don&#39;t have a family room.<br/>\n<br/>\nEach girl has her own room, tho they both sleep together in the one with the double bed.  The rooms are good size 12x12.  Closets are pretty standard.  Each closet has two low shelves and a hanging shoe rack.<br/>\n<br/>\nClothing is more or less under control, but I could use some ideas for how to store/display dolls, craft supplies/kits, and stuffed animals.<br/>\n<br/>\nThere is a small bathroom in between the rooms, which is also the guest bathroom, due to it&#39;s location.  The counter is tiny.  I hung an organizer on the back of the door, which helps a lot for assorted &quot;beauty supplies&quot;.  Towels fit under the sink, but not much more.  There is a laundry basket and a basket of reading material in there.  We have a stool in there, but it occurs to me that they don&#39;t really need that anymore.<br/>\n<br/>\nWe have a small office with 3 desks and a piano.  Each girl has a box and a file box, but still stuff ends up piled all over the floor.  A small bookshelf hosts the printer, art supplies, and office supplies.<br/>\n<br/>\nI think we may have too much furniture, or perhaps just the wrong types.  To me, the house looks like it is wall to wall furniture.  A lot of it is antique mix and match stuff that was acquired through my in-laws auction or hand me downs from his folks or mine.  When I think about rearranging, I end up going in circles because anyplace I think to move something, already has something there.  Dh is very attached to most of the furniture.  I&#39;ve suggested selling some of the pieces that we don&#39;t really use, but haven&#39;t gotten very far with that idea.<br/>\n<br/>\nMy budget is limited, so I can&#39;t go out and buy too much to help with this project.  The garage is already stuffed.  I&#39;m thinking about storing some things under the house.  It stays dry, but is really dusty.<br/>\n<br/>\nAny ideas?  Anybody want to share things you&#39;ve done to increase storage or better organize yours and your kid&#39;s stuff?<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":83664,"nextTopicId":83497}}