{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":129294861,"authorName":"christy_imnotred","from":"&quot;christy_imnotred&quot; &lt;christy_imnotred@...&gt;","profile":"christy_imnotred","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Day in the Life","postDate":"1094868639","msgId":99486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNodG1xditlOXBqQGVHcm91cHMuY29tPg=="},"prevInTopic":99431,"nextInTopic":0,"prevInTime":99485,"nextInTime":99487,"topicId":99389,"numMessagesInTopic":0,"msgSnippet":"... Anyone ... 6 ... Logan (5yo) woke up today around 10.  After some cuddling in bed, he said he wanted me to carry him downstairs so he could watch the Land ","messageBody":"<div id=\"ygrps-yiv-701015893\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &lt;dezigna@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;I would kind of like to read a few day-in-the-life accounts.  <br/>\n </span></blockquote>Anyone <br/>\n<blockquote><span title=\"ireply\"> &gt; care to share how their day went today?  (Particularly with a 5 or <br/>\n </span></blockquote>6 <br/>\n<blockquote><span title=\"ireply\"> &gt; or 7 year old?)&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Logan (5yo) woke up today around 10.  After some cuddling in bed, he <br/>\nsaid he wanted me to carry him downstairs so he could watch the Land <br/>\nBefore Time DVD we got from the library.  He watched it while I did <br/>\nsome catching up on the computer.  We both finished at the same time <br/>\nand I made lunch.  Frozen pizza for him, left over pasta for me.  <br/>\nWhile we ate lunch we played with play doh.  I rolled it out for him <br/>\nand he used cookie cutters to make designs.  We then played with some <br/>\nMicro Machine cars he got yesterday with his allowance.  He is really <br/>\ninto the little cars right now.  He has a half pipe thing for the <br/>\ncars, so we did tricks on that with our cars.  <br/>\n<br/>\nWe went to the library to pick up some stuff we had on reserve (some <br/>\nBarbara Sher books).  Logan played with some other little boys that <br/>\nwere at the library.  In the kids section of our library they have a <br/>\nbunch of Hot Wheels cars and a race track.  I looked through the DVDs <br/>\nwhile he played and was able to pick up 2 more Land Before Time and a <br/>\nbunch of Pokemon (his current obsession).  Just a week ago, the <br/>\nlibrary had almost no DVDs available.  I love it when the kids go <br/>\nback to school!  I was also able to find quite a few Pokemon chapter <br/>\nbooks, something else the library had none of a week ago.<br/>\n<br/>\nWe came home from the library and read 3 Mr. Putter and Tabby books, <br/>\none of them we read twice.  In one of the books the characters are <br/>\nbaking a cake, so Logan went back to the Playdoh and made cakes for <br/>\nus to eat.  We then read the next in the Andrew Lost series.  While <br/>\nreading it, I realized we never finished the previous book in the <br/>\nseries (no wonder we were confused).  Unfortunately, I already <br/>\nreturned the book to the library.  We had a long discussion about <br/>\nwhether to keep reading the one we already had or wait and get the <br/>\nprevious one tomorrow, read it and then the current one.  Logan <br/>\ndecided to go on with reading the current one.  So, I read the whole <br/>\nbook to him (took about an hour).  During our reading, Daddy came <br/>\nhome from work and started packing for his camping trip.  <br/>\n<br/>\nAfter I finished Andrew Lost, Logan wanted to watch one of the new <br/>\nLand Before Time DVDs.  DH and I ate dinner while Logan watched the <br/>\nDVD.  He ate after the DVD finished.  DH then put on the Nascar race, <br/>\nand Logan decided he really needed some rough play.  So we went into <br/>\nthe computer room and wrestled.  Wrestling turned into us being <br/>\ndinosaurs that were fighting.  Logan then requested I read him a <br/>\nMagic Schoolbus book I got at the library today.<br/>\n<br/>\nIt is 10pm now, after the race is over Logan wants to watch the Magic <br/>\nSchoolbus that I read to him (I have them all on tape).  So he will <br/>\nwatch that and we will head up to bed for some more reading.  Logan <br/>\nis currently karate fighting a dinosaur behind me.<br/>\n<br/>\nThis is a fairly typical day for us, except Logan hasn&#39;t played any <br/>\ncomputers games today.  He had me start a Magic Schoolbus game up for <br/>\nhim earlier today but he never played.  He got distracted by the <br/>\nPlaydoh.<br/>\n<br/>\nAs for his favorite websites, he really likes Neopets, Disney and <br/>\nPokemon.<br/>\n<br/>\nChristy O</div>","specialLinks":[]},{"userId":177721839,"authorName":"Game-Enthusiast","from":"&quot;Game-Enthusiast&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re: Day in the Life","postDate":"1094755739","msgId":99431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwOTA5MTg0ODU5LlpESEoyNDY5My5tdGExMy5hZGVscGhpYS5uZXRAbGVpZ2g+","inReplyToHeader":"PGNocGd0aytzNGdrQGVHcm91cHMuY29tPg=="},"prevInTopic":99406,"nextInTopic":99486,"prevInTime":99430,"nextInTime":99432,"topicId":99389,"numMessagesInTopic":0,"msgSnippet":"I have two girls who are 7 (8 in two weeks) and 9.5.  This is how today has gone so far.  Dd9 got up at about 7 am and woke me up and we got up together.  dd7","messageBody":"<div id=\"ygrps-yiv-1030997944\">I have two girls who are 7 (8 in two weeks) and 9.5.  This is how today has<br/>\ngone so far.  Dd9 got up at about 7 am and woke me up and we got up<br/>\ntogether.  dd7 was up a few minutes later.  She had found a dollar under her<br/>\npillow from the tooth fairy and put it in her money bag.  They both watched<br/>\nTV for an hour and shut it off at 8:00. While they watched TV, I served them<br/>\nthe breakfast they asked for.  (cereal)  Both girls came into the computer<br/>\nroom where I was finishing up reading emails and started playing Sims on<br/>\nseparate computers.  I headed down  to the basement to exercise while they<br/>\nplayed.  I exercised for 30 minutes and before I was done dd9 was down there<br/>\nwith me.  I cleaned the guinea pig cage before I came up and started a load<br/>\nof laundry.<br/>\n <br/>\nI came upstairs and made crepes for dh and I for breakfast.  Both girls had<br/>\nalready eaten. Now they were playing Breyer horses, which they do for hours<br/>\non end.  They played.  I ate and showered.  We made cookies later in the<br/>\nmorning and the girls also mixed up some old cereal to make food for their<br/>\nstuffed animals.  <br/>\n <br/>\nDd7, who sold some stuff on ebay, helped me box up the stuff to be shipped<br/>\nand then we spent far too long looking for a little hair brush that went<br/>\nwith one of the things she sold.  We couldn&#39;t find it and I decided it<br/>\nwasn&#39;t worth the dollar she earned to ruin our day looking for it all day<br/>\nlong. (After being a little grumpy then deciding I didn&#39;t have to be, it was<br/>\neasy to solve for only a dollar or less.) We emailed the buyer and asked if<br/>\nit would be ok to substitute another brush or if they would prefer their<br/>\nmoney back.  We talked about how if they are dissatisfied that they can<br/>\nleave bad feedback and that I would be upset by that.  Dd2 will now put<br/>\naside the things she sells once she lists them so she can find them when it<br/>\nis time to ship them.  &lt;lesson learned&gt;<br/>\n <br/>\nI made lunch for dh and I.  Dd7 ate carrots and cookies.  Dd9 hasn&#39;t eaten<br/>\nlunch yet and it&#39;s after 2 o&#39;clock.  Off and on over the course of the early<br/>\nafternoon both girls wrote emails from my email account to a friend.  Dh<br/>\ndecided to set them up their own email addresses and while he worked on<br/>\nthat, dd9 asked to play mail.  We each sit in different rooms and write<br/>\nnotes to each other and deliver them in our *mailboxes*.  Mine was a butter<br/>\nbox this time.  ;0)  We played that for maybe a half an hour.<br/>\n <br/>\nWhen dh was done setting up the new email accounts, they both spent an hour<br/>\nwriting emails to each other and to dh and I and to one friend.   I just<br/>\nfinally got a chance to sit down and read emails again.  I thought about<br/>\nwhat we&#39;d done so far today and realized it was a great unschooling day.  We<br/>\nwill go to the library sometime this afternoon because our movies and books<br/>\nare due.  We&#39;ll stop at the post office and ship the packages dd7 sold on<br/>\nebay.  We are kind of waiting to get payment on one so we can ship them all<br/>\nin one trip.<br/>\n <br/>\nJust got back from a small interruption as dd7 wanted me to help her<br/>\nremember how to knit.  She worked on a scarf last winter for her riding<br/>\ninstructor and she never finished it.  She wants to finish it to give her<br/>\nsoon.  It just took a minute to find the needles and remind her how to knit.<br/>\nShe&#39;s now working on that and dd9 is laying on the floor beside her finger<br/>\nknitting.<br/>\n <br/>\nThat&#39;s it so far.  Lots of learning going on today.  :0)  (the lost brush,<br/>\nSims, knitting, oh ya, we also half watched a movie called Animal Olympics<br/>\nwhich was due back to the library today which we hadn&#39;t watched yet, note<br/>\nwriting, email writing, playing, etc.)  <br/>\n <br/>\nSometime in there they did brush their teeth, but hair has yet to be done.  <br/>\n <br/>\nOh ya, this morning we also copied and pasted pictures of Breyer horses we<br/>\nfound on-line to a printable calendar we found on-line to make a riding<br/>\nschedule for the girls Breyer Riding instructors.<br/>\n <br/>\nThere is probably more that I missed, but that&#39;s one day in our life...so<br/>\nfar.  Some days are spent playing with friends, riding lessons, reading<br/>\naloud,  playing board games, swimming, camping, and on and on. They are all<br/>\nso different.  <br/>\n <br/>\n <br/>\n <br/>\nAngela <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle","from":"&quot;Danielle&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Day in the Life","postDate":"1094731508","msgId":99406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNocGd0aytzNGdrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNobzk1NCttMDFyQGVHcm91cHMuY29tPg=="},"prevInTopic":99405,"nextInTopic":99431,"prevInTime":99405,"nextInTime":99407,"topicId":99389,"numMessagesInTopic":0,"msgSnippet":"I would kind of like to read a few day-in-the-life accounts.  Anyone care to share how their day went today?  (Particularly with a 5 or 6 or 7 year old?) ","messageBody":"<div id=\"ygrps-yiv-1708606811\">I would kind of like to read a few day-in-the-life accounts.  Anyone<br/>\ncare to share how their day went today?  (Particularly with a 5 or 6<br/>\nor 7 year old?)<br/>\n=========<br/>\n<br/>\nHow &#39;bout a 4, 5 and 7 year old? *lol*<br/>\n<br/>\nI just posted this the other day at my blog:<br/>\nFriday, September 03, 2004<br/>\nWhat a wonderful, relaxing, perfect unschooling day! The kids wanted<br/>\nto paint this morning when they woke up, so they pulled out the water<br/>\ncolors. It&#39;s amazing to watch how self-sufficient they&#39;ve become! They<br/>\npointed out to me that all our watercolor paper is gone, so we&#39;ll have<br/>\nto head into The Art Store in Georgetown, which we&#39;re all looking<br/>\nforward to upon our return.<br/>\n<br/>\nWhile I was eating breakfast, the kids decided they wanted water<br/>\nballoons, so they filled a bunch up and brought them up to me to tie.<br/>\nThey took them outside to play, and before long, they were asking to<br/>\ntake them into the pool. While they were swimming, they discovered<br/>\nthat some of the water balloons would float while some would sink.<br/>\nThey began hypothesizing that maybe it was the amount of water or the<br/>\ntemperature of the water. Before long, Emily realized that it was the<br/>\namount of air in the balloon with the water that made it float!<br/>\n<br/>\nThis afternoon, we watched Cats for a while, which Emily and Julia<br/>\nthought was pretty cool. The kids were all working to balance and<br/>\ndance the way the cats were; they were discussing the different<br/>\ncostumes, which looked more cat-like, which was their favorite.<br/>\n<br/>\nSam soon grew bored after he&#39;d had enough snuggling and headed<br/>\ndownstairs, shortly to reappear with another balloon for me to tie.<br/>\nThis time, instead of water, the balloon contained a magnetic ball. I<br/>\nblew it up for him, and he threw it up in the air for a while,<br/>\nwatching the way it wobbled, spun and sunk--movement very different<br/>\nfrom the graceful floating of an air-filled balloon. Soon, he<br/>\ndisappeared again and reappeared with a magnet to attach to the ball<br/>\ninside, knowing full well what would happen when he tried to pull it<br/>\naway because it&#39;s one of his favorite experiments.<br/>\n<br/>\nThe girls are now outside, dressed in their Colonial Williamsburg garb<br/>\nin anticpation of our upcoming trip, and they&#39;re harvesting vegetables<br/>\nlike good little Colonial girls. As our gardens here in Southern<br/>\nMaryland are fading fast, it should be interesting to see what&#39;s in<br/>\ntheir baskets on their return! Sam has scattered a bag of cherry<br/>\ntomatoes on the table given to us by a member of our 4-H club, and he<br/>\nhas experimented with how well the paper bag holds water, reporting<br/>\nthat I was correct in pointing out that paper did not hold water so<br/>\nwell. *lol* Emily just came in with a basket full of red hot chilis to<br/>\nroast! Not a bad harvest.<br/>\n# posted by Danielle @ 5:33 PM<br/>\n<br/>\n<br/>\n--Danielle<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a></div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Day in the Life","postDate":"1094728721","msgId":99405,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PGNobzk1NCttMDFyQGVHcm91cHMuY29tPg=="},"prevInTopic":99403,"nextInTopic":99406,"prevInTime":99404,"nextInTime":99406,"topicId":99389,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-985199340\">&lt;&lt;&lt;I would kind of like to read a few day-in-the-life accounts.  Anyone <br/>\ncare to share how their day went today?  (Particularly with a 5 or 6 <br/>\nor 7 year old?)&gt;&gt;&gt;&gt;<br/>\n<br/>\nJayn will be 5 in October.<br/>\n<br/>\nThis morning I got up early at 7.30 to get to the dentist for my<br/>\nteethcleaning. Jayn was sleeping, since we were up until after 4am the night<br/>\nbefore. I did some email checking, prepared a food bag and some extra<br/>\nclothes and then hauled Jayn down to the car. She slept until we got to the<br/>\nparking lot, where she chose to remain in her nightgown.<br/>\n<br/>\nWe went up to my appointment, where Jayn was fascinated by everything the<br/>\nhygienist did, drew some pictures of the Fairy Godmother and a self portrait<br/>\nwhile sitting on the floor, and made a lot of remarks about the cleaning<br/>\nprocess. She then sat bravely in the dentist chair for the first time and<br/>\nthe hygienist, who seemed really charmed by Jayn, counted her teeth and had<br/>\na look. She found a couple of cavities (no surprise to me). The dentist<br/>\nstopped in to say hello and delighted Jayn by remembering a story I had<br/>\nforgotten about when she sat up by herself for the first time at the<br/>\ndentist&#39;s office.<br/>\n<br/>\nAfter collecting the car, we went to the outdoor mall nearby as planned. We<br/>\nintended to buy some shoes. We found a restroom, got some lemonade (and a<br/>\nlollipop that Jayn didn&#39;t like so we tossed), and found out that the Disney<br/>\nStore was gone. We looked in Gap Kids, and Jayn tried on a nightgown and had<br/>\na bit of a meltdown that the skirt was too short, so we rejected that<br/>\ngarment. We did get some sandals and stickers. I realized that Jayn was<br/>\nprobably hungry so we got some donuts (the food bag was in the car), a hot<br/>\ndog and some really nice french fries. <br/>\n<br/>\nAfter eating Jayn still seemed to be very whiney and twitchy, so I suggested<br/>\nthat we should head home instead of getting more shoes. Jayn got upset,<br/>\nwhich led me to realize that we *really* needed to go. I told her that she<br/>\nseemed to be telling me by her behavior that she was not liking being here -<br/>\nevery thing was wrong - her socks were too tight, her shoes didn&#39;t fit<br/>\nright, nothing tasted good but I couldn&#39;t throw it away. Suddenly she told<br/>\nme that she just realized that she was very tired and hadn&#39;t had enough<br/>\nsleep. At this moment her own tension seemed to release. So we went back to<br/>\nthe car cheerfully, and she fell asleep almost instantly after we started<br/>\noff. <br/>\n<br/>\nWe got home, and Jayn woke up. She did some playing with an ongoing magnet<br/>\nand doll game she has. Yesterday we had made some playdoh &quot;game pieces&quot;<br/>\nusing a rubber stamp and this had inspired the idea of creating a board<br/>\ngame. (All board games are &quot;chess&quot; at the moment). Then one of our neighbors<br/>\nwent swimming, so Jayn and I had a great time for a couple of energetic<br/>\nhours having a swim with him, before dh came home. After our swim Jayn got<br/>\ndressed. <br/>\n<br/>\nUnfortunately she then went to sleep for what has turned out to be one her<br/>\n&quot;flipping to nights&quot; naps. I got into bed with her to nurse, and in the hope<br/>\nthat she would stay asleep all night. While eating a sandwich (from the food<br/>\nbag I prepped in the am) I read through my newly arrived copy of Live Free,<br/>\nLearn Free which is mostly just like hooking up with my on-line friends for<br/>\nsome refreshing chats. Then I went to sleep. Poor dh didn&#39;t get a look in<br/>\nfrom anyone this evening, and had to order a pizza for himself.<br/>\n<br/>\nJayn woke up about 4 hours later, ready to go! She ate grilled sandwiches,<br/>\nplayed and talked to Daddy for a little while before he hit the sack around<br/>\nmidnight. He will get up early and head off to his set. I am playing catch<br/>\nup again, and the only way I can keep myself awake is by typing. So I am<br/>\nchecking email and doing some reading, while Jayn watches all her favorite<br/>\ncartoons and shows that are on late (that she hasn&#39;t seen in a little<br/>\nwhile), and has done some noodling around with her dolls and eaten some<br/>\npopcorn, strawberries and a corn dog. If I could muster some more physical<br/>\nenergy we would probably be making paper dolls - yesterday we did a Cat in<br/>\nthe Hat - creating collages, playing X-box, doing Barbie or Princess doll<br/>\nplaying, or doing some drawing. Jayn sometimes plays computer games at night<br/>\ntoo. These latter activities are more typical of our nights.<br/>\n<br/>\nShe has put her other pyjamas on in the last few minutes, and I have been<br/>\nsaying for a while that I am needing to go to sleep. I&#39;m hoping we can head<br/>\noff shortly. The sofa is just too uncomfortable to sleep on in this<br/>\noppressive heat we are having here, and Jayn is not comfortable staying in<br/>\nthe living room alone. So at 4am I have no confirmation that our day is<br/>\nactually close to ending, but I am hoping for it.<br/>\n<br/>\nOriginally I had a tenuous plan for one of Jayn&#39;s friends to visit tomorrow,<br/>\nbut now I expect we will be sleeping instead - unless they are able to make<br/>\nit later in the day. When I get up I&#39;ll have to do laundry, finish my bill<br/>\npaying, and get to the store for milk. Jayn will continue with whatever<br/>\nadventure she can, between helping me with my stuff if she wants.<br/>\n<br/>\nJayn&#39;s favorite websites are: Barbie.com, Kelly, PollyPocket.com,<br/>\ndivastars.com (all of these are Mattel and linked), nickjr.com, Disney.com<br/>\nand sometimes she is interested in some of the gaming or movie sites that dh<br/>\nwill visit that have previews. Periodically I go to some of the game sites<br/>\nrecommended by unschoolers, like Zoombinis, but so far Jayn has only watched<br/>\nwithout wanting to participate.<br/>\n<br/>\nRobyn L. Coburn<br/>\n  <br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.752 / Virus Database: 503 - Release Date: 9/3/2004</div>","specialLinks":[]},{"userId":162315742,"authorName":"Joni Zander","from":"Joni Zander &lt;fotoceo@...&gt;","profile":"cmjoni","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Day in the Life","postDate":"1094713789","msgId":99403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDRDQ3MEVGLTAyMkYtMTFEOS1CREEzLTAwMEE5NUYwQjZDMEBjb3gubmV0Pg==","inReplyToHeader":"PDEwOTQ3MDcyOTYuMzM4OS43MTE1Ny5tMTZAeWFob29ncm91cHMuY29tPg==","referencesHeader":"PDEwOTQ3MDcyOTYuMzM4OS43MTE1Ny5tMTZAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":99400,"nextInTopic":99405,"prevInTime":99402,"nextInTime":99404,"topicId":99389,"numMessagesInTopic":0,"msgSnippet":"I don t have a 5, 6, or 7 year old, but I do have an 8 year old.  It s kind of tough for me to give a great account of her day, because she is so independent,","messageBody":"<div id=\"ygrps-yiv-1822563060\">I don&#39;t have a 5, 6, or 7 year old, but I do have an 8 year old.  It&#39;s <br/>\nkind of tough for me to give a great account of her day, because she is <br/>\nso independent, but I&#39;ll try.<br/>\n<br/>\nI was on the phone when she got up at about 9:00, so she came in, waved <br/>\nand went to get dressed and make her bed (a habit held over from having <br/>\nour house on the market for over 8 months last year - that and the fact <br/>\nthat she really likes her space to be neat).  I think she fixed herself <br/>\nsome cereal for breakfast and packed a lunch for our park day.  Between <br/>\n9 am and noon she played Barbies in her room, both alone and with her <br/>\n12 yo sis when she wasn&#39;t getting ready for the day.<br/>\nAt noon we left for our park day, where she played with friends until <br/>\nabout 9 pm while I sat and talked with the other moms.  When her <br/>\nfriends went home, she had some dinner on the swings, and waited for <br/>\nthe rest of us to be ready to go home, which we did at about 9:30.  She <br/>\nslept in the car on the way home.  When we got home she got ready for <br/>\nbed and was asleep half a second later.<br/>\nNot the most exciting of days, but pretty typical for a Wednesday for <br/>\nus.<br/>\n<br/>\nJoni Zander<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:FotoCEO@...\">FotoCEO@...</a><br/>\n<br/>\n(Sorry Pam, I just HAD to get in here and post the very first day!)<br/>\n<br/>\nOn Sep 8, 2004, at 10:21 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; I would kind of like to read a few day-in-the-life accounts.  Anyone<br/>\n&gt; care to share how their day went today?  (Particularly with a 5 or 6<br/>\n&gt; or 7 year old?)<br/>\n&gt;<br/>\n&gt; Also,  how about favorite websites for 5 year olds?<br/>\n&gt;<br/>\n&gt; Thanks!<br/>\n&gt;<br/>\n&gt; Sarah </span></blockquote></div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Day in the Life","postDate":"1094708494","msgId":99400,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNob3FlZStlNWdtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGNobzk1NCttMDFyQGVHcm91cHMuY29tPg=="},"prevInTopic":99393,"nextInTopic":99403,"prevInTime":99399,"nextInTime":99401,"topicId":99389,"numMessagesInTopic":0,"msgSnippet":"... Anyone ... 6 ... I have a 5 yo (Luke),7(Matt), and 11 yo (Alisha). Today we went to a friend s house at noon.  They re an unschooling family with a girl","messageBody":"<div id=\"ygrps-yiv-832049231\"><blockquote><span title=\"ireply\">&gt; I would kind of like to read a few day-in-the-life accounts.  <br/>\n </span></blockquote>Anyone <br/>\n<blockquote><span title=\"ireply\"> &gt; care to share how their day went today?  (Particularly with a 5 or <br/>\n </span></blockquote>6 <br/>\n<blockquote><span title=\"ireply\"> &gt; or 7 year old?)<br/>\n&gt; <br/>\n&gt; Also,  how about favorite websites for 5 year olds?<br/>\n<br/>\n </span></blockquote>I have a 5 yo (Luke),7(Matt), and 11 yo (Alisha).  <br/>\n<br/>\nToday we went to a friend&#39;s house at noon.  They&#39;re an unschooling <br/>\nfamily with a girl who gets along with my 11 year old, a boy who gets <br/>\nalong with my 5 and 7 year olds, and a mom who gets along with <br/>\nme. :)  <br/>\n<br/>\nWe stopped at Wal-mart on the way for Alisha to check on makeup she <br/>\nwas thinking about buying and discovered that they have series 4 <br/>\nMighty Beanz.  My kids are fascinated with Mighty beanz and begged me <br/>\nto give them their allowance 2 days early so they could buy them, so <br/>\nI did.  <br/>\n<br/>\nAt the friend&#39;s house, we had fun eating lunch, talking, playing with <br/>\ngames and toys we don&#39;t have at our house.  4 of the 5 kids colored <br/>\ntheir hair with temporary orange and pink hair color and painted <br/>\ntheir faces.  <br/>\n<br/>\nWe got home at 6, heated up some supper, hung out around the house, <br/>\nand started watching the movie 13 going on 30.  None of the kids <br/>\nreally liked it though so we stopped watching it half way through and <br/>\nput on Home Alone 4 instead.  That was neat because it was about a <br/>\nboy getting lost in NY city, and we&#39;re going to NY city next week, so <br/>\nit was neat to say &quot;Oooh, there&#39;s central park!  We&#39;re going there <br/>\nsoon!&quot;  <br/>\n<br/>\nWebsites:<br/>\nThe boys have been into Harry Potter legos big time lately, <br/>\nespecially Matt.  They&#39;ve been going to the www.lego.com website and <br/>\ntyping in numbers to see what legos come up.  Sometimes they look at <br/>\nlego papers and type in specific numbers, and sometimes they make <br/>\nnumbers up to see what they get.  Then they started writing the <br/>\nnumbers down on paper that brought them to cool lego sets, and they <br/>\nhad to write the numbers very carefully so they&#39;d be able to read <br/>\nthem again.  <br/>\n<br/>\nThey go to ebay quite a bit too, to see what kind of mighty beanz and <br/>\nHarry Potter legos people are selling.  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Day in the Life","postDate":"1094696452","msgId":99393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRjLjE0MmVlMGIyLjJlNzExODA0QGFvbC5jb20+"},"prevInTopic":99389,"nextInTopic":99400,"prevInTime":99392,"nextInTime":99394,"topicId":99389,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/8/04 6:48:08 PM, sarahanne1@yahoo.com writes:  If what you get here","messageBody":"<div id=\"ygrps-yiv-198401938\">In a message dated 9/8/04 6:48:08 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sarahanne1@...\">sarahanne1@...</a> writes:<br/>\n<br/>\n&lt;&lt; I would kind of like to read a few day-in-the-life accounts.   &gt;&gt;<br/>\n<br/>\nIf what you get here isn&#39;t enough, there are some good ones collected here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a></div>","specialLinks":[]},{"userId":59461774,"authorName":"sarah","from":"&quot;sarah&quot; &lt;sarahanne1@...&gt;","profile":"sarahanne1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Day in the Life","postDate":"1094690788","msgId":99389,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNobzk1NCttMDFyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":99393,"prevInTime":99388,"nextInTime":99390,"topicId":99389,"numMessagesInTopic":0,"msgSnippet":"Hi, I would kind of like to read a few day-in-the-life accounts.  Anyone care to share how their day went today?  (Particularly with a 5 or 6 or 7 year old?) ","messageBody":"<div id=\"ygrps-yiv-1266667927\">Hi,<br/>\n<br/>\nI would kind of like to read a few day-in-the-life accounts.  Anyone <br/>\ncare to share how their day went today?  (Particularly with a 5 or 6 <br/>\nor 7 year old?)<br/>\n<br/>\nAlso,  how about favorite websites for 5 year olds?<br/>\n<br/>\nThanks!<br/>\n<br/>\nSarah</div>","specialLinks":[]}],"prevTopicId":99420,"nextTopicId":99493}}