{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Cory and Amy Nelson","from":"Cory and Amy Nelson &lt;amynelson3@...&gt;","replyTo":"LIST","senderId":"LdkvRa917bCZSA50BTce8lFlqHLkUN2Z_nbAR41ObYixJ-nHf9uk66F76-HAc3cRuXnXl3ifh8IP1F4rluCzgV6gpjAeQLMaUSHaRDycFgM","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] an introduction","postDate":"979760924","msgId":15155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2OEI1MzNCLjFGOTElYW15bmVsc29uM0Bob21lLmNvbT4=","inReplyToHeader":"PDNBNjVGNEQzLjRGOTIyMTkwQHF3ZXN0Lm5ldD4="},"prevInTopic":15154,"nextInTopic":0,"prevInTime":15154,"nextInTime":15156,"topicId":15154,"numMessagesInTopic":0,"msgSnippet":"Welcome, Mara, and happy birthday! What a great conversation with your husband about unschooling. I m sure he ll be extremely supportive. I m Amy, SAHM to","messageBody":"<div id=\"ygrps-yiv-1640381939\">Welcome, Mara, and happy birthday! What a great conversation with your<br/>\nhusband about unschooling. I&#39;m sure he&#39;ll be extremely supportive.<br/>\n<br/>\nI&#39;m Amy, SAHM to 19-month-old Accalia.<br/>\n<br/>\nAmy<br/>\nMama to Accalia (6/14/99)<br/>\n&quot;The hardest to learn was the least complicated&quot; -Indigo Girls</div>","specialLinks":[]},{"userId":0,"authorName":"pookaberry","from":"&quot;pookaberry&quot; &lt;blackberry31416@...&gt;","replyTo":"LIST","senderId":"vdEwHP4dQJuodqnvrbAOfvswsrrwkj2EyKIOqqorEwxrLQjnYsVr1zWiJTNY4DzR-Jd59w4N_qbybN88pF2DA2IPqKu7pXRnfyqlw3Yk1g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"an introduction","postDate":"979760339","msgId":15154,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBNjVGNEQzLjRGOTIyMTkwQHF3ZXN0Lm5ldD4="},"prevInTopic":0,"nextInTopic":15155,"prevInTime":15153,"nextInTime":15155,"topicId":15154,"numMessagesInTopic":0,"msgSnippet":"Well I thought I d introduce myself.  I subscribed to this group a few days ago and have been following the conversations with interest.  A little about my","messageBody":"<div id=\"ygrps-yiv-508126984\">Well I thought I&#39;d introduce myself.  I subscribed to this group a few<br/>\ndays ago and have been following the conversations with interest.  A<br/>\nlittle about my self...<br/>\nMy name is Arlene but I usually go by Mara (or Mara Arlene).  I&#39;m about<br/>\nto turn 23 (tomorrow) and have two children, Cleopatra who is almost<br/>\nthree and Thony (Anthony) who is three months old.  I&#39;ve always felt<br/>\nthat education was a personal endeavor.  Personally I went to about 12<br/>\ndifferent schools while I was young (public, and various private schools<br/>\nranging from Montessori to fancier versions of public schools to non<br/>\ndenominational christian schools)  I went to about a year and a half of<br/>\ncollege and got my GED when I was 19/20.  I consider myself to be an<br/>\nunschooling college student. (I actually would like to become a<br/>\ncertified teacher so in a few months I&#39;m thinking of taking<br/>\ncorrespondence classes to get started)<br/>\n\tI hope everyone will forgive me for merging topics but I&#39;ve been sick<br/>\nthis week and while I&#39;ve got a few thoughts on some of the current<br/>\nconversations I haven&#39;t had the energy to reply to them individually.<br/>\n\ton co-sleeping and bedtimes<br/>\nMy parents didn&#39;t really co sleep with me, I knew I had the option to<br/>\nclimb into bed with them if I wanted to but I usually didn&#39;t.  After my<br/>\nfather died when I was twelve I found it was more comforting to sleep<br/>\nwith my mom (for her as well).  While I always had my own room and bed I<br/>\nusually spent half the week sleeping with my mom (until I was 17 when I<br/>\ndecided I wanted to spend most of my nights awake)<br/>\nI have never given Cleo a bedtime,  I found the few times she went to<br/>\nbed around 7 she would wake up at four and then try to get me to wake up<br/>\ntoo.  At the moment she usually goes to bed around 10 and even then she<br/>\nwakes up around 6 or 7 in the morning (which isn&#39;t too bad).<br/>\n\thusbands that aren&#39;t very supportive of unschooling<br/>\nMy situation is a little different and because Cleo isn&#39;t &quot;school age&quot;<br/>\nyet I haven&#39;t had to worry too much.  The times I&#39;ve tried to talk to my<br/>\nhusband about &quot;homeschooling&quot; we have just ended up arguing.  He was<br/>\nhomeschooled for a couple years and didn&#39;t like it, he thinks I don&#39;t<br/>\nhave the right educational background, that she wouldn&#39;t get enough<br/>\nsocialization, that it would &quot;harm&quot; her in some way. (most of the usual<br/>\narguments against homeschooling.  Then last night I asked him what he<br/>\nthought of unschooling.  He asked me what it was because he hadn&#39;t heard<br/>\nof it.  I don&#39;t remember my exact words but I basically told him that it<br/>\nwas the belief that everyone is learning at all times and to allow a<br/>\nchild to study the subjects that they are interested in at the time. <br/>\nHis response?  &quot;Oh, you mean the way I educated myself!&quot;  He then told<br/>\nme to &quot;go for it&quot; and see how it works.  (I should have just told him<br/>\nabout unschooling to start with and dispensed with the arguments)  Cleo<br/>\non the other hand is all for going to school (she wants to ride the<br/>\nyellow school bus that goes by our house every day)  She is also the<br/>\ntype of child that needs lots of interaction every day so I&#39;ve been<br/>\nthinking of finding a small loosely structured Montessori preschool so<br/>\nshe could go and play for a while every day.  I have a little while to<br/>\ndecide though because she isn&#39;t potty trained yet (and shows no interest<br/>\nin becoming so)<br/>\n\t-sorry for any rambling<br/>\n<br/>\nMara Arlene<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://members.nettrash.com/blackthorn\">http://members.nettrash.com/blackthorn</a></div>","specialLinks":[]}],"prevTopicId":15140,"nextTopicId":15126}}