{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":42924764,"authorName":"Marjorie Kirk","from":"&quot;Marjorie Kirk&quot; &lt;mkirk@...&gt;","profile":"mdlfkirk","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] my husband&#39;s take on unschooling","postDate":"1092403410","msgId":97829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODEzMTMyMS5pN0RETGJKWDAxNTkxMkBtcy1zbXRwLTAxLWVyaTAub2hpb3JkYy5yci5jb20+","inReplyToHeader":"PDQxMUMzN0FCLjMwMjA5MDhAZWFydGhsaW5rLm5ldD4="},"prevInTopic":97825,"nextInTopic":0,"prevInTime":97828,"nextInTime":97830,"topicId":97822,"numMessagesInTopic":0,"msgSnippet":"Last year I had to talk the whole family into going to the conference, but they have been looking forward to this one since then!  After we made plans to come,","messageBody":"<div id=\"ygrps-yiv-65214847\">Last year I had to talk the whole family into going to the conference, but<br/>\nthey have been looking forward to this one since then!  After we made plans<br/>\nto come, my DH found out that he was overbooked; he&#39;s supposed to be picking<br/>\nup a colleague at the airport on Sunday in Columbus, Ohio and driving to<br/>\nMichigan to lead a seminar.  He was bummed and didn&#39;t want to miss the any<br/>\nof the conference (I, particularly didn&#39;t want him to miss the dads&#39; get<br/>\ntogether).  My son also started playing football for the first time this<br/>\nyear and has a game on Sunday. (It&#39;s also football picture day!) So, we<br/>\narranged for the two of them to fly home Saturday night to be at their<br/>\nvarious events on Sunday and the rest of us will drive home after the whale<br/>\nwatch. DH &quot;gets&quot; unschooling, but sometimes gets stuck in old patterns of<br/>\nbehavior (don&#39;t we all?).  It is really great to be able to hang out with<br/>\nall these people who respect and trust their kids and love being with them.<br/>\nIt&#39;s such a great atmosphere of camaraderie.  Anyone who is sitting on the<br/>\nfence, or has a spouse up there---COME!!!  It&#39;s so worth it!<br/>\n<br/>\nAlso, after last year&#39;s chainmaille funshop my DH decided to make a shirt<br/>\nwith DS&#39;s help.  It turned out to be a very long tunic, with no sleeves.<br/>\nIt&#39;s very cool and they want to bring it to show Julian.<br/>\n<br/>\n<br/>\nMarjorie, who now has 2 extra whale watch tickets available.  Any takers?</div>","specialLinks":[]},{"userId":154033277,"authorName":"Crystal","from":"&quot;Crystal&quot; &lt;crystal.pina@...&gt;","profile":"crystalinma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: my husband&#39;s take on unschooling","postDate":"1092370216","msgId":97825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNmaGV2OCt0NGQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxMUMzN0FCLjMwMjA5MDhAZWFydGhsaW5rLm5ldD4="},"prevInTopic":97823,"nextInTopic":97829,"prevInTime":97824,"nextInTime":97826,"topicId":97822,"numMessagesInTopic":0,"msgSnippet":"Betsy, I totally understand where you are coming from, although I don t have any answers for you.  I just posted a reply to this on the unschooling basics list","messageBody":"<div id=\"ygrps-yiv-1052618325\">Betsy, I totally understand where you are coming from, although I <br/>\ndon&#39;t have any answers for you.  I just posted a reply to this on <br/>\nthe unschooling basics list saying just about the same thing you <br/>\ndid, that my dh has to work and doesn&#39;t want to come.  I&#39;m going to <br/>\ncut and paste it here, since Kelly posted it here too. <br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ <br/>\n&lt;snip&gt;<br/>\nThank you, Kelly, for sharing this. I, even more now, want my<br/>\nhusband to attend the conference. Right now he still doesn&#39;t want<br/>\nto go. I think if I pushed he would, though. I have told him it<br/>\nwould mean a lot to me if he would be there with me, but he is<br/>\nworking on Friday and he might work Saturday morning, then he wants<br/>\ntime to relax before Monday and it all starts over again. So, I see<br/>\nhis reason for not wanting to go, but I also know this is a once in<br/>\na lifetime opportunity for me to help him understand where I am in<br/>\nmy thinking. (Next year is a whole nother year away!, plus he hates<br/>\nFlorida.)<br/>\n<br/>\nHe mostly understands the academic parts of unschooling. The things<br/>\nI think he needs to understand is why I don&#39;t make the kids do a lot<br/>\nof housework, like, when Erica is drawing and her drawing stuff is<br/>\nall out around her along with a dirty dish or two and a drink, and<br/>\nher laundry needs to be done, etc. In his culture, girls my<br/>\ndaughter&#39;s age would be running the household--cooking and cleaning,<br/>\nnot drawing. What makes it worse is our neighbor is like he is, the<br/>\nwomen and girls spend their day taking care of the kids and the<br/>\nhouse while the men work and fix cars. I&#39;m hoping he might listen<br/>\nto someone who is not me (ie, another man).<br/>\n<br/>\nOne thing I have going for me is that he is not my kids&#39; father. I<br/>\ndo not have to wait to unschool until he &quot;gets it&quot;. I wish we were<br/>\nboth on the same page, though.<br/>\n<br/>\nCrystal, crossing her fingers that dh comes to the conference.&lt;/snip&gt;</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] my husband&#39;s take on unschooling","postDate":"1092368299","msgId":97823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMUMzN0FCLjMwMjA5MDhAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDIwLjMwYTNiM2Q5LjJlNGQ3ZThiQGFvbC5jb20+","referencesHeader":"PDIwLjMwYTNiM2Q5LjJlNGQ3ZThiQGFvbC5jb20+"},"prevInTopic":97822,"nextInTopic":97825,"prevInTime":97822,"nextInTime":97824,"topicId":97822,"numMessagesInTopic":0,"msgSnippet":"** Your can t support or understand what he hasn t  experienced or read about. Having him there at the very least means  exposure; besides, he s agreed to come","messageBody":"<div id=\"ygrps-yiv-1099232091\">** Your can&#39;t support or understand what he hasn&#39;t  experienced or read <br/>\nabout. <br/>\nHaving him there at the very least means  exposure; besides, he&#39;s agreed to<br/>\ncome already.**<br/>\n<br/>\nI&#39;m not above &quot;bargaining&quot; with my husband.  Such as &quot;if you come with <br/>\nme to the conference I&#39;ll be really delighted and I&#39;ll do something nice <br/>\nfor you like: visit your family cheerfully or clean the garage or make <br/>\nshepherd&#39;s pie every week for 6 weeks.&quot; <br/>\n<br/>\nI would do it.  (Note: my husband has to go back to work before the <br/>\nconference and it&#39;s hard to squish a cross country trip into his <br/>\nunlengthenable weekends.)  (So I&#39;m not just blowing hypocritical smoke, <br/>\nhere.  Um...really.)<br/>\n<br/>\nIf the rest of you have some better tips in spousal persuasion, let&#39;s <br/>\nhear &#39;em.<br/>\n<br/>\nBetsy<br/>\n<br/>\nPS  Although we aren&#39;t making it to MA, my husband is coming to the <br/>\nSacramento HS conference with me, finally.</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"my husband&#39;s take on unschooling","postDate":"1092363403","msgId":97822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwLjMwYTNiM2Q5LjJlNGQ3ZThiQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":97823,"prevInTime":97821,"nextInTime":97823,"topicId":97822,"numMessagesInTopic":0,"msgSnippet":"The following is a partial response to a mom who is interested in coming to the conference. Her husband is reluctant----in more ways than one. Ben wrote to","messageBody":"<div id=\"ygrps-yiv-1758091199\">The following is a partial response to a mom who is interested in coming to  <br/>\nthe conference. Her husband is reluctant----in more ways than one. Ben wrote <br/>\nto  encourage her to bring the whole family. I thought some of you might be  <br/>\ninterested in reading a dad&#39;s viewpoint. I&#39;ve deleted her questions and some  <br/>\nspecifics, but I think you&#39;ll get the gist.<br/>\n <br/>\nI&#39;m lucky.<br/>\n <br/>\n~Kelly<br/>\n <br/>\n*************************<br/>\n <br/>\nAt least 10 dads (not to mention countless moms and kids) have had  <br/>\nlife-changing experiences at the past two conferences.  I can&#39;t pinpoint a  specific <br/>\nevent which made those things happen, so I must attribute it to the  entire <br/>\nconference.  The presenters ... the funshops ... the dads&#39;  get-together ... <br/>\nchildren experiencing some of their own ... the talent show ...  everything that <br/>\nthe conference offers (and leaves out) is important.   Complete submersion into <br/>\nthe entire conference will help more than just picking  and choosing certain <br/>\nthings to see and hear.  You can&#39;t submerge or pick  and choose if one of you <br/>\nis not there.  <br/>\n<br/>\nI&#39;m assuming that you mean my talk with the fathers  when you say &#39;your <br/>\ntalk&quot;; I actually am presenting in the main tent on &quot;Rules vs  Principles&quot;, also.  <br/>\nFor the sake of this e-mail, I&#39;ll go with my  assumption.  My get-together <br/>\nwith the fathers will give him some insight  into unschooling and ways that <br/>\nothers experience it in and outside of their  homes.  Unschooling is not the <br/>\nproduct of an equation; there is no one  definition or way to do it.  It is the math <br/>\nequivalent of  infinity because it is continuous and evolving and maleable <br/>\nand has no defined  stopping point.  It must be lived and experienced correctly, <br/>\nand it extends  the journey of learning.  As far as &#39;graduation&#39; and college <br/>\nare concerned,  there should be people there with whom he can speak about <br/>\nthose subjects (in  fact, one of the speakers, Valerie Fitzenrieter, will be <br/>\ntalking about  her daughter, Laurie, who just began working on her  <br/>\ndoctorate---unschooled until college).  As far as successful goes, you&#39;re  treading on thin <br/>\nice with me.  My DW never graduated from college, and  she&#39;s been successful <br/>\nfrom society&#39;s and unschooling&#39;s standpoint.   Maybe you both need to define the <br/>\nmeaning of being &quot;successful&quot;.  Bill  Gates would take exception to needing a <br/>\ncollege degree to be &quot;successful&quot;.  <br/>\n <br/>\n<br/>\n<br/>\nYour can&#39;t support or understand what he hasn&#39;t  experienced or read about.  <br/>\nHaving him there at the very least means  exposure; besides, he&#39;s agreed to <br/>\ncome already.  But if you think he&#39;ll  make it miserable for your son, you need <br/>\nto ask whether or not you will continue  to unschool if your husband is not <br/>\nsupportive.  My get-together with  the fathers is crucial to his being in a <br/>\n&#39;safe&#39; environment to discuss issues  specific to the dads.  Everything else at <br/>\nthe conference is just as  important because he&#39;ll see how fathers are <br/>\ninteracting with their children  every minute of every hour of every day of the <br/>\nconference.  Not knocking  you moms, but that is a thing of beauty for me.<br/>\n <br/>\n<br/>\n<br/>\nThis is more of a separate subject than the conference itself, but two  <br/>\nthings here: 1) what &#39;you&#39; want vs what he wants and 2) teaching vs  learning.  <br/>\nWhat he wants is what your focus is in unschooling.  One of  the basic themes <br/>\nthroughout your note is how much you want this to work, and  that&#39;s good ... you <br/>\nhave to have the passion to do it.  But in the end,  it&#39;s got to be what he <br/>\nwants.  I don&#39;t deny that being home in an  unschooling environment would be the <br/>\nbest thing for him, but he&#39;s gotta be the  one to make that choice.  His <br/>\nchoice will be to stay home if he realizes  that you will help him learn <br/>\nabsolutely anything that he&#39;s interested in.   If that means watching TV, playing video <br/>\ngames, playing cards, or coloring in a  coloring book all day for the next <br/>\ntwo months, let him do it.  He&#39;ll be  &#39;deschooling&#39;, gaining confidence in <br/>\nhimself (and you), become more responsible  for his own learning, and experience <br/>\nthe value of self-led learning.  Your  responsibility is not to teach, but to <br/>\nfind ways to turn your &quot;no&#39;s&quot; into  &quot;yes&#39;s&quot;.  In his time, his responsibility <br/>\nwill be to make choices based  upon his passions and interests and not upon what <br/>\nsome faceless administration,  government official, or other self-appointed <br/>\nexpert thinks he should be  doing.  He will empower himself.<br/>\n <br/>\n************************<br/>\n <br/>\nThere&#39;s more----but I just thought I&#39;d share a bit.<br/>\n <br/>\n~K<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":97818,"nextTopicId":97708}}