{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: OT-Letting them marry? Talking about sex","postDate":"1169667125","msgId":27808,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDcwMTI0MTEzMmoyN2NkNWExZXM1MGYzNmI1ZjhhOGJkYWMzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGVwODh1aSszMmdqQGVHcm91cHMuY29tPg==","referencesHeader":"PDcyNjc1Ny44MzU4OS5xbUB3ZWI1NjgwNS5tYWlsLnJlMy55YWhvby5jb20+CSA8ZXA4OHVpKzMyZ2pAZUdyb3Vwcy5jb20+"},"prevInTopic":27803,"nextInTopic":0,"prevInTime":27807,"nextInTime":27809,"topicId":27802,"numMessagesInTopic":0,"msgSnippet":"... I d say keep it matter-of-fact... if you ve gotta make an extra bathroom break and you re together, casually mention it s your *moon time* (or whatever","messageBody":"<div id=\"ygrps-yiv-1361638334\"><blockquote><span title=\"ireply\">&gt; What should I do? Wait for him? I&#39;m very new to unschooling.<br/>\n&gt;Not sure what is best for encouraging his autonomy with regards to<br/>\n&gt;this topic.<br/>\n<br/>\n&gt;<br/>\n </span></blockquote>I&#39;d say keep it matter-of-fact... if you&#39;ve gotta make an extra bathroom<br/>\nbreak and you&#39;re together, casually mention it&#39;s your *moon time* (or<br/>\nwhatever phrase you&#39;re comfortable with); if it sparks a puzzled look you<br/>\ncan give a brief explanation... if something comes on television, the same<br/>\nthing just talk as if he already knows and you&#39;re just<br/>\nreminding/clarifying.  (i.e. a teen pregnancy situation, I&#39;d mention how sad<br/>\nit is that those kids didn&#39;t have parents willing to talk to them about<br/>\npreventing it or provide them with protection -- or, a real-life situation<br/>\nwe&#39;ve had are the new commercials for the HPV vax... I&#39;ve thrown out that<br/>\nsimple, responsible condom use will serve the same purpose).  Avoid<br/>\nlecturing or talking beyond his comfort (I&#39;m still working on that one!).<br/>\nIf you&#39;re open and non-pressuring about the fact that you&#39;re ready, willing<br/>\nand able to discuss with him whatever he asks (especially as it is apparent<br/>\nthe other adults in his life are not), you become the person in whom he can<br/>\nconfide.<br/>\nThere&#39;s a great book on body changes (I&#39;ll find the title... on Amazon.com I<br/>\ntyped in: body changes, puberty and got a great list of options) you can<br/>\nhave around, even for your dd, that he should be able to take into his room<br/>\nand read himself.<br/>\n-- <br/>\n~diana :)<br/>\nxoxoxoxo<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: OT-Letting them marry? Talking about sex","postDate":"1169663762","msgId":27803,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVwODh1aSszMmdqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcyNjc1Ny44MzU4OS5xbUB3ZWI1NjgwNS5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":27802,"nextInTopic":27808,"prevInTime":27802,"nextInTime":27804,"topicId":27802,"numMessagesInTopic":0,"msgSnippet":"... I d say, if he doesnt want to talk about it, don t force the issue. Esp since no one else (including his two other parents)WANTS you to talk to him...it","messageBody":"<div id=\"ygrps-yiv-2114879300\"><blockquote><span title=\"ireply\">&gt;   What should I do?  Wait for him?  I&#39;m very new to unschooling.  <br/>\n&gt;Not sure what is best for encouraging his autonomy with regards to <br/>\n&gt;this topic.<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;d say, if he doesnt want to talk about it, don&#39;t force the issue. <br/>\nEsp since no one else (including his two other parents)WANTS you to <br/>\ntalk to him...it could cause some problems.<br/>\n<br/>\nJust get a book about sex (and the human body, dating, puberty, all <br/>\nthat stuff)and leave it somewhere where he is sure to <br/>\nfind it, like the bathroom or something. (That is, if you think he&#39;d <br/>\nbe weirded out with you handing it to him to keep.)<br/>\n<br/>\nI just got my 11 yr old niece a book for teens by the authors <br/>\nof &quot;Our Bodies OurSelves&quot;...i told her &quot;Don&#39;t let your dad see <br/>\nthis, he&#39;ll never let you speak to me again!&quot; LOL. I cleared it with <br/>\nher mom (my sister)so there wouldnt be any issues. My niece loves to <br/>\nread, and was totally into it. Alot of the info is not stuff she can <br/>\nuse now (like, about STDs, and unintended pg, dating, etc)...but its <br/>\ngood that she has the info.<br/>\n<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":283459052,"authorName":"Terry Yoesting","from":"Terry Yoesting &lt;terryyoesting@...&gt;","profile":"terryyoesting","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: OT-Letting them marry? Talking about sex","postDate":"1169661963","msgId":27802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyNjc1Ny44MzU4OS5xbUB3ZWI1NjgwNS5tYWlsLnJlMy55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":27803,"prevInTime":27801,"nextInTime":27803,"topicId":27802,"numMessagesInTopic":0,"msgSnippet":"Hello Everyone.  I am Terry.  I usually lurk, but this has been interesting topic.  I married at a older age 38.  When I married, my husband had a then 7 year","messageBody":"<div id=\"ygrps-yiv-1698743893\">Hello Everyone.  I am Terry.  I usually lurk, but this has been interesting topic.  I married at a older age 38.  When I married, my husband had a then 7 year old son.  This thread made me think of a few things. <br/>\n   <br/>\n  First when we decided to marry, ds was very insistent that I take thier last name (I did not have any children, I was working full time and we discussed me keeping my maiden name).  He kept telling us that we should all have the same name, me, his father, his mother and him.  We honored his wishes.  Two years later his mom got married and he told us how upset he was that at his mom&#39;s house, he was different because he was the only one with his last name.  His parents got married because she became pregnant.  My husband was 17 at the time and his mother was 19.  They were forced to get married at the time.  I say forced because the parents told them it was the only responsible thing to do.  They hated being married and ended up hating each other.  To this day I must wonder how this affected ds.<br/>\n   <br/>\n  Anyway this lead to my second thought.  We have since had a dd.  She is four now and ds is 14.  Dd hears me talk about the human body.  She is not shocked by what she hears because she has heard the terms before.    But my ds is a different story.  He never heard of these terms before he met me.  Right before we got married, he was sitting on my lap and bouncing.  I asked him not to bounce because it was hurting me.  He then asked me if he was hurting my &quot;thing&quot;?  He didn&#39;t even know the term penis.  And at 7 he didn&#39;t know I didn&#39;t have one.  Wasn&#39;t talked about in his family.  I told him, no he wasn&#39;t hurting my penis because girls don&#39;t have a penis, but he was hurting my legs.  He had such a puzzling look on his face.  Really?  Girls don&#39;t have a penis?  How to they pee?  So I told him.  Now  I should tell you that we were sitting on my future inlaws back porch having a BBQ.  Everyone around us was VERY upset with our converstation.  It was very upsetting to me also<br/>\n that this would be upsetting. Should have heard the conversation about my pregnancy, giving birth (ds thought all babies came out of the stomach with an incision) and breast feeding.<br/>\n   <br/>\n  This leads to my question for everyone.  It has been very weird (not sure if that is the word I need) to discuss sex with my ds.  His father and mother do not want to talk about it with him.   Our ds is not comfortable with talking about this.  And sometimes I hold back because I&#39;m afraid of stepping on his mothers toes.  <br/>\n   <br/>\n  Today I stay at home with dd.  We are together 24/7.  But my ds attends public school and is with us every wednesday and thursday and every other 3 day weekend.  I don&#39;t see opportunities to talk with him about sexuality.  When I ask him if he has any questions he says no.  I don&#39;t know if he does have questions or if he is uncomfortable talking with me.<br/>\n   <br/>\n  What should I do?  Wait for him?  I&#39;m very new to unschooling.  Not sure what is best for encouraging his autonomy with regards to this topic.<br/>\n   <br/>\n  thanks for letting me vent and ask questions.<br/>\n  Terry <br/>\n<br/>\n <br/>\n---------------------------------<br/>\nDon&#39;t pick lemons.<br/>\nSee all the new 2007 cars at Yahoo! Autos.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":27782,"nextTopicId":27821}}