{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"slabkNQjklEFmrnACv1hBppLXjkp6ZHoLtXZvje1LJJnAEENtlQcoaybBcnFrP35TqMJ_X49gdUsA0mBMI6zXNnYCEZZWss","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Classroom collapse in Japan","postDate":"958831435","msgId":8586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNTIwMTM1NS5XQUEyMTM1MkBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":8585,"nextInTime":8587,"topicId":8586,"numMessagesInTopic":0,"msgSnippet":"Hi all, On my way to meet with the head of an alternative school here in Japan, I opened the morning paper today and found the following story on the front ","messageBody":"<div id=\"ygrps-yiv-794794907\">Hi all,<br/>\n<br/>\nOn my way to meet with the head of an alternative school here in Japan, I <br/>\nopened the morning paper today and found the following story on the front <br/>\npage about *gakkyu hokai* -- classroom collapse or breakdown in Japan.<br/>\n<br/>\nThis article says a lot about where the Japanese Ministry of Education is <br/>\nheaded with regard to problems in public schools. Parents are even being <br/>\nconsidered to help teachers &quot;in some cases.&quot;<br/>\n<br/>\nLest we think the Education Ministry in Japan is going soft, bear this in <br/>\nmind: The educrats here can definitely see the writing on the wall, both <br/>\nin Japan and overseas, where the choices of homelearning and alternative <br/>\neducation are concerned. Since it knows it cannot outright stop people in <br/>\nJapan from making these viable choices, the ministry would no doubt like <br/>\nto &quot;lead&quot; the public there, rather than finding itself being led by a <br/>\nJapanese grassroots movement that rejects school. We&#39;re seeing some signs <br/>\nof such ministry intentions already.<br/>\n<br/>\nA suspicious bunch, those Education Ministry folks. &lt;g&gt;<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n------------------------------------<br/>\n<br/>\n[Japan Times, 20 May 2000, page 1]<br/>\n<br/>\n<br/>\nTeachers told to take team approach, act fast<br/>\nto quell &#39;classroom collapse&#39; <br/>\n<br/>\n<br/>\nTeachers and other adults must take countermeasures at an early stage and <br/>\ndeal with problems as a group to curb &quot;classroom collapse,&quot; according to <br/>\nan Education Ministry report.<br/>\n<br/>\nThe report, compiled by a team from the National Institute for <br/>\nEducational Research, examines 150 cases in which elementary school <br/>\nclasses did not function. These instances were typified by children <br/>\nignoring teachers and being unruly and destructive.<br/>\n<br/>\nThe report concludes that classroom breakdown can occur at any school -- <br/>\nregardless of class size, gender of teacher or age of children. However, <br/>\ncases were recorded in which chaos was attributed to a sudden rise in <br/>\nclass size, it says.<br/>\n<br/>\nOut of 41 cases in which the class numbered more than 36 children, eight <br/>\nclasses experienced a sudden rise in numbers -- such as from 21 children <br/>\nto 40.<br/>\n<br/>\nThe standard class size at public elementary schools is set at 40, which <br/>\nmeans two classes numbering less than 20 children must be merged.<br/>\n<br/>\nThe most common cause of collapse is &quot;teacher incompetence,&quot; typified by <br/>\noppression or failing to listen to children, the report says. Other <br/>\ncauses include rogue students with difficult home backgrounds misbehaving <br/>\nand influencing others. A lack of leadership by principals is also cited.<br/>\n<br/>\nThe report calls for teachers to swiftly deal with even minor problems to <br/>\nprevent them from degenerating. It also suggests taking a flexible stance <br/>\nin teaching to make studies interesting and understandable to children. <br/>\n<br/>\nTeachers are also urged to consult with their colleagues when dealing <br/>\nwith problems, rather than trying to solve them individually.<br/>\n<br/>\nCiting one successful example in which three teachers taught arithmetic <br/>\nto a class of 44 children, the report says, &quot;It is important to make an <br/>\natmosphere where teachers can discuss problems freely with others at <br/>\nstaff meetings and study groups.&quot;<br/>\n<br/>\nTeam teaching, sending part-time teachers to assist homeroom teachers and <br/>\nutilizing school advisers from local education boards would be effective <br/>\nways of helping teachers solve problems, an official said.<br/>\n<br/>\nThe report says schools should maintain close contact with both parents <br/>\nand kindergarten teachers in order to understand each child&#39;s background. <br/>\nIn some cases, direct participation of parents in classroom teaching is <br/>\nalso effective, the report says, adding that teachers need to change the <br/>\nview that they must &quot;control&quot; pupils.<br/>\n<br/>\nChildren must be the main actors in the classroom and teachers should be <br/>\nthe ones to support children in learning and solving problems by <br/>\nthemselves, it says.<br/>\n<br/>\n<br/>\n[copyright - The Japan Times]</div>","specialLinks":[]}],"prevTopicId":8585,"nextTopicId":8589}}