{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":89015023,"authorName":"rambler@planetcomm.net","from":"rambler@...","profile":"AMCAmbassador","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Just Say No to Ritalin","postDate":"1022849569","msgId":38007,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMuMC41LjMyLjIwMDIwNTMxMDg1MjQ5LjAwYTI1MjA4QG1haWwucGxhbmV0Y29tbS5uZXQ+","inReplyToHeader":"PDEwMjI4NDcyMzEuMzkzLjgwNjE4Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":38006,"nextInTime":38008,"topicId":38007,"numMessagesInTopic":0,"msgSnippet":"Let me tell you a bit about my experience with Ritalin. My sister has two sons.  One (let s call him Ralph ) is exceedingly bright, active, and friendly.  The","messageBody":"<div id=\"ygrps-yiv-1019342051\">Let me tell you a bit about my experience with Ritalin.<br/>\n<br/>\nMy sister has two sons.  One (let&#39;s call him &quot;Ralph&quot;) is exceedingly<br/>\nbright, active, and friendly.  The other (&quot;Tommy&quot;) is also active,<br/>\nexceptionally curious and athletic, but a a bit of a discipline problem.<br/>\nThe most notable was that he would frequently awake in the night and raid<br/>\nthe refrigerator, and tear up stuff.<br/>\n<br/>\nShe was told to put them on Ritalin, which she did, for years.  It turned<br/>\nthem into zombies.  The spark faded from their eyes when they were on that<br/>\ndrug, and they appeared listless.  Their voices even changed -- gone was<br/>\nthe confident, fully-charged lungs voice they used when sober.  That was<br/>\nreplaced with a light, airy, cracking and timid voice.<br/>\n<br/>\nNeedless to say, I did not like what she was willingly doing to her<br/>\ninnocent little boys.<br/>\n<br/>\nMy wife and I took them on a week&#39;s vacation, and we swore that they would<br/>\nbe going cold-turkey off of those chemicals.  For a week, they didn&#39;t see<br/>\nPill One.  We marched their little butts all over creation and back, and<br/>\ndidn&#39;t slow down a bit to wait for them, so they HAD to keep up.  And they<br/>\ndid!  We hiked, made campfires, cooked out, looked for flat rocks to skip<br/>\non the stream, worried lizards and snakes and other animal life along the<br/>\nstreambank, and other physical activities.<br/>\n<br/>\nWithin that week, &quot;Tommy&#39;s&quot; discipline problem was under control.  After<br/>\nthe second day, at each day&#39;s end, they were both begging to go to bed, and<br/>\nboth of them slept throughout the night without a peep.  &quot;Tommy&quot; also had<br/>\nnot been taught proper table manners, and at the beginning of the week, ate<br/>\nlike a wild animal.  We stopped that in short order, and by the end of the<br/>\nweek, he was proudly showing us his new skill at eating correctly and<br/>\npolitely.<br/>\n<br/>\nWe knew the lessons they&#39;d learned would be unlearned when they got back<br/>\nhome and were put back on drugs and plunked down in front of the hypnosis<br/>\nmachine again, but we felt compelled to show them &quot;the other side&quot;.  Who<br/>\nknows, but maybe some day they will remember the experiences and make<br/>\nbetter choices for themselves and their children.<br/>\n<br/>\nI believe the biggest mistake schools make is to not match what they do<br/>\nwith each child to what that child needs to do.  In the case of young boys,<br/>\nold schoolmasters knew what they were doing -- most of them, you just WEAR<br/>\nOUT.  It is their &quot;disconnect&quot; with students that led me to vow my children<br/>\nwill never see the inside of a government school; and as most private<br/>\nschools in many way mirror public ones, I concluded homeschooling was the<br/>\nway to go.  <br/>\n<br/>\nAnyway, more specific to the below quoted post, I don&#39;t have any great love<br/>\nfor the forced looting of the Tobacco industry.  Those warning labels have<br/>\nbeen on cigarettes for almost forty years now; anyone who didn&#39;t quit<br/>\nsmoking when they were already proven to be dangerous should have borne the<br/>\nfull cost of their medical treatment.  It&#39;s called &quot;responsibility&quot;.  <br/>\n<br/>\nThe use of Ritalin and other psychoactive substances is of a different<br/>\nnature -- it is teachers, school administrators, doctors, lawyers, and drug<br/>\nmakers colluding to force innocent young boys (some girls too, but the vast<br/>\nmajority are young boys) to ingest a harmful chemical to make them docile<br/>\nand compliant.  The boys have no choice in the matter, unlike smokers did.<br/>\n<br/>\nAll I can say is, Just Say No to Drugs.<br/>\n<br/>\n-- Marc Montoni<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Just a little food for thought_________________   The same attorney who just <br/>\n&gt;won the hudge case against the tobacco industry is now suing the drug<br/>\n </span></blockquote>company <br/>\n<blockquote><span title=\"ireply\"> &gt;that make ritalin.  The basis for his case is that he claims he has proof <br/>\n&gt;that ADD was a made up disorder by the drug company and the american board<br/>\n </span></blockquote>of <br/>\n<blockquote><span title=\"qreply\"> &gt;pediatrics to make money and sell more drugs.  Sounds crazy, but it will be <br/>\n&gt;fun to see what comes of it.<br/>\n&gt;        One thing I do know is that in our area lots of people are making <br/>\n&gt;money fast and furious off of these kids.  I  have seen so many suposed ADD <br/>\n&gt;kids come in to homeschooling and eventually all their symptoms go away </span></blockquote></div>","specialLinks":[]}],"prevTopicId":37998,"nextTopicId":38011}}