{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] wisdom and excellent writing","postDate":"1036473061","msgId":10337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEzREM3RDBAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":10282,"nextInTopic":0,"prevInTime":10336,"nextInTime":10338,"topicId":10282,"numMessagesInTopic":0,"msgSnippet":"Thanks for all the encouragement about the food thing. I do truly believe that no limits will work. It just has been really painful watching them gorge. There","messageBody":"<div id=\"ygrps-yiv-1784952136\">Thanks for all the encouragement about the food thing. I do truly believe that no limits<br/>\nwill work. It just has been really painful watching them gorge. There were a couple of days<br/>\nwhen they only ate candy, soda and chips. BUT I have seen some glimmers of hope. Yesterday<br/>\nI asked Jason if he was only eating candy because I had not let him for so long. He said<br/>\nyes. I also asked him if he was afraid that I would change my mind, he said yes. I reassured<br/>\nhim that I was not going to change my mind. Today he asked for 4 grilled cheese sandwiches<br/>\nfor lunch (he ate 3) and ate much less junk then he has for the past 2 weeks. He seems more<br/>\nopen to listening to me also. A couple of weeks ago, I made the mistake of cringing when<br/>\nhe asked for mountain dew when we were out with my grandmother and aunt and cousins. I<br/>\nexplained to him that it had more caffeine then most sodas and I was worried that he<br/>\nwould start getting hyper. Of course this made him want it more. He ended up drinking <br/>\n2 cans and bouncing off the walls, getting all over his brother etc. Not exactly<br/>\nthe behavior I wanted around my grandmother! The next day, I talked to him about it.<br/>\nHe said that he liked feeling that way ;o) thought that it was kind of neat. I told<br/>\nhim that it was hard on me when we were out with people because it took more energy<br/>\nto parent him. I asked him if he would mind only drinking it when we were not out with<br/>\npeople (stressing that it was his decision). He said yes. So he has been drinking it<br/>\nat home and seeing how it affects him. If he wants to drink it next time we are out<br/>\nI will let him, but hopefully this compromise will work. I think that he is just interested<br/>\nin how things he eats make him feel. So in the short run, it is more work because I have<br/>\nto be more &quot;on&quot; as a parent when he is bouncing off the walls, but in the long run<br/>\nI think that he will be more aware of how he feels when he eats different things.<br/>\n<br/>\nI am trying to leave more healthy stuff easily available, but it can be hard as Jason<br/>\nis a *very* picky eater (so was/am I). I have never made him eat anything he did not<br/>\nwant to (my parents were very controlling about making me eat things I did not like).<br/>\nWe have lots of conversations about how mommy did not like many things when she was<br/>\nlittle, but tastes change as you get older. He is pretty open to trying new things, but <br/>\nI do not force him. The funny thing, I started out, when he was little, planning on letting<br/>\nhim eat what he wanted. I remember when he was 2, being vindicated in front of my mother<br/>\nwhen I let him have some birthday cake *before*  lunch and he still ate all of his <br/>\nlunch. However as he got older, I panicked about the junk food thing and started <br/>\nrestricting it. sigh.<br/>\n<br/>\nThanks again...I may come back for support before he finds his balance. Why is my opinion of myself as a mother so tied up in what my children eat?<br/>\n<br/>\nStephanie E.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"wisdom and excellent writing","postDate":"1036441129","msgId":10282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5YS5iMTRmZTc1LjJhZjgzMDI5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":10337,"prevInTime":10281,"nextInTime":10283,"topicId":10282,"numMessagesInTopic":0,"msgSnippet":"Quote: One thing I did and still do is make sure there is other food ready all the time.  Little kids don t like to wait for food,  and even at ten, when he","messageBody":"<div id=\"ygrps-yiv-1950824552\">Quote:<br/>\n<br/>\nOne thing I did and still do is make sure there is other food ready all<br/>\nthe time.  Little kids don&#39;t like to wait for food,  and even at ten,<br/>\nwhen he knows how to make so many things, my son still sometimes prefers<br/>\nfast.<br/>\n<br/>\nI make a sandwich or two in the morning and cut it and wrap it separately<br/>\nand have it in the fridge, ready to grab.   I wash fruit and leave it on<br/>\nthe counter.   I wash grapes and carrots and put them into little zip loc<br/>\nbags.  I always have bananas and nuts and seeds.     <br/>\n<br/>\nKids will balance their food consumption naturally as long as they have<br/>\nchoices.  If the only choice for quick and handy food is chips, etc. then<br/>\nthat&#39;s what they&#39;ll eat.  If  other choices are just as quick and handy<br/>\nthey get equal consideration.  <br/>\n<br/>\nIt works!  You&#39;ll survive.  = )<br/>\n<br/>\nDeb L    &gt;&gt;</div>","specialLinks":[]}],"prevTopicId":10334,"nextTopicId":10343}}