{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":70316959,"authorName":"AimeeL73@cs.com","from":"AimeeL73@...","profile":"aimeel73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning Lessons from life","postDate":"1064422940","msgId":81441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ZC4xYTliNzM2NS4yY2EzMjgxY0Bjcy5jb20+"},"prevInTopic":81411,"nextInTopic":0,"prevInTime":81440,"nextInTime":81442,"topicId":81330,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/23/03 10:46:49 PM Central Daylight Time, ... Hi Amy, guess what my name is?  *grin* I ve read Quinn s books as well, and I LOVE THEM.  If","messageBody":"<div id=\"ygrps-yiv-1932317275\">In a message dated 9/23/03 10:46:49 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:arcarpenter@...\">arcarpenter@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; And now I have to laugh at myself, because I&#39;m just so pleased with <br/>\n&gt; everything I just wrote here that I&#39;m envisioning the responses:  &quot;wow, <br/>\n&gt; you&#39;ll have no <br/>\n&gt; trouble with unschooling,&quot; and &quot;what was that book again?&quot;  Probably not, <br/>\n&gt; huh? <br/>\n&gt; But it is exciting for me as I&#39;m integrating these ideas into how I interact <br/>\n&gt; <br/>\n&gt; with the world, and I&#39;m very interested in feedback and yes, criticism.<br/>\n&gt; <br/>\n&gt; I&#39;m pressing send now.  Bring it on.  &lt;g&gt;<br/>\n&gt; <br/>\n&gt; Peace,<br/>\n&gt; Amy<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>Hi Amy, guess what my name is?  *grin*<br/>\n<br/>\nI&#39;ve read Quinn&#39;s books as well, and I LOVE THEM.  If I believed in required <br/>\nreading, they would be on everyone&#39;s shelves, as a wake up call to the way we <br/>\nare living.  <br/>\n<br/>\nI&#39;m interested in others&#39; responses.  <br/>\n<br/>\n~Aimee in IL <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning Lessons from life","postDate":"1064415416","msgId":81411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE5LjQ4NzkwN2Q1LjJjYTMwYWI4QGFvbC5jb20+"},"prevInTopic":81382,"nextInTopic":81441,"prevInTime":81410,"nextInTime":81412,"topicId":81330,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/23/03 10:47:07 PM Central Daylight Time, arcarpenter@cs.com writes: In a message dated 9/23/03 6:53:13 PM Eastern Daylight Time, ... You","messageBody":"<div id=\"ygrps-yiv-1889559373\">In a message dated 9/23/03 10:47:07 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:arcarpenter@...\">arcarpenter@...</a> writes:<br/>\nIn a message dated 9/23/03 6:53:13 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; Not all &quot;good&quot; and &quot;bad&quot; are cultural.  If <br/>\n&gt; they were, babies would have nothing to cry about until someone else had <br/>\n&gt; taught them what to expect.  Food is better than lack of food.  Warmth is <br/>\n&gt; better <br/>\n&gt; than freezing cold.<br/>\n<br/>\n </span></blockquote>You use the terms &quot;good&quot; and &quot;bad&quot; and then talk about behaviors of basic <br/>\nsurvival.  Babies don&#39;t cry because their hunger is universally bad -- they <br/>\ncry <br/>\nto be fed and therefore to survive.  But, if that baby lives in North America <br/>\nor Western Europe, she will grow up to consume more than her share of the <br/>\nworld&#39;s resources.  Rainforests will be destroyed so that she and her peers, <br/>\nat 21, <br/>\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%<br/>\n<br/>\nI don&#39;t know exactly where the environmental impact part of your post comes <br/>\ninto play with responding to Sandra&#39;s post, but as to the first part, have you <br/>\nread Jean Liedloff&#39;s book *The Continuum Concept*? It deals with the heart of <br/>\nwhat Sandra stated in this part of her post. I am currently rereading the book <br/>\nfor the umpteenth time, and I have just read the part dealing with the very <br/>\nnature of a baby&#39;s reality in his or her own continuum. She writes in matters <br/>\nconcerning a newborn infant; &quot;Again, the quality of his awareness is very <br/>\ndifferent from what it will become. He cannot qualify his impression of how things <br/>\nare. Either they are right or not right. Requirements are strict at this early <br/>\ndate. As we have seen, he cannot hope, if he is uncomfortable now, that he <br/>\nwill be comfortable later. He cannot feel that &quot;mother will be right back&quot; when <br/>\nshe leaves him; the world has suddenly gone wrong, conditions are intolerable. <br/>\nHe hears and accepts his own weeping, but although his mother knows the sound <br/>\nand its meaning since time immemorial, and so does any child or adult who <br/>\nhears it, he does not. He only senses that it is a positive action toward setting <br/>\nthings right. But if he is left to cry for too long, if the response it is <br/>\nmeant to elicit does not come, that feeling departs as well, giving way to utter <br/>\nbleakness without time or hope. When his mother does come to him, he simply <br/>\nfeels right, he is not aware that she has been away, nor does h e remember <br/>\nhaving cried. He is reconnected to his lifeline and his environment meets his <br/>\nexpectations. When he is abandoned, put out of his continuum of correct <br/>\nexperience, nothing is acceptable, and nothing is accepted. Want is all there is, there <br/>\nis nothing to use, to grow on, to fulfill his requirement for experience, for <br/>\nthe experiences must be expected ones...&quot; and a little while later she writes; <br/>\n&quot;If he feels safe, wanted, and &quot;at home&quot; in the midst of activity before he <br/>\ncan think, his view of later experiences will be very distinct in character <br/>\nfrom those of a child who feels unwelcome, unstimulated by the experiences he has <br/>\nmissed, and accustomed to living in a state of want, though the later <br/>\nexperiences of both may be identical. At first, the infant only notices; he cannot <br/>\nreason. He becomes familiar with his surroundings by association. At the very <br/>\noutset, in the first postnatal messages brought in by the senses, there is an <br/>\nabsoluteness, an unqualified impression of the state of things, relative to <br/>\nnothing but the innate expectations of the infant and, of course, devoid of any <br/>\nrelation to the passage of time.&quot; <br/>\n<br/>\nSo Sandra&#39;s hypothetical baby cries from its innate expectations. Gradually <br/>\nthe baby learns that certain actions elicit a positive response. If those <br/>\ninnate expectations were not present at or even before birth, then babies since <br/>\ntime immemorial would have no need to cry until someone taught them that they <br/>\nshould expect some things to happen. As it is, babies, all of them, have a <br/>\nnatural expectation that food and warmth are basic requirements in their continuum, <br/>\nand if not met, they cry. At first not knowing why they cry or even <br/>\nremembering that they did cry, but gradually learning that the cry begets a response. A <br/>\nyoung baby without the power of reason cannot hope to know the passage of <br/>\ntime, as it has no experience of time. It isn&#39;t until much later that time has <br/>\nmeaning in dealing with the basic needs. An infant has no knowledge of time only <br/>\nthat something is either right or wrong, good or bad at this moment. A five <br/>\nyear old has a much better concept, yet still not fully realized. A promise of a <br/>\nspecial want at a future date (to use Liedloff&#39;s example, a bike at Christmas <br/>\npromised in August) means little to a five year old, almost as if there were <br/>\nno promise at all, but hope is beginning to be established. As hope can only <br/>\nbe established with the passage and realization of time. For without time there <br/>\nis no hope. An infant knows no time, therefore has no hope, but does have <br/>\ninnate expectations. A ten year old on the other hand experiences time better and <br/>\ncan understand August, September, October, November, December. Although for a <br/>\nten year old, the wait, the hope, is still prolonged. <br/>\n<br/>\nIf you haven&#39;t read the book, I strongly suggest doing so. But that is just <br/>\nmy two cents. &lt;g&gt; I could be way off track in interpreting what you were trying <br/>\nto say.<br/>\n<br/>\n~Nancy<br/>\n<br/>\nHe felt that his whole life was some kind of dream and he sometimes wondered <br/>\nwhose it was and whether they were enjoying it.<br/>\nDouglas Adams <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":3270790,"authorName":"JenV72","from":"&quot;JenV72&quot; &lt;jvaitkus@...&gt;","profile":"JenV72","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Learning Lessons from life","postDate":"1064375116","msgId":81382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrcjQwYytyN2UxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJrcW9yZStnZHUyQGVHcm91cHMuY29tPg=="},"prevInTopic":81381,"nextInTopic":81411,"prevInTime":81381,"nextInTime":81383,"topicId":81330,"numMessagesInTopic":0,"msgSnippet":"Hi Julie, I do understand your points.  There are so many ways of looking at things, and I totally agree with you that we all make sense of our exitsence in","messageBody":"<div id=\"ygrps-yiv-1473842723\">Hi Julie,<br/>\n  I do understand your points.  There are so many ways of looking at <br/>\nthings, and I totally agree with you that we all make sense of our <br/>\nexitsence in ways that bring us peace and comfort.  I don&#39;t believe <br/>\nwe&#39;ll ever know what the truth is, or thruths are, about our life on <br/>\nthis earth until we&#39;ve left (even this point will bring disagreement <br/>\nwith some...that&#39;s fine).  There is so much we don&#39;t understand, and <br/>\nyes, trying to put &quot;meaning&quot; to everything can be quite tiresome at <br/>\nleast. And putting meaning to many things brings me peace and <br/>\ncomfort.  <br/>\n   I&#39;m not going to answer all your questions here one this list, <br/>\nbut if you&#39;re really interested in my ideas you can email me <br/>\nprivately (but please don&#39;t feel like you should if you really don&#39;t <br/>\nwant to, I wouldn&#39;t be hurt :)<br/>\n<br/>\nHave a great day,<br/>\nJennifer<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Julie Bogart&quot; <br/>\n&lt;julie@b...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Stop me, stop me. I can&#39;t help myself. :)<br/>\n&gt; <br/>\n&gt; Jen, I&#39;m currently studying some of these issues in a grad <br/>\n&gt; school program so I offer my thoughts here not to rebut you per <br/>\n&gt; se, but because your post triggered some of the reading I&#39;m <br/>\n&gt; doing. Hope that&#39;s okay.<br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;JenV72&quot; <br/>\n&gt; &lt;jvaitkus@h...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt;    Louise Hay has written a really neat book about the <br/>\n&gt; &gt; metaphysical/spiritual reasons for different ailments.  Just for <br/>\n&gt; fun <br/>\n&gt; &gt; I looked up leg problems (a broken bone would certainly be a <br/>\n&gt; &gt; problem).  She suggested that since legs carry us through life, <br/>\n&gt; a <br/>\n&gt; &gt; leg problem would be the result of fear of the furture and not <br/>\n&gt; &gt; wanting to move. <br/>\n&gt; <br/>\n&gt; While this idea may be supportive ahd helpful as a point of <br/>\n&gt; reflection, doesn&#39;t it also try to mitigate against the feeling of <br/>\n&gt; being out of control that breaking a leg produces?<br/>\n&gt; <br/>\n&gt; Much of religious thought over the centuries is about gaining <br/>\n&gt; control over the unforeseen. And much of it is comforting and <br/>\n&gt; often even useful for reflection. The caution I have in myself <br/>\n </span></blockquote>now, <br/>\n<blockquote><span title=\"ireply\"> &gt; though, is to beleive that these ideas are axiomatic혰that a <br/>\n&gt; broken leg equals fear of the future and not wanting to move. If <br/>\n&gt; we believe that it actually means those things, we will become <br/>\n&gt; perfectionists in our attempts to control our emotions, thoughts, <br/>\n&gt; beliefs and ideas to prevent bad things from occuring, when in <br/>\n&gt; reality there isn&#39;t a belief system/healthy emotional life system <br/>\n </span></blockquote>on <br/>\n<blockquote><span title=\"ireply\"> &gt; the planet that protects anyone from harm or evil.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt;    The deeper reason for things happening might not always be <br/>\n&gt; to <br/>\n&gt; &gt; learn a lesson, it may be to keep something else from <br/>\n&gt; happening.  <br/>\n&gt; &gt; Let&#39;s say someone is planning a vacation, but got sick.  That <br/>\n&gt; sucks, <br/>\n&gt; &gt; the vacation was to Hawaii and was going to be awesome.  <br/>\n&gt; &gt; Later that night he hears on the news that the plane he was <br/>\n&gt; supposed <br/>\n&gt; &gt; to take to Hawaii crashed, no survivors....it wasn&#39;t his time to <br/>\n&gt; die.<br/>\n&gt; <br/>\n&gt; But it was everyone else&#39;s time to die? I remember after 9/11 <br/>\n&gt; hearing of the miraculous escapes of some of the survivors. <br/>\n&gt; Several attributed those narrow escapes to God as preserving <br/>\n&gt; his/her life. How does someone else see the loss of their loved <br/>\n&gt; one&#39;s life혰God didn&#39;t protect, care, save? That it was their <br/>\n&gt; &quot;time&quot;?<br/>\n&gt; <br/>\n&gt; I had a friend who told me that her best friend died of cancer <br/>\n </span></blockquote>after <br/>\n<blockquote><span title=\"qreply\"> &gt; the whole church community had prayed for her. This friend of <br/>\n&gt; mine was very ill at the time. She said that God taught her <br/>\n&gt; through her friend&#39;s death that she must learn to trust God more <br/>\n&gt; so she wouldn&#39;t die.<br/>\n&gt; <br/>\n&gt; For me, this felt strange and wrong. Better to mourn the lost life <br/>\n&gt; and to face illness honestly than to assume God is orchestrating <br/>\n&gt; death for one so that the living person would learn to trust God <br/>\n&gt; better than the dead one did.<br/>\n&gt; <br/>\n&gt; &gt;   Have you ever heard people who are trying to buy a house <br/>\n&gt; say.  I&#39;m <br/>\n&gt; &gt; so glad we didn&#39;t get that last one, THIS is the right house for <br/>\n&gt; us.<br/>\n&gt; <br/>\n&gt; And have you heard of the ones who almost got their dream <br/>\n&gt; home when someone else got it and they had to settle for a <br/>\n&gt; lesser home? (My sister comes to mind...)<br/>\n&gt; <br/>\n&gt; In the end, we all make sense of our exitsence in ways that bring <br/>\n&gt; us peace and comfort. For me, it became too uncomfortable to <br/>\n&gt; try to fit every circumstance into a &quot;meaning&quot; package.<br/>\n&gt; <br/>\n&gt; Julie B </span></blockquote></div>","specialLinks":[]},{"userId":77662315,"authorName":"arcarpenter@cs.com","from":"arcarpenter@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning Lessons from life","postDate":"1064374385","msgId":81380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjYi4xMTVjOWZmZS4yY2EyNmE3MUBjcy5jb20+"},"prevInTopic":81363,"nextInTopic":81381,"prevInTime":81379,"nextInTime":81381,"topicId":81330,"numMessagesInTopic":0,"msgSnippet":"Hi all, My name is Amy, from Grand Rapids, Michigan.  I am not yet an unschooler, but am really just to the point of deciding where and how the necessary","messageBody":"<div id=\"ygrps-yiv-510500254\">Hi all,<br/>\n<br/>\nMy name is Amy, from Grand Rapids, Michigan.  I am not yet an unschooler, but <br/>\nam really just to the point of deciding where and how the necessary changes <br/>\nwill take place -- I may bring that up later.  My oldest son Fisher is <br/>\ncurrently in first grade at a charter school.  My younger son Riley is only three <br/>\nmonths -- his unschooling involves watching us bigheads until he gets too tired.  &lt;<br/>\ng&gt;<br/>\n<br/>\nI have been reading posts on this list for a little less than a week.  I, <br/>\nlike Holly, take myself with a huge grain of salt -- so big, it would give the <br/>\nwhole list high blood pressure.  But I&#39;m interested in pursuing a line of <br/>\nthought here, so I&#39;m going to give it a whirl.  &lt;g&gt;  I&#39;ve been reading the _Ishmael_ <br/>\nseries by Daniel Quinn, and found them very intriguing, even life- and <br/>\nworldview-changing.  They are meant to be a series of philosophical treatises, <br/>\ncouched in novel form.  (Hey, it worked for Plato.)  In my response below I&#39;ve <br/>\npulled out some of the ideas.<br/>\n<br/>\nIn a message dated 9/23/03 6:53:13 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; Not all &quot;good&quot; and &quot;bad&quot; are cultural.  If <br/>\n&gt; they were, babies would have nothing to cry about until someone else had <br/>\n&gt; taught them what to expect.  Food is better than lack of food.  Warmth is <br/>\n&gt; better <br/>\n&gt; than freezing cold.<br/>\n<br/>\n </span></blockquote>You use the terms &quot;good&quot; and &quot;bad&quot; and then talk about behaviors of basic <br/>\nsurvival.  Babies don&#39;t cry because their hunger is universally bad -- they cry <br/>\nto be fed and therefore to survive.  But, if that baby lives in North America <br/>\nor Western Europe, she will grow up to consume more than her share of the <br/>\nworld&#39;s resources.  Rainforests will be destroyed so that she and her peers, at 21, <br/>\ncan have a cappucino before their first college class of the day.  That could <br/>\nbe considered bad, especially by the inhabitants of the rainforest.  (And no, <br/>\nI&#39;m not in favor of  depriving starving babies, North American or otherwise.  <br/>\nStick with me, I&#39;m trying to get to the &quot;useful&quot; part.)  Eventually, because <br/>\nI&#39;m told that the planet needs the biological diversity found in rainforests <br/>\n(and in other ecosystems that we often destroy for our food and our raw <br/>\nmaterials), this will be bad for the survival of the planet.<br/>\n<br/>\nIf that crying baby belongs to the !Kung in Africa, however, she will have <br/>\nvery little ecological impact -- her people still live within the limits of the <br/>\necosystem, still control their population and the damage they do to the <br/>\nenvironment.  That could be considered to be, if not good, at least not harmful.<br/>\n<br/>\nMy point:  much of the &quot;beliefs&quot; discussion on this list has dealt with world <br/>\nreligions that are only six to eight thousand years old -- a blip on the <br/>\nscreen when it comes to the whole of human history that could inform our beliefs.  <br/>\nBecause the major world religions (Hinduism, a variation of which Judie <br/>\nseemed to be espousing; Buddhism, Jainism, Taoism, Zoroastrianism, Judaism, <br/>\nChristianity, Islam, neo-Paganism, if not Paganism  -- I&#39;m most certainly missing <br/>\nsome) have all come about in cultures in which humans were not living within the <br/>\nlaws of the community of life, they have all had to address humans as flawed <br/>\nbeings, as capable of evil, which many of them have elevated to The Question of <br/>\nEvil.  Because of that, they can get pretty goofy.  For instance, one way <br/>\nI&#39;ve heard the central tenet of Christianity paraphrased is that God so loved the <br/>\nworld that he committed divine child abuse .  Or in Hinduism, souls that are <br/>\nworking their way to enlightenment may choose incarnations (or be sentenced to <br/>\nincarnations) that seem awful, but all is as it is supposed to be.  And so <br/>\nthe mostly Hindu nation of India lives with the Untouchables.  <br/>\n<br/>\n(I should clarify that I think faith and religion are amazing things, because <br/>\nthey are an expression of the natural capacity for spirituality that lives in <br/>\nhumans.  It&#39;s just that they can be reduced to some statements that are <br/>\nreally weird, even harmful [to humans].) <br/>\n<br/>\nBut there may be more useful insights when one goes back to the <br/>\nevolutionarily stable way that humans lived for nearly three million years before the <br/>\nagricultural revolution.  Insights like: Take only what you need;  Limit your <br/>\npopulation size;  Live by the laws of your tribe, but don&#39;t assume you can tell <br/>\nother tribes how to live;  As you eat one day, you may be eaten on another, so <br/>\nyou might want to come to terms with death as a very real part of life.  (And <br/>\nworld religions and their practitioners often confuse death with evil, it <br/>\nseems.)  So in unschooling and in life, it might be useful to extend the models for <br/>\nmaking choices.  I&#39;m not saying that we will return to a hunter/gatherer <br/>\nlifestyle, but that we can learn and envision and create a way of life that is not <br/>\ninherently destructive to the planet or ourselves.<br/>\n<br/>\nAnd now I have to laugh at myself, because I&#39;m just so pleased with <br/>\neverything I just wrote here that I&#39;m envisioning the responses:  &quot;wow, you&#39;ll have no <br/>\ntrouble with unschooling,&quot; and &quot;what was that book again?&quot;  Probably not, huh? <br/>\n But it is exciting for me as I&#39;m integrating these ideas into how I interact <br/>\nwith the world, and I&#39;m very interested in feedback and yes, criticism.<br/>\n<br/>\nI&#39;m pressing send now.  Bring it on.  &lt;g&gt;<br/>\n<br/>\nPeace,<br/>\nAmy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":66835036,"authorName":"RJHill241@aol.com","from":"RJHill241@...","profile":"rjhill241","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning Lessons from life","postDate":"1064372138","msgId":81381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMi4yNGU2MzkzNi4yY2EyNjFhYUBhb2wuY29tPg=="},"prevInTopic":81380,"nextInTopic":81382,"prevInTime":81380,"nextInTime":81382,"topicId":81330,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/23/03 7:52:07 PM Pacific Daylight Time, leschke@shaw.ca ... I wanted to be sure you were hearing me!! Thanx for the laugh Tia! I needed ","messageBody":"<div id=\"ygrps-yiv-927715552\">In a message dated 9/23/03 7:52:07 PM Pacific Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Rhonda, you&#39;ve got to stop yelling at me.  &lt;g&gt;<br/>\n&gt; Tia<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I wanted to be sure you were hearing me!! Thanx for the laugh Tia! I needed <br/>\nit.<br/>\n<br/>\nRhonda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Learning Lessons from life","postDate":"1064367453","msgId":81363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdkLjNlM2EyOGViLjJjYTI0ZjVkQGFvbC5jb20+"},"prevInTopic":81355,"nextInTopic":81380,"prevInTime":81362,"nextInTime":81364,"topicId":81330,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/23/03 5:45:58 PM, jvaitkus@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-843857817\">In a message dated 9/23/03 5:45:58 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jvaitkus@...\">jvaitkus@...</a> writes:<br/>\n<br/>\n&lt;&lt;    Louise Hay has written a really neat book about the <br/>\n<br/>\nmetaphysical/spiritual reasons for different ailments.  Just for fun <br/>\n<br/>\nI looked up leg problems (a broken bone would certainly be a <br/>\n<br/>\nproblem).  &gt;&gt;<br/>\n<br/>\nBut not a psychosomatic problem, nor a blockage of chi or such, as those <br/>\ntheories deal in.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Learning Lessons from life","postDate":"1064363694","msgId":81355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrcW9yZStnZHUyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGJrcWxuOCsyanF1QGVHcm91cHMuY29tPg=="},"prevInTopic":81351,"nextInTopic":81363,"prevInTime":81354,"nextInTime":81356,"topicId":81330,"numMessagesInTopic":0,"msgSnippet":"Stop me, stop me. I can t help myself. :) Jen, I m currently studying some of these issues in a grad school program so I offer my thoughts here not to rebut","messageBody":"<div id=\"ygrps-yiv-814241983\">Stop me, stop me. I can&#39;t help myself. :)<br/>\n<br/>\nJen, I&#39;m currently studying some of these issues in a grad <br/>\nschool program so I offer my thoughts here not to rebut you per <br/>\nse, but because your post triggered some of the reading I&#39;m <br/>\ndoing. Hope that&#39;s okay.<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;JenV72&quot; <br/>\n&lt;jvaitkus@h...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    Louise Hay has written a really neat book about the <br/>\n&gt; metaphysical/spiritual reasons for different ailments.  Just for <br/>\n </span></blockquote>fun <br/>\n<blockquote><span title=\"ireply\"> &gt; I looked up leg problems (a broken bone would certainly be a <br/>\n&gt; problem).  She suggested that since legs carry us through life, <br/>\n </span></blockquote>a <br/>\n<blockquote><span title=\"ireply\"> &gt; leg problem would be the result of fear of the furture and not <br/>\n&gt; wanting to move. <br/>\n<br/>\n </span></blockquote>While this idea may be supportive ahd helpful as a point of <br/>\nreflection, doesn&#39;t it also try to mitigate against the feeling of <br/>\nbeing out of control that breaking a leg produces?<br/>\n<br/>\nMuch of religious thought over the centuries is about gaining <br/>\ncontrol over the unforeseen. And much of it is comforting and <br/>\noften even useful for reflection. The caution I have in myself now, <br/>\nthough, is to beleive that these ideas are axiomatic혰that a <br/>\nbroken leg equals fear of the future and not wanting to move. If <br/>\nwe believe that it actually means those things, we will become <br/>\nperfectionists in our attempts to control our emotions, thoughts, <br/>\nbeliefs and ideas to prevent bad things from occuring, when in <br/>\nreality there isn&#39;t a belief system/healthy emotional life system on <br/>\nthe planet that protects anyone from harm or evil.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    The deeper reason for things happening might not always be <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; learn a lesson, it may be to keep something else from <br/>\n </span></blockquote>happening.  <br/>\n<blockquote><span title=\"ireply\"> &gt; Let&#39;s say someone is planning a vacation, but got sick.  That <br/>\n </span></blockquote>sucks, <br/>\n<blockquote><span title=\"ireply\"> &gt; the vacation was to Hawaii and was going to be awesome.  <br/>\n&gt; Later that night he hears on the news that the plane he was <br/>\n </span></blockquote>supposed <br/>\n<blockquote><span title=\"ireply\"> &gt; to take to Hawaii crashed, no survivors....it wasn&#39;t his time to <br/>\n </span></blockquote>die.<br/>\n<br/>\nBut it was everyone else&#39;s time to die? I remember after 9/11 <br/>\nhearing of the miraculous escapes of some of the survivors. <br/>\nSeveral attributed those narrow escapes to God as preserving <br/>\nhis/her life. How does someone else see the loss of their loved <br/>\none&#39;s life혰God didn&#39;t protect, care, save? That it was their <br/>\n&quot;time&quot;?<br/>\n<br/>\nI had a friend who told me that her best friend died of cancer after <br/>\nthe whole church community had prayed for her. This friend of <br/>\nmine was very ill at the time. She said that God taught her <br/>\nthrough her friend&#39;s death that she must learn to trust God more <br/>\nso she wouldn&#39;t die.<br/>\n<br/>\nFor me, this felt strange and wrong. Better to mourn the lost life <br/>\nand to face illness honestly than to assume God is orchestrating <br/>\ndeath for one so that the living person would learn to trust God <br/>\nbetter than the dead one did.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   Have you ever heard people who are trying to buy a house <br/>\n </span></blockquote>say.  I&#39;m <br/>\n<blockquote><span title=\"ireply\"> &gt; so glad we didn&#39;t get that last one, THIS is the right house for <br/>\n </span></blockquote>us.<br/>\n<br/>\nAnd have you heard of the ones who almost got their dream <br/>\nhome when someone else got it and they had to settle for a <br/>\nlesser home? (My sister comes to mind...)<br/>\n<br/>\nIn the end, we all make sense of our exitsence in ways that bring <br/>\nus peace and comfort. For me, it became too uncomfortable to <br/>\ntry to fit every circumstance into a &quot;meaning&quot; package.<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Learning Lessons from life","postDate":"1064362633","msgId":81351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrcW5xOStuMGozQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM5LjM3YzFhMzFlLjJjYTIxMDZjQGFvbC5jb20+"},"prevInTopic":81347,"nextInTopic":81355,"prevInTime":81350,"nextInTime":81352,"topicId":81330,"numMessagesInTopic":0,"msgSnippet":"... something ... teach us something. ... valuable lesson ... how can we ... My question for this belief system (one that I was schooled in in CA in the 70s","messageBody":"<div id=\"ygrps-yiv-1517641222\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, <br/>\nSandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 9/23/03 7:43:50 AM, sjogy@s... writes:<br/>\n&gt; <br/>\n&gt; &lt;&lt; I think there&#39;s a big difference between saying that you learn <br/>\n </span></blockquote>something<br/>\n<blockquote><span title=\"ireply\"> &gt; from every experience and experiences happen IN ORDER to <br/>\n </span></blockquote>teach us something.<br/>\n<blockquote><span title=\"ireply\"> &gt; Many things happen for no reason, but you can still take a <br/>\n </span></blockquote>valuable lesson<br/>\n<blockquote><span title=\"ireply\"> &gt; from them. &gt;&gt;<br/>\n&gt; <br/>\n&gt; VERY true.<br/>\n&gt; <br/>\n&gt; If we don&#39;t believe people can learn from random happenings, <br/>\n </span></blockquote>how can we <br/>\n<blockquote><span title=\"ireply\"> &gt; possibly believe in unschooling?<br/>\n<br/>\n<br/>\n </span></blockquote>My question for this belief system (one that I was schooled in in <br/>\nCA in the 70s through est) is if we choose everything (and the <br/>\npermutation that we choose it all before even being born) what&#39;s <br/>\nthe point of lessons anyway? Who cares if I learn anything? To <br/>\nwhat end?<br/>\n<br/>\nWhy would I choose to break my leg to learn how to, what, <br/>\nrecover from leg-breakings? Why would I choose to have my <br/>\nhusband cheat on me so that I could, what, experience the pain <br/>\nand suffering of divorce? Then when I learned the lessons, what <br/>\ndo they produce? <br/>\n<br/>\nAnd a corollary: how does learning something from choices <br/>\nmade before birth look or feel any different than being dealt a <br/>\nrandom set of circumstances that we learn from as we go?<br/>\n<br/>\nLearning is the nature of living. Choosing in pre-existence or <br/>\nfacing dilemmas after being born? What&#39;s the diff?<br/>\n<br/>\nJulie B</div>","specialLinks":[]},{"userId":3270790,"authorName":"JenV72","from":"&quot;JenV72&quot; &lt;jvaitkus@...&gt;","profile":"JenV72","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Learning Lessons from life","postDate":"1064360488","msgId":81347,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrcWxuOCsyanF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGM5LjM3YzFhMzFlLjJjYTIxMDZjQGFvbC5jb20+"},"prevInTopic":81330,"nextInTopic":81351,"prevInTime":81346,"nextInTime":81348,"topicId":81330,"numMessagesInTopic":0,"msgSnippet":"To fully understand the lesson, one needs to look deeper than just the surface/physical aspects of life that are affected.  If a sickness or injury occurs","messageBody":"<div id=\"ygrps-yiv-306650812\">To fully understand the lesson, one needs to look deeper than <br/>\njust the surface/physical aspects of life that are affected.  If a <br/>\nsickness or injury occurs maybe it is your body/mind/soul <br/>\nsaying &quot;You need to slow down and rest.  YOu are taking on too <br/>\nmuch.  YOu need to spend some time working on the inside and less on <br/>\nthe outside world for awhile.  I&#39;ve been trying to send this message <br/>\nin other ways, but you haven&#39;t listened.  Now I need to give a <br/>\nlouder message&quot;. <br/>\n   Louise Hay has written a really neat book about the <br/>\nmetaphysical/spiritual reasons for different ailments.  Just for fun <br/>\nI looked up leg problems (a broken bone would certainly be a <br/>\nproblem).  She suggested that since legs carry us through life, a <br/>\nleg problem would be the result of fear of the furture and not <br/>\nwanting to move. <br/>\nOf course not everyone would like a book like this, but I find it <br/>\nquite right on for myself.  <br/>\n   The deeper reason for things happening might not always be to <br/>\nlearn a lesson, it may be to keep something else from happening.  <br/>\nLet&#39;s say someone is planning a vacation, but got sick.  That sucks, <br/>\nthe vacation was to Hawaii and was going to be awesome.  <br/>\nLater that night he hears on the news that the plane he was supposed <br/>\nto take to Hawaii crashed, no survivors....it wasn&#39;t his time to die.<br/>\n  Have you ever heard people who are trying to buy a house say.  I&#39;m <br/>\nso glad we didn&#39;t get that last one, THIS is the right house for us.<br/>\n<br/>\nJust a few more ideas....<br/>\n<br/>\n-Jennifer V<br/>\nps Eastern philosophies often discuss predestination.  I just say <br/>\nthis because I believe there was earlier dicussion about the idea of <br/>\npredestination being new...maybe I&#39;m incorrect though.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I got a couple of people saying something like that to me after I <br/>\n </span></blockquote>broke my <br/>\n<blockquote><span title=\"ireply\"> &gt; leg last year.  It was irritating.  What I needed to learn, I <br/>\n </span></blockquote>think, is that wet <br/>\n<blockquote><span title=\"ireply\"> &gt; ramps in climates where slippy-slime can grow will be slippery <br/>\n </span></blockquote>like nothing <br/>\n<blockquote><span title=\"ireply\"> &gt; ever seen in New Mexico.<br/>\n&gt; <br/>\n&gt; I learned that we need a bigger door into our downstairs bathroom.<br/>\n&gt; <br/>\n&gt; I learned that my kids can&#39;t make much food beyond a hot dog, <br/>\n </span></blockquote>peanut butter <br/>\n<blockquote><span title=\"ireply\"> &gt; sandwich, Ramen and scrambled eggs.  I learned I can get really <br/>\n </span></blockquote>tired of that <br/>\n<blockquote><span title=\"qreply\"> &gt; menu.<br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Learning Lessons from life (was some digest xtyx240698)","postDate":"1064351340","msgId":81330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5LjM3YzFhMzFlLjJjYTIxMDZjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":81347,"prevInTime":81329,"nextInTime":81331,"topicId":81330,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/23/03 7:43:50 AM, sjogy@sbcglobal.net writes: ","messageBody":"<div id=\"ygrps-yiv-226112425\">In a message dated 9/23/03 7:43:50 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sjogy@...\">sjogy@...</a> writes:<br/>\n<br/>\n&lt;&lt; I think there&#39;s a big difference between saying that you learn something<br/>\nfrom every experience and experiences happen IN ORDER to teach us something.<br/>\nMany things happen for no reason, but you can still take a valuable lesson<br/>\nfrom them. &gt;&gt;<br/>\n<br/>\nVERY true.<br/>\n<br/>\nIf we don&#39;t believe people can learn from random happenings, how can we <br/>\npossibly believe in unschooling?<br/>\n<br/>\nIf we needed to plan out our entire curriculum before being born...  yeeeesh!<br/>\n<br/>\n&lt;&lt;Many years ago, someone blew up a house I was living in. Some people<br/>\nactually asked me what it was about my life that caused that to happen. I<br/>\nhave learned many things through having had that experience, but no one<br/>\ncould ever convince me that there was anything about my life that CAUSED<br/>\nthat.&gt;&gt;<br/>\n<br/>\nI got a couple of people saying something like that to me after I broke my <br/>\nleg last year.  It was irritating.  What I needed to learn, I think, is that wet <br/>\nramps in climates where slippy-slime can grow will be slippery like nothing <br/>\never seen in New Mexico.<br/>\n<br/>\nI learned that we need a bigger door into our downstairs bathroom.<br/>\n<br/>\nI learned that my kids can&#39;t make much food beyond a hot dog, peanut butter <br/>\nsandwich, Ramen and scrambled eggs.  I learned I can get really tired of that <br/>\nmenu.<br/>\n<br/>\nI took it not as sympathy but as irritating insult that I was hurt in order <br/>\nto teach me a lesson.  Seemed to me someone had paid for me to go and speak to <br/>\npeople who really wanted to hear me.  There are still people who were greatly <br/>\nput out by my missing that conference to be in the hospital, so if anyone on <br/>\nthis list was one of the people who said &quot;I guess there was some lesson the <br/>\nuniverse needed to teach you,&quot; you don&#39;t need to confess because I don&#39;t remember <br/>\nwho said it.  Keep it to yourself forever, if you can.<br/>\n<br/>\nI think people are born randomly and they live in a random world where they <br/>\ntry constantly to find patterns (because that&#39;s what people do) and sometimes <br/>\nthey get all excited about a pattern or theory (about causation or death or <br/>\nlife or afterlife) and they start making decisions based on their theory.<br/>\n<br/>\nBecause of that, people have thought that human behavior has caused tornados, <br/>\nearthquakes, volcanos, floods and fires.  They REALLY believe that because <br/>\npeople were bad, or prayed wrong, or didn&#39;t sacrifice a sheep or a cow or a <br/>\nvirgin girl, that something invisible but powerful was going to dip them in hot <br/>\nlava, or shake their houses down.  Some people have little tiny versions of <br/>\nthat: lucky socks, wearing a certain ring or bracelet or shirt, whatever it is, <br/>\nthere are magic talismans in use even by the most scientific of people.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":81438,"nextTopicId":80734}}