{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"LisaCaryl@xxx.xxx","from":"LisaCaryl@...","replyTo":"LIST","senderId":"DXPqLy6pv258qFZFbec7hYp_uXqBau5PDsSfRvkfvKJfri5JY1dtdAaLU-GsBTw9GeKnKWfy8kU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Colfaxes","postDate":"930508704","msgId":1297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy45OC4xMjk3Ljk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":1296,"nextInTime":1298,"topicId":1297,"numMessagesInTopic":0,"msgSnippet":"... children were particularly shining examples of success.  I still think the Colfaxes succeeded, but my definition of success has changed somewhat. People","messageBody":"<div id=\"ygrps-yiv-185948546\"><blockquote><span title=\"ireply\">&gt;&gt;I used to tell people to read the Colfax books because I thought their<br/>\n </span></blockquote>children were particularly shining examples of success.  I still think the<br/>\nColfaxes succeeded, but my definition of success has changed somewhat. <br/>\n <br/>\nPeople who see success as achieving social status and a lot of money will<br/>\nno doubt be impressed by what the Colfaxes have achieved.  However, there<br/>\nare more than a few people out there who are applying very different<br/>\ncriteria of success to their lives and by those criteria succeeding <br/>\nbrilliantly.&lt;&lt;<br/>\n<br/>\nActually, by my criteria the Colfax boys are succeeding brilliantly.  From <br/>\nthe latest issue of HEM (first written on the HEM website:  &quot;Grant is still a <br/>\nphysician in San Fransisco working in public health and is a noted AIDS <br/>\nreseracher.  Reed is married and a dad . . . they live near Washington, DC <br/>\nwhere he works as a civil rights attorney in the field of fair housing.  <br/>\nDrew, an attorney, works for the  Southern Poverty Law Center (I think) <br/>\nworking on appeals for death row inmates.  Garth resides in Sacramento with <br/>\nhis wife.  He works with developmentally disabled individuals and restores <br/>\nold houses.&quot;<br/>\n<br/>\nI don&#39;t see any of the Colfaxes as having achieved &quot;social status&quot; (now <br/>\n*there&#39;s* a term that begs definition) or great wealth.  I see them as people <br/>\nwho had joyful childhoods filled with interesting work who grew up to achieve <br/>\ntheir own goals and are using their skills and talents to help other people.  <br/>\n<br/>\nPlease note that I said &quot;their own goals&quot;.  I am not setting goals for my <br/>\nchildren, but I most definitely want to provide support for them to achieve <br/>\nthe goals they set for themselves.  If my kids want to become attorneys or <br/>\ndoctors I would support that.  I wouldn&#39;t encourage it &lt;g&gt; but I would <br/>\nsupport it.  But I hope that my children help others, no matter what career <br/>\npath they choose.<br/>\n<br/>\nI think the value in the Colfax&#39;s books is that they lay out convincing <br/>\nexamples of the fact that kids do not need to spend their childhoods in heavy <br/>\nacademic pursuit in order to survive in academia later on.  Yes, there are <br/>\nunschoolers who are not interested in academia.  That&#39;s fine.  But judging <br/>\nfrom the questions that come up again and again on the homeschooling message <br/>\nboards, I think that most homeschoolers (especially new homeschoolers) want <br/>\nto know that their children will have the option of attending college.<br/>\n<br/>\nLisa Caryl</div>","specialLinks":[]}],"prevTopicId":1271,"nextTopicId":1302}}