{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1379016,"authorName":"Kathleen Whitfield","from":"Kathleen Whitfield &lt;kmckernan@...&gt;","profile":"kathwhit2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Thoughts on Re: Neighbourhood kid problem","postDate":"1182560652","msgId":29453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyQTFCRjlDLjhDQkFDJWttY2tlcm5hbkBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":29452,"nextInTime":29454,"topicId":29453,"numMessagesInTopic":0,"msgSnippet":"I ve been working on this since I saw the initial post, so this isn t in reaction to anything posted today! When I had three kids who were (in my case) 6, 4","messageBody":"<div id=\"ygrps-yiv-1621377120\">I&#39;ve been working on this since I saw the initial post, so this isn&#39;t in<br/>\nreaction to anything posted today!<br/>\n<br/>\nWhen I had three kids who were (in my case) 6, 4 and 10 weeks, I was feeling<br/>\nvery overwhelmed with adjusting to life with three children, partially<br/>\nbecause my third newborn was quite a bit harder to calm than my older two<br/>\n*and* she had some anatomical issues that made breastfeeding more<br/>\nchallenging for her.<br/>\n<br/>\nAround that time, I also had the misconception that 11-year-olds would act<br/>\nmore like little adults. I know lots of eleven-year-olds now who are<br/>\nwonderful and great fun, but I had unfair expectations of how friends&#39;<br/>\n11-year-olds would be acting when I had only younger children -- I didn&#39;t<br/>\nexpect all the activity and noise! It&#39;s similar to how I had a misconception<br/>\nthat it was easier to have older children than babies and toddlers. It&#39;s<br/>\neasier in a certain sense because their physical maintenance needs are<br/>\nlessened, but older children have emotional and intellectual needs that take<br/>\nmore than a breast and a cuddle to fulfill.<br/>\n<br/>\nI&#39;m not accusing anyone of having unfair expectations, but I&#39;m sharing what<br/>\nI remember of my life at that times. It sounds as though it might be a<br/>\npossibility that the original poster can explore herself.<br/>\n<br/>\nAlso, I&#39;ve found that it helps to treat other people&#39;s kids who are guests<br/>\nin my home as though they are my own. Which, for me, has translated into<br/>\ngiving them the benefit of the doubt about things and talking to them<br/>\nkindly. I&#39;ve found when I make an effort to establish rapport with the<br/>\nchildren in my kids&#39; lives that our time together is a lot easier. If I sit<br/>\nand play with them, they&#39;re much more open to my suggestion of &quot;Let&#39;s pick<br/>\nthis up now!&quot;<br/>\n<br/>\nI also think that sometimes with a young baby that a lot of issues that have<br/>\nbeen simmering without much attention on mom&#39;s part suddenly seem really<br/>\nurgent because of the increased stress her life. The problem is is that the<br/>\nmother is now in a situation where she has these really intense needs and<br/>\nisn&#39;t the best at problem-solving herself, particularly if she has a picture<br/>\nin her mind of what she *needs* to feel good again and isn&#39;t thinking about<br/>\nother ways that she might feel even better.<br/>\n<br/>\nI can tell you how I got through it. I got out of the house as much as I<br/>\ncould so we weren&#39;t a) messing up the house or b) having me look at the mess<br/>\nthat was there. I went over to a friend&#39;s house a lot, where they had<br/>\nplaymates. I played with the kids and read to them a lot, just like normal,<br/>\nat the library or at parks. I sat outside with them and watched them while<br/>\nthey played with their friends and I held the baby.<br/>\n<br/>\nI think, though, too, that a lot of the things that make family life happier<br/>\nwhen you add another child are things that are best done *before* the new<br/>\none comes. Having a strong foundation of listening to the kids makes it a<br/>\nlot easier when stressful times hit. Which doesn&#39;t help the original poster.<br/>\n:-) <br/>\n<br/>\nOne thing I also do when adding additional children is talk honestly and<br/>\nnonjudgmentally about the adjustment on the family, talk about how it takes<br/>\nsome time for me to recover from having a baby and how I know it&#39;s difficult<br/>\nfor them, too. I&#39;ve found that my kids, who get their needs met, do<br/>\nunderstand pretty well when I have to say, &quot;Right now, I&#39;m sorry; I can&#39;t do<br/>\n(fill-in-the-blank)&quot; My fill-in-the-blank is a specific and temporary<br/>\nlimitation and not, significantly, something like &quot;Your friends can&#39;t come<br/>\nover anymore.&quot; It&#39;s not something that I say to them arbitrarily or<br/>\nfrequently. We plan when we can do the desired thing again, so they know<br/>\nthat the baby doesn&#39;t mean we&#39;ll *never* do certain things again! I remember<br/>\nbeing overwhelmed with my first child at all his needs in early infancy --<br/>\nand I was a relatively well-read adult. Kids can feel that overwhelming<br/>\nfeeling just as strongly.<br/>\n<br/>\nTalking honestly about the whole family&#39;s adjustment meant that I&#39;d hear<br/>\nthings like, &quot;I wish you didn&#39;t have another baby&quot; from a 6yo while a 4yo<br/>\nnodded vehemently. I found that accepting those kinds of statements (I have<br/>\nheard mothers discount or react with anger to negative feelings like this)<br/>\nseem to lessen the tension in the family for everyone. Also, lots of talk<br/>\nabout what their babyhoods were like is always delightful for them.<br/>\n<br/>\nI do find it interesting that many people do come to the list with questions<br/>\nand many personal non-negotiables right when they&#39;ve added a baby! I think<br/>\nthe non-negotiables are a way of feeling back in control; I think it&#39;s<br/>\nimportant, though, to avoid damaging relationships. Letting go a bit  seems<br/>\nto help considerably more with feeling normal again than trying to hang on<br/>\nto an attachment to what would have been normal before the kids came.<br/>\n<br/>\nKathleen Whitfield<br/>\nin SoCal<br/>\n<br/>\nP.S. I&#39;m off to play Polly Pockets with my 3yo boy!</div>","specialLinks":[]}],"prevTopicId":29396,"nextTopicId":29480}}