{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":154422553,"authorName":"Krisula Moyer","from":"&quot;Krisula Moyer&quot; &lt;krisulam@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Digest Number 4454","postDate":"1075918665","msgId":90252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElORU5MQU5QUENKSEFJUE9NRklPSUVQQ0NDQUEua3Jpc3VsYW1AdmVyaXpvbi5uZXQ+","inReplyToHeader":"PDEwNzU4OTcyNjQuNDg1LjI5MDYyLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":90251,"nextInTime":90253,"topicId":90252,"numMessagesInTopic":0,"msgSnippet":"... control the change (by somehow making people behave the way we want them to.) Help your son see what choices he does have rather than being upset with ","messageBody":"<div id=\"ygrps-yiv-977051633\">Joyce said:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;We can be a catalyst of change (by offering information) but we can&#39;t<br/>\n </span></blockquote>control the change (by somehow making people behave the way we want them<br/>\nto.)<br/>\n<br/>\nHelp your son see what choices he does have rather than being upset with<br/>\nthings that are beyond his control. He can choose not to play volleyball. He<br/>\ncould find some other team. He could put up with the &quot;rain&quot; and enjoy<br/>\nhimself despite the weather.&lt;&lt;<br/>\n<br/>\n-------------<br/>\nI love this response.  You can offer information and perspective to the<br/>\noffending person.  What he does with that is out of your control but it<br/>\ndoesn&#39;t mean it&#39;s wasted.  After that the changes you *can* make are within<br/>\nyourself.  You can take the person way less seriously, you can set up<br/>\nboundaries so that the coach knows how the kid feels and the child has some<br/>\ncontrol over how much he is willing to take before saying that&#39;s enough and<br/>\nfinding another team or sport.<br/>\n<br/>\nMy dd was reduced to tears by a director who just had too few skills.  He&#39;s<br/>\nolder and though he seems to love working with children, he relies heavily<br/>\non empty threats, bluster and embarrassing kids to get them to do what he<br/>\nneeds them to do.  I was furious and ready to pull her out of the play but<br/>\nthat wasn&#39;t what she wanted.  (she&#39;s 8).   Sydney said she was going to tell<br/>\nhim what she thought of him the last day and until then she just didn&#39;t care<br/>\nwhat he said because she didn&#39;t respect him anymore.  She certainly wasn&#39;t<br/>\ngoing to sign up for any more of his productions.  We had a lot of talks<br/>\nabout the effect words have on people, the responsibility we have to be<br/>\nrespectful to people and why this man wasn&#39;t.  (he was rarely rude to the<br/>\nadults - just the kids).  She learned a lot, finished the play and by the<br/>\nend wanted to do it again.  By this time DH an I had found her another group<br/>\nand she chose to do that instead.<br/>\n<br/>\nI dealt with the situation as best as I could.  Stuffing all that anger<br/>\nended up making me rather sick - so I learned a lesson too.  In the end I<br/>\ngave him a copy of How to talk so kids can learn and to my surprise, he<br/>\nreceived it graciously and said he would read it.  If Sydney had decided to<br/>\nbail I would have left that man behind and shaken the dust from my shoes but<br/>\nI&#39;m glad she knew what she wanted and I&#39;m glad I didn&#39;t unload on him before<br/>\nI was able to pass on that book. Next time I will know not to bury my anger<br/>\nthough.<br/>\n<br/>\n-Krisula</div>","specialLinks":[]}],"prevTopicId":90240,"nextTopicId":90206}}