{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Question about my 4 year old and doing things","postDate":"1111079144","msgId":104602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQxY2RkOCtlOGpuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGRjLjIyNzllYjE1LjJmNmE0N2FhQGFvbC5jb20+"},"prevInTopic":104596,"nextInTopic":0,"prevInTime":104601,"nextInTime":104603,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"... Another option is sponge baths. When DS is grubby/sweaty and not wanting a bath, I ll suggest I sponge bath him. We ll put on a TV show or movie he likes","messageBody":"<div id=\"ygrps-yiv-591104951\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; If they were in an aversion <br/>\n&gt; phase, we&#39;d just wait for extreme dirt or need, or set up backyard <br/>\n&gt;water-play <br/>\n&gt; (wading pool, sprinkler, washing toy dishes on the patio or in the <br/>\n&gt;tub).<br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>Another option is sponge baths. When DS is grubby/sweaty and not <br/>\nwanting a bath, I&#39;ll suggest I sponge bath him. We&#39;ll put on a TV <br/>\nshow or movie he likes and I&#39;ll get some warm water in a container, <br/>\na warm soapy washcloth, and a towel. I start at his head, just <br/>\nrunning the clean, damp washcloth over his scalp, then work my way <br/>\ndown to his feet - that&#39;s usually really grubby because he prefers <br/>\nto be shoeless if at all possible, next step up is sandals and only <br/>\nwhen it is at the coldest, snowiest, soggiest will he wear shoes. <br/>\nNot only does he get clean but we also get to spend some one on one, <br/>\nphysical contact, positive, time together.</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Question about my 4 year old and doing things","postDate":"1111075101","msgId":104596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUzLmY3ZTQ3NmYuMmY2YjAzMWRAYW9sLmNvbT4="},"prevInTopic":104595,"nextInTopic":104602,"prevInTime":104595,"nextInTime":104597,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/17/2005 4:06:41 AM Mountain Standard Time, fetteroll@earthlink.net writes: Again it  helps to not think in terms of have to . Turn your","messageBody":"<div id=\"ygrps-yiv-1198489969\">In a message dated 3/17/2005 4:06:41 AM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\nAgain it  helps to not think in terms of &quot;have to&quot;. Turn your thinking <br/>\naround. You  *want* him in clothes so you don&#39;t get in trouble. By <br/>\nputting on clothes  when he doesn&#39;t want to he&#39;s doing you a favor. <br/>\nThink of it as a *huge*  favor you&#39;re asking him to do because from his <br/>\npoint of view it  is.<br/>\n<br/>\n<br/>\nI made Kirby put clothes on the other day.<br/>\n <br/>\nHe had gone to class in long shorts and flip-flops, even though it was  <br/>\nsnowing lightly. <br/>\n <br/>\nI took Marty for oral surgery at 12:30, got him back at 2:00, all woozy,  <br/>\neight teeth lighter, and set him up in a recliner in the den, with an ice pack  <br/>\nand blah blah blah...  I was stressed. <br/>\n <br/>\n <br/>\n Kirby&#39;s appointment to have his wisdom teeth out was 3:30.  He  had arrived <br/>\nhome while I was out with Marty.  I went and reminded him of  time, and went <br/>\nto get some food for myself.  I ate cold food, so the kids  (who couldn&#39;t eat <br/>\nbecause of impending surgery) wouldn&#39;t smell it. <br/>\n<br/>\nOh.  Forgot to say that he light snow had turned to very HEAVY  snow, the <br/>\noral surgeon is about eight miles away and I was about to turn right  around and <br/>\ngo back out in it, wait again for over an hour while one of my  children was <br/>\nanesthesized and dismantled, and AGAIN drive in that slippery,  crowded... only <br/>\nafter Kirby&#39;s surgery it would be 5:00 and everyone coming home  from work.<br/>\n <br/>\nSo I went into Kirby&#39;s room when it was time to go and he was still in  those <br/>\nknee-length pants and flip-flops.  The snow was four inches deep and  DUMPING <br/>\nalarmingly.  <br/>\n <br/>\nI don&#39;t remember the exact words but it had to do with tradition, respect,  <br/>\nwhat people would think, stupidity, winter, ME, and ended with something like  <br/>\n&quot;PANTS, shoes, socks, just DO IT.  NOW!&quot;<br/>\n <br/>\nHe just did it.  Then.  And nothing else was said, but I  seriously doubt <br/>\nthat he was sorry to have some shoes and socks on when he saw  how deep the snow <br/>\nwas getting.<br/>\n <br/>\nIt was a stressful day, and his insistence on flip-flops would have been  <br/>\nmore stressful for me (and him, too) than my insistence on real shoes and socks  <br/>\nwas.  <br/>\n <br/>\nYears ago, pre-kids, I was going to  San Francisco for a  meeting.  Keith had <br/>\nbeen there before.  I hadn&#39;t.  He said &quot;take  a coat.&quot;  I said it&#39;s July.  He <br/>\nsaid &quot;it will be cold, take a  coat.&quot;  I grabbed a light zippered sweatshirt. <br/>\n He took it out of my  hand and handed me a corduroy jacket lined in flannel. <br/>\n Later in the  weekend I was wishing it had been a ski jacket instead.  It <br/>\nwas wet and  REALLY COLD.  So I trust Keith more now, not less.  And I want it <br/>\nto  be that way with my kids too.  But on Monday this week, I had no time or  <br/>\npatience to explain carefully to Kirby, because it was time to brave the  <br/>\nslippery streets again right then.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Question about my 4 year old and doing things","postDate":"1111074428","msgId":104595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3LjQxODMzOWRjLjJmNmIwMDdjQGFvbC5jb20+"},"prevInTopic":104591,"nextInTopic":104596,"prevInTime":104594,"nextInTime":104596,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/17/2005 4:06:41 AM Mountain Standard Time, fetteroll@earthlink.net writes: you re  chipping at your relationship for something that isn t","messageBody":"<div id=\"ygrps-yiv-1292231605\">In a message dated 3/17/2005 4:06:41 AM Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\nyou&#39;re  chipping at your relationship for something that isn&#39;t as dire <br/>\nas you&#39;re  telling your children that it is.<br/>\n<br/>\n<br/>\n<br/>\n----------<br/>\n <br/>\nThe brighter the kids, the worse this is.  If they figure out ONE  thing the <br/>\nmom is claiming isn&#39;t an absolute truth, they&#39;ll start to doubt and  question <br/>\neverything the mom says.  <br/>\n <br/>\nIt&#39;s good to present them with what you believe and why you believe it, and  <br/>\nadmit that scientific ideas change over time, but that these days dentists are <br/>\n saying [whatever].  That also helps them learn how to figure out how to  <br/>\nmake decisions based on what they hear (from dentists or moms or magazines or  <br/>\ninstructions on the backs of toothbrush packages).<br/>\n <br/>\nIt&#39;s not a definite that brushing teeth prevents cavities.  There are  people <br/>\nwho don&#39;t brush who have none, and people who Do brush who have  cavities.  <br/>\nThere are many other factors.  <br/>\n <br/>\nIt IS pretty definite that kids who feel overly controlled will become more  <br/>\nresistent and eventually sneaky and dishonest.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Question about my 4 year old and doing things","postDate":"1111059156","msgId":104591,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVjNTdiNDk5MmZlNjdlZjViZGI1MTE2MzE3OGVhMDk5QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDAwYmIwMWM1MmE5MSQwY2VkYzIyMCRhYjQzMTYxOEBCZWRyb29tMT4=","referencesHeader":"PDAwYmIwMWM1MmE5MSQwY2VkYzIyMCRhYjQzMTYxOEBCZWRyb29tMT4="},"prevInTopic":104590,"nextInTopic":104595,"prevInTime":104590,"nextInTime":104592,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"... People respond from *their* point of view, though. In order to understand why someone is reacting in a certain way and to get a different response from","messageBody":"<div id=\"ygrps-yiv-145795694\"><blockquote><span title=\"ireply\">&gt; We, in my opinion, do not &quot;boss&quot; him around, we ask him nicely to<br/>\n&gt; do things.<br/>\n<br/>\n </span></blockquote>People respond from *their* point of view, though. In order to <br/>\nunderstand why someone is reacting in a certain way and to get a <br/>\ndifferent response from them, we have to understand why we&#39;re coming <br/>\nacross differently than we intend and then alter our approach.<br/>\n<br/>\nRegardless of how not controlling you think you are, he can only <br/>\nrespond to what he feels is your intent not to your actual intent.<br/>\n<br/>\nIf you&#39;re asking and the answer can&#39;t be no, then it&#39;s not a real <br/>\nquestion. It&#39;s just a confusing way of wording a command. So he&#39;s <br/>\nreacting to being commanded since he knows it isn&#39;t a real question.<br/>\n<br/>\nYour husband might ask &quot;Would you make meat loaf tonight?&quot; and you know <br/>\nthat if for some reason you couldn&#39;t that it would be okay.<br/>\n<br/>\nBut what if you knew that if you didn&#39;t make meat loaf he&#39;d make you? <br/>\nNo matter how nicely he asked, it wouldn&#39;t erase the fact that there <br/>\nwas a threat behind the request and that he had power and control over <br/>\nyour.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Question about my 4 year old and doing things","postDate":"1111057502","msgId":104590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxMzljMTM0OGQwNDFmMzk1MjE2YmRmYmVkZGZiZjI0QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDIwMDUwMzE2MTg0MzA2LjMwNkQ0MzlAdHlsZXIuY3MudGFtdS5lZHU+","referencesHeader":"PDIwMDUwMzE2MTg0MzA2LjMwNkQ0MzlAdHlsZXIuY3MudGFtdS5lZHU+"},"prevInTopic":104588,"nextInTopic":104591,"prevInTime":104589,"nextInTime":104591,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"... There s two issues tangled up in that statement. First it will help to not think in terms of have to but in terms of helping kids get what they want (and","messageBody":"<div id=\"ygrps-yiv-603588841\">On Mar 16, 2005, at 6:43 PM, Kim J. Flowers wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; No they don&#39;t HAVE to brush their teeth in this or that room<br/>\n&gt; at this or that time, but they do need to be brushed twice a day and <br/>\n&gt; flossed<br/>\n&gt; once a day.<br/>\n<br/>\n </span></blockquote>There&#39;s two issues tangled up in that statement.<br/>\n<br/>\nFirst it will help to not think in terms of have to but in terms of <br/>\nhelping kids get what they want (and avoid what they don&#39;t want.)<br/>\n<br/>\nKids don&#39;t want cavities! But often there&#39;s something in between them <br/>\nand that goal. And it&#39;s rarely &quot;toothbrushing&quot; as a whole. It can be <br/>\ntoothpaste. Or toothbrush. Or -- quite often -- being made to do it.<br/>\n<br/>\nI eat cereal every morning. But if my husband handed me a bowl of <br/>\ncereal and hovered over me to make sure I ate it, I&#39;d start associating <br/>\na bowl of cereal with being coerced and controlled and I&#39;d be <br/>\nentertaining thoughts on how to avoid my morning cereal -- though <br/>\nreally I&#39;d be trying to avoid the morning&#39;s dose of control.<br/>\n<br/>\nParents assume they know what their children&#39;s characters are because <br/>\nthey&#39;re with them all the time :-) But if the parents control some <br/>\naspects of their kids&#39; lives, the parents really only know how their <br/>\nkids react to control.<br/>\n<br/>\nIf your kids resist the toothbrushing you make them do, you only know <br/>\nhow they react to being *made* to brush their teeth, not how they react <br/>\nto toothbrushing.<br/>\n<br/>\nIf you let go of control, yes, they will probably not brush!<br/>\n<br/>\nBut, if instead of an atmosphere of &quot;you have no choice&quot;, you create an <br/>\natmosphere of being their partner who will do whatever she can to help <br/>\nthem, they won&#39;t have to avoid brushing teeth in order to feel in <br/>\ncontrol.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but they do need to be brushed twice a day and flossed<br/>\n&gt; once a day.<br/>\n<br/>\n </span></blockquote>And if they skip a day will they get cavities?<br/>\n<br/>\nUnlike lack of oxygen, lack of brushing and flossing for a day will not <br/>\nhave disastrous results. ;-) In fact a few of weeks while they adjust <br/>\nto not being made to brush and accept that you&#39;re their partner rather <br/>\nthan their controller will not result in cavities.<br/>\n<br/>\nWhat you&#39;ve done is taken a general piece of advice for the broad <br/>\npopulation and engraved it in stone as though it were a truth and then <br/>\nyou&#39;re chipping at your relationship for something that isn&#39;t as dire <br/>\nas you&#39;re telling your children that it is.<br/>\n<br/>\nWhat is closer to the truth is brushing teeth twice a day will help <br/>\n*most* people have fewer cavities. But kids can go for days without <br/>\nbrushing while you help them find ways to make brushing less onerous.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I think is necessary is when I have to take the baby to the <br/>\n&gt; doctor and<br/>\n&gt; I cannot get him to get dressed because they HAVE to wear clothing.<br/>\n<br/>\n </span></blockquote>First, there&#39;s no way to make him see the world through your eyes and <br/>\nmake him do what you want to do willingly and cheerfully.<br/>\n<br/>\nBut you can change the attitude you approach him with and that will <br/>\nhave an affect on his reaction. He may still not want to put on clothes <br/>\nbut he won&#39;t be fighting against what he perceives as your need to <br/>\ncontrol him.<br/>\n<br/>\nAgain it helps to not think in terms of &quot;have to&quot;. Turn your thinking <br/>\naround. You *want* him in clothes so you don&#39;t get in trouble. By <br/>\nputting on clothes when he doesn&#39;t want to he&#39;s doing you a favor. <br/>\nThink of it as a *huge* favor you&#39;re asking him to do because from his <br/>\npoint of view it is. And thank him for helping you out by letting you <br/>\ndress him. Thank him for inconveniencing him, for taking him from fun <br/>\nthings and helping you out even if he didn&#39;t enjoy the process. Do <br/>\nsomething nice for him for helping you out, like ice cream afterwards.<br/>\n<br/>\nPicture it like this scenario: You&#39;ve just gotten into the bath for  a <br/>\nlong soak. And your husband comes rushing in saying &quot;Honey, I&#39;m really <br/>\nsorry but I&#39;ve just had word that I need to leave for the airport in 10 <br/>\nminutes and I have to pack. Would you do me a huge favor and  get me <br/>\nsomething quick to eat?&quot; You&#39;ll probably do it for him because you love <br/>\nhim  :-) But if you had a bad day and you&#39;re grumpy while you do it, <br/>\nhis thanks shouldn&#39;t depend on your level of happiness while doing him <br/>\na favor. His thanks should be in proportion to the interruption to your <br/>\nlife he&#39;s asking you to make.<br/>\n<br/>\nBut if he came into the bathroom and said you *had* to get out of the <br/>\nbath and make him something to eat so he could leave, the atmosphere <br/>\nbetween you and your feelings towards him would be a whole lot <br/>\ndifferent.<br/>\n<br/>\nThat&#39;s not the best analogy but *if* we turn what we ask our kids to do <br/>\naround and see that we&#39;re more often than not -- *from their point of <br/>\nview!* -- asking them to do us a big favor, and if we treat what they <br/>\ndo for us as a big huge favor they&#39;ve done for us -- whether done <br/>\nhappily or not -- then they will respond much better than if we <br/>\napproach them with attitudes of &quot;you have to do this.&quot;<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] Re: Question about my 4 year old and doing things","postDate":"1111045370","msgId":104588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDUwMzE2MTg0MzA2LjMwNkQ0MzlAdHlsZXIuY3MudGFtdS5lZHU+"},"prevInTopic":104581,"nextInTopic":104590,"prevInTime":104587,"nextInTime":104589,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1292955967\">&lt;&lt;&lt;&lt;&lt;I don&#39;t also have the money to cover all the<br/>\ndental work necessary to allow them to make poor choices regarding their<br/>\ndental health. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThe number of times this issue has come up repeatedly on this list is huge.<br/>\nHistorically posting this idea is likely to bring in a small avalanche of<br/>\nreplies about how so much of dental health - generally defined re children<br/>\nas an absence of cavities - probably has more to do with genetics and<br/>\napparently good luck than any regularity of tooth brushing.<br/>\n<br/>\nI would rather Jayn had some cavities in her teeth than there be a gaping,<br/>\nfestering hole of my creating in our relationship. I have never enforced<br/>\ntooth brushing. She is 5, and her teeth did start to come in &quot;late&quot;, at one<br/>\nyear. Of course she sees me and dh brushing, and we have gone through a<br/>\nlengthy process of finding toothpastes that she likes the taste of. She is<br/>\nalso aware of the one large cavity she has in a molar. Rather than express<br/>\nthe inaccurate information that brushing *will* prevent cavities, I tell her<br/>\nthat brushing is more likely to mean fewer cavities, as well as fresher<br/>\nbreath. She also knows that it will be more important to brush more often<br/>\nwhen her adult teeth come in. She has recently spontaneously begun brushing<br/>\nher teeth several times a day, rotating through her selection of fun<br/>\ntoothbrushes, and sometimes flossing. This is actually unnecessary as her<br/>\nbaby teeth are wide apart. <br/>\n<br/>\nWe have taken visiting the dentist very gradually. Six months ago she came<br/>\nwith me to my cleaning, and wanted to sit in the chair and &quot;get her teeth<br/>\ncounted&quot;. She asked a lot of questions. Now I am on a quest to find a nice,<br/>\ngentle, lady dentist (Jayn wants a woman) who uses air abrasion when<br/>\npossible, instead of drilling. We will be interviewing and choose the person<br/>\nJayn likes best, and she is looking forward to the visits.<br/>\n<br/>\nMore importantly we have never had a battle about something as trivial as<br/>\nthis. By trivial I mean an issue that modeling and maturity are demonstrably<br/>\ntaking care of in a way that results in Jayn brushing her teeth *more<br/>\nfrequently* and of her own accord, than if I were making rules about it.  <br/>\n<br/>\n&lt;&lt;&lt;&lt; No they don&#39;t HAVE to brush their teeth in this or that room<br/>\nat this or that time, but they do need to be brushed twice a day and flossed<br/>\nonce a day.  I don&#39;t make up &quot;rules&quot; just for the sake of having them, I<br/>\nonly make rules that are necessary for health, safety, or to keep CPS away<br/>\nfrom me (like taking them into public with no clothes on). &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nSeriously, it is very easy to find all kinds of reasons entrenched in the<br/>\ndominant ideology of Western cultures to choose &quot;enforcing rules&quot; and<br/>\nabrogating the very idea of choice by believing that many things *are*<br/>\nnecessary that on examination may not be. It is much harder to find<br/>\nencouragement to move beyond what society deems &quot;necessary&quot; and what our<br/>\nculture deems &quot;safe&quot;. If you hang around Unschooling lists for long enough<br/>\nyou will find these ideas being stretched.<br/>\n<br/>\nWhat happens to your kids if they refused to brush one day? Is whatever<br/>\nmight be the next step you take going to enhance or diminish your<br/>\nrelationship with them? You need not answer here necessarily, just think<br/>\nabout it. Are they brushing because they fear the consequences you will<br/>\nimpose, or because they agree that brushing is a good idea? If the latter,<br/>\nwhy is a rule &quot;needed&quot; at all?<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt; If I can help it<br/>\nand not go somewhere when they don&#39;t want to, then I don&#39;t.<br/>\nSO, my whole point, is I want you to understand where I am coming from and<br/>\nknow that I am not just blabbing to him at the mouth with no apparent<br/>\nreason. &gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nWe all know you have reasons for believing you *need* rules. Most of us grew<br/>\nup in traditionally parented families with rules, punishments (gentle or<br/>\nharsh) and lack of autonomy. It is more helpful for people trying to get to<br/>\nUnschooling with joy if there is less defensiveness and more discussion of<br/>\nPrinciples and alternative strategies. We can get support for insisting on<br/>\ntooth brushing or clothing or any other parental mandate at any mainstream<br/>\nparenting site or publication. However there are ideas for another way to<br/>\nlive right here.<br/>\n<br/>\nFor example when I genuinely *have to* go somewhere that is genuinely<br/>\nimportant (rare), and Jayn must come with me due to a lack other child care<br/>\npersonnel (ie dh is busy), I have a process that allows her to say &quot;no&quot; as<br/>\noften as she needs to until she is ready. I alter my internal clock or<br/>\ntimetable to her slower pace of transitioning. If she wanted to leave the<br/>\nhouse without clothing (never happened yet) I would carry her clothes with<br/>\nme, in full view of passers by, so that they were both available to her<br/>\ninstantly, and so that others could see them and may feel humorous about it<br/>\ninstead of judgmental. This strategy works for sweaters and coats and shoes<br/>\nin cold weather also. The others probably assume I am &quot;teaching her a life<br/>\nlesson through experience&quot; instead of just living life simply without<br/>\nconflict. When she wants to wear odd clothes or pajamas it is meaningless to<br/>\nme; I make no qualitative judgments about her clothing choices.<br/>\n<br/>\nDanielle Conger had a great article about Rules vs Principles in a recent<br/>\nissue of Life Learning Magazine.<br/>\n<br/>\nwww.LifeLearningMagazine.com<br/>\n<br/>\nOne of the reasons I just love Radical Unschooling is because it shows me a<br/>\nway of life that minimizes the opportunities for conflict that I bring into<br/>\nour home and relationships. It goes beyond the ordinary advice of &quot;pick your<br/>\nbattles&quot; that is often offered in ordinary traditional parenting, to how to<br/>\nrenounce an adversarial relationship with our children. Jayn and I still<br/>\nhave opposing desires sometimes, but the basic paradigm is resolving issues<br/>\nwithout coercion and with respect.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.308 / Virus Database: 266.7.2 - Release Date: 3/11/2005</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Question about my 4 year old and doing things","postDate":"1111027114","msgId":104581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRjLjIyNzllYjE1LjJmNmE0N2FhQGFvbC5jb20+"},"prevInTopic":104579,"nextInTopic":104588,"prevInTime":104580,"nextInTime":104582,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/16/05 4:47:41 PM, grayfamily9@grayfamily9.karoo.co.uk writes: ","messageBody":"<div id=\"ygrps-yiv-690209862\">In a message dated 3/16/05 4:47:41 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grayfamily9@...\">grayfamily9@...</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt; They both are given a choice of bathtimes and choose when it will take <br/>\nplace. It does not happen everyday. &gt;&gt;<br/>\n<br/>\nWhen mine were little, they went through phases of wanting to take two baths <br/>\na day (to play in the water) or not liking it.  If they were in an aversion <br/>\nphase, we&#39;d just wait for extreme dirt or need, or set up backyard water-play <br/>\n(wading pool, sprinkler, washing toy dishes on the patio or in the tub).<br/>\n<br/>\nWhen they each reached puberty, they started taking a shower first thing <br/>\nafter waking up.  I didn&#39;t suggest it.  They just do it.  They shower more than I <br/>\ndo or my husband does (probably because we have long hair and that&#39;s a <br/>\npain)--we&#39;ll skip a day sometimes, but they never do.  Today Marty took a shower even <br/>\nthough he wasn&#39;t leaving the house at all and nobody came over (and he had <br/>\nhis wisdom teeth out Monday).  He took one yesterday too, but a friend was <br/>\ncoming by so maybe that was why.   <br/>\n<br/>\nHad we tried to make them shower, they wouldn&#39;t be as calmly happy to take <br/>\nshowers now for their own personal reasons.<br/>\n<br/>\nIf we had tried to make them against their will, the situation would have <br/>\nbeen set up so that a shower meant parents won, and a shower meant the kid lost.<br/>\n<br/>\nKids don&#39;t want to be losers.  Too many parents insist that their children <br/>\nbecome losers.<br/>\n<br/>\nMaybe it&#39;s not so fair to blame schools for that low self-esteem and <br/>\nneediness when mealtime, bedtime, bathtime, tv, computers and bicycles can become <br/>\narenas of defeat in cases of parental insistence and control.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":78615010,"authorName":"mamaaj2000","from":"&quot;mamaaj2000&quot; &lt;mamaaj2000@...&gt;","profile":"mamaaj2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Question about my 4 year old and doing things","postDate":"1111026249","msgId":104579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQxYXBvOStrb2wzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwYmIwMWM1MmE5MSQwY2VkYzIyMCRhYjQzMTYxOEBCZWRyb29tMT4="},"prevInTopic":104573,"nextInTopic":104581,"prevInTime":104578,"nextInTime":104580,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"...  wrote: We ask him nicely and respectfully to brush his teeth or ... hate doing ... to do ... are you asking him to do it?  If you ask someone to","messageBody":"<div id=\"ygrps-yiv-2095710990\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Robin&quot; &lt;tri_mom@c...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Kim J. Flowers&quot; <br/>\n </span></blockquote>&lt;kim@t...&gt; wrote:<br/>\n We ask him nicely and respectfully to brush his teeth or<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; get dressed or to do something necessary and his response is &quot;I <br/>\n </span></blockquote>hate doing<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; things, people always say do this and do that and always tell me <br/>\n </span></blockquote>to do<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; things&quot;.<br/>\n<br/>\n&gt; My first question is: Is teeth brushing non-negotiable? If so, why <br/>\n </span></blockquote>are you asking him to do it?  If you ask someone to do something, you <br/>\nneed to be able to accept a &quot;no&quot; answer, at least in my book. If <br/>\nthere are things that are non-negotiable (we try to keep that list <br/>\n<blockquote><span title=\"ireply\"> &gt;very small in our house, but teeth-brushing is one of them), I don&#39;t <br/>\n&gt;ask them if they want to do it. I talk with my kids about why it is <br/>\n&gt;important, and why it *is* something that we do every day<br/>\n<br/>\n </span></blockquote>I agree on the treatment of non-negotiable tasks. If we have an <br/>\nappointment, I&#39;ll give lots of notice, but I&#39;m not going to debate <br/>\nthe subject *at that time*. Distracting and diverting or just being <br/>\nsilly can sometimes help, even at 4 (or 35, lol). Making sure that <br/>\nI&#39;ve gotten everything ready so that I can give ds 5-10 minutes to <br/>\nslowly get dressed helps. Getting there on time is MY problem, not <br/>\nhis.<br/>\n<br/>\nI&#39;m all for avoiding power struggles. That&#39;s not the same as taking <br/>\npart in one and &quot;letting the child win.&quot; Don&#39;t like that phrasing, <br/>\nbut if you are standing there feeling bad at upsetting him, he&#39;s got <br/>\na lot of power over your emotions. Like Robin said, I know I don&#39;t <br/>\ninsist on much and there&#39;s a good reason for those few things (I <br/>\nthink, I hope, I constantly ask myself!).<br/>\n<br/>\nI&#39;d try to talk about it at a different time. Hey, tomorrow we&#39;re <br/>\ngoing to the doctor and I don&#39;t want to argue with you. What can we <br/>\ndo that will make us both happy? <br/>\n<br/>\nI forget which list I brought it up on back in December, but I&#39;d had <br/>\nto do some shopping with the kids (4 and almost 2 at the time) and it <br/>\ndidn&#39;t always go well, even with much discussion and promises of <br/>\ntrips to the toy store, etc. A number of people said, well, yeh, <br/>\nyoung kids aren&#39;t always going to enjoy errands, but sometimes we <br/>\nhave to go, esp. to have food to eat and little things like that. <br/>\n<br/>\nOkay, I found the discussion (about going out and some other issues I <br/>\nwas having) from December, on AlwaysUnschooling, the list for <br/>\nunschooling younger kids, if you are a member or want to join:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysUnschooled/message/2016\">http://groups.yahoo.com/group/AlwaysUnschooled/message/2016</a><br/>\n<br/>\nor the link to the group&#39;s homepage:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysUnschooled/\">http://groups.yahoo.com/group/AlwaysUnschooled/</a><br/>\n<br/>\nI found this in one of my responses to the great thoughts others had:<br/>\n<br/>\n&quot;I&#39;ve been so actively trying to change the way I parent for about 1.5<br/>\nyears now that sometimes I tend to focus too much on &quot;that was wrong,<br/>\nI need to fix it so I/he/she/we aren&#39;t upset&quot;. Things are going to go<br/>\nwrong and it may be my fault, but being self-critical isn&#39;t always<br/>\nthe immediate answer. Need to breathe more and look for joy instead<br/>\nof just trying to avoid strife.&quot;<br/>\n<br/>\nhth,<br/>\naj</div>","specialLinks":[]},{"userId":153142310,"authorName":"Robin","from":"&quot;Robin&quot; &lt;tri_mom@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Question about my 4 year old and doing things","postDate":"1111023092","msgId":104573,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYmIwMWM1MmE5MSQwY2VkYzIyMCRhYjQzMTYxOEBCZWRyb29tMT4="},"prevInTopic":104572,"nextInTopic":104579,"prevInTime":104572,"nextInTime":104574,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"... My first question is: Is teeth brushing non-negotiable? If so, why are you asking him to do it?  If you ask someone to do something, you need to be able to","messageBody":"<div id=\"ygrps-yiv-917418013\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Kim J. Flowers&quot; &lt;kim@t...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I am having some questions about my 4 1/2 year old, Tyler, and his problem<br/>\n&gt; with doing things.  We ask him nicely and respectfully to brush his teeth or<br/>\n&gt; get dressed or to do something necessary and his response is &quot;I hate doing<br/>\n&gt; things, people always say do this and do that and always tell me to do<br/>\n&gt; things&quot;.  We, in my opinion, do not &quot;boss&quot; him around, we ask him nicely to<br/>\n&gt; do things. <br/>\n<br/>\n<br/>\n </span></blockquote>My first question is: Is teeth brushing non-negotiable? If so, why are you asking him to do it?  If you ask someone to do something, you need to be able to accept a &quot;no&quot; answer, at least in my book. If there are things that are non-negotiable (we try to keep that list very small in our house, but teeth-brushing is one of them), I don&#39;t ask them if they want to do it. I talk with my kids about why it is important, and why it *is* something that we do every day, and then when it is time to brush their teeth, I say simply &quot;teeth brushing time&quot; or I ask them to do it sometime in the morning before we go out, or whatever. And I&#39;m okay with the few things that I mandate (like teeth brushing), because we tried making that one optional and $2000 worth of dental work under scary general anesthetic later, I&#39;m okay with making it an necessary thing. <br/>\n<br/>\nI would explore what things can be optional, and if they are just don&#39;t ask him to do them (like get dressed). My daughter tends to like being naked, my son is always dressed. However, he wears shorts through most of the winter. If we&#39;re going out, they understand that getting dressed is part of what needs to happen before we go out. If they don&#39;t want to get dressed, then not going out might be another option, or finding some really fun clothes to wear (like a spiderman costume or something) might be another option, or me helping them get dressed might be another option - there&#39;s lots of options between getting dressed and not getting dressed. My daughter really likes it if I pick out some clothes for her (something I know she&#39;ll want to wear) and stick it in the clothes dryer with the load of laundry I&#39;m drying in the morning. That way she gets to put on cozy, warm, comfy clothes - what a great feeling! I keep our ski bag in the car, so we always have coats, hats, mittens, socks, and snowsuits handy when we&#39;re going somewhere. If we go on our bikes or walk, I put the kids fleece and windbreakers in a backpack just in case they get chilly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I hate it that he feels bossed around and doesn&#39;t want to even<br/>\n&gt; do the necessary things in life simply because he was asked to.  At least<br/>\n&gt; that is what it seems like.  We have even tried asking him if he would like<br/>\n&gt; to do this or that and trying to make it sound worth his while, but that<br/>\n&gt; doesn&#39;t work either.  <br/>\n<br/>\n </span></blockquote>Maybe he&#39;s picking up on the idea that you&#39;re trying to make something that is non-negotiable into a question? It might feel dishonest to him. Or if you&#39;re trying to make something sound fun that he thinks is not, he might feel like his own feelings are being ignored. It might work better to just acknowledge his feelings, and see if there are ways that you can work toward a mutually agreeable solution.<br/>\n<br/>\nBlue Skies,<br/>\n-Robin-<br/>\n<br/>\nKids are God; Pay attention. - Viggo Mortensen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":144808972,"authorName":"Kim J. Flowers","from":"&quot;Kim J. Flowers&quot; &lt;kim@...&gt;","profile":"kimjflowers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] Re: Question about my 4 year old and doing things","postDate":"1111016632","msgId":104572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMzE2MTg0MzA2LjMwNkQ0MzlAdHlsZXIuY3MudGFtdS5lZHU+","inReplyToHeader":"PGQxYWFyaisyY2tpQGVHcm91cHMuY29tPg=="},"prevInTopic":104569,"nextInTopic":104573,"prevInTime":104571,"nextInTime":104573,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"What I think is necessary is when I have to take the baby to the doctor and I cannot get him to get dressed because they HAVE to wear clothing.  Truly, I am","messageBody":"<div id=\"ygrps-yiv-1520526912\">What I think is necessary is when I have to take the baby to the doctor and<br/>\nI cannot get him to get dressed because they HAVE to wear clothing.  Truly,<br/>\nI am not being picky here and trying to make my kids do things just for the<br/>\nhell of making them do them.  I don&#39;t also have the money to cover all the<br/>\ndental work necessary to allow them to make poor choices regarding their<br/>\ndental health.  No they don&#39;t HAVE to brush their teeth in this or that room<br/>\nat this or that time, but they do need to be brushed twice a day and flossed<br/>\nonce a day.  I don&#39;t make up &quot;rules&quot; just for the sake of having them, I<br/>\nonly make rules that are necessary for health, safety, or to keep CPS away<br/>\nfrom me (like taking them into public with no clothes on).  If I can help it<br/>\nand not go somewhere when they don&#39;t want to, then I don&#39;t.<br/>\nSO, my whole point, is I want you to understand where I am coming from and<br/>\nknow that I am not just blabbing to him at the mouth with no apparent<br/>\nreason.<br/>\n <br/>\nKim Flowers - Wife to Nolan for 9 years<br/>\nStay at Home Mama of 4 wonderful boys<br/>\n&quot;I try to take one day at a time, but sometimes several days attack me at<br/>\nonce.&quot;<br/>\n <br/>\n<br/>\n  _____  <br/>\n<br/>\nFrom: soggyboysmom [mailto:debra.rossing@...] <br/>\nSent: Wednesday, March 16, 2005 4:10 PM<br/>\nTo: UnschoolingDiscussion@yahoogroups.com<br/>\nSubject: [UnschoolingDiscussion] Re: Question about my 4 year old and doing<br/>\nthings<br/>\n<br/>\n<br/>\n<br/>\nAre you asking asking (where No is a valid answer) or is asking a <br/>\nway of telling him to do things that maybe sounds a little nicer to <br/>\nyour ears? If &quot;No&quot; is not a valid answer, you&#39;re not really giving <br/>\nhim options are you? &quot;Necessary&quot; things as defined by who? You? Or <br/>\nhim? Yes, toothbrushing is important BUT does it have to be done <br/>\nright then, in that way, in that room, with that toothbrush, and <br/>\nthat toothpaste? Does he have options as far as dressing or not <br/>\ndressing, picking out his own clothing, getting help in getting <br/>\ndressed (even if he CAN do it himself he might not always WANT to do <br/>\nit himself - my almost 7 yr old still likes to have assistance <br/>\nsometimes)? My DS, since he&#39;s at home much of the time, can choose <br/>\nwhether to put on clothing or not. And, yes, sometimes that <br/>\ntranslates into a naked boy around the house all day. Even in <br/>\nwinter. In New England. He has gone and put on clothing or found a <br/>\nblanket on occasions when he feels cold. We request that he wear at <br/>\nleast a pair of shorts if he goes outdoors or we have guests over to <br/>\nthe house. He can totally understand that in the context of keeping <br/>\nhis private parts private (and keeping bugs and stuff off them in <br/>\nthe summer when he&#39;s outdoors most of the daylight hours). Your own <br/>\nsense of what is &quot;necessary&quot; is not likely the same as that of a 4 <br/>\nor 5 yr old. For example, DS dislikes wearing shoes even more than <br/>\nwearing clothing. BUT in order to go in to his favorite restaurant, <br/>\nmini-mart, grocery store, he MUST wear footwear. So, he has a <br/>\nchoice - stay in the car (with Daddy) while I run in, get fast food <br/>\nfrom the drive thru, etc or put on footwear to come in. Both are <br/>\nvalid options. He has a true choice. No battles. He doesn&#39;t <br/>\nfeel &quot;bossed&quot;, we don&#39;t have to push him.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nVisit the Unschooling website and message boards: http://www.unschooling.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor\t<br/>\n<br/>\nADVERTISEMENT<br/>\n <br/>\n&lt;http://us.ard.yahoo.com/SIG=129lp6i1b/M=298184.6191685.7192823.3001176/D=gr<br/>\noups/S=1705081972:HM/EXP=1111097399/A=2593423/R=0/SIG=11el9gslf/*http://www.<br/>\nnetflix.com/Default?mqso=60190075&gt; click here\t<br/>\n <br/>\n&lt;http://us.adserver.yahoo.com/l?M=298184.6191685.7192823.3001176/D=groups/S=<br/>\n:HM/A=2593423/rand=845997735&gt; \t<br/>\n<br/>\n  _____  <br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n*\tTo visit your group on the web, go to:<br/>\nhttp://groups.yahoo.com/group/UnschoolingDiscussion/<br/>\n  <br/>\n<br/>\n*\tTo unsubscribe from this group, send an email to:<br/>\nUnschoolingDiscussion-unsubscribe@yahoogroups.com<br/>\n&lt;mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com?subject=Unsubscrib<br/>\ne&gt; <br/>\n  <br/>\n<br/>\n*\tYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service<br/>\n&lt;http://docs.yahoo.com/info/terms/&gt; . <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194903596,"authorName":"Ruth","from":"&quot;Ruth&quot; &lt;grayfamily9@...&gt;","profile":"ladybird579","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Question about my 4 year old and doing things","postDate":"1111014693","msgId":104569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGYwMWM1MmE3ZCQ3ZWUyMzY0MCRiNDlhNjQ1M0BwY2FiYTFkMzU1NTE5Zj4=","referencesHeader":"PDIwMDUwMzE2MTI1NTAyLjY2OERGMzdAdHlsZXIuY3MudGFtdS5lZHU+IDwwMDMxMDFjNTJhNmEkNzc2MTZhMjAkN2U0Y2RlMThAYW9sZHNsLm5ldD4="},"prevInTopic":104566,"nextInTopic":104572,"prevInTime":104568,"nextInTime":104570,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"Hi Dawn I have two little boys here who hated teeth cleaning, hated getting bathed and hated getting dressed.   One would scream and one would go off in a","messageBody":"<div id=\"ygrps-yiv-937467949\">Hi Dawn<br/>\nI have two little boys here who hated teeth cleaning, hated getting bathed and hated getting dressed.   One would scream and one would go off in a strop if he felt he was being made to do it. Now this sounds radical but I stopped making them. End of it.  If they sat in p.j&#39;s all day so what? If they didn&#39;t clean their teeth -so what?  Bathing - so what? The battle was over. After a few days when it dawned on them that to go outanywhere interesting they had to get dressed and to go out they needed to be clean ( ie not smell is good enough here) the problem was mainly solved. Their teeth did not drop out and no one complained about their hygiene.. Now one cleans his teeth himself without being asked and the other does if given a choice of times.. They both are given a choice of bathtimes and choose when it will take place. It does not happen everyday.They do not have to get dressed. It is their choice. They choose to if they want to go out. Sometimes they will go and dress after they have finished on the computer or watching t.v. It depends.  They will wear shoes if they are going out if it is cold. They choose not to wear them all year round in the garden.  They are healthy and happy and it doesn&#39;t matter.<br/>\n<br/>\nRuth<br/>\n____________________________________________________________________________<br/>\nThis email and all attachments have been electronically scanned by Kingston<br/>\nCommunications&#39; email Anti-Virus service and no known viruses were detected.<br/>\n____________________________________________________________________________<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Question about my 4 year old and doing things","postDate":"1111013060","msgId":104566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMC40NWIzOWVlNy4yZjZhMTBjNEBhb2wuY29tPg=="},"prevInTopic":104563,"nextInTopic":104569,"prevInTime":104565,"nextInTime":104567,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"Kim, please capitalize all vowels when you post to this list, if you don t mind, lIkE thIs, sEE? And as soon as you can, could you send us a list of the names","messageBody":"<div id=\"ygrps-yiv-1972866956\">Kim, please capitalize all vowels when you post to this list, if you don&#39;t  <br/>\nmind, <br/>\nlIkE thIs, sEE?<br/>\n <br/>\nAnd as soon as you can, could you send us a list of the names of all the  <br/>\ndogs you&#39;ve ever owned?  Thanks!  I really appreciate it.<br/>\n <br/>\n <br/>\n------------<br/>\n <br/>\nNot really.<br/>\n <br/>\nBut did it sound like I was asking you really nicely to do something that  <br/>\nmade good sense to you and that you would have done anyway?<br/>\n <br/>\nIt&#39;s probably how your polite requests are sounding to your four year  old.<br/>\n <br/>\n-=-He just sighs and falls to the ground like we have<br/>\nonce again bossed  him around. -=-<br/>\n <br/>\nBut you have bossed him around.<br/>\n <br/>\nIf Kirby (who&#39;s 18 and has had the same job for over four years) goes to  <br/>\nwork this afternoon (which he&#39;s doing at 5:30) and his boss says, &quot;Kirby!   I&#39;m <br/>\nso glad to see you!  Could you work tomorrow and Sunday and addition to  Friday <br/>\nand Saturday?  And could you open tomorrow?&quot; I think he wouldn&#39;t  REALLY <br/>\nthink he could say &quot;No, thanks&quot; without repercussions.  BUT...  because they&#39;ve <br/>\nusually been really generous with him when he needs time off, he  would probably <br/>\nsay &quot;can&#39;t tomorrow until later; algebra test--but can  Sunday.&quot;<br/>\n <br/>\nIf all the directives come from the parents, the child will balk.<br/>\nIf parents are as willing to do what he kid thinks up or requests or  <br/>\nwants,and to do it quickly and happily, the child is way more likely to help the  mom <br/>\n(even if the &quot;help&quot; is making her feel better by brushing his  teeth).   <br/>\n <br/>\n-=- I hate it that he feels bossed around and doesn&#39;t want to even<br/>\ndo  the necessary things in life simply because he was asked to. -=-<br/>\n <br/>\nPlease read this and consider what is &quot;necessary&quot; and why.<br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/haveto_\">http://sandradodd.com/unschool/haveto_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/haveto)\">http://sandradodd.com/unschool/haveto)</a> <br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Question about my 4 year old and doing things","postDate":"1111010995","msgId":104563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQxYWFyaisyY2tpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDUwMzE2MTI1NTAyLjY2OERGMzdAdHlsZXIuY3MudGFtdS5lZHU+"},"prevInTopic":104558,"nextInTopic":104566,"prevInTime":104562,"nextInTime":104564,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"Are you asking asking (where No is a valid answer) or is asking a way of telling him to do things that maybe sounds a little nicer to your ears? If No is not","messageBody":"<div id=\"ygrps-yiv-1553335922\">Are you asking asking (where No is a valid answer) or is asking a <br/>\nway of telling him to do things that maybe sounds a little nicer to <br/>\nyour ears? If &quot;No&quot; is not a valid answer, you&#39;re not really giving <br/>\nhim options are you? &quot;Necessary&quot; things as defined by who? You? Or <br/>\nhim? Yes, toothbrushing is important BUT does it have to be done <br/>\nright then, in that way, in that room, with that toothbrush, and <br/>\nthat toothpaste? Does he have options as far as dressing or not <br/>\ndressing, picking out his own clothing, getting help in getting <br/>\ndressed (even if he CAN do it himself he might not always WANT to do <br/>\nit himself - my almost 7 yr old still likes to have assistance <br/>\nsometimes)? My DS, since he&#39;s at home much of the time, can choose <br/>\nwhether to put on clothing or not. And, yes, sometimes that <br/>\ntranslates into a naked boy around the house all day. Even in <br/>\nwinter. In New England. He has gone and put on clothing or found a <br/>\nblanket on occasions when he feels cold. We request that he wear at <br/>\nleast a pair of shorts if he goes outdoors or we have guests over to <br/>\nthe house. He can totally understand that in the context of keeping <br/>\nhis private parts private (and keeping bugs and stuff off them in <br/>\nthe summer when he&#39;s outdoors most of the daylight hours). Your own <br/>\nsense of what is &quot;necessary&quot; is not likely the same as that of a 4 <br/>\nor 5 yr old. For example, DS dislikes wearing shoes even more than <br/>\nwearing clothing. BUT in order to go in to his favorite restaurant, <br/>\nmini-mart, grocery store, he MUST wear footwear. So, he has a <br/>\nchoice - stay in the car (with Daddy) while I run in, get fast food <br/>\nfrom the drive thru, etc or put on footwear to come in. Both are <br/>\nvalid options. He has a true choice. No battles. He doesn&#39;t <br/>\nfeel &quot;bossed&quot;, we don&#39;t have to push him.</div>","specialLinks":[]},{"userId":162967824,"authorName":"Dawn Adams","from":"&quot;Dawn Adams&quot; &lt;Wishbone@...&gt;","profile":"bluenosegoddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Question about my 4 year old and doing things","postDate":"1111006520","msgId":104558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzEwMWM1MmE2YSQ3NzYxNmEyMCQ3ZTRjZGUxOEBhb2xkc2wubmV0Pg==","referencesHeader":"PDIwMDUwMzE2MTI1NTAyLjY2OERGMzdAdHlsZXIuY3MudGFtdS5lZHU+"},"prevInTopic":104553,"nextInTopic":104563,"prevInTime":104557,"nextInTime":104559,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"... or ... to ... like ... Maybe he doesn t mean you re bossing him but means he feels your questions arn t honest our that you re trying to manioulate him and","messageBody":"<div id=\"ygrps-yiv-1121429367\"><blockquote><span title=\"ireply\">&gt; I am having some questions about my 4 1/2 year old, Tyler, and his problem<br/>\n&gt; with doing things.  We ask him nicely and respectfully to brush his teeth<br/>\n </span></blockquote>or<br/>\n<blockquote><span title=\"ireply\"> &gt; get dressed or to do something necessary and his response is &quot;I hate doing<br/>\n&gt; things, people always say do this and do that and always tell me to do<br/>\n&gt; things&quot;.  We, in my opinion, do not &quot;boss&quot; him around, we ask him nicely<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; do things.  I hate it that he feels bossed around and doesn&#39;t want to even<br/>\n&gt; do the necessary things in life simply because he was asked to.  At least<br/>\n&gt; that is what it seems like.  We have even tried asking him if he would<br/>\n </span></blockquote>like<br/>\n<blockquote><span title=\"ireply\"> &gt; to do this or that and trying to make it sound worth his while, but that<br/>\n&gt; doesn&#39;t work either.  He just sighs and falls to the ground like we have<br/>\n&gt; once again bossed him around.  Any advice on how to handle this would be<br/>\n&gt; greatly appreciated.  We are at a complete loss.  Thanks.<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;.<br/>\n<br/>\n </span></blockquote>Maybe he doesn&#39;t mean you&#39;re bossing him but means he feels your questions<br/>\narn&#39;t honest our that you&#39;re trying to manioulate him and &#39;bossy&#39; is just<br/>\nthe only word he can come up with?<br/>\n<br/>\nYou ask him nicely but is he allowed to say no and have that respected?<br/>\n<br/>\nMaking it sound worthwhile might come across as pushing the issue and trying<br/>\nto get a yes out of him.<br/>\n<br/>\nJust some thoughts.<br/>\n<br/>\nDawn (in NS)<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.308 / Virus Database: 266.7.3 - Release Date: 15/03/2005</div>","specialLinks":[]},{"userId":144808972,"authorName":"Kim J. Flowers","from":"&quot;Kim J. Flowers&quot; &lt;kim@...&gt;","profile":"kimjflowers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Question about my 4 year old and doing things","postDate":"1110995748","msgId":104553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMzE2MTI1NTAyLjY2OERGMzdAdHlsZXIuY3MudGFtdS5lZHU+"},"prevInTopic":0,"nextInTopic":104558,"prevInTime":104552,"nextInTime":104554,"topicId":104553,"numMessagesInTopic":0,"msgSnippet":"I am having some questions about my 4 1/2 year old, Tyler, and his problem with doing things.  We ask him nicely and respectfully to brush his teeth or get","messageBody":"<div id=\"ygrps-yiv-410295788\">I am having some questions about my 4 1/2 year old, Tyler, and his problem<br/>\nwith doing things.  We ask him nicely and respectfully to brush his teeth or<br/>\nget dressed or to do something necessary and his response is &quot;I hate doing<br/>\nthings, people always say do this and do that and always tell me to do<br/>\nthings&quot;.  We, in my opinion, do not &quot;boss&quot; him around, we ask him nicely to<br/>\ndo things.  I hate it that he feels bossed around and doesn&#39;t want to even<br/>\ndo the necessary things in life simply because he was asked to.  At least<br/>\nthat is what it seems like.  We have even tried asking him if he would like<br/>\nto do this or that and trying to make it sound worth his while, but that<br/>\ndoesn&#39;t work either.  He just sighs and falls to the ground like we have<br/>\nonce again bossed him around.  Any advice on how to handle this would be<br/>\ngreatly appreciated.  We are at a complete loss.  Thanks.<br/>\n <br/>\nKim Flowers - Wife to Nolan for 9 years<br/>\nStay at Home Mama of 4 wonderful boys<br/>\n&quot;I try to take one day at a time, but sometimes several days attack me at<br/>\nonce.&quot;<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":259,"nextTopicId":104609}}