{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":134300842,"authorName":"Brenda Rose","from":"&quot;Brenda Rose&quot; &lt;rosebl@...&gt;","profile":"homeanduva2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: PBS Colonial House","postDate":"1114808753","msgId":105766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBkZWYwMWM1NGNmZiQzYjMyNzBhMCQ2NjAxYThjMEBCcmVuZGE+","referencesHeader":"PDExMTQ2NjMwNjYuMjc1Mi4zNDcxNi5tMTRAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":105685,"nextInTopic":0,"prevInTime":105765,"nextInTime":105767,"topicId":105685,"numMessagesInTopic":0,"msgSnippet":"Thanks, Mary Ellen.  I always appreciate hearing about good sources of entertainment/learning.  This sounds liek something my dd 22 and I would enjoy - the","messageBody":"<div id=\"ygrps-yiv-619649997\">Thanks, Mary Ellen.  I always appreciate hearing about good sources of <br/>\nentertainment/learning.  This sounds liek something my dd 22 and I would <br/>\nenjoy - the boys might like parts too.<br/>\n<br/>\nBrenda<br/>\n<br/>\nPS - Sorry, Sandra, for not deleting on my last message.</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"PBS Colonial House","postDate":"1114662696","msgId":105685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzMwMWM1NGJhYyQwMmQwNDk3MCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PDdkLjY4M2VlNWMzLjJmYTFhMWZmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":105766,"prevInTime":105684,"nextInTime":105686,"topicId":105685,"numMessagesInTopic":0,"msgSnippet":"One of my recent finds at our local library was PBS Colonial House on DVD.  Maybe some will enjoy reading my thoughts on our viewing it.  Maybe not. Mary Ellen","messageBody":"<div id=\"ygrps-yiv-112271697\">One of my recent finds at our local library was PBS Colonial House on DVD.  Maybe some will enjoy reading my thoughts on our viewing it.  Maybe not.<br/>\nMary Ellen<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://melonary.blogspot.com/\">http://melonary.blogspot.com/</a><br/>\n21st Centurions in the 16th Century <br/>\nWe finished watching Colonial House today. Our experience in viewing this together is such a great example of the manner in which real learning cannot be contained by mere subjects.<br/>\n<br/>\nThe schooled part of me wanted to tell more than one person (you know who those people might be) that we spent the week studying history, or more specifically, the Colonial era. And that is true, we did. The program highlighted many of the realities of colonists to New England during the early 1600&#39;s.<br/>\n<br/>\nBut the study of anything in the past is so much more than history. For starters, there was a great deal of herstory. Not to mention childrenstory and indigentpeoplestory, or at least a mention of the last two.<br/>\n<br/>\nWhat made the show especially fascinating to me was the sharing of the 21st century participant&#39;s views of living four months in the physical space of 1628. At first glance, it may seem that people wanting to break free from the bonds of indentured servant or women&#39;s subservience to men is a modern thing. However, I think that these desires have always been so, and it is only minor variances in society that promote big steps in behavioral changes.<br/>\n<br/>\nThe other point is that any time we consider something that can be categorized (this is history!), we actually experience a far greater range of ideas. History just means it happened previous to now. Just because it happened in the past doesn&#39;t mean it is limited to *history*.<br/>\n<br/>\nSerendipity comes into play as well, with this particular show leading us to a discussion of homosexuality, followed by Lisa&#39;s magazine subscription coming in the mail and containing information on the same topic. (Jonathon came out in episode 4 of Colonial House, and the Governor hoped his confession was the first step towards changing his evil ways. This led to a discussion about being gay and people&#39;s beliefs on homosexuality being something you are born with or something you choose. Later, Lisa was reading one of her magazines and shared the letters to the editor. Apparently the last issue had a quiz to help people know if they are gay or not. Two of the letters criticized the magazine editors for printing such a quiz, suggesting that young people will only become gay if they know it&#39;s an option. One of the letters was from a girl who had thought she might be gay, but after taking the quiz decided she wasn&#39;t.)  Today Lisa told me that she is going to attempt to create gay SIMs characters. I asked her how one programs their romance aspects and she explained that you create the family tree, so she is going to make male/male or female/female spouses and see what happens.<br/>\n<br/>\nPat and I had also been discussing homosexuality recently because it has been in the national news headlines. Pat&#39;s cousin died from AIDs complications in the 80&#39;s. I never met him, but I&#39;ve asked Pat questions about his childhood memories of Terry. When did he realize his cousin was gay? What led him to realize it?<br/>\n<br/>\nJackie was not as interested in the Colonial House program, though she did watch about half of it. She was interested in their clothing. While we watched, she spent some time playing with Barbies and Digi-draw, and drew a number of portraits. In one Colonial House episode, one of the colonists drew a charcoal portrait of the lay preacher/governor. Other colonists were envious of the *leisure time* afforded to the artist (who was commanded to make the portrait) while the rest of them were processing lumber or preparing meals. Jackie asked me if I would borrow Colonial House from the library another time, and watch with her.  I said yes, then she went off to play something else.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":105765,"nextTopicId":105762}}