{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":217346155,"authorName":"k9gyp","from":"&quot;k9gyp&quot; &lt;doree.donovan@...&gt;","profile":"k9gyp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Also in Colorado","postDate":"1140163266","msgId":24353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGR0M3ZzMityNjYxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":24352,"nextInTime":24354,"topicId":24353,"numMessagesInTopic":0,"msgSnippet":"I am new to the group and also new to unschooling.  I love reading all the posts, but so far i have not introduced myself.  I have a 12 year old daughter who","messageBody":"<div id=\"ygrps-yiv-1701741548\">I am new to the group and also new to unschooling.  I love reading all<br/>\nthe posts, but so far i have not introduced myself.  I have a 12 year<br/>\nold daughter who has been to public school most of her life, but<br/>\nneither of us could stand the &quot;girl fights&quot; that persist at this age.<br/>\n I thought  junior high was hell on earth (I am a 6&#39; tall intelligent<br/>\ngeek) so why would I put her through the same thing?  I was actually<br/>\npretty good at skipping school and forgery, which gave me some relief.<br/>\n I live in Colorado, but my daughter and I love to travel, which is a<br/>\nnice way to learn and to spend time together. <br/>\n<br/>\nI have never wanted to nag my family about things (except Sunblock,<br/>\nthe call me a Sunscreen Nazi)and have low standards about the house. <br/>\nI do actually like to pick up things at times just to see what she is<br/>\nup to.        She still likes to play with American Girl dolls, Beanie<br/>\nBabies, and stuffed animals but she doesn&#39;t want anyone to witness<br/>\nthis.  I think it is great that she can be a kid and enjoy pretending,<br/>\none of the benefits of being at home.  Occaisionally, I will say &quot;I<br/>\nwill be ready to go as soon as you take some of your shoes to your<br/>\nroom&quot; because she is highly motivated to get out of the house.  She<br/>\nloves shoes, but does not wear them any longer than absolutely required.<br/>\n<br/>\nWe spend time most days training dogs, a passion we share.  My two<br/>\nolder daughters (26 and 19) have created a web site together;<br/>\nbordercollies.omegan.org.  My oldest daughter was homeschooled for<br/>\nhighschool, using a curriculum but little direction from me.  She went<br/>\nto a college for younger scholars called Simon&#39;s Rock in Great<br/>\nBarrington, MA when she was 15.  I mostly wanted to get her away from<br/>\nan older boyfriend, which was only partially successful because she<br/>\nwent back to him after getting her Associates degree.  He was<br/>\nemotionally abusive which I probably recognized since I was in a<br/>\nsimilar situation with her father at about the same age.  Luckily, we<br/>\nboth came to our senses in time in spite of our concerned mothers,<br/>\nwhom we both ignored. <br/>\n<br/>\nShe went back to college and majored in Religious Studies, deciding in<br/>\nher final year of college that she did not care to work in this field<br/>\nbecause she follows no specific religion.  She was also diagnosed with<br/>\nM.S. her final year in college, which helped her decide not to go to<br/>\ngraduate school.  She took several web design classes, which has led<br/>\nto several jobs in that area and also led her to meeting a nice fellow<br/>\nwho also works in that field.  She has been married for almost two<br/>\nyears and now works for Santa Fe Greenhouse making their online<br/>\ncatalog function nicely.  Together, she and her dh are involved<br/>\nputting on an annual in a science fiction conference called Bubonicon<br/>\nin Albuquerque.  <br/>\n<br/>\nI also found a much nicer fellow whom I have been married to for<br/>\nalmost 22 years.  He was not too supportive of homeschooling, but even<br/>\nhe recognized that you can lead a horse to water but you can&#39;t make<br/>\nher drink!  My youngest daughter is now much easier to be around, and<br/>\nmuch healthier emotionally.  We are enjoying deschooling, dogs, and<br/>\ntravel. <br/>\n<br/>\nDoree Donovan</div>","specialLinks":[]}],"prevTopicId":24352,"nextTopicId":24393}}