{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] goal setting was Re: voyage","postDate":"1056098894","msgId":74961,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVERkUxMUIyLUEyRkItMTFENy1BMTUyLTAwMEE5NTZFMTA5RUBtYWMuY29tPg==","inReplyToHeader":"PGJjc3RjMitxOWNkQGVHcm91cHMuY29tPg=="},"prevInTopic":74863,"nextInTopic":0,"prevInTime":74960,"nextInTime":74962,"topicId":74818,"numMessagesInTopic":0,"msgSnippet":"HA - I know you meant it as just an example -- but Rosie (12) is a horse nut - rides several times a week - and reads about horses a lot. So - what does she","messageBody":"<div id=\"ygrps-yiv-1431622636\">HA - I know you meant it as just an example -- but Rosie (12) is a <br/>\nhorse nut - rides several times a week - and reads about horses a lot.<br/>\n<br/>\nSo - what does she read?<br/>\n<br/>\nLOTS of Saddle Club books - they are brain candy.<br/>\nHorses of the World coloring book.<br/>\nHow to Draw Horses.<br/>\nOther children&#39;s books such as those by Marguerite Henry.<br/>\nManuals about horses - technical stuff put out by horse associations <br/>\nand 4H.<br/>\nHistorical fact-based horse novels.<br/>\nNonfiction books about the history of horses.<br/>\nHorse magazines.<br/>\nCollege textbooks on Equine Science (looks up information - doesn&#39;t sit <br/>\nand read from front to back).<br/>\n<br/>\n<br/>\n-pam<br/>\n<blockquote><span title=\"qreply\"> On Thursday, June 19, 2003, at 10:54 AM, shantinik wrote:<br/>\n<br/>\n&gt; You can do this with books, too -- if you&#39;re erstwhile &quot;4th<br/>\n&gt; grader&quot; (whatever that is) has been bitten by the horse bug, give her<br/>\n&gt; books reflecting a second grade, fifth grade, high school, and<br/>\n&gt; college understanding of the subject. Sometimes the 2nd grade version<br/>\n&gt; will be all that she wants (she just needed some good pictures);<br/>\n&gt; other times she&#39;ll want the college text (to learn about equine fetal<br/>\n&gt; birth defects.) And she&#39;ll watch her own understanding expand. </span></blockquote></div>","specialLinks":[]},{"userId":2448334,"authorName":"shantinik","from":"&quot;shantinik&quot; &lt;shantinik@...&gt;","profile":"shantinik","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"goal setting was Re: voyage","postDate":"1056045250","msgId":74863,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJjc3RjMitxOWNkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTMtREFWNzYxMVJsT1lJcE0wMDA0MDM3N0Bob3RtYWlsLmNvbT4="},"prevInTopic":74851,"nextInTopic":74961,"prevInTime":74862,"nextInTime":74864,"topicId":74818,"numMessagesInTopic":0,"msgSnippet":"... along with ... if my ... to do ... selling ... $50 by ... selling plants ... grow, he ... certain date. ... just ... our own ... 50 plants ... point he ...","messageBody":"<div id=\"ygrps-yiv-521083434\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, &quot;Robin Clevenger&quot; <br/>\n&lt;diamondair@e...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;    From: &quot;24hrmom&quot; &lt;24hrmom@s...&gt;<br/>\n&gt; &gt; David, could you, or any one else who does some goal setting <br/>\n </span></blockquote>along with<br/>\n<blockquote><span title=\"ireply\"> &gt; unschooling, expand on this a bit?<br/>\n&gt; <br/>\n&gt; The kids in our house learn goal-setting by example mostly. Though <br/>\n </span></blockquote>if my<br/>\n<blockquote><span title=\"ireply\"> &gt; kids have a project they&#39;re trying to achieve, I help suggest ways <br/>\n </span></blockquote>to do<br/>\n<blockquote><span title=\"ireply\"> &gt; that. For instance, my son hit on the idea last year of growing and <br/>\n </span></blockquote>selling<br/>\n<blockquote><span title=\"ireply\"> &gt; plants at garage sales in the summer. He ended up earning almost <br/>\n </span></blockquote>$50 by<br/>\n<blockquote><span title=\"ireply\"> &gt; himself. When he had this idea, we knew that he&#39;d need to be <br/>\n </span></blockquote>selling plants<br/>\n<blockquote><span title=\"ireply\"> &gt; by the end of the summer. So, given how much time plants need to <br/>\n </span></blockquote>grow, he<br/>\n<blockquote><span title=\"ireply\"> &gt; knew he needed to get a critical mass of plants in pots by a <br/>\n </span></blockquote>certain date.<br/>\n<blockquote><span title=\"ireply\"> &gt; He hit on the number of at least 30 plants. So I suggested he try <br/>\n </span></blockquote>just<br/>\n<blockquote><span title=\"ireply\"> &gt; potting 5 a day (he was growing them from cuttings and sprouts in <br/>\n </span></blockquote>our own<br/>\n<blockquote><span title=\"ireply\"> &gt; garden, not from seed). Within a couple of weeks, he had close to <br/>\n </span></blockquote>50 plants<br/>\n<blockquote><span title=\"ireply\"> &gt; in pots ready to go, and a few weeks later they had matured to the <br/>\n </span></blockquote>point he<br/>\n<blockquote><span title=\"ireply\"> &gt; could sell them.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I could hardly do better than Robin&#39;s response, and what little I <br/>\nknow of Robin (hi, there!) that is not in the least bit surprising -- <br/>\nathletes, and ski divers, and musicians (I only qualify -- barely -- <br/>\namong the last) are goal experts!<br/>\n<br/>\nThe bigger point is that goal-setting and evaluation is only one of <br/>\nmany ways to help kids develop their own self-awareness.<br/>\n<br/>\nOne favorite of mine is to set a day with your child once a year -- <br/>\ntake a big cake and a yellow pad to the park, and write down (random -<br/>\n- no organization necessary) all the things she says she now knows <br/>\nabout the world. Seal it up in an envelope, and open it with her on <br/>\nthat same day the following year. For kids who think they haven&#39;t <br/>\nbeen learning anything, this will surely do the trick!<br/>\n<br/>\nThen there is the old music teacher&#39;s trick -- a child should always <br/>\nbe working on a piece that is easy enough for her to be perfecting, a <br/>\npiece that moves her forward a little bit and competence, and there <br/>\nshould always be one piece that she likes but is WAY too difficult <br/>\nfor her now, but that she can drag out every once in a while. As time <br/>\ngoes by, she is able to see how much closer to playing it she has <br/>\ncome.  You can do this with books, too -- if you&#39;re erstwhile &quot;4th <br/>\ngrader&quot; (whatever that is) has been bitten by the horse bug, give her <br/>\nbooks reflecting a second grade, fifth grade, high school, and <br/>\ncollege understanding of the subject. Sometimes the 2nd grade version <br/>\nwill be all that she wants (she just needed some good pictures); <br/>\nother times she&#39;ll want the college text (to learn about equine fetal <br/>\nbirth defects.) And she&#39;ll watch her own understanding expand.<br/>\n<br/>\nRobin&#39;s &quot;planting planning&quot; is a terrific tool. When my daughter was <br/>\nplaying the flute at the Farmers Market to earn enough money to buy <br/>\nherself a dog (an expensive one -- a Westie), part of the job was to <br/>\nplot her earnings on a graph, and to figure out the percentage of how <br/>\nclose she was to her goal. (We also use to weigh and measure snakes <br/>\nwhen the kids were younger, so that they could see an analogy to <br/>\ntheir own physical development.)<br/>\n<br/>\nLearning contracts are great tools, too -- I don&#39;t have time to write <br/>\nan essay about them just now, but I&#39;m planning one for my column. But <br/>\none of the nice things about contracts is that it can turn &quot;quitters&quot; <br/>\ninto &quot;graduates&quot;  -- instead of having &quot;quit violin playing&quot;, she <br/>\nhas &quot;graduated from violin playing&quot;, having taken in the learning she <br/>\nwants at this time, and can move on to other things, all in a very <br/>\nself-aware manner in which she has learned something about herself.<br/>\n(My Sept/Oct Home Ed. Mag. column will be on Meera&#39;s graduation from <br/>\nthe flute -- if you e-mail me privately, I&#39;ll send you an advance <br/>\ndraft.)<br/>\n<br/>\nHope that helps! Robin -- I LOVED your response.<br/>\n<br/>\ndavid<br/>\nwww.skylarksings.com</div>","specialLinks":[]},{"userId":8226888,"authorName":"Robin Clevenger","from":"&quot;Robin Clevenger&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: goal setting was Re: voyage","postDate":"1056035273","msgId":74851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTMtREFWNzYxMVJsT1lJcE0wMDA0MDM3N0Bob3RtYWlsLmNvbT4=","referencesHeader":"PDEwNTU5OTUwNzMuMjE0Mi4zNjIzOC5tMUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":74818,"nextInTopic":74863,"prevInTime":74850,"nextInTime":74852,"topicId":74818,"numMessagesInTopic":0,"msgSnippet":"... unschooling, expand on this a bit? The kids in our house learn goal-setting by example mostly. Though if my kids have a project they re trying to achieve,","messageBody":"<div id=\"ygrps-yiv-1024481655\"><blockquote><span title=\"ireply\">&gt;    From: &quot;24hrmom&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:24hrmom@...\">24hrmom@...</a>&gt;<br/>\n&gt; David, could you, or any one else who does some goal setting along with<br/>\n </span></blockquote>unschooling, expand on this a bit?<br/>\n<br/>\nThe kids in our house learn goal-setting by example mostly. Though if my<br/>\nkids have a project they&#39;re trying to achieve, I help suggest ways to do<br/>\nthat. For instance, my son hit on the idea last year of growing and selling<br/>\nplants at garage sales in the summer. He ended up earning almost $50 by<br/>\nhimself. When he had this idea, we knew that he&#39;d need to be selling plants<br/>\nby the end of the summer. So, given how much time plants need to grow, he<br/>\nknew he needed to get a critical mass of plants in pots by a certain date.<br/>\nHe hit on the number of at least 30 plants. So I suggested he try just<br/>\npotting 5 a day (he was growing them from cuttings and sprouts in our own<br/>\ngarden, not from seed). Within a couple of weeks, he had close to 50 plants<br/>\nin pots ready to go, and a few weeks later they had matured to the point he<br/>\ncould sell them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you - as in you and your family - make short (months) and long-term<br/>\n </span></blockquote>(years) goals?  How specific are they? How often do you revisit them?  Do<br/>\nyou revisit them mostly for interest to see if you ended up following the<br/>\npaths you thought you would, and then set new ones?  Or do you actively<br/>\nreview and pursue them daily/weekly?&gt;&gt;&gt;&gt;<br/>\n<br/>\nBoth my husband and I set goals for ourselves, both long term and<br/>\nshort-term. And we have family goals as well. One of our family&#39;s goals to<br/>\nlive off of the grid. Our medium range goal is to consume no more gasoline.<br/>\nSo three years ago we bought enough biking gear to get us and the kids<br/>\naround town as much as posible. That cut down on our fuel consumption<br/>\ndrastically. Then this year we bought an old diesel car with the intention<br/>\nof running it on biodiesel (made from waste vegetable oil). Right now, DH is<br/>\nclearing a spot in the back yard to build a shed to manufacture our own<br/>\nbiodiesel. We&#39;ve also been gradually accumulating the supplies we need -<br/>\nbeakers, 50-gallon drums, funnels, etc. and making contacts with restaurant<br/>\nowners to get waste fryer oil. Within the month, the shed should be<br/>\nfinished, and within 2 months, we should be running at least one car on<br/>\nbiodiesel.<br/>\nSo that&#39;s one of our family&#39;s goals. I have two big individual<br/>\ngoals--publishing my first novel, and completing the Ironman triathlon. The<br/>\nkids see me accomplish smaller goals toward those two big ones. I&#39;m editing<br/>\nmy book right now, so I set aside an hour a day for that. I set aside<br/>\nanother 1 - 2 hours for my triathlon workouts. I just completed a<br/>\nhalf-marathon which is one of the smaller goals on the way to Ironman. So<br/>\nthe kids get an idea that goals can be long or short term, and that you need<br/>\nto make it a priority to work toward them every day. These are things we<br/>\ntalk about in the course of living together, because the kids readily see<br/>\nthat our goals and the steps we take toward them are a big part of our<br/>\nlives.<br/>\nMy personal goals are very specific. I started toward the Ironman two years<br/>\nago. That year I trained for a Sprint distance triathlon. The next year I<br/>\ntrained for an Olympic distance triathlon. This year it&#39;s more Olympic<br/>\ndistance races and a half-marathon. Next year it will be a half-ironman. The<br/>\nyear after a marathon and a half-ironman and the year after that the<br/>\nIronman. Now I know people who train for the Ironman in a year, but I have<br/>\nno urge to jettison my family life for a goal (which is what you have to do<br/>\npractically in order to do it that way). Also, I think my slow-and-steady<br/>\napproach is less likely to lead to overtraining, burnout, and injury. Within<br/>\nthe framework of these stepping-stone goals, I have increasingly smaller<br/>\ngoals. Distance and time goals, weekly workout goals, daily workout goals,<br/>\nand goals within each workout (like to run a certain pace, or swim 500 yards<br/>\nin under 7 minutes, or whatever).<br/>\nSo I guess to answer your questions, I revisit my goals daily because I have<br/>\nthese micro and macro goals within my larger goal framework. I track my<br/>\nprogress in Excel spreadsheets and the like. And when these larger goals are<br/>\naccomplished, I&#39;m sure I will find new goals to pursue.<br/>\nMy kids have likewise set goals. My son finished his first duathlon last<br/>\nyear, and he trained for that. He did the plant sales I mentioned above. He<br/>\nstarted a kid&#39;s writer&#39;s group and set a mini-goal to get his writing for<br/>\nthe next week&#39;s meeting done by a certain day of the week. He&#39;s 6 1/2, BTW.<br/>\nMy daughter (3 1/2) has stated that she has the goal of learning to rock<br/>\nclimb. I took her down to the rock gym this week and am signing us up for a<br/>\nclass. She also is taking violin lessons and practices towards her goals in<br/>\nthat (which right now are basically to master Twinkle Twinkle Little Star).<br/>\nSo even at pretty young ages, kids can determine their own goals and start<br/>\ntaking steps towards them. In case it isn&#39;t clear, none of my kids&#39; goals<br/>\nare mandatory or enforced by me. These are things that have come from within<br/>\nthem, and I help them with things like setting up classes, providing<br/>\ntransportation, and giving input on how to accomplish their goals.<br/>\n<br/>\nBlue Skies!<br/>\n   -Robin-</div>","specialLinks":[]},{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"goal setting was Re: voyage","postDate":"1055988948","msgId":74818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDYwMWMzMzYwOCRiMzZmZTk0MCQ2NDAxYThjMEB0YXJ6YW4+","referencesHeader":"PGJjcW01aythdW8yQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":74851,"prevInTime":74817,"nextInTime":74819,"topicId":74818,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-119792821\">&lt;&lt;shantinik wrote:<br/>\nIn my house, where our practice differs from that of SOME unschoolers <br/>\nis that we do a lot of goal setting. The education is still &quot;child-<br/>\ndirected, family-centered&quot;, but I&#39;m also a believer in the theory of <br/>\nFLOW -- small goals set and small goals met lead to larger ones <br/>\nlater. We are little bound by the tyranny of subject matter, and we <br/>\nput the kids&#39; pursuit of their own passions first on our collective <br/>\nfamily lists, but we do explicitly help them set goals for <br/>\nthemselves, and help them evaluate them along the way -- I want them <br/>\nto become self-aware of the journey.&gt;&gt;<br/>\n<br/>\nDavid, could you, or any one else who does some goal setting along with unschooling, expand on this a bit?  <br/>\n<br/>\nMy kids are 6, 9, and 11 and have their areas of interest and I can see daily through their activities and discussions how they are pursuing them.  <br/>\nPlus, with life going on around them they are introduced to other things that they may or may not find interesting or choose to pursue. I&#39;ve thought about doing some goal setting with them for the same reason you mentioned, though you put it much more eloquently than my thoughts: &quot;to become self-aware of the journey&quot;.  But I haven&#39;t yet been able to reconcile in my mind how these interests/pursuits might be translated into goals.  I know they are their goals to make, but I&#39;d be more comfortable bringing the subject up if I had a reasonable idea of how it might work for them.<br/>\n<br/>\nFor example, my eldest&#39;s biggest interest is video games, specifically RPGs.  I can see through our conversations the level of detail he gets to.  He discusses character development with me, calls me to hear the music he likes in the game and describes how they use it to set the mood, critiques stories he reads online based on the game characters and plot, replays games in various ways to get specific outcomes, often trying to &quot;outsmart&quot; the software, and is working (in his head right now) on his own story, not to mention the logic and math etc. that comes up in the games themselves.  He spends a lot of time reading about his current games, both in magazines and online.  <br/>\n<br/>\nI&#39;m kinda stumped in coming up with an idea of how these pursuits may be translated into goals so that he becomes more aware of his journey / progress.  A couple weeks ago he made an offhand remark that he hasn&#39;t learned anything this past year of homeschooling, he&#39;s just been playing. To which I laughed along and pointed out just a couple of the things he&#39;s learned along the way.  On the other hand, I don&#39;t want to emphasize what he&#39;s learning too much if it&#39;s going to lessen the enjoyment of the learning.  Any ideas?<br/>\n<br/>\nDo you - as in you and your family - make short (months) and long-term (years) goals?  How specific are they? How often do you revisit them?  Do you revisit them mostly for interest to see if you ended up following the paths you thought you would, and then set new ones?  Or do you actively review and pursue them daily/weekly?<br/>\n<br/>\nPam L.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":74864,"nextTopicId":2293}}