{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] What this list is and is not (was Re:  What unschooling is not)","postDate":"1304423376","msgId":60994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGQzVGQTIxLUVCMjQtNDM2QS05QzVCLUMwMEQ0NzBBNkQ3OEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEVDODIwNzkwLTc1QjUtNEI3Ri05M0UzLTc2NkZBMTlBRDUxMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDE4M0Q0ODVFLUU5QUQtNDMyRi1BQTU2LUYxNjU4QTQ4Rjk5MkBTYW5kcmFkb2RkLmNvbT4gPEVDODIwNzkwLTc1QjUtNEI3Ri05M0UzLTc2NkZBMTlBRDUxMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60991,"nextInTopic":0,"prevInTime":60993,"nextInTime":60995,"topicId":60987,"numMessagesInTopic":0,"msgSnippet":"... Honest bafflement perhaps but the questions wouldn t get you the answers you were looking for nor get you new insights. (Which weren t the same thing.) ","messageBody":"<div id=\"ygrps-yiv-1575541005\"><blockquote><span title=\"ireply\">&gt; my honest questions were rebuffed.<br/>\n<br/>\n </span></blockquote>Honest bafflement perhaps but the questions wouldn&#39;t get you the  <br/>\nanswers you were looking for nor get you new insights. (Which weren&#39;t  <br/>\nthe same thing.)<br/>\n<br/>\nWhen people get flabbergasted by ideas that seem disconnected from  <br/>\nreality, the questioner often asks &quot;questions&quot; with preconceived  <br/>\nanswers in mind.<br/>\n<br/>\nMoms do it to kids all the time when a child has made or is making  <br/>\nseemingly thoughtless choices:<br/>\n<br/>\n&quot;Did you *want* to hurt your sister??&quot; if a kid pushed his sister.<br/>\n&quot;Do you *want* to be a checker at Walmart?&quot; if a kid isn&#39;t &quot;applying&quot;  <br/>\nhimself at school.<br/>\n<br/>\nThey do it to fundamentalist Christians:<br/>\n<br/>\n&quot;Do you want someone else to do your thinking for you?&quot;<br/>\n<br/>\nAnd they do it to seemingly clueless radical unschoolers:<br/>\n<br/>\n&quot;Aren&#39;t we supposed to the parent or should kids run the show?&quot;<br/>\n<br/>\nWhen someone already knows the &quot;right&quot; answer, those kinds of  <br/>\nquestions won&#39;t help them understand the different point of view. The  <br/>\nquestioner&#39;s focus is on trying to fit these bizarre ideas into the  <br/>\nbox they&#39;re certain is the only proper box to be in.<br/>\n<br/>\nEven if the child tries to explain why he pushed his sister, the mom  <br/>\nisn&#39;t likely to listen. Her whole focus is on fixing the child&#39;s  <br/>\nmistaken notion that hurting someone is okay and anything that doesn&#39;t  <br/>\nsound like &quot;right thinking&quot; is irrelevant. She won&#39;t step into his  <br/>\nshoes and see the world through him in order to help him find better  <br/>\nchoices.<br/>\n<br/>\nEven if a child tries to explain why he doesn&#39;t like school, the mom  <br/>\nis so focused on grades being all that matters that she won&#39;t hear his  <br/>\nconcerns or won&#39;t be able to help him figure out what&#39;s getting in the  <br/>\nway.<br/>\n<br/>\nEven if an unschooler tries to explain why they make the choices they  <br/>\ndo, the ideas won&#39;t fit into conventional boxes. The ideas very often  <br/>\nsound like neglect, sound like cluelessness, sound like being more  <br/>\nconcerned with some airy-fairy philosophy and not caring about what  <br/>\neveryone knows kids need (like discipline, like for parents to be  <br/>\nparents not friends, like being taught the right choices to make).<br/>\n<br/>\nIf someone wants to understand a new point of view, whether it be of a  <br/>\nchild, someone of another religion, or someone with a new approach, it  <br/>\nhelps to *temporarily* let go of your own point of view. Start with a  <br/>\nblank slate.<br/>\n<br/>\nSandra has the story of the Zen master and how it&#39;s necessary to empty  <br/>\nyour cup before you can put something new in:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nAssume that they are right from their point of view. Work to  <br/>\nunderstand that point of view. What are their goals? What are they  <br/>\ntrying to achieve? What&#39;s important to them?<br/>\n<br/>\nYou don&#39;t need to believe their point of view is right for you to do  <br/>\nthis! This is a temporary shift in order to understand a new point of  <br/>\nview. You don&#39;t need to believe the Bible is the Word of God in order  <br/>\nto grow an understanding of why someone else believes that to be true  <br/>\nand how it shifts their view of how the world works and why spanking  <br/>\nmight seem a far far better choice than eternal damnation. You don&#39;t  <br/>\nneed to believe that hurting someone is a right choice to work at  <br/>\nunderstanding why someone could feel so desperate that they lashed  <br/>\nout, nor to help them figure out better options for next time.<br/>\n<br/>\nYou don&#39;t need to believe radical unschooling ideas are right *for  <br/>\nyou* to try to understand a why unschoolers do what they do, why they  <br/>\nsee the world as they see it. But to grow a whole new understanding it  <br/>\nhelps to begin asking questions assuming the list members love their  <br/>\nkids and do care about their happiness, health and being able to be  <br/>\nindependent in the world as adults. Then ask questions about how they  <br/>\navoid what society believes will happen (like alcoholism, zombiehood,  <br/>\nslothism, and so on). And why do they believe that will work? And what  <br/>\nexperience are they basing that on?<br/>\n<br/>\nQuestions asked from a sincere attitude of &quot;These are very intriguing  <br/>\nideas I&#39;d like to understand better,&quot; will always garner more and  <br/>\nbetter responses than questions asked from an attitude of &quot;Convince me  <br/>\nyou&#39;re not as crazy as you sound.&quot;<br/>\n<br/>\nWhile the Always Learning list is more oriented towards people who  <br/>\nwant to deepen their understanding or radical unschooling and grow  <br/>\ntheir ability to make it work in their families., when questions are  <br/>\nasked with a sincere desire to understand something that sounds cool,  <br/>\nit&#39;s likely to inspire a desire to help from several people on the  <br/>\nlist. Questions asked with an attitude of &quot;You guys need to convince  <br/>\nme you&#39;re not nuts before I&#39;m going to take in anything you say,&quot; are  <br/>\nmore likely to inspire irritation. It&#39;s just a fact of life that it&#39;s  <br/>\nmore enjoyable, seems a more valuable use of limited time, to help  <br/>\npeople who are eager to learn about something they think sounds  <br/>\nexciting than people who expect they are owed convincing explanations.<br/>\n<br/>\nIf someone is fuzzy about what radical unschooling is, Sandra&#39;s  <br/>\nwebsite is a treasure trove of writings. Mine tackles many of the most  <br/>\ncommon concerns:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nBut if someone needs feedback for their questions, The Unschooling  <br/>\nBasics list and the Radical Unschoolers Network are good places to  <br/>\nbegin.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://familyrun.ning.com/forum/topic/list\">http://familyrun.ning.com/forum/topic/list</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics\">http://groups.yahoo.com/group/unschoolingbasics</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] What this list is and is not (was Re:  What unschooling is not)","postDate":"1304372114","msgId":60991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyNjk0LjcyMDI1LnFtQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEVDODIwNzkwLTc1QjUtNEI3Ri05M0UzLTc2NkZBMTlBRDUxMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDE4M0Q0ODVFLUU5QUQtNDMyRi1BQTU2LUYxNjU4QTQ4Rjk5MkBTYW5kcmFkb2RkLmNvbT4gPEVDODIwNzkwLTc1QjUtNEI3Ri05M0UzLTc2NkZBMTlBRDUxMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60990,"nextInTopic":60994,"prevInTime":60990,"nextInTime":60992,"topicId":60987,"numMessagesInTopic":0,"msgSnippet":"When I first joined an unschooling list I posted something and got an answer that made me stop and think about what I had written and made me think why I was","messageBody":"<div id=\"ygrps-yiv-1731908651\">When I first joined an unschooling list I posted something and got an answer that made me stop and think about<br/>\nwhat I had written and made me think why I was asking it.<br/>\nI then lurked a lot and then I joined this list and again I had some of my ideas challenged Still do!<br/>\nNot only my ideas but the words I was using.<br/>\nFrom the very beginning I got unschooling. Every time I read something that  was different I was like &quot;wow. That makes sense&quot;<br/>\nIt has been almost 7 years since I joined unschooling discussion list and it  almost 8.5 since I started reading about unschooling.<br/>\nI am still getting it. As my children grow and things change I learn more and more. It does take time. <br/>\n <br/>\n <br/>\nJust a couple months ago I met a new mother to our local homeschooling list. After talking to her she was really interested in learning about unschooling as her child is just 5 years old and she is just starting on homeschooling.<br/>\nI gave her links to Sandra and Joyce&#39;s sites, this group and she borrowed several of my books.<br/>\nI told her that if she joined this group she should just lurk. I told her that it would take her a long time to get it and that<br/>\nit may challenge many of her  ideas on parenting and learning. She is very open to it.<br/>\nShe just returned Sandra&#39;s Big book and she told me the book gave her a headache. SHe said it was awesome but that  the ideas in it are so different to what she was raised with and what was common practice that after reading a bit she would get a headache from thinking about it. She said she has so much to &quot;unlearn&quot;, her words.<br/>\nI told her to read a bit, try a bit , watch her child.<br/>\nI told her that many come to unschooling and read things but don;t really understand why and they go ahead and try to follow unschooling &quot;rules&quot; and it is a mess.<br/>\nLike some read that  there are no bed times and they just tell their kids that they can , from now on, go to bed whenever they want. It is usually a mess. <br/>\nMy kids never had bed times. I always helped them sleep. I also do tell them to be quite if they want to stay up later than their dad or me.<br/>\nI tell them that they may want to go to bed earlier if we are getting up early for something fun.<br/>\nI read to my daughter every night because that is what she likes to go to sleep.  It is not a mess here.<br/>\nI facilitate. I am present. I help them!<br/>\nSometimes my son stays up late , sometimes he comes to bed earlier because we are getting up early and he does not want to be tired. He is only 8.<br/>\nMy kids eat whatever they want. But that does not mean they only eat candy and chips. Just for lunch we had some very healthy stuff and they ate all their broccoli, because they like it. Gigi is now eating some Hershey Kisses and MD wants some more apple sauce.<br/>\nI provide food , I make sure I have what they like. I have no problem making different  meals to my kids and husband ( he is peculiar).<br/>\nI have lots of candy and snacks and food that is called &quot;junk&quot; in my house. My kids do not eat only that. <br/>\nWell got to go give MD more apple sauce. I hope I made some sense!<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What this list is and is not (was Re:  What unschooling is not)","postDate":"1304369977","msgId":60990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVDODIwNzkwLTc1QjUtNEI3Ri05M0UzLTc2NkZBMTlBRDUxMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE4M0Q0ODVFLUU5QUQtNDMyRi1BQTU2LUYxNjU4QTQ4Rjk5MkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDE4M0Q0ODVFLUU5QUQtNDMyRi1BQTU2LUYxNjU4QTQ4Rjk5MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60989,"nextInTopic":60991,"prevInTime":60989,"nextInTime":60991,"topicId":60987,"numMessagesInTopic":0,"msgSnippet":"We have a complaint from a member who had a post returned.  I m bringing the post anonymously, because the mom might understand this soon and not want to have","messageBody":"<div id=\"ygrps-yiv-470840185\">We have a complaint from a member who had a post returned.  I&#39;m bringing the post anonymously, because the mom might understand this soon and not want to have pissed too many people off in the best place she could come to learn about unschooling.<br/>\n<br/>\n-=-I don&#39;t understand why my post was returned.-=-<br/>\n<br/>\nPosts are occasionally returned, for lack of value to the list according to the criteria here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearningPOSTS\">http://sandradodd.com/lists/alwayslearningPOSTS</a><br/>\n<br/>\nLest this post be considered insufficiently valuable, I think these responses will help others, and the author of the complaints, to understand &#39;where we people are coming from,&#39; so the unschooling information can flow more freely.<br/>\n<br/>\n-=- I am trying to understand this Radical Un schooling but it doesn&#39;t jive with so much that I have experienced in<br/>\nmy life that I am having a difficult time understanding where you people are coming from.-=- <br/>\n<br/>\nIt&#39;s fine not to understand.<br/>\nRead a little, try a little, wait a while, watch.  Watch your children, and your own thoughts.   Then read some more.  It can&#39;t be understood all at once.<br/>\n<br/>\n-=-I don&#39;t think reading the list for a month is going to help me understand. I NEED conversation, interaction, debate to help ME learn-=- <br/>\n<br/>\nThe list only arrives in text, so reading is all there is.  There isn&#39;t interaction except in writing.  There isn&#39;t conversation except in writing.  There shouldn&#39;t be too much debate.  The list is nine and a half years old.  Joyce&#39;s page probably is, too.  Mine&#39;s older.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gettingit\">http://sandradodd.com/gettingit</a><br/>\nThere are some reports of people getting it.  None of them said, &quot;I read the list for a month and now I get it!&quot;<br/>\n<br/>\n-=-...but I feel like I was swept under the rug because I have only been on list two days and so<br/>\nmy honest questions were rebuffed.-=- <br/>\n<br/>\nCriticism and insult were rebuffed.<br/>\nAnyone who has only been on the list two days and wants to express ideas from the point of view of someone who knows nothing about unschooling is writing too soon.<br/>\n<br/>\n-=-I KNOW you don&#39;t treat your children like that so why me?-=- <br/>\n<br/>\n#1, you&#39;re not the child of anyone here.<br/>\n#2, you&#39;re not a child.<br/>\n#3, you came to a discussion group as an adult.<br/>\n#4, you have children at your house.  We would like to help you treat your children the way we treat ours.<br/>\n<br/>\nThis complaint is made a time or two a year.  If a mother wants to be treated as a child, that&#39;s beyond the scope of this list.  We KNOW that many adults had insufficient nurturing and would like to be babied and soothed and rocked and sung to.  We can&#39;t rock and sing here anyway, but mothers can heal their own sad childhoods by babying, soothing, rocking and singing to their own children.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/issues\">http://sandradodd.com/issues</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being/healing\">http://sandradodd.com/being/healing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rentalk\">http://sandradodd.com/rentalk</a><br/>\n<br/>\n-=-I DON&#39;T learrn by just reading, all my senses have to be engaged.-=-<br/>\n<br/>\nThis complaint hasn&#39;t been made before, ever, I don&#39;t think.<br/>\nAs it&#39;s a text-based chat, I don&#39;t think anyone has ever complained that there was nothing to touch, taste, hear or smell.   But there is this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a> which recommends just that--to do things with children that involve all their senses.  <br/>\nThat would be a good way to read a little, try a little, wait a while, watch, hear, taste, smell and touch.  And then that mom would have something cool to write about, or some real questions to ask.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: What unschooling is not","postDate":"1304353839","msgId":60989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc1RTdCMUIzLTREMzItNDI2MS05RTFCLTZDMDI3MzA2RDkxM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlwbWJhcyt1cXNkQGVHcm91cHMuY29tPg==","referencesHeader":"PGlwbWJhcyt1cXNkQGVHcm91cHMuY29tPg=="},"prevInTopic":60988,"nextInTopic":60990,"prevInTime":60988,"nextInTime":60990,"topicId":60987,"numMessagesInTopic":0,"msgSnippet":"I like this, Sarah: -=-I make things ready for exploration in many directions. Sometimes it s like laying track in front of a moving train, sometimes I m","messageBody":"<div id=\"ygrps-yiv-356784269\">I like this, Sarah:<br/>\n<br/>\n-=-I make things ready for exploration in many directions. Sometimes it&#39;s like laying track in front of a moving train, sometimes I&#39;m better prepared! Structures don&#39;t have to be restrictive, they can be enabling.-=-<br/>\n<br/>\nSometimes it&#39;s as simple as clearing off tables and counters, which someone called years back preparing a blank canvas for the kids.<br/>\n<br/>\nSomething some of the coolest dads do is keep bikes and skates in good operation.  We weren&#39;t as good at that part as I wish we had been.  Our pogo stick froze up (the kids were already past using it) and the varnish on the stilts is all dangerously flakey now. :-)   Maintaining a fleet of kid conveyances is hard work.  We did keep Marty in sharpened ice skates for many years, and by the time the kids were driving, we could afford to put cars in the shop when they started to squeak or wobble (before they actually broke).<br/>\n<br/>\nIt was touching to see how attentive Keith is to the car Holly&#39;s driving.  He cares extra much about his little girl.  Then I had the second wave thought:  HEY, man.  With me it was &quot;call me if it breaks,&quot; and with the boys it was &quot;tell me if it gets worse.&quot;  :-)    But partly he&#39;s older and wiser and not as worried about money, and mostly he&#39;s very aware of Holly&#39;s safety.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":246186758,"authorName":"Sarah","from":"&quot;Sarah&quot; &lt;yahoo@...&gt;","profile":"sarahlexis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: What unschooling is not","postDate":"1304342684","msgId":60988,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlwbWJhcyt1cXNkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE4M0Q0ODVFLUU5QUQtNDMyRi1BQTU2LUYxNjU4QTQ4Rjk5MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60987,"nextInTopic":60989,"prevInTime":60987,"nextInTime":60989,"topicId":60987,"numMessagesInTopic":0,"msgSnippet":"I was thinking about this (broadly) recently, I was talking to a friend who told me that what I m doing sounds lovely but children need structure . The","messageBody":"<div id=\"ygrps-yiv-514931820\">I was thinking about this (broadly) recently, I was talking to a friend who told me that what I&#39;m doing sounds lovely but &#39;children need structure&#39;. The situation wasn&#39;t really appropriate for a proper response but what I wanted to say is that we have *tonnes* of structure! That&#39;s what I do with my time, particularly now, while my children are so young. I build the structures that support learning. I make our unschooling nest, I research, I collect ideas and materials, I make things ready for exploration in many directions. Sometimes it&#39;s like laying track in front of a moving train, sometimes I&#39;m better prepared! Structures don&#39;t have to be restrictive, they can be enabling.<br/>\n <br/>\n<blockquote><span title=\"qreply\"> &gt; &quot;A bit of mom ideas&quot; isn&#39;t a contrast to unschooling, unless &quot;mom ideas&quot; meant schoolish assignments.<br/>\n&gt; <br/>\n&gt; When unschooling is working well, life is rich and learning is happening all the time, no one needs &quot;to lead&quot;--it will be happening all the time, without any days off.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n&gt; <br/>\n&gt; If any of the many new members haven&#39;t read this, please do:<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\n&gt; and the pages linked there for new members, and with posting guidelines.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"What unschooling is not","postDate":"1304297380","msgId":60987,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4M0Q0ODVFLUU5QUQtNDMyRi1BQTU2LUYxNjU4QTQ4Rjk5MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":60988,"prevInTime":60986,"nextInTime":60988,"topicId":60987,"numMessagesInTopic":0,"msgSnippet":"-=- I m new here. I ve been homeschooling for a dozen years and we have tried every different way of schooling, eventually leaning towards, child led/un","messageBody":"<div id=\"ygrps-yiv-1774113854\">-=- I&#39;m new here. I&#39;ve been homeschooling for a dozen years <br/>\nand we have tried every different way of schooling, <br/>\neventually leaning towards, child led/un schooling with a <br/>\nbit of mom ideas thrown in.  I just can&#39;t seem to go to all <br/>\nout un schooling.-=-<br/>\n<br/>\nThis is from a post that was returned by a moderator for good reasons.  I just want to address this first part, for the benefit of the twenty new members of the list, and anyone else who has joined lately.<br/>\n<br/>\n&quot;Child led&quot; isn&#39;t a term used on this list.  <br/>\n<br/>\n&quot;A bit of mom ideas&quot; isn&#39;t a contrast to unschooling, unless &quot;mom ideas&quot; meant schoolish assignments.<br/>\n<br/>\nWhen unschooling is working well, life is rich and learning is happening all the time, no one needs &quot;to lead&quot;--it will be happening all the time, without any days off.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<br/>\nIf any of the many new members haven&#39;t read this, please do:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\nand the pages linked there for new members, and with posting guidelines.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":60992,"nextTopicId":61013}}