{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] I have picked up the book I never got  a chance to really read Quit School and","postDate":"1009560978","msgId":30336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAxMTIyODA5MzI1NC4wMjcwMzg0MEBsb2NhbGhvc3Q+","inReplyToHeader":"PDIwMDExMjI4MTIxMjEwLjQ4Njc2LnFtYWlsQHdlYjExNjA2Lm1haWwueWFob28uY29tPg==","referencesHeader":"PDJFRUFEREVDLUZCNjQtMTFENS04QzM1LTAwMDM5MzQ5RDRBRUBob3VzdG9uLnJyLmNvbT4="},"prevInTopic":30328,"nextInTopic":0,"prevInTime":30335,"nextInTime":30337,"topicId":30306,"numMessagesInTopic":0,"msgSnippet":"... I was just reading recently about MA and satisfying their regs.  It might have been here, in which case you d find it in the archives.  But one of the","messageBody":"<div id=\"ygrps-yiv-1885741480\"><blockquote><span title=\"ireply\">&gt;  Now my only question is how to provide the necessary documentation to <br/>\n&gt; please the school district at the end of the year. I think that has been <br/>\n&gt; some of the most pressure I&#39;ve been feeling. Still a prisoner and they <br/>\n&gt; don&#39;t even attend ps anymore.<br/>\n<br/>\n </span></blockquote>I was just reading recently about MA and satisfying their regs.  It might <br/>\nhave been here, in which case you&#39;d find it in the archives.  But one of <br/>\nthe suggestions was for a MA hs list.  If you don&#39;t find it in the <br/>\narchives, maybe you could search Yahoogroups.  Or it might show up on <br/>\nunschooling.com.  At any rate, it sounded like it wouldn&#39;t be that hard to do.<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":59497572,"authorName":"Sarah Carothers","from":"Sarah Carothers &lt;puddles@...&gt;","profile":"sarahjocarothers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] I have picked up the book I never got a chance to really read Quit School and","postDate":"1009557723","msgId":30328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTQxNDUzOTE2MWNjMUZFNkBNYWlsNi50cmlhZC5yci5jb20+","inReplyToHeader":"PGEwZ2ZwcCtpbDQwQGVHcm91cHMuY29tPg==","referencesHeader":"PDJFRUFEREVDLUZCNjQtMTFENS04QzM1LTAwMDM5MzQ5RDRBRUBob3VzdG9uLnJyLmNvbT4="},"prevInTopic":30321,"nextInTopic":30336,"prevInTime":30327,"nextInTime":30329,"topicId":30306,"numMessagesInTopic":0,"msgSnippet":"I m going to chop up the posts, too, to respond. ... ~~~~~~~~~~~~~~~~~~~~~~~~` When I first read this, I missed reading the subject line and wondered if","messageBody":"<div id=\"ygrps-yiv-1279774784\">I&#39;m going to chop up the posts, too, to respond.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;On Thursday, December 27, 2001, at 06:53 PM, dljones0 wrote:<br/>\n&gt;<br/>\n&gt;&gt; Get a Life. <br/>\n<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~`<br/>\nWhen I first read this, I missed reading the subject line and <br/>\nwondered if somebody had made you mad! (did anybody else miss the <br/>\nsubject line that led into this sentence?&lt;G&gt;)<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>Mimi wrote:<br/>\n I consider unschooling to be more of a<br/>\n<blockquote><span title=\"ireply\"> &gt;style<br/>\n&gt;of parenting (or lifestyle) than purely a method of educating my<br/>\n&gt;children.  Unschooling encourages a child to grow up to be a<br/>\n&gt;happy,<br/>\n&gt;self-confident, auto-didactic, self-regulating,<br/>\n&gt;self-entertaining,<br/>\n&gt;curious and  a self-assured person.  If a person is lucky enough<br/>\n&gt;to have<br/>\n&gt;some or all of those traits then that person&#39;s education will be<br/>\n&gt;a<br/>\n&gt;natural and painless part of his/her life and s/he will be<br/>\n&gt;learning all<br/>\n&gt;the time.<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nSo true. When we go with the natural talents a child has, it *is* a <br/>\npainless procedure. But to get there, we have to release our past <br/>\nupbringing of &quot;this is how it&#39;s done&quot; and &quot;this is what you need to <br/>\nknow&quot; stuff. Hard to do but well worth it in the end.<br/>\n<br/>\nDebbie wrote:<br/>\n Since quitting school in April, I am wondering if he<br/>\n<blockquote><span title=\"ireply\"> &gt;needs<br/>\n&gt;&gt; more time to deschool because academics is just not setting<br/>\n&gt;well with<br/>\n&gt;&gt; him at all.<br/>\n&gt;+++++++++++++++++++++++<br/>\n </span></blockquote>Mimi responded:<br/>\n<blockquote><span title=\"ireply\"> &gt;That&#39;s not even nine months.  I would probably wait at least<br/>\n&gt;another<br/>\n&gt;year before I would even think about introducing academics to him<br/>\n&gt;again,<br/>\n&gt;if ever.  Deschooling can take a long time and requires a lot of<br/>\n&gt;patience on your part.  You have to totally change your ideas of<br/>\n&gt;what<br/>\n&gt;learning really is and how it happens. <br/>\n&gt;++++++++++++++++++++++++<br/>\n </span></blockquote>my response: I&#39;ve head for every year of school, deschooling takes a <br/>\nmonth so in your case, a minimum of 10 months of doing *NOTHING* <br/>\nschoolish (on your part anyway) would be needed.  When we went <br/>\nthrough the de-schooling process, dd had only been in Kindergarten <br/>\nfor about 3 months and we &#39;deschooled&#39; for 6 months before she came <br/>\nto me wanting to do something other than watch tv and play games. It <br/>\nwas well worth the wait!!!!!<br/>\n<br/>\nDebbie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He has just been diagnosed with ADD-inattentive type, so<br/>\n&gt;&gt; I know that hasn&#39;t helped his self-esteem, and he says he can&#39;t<br/>\n&gt;pick<br/>\n&gt;&gt; up a book because he can&#39;t retain anything he reads. That is so<br/>\n&gt;&gt; different for him, because he always used to love reading.<br/>\n&gt;++++++++++++++++++++++++++<br/>\n </span></blockquote>I have that problem as well. Try the following to see if any of it <br/>\nhelps:<br/>\n1. no florescent lighting (it can drive me crazy)<br/>\n2. try tinted overlays on the page (or tinted glasses... soft pink <br/>\nseems to work in our family)<br/>\n3. Make sure he&#39;s reading something he&#39;s *really* interested in.<br/>\nWhat happens in my case is while I&#39;m reading, I&#39;m thinking of a <br/>\nthousand other things I need to do. Have him keep a notepad beside <br/>\nhim and when he finds he&#39;s thinking about something else, jot it down <br/>\nso he won&#39;t forget about it but it will give him the sense that he&#39;s <br/>\nreleased from trying to remember whatever &#39;it&#39; is. <br/>\n<br/>\nDebbie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n&gt;&gt; What I would love is encouragement, advice on unschooling, and<br/>\n&gt;please<br/>\n&gt;&gt; no ridiculing because it&#39;s not as easy for me to just jump in<br/>\n&gt;like<br/>\n&gt;&gt; some of the rest of you who have done it for so long.<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nmy response: I hope I don&#39;t sound like I&#39;m ridiculing anyone; I&#39;m <br/>\nsincere and if there&#39;s ever any doubt, please ask me what I meant. <br/>\nPeople get tired of my &quot;:-)&quot; and &quot;&lt;g&gt;&quot; &#39;s so I&#39;m trying to trust that <br/>\nmy words will convey my message without the graphics but... :-) ;-)<br/>\n<br/>\nDebbie wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I really admire<br/>\n&gt;&gt; this way of learning instead of having everything shoved down<br/>\n&gt;their<br/>\n&gt;&gt; throats. I grew up thinking we had to be pushed all the time and<br/>\n&gt;&gt; never had the opportunity to just sit back and make the<br/>\n&gt;decision on<br/>\n&gt;&gt; my own to learn when I wanted to.<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nmy response:<br/>\nDidn&#39;t you write somewhere that your dh isn&#39;t so supportive of your <br/>\nunschooling leanings? IMO, that&#39;s a battle all in itself that would <br/>\nbe most beneficial if you could win him over to your way of thinking. <br/>\nYou both need to show a face of confidence to your son that he *will* <br/>\nsucceed at whatever he pursues and that unschooling *is* learning <br/>\nwithout pain (which is the way it should be!).<br/>\n<br/>\n<br/>\nDebbie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So, please explain where I go from here. I&#39;m feeling like<br/>\n&gt;backing off<br/>\n&gt;&gt; and letting him do whatever he chooses for a while.<br/>\n<br/>\n </span></blockquote>Mimi responded:<br/>\n<blockquote><span title=\"ireply\"> &gt;++++++++++++++++++++++++++<br/>\n&gt;I think that is exactly what you should do.  Try and relax (I<br/>\n&gt;know it&#39;s<br/>\n&gt;hard).  Just let him hang out and have fun.  Let him do his<br/>\n&gt;computer<br/>\n&gt;programming.  I don&#39;t know what your relationship is like with<br/>\n&gt;him, but<br/>\n&gt;do you think you two could do stuff together like go camping or<br/>\n&gt;do some<br/>\n&gt;traveling together.  I would spend lots of time with him and<br/>\n&gt;maybe see<br/>\n&gt;if you can strengthen your relationship.  Just have lots of fun<br/>\n&gt;with him<br/>\n&gt;and FORGET school and academics.  Concentrate on being HAPPY!!!<br/>\n&gt;++++++++++++++++++++++++<br/>\n </span></blockquote>my response: DO WHAT MIMI SAID... She&#39;s right!<br/>\n<br/>\nDebbie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I&#39;ve tried it,<br/>\n&gt;&gt; but then I start feeling like he needs to learn, or should I<br/>\n&gt;say, do<br/>\n&gt;&gt; academics. My husband&#39;s attitude about that may tend to sway me<br/>\n&gt;in<br/>\n&gt;&gt; that direction more than I tend to want to go. My son is<br/>\n&gt;intelligent,<br/>\n&gt;&gt; has big ideas, but has trouble implementing.<br/>\n<br/>\n </span></blockquote>my response: Debbie, look at it this way. WHO says one has to finish <br/>\nhigh school by &quot;x&quot; age? If you approach it that way, what&#39;s one year <br/>\nof doing nothing? There&#39;s no catching up that needs to be done. If <br/>\nyour son were very ill and had to take a year off of school, would <br/>\nyou be in such a panic or would you sigh and say, we&#39;ll, he&#39;ll be <br/>\nfine? There&#39;s no race here to the educational finish line... there <br/>\n*is* no finish line! So consider this an experiemental year... you <br/>\nhave nothing to lose and everything to gain.<br/>\n<br/>\n<br/>\nMimi wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;I suggest you think happy and positive thoughts and think about<br/>\n&gt;how<br/>\n&gt;lucky your son is that he doesn&#39;t have to waste his time in a<br/>\n&gt;school.<br/>\n&gt;Think about how lucky you are to have him around all day.  How<br/>\n&gt;you can<br/>\n&gt;enjoy each other&#39;s company, etc. <br/>\n<br/>\n </span></blockquote>~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nmy response: <br/>\nYou&#39;ll have to find some things the two of you can do together once <br/>\nin awhile. Sitting at home bored to tears won&#39;t work for long. You <br/>\nsay he&#39;s crazy about computers... can you make plans to go to a <br/>\ncomputer show/extravaganza? How about just going to the bookstore and <br/>\nfinding books that interest him on computers? How about lining up a <br/>\ntrip for the two of you to a business that does what he&#39;s interested <br/>\nin? If you called and said your son would like to spend an hour or <br/>\ntwo with a mentor there and would anyone be interested in showing him <br/>\nthe business, *somebody* will be interested. Somebody will have a kid <br/>\nand relate to your situation and offer help.<br/>\n<br/>\nMimi wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;With regard to your husband, I have the same problem.  I suggest<br/>\n&gt;you try<br/>\n&gt;and educate him as best you can about unschooling. <br/>\n </span></blockquote>~~~~~~~~~~~~~~<br/>\nmy response:<br/>\nAnd if he refuses to learn about unschooling, then tell him *you* <br/>\nhave done the research and *you* think this is best for your child. <br/>\nIf he&#39;s not willing to learn about the alternatives, then he needs to <br/>\nrelinquish that parenting responsibility over to you and not <br/>\ncriticize it! :-) I had to take this approach and although dh has <br/>\nnever read any John Holt other than what I&#39;ve read out loud to him, <br/>\njust observing our kids has brought him around full circle.<br/>\n<br/>\nDebbie wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I think in time,<br/>\n&gt;&gt; however, he will do great things so I&#39;m not sure why I&#39;m<br/>\n&gt;concerned.<br/>\n </span></blockquote>Mimi wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; +++++++++++++++++++++<br/>\n&gt;He&#39;s lucky to have a mother with so much confidence in him.  Just<br/>\n&gt;keep<br/>\n&gt;thinking that way and try to relax.<br/>\n </span></blockquote>~~~~~~~~~~~~~<br/>\nmy response:<br/>\nI agree. I think you&#39;re concerned because uncharted territory is <br/>\nalways a little unsettling. But if you stick around the unschooling <br/>\nboards and lists you&#39;ll soon start feeling more at ease with your <br/>\ninclinations to unschool.  Just give it *one* year and I truly <br/>\nbelieve you&#39;ll be where you want to be.<br/>\nSarah <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":64314002,"authorName":"debbie jones","from":"debbie jones &lt;dljones0@...&gt;","profile":"dljones0","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] I have picked up the book I never got a chance to really read Quit School and","postDate":"1009541530","msgId":30321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMjI4MTIxMjEwLjQ4Njc2LnFtYWlsQHdlYjExNjA2Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDJFRUFEREVDLUZCNjQtMTFENS04QzM1LTAwMDM5MzQ5RDRBRUBob3VzdG9uLnJyLmNvbT4="},"prevInTopic":30319,"nextInTopic":30328,"prevInTime":30320,"nextInTime":30322,"topicId":30306,"numMessagesInTopic":0,"msgSnippet":"Hi, I want to respond to all of you here and start by saying I didn t feel that anyone WAS ridiculing me. I guess I said that becuase I had posted on another","messageBody":"<div id=\"ygrps-yiv-606188100\">Hi,<br/>\nI want to respond to all of you here and start by saying I didn&#39;t feel that anyone WAS ridiculing me. I guess I said that becuase I had posted on another unschooling board several months ago about unschooling and wanted to know more about it and I felt like I didn&#39;t belong there. I&#39;m sorry that I made anyone here feel that they did anything wrong. I&#39;m very thankful for the very lengthy and very helpful responses I have been getting.<br/>\nWe are getting ready to go away for a few days to see family and have our Christmas with them and my boys will be skiing, which they love to do. I&#39;ll be sure to stop back in as soon as I return.<br/>\nI&#39;m thinking my son&#39;s problem mostly stems from the very real need to deschool and his own guilt about not being in school. Time and my attitude will change that I hope. As far as his goals go, he just knows that he loves computers and programming and has for at least 4 years. Most kids never know, and I am not certain I ever knew what I wanted to do. He&#39;s not your everyday kid, but a joy to have around to discuss current events, politics, everything just about. If I have a computer problem, I know who to call on. He gets his knack from his dad. He has a computer science major, so I wouldn&#39;t be surprised to see my son go down that same path. Their wired a lot the same. ; ) a bunch of computer nerds in the family. <br/>\nI&#39;ll take my book with me this weekend and plan to buy a few more from your list of suggestions. In time I may be able to sway my husband, but he knows that I basically make these types of decisions so if I don&#39;t get his total support, oh well. He does support homeschooling though in general. <br/>\nAlso, I hated high school. I only liked the social part and that became a little hard as I recall being a teenager. School work was a pain, and I couldn&#39;t wait to graduate. Spending my days with a lot of people I didn&#39;t choose to.... The way they made academics SOOO borning. Those textbooks. I hate textbooks. <br/>\nOk, I&#39;m feeling some of the pressure leaving me right now as I give into something I should have long ago. (I&#39;ve never actually wanted to go with the flo. Just did it because it was expected.) Now my only question is how to provide the necessary documentation to please the school district at the end of the year. I think that has been some of the most pressure I&#39;ve been feeling. Still a prisoner and they don&#39;t even attend ps anymore. <br/>\nThanks again for all your help. :)<br/>\nDebbie<br/>\n <br/>\n  Mimi Moorehead &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:groundhoggirl@...\">groundhoggirl@...</a>&gt; wrote: Hi,<br/>\n<br/>\nSorry if it was me that seemed to ridicule you.  I never intentionally <br/>\nmean to do that.  When I post, it&#39;s usually just to share my experiences.<br/>\n<br/>\nI&#39;m sure that either Tia, Sarah Carothers, Lovemary or Kolleen will be <br/>\nmore help to you than I can be, but I&#39;ll try.<br/>\n<br/>\nFirst of all, have you read the standard unschooling books by John Holt, <br/>\nGrace Llewellyn, etc.?  If you haven&#39;t, you should do so.  Also, <br/>\nunderstand what &quot;deschooling&quot; is.  I understand it requires an awful lot <br/>\nof patience and a lot of time.  It depends on the child, but deschooling <br/>\ncan take years.  Remember he has been in school for close to 10 years, <br/>\nconstantly being told what to do, when to do it, how to do it, how much <br/>\ntime he has to do it in, and, even, with whom to do it.  He&#39;s not used <br/>\nto self-initiating those types of activities which most people would <br/>\nconsider to be learning activities.  He has been taught for many years <br/>\nthat learning is WORK and that it is unpleasant because it has been <br/>\nforced upon him.  So, it&#39;s only natural he would have an aversion to <br/>\nactivities that many would consider educational.<br/>\n<br/>\nUnschooling is all about respecting your child&#39;s choices and trusting <br/>\nthe fact that he will learn, on his own, what is best for him.<br/>\n<br/>\nDidn&#39;t you say that your son was into computer programming?  Well, let <br/>\nhim do that - all day long, all year long, if that&#39;s what he wants to <br/>\ndo.  He can learn an awful lot from that.<br/>\n<br/>\nThis is what unschooling is to me:  I basically leave my kids alone and <br/>\nlet them do what they want to do.  I rarely tell them to do anything <br/>\n(unless it has to do with their physical health, which is a big factor <br/>\nwith my kids).  I consciously try to involve myself in as many active <br/>\n(not passive) activities as possible.  I am modeling for my kids.  I <br/>\nhope they join me, and they often do.  I answer all their questions (and <br/>\nthere are very many of them), which often lead into pretty deep <br/>\ndiscussions (these are definitely learning moments).  I find the long <br/>\nand more interesting discussions are in the car, where they are captive <br/>\nand have few distractions.<br/>\n<br/>\nI will now go through your post and interject my thoughts.  Please don&#39;t <br/>\nthink I am being critical or I am ridiculing you.  I&#39;m just giving you <br/>\nmy ideas and am trying to help in the best way that I can.  If we don&#39;t <br/>\nanswer your questions, then you must keep asking and maybe be more <br/>\nspecific, or word your question in another way.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thursday, December 27, 2001, at 06:53 PM, dljones0 wrote:<br/>\n<br/>\n&gt; Get a Life. I feel so far that what I am reading feels more like my<br/>\n&gt; style, but it&#39;s so unnatural for me since it&#39;s not the way I was<br/>\n&gt; raised.<br/>\n<br/>\n+++++++++++++++++++++++=<br/>\nI wasn&#39;t raised this way either.  I read &quot;Learning all the Time&quot; by John <br/>\nHolt and it really changed the way I looked at how children learn.  Read <br/>\nthat book if you haven&#39;t yet.  Also read Alice Miller&#39;s &quot;Thou Shall Not <br/>\nBe Aware&quot; (I think that&#39;s the title - it&#39;s been a few years since I read <br/>\nit).  Sorry if this sounds maudlin, but I have many faults and have had <br/>\nmany failures.  I have analyzed them and tried to figure out where they <br/>\ncame from and how they came about.  Of course, it all stems from my <br/>\nchildhood and my mother&#39;s parenting style which was almost the exact <br/>\nopposite of unschooling.  I consider unschooling to be more of a style <br/>\nof parenting (or lifestyle) than purely a method of educating my <br/>\nchildren.  Unschooling encourages a child to grow up to be a happy, <br/>\nself-confident, auto-didactic, self-regulating, self-entertaining, <br/>\ncurious and  a self-assured person.  If a person is lucky enough to have <br/>\nsome or all of those traits then that person&#39;s education will be a <br/>\nnatural and painless part of his/her life and s/he will be learning all <br/>\nthe time.<br/>\n<br/>\nSo, I have looked at the way I was raised and determined what was done <br/>\nwrong and have chosen to raise my children in a different way which <br/>\nhappens to be unschooling.<br/>\n+++++++++++++++++++++=<br/>\n&gt;  My son didn&#39;t do well with the traditional school setting,<br/>\n&gt; and I think the best thing I can do for him is to try to offer him<br/>\n&gt; some alternatives until we find one that works for him and makes him<br/>\n&gt; happy. Since quitting school in April, I am wondering if he needs<br/>\n&gt; more time to deschool because academics is just not setting well with<br/>\n&gt; him at all.<br/>\n+++++++++++++++++++++++<br/>\nThat&#39;s not even nine months.  I would probably wait at least another <br/>\nyear before I would even think about introducing academics to him again, <br/>\nif ever.  Deschooling can take a long time and requires a lot of <br/>\npatience on your part.  You have to totally change your ideas of what <br/>\nlearning really is and how it happens.   Personally, I don&#39;t think that <br/>\nacademics are that important yet at age 14.  He has his whole life ahead <br/>\nof him to learn those things, if he wishes.<br/>\n++++++++++++++++++++++++<br/>\n&gt; He has just been diagnosed with ADD-inattentive type, so<br/>\n&gt; I know that hasn&#39;t helped his self-esteem, and he says he can&#39;t pick<br/>\n&gt; up a book because he can&#39;t retain anything he reads. That is so<br/>\n&gt; different for him, because he always used to love reading.<br/>\n++++++++++++++++++++++++++<br/>\nIs he referring to textbook reading or reading for pleasure?   Can he <br/>\nread some entertaining fiction?  Perhaps you can introduce him to some <br/>\nbooks about subjects he has an interest in, like computer programming, <br/>\nsports (if that&#39;s what he&#39;s into), etc.<br/>\n+++++++++++++++++++++++++++<br/>\n&gt;<br/>\n&gt; What I would love is encouragement, advice on unschooling, and please<br/>\n&gt; no ridiculing because it&#39;s not as easy for me to just jump in like<br/>\n&gt; some of the rest of you who have done it for so long.<br/>\n++++++++++++++++++++<br/>\nI encourage you to read the unschooling books as well as past issues of <br/>\n&quot;Growing Without Schooling&quot;.  I learned a lot from them.  Also, see if <br/>\nyou can make friends with another family that is unschooling and spend <br/>\ntime with them and learn from them.  This is what I have done.  I also <br/>\nhope you stay with this list.  Read the posts and ask as many questions <br/>\nas you need to.  I think its wonderful you are considering unschooling <br/>\nfor your son.  All children should be so lucky.<br/>\n+++++++++++++++++++++++<br/>\n&gt;  I really admire<br/>\n&gt; this way of learning instead of having everything shoved down their<br/>\n&gt; throats. I grew up thinking we had to be pushed all the time and<br/>\n&gt; never had the opportunity to just sit back and make the decision on<br/>\n&gt; my own to learn when I wanted to.<br/>\n+++++++++++++++++++++++++++<br/>\nYes!  And, not only when you wanted to but also what you wanted to.<br/>\n+++++++++++++++++++++++++<br/>\n&gt; Therefore, it makes me think that<br/>\n&gt; most children need a little bit of a constant push to continue acting<br/>\n&gt; responsibly, which means doing homework, etc. I thought this was part<br/>\n&gt; of being a parent and guiding your children to become well behaved,<br/>\n&gt; responsible adults.<br/>\n&gt; ++++++++++++++++++++<br/>\nI think a child can learn about responsibility from watching the parents <br/>\ndo responsible things.  It&#39;s all about modeling.  Kids learn a lot from <br/>\nthat.  They don&#39;t have to be taught.  They just have to see you do it.<br/>\n+++++++++++++++++++++++<br/>\n&gt; So, please explain where I go from here. I&#39;m feeling like backing off<br/>\n&gt; and letting him do whatever he chooses for a while.<br/>\n++++++++++++++++++++++++++<br/>\nI think that is exactly what you should do.  Try and relax (I know it&#39;s <br/>\nhard).  Just let him hang out and have fun.  Let him do his computer <br/>\nprogramming.  I don&#39;t know what your relationship is like with him, but <br/>\ndo you think you two could do stuff together like go camping or do some <br/>\ntraveling together.  I would spend lots of time with him and maybe see <br/>\nif you can strengthen your relationship.  Just have lots of fun with him <br/>\nand FORGET school and academics.  Concentrate on being HAPPY!!!<br/>\n++++++++++++++++++++++++<br/>\n&gt;  I&#39;ve tried it,<br/>\n&gt; but then I start feeling like he needs to learn, or should I say, do<br/>\n&gt; academics. My husband&#39;s attitude about that may tend to sway me in<br/>\n&gt; that direction more than I tend to want to go. My son is intelligent,<br/>\n&gt; has big ideas, but has trouble implementing.<br/>\n+++++++++++++++++++<br/>\nHe has big ideas!!!  That&#39;s great!!  I wish I had any ideas at all when <br/>\nI was 14.  If he has big ideas then he has goals.  He has something in <br/>\nmind that he wants to accomplish.  I would love to know what his goals <br/>\nare.  I hope you share them with us.<br/>\n<br/>\nThink back to all the courses you took in high school and all those <br/>\nhours you spent in the classroom and all that homework you did.  Do you <br/>\nremember much of it?  Do you really feel that it was all that <br/>\nimportant?  I&#39;m sure there were a few things that may have been <br/>\nworthwhile, but you probably could have learned it on your own in a <br/>\nfraction of the time it took you to have it forced into you by the <br/>\nschool.<br/>\n<br/>\nI suggest you think happy and positive thoughts and think about how <br/>\nlucky your son is that he doesn&#39;t have to waste his time in a school.  <br/>\nThink about how lucky you are to have him around all day.  How you can <br/>\nenjoy each other&#39;s company, etc.  Join homeschooling groups in your area <br/>\nand introduce him to new people.  Give him the opportunity to make new <br/>\nfriends.<br/>\n<br/>\nWith regard to your husband, I have the same problem.  I suggest you try <br/>\nand educate him as best you can about unschooling.  Get a hold of old <br/>\n&quot;Growing Without Schooling&quot; magazines, read them and share the articles <br/>\nwith him.  Have them in the bathroom, so he can read them there too.  My <br/>\nhusband has come a long way, but we still have to compromise.  My boys <br/>\nand I have come out on top though.<br/>\n+++++++++++++++++++++++++<br/>\n&gt;  I think in time,<br/>\n&gt; however, he will do great things so I&#39;m not sure why I&#39;m concerned.<br/>\n&gt; +++++++++++++++++++++<br/>\nHe&#39;s lucky to have a mother with so much confidence in him.  Just keep <br/>\nthinking that way and try to relax.<br/>\n<br/>\nI hope I have helped a little bit.<br/>\n<br/>\nI hope you stay on this list.  Ask for support and information.  This <br/>\nlist can be very helpful.<br/>\n<br/>\nMimi<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\nMimi<br/>\nMama of Leroy & Paul, born 01/10/94<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\nMessage boards, timely articles, a free newsletter and more!<br/>\nCheck it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\nTo unsubscribe, set preferences, or read archives:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a><br/>\n<br/>\nAnother great list sponsored by Home Education Magazine!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a> <br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo You Yahoo!?<br/>\nSend your FREE holiday greetings online at Yahoo! Greetings.<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":89240901,"authorName":"Mimi Moorehead","from":"Mimi Moorehead &lt;groundhoggirl@...&gt;","profile":"groundhoggirl2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] I have picked up the book I never got a chance to really read Quit School and","postDate":"1009524377","msgId":30319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJFRUFEREVDLUZCNjQtMTFENS04QzM1LTAwMDM5MzQ5RDRBRUBob3VzdG9uLnJyLmNvbT4=","inReplyToHeader":"PGEwZ2ZwcCtpbDQwQGVHcm91cHMuY29tPg=="},"prevInTopic":30306,"nextInTopic":30321,"prevInTime":30318,"nextInTime":30320,"topicId":30306,"numMessagesInTopic":0,"msgSnippet":"Hi, Sorry if it was me that seemed to ridicule you.  I never intentionally mean to do that.  When I post, it s usually just to share my experiences. I m sure","messageBody":"<div id=\"ygrps-yiv-1456330401\">Hi,<br/>\n<br/>\nSorry if it was me that seemed to ridicule you.  I never intentionally <br/>\nmean to do that.  When I post, it&#39;s usually just to share my experiences.<br/>\n<br/>\nI&#39;m sure that either Tia, Sarah Carothers, Lovemary or Kolleen will be <br/>\nmore help to you than I can be, but I&#39;ll try.<br/>\n<br/>\nFirst of all, have you read the standard unschooling books by John Holt, <br/>\nGrace Llewellyn, etc.?  If you haven&#39;t, you should do so.  Also, <br/>\nunderstand what &quot;deschooling&quot; is.  I understand it requires an awful lot <br/>\nof patience and a lot of time.  It depends on the child, but deschooling <br/>\ncan take years.  Remember he has been in school for close to 10 years, <br/>\nconstantly being told what to do, when to do it, how to do it, how much <br/>\ntime he has to do it in, and, even, with whom to do it.  He&#39;s not used <br/>\nto self-initiating those types of activities which most people would <br/>\nconsider to be learning activities.  He has been taught for many years <br/>\nthat learning is WORK and that it is unpleasant because it has been <br/>\nforced upon him.  So, it&#39;s only natural he would have an aversion to <br/>\nactivities that many would consider educational.<br/>\n<br/>\nUnschooling is all about respecting your child&#39;s choices and trusting <br/>\nthe fact that he will learn, on his own, what is best for him.<br/>\n<br/>\nDidn&#39;t you say that your son was into computer programming?  Well, let <br/>\nhim do that - all day long, all year long, if that&#39;s what he wants to <br/>\ndo.  He can learn an awful lot from that.<br/>\n<br/>\nThis is what unschooling is to me:  I basically leave my kids alone and <br/>\nlet them do what they want to do.  I rarely tell them to do anything <br/>\n(unless it has to do with their physical health, which is a big factor <br/>\nwith my kids).  I consciously try to involve myself in as many active <br/>\n(not passive) activities as possible.  I am modeling for my kids.  I <br/>\nhope they join me, and they often do.  I answer all their questions (and <br/>\nthere are very many of them), which often lead into pretty deep <br/>\ndiscussions (these are definitely learning moments).  I find the long <br/>\nand more interesting discussions are in the car, where they are captive <br/>\nand have few distractions.<br/>\n<br/>\nI will now go through your post and interject my thoughts.  Please don&#39;t <br/>\nthink I am being critical or I am ridiculing you.  I&#39;m just giving you <br/>\nmy ideas and am trying to help in the best way that I can.  If we don&#39;t <br/>\nanswer your questions, then you must keep asking and maybe be more <br/>\nspecific, or word your question in another way.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thursday, December 27, 2001, at 06:53 PM, dljones0 wrote:<br/>\n<br/>\n&gt; Get a Life. I feel so far that what I am reading feels more like my<br/>\n&gt; style, but it&#39;s so unnatural for me since it&#39;s not the way I was<br/>\n&gt; raised.<br/>\n<br/>\n+++++++++++++++++++++++=<br/>\nI wasn&#39;t raised this way either.  I read &quot;Learning all the Time&quot; by John <br/>\nHolt and it really changed the way I looked at how children learn.  Read <br/>\nthat book if you haven&#39;t yet.  Also read Alice Miller&#39;s &quot;Thou Shall Not <br/>\nBe Aware&quot; (I think that&#39;s the title - it&#39;s been a few years since I read <br/>\nit).  Sorry if this sounds maudlin, but I have many faults and have had <br/>\nmany failures.  I have analyzed them and tried to figure out where they <br/>\ncame from and how they came about.  Of course, it all stems from my <br/>\nchildhood and my mother&#39;s parenting style which was almost the exact <br/>\nopposite of unschooling.  I consider unschooling to be more of a style <br/>\nof parenting (or lifestyle) than purely a method of educating my <br/>\nchildren.  Unschooling encourages a child to grow up to be a happy, <br/>\nself-confident, auto-didactic, self-regulating, self-entertaining, <br/>\ncurious and  a self-assured person.  If a person is lucky enough to have <br/>\nsome or all of those traits then that person&#39;s education will be a <br/>\nnatural and painless part of his/her life and s/he will be learning all <br/>\nthe time.<br/>\n<br/>\nSo, I have looked at the way I was raised and determined what was done <br/>\nwrong and have chosen to raise my children in a different way which <br/>\nhappens to be unschooling.<br/>\n+++++++++++++++++++++=<br/>\n&gt;  My son didn&#39;t do well with the traditional school setting,<br/>\n&gt; and I think the best thing I can do for him is to try to offer him<br/>\n&gt; some alternatives until we find one that works for him and makes him<br/>\n&gt; happy. Since quitting school in April, I am wondering if he needs<br/>\n&gt; more time to deschool because academics is just not setting well with<br/>\n&gt; him at all.<br/>\n+++++++++++++++++++++++<br/>\nThat&#39;s not even nine months.  I would probably wait at least another <br/>\nyear before I would even think about introducing academics to him again, <br/>\nif ever.  Deschooling can take a long time and requires a lot of <br/>\npatience on your part.  You have to totally change your ideas of what <br/>\nlearning really is and how it happens.   Personally, I don&#39;t think that <br/>\nacademics are that important yet at age 14.  He has his whole life ahead <br/>\nof him to learn those things, if he wishes.<br/>\n++++++++++++++++++++++++<br/>\n&gt; He has just been diagnosed with ADD-inattentive type, so<br/>\n&gt; I know that hasn&#39;t helped his self-esteem, and he says he can&#39;t pick<br/>\n&gt; up a book because he can&#39;t retain anything he reads. That is so<br/>\n&gt; different for him, because he always used to love reading.<br/>\n++++++++++++++++++++++++++<br/>\nIs he referring to textbook reading or reading for pleasure?   Can he <br/>\nread some entertaining fiction?  Perhaps you can introduce him to some <br/>\nbooks about subjects he has an interest in, like computer programming, <br/>\nsports (if that&#39;s what he&#39;s into), etc.<br/>\n+++++++++++++++++++++++++++<br/>\n&gt;<br/>\n&gt; What I would love is encouragement, advice on unschooling, and please<br/>\n&gt; no ridiculing because it&#39;s not as easy for me to just jump in like<br/>\n&gt; some of the rest of you who have done it for so long.<br/>\n++++++++++++++++++++<br/>\nI encourage you to read the unschooling books as well as past issues of <br/>\n&quot;Growing Without Schooling&quot;.  I learned a lot from them.  Also, see if <br/>\nyou can make friends with another family that is unschooling and spend <br/>\ntime with them and learn from them.  This is what I have done.  I also <br/>\nhope you stay with this list.  Read the posts and ask as many questions <br/>\nas you need to.  I think its wonderful you are considering unschooling <br/>\nfor your son.  All children should be so lucky.<br/>\n+++++++++++++++++++++++<br/>\n&gt;  I really admire<br/>\n&gt; this way of learning instead of having everything shoved down their<br/>\n&gt; throats. I grew up thinking we had to be pushed all the time and<br/>\n&gt; never had the opportunity to just sit back and make the decision on<br/>\n&gt; my own to learn when I wanted to.<br/>\n+++++++++++++++++++++++++++<br/>\nYes!  And, not only when you wanted to but also what you wanted to.<br/>\n+++++++++++++++++++++++++<br/>\n&gt; Therefore, it makes me think that<br/>\n&gt; most children need a little bit of a constant push to continue acting<br/>\n&gt; responsibly, which means doing homework, etc. I thought this was part<br/>\n&gt; of being a parent and guiding your children to become well behaved,<br/>\n&gt; responsible adults.<br/>\n&gt; ++++++++++++++++++++<br/>\nI think a child can learn about responsibility from watching the parents <br/>\ndo responsible things.  It&#39;s all about modeling.  Kids learn a lot from <br/>\nthat.  They don&#39;t have to be taught.  They just have to see you do it.<br/>\n+++++++++++++++++++++++<br/>\n&gt; So, please explain where I go from here. I&#39;m feeling like backing off<br/>\n&gt; and letting him do whatever he chooses for a while.<br/>\n++++++++++++++++++++++++++<br/>\nI think that is exactly what you should do.  Try and relax (I know it&#39;s <br/>\nhard).  Just let him hang out and have fun.  Let him do his computer <br/>\nprogramming.  I don&#39;t know what your relationship is like with him, but <br/>\ndo you think you two could do stuff together like go camping or do some <br/>\ntraveling together.  I would spend lots of time with him and maybe see <br/>\nif you can strengthen your relationship.  Just have lots of fun with him <br/>\nand FORGET school and academics.  Concentrate on being HAPPY!!!<br/>\n++++++++++++++++++++++++<br/>\n&gt;  I&#39;ve tried it,<br/>\n&gt; but then I start feeling like he needs to learn, or should I say, do<br/>\n&gt; academics. My husband&#39;s attitude about that may tend to sway me in<br/>\n&gt; that direction more than I tend to want to go. My son is intelligent,<br/>\n&gt; has big ideas, but has trouble implementing.<br/>\n+++++++++++++++++++<br/>\nHe has big ideas!!!  That&#39;s great!!  I wish I had any ideas at all when <br/>\nI was 14.  If he has big ideas then he has goals.  He has something in <br/>\nmind that he wants to accomplish.  I would love to know what his goals <br/>\nare.  I hope you share them with us.<br/>\n<br/>\nThink back to all the courses you took in high school and all those <br/>\nhours you spent in the classroom and all that homework you did.  Do you <br/>\nremember much of it?  Do you really feel that it was all that <br/>\nimportant?  I&#39;m sure there were a few things that may have been <br/>\nworthwhile, but you probably could have learned it on your own in a <br/>\nfraction of the time it took you to have it forced into you by the <br/>\nschool.<br/>\n<br/>\nI suggest you think happy and positive thoughts and think about how <br/>\nlucky your son is that he doesn&#39;t have to waste his time in a school.  <br/>\nThink about how lucky you are to have him around all day.  How you can <br/>\nenjoy each other&#39;s company, etc.  Join homeschooling groups in your area <br/>\nand introduce him to new people.  Give him the opportunity to make new <br/>\nfriends.<br/>\n<br/>\nWith regard to your husband, I have the same problem.  I suggest you try <br/>\nand educate him as best you can about unschooling.  Get a hold of old <br/>\n&quot;Growing Without Schooling&quot; magazines, read them and share the articles <br/>\nwith him.  Have them in the bathroom, so he can read them there too.  My <br/>\nhusband has come a long way, but we still have to compromise.  My boys <br/>\nand I have come out on top though.<br/>\n+++++++++++++++++++++++++<br/>\n&gt;  I think in time,<br/>\n&gt; however, he will do great things so I&#39;m not sure why I&#39;m concerned.<br/>\n&gt; +++++++++++++++++++++<br/>\nHe&#39;s lucky to have a mother with so much confidence in him.  Just keep <br/>\nthinking that way and try to relax.<br/>\n<br/>\nI hope I have helped a little bit.<br/>\n<br/>\nI hope you stay on this list.  Ask for support and information.  This <br/>\nlist can be very helpful.<br/>\n<br/>\nMimi<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\nMimi<br/>\nMama of Leroy & Paul, born 01/10/94<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":64314002,"authorName":"dljones0","from":"&quot;dljones0&quot; &lt;dljones0@...&gt;","profile":"dljones0","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I have picked up the book I never got a chance to really read Quit School and","postDate":"1009500792","msgId":30306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEwZ2ZwcCtpbDQwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":30319,"prevInTime":30305,"nextInTime":30307,"topicId":30306,"numMessagesInTopic":0,"msgSnippet":"Get a Life. I feel so far that what I am reading feels more like my style, but it s so unnatural for me since it s not the way I was raised. My son didn t do","messageBody":"<div id=\"ygrps-yiv-1653673484\">Get a Life. I feel so far that what I am reading feels more like my <br/>\nstyle, but it&#39;s so unnatural for me since it&#39;s not the way I was <br/>\nraised. My son didn&#39;t do well with the traditional school setting, <br/>\nand I think the best thing I can do for him is to try to offer him <br/>\nsome alternatives until we find one that works for him and makes him <br/>\nhappy. Since quitting school in April, I am wondering if he needs <br/>\nmore time to deschool because academics is just not setting well with <br/>\nhim at all. He has just been diagnosed with ADD-inattentive type, so <br/>\nI know that hasn&#39;t helped his self-esteem, and he says he can&#39;t pick <br/>\nup a book because he can&#39;t retain anything he reads. That is so <br/>\ndifferent for him, because he always used to love reading.<br/>\n<br/>\nWhat I would love is encouragement, advice on unschooling, and please <br/>\nno ridiculing because it&#39;s not as easy for me to just jump in like <br/>\nsome of the rest of you who have done it for so long. I really admire <br/>\nthis way of learning instead of having everything shoved down their <br/>\nthroats. I grew up thinking we had to be pushed all the time and <br/>\nnever had the opportunity to just sit back and make the decision on <br/>\nmy own to learn when I wanted to. Therefore, it makes me think that <br/>\nmost children need a little bit of a constant push to continue acting <br/>\nresponsibly, which means doing homework, etc. I thought this was part <br/>\nof being a parent and guiding your children to become well behaved, <br/>\nresponsible adults. <br/>\n<br/>\nSo, please explain where I go from here. I&#39;m feeling like backing off <br/>\nand letting him do whatever he chooses for a while. I&#39;ve tried it, <br/>\nbut then I start feeling like he needs to learn, or should I say, do <br/>\nacademics. My husband&#39;s attitude about that may tend to sway me in <br/>\nthat direction more than I tend to want to go. My son is intelligent, <br/>\nhas big ideas, but has trouble implementing. I think in time, <br/>\nhowever, he will do great things so I&#39;m not sure why I&#39;m concerned.</div>","specialLinks":[]}],"prevTopicId":30308,"nextTopicId":30342}}