{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":14,"messages":[{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: classes and unschooling","postDate":"1347115854","msgId":68970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsyZm0wZSs5djg3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJDQTU3RjAxNTcxNDQ3RjFBOTc0OTIyNDExQjY2RjZFQERlYm9yYWhQQz4="},"prevInTopic":68968,"nextInTopic":0,"prevInTime":68969,"nextInTime":68971,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"== Maybe get some Power Rangers dvds instead, and let him play.  He can fight imaginary bad guys and always win.== My boys, 8 and 5 years, do that. They watch","messageBody":"<div id=\"ygrps-yiv-1283974431\">== Maybe get some Power Rangers dvds instead, and let him play.  He can fight imaginary bad guys and always win.==<br/>\n<br/>\nMy boys, 8 and 5 years, do that. They watch a show or movie for a bit and then jump up and act out whatever is going on. Lots of times is superheros saving the city or good guys fighting bad guys.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: classes and unschooling","postDate":"1347024906","msgId":68968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJDQTU3RjAxNTcxNDQ3RjFBOTc0OTIyNDExQjY2RjZFQERlYm9yYWhQQz4=","inReplyToHeader":"PGsyY2VrZSs0MWcxQGVHcm91cHMuY29tPg==","referencesHeader":"PGsyY2VrZSs0MWcxQGVHcm91cHMuY29tPg=="},"prevInTopic":68967,"nextInTopic":68970,"prevInTime":68967,"nextInTime":68969,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"***My next thought was that I could take him to a class so that he could try it for himself.*** Maybe get some Power Rangers dvds instead, and let him play.","messageBody":"<div id=\"ygrps-yiv-1826895781\">***My next thought was that I could take him to a class so that he could try it for himself.***<br/>\n<br/>\nMaybe get some Power Rangers dvds instead, and let him play.  He can fight imaginary bad guys and always win. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: classes and unschooling","postDate":"1347024555","msgId":68967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENGM0MyNTk2LUYyNEYtNDg0My1BMDk4LTc3QTY3MDY0QUQ2M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGsyY2VrZSs0MWcxQGVHcm91cHMuY29tPg==","referencesHeader":"PGsyY2VrZSs0MWcxQGVHcm91cHMuY29tPg=="},"prevInTopic":68965,"nextInTopic":68968,"prevInTime":68966,"nextInTime":68968,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"-=- There is the possibility that even a few classes at the wrong moment can have your child believing that learning only happens in the presence of","messageBody":"<div id=\"ygrps-yiv-409479628\">-=-<br/>\nThere is the possibility that even a few classes at the wrong moment can have your child believing that learning only happens in the presence of teaching.-=-<br/>\n<br/>\nOH!  That&#39;s a great point.  And the parent might believe it, too.<br/>\n<br/>\nI was thinking about how I learned to play guitar, because my &quot;teacher&quot; is turning 60 and her sister is organizing a book of memories from friends of hers.  I was thinking of doing a caliigraphed page, which ties in here, too.<br/>\n<br/>\nMy mom played guitar, and so I heard her tune it from the time I can remember.  And I could play with it, too, if I sat on the bed and she handed it to me, and I had done that lots of times.<br/>\n<br/>\nWhen I was fourteen, I wanted to learn to play, and asked a slightly-older friend, the sister of someone my age, to teach me.  We were going to do weekly lessons.<br/>\n<br/>\nThe first lesson was so exciting, and she had shown me how to fingerpick (my mom used a flatpick style), that I went home and practiced and tried other chords and other songs, and didn&#39;t need any other lessons.  Still, I&#39;ve told people over the years &quot;Ymelda Martinez taught me to play guitar,&quot; and she was always embarrassed.<br/>\n<br/>\nI had one calligraphy lesson, too, similarly.  I needed an in-person person to show me how deep into the ink to stick the nib, and how to scrape off the extra, and what angle to hold my hand and how hard to push on the pen, and what those little numbers and arrows mean, really, in calligraphy books, and what those terms meant, height and bowl and such.  Then I went from there.  And I always told people &quot;Rodema Ashby taught me calligraphy.&quot;<br/>\n<br/>\nSame with recorder.  I figured out fingerings, and had one session of how to hold it and what was good and bad about how to deal with the mouthpiece and the fipple, and that was what I needed.   And still I always told people &quot;John Truitt was my recorder teacher.&quot;<br/>\n<br/>\nBut I did play guitar with Ymelda afterwards, many times, and I was able to ask Rodema questions when I had them, and I was in a Renaissance music ensemble with John, and he was always willing to help me if I needed help.<br/>\n<br/>\nI think it&#39;s good to credit people who&#39;ve helped us, and it&#39;s potentially bad to shun all assistance, but it&#39;s great to help kids see that the learning itself is all in them.  Each of those situations above was done freely and joyfully and voluntarily on all parts.  And I&#39;m still grateful. And I&#39;m glad I was the kind of person who played around with the information and the instruments and the pens on my own, without doing just the minimum &quot;assignment,&quot; and then waiting for another lesson/session.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: classes and unschooling","postDate":"1347009998","msgId":68965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsyY2VrZSs0MWcxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+"},"prevInTopic":68964,"nextInTopic":68967,"prevInTime":68964,"nextInTime":68966,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"=== As an example:  these days, my son is interested in the idea of smashing and bashing people.  (We saw a street fight.)  He likes to role play smashing and","messageBody":"<div id=\"ygrps-yiv-1795039428\">=== As an example:  these days, my son is interested in the idea of smashing and bashing people.  (We saw a street fight.)  He likes to role play smashing and bashing, self defense, calling the police, etc.  I&#39;ve told him that there are also sports where you can do smashing and bashing wearing protective gear, and having been trained.  We watched some videos of boxing and a variety of martial arts.  My next thought was that I could take him to a class so that he could try it for himself.  And then my third thought was, &quot;Hm, are there aspects of these classes that I should be more mindful about, as an unschooler?&quot;===<br/>\n<br/>\nDoes he want to pursue this as an interest, or is he trying to process his feelings about what he saw?<br/>\n<br/>\nWhen Jayn was about that age she wanted to play fire rescue, in response to the fires in Malibu that year. However she had no interest in visiting fire stations, despite numerous field trips organized by the local home school groups.<br/>\n<br/>\nSpeaking of groups - some of the local home schooling kids here have organized a nerf battle tournament. But I think they are older.<br/>\n<br/>\nAs for being mindful about classes - a couple of thoughts. The first is to recommend Kelly Lovejoy&#39;s Stages of Unschooling. <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/kellylovejoy/stages\">http://sandradodd.com/kellylovejoy/stages</a><br/>\n<br/>\nThe other is to be cautious. Your son is very young, as others have mentioned. I made the mistake of having a very nice young woman come over and give Jayn some swimming lessons, before I was fully into unschooling. Jayn was about two. I watched all four lessons. All they were was putting her face in the pool, and playing with a floating stick. They seemed silly, as Jayn already did all that stuff when we were playing, and I have vague memories of the teacher saying some schooly stuff I was starting to dislike, so we stopped wasting that money.<br/>\n<br/>\nImagine my surprise when about 18 months later when Jayn had learned to swim just through being in the water with me and other kids, when someone complimented her on being able to swim already, and she announced, &quot;My swimming teacher taught me to swim&quot;. Er, no that is NOT how she learned to swim.<br/>\n<br/>\nThere is the possibility that even a few classes at the wrong moment can have your child believing that learning only happens in the presence of teaching.</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: classes and unschooling","postDate":"1346953360","msgId":68964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsyYW5hZytoczJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+"},"prevInTopic":68960,"nextInTopic":68965,"prevInTime":68963,"nextInTime":68965,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"... City or not, if you have a kid who is really social, getting out to activities, events and classes can be good ways to fill his cup in social terms. A","messageBody":"<div id=\"ygrps-yiv-1724760904\">regan &lt;regan@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Is this the way most city-based unschoolers do it? <br/>\n<br/>\n </span></blockquote>City or not, if you have a kid who is really social, getting out to activities, events and classes can be good ways to &quot;fill his cup&quot; in social terms. A lot of 3yos don&#39;t like to be out and about so much, though, and need more time at home or they get very stressed out. If your guy is enjoying all these outings at the moment, and the travel time isn&#39;t stressful, that&#39;s good (sometimes city travel can be harder with a very active or social child, if you&#39;re using public transportation). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It&#39;s also a little easier to go to a messy cornstarch workshop at the science museum where he can delve in up to his elbows, than it would be to buy the stuff (and store the leftovers), do the project at our tiny table, and clean up.<br/>\n </span></blockquote>******************<br/>\n<br/>\nIt&#39;s easier if you have a kid who is amenable to going to the science museum during class hours and doing the designated activity - that&#39;s not the reality for a lot of people with 3yos ;) Much of what unschoolers do depends on the specifics of personality and family situation. <br/>\n<br/>\nThat being said, it might be useful to think about what your child may be missing by a focus on convenience. If &quot;home&quot; is super clean and convenient for mom, but &quot;away&quot; is where all the excitement happens, that&#39;s not a very kid-friendly environment. And once he&#39;s a little older, why should he stay in a place he has to leave to get his needs met? It&#39;s the sort of situation which could make school a logical next step.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I wonder if a class is overstimulating compared with learning on one&#39;s own.<br/>\n<br/>\n </span></blockquote>Does your son seem over stimulated? Do you have reason to thing he might need more time at home? Is he cranky and having trouble with transitions? <br/>\n<br/>\nMy daughter didn&#39;t like classes when she was little. She didn&#39;t like being told what to do, what to touch or look at or work with. If she was enjoying herself, she didn&#39;t like having to stop when she had barely gotten started - she likes to do things for big blocks of time, and classes for little kids assume they&#39;ll have short attention spans. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I wonder if classes imply that the best way to learn is to find an expert and pay that person, rather than to explore and see where your own ideas take you.<br/>\n </span></blockquote>****************<br/>\n<br/>\nYes, classes can give the impression that learning comes from teaching. It&#39;s not bad to go to classes, but it could be useful for you to think of more ways to facilitate what your child wants to do in other ways. To an extent, that depends on how social your child is, though - especially since you&#39;re new to the area and may not have friends, yet. It may be that you can use classes to meet other kids and families and set up play dates so you don&#39;t &quot;need&quot; to go to so many classes in the future. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":311341422,"authorName":"dapsign","from":"&quot;dapsign&quot; &lt;dapsign@...&gt;","profile":"dapsign","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: classes and unschooling","postDate":"1346901504","msgId":68960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsyOTRtMCtja2RxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+"},"prevInTopic":68959,"nextInTopic":68964,"prevInTime":68959,"nextInTime":68961,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"I m also in NYC and there are lots of homeschoolers with young kids.  Write to me off list and I will give you some links of groups that may help. Dina","messageBody":"<div id=\"ygrps-yiv-786034477\">I&#39;m also in NYC and there are lots of homeschoolers with young kids.  Write to me off list and I will give you some links of groups that may help.<br/>\n<br/>\nDina<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, regan &lt;regan@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello everyone,<br/>\n&gt; <br/>\n&gt; I am writing to you from NYC, where I am unschooling my 3 year old boy.  Unschooling at 3?  I feel like we are, already!  Here, most middle-class families apply for competitive pre-schools while their babies are still 1, in order to attend for ages 2-4.  It&#39;s certainly hard for us to find other 3 year olds to play with during the daytime hours.  Anyway, I have been following unschooling message boards since before he was born!  I even went to the MA Live and Learn Conference.  (It was super.)  <br/>\n&gt; <br/>\n&gt; Moving to NYC was unexpected for us.  I had been picturing a house, with a little yard Here I am, though, in our 2-room apartment.  I have recently noticed that I tend to think in terms of classes and other organized activities for him.  These things get us out in the world (and learning things along the way, in buses and on subways).  It&#39;s also a little easier to go to a messy cornstarch workshop at the science museum where he can delve in up to his elbows, than it would be to buy the stuff (and store the leftovers), do the project at our tiny table, and clean up.  <br/>\n&gt; <br/>\n&gt; Is this the way most city-based unschoolers do it?  There are so many options for afternoon classes for kids here -- puppetry, chess, circus arts, construction, robotics, music, dance, every sport, language, crafts, pastries, yoga   But I am wondering if a life full of classes is not quite unschooling either (even though he can quit at any time).  I wonder if a class is overstimulating compared with learning on one&#39;s own.  I wonder if classes imply that the best way to learn is to find an expert and pay that person, rather than to explore and see where your own ideas take you.<br/>\n&gt; <br/>\n&gt; My bias is that I was an &quot;underprivileged&quot; child.  My school had no art, music, or sports, and my parents didn&#39;t facilitate any of my interests.  I craved music lessons and a drawing class!  Of course, my son has none of this baggage.  <br/>\n&gt; <br/>\n&gt; As an example:  these days, my son is interested in the idea of smashing and bashing people.  (We saw a street fight.)  He likes to role play smashing and bashing, self defense, calling the police, etc.  I&#39;ve told him that there are also sports where you can do smashing and bashing wearing protective gear, and having been trained.  We watched some videos of boxing and a variety of martial arts.  My next thought was that I could take him to a class so that he could try it for himself.  And then my third thought was, &quot;Hm, are there aspects of these classes that I should be more mindful about, as an unschooler?&quot;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; cheers,<br/>\n&gt; Regan<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] classes and unschooling","postDate":"1346898222","msgId":68956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDY4OTgyMjIuMzU5NzkuWWFob29NYWlsTmVvQHdlYjgxNTAyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PENBQVZzNkd3Umo5ZnBYZ0RIZkNxN0tvQWlvQ0tuZy1CQUxaQmJCQU42dFFldVN6TWlad0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+IDxDQU9PVGFYTTJyVG9faG5IX1djeDZCREw9OG51T1hjM1ZobU1FODhkUHhiK0dic0dtNmdAbWFpbC5nbWFpbC5jb20+IDwxMzQ2ODk3MTUxLjc0MjY0LllhaG9vTWFpbE5lb0B3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+IDxDQUFWczZHd1JqOWZwWGdESGZDcTdLb0Fpb0NLbmctQkFMWkJiQkFONnRRZXVTek1pWndAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":68955,"nextInTopic":68959,"prevInTime":68955,"nextInTime":68957,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"Yep ! That is it Heather thanks! Using little action figures and making them fight may also be something he enjoys!   Alex Polikowsky [Non-text portions of","messageBody":"<div id=\"ygrps-yiv-202929626\">Yep ! That is it Heather thanks!<br/>\n<br/>\nUsing little action figures and making them fight may also be something he enjoys!<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":214171486,"authorName":"Heather","from":"Heather &lt;swingdancechick@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] classes and unschooling","postDate":"1346897854","msgId":68955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQVZzNkd3Umo5ZnBYZ0RIZkNxN0tvQWlvQ0tuZy1CQUxaQmJCQU42dFFldVN6TWlad0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzNDY4OTcxNTEuNzQyNjQuWWFob29NYWlsTmVvQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+CTxDQU9PVGFYTTJyVG9faG5IX1djeDZCREw9OG51T1hjM1ZobU1FODhkUHhiK0dic0dtNmdAbWFpbC5nbWFpbC5jb20+CTwxMzQ2ODk3MTUxLjc0MjY0LllhaG9vTWFpbE5lb0B3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":68954,"nextInTopic":68956,"prevInTime":68954,"nextInTime":68956,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"Bop bag? Here are a few on amazon - http://www.amazon.com/Bop-Bag-Blow-Inflatable-Tiger/dp/B0036QXU48/ref=pd_sim_t_2 heather On Wed, Sep 5, 2012 at 7:05 PM,","messageBody":"<div id=\"ygrps-yiv-1586383108\">Bop bag?<br/>\n<br/>\nHere are a few on amazon -<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Bop-Bag-Blow-Inflatable-Tiger/dp/B0036QXU48/ref=pd_sim_t_2\">http://www.amazon.com/Bop-Bag-Blow-Inflatable-Tiger/dp/B0036QXU48/ref=pd_sim_t_2</a><br/>\n<br/>\n<br/>\nheather<br/>\n<br/>\nOn Wed, Sep 5, 2012 at 7:05 PM, BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a><br/>\n<blockquote><span title=\"ireply\"> &gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &lt;&lt;&lt;&lt;Maybe get him one of those blow-up life-size people that you can knock<br/>\n&gt; over<br/>\n&gt; and they stand back up. Let him punch and kick to his heart&#39;s content.&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; What are they called anyways?? I got one for my son when he was young and<br/>\n&gt; we used it a lot! It was fun!<br/>\n&gt; I was trying to remember what they are called  to post.<br/>\n&gt;  Wrestling on the floor, Inflatable boxing gloves, pillow fights.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Alex Polikowsky<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nHeather Mclean<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] classes and unschooling","postDate":"1346897151","msgId":68954,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDY4OTcxNTEuNzQyNjQuWWFob29NYWlsTmVvQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PENBT09UYVhNMnJUb19obkhfV2N4NkJETD04bnVPWGMzVmhtTUU4OGRQeGIrR2JzR202Z0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+IDxDQU9PVGFYTTJyVG9faG5IX1djeDZCREw9OG51T1hjM1ZobU1FODhkUHhiK0dic0dtNmdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":68952,"nextInTopic":68955,"prevInTime":68953,"nextInTime":68955,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-387836337\">&lt;&lt;&lt;&lt;Maybe get him one of those blow-up life-size people that you can knock over<br/>\nand they stand back up. Let him punch and kick to his heart&#39;s content.&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nWhat are they called anyways?? I got one for my son when he was young and we used it a lot! It was fun!<br/>\nI was trying to remember what they are called  to post.<br/>\n Wrestling on the floor, Inflatable boxing gloves, pillow fights.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":403767111,"authorName":"Jo Isaac","from":"Jo Isaac &lt;joanneisaac@...&gt;","profile":"joanne.isaac","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] classes and unschooling","postDate":"1346897149","msgId":68959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERVQjEwMS1XMzM0QTYzQ0UxMDZCREIwMEY2MkE2OUI3QTgwQHBoeC5nYmw+","inReplyToHeader":"PENBT09UYVhNMnJUb19obkhfV2N4NkJETD04bnVPWGMzVmhtTUU4OGRQeGIrR2JzR202Z0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+LDxDQU9PVGFYTTJyVG9faG5IX1djeDZCREw9OG51T1hjM1ZobU1FODhkUHhiK0dic0dtNmdAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":68956,"nextInTopic":68960,"prevInTime":68958,"nextInTime":68960,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"Pam said ==I d be hesitant to consider a class for a 3 year old. Too many better ways to spend time with him. Too many expectations for paying attention and ","messageBody":"<div id=\"ygrps-yiv-654036371\">Pam said ==I&#39;d be hesitant to consider a class for a 3 year old. Too many better ways<br/>\nto spend time with him. Too many expectations for paying attention and<br/>\nfollowing directions in any class.==<br/>\n <br/>\nI absolutely agree - I made that mistake with my then 3 year old when we moved to the US (from Australia) - I enrolled him in two summer classes - dance and gymnastics, and they were much too structured and we ended up not going after a couple of weeks.<br/>\n <br/>\nOnly recently have we found a class that he really enjoys going to - he&#39;s now 6 - and it&#39;s a very unstructured class called &#39;stunt monkeys&#39; where the kids get to do kicks, punches, stunt moves and rolls! The instructors are fantastic and really engage the kids, which makes a huge difference too. <br/>\n <br/>\nAs for aspects to be mindful of - in most structured classes there will be aspects that will not gel with unschooling - but as long as the child is enjoying the class and wants to go, then I think that&#39;s fine. In my experience my son is much more okay with those aspects than me because he&#39;s not carrying my &#39;schooly&#39; baggage - he tolerates them because he loves the class (in terms of lining up and &#39;drill&#39; work and all the &#39;good boy&#39; stuff!)<br/>\n <br/>\nJo<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n \t\t \t   \t\t  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] classes and unschooling","postDate":"1346896171","msgId":68952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhNMnJUb19obkhfV2N4NkJETD04bnVPWGMzVmhtTUU4OGRQeGIrR2JzR202Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+","referencesHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+"},"prevInTopic":68949,"nextInTopic":68954,"prevInTime":68951,"nextInTime":68953,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"... I d be hesitant to consider a class for a 3 year old. Too many better ways to spend time with him. Too many expectations for paying attention and following","messageBody":"<div id=\"ygrps-yiv-1591000252\">On Wed, Sep 5, 2012 at 5:55 PM, regan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:regan@...\">regan@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Hm, are there aspects of these classes that I should be more mindful<br/>\n&gt; about, as an unschooler?&quot;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;d be hesitant to consider a class for a 3 year old. Too many better ways<br/>\nto spend time with him. Too many expectations for paying attention and<br/>\nfollowing directions in any class.<br/>\n<br/>\nMaybe get him one of those blow-up life-size people that you can knock over<br/>\nand they stand back up. Let him punch and kick to his heart&#39;s content.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187853867,"authorName":"Andrea Q","from":"&quot;Andrea Q&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: classes and unschooling","postDate":"1346894575","msgId":68949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGsyOHR0Zit0ODY3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+"},"prevInTopic":68948,"nextInTopic":68952,"prevInTime":68948,"nextInTime":68950,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"I definitely think it s possible to over-do classes, but when you re new to an area, they can be a great way to meet people (not always, but sometimes). There","messageBody":"<div id=\"ygrps-yiv-1231283617\">I definitely think it&#39;s possible to over-do classes, but when you&#39;re new to an area, they can be a great way to meet people (not always, but sometimes). <br/>\n<br/>\nThere will be some things that are easy to explore on your own using the internet or the library, or visiting a museum/science center together. When a new idea comes up, try to think of other possibilities first, before jumping to classes. I tend to look for inexpensive, one-time workshops, drop-in story/craft times or presentations (like feeding time at an aquarium).<br/>\n<br/>\nHis interest in smashing might dissipate before you find an appropriate class, or he might be satisfied with the videos and rough play with you.<br/>\n<br/>\nAndrea Q</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] classes and unschooling","postDate":"1346893901","msgId":68948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEyRDFBM0UyLUQ1RTUtNEM3Qi05OUE1LTE2NUUyQjQ3OTc1QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+","referencesHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+"},"prevInTopic":68947,"nextInTopic":68949,"prevInTime":68947,"nextInTime":68949,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"-=-Here, most middle-class families apply for competitive pre-schools while their babies are still 1, in order to attend for ages 2-4.  It s certainly hard for","messageBody":"<div id=\"ygrps-yiv-1935024246\">-=-Here, most middle-class families apply for competitive pre-schools while their babies are still 1, in order to attend for ages 2-4.  It&#39;s certainly hard for us to find other 3 year olds to play with during the daytime hours. -=-<br/>\n<br/>\nThat&#39;s even happening in India.  :-/  Not yet in New Mexico, but I suppose it might someday.<br/>\n<br/>\nIt&#39;s good that you&#39;re concerned about where the line is.  I think it&#39;s not the content or even the number of the classes or workshops you go to, but your attitude toward them, and toward your child&#39;s participation in them.<br/>\n<br/>\nThings you both can participate in might be better than something that wants you to leave him there and go away (generally speaking).  Something you can drop in when you feel like it has advantages over things that have expensive longterm financial commitments.<br/>\n<br/>\nBut if you treat it all as fun, and if your child sees it as fun, I don&#39;t think you should worry.<br/>\n<br/>\nYou could be healing some of your own childhood lack, too, but learning and doing things now, and thinking of your own younger self with happiness, of how fun it might have been.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":382612893,"authorName":"regan","from":"regan &lt;regan@...&gt;","profile":"reganzzzz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"classes and unschooling","postDate":"1346892934","msgId":68947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5MUUxQUFDLTA2OUQtNDRFQi04MDYzLTczNTY0NUU1QzREQ0BzbG93Z2xvd2luZy5jb20+"},"prevInTopic":0,"nextInTopic":68948,"prevInTime":68946,"nextInTime":68948,"topicId":68947,"numMessagesInTopic":0,"msgSnippet":"Hello everyone, I am writing to you from NYC, where I am unschooling my 3 year old boy.  Unschooling at 3?  I feel like we are, already!  Here, most","messageBody":"<div id=\"ygrps-yiv-1211055621\">Hello everyone,<br/>\n<br/>\nI am writing to you from NYC, where I am unschooling my 3 year old boy.  Unschooling at 3?  I feel like we are, already!  Here, most middle-class families apply for competitive pre-schools while their babies are still 1, in order to attend for ages 2-4.  It&#39;s certainly hard for us to find other 3 year olds to play with during the daytime hours.  Anyway, I have been following unschooling message boards since before he was born!  I even went to the MA Live and Learn Conference.  (It was super.)  <br/>\n<br/>\nMoving to NYC was unexpected for us.  I had been picturing a house, with a little yard� Here I am, though, in our 2-room apartment.  I have recently noticed that I tend to think in terms of classes and other organized activities for him.  These things get us out in the world (and learning things along the way, in buses and on subways).  It&#39;s also a little easier to go to a messy cornstarch workshop at the science museum where he can delve in up to his elbows, than it would be to buy the stuff (and store the leftovers), do the project at our tiny table, and clean up.  <br/>\n<br/>\nIs this the way most city-based unschoolers do it?  There are so many options for afternoon classes for kids here -- puppetry, chess, circus arts, construction, robotics, music, dance, every sport, language, crafts, pastries, yoga�   But I am wondering if a life full of classes is not quite unschooling either (even though he can quit at any time).  I wonder if a class is overstimulating compared with learning on one&#39;s own.  I wonder if classes imply that the best way to learn is to find an expert and pay that person, rather than to explore and see where your own ideas take you.<br/>\n<br/>\nMy bias is that I was an &quot;underprivileged&quot; child.  My school had no art, music, or sports, and my parents didn&#39;t facilitate any of my interests.  I craved music lessons and a drawing class!  Of course, my son has none of this baggage.  <br/>\n<br/>\nAs an example:  these days, my son is interested in the idea of smashing and bashing people.  (We saw a street fight.)  He likes to role play smashing and bashing, self defense, calling the police, etc.  I&#39;ve told him that there are also sports where you can do smashing and bashing wearing protective gear, and having been trained.  We watched some videos of boxing and a variety of martial arts.  My next thought was that I could take him to a class so that he could try it for himself.  And then my third thought was, &quot;Hm, are there aspects of these classes that I should be more mindful about, as an unschooler?&quot;<br/>\n<br/>\n<br/>\ncheers,<br/>\nRegan<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":68697,"nextTopicId":68974}}