{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"D.J. Brewer","from":"&quot;D.J. Brewer&quot; &lt;djbrewer@...","replyTo":"LIST","senderId":"dhC27VRSPmEF-2Cs-gkUVlo_Ib-kyiGliyrHdyYdUb4suwodDGwOLxOXhazHdxRCFWJEG4ybNcKay5HmixH9guMcupRRiiZ9G2w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Peer Group dependence","postDate":"937013924","msgId":2874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMDEuMjg3NC45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":2864,"nextInTopic":0,"prevInTime":2873,"nextInTime":2875,"topicId":2864,"numMessagesInTopic":0,"msgSnippet":"... children is actually displaced dependence which winds up being dependence on peers.  So you wind up with peer dependent kids role modeling themselves after","messageBody":"<div id=\"ygrps-yiv-390224102\">I have seen this post a bit the last couple of days:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;He believes much &quot;independence&quot; that people are so proud of in their<br/>\n </span></blockquote>children is actually displaced dependence which winds up being<br/>\ndependence on peers.  So you wind up with peer dependent kids role<br/>\nmodeling themselves after their peer group which is a highly abnormal<br/>\nand dangerous state of affairs given that children don&#39;t really have all<br/>\nthey need to guide each other. Many of these kids appear very<br/>\nindependent but looks are deceiving.&lt;<br/>\n<br/>\nNo duh looks are deceiving!<br/>\nI have seen this post repeated several times, and MAN, I am SO glad<br/>\nsomebody is on the ball about this false independence thing.  All it is,<br/>\nis definitely displaced dependence on peers!<br/>\n<br/>\nA child desperately needs the love and support of a family.  That is why<br/>\nthey were born into one.  It is horrific the kind of weird social groups<br/>\nthat kids create at peer-grouped institutions.  And because these<br/>\ninstitutions are ubiquitous, the majority of people think that they are<br/>\ngood, despite repeated murders that take place at them, despite the rise<br/>\nin young teens having babies as a result of twisted relationships<br/>\nspawned at these institutions, despite the verbal cruelty kids dish out<br/>\nto one another on a daily basis at public schools, despite the tears of<br/>\nkids each day who come home humiliated.  And THIS is our national<br/>\nstandard of &quot;socialization.&quot; Then God help our society!<br/>\n<br/>\nI think too many parents are kicking their kids into a world they are in<br/>\nno way prepared to deal with at way too young an age.  These kids&#39; role<br/>\nmodels are television characters and mouthy popular kids at school who<br/>\nhide their feelings with smart remarks and put downs.  The &quot;real world&quot;<br/>\nthat homeschoolers supposedly shelter their kids from is NOT real at<br/>\nall.  It is largely made up of immature &quot;shunnings,&quot; as well as  poorly<br/>\ninformed, loudlyvoiced opinions, and celluloid characters whom few know<br/>\nyet many adore without question.  There ya go.  There&#39;s &quot;real&quot; for ya!<br/>\n<br/>\nHomeschooled kids deal with the real world on a daily basis -- a world<br/>\npopulated with REAL people of all ages.  Homeschooled children know and<br/>\nmeet people of  all interests, all occupations.  They are not forced<br/>\ninto a &quot;herd mentality&quot; due to ridicule if you don&#39;t ascribe to the<br/>\npopularly held views of your peers.<br/>\n<br/>\nI know studies have been done that show public school fosters peer<br/>\ndependency.  I thought that after the Littleton, Colorado incident we<br/>\nwould have an awakening and people would see that alienation is a<br/>\ndangerous lifestyle to practice.<br/>\n<br/>\nInstead it brought on a host of paranoid rules -- students must now own<br/>\nsee-through backpacks, they cannot wear trenchcoats, there are increased<br/>\nregulations in appearance and EVEN THOUGHT!!! The thought police are now<br/>\nno longer a piece of science fiction!  They are the counselors and<br/>\nteachers (even the students) at any public school.  If someone overhears<br/>\nyou say something, their word is enough to get the police onto your<br/>\ncase.  Our youth are being raised bereft of fundemental rights and are<br/>\nbeing prepared perfectly to fit into a police state. It&#39;s downright<br/>\nscary.<br/>\n<br/>\nReally, what they needed to do was get kids together and have them<br/>\novercome their prejudices and cruelties practiced against one another.<br/>\nThe jocks, preppies, goths, druggies, skateboarders, surfers,<br/>\nCaucasions, Latinos, Asians, African Americans (African Africans,<br/>\nCarribean Africans, etc.)  all just need talk to one another as human<br/>\nbeings, get over it and get along.<br/>\n<br/>\nBut the structure they are existing in is not likely to foster that kind<br/>\nof mentality.  Only a family can do that.  Government rules the masses,<br/>\nbut love rules the family.<br/>\n<br/>\nDJ Brewer</div>","specialLinks":[]},{"userId":0,"authorName":"Becky Wollenslegel","from":"&quot;Becky Wollenslegel&quot; &lt;beckycraigw12@...","replyTo":"LIST","senderId":"gSkP13jw_ylXgHoiTzI7cbYQMCBrF0NVtbQ6uNAaD9vP3G4qrnf7oPMZsgwe_gzFihPTorSBKK-nSEqcr0QdsXbHEZ-_NYJG-Wwna0EOagbh_BxUbMqI4Fw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Peer Group dependence","postDate":"936977126","msgId":2864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMDAuMjg2NC45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":2874,"prevInTime":2863,"nextInTime":2865,"topicId":2864,"numMessagesInTopic":0,"msgSnippet":"... children is actually displaced dependence which winds up being dependence on peers.  So you wind up with peer dependent kids role modeling themselves after","messageBody":"<div id=\"ygrps-yiv-2073673095\">Joel wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; He believes much &quot;independence&quot; that people are so proud of in their<br/>\n </span></blockquote>children is actually displaced dependence which winds up being dependence on<br/>\npeers.  So you wind up with peer dependent kids role modeling themselves<br/>\nafter their peer group which is a highly abnormal and dangerous state of<br/>\naffairs given that children don&#39;t really have all they need to guide each<br/>\nother. Many of these kids appear very independent but looks are deceiving.&lt;<br/>\n<br/>\nThis is what bothers me so much about day care - you hear so much about how<br/>\nday care fosters independence - but somehow I always thought babies were<br/>\nsupposed to be dependent!<br/>\n<br/>\nWhat I read was about how these very young children are transferring their<br/>\ndependence from parents/family to other kids - so what appears to be<br/>\nindependence isn&#39;t!  Then suddenly they are teenagers and at the place in<br/>\ntheir life when they should be questioning/moving away from parental<br/>\nattachment - and with an unhealthy dependence on their peer group and no use<br/>\nfor their family - and no respect for the value system of their family.<br/>\nIt&#39;s like they don&#39;t have the parental attachment to balance against the<br/>\npeer attachment that would naturally happen at that age  As more and more<br/>\nkids are being &quot;raised&quot; by strangers in institutions the problem continues<br/>\nto grow.<br/>\n<br/>\nIt also seems like alot of people are eager for their children to be<br/>\nindependent so they can get on with their owns lives/interests.  Meanwhile<br/>\nthe kids dangle somewhere in search of a family attachment - and their peer<br/>\ngroup becomes their &quot;family&quot;<br/>\n<br/>\nBothers me alot - I cared for children in my home for many years - and those<br/>\nkids had the advantage of our family as their extended one.  I&#39;m not sure<br/>\ntheir parents realized how attached to me/my family they were and how<br/>\nwrenching it was for them when they started school or moved and had to<br/>\nseperate from us. Children have always been cared for by people other than<br/>\ntheir parents - but at least in the old &quot;governess&quot; days they were in their<br/>\nown home with their siblings instead of being dropped off in an instution<br/>\nand warehoused for most of their day.<br/>\n<br/>\nCan you tell this is one of the things that I get on my soap-box about?<br/>\nThanks, Joel, for the reminder.<br/>\n<br/>\nBecky in Ohio</div>","specialLinks":[]}],"prevTopicId":2872,"nextTopicId":2875}}