{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","replyTo":"LIST","senderId":"JRAXVmxZj3ADFKDX-vij09aPVa0l8c30J5Jj5xHdEbB8Ypp8iZRbDzQYBw9KHkHB8oxLX8pmSxEOtvnJb1b-2yuXMnZh0oT9YrjIBhAS","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: unschooling math, etc.","postDate":"997635931","msgId":23191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBHSFkwMERTSFNUN1NEQG10YTYuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":23190,"nextInTime":23192,"topicId":23191,"numMessagesInTopic":0,"msgSnippet":"... I m glad you wrote this, as I was about to post something similar. I was a cost accountant. I learned entirely on the job. It takes very, very little","messageBody":"<div id=\"ygrps-yiv-663878336\">----------<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;Subject: [Unschooling-dotcom] Digest Number 1360<br/>\n&gt;Date: Sun, Aug 12, 2001, 9:28 AM<br/>\n&gt;<br/>\n<br/>\n&gt; I just don&#39;t think anything a person does, whether its an engineer, an<br/>\n&gt; accountant, or anything else is separated into subjects. An accountant<br/>\n&gt; doesn&#39;t only do math, a massage therapist doesn&#39;t only do massages, etc. Hope<br/>\n&gt; I am making my point clearly. . . NAK<br/>\n<br/>\n<br/>\n </span></blockquote>I&#39;m glad you wrote this, as I was about to post something similar.<br/>\n<br/>\nI was a cost accountant. I learned entirely on the job. It takes very, very<br/>\nlittle &quot;math&quot; as is presented in school. You need a good calculator and need<br/>\nto learn how to use it. You need an obsession with orderliness, and that&#39;s<br/>\npretty much it.<br/>\n<br/>\nSchools, colleges, separate things into &quot;subjects&quot;. Life does not.<br/>\nSeparating what a person does all day into &quot;subjects&quot; can be a fun<br/>\nunschooling party trick, but life goes on and doesn&#39;t care whether you do<br/>\nit. Life goes on and we learn whether we do it.<br/>\n<br/>\nSandra had a good point with the percentages: I didn&#39;t learn how to do<br/>\npercentages, mathematically on a worksheet, until this year. I glazed over<br/>\nthem in school, and quickly learned the few real life ones needed by using<br/>\nthem (tips). I learned how to plug them into the computer for my job as an<br/>\naccountant, and later didn&#39;t need them so much for my job as a dog trainer,<br/>\nor my job now as a bookseller.<br/>\n<br/>\nI don&#39;t know why I was thinking about them the other day, but I said to my<br/>\nhusband, &quot;if I do this, then is it that?&quot; and he said, &quot;yes&quot; and I thought,<br/>\n&quot;oh, so THAT&#39;s how you do that&quot;.<br/>\n<br/>\nI&#39;m 35 in a few weeks.<br/>\n<br/>\nI didn&#39;t need to know how to do percentages up till now. I still don&#39;t,<br/>\nreally, but for some reason it caught my interest at this time. It is no<br/>\nmore &quot;vital&quot; for me to know than how to fit a collar on my dog. In fact,<br/>\nless vital. But I doubt anyone here would suggest that I need to sit my<br/>\ndaughters down and teach them &quot;collar fitting&quot; before lunch.<br/>\n<br/>\nThere is nothing that is necessarily more important than anything else.<br/>\nThere is no way to prepare children &quot;in advance&quot; for what they want to do in<br/>\n20 years, because we don&#39;t know what that is. The only ones who have SOME<br/>\ninkling (and we have to accept their right to change their minds and<br/>\ndirections 400 or 40,000 times) are our kids. THEY know what speaks to them<br/>\nand sings to them. They know it when they do it, and we don&#39;t get to choose<br/>\nwhat is right for them. We can choose to force what is wrong for them, but<br/>\nwe don&#39;t get to choose what is right.<br/>\n<br/>\nIf a child wants to spend all his time playing basketball, then that&#39;s what<br/>\nhe needs to learn. Doesn&#39;t mean he&#39;ll grow up to play basketball. Might,<br/>\nmight not.<br/>\n<br/>\nIf a child wants to spend all his time taking things apart, then that&#39;s what<br/>\nhe needs to learn. Doesn&#39;t mean he&#39;ll grow up to be a mechanic. Might, might<br/>\nnot.<br/>\n<br/>\nIf a child wants to spend all his time playing computer games, then that&#39;s<br/>\nwhat he needs to learn. Doesn&#39;t mean he&#39;ll grow up to be a programmer.<br/>\nMight, might not.<br/>\n<br/>\nIf a child wants to spend all his time doing math worksheets, then that&#39;s<br/>\nwhat he needs to learn. Doesn&#39;t mean he&#39;ll grow up to be a professor of<br/>\nmathematics. Might, might not.<br/>\n<br/>\nSchool has fed us a line about children being prepared. Class time on<br/>\npercentages was wasted on me. Class time on fine literature was wasted on my<br/>\nbrother in law. Class time on home ec was wasted on my sister.<br/>\n<br/>\nUnlike schools, we don&#39;t have to waste our children&#39;s time. We can accept<br/>\nthat time is theirs, not ours, to spend how they choose, and just make sure<br/>\nthere are plenty of choices so they can choose well -- for them, not us.<br/>\n<br/>\nPam</div>","specialLinks":[]}],"prevTopicId":23189,"nextTopicId":23109}}