{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Hafidha","from":"&quot;Hafidha&quot; &lt;hafidha@...&gt;","replyTo":"LIST","senderId":"zbcFAGcgM8Wqq_qHmdmyZf6wZKnhlLUAoPo2ulchwtgMs3768WP_iX217I3KQvFSZdARXtOyQWejFiHAM4WAi8LE","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Karen: Shy kids","postDate":"956075749","msgId":8249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyYzIwMWJmYTk1NCQzMTYwMzk4MCQ3NDcwM2ZkMUBkZWZhdWx0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":8248,"nextInTime":8250,"topicId":8249,"numMessagesInTopic":0,"msgSnippet":"Hi, Karen - sorry for the late response. Hmm ... for most of my life I was convinced that I was shy .. shy and introverted.  I dreaded the prospect of being","messageBody":"<div id=\"ygrps-yiv-430250507\">Hi, Karen - sorry for the late response.<br/>\n<br/>\nHmm ... for most of my life I was convinced that I was shy .. shy and<br/>\nintroverted.  I dreaded the prospect of being uncomfortable in new<br/>\nsituations so much that I usually avoided them.  It became a kind of<br/>\nself-fulfilling prophecy ... even when I was 17 years old and took the<br/>\nMeyers Briggs test for the first time, I thought, &quot;There must be some<br/>\nmistake&quot; when it indicated I was almost evenly split between<br/>\nintroverted and extroverted.<br/>\n<br/>\nIt wasn&#39;t until about a year ago (after another personality test) that<br/>\nI realized how wrong I&#39;d been about myself.  All that time I&#39;d thought<br/>\nfor sure I was a total introvert because I BEHAVED as one.  It hadn&#39;t<br/>\noccurred to me to take into consideration my INCLINATION to be<br/>\nextroverted; or to realize that in my daydreams I was almost *always*<br/>\nthe life of the party. I&#39;m one of those people who stands at the bus<br/>\nstop and envisions herself striking up conversations with everyone<br/>\nthere - yet in reality never says a word to any of them. I *want* to<br/>\nsay or do something, but something holds me back, and in the end I<br/>\nusually kick myself for being held back.<br/>\n<br/>\nOne thing that helped *me* when I was younger (and still helps now)<br/>\nwas to start off in a structured environment (e.g. a class) in which<br/>\neveryone participated to some degree. I believe my initial shyness is<br/>\nrelated to my high level of self-consciousness and my uncertainty<br/>\nabout people (is she mean? is he crude?). Being introduced to others<br/>\nwithin a group takes pressure off of me (I don&#39;t have to dazzle them)<br/>\nand also allows me to &#39;safely&#39; observe the others. After I&#39;ve had a<br/>\nchance to &#39;feel&#39; them out, I relax a bit and am very receptive to<br/>\nbeing approached.<br/>\n<br/>\nIn dealing with strangers in a non structured environment, as a child<br/>\n(and as an adult) it was helpful to have a connection; for example, a<br/>\nfriend who already knew the strangers.  That friend acted (without<br/>\nknowing) as a diversion so that all the focus wasn&#39;t on me (who&#39;s the<br/>\nnew girl?); I was also able to see how she interacted with the other<br/>\nkids and get a feel for them less directly.  I think a lot of people<br/>\ncan relate to this, no?<br/>\n<br/>\nTo this very day, I am uncomfortable and indecisive in most one-on-one<br/>\nsituations- even with friends; I am still very self-consciousness, and<br/>\nconcerned about not putting anyone out. However, when I&#39;m with several<br/>\nfolks or a large group, I&#39;m VERY vocal, extroverted and often take<br/>\ncharge. Believe it or not, sometimes I&#39;m called on  to do public<br/>\nspeaking and always enjoy it (though of course I get butterflies<br/>\nbeforehand).<br/>\n<br/>\nSo I think a distinction ought to be made between those who *want* to<br/>\nbe actively involved, but have some fears, and those who are more<br/>\npassive.  I&#39;m of the former group, but have a few friends who are of<br/>\nthe latter. There is *nothing* wrong with them.<br/>\n<br/>\nAll that being said, in the past year I&#39;ve traveled to three different<br/>\ncountries alone - and only recently found out that such a thing is<br/>\nconsidered WEIRD and SCARY to most people.  Admittedly, I often kept<br/>\nto myself and didn&#39;t initiate many conversations with strangers I came<br/>\nacross, but just the fact that I had enough confidence and<br/>\nself-assurance  to travel solo gives me some encouragement that I&#39;ll<br/>\nbecome braver with time and practice. All those years, it was just my<br/>\nfears blocking me; if you determine your child to have &#39;that kind&#39; of<br/>\nshyness, I think you ought to help him conquer his fears so that he<br/>\ncan engage in the things he wants to do.  If your child is simply a<br/>\npassive person who prefers observing to participating,  I definitely<br/>\nwouldn&#39;t push him. We shouldn&#39;t all be the same!  Hope I&#39;ve been<br/>\nhelpful as much as I&#39;ve been longwinded.<br/>\n<br/>\n<br/>\n-Hafidha<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nIn a message dated 4/16/00 <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HPaulson5@...\">HPaulson5@...</a> writes:<br/>\n<br/>\n    Hafidha,<br/>\n            I have a young son ( 5yo) that is also very shy.  Looking<br/>\nback, is there anything that ,in your opinion, would have helped you<br/>\nwith your shyness?  Do you think your parents could have or should<br/>\nhave handled things differently, so that you would maybe have been<br/>\nmore comfortable in new situations?  I remembered being extremely shy<br/>\nas a child, and I definitely did not want to be pushed into anything,<br/>\nand I don&#39;t want to push my child too much, either; however, sometimes<br/>\nhe needs that encouragement... to<br/>\nfind out that things can be fun to do.  Yesterday we went to an Easter<br/>\negg hunt.<br/>\n<br/>\nBefore we left to go, my little boy expressed how he was scared.  I<br/>\ntold him that we were going to go ahead and go, and that he could see<br/>\nwhat it was like when we got there, and that if he decided that he did<br/>\nnot want to do it, that he did not have to. Well, he ended up taking<br/>\npart,and enjoying it, so I was happy for him, but the shyness is<br/>\nsomething we have to deal with continually.<br/>\nSo, if you, or anyone else, would have any thoughts on dealing with<br/>\nshyness, I&#39;d like to hear them.  Thanks in advance!<br/>\n                                Karen--in Ind</div>","specialLinks":[]}],"prevTopicId":8245,"nextTopicId":8252}}