{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Friends was Can I talk here","postDate":"1227640738","msgId":40494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdnaGozMitoOGg0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEM4MTk2NjUyNkM1NDRBQTdBMzk0QzYwN0YyMTU2QTk4QFJvYnluUEM+"},"prevInTopic":40473,"nextInTopic":0,"prevInTime":40493,"nextInTime":40495,"topicId":40463,"numMessagesInTopic":0,"msgSnippet":"Chamille has always seemed to attract and be attracted to kids with really dysfunctional families.  Something that I ve seen happen over the years, is that in","messageBody":"<div id=\"ygrps-yiv-1044294789\">Chamille has always seemed to attract and be attracted to kids with<br/>\nreally dysfunctional families.  Something that I&#39;ve seen happen over the<br/>\nyears, is that in many ways, Chamille has shown those kids another way<br/>\nof being in the world.<br/>\n<br/>\nMost of the time kids always wanted to be at our house, not theirs, so<br/>\nit was easier for me.  Could you push that more?<br/>\n<br/>\nNow that Chamille is older, she is less tolerant of bad behavior from<br/>\nher friends.  She&#39;s still patient and kind and open to friendship, but<br/>\nshe doesn&#39;t let people walk on her or abuse her in any way.  A lot of<br/>\nthat is because she&#39;s learned, through years of playing with kids like<br/>\nthat, how to mediate and navigate in and around turmoil.<br/>\n<br/>\nShe&#39;s really grown a lot just in the last year in regards to how she<br/>\nanalyzes people and their behavior.  It started when she was small and<br/>\ntried to make sense of why so and so tried to steal things or why so and<br/>\nso treated her stuff badly, or why so and so was mean to the other kid,<br/>\netc.  We talked, and worked through scenarios of possibilities, actual<br/>\nand imaginary.<br/>\n<br/>\nShe&#39;s always watched people, often, in such a way, where she has no<br/>\ninterest at all in actually talking or interacting with them, just<br/>\nwatch.  Kids have always wanted to be around Chamille though, especially<br/>\nwhen she was littler, because she had all the good ideas and she was<br/>\ngracious about sharing everything and being fair.<br/>\n<br/>\nI used to be concerned with all her friend choices, because mostly they<br/>\nweren&#39;t the &quot;nice&quot; kids.  At least one of those kids, we still see, and<br/>\nshe relies heavily on our family to show her kindness because it&#39;s the<br/>\nonly time she sees it.  I think, she will survive, in part, because of<br/>\nthat.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Friends was Can I talk here","postDate":"1227620504","msgId":40473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQzMzVERjBBLUI5QzEtNENDRi1CNDNBLUJFNjc2MDRFRkNBNEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEM4MTk2NjUyNkM1NDRBQTdBMzk0QzYwN0YyMTU2QTk4QFJvYnluUEM+","referencesHeader":"PEM4MTk2NjUyNkM1NDRBQTdBMzk0QzYwN0YyMTU2QTk4QFJvYnluUEM+"},"prevInTopic":40466,"nextInTopic":40494,"prevInTime":40472,"nextInTime":40474,"topicId":40463,"numMessagesInTopic":0,"msgSnippet":"-=-But short of moving away (and I keep hoping they will) I m not sure what to tell myself to find acceptance. Any thoughts will be welcomed.-=- Can you move","messageBody":"<div id=\"ygrps-yiv-1661206091\">-=-But short of moving away (and I keep hoping they will) I&#39;m not  <br/>\nsure what to tell myself to find acceptance. Any thoughts will be  <br/>\nwelcomed.-=-<br/>\n<br/>\nCan you move away?  But Jane would still be an only child wherever  <br/>\nyou went.<br/>\n<br/>\nThere are tales of only children who grew up in isolation and did  <br/>\nokay as adults, but if she can see other kids and wants to be with  <br/>\nthem, it seems cruel not to let her try.<br/>\n<br/>\nWhen my kids brought bad attitude and emotion in from their outside  <br/>\nactivities, I would tell them they couldn&#39;t do that, that if the  <br/>\nfriend was going to cause them to be awful to us that they needed to  <br/>\nnot hang out with the friend.  Maybe you can tell her (maybe you  <br/>\nhave) that she needs to figure out a way to be her best and sweetest  <br/>\nself with you and her dad, or she needs not to play with the other kids.<br/>\n<br/>\nMarty had one friend who was not a great influence, and I wish I had  <br/>\nmade less noise about it, because the kids name him immediately when  <br/>\nsuch topics come up.  He grew up better than I had thought he would,  <br/>\nbut he still is reckless and lacks some of the kinds of regard for  <br/>\npeople and property than I think is important.  His mom was  <br/>\ninconsistent and his dad was in prison across the country (I don&#39;t  <br/>\nknow why and really didn&#39;t want to know), but Marty liked him.  He  <br/>\nwas sometimes in school and sometimes homeschooled, sometimes too  <br/>\nfree, sometimes overly constrained.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Friends was Can I talk here","postDate":"1227592906","msgId":40466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2RjU2MjE0LUZENkUtNEQwOC05NjlFLUZCNzhCRjJCMTY0MEBtYWMuY29tPg==","inReplyToHeader":"PEM4MTk2NjUyNkM1NDRBQTdBMzk0QzYwN0YyMTU2QTk4QFJvYnluUEM+","referencesHeader":"PEM4MTk2NjUyNkM1NDRBQTdBMzk0QzYwN0YyMTU2QTk4QFJvYnluUEM+"},"prevInTopic":40463,"nextInTopic":40473,"prevInTime":40465,"nextInTime":40467,"topicId":40463,"numMessagesInTopic":0,"msgSnippet":"Hey - that was Roya. Roya used to be kind of desperate like that - and it made me so sad and worried about her. She still IS a very very social person and when","messageBody":"<div id=\"ygrps-yiv-245878290\">Hey - that was Roya. Roya used to be kind of desperate like that - and  <br/>\nit made me so sad and worried about her. She still IS a very very  <br/>\nsocial person and when she was Jayn&#39;s age really wanted a group of  <br/>\nfriends to hang out with many hours of each day. At nearly 24 she has  <br/>\njust started to enjoy her alone time more than she had in the past -  <br/>\nbut still she almost always wants a friend along, no matter what she&#39;s  <br/>\ndoing. She&#39;s more discriminating about her friends, these days,  <br/>\nthough, by the way.<br/>\n<br/>\n  Let me ask you this - how would you respond to the whole situation  <br/>\nif you were absolutely sure that these playtimes/playmates would have  <br/>\nno long-lasting impact? How would you feel different than you do now?  <br/>\nHow would you talk about them with Jayn?<br/>\n<br/>\nRobyn - I really truly don&#39;t think hanging out with some problematic  <br/>\nneighbor kids is going to have any long-lasting impact at all on  <br/>\nJayn.  I hung out quite a bit with a kid who ended up in prison for  <br/>\nmurder - and he wasn&#39;t a nice kid, either, just a neighbor. Lots of  <br/>\nthe kids on my street were, now that I look back on it, not all that  <br/>\nnice. It was a regular Peyton Place among the adults (I heard later,  <br/>\nfrom my mom, after I was grown), so I guess no wonder there was lots  <br/>\nof meanness among the kids. But I was, like Roya, a very very socially  <br/>\nneedy kid and I was not at ALL discriminating in my friendships. I  <br/>\njust played with the kids on my street- whichever was available at the  <br/>\ntime.<br/>\n<br/>\nThat said, seems to me your best approach is to keep her socially  <br/>\nsatisfied by offering far more social time away from the neighbor  <br/>\nkids, even if that means not being home as much as you&#39;d like.<br/>\n<br/>\nBut, it might help you to have more confidence in her if I tell you  <br/>\nthat there were times that my girls have had playmates I found sort of  <br/>\nunsavory and that it WILL happen even when they are teens - it is hard  <br/>\nto explain sometimes what attracts our kids to befriend someone whom  <br/>\nwe see is, for example, manipulative or demanding. But we can trust  <br/>\nthat there is something our kid is getting out of that relationship -  <br/>\nand if we can figure out what it is, we might be able to help them get  <br/>\nwhat they need in better ways, but we may not be able to figure out  <br/>\nwhat it is. Can you take a more detached or clinical look at what  <br/>\nshe&#39;s getting from these friendships and focus more on supporting her  <br/>\ngetting that, rather than focusing on your fears that the other  <br/>\nchildren&#39;s negative characteristics are going to contaminate Jayn?<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 24, 2008, at 8:53 PM, Robyn L. Coburn wrote:<br/>\n<br/>\n&gt;  she is always, always the begging supplicant, looking out the  <br/>\n&gt; window first thing in the morning, watching for them to come home,  <br/>\n&gt; insisting on going over every time we get home </span></blockquote></div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Friends was Can I talk here","postDate":"1227588824","msgId":40463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM4MTk2NjUyNkM1NDRBQTdBMzk0QzYwN0YyMTU2QTk4QFJvYnluUEM+"},"prevInTopic":0,"nextInTopic":40466,"prevInTime":40462,"nextInTime":40464,"topicId":40463,"numMessagesInTopic":0,"msgSnippet":"It s hard when you really dislike how your child wants to spend their time. Whether it s an aversion to TV, to electronic gaming, to particular friends, to a","messageBody":"<div id=\"ygrps-yiv-802559440\">It&#39;s hard when you really dislike how your child wants to spend their time. Whether it&#39;s an aversion to TV, to electronic gaming, to particular friends, to a club or activity - it&#39;s really hard. <br/>\n<br/>\nI&#39;ve never had problems with my daughter watching tv. Even when there were a couple of shows I didn&#39;t care for, I knew that she would grow out of them, and they weren&#39;t harming her.<br/>\n<br/>\nI love that she plays computer games and online games and wants me to play them with her. Even though I find Mario Party a bit slow moving at times - and I am not very good at some of the mini-games - I love that she wants to play with me and I love hearing her reading stuff from the screen.<br/>\n<br/>\nI love her enthusiasm for dolls, for drawing, for more dolls, for writing stories, for writing stories about her dolls.....her interests and passions have been easy to support.<br/>\n<br/>\nNo - my particular challenge, again, is just the particular friends that she loves and apparently prefers over everyone else in the world, often including her father and I, who just aren&#39;t nice kids, living in a rulebound home with other issues that I find hard to deal with. She isn&#39;t doing what some of you have reported of your children - noticing the unpleasant part and choosing to back off. She isn&#39;t insulating her Self from what ever the stressors are - she is bringing her stress home and acting out with us once she can relax. She isn&#39;t picking and choosing - she is always, always the begging supplicant, looking out the window first thing in the morning, watching for them to come home, insisting on going over every time we get home - while they apparently don&#39;t particularly care and never seek her out. She&#39;s just this convenience for them. If I felt that they truly loved her, maybe it would somewhat better.<br/>\n<br/>\nSo I sympathise with other moms journeying towards unschooling who feel the same anxiety about their little ones sitting in front of the computer again, as I do in the pit of my stomach that is only relieved when I hear Jayn coming up the stairs to home. I sympathise with other moms who are afraid that tv is somehow stronger than their child&#39;s mind and heart (it&#39;s not stronger than my child&#39;s mind or heart but I fear that the insidious influence of these kids somehow is.) I sympathise with moms wanting to erect a big, strong wall around their child&#39;s health, even when I know that this won&#39;t work nearly as well to protect them as the power of knowledge and self awareness will.<br/>\n<br/>\nI know from bitter experience that living the lie of silence - not expressing my misgivings about a person - is harmful to our relationship. But now I fear going too far in the opposite direction - expressing my dislike too strongly, my disapproval, my fear, my disappointment, my fear, my annoyance, my fear - will have the same negative effect as with any other issue, like Pam speaking of her disparaging attitude towards her dh&#39;s tv a long time ago (and it must have been a long time ago.)<br/>\n<br/>\nSo I have been struggling, and saying to myself over and over, &quot;it&#39;s just like tv, it&#39;s just her passion&quot; and I make a determined effort to speak brightly and ask how it went, what they played, was it fun. But tonight I am slammed with the realization that it is not &quot;just like&quot; anything else in our life.<br/>\n<br/>\nBecause I love tv. I have no desire for her to &quot;have her fill&quot; and not care for any more. I will be perfectly content if she watches tv avidly and enthusiastically for the rest of her life. Or not.<br/>\n<br/>\nBut these kids....I&#39;m watching, waiting, hoping that she will soon be done with them. That she will see the difference between these low grade friends, and the truly lovely kids  who genuinely like her and seek her out, that she plays with in other situations, playdates I strive to have as many of as possible (am I really doing enough? Surely no...) And again it is not that I don&#39;t trust Jayn...it&#39;s that I don&#39;t trust them, or their family, and I haven&#39;t the slightest idea what horrible antithetical ideas or philosophies they are insidiously inserting into my dear, pure child&#39;s unsullied mind.<br/>\n<br/>\nAnd yes, she is a different person when she spends any amount of time with them, especially at their house, than when she doesn&#39;t.<br/>\n<br/>\nI don&#39;t think living with the emotional turmoil of a sense of desperation is good for me, for her, for the peace of our household. But short of moving away (and I keep hoping they will) I&#39;m not sure what to tell myself to find acceptance. Any thoughts will be welcomed.<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":40477,"nextTopicId":40485}}