{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"megates@juno.com","from":"megates@...","replyTo":"LIST","senderId":"HHszroQLhx1AlJN5AOtDRn2SZuvKYHbu7ukU0Wf7wKKc44zjVFAoKLfbmjoss3urCBRuIMShbg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"simplifying","postDate":"975949742","msgId":14363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMjA0LjA5MzAwNS4tNDE3Nzc1LjUubWVnYXRlc0BqdW5vLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14362,"nextInTime":14364,"topicId":14363,"numMessagesInTopic":0,"msgSnippet":"This seems to tie in with the question about simplifying, yet still providing plenty of learning opportunities for our children. Mary Ellen Nobody had a watch,","messageBody":"<div id=\"ygrps-yiv-1148881664\">This seems to tie in with the question about simplifying, yet still<br/>\nproviding plenty of learning opportunities for our children.<br/>\nMary Ellen<br/>\nNobody had a watch, so they ate lunch when they got hungry.<br/>\n<br/>\nScrooge&#39;s Christmas List<br/>\nby Gary Foreman<br/>\n<br/>\n       &quot;Cratchit, take your Christmas grab bag and be gone. Out, I tell<br/>\nyou, or you&#39;ll be seeking new employment!&quot; That scene wasn&#39;t included in<br/>\nCharles Dickens&#39; &quot;A Christmas Carol&quot; but I can easily picture crotchety<br/>\nold Scrooge taking Bob Cratchit to task for attempting to include him in<br/>\nan office holiday gift exchange. Scrooge certainly is the symbol of<br/>\nsomeone who doesn&#39;t like Christmas.<br/>\n       But, if you think about it, many of us harbor Scrooge-like<br/>\nfeelings<br/>\ntoday. We really don&#39;t want to participate in yet one more gift exchange.<br/>\nWe&#39;re out of both time and money.<br/>\n       The sad fact is that for many of us, Christmas shopping has become<br/>\nlargely an obligation. We buy presents because it&#39;s expected. Take a look<br/>\nat your list. How many gifts are you buying because you really want to<br/>\nbless the person receiving it? And how many fall into the &quot;I gotta&quot;<br/>\ncategory?<br/>\n       Part of the problem for all of us is that most of the people that<br/>\nwe buy for already enjoy material wealth. They truly &quot;don&#39;t need<br/>\nanything.&quot; In fact, your present creates a problem for them.<br/>\n       Yes, I know that some think only a real Scrooge would take people<br/>\noff their gift list. But, I&#39;d disagree. Many of the gifts that you will<br/>\ngive this season will actually hurt the person you give them to. Here&#39;s<br/>\nhow. They really don&#39;t need whatever you bought. It&#39;s just one more item<br/>\nto take up closet, cabinet or attic space. You&#39;ve put them one step<br/>\ncloser to needing a bigger house (with a bigger mortgage payment). You&#39;ll<br/>\nconsume their time and money without adding any enjoyment to their lives.<br/>\n       And you&#39;ll diminish your own life, too. Whether you consider this<br/>\ntime of year to be an important part of your faith or just a time of good<br/>\nwill, rushing from store to store will take your mind from the real<br/>\nmeaning of the season. You will be focused on things and not on the<br/>\nrelationships that are important to your life. So I&#39;d argue that it&#39;s<br/>\nreally in the spirit of the season to reduce the number of people on your<br/>\ngift list.<br/>\n       In fact, you&#39;d be doing friends a favor by not exchanging gifts.<br/>\nYou&#39;d both save the time spent buying and wrapping the gift. If you truly<br/>\nvalue that person, it&#39;s much better to get together for lunch or dinner<br/>\nand catch up on what&#39;s happening in your lives.<br/>\n       OK, in some cases it&#39;s not practical to drop people from your<br/>\nlist.<br/>\nSo how can you make the best of gift shopping?<br/>\n       Before you go shopping, consider why you&#39;re buying each present.<br/>\nDecide which people on your list are really important. You have a limited<br/>\namount of time and money. Spend them on the people who are truly<br/>\nimportant in your life.<br/>\n       Everyone else should be handled without a big fuss. It&#39;s not that<br/>\nwe don&#39;t like the people in our office gift exchange. It&#39;s just that six<br/>\nmonths from now they won&#39;t remember what you bought them.<br/>\n       An office party is a great place for a gag gift. Thrift stores can<br/>\nprovide an assortment of items that can be used for funny gifts. Stuffed<br/>\nanimals, clothing, coffee mugs and toys are fertile ground for the<br/>\nimagination. Is the recipient a stickler for time? An old alarm clock<br/>\ncould be good. One where the hands have been removed is even better.<br/>\n       Many of us have far away relatives and friends. Unless you&#39;re<br/>\nparticularly close, you might as well admit that you really don&#39;t know<br/>\nwhat they already have or what they need. So no matter what you get<br/>\nthere&#39;s a good chance that it will need to be returned. Rather than<br/>\ncombing the malls hoping that the perfect item will jump into your arms,<br/>\nwhy not consider a gift certificate from a national chain of stores. Or,<br/>\nbetter still, agree to a dollar amount that you will each spend on your<br/>\nown family. Do your buying after Christmas and send the &quot;giver&quot; a photo<br/>\nof the gift that they &quot;bought.&quot;<br/>\n       For local friends and relatives, think about where your lives<br/>\nintersect. That&#39;s the place to begin looking for a present. If you find<br/>\nthat your lives have drifted apart, it&#39;s better to spend time catching up<br/>\ninstead of shopping.<br/>\n       Then there&#39;s those very special people on your list. Your spouse,<br/>\nchildren and others who you truly want to make happy with a gift.<br/>\nRemember that it&#39;s not how much you spend. While it&#39;s nice to find a<br/>\nthoughtful gift for that special someone, what they really want is you.<br/>\nThe people that are most important in your life want your time and<br/>\nattention. They want your happiness. Don&#39;t disappoint them by picking<br/>\nsomething that&#39;s expensive but impersonal.<br/>\n       Finally, please understand that this isn&#39;t meant to imply that you<br/>\nshouldn&#39;t give to those who need help. Not everyone in our world is<br/>\nblessed with the abundance that so many of us have. And the less<br/>\nfortunate would can use your gift. If you can afford to, please<br/>\nparticipate in Angel Tree, the Salvation Army kettles or other programs<br/>\nto help those who struggle. If you&#39;re really in the holiday spirit you&#39;ll<br/>\nfeel much better giving that new sweater to a poor child rather than your<br/>\nAunt Edna.<br/>\n       Nor is this meant to imply that you should ignore the holidays.<br/>\nThis is a wonderful time of year. My hope is that you&#39;d make the most of<br/>\nyour resources and bring happiness to the people who matter in your life.<br/>\n       Here&#39;s to a wonderful holiday for everyone. Hopefully your holiday<br/>\nwill be filled with joy and wonder.<br/>\n____________<br/>\n<br/>\nGary Foreman has worked as a Certified Financial Planner and currently<br/>\nedits The Dollar Stretcher website &lt;www.stretcher.com/save.htm&gt; You&#39;ll<br/>\nfind hundreds of free articles to help you save time and money. Visit<br/>\nToday!<br/>\n<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/tagj.\">http://dl.www.juno.com/get/tagj.</a></div>","specialLinks":[]}],"prevTopicId":14359,"nextTopicId":14336}}