{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Update:  Was Concerns about how my son treats my daughter AND Nursing","postDate":"1329951226","msgId":65859,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4QTEyRTA2LTM0MEUtNDE1Ni05OTYxLTU2MTgyMkU1MUI4M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGppM3BlZitvcnQxQGVHcm91cHMuY29tPg==","referencesHeader":"PGppM3BlZitvcnQxQGVHcm91cHMuY29tPg=="},"prevInTopic":65857,"nextInTopic":0,"prevInTime":65858,"nextInTime":65860,"topicId":65843,"numMessagesInTopic":0,"msgSnippet":"-=-*** Will you take your cues from them if you want them to be quiet at a funeral? If you re going to a wedding, will you wait to see whether they want to","messageBody":"<div id=\"ygrps-yiv-1863902491\">-=-*** Will you take your cues from them if you want them to be quiet at a funeral? If you&#39;re going to a wedding, will you wait to see whether they want to stick their fingers in the cake frosting before the bride cuts it?***<br/>\n<br/>\n-=-Yes. I would. I think it&#39;d be a good opportunity to share my principle of respect. :-) I-=-<br/>\n<br/>\nI think that&#39;s a bad time to share your principle of respect for your children.<br/>\n<br/>\nI think that&#39;s the time to show respect for the dead, for the bereaved, for the bride&#39;s one single special day, for her groom, and their parents.<br/>\n<br/>\nIt&#39;s respectful of children to help them behave in ways of which they can be proud, and in ways that cause others to appreciate them and be glad they&#39;re there.  You can talk about those things before you go to special events, and if you don&#39;t believe the children are prepared to cooperate, it might be more respectful not to take them.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252464818,"authorName":"Christina","from":"&quot;Christina&quot; &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Update:  Was Concerns about how my son treats my daughter AND Nursing","postDate":"1329948943","msgId":65857,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppM3BlZitvcnQxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFEODk4QTU5LTFFRDUtNDAzNy05QjlGLUU3NzI3M0RCQ0M1REBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":65850,"nextInTopic":65859,"prevInTime":65856,"nextInTime":65858,"topicId":65843,"numMessagesInTopic":0,"msgSnippet":"*** Will you take your cues from them if you want them to be quiet at a funeral?  If you re going to a wedding, will you wait to see whether they want to stick","messageBody":"<div id=\"ygrps-yiv-227751524\">*** Will you take your cues from them if you want them to be quiet at a funeral?  If you&#39;re going to a wedding, will you wait to see whether they want to stick their fingers in the cake frosting before the bride cuts it?***<br/>\n<br/>\nYes.  I would.  I think it&#39;d be a good opportunity to share my principle of respect.  :-)  I doubt my older two would even dream of doing this, but the 2 year old probably would, but I relate to the 2 year old as a 2 year old and help her navigate and understand the world around her as best as I can so if she was being loud at a funeral and didn&#39;t respond to my request for her to quiet down, then I would step out with her.  If she really wanted to stick her fingers in the wedding cake I&#39;d let her know she can&#39;t have that cake, but we can make cupcakes later and she can have at those. <br/>\n <br/>\n***But I think if you&#39;ve gotten to this point thinking that it&#39;s discipline and rules that cause quiet funerals and pristine wedding cakes, you probably can&#39;t imagine how a child could CHOOSE to &quot;be good.&quot;***<br/>\n<br/>\nYes!  This was the mentality I have had. A few months ago the idea that people are evil to the core and that children need a strong, authoritarian figure in their life to ensure they turn out well, began being challenged.  My story is much too long to share here, but it has been a very long journey of realizing how much I have internalized without questioning. <br/>\n <br/>\n***Well that&#39;s because no child can choose to be good if he doesn&#39;t have a choice.***<br/>\n<br/>\nExactly what I&#39;m beginning to understand and what I was trying to express in my original post today, however poorly.  I&#39;m still thinking through what our principles really are.  This all feels VERY wobbly and I find myself, questioning myself a lot, which I don&#39;t think is a bad thing, but can feel a little overwhelming sometimes.<br/>\n<br/>\nThanks a BUNCH!<br/>\nChristina.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Update:  Was Concerns about how my son treats my daughter AND Nursing","postDate":"1329936845","msgId":65850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFEODk4QTU5LTFFRDUtNDAzNy05QjlGLUU3NzI3M0RCQ0M1REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGppM2JnYitvMjJyQGVHcm91cHMuY29tPg==","referencesHeader":"PGppM2JnYitvMjJyQGVHcm91cHMuY29tPg=="},"prevInTopic":65848,"nextInTopic":65857,"prevInTime":65849,"nextInTime":65851,"topicId":65843,"numMessagesInTopic":0,"msgSnippet":"-=-I have been much too focused on the externals. I realized my goal was well-behaved kids at the cost of their individuality. Where they have probably felt","messageBody":"<div id=\"ygrps-yiv-1861632042\">-=-I have been much too focused on the externals. I realized my goal was &quot;well-behaved&quot; kids at the cost of their individuality. Where they have probably felt repression of feelings and heart. I really have had an image I wanted them to live up to and didn&#39;t even realize it. Basically, training them up in the way I thought they *should* go, instead of really looking at who they already are and taking my cues from there. -=--<br/>\n<br/>\nWill you take your cues from them if you want them to be quiet at a funeral?<br/>\nIf you&#39;re going to a wedding, will you wait to see whether they want to stick their fingers in the cake frosting before the bride cuts it?<br/>\n<br/>\nBut I think if you&#39;ve gotten to this point thinking that it&#39;s discipline and rules that cause quiet funerals and pristine wedding cakes, you probably can&#39;t imagine how a child could CHOOSE to &quot;be good.&quot;<br/>\n<br/>\nWell that&#39;s because no child can choose to be good if he doesn&#39;t have a choice.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":252464818,"authorName":"Christina","from":"&quot;Christina&quot; &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Update:  Was Concerns about how my son treats my daughter AND Nursing","postDate":"1329934667","msgId":65848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppM2JnYitvMjJyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFFMzU0NUEyLTNFRDgtNEQ0Ri05QjUyLUQ1RTNGMUVEQjlCOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":65845,"nextInTopic":65850,"prevInTime":65847,"nextInTime":65849,"topicId":65843,"numMessagesInTopic":0,"msgSnippet":"*** Free is a problem.  Please don t tell them they are free because you only have a little bit of freedom to give them.   You can give them a ton of","messageBody":"<div id=\"ygrps-yiv-972174663\">*** &quot;Free&quot; is a problem.  Please don&#39;t tell them they are &quot;free&quot; because you only have a little bit of freedom to give them.   You can give them a ton of options and choices and leeway, but they are as bound by law and social realities as anyone.***<br/>\n<br/>\nThank you. :-)  I don&#39;t think I&#39;m in danger of throwing all caution to the wind, yet.  I&#39;m much too neurotic for that, but anything is possible.  I am grateful that you &quot;typed&quot; that out because I am very much in the process of navigating through what really matters and what doesn&#39;t.  What IS my role as a mom?  I feel like everything is &quot;up in the air&quot;.   <br/>\n<br/>\n***Part of your job as a mom is to coach them to be well behaved as appropriate to the situation.  There&#39;s a large range of behavior, but don&#39;t say &quot;I don&#39;t want well-behaved kids.&quot;  That would do them a huge disservice if you backed off so far as to have no concern whatsoever whether they knew how to hold a fork in a restaurant, or make an introduction, put litter in a bin, or keep their hands off other people&#39;s freshly washed cars (and other things that come up in the course of daily life).***<br/>\n<br/>\nAbsolutely.  I should have qualified the statement, but was definitely caught up in the bliss of the &quot;moment&quot;.  I have been much too focused on the externals.  I realized my goal was &quot;well-behaved&quot; kids at the cost of their individuality.  Where they have probably felt repression of feelings and heart.  I really have had an image I wanted them to live up to and didn&#39;t even realize it.  Basically, training them up in the way I thought they *should* go, instead of really looking at who they already are and taking my cues from there.  <br/>\n<br/>\nThere are things that are really important...kindness, respect, etc...  However, those are to be genuine, not forced or superficial.  I am only at the beginning of this journey.  I have SO much to learn.  Thank you for your website and this forum.  For all of the time you and so many others on this list freely give.<br/>\n<br/>\nThanks for the link.  So much great stuff on there!<br/>\n<br/>\nChristina.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Update:  Was Concerns about how my son treats my daughter AND Nursing","postDate":"1329927769","msgId":65845,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFMzU0NUEyLTNFRDgtNEQ0Ri05QjUyLUQ1RTNGMUVEQjlCOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGppMmxxaitmM3JnQGVHcm91cHMuY29tPg==","referencesHeader":"PGppMmxxaitmM3JnQGVHcm91cHMuY29tPg=="},"prevInTopic":65844,"nextInTopic":65848,"prevInTime":65844,"nextInTime":65846,"topicId":65843,"numMessagesInTopic":0,"msgSnippet":"-=- I don t want well-behaved kids, I want free kids...I want them to be whole...loved and appreciated for who they already are. Thank you for helping me in","messageBody":"<div id=\"ygrps-yiv-1298992119\">-=- I don&#39;t want well-behaved kids, I want free kids...I want them to be whole...loved and appreciated for who they already are. Thank you for helping me in this transition that is truly saving us all. -=-<br/>\n<br/>\n&quot;Free&quot; is a problem.  Please don&#39;t tell them they are &quot;free&quot; because you only have a little bit of freedom to give them.   You can give them a ton of options and choices and leeway, but they are as bound by law and social realities as anyone.  <br/>\n<br/>\nPart of your job as a mom is to coach them to be well behaved as appropriate to the situation.  There&#39;s a large range of behavior, but don&#39;t say &quot;I don&#39;t want well-behaved kids.&quot;  That would do them a huge disservice if you backed off so far as to have no concern whatsoever whether they knew how to hold a fork in a restaurant, or make an introduction, put litter in a bin, or keep their hands off other people&#39;s freshly washed cars (and other things that come up in the course of daily life).<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\nBalance!  Don&#39;t swing to the far extreme.  Find the restful middle.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"CarenKH","from":"&quot;CarenKH&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Update:  Was Concerns about how my son treats my daughter AND Nursing","postDate":"1329922922","msgId":65844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppMzAxYSthN2c2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGppMmxxaitmM3JnQGVHcm91cHMuY29tPg=="},"prevInTopic":65843,"nextInTopic":65845,"prevInTime":65843,"nextInTime":65845,"topicId":65843,"numMessagesInTopic":0,"msgSnippet":"=-=Last night while Izzy was asking me about the new baby coming and how she wants to be able to be near me when I m in labor.  She says that she isn t afraid","messageBody":"<div id=\"ygrps-yiv-1515728594\">=-=Last night while Izzy was asking me about the new baby coming and how she wants to be able to be near me when I&#39;m in labor.  She says that she isn&#39;t afraid of being with me.  We, (Darius, Izzy, and I), got into a long talk where they asked some questions and even shared their fears.=-=<br/>\n<br/>\nI&#39;m so glad things are shifting for you!<br/>\n<br/>\nWhen I was pregnant with Seth, Evan and I watched some birth videos that my midwife provided, and we watched PBS&#39; Nova - Miracle of Life. (which has a new name, apparently: Life&#39;s Greatest Miracle)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.pbs.org/wgbh/nova/body/life-greatest-miracle.html\">http://www.pbs.org/wgbh/nova/body/life-greatest-miracle.html</a><br/>\nI was ready to fast-forward through any parts that made him uncomfortable, but he watched everything. There are TONS more videos and resources available now! <br/>\n<br/>\nEvan was 6 at the time, and he was (and still is!) very sensitive to seeing blood, bodily fluids, seeing people in pain, etc. We had talked about him being at the birth, and seeing those videos helped him decide to be in the same house, but not the actual room. I lined up a friend to be with him while I was in labor. We had a homebirth, which allowed us to be really flexible about who was there - at any time, Evan could have come into the room if he chose to. He came in right after Seth was born, and cuddled right next to us.<br/>\n<br/>\nSweet memories!<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":252464818,"authorName":"Christina","from":"&quot;Christina&quot; &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Update:  Was Concerns about how my son treats my daughter AND Nursing","postDate":"1329912467","msgId":65843,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGppMmxxaitmM3JnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":65844,"prevInTime":65842,"nextInTime":65844,"topicId":65843,"numMessagesInTopic":0,"msgSnippet":"Thanks so much to all who have shared their wisdom.  I ve been reading both here and on the blog and waiting and watching.  Even just in the past few days I","messageBody":"<div id=\"ygrps-yiv-1107095718\">Thanks so much to all who have shared their wisdom.  I&#39;ve been reading both here and on the blog and waiting and watching.  Even just in the past few days I have seen an &quot;opening&quot; with all of us.  <br/>\n<br/>\nI had a really hard day on Monday.  Just personally wrestling with my anxieties.  Confronting my fears, but the kids didn&#39;t seem to notice.  They spent the whole day painting together.  I realized that we have been so task-oriented for so long.  Even though in my opinion we didn&#39;t do that much &quot;school&quot;, I think the kids have been burned out for a long time.  I think they have felt pressured and like they didn&#39;t have time to just be.  There was always something to do, somewhere to go.  We certainly haven&#39;t had a lot of time to just be together, doing things we enjoy.  We&#39;ve spent more time together the past few days, mostly painting and talking.  Last night while Izzy was asking me about the new baby coming and how she wants to be able to be near me when I&#39;m in labor.  She says that she isn&#39;t afraid of being with me.  We, (Darius, Izzy, and I), got into a long talk where they asked some questions and even shared their fears.  <br/>\n<br/>\nI&#39;ve noticed how much more patience Darius has been showing towards Izzy.  Darius asked me last night, &quot;Momma, what do you like about me?&quot;  I struggled to keep my composure.  Being pregnant, hormonal, and emotional enough these last few days, that about threw me over the tearful edge.  So I shared with him all the wonderful attributes I see in him.  <br/>\n<br/>\nI&#39;ve noticed a lot more laughter, a lot more of a &quot;lightness&quot; in the atmosphere, even some surprising helpfulness.  Monday was a very busy day for me.  A lot to do as far as household tasks.  They just stepped in and we all got it done so much more quickly than I would&#39;ve on my own and I didn&#39;t even ask.<br/>\n<br/>\nI&#39;m looking forward to making some monkey platters.  They are gonna so dig that!  That has also gotten me thinking of other ways to reflect my truly seeing each of them as individuals.  Other gifts I can give them to remind them that they are seen and known and appreciated just for being themselves.<br/>\n<br/>\nDespite all the anxiety and fears, these past couple days have been so encouraging and have reassured me that we are on the &quot;right track&quot;.  Ultimately, what difference does it make to raise perfectly well-behaved scholars, if we have no real depth of relationship?  I know what it was like to have to &quot;look&quot; a certain part.  I don&#39;t want that for my kids.  I don&#39;t want well-behaved kids, I want free kids...I want them to be whole...loved and appreciated for who they already are.  Thank you for helping me in this transition that is truly saving us all.  <br/>\n<br/>\nWith TONS of gratitude,<br/>\nChristina.</div>","specialLinks":[]}],"prevTopicId":65804,"nextTopicId":65879}}