{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: 2223 -- the god thread","postDate":"1029007767","msgId":40616,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5N0FERTE3LjEyOTIlbmVkdmFyZUBudHBseC5uZXQ+","inReplyToHeader":"PDEwMjg5NTc0NTcuMTM2Ny4xMTAzMS5tMTNAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":40615,"nextInTime":40617,"topicId":40616,"numMessagesInTopic":0,"msgSnippet":"on 8/10/02 1:30 AM, Unschooling-dotcom@yahoogroups.com at ... Ned carries on::: Who knew that this was a religion group....? Well, so be it. I ll give it a ","messageBody":"<div id=\"ygrps-yiv-878016524\">on 8/10/02 1:30 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Message: 11<br/>\n&gt; Date: Sat, 10 Aug 2002 03:04:23 -0000<br/>\n&gt; From: &quot;gruvystarchild&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\n&gt; Subject: christianity<br/>\n&gt; <br/>\n&gt; &quot;Christianity comes from Christ, religion is man made.&quot;<br/>\n<br/>\n </span></blockquote>Ned carries on:::<br/>\n<br/>\nWho knew that this was a religion group....? Well, so be it. I&#39;ll give it a<br/>\nshot.   (it will tie in, just wait)<br/>\n<br/>\nThe Bible tells the story of the evolution of man&#39;s perception of, and<br/>\nrelationship to, the supernatural -- god -- the &quot;greater force&quot; behind<br/>\nworldly things, and the spiritual life, so to speak. &quot;It&#39;s all in God&#39;s<br/>\nhands,&quot; as they(we)<br/>\n say.<br/>\n<br/>\nEarly on, man desperately needed explanations for things that were, and<br/>\nstill often are, beyond our comprehension.<br/>\n<br/>\nFaced with often overwhelming natural forces, we imagine an all powerful<br/>\nspirit that controls the world, indeed, the universe, and in the process,<br/>\ncontrols our puny existence.<br/>\n<br/>\nEarly &quot;gods&quot; were the very forces of nature...Zeus, Mars, etc. There were<br/>\ngraven images of animals, tree worshippers, sacrifices (murders) to show our<br/>\nfear of the forces of &quot;heaven.&quot; Kings became gods to their people.<br/>\n<br/>\nHumans have, is seems, always had a need to ascribe anthropomorphic<br/>\nqualities and motives to the forces of nature and to the nether world and to<br/>\nthe firmament. Thus, some gave their god a male human form and placed &quot;him&quot;<br/>\nin the heavens. &quot;He&quot; was to be the good (god) guy who would protect them, if<br/>\nthey obeyed certain rules. And to explain all the &quot;bad&quot; stuff that happens,<br/>\nthey created another guy (bad guy) and he lived, they were sure, underneath<br/>\neverything.....in Hell.<br/>\n<br/>\nAll this imagery has been incredibly useful for financial institutions such<br/>\nas churces. The threat of Hell and damnation, along with the promise of<br/>\nsomeday sitting on the knee of a benevolent &quot;creator&quot; comprise the twin<br/>\nenticements for supporting a huge corps of therapists called clergy. (Hmm,<br/>\nsounds like what the public schools do to create their brand of conformity,<br/>\n&quot;Sit still and be quiet, and you&#39;ll get As; but if you don&#39;t we&#39;ll drug you<br/>\ninto a stupor)<br/>\n<br/>\nBut the Bible goes further, because man is still evolving. Man&#39;s view of<br/>\n&quot;god&quot; changed over the centuries to a more and more enlightened idea. That<br/>\nadvanced thinking is described in the New Testament. For my money, Jesus<br/>\n(and a few others, like Buddha) led the way out of the era of nature and<br/>\nanimal worship into an era in which god is seen simply as man&#39;s highest view<br/>\nof himself. Jesus called it Love. Christianity changed everything, or, as<br/>\nRen said, <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; turn[ed} the status quo on it&#39;s head.&lt;&lt;<br/>\n </span></blockquote>Religion has become a personal thing, instead of a group thing, even though<br/>\nmany people still enjoy group rituals and celebrations or their &quot;truth.&quot;<br/>\nThere&#39;s even a joke, &quot;Hey, I saw God, and she&#39;s black !&quot;  -- talk about<br/>\nupsetting the apple cart...<br/>\n<br/>\nSo, today, we don&#39;t grovel in front of a carved statue of a beast, we don&#39;t<br/>\npray (beg) to an unknowable &quot;man&quot; in the sky, but we grow (if we can) in an<br/>\nunderstanding and demonstration of our own highest ethics and best<br/>\nattributes. If we read the Bible (which I used to but don&#39;t these days) we<br/>\nlearn that we are created in the image and likeness of God.<br/>\n<br/>\nWhat &quot;good news&quot; (the meaning of &quot;gospel&#39;) that is!  If we can believe that,<br/>\nthen we know that we are not born as &quot;sinners,&quot; but with all the qualities<br/>\nwe need in order to perfect our lives. It means there is no need to beg for<br/>\nfavors, no need to pay for forgiveness, no need to believe that anyone or<br/>\nanything has power over us or is god&#39;s go-between. (Martin Luther drew that<br/>\nline in the sand for us, saying, in effect, that we could speak driectly to<br/>\ngod, if we wanted to. Wow, what a breakthrough)<br/>\n<br/>\nWe have examples of people in several cultures coming to similar<br/>\nconclusions. Man has evolved much since the days of cow worship and man<br/>\nworship. Today, there need be no intermediary (priest) between man and<br/>\nwhatever we view as a creative/benevolent spirit, or god.<br/>\n<br/>\n The same evolution took place in nations...America was founded on the still<br/>\nrelatively new (in 1750) idea that the individual is more important than the<br/>\ngroup, and our government was viewed by the framers as the mechanism to<br/>\nprotect individual citizens from harm, whether from other individuals or<br/>\ngroups.  While government schooling is the last vestige of socialist ideas<br/>\n(top-down control, or subsumption of individuals to the group),<br/>\nhomeschooling is helping our country to overcome that oppression and evolve<br/>\nto a higher level of self- and universal awareness.<br/>\n<br/>\nNed Vare</div>","specialLinks":[]}],"prevTopicId":40615,"nextTopicId":40618}}