{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":401964735,"authorName":"Mog D","from":"&quot;Mog D&quot; &lt;yarnmama@...&gt;","profile":"yarnmama@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: girlfriend trouble","postDate":"1341929678","msgId":68122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0aGRjZSs3dWcxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI2M0FGMjIxLTgyNjctNDlFQy1CRTIzLUFFRUNBQkRDOERCN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":68116,"nextInTopic":0,"prevInTime":68121,"nextInTime":68123,"topicId":68114,"numMessagesInTopic":0,"msgSnippet":"Thank you Sandra.  I needed that. They do normally spend most of their time at the local park or at Scouts, where they met.  She has actually only been to the","messageBody":"<div id=\"ygrps-yiv-807684271\">Thank you Sandra.  I needed that.<br/>\n<br/>\nThey do normally spend most of their time at the local park or at Scouts, where they met.  She has actually only been to the house a couple of times and then only to wait for him while he got ready to go out.  I think that is what I found most frustrating about the whole conversation yesterday because to me it seems a mountain out of a molehill, however they will not accept my word that she has only been in a couple of times and never for longer than a few minutes.<br/>\n<br/>\nOn the other hand I know nothing about this girl&#39;s situation and I do realise that they have a duty of care towards this girl.  I just wish they had been more willing to engage with me, so that maybe we could work together for the benefit of both the children.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-And as far as anything else goes this is a boy who agonized for a good couple of weeks over when and how to even kiss his girlfriend never mind anything else.-=-<br/>\n&gt; <br/>\n&gt; So your son is a nice young man and a responsible person.<br/>\n&gt; <br/>\n&gt; Foster parents take on a hard job, and though they might be compensated some, financially, it&#39;s not much.  But if they lose their approval to be foster parents, they can&#39;t do it anymore whether they were doing it out of service or need of money either one.<br/>\n&gt; <br/>\n&gt; So their responsibility to keep teenaged girls safe is very, very real.<br/>\n&gt; <br/>\n&gt; Your &quot;right&quot; to let your son entertain in his own bedroom is much less real.<br/>\n&gt; <br/>\n&gt; If you want to allow the girl to continue to visit, find a different place for them to be.  Maybe they can go for a walk, or meet in public places (arcade, mall, park).<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] girlfriend trouble","postDate":"1341908041","msgId":68116,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2M0FGMjIxLTgyNjctNDlFQy1CRTIzLUFFRUNBQkRDOERCN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGp0ZnU3NitiMWJ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGp0ZnU3NitiMWJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":68115,"nextInTopic":68122,"prevInTime":68115,"nextInTime":68117,"topicId":68114,"numMessagesInTopic":0,"msgSnippet":"-=-And as far as anything else goes this is a boy who agonized for a good couple of weeks over when and how to even kiss his girlfriend never mind anything","messageBody":"<div id=\"ygrps-yiv-577664307\">-=-And as far as anything else goes this is a boy who agonized for a good couple of weeks over when and how to even kiss his girlfriend never mind anything else.-=-<br/>\n<br/>\nSo your son is a nice young man and a responsible person.<br/>\n<br/>\nFoster parents take on a hard job, and though they might be compensated some, financially, it&#39;s not much.  But if they lose their approval to be foster parents, they can&#39;t do it anymore whether they were doing it out of service or need of money either one.<br/>\n<br/>\nSo their responsibility to keep teenaged girls safe is very, very real.<br/>\n<br/>\nYour &quot;right&quot; to let your son entertain in his own bedroom is much less real.<br/>\n<br/>\nIf you want to allow the girl to continue to visit, find a different place for them to be.  Maybe they can go for a walk, or meet in public places (arcade, mall, park).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] girlfriend trouble","postDate":"1341907824","msgId":68115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDE5MDc4MjQuMjUyMTcuWWFob29NYWlsTmVvQHdlYjEyMjUwNi5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGp0ZnU3NitiMWJ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGp0ZnU3NitiMWJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":68114,"nextInTopic":68116,"prevInTime":68114,"nextInTime":68116,"topicId":68114,"numMessagesInTopic":0,"msgSnippet":"***...proceeded to tell me that I was not to allow the girl into my son s room and that if I did she would inform social services and the police, she refused","messageBody":"<div id=\"ygrps-yiv-973054403\">***...proceeded to tell me that I was not to allow the girl into my son&#39;s room and that if I did she would inform social services and the police, she refused to hear our perspective on the situation and insinuated that it was our (underage) son and us that were in the wrong.***<br/>\n<br/>\n<br/>\nYou can&#39;t prevent kids from being sneaky if you ban things.<br/>\n<br/>\nMy priority has always been my own child&#39;s peace and happiness.  I did a lot of things to protect relationships with kids who had strict or terrible parents.  I can only say that it can be touchy and tricky to navigate that minefield.  One day the kid with the strict parents will need to do what they need to do to get what they want and that generally results in fights and struggles between that/those parent/s and kid.  Our home has been a sanctuary to many of those kids but it hasn&#39;t been easy.  Everyone loses in those battles, the kids and the parents, and sometimes your own kid.   <br/>\n<br/>\nIt will help if you know the laws about underage sexual relationships.  It will also help to make sure that if they are having sex, that they have birth control, make sure that your son has condoms in his room or easily accessible.  While you certainly can&#39;t tell the other parents what they can and can&#39;t do with their own kid, you can be a friend and an ear and a resource for that kid.<br/>\n<br/>\nSometimes you need to let things run their course and take each little event as it comes.  I learned early on that it&#39;s better to not engage certain other parents in any kinds of conversations because to do so would create more animosity than it did any sort of positive good.  Smile and play nice, but keep your distance.  Introducing yourself was a very good thing.  In hindsight, I would have kept my address a secret from some parents, but I don&#39;t always think about these things when I try to assume positive intent.<br/>\n<br/>\nRight now, the positive upside is that the parents haven&#39;t banned their daughter from visiting your home.  You might encourage your son to visit their home and be kind and get to know the parents a little so that they can relax.  It&#39;s very possible they&#39;ve never been a parent to a teen and have never gone through the relationship thing with a kid living in their home.  Some parents simply are not at all prepared for that and will forcibly avoid dealing with it in any sort of open or healthy way.  One way to do that is by overreacting, such as what happened.  You can&#39;t change the way they react to their teen daughter engaging in sexual anything, even if they aren&#39;t, that is what the other parents are thinking and reacting to.  This is especially true if they are at all religious and into the &quot;purity&quot; thing.<br/>\n<br/>\nBe as kind and gentle as possible and encourage your son to do the same even if it&#39;s frustrating or irritating.  That girl will be 18 in 2 years.  She&#39;ll be dealing with a lot between now and then, so be a soft landing for her and your son and protect that little bit of whatever they have as best as you can.  My daughter&#39;s first relationship lasted for about 2 yrs while dealing with an awful over reactive parent.  I&#39;ve kept a lot of secrets.  I don&#39;t regret any of it.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":401964735,"authorName":"Mog D","from":"&quot;Mog D&quot; &lt;yarnmama@...&gt;","profile":"yarnmama@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"girlfriend trouble","postDate":"1341881382","msgId":68114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp0ZnU3NitiMWJ1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":68115,"prevInTime":68113,"nextInTime":68115,"topicId":68114,"numMessagesInTopic":0,"msgSnippet":"Ok, so I m not 100% sure that this is altogether an unschooling problem, but I know that here I ll get straight, sensible and unbiased ideas and opinions. ","messageBody":"<div id=\"ygrps-yiv-1087305812\">Ok, so I&#39;m not 100% sure that this is altogether an unschooling problem, but I know that here I&#39;ll get straight, sensible and unbiased ideas and opinions.<br/>\n<br/>\nAbout a month ago my son (3 months shy of 16) started a relationship with a girl (16).  This girl is in the care of rather strict foster parents.  Someone has told these foster carers that my son has been &quot;sneaking&quot; her into his bedroom, they apparently came round and harangued my son (although the foster mother denies this) anyway when the rest of us got back, my son told me what had happened and I went with him to their house to discuss it.<br/>\n<br/>\nWhen we got there, I introduced myself (she didn&#39;t bother) we were shown into their front room and she (the foster mother) proceeded to tell me that I was not to allow the girl into my son&#39;s room and that if I did she would inform social services and the police, she refused to hear our perspective on the situation and insinuated that it was our (underage) son and us that were in the wrong.<br/>\n<br/>\nWe have three much younger children one of whom has suspected aspergers so when our eldest has friends over we let him entertain them in his room so he gets some peace and quiet.  There are always other people around and there is certainly no &quot;sneaking&quot; except as far as getting past his siblings is concerned. And as far as anything else goes this is a boy who agonized for a good couple of weeks over when and how to even kiss his girlfriend never mind anything else.<br/>\n<br/>\nSorry this is so long, I&#39;m all at sea with this situation an I&#39;m not sure how to handle it, I could really so with some suggestions and ideas.<br/>\n<br/>\nMorag</div>","specialLinks":[]}],"prevTopicId":68106,"nextTopicId":68117}}