{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":86266556,"authorName":"J & D Fields","from":"J & D Fields &lt;bluebell@...&gt;","profile":"waldorfmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] reguarding ADD post... & Special diets","postDate":"1079094301","msgId":19016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDNzcxNjRELkNFQjUlYmx1ZWJlbGxAbWFpbmUucnIuY29tPg==","inReplyToHeader":"PGMycmJsMis4cGpzQGVHcm91cHMuY29tPg=="},"prevInTopic":19009,"nextInTopic":0,"prevInTime":19015,"nextInTime":19017,"topicId":19009,"numMessagesInTopic":0,"msgSnippet":"I agree that Feingold can turn kids into neurotic eaters! It happened to my dd! However, when it comes to the allergies/ food sensitivities I think eliminating","messageBody":"<div id=\"ygrps-yiv-697815424\">I agree that Feingold can turn kids into neurotic eaters! It happened to my<br/>\ndd!<br/>\n<br/>\nHowever, when it comes to the allergies/ food sensitivities I think<br/>\neliminating the allergen can help a lot (I&#39;m not specifically referring to<br/>\nADD). I saw my dd&#39;s behavoiur get so explosive that people&#39;s reactions to<br/>\nher were affecting her self-esteem. This really concerned me. Also she was<br/>\nso HIGHLY sensitive to sounds and textures that it was really affecting her<br/>\ndaily life. Since being off soy she is no longer covering her ears half the<br/>\nday and freaking out because the seam of her sock is off by half a<br/>\nmillimeter. <br/>\n<br/>\nI don&#39;t think its the answer for all kids but when your child seems *angry*<br/>\nmost of the time its possible its something in their environment.<br/>\n<br/>\n:)<br/>\nJessie</div>","specialLinks":[]},{"userId":99936689,"authorName":"mozafamily","from":"&quot;mozafamily&quot; &lt;mozafamily@...&gt;","profile":"mozafamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"reguarding ADD post... & Special diets","postDate":"1079063010","msgId":19009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMycmJsMis4cGpzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":19016,"prevInTime":19008,"nextInTime":19010,"topicId":19009,"numMessagesInTopic":0,"msgSnippet":"My son will be 6 next week and he went through a time from about 4 1/2 to 5 when we went to a very highly recommended private preschool, WRONG - this teacher","messageBody":"<div id=\"ygrps-yiv-563064006\">My son will be 6 next week and he went through a time from about 4 <br/>\n1/2 to 5 when we went to a &quot;very highly recommended&quot; private <br/>\npreschool, WRONG - this teacher had all these ideas that just <br/>\nbecause my child refused to do exactly what the other kids were <br/>\ndoing or what she told them to do, or sat in his seat properly, or <br/>\nhis eyes wondered off his page, etc etc etc that he most definately <br/>\nHAD to be ADD and I should get him professional treatment(ie drugs <br/>\nor reconditioning) for his own benefit, of course. That was a <br/>\nnightmare for me but in the end it was also one of my biggest <br/>\neyeopeners about how the public system mostly works. Now I am lucky <br/>\nenough to know that my child is wonderful healthy and as normal as <br/>\nneed be! <br/>\nUnschooling (or whatever you want to call it) seems to deminish most <br/>\nof the qualities of this ADD/ADHD disease, and now I truely believe <br/>\nthat it is only another label or excuse or money-making idea and not <br/>\nsomething that truely deserves our taking hold of it as a real <br/>\nthing. That being said I do believe that allergies are real and if <br/>\nyou have concern with a certain food you could try and remove that <br/>\nfood from your child&#39;s diet and see if the situation improves for <br/>\nyou. I don&#39;t recommend the feingold diet because it will drive <br/>\neveryone more insane than needs be. I believe also that what may be <br/>\nseen as an alergy is actually a deficiency of something needed to <br/>\nproperly digest the food in question (like needing lactace to digest <br/>\nthe milk sugar lactose, like in the suppliment lactaid I believe) So <br/>\nsometimes a well balanced diet can make a difference. It is very big <br/>\ndebate because allergy people say that you crave things that you are <br/>\nallergic to, but some people also say that you crave things that <br/>\ngive you the vitamins and minerals your body naturally need. I let <br/>\nmy son eat what he wants and I try to give him as healthy of options <br/>\nas possible, but he also does help me do the shopping as well. <br/>\nWe did several horrible weeks of allergy trials with no difference <br/>\nin behavior, other than being grouchier than normal because he <br/>\ncouldn&#39;t eat the foods that he preferred. I wouldn&#39;t really <br/>\nrecommend it to anyone, they do have professional allergy tests that <br/>\nI think would be less excrutiating. We also tried some of <br/>\nthe &quot;Natural suppliments&quot; some of them made him sick or &quot;wired&quot; and <br/>\na couple of them perhaps helped a tiny bit but were hard to get him <br/>\nto take because he still refuses to take tablets and notices the <br/>\ntaste of drops in anything! I believe the protein suppliments did <br/>\nthe most good and I still do make sure breakfast is a high protein <br/>\nmeal, but otherwise we didn&#39;t get any &quot;miracle&quot; results, and we <br/>\ntried a lot of different things, spending a lot of $ and lots of <br/>\ntime reading books on the subject. <br/>\nI think that &quot;letting go&quot; of my perfect parental expectaions of my <br/>\nson has helped me the most to get past the ADD thing. If he needs to <br/>\nrun or be active then try and find a way for him to do that in an <br/>\nacceptable way, like sports or jogging together, walking the dog, <br/>\netc. I now am really starting to believe that most of the time my <br/>\nson does know what he needs and I simply need to help him get it, or <br/>\nstay out of his way while he gets it himself.</div>","specialLinks":[]}],"prevTopicId":19015,"nextTopicId":18975}}