{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Hello","postDate":"1339633245","msgId":67649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyYmFvdCthaGN2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzk1OTc2MTUuODM0MjcuWWFob29NYWlsTmVvQHdlYjg0NTAyLm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":67648,"nextInTopic":0,"prevInTime":67648,"nextInTime":67650,"topicId":67628,"numMessagesInTopic":0,"msgSnippet":"... That s because the so called symptoms are nothing more than a listing of observations. If your child behaves in a certain way, whatever that way might","messageBody":"<div id=\"ygrps-yiv-803400568\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Laura Selecman &lt;poptartcutie@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;<br/>\n&gt;  Oppositional Defiant Disorder.Â Â  Everything you read about ODD, he has every symptom.Â  <br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s because the so called &quot;symptoms&quot; are nothing more than a listing of observations. <br/>\n<br/>\nIf your child behaves in a certain way, whatever that way might be, it would be *impossible* for the behaviour not to match a description of the behaviour! <br/>\n<br/>\nSee my free e-book &quot;How The American Psychiatric Association Tried To Scam Me And What I Did About It&quot;:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parental-intelligence.com/HTAPATTSM.pdf\">http://www.parental-intelligence.com/HTAPATTSM.pdf</a><br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Hello","postDate":"1339626372","msgId":67648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyYjQyNCtxcnAwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzk1OTc2MTUuODM0MjcuWWFob29NYWlsTmVvQHdlYjg0NTAyLm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":67640,"nextInTopic":67649,"prevInTime":67647,"nextInTime":67649,"topicId":67628,"numMessagesInTopic":0,"msgSnippet":"... ************** The trouble with being strict is that it sets active, sensitive kids up to behave in ways that are (or seem) aggressive and defiant. Try","messageBody":"<div id=\"ygrps-yiv-409253309\">Laura Selecman &lt;poptartcutie@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve tried to be strict with him because he has always had a problem with agression, and defiance that is very strong for his age<br/>\n </span></blockquote>**************<br/>\n<br/>\nThe trouble with being strict is that it sets active, sensitive kids up to behave in ways that are (or seem) aggressive and defiant. Try stepping back from those ideas and seeing a kid who has a lot of energy and needs a lot of direct attention and support. If he&#39;s not getting All the attention he needs he&#39;ll clamor for it and do it in very physical ways - like hitting people and breaking things and yelling at you. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;His doctor also feels as if he has<br/>\n&gt;  Oppositional Defiant Disorder<br/>\n<br/>\n </span></blockquote>If your goal is for a child to be accomodating and obedient and you try to impose that goal on a kid who is energetic, sensitive and needs a lot of attention, you&#39;ll see a person who is always in opposition to and defiant of your goals. <br/>\n<br/>\nWhat is your guy defying? Can you shift your expectations and goals so that whatever it is becomes a non-issue? For instance, if you want him to change clothes and he doesn&#39;t want to change, then he would seem defiant, but unless he&#39;s soaking wet or muddy, there&#39;s no real need to change clothes. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; he has ADHD and cannot focus and finish anything he starts even when he wants too<br/>\n </span></blockquote>**************<br/>\n<br/>\n&quot;Even when he wants to&quot; makes me wonder - are you trying to get him to focus and finish things he Doesn&#39;t want to? If so, it&#39;s your expectations which are the problem, not some deficit on his part. What sorts of things does he like doing but struggle to focus on - watching tv? Is the tv somewhere he can be active While watching? What else? Is he, maybe, trying to do things which are too difficult for him? Are you leaving him to do things on his own when what he wants is your attention? I&#39;m not saying there&#39;s no such thing as an attention deficit, but they&#39;re really rare - much more often the problem lies with adult expectations. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He is very loving and sweet but like I said, argues with everything...<br/>\n </span></blockquote>**********<br/>\n<br/>\nSuch as? Maybe you&#39;re not being clear, or are making the sorts of vague, unfounded statements which annoy children like &quot;you should put a coat on, it&#39;s cold&quot; when the child isn&#39;t cold. Listen more. Think about what he has to say. Maybe You&#39;re the one who is arguing about everything. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; tells me what to do<br/>\n<br/>\n </span></blockquote>How thoughtful of him to be clear about his needs and wishes! As much as you can, do what he wants, or work with him to find a compromise which works for both of you. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; is very disrespectful<br/>\n<br/>\n </span></blockquote>From His point of view, maybe you&#39;re the one who is disrespectful. <br/>\nHe tells you what he thinks, and you argue with him. He tells you what to do and you dismiss him. That&#39;s not very nice, from his perspective. How can you be kinder, more thoughtful, more respectful From His Point of View? How does the world look to a young child?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;and I have no time to really do anything else with the other 2<br/>\n<br/>\n </span></blockquote>So it probably sounds a little crazy to be told &quot;give him more attention&quot;! But if you start from the assumption that he needs more than he&#39;s getting and he&#39;s Going to try to get his needs met one way or another, then it&#39;s easier to actively plan to give him more time and attention proactively. And then, since he&#39;s not set up to have to clamor for attention, you actually have a little more control over your end of things - you get more choices, you get to be more thoughtful, and you&#39;ll be less stressed because you aren&#39;t running around putting out fires as it were. <br/>\n<br/>\nSo plan to include him all the time. If you&#39;re doing something with one child, find a way to help him feel like he has your attention, too. Touch him while you talk to someone else - or vice versa. Invite him where you are if you can&#39;t be where he is at the moment. Don&#39;t look for ways for him to do things by himself, look for ways to reassure him he&#39;s important to his mommy. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Hello","postDate":"1339608138","msgId":67640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGMDM5RjFELUE2M0QtNEIzOC1BN0Q3LTlCQzI3NTgyRUM1OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzMzk1OTc2MTUuODM0MjcuWWFob29NYWlsTmVvQHdlYjg0NTAyLm1haWwubmUxLnlhaG9vLmNvbT4=","referencesHeader":"PGpyOWljZStwNjhtQGVHcm91cHMuY29tPiA8anI5dmEzKzl0Z2tAZUdyb3Vwcy5jb20+IDwxMzM5NTk3NjE1LjgzNDI3LllhaG9vTWFpbE5lb0B3ZWI4NDUwMi5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":67635,"nextInTopic":67648,"prevInTime":67639,"nextInTime":67641,"topicId":67628,"numMessagesInTopic":0,"msgSnippet":"... The symptoms I read are also the symptoms of someone who is very angry: • Actively refuses to comply with majority s requests or consensus supported","messageBody":"<div id=\"ygrps-yiv-319559264\">On Jun 13, 2012, at 10:26 AM, Laura Selecman wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Everything you read about ODD, he has every symptom.  <br/>\n<br/>\n </span></blockquote>The symptoms I read are also the symptoms of someone who is very angry:<br/>\n<br/>\n\t• Actively refuses to comply with majority&#39;s requests or consensus supported rules<br/>\n\t• Performs deliberate actions to annoy others<br/>\n\t• Angry and resentful of others<br/>\n\t• Argues often<br/>\n\t• Blames others for his or her own mistakes<br/>\n\t• Has few or no friends or has lost friends<br/>\n\t• Is causing constant trouble at school<br/>\n\t• Spiteful or seeks revenge<br/>\n\t• Touchy or easily annoyed<br/>\n<br/>\nConventional ways of interacting with kids are hugely disrespectful. But it&#39;s hard for parents to notice because everyone acts that way towards kids. Some kids are more sensitive. Some kids need more attention. Put a kid like that in school and its a recipe for disaster.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; However, how can I (for lack of a better word) entertain him and keep him out of trouble<br/>\n<br/>\n </span></blockquote>By not thinking in terms of entertaining him and keeping him out of trouble. Think of it as meeting his needs. You may need to do some mental shifting. Maybe some regular one on one time with you or your husband. Do things he enjoys. Listen more than you talk.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; he has always had a problem with agression, and defiance that is very strong for his age.<br/>\n<br/>\n<br/>\n </span></blockquote>Have you read Ross Greene&#39;s The Explosive Child?<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/JCilMW\">http://amzn.to/JCilMW</a><br/>\n<br/>\nAnd Raising Your Spirited Child Rev Ed: A Guide for Parents Whose Child Is More Intense, Sensitive, Perceptive, Persistent, and Energetic by Mary Sheedy Kurcinka<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://amzn.to/IKBN4R\">http://amzn.to/IKBN4R</a><br/>\n<br/>\nI&#39;ve heard so may people say they finally get their child after reading it.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":346347940,"authorName":"Laura Selecman","from":"Laura Selecman &lt;poptartcutie@...&gt;","profile":"poptartcutie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Hello","postDate":"1339597615","msgId":67635,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzk1OTc2MTUuODM0MjcuWWFob29NYWlsTmVvQHdlYjg0NTAyLm1haWwubmUxLnlhaG9vLmNvbT4=","inReplyToHeader":"PGpyOXZhMys5dGdrQGVHcm91cHMuY29tPg==","referencesHeader":"PGpyOWljZStwNjhtQGVHcm91cHMuY29tPiA8anI5dmEzKzl0Z2tAZUdyb3Vwcy5jb20+"},"prevInTopic":67632,"nextInTopic":67640,"prevInTime":67634,"nextInTime":67636,"topicId":67628,"numMessagesInTopic":0,"msgSnippet":"Hello, I ve been on this list for about a year or more I think, and I have really enjoyed reading all the emails and getting alot of insight.  I have 3","messageBody":"<div id=\"ygrps-yiv-456127860\">Hello,<br/>\n<br/>\nI&#39;ve been on this list for about a year or more I think, and I have really enjoyed reading all the emails and getting alot of insight.  I have 3 children: a 5 1/2 yr old boy, a 4 1/2 year old girl, and a 2 yr old boy.  My husband and I would like to homeschool the kids and we really like the purpose behind unschooling.  We feel not only does it make sense but it would do best for our children because of their personalities.  The question(s) that I have are: Obviously my 2 oldest are very different even though close in age, but with my oldest boy I&#39;m not quite sure how to handle him.  He is very intelligent, aware, and receptive to everything going on but he has ADHD and cannot focus and finish anything he starts even when he wants too.  It causes him a lot of frustration.  I&#39;ve tried to be strict with him because he has always had a problem with agression, and defiance that is very strong for his age.  His doctor also feels as if he has<br/>\n Oppositional Defiant Disorder.   Everything you read about ODD, he has every symptom.  He is very loving and sweet but like I said, argues with everything, tells me what to do, is very disrespectful, and I have no time to really do anything else with the other 2.  I have tried to sit back and play with all of them and not be so &quot;on top&quot; of correcting him but when I do that, he hurts them more and yells and takes everything away from them.  As  far as unschooling goes, i know everything will happen when it is ready and every child learns at their own pace.  I&#39;m ok with that.  However, how can I (for lack of a better word) entertain him and keep him out of trouble since he has no self control, to lead him in the right direction? Because he does not lead himself?? Please help. Thank you<br/>\n <br/>\nLaura <br/>\n________________________________<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How do i help my family reconnect?","postDate":"1339588739","msgId":67632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyOXZhMys5dGdrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpyOWljZStwNjhtQGVHcm91cHMuY29tPg=="},"prevInTopic":67628,"nextInTopic":67635,"prevInTime":67631,"nextInTime":67633,"topicId":67628,"numMessagesInTopic":0,"msgSnippet":"... He s 3. It might help to get a book like what to expect from your 3yo or look for similar sorts of resources on line. ... He may need more robust","messageBody":"<div id=\"ygrps-yiv-863689789\">&quot;madh4ofwaipu&quot; &lt;megan2@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Our master (only just) 3s behavior has changed.<br/>\n<br/>\n </span></blockquote>He&#39;s 3. It might help to get a book like &quot;what to expect from your 3yo&quot; or look for similar sorts of resources on line. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;he&#39;s getting a bit rough<br/>\n<br/>\n </span></blockquote>He may need more robust playmates. Some kids need a good bit of rough and tumble play just to use up some of their natural energy, and boys somewhat more so than girls. It may well be that your regular activities no longer meet his needs very well - that&#39;s to be expected, really. Kids change as they get older and it helps a whole lot if you can change along with them. One big change which may be in order has to do with when and how you spend time with Nana. She&#39;s not up to the rigors of a busy, active, rough-and-tumble little boy, and that&#39;s not good for either of them. Better to find ways for your guy to get his big, physical needs met without someone telling him to settled down and come inside at every turn. Is there a time of day when he&#39;s more mellow? That&#39;s a better time to spend with grandma. Or it could be better to see her once or twice a week, not every day. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;sister likes to do a lot of craft work and listen to a lot of story&#39;s I read. She draws and does all that kind of stuff. I&#39;ve put down the same things for him to try do...but he&#39;s like a ball bouncing round the room....<br/>\n </span></blockquote>**************<br/>\n<br/>\nYup, kids are different. 3yos aren&#39;t 6yos, and there are personality differences, too. Get audio books for sister so you can give your busy, active kids some more direct attention and help him do what he wants to do. Look for a few things they can do together, but don&#39;t expect to sit back and read, expect to be right in the middle of the action, having fun along with them. Finger paints. Glue and glitter art (expect bubbah to cover himself with paint and glue!). Paper mache and collages. But don&#39;t expect both kids to love arts and crafts. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve even tried that throwing a ball while reading. He just gets angry<br/>\n<br/>\n </span></blockquote>Of course he does - he wants your attention and you&#39;re trying to tune him out. Play With him.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m tired with his out bursts<br/>\n<br/>\n </span></blockquote>You didn&#39;t really describe any outbursts, so I&#39;m not sure what you mean. You have two kids, three years apart in age, with somewhat different needs - and from your description you&#39;re trying to maintain a kind of status quo. That&#39;s your mistake. You need to adapt to your growing, changing child&#39;s needs. Maybe it would help to scrap your Whole regular schedule and start fresh - take a month holiday from the play center and grandma and see where the natural ups and downs of the day are and start to build a new routine around those. Make more individual play dates for your kids rather than the play center. Meet grandma at the park and send her home when she gets cold, or meet her for lunch or something. But mostly you need to shift your expectations - whatever life you had with one child, or a child and infant, that&#39;s over. Now you have the life of a mother of two kids who want different things, and it&#39;s time to adapt.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":474398264,"authorName":"madh4ofwaipu","from":"&quot;madh4ofwaipu&quot; &lt;megan2@...&gt;","profile":"madh4ofwaipu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"How do i help my family reconnect?","postDate":"1339575502","msgId":67628,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpyOWljZStwNjhtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":67632,"prevInTime":67627,"nextInTime":67629,"topicId":67628,"numMessagesInTopic":0,"msgSnippet":"Our master (only just) 3s behavior has changed. There have been so many changes in his life we are not surprised! He and his older sister decided to move out","messageBody":"<div id=\"ygrps-yiv-2118010033\">Our master (only just) 3s behavior has changed. <br/>\nThere have been so many changes in his life we are not surprised!<br/>\n<br/>\nHe and his older sister decided to move out into their own room being &quot;big kids now&quot;. I still co sleep with him after his first waking and have always offered that he sleep back in the big bed.<br/>\n<br/>\n3s big sister now 6 is no longer aloud at playcentre (pc rules due to funding) so she goes to my Nana&#39;s in the retirement village beside the playcentre. <br/>\nHe refuses to do any activities at pc and will breastfeed till morning tea then sit with his little mates. I don&#39;t mind sitting on the couch with him as I read to any of the other kids who bring books to me. <br/>\nThis playcentre visit is only one morning a week. He seems keen to go and loves the swings and some painting activities.<br/>\n<br/>\nMy nana comes to our house every day from 4-6pm often longer on the weekend. She spends a lot of time with him and mostly he&#39;s very happy as she is totally focused on him. But with his behavior change I have to watch him as he&#39;s getting a bit rough and he&#39;s come close to knocking her over a few times. <br/>\nI also worry has he has a very close bond with my nana ( she&#39;s amazing!) but she 83 and not well. Two weeks ago she had a turn...her heart.. we just popped in to see her out of the blue and she looked terrible. I was shocked, so I&#39;m sure the kids were too.<br/>\n<br/>\nWe spend a lot of time outdoors...but with the temp change...there is no more water play ... Well they do at odd times but my nana just about has kittens seeing the kids play in the water and is freezing. He loves water play.<br/>\nOn fine days I aim for as much outdoor time as possibly. It can be a battle to get him outside sometimes as nana keeps saying its too cold...and it&#39;s not really. Nana often talks him into heading in after a short play.<br/>\n<br/>\nMaster 3s sister likes to do a lot of craft work and listen to a lot of story&#39;s I read. She draws and does all that kind of stuff. I&#39;ve put down the same things for him to try do...but he&#39;s like a ball bouncing round the room....I&#39;ve even tried that throwing a ball while reading. He just gets angry...so miss 6 is missing out on story time....so she is getting angry with him. Argh so torn! <br/>\n<br/>\nThe children&#39;s dad is now (after three years of working from home) working in town so leaves early comes home late...is tired...and is not there for the day. Dad is also very grumpy with working 3 other contracts late at night too. Dad is under a lot of pressure and I feel this has been the start of the bad feels in the house. But the contracts should be over in a month.<br/>\n<br/>\nOh and master 3 amazing little dude managed to work out how to go to the toilet on his own through all of this.<br/>\n<br/>\nI suppose there are so many other little changes in his little life too that i don&#39;t know about he&#39;s just struggling...so am I. I&#39;m tired with his out bursts...and with me getting tired he gets worse as I&#39;m worse as my focus on him becomes less. And im having out bursts too..I feel really bad not being able to be a steady rock, as I feel ...&quot;mew&quot; ...splat on the floor. <br/>\n<br/>\nId love some ideas How to help him and us through the changes....and still be a good mummy to his sister too.<br/>\nOur whole family needs to re connect...I even tried bringing everyone back to the family bed last night...oh dear....very restless night.<br/>\n<br/>\nThank you <br/>\nMegan</div>","specialLinks":[]}],"prevTopicId":67548,"nextTopicId":67651}}