{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Sandra&#39;s report on the conference (part 2)","postDate":"1029945383","msgId":41665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIwLjJiNzM3ODM2LjJhOTUxMjI3QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":41664,"nextInTime":41666,"topicId":41665,"numMessagesInTopic":0,"msgSnippet":" After that video","messageBody":"<div id=\"ygrps-yiv-535141876\">&lt;&lt;        Let us live vicariously through your experiences. Enlighten us, <br/>\nshare <br/>\nwith us. How was the conference you attended/presented at? &gt;&gt;<br/>\n<br/>\nAfter that video discussion I stood and talked with Kathy Ward and another <br/>\ncouple of people for a while, and that was really pleasant.<br/>\n<br/>\nAt lunchtime I went to the appointed place to meet with some people from the <br/>\nAlways Learning list for lunch.  Eight altogether, and it was perfect.<br/>\n<br/>\nThen Richard Prystowsky and I did our joint workshop, which is becoming a <br/>\ntradition.  This year we did &quot;Peaceful Parenting.&quot;<br/>\n<br/>\nBut here&#39;s the exciting part for me:<br/>\n<br/>\nFrank Smith was there, the author of The Book of Learning and Forgetting (and <br/>\nother books, including a new one about math-learning.<br/>\n<br/>\nA few years ago, Laura Derrick pressed me to read that book and I whimpered <br/>\nand she bought a copy and laid it on me and said READ.  She was right.  <br/>\n<br/>\nSo Frank Smith was the second speaker Saturday morning, part of the <br/>\nkeynote/intro stuff, and he was wonderful.  Spoke without notes, clearly, <br/>\nsimply, sincerely and directly.  I was mightily impressed.<br/>\n<br/>\nSo the weekend whizzed by, I played recorder with Carol Narigon in the talent <br/>\nshow, and later did a ballad with a singalong part (words calligraphed by me <br/>\nyears ago on a long paper banner, held by Pam Sorooshian&#39;s daughter Roxana <br/>\nwho knew the song, and her assistants), talked with lots of people, laughed, <br/>\nplayed...<br/>\n<br/>\nSunday spoke twice, went to lunch (already told that part, but I&#39;m coming to <br/>\na new aspect.<br/>\n<br/>\nWhen we were sitting to talk at lunch, Laura Derrick was just beaming.  She <br/>\nhad something to say.  It was this:  &quot;Frank Smith talked about you in his <br/>\nsession.&quot;<br/>\n<br/>\nAfter the initial presentation, there were two Frank Smith question/answer <br/>\nsessions, one on Saturday and one on Sunday at 9:15.  <br/>\n<br/>\nThe 9:15 was in the same room where I had spoken earlier.<br/>\n<br/>\nSomeone else in the lunch group (Meghan?  Pam Hartley?) had heard it too and <br/>\nsaid someone asked him what he had thought of my session and he said he had <br/>\nreally liked it, especially the bit about not defining &quot;science&quot; and <br/>\n&quot;history&quot; (or some such, and his sessions weren&#39;t taped so I can&#39;t double <br/>\ncheck).<br/>\n<br/>\nI hadn&#39;t even seen that he was in my session, which makes me think maybe <br/>\nthere were more than sixty people, or he was sitting behind someone bigger.<br/>\n<br/>\nAnd he mentioned me two other times in that session on his own, after the <br/>\ninitial question.<br/>\n<br/>\nSo that was pretty cool.<br/>\n<br/>\nWhen I was speaking with Richard I saw Frank Smith was in the audience!   We <br/>\nhad a turns-taking schedule and about twenty minutes in when I knew Richard <br/>\nhad a ten minute segment coming up, I went to refill my water, and get him an <br/>\nextra one.  While I was at the water table, Mr./Dr./Prof. whatever he is <br/>\nSmith rushed over to the table (not knowing, I guess, I was going to fill up <br/>\ntwo glasses and stall around anyway), and shook my hand VERY warmly and said <br/>\nhe wanted to tell me how much he enjoyed my unschooling talk, and I thanked <br/>\nhim and said I was flattered to hear he had mentioned me.  He kinda shrugged <br/>\nshyly and politely and we talked about him being in this session, and I went <br/>\non back.  <br/>\n<br/>\nHe left about 2/3 of the way through it, but that&#39;s fine because except for <br/>\nan early mention of Maslow&#39;s heirarchy of needs and people needing to feel <br/>\nsafe and secure in order to learn well, the rest wasn&#39;t about learning but <br/>\nabout parenting and family life.<br/>\n<br/>\nMy personal favorite type of homeschooling exchange is online bulletin <br/>\nboards, because people can get a variety of answers and some discussion on <br/>\nthose answers without leaving home.  I like writing because it can be used <br/>\ntwice.<br/>\n<br/>\nBut I know some people really like and need the visual and aural input of a <br/>\nlive speaker.  And the energy of that many homeschoolers (very many <br/>\nunschoolers in the case of the HSC conference) and their VERY fun kids all <br/>\naround is another kind of input that can give people months of wondrous <br/>\nconfidence.<br/>\n<br/>\nSo I think a conference can be a boost to unschooling confidence that&#39;s just <br/>\nnot available otherwise. <br/>\n<br/>\nConferences have an aspect that&#39;s like a party.  It can&#39;t be entirely <br/>\npredicted or guaranteed how the electricity of the combination of people will <br/>\nflow, but when it&#39;s good it&#39;s GREAT and when it&#39;s slow it&#39;s still an <br/>\nopportunity to hear a variety of in-person voices and see dads interacting <br/>\nwith their kids, and to see the vendors&#39; stuff in person and to see people&#39;s <br/>\neyes when they speak.<br/>\n<br/>\nAs parties go, this year&#39;s HSC conference was a bubbly happy one!!<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":41664,"nextTopicId":41659}}