{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: RUing my schooled 12 yr old step son","postDate":"1322780024","msgId":64040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiOTBobytmaGswQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpiN3IwcCtxczMxQGVHcm91cHMuY29tPg=="},"prevInTopic":64030,"nextInTopic":0,"prevInTime":64039,"nextInTime":64041,"topicId":64029,"numMessagesInTopic":0,"msgSnippet":"... **************** And he s in school. How s that working out for him? ... *********** Add to each of those phrases in school . Learning in school isn t","messageBody":"<div id=\"ygrps-yiv-1242222012\">&quot;Messyfish&quot; &lt;messy_fish@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I wonder that radical unschooling may not be a good idea for him. Are some children better off in school? My step son does not read yet. He will not do any activity/hobbie/interest by himself except watch tv.<br/>\n </span></blockquote>****************<br/>\n<br/>\nAnd he&#39;s in school. How&#39;s that working out for him? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; He does not learn things easily or quickly, nor remembers how to do things.<br/>\n </span></blockquote>***********<br/>\n<br/>\nAdd to each of those phrases &quot;in school&quot;. Learning in school isn&#39;t like real life learning. It&#39;s kind of like comparing playing around in the yard to training for a marathon and calling both &quot;running&quot;. <br/>\n<br/>\nUnschooling can work for any child, but not necessarily for every family. If you don&#39;t feel up to having this kid home, leave him in school. Don&#39;t set yourself up to resent him for ruining your life and family. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He loves interacting with people at all times and requires a huge amount of attention (it is very draining at times, bordering on &quot;special needs&quot;). He is always wanting to be with people.<br/>\n </span></blockquote>*******************<br/>\n<br/>\nIt totally possible to unschool with a kid like that. Lavish him with time and care and attention. Love him up and fill him to the brim. It will probably take a big mental shift on your part to do it. It&#39;s do-able, but not by every parent - but that being said you don&#39;t actually know if you have the personal resources to unschool him until you throw yourself into it wholeheartedly. I found I had more attention and listening, thoughtfulness and care in my than I ever knew. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; What would I have to do for a 12 yr old with &quot;learning difficulties&quot; (labelled by his school)<br/>\n </span></blockquote>****************<br/>\n<br/>\nDrop the label, to start with. See all the good, all the wonderful positive things about him and hold them in the front of your mind every time you look at him. Plan to spend hours and hours in his company, every day, talking and listening and multi-tasking with your toddler to help him feel welcome and loved and part of the family. Since he&#39;s very social, plan on getting out and visiting, finding people to spend time with, doing a lot of driving, perhaps, and problem solve ways to do that while also meeting your toddler&#39;s needs. Expect your whole life to change.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I feel he may be better off continuing in his small expat  school overseas, continuing to live with his mother. <br/>\n </span></blockquote>***************<br/>\n<br/>\nThen do that. Be firm with your husband that you don&#39;t have the resources to add a 12yo to your family. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] RUing my schooled 12 yr old step son","postDate":"1322753015","msgId":64030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2MzE2Njk5LTRBRDMtNDU3Mi1BRkRCLTFFQjZBODRBRDA1Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpiN3IwcCtxczMxQGVHcm91cHMuY29tPg==","referencesHeader":"PGpiN3IwcCtxczMxQGVHcm91cHMuY29tPg=="},"prevInTopic":64029,"nextInTopic":64040,"prevInTime":64029,"nextInTime":64031,"topicId":64029,"numMessagesInTopic":0,"msgSnippet":"Eek. Please, PLEASE don t use RUing on this list. Subject: \t[AlwaysLearning] RUing my schooled 12 yr old step son It matters.  It s like a wall between","messageBody":"<div id=\"ygrps-yiv-299302545\">Eek.<br/>\nPlease, PLEASE don&#39;t use &quot;RUing&quot; on this list.<br/>\n<br/>\n\tSubject: \t[AlwaysLearning] RUing my schooled 12 yr old step son<br/>\n<br/>\nIt matters.  It&#39;s like a wall between people.  Please use English without turning unschooling into a secret word.<br/>\n<br/>\nYou can&#39;t &quot;radically unschool&quot; a kid who&#39;s in school.  <br/>\n<br/>\nYes, some kids are better off in school.<br/>\n<br/>\nIf your step-son&#39;s interests and learning needs and mother are not ideal for radical unschooling, then yes, it might be better for him to stay in school and live with his mom and just visit you sometimes.<br/>\n<br/>\nIf having him there will keep you from providing the kind of life you want to create for your younger child, it might be better for him to stay where he is for most of the time.  If he doesn&#39;t read and is so schooled that deschooling would take a long time, and be made difficult by the parent arrangements, then if you were to be challenged about his not reading (and be blamed even though he&#39;s in school and 12 and isn&#39;t yet reading), it could affect your right to unschool the younger half-sibling.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":374082408,"authorName":"Messyfish","from":"&quot;Messyfish&quot; &lt;messy_fish@...&gt;","profile":"messy_fish","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"RUing my schooled 12 yr old step son","postDate":"1322741593","msgId":64029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpiN3IwcCtxczMxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":64030,"prevInTime":64028,"nextInTime":64030,"topicId":64029,"numMessagesInTopic":0,"msgSnippet":"We are radically unschooling our 3 year old. My husband would like to offer that my 12yr schooled step son come and live with us full time. I wonder that","messageBody":"<div id=\"ygrps-yiv-1471310125\">We are radically unschooling our 3 year old. My husband would like to offer that my 12yr schooled step son come and live with us full time. I wonder that radical unschooling may not be a good idea for him. Are some children better off in school? My step son does not read yet. He will not do any activity/hobbie/interest by himself except watch tv. He loves interacting with people at all times and requires a huge amount of attention (it is very draining at times, bordering on &quot;special needs&quot;). He is always wanting to be with people. He has been diagnosed with auditory processing disorder when he was young. He does not learn things easily or quickly, nor remembers how to do things. <br/>\nWe live in an isolated area. he does not know anyone his age here. The RU group we are begining to form  has young children. I feel he may be better off continuing in his small expat  school overseas, continuing to live with his mother. <br/>\nIs there a way RU could work for him? What would I have to do for a 12 yr old with &quot;learning difficulties&quot; (labelled by his school). I would like to know what you all think it might require before/if we suggest to him he can come and live with us. <br/>\nRegards,<br/>\nAnna.</div>","specialLinks":[]}],"prevTopicId":63928,"nextTopicId":64031}}