{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":2523757,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Life without Limits","postDate":"1034787160","msgId":46565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBINDMwMEtYRzJWVFFCQG10YTYuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":46564,"nextInTime":46566,"topicId":46565,"numMessagesInTopic":0,"msgSnippet":"... The styles that people prefer to read vary as widely as the styles that people write. I much prefer someone who just tells me what they think without","messageBody":"<div id=\"ygrps-yiv-106239240\">----------<br/>\n<blockquote><span title=\"ireply\"> &gt;From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt;Subject: [Unschooling-dotcom] Digest Number 2490<br/>\n&gt;Date: Wed, Oct 16, 2002, 3:05 AM<br/>\n&gt;<br/>\n<br/>\n&gt; Thanks for all your replies, I do enjoy discussing this and I do have a lot<br/>\n&gt; to digest. I  feel quite comfortable with most of the ideas. I do however<br/>\n&gt; find some of the responses (not only to me) on this group harsh,<br/>\n&gt; judgemental and aggressive. I do not understand this, since I would think<br/>\n&gt; people that so strongly believe in this style of parenting would be far<br/>\n&gt; more helpful to help other people in transition (like myself) to understand<br/>\n&gt; what unschooling is about. I imagine some people might be turned off by<br/>\n&gt; individual aggressive replies rather than the philosophy.<br/>\n<br/>\n </span></blockquote>The styles that people prefer to read vary as widely as the styles that<br/>\npeople write. I much prefer someone who just tells me what they think<br/>\nwithout frills or hand-patting, some much prefer an extremely gentle<br/>\napproach.<br/>\n<br/>\nMy writing style (says the writer) is not something that I am willing (or<br/>\npossibly able) to change. I like my writing style. It&#39;s me. Many others like<br/>\nit, too, but that&#39;s just a side benefit. My writing is one of the most pure<br/>\nparts of Who I Am. I&#39;d rather get into physical self-mutilation if I were<br/>\ngoing to start cutting up my Self.<br/>\n<br/>\nIn a medium where our writing is all we know of each other (excepting a few<br/>\nof us who have met a few others of us in real life) I believe it&#39;s wise to<br/>\nget used to reading the message and not critiquing the style of the<br/>\nmessenger. Even if I think somebody is whining or cloying or coddling in<br/>\ntheir style, I try not to tell them so. :) Just my little effort at public<br/>\nservice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; As far as limits go, someone suggested that I might not trust my children.<br/>\n&gt; I don&#39;t believe that this is a matter about trust. I believe it is about<br/>\n&gt; understanding my role as parent. I have always felt that my role is to love<br/>\n&gt; them, guide them and protect them. Within the unschooling approach I<br/>\n&gt; understand that I have to love them and guide them, but don&#39;t protect them.<br/>\n&gt; I&#39;m not quite at ease with that. If feel that I might not be fulfilling my<br/>\n&gt; responsibility if I don&#39;t protect the and to protect them means to<br/>\n&gt; sometimes keep them away.<br/>\n<br/>\n </span></blockquote>When talking about limits, you&#39;re trying to protect your children from<br/>\nthemselves and their own judgment calls. That&#39;s where the trust issue comes<br/>\nin. I trust my children to make choices for themselves at any given time,<br/>\neven if it&#39;s not a choice I would have made for them. They will make some<br/>\npoor choices and learn from them. If I am in charge of choosing for them *I*<br/>\nwould make some poor choices for them, and what good would that do them?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think my uneasiness with all this is that I might make the wrong choice<br/>\n&gt; for my children.<br/>\n<br/>\n </span></blockquote>Well, that brings us back to the beginning and letting them make the choices<br/>\nfor themselves.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A hypothetical question comes to mind. What would you all do if your young<br/>\n&gt; teenager experiences with serious drugs??<br/>\n<br/>\n </span></blockquote>Children who experiment with drugs don&#39;t usually have better choices, and/or<br/>\nare trying to fill a void with a high. My children have better choices and<br/>\nknow how to fill voids with my help and without.<br/>\n<br/>\nI am not trying to dismiss what is obviously a very real fear, but my mind<br/>\nboggles, you see. We have a home business. We unschool. Our children have<br/>\nrich and varied lives and interests and keen curiousity. Making the leap<br/>\nfrom there to a neglected bored schooled teen surrounded by same-situation<br/>\npeers, many of them latch-key kids with no interest other than wearing black<br/>\nand sneering, to the bright and interesting and active unschooled teens I<br/>\nknow is more a jump than I&#39;m able for.<br/>\n<br/>\nIt&#39;s a bit like asking me what I would do if Brit took up a knife and tried<br/>\nto kill the dog. Well, I&#39;d stop her, but I don&#39;t expect her to do it. She<br/>\nhas better outlets for her energy, even her anger.<br/>\n<br/>\nIf my daughter were experimenting with serious drugs that presented a clear<br/>\nand present danger of harming her or landing us all in jail, I would of<br/>\ncourse stop her, just as I did stop my two year old from running headlong<br/>\ndown the stairs.<br/>\n<br/>\nBut I&#39;m not interested in living our lives in prevention of Worst Case<br/>\nScenario.<br/>\n<br/>\nPam</div>","specialLinks":[]}],"prevTopicId":46548,"nextTopicId":46419}}