{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"F7tV_1ohyygHhDIQwNjiDR227YLW-gTvy9gchfwAqB16rNDo5pDnkOs8ErxKPailprv6lWlUP6WhD1AonuLyDPaJ31E0upU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"KnoK NEWS for 11 June 2000","postDate":"960655828","msgId":9081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNjEwMTY0MS5CQUExNjc1NUBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":9080,"nextInTime":9082,"topicId":9081,"numMessagesInTopic":0,"msgSnippet":"* * * *  KnoK NEWS  * * * * -- Views from the world of learning in Japan -- Welcome to the 11 June 2000 edition of KnoK (pronounced knock ) NEWS, an informal","messageBody":"<div id=\"ygrps-yiv-474575305\">* * * *  KnoK NEWS  * * * *<br/>\n        -- Views from the world of learning in Japan --<br/>\n<br/>\n<br/>\nWelcome to the 11 June 2000 edition of KnoK (pronounced &quot;knock&quot;) NEWS, an <br/>\ninformal and periodic bulletin concerning issues of learning in Japan. It <br/>\nis brought to you by the Covert family -- Kazumi, Kenya and Brian -- a <br/>\nmulticultural, homelearning family in Osaka, Japan.<br/>\n<br/>\nKnoK stands for *Kodomo no Kokoro*, meaning &quot;Heart of a Child&quot; in <br/>\nJapanese. It is our belief that the heart of any child is indeed at the <br/>\ncenter of true learning, wherever and however such learning may take <br/>\nplace. <br/>\n<br/>\n<br/>\n           &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nEDITOR&#39;S WELCOME:  Once again, greetings everybody! The humid summer heat <br/>\nis already well upon us in parts of Japan, and with the approach of <br/>\nsummer come the usual thoughts of vacations, festivals and the getting <br/>\ntogether of friends, old and new. It is in this spirit that we bring you <br/>\nour feature this time: an introduction to Japan-based homelearning <br/>\nfamilies on the Web.<br/>\n<br/>\nWe hope you will take some time and enjoy browsing around the websites <br/>\nand homepages you see here, whether they be in English or Japanese. <br/>\nThere&#39;s no better way to get acquainted with the homelearning community <br/>\nhere in Japan, a community that is small in number (2,000 to 3,000 <br/>\nhomelearners nationwide, by unofficial estimates) but large in spirit. <br/>\nYou&#39;ll find sites here from various parts of Japan, and each site as <br/>\nunique as the family or group that put it together.<br/>\n<br/>\nIt should be noted, however, that not all of the families included here <br/>\nare &quot;technically&quot; homelearners. In Japan, there are thousands of <br/>\nschoolchildren who, for whatever reason, have decided they will not go to <br/>\nschool. This is known as *fu-toko* (&quot;school avoidance&quot; or &quot;school <br/>\nnonattendance&quot;). *Fu-toko* is more or less a state of &quot;educational limbo&quot; <br/>\nin which a child stays at home to avoid school, with the idea that, <br/>\nsooner or later, she/he will probably be placed back into the mainstream <br/>\nschool system once things are smoothed over.<br/>\n<br/>\nThis is different from homelearning in Japan, which involves a family&#39;s <br/>\nformal declaration to learn at home independently of school, not just <br/>\nstaying at home to avoid school. In any case, since *fu-toko* sometimes <br/>\nis the starting point for families in Japan to discover and embrace <br/>\nhomelearning, we wanted to respect that by including the voices of some <br/>\nprominent *fu-toko* families here as well.<br/>\n<br/>\nSo, is homelearning a workable educational choice in Japan? Most <br/>\ndefinitely, yes. But don&#39;t just take our word for it: Look here at what <br/>\nsome Japanese homelearners themselves are doing on the Web -- and with <br/>\ntheir lives. They are proof positive (if any were needed) that <br/>\nhomelearning can be done in Japan, and be done well. These families and <br/>\norganizations are part of a living, breathing community of home-based <br/>\nlearners in Japan that is slowly but steadily rising in number and, as <br/>\ntime goes on, learning the value of networking and uniting. These are <br/>\npeople who are helping to change the face of Japanese education forever <br/>\nin their own humble ways.<br/>\n <br/>\nFeel free to pass this info around and share it with others. If you come <br/>\nacross any Japanese or Japan-based homelearning families on the Web that <br/>\nwe may have missed, let us know and we promise to follow it up in a <br/>\nfuture edition of KnoK NEWS. <br/>\n<br/>\nIn the meantime, and in the spirit of summer, enjoy!<br/>\n<br/>\n-- Brian Covert<br/>\n<br/>\n<br/>\n           &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n          ON THE WEB WITH HOMELEARNING FAMILIES IN JAPAN<br/>\n<br/>\n<br/>\n<br/>\n(1) HOMESCHOOLING IN JAPAN  (english)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www2.gol.com/users/milkat/index.html\">http://www2.gol.com/users/milkat/index.html</a><br/>\nYour &quot;one-stop support network&quot; for home-based learning in Japan: This is <br/>\nby far the most comprehensive resource guide and gathering place on the <br/>\nWeb for Japanese and foreign-resident homelearners in Japan. The <br/>\nwebmaster is Katherine Combs, originally from the US (Seattle, <br/>\nWashington) and now doing home-based learning with her family in Tokyo. <br/>\nSays Combs: &quot;&#39;Homeschooling in Japan&#39; was created to bring together home <br/>\nlearners through monthly outings, and encourages families to get involved <br/>\nin helping plan social/learning opportunities for our children.&quot; The <br/>\nsite&#39;s newsletter, discussion list and other resources are handled by <br/>\nhomelearning parent Aileen Kawagoe, originally from Singapore and now <br/>\nliving in Japan with her family in Kashiwa, Chiba Prefecture. The <br/>\n&quot;Homeschooling in Japan&quot; website is also mentioned in the book &quot;Japan For <br/>\nKids: The Ultimate Guide for Parents and Their Children&quot; by Diane <br/>\nWiltshire and Jeanne Huey (Kodansha International, 2000), a new edition <br/>\nof which has just hit the bookstores.<br/>\n<br/>\n(2) HOME SCHOOLING NETWORK - HIMEJI  (japanese)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www2h.biglobe.ne.jp/~hsn-hime/\">http://www2h.biglobe.ne.jp/~hsn-hime/</a><br/>\nWebsite of an independent support group headed by Tomiko Kugai of Himeji, <br/>\nHyogo Prefecture. A respected homelearning advocate in Japan, Kugai has <br/>\nbeen homelearning with her daughter for about six years now. We are proud <br/>\nto have featured Kugai&#39;s two-part &quot;Q & A on Homeschooling in Japan&quot; in <br/>\nrecent editions of KnoK NEWS. Her homelearning activities have also been <br/>\ncovered in Japanese TV news programs, and in magazine and newspaper <br/>\narticles. She puts out a printed version of her support group&#39;s <br/>\nnewsletter as well.<br/>\n<br/>\n(3) HOME SCHOOLING NETWORK - MICHIKUSA  (japanese)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www09.u-page.so-net.ne.jp/tj8/hsn-miti/\">http://www09.u-page.so-net.ne.jp/tj8/hsn-miti/</a><br/>\nWebsite of an independent support group led by Kimiyo Matsuura, a <br/>\nhomelearning parent based in rural Toyono-cho, Osaka Prefecture. Matsuura <br/>\nis one of several contributing authors of a Japanese book published in <br/>\n1999, titled *Warau Fu-toko* (literally: &quot;Happy Without School&quot;), which <br/>\nextolls the virtues of children not attending school in Japan. Matsuura <br/>\nand her son each regularly put out printed versions of homelearning <br/>\nnewsletters as well. (&quot;Michi-kusa,&quot; by the way, is a Japanese expression <br/>\nmeaning to take one&#39;s time and smell the roses along the way.)<br/>\n<br/>\n(4) HOTTO RUUMU [HOT ROOM]  (japanese)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aay.mtci.ne.jp/~shine/kimiko/\">http://www.aay.mtci.ne.jp/~shine/kimiko/</a><br/>\nWebsite hosted by Kimiko Saito of Fukushima Prefecture, parent of a <br/>\n*fu-toko* child who was enrolled in, and has since graduated from, the <br/>\nhome-based education program of Clonlara School in Ann Arbor, Michigan in <br/>\nthe US. Saito also is one of the contributing authors of the *Warau <br/>\nFu-toko* book mentioned above. (The Chinese kanji characters for this <br/>\nwebsite&#39;s name, &quot;hot-to-ruu-mu,&quot; are also a play on words, roughly <br/>\nmeaning &quot;a person walking carefree in a dream.&quot;)<br/>\n<br/>\n(5) IKUTA FAMILY GA YUKU [HERE COMES THE IKUTA FAMILY]  (japanese)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www2u.biglobe.ne.jp/~iku/\">http://www2u.biglobe.ne.jp/~iku/</a><br/>\nMeet the Ikuta homelearning family from the city of Kobe, Hyogo <br/>\nPrefecture. They&#39;ve set up a colorful, creative website to introduce <br/>\nthemselves and some of the things they love doing together. The main page <br/>\nfeatures a simple animated cartoon, so it takes a bit of time to load. <br/>\nBut stick around: The rest of the site features lots of artwork and nice, <br/>\nclear photos. (Don&#39;t leave without checking out the cool shots of the <br/>\nfrogs!)<br/>\n<br/>\n(6) IO [&quot;ee-oh&quot;]  (japanese)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.itoh.org/io/\">http://www.itoh.org/io/</a><br/>\nWebsite set up by Miyoshi Itoh of Tokyo and Yuko Inoue of Saitama <br/>\nPrefecture, both parents of *fu-toko* children. Heavy emphasis in this <br/>\nwebsite on children&#39;s rights and other human rights. Itoh, who spent two <br/>\nyears living in Denmark with her children, has written about their <br/>\nexperiences there in an extended series of articles for the Tokyo <br/>\nShimbun, a major metro daily newspaper in Japan&#39;s capital city. Both Itoh <br/>\nand Inoue are contributing authors of the *Warau Fu-toko* book mentioned <br/>\nin listing #3 above. (And now, for those who are interested, a nonschool <br/>\nquiz: The name of this website, &quot;Io,&quot; comes from both (1) the name of a <br/>\nwoman loved by which mythological Greek deity? AND (2) the name of a <br/>\nvolcanically active moon affiliated with which planet of the solar <br/>\nsystem?)   [Answers to be found further down in this newsletter.]   <br/>\n<br/>\n(7) KODOMO ISHA [CHILDREN&#39;S DOCTOR]  (japanese)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.asahi-net.or.jp/~dw3r-isbs/ryoko.html\">http://www.asahi-net.or.jp/~dw3r-isbs/ryoko.html</a><br/>\nWebsite of Ryoko Ishibashi, a Tokyo-based pediatrician and parent of a <br/>\n*fu-toko* child. This site includes info about Dr. Ishibashi&#39;s personal <br/>\nexperiences as a parent of a school avoider in Japan, backed up with lots <br/>\nof other professional childcare advice to parents from her position as a <br/>\nmedical specialist. Dr. Ishibashi is yet another of the contributing <br/>\nauthors of the *Warau Fu-toko* book listed above in #3.<br/>\n<br/>\n(8) KUBO HOMESCHOOL FAMILY  (japanese)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.seaple-n.icc.ne.jp/~yoshikok/\">http://www.seaple-n.icc.ne.jp/~yoshikok/</a><br/>\nWebsite of Yoshiko Kubo, one of the veterans of the homelearning <br/>\ncommunity in Japan. She lives in Narashino, Chiba Prefecture, located <br/>\nabout 30 minutes from Tokyo. Kubo has been homelearning in Japan with her <br/>\ntwo children, ages nine and 12, from the beginning. Her website includes <br/>\na report on her family&#39;s travels last summer to Canada and the United <br/>\nStates, where they enjoyed staying with other homelearning families. More <br/>\nrecently, Kubo appeared as a panelist at a symposium in Tokyo on 3 June <br/>\nto help introduce homelearning as a positive alternative to conventional <br/>\nschools in Japan. She also regularly puts out two printed newsletters in <br/>\nJapanese -- one by the &quot;Sweet Heart&quot; social childcare network she heads, <br/>\nand another called &quot;LIVE&quot; (as in &quot;live and learn&quot;) that specifically <br/>\ncovers homelearning matters. And Kubo has self-published a book titled <br/>\n*Kodomo wa Asobi no Tensai* (&quot;Children are Geniuses at Playing&quot;), which <br/>\nintroduces some of her and her children&#39;s homelearning adventures. Busy, <br/>\nbusy!  <br/>\n<br/>\n(9) MISAWA HOME EDUCATORS SUPPORT GROUP  (english)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://members.xoom.com/MHESG/\">http://members.xoom.com/MHESG/</a><br/>\nWebsite of the 35th Support Group, a Christian-oriented homelearning <br/>\nsupport network in Japan for US military and civilian families stationed <br/>\nat the Misawa Air Base in Misawa, Aomori Prefecture. This site includes <br/>\nsections on homelearning resources and curriculums. (Note: You may <br/>\nencounter, as we did, several errors in the loading of this particular <br/>\nwebsite.)<br/>\n<br/>\n(10) MUKAI FAMILY TIMES  (english)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://members.tripod.com/mukaifamilytimes/homeschooling.html\">http://members.tripod.com/mukaifamilytimes/homeschooling.html</a><br/>\nChristian-oriented homelearning website of Katheryn Mukai and family, <br/>\ncurrently living in Tokyo. Though Mukai says the site is in need of <br/>\nupdating and that her family will be leaving Japan soon for Raleigh, <br/>\nNorth Carolina, we are nevertheless happy to include her &quot;Mukai Family <br/>\nTimes&quot; here. Katheryn Mukai is originally from the United States and has <br/>\n10 years of homelearning under her belt, in both the US and Japan, with <br/>\nher three children. She also helped with the launching of the <br/>\n&quot;Homeschooling in Japan&quot; website (see listing #1 above) and has been an <br/>\nactive contributor to that site. We will miss having the Mukai family in <br/>\nJapan, but look forward to maybe seeing a &quot;Stateside edition&quot; of the <br/>\nMukai Family Times in the future! <br/>\n<br/>\n(11) THINK SMALL  (japanese)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lain.ais.ne.jp/~iris1226/\">http://www.lain.ais.ne.jp/~iris1226/</a><br/>\nWebsite of Yumi Matsushima of Tokyo, parent of a *fu-toko* child. Tons of <br/>\nlinks to be found throughout Matsushima&#39;s site, including to her &quot;Museum <br/>\nof Rainbow&quot; section, where she displays artwork, and her new &quot;World of <br/>\nIris&quot; section featuring her own poetry in Japanese. For those who like <br/>\nsome simple music to go with their browsing, there is a link to that too! <br/>\nMatsushima is another of the contributing authors of the *Warau Fu-toko* <br/>\nbook mentioned above in listing #3.   <br/>\n<br/>\n(12) TORIA&#39;S HOUSE IN USA  (japanese)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.co.jp/HeartLand-Sumire/8473/index.html\">http://www.geocities.co.jp/HeartLand-Sumire/8473/index.html</a><br/>\nWebsite of a homelearning parent from Japan (she goes by the nickname of <br/>\n&quot;Mama-chanee&quot;) who is now living in Detroit, Michigan. She and her family <br/>\nstarted homelearning last year. The site features a special section <br/>\n(click on the blackboard with the apple) that provides some links to <br/>\nother English- and Japanese-language sites for homelearning newcomers.<br/>\n<br/>\n(13) YOSHII&#39;S HOME PAGE  (japanese)<br/>\n--&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.alpha-net.ne.jp/users2/gratias/index.html\">http://www.alpha-net.ne.jp/users2/gratias/index.html</a><br/>\nChristian-oriented homelearning website of the Yoshii family of Tokyo. <br/>\nMr. Haruto Yoshii, who has been homelearning in Japan with his three <br/>\nchildren for the last 10 years, has lots of opinions about homelearning, <br/>\neducation and Christianity. He shares with us a plethora of his original <br/>\nessays on these and other topics on his website. Some nice photos of the <br/>\nfamily are featured on the site too.<br/>\n<br/>\n[Answers to nonschool quiz in listing #6:  (1) Zeus  (2) Jupiter]<br/>\n<br/>\n<br/>\n                         *   *   *   *<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; NEXT TIME: Voices of Japanese Homelearners <br/>\n<br/>\n<br/>\n </span></blockquote>                         *   *   *   *<br/>\n<br/>\n<br/>\n             WISH I&#39;D SAID THAT  (Quote of the Day):<br/>\n<br/>\n&quot;[E]ducation is not achieved when you have completed college. It is <br/>\nhappening every moment. The Western system has emphasized the <br/>\nachievement, the success. And I say to students, seek not success, but <br/>\nseek fulfillment.&quot;   <br/>\n<br/>\n  --Holistic educator Satish Kumar, in *Kyoto Journal*, No. 43, Spring 2000</div>","specialLinks":[]}],"prevTopicId":8978,"nextTopicId":9066}}