{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":228638122,"authorName":"hpmarker","from":"&quot;hpmarker&quot; &lt;hpmarker@...&gt;","profile":"hpmarker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dishes","postDate":"1204613336","msgId":32623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZxaXJjbys5ZjEyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNzcwMWM4N2Q0YyQwOTA4M2IyMCQwMjAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":32622,"nextInTopic":0,"prevInTime":32622,"nextInTime":32624,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"Sorry for not signing my previous post. -Hallie","messageBody":"<div id=\"ygrps-yiv-1070100928\">Sorry for not signing my previous post.<br/>\n<br/>\n-Hallie</div>","specialLinks":[]},{"userId":228638122,"authorName":"hpmarker","from":"&quot;hpmarker&quot; &lt;hpmarker@...&gt;","profile":"hpmarker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dishes","postDate":"1204613225","msgId":32622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZxaXI5OStubnF2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNzcwMWM4N2Q0YyQwOTA4M2IyMCQwMjAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":32613,"nextInTopic":32623,"prevInTime":32621,"nextInTime":32623,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"... When we moved to Montana where we had fancy indoor pluming it seemed kind of like a miracle that all I had to do was turn that knob and get hot water!","messageBody":"<div id=\"ygrps-yiv-1029840557\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Deb Lewis&quot; &lt;d.lewis@...&gt; wrote:<br/>\n<br/>\n  When we moved to Montana where we had fancy indoor pluming it seemed <br/>\nkind of like a miracle that all I had to do was turn that knob and get <br/>\nhot water!  Golly I&#39;m pathetic.&lt;g&gt; <br/>\n<br/>\n<br/>\n<br/>\nThat reminds me of when we bought a dishwasher after not having had one <br/>\nfor years.  The salesperson was bemused at how thrilled I was to be <br/>\npurchasing the absolute least impressive dishwasher in the whole <br/>\nstore.  But what an upgrade it was for us! </span></blockquote></div>","specialLinks":[]},{"userId":99936689,"authorName":"Barbara Mullins","from":"&quot;Barbara Mullins&quot; &lt;mozafamily@...&gt;","profile":"mozafamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dishes","postDate":"1204581695","msgId":32613,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZxaHNmdithNnRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDBERDEyQUQyLTFBMDMtNEI5Mi05NEVCLTVBMERFQTlEMzdCN0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":32612,"nextInTopic":32622,"prevInTime":32612,"nextInTime":32614,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"I find the relaxing and enjoyable smell of lavender and ylang ylang Palmolive really helps to make doing the dishes more enjoyable for me. And I also second","messageBody":"<div id=\"ygrps-yiv-376537222\">I find the relaxing and enjoyable smell of lavender and ylang ylang<br/>\nPalmolive really helps to make doing the dishes more enjoyable for me.<br/>\nAnd I also second the idea of trying to do them often so they don&#39;t<br/>\nbecome this huge heap of worry or resentment. Just do them and get<br/>\ndone with them so you can go do other fun stuff. And yeah sure paper<br/>\nis great if you can afford it. <br/>\n   Have you got an action plan going for when you will be able to<br/>\nafford getting the plumber there? If not make one even if it&#39;s 6<br/>\nmonths from now. Just knowing that this won&#39;t be a problem forever<br/>\nhelps to deflate the aggravation.  <br/>\n   And remember things could easily be worse. When we had new kitchen<br/>\ncounter tops installed (they were linoleum when we moved in euww! but<br/>\nusable)we had do to without a kitchen sink for about a week. I washed<br/>\ndishes in the bathtub and it really made my back hurt. I wish I had<br/>\nthought about setting up tubs in my yard as someone suggested, that<br/>\nsounds like a lot of fun! <br/>\n   Best Wishes - Barbara</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dishes","postDate":"1204579714","msgId":32612,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBERDEyQUQyLTFBMDMtNEI5Mi05NEVCLTVBMERFQTlEMzdCN0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIzMzJkZjUwMDgwMzAzMDUwOWwyNWEwZmE5OXhlYmVjNzAyNDY4MmNjOWE0QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDIzMzJkZjUwMDgwMzAzMDUwOWwyNWEwZmE5OXhlYmVjNzAyNDY4MmNjOWE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":32604,"nextInTopic":32613,"prevInTime":32611,"nextInTime":32613,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"-=-I hate dishes. I would rather clean the house from top to bottom than to do dishes.-=- Until the sink is fixed, could you concentrate on foods that are ","messageBody":"<div id=\"ygrps-yiv-1137886195\">-=-I hate dishes. I would rather clean the house from top to bottom  <br/>\nthan to do<br/>\ndishes.-=-<br/>\n<br/>\nUntil the sink is fixed, could you concentrate on foods that are  <br/>\nserved without dishes?  You could use paper napkins or paper towels  <br/>\nor just cheap printer-paper for &quot;plates&quot; then, if you can&#39;t afford  <br/>\npaper plates.<br/>\n<br/>\nWhen the sink is fixed, could you ask one of your kids to come and  <br/>\nsit and talk to you while you do dishes?  That would keep you from  <br/>\nbeing &quot;DOING DISHES&quot;--you&#39;d be visiting with one of the kids.  They  <br/>\nmight want to help; it&#39;s possible, but don&#39;t ask.  Just make it seem  <br/>\nas fun as you can.<br/>\n<br/>\nFor a while Holly wanted it to be her job to mop the kitchen floor.   <br/>\nCool, because I hate mopping.  She did  it for a few months and  <br/>\nstopped.  That&#39;s okay.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dishes","postDate":"1204562743","msgId":32604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxRkRGRThCLTMzQTItNDQ0NS05NjlELTIzN0RGNDg0NUE4MkBjb3gubmV0Pg==","inReplyToHeader":"PDAwNzcwMWM4N2Q0YyQwOTA4M2IyMCQwMjAxYThjMEBiaWdzdXJwcmlzZT4=","referencesHeader":"PDAwNzcwMWM4N2Q0YyQwOTA4M2IyMCQwMjAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":32603,"nextInTopic":32612,"prevInTime":32603,"nextInTime":32605,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"... A dishwasher after my own heart.  I forgot to mention in my previous post that my sink has a window above it, looking out on my backyard, trees, and beyond","messageBody":"<div id=\"ygrps-yiv-1692866767\">On Mar 3, 2008, at 8:31 AM, Deb Lewis wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It calms me to have my hands in hot water.  I light a candle  <br/>\n&gt; (currently a skull candle, which, when lit, drips red wax blood.  <br/>\n&gt; Courtesy of my son, the ghoul.&lt;g&gt;)  I open the curtains to look out  <br/>\n&gt; the window, I put on some music, pour a glass of wine or a cup of  <br/>\n&gt; tea.  It&#39;s my cheap substitute for a spa.  It&#39;s my mental health  <br/>\n&gt; moment.<br/>\n<br/>\n </span></blockquote>A dishwasher after my own heart.  I forgot to mention in my previous  <br/>\npost that my sink has a window above it, looking out on my backyard,  <br/>\ntrees, and beyond to Cowles Mountain, which is really a little hill  <br/>\nbut hey, it&#39;s a view &lt;g&gt;  We have bird feeders, too, so there&#39;s always  <br/>\nsomething to see.  At night, I have candles on the window ledge.<br/>\n<br/>\nI like the hot water, too.  I sometimes make dish washing a manicure  <br/>\ntreatment: I do a salt and olive oil exfoliating scrub, rinse that  <br/>\noff, apply a heavy cream like Nivea or udder balm, and then put on  <br/>\nrubber gloves.  The heat activates the hand cream, and I have really  <br/>\nnice skin when I&#39;m done with the dishes.<br/>\n<br/>\nNancy  (putting off ironing...)</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Dishes","postDate":"1204561890","msgId":32603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzcwMWM4N2Q0YyQwOTA4M2IyMCQwMjAxYThjMEBiaWdzdXJwcmlzZT4="},"prevInTopic":32602,"nextInTopic":32604,"prevInTime":32602,"nextInTime":32604,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"***I am just looking for some creative solutions, insight, whatever.*** Someone else has recommended paper plates. Put all the dishes away, out of reach,","messageBody":"<div id=\"ygrps-yiv-593342153\">***I am just looking for some creative solutions, insight, whatever.***<br/>\n<br/>\nSomeone else has recommended paper plates. <br/>\n<br/>\nPut all the dishes away, out of reach, except for a plate, bowl, spoon, fork, knife, and cup for each of you.  That will limit the number of dishes you&#39;ll be dirtying.  You&#39;ll wash them more often but there won&#39;t be a pile of dishes.  Doesn&#39;t really work if you have as many family members as you have dishes, though. &lt;g&gt;<br/>\n<br/>\nWash a thing as soon as you&#39;re finished with it.  I have a really small kitchen and I usually wash each sauce pan or pot the minute I&#39;m finished with it.  <br/>\nKeep a little bit of hot water in your wash pan.  Heat it up when you need to.  Stop and wash one thing when you&#39;re walking by.  <br/>\n<br/>\nMicrowave what you can and save yourself pot scrubbing. <br/>\n<br/>\nCan you trade with a friend?  She&#39;ll come do your dishes once a day if you take her kids swimming or something? <br/>\nCan you hire a neighborhood kid to do dishes in the evening for you?    Do you have something you could trade out for dish doing?  Piano lessons?  Sewing? Carpentry?<br/>\n<br/>\nPick up cheap dishes at the second hand store and when they&#39;re dirty, toss them out the window like Lisa Douglas on &quot;Green Acres.?&quot; <br/>\n<br/>\nI used to hate washing dishes and now I love it.  Sickening, isn&#39;t it?   Some things that helped change my thinking: <br/>\n<br/>\nI stopped thinking, &quot;I hate to do dishes&quot; and started thinking, &quot;I want clean dishes.&quot; <br/>\nMy dad gave me a gift of beautiful dishes before he died.  When I wash them it makes me think about the last couple of years with him and how I came to know and like him. <br/>\nMy kid&#39;s hands itch in water so making sure he had all the clean dishes he needed felt like good mothering to me. <br/>\nI picked my dishes from here and there, pieces I really like, and made some too.  I was gifted some pretty things and when I wash them I enjoy thinking about how I acquired them and how long I&#39;ve had them and the friends and groovy ones who gave them to me.   <br/>\nIt calms me to have my hands in hot water.  I light a candle (currently a skull candle, which, when lit, drips red wax blood. Courtesy of my son, the ghoul.&lt;g&gt;)  I open the curtains to look out the window, I put on some music, pour a glass of wine or a cup of tea.  It&#39;s my cheap substitute for a spa.  It&#39;s my mental health moment. <br/>\nI bought a stool for the kitchen and my kid comes and sits on the stool and visits with me while I wash dishes. <br/>\nI have some weird hand pain and it feels good to have them in hot water. <br/>\nI like bubbles.  I keep a bubble wand by the sink. <br/>\nI only do the dishes when I want to.  And I only do as much as I want.  If I&#39;m busy and there are only a few dirty plates but lots of coffee mugs, I might just wash some of the coffee mugs.  I think about convenience for others and wash what will most likely be needed. <br/>\nI think of doing dishes as a gift to my family.  They may not think of it as a gift but when I know their lives are more convenient because they can find what they need in the kitchen, I feel happy.   <br/>\nAnd because I do dishes happily,  on the occasions  they do pile up, no one is stressed by that because we all know they&#39;ll get washed at a more convenient time. <br/>\nIf I know I won&#39;t be home much or I&#39;ll be otherwise occupied we use paper plates. <br/>\n<br/>\nWe used to live in Knik Alaska.  We had no plumbing.  We hauled our water to the house from a public well seven miles away. (uphill both ways through the deep snow with rags tied around our feet)   I heated water on the wood stove and dumped the wash and rinse basins out in the leach field.   When we moved to Montana where we had fancy indoor pluming it seemed kind of like a miracle that all I had to do was turn that knob and get hot water!  Golly I&#39;m pathetic.&lt;g&gt; <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dishes","postDate":"1204558879","msgId":32602,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzM0QwNkRBLUZEMjMtNEQ4RC04NTc5LUM0MjEzRURDNUIyMUBjb3gubmV0Pg==","inReplyToHeader":"PDIzMzJkZjUwMDgwMzAzMDUwOWwyNWEwZmE5OXhlYmVjNzAyNDY4MmNjOWE0QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDIzMzJkZjUwMDgwMzAzMDUwOWwyNWEwZmE5OXhlYmVjNzAyNDY4MmNjOWE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":32601,"nextInTopic":32603,"prevInTime":32601,"nextInTime":32603,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"... From the start, my dh and I worked out a system: immediately after a meal, he d scrape the food off the dishes, rinse and stack them, and I d wash them","messageBody":"<div id=\"ygrps-yiv-404413302\">On Mar 3, 2008, at 5:09 AM, Amanda Horein wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wasn&#39;t sure where else to post this, so I thought I would do it  <br/>\n&gt; here.<br/>\n&gt;<br/>\n&gt; Let me make it clear though that this is about me, not anyone else  <br/>\n&gt; in the<br/>\n&gt; home.<br/>\n&gt;<br/>\n&gt; I hate dishes. I would rather clean the house from top to bottom  <br/>\n&gt; than to do<br/>\n&gt; dishes.<br/>\n<br/>\n </span></blockquote> From the start, my dh and I worked out a system: immediately after a  <br/>\nmeal, he&#39;d scrape the food off the dishes, rinse and stack them, and  <br/>\nI&#39;d wash them later.  I hated the scrape and rinse aspect but he  <br/>\ndidn&#39;t mind, so it worked out.  When the kids were little, doing the  <br/>\ndishes was a break for me -- they weren&#39;t interested in helping, so it  <br/>\ngave me time to think &lt;g&gt;  Now that they&#39;re big, the kids will pitch  <br/>\nin, too; washing while my 20 y.o. dd dries is companionable.<br/>\n<br/>\nCould you find ways to divide the job up?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We don&#39;t have a dishwasher and we don&#39;t have room for one so that<br/>\n&gt; isn&#39;t an option. Currently our sink has got some sort of blockage in  <br/>\n&gt; it and<br/>\n&gt; we don&#39;t have the funds to get it fixed. We have tried doing it  <br/>\n&gt; ourselves to<br/>\n&gt; no avail.<br/>\n<br/>\n </span></blockquote>If you think the blockage is really in the area of the sink, not  <br/>\nfurther down the drain pipes, you can try a couple of home remedies.   <br/>\nBaking soda and vinegar can help, and be quite entertaining as well.   <br/>\nAnother that works really well on grease is to pour a couple cups of  <br/>\nammonia into the drain, followed by boiling water.  If you have a  <br/>\ndouble sink, routinely fill both sinks with hot water, then pull both  <br/>\nplugs at the same time to help clear the drains.<br/>\n<br/>\nIf your sink will drain for awhile and then backs up, it might be  <br/>\nblocked further down.  We battled a blocked drain for years (which is  <br/>\nthe only reason I know this stuff -- learning by doing!).  Snaking it  <br/>\nfinally had no effect, so my plumber spent a day putting in access in  <br/>\nthe front yard.  Snaking it from there identified the problem, which  <br/>\nturned out to be under the street.  That made it the city&#39;s problem,  <br/>\nnot ours -- they had to send a crew out to dig up the street and fix  <br/>\nit.  They couldn&#39;t have done it, though, without our first installing  <br/>\nthat access.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, we are using wash tubs stuck in our sink and dumping them out<br/>\n&gt; the back door. It is a huge pain, but even before that I hated  <br/>\n&gt; dishes. Dh<br/>\n&gt; isn&#39;t fond of them either (so we can&#39;t &quot;compliment&quot; each other in  <br/>\n&gt; that way).<br/>\n&gt;<br/>\n&gt; I am just looking for some creative solutions, insight, whatever.<br/>\n<br/>\n </span></blockquote>Could you set the wash tubs on a table in the yard and wash the dishes  <br/>\nal fresco?  Your kids could pretend they&#39;re camping.<br/>\n<br/>\nPaper plates can be helpful, too :-)  I also found that using pretty  <br/>\ndishes helps; after 25 years of marriage, I finally dragged the  <br/>\nwedding china out of storage and started using it every day.  The  <br/>\npattern is discontinued but I could still get replacements if I broke  <br/>\none; I&#39;m more worried I&#39;ll drop one than that a kid will (my baby will  <br/>\nbe 18 this month ;-)<br/>\n<br/>\nNancy<br/>\n<br/>\n(I feel obligate to add that I am not always this enthusiastic about  <br/>\ndishes, but mine are clean in the rack thanks to dh; if they were  <br/>\npiled high, awaiting my attention, I might be calling them our family  <br/>\nnickname for the job -- the &quot;ducking fishes&quot;!  Now if I could only  <br/>\nfind a way to like ironing....)<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dishes","postDate":"1204558108","msgId":32601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyMDExOC4xNzYzMS5xbUB3ZWI4MTUwNS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDIzMzJkZjUwMDgwMzAzMDUwOWwyNWEwZmE5OXhlYmVjNzAyNDY4MmNjOWE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":32600,"nextInTopic":32602,"prevInTime":32600,"nextInTime":32602,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"paper plates, disposable silverware and plastic cups, from food you can put straight in the oven or microwave. alex Amanda Horein  wrote: I","messageBody":"<div id=\"ygrps-yiv-93568083\">paper plates, disposable silverware and plastic cups, from food you can put straight in the oven or microwave.<br/>\n  alex<br/>\n<br/>\nAmanda Horein &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:horein@...\">horein@...</a>&gt; wrote:<br/>\n          I wasn&#39;t sure where else to post this, so I thought I would do it here.<br/>\n<br/>\nLet me make it clear though that this is about me, not anyone else in the<br/>\nhome.<br/>\n<br/>\nI hate dishes. I would rather clean the house from top to bottom than to do<br/>\ndishes. We don&#39;t have a dishwasher and we don&#39;t have room for one so that<br/>\nisn&#39;t an option. Currently our sink has got some sort of blockage in it and<br/>\nwe don&#39;t have the funds to get it fixed. We have tried doing it ourselves to<br/>\nno avail. So, we are using wash tubs stuck in our sink and dumping them out<br/>\nthe back door. It is a huge pain, but even before that I hated dishes. Dh<br/>\nisn&#39;t fond of them either (so we can&#39;t &quot;compliment&quot; each other in that way).<br/>\n<br/>\nI am just looking for some creative solutions, insight, whatever.<br/>\n<br/>\n-- <br/>\nAmanda<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://whatmykidstaughtme.blogspot.com/\">http://whatmykidstaughtme.blogspot.com/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n                         <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":213505820,"authorName":"Jennifer Varela","from":"&quot;Jennifer Varela&quot; &lt;gemini7772@...&gt;","profile":"gemini7772","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dishes","postDate":"1204557223","msgId":32600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmYTNlNzYxMDgwMzAzMDcxM3Q1NDdiMjllOXNiODJlOWQ1MzA3N2Q4NmMzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDIzMzJkZjUwMDgwMzAzMDUwOWwyNWEwZmE5OXhlYmVjNzAyNDY4MmNjOWE0QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDIzMzJkZjUwMDgwMzAzMDUwOWwyNWEwZmE5OXhlYmVjNzAyNDY4MmNjOWE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":32599,"nextInTopic":32601,"prevInTime":32599,"nextInTime":32601,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"... Me, too,  Mine are currently piled up, lol.  I second Harmony s recommendation of disposable.  Plus, I ve seen countertop dishwashers.  They are smaller,","messageBody":"<div id=\"ygrps-yiv-731843382\"><blockquote><span title=\"ireply\">&gt;&gt;On Mon, Mar 3, 2008 at 8:09 AM, Amanda Horein &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:horein@...\">horein@...</a>&gt; wrote:<br/>\n<br/>\n&gt; I hate dishes. &lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Me, too,  Mine are currently piled up, lol.  I second Harmony&#39;s<br/>\nrecommendation of disposable.  Plus, I&#39;ve seen countertop dishwashers.  They<br/>\nare smaller, so they don&#39;t hold the amount of dishes a large dishwasher<br/>\nwould, but, they would help with the issue!  I did a quick google search and<br/>\nthere are a bunch of different ones.  Here is one:  *<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/39xsal*\">http://tinyurl.com/39xsal*</a><br/>\n<br/>\nJen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":285625854,"authorName":"harmony","from":"&quot;=?iso-8859-1?Q?harmony?=&quot; &lt;harmony@...&gt;","profile":"harmonyhogan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dishes","postDate":"1204551755","msgId":32599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDgwMzAzMTM0MjM1LjE0MzIwLnFtYWlsQHNlcnZlcjMxNi5jb20+"},"prevInTopic":32598,"nextInTopic":32600,"prevInTime":32598,"nextInTime":32600,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"before getting a dishwasher we used a lot of papar plates.  They are cheap at costco.  We had cups with names on them so everyone had a cup and could wash","messageBody":"<div id=\"ygrps-yiv-1550162062\">before getting a dishwasher we used a lot of papar plates.  They are cheap at costco.  We had cups with names on them so everyone had a cup and could wash thier own.  Then I only had to wash pots and pans and silverwear.  We used plastic silverwear sometimes too.<br/>\nI also hate doing dishes.  I bought one of those dishwashers that we roll over to the sink and hook it up, then push it back in the corner when we&#39;re not using it.  It works great, then I don&#39;t have to do dishes.  Everyone puts their dishes into it when they finish eating.  <br/>\nGood Luck<br/>\nHarmony<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;  -------Original Message-------<br/>\n&gt;  From: Amanda Horein &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:horein@...\">horein@...</a>&gt;<br/>\n&gt;  Subject: [AlwaysLearning] Dishes<br/>\n&gt;  Sent: Mar 03 &#39;08 7:09am<br/>\n&gt;  <br/>\n&gt;  I wasn&#39;t sure where else to post this, so I thought I would do it here.<br/>\n&gt;  <br/>\n&gt;  Let me make it clear though that this is about me, not anyone else in the<br/>\n&gt;  home.<br/>\n&gt;  <br/>\n&gt;  I hate dishes. I would rather clean the house from top to bottom than to<br/>\n&gt;  do<br/>\n&gt;  dishes. We don&#39;t have a dishwasher and we don&#39;t have room for one so that<br/>\n&gt;  isn&#39;t an option. Currently our sink has got some sort of blockage in it<br/>\n&gt;  and<br/>\n&gt;  we don&#39;t have the funds to get it fixed. We have tried doing it ourselves<br/>\n&gt;  to<br/>\n&gt;  no avail. So, we are using wash tubs stuck in our sink and dumping them<br/>\n&gt;  out<br/>\n&gt;  the back door. It is a huge pain, but even before that I hated dishes. Dh<br/>\n&gt;  isn&#39;t fond of them either (so we can&#39;t &quot;compliment&quot; each other in that<br/>\n&gt;  way).<br/>\n&gt;  <br/>\n&gt;  I am just looking for some creative solutions, insight, whatever.<br/>\n&gt;  <br/>\n&gt;  --<br/>\n&gt;  Amanda<br/>\n&gt;  [LINK: <a rel=\"nofollow\" target=\"_blank\" href=\"http://whatmykidstaughtme.blogspot.com/%5d\">http://whatmykidstaughtme.blogspot.com/%5d</a><br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://whatmykidstaughtme.blogspot.com/\">http://whatmykidstaughtme.blogspot.com/</a><br/>\n&gt;  <br/>\n&gt;  [Non-text portions of this message have been removed]<br/>\n&gt;  <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":307938888,"authorName":"Amanda Horein","from":"&quot;Amanda Horein&quot; &lt;horein@...&gt;","profile":"michmdmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Dishes","postDate":"1204549781","msgId":32598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzMzJkZjUwMDgwMzAzMDUwOWwyNWEwZmE5OXhlYmVjNzAyNDY4MmNjOWE0QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":32599,"prevInTime":32597,"nextInTime":32599,"topicId":32598,"numMessagesInTopic":0,"msgSnippet":"I wasn t sure where else to post this, so I thought I would do it here. Let me make it clear though that this is about me, not anyone else in the home. I hate","messageBody":"<div id=\"ygrps-yiv-871798016\">I wasn&#39;t sure where else to post this, so I thought I would do it here.<br/>\n<br/>\nLet me make it clear though that this is about me, not anyone else in the<br/>\nhome.<br/>\n<br/>\nI hate dishes. I would rather clean the house from top to bottom than to do<br/>\ndishes. We don&#39;t have a dishwasher and we don&#39;t have room for one so that<br/>\nisn&#39;t an option. Currently our sink has got some sort of blockage in it and<br/>\nwe don&#39;t have the funds to get it fixed. We have tried doing it ourselves to<br/>\nno avail. So, we are using wash tubs stuck in our sink and dumping them out<br/>\nthe back door. It is a huge pain, but even before that I hated dishes. Dh<br/>\nisn&#39;t fond of them either (so we can&#39;t &quot;compliment&quot; each other in that way).<br/>\n<br/>\nI am just looking for some creative solutions, insight, whatever.<br/>\n<br/>\n-- <br/>\nAmanda<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://whatmykidstaughtme.blogspot.com/\">http://whatmykidstaughtme.blogspot.com/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":32616,"nextTopicId":32592}}