{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":336246301,"authorName":"CarenKH","from":"&quot;CarenKH&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: The boy who won&#39;t leave the house","postDate":"1377338193","msgId":72015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt2YTAwaCsxcWdvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt2NGM3ZytndWNpQGVHcm91cHMuY29tPg=="},"prevInTopic":72012,"nextInTopic":0,"prevInTime":72014,"nextInTime":72016,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"~~Essential for this, though, when I feel like your husband seems to, I need to feel the connection with my wife. To also feel important to her, just as much","messageBody":"<div id=\"ygrps-yiv-1241537722\">~~Essential for this, though, when I feel like your husband seems to, I need to feel the connection with my wife. To also feel important to her, just as much as our children. Even though we adults can generally use our rational minds to soothe ourselves, it sometimes takes a warm hug or some kind words of understanding from from our loved ones for us to be our best selves. I guess it is a bit like fuel for the soul.~~<br/>\n<br/>\nI have written before about how I think I would not have gotten separated from my husband if I had been reading on this list & UnschoolingBasics during that time in my life (and before). This post, and others like it, will help me be a better partner, should I ever be in a relationship again. One of the many reasons I continue to be grateful this list exists, and so grateful for the people posting. Thanks so much for writing.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy Dusseldorp","from":"&quot;Rippy Dusseldorp&quot; &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The boy who won&#39;t leave the house","postDate":"1377154096","msgId":72012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt2NGM3ZytndWNpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt2MDhjcitxY3A0QGVHcm91cHMuY29tPg=="},"prevInTopic":72004,"nextInTopic":72015,"prevInTime":72011,"nextInTime":72013,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"... I just read your last post and I think it is full of deep insight, after a month of wonderful suggestions on this list. As a father with a traditional job","messageBody":"<div id=\"ygrps-yiv-233633802\">I left my computer on last night and Graham (my husband) saw this thread in my inbox. He wrote the post below before he left for work in the morning. When I woke up, I saw a note from him asking me to read his post and to forward it to the list, if I thought it would be helpful. Here it is:<br/>\n<br/>\n---<br/>\n<br/>\nI just read your last post and I think it is full of deep insight, after a month of wonderful suggestions on this list. As a father with a traditional job - preferring an entrepreneurial one but consciously choosing to keep the stability - but with many non-traditional choices, including unschooling, I can relate to your story and more particularly, your husband. <br/>\n<br/>\nEven though I fully support our choices that come from tending to our children&#39;s needs, it is not always easy to warmly accept the consequences. Remembering why we make them and having gratitude for those choices helps most often. But sometimes it also helps to just share with my wife how difficult I sometimes find it, and for her to acknowledge this and show her appreciation. <br/>\n<br/>\nMy wife grew up with &quot;helping others&quot; as one of the most important family values. That value was not part of my upbringing. So I had to do quite a bit of growing. And especially when I am tired and exhausted from my responsibilities, I just want things (the kids, our situation) to be &quot;normal and easy&quot; and I get frustrated. Paying attention to this and connecting with my wife helps. It helps to accept and to feel her appreciation, even though I know this appreciation is also within me. Sometimes it just helps to be reminded or just to feel supported when things feel a bit heavy. <br/>\n<br/>\nIt also helps to do the next best thing possible. Such as when a child does not want to go out, for me to go out with the other child, or to have my favorite take in, while watching a nice dvd with the family (or any members who would like to). Essential for this, though, when I feel like your husband seems to, I need to feel the connection with my wife. To also feel important to her, just as much as our children. Even though we adults can generally use our rational minds to soothe ourselves, it sometimes takes a warm hug or some kind words of understanding from from our loved ones for us to be our best selves. I guess it is a bit like fuel for the soul.<br/>\n<br/>\nIt is lovely to hear how you tend to your family&#39;s needs. To your son&#39;s and, as I am reading from your last post, to your husband&#39;s. I cannot make it out based on what you wrote, but I trust that you also tend to yours and your daughter&#39;s - and let others help with this as well. To find complete balance, which, as we know, requires continuous attention and often new action. Thank you for sharing, it also reminded me of things and helps me in my life.<br/>\n<br/>\nGraham<br/>\n(Gianluca 8, Gisele 6)</div>","specialLinks":[]},{"userId":219096950,"authorName":"saritap1119","from":"&quot;saritap1119&quot; &lt;sarah@...&gt;","profile":"saritap1119","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The boy who won&#39;t leave the house","postDate":"1377019099","msgId":72004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt2MDhjcitxY3A0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRTA1UktQTnZEeHc4R19RcGpCWXRCS3ptT1BmVzUyYWcrX0tVb2Y5R24rei0zZGctd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71975,"nextInTopic":72012,"prevInTime":72003,"nextInTime":72005,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"Yes, my response as well has been to host gatherings at our house a lot, and to have friends over as often as I can get them.  We end up having that house with","messageBody":"<div id=\"ygrps-yiv-961469677\">Yes, my response as well has been to host gatherings at our house a lot, and to have friends over as often as I can get them.  We end up having that house with people coming over really frequently.  Sometimes it is overwhelming for me, as the home feels more like a &quot;center&quot; than a refuge of privacy.  It&#39;s a weird compromise.  <br/>\n<br/>\nI imagine that my son is very deeply interested and connected with his work.  He seems to me like a scholar of physics, a deeply visual learner, and an immersive thinker.  Interruptions are frustrating for him, and I imagine that the normal interruptions of life will be easier to handle as he matures.  He is also introverted, like the rest of us, needing just a few friends, only one at a time, if possible, and lots of time alone to think and work.<br/>\n<br/>\nI think my husband was feeling not that it was so important to that we all go out together as a family, but that one person does not get to decide for the entire family.  Particularly, that a child does  not get to decide.  And probably that I was not supporting the group, but the individual.   I felt I was supporting the most vulnerable person, and I can see that sometimes my husband can feel just as vulnerable.  <br/>\n<br/>\nI think one person often decides things for the family all the time.  I&#39;m the one who decided that I didn&#39;t want the kids to go to school, and that I would stay home, forgoing other options, to stay with them.  Of course my husband and I discussed it at length, read and researched and debated.  But, it was me that had to make the commitment.  I&#39;m the one who was drawn to unschooling, and decided to forgo a formal curriculum in favor of a more peaceful interchange.  So one person changed the entire course of everything in our house.<br/>\n<br/>\nMy husband is the one who decided to devote his life to an entrepreneurial career, fraught with financial risks.  He decided not to get a safe, traditional job with traditional benefits and retirement plans.  Of course I support him in that decision, I respect and honor his choice, but it really is his choice.  And we have paid the price, and reaped the rewards, just as we have with unschooling.  <br/>\n<br/>\nWe have more worries, and more victories, than if we had never made those choices.  <br/>\n<br/>\nSo we all make decisions that affect each other, all the time.  We all have our own, idiosyncratic needs that need to be met and supported by the group.<br/>\n<br/>\nPerhaps I need to focus more on supporting my husband&#39;s need to feel heard and respected.  Perhaps he feels like it&#39;s me and the kids against him.  Perhaps the gentle and quiet understanding that I work so hard to cultivate with my kids needs to be directed towards him as well.  I often assume that he can take care of himself, but perhaps I am not being sensitive to his need for validation and gentle listening.  <br/>\n<br/>\nSarah</div>","specialLinks":[]},{"userId":458624268,"authorName":"Dola Dasgupta","from":"Dola Dasgupta &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The boy who won&#39;t leave the house","postDate":"1376658064","msgId":71975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRTA1UktQTnZEeHc4R19RcGpCWXRCS3ptT1BmVzUyYWcrX0tVb2Y5R24rei0zZGctd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71972,"nextInTopic":72004,"prevInTime":71974,"nextInTime":71976,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"I would suggest you try a chat with your son about this when you two are alone out some place fun may be..over pizza or ice cream or may be driving...and","messageBody":"<div id=\"ygrps-yiv-1500716234\">I would suggest you try a chat with your son about this when you two are<br/>\nalone out some place fun may be..over pizza or ice cream or may be<br/>\ndriving...and really try and listen to him and what is the real discomfort<br/>\nfor him in these outings..and see together if it is possible to work out<br/>\nsome win-win solution..where both family outing and his needs can be taken<br/>\ncare of...<br/>\n<br/>\nI would suggest doing a similar chat with your husband..and really try and<br/>\nunderstand why is it so important for him that all go out. And if it so<br/>\nimportant than to help him see that can there be possibilities where his<br/>\nand your son&#39;s needs are both met?<br/>\n<br/>\nOr would he be alright with your son staying back home with a baby sitter<br/>\nperhaps?<br/>\n<br/>\nIf it is his computer games that seems more interesting than anything<br/>\nelse..then see if there is any possibility for connecting lap tops in the<br/>\npremise while you three are together and he is somewhere safe close by..or<br/>\nif you have an iPad..then may be he could take that and sit out somewhere..<br/>\n<br/>\nI am sorry as I live in India, I am not sure how the arrangements are at<br/>\nvenues where you all want to go..so my suggestions might not work..<br/>\n<br/>\nMy children 11 and 7, refuse to go any place I want to go as they want<br/>\ntheir stuff and the comfort of their spaces a lot. Places where they can<br/>\ncarry lap tops and iPads, we do that all the time..If not possible then I<br/>\ntry and go out during the day when there is help to watch over the kids.<br/>\nSince I like meeting friends once in a while..I have also started having<br/>\nsmall gatherings at home..so that my kids do not have to go anywhere..I<br/>\ndon&#39;t mind the extra work that comes with socialization..But when the<br/>\ngathering is at our home, my kids are happier as they just retreat to their<br/>\nrooms..with their things..and ask for me only when they need food and<br/>\ndrinks.<br/>\n<br/>\nDola<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The boy who won&#39;t leave the house","postDate":"1376623039","msgId":71972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA1NUUzRjc5LUZBMjctNDk1Qi1BNjdDLTgwNTMxMzYyNUM3NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGt1ZGd0aStzYmNwQGVHcm91cHMuY29tPg==","referencesHeader":"PGt1ZGd0aStzYmNwQGVHcm91cHMuY29tPg=="},"prevInTopic":71949,"nextInTopic":71975,"prevInTime":71971,"nextInTime":71973,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"-=-How do I suggest balance? -=- I would talk to the boy at some time when everything is calm and nobody s there but the two of you.  Maybe while you re","messageBody":"<div id=\"ygrps-yiv-1063065030\">-=-How do I suggest balance? -=-<br/>\n<br/>\nI would talk to the boy at some time when everything is calm and nobody&#39;s there but the two of you.  Maybe while you&#39;re driving somewhere, or doing something together where you&#39;re not sitting face to face formally &quot;talking.&quot;  <br/>\n<br/>\nDitto, later maybe, with your husband.   <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/truck\">http://sandradodd.com/truck</a><br/>\n<br/>\nI would talk to the boy about finding a way to go out once a week or something.  <br/>\n<br/>\nI would talk to the dad about getting a babysitter so the other three of you can go out.<br/>\n<br/>\nOne of the factors in balance here is time. Your son will become more mature and maybe realize that he&#39;s disrupting family life.  Or your husband might find ways to be happy without all four in one place.<br/>\n<br/>\n-=-He says it&#39;s<br/>\nreally hard to sit through them, which I can understand - he is an 8yo boy and I<br/>\ncan see his body might need to move more. But many of the performances are like<br/>\n30 minutes long, not 2 hours. And he certainly can sit for 9 solid hours in<br/>\nfront of the computer, so I&#39;m not sure that sitting is a problem._+_<br/>\n<br/>\nCan you find places where he doesn&#39;t need to sit?  Stand in the back with him so you can both rock from foot to foot, or walk away a bit if it gets boring?<br/>\n<br/>\n-=-He said it&#39;s my fault for letting him be on the computer all the time, and that<br/>\nit&#39;s more interesting than anything else.-=-<br/>\n<br/>\nIf it&#39;s more interesting than anything else, then that&#39;s what he should be doing, maybe, in a way.<br/>\n<br/>\nBut maybe diving him to his friend&#39;s house an hour away, you could talk to him about how important it is for him to give some time and attention to other people and other things.   He wouldn&#39;t have a computer if his dad didn&#39;t go to work and make money, and his dad would like to spend some time with him other places, other times.<br/>\n<br/>\n-=-At home, he is really comfortable and happy. He stays on the computer from<br/>\nmorning to bedtime. He does lots of different games, and watches all kinds of<br/>\nvideos-=-<br/>\n<br/>\nDo you have an iPad that he could take with him and play games while he&#39;s out and there are alternatives?  He might, with headphones, still be nearby.   Some kids want a book, even at a restaurant.  People are more accepting of that, maybe.   It&#39;s not perfect, but it&#39;s a possible transitional option.<br/>\n<br/>\nHe won&#39;t always be eight.  And if this is going to get worse, it&#39;s going to get worse.  Trying to force him out isn&#39;t likely to make it better.  Maybe it&#39;s a phobia.  Maybe it&#39;s his way to feel powerful or get his way.  I&#39;m just guessing, because I don&#39;t know the history of the situation or the relationships.<br/>\n<br/>\nYou might also try making a deal, like if he&#39;ll go to lunch and be friendly and cooperative, then you won&#39;t ask him to go anywhere for two weeks.   Or something. <br/>\n<br/>\nWhen you DO get to go out with your husband, make it all about your husband or the surroundings, though.  Don&#39;t go there and talk about your son who&#39;s not there.  That&#39;s a big drag.  <br/>\n<br/>\nPut the spotlight on other things.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The boy who won&#39;t leave the house","postDate":"1376416429","msgId":71949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt1ZHJyZCtoZW10QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt1ZGd0aStzYmNwQGVHcm91cHMuY29tPg=="},"prevInTopic":71948,"nextInTopic":71972,"prevInTime":71948,"nextInTime":71950,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"... *************** You were available. Your husband and daughter could have gone while you and your son stayed home. They didn t have to stay. I ve taken Mo","messageBody":"<div id=\"ygrps-yiv-472033702\">&quot;saritap1119&quot; &lt;sarah@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My husband felt that I was &quot;giving in&quot; to the boy and that he was controlling the whole family.<br/>\n&gt; <br/>\n&gt; We were not in a position where I could have left our boy with another adult, no one was available.<br/>\n </span></blockquote>***************<br/>\n<br/>\nYou were available. Your husband and daughter could have gone while you and your son stayed home. They didn&#39;t have to stay. <br/>\n<br/>\nI&#39;ve taken Mo to restaurants when she wanted to go only to discover something in the environment was overwhelming to her. That&#39;s no fun for anyone. Would it really be a fun family outing if one of your family members was miserable? <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The boy who won&#39;t leave the house","postDate":"1376407931","msgId":71948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNzY0MDc5MzEuOTQ2NjYuWWFob29NYWlsTmVvQHdlYjE4MjIwNS5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGt1ZGd0aStzYmNwQGVHcm91cHMuY29tPg==","referencesHeader":"PGtzYnQ3Mys1M2g2QGVHcm91cHMuY29tPiA8a3VkZ3RpK3NiY3BAZUdyb3Vwcy5jb20+"},"prevInTopic":71947,"nextInTopic":71949,"prevInTime":71947,"nextInTime":71949,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"Before things escalated did you offer your son something special to look forward to after church? An incentive? My son loves to be home and we have had some","messageBody":"<div id=\"ygrps-yiv-248396580\">Before things escalated did you offer your son something special to look forward to after church? An incentive?<br/>\n<br/>\nMy son loves to be home and we have had some moments on antagonism because of that.<br/>\nWhat my husband and I learned is that pushing him makes him want to stay that much more.<br/>\nWhen we do not push at all and he is happy he will go out  :) unless he is really  into something at home in that moment. <br/>\nMy son is 11 so that makes it much easier as he can stay home alone. Last year at 10  we already left him home for a couple hours.  <br/>\nOne time we were going to be gone all day so I did tell him he was going with us and that I would bring everything to make it easier for him ( computers, gaming etc) as we were going to the World Dairy Expo  about 4 hours from home.  In the end he met a boy that and had a blast running around.<br/>\nHe did not go against his will and I did not have to make him. I just prepared him for it and he went with us but we try to make this as rarely as we can.<br/>\n<br/>\n At 8 I would have said we could go somewhere he really wanted after and even get him something he wanted. I would take a gaming system or laptop for him and settle him in a youth room at church. <br/>\nI would find a way to make it doable for him :)<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":219096950,"authorName":"saritap1119","from":"&quot;saritap1119&quot; &lt;sarah@...&gt;","profile":"saritap1119","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The boy who won&#39;t leave the house","postDate":"1376405234","msgId":71947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt1ZGd0aStzYmNwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtzYnQ3Mys1M2g2QGVHcm91cHMuY29tPg=="},"prevInTopic":71760,"nextInTopic":71948,"prevInTime":71946,"nextInTime":71948,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone - I m the original poster of this thread.  Here it is for easy peasy http://groups.yahoo.com/group/AlwaysLearning/message/71750. I ve really","messageBody":"<div id=\"ygrps-yiv-526927712\">Hi Everyone -<br/>\n<br/>\nI&#39;m the original poster of this thread.  Here it is for easy peasy <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/message/71750.\">http://groups.yahoo.com/group/AlwaysLearning/message/71750.</a><br/>\n<br/>\nI&#39;ve really appreciated everyone&#39;s feedback, and have felt very calm about our homebound situation.  This weekend, however, my husband got really frustrated, and I wanted to get some perspectives to help us work through it.<br/>\n<br/>\nMy husband, daughter, and I had all wanted to go out for lunch.  A lovely Sunday outing.  Our boy, predictably, did not want to go.  He felt very strongly about it and soon my husband was feeling equally strong that we should go out.  He said that the boy was &quot;holding us hostage&quot; and that if everybody else wanted to go, he should just go.  He said he is part of the family, and sometimes he just has to do stuff with the family.<br/>\n<br/>\nI felt less strongly about it.  I was disappointed, because I love to go out as a family, but I also understand where my son is right now, and we will have many outings together in the future.  My husband felt that I was &quot;giving in&quot; to the boy and that he was controlling the whole family.<br/>\n<br/>\nWe were not in a position where I could have left our boy with another adult, no one was available.  My husband and son were both really angry and hurt.  <br/>\n<br/>\nHow do I suggest balance?  <br/>\n<br/>\nSarah</div>","specialLinks":[]},{"userId":219096950,"authorName":"saritap1119","from":"&quot;saritap1119&quot; &lt;sarah@...&gt;","profile":"saritap1119","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The boy who won&#39;t leave the house","postDate":"1374426260","msgId":71760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtzaDRhayszajRoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBUHVzdEZCVkxWRXlEQVk0ZXNjZzBUekMtQjBicWg2Y1MxVWROanRjS2NzRzdSWFlqd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71755,"nextInTopic":71947,"prevInTime":71759,"nextInTime":71761,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"Good Morning Everyone (maybe not morning for you, when you are reading this, but morning for me, as I m writing this). Thank you all so very, very, very much","messageBody":"<div id=\"ygrps-yiv-1649707926\">Good Morning Everyone (maybe not morning for you, when you are reading this, but morning for me, as I&#39;m writing this).  <br/>\n<br/>\nThank you all so very, very, very much for your responses.  You have cleared my head and relieved my worries.   It is so clear to me now that I was really fixated on &quot;going out&quot; as part of some kind of curriculum.  Like he &quot;needs&quot; to be out in the world to have this full life.  I don&#39;t know where I got that!  (Ok, I do know where, but thanks for dislodging it.  Clarity.  Cool water.  Fresh air.  Thank you.)<br/>\n<br/>\nYes!   A sitter!   Yes!  Stay with dad!  Yes I can totally work around it, practically all the time.  I thought I needed to do something different, but I really don&#39;t.<br/>\n<br/>\nYesterday we had two little friends over.  Their mom had surgery, so I took the girls for the day so she could stay in bed.  My son and the big girl played Minecraft all day long.  My daughter and the little girl had a huge play dough party, painted pictures, played with Barbies and ponies, dressed up in costumes and ran all around.  The girls were here for 8 hours, through lunch and dinner.  I made pizza and noodles, vegetable soup, chocolate chip cookies, mac and cheese.  I talked them through disagreements, washed paint off of toes, took the little ones to the store, listened to a pod cast, drank a lot of coffee...<br/>\n<br/>\nMy husband got up around noon, and played a video game for 7 straight hours, not moving, ever.  I brought him his lunch and some cookies.  He came down for dinner and washed the immense pile of dishes I had created.<br/>\n<br/>\nThe thing is, I would go INSANE sitting at the computer for 7 hours.  I just can&#39;t do it.  I would go INSANE sitting in the house all day.  But my husband LOVES it.  He found his bliss long ago.  <br/>\n<br/>\nAnd I like running around.  I like cooking and having projects and loads to read and lots to do.  So, I can see how my boy has found his bliss, and how I can get in the way of it.  <br/>\n<br/>\nYes, I was pushing too hard.  I didn&#39;t get that before.  Yes, I can see now how he might be more resistant because of that, or even how it could feel that I don&#39;t really &quot;get him&quot;.  I didn&#39;t.  I didn&#39;t see it, and now I do!<br/>\n<br/>\nThank you all,<br/>\n<br/>\nSarah (who is going to go out for Vietnamese food, dip my toes in the ocean, clean the house, make bread, soak oats for tomorrow&#39;s breakfast, paint a wall, dance around the house a bit, call a friend, whirl like a Dervish, hug and kiss my family until it annoys them, and then watch Orange is the new Black later on...)</div>","specialLinks":[]},{"userId":544864751,"authorName":"Roya Dedeaux","from":"Roya Dedeaux &lt;royadedeaux@...&gt;","profile":"royadedeaux","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: The boy who won&#39;t leave the house","postDate":"1374344274","msgId":71755,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUHVzdEZCVkxWRXlEQVk0ZXNjZzBUekMtQjBicWg2Y1MxVWROanRjS2NzRzdSWFlqd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGtzZTQzMStlbjM2QGVHcm91cHMuY29tPg==","referencesHeader":"PGtzYnQ3Mys1M2g2QGVHcm91cHMuY29tPgk8a3NlNDMxK2VuMzZAZUdyb3Vwcy5jb20+"},"prevInTopic":71754,"nextInTopic":71760,"prevInTime":71754,"nextInTime":71756,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"==At the same time, travelling from your home to wherever you re going may be uncomfortable for him in any number of ways  == Also - if he is the type of","messageBody":"<div id=\"ygrps-yiv-1778304891\">==At the same time, travelling from your home to wherever you&#39;re going may<br/>\nbe uncomfortable for him in any number of ways  ==<br/>\n<br/>\nAlso - if he is the type of person who wants to spend many hours on<br/>\nsomething, then even leaving for a little while is disrupting - even if<br/>\nthere&#39;s &quot;no wait&quot; at the bakery, it means a pause in whatever he is doing.<br/>\nIf he is involved in games or online things with other people, then it<br/>\ndisrupts their entire situation as well. I know when I am involved in<br/>\nsomething I want to do (in my case, knitting for hours) then it is the most<br/>\nfrustrating thing to be asked to do something else - even if it is a short<br/>\nerrand. My husband plays a game online that relies on other people and has<br/>\nno pause button, and I had to realize that when I am interrupting him, I am<br/>\nalso interrupting 9 other very invested individuals, which reflects on his<br/>\nfuture ability to form teams and play his game at the level he wants to<br/>\nplay at.<br/>\n<br/>\nIt sounds like you are lucky to have a child who is so articulate about<br/>\nwhat he wants and even has ideas for how you can make it happen for him.<br/>\n<br/>\n*Roya Dedeaux, M.S.*<br/>\nMarriage and Family Therapist Intern #73122<br/>\nwww.royadedeaux.com<br/>\n(657) 464-ROYA<br/>\n<br/>\n*&quot;art washes away from the soul the dust of everyday life&quot; - Pablo Picasso*<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jul 20, 2013 at 6:41 AM, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;saritap1119&quot; &lt;sarah@...&gt; wrote:<br/>\n&gt; &gt;He says it&#39;s really hard to sit through them, which I can understand - he<br/>\n&gt; is an 8yo boy and I can see his body might need to move more. But many of<br/>\n&gt; the performances are like 30 minutes long, not 2 hours.<br/>\n&gt; ***************<br/>\n&gt;<br/>\n&gt; He probably can&#39;t pin down and articulate all of what makes him<br/>\n&gt; uncomfortable. Going out at all may be an awkward, stressful transition for<br/>\n&gt; him - it is for me, something I need to &quot;work up to&quot; a little, so it&#39;s much<br/>\n&gt; harder to go out if I&#39;m not enthusiastic about where I&#39;m going.<br/>\n&gt;<br/>\n&gt; At the same time, travelling from your home to wherever you&#39;re going may<br/>\n&gt; be uncomfortable for him in any number of ways - he may feel exposed if you<br/>\n&gt; don&#39;t have your own car, plus he&#39;s unable to read or watch a movie or play<br/>\n&gt; a game while walking or negotiating public transportation. If you do have<br/>\n&gt; your own car its still a transition and the car ride itself could be dull<br/>\n&gt; and/or uncomfortable, especially riding in city traffic - it&#39;s much harder<br/>\n&gt; to focus on reading and can be outright impossible to do anything which<br/>\n&gt; requires manual dexterity while riding in traffic. And Then he&#39;s still got<br/>\n&gt; to sit through something he may or may not like, might no longer be in the<br/>\n&gt; mood for after travelling, or might like so much he doesn&#39;t want it to end<br/>\n&gt; and then he&#39;s stuck facing the return trip. So when you suggest going out,<br/>\n&gt; he&#39;s remembering all those uncomfortable feelings and weighing them against<br/>\n&gt; possible short-term enjoyment and the fact that, with the internet at his<br/>\n&gt; fingertips, he can probably find something just as enjoyable in the comfort<br/>\n&gt; and security of his own home.<br/>\n&gt;<br/>\n&gt; He may also feel like he&#39;s under a lot of pressure from you, so he&#39;s<br/>\n&gt; resisting going out any more than he &quot;has to&quot;. That&#39;s a pretty normal human<br/>\n&gt; response - it&#39;s essentially the same as if he felt like you were trying to<br/>\n&gt; limit something he loves. To him, you&#39;re trying to limit the safety and<br/>\n&gt; comfort of Home by trying to get him to go out, so he&#39;s holding on to what<br/>\n&gt; he has as tightly as possible.<br/>\n&gt;<br/>\n&gt; Instead of trying to get him to go out, plan for him to be home. Assume<br/>\n&gt; you&#39;ll need to set things up so you can go out without him and let him know<br/>\n&gt; what the plans are. Hire a sitter as much as you possibly can. Plan some<br/>\n&gt; outings for times when someone else can be home to hang out with him - dad<br/>\n&gt; or friends. If you&#39;re just going to run down the block for something, can<br/>\n&gt; you leave him home alone? How long are you all comfortable with him being<br/>\n&gt; home alone? Can you call or text and stay in contact so you can stretch<br/>\n&gt; that out a little? (again, that may be harder if you&#39;re relying on public<br/>\n&gt; transportation) Give him the space and time so that he can feel like he&#39;s<br/>\n&gt; Really choosing to go out, not that he&#39;s finally worn down enough to give<br/>\n&gt; in.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: The boy who won&#39;t leave the house","postDate":"1374327713","msgId":71754,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtzZTQzMStlbjM2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtzYnQ3Mys1M2g2QGVHcm91cHMuY29tPg=="},"prevInTopic":71753,"nextInTopic":71755,"prevInTime":71753,"nextInTime":71755,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"... *************** He probably can t pin down and articulate all of what makes him uncomfortable. Going out at all may be an awkward, stressful transition for","messageBody":"<div id=\"ygrps-yiv-1511373454\">&quot;saritap1119&quot; &lt;sarah@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;He says it&#39;s really hard to sit through them, which I can understand - he is an 8yo boy and I can see his body might need to move more.  But many of the performances are like 30 minutes long, not 2 hours.<br/>\n </span></blockquote>***************<br/>\n<br/>\nHe probably can&#39;t pin down and articulate all of what makes him uncomfortable. Going out at all may be an awkward, stressful transition for him - it is for me, something I need to &quot;work up to&quot; a little, so it&#39;s much harder to go out if I&#39;m not enthusiastic about where I&#39;m going. <br/>\n<br/>\nAt the same time, travelling from your home to wherever you&#39;re going may be uncomfortable for him in any number of ways - he may feel exposed if you don&#39;t have your own car, plus he&#39;s unable to read or watch a movie or play a game while walking or negotiating public transportation. If you do have your own car its still a transition and the car ride itself could be dull and/or uncomfortable, especially riding in city traffic - it&#39;s much harder to focus on reading and can be outright impossible to do anything which requires manual dexterity while riding in traffic. And Then he&#39;s still got to sit through something he may or may not like, might no longer be in the mood for after travelling, or might like so much he doesn&#39;t want it to end and then he&#39;s stuck facing the return trip. So when you suggest going out, he&#39;s remembering all those uncomfortable feelings and weighing them against possible short-term enjoyment and the fact that, with the internet at his fingertips, he can probably find something just as enjoyable in the comfort and security of his own home. <br/>\n<br/>\nHe may also feel like he&#39;s under a lot of pressure from you, so he&#39;s resisting going out any more than he &quot;has to&quot;. That&#39;s a pretty normal human response - it&#39;s essentially the same as if he felt like you were trying to limit something he loves. To him, you&#39;re trying to limit the safety and comfort of Home by trying to get him to go out, so he&#39;s holding on to what he has as tightly as possible. <br/>\n<br/>\nInstead of trying to get him to go out, plan for him to be home. Assume you&#39;ll need to set things up so you can go out without him and let him know what the plans are. Hire a sitter as much as you possibly can. Plan some outings for times when someone else can be home to hang out with him - dad or friends. If you&#39;re just going to run down the block for something, can you leave him home alone? How long are you all comfortable with him being home alone? Can you call or text and stay in contact so you can stretch that out a little? (again, that may be harder if you&#39;re relying on public transportation) Give him the space and time so that he can feel like he&#39;s Really choosing to go out, not that he&#39;s finally worn down enough to give in. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The boy who won&#39;t leave the house","postDate":"1374321760","msgId":71751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwOEMzMzI1LTY0REUtNEI3OC1CNDNBLUIzOEVBNkNCMDRGMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtzYnQ3Mys1M2g2QGVHcm91cHMuY29tPg==","referencesHeader":"PGtzYnQ3Mys1M2g2QGVHcm91cHMuY29tPg=="},"prevInTopic":71750,"nextInTopic":71752,"prevInTime":71750,"nextInTime":71752,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"-=-He suggests I get a sitter for him so he can be home all the time. And yes, I wonder if this is normal.-=- I think if you could do that, it would be a good","messageBody":"<div id=\"ygrps-yiv-22246720\">-=-He suggests I get a sitter for him so he can be home all the time. And yes, I wonder if this is normal.-=-<br/>\n<br/>\nI think if you could do that, it would be a good idea.<br/>\n<br/>\nHe&#39;s young.  In some cultures or in some strata of cultures, he could live in a large house with other people and servants and never leave for a year.  If you can afford one temporary servant, consider that you live on a great estate, and you&#39;re going out but he is staying.<br/>\n<br/>\nIt&#39;s not as big a deal as school culture makes it seem.<br/>\n<br/>\nAND, odd but maybe useful:  What if it WERE a phobia?  It doesn&#39;t sound like it, but what if he were entirely agoraphobic, or paraplegic, or in an iron lung and couldn&#39;t go out.  Then what?  I think you would hire nurses to stay with him sometimes, and you would go and do other things.  <br/>\n<br/>\nBut he&#39;s not tied to a machine.  He has full use of his physical body.  So those are things to be grateful for.  And if he wants to go out, you have the means to take him!  More abundance.  <br/>\n<br/>\nI doubt he will want to stay home forever, but if he does, isn&#39;t it wonderful that the internet connects people so well these days?  I have no idea where you are, on earth, nor your boy, nor where your husband&#39;s office is.  I&#39;m sitting at the dining room table of friends who live west of London, in Surrey.  Within a week, I will be at the table in my own kitchen in Albuquerque, but my posts will look the same.<br/>\n<br/>\n&quot;Not leaving the house&quot; in 2013 is not what it was in other times and places.  It&#39;s probably more private and isolated now than it will be when your son is grown!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":343381924,"authorName":"lucy.web","from":"&quot;lucy.web&quot; &lt;lucy.web@...&gt;","profile":"lucylists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] The boy who won&#39;t leave the house","postDate":"1374320769","msgId":71753,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4RTIyQzkzLTNGNTYtNEFCRi1BRTlELTY3QTNBRjNGNDIwMkBtYWMuY29tPg==","inReplyToHeader":"PGtzYnQ3Mys1M2g2QGVHcm91cHMuY29tPg==","referencesHeader":"PGtzYnQ3Mys1M2g2QGVHcm91cHMuY29tPg=="},"prevInTopic":71752,"nextInTopic":71754,"prevInTime":71752,"nextInTime":71754,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"... I am highly introverted.   I would be very happy to stay home almost all of the time.   I don t have a phobia of being out and about, or of crowds, or","messageBody":"<div id=\"ygrps-yiv-2100752979\">On 19 Jul 2013, at 19:32, saritap1119 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On the other hand, I don&#39;t know what to make of the situation. I just want to understand. <br/>\n<br/>\n<br/>\n </span></blockquote>I am highly introverted.   I would be very happy to stay home almost all of the time.   I don&#39;t have a phobia of being out and about, or of crowds, or other people, or social situations, or anything like that ... I just prefer to be at home, doing my own stuff, and if it was only me to think about I can imagine very rarely going out.   I have pretty much everything I need right here.  ;)<br/>\n<br/>\nAs it is, I do go out, at least once a week.   We go grocery shopping, run errands, visit places and other people, etc.   I&#39;m perfectly capable, it&#39;s just that it&#39;s not what I would choose to do if there wasn&#39;t an immediate need to do some of those things.   I don&#39;t find those things particularly enjoyable, even though almost everyone else seems to.   I like to go to restaurants every so often, but mostly because it&#39;s a treat for me to have someone else do the cooking and that makes up for all the not-so-good things about it.   That probably wouldn&#39;t factor into a child&#39;s decision to go / not go.<br/>\n<br/>\nI don&#39;t feel &#39;bored&#39; by being out of the house and doing the necessary day-to-day things.   But if I were an 8 year old I might end up describing it like that, to someone who didn&#39;t quite get it.   <br/>\n<br/>\nIn a couple of weeks, we have a family &#39;holiday&#39; planned.  2 nights and 3 days at a lovely safari park.   I am looking forward to it, but I know it&#39;s going to take a huge amount of my energy, and I am probably going to want to stay home for a long time afterwards.   Even though it&#39;s a really enjoyable thing to do, it is going to drastically deplete me, rather than invigorate and energise me.   That&#39;s one of the big differences between introverts and extraverts.   Introverts are (generally) depleted by those sorts of activities, and need lots of time alone (or with just their close family) to compensate.   Extroverts get their energy from doing stuff out and about with other people.   <br/>\n<br/>\nI had a complete collapse and was diagnosed with chronic fatigue syndrome when I was 18 years old.   More and more, these days, I wonder if my symptoms were actually mostly down to being an extreme introvert in an extrovert world.   I wasn&#39;t unschooled and nobody enabled me to just be myself: instead I was expected to do all the things that other people thought I should find enjoyable, and was made to feel very odd for not enjoying doing those things.<br/>\n<br/>\nWould something like an ipad mean that your son would be happier to accompany you and your daughter while you are out and about, as a last resort?   Could he bring the laptop with him when it&#39;s unavoidable for you to go out?   I like his idea of hiring a baby sitter best, though!   <br/>\n<br/>\nLucy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":451458129,"authorName":"Stephanie Mitchell","from":"Stephanie Mitchell &lt;naturelovingmom@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"re: [AlwaysLearning] The boy who won&#39;t leave the house","postDate":"1374319576","msgId":71752,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxZWE3NDA2LjY1MzQ0NDBhLjc4OTEuZmZmZjkxNmNAbXguZ29vZ2xlLmNvbT4="},"prevInTopic":71751,"nextInTopic":71753,"prevInTime":71751,"nextInTime":71753,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"Hi Sarah, Could you bring his world in to yours so you can go out some times? Maybe he could take his laptop or an ipad etc out to eat, and play his games","messageBody":"<div id=\"ygrps-yiv-2123613083\">Hi Sarah,<br/>\nCould you &quot;bring his world&quot; in to yours so you can go out some <br/>\ntimes?<br/>\nMaybe he could take his laptop or an ipad etc out to eat, and <br/>\nplay his games etc there.  That way both needs are met.<br/>\nSteph</div>","specialLinks":[]},{"userId":219096950,"authorName":"saritap1119","from":"&quot;saritap1119&quot; &lt;sarah@...&gt;","profile":"saritap1119","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"The boy who won&#39;t leave the house","postDate":"1374255139","msgId":71750,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtzYnQ3Mys1M2g2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":71751,"prevInTime":71749,"nextInTime":71751,"topicId":71750,"numMessagesInTopic":0,"msgSnippet":"Hi All Hope you can offer some insight here.  My son is 8 1/2.  He does not like to leave the house, like ever.  He will stay home for weeks on end.  It began","messageBody":"<div id=\"ygrps-yiv-366063006\">Hi All<br/>\n<br/>\nHope you can offer some insight here.  My son is 8 1/2.  He does not like to leave the house, like ever.  He will stay home for weeks on end.  It began gradually, when he started to get less enthusiastic about going to our normal places like museums, aquariums, park days, play spaces, etc.  Then he didn&#39;t want to go to friends&#39; houses, and instead only wanted them to come to our house.  Now he won&#39;t go out to eat, even to a favorite restaurant.  I can&#39;t even get him to go out to a bakery to pick out a cookie, or to get an ice cream.  <br/>\n<br/>\nAt home, he is really comfortable and happy.  He stays on the computer from morning to bedtime.  He does lots of different games, and watches all kinds of videos.  We also have friends come over several times a week (or as often as I can get them), so he has lots of social connections.  His 4 1/2 yo sister and I are home with him full-time.  His dad works full-time, but is flexible with his time and is around to chat and hang out.  <br/>\n<br/>\nOn the one hand, I&#39;m really happy that he has found something he loves, and that the computer offers this immense, gigantic world for him.  He explores and learns and is entertained all day long.  I see his mind is alive and his eyes are bright.  I&#39;m grateful that we have friends that are willing to come over and spend days with us.  I know his friends love to be here too (they can ride scooters around the living room, eat pizza, make big messes, it&#39;s a fun house)  I&#39;m proud that our life at home is comfortable and fulfilling for him.  <br/>\n<br/>\nOn the other hand, I don&#39;t know what to make of the situation.  I just want to understand.  I do accommodate him, I save errands for the weekends or mornings that my husband is home.  My daughter definitely wants to be out in the world, so I take her to events when I can get a sitter for my son.  But it&#39;s not as much as she would like, or as I would like.  It feels really claustrophobic to me, not for him, but for me.  I would love to get out in the world more.  We live in a big city, and I love going to museums and performances, the beach and the mountains.  It is frustrating for me that we don&#39;t go out more than we do.  <br/>\n<br/>\nMy son tells me that going out to all the museums and play spaces feels really boring.  We have been to all of them a million times, and I totally understand that he might be sick of them (although my daughter isn&#39;t, and I wish I could take her more).  He has never been a super fan of parks and the beach, so I understand that one too.  <br/>\n<br/>\nDuring the summer, there are millions of different performances for kids.  Everything from magic to dance to music to puppet shows and story readings.  It&#39;s so broad, but he doesn&#39;t want to even consider any of those.  He says it&#39;s really hard to sit through them, which I can understand - he is an 8yo boy and I can see his body might need to move more.  But many of the performances are like 30 minutes long, not 2 hours.  And he certainly can sit for 9 solid hours in front of the computer, so I&#39;m not sure that sitting is a problem.  <br/>\n<br/>\nAnd it doesn&#39;t explain things like not wanting to go get a frozen yogurt, which he loves.  He just doesn&#39;t want to GO there, although he would be happy for me to go get him one.  Or going to a bakery to get a treat, there is no waiting involved, but he doesn&#39;t want to go (again, I can go bring him something, it&#39;s just that he doesn&#39;t want to leave the house).  <br/>\n<br/>\nLast night I mentioned that I would like to go to his favorite restaurant for lunch today, and he got really mad, started to cry, demanded not to go.  The first thing he said this morning was that he was not going out today.  He and I can really talk and connect, so I probed further.  He said it&#39;s really hard to do all the waiting, like after you order you have to wait for the food, then you have to wait for the check, and he says his back gets sweaty and he gets really bored.  I bring books and toys, and encourage him to bring what he thinks might occupy him, but it doesn&#39;t help.<br/>\n<br/>\nHe said it&#39;s my fault for letting him be on the computer all the time, and that it&#39;s more interesting than anything else.  I do get that perspective, but I don&#39;t understand how it is so painful for him to do anything else.  He literally would cry all the way to the restaurant, not talk to us or make eye contact at the restaurant, and then storm upstairs when we would get home.<br/>\n<br/>\nI don&#39;t know that it feels like a phobia, but I sometimes wonder.<br/>\n<br/>\nThere are a couple of places I can get him to go.  One is this one friend&#39;s house, about an hour away.  They have a huge tv and lots of video games.  He likes to go there, and we can manage it about once a month.  The other is his dad&#39;s office, where he will bring a laptop and play games/watch his shows.  It&#39;s sort of a sitter-stop-gap when my daughter and I would really like to go somewhere.  But it only works if my husband is not especially busy, or has to be out for meetings, so it&#39;s not very regular.  <br/>\n<br/>\nAnyway, I don&#39;t know how all this sounds and how I can help.  It&#39;s not so much that I think going out in the world is so critical for him, but there are things I would like to do, things my daughter would like to do. And we can&#39;t do them because my son wants to stay home and gets really angry if we push the issue.  He suggests I get a sitter for him so he can be home all the time.  And yes, I wonder if this is normal.<br/>\n<br/>\nOk thanks in advance<br/>\n<br/>\nSarah</div>","specialLinks":[]}],"prevTopicId":72014,"nextTopicId":72029}}