{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":26,"messages":[{"userId":86585859,"authorName":"meghan anderson","from":"meghan anderson &lt;moonmeghan@...&gt;","profile":"moonmeghan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Need your Experience","postDate":"1012821223","msgId":4110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjA0MTExMzQzLjQ3OTAyLnFtYWlsQHdlYjIwOTAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMTI1Nzg5NDcuMTg1MC40OTUwNC5tNEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":4027,"nextInTopic":0,"prevInTime":4109,"nextInTime":4111,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":" Pam Oooh, this sounds so familiar!  Meghan ","messageBody":"<div id=\"ygrps-yiv-614824017\">&lt;&lt;&lt;&lt;Mikey<br/>\n(4) says in her quelling English nanny voice, &quot;No,<br/>\nthank you&quot;. Very<br/>\nrepressing. &lt;g&gt;<br/>\n<br/>\nPam&gt;&gt;&gt;&gt;<br/>\n<br/>\nOooh, this sounds so familiar! &lt;g&gt;<br/>\n<br/>\nMeghan<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nGreat stuff seeking new owners in Yahoo! Auctions! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com\">http://auctions.yahoo.com</a></div>","specialLinks":[]},{"userId":1339984,"authorName":"Dan Vilter","from":"Dan Vilter &lt;dvilter@...&gt;","profile":"dvilter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012722528","msgId":4027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4ODIyQjVGLjc1OTElZHZpbHRlckBtYWMuY29tPg==","inReplyToHeader":"PDg4LjEzM2U0OTgyLjI5OGM5YjdkQGFvbC5jb20+"},"prevInTopic":3955,"nextInTopic":4110,"prevInTime":4026,"nextInTime":4028,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"... When I was 10 to about 18 years old I did a fair amount of woodworking.  My mom brought home a book from the library (which she left laying around for me","messageBody":"<div id=\"ygrps-yiv-724360064\">on 2/1/02 5:31 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Lots of old furniture (and some new stuff,<br/>\n&gt; though I can&#39;t afford good new stuff!) has veneer made of facing slices, so<br/>\n&gt; that one side is the mirror image of the other.  All the doors in my college<br/>\n&gt; dormitory were like that--the outside was two facing pieces sliced and opened<br/>\n&gt; up.  It&#39;s fun to go to lumber yards sometimes and see patterns on wood.<br/>\n<br/>\n<br/>\n </span></blockquote>When I was 10 to about 18 years old I did a fair amount of woodworking.  My<br/>\nmom brought home a book from the library (which she left laying around for<br/>\nme to discover) on marquetry, where pictures are made of inlaid veneers of<br/>\nwood.  I was fascinated. It started off talking about the &quot;Book Matches&quot; of<br/>\ngrain you describe in this post, and of the many aesthetic decisions to make<br/>\nbased on the veneers you have, balance, harmony, line, form, and visual<br/>\ntexture.  At about the same time I saw a television program on what makes<br/>\nStradivarius Violins so revered. They mentioned, among many things, the book<br/>\nmatching of the wood blanks that become the front and back of the<br/>\ninstrument.  It was the careful selection of the matching grains that not<br/>\nonly balance the visual aesthetic but physically balance the tone or timbre<br/>\nthat acoustically radiates from the finished violin.<br/>\n<br/>\nI was in heaven to discover the relationships of the physical wood grains to<br/>\nvisual and aural beauty of the instrument.<br/>\n<br/>\n-Dan Vilter<br/>\nWho had to skip all the posts for Monday, Tuesday, Wednesday and half of<br/>\nThursday to find himself caught up on the posts of interest in<br/>\nAlwaysLearning &lt;G&gt;</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012666186","msgId":3955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Yy44MjQ2ODZiLjI5OGQ2OTRhQGFvbC5jb20+"},"prevInTopic":3943,"nextInTopic":4027,"prevInTime":3954,"nextInTime":3956,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/02 2:35:26 AM, felesina@cwnet.com writes: ","messageBody":"<div id=\"ygrps-yiv-744371927\">In a message dated 2/2/02 2:35:26 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:felesina@...\">felesina@...</a> writes:<br/>\n<br/>\n&lt;&lt; my point was that if you ask<br/>\nyourself &quot;would I suggest that to a friend?&quot; it is easy to see when you have<br/>\na hidden agenda (like &quot;maybe this will get him to read&quot;), because with<br/>\nfriends you (hopefully) are less attached to what they do with your<br/>\ninfo/stuff.  &gt;&gt;<br/>\n<br/>\nOH!  I get your point.  Thanks.<br/>\n<br/>\nI didn&#39;t give books on medieval history to other SCA friends who didn&#39;t care <br/>\nso much about authenticity with the thought that they would get a clue or <br/>\nremediate themselves or get interested in something they didn&#39;t have any <br/>\nnatural interest in before.<br/>\n<br/>\nI&#39;m augmenting existing fascinations, not trying to build them from scratch.<br/>\n<br/>\n&lt;&lt; making sure Holly<br/>\nhas<br/>\n<blockquote><span title=\"ireply\"> &gt; room cleaning her room&gt;&gt;<br/>\n<br/>\n </span></blockquote>That was supposed to be &quot;help cleaning her room&quot; but sometimes room is help. <br/>\n&lt;g&gt;<br/>\n<br/>\n&lt;&lt;I am talking about freeing your self from worry and fear-  and just enjoying<br/>\nthe love and sharing that life has to offer. &gt;&gt;<br/>\n<br/>\nOkay.  I&#39;m sorry I reacted with the YIKES! WHAT? strength of my response.  <br/>\nYour commentary made it all the same with different labels for me.<br/>\n<br/>\n&lt;&lt;That I told her of ballet shows my limitations- I didnt tell her about irish<br/>\ndancing, modern, Balinese, etc at first, because I didnt know about them-<br/>\nnot in my background at the time&gt;&gt;<br/>\n<br/>\nHolly loves to dance but she&#39;s not so graceful.  She does learn the routines <br/>\nand she&#39;s good musically, but her body isn&#39;t naturally expressive.  She&#39;s <br/>\ntaken a few dance classes, and was at a(n expensive) dance camp last summer.  <br/>\n<br/>\nYesterday she said &quot;I&#39;d like to try clogging.&quot;  She said it because she was <br/>\nwatching Reading Rainbow and it was about cloggers.   I do need to look for <br/>\nsomething for her because that might be just the kind of dance she could be <br/>\ngood at.  It&#39;s more rhythm and strength than bodily expression and contortion.<br/>\n<br/>\nBut first on our financial Holly list are a drama class and braces (her <br/>\nrequest and insistence, I wouldn&#39;t care).  <br/>\n<br/>\n&lt;&lt;(&quot;I am thinking this game I brought to the dinner party will<br/>\nexpose them to bigger words- they have such a small vocabulary...&quot; hee)&gt;&gt;<br/>\n<br/>\nWe did one time do a weekend thing with the protege (squire-like thing) of an <br/>\nSCA friend in another city.  His local friends were totally unable to get <br/>\nthrough to him on some things which were holding back his SCA advancement.<br/>\n<br/>\nMy own students had made some noticeable changes, and so his teacher asked if <br/>\nwe could maybe talk to his, and try to undo some of his arrogance and <br/>\nself-centeredness.  We&#39;d been doing a lot of work on selflessness and service <br/>\nand modesty, so we said sure.<br/>\n<br/>\n(I should note before I tell this next part that we&#39;re all still really good <br/>\nfriends, and that this guy is now a landed baron, meaning the ceremonial head <br/>\nof a large SCA group, and is noted for his consideration of others.  <br/>\nSeriously.)<br/>\n<br/>\nSo the first tactic was to play some high-powered kind of games Saturday <br/>\nnight.  One is a flea-market find called Picture Picture, in which people all <br/>\nlook at a picture (there are bunch of interesting things in the box, but <br/>\nwe&#39;ve used album covers and other stuff too) and write down a word starting <br/>\nwith each letter of the alphabet, as much as you can do in 90 seconds, and <br/>\nyou get points for exclusive answers.  <br/>\n<br/>\nThe visitor/victim/client was really proud of his intellect, and being fresh <br/>\nout of college and having been a gifted student, blahdyblah, had much of his <br/>\nself esteem tied up in being smarter than others around him.  He didn&#39;t look <br/>\nmuch past that, in fact.  If there was a disagreement about something, he <br/>\nmentally declared himself the winner because his IQ was higher.  I hope none <br/>\nof you have ever met anyone like that.<br/>\n<br/>\nSo we sweetly, and kindly, and gently kicked his ass at a word and concept <br/>\ngame.<br/>\n<br/>\nThat was the first boot-camp move.  And it truly did help.  We set the stage <br/>\nfor the rest of the weekend.<br/>\n<br/>\nThat&#39;s not the best of unschooling tactics, but at that stage we were in a <br/>\nrehabilitation situation, and he had to be all taken down and built back up <br/>\nand safely at work in another state on Monday!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":53685616,"authorName":"Bronwen","from":"&quot;Bronwen&quot; &lt;felesina@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012642261","msgId":3943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTQwMWMxYWJjYyQ2NjdlMGVlMCQ2MzZjYTJjZEBmZWxlc2luYT4=","referencesHeader":"PDEwNC4xMDU2MzJlNS4yOThjOTYyY0Bhb2wuY29tPg=="},"prevInTopic":3925,"nextInTopic":3955,"prevInTime":3942,"nextInTime":3944,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"Hi! ... path ... Sandra wrote: Uh...Holly used the globe two days ago, and rediscovered a couple of kids ... me: my point isnt *dont have stuff *- (my kids","messageBody":"<div id=\"ygrps-yiv-841288451\">Hi!<br/>\n<br/>\nI wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt; But it is a FINE FINE day when you realize that you never had to<br/>\n&gt; worry about the microscope, or the globe, or the chess book, or the tennis<br/>\n&gt; raquet at all-when you look back and realize that all those &quot;important<br/>\n </span></blockquote>path<br/>\n<blockquote><span title=\"ireply\"> &gt; developing tools&quot; are collecting dust, that you wasted your energy- &gt;&gt;<br/>\n&gt;<br/>\n </span></blockquote> Sandra wrote:<br/>\n<br/>\n Uh...Holly used the globe two days ago, and rediscovered a couple of kids&#39;<br/>\n<blockquote><span title=\"ireply\"> &gt; books on maps.  She LOVES maps.  What if we didn&#39;t have those things?<br/>\n<br/>\n </span></blockquote>me:<br/>\nmy point isnt *dont have &quot;stuff&quot;*- (my kids love the globe too), or that all<br/>\ntools are stupid.<br/>\njust dont *worry* that there is something that you MUST have (and you arent<br/>\nsure what it<br/>\nis..) to provide for them- that they will let us know if they really need,<br/>\nwant, like something. (after all you *do* have maps- right?- cause she likes<br/>\nthem (or someone did)? right? and if she wanted more, you&#39;d get them)<br/>\n<br/>\nI wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;Something that might help is to say to yourself-<br/>\n&gt;<br/>\n&gt; &lt;&lt;* would I say, suggest, offer, that to my adult friend in a similar<br/>\n&gt; situation? &gt;&gt;<br/>\n&gt;<br/>\n </span></blockquote>Sandra:<br/>\n And yes I DO make such offerings to my friends.  &quot;Do you want to see a<br/>\n<blockquote><span title=\"ireply\"> &gt; movie?&quot;<br/>\n&gt; &quot;I found a website you might like.&quot;<br/>\n&gt; &quot;Happy Birthday!  That board game you liked at our house.&quot;<br/>\n&gt;<br/>\n&gt;  have a friend who has long been interested in medieval religious<br/>\n&gt; obscurities.  If I ever come across a book, reference or website, I send<br/>\n </span></blockquote>it<br/>\n<blockquote><span title=\"ireply\"> &gt; to him.  He sent me, for Christmas, a book with photographs of famous<br/>\n </span></blockquote>letters<br/>\n<blockquote><span title=\"ireply\"> &gt; which belong to the Crown of England.  I was thrilled.<br/>\n&gt;<br/>\n&gt; It wasn&#39;t his job, but he&#39;s my friend and knew I would love it.  He was<br/>\n </span></blockquote>right.<br/>\n<br/>\nYES!  this is exactly what i mean!  Lovely examples. you would/ do<br/>\noffer/share things with your friends/children-  my point was that if you ask<br/>\nyourself &quot;would I suggest that to a friend?&quot; it is easy to see when you have<br/>\na hidden agenda (like &quot;maybe this will get him to read&quot;), because with<br/>\nfriends you (hopefully) are less attached to what they do with your<br/>\ninfo/stuff. (&quot;I am thinking this game I brought to the dinner party will<br/>\nexpose them to bigger words- they have such a small vocabulary...&quot; hee)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;but you dont want the sharing of yourself and your ideas to be connected<br/>\n&gt; with your children&#39;s &quot;outcome&quot;- yeah?&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; Rephrase, please, if others haven&#39;t already asked you to do so.<br/>\n </span></blockquote>Everything<br/>\n<blockquote><span title=\"ireply\"> &gt; in my life will affect my children&#39;s &quot;outcome,&quot; and theirs mine.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>YES!  I agree that everything we do affects eachother.  What I mean is that<br/>\nwhen you share yourself it is not because you want a certain &quot;effect&quot; - it<br/>\nis with no strings attached-  your sharing&#39;s main purpose is just pure<br/>\ngiving. Our goal is not to *mold* our kids, right?  Our kids are already<br/>\nwhole people.  I think this is a big hurdle for many and just wanted to draw<br/>\nlight on that idea.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;I mean, you are on a totally different life path than your children, who<br/>\n&gt; knows why he is stacking chess peices?  &gt;&gt;<br/>\n&gt;<br/>\n&gt; I&#39;m not on a totally different path.  They&#39;ve been in my life since nine<br/>\n&gt; months before birth, and if things continue to go as warmly as they are,<br/>\n </span></blockquote>one<br/>\n<blockquote><span title=\"ireply\"> &gt; of us will have to die to destroy this relationship.  They do share with<br/>\n </span></blockquote>me,<br/>\n<blockquote><span title=\"ireply\"> &gt; lots, and I share with them.<br/>\n<br/>\n </span></blockquote>yes- of course.   still cant know what is going on in someone&#39;s brain-<br/>\neasier to wait for them to give you a sign as to what they want next.  The<br/>\nwoman who asked the question was talking about a small person stacking chess<br/>\npieces- not too much like playing &quot;real&quot; chess.  and she was talking about<br/>\nbeing overinvolved- carrying it way farther than the kids wanted.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;me:<br/>\n<br/>\n&gt; &lt;&lt;It is not my responsibility to make another person&#39;s day &quot;full or flat&quot;<br/>\n </span></blockquote>or<br/>\n<blockquote><span title=\"ireply\"> &gt; anything-  my responsibility is to be the best person I can be.&gt;&gt;<br/>\n&gt;<br/>\n </span></blockquote>Sandra:<br/>\n<blockquote><span title=\"ireply\"> &gt; I SO disagree with this, or rather I think it&#39;s contradictory.  The best<br/>\n&gt; person I can be is a still-fun wife, an attentive mom, and a good friend<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"ireply\"> &gt; my friends.<br/>\n<br/>\n </span></blockquote>Yes all good things to be- and part of being a &quot;good person&quot;- but while I<br/>\nwork on being a fun wife, attentive mom, and good friend- I am still not<br/>\n*responsible* for making sure someone else has a good day-...  gotta watch<br/>\nout for thinking that if your toddler falls- it is your fault.<br/>\n<br/>\nSandra:<br/>\nNone of that would preclude letting my husband know about a<br/>\n<blockquote><span title=\"ireply\"> &gt; Viking exhibit, telling Kirby someone asked about him, making sure Holly<br/>\n </span></blockquote>has<br/>\n<blockquote><span title=\"ireply\"> &gt; room cleaning her room, sitting with Marty and letting him tell me about<br/>\n&gt; something he made, and about the adventures he had spending the weekend<br/>\n </span></blockquote>with<br/>\n<blockquote><span title=\"ireply\"> &gt; a friend.  None of them asked me to do that, but I consciously wanted to<br/>\n&gt; make their days better, which makes their lives better, which makes THEM<br/>\n&gt; better.<br/>\n<br/>\n </span></blockquote>Yes- so true.  you are painting a picture of a very supportive, sharing,<br/>\ninterdependant environment.  That is what true giving and sharing looks like<br/>\nme thinks-<br/>\n<br/>\nThose are gifts you are giving- you are not obligated to give them, no one<br/>\nis going to say, &quot;Damn it! why didnt you tell me about that Viking exibit!&quot;<br/>\n<br/>\nOne thing I am trying to say (thanks for helping me clarify) is that we<br/>\nshould free ourselves from *fear*- you know, like &quot;what if he would have<br/>\nbeen a chess champion, and I never showed him the game?&quot;-<br/>\n<br/>\nand instead *trust* that we can see when someone wants, needs likes<br/>\nsomething- we will know- and we will give if we are able.    also, it is ok<br/>\nto be limited in what you can provide -because we are all &quot;limited&quot; in so<br/>\nmany ways-  I can only give what&#39;s within my scope as a person living in<br/>\nthis state, in this culture, from this background...but I feel confident<br/>\nthat there is an answer to my children&#39;s life needs within that framework.<br/>\n<br/>\n<br/>\nThis comes up for me alot because my daughter is a dancer.   People think<br/>\nthat there is some magic window- and if you dont expose them to it they can<br/>\nnever dance.. and the parents just put them in the class at &quot;the right age&quot;-<br/>\nand &quot;how, when, where did she start?&quot;  They are worried, you know? (like<br/>\n&quot;what if she was to be the next Darcy Kistler- and I blew it?&quot;)  But there<br/>\nis no way that any half consious mother (and we arent even half consious on<br/>\nthis list are we?) could not have noticed that my daughter was a mover, that<br/>\nshe might love dance.  And as it was, I hardly remember mentioning the word<br/>\n&quot;ballet&quot; at all- mostly I remember trying franticly to keep her satisfied<br/>\n(with pretend dance classes, yoga poses, different types of music, real<br/>\nballet shoes, tights, etc) until she got old enough to take real ballet<br/>\n(well, we still did pretend class at home..but then I was the student).<br/>\nThat I told her of ballet shows my limitations- I didnt tell her about irish<br/>\ndancing, modern, Balinese, etc at first, because I didnt know about them-<br/>\nnot in my background at the time,- but what I gave her satisfied and<br/>\ninspired her.<br/>\n<br/>\nI am talking about freeing your self from worry and fear-  and just enjoying<br/>\nthe love and sharing that life has to offer.  Reading examples of your<br/>\nfamily life helps us do that, Sandra.<br/>\n<br/>\nLove,<br/>\nBrowen</div>","specialLinks":[]},{"userId":74604204,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"mom2zimmy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012616028","msgId":3925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjAxLjE5MTM1NS4tOTUyOTY1LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":3918,"nextInTopic":3943,"prevInTime":3924,"nextInTime":3926,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"... Dylan always sees faces, people, animals, creatures, etc. in the patterns of wood or the lay of carpet, in the patterns on fabric or the different textures","messageBody":"<div id=\"ygrps-yiv-513775411\"><blockquote><span title=\"ireply\">&gt; In a message dated 2/1/02 1:55:49 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:homeschoolmd@...\">homeschoolmd@...</a> writes:<br/>\n <br/>\n&gt; &lt;&lt; She also says she sees patterns in everything and pointed to the <br/>\n&gt; wood on <br/>\n&gt; the side of my dresser.<br/>\n<br/>\n </span></blockquote>Dylan always sees faces, people, animals, creatures, etc. in the patterns<br/>\nof wood or the lay of carpet, in the patterns on fabric or the different<br/>\ntextures of fabric.  We used to have this old table, is that Formica?,<br/>\nwith a kind of marbleized pattern on the top; he would point out<br/>\ndifferent *people*.  He started outlining some with a pencil and pretty<br/>\nsoon we could all see them.  It was fun.  We had faces all over the<br/>\nplace.  He can look at evergreen trees and see faces in them.  <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012615134","msgId":3918,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyYjgwMWMxYWI4ZCQyYmE0MjI4MCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PDg4LjEzM2U0OTgyLjI5OGM5YjdkQGFvbC5jb20+"},"prevInTopic":3909,"nextInTopic":3925,"prevInTime":3917,"nextInTime":3919,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"From: SandraDodd@aol.com ... I hope my dd can help me see all this wonderful stuff.  I have spent my whole adult life trying to be *productive*, whatever that","messageBody":"<div id=\"ygrps-yiv-801317576\">From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n<blockquote><span title=\"ireply\"> &gt;Patterns never end. &lt;g&gt;<br/>\n<br/>\n </span></blockquote>I hope my dd can help me see all this wonderful stuff.  I have spent my whole adult life trying to be *productive*, whatever that means.  As a result, I&#39;ve missed so much.  I&#39;m going to open my eyes more and do things for the enjoyment.  Today I spent the day working through a math book I got my dd when we were doing school-at-home (I really like to work math problems) and reading and answering emails. Anyway, my point is, I was not productive but I didn&#39;t care.<br/>\n<br/>\nThe rest of your post was very helpful.  <br/>\n<br/>\nSchool-at-home would have been much easier for me.  I&#39;m really going to need to expand my interests and curiousity.  This is hard. <br/>\n<br/>\nPat<br/>\n<br/>\n<br/>\n<br/>\n      Yahoo! Groups Sponsor <br/>\n            ADVERTISEMENT<br/>\n           <br/>\n     <br/>\n     <br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012613501","msgId":3909,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4LjEzM2U0OTgyLjI5OGM5YjdkQGFvbC5jb20+"},"prevInTopic":3906,"nextInTopic":3918,"prevInTime":3908,"nextInTime":3910,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/1/02 1:55:49 PM, homeschoolmd@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-508767070\">In a message dated 2/1/02 1:55:49 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:homeschoolmd@...\">homeschoolmd@...</a> writes:<br/>\n<br/>\n&lt;&lt; She also says she sees patterns in everything and pointed to the wood on <br/>\nthe side of my dresser. I&#39;m just going to show an interest in all she is <br/>\ninterested in and see where it takes us.  When I get a better handle on this <br/>\n*new* child of mine,I&#39;ll be able to ask more directed questions. &gt;&gt;<br/>\n<br/>\nYou don&#39;t have to really ask straight out questions, though.  If she likes <br/>\nwood patterns, next time you&#39;re in a place with wood panelling and see <br/>\nsomething good, point it out.  Lots of old furniture (and some new stuff, <br/>\nthough I can&#39;t afford good new stuff!) has veneer made of facing slices, so <br/>\nthat one side is the mirror image of the other.  All the doors in my college <br/>\ndormitory were like that--the outside was two facing pieces sliced and opened <br/>\nup.  It&#39;s fun to go to lumber yards sometimes and see patterns on wood.  <br/>\n<br/>\nWe were talking about cross-cuts of wood last night because I&#39;m wanting some <br/>\ncoat buttons with Celtic designs cut in with a dremel tool.  And three button <br/>\nholes.  I want my husband and daughter, who&#39;ve been messing with knotwork, to <br/>\nmake me five unmatched (set of five different) buttons.  My husband suggested <br/>\nzebra wood.  I don&#39;t think that would be good with triangular or circle-based <br/>\nart.  I suggested curly maple.<br/>\n<br/>\nThe kids weren&#39;t even there, but eventually they&#39;ll see whatever wood gets <br/>\nchosen.  And if we&#39;re Oohing and Aahing, they&#39;ll at least look over our <br/>\nshoulders to see what&#39;s the deal.<br/>\n<br/>\nHolly&#39;s room has old wood panelling and she has found the matching patterns, <br/>\nwhich change slightly as they got deeper into the wood (or shallower).<br/>\n<br/>\nEither of us will show the other good woodgrains.<br/>\n<br/>\nPatterns never end. &lt;g&gt;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012612140","msgId":3906,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNC4xMDU2MzJlNS4yOThjOTYyY0Bhb2wuY29tPg=="},"prevInTopic":3901,"nextInTopic":3909,"prevInTime":3905,"nextInTime":3907,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/1/02 1:15:43 PM, felesina@cwnet.com writes: ","messageBody":"<div id=\"ygrps-yiv-505138622\">In a message dated 2/1/02 1:15:43 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:felesina@...\">felesina@...</a> writes:<br/>\n<br/>\n&lt;&lt; But it is a FINE FINE day when you realize that you never had to<br/>\nworry about the microscope, or the globe, or the chess book, or the tennis<br/>\nraquet at all-when you look back and realize that all those &quot;important path<br/>\ndeveloping tools&quot; are collecting dust, that you wasted your energy- &gt;&gt;<br/>\n<br/>\nUh...Holly used the globe two days ago, and rediscovered a couple of kids&#39; <br/>\nbooks on maps.  She LOVES maps.  What if we didn&#39;t have those things?  We put <br/>\nsomething else in the cup we collect to take to the museum&#39;s public <br/>\nmicroscopes.  We have two chess books  Marty really likes.  How did I waste <br/>\nmy energy?  I&#39;m sorry if things at your house are collecting dust.  Not that <br/>\nwe don&#39;t have dust, but the kids are also really happy with their stuff.  A <br/>\ncheap kids&#39; map of the U.S. with stars on states the whole family has visited <br/>\ntogether is pulled out at least every six months, and it&#39;s been used three <br/>\ntimes in the past two weeks.  It&#39;s a schooly damned map, but I bet one of the <br/>\nkids will want to keep it when they leave.<br/>\n<br/>\nI<br/>\n&lt;&lt;that you<br/>\ndont have to waste energy on other people&#39;s life any more.&gt;&gt;<br/>\n<br/>\nI&#39;m not wasting any energy on my children&#39;s lives.  We have shared lives, <br/>\nuntil they choose to leave.<br/>\n<br/>\n&lt;THIS is a fabulous question- it shows you really see how &quot;offering&quot; when<br/>\nuninvited is the antithesis of trust.&gt;&gt;<br/>\n<br/>\nThe kids won&#39;t know when to invite me to show them a Marx Brothers movie if <br/>\nthey&#39;ve never seen one.  My kids have all seen Horsefeathers, because I <br/>\nthought they&#39;d like it.  They did.  It was halfway through before Kirby (who <br/>\nhad stood watching it without ever sitting down) said &quot;Is this in black and <br/>\nWHITE?&quot;    And today, in the mail/rental DVD, came Duck Soup.  I haven&#39;t seen <br/>\nit since I was a teen, and I want to share it with any kids who want.  Any <br/>\nwho are otherwise occupied can see it later, but watching movies with others <br/>\nis more fun for me than watching them alone.<br/>\n<br/>\n<br/>\n&lt;&lt;Something that might help is to say to yourself-<br/>\n<br/>\n&lt;&lt;* would I say, suggest, offer, that to my adult friend in a similar<br/>\nsituation? &gt;&gt;<br/>\n<br/>\nAnd yes I DO make such offerings to my friends.  &quot;Do you want to see a <br/>\nmovie?&quot;  <br/>\n&quot;I found a website you might like.&quot;<br/>\n&quot;Happy Birthday!  That board game you liked at our house.&quot;<br/>\n<br/>\n have a friend who has long been interested in medieval religious <br/>\nobscurities.  If I ever come across a book, reference or website, I send it <br/>\nto him.  He sent me, for Christmas, a book with photographs of famous letters <br/>\nwhich belong to the Crown of England.  I was thrilled.<br/>\n<br/>\nIt wasn&#39;t his job, but he&#39;s my friend and knew I would love it.  He was right.<br/>\n<br/>\nLast time I went to Pam Sorooshian&#39;s house, I took her daughter (who&#39;s still <br/>\non the list, maybe?) a piano book.  If I had waited for Roxanna to ask me for <br/>\na piano book, I guess I&#39;d still be waiting.  She didn&#39;t know I had any, and <br/>\nhad never heard of Clementi.  But I had heard her play, and figured it was <br/>\nsomething she might enjoy.  What I didn&#39;t know was that she could open it and <br/>\nsight read from it (not full speed, but definitely fluent reading).  And what <br/>\nI REALLY didn&#39;t know is that she had never had a piano lesson but had learned <br/>\nall that on her own, at home.<br/>\n<br/>\nWho was harmed in that scenario?  I think everyone involved benefitted.<br/>\n<br/>\n&lt;if not, you are &quot;teaching&quot;- you have switched your focus from<br/>\nyourself to your children and what they &quot;need&quot;&gt;&gt;<br/>\n<br/>\nThat&#39;s parenting, not teaching.<br/>\n<br/>\n&lt;&lt;&gt; It doesn&#39;t have to be done at any one moment, just incorporate his<br/>\ninterest<br/>\n<blockquote><span title=\"ireply\"> &gt; in chess pieces into your daily considerations until the time when he<br/>\n </span></blockquote>knows<br/>\n<blockquote><span title=\"ireply\"> &gt; more about it than you do (unless you&#39;re a whiz, and then sorry for the<br/>\n&gt; assumption that you weren&#39;t).<br/>\n<br/>\n </span></blockquote>&lt;&lt;but you dont want the sharing of yourself and your ideas to be connected<br/>\nwith your children&#39;s &quot;outcome&quot;- yeah?&gt;&gt;<br/>\n<br/>\nIf they&#39;re not interested, I&#39;ll be able to tell.  If they ARE interested, I <br/>\ndid them a favor.<br/>\n<br/>\nThere was a time when it kinda hurt my feelings if Kirby (the experimental <br/>\nmodel, oldest child) would show a profound lack of interest in something I <br/>\nthought was fun, but I got over that.  It certainly didn&#39;t make me quit <br/>\noffering to share things with him, I just quit taking the response personally.<br/>\n<br/>\n&lt;&lt;<br/>\n&lt;&lt;but you dont want the sharing of yourself and your ideas to be connected<br/>\nwith your children&#39;s &quot;outcome&quot;- yeah?&gt;&gt;&gt;&gt;<br/>\n<br/>\nRephrase, please, if others haven&#39;t already asked you to do so.  Everything <br/>\nin my life will affect my children&#39;s &quot;outcome,&quot; and theirs mine.<br/>\n<br/>\n&lt;&lt;I mean, you are on a totally different life path than your children, who<br/>\nknows why he is stacking chess peices?  &gt;&gt;<br/>\n<br/>\nI&#39;m not on a totally different path.  They&#39;ve been in my life since nine <br/>\nmonths before birth, and if things continue to go as warmly as they are, one <br/>\nof us will have to die to destroy this relationship.  They do share with me, <br/>\nlots, and I share with them.<br/>\n<br/>\n&lt;&lt;It is not my responsibility to make another person&#39;s day &quot;full or flat&quot; or<br/>\nanything-  my responsibility is to be the best person I can be.&gt;&gt;<br/>\n<br/>\nI SO disagree with this, or rather I think it&#39;s contradictory.  The best <br/>\nperson I can be is a still-fun wife, an attentive mom, and a good friend to <br/>\nmy friends.  None of that would preclude letting my husband know about a <br/>\nViking exhibit, telling Kirby someone asked about him, making sure Holly has <br/>\nroom cleaning her room, sitting with Marty and letting him tell me about <br/>\nsomething he made, and about the adventures he had spending the weekend with <br/>\na friend.  None of them asked me to do that, but I consciously wanted to  <br/>\nmake their days better, which makes their lives better, which makes THEM <br/>\nbetter.<br/>\n<br/>\n&lt;&lt;I understand you are speaking to &quot;checklist moms&quot; - and I think it is a<br/>\ntransition that we all go through&gt;&gt;<br/>\n<br/>\nI was answering a question.  Some people&#39;s personalities  make them checklist <br/>\nhumans their whole lives. Some are not.  Holly loves schedules, but I don&#39;t.  <br/>\nShe makes schedules.  She gets me to write things down, with times, and then <br/>\ncomplains later (yesterday she complained that she didn&#39;t do her 6:00, which <br/>\nwas &quot;make a Rube Goldberg invention&quot; because she went to a friend&#39;s house.  I <br/>\ntold her it was fine, and she wouldn&#39;t have had any disappointment if she <br/>\nhadn&#39;t had a list.  But some people might want checklists their whole lives.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012610498","msgId":3901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNjkwMWMxYWI4MiQ2MDU4OTIwMCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PDE4MS4zMDMwZGE5LjI5OGMyNzZiQGFvbC5jb20+IDxsMDMxMTA3MDNiODgwZTA3NWYyYmJAWzIwNi4xMy40NS4xMTVdPg=="},"prevInTopic":3896,"nextInTopic":3906,"prevInTime":3900,"nextInTime":3902,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"From: Jorgen & Ann  ... I ll keep that in mind Ann, thanks. Pat Yahoo! Groups Sponsor ADVERTISEMENT To unsubscribe from this group, send an email to: ","messageBody":"<div id=\"ygrps-yiv-1932745807\">From: Jorgen & Ann <br/>\n&lt;snip&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;My kids let me know what they want to pursue by bringing it up a lot.&gt;<br/>\n<br/>\n </span></blockquote>I&#39;ll keep that in mind Ann, thanks.<br/>\n<br/>\nPat<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      Yahoo! Groups Sponsor <br/>\n            ADVERTISEMENT<br/>\n           <br/>\n     <br/>\n     <br/>\n<br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":698072,"authorName":"Jorgen & Ann","from":"Jorgen & Ann &lt;stargate@...&gt;","profile":"ramoniac589","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012609345","msgId":3896,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGwwMzExMDcwM2I4ODBlMDc1ZjJiYkBbMjA2LjEzLjQ1LjExNV0+","inReplyToHeader":"PDAwMTMwMWMxYWI1MCQ2ZWQyNjRhMCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PDE4MS4zMDMwZGE5LjI5OGMyNzZiQGFvbC5jb20+"},"prevInTopic":3869,"nextInTopic":3901,"prevInTime":3895,"nextInTime":3897,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"... Pat, Just being there, listening, and responding to her is your gift to her, IMO. How often did that happen for her in school? Kids who have the time and","messageBody":"<div id=\"ygrps-yiv-1127260243\"><blockquote><span title=\"ireply\">&gt;You seem like you are on a roll here Sandra, so can you think of what I<br/>\n&gt;might say to my 12 yo dd when she tells me her vision of how things will<br/>\n&gt;work in the future?  The other day I was dragging a 100&#39; hose all around<br/>\n&gt;the yard.  My dd told me of her vision of the future when water would be<br/>\n&gt;condensed from the air and we would no longer need hoses.  I told her I<br/>\n&gt;thought that would be neat - dah- I can&#39;t help her take her ideas<br/>\n&gt;anywhere.  She tells me she is always thinking of things like this.  OK<br/>\n&gt;Mom Sandra, what do I do to nurture this?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Pat,<br/>\n<br/>\nJust being there, listening, and responding to her is your gift to her,<br/>\nIMO. How often did that happen for her in school? Kids who have the time<br/>\nand freedom to think may talk about lots of stuff, and &quot;do&quot; some stuff. My<br/>\nkids let me know what they want to pursue by bringing it up a lot.<br/>\n<br/>\nAnn</div>","specialLinks":[]},{"userId":4635099,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;Felicitas@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012601689","msgId":3869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4ODA1MzU4LjIxOTgzJUZlbGljaXRhc0BNYWMuY29tPg==","inReplyToHeader":"PEI4ODA2NjMxLjRDQUElZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+"},"prevInTopic":3840,"nextInTopic":3896,"prevInTime":3868,"nextInTime":3870,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"... That was one of the survival solutions in my high school whatever class -- whichever one was trying to socialize us (social studies??).  The Lifeboat ","messageBody":"<div id=\"ygrps-yiv-413972008\">on 2/1/02 12:35 PM, Fetteroll at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; even in the desert if you stretch out a<br/>\n&gt; large sheet of plastic (big, not plastic wrap) above the ground, put a stone<br/>\n&gt; in the middle and a can on the ground under the stone, that water will<br/>\n&gt; collect and drop into the can. Maybe it&#39;s coming up from the ground? Maybe<br/>\n&gt; it just sounded cool to someone.<br/>\n<br/>\n </span></blockquote>That was one of the survival solutions in my high school whatever class --<br/>\nwhichever one was trying to socialize us (social studies??).  The Lifeboat<br/>\nScenario, only in our case, it was desert survival and we didn&#39;t necessarily<br/>\nhave to toss anyone out to save the rest.  We had a list of items and had to<br/>\nfigure out how to survive with them.  The can, though, was the body of the<br/>\nflashlight whose batteries were now dead.<br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012596770","msgId":3840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMmIwMWMxYWI2MiQ2OWM1Y2QwMCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PEI4ODA2NzM2LjRDQUIlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+"},"prevInTopic":3835,"nextInTopic":3869,"prevInTime":3839,"nextInTime":3841,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"... I don t know.  This stuff is so new to me.  DD is in 7th grade and this is our first year homeschooling.  This, expression of her ideas, is new since she","messageBody":"<div id=\"ygrps-yiv-1409721680\"><blockquote><span title=\"ireply\">&gt;&gt; I told her I thought that would be neat - dah- I can&#39;t help her take &gt;&gt;her<br/>\n&gt;&gt; ideas anywhere.  She tells me she is always thinking of things like &gt;&gt;this.<br/>\n<br/>\n&gt;Does *she* want to go further with them?<br/>\n<br/>\n </span></blockquote>I don&#39;t know.  This stuff is so new to me.  DD is in 7th grade and this is our first year homeschooling.  This, expression of her ideas, is new since she now has the time to think.  She also says she sees patterns in everything and pointed to the wood on the side of my dresser. I&#39;m just going to show an interest in all she is interested in and see where it takes us.  When I get a better handle on this *new* child of mine,I&#39;ll be able to ask more directed questions.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;Maybe she could write them down. But maybe that would set them in stone &gt;too.<br/>\n<br/>\n </span></blockquote>Not if anyone suggested it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Maybe what they need to be are just what they are which is brain &gt;exercise.<br/>\n&gt;Just what if&#39;s to see how they fit into the world. It&#39;s probably the way<br/>\n&gt;inventors think. And science fiction writers.<br/>\n<br/>\n </span></blockquote>Funny you should mention science fiction.  Last night she wrote what she called a science fiction story and it included some far out ideas.  Maybe that&#39;s it.<br/>\n<br/>\nPat<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012596324","msgId":3835,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjAxLjEzNDUyNy4tMzc0MDAxLjEzLmZyZWVmb3JtQGp1bm8uY29tPg=="},"prevInTopic":3831,"nextInTopic":3840,"prevInTime":3834,"nextInTime":3836,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"On Fri, 01 Feb 2002 15:35:13 -0500 Fetteroll  ... keep ... out a ... stone ... Maybe ... We did a project sort of like that in school","messageBody":"<div id=\"ygrps-yiv-175868005\">On Fri, 01 Feb 2002 15:35:13 -0500 Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt;<br/>\nwrites:<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve *heard* -- but can&#39;t test since the problem here is often how to<br/>\n </span></blockquote>keep<br/>\n<blockquote><span title=\"ireply\"> &gt; things from getting damp ;-) -- that even in the desert if you  stretch<br/>\n </span></blockquote>out a<br/>\n<blockquote><span title=\"ireply\"> &gt; large sheet of plastic (big, not plastic wrap) above the ground, put  a<br/>\n </span></blockquote>stone<br/>\n<blockquote><span title=\"ireply\"> &gt; in the middle and a can on the ground under the stone, that water  will<br/>\n&gt; collect and drop into the can. Maybe it&#39;s coming up from the ground? <br/>\n </span></blockquote>Maybe<br/>\n<blockquote><span title=\"ireply\"> &gt; it just sounded cool to someone.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>We did a project sort of like that in school here in Arizona, when I was<br/>\n9. You go out in the desert and dig a hole a few inches deeper and wider<br/>\nthan a coffee can, then put the can in the middle,and collect various<br/>\ndesert plants and put them around the can (y&#39;all know there are lots of<br/>\ndesert plants, right? The desert is alive...) then stretch a piece of<br/>\nplastic wrap over the top, weigh the edges with sand and rocks and put a<br/>\nlittle rock right over the can. It was very cool, the next morning our<br/>\ncans had real water in them.<br/>\n<br/>\nOf course, that water was coming from the plants, I don&#39;t know about<br/>\ndoing it the way Joyce describes, if that would work here. Well, this<br/>\nweek it would, because it&#39;s been raining and snowing (!). But say in<br/>\nJune, which is usually the hottest month here, although July and August <br/>\nare worse because there&#39;s more humidity. OTOH, I&#39;ve never seen the<br/>\nrelative humidty be zero here, although it gets into single digit numbers<br/>\noften. But it seems like there&#39;s always some moisture in the air, so<br/>\nmaybe it would work.<br/>\n<br/>\nAnyway, remind me in June and I&#39;ll try it :-)<br/>\n<br/>\nDar<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/web/.\">http://dl.www.juno.com/get/web/.</a></div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012595974","msgId":3831,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4ODA2NzM2LjRDQUIlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDE0Mi44ZDBlZTE4LjI5OGM0Mzg4QGFvbC5jb20+"},"prevInTopic":3830,"nextInTopic":3835,"prevInTime":3830,"nextInTime":3832,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"... Does *she* want to go further with them? Maybe she could write them down. But maybe that would set them in stone too. Maybe what they need to be are just","messageBody":"<div id=\"ygrps-yiv-1042278191\">In a message dated 2/1/02 11:47:34 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:homeschoolmd@...\">homeschoolmd@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I told her I thought that would be neat - dah- I can&#39;t help her take her<br/>\n&gt; ideas anywhere.  She tells me she is always thinking of things like this.<br/>\n<br/>\n </span></blockquote>Does *she* want to go further with them?<br/>\n<br/>\nMaybe she could write them down. But maybe that would set them in stone too.<br/>\n<br/>\nMaybe what they need to be are just what they are which is brain exercise.<br/>\nJust what if&#39;s to see how they fit into the world. It&#39;s probably the way<br/>\ninventors think. And science fiction writers.<br/>\n<br/>\nJoyce <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012595713","msgId":3830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4ODA2NjMxLjRDQUElZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDE0Mi44ZDBlZTE4LjI5OGM0Mzg4QGFvbC5jb20+"},"prevInTopic":3825,"nextInTopic":3831,"prevInTime":3829,"nextInTime":3831,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"... I ve *heard* -- but can t test since the problem here is often how to keep things from getting damp ;-) -- that even in the desert if you stretch out a ","messageBody":"<div id=\"ygrps-yiv-1271473361\">on 2/1/02 2:16 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Because in New Mexico, there IS no moisture in the air and so it would be<br/>\n&gt; pretty hard work! &lt;g&gt;<br/>\n<br/>\n </span></blockquote>I&#39;ve *heard* -- but can&#39;t test since the problem here is often how to keep<br/>\nthings from getting damp ;-) -- that even in the desert if you stretch out a<br/>\nlarge sheet of plastic (big, not plastic wrap) above the ground, put a stone<br/>\nin the middle and a can on the ground under the stone, that water will<br/>\ncollect and drop into the can. Maybe it&#39;s coming up from the ground? Maybe<br/>\nit just sounded cool to someone.<br/>\n<br/>\nJoyce <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":53685616,"authorName":"Bronwen","from":"&quot;Bronwen&quot; &lt;felesina@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012594273","msgId":3825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZTQwMWMxYWI1YyRhYjQ1YmRlMCQ3YTM4OGVkMUBmZWxlc2luYT4=","referencesHeader":"PDE4MS4zMDMwZGE5LjI5OGMyNzZiQGFvbC5jb20+"},"prevInTopic":3817,"nextInTopic":3830,"prevInTime":3824,"nextInTime":3826,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"... THIS is a fabulous question- it shows you really see how offering when uninvited is the antithesis of trust. Something that might help is to say to","messageBody":"<div id=\"ygrps-yiv-1632022172\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; In a message dated 2/1/02 7:10:56 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a> writes:<br/>\n&gt;<br/>\n&gt; &lt;&lt; How did you get comfortable with not racing around and<br/>\n&gt; &quot;providing&quot; entertainment for your children.  &gt;&gt;<br/>\n<br/>\n </span></blockquote>THIS is a fabulous question- it shows you really see how &quot;offering&quot; when<br/>\nuninvited is the antithesis of trust.<br/>\n<br/>\nSomething that might help is to say to yourself-<br/>\n<br/>\n* would I say, suggest, offer, that to my adult friend in a similar<br/>\nsituation? (if not, you are &quot;teaching&quot;- you have switched your focus from<br/>\nyourself to your children and what they &quot;need&quot;) (although some people<br/>\nannoyingly &quot;help&quot; their friends...watch out for that one..)<br/>\n<br/>\n<br/>\nFrom Sandra:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It doesn&#39;t have to be done at any one moment, just incorporate his<br/>\n </span></blockquote>interest<br/>\n<blockquote><span title=\"ireply\"> &gt; in chess pieces into your daily considerations until the time when he<br/>\n </span></blockquote>knows<br/>\n<blockquote><span title=\"ireply\"> &gt; more about it than you do (unless you&#39;re a whiz, and then sorry for the<br/>\n&gt; assumption that you weren&#39;t).<br/>\n<br/>\n </span></blockquote>but you dont want the sharing of yourself and your ideas to be connected<br/>\nwith your children&#39;s &quot;outcome&quot;- yeah?<br/>\n<br/>\nI mean, you are on a totally different life path than your children, who<br/>\nknows why he is stacking chess peices?  could be because he&#39;s examining the<br/>\ncontrast between black wood and white - or maybe thinking about wood in<br/>\ngeneral, or stone (or whatever the pieces are made out of), I mean GAWD- I<br/>\nthink I could write a millon things that could be going on in his head.<br/>\nWhich illustrates my point- there is no sense in guessing what they &quot;need<br/>\nnext&quot; -it is like guessing their path , and choosing one path (that he is or<br/>\nshould be interested in chess at all) to &quot;provide&quot; info for.  I have to<br/>\nfocus on MY path, not my children&#39;s- not only do I<br/>\n<br/>\n*waste energy- focusing on someone else&#39;s life and what they are thinking,<br/>\nbut I<br/>\n<br/>\n*undermine trust- because by &quot;providing something&quot; that no one wanted I am<br/>\nassuming that they couldnt either get what they wanted themselves or let me<br/>\nknow how I (or someone else) could help them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; One way for moms who love to checklist their days to provide without<br/>\n </span></blockquote>managing<br/>\n<blockquote><span title=\"ireply\"> &gt; is to go afield of verbal presentation.  Go through a list of the senses.<br/>\n&gt; And if each day you try to provide something interesting to taste, touch,<br/>\n&gt; hear, see and smell, his day will be more full than flat.<br/>\n<br/>\n </span></blockquote>It is not my responsibility to make another person&#39;s day &quot;full or flat&quot; or<br/>\nanything-  my responsibility is to be the best person I can be.  I want to<br/>\nbe fully available when someone (anyone) expresses need and I feel I can<br/>\ngive it- offering something when there is no expressed need is icky.  I am a<br/>\nmodel for my children - but I am not &quot;being a good model&quot; for the benefit of<br/>\nmy children as much as just because that is what we should do- be true to<br/>\nourselves<br/>\n<br/>\nI understand you are speaking to &quot;checklist moms&quot; - and I think it is a<br/>\ntransition that we all go through, feeling we are &quot;letting our kids down&quot; by<br/>\nnot having a sand table, or a microscope- &quot;is my environment &quot;enriched&quot;<br/>\nenough?&quot;  But it is a FINE FINE day when you realize that you never had to<br/>\nworry about the microscope, or the globe, or the chess book, or the tennis<br/>\nraquet at all- when you look back and realize that all those &quot;important path<br/>\ndeveloping tools&quot; are collecting dust, that you wasted your energy- that you<br/>\ndont have to waste energy on other people&#39;s life any more.  You dont have to<br/>\nworry about &quot;their multi-dimentional world veiw&quot;- you just dont have to<br/>\nworry- TRUST has arrived<br/>\n<br/>\nBECAUSE  you realize, your children have let you know- they have let you<br/>\nknow the WHOLE time, JUST what they needed, WHEN they needed it- and you<br/>\ndidnt let them down, you didnt-<br/>\n<br/>\nbecause it was so obvious obvious when they wanted you to help, provide,<br/>\ninform-<br/>\n<br/>\nand you did<br/>\n<br/>\nLove,<br/>\nBronwen</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012592317","msgId":3817,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyOC5iY2NmMTFmLjI5OGM0OGJkQGFvbC5jb20+"},"prevInTopic":3814,"nextInTopic":3825,"prevInTime":3816,"nextInTime":3818,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/1/02 12:32:24 PM, homeschoolmd@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-623752681\">In a message dated 2/1/02 12:32:24 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:homeschoolmd@...\">homeschoolmd@...</a> writes:<br/>\n<br/>\n&lt;&lt; Thanks Sandra, I guess I need to figure out if she fancies herself an <br/>\ninventor or just likes to think of fantasy stuff.  &gt;&gt;<br/>\n<br/>\nI don&#39;t think it matters at this point, just so you don&#39;t squelch it.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012591734","msgId":3814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYWIwMWMxYWI1NiRhZmYyMTZhMCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PDE0Mi44ZDBlZTE4LjI5OGM0Mzg4QGFvbC5jb20+"},"prevInTopic":3810,"nextInTopic":3817,"prevInTime":3813,"nextInTime":3815,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"Thanks Sandra, I guess I need to figure out if she fancies herself an inventor or just likes to think of fantasy stuff.  She has not shown much of an interest","messageBody":"<div id=\"ygrps-yiv-1313093059\">Thanks Sandra, I guess I need to figure out if she fancies herself an inventor or just likes to think of fantasy stuff.  She has not shown much of an interest in how things actually work or what makes something happen.  She didn&#39;t even talk about where the water would come from.  Maybe I should have asked her how she thought that might work but I didn&#39;t want to seem at all negative.  I think she just likes to dream.<br/>\n<br/>\nPat<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Friday, February 01, 2002 2:16 PM<br/>\nSubject: Re: [AlwaysLearning] Need your Experience<br/>\n<br/>\n<br/>\n<br/>\nIn a message dated 2/1/02 11:47:34 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:homeschoolmd@...\">homeschoolmd@...</a> writes:<br/>\n<br/>\n&lt;&lt; I told her I thought that would be neat - dah- I can&#39;t help her take her <br/>\nideas anywhere.  She tells me she is always thinking of things like this.   &gt;&gt;<br/>\n<br/>\nWhere does she need to take them?  <br/>\n<br/>\nI guess I would ask her how that would work, her condensation plan.  Because <br/>\nin New Mexico, there IS no moisture in the air and so it would be pretty hard <br/>\nwork! &lt;g&gt;<br/>\n<br/>\nAnd in most places, I hear, moisture condenses out of the air by itself, <br/>\nalmost daily! &lt;g&gt;<br/>\n<br/>\nI don&#39;t think using humor is belittling, but some kids like it and some can&#39;t <br/>\nstand it.  <br/>\nSo depending on her personality, maybe she just wants you to say &quot;That sounds <br/>\nlike a GREAT idea,&quot; and ask her if she could condense enough that people <br/>\nwouldn&#39;t need to pipe water in, too.  Then people who live out in the country <br/>\nmight not have to drill their own wells.  Or get her thinking about whether <br/>\nin crowded neighborhoods one neighbor could condense so much water that the <br/>\nother neighbors&#39; condensers wouldn&#39;t work.  (That&#39;s a practical question <br/>\nbased on local experience with ditches.)<br/>\n<br/>\nMaybe she doesn&#39;t want any more questions or input, but just wants to mull <br/>\nover her own idea.<br/>\n<br/>\nI had an idea when I was six for striped paint--a split brush, and a can with <br/>\na divider in the middle.  That was because I had never really painted with <br/>\nhouse paint.  I told my granny and papaw.  He said that was an idea he had <br/>\nnever heard.  Neither one told me why it wouldn&#39;t work.  I think that was <br/>\npretty sweet, looking back.  Within a year I had figured out the brush <br/>\nwouldn&#39;t separate on the second dip, and the colors would get muddied.  But <br/>\nit was fun, for a while, having my kid-fantasy.<br/>\n<br/>\nHer ideas don&#39;t need to be taken anywhere, just around her brain and into the <br/>\nair around her.  <br/>\n<br/>\nI think the best thing you can do is not say &quot;That won&#39;t work,&quot; but ask her <br/>\nquestions that help her clarify what she&#39;s thinking, or talk about similar <br/>\nthings.  Cloud seeding is something you could look up and introduce to her.  <br/>\nBut just mention it, define it, show a photo or something if you can, and let <br/>\nit go.   Don&#39;t make &quot;a unit study,&quot; just add one piece or two to her puzzle.<br/>\n<br/>\nThat&#39;s my musing on it.  Others might have more scientific ideas.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n      Yahoo! Groups Sponsor <br/>\n            ADVERTISEMENT<br/>\n           <br/>\n     <br/>\n     <br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012590984","msgId":3810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Mi44ZDBlZTE4LjI5OGM0Mzg4QGFvbC5jb20+"},"prevInTopic":3799,"nextInTopic":3814,"prevInTime":3809,"nextInTime":3811,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/1/02 11:47:34 AM, homeschoolmd@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1404836895\">In a message dated 2/1/02 11:47:34 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:homeschoolmd@...\">homeschoolmd@...</a> writes:<br/>\n<br/>\n&lt;&lt; I told her I thought that would be neat - dah- I can&#39;t help her take her <br/>\nideas anywhere.  She tells me she is always thinking of things like this.   &gt;&gt;<br/>\n<br/>\nWhere does she need to take them?  <br/>\n<br/>\nI guess I would ask her how that would work, her condensation plan.  Because <br/>\nin New Mexico, there IS no moisture in the air and so it would be pretty hard <br/>\nwork! &lt;g&gt;<br/>\n<br/>\nAnd in most places, I hear, moisture condenses out of the air by itself, <br/>\nalmost daily! &lt;g&gt;<br/>\n<br/>\nI don&#39;t think using humor is belittling, but some kids like it and some can&#39;t <br/>\nstand it.  <br/>\nSo depending on her personality, maybe she just wants you to say &quot;That sounds <br/>\nlike a GREAT idea,&quot; and ask her if she could condense enough that people <br/>\nwouldn&#39;t need to pipe water in, too.  Then people who live out in the country <br/>\nmight not have to drill their own wells.  Or get her thinking about whether <br/>\nin crowded neighborhoods one neighbor could condense so much water that the <br/>\nother neighbors&#39; condensers wouldn&#39;t work.  (That&#39;s a practical question <br/>\nbased on local experience with ditches.)<br/>\n<br/>\nMaybe she doesn&#39;t want any more questions or input, but just wants to mull <br/>\nover her own idea.<br/>\n<br/>\nI had an idea when I was six for striped paint--a split brush, and a can with <br/>\na divider in the middle.  That was because I had never really painted with <br/>\nhouse paint.  I told my granny and papaw.  He said that was an idea he had <br/>\nnever heard.  Neither one told me why it wouldn&#39;t work.  I think that was <br/>\npretty sweet, looking back.  Within a year I had figured out the brush <br/>\nwouldn&#39;t separate on the second dip, and the colors would get muddied.  But <br/>\nit was fun, for a while, having my kid-fantasy.<br/>\n<br/>\nHer ideas don&#39;t need to be taken anywhere, just around her brain and into the <br/>\nair around her.  <br/>\n<br/>\nI think the best thing you can do is not say &quot;That won&#39;t work,&quot; but ask her <br/>\nquestions that help her clarify what she&#39;s thinking, or talk about similar <br/>\nthings.  Cloud seeding is something you could look up and introduce to her.  <br/>\nBut just mention it, define it, show a photo or something if you can, and let <br/>\nit go.   Don&#39;t make &quot;a unit study,&quot; just add one piece or two to her puzzle.<br/>\n<br/>\nThat&#39;s my musing on it.  Others might have more scientific ideas.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":94797851,"authorName":"Karin","from":"&quot;Karin&quot; &lt;curtkar@...&gt;","profile":"kc85022","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012589260","msgId":3784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNzYwMWMxYWI1MCRlZGE0ODRjMCQ2NDAwYThjMEBnb2R6aWxsYT4=","referencesHeader":"PDE4MS4zMDMwZGE5LjI5OGMyNzZiQGFvbC5jb20+"},"prevInTopic":3773,"nextInTopic":3799,"prevInTime":3783,"nextInTime":3785,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"I m saving this too! Thanks for all the ideas. Karin ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1053886803\">I&#39;m saving this too! Thanks for all the ideas.<br/>\n<br/>\nKarin<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;(Maybe I just wrote the core of a column for HEM.  I&#39;m saving this one.)<br/>\n<br/>\n  &gt;Sandra<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012589047","msgId":3799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTMwMWMxYWI1MCQ2ZWQyNjRhMCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PDE4MS4zMDMwZGE5LjI5OGMyNzZiQGFvbC5jb20+"},"prevInTopic":3784,"nextInTopic":3810,"prevInTime":3798,"nextInTime":3800,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"You seem like you are on a roll here Sandra, so can you think of what I might say to my 12 yo dd when she tells me her vision of how things will work in the","messageBody":"<div id=\"ygrps-yiv-2014670727\">You seem like you are on a roll here Sandra, so can you think of what I might say to my 12 yo dd when she tells me her vision of how things will work in the future?  The other day I was dragging a 100&#39; hose all around the yard.  My dd told me of her vision of the future when water would be condensed from the air and we would no longer need hoses.  I told her I thought that would be neat - dah- I can&#39;t help her take her ideas anywhere.  She tells me she is always thinking of things like this.  OK Mom Sandra, what do I do to nurture this?<br/>\n<br/>\nPat<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Friday, February 01, 2002 12:16 PM<br/>\nSubject: Re: [AlwaysLearning] Need your Experience<br/>\n<br/>\n<br/>\n<br/>\nIn a message dated 2/1/02 7:10:56 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a> writes:<br/>\n<br/>\n&lt;&lt; How did you get comfortable with not racing around and<br/>\n&quot;providing&quot; entertainment for your children.  &gt;&gt;<br/>\n<br/>\nGradually!<br/>\n<br/>\nI still provide entertainment for my children (and they provide things for <br/>\nthe rest of the family too, because (shhh...) they think that&#39;s just how <br/>\npeople in families are!  They don&#39;t associate it with unschooling directly.<br/>\n<br/>\n&lt;&lt; He&#39;s only interested in<br/>\nstanding them up and already I&#39;m thinking of chess tournaments&gt;&gt;<br/>\n<br/>\nFind a diagram of the board set up and leave it available.  He can copy that <br/>\npattern or not, but he&#39;ll realize there is a pattern.<br/>\n<br/>\nAnd it&#39;s cool when the chess pieces on the chart don&#39;t look exactly like his <br/>\nown.<br/>\n<br/>\nMaybe check out a book on chess pieces or history of game boards.  Not on <br/>\nchess strategy at all, but on gaming history so he can see the history of the <br/>\npieces and the different forms.  Or if you&#39;re near a games shop, wander by <br/>\nand look at different chess sets on display.  it will be like a teeny chess <br/>\nmuseum.<br/>\n<br/>\nIt doesn&#39;t have to be done at any one moment, just incorporate his interest <br/>\nin chess pieces into your daily considerations until the time when he knows <br/>\nmore about it than you do (unless you&#39;re a whiz, and then sorry for the <br/>\nassumption that you weren&#39;t).<br/>\n<br/>\nOne way for moms who love to checklist their days to provide without managing <br/>\nis to go afield of verbal presentation.  Go through a list of the senses.  <br/>\nAnd if each day you try to provide something interesting to taste, touch, <br/>\nhear, see and smell, his day will be more full than flat.  Too many families <br/>\nstop at things to hear and see. (Because school stops there, I guess.)<br/>\n<br/>\nBut you don&#39;t have to do this until he&#39;s 17.  You can do it until you&#39;re <br/>\nconfident that he&#39;s filled with experiences to cross-reference at his own <br/>\nleisure (in dreams, in fantasies, in future incidents which remind him of <br/>\nthose, etc.) and you feel satisfied that you&#39;re not a slacker.<br/>\n<br/>\nIf just &quot;the five sense&quot; seems a lame checklist and you want four dimensional <br/>\ninstead of three, maybe each day work into conversation something about the <br/>\npast and something about the future.  (I can hardly imagine a day without <br/>\nthose coming up naturally in my own family, but in case you&#39;re not really <br/>\ntalkative or something, it&#39;s something for the checklist.)  If it comes up <br/>\nnaturally in conversation you could say &quot;They didnt&#39; even have chainsaws <br/>\nuntil... [whenever little gasoline engines were common, or whatever the <br/>\nseminal technological feature is] and would have had to do all this with a <br/>\nhand saw, or an axe.  (That&#39;s if you cut firewood with a chainsaw, not if <br/>\nyou&#39;re sitting around working a jigsaw puzzle of tiger cubs in the forest.)  <br/>\nOr you could say &quot;How long do you think we will have these dishes?  When too  <br/>\nmany are broken, what kind should we get next?&quot; (if you have a girl with <br/>\nthose sorts of interests).  Various kinds of mind-casting conversations into <br/>\nthe past (personal past or technological past or cultural past or planetary <br/>\npast) or into the future (tomorrow, next year, next century) help kids build <br/>\ntheir internal model of the universe.  I know I&#39;ve used that phrase half a <br/>\ndozen times talking about unschooling, but I think it&#39;s one of the coolest <br/>\nideas.  <br/>\n<br/>\nAt school, there is a model of knowledge which they&#39;re hoping to insert into <br/>\neach child&#39;s head.  And it has things that are dumb and arbitrary.  Like that <br/>\nthe history of England is way more important than the history of China (in <br/>\nEnglish speaking countries, there&#39;s a lot of justification for that, but <br/>\nstill, let me run my imperfect little thang here), and that there are some <br/>\nauthors EVERYBODY has to know, and others that are TOTALLY optional, <br/>\nmarginal, don&#39;t even brag if you&#39;ve read them.  And that some historical <br/>\ncultures are hugely more important than others.  And some science is FACT and <br/>\nsome is marginal &quot;whatever,&quot; not appearing in this book.<br/>\n<br/>\nSchool kids don&#39;t know the world is a million times bigger than school&#39;s <br/>\nversion of it.<br/>\n<br/>\nUnschooled kids are also making a model of the universe inside them, but <br/>\nthey&#39;re making it their own way, and they&#39;re not valuing the school-bits over <br/>\nthe bits that their model has which are unique to them and their own personal <br/>\ninterests and experiences.<br/>\n<br/>\nThat&#39;s the main reason I think that an unschooler&#39;s checklist should look <br/>\nmore like the five senses and past/future than like science, history, <br/>\nlanguage, math, maybe-music-art-physical education.   Because that model is <br/>\nprescriptive and limiting.  And the other is descriptive and unlimited.<br/>\n<br/>\n(Maybe I just wrote the core of a column for HEM.  I&#39;m saving this one.)<br/>\n<br/>\nSandra<br/>\n<br/>\n      Yahoo! Groups Sponsor <br/>\n            ADVERTISEMENT<br/>\n           <br/>\n     <br/>\n     <br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012583787","msgId":3773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4MS4zMDMwZGE5LjI5OGMyNzZiQGFvbC5jb20+"},"prevInTopic":3749,"nextInTopic":3784,"prevInTime":3772,"nextInTime":3774,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/1/02 7:10:56 AM, dawn@astrologerdawn.com writes: ","messageBody":"<div id=\"ygrps-yiv-1587803511\">In a message dated 2/1/02 7:10:56 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a> writes:<br/>\n<br/>\n&lt;&lt; How did you get comfortable with not racing around and<br/>\n&quot;providing&quot; entertainment for your children.  &gt;&gt;<br/>\n<br/>\nGradually!<br/>\n<br/>\nI still provide entertainment for my children (and they provide things for <br/>\nthe rest of the family too, because (shhh...) they think that&#39;s just how <br/>\npeople in families are!  They don&#39;t associate it with unschooling directly.<br/>\n<br/>\n&lt;&lt; He&#39;s only interested in<br/>\nstanding them up and already I&#39;m thinking of chess tournaments&gt;&gt;<br/>\n<br/>\nFind a diagram of the board set up and leave it available.  He can copy that <br/>\npattern or not, but he&#39;ll realize there is a pattern.<br/>\n<br/>\nAnd it&#39;s cool when the chess pieces on the chart don&#39;t look exactly like his <br/>\nown.<br/>\n<br/>\nMaybe check out a book on chess pieces or history of game boards.  Not on <br/>\nchess strategy at all, but on gaming history so he can see the history of the <br/>\npieces and the different forms.  Or if you&#39;re near a games shop, wander by <br/>\nand look at different chess sets on display.  it will be like a teeny chess <br/>\nmuseum.<br/>\n<br/>\nIt doesn&#39;t have to be done at any one moment, just incorporate his interest <br/>\nin chess pieces into your daily considerations until the time when he knows <br/>\nmore about it than you do (unless you&#39;re a whiz, and then sorry for the <br/>\nassumption that you weren&#39;t).<br/>\n<br/>\nOne way for moms who love to checklist their days to provide without managing <br/>\nis to go afield of verbal presentation.  Go through a list of the senses.  <br/>\nAnd if each day you try to provide something interesting to taste, touch, <br/>\nhear, see and smell, his day will be more full than flat.  Too many families <br/>\nstop at things to hear and see. (Because school stops there, I guess.)<br/>\n<br/>\nBut you don&#39;t have to do this until he&#39;s 17.  You can do it until you&#39;re <br/>\nconfident that he&#39;s filled with experiences to cross-reference at his own <br/>\nleisure (in dreams, in fantasies, in future incidents which remind him of <br/>\nthose, etc.) and you feel satisfied that you&#39;re not a slacker.<br/>\n<br/>\nIf just &quot;the five sense&quot; seems a lame checklist and you want four dimensional <br/>\ninstead of three, maybe each day work into conversation something about the <br/>\npast and something about the future.  (I can hardly imagine a day without <br/>\nthose coming up naturally in my own family, but in case you&#39;re not really <br/>\ntalkative or something, it&#39;s something for the checklist.)  If it comes up <br/>\nnaturally in conversation you could say &quot;They didnt&#39; even have chainsaws <br/>\nuntil... [whenever little gasoline engines were common, or whatever the <br/>\nseminal technological feature is] and would have had to do all this with a <br/>\nhand saw, or an axe.  (That&#39;s if you cut firewood with a chainsaw, not if <br/>\nyou&#39;re sitting around working a jigsaw puzzle of tiger cubs in the forest.)  <br/>\nOr you could say &quot;How long do you think we will have these dishes?  When too  <br/>\nmany are broken, what kind should we get next?&quot; (if you have a girl with <br/>\nthose sorts of interests).  Various kinds of mind-casting conversations into <br/>\nthe past (personal past or technological past or cultural past or planetary <br/>\npast) or into the future (tomorrow, next year, next century) help kids build <br/>\ntheir internal model of the universe.  I know I&#39;ve used that phrase half a <br/>\ndozen times talking about unschooling, but I think it&#39;s one of the coolest <br/>\nideas.  <br/>\n<br/>\nAt school, there is a model of knowledge which they&#39;re hoping to insert into <br/>\neach child&#39;s head.  And it has things that are dumb and arbitrary.  Like that <br/>\nthe history of England is way more important than the history of China (in <br/>\nEnglish speaking countries, there&#39;s a lot of justification for that, but <br/>\nstill, let me run my imperfect little thang here), and that there are some <br/>\nauthors EVERYBODY has to know, and others that are TOTALLY optional, <br/>\nmarginal, don&#39;t even brag if you&#39;ve read them.  And that some historical <br/>\ncultures are hugely more important than others.  And some science is FACT and <br/>\nsome is marginal &quot;whatever,&quot; not appearing in this book.<br/>\n<br/>\nSchool kids don&#39;t know the world is a million times bigger than school&#39;s <br/>\nversion of it.<br/>\n<br/>\nUnschooled kids are also making a model of the universe inside them, but <br/>\nthey&#39;re making it their own way, and they&#39;re not valuing the school-bits over <br/>\nthe bits that their model has which are unique to them and their own personal <br/>\ninterests and experiences.<br/>\n<br/>\nThat&#39;s the main reason I think that an unschooler&#39;s checklist should look <br/>\nmore like the five senses and past/future than like science, history, <br/>\nlanguage, math, maybe-music-art-physical education.   Because that model is <br/>\nprescriptive and limiting.  And the other is descriptive and unlimited.<br/>\n<br/>\n(Maybe I just wrote the core of a column for HEM.  I&#39;m saving this one.)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":9440128,"authorName":"ElissaJC@concentric.net","from":"&lt;ElissaJC@...&gt;","profile":"elissajc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012578309","msgId":3749,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzYTgwMWMxYWIzNyQ2ZjAxNmQ0MCRmNTI0YWRjZUBFbGlzc2FKQz4="},"prevInTopic":3746,"nextInTopic":3773,"prevInTime":3748,"nextInTime":3750,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"... Or read your email!! Elissa, who will soon be singing Yippee - Kai - Yay!","messageBody":"<div id=\"ygrps-yiv-1760026360\"><blockquote><span title=\"ireply\">&gt;&lt;&lt; I watched Zak play yesterday rather than me trying to<br/>\n&gt;keep offering him things and he was fine. &gt;&gt;&gt;<br/>\n&gt;Do this more. Then one day instead of watching, you&#39;ll go read a book &lt;gg&gt;.<br/>\n&gt;&gt;Paula<br/>\n<br/>\n </span></blockquote>Or read your email!!<br/>\nElissa, who will soon be singing<br/>\nYippee - Kai - Yay!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;&lt;&lt; I watched Zak play yesterday rather than me trying to<br/>\n&gt;keep offering him things and he was fine. &gt;&gt;<br/>\n&gt;<br/>\n&gt;Do this more. Then one day instead of watching, you&#39;ll go read a book &lt;gg&gt;.<br/>\n&gt;<br/>\n&gt;Paula </span></blockquote></div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012577590","msgId":3746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBHUVYwMDVPNzFWQThaQG10YTUuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":3738,"nextInTopic":3749,"prevInTime":3745,"nextInTime":3747,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"It helps to have pursuits of your own, for when they really don t need you or, in fact, WANT you, involved. This list, for example.  Understanding your own","messageBody":"<div id=\"ygrps-yiv-581834543\">It helps to have pursuits of your own, for when they really don&#39;t need you<br/>\nor, in fact, WANT you, involved. This list, for example. &lt;g&gt;<br/>\n<br/>\nUnderstanding your own motives helps. Being able to read your child&#39;s<br/>\ninterest in your suggestions helps (this is not a problem for me. Brit<br/>\nbecomes one with the vegetables if you bore her in any slight way, and Mikey<br/>\n(4) says in her quelling English nanny voice, &quot;No, thank you&quot;. Very<br/>\nrepressing. &lt;g&gt;<br/>\n<br/>\nPam<br/>\n<br/>\n----------<br/>\nFrom: &quot;Dawn Falbe&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Alwayslearning@yahoogroups.com\">Alwayslearning@yahoogroups.com</a>&gt;<br/>\nSubject: [AlwaysLearning] Need your Experience<br/>\nDate: Fri, Feb 1, 2002, 6:13 AM<br/>\n<br/>\n<br/>\nI&#39;m writing this thinking to myself &quot;What<br/>\nelse do you want him to do Dawn?&quot;.....  OK OK I know it&#39;s me... so those of<br/>\nyou with years of experience and who&#39;ve already gone through this &quot;stage&quot;<br/>\nwould you please give me your experience, strength and hope that I will<br/>\neventually become &quot;normal&quot; and let things be the way they are.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2018196,"authorName":"sjogy@aol.com","from":"sjogy@...","profile":"sjogypls","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Need your Experience","postDate":"1012576203","msgId":3738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdlLjIyMDM0Yjk2LjI5OGMwOWNiQGFvbC5jb20+"},"prevInTopic":3729,"nextInTopic":3746,"prevInTime":3737,"nextInTime":3739,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/1/02 8:10:32 AM, dawn@astrologerdawn.com writes: ","messageBody":"<div id=\"ygrps-yiv-398323392\">In a message dated 2/1/02 8:10:32 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a> writes:<br/>\n<br/>\n&lt;&lt; I watched Zak play yesterday rather than me trying to<br/>\nkeep offering him things and he was fine. &gt;&gt;<br/>\n<br/>\nDo this more. Then one day instead of watching, you&#39;ll go read a book &lt;gg&gt;.<br/>\n<br/>\nPaula</div>","specialLinks":[]},{"userId":49413852,"authorName":"Dawn Falbe","from":"&quot;Dawn Falbe&quot; &lt;dawn@...&gt;","profile":"astrologerdawn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Need your Experience","postDate":"1012572807","msgId":3729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGUwMWMxYWIyYSQ5ZWRjNTMyMCRkMThlZGQxOEBhei5zcHJpbnRiYmQubmV0Pg=="},"prevInTopic":0,"nextInTopic":3738,"prevInTime":3728,"nextInTime":3730,"topicId":3729,"numMessagesInTopic":0,"msgSnippet":"Hi All: I m interested in hearing from those of you who have been unschooling for sometime... How did you get comfortable with not racing around and ","messageBody":"<div id=\"ygrps-yiv-1194241145\">Hi All:<br/>\n<br/>\nI&#39;m interested in hearing from those of you who have been unschooling for<br/>\nsometime... How did you get comfortable with not racing around and<br/>\n&quot;providing&quot; entertainment for your children.  It&#39;s 6:30am here and Max (2.5<br/>\nyrs old) took out Zak chess game and started to stand the pieces up.  I have<br/>\nto stop myself from showing him how to play chess... He&#39;s only interested in<br/>\nstanding them up and already I&#39;m thinking of chess tournaments he can<br/>\nenter.... I&#39;ve been thinking about this and I think I do this with Zak as<br/>\nwell... I don&#39;t know if it&#39;s my own school conditioning that says &quot;if you<br/>\nare not constantly offering them all sorts of wonderful opportunities, they<br/>\nare going to get bored and want to go to school&quot;..  I know this is about me<br/>\nand not about them....I watched Zak play yesterday rather than me trying to<br/>\nkeep offering him things and he was fine... He painted, colored, make lego<br/>\nracer models, went outside on his bike with DH and his brother, watched a<br/>\ncouple of There goes the (fill in the blank) videos, played on his computer<br/>\nlearning Spanish and Japanese.... I&#39;m writing this thinking to myself &quot;What<br/>\nelse do you want him to do Dawn?&quot;.....  OK OK I know it&#39;s me... so those of<br/>\nyou with years of experience and who&#39;ve already gone through this &quot;stage&quot;<br/>\nwould you please give me your experience, strength and hope that I will<br/>\neventually become &quot;normal&quot; and let things be the way they are.<br/>\n<br/>\nDawn (learning how to unschool)<br/>\n<br/>\n<br/>\n********************<br/>\nDawn  Falbe<br/>\nAstrologer Coach<br/>\n(520) 312-5300<br/>\n********************<br/>\nwww.astrologerdawn.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a><br/>\nEnlightening you on how to discover and live your Soul Purpose<br/>\n<br/>\n&quot;The people who get on in this world are people who get up and look for the<br/>\ncircumstances they want, and, if they can&#39;t find them, make them.&quot; - George<br/>\nBernard Shaw<br/>\n<br/>\n&quot;The only time my education was interrupted was when I was in school&quot; -<br/>\nGeorge Bernard Shaw<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":4107,"nextTopicId":3648}}