{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"&quot;there,&quot; or &quot;not there&quot;","postDate":"1027449942","msgId":39353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5NjMxQjhGLkZGQiVuZWR2YXJlQG50cGx4Lm5ldD4=","inReplyToHeader":"PDEwMjczOTk2NzQuMzU1LjMyMTMzLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":39352,"nextInTime":39354,"topicId":39353,"numMessagesInTopic":0,"msgSnippet":"Dear Unschoolers and others not yet there, Luz and I  have been hosting gatherings of homeschoolers at our home for about eighteen years. It began with","messageBody":"<div id=\"ygrps-yiv-2088806408\">Dear Unschoolers and others not yet &quot;there,&quot;<br/>\n<br/>\nLuz and I  have been hosting gatherings of homeschoolers at our home for<br/>\nabout eighteen years. It began with wanting to meet with others doing<br/>\nsimilar things. As followers of the writings of John Holt, we were, and<br/>\nstill are, surprised to find so many people who believe that homeschooling<br/>\nactually means &quot;doing school at home.&quot;<br/>\n<br/>\nIn our travels, we&#39;ve met many people who agree with us (and Holt), but<br/>\nalong the way it has become evident that many people (most, in fact) simply<br/>\ncannot imagine growing up without having a school-like experience. The first<br/>\nimpulse of many people who are dissatisfied with their public school is to<br/>\ndo the same thing at home. They haven&#39;t yet seen the truth in Holt&#39;s message<br/>\nthat IT&#39;S THE SCHOOLING THAT&#39;S THE PROBLEM.<br/>\n<br/>\nThat exact thing happened to me twenty-five years ago. When my older son<br/>\n(then 9yo) came to live with me, I sent for the box of books (from Calvert).<br/>\nOn the second morning, my son looked up and said, &quot;Dad, this is stupid.&quot; I<br/>\nreplied, &quot;You&#39;re right, let&#39;s send it back for a refund and go out and<br/>\nplay.&quot;  He agreed, and that&#39;s what we did.<br/>\n<br/>\n Luckily for me, the transition from school-at-home to unschooling was quick<br/>\nand easy. For others, it&#39;s not so...the fears, intimidation and pressures to<br/>\nhave a &quot;school&quot; experience (no matter how stupid it is) are strong, and it<br/>\nusually takes time and courage and unusual trust of both one&#39;s self and<br/>\none&#39;s child to jump off that cliff into total unschooling.<br/>\n<br/>\nIn our gatherings, we know that some families are using school books, and<br/>\nthat some children are more secure if they occasionally fill a workbook or<br/>\ntake a test or read a textbook. So what. We don&#39;t give out pedigrees, we<br/>\ndon&#39;t check anyone&#39;s teeth or diet or degree of unschooling.<br/>\n<br/>\nTo us, UNschooling is a weaning process that parents need to go through. We<br/>\n(parents) need to learn that the school experience is not only unnecessary,<br/>\nbut can be, and often is, damaging both for children and parents. Therefore,<br/>\nUnschooling simply means learning not to take schooling seriously. I believe<br/>\nthat, with that attitude, many families have gradually weaned themselves<br/>\nfrom &quot;schooling their kids&quot; to a much more relaxed form of homeschooling.<br/>\nNot everyone can get &quot;there&quot; quickly and/or easily.<br/>\n<br/>\nFor Luz and me, unschooling was extreme, but not fanatical. It was merely in<br/>\nagreement with our kid&#39;s desires. He liked Churchill&#39;s expression, &quot;I love<br/>\nto learn, but hate being taught.&quot; Somehow, we learned to trust him early on,<br/>\nthat he could be in charge of his own learning. By not going to school, he<br/>\nhad plenty of time to do it. He&#39;s now 23, graduated from college Magna Cum<br/>\nLaude, and seems to have good prospects.<br/>\n<br/>\nPeople tell us...&quot;Well, you are good parents and Cassidy must be bright.&quot;<br/>\nThe one thing I have come to realize is, &quot;Nobody dumbed him down.&quot;<br/>\n<br/>\nNed Vare</div>","specialLinks":[]}],"prevTopicId":39332,"nextTopicId":39355}}