{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":363518215,"authorName":"Claire","from":"&quot;Claire&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: finding me again??","postDate":"1278385787","msgId":55665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwdTZwcityYTUzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrNFpYWUVyWVppUmtORDg1c2VyYnZYMFFiZVU5OVZIUnFVTElGX0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":55656,"nextInTopic":0,"prevInTime":55664,"nextInTime":55666,"topicId":55649,"numMessagesInTopic":0,"msgSnippet":"A lot of my intellectual stimulation over the last three years has been through reading this list and other sources of unschooling info.  I have found it","messageBody":"<div id=\"ygrps-yiv-708220212\">A lot of my intellectual stimulation over the last three years has been through reading this list and other sources of unschooling info.  I have found it endlessly rewarding to delve each day into the conundrums and dilemmas of unschoolers on the Always Learning list.  It has been very empowering and confidence-building for me to develop a really robust set of ideas which guides my daily life with my kids.<br/>\n<br/>\nSo if you are an expert on your kids and are happy to devote lots of time and energy to your unschooling lives, then that IS you.  You don&#39;t need to &#39;find you&#39; again. However, you can allow yourself the same kinds of opportunities to experiment and explore that you provide for your kids. What kinds of things are you drawn to? Are you good with your hands? Knitting and other crafts are fairly easy to pick up and put down. Do you like to garden? A veggie patch (if you don&#39;t already have one) could be very rewarding for both you and the kids. Or how about a magazine subscription? A musical instrument? So many possibilities ...<br/>\n<br/>\nOne great thing I got last Christmas was a beautiful cookbook called &#39;Kitchen Garden Companion&#39; by Stephanie Alexander, which brings together my interest in growing food and my desire to be a better cook. And since I am cooking dinner every night anyway, it&#39;s not like a whole new hobby requiring lots of time.<br/>\n<br/>\nIt is good to be a bit interesting, to be reasonably well-read, to have opinions and interests, because it makes you a well-rounded person - satisfying for you and a good role-model for your kids.<br/>\n<br/>\nClaire<br/>\n<br/>\nMelbourne, Australia<br/>\nKids - Ashlin,5 & Eden,3</div>","specialLinks":[]},{"userId":239531140,"authorName":"renee_cabatic","from":"&quot;renee_cabatic&quot; &lt;renee_cabatic@...&gt;","profile":"renee_cabatic","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: finding me again??","postDate":"1278349517","msgId":55656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwdDNjZCs4ZjQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIyODA2LjY0NzgzLnFtQHdlYjg2MjA0Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":55655,"nextInTopic":55665,"prevInTime":55655,"nextInTime":55657,"topicId":55649,"numMessagesInTopic":0,"msgSnippet":"I wanted to second what Alex and Schuyler said and add that when my twins were between 5 and 6 they had a surge of independence that left me feeling a bit lost","messageBody":"<div id=\"ygrps-yiv-1054604755\">I wanted to second what Alex and Schuyler said and add that when my twins were between 5 and 6 they had a surge of independence that left me feeling a bit lost with a fair amount of free-ish time on my hands.  I tried a couple of different projects but they were distractions from my main interest. I soon realized this in part because of unschooling and this list. I settled into a comfortable place being available to Xander and XuMei. <br/>\n<br/>\n  They are 9 now and I do things with them.  And when I&#39;m doing something on my own (like writing this) I want to be able to drop whatever I am doing and be with them.  I want to be able to answer questions when they ask them not when I am done with what I am doing.  <br/>\n<br/>\n  And know this:  Being able to be with kids and know them and meet their needs IS a huge talent and skill that not everyone has.  Some people work harder at it than others.  Some don&#39;t even try.  But it is important and valuable.<br/>\n<br/>\nspeaking of..Xander is up and asking why do trees grow up? So I&#39;m off...<br/>\nRenee Cabatic<br/>\nMa to Xander and XuMei (9)</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] finding me again??","postDate":"1278339252","msgId":55655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrNFpYWUVyWVppUmtORDg1c2VyYnZYMFFiZVU5OVZIUnFVTElGX0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGkwcmFsbisxMGkwMkBlR3JvdXBzLmNvbT4=","referencesHeader":"PGkwcmFsbisxMGkwMkBlR3JvdXBzLmNvbT4="},"prevInTopic":55653,"nextInTopic":55656,"prevInTime":55654,"nextInTime":55656,"topicId":55649,"numMessagesInTopic":0,"msgSnippet":"I had Karl in my late 30s and only just gotten married about 3 years before. So that s another thing. The timelines of different people fall very differently! ","messageBody":"<div id=\"ygrps-yiv-514494222\">I had Karl in my late 30s and only just gotten married about 3 years<br/>\nbefore. So that&#39;s another thing. The timelines of different people<br/>\nfall very differently!<br/>\n<br/>\nHaving a child to care for is very much all-consuming for me. Some<br/>\npeople for one reason or another aren&#39;t as fortunate to have the time<br/>\nto put into their kid(s) -- finances or illness, etc pulls them away.<br/>\nEveryone&#39;s focus is driven somewhat by necessity and somewhat by<br/>\nchoice.<br/>\n<br/>\nSomeone else might get a lot done but their body rebels against the<br/>\npace. I called a friend yesterday who I haven&#39;t talked with in a while<br/>\nand she is in pain after 6 weeks of very welcome unaccustomed<br/>\nmothering to a grown child who needed a place between jobs. He&#39;s going<br/>\nto train for something he&#39;s wanted to do for a long time (I&#39;ve<br/>\nforgotten what). Normally she gardens all day. None of that is in the<br/>\nrealm of &quot;hobby&quot; really but full on passions. Parenting can definitely<br/>\nbe like that.<br/>\n<br/>\nWhen I had Karl, it took some time to transition to parenting after<br/>\nworking and school for years and expecting to work more. I kept<br/>\nfeeling like I wasn&#39;t busy enough just sitting around nursing and<br/>\ndiapering and recouperating after birth and light housekeeping and<br/>\ncooking! What it really IS is a lot activities people often think less<br/>\nof even tho it&#39;s much needed in this world. It&#39;s all in the way we<br/>\nthink and talk about these things which can make it seem like<br/>\nparenting isn&#39;t 100% wonderful.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 7/4/10, m_aduhene &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:m_aduhene@...\">m_aduhene@...</a>&gt; wrote:<br/>\n&gt; hi all,<br/>\n&gt; my children are 9,6 and 4.<br/>\n&gt; i have been present for them for the whole of their lives so far.  i have<br/>\n&gt; had only 6 weeks of absence from them due to a period in hospital.<br/>\n&gt; i am available for them whenever they need and try my hardest to give as<br/>\n&gt; much attention to each as i can.<br/>\n&gt; i just feel i have lost myself somewhere.  i know i have changed and matured<br/>\n&gt; since my eldest was born.  being a mother has tested me and made me question<br/>\n&gt; things about myself, my life, realtionships and many, many such positive<br/>\n&gt; things.<br/>\n&gt; i just feel a bit lost now.<br/>\n&gt; my youngest doesn&#39;t &quot;need&quot; me as much and i am finding i have time on my<br/>\n&gt; hands.  i have never really been a hobbies person.  this doesn&#39;t really<br/>\n&gt; bother me until i meet friends or come here to this group and you all seem<br/>\n&gt; to have &quot;other parts&quot; to your lives that you manage to maintain.<br/>\n&gt; my husband works a lot and long hours and so i am the sole child carer which<br/>\n&gt; i love.  if i begin something even washing the dishes i am usually asked to<br/>\n&gt; go help a child out (which i don&#39;t mind) but i just think if i were to begin<br/>\n&gt; a hobby then i would constantly have to put it away or leave it till later<br/>\n&gt; if someone needed something so it seems easier to not start one<br/>\n&gt; yet.....which i am fine with.<br/>\n&gt; i just feel, if i am honest, a bit boring to be around....we do loads<br/>\n&gt; together me and the children.  different places, meet up with friends and i<br/>\n&gt; love my life.  BUT<br/>\n&gt; i feel i need to &quot;be&quot; something and have some skills and talents like<br/>\n&gt; drawing or playing the piano etc.  even following the threads on here i<br/>\n&gt; sometimes wonder if my brain has turned to mush as i read some of the<br/>\n&gt; theories and studies, and knowledge you all have.<br/>\n&gt; blessings<br/>\n&gt; michelle<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] finding me again??","postDate":"1278313953","msgId":55653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyODA2LjY0NzgzLnFtQHdlYjg2MjA0Lm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGkwcmFsbisxMGkwMkBlR3JvdXBzLmNvbT4=","referencesHeader":"PGkwcmFsbisxMGkwMkBlR3JvdXBzLmNvbT4="},"prevInTopic":55651,"nextInTopic":55655,"prevInTime":55652,"nextInTime":55654,"topicId":55649,"numMessagesInTopic":0,"msgSnippet":"I can remember feeling that way when Simon and Linnaea were younger, they didn t need me as much and I was sort of third wheelie to their lives. And I felt","messageBody":"<div id=\"ygrps-yiv-562676686\">I can remember feeling that way when Simon and Linnaea were younger, they didn&#39;t need me as much and I was sort of third wheelie to their lives. And I felt like I really didn&#39;t have any interests or any things to go do when they were doing their own thing. I&#39;ve since discovered, as they&#39;ve actually grown older still and my time without them is growing as well, that the real problem was that they still needed me so much. It wasn&#39;t that I couldn&#39;t find things to putter about doing as much as it was that I didn&#39;t have true time to putter about. They needed me at fairly regular intervals. Or at fairly irregular regular intervals. So if I had sat down to do something within minutes I would get pulled away. I found that I tended to get irritable being pulled away from the thing I was doing, even though I was only doing whatever to fill the moments when Simon or Linnaea didn&#39;t need me. <br/>\n<br/>\nIn the end I found things that were sort of limbo-esque. Things that I didn&#39;t really care so much about and that I wouldn&#39;t mind getting pulled away from. You mentioned dishes, housework was one thing, but less frequent than others. More things like watching a cartoon or playing a video game or reading a magazine or looking for something on-line. Idling kinds of things. And things that were welcoming to both Simon and Linnaea. <br/>\n<br/>\nI probably would worry less about finding yourself and just enjoy the change in flow throughout the day. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nhi all,<br/>\nmy children are 9,6 and 4.<br/>\ni have been present for them for the whole of their lives so far.  i have had only 6 weeks of absence from them due to a period in hospital.<br/>\ni am available for them whenever they need and try my hardest to give as much attention to each as i can.<br/>\ni just feel i have lost myself somewhere.  i know i have changed and matured since my eldest was born.  being a mother has tested me and made me question things about myself, my life, realtionships and many, many such positive things.<br/>\ni just feel a bit lost now.<br/>\nmy youngest doesn&#39;t &quot;need&quot; me as much and i am finding i have time on my hands.  i have never really been a hobbies person.  this doesn&#39;t really bother me until i meet friends or come here to this group and you all seem to have &quot;other parts&quot; to your lives that you manage to maintain.<br/>\nmy husband works a lot and long hours and so i am the sole child carer which i love.  if i begin something even washing the dishes i am usually asked to go help a child out (which i don&#39;t mind) but i just think if i were to begin a hobby then i would constantly have to put it away or leave it till later if someone needed something so it seems easier to not start one yet.....which i am fine with.<br/>\ni just feel, if i am honest, a bit boring to be around....we do loads together me and the children.  different places, meet up with friends and i love my life.  BUT<br/>\ni feel i need to &quot;be&quot; something and have some skills and talents like drawing or playing the piano etc.  even following the threads on here i sometimes wonder if my brain has turned to mush as i read some of the theories and studies, and knowledge you all have.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] finding me again??","postDate":"1278303546","msgId":55651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3NDA3Ljg4OTU3LnFtQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDY0NzE4LjEzNDEwLnFtQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGkwcmFsbisxMGkwMkBlR3JvdXBzLmNvbT4gPDY0NzE4LjEzNDEwLnFtQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":55650,"nextInTopic":55653,"prevInTime":55650,"nextInTime":55652,"topicId":55649,"numMessagesInTopic":0,"msgSnippet":" Correction~ Everthing else comes second.   Alex Polikowsky [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-919121472\">&lt;&lt;Everything else  does comes second&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nCorrection~<br/>\n<br/>\nEverthing else comes second. <br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] finding me again??","postDate":"1278302818","msgId":55650,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0NzE4LjEzNDEwLnFtQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGkwcmFsbisxMGkwMkBlR3JvdXBzLmNvbT4=","referencesHeader":"PGkwcmFsbisxMGkwMkBlR3JvdXBzLmNvbT4="},"prevInTopic":55649,"nextInTopic":55651,"prevInTime":55649,"nextInTime":55651,"topicId":55649,"numMessagesInTopic":0,"msgSnippet":"It seems like your children and caring for your family is the most important thing right now for you and if you don t have anything else the gives you more","messageBody":"<div id=\"ygrps-yiv-581369174\">It seems like your children and caring for your family is the most important thing right now for you and <br/>\nif you don&#39;t have anything else the gives you more pleasure than your kids than that is it.<br/>\nAre you feeling you need to have another passion or hobby just because other have them?<br/>\nWhy are you comparing yourself to others?<br/>\nI have many many things that I gladly put on hold in my life because of my young children.<br/>\nThey are more important to me then those things and I am happy to be with my kids instead , for example,<br/>\nat dog shows.<br/>\n There may be many things you enjoy and even do right now that you are NOT seeing as a hobby or valuable.<br/>\nDO you read? like movies? like cooking for your family?  do you like helping at church?<br/>\n those and much much more ARE hobbies too!<br/>\nI enjoy looking for things on craigslist for my kids and going to the pool with them.<br/>\nThey are more satisfying for me than , for example, making scrapbooks about them.<br/>\nEveryone is different and likes doing different things.<br/>\nMy children and family are my priority and at the top of the list of my passions in life.<br/>\nThey are my favorite hobby!<br/>\nEverything about them brings me joy and happiness in life.<br/>\nMy life is full and complete because of my children.<br/>\nEverything else  does comes second.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":227835915,"authorName":"m_aduhene","from":"&quot;m_aduhene&quot; &lt;m_aduhene@...&gt;","profile":"m_aduhene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"finding me again??","postDate":"1278291447","msgId":55649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGkwcmFsbisxMGkwMkBlR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":55650,"prevInTime":55648,"nextInTime":55650,"topicId":55649,"numMessagesInTopic":0,"msgSnippet":"hi all, my children are 9,6 and 4. i have been present for them for the whole of their lives so far.  i have had only 6 weeks of absence from them due to a","messageBody":"<div id=\"ygrps-yiv-1413576546\">hi all,<br/>\nmy children are 9,6 and 4.<br/>\ni have been present for them for the whole of their lives so far.  i have had only 6 weeks of absence from them due to a period in hospital.<br/>\ni am available for them whenever they need and try my hardest to give as much attention to each as i can.<br/>\ni just feel i have lost myself somewhere.  i know i have changed and matured since my eldest was born.  being a mother has tested me and made me question things about myself, my life, realtionships and many, many such positive things.<br/>\ni just feel a bit lost now.<br/>\nmy youngest doesn&#39;t &quot;need&quot; me as much and i am finding i have time on my hands.  i have never really been a hobbies person.  this doesn&#39;t really bother me until i meet friends or come here to this group and you all seem to have &quot;other parts&quot; to your lives that you manage to maintain.<br/>\nmy husband works a lot and long hours and so i am the sole child carer which i love.  if i begin something even washing the dishes i am usually asked to go help a child out (which i don&#39;t mind) but i just think if i were to begin a hobby then i would constantly have to put it away or leave it till later if someone needed something so it seems easier to not start one yet.....which i am fine with.<br/>\ni just feel, if i am honest, a bit boring to be around....we do loads together me and the children.  different places, meet up with friends and i love my life.  BUT<br/>\ni feel i need to &quot;be&quot; something and have some skills and talents like drawing or playing the piano etc.  even following the threads on here i sometimes wonder if my brain has turned to mush as i read some of the theories and studies, and knowledge you all have.<br/>\nblessings<br/>\nmichelle</div>","specialLinks":[]}],"prevTopicId":55657,"nextTopicId":55453}}