{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Helen","from":"Helen &lt;Helen@...","replyTo":"LIST","senderId":"N4rvrHvQlf2rvbm0OP6YLQn08vD2uMddZMSEbqsm2ahVoH6m3v9zEdT2trOgS1l-s6qaK5OdFyB17LC9INDP6qF4PcU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fwd: Will homeschoolers help win this battle for their rights?","postDate":"947796157","msgId":5608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNzAuNTYwOC45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":5607,"nextInTime":5609,"topicId":5608,"numMessagesInTopic":0,"msgSnippet":"[This is forwarded from our Washington state list:]","messageBody":"<div id=\"ygrps-yiv-362879713\">[This is forwarded from our Washington state list:]<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;From: &quot;Kathleen McCurdy&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kathleen@...\">kathleen@...</a>&gt;<br/>\n&gt;<br/>\n&gt;HOME EDUCATION UNDER ATTACK<br/>\n&gt;Who Should Control the Measuring of Educational Progress?<br/>\n&gt;<br/>\n&gt;It was in April of 1985 that Washington&#39;s then governor, Booth Gardner,<br/>\n&gt;signed into law a bill making homeschooling legal in this state. Choosing to<br/>\n&gt;follow a trend that was sweeping across the country, the state legislature<br/>\n&gt;wrote a fairly liberal law with a few qualifications for parents to meet, as<br/>\n&gt;well as a few duties, and no real teeth in it. Lobbyists had persuaded<br/>\n&gt;legislators and the public alike to trust parents to know what is best for<br/>\n&gt;their children.<br/>\n&gt;<br/>\n&gt;Many legislators insisted that &quot;tests&quot; must be required, and so it was<br/>\n&gt;ordained. Yet no mechanism was devised to enable this requirement. And no one<br/>\n&gt;foresaw that this item might become a potential downfall for the movement.<br/>\n&gt;<br/>\n&gt;As other states across the country enacted legislation, Washington&#39;s testing<br/>\n&gt;requirement was often imitated. Many states now require standardized<br/>\n&gt;achievement tests as a measure of accountability or for determining if<br/>\n&gt;children are really being taught. Some states have a minimum percentile<br/>\n&gt;ranking students must achieve, but most seem only to expect that parents will<br/>\n&gt;use the test scores to determine if changes need to be made in the homeschool<br/>\n&gt;program. Not all states require testing.<br/>\n&gt;<br/>\n&gt;Then too, parents often want to know how their homeschooling is progressing,<br/>\n&gt;and standardized tests are an easy way to compare their children to those in<br/>\n&gt;public school. Since most homeschooled students score well above average<br/>\n&gt;(depending on how long they&#39;ve been homeschooled), the test scores can be a<br/>\n&gt;source of encouragement and affirmation.<br/>\n&gt;<br/>\n&gt;In view of the movement&#39;s rapid growth, strong showing, and the rather dismal<br/>\n&gt;state of things in the public schools, the avowed opponents of homeschooling<br/>\n&gt;have had to bide their time. But now it appears they have found a chink in<br/>\n&gt;the strong armor of the movement&#39;s ongoing success.<br/>\n&gt;<br/>\n&gt;When Family Learning Organization started a testing service in December of<br/>\n&gt;1987, there were probably a dozen little testing services around the country<br/>\n&gt;catering to homeschoolers. Kay Elam in Georgia, a pastor&#39;s wife in Arkansas,<br/>\n&gt;Seton School in Virginia, Christian Liberty Academy in Chicago come to mind.<br/>\n&gt;Some had sold tests to parents for years. Emporia State University&#39;s Bureau<br/>\n&gt;of Educational Measurements seemed anxious to help the fledgling movement.<br/>\n&gt;They sent a letter offering to make tests available to any organization that<br/>\n&gt;could meet their criteria.<br/>\n&gt;<br/>\n&gt;But not everyone was happy that homeschooling parents wanted to test their<br/>\n&gt;own children. Trouble came from some whom we thought were our friends. Within<br/>\n&gt;a few short months FLO received an angry letter from one of the test<br/>\n&gt;publishers demanding that we quit sending tests to parents. FLO explained<br/>\n&gt;that our state law required homeschooling parents to provide an annual test<br/>\n&gt;or assessment and that it was our intention to help parents comply with the<br/>\n&gt;law. Shortly, we received an almost identical letter from another publisher,<br/>\n&gt;and this one conveyed to us the name of our accuser-a homeschool leader that<br/>\n&gt;was at that time associated with another Washington homeschool organization.<br/>\n&gt;<br/>\n&gt;While the test publishers avowed not to sell tests to FLO, we continued to<br/>\n&gt;order them from other sources such as Emporia University. But it didn&#39;t take<br/>\n&gt;long for the publishers to discover who were selling tests to parents, and<br/>\n&gt;one by one they were put out of business. Even Emporia ceased to offer their<br/>\n&gt;services and the national homeschooling community was virtually left without<br/>\n&gt;a source of tests.<br/>\n&gt;<br/>\n&gt;At this time Michael Farris at Homeschool Legal Defense Association went to<br/>\n&gt;one of the publishers (eventually other publishers went along) and persuaded<br/>\n&gt;them to allow Bob Jones University to offer the tests with the understanding<br/>\n&gt;that only teachers or specially trained persons with a Baccalaureate degree<br/>\n&gt;would be allowed to administer the tests. While this seemed to be a salvation<br/>\n&gt;for the homeschooling community, it appeared to FLO and others as a dangerous<br/>\n&gt;sellout-and a short step away from requiring all homeschooling to be<br/>\n&gt;supervised by persons who were teachers or who held degrees.<br/>\n&gt;<br/>\n&gt;So FLO changed tactics and began reusing test booklets and creating our own<br/>\n&gt;answer forms and finding other ways of making tests available to parents who<br/>\n&gt;did not wish to be dependent on teachers for tests. The idea of changing the<br/>\n&gt;law&#39;s requirement for testing was considered but, as OSPI director Barbara<br/>\n&gt;Mertens pointed out, the risk of opening up the law was too great and we<br/>\n&gt;decided there were other solutions to explore. One solution was to create our<br/>\n&gt;own school for the purpose of ordering tests. Ms. Mertens encouraged this<br/>\n&gt;idea and in fact approved the paperwork we submitted. Our school had a<br/>\n&gt;certified teacher and her two homeschooled students... and we ordered<br/>\n&gt;hundreds of tests! Thousands of parents were thus able to test their children<br/>\n&gt;&quot;in their normal learning environment&quot;, as the test instructions recommend.<br/>\n&gt;<br/>\n&gt;But alas, Riverside Publishing Company has decided to leave off the posturing<br/>\n&gt;and nasty letters we have fended off all these years, and has finally made<br/>\n&gt;good on their threat: Family Learning Organization, our teacher of record<br/>\n&gt;Margaret Donovan, and Kathleen McCurdy have been charged in federal court<br/>\n&gt;with various charges including copyright infringement and fraud. Previously,<br/>\n&gt;Riverside demanded that all tests be returned to them, along with a list of<br/>\n&gt;all our customers. If FLO had complied, no charges would have been filed. But<br/>\n&gt;here are the reasons we chose not to go along with their demands:<br/>\n&gt;1. Homeschooling families have the right not to have their names divulged,<br/>\n&gt;and FLO has and will staunchly defend that right.<br/>\n&gt;2. Should one publisher succeed in getting us to quit using their materials,<br/>\n&gt;soon all the others would follow-and homeschoolers would be left without a<br/>\n&gt;means to comply with the law and of comparing their student&#39;s progress to<br/>\n&gt;that of the national average.<br/>\n&gt;3. If parents must rely on teachers to administer the test (generally in<br/>\n&gt;group settings and in strange surroundings that put the homeschooled student<br/>\n&gt;at a disadvantage), it will be a small step to further demand that<br/>\n&gt;legislatures make teacher supervision mandatory for all homeschoolers.<br/>\n&gt;<br/>\n&gt;Not everyone feels that testing is important. Nor does everyone agree that<br/>\n&gt;parents are the best teachers of their children. But if we start down the<br/>\n&gt;path of requiring professional supervision for all, where will it end?<br/>\n&gt;Sometimes it can feel like the little Dutch boy with his finger stopping the<br/>\n&gt;hole in the dike! With the federal government looking to pass measures that<br/>\n&gt;guarantee homeschoolers admission into the military on the strength of a<br/>\n&gt;diploma issued by parents, and on the same basis allowing them to receive<br/>\n&gt;federal grant money for college tuition, is it not right that we defend a<br/>\n&gt;parent educator&#39;s right to have access to standardized tests?<br/>\n&gt;<br/>\n&gt;If you want to help us fight this battle, write to Riverside Publishing,<br/>\n&gt;Itasca IL 60143-2079 or  www.riverpub.com (cc to FLO please). You may send<br/>\n&gt;contributions to the FLO Legal Fund. All who contribute will be kept informed<br/>\n&gt;of the progress of this case. Even if we win, we lose-unless the publishers<br/>\n&gt;are required to allow their tests to be used by parent educators. This will<br/>\n&gt;be costly.<br/>\n&gt;-KSM<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":5607,"nextTopicId":5609}}