{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":55,"messages":[{"userId":72373211,"authorName":"JH","from":"JH &lt;roseelly@...&gt;","profile":"roseelly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Reading- Freedom","postDate":"1319038268","msgId":63480,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTkwMzgyNjguMjA5MDUuWWFob29NYWlsTmVvQHdlYjEyMTcxNi5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PGo3bWlxbittajRtQGVHcm91cHMuY29tPg==","referencesHeader":"PDFEQjY1RUNCLUY4QjQtNDdDMS04OENFLUM0ODRENUQyODNBQkBTYW5kcmFkb2RkLmNvbT4gPGo3bWlxbittajRtQGVHcm91cHMuY29tPg=="},"prevInTopic":63478,"nextInTopic":63481,"prevInTime":63479,"nextInTime":63481,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":" I wanted to get an opinion on a debate my husband and I are having about reading.  Brief background My daughter (5) sometimes complains that she is bored or","messageBody":"<div id=\"ygrps-yiv-197795857\"> I wanted to get an opinion on a debate my husband and I are having about reading.  <br/>\n<br/>\n<br/>\nBrief background<br/>\n<br/>\nMy daughter (5) sometimes complains that she is bored or that her schedule is dictated by adults.  She said to my husband last night &quot;Adults have things to do everyday cleaning, going to work, shopping- us kids don&#39;t have that&quot;   She gets an allowance every week which is not dependent on anything just for being part of the family.  She can take any chore she wants to have and make it her own- I don&#39;t force chores and never have.  People in our family contribute in the ways they like to and that works best for us.  She can also make her schedule.  I have a schedule for the kids but it is not strict and very free flowing.<br/>\n<br/>\n<br/>\nI work and have a nanny in during the day from 9am to 5pm period during the week.  I have tons of activities, games, toys available but the nanny is not very proactive and does not seem to be very interesting to my kids lately.  My husband read very early at age 4 and my daughter is 5 and does not read yet.  She reads many thing but I guess she would still be called a &quot;pre-reader&quot;.      She does not seem bored when she is with me and her dad or her grandmother but the nanny situation seems to be an issue.                 <br/>\n<br/>\n<br/>\nMy husband thinks my daughter&#39;s ability to read is the key to her freedom and I disagree.  I don&#39;t want to force her to read if she is not ready and I am sure he doesn&#39;t wants me to force her to do anything but he thinks I am being dishonest if I do not admit that reading equals freedom in learning and that without reading you are always dependent on others for your learning.<br/>\n<br/>\nWhat do you think?<br/>\n<br/>\nElly<br/>\n<br/>\nElly, Rob, Cleyre(5), Ruti (2)<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Literacy and dislexia","postDate":"1319031956","msgId":63477,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQyODAwM0NFLUMyNTgtNDZENS05RDU1LTA2RjA3NDlBQjcwOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo3bWdhcCt0Y2ljQGVHcm91cHMuY29tPg==","referencesHeader":"PGo3bWdhcCt0Y2ljQGVHcm91cHMuY29tPg=="},"prevInTopic":63476,"nextInTopic":63478,"prevInTime":63476,"nextInTime":63478,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"-=-As a result, at 2.5 he recognizes some words and letters, has his numbers fairly in order, and neither stream did a whole lot for him positively, but we","messageBody":"<div id=\"ygrps-yiv-805982157\">-=-As a result, at 2.5 he recognizes some words and letters, has his numbers fairly in order, and neither stream did a whole lot for him positively, but we were resistant enough to it so that it didn&#39;t get negative in any way. Doman is very clear on stopping if it&#39;s not fun or you&#39;re not being fun and engaging. -=-<br/>\n<br/>\nMy kids learned a lot from one single cassette tape we bought from Discovery Toys, called &quot;Sounds Like Fun.&quot;<br/>\n<br/>\nCompared to music like Jim Henson/muppets stuff and Raffi (which we also listened to a lot in the car and around the house), the quality of the music and performance wasn&#39;t fantastic.  The songs were all about the same speed, which I found interesting--slowish, so&#39;s one could go to sleep to it. :-)   That part reminded me of  the 1960&#39;s beliefs (hopes!) that people could learn in their sleep, listening to recordings.     [Slow like 60 beats per minute.  I joked with Keith that I thought she put a metronome on when she recorded those, and honestly, she might have.  It would slow my heart down.]<br/>\n<br/>\nI sang the alphabet to my kids just for fun, for a song to sing, and they all knew that song.  I sang the days of the week to them as a tooth-brushing song, and so they all knew those, in order, and I used the tune to Yankee Doodle, so singing the week four times was a month.  They had that idea early.  And because it was a song, it was just in them to pull back out and examine when they were older.<br/>\n<br/>\n&quot;Sounds Like Fun&quot;   Oh jeez... I&#39;d hoped to come tell you it was still available, but used copies are really expensive at Amazon.<br/>\nHere&#39;s one of the reviews:<br/>\n<br/>\n&quot;I bought this CD years ago and it is very nice. The music is soothing and not obnoxious. The melodies are catchy and sometimes I find myself singing the songs all day long--esp. months of the year and counting by 10&#39;s. What you will hear is a lady singing while playing the guitar.&quot;<br/>\n<br/>\nI sing some of those still, and I my kids occasionally will still make a joke about one of them, or sing a snatch of something, mostly the counting by tens song.<br/>\n<br/>\nMaybe they have it on CD still:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.verysmarttoys.com/gsalist.htm\">http://www.verysmarttoys.com/gsalist.htm</a><br/>\n<br/>\nThe alphabet chart they show there is thin cardboard (or used to be). We have ours somewhere all worn out.  It&#39;s the first thing I started messing with when we got Photoshop Elementsy years ago--to scan that and fix it up.  I never finished, and the kids didn&#39;t need it, but it was fun practice for me.  The corners and edges were all worn off of ours.  (I don&#39;t have that image anymore.  It was a few computers ago.)<br/>\n<br/>\nTHE DOWNSIDE (very minor).  Not the downside of that recording, but of Discovery Toys. :-)  They list it on their main site as &quot;Reading & Language&quot; and that&#39;s all.  It&#39;s music and math and interpersonal relations.  Not &quot;reading.&quot;  Gross!  But &quot;pre-reading,&quot; yes.  Their alphabet song is about the sounds of letters, and it&#39;s a little lame, but easy to sing along to and very easy to fall asleep to. :-)<br/>\n<br/>\nThe coolest thing EVER, ever, about my kids learning so many things from songs is that the only &quot;test&quot; is whether they can sing the song, or laugh at it, or enjoy it, or mess with it (which Marty did to those, especially, and would crack us up).  And if they didn&#39;t like it, it wasn&#39;t played.  But that one, they all liked. <br/>\n<br/>\nMarty made two very funny jokes, when he was probably four, maybe three, in the car both times, and they won&#39;t be as funny to anyone who doesn&#39;t know slow-paced song, but one song goes<br/>\nI can count by tens up to a hundred<br/>\nI can count by tens, ready here I go.<br/>\nTen, twenty, thirty, forty, fifty, sixty,<br/>\nSeventy, eighty, ninety, one hun- dred.<br/>\n<br/>\nMarty sang once in the car (with the tape off, and just as slowly and rhythmically), <br/>\n&quot;I can count by ones up to one<br/>\nI can count by ones, ready here I go.<br/>\nOne.&quot;<br/>\n<br/>\nAnother day he sang:<br/>\n<br/>\nI can count by tens up to a hundred<br/>\nI can count by tens, ready here I go.<br/>\nTen, twenty, thirty, forty, fifty, sixty,<br/>\nSeventy, eighty, ninety, one hun- dred.<br/>\nA hundred and ten, a hundred and twenty a hundred and thirty...&quot;   (That&#39;s probably about as far as he got, but we all imagined some of the rest.)<br/>\n<br/>\nMaybe now, 20 years later, it would be way more lame.  I don&#39;t know, but if something intended to be &quot;educational&quot; is used for fun, it&#39;s just fun (and maybe educational).    I always thought &quot;will they learn?&quot; from anything I bought or used or did, and as time went on, I saw more and more learning.  I think it&#39;s a mistake, though, when new unschoolers don&#39;t look for learning.  I think it&#39;s part of the process of getting away from &quot;educational&quot; without ever getting away from learning.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":239308464,"authorName":"Lang","from":"&quot;Lang&quot; &lt;lizasheehan@...&gt;","profile":"poppygirllang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Looking for encouragement, advise, connection","postDate":"1319030423","msgId":63478,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3bWlxbittajRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFEQjY1RUNCLUY4QjQtNDdDMS04OENFLUM0ODRENUQyODNBQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63477,"nextInTopic":63480,"prevInTime":63477,"nextInTime":63479,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"My husband, Alex, Participated in this the other day.  He works at G4 (cable network)and 300 employees participated in this charity event.  Gaming is","messageBody":"<div id=\"ygrps-yiv-2108492146\">My husband, Alex, Participated in this the other day.  He works at G4 (cable network)and 300 employees participated in this charity event.  Gaming is considered as valuable as a fun-run, walk, ride for charity!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.extra-life.org/index.cfm?\">http://www.extra-life.org/index.cfm?</a><br/>\n<br/>\nLiza</div>","specialLinks":[]},{"userId":277265547,"authorName":"maltmanjamie","from":"&quot;maltmanjamie&quot; &lt;jamie.maltman@...&gt;","profile":"maltmanjamie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Literacy and dislexia","postDate":"1319027865","msgId":63476,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3bWdhcCt0Y2ljQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ2ODRFMUFDLUYyRTctNDY3QS1BMzY1LTE3MEE0QjQ4N0ZDREBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":63475,"nextInTopic":63477,"prevInTime":63475,"nextInTime":63477,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"As someone in my 30s whose Mum used the Doman method with me, and resulted in me reading Narnia along with her before 3 and Tolkien with her and without her","messageBody":"<div id=\"ygrps-yiv-1583378777\">As someone in my 30s whose Mum used the Doman method with me, and resulted in me reading Narnia along with her before 3 and Tolkien with her and without her soon after, I was naturally curious about the methods when my son was born. <br/>\n<br/>\nMy wife and I ate it up, and started making our materials for him in the various streams of math, words and bits (pictures of bits of knowledge). <br/>\n<br/>\nA funny thing happened along the way. We found it hard not to test - which he expressly forbidden as damaging to learning. (deschooling early) We found it easy and fun to do the picture bits in most topics, but he wasn&#39;t interested in others. It was hard to just put those away unused since we put effort into making the sets. But we did put them away. The ones he liked, we kept using. He occasionally asks to pull them out sometimes. <br/>\n<br/>\nThe ones that were hardest to present with sincere joy and fun were the math and reading bits. So we dropped them the quickest. And when it came time to create programs of information (facts about the pictures) we stopped as I got started. It was easier and more fun to explore a wikipedia page, sharing random facts that interested me about the picture that engaged him, rather than take them out piece by piece and in an arbitrary order. With the added benefit of quickly googling tobrelated pictures or videos in the voyage of discovery. <br/>\n<br/>\nAs a result, at 2.5 he recognizes some words and letters, has his numbers fairly in order, and neither stream did a whole lot for him positively, but we were resistant enough to it so that it didn&#39;t get negative in any way. Doman is very clear on stopping if it&#39;s not fun or you&#39;re not being fun and engaging. <br/>\n<br/>\nWe abandoned making stuff Doman-style after about 6 months of doing it because it just seemed so much easier to find books or shows or stuff in life than to be constantly and artificially making these sets and materials. <br/>\n<br/>\nIn a nutshell I now think (as a result of discovering unschooling about a year in), that if you are superhuman and follow his stuff to the letter, you will be exposing your child to a lot of amazing things (a sort of warp-speed paternalistic strewing) and that as long as you are doing it lovingly, in a fun and engaging way, and without testing or pressure (on you or them), that you would be providing a rich and sparkly experience for them. But it&#39;s a lot of work to create this stuff fast enough for your child&#39;s interest, and it&#39;s hard to use something once and discard it unloved and not at least try and push it. <br/>\n<br/>\nI love that he sees they joyful potential in children, that he wants them to be able to joyfully learn as much and as quickly as they want. It&#39;s just that what he outlines is a lot of work, hard for schooled people to stick to without making it stressful for themselves and/or their kids, and it all leaves you thinking that there has to be a better, simpler way. <br/>\n<br/>\nSo why not take the best of it and just have lots of awesome things in the environment, to make fun and following the child&#39;s interests an level of engagement where they lead and making sure there&#39;s exposure to larger sizes of print that might be engaging to your child? Basically, to unschool instead. <br/>\n<br/>\nNow do I feel bad for doing it? No way. We had tons of fun and he got exposed to tons of awesome things that led to him being interested in The Beatles, Van Gogh and Picasso, Ghandhi, Pryzwalski&#39;s horse, JS Bach, Alexander Graham Bell, human body organs, puffins and many, many more when he recognized pictures from some of our bits in other contexts of books, movies, or at the zoo. <br/>\n<br/>\nThank you Glen Doman for leading me to a world of joyful discovery and amazing close bond with my son, for giving some great principles to stop myself from screwing it up, and for ultimately leading me continue searching for a way that made sense, which I found with unschooling and the work of John Holt and eventually to a great community here. <br/>\n<br/>\nCheers<br/>\nJamie (the Dad) <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pamela Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; On Oct 18, 2011, at 1:22 PM, Claire Darbaud wrote:<br/>\n&gt; <br/>\n&gt; &gt; And yet most school children I have met learn to read between 3 à 7 or 8.<br/>\n&gt; &gt; Doman and mothers following the doman method have taught young babies to<br/>\n&gt; &gt; read. So it&#39;s not true that nothing can be done until children come to<br/>\n&gt; &gt; reading naturally.<br/>\n&gt; <br/>\n&gt; I could find no scientific studies with control groups that show that Doman&#39;s methods result in any better outcomes than other methods carried out by extremely, intensely involved parents who emphasize play and exploration. Doman&#39;s institute has all kinds of pseudoscientific stuff - but they are, from what I have read, filled with methodological problems and are completely unreliable and suspect.<br/>\n&gt; <br/>\n&gt; His &quot;patterning&quot; methods are considered outmoded and potentially harmful in that they create false hopes and disappointment for parents and excessive stress on families.<br/>\n&gt; <br/>\n&gt; Do most school children read by 8? Probably a majority, but there are MANY who are not reading by 8. Most unschooled children do, too. I don&#39;t think it is the schooling (although they do readily take credit for it). I think it is that kids live in a world where reading is clearly important and useful and kids naturally learn such things (in school or out). Most are ready to learn by 8 or 9. But not all.<br/>\n&gt; <br/>\n&gt; Schools, however, by pushing reading on all kids and by expecting ALL kids to read by 9 (that&#39;s the big slogan in California public schools, anyway), do not acknowledge that some kids&#39; brains may not be ready to read and that pushing them might even be creating resistance and confusion and emotional reaction that makes reading more difficult for them, eventually resulting in a diagnosis of reading or learning disabilities.  <br/>\n&gt; <br/>\n&gt; And, no, I don&#39;t have scientific evidence for that last statement, but I&#39;ve seen it happen right before my eyes and I&#39;m firmly convinced that it isn&#39;t uncommon.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Reading Age","postDate":"1318981798","msgId":63475,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFN0ZCOUVFLTc1M0YtNEVFQi1BN0YwLTIxQUYwMjA3OUMwMkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDEzMTg5NzE1MTguNDM1MDYuWWFob29NYWlsUkNAd2ViODczMDMubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPiA8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPiA8Q0FHMHVXOG5iSnZ5emlUX1lGM0VlT1dqNE5hdDJBc3I3aS1qcU9feVdZX09NWFFISl93QG1haWwuZ21haWwuY29tPiA8MTMxODk3MTUxOC40MzUwNi5ZYWhvb01haWxSQ0B3ZWI4NzMwMy5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":63474,"nextInTopic":63476,"prevInTime":63474,"nextInTime":63476,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"Let s do a little survey…. When did your child learn to read? Go here to fill out a survey:  I ll leave it up until","messageBody":"<div id=\"ygrps-yiv-1482737121\">Let&#39;s do a little survey�.<br/>\n<br/>\nWhen did your child learn to read? Go here to fill out a survey:<br/>\n<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.surveymonkey.com/s/PGBJ788\">http://www.surveymonkey.com/s/PGBJ788</a>&gt;<br/>\n<br/>\nI&#39;ll leave it up until there are enough responses to be interesting and then report back here.<br/>\n<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":394445036,"authorName":"Rosalina Cantu Guzman","from":"Rosalina Cantu Guzman &lt;rosalina.cantu@...&gt;","profile":"rosalina.cantu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Learning unschooling","postDate":"1318979351","msgId":63474,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5NzkzNTEuNzQ4MDQuWWFob29NYWlsTmVvQHdlYjU5ODA5Lm1haWwuYWM0LnlhaG9vLmNvbT4=","inReplyToHeader":"PENBTXVqbWRzNzJjNFYrRD0xRTRkbnd3UDVzR3Jwc3pxOXctMXVmem9Bb2p5WDAwTXhNQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPiA8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPiA8Q0FHMHVXOG5iSnZ5emlUX1lGM0VlT1dqNE5hdDJBc3I3aS1qcU9feVdZX09NWFFISl93QG1haWwuZ21haWwuY29tPiA8OEM5RkJBMkUtNTREMC00REE1LUFCNEYtRDFFMUQzNzE1QThBQFNhbmRyYWRvZGQuY29tPiA8Q0FNdWptZHM3MmM0VitEPTFFNGRud3dQNXNHcnBzenE5dy0xdWZ6b0FvanlYMDBNeE1BQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63473,"nextInTopic":63475,"prevInTime":63473,"nextInTime":63475,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"I come from Puerto Rico, just moved to Nevada. And I started homeschool my son because he was getting sick from school literally. He developed croupe cough all","messageBody":"<div id=\"ygrps-yiv-2048718764\">I come from Puerto Rico, just moved to Nevada. And I started homeschool my son because he was getting sick from school literally. He developed croupe cough all year long, and Drs. didn&#39;t make sense of it. Until I took him off school . So after he left, the cough went away.<br/>\n<br/>\nOne day we had to return for some school papers, and he started coughing again. That&#39;s when we knew it was stress. I later learned that the teacher yelled at him because she was frustrated with him because he has speech problems, and told him he wouldn&#39;t be allowed to go outside to play until he finished, (he also is slow writing because he has a problem with his wrist). So we started homeschooling and he became so happy.<br/>\n<br/>\nBut in Puerto Rico even though homeschooling isn&#39;t regulated by the state, every mom in the group I was, was really obsessed to do a curriculum. And the stress of it got to me, like other moms. I&#39;m teaching him the right things? Is it<br/>\n enough? etc. And thought maybe a long distance school would solve my curriculum problem. Wrong! He had to work mornings and afternoons 7 days a week to finish all week assignments. So I took him off the school as well.<br/>\n<br/>\nSo when I came to Nevada and met people from different groups, told me about the laws here and about unschooling. And you have no idea how happy I am that I learned about of unschooling. My kid was labeled by the therapists, the family, everyone. In here he&#39;s just Mickey and now he can learn freely, he&#39;s eight loves Star Wars and wants to build robots, and loves to swim like a fish.<br/>\n<br/>\n I appreciate your post and all the posts I&#39;ve read because each day I learn more about unschooling. One of the principles I knew about unschooling, is you present the info to the child, but never force it. This I&#39;ve done with my kid, sometimes when he asks about something I show him and teach him, but let it go, and after a awhile he laters masters.<br/>\nIs there other tips you all can give me about unschooling...<br/>\n<br/>\nThank you, nice to meet you all<br/>\n<br/>\nRosalina<br/>\n<br/>\nRosalina Cantu Guzman<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.rcantu.net/\">http://www.rcantu.net/</a></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Literacy and dislexia","postDate":"1318979012","msgId":63473,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3MTYyNjA5LTI2OTgtNDhCQS05NTE5LTMwOTJCNTc0OTZFNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBRzB1VzhuYkp2eXppVF9ZRjNFZU9XajROYXQyQXNyN2ktanFPX3lXWV9PTVhRSEpfd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPiA8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPiA8Q0FHMHVXOG5iSnZ5emlUX1lGM0VlT1dqNE5hdDJBc3I3aS1qcU9feVdZX09NWFFISl93QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63472,"nextInTopic":63474,"prevInTime":63472,"nextInTime":63474,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"... While I can t prove it -- and the theory doesn t even make sense to try to prove it! -- is that kids can t read before they re *developmentally* ready. Nor","messageBody":"<div id=\"ygrps-yiv-1789418442\">On Oct 18, 2011, at 4:22 PM, Claire Darbaud wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I firmly believe, from what my eyes can see around me in the  <br/>\n&gt; children I have<br/>\n&gt; met, that there is such thing as children who learn to read in  <br/>\n&gt; school before<br/>\n&gt; they would naturally have learned to read.<br/>\n<br/>\n<br/>\n </span></blockquote>While I can&#39;t prove it -- and the theory doesn&#39;t even make sense to  <br/>\ntry to prove it! -- is that kids can&#39;t read before they&#39;re  <br/>\n*developmentally* ready. Nor can they walk. Or talk.<br/>\n<br/>\nWhat is undoubtedly true is that unschooled kids may choose to read  <br/>\n(say a book) after, even well after, they&#39;re developmentally ready. If  <br/>\na child doesn&#39;t have a need to read, why would they? Why would they  <br/>\nride a bike before they want to? Or swim before they want to?<br/>\n<br/>\nMy daughter could read at least by 10. She didn&#39;t pick up a book to  <br/>\nread on her own until she was 14. (Before that I read to her. She  <br/>\nlistened to books on tape.) She said reading was difficult. (When she  <br/>\nread aloud it was smooth and properly inflected so she could read well  <br/>\nat least at read-aloud speed.) But when she turned 14 she found an  <br/>\nadult series she wanted to read and was reading dense type after that  <br/>\npoint.<br/>\n<br/>\nIf she had been made to read, she probably could have been reading  <br/>\nbooks earlier. But what would be the point? She was learning just fine  <br/>\nthrough other ways. When *she* was motivated to push past the  <br/>\ndifficulties for something she wanted, she did just fine.<br/>\n<br/>\nAnd there was the very real possibility she would have associated the  <br/>\nirritation of reading things she didn&#39;t want to with reading. What  <br/>\nwould be the benefit that&#39;s worth that risk?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Literacy and dislexia","postDate":"1318978919","msgId":63472,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2ODRFMUFDLUYyRTctNDY3QS1BMzY1LTE3MEE0QjQ4N0ZDREBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PENBRzB1VzhuYkp2eXppVF9ZRjNFZU9XajROYXQyQXNyN2ktanFPX3lXWV9PTVhRSEpfd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPiA8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPiA8Q0FHMHVXOG5iSnZ5emlUX1lGM0VlT1dqNE5hdDJBc3I3aS1qcU9feVdZX09NWFFISl93QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63471,"nextInTopic":63473,"prevInTime":63471,"nextInTime":63473,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"... I could find no scientific studies with control groups that show that Doman s methods result in any better outcomes than other methods carried out by","messageBody":"<div id=\"ygrps-yiv-563046264\">On Oct 18, 2011, at 1:22 PM, Claire Darbaud wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And yet most school children I have met learn to read between 3 à 7 or 8.<br/>\n&gt; Doman and mothers following the doman method have taught young babies to<br/>\n&gt; read. So it&#39;s not true that nothing can be done until children come to<br/>\n&gt; reading naturally.<br/>\n<br/>\n </span></blockquote>I could find no scientific studies with control groups that show that Doman&#39;s methods result in any better outcomes than other methods carried out by extremely, intensely involved parents who emphasize play and exploration. Doman&#39;s institute has all kinds of pseudoscientific stuff - but they are, from what I have read, filled with methodological problems and are completely unreliable and suspect.<br/>\n<br/>\nHis &quot;patterning&quot; methods are considered outmoded and potentially harmful in that they create false hopes and disappointment for parents and excessive stress on families.<br/>\n<br/>\nDo most school children read by 8? Probably a majority, but there are MANY who are not reading by 8. Most unschooled children do, too. I don&#39;t think it is the schooling (although they do readily take credit for it). I think it is that kids live in a world where reading is clearly important and useful and kids naturally learn such things (in school or out). Most are ready to learn by 8 or 9. But not all.<br/>\n<br/>\nSchools, however, by pushing reading on all kids and by expecting ALL kids to read by 9 (that&#39;s the big slogan in California public schools, anyway), do not acknowledge that some kids&#39; brains may not be ready to read and that pushing them might even be creating resistance and confusion and emotional reaction that makes reading more difficult for them, eventually resulting in a diagnosis of reading or learning disabilities.  <br/>\n<br/>\nAnd, no, I don&#39;t have scientific evidence for that last statement, but I&#39;ve seen it happen right before my eyes and I&#39;m firmly convinced that it isn&#39;t uncommon.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Literacy and dislexia","postDate":"1318972192","msgId":63471,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWRzNzJjNFYrRD0xRTRkbnd3UDVzR3Jwc3pxOXctMXVmem9Bb2p5WDAwTXhNQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDhDOUZCQTJFLTU0RDAtNERBNS1BQjRGLUQxRTFEMzcxNUE4QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPgk8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPgk8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPgk8Q0FHMHVXOG5iSnZ5emlUX1lGM0VlT1dqNE5hdDJBc3I3aS1qcU9feVdZX09NWFFISl93QG1haWwuZ21haWwuY29tPgk8OEM5RkJBMkUtNTREMC00REE1LUFCNEYtRDFFMUQzNzE1QThBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":63470,"nextInTopic":63472,"prevInTime":63470,"nextInTime":63472,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"I had a child who was late to read (by around age 12 he started to get it).  I didn t worry about it because I realized that while his sight was great, he","messageBody":"<div id=\"ygrps-yiv-727979447\">I had a child who was &quot;late&quot; to read (by around age 12 he started to get<br/>\nit).  I didn&#39;t worry about it because I realized that while his sight was<br/>\ngreat, he had trouble tracking small black symbols on a page.  I knew that<br/>\nhe would eventually be able to read those little symbols, because while I<br/>\nhad all of the great education to &#39;fix&#39; my dyslexia, I really didn&#39;t read<br/>\nfluently (without exhaustion, with good comprehension) until I was around 12<br/>\nand yet I went on to do all of the things that I wanted to do in life<br/>\n(including 3 college degrees) without much issue.<br/>\n<br/>\nMy husband who read at age 3, worried.  Many or our friends and family<br/>\nworried.<br/>\n<br/>\nMy son had some perceptual issues and physical coordination issues, we<br/>\nworked on those by playing games that were fun.  I never said that he may<br/>\nhave been &#39;disabled&#39; or unable or less capable.  Yes, sometimes he wasn&#39;t as<br/>\ntalented with certain physical things as other kids, but he was better than<br/>\nsome.  We would celebrate the things that everybody was good at or enjoyed.<br/>\nWe would point out that everybody is different and that it was wonderful.<br/>\n<br/>\nI sometimes had to protect him from relatives that would try to quiz him.  I<br/>\nset limits on adults that wanted to layer their expectations (that have no<br/>\nbasis in reality) on our family and my children.<br/>\n<br/>\nI would often tell people that he would be ready to fill out his first job<br/>\napplication and so it would be okay.<br/>\n<br/>\nWe learn to read so that we can navigate the world, and maybe even for<br/>\npleasure.  I would always ask (rhetorically of course), what does a child<br/>\nneed to read for?<br/>\n<br/>\nWe are a reading family full of what I call bibliophiles.  We love our books<br/>\nand stories and are regular users of our library.  This all being true, I<br/>\nknew that my children would be readers eventually.  It takes faith in your<br/>\nchildren and exposure to reading and print.  To spell, we have a phonics<br/>\nreference that we all pull out when we need to.<br/>\nChris<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Oct 18, 2011 at 4:40 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=--- Have you mentioned to him that reading is like walking or riding a<br/>\n&gt; bike?<br/>\n&gt;<br/>\n&gt; That until his body is ready to do it, he really can&#39;t. --<br/>\n&gt;<br/>\n&gt; -=-But that&#39;s not true though. There was another post a couple of days ago<br/>\n&gt;<br/>\n&gt; that said something like &quot;until the child is ready to read nobody can do<br/>\n&gt; anything about it&quot; but I can&#39;t find it.-=-<br/>\n&gt;<br/>\n&gt; Until a child can hold up his own weight and balance and propel himself<br/>\n&gt; nobody can teach him to walk. They learn it; they aren&#39;t taught.<br/>\n&gt; Until a child can balance and is strong and brave and coordinated, he can&#39;t<br/>\n&gt; learn to ride a bike. He can wreck a bike and cry, maybe.<br/>\n&gt;<br/>\n&gt; Until a child has all the various tools and skills needed to learn to read,<br/>\n&gt; they cannot &quot;be taught&quot; to read.<br/>\n&gt;<br/>\n&gt; Sometimes kids in school happen to catch on while people are talking to<br/>\n&gt; them about phonics and phonemes and all that (blends, syllables). Sometimes<br/>\n&gt; kids already understood it and they do what the teacher asks them to, and<br/>\n&gt; the teacher then would swear she taught them. Sometimes the kid just happens<br/>\n&gt; to be ready the first time he gets a chance to try a bike out, and the<br/>\n&gt; person who loaned him the bike and spoke some encouragement feels like he<br/>\n&gt; taught him.<br/>\n&gt;<br/>\n&gt; I didn&#39;t teach my kids to walk by letting them hold my hand. I was patient<br/>\n&gt; and helpful while they figured it out, though.<br/>\n&gt;<br/>\n&gt; Same with reading.<br/>\n&gt;<br/>\n&gt; It could be that English is harder to learn than French. Maybe in French<br/>\n&gt; schools there are no children who are told they are non-readers at the age<br/>\n&gt; of eight or nine. Maybe in French schools there are no twelve year olds in<br/>\n&gt; remedial reading classes. If so, then what we&#39;re talking about won&#39;t make<br/>\n&gt; sense to you.<br/>\n&gt;<br/>\n&gt; -=-And yet most school children I have met learn to read between 3 � 7 or<br/>\n&gt; 8.<br/>\n&gt;<br/>\n&gt; Doman and mothers following the doman method have taught young babies to<br/>\n&gt; read. -=-<br/>\n&gt;<br/>\n&gt; To read the newspaper? Magazines?<br/>\n&gt; No, to read flashcards, and beginning readers, maybe. To read sentences<br/>\n&gt; carefully composed of short, simple words that follow the rules the children<br/>\n&gt; have been taught, without &quot;hard words.&quot;<br/>\n&gt;<br/>\n&gt; -=-I totally understand that the side effects of being taught to read<br/>\n&gt; before<br/>\n&gt;<br/>\n&gt; you developmentally come to learning it naturally can be terribly<br/>\n&gt; disempowering, damaging for the adult/child relationship and damaging for<br/>\n&gt; the child&#39;s self esteem, and in some cases (though not all) severely<br/>\n&gt; damaging to the child&#39;s very ability to learn to read at all... to the<br/>\n&gt; point some of these children can reach adulthood without knowing how to<br/>\n&gt; read<br/>\n&gt; at all.-=-<br/>\n&gt;<br/>\n&gt; That being true, why risk it? You can&#39;t tell by looking whether your child<br/>\n&gt; is one of those or not.<br/>\n&gt;<br/>\n&gt; -=-But it bugs me to read that children simply can not read until it comes<br/>\n&gt; to<br/>\n&gt;<br/>\n&gt; them naturally, because it brings confusion when I can see around me that<br/>\n&gt; it&#39;s simply not true.-=-<br/>\n&gt;<br/>\n&gt; What!?<br/>\n&gt; Then where did the people in the longer paragraph above come from!?<br/>\n&gt;<br/>\n&gt; SOME of the kids learned, and SOME did not. You know what that means?<br/>\n&gt; SOME were ready, and SOME were not. And those who were ready were robbed<br/>\n&gt; forever of the joy of learning it on their own (they will believe, as you<br/>\n&gt; seem to believe, that they were taught by others, and couldn&#39;t have,<br/>\n&gt; wouldn&#39;t have learned it any other way), and the others are disempowered,<br/>\n&gt; damaged and in some cases lose the ability to learn to read at all.<br/>\n&gt;<br/>\n&gt; -=-I firmly believe, from what my eyes can see around me in the children I<br/>\n&gt; have<br/>\n&gt;<br/>\n&gt; met, that there is such thing as children who learn to read in school<br/>\n&gt; before<br/>\n&gt; they would naturally have learned to read.-=-<br/>\n&gt;<br/>\n&gt; Cling to that firm belief if it makes you feel better. It won&#39;t help you<br/>\n&gt; move closer to unschooling. But it might make you feel better about having<br/>\n&gt; your kids in school, and your kids might need to go to school, so that&#39;s<br/>\n&gt; fine.<br/>\n&gt;<br/>\n&gt; -=-Seeing the damage that results from speeding things up is not the same<br/>\n&gt; as<br/>\n&gt; saying things can not be sped up.-=-<br/>\n&gt;<br/>\n&gt; Things cannot be sped up without the risk of damage. And when the &quot;speeding<br/>\n&gt; up&quot; involves every child in a school, there is not &quot;risk of damage.&quot; There&#39;s<br/>\n&gt; pretty much guarantee that some kids will fail. That&#39;s how it works.<br/>\n&gt;<br/>\n&gt; -=-I am not trying to put down unschooling, I totally believe it&#39;s a better<br/>\n&gt; way. I am working hard to find my way there.-=-<br/>\n&gt;<br/>\n&gt; Don&#39;t work so hard.<br/>\n&gt; Don&#39;t be so defensive of school.<br/>\n&gt; Accept it for what it is and don&#39;t flail.<br/>\n&gt;<br/>\n&gt; Read these before you post again, please.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/deeper\">http://sandradodd.com/r/deeper</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifonly\">http://sandradodd.com/ifonly</a> (this might be good to share with your<br/>\n&gt; husband)<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/newview\">http://sandradodd.com/peace/newview</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gettingit\">http://sandradodd.com/gettingit</a><br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Literacy and dislexia","postDate":"1318971948","msgId":63470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5NzE5NDguMzQzNTEuWWFob29NYWlsTmVvQHdlYjgxNTA0Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDhDOUZCQTJFLTU0RDAtNERBNS1BQjRGLUQxRTFEMzcxNUE4QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPiA8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPiA8Q0FHMHVXOG5iSnZ5emlUX1lGM0VlT1dqNE5hdDJBc3I3aS1qcU9feVdZX09NWFFISl93QG1haWwuZ21haWwuY29tPiA8OEM5RkJBMkUtNTREMC00REE1LUFCNEYtRDFFMUQzNzE1QThBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":63469,"nextInTopic":63471,"prevInTime":63469,"nextInTime":63471,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1938936112\">&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n=-Seeing the damage that results from speeding things up is not the same as<br/>\nsaying things can not be sped up.-=-<br/>\n<br/>\nThings cannot be sped up without the risk of damage.  And when the <br/>\n&quot;speeding up&quot; involves every child in a school, there is not &quot;risk of <br/>\ndamage.&quot;  There&#39;s pretty much guarantee that some kids will fail.  <br/>\nThat&#39;s how it works.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-=-<br/>\nI repeat this:<br/>\n&quot;Things cannot be sped up without the risk of damage.&quot;&quot;<br/>\nThat applies even to riding a bike.<br/>\n<br/>\nMy son was never able to pedal a tricycle  as a toddler. He had bikes and tricycles growing up.<br/>\nHe is athletic. He is a very good basketball player, he swims , he tackles and he can bat with both left and right!<br/>\nBut he could not ride a bike. He tried. He wanted to learn. We bought him training wheels for biker bikes when he outgrew the smaller ones. He could barely go in a straight line on a bicycle with training wheels, he definitely could not make turns , just could not!. Last year I bought him a very nice bike ( Craigslist used very cheap) hoping a better bike would make the difference.<br/>\nHe started disliking bikes, really dislike them ( my husband and I love biking and his little sister has been riding since she was a little toddler)<br/>\nThis year when he turned 9 or just weeks before he decided to take his new bike out of the garage. He took one training wheel off and started biking, in 5 minutes he asked to take the second one off and in another 5 minutes he was riding like he  had been doing for years.<br/>\nI have a video of him going around and around about 15 minutes after he started riding his bike.<br/>\nHe now rides all over the farm in gravel, grass, whatever!  He loves his bike!<br/>\nBut he could not do it before he was ready. No matter how much he wanted or how much we tried to help him learn.<br/>\nWhen he was ready he did it effortlessly and joyfully! <br/>\n<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [AlwaysLearning] Literacy and dislexia","postDate":"1318971518","msgId":63469,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5NzE1MTguNDM1MDYuWWFob29NYWlsUkNAd2ViODczMDMubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PENBRzB1VzhuYkp2eXppVF9ZRjNFZU9XajROYXQyQXNyN2ktanFPX3lXWV9PTVhRSEpfd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPiA8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPiA8Q0FHMHVXOG5iSnZ5emlUX1lGM0VlT1dqNE5hdDJBc3I3aS1qcU9feVdZX09NWFFISl93QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63467,"nextInTopic":63470,"prevInTime":63468,"nextInTime":63470,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"++++++++++++++++++++++++++++++ What I was/am trying to say is: I firmly believe, from what my eyes can see around me in the children I have met, that there is","messageBody":"<div id=\"ygrps-yiv-1646621327\">++++++++++++++++++++++++++++++<br/>\n<br/>\nWhat I was/am trying to say is:<br/>\nI firmly believe, from what my eyes can see around me in the children I have<br/>\nmet, that there is such thing as children who learn to read in school before<br/>\nthey would naturally have learned to read.<br/>\n++++++++++++++++++++++++++++++++++<br/>\n<br/>\nBut you don&#39;t know that. You don&#39;t know, because you can&#39;t know, that the <br/>\nchildren that you are seeing who are learning to read earlier than you say they <br/>\nare developmentally ready are reading earlier than they are developmentally <br/>\nready. <br/>\n<br/>\n<br/>\nI read at 4. I wasn&#39;t pressed or pushed. I read at 4 because I was ready and I <br/>\nwas exposed to lots of being read to and lots of books and the pieces came <br/>\ntogether. And I understood what I was reading. It wasn&#39;t a struggle to <br/>\ncomprehend, I was fully reading.  David&#39;s ex-wife read before she could walk. <br/>\nShe read very early and walked very late--before she was 2 for both things, but <br/>\nDavid can&#39;t remember her exact age. She wasn&#39;t pressed or pushed to read, she <br/>\nread at 2, read and understood. She&#39;s exceptionally good at seeing patterns and <br/>\nher mother is a librarian. Things came together for her at a very, very early <br/>\nage. She was developmentally ready to read. Linnaea read at 6 and Simon read at <br/>\n12. Very similar environment. Very similar information, different brains. <br/>\n<br/>\n<br/>\nYou are leaping to the assumption that the children that you see reading are <br/>\nbeing trained to read through whatever tricks are being practiced in schools. <br/>\nGiven what you wrote: &quot;and in some cases (though not all) severely<br/>\ndamaging to the child&#39;s very ability to learn to read  at all... to the<br/>\npoint some of these children can reach adulthood without knowing how to read<br/>\nat all.&quot;<br/>\n<br/>\nIf the schools can get children to read before they are developmentally ready <br/>\nwhy aren&#39;t all children able to read by age 5 or 6 or 7? Why do any schools <br/>\nstruggle with this? Why is so much time and money in the UK spent changing from <br/>\nsight reading to phonics and back again? Why are there any children, in your <br/>\nstatement, who fail to read? <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Literacy and dislexia","postDate":"1318970443","msgId":63467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOUZCQTJFLTU0RDAtNERBNS1BQjRGLUQxRTFEMzcxNUE4QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRzB1VzhuYkp2eXppVF9ZRjNFZU9XajROYXQyQXNyN2ktanFPX3lXWV9PTVhRSEpfd0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPiA8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPiA8Q0FHMHVXOG5iSnZ5emlUX1lGM0VlT1dqNE5hdDJBc3I3aS1qcU9feVdZX09NWFFISl93QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63466,"nextInTopic":63469,"prevInTime":63466,"nextInTime":63468,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"-=--- Have you mentioned to him that reading is like walking or riding a bike? That until his body is ready to do it, he really can t. -- -=-But that s not","messageBody":"<div id=\"ygrps-yiv-903617562\">-=--- Have you mentioned to him that reading is like walking or riding a bike?<br/>\nThat until his body is ready to do it, he really can&#39;t. --<br/>\n<br/>\n-=-But that&#39;s not true though. There was another post a couple of days ago<br/>\nthat said something like &quot;until the child is ready to read nobody can do<br/>\nanything about it&quot; but I can&#39;t find it.-=-<br/>\n<br/>\nUntil a child can hold up his own weight and balance and propel himself nobody can teach him to walk.  They learn it; they aren&#39;t taught.<br/>\nUntil a child can balance and is strong and brave and coordinated, he can&#39;t learn to ride a bike.  He can wreck a bike and cry, maybe.<br/>\n<br/>\nUntil a child has all the various tools and skills needed to learn to read, they cannot &quot;be taught&quot; to read.<br/>\n<br/>\nSometimes kids in school happen to catch on while people are talking to them about phonics and phonemes and all that (blends, syllables).  Sometimes kids already understood it and they do what the teacher asks them to, and the teacher then would swear she taught them.  Sometimes the kid just happens to be ready the first time he gets a chance to try a bike out, and the person who loaned him the bike and spoke some encouragement feels like he taught him.<br/>\n<br/>\nI didn&#39;t teach my kids to walk by letting them hold my hand.  I was patient and helpful while they figured it out, though.<br/>\n<br/>\nSame with reading.<br/>\n<br/>\nIt could be that English is harder to learn than French.  Maybe in French schools there are no children who are told they are non-readers at the age of eight or nine.  Maybe in French schools there are no twelve year olds in remedial reading classes.  If so, then what we&#39;re talking about won&#39;t make sense to you.<br/>\n<br/>\n-=-And yet most school children I have met learn to read between 3 à 7 or 8.<br/>\nDoman and mothers following the doman method have taught young babies to<br/>\nread. -=-<br/>\n<br/>\nTo read the newspaper?  Magazines?  <br/>\nNo, to read flashcards, and beginning readers, maybe.  To read sentences carefully composed of short, simple words that follow the rules the children have been taught, without &quot;hard words.&quot;<br/>\n<br/>\n-=-I totally understand that the side effects of being taught to read before<br/>\nyou developmentally come to learning it naturally can be terribly<br/>\ndisempowering, damaging for the adult/child relationship and damaging for<br/>\nthe child&#39;s self esteem, and in some cases (though not all) severely<br/>\ndamaging to the child&#39;s very ability to learn to read at all... to the<br/>\npoint some of these children can reach adulthood without knowing how to read<br/>\nat all.-=-<br/>\n<br/>\nThat being true, why risk it?  You can&#39;t tell by looking whether your child is one of those or not.<br/>\n<br/>\n-=-But it bugs me to read that children simply can not read until it comes to<br/>\nthem naturally, because it brings confusion when I can see around me that<br/>\nit&#39;s simply not true.-=-<br/>\n<br/>\nWhat!?  <br/>\nThen where  did the people in the longer paragraph above come from!?<br/>\n<br/>\nSOME of the kids learned, and SOME did not.  You know what that means? <br/>\nSOME were ready, and SOME were not.  And those who were ready were robbed forever of the joy of learning it on their own (they will believe, as you seem to believe, that they were taught by others, and couldn&#39;t have, wouldn&#39;t have learned it any other way), and the others are disempowered, damaged and in some cases lose the ability to learn to read at all.<br/>\n<br/>\n-=-I firmly believe, from what my eyes can see around me in the children I have<br/>\nmet, that there is such thing as children who learn to read in school before<br/>\nthey would naturally have learned to read.-=-<br/>\n<br/>\nCling to that firm belief if it makes you feel better.  It won&#39;t help you move closer to unschooling.  But it might make you feel better about having your kids in school, and your kids might need to go to school, so that&#39;s fine.<br/>\n<br/>\n-=-Seeing the damage that results from speeding things up is not the same as<br/>\nsaying things can not be sped up.-=-<br/>\n<br/>\nThings cannot be sped up without the risk of damage.  And when the &quot;speeding up&quot; involves every child in a school, there is not &quot;risk of damage.&quot;  There&#39;s pretty much guarantee that some kids will fail.  That&#39;s how it works.<br/>\n<br/>\n-=-I am not trying to put down unschooling, I totally believe it&#39;s a better<br/>\nway. I am working hard to find my way there.-=-<br/>\n<br/>\nDon&#39;t work so hard.<br/>\nDon&#39;t be so defensive of school.<br/>\nAccept it for what it is and don&#39;t flail.<br/>\n<br/>\nRead these before you post again, please.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/deeper\">http://sandradodd.com/r/deeper</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ifonly\">http://sandradodd.com/ifonly</a> (this might be good to share with your husband)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/newview\">http://sandradodd.com/peace/newview</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gettingit\">http://sandradodd.com/gettingit</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Literacy and dislexia","postDate":"1318970099","msgId":63466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5NzAwOTkuODgwNi5ZYWhvb01haWxOZW9Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PDEzMTg5NjYzMTIuNzc0MzEuWWFob29NYWlsTmVvQHdlYjEyMjUxNi5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPiA8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPiA8MTMxODk2NjMxMi43NzQzMS5ZYWhvb01haWxOZW9Ad2ViMTIyNTE2Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":63465,"nextInTopic":63467,"prevInTime":63465,"nextInTime":63467,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"Yes  Jenny! Many people are horrified that an unschooled child that does not read at 9, 10  or 11 but many many kids in school that are the same age and","messageBody":"<div id=\"ygrps-yiv-455097379\">Yes  Jenny! Many people are horrified that an unschooled child that does not read at 9, 10  or 11 but many many kids in school that are the same age and &quot;reading&quot; are not really reading. When I say my son learned to read at 6 and a half that is when I saw that he was fluently reading and understanding what he was reading. If I consider what school calls reading then he was reading at a much younger age. The big difference between the unschooled kids and the school kids is that the unschooled kids were not called behing, or learning disable or whatever label. They don;t have the baggage schooled kids have.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Literacy and dislexia","postDate":"1318969350","msgId":63465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1VzhuYkp2eXppVF9ZRjNFZU9XajROYXQyQXNyN2ktanFPX3lXWV9PTVhRSEpfd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzMTg5NTAyNDYuODQ0MTcuWWFob29NYWlsTmVvQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPgk8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPgk8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":63464,"nextInTopic":63466,"prevInTime":63464,"nextInTime":63466,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"I am happy you brought this here, always learning is the list I had intended to post it to. I wish you had quoted the whole thing though. Here is the entire","messageBody":"<div id=\"ygrps-yiv-849254010\">I am happy you brought this here, always learning is the list I had intended<br/>\nto post it to.<br/>\n<br/>\nI wish you had quoted the whole thing though.<br/>\n<br/>\nHere is the entire post, that was a response to Joyce:<br/>\n<br/>\n**** post from Unschooling basics ***<br/>\n2011/10/17 Joyce Fetteroll<br/>\n-- Have you mentioned to him that reading is like walking or riding a bike?<br/>\nThat until his body is ready to do it, he really can&#39;t. --<br/>\n<br/>\nBut that&#39;s not true though.  There was another post a couple of days ago<br/>\nthat said something like &quot;until the child is ready to read nobody can do<br/>\nanything about it&quot;  but I can&#39;t find it.<br/>\n<br/>\nFrom what I read everywhere, learning to read the natural way can happen<br/>\nanytime between 3 à 15...<br/>\n<br/>\nAnd yet most school children I have met learn to read between 3 à 7 or 8.<br/>\nDoman and mothers following the doman method have taught young babies to<br/>\nread. So it&#39;s not true that nothing can be done until children come to<br/>\nreading naturally.<br/>\n<br/>\nI totally understand that the side effects of being taught to read before<br/>\nyou developmentally come to learning it naturally can be terribly<br/>\ndisempowering, damaging for the adult/child relationship and damaging for<br/>\nthe child&#39;s self esteem, and in some cases (though not all) severely<br/>\ndamaging to the child&#39;s very ability to learn to read  at all... to the<br/>\npoint some of these children can reach adulthood without knowing how to read<br/>\nat all.<br/>\n<br/>\nBut it bugs me to read that children simply can not read until it comes to<br/>\nthem naturally, because it brings confusion when I can see around me that<br/>\nit&#39;s simply not true.<br/>\n<br/>\n**** end post from unschooling basics ***<br/>\n<br/>\n<br/>\nWhat I was/am trying to say is:<br/>\nI firmly believe, from what my eyes can see around me in the children I have<br/>\nmet, that there is such thing as children who learn to read in school before<br/>\nthey would naturally have learned to read.<br/>\n<br/>\nSeeing the damage that results from speeding things up is not the same as<br/>\nsaying things can not be sped up.<br/>\n<br/>\nI am not trying to put down unschooling, I totally believe it&#39;s a better<br/>\nway. I am working hard to find my way there.<br/>\n<br/>\nBut I can tell clarity is the very thing I find on this list and unschooling<br/>\nbasics that helps me find my way. It helps me see how things really are. But<br/>\nwhen I read things that simply don&#39;t match what I can observe around me,<br/>\nthen that brings more confusion, not more clarity.<br/>\n<br/>\nDo you see what I mean? (I I welcome feedback, I am trying to have more<br/>\nclarity for myself too...)<br/>\n<br/>\nClaire<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Literacy and dislexia","postDate":"1318969054","msgId":63464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyREQ1NTczLTNFODUtNEY5QS05NjhCLTE4Q0JCRjQ4RDkxNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTg5NjYzMTIuNzc0MzEuWWFob29NYWlsTmVvQHdlYjEyMjUxNi5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPiA8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPiA8MTMxODk2NjMxMi43NzQzMS5ZYWhvb01haWxOZW9Ad2ViMTIyNTE2Lm1haWwubmUxLnlhaG9vLmNvbT4="},"prevInTopic":63463,"nextInTopic":63465,"prevInTime":63463,"nextInTime":63465,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"-=-Outside of that environment, she simply wasn t reading fluently yet.  By the time she reached 11, she started reading.  She went straight to full reading,","messageBody":"<div id=\"ygrps-yiv-728127543\">-=-Outside of that environment, she simply wasn&#39;t reading fluently yet.  By the time she reached 11, she started reading.  She went straight to full reading, no levels.  The same thing happened with my other daughter, but she did it earlier, at age 9. -=-<br/>\n<br/>\nExactly.  There&#39;s real reading, and there&#39;s school reading, limping along with &quot;graded&quot; texts, guessing, hearing what the other kids read, copying, faking.  My kids never learned to fake anything, nor fear reading.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Literacy and dislexia","postDate":"1318966312","msgId":63463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5NjYzMTIuNzc0MzEuWWFob29NYWlsTmVvQHdlYjEyMjUxNi5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDEzMTg5NTAyNDYuODQ0MTcuWWFob29NYWlsTmVvQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPiA8MTMxODk1MDI0Ni44NDQxNy5ZYWhvb01haWxOZW9Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":63458,"nextInTopic":63464,"prevInTime":63462,"nextInTime":63464,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"***4th grade students cannot read fluently,  even when they read grade-level stories aloud*** ***50 percent of American adults are unable to read an eighth","messageBody":"<div id=\"ygrps-yiv-491391088\">***4th grade students cannot read fluently, <br/>\neven when they read grade-level stories aloud***<br/>\n<br/>\n<br/>\n***50 percent of American adults are unable to read an eighth grade level book. ***<br/>\n<br/>\n<br/>\n***37 percent of fourth graders and 26 percent of eighth graders <br/>\ncannot read at the basic level; and on the 2002 NAEP 26 percent of <br/>\ntwelfth graders cannot read at the basic level. That is, when reading <br/>\ngrade appropriate text***<br/>\n<br/>\nEach of those point out reading at a &quot;level&quot;.  Outside of school, one can either read or they can&#39;t.  When each of my kids wasn&#39;t fluently reading yet, if they had been in school they surely would have been considered a reader by the standard at which the school put them into.  So, when Chamille was 9, before she could read fluently, she might have been said to be reading at 2nd grade level, or some other bench mark below her actual age.  She would have been called a reader, but a low reader, a behind reader, not at level with her peers, something that needed work, something that held her back and set her apart and behind others, needing special help and attention.<br/>\n<br/>\nOutside of that environment, she simply wasn&#39;t reading fluently yet.  By the time she reached 11, she started reading.  She went straight to full reading, no levels.  The same thing happened with my other daughter, but she did it earlier, at age 9. <br/>\n<br/>\n<br/>\nWhat those quotes do, for me, is point to a clear correlation to schools creating many many people who can&#39;t read.  They&#39;ve taken something basic and turned it into a big deal.  If reading is so basic, as in &quot;fundamental basic&quot;, why then, do schools make it so hard?  The written text is complex, just like learning a language is complex, but humans are designed to think and figure things out.  Kids who aren&#39;t forced to learn to read, do so because they find a reason to do so.  Since human brains are designed to figure out their world, they will naturally do so, even if that world includes printed word.  If they don&#39;t figure out something as a kid, they&#39;ll do it as an adult.<br/>\n<br/>\nIn Peter Grey&#39;s blog, Freedom To Learn, a woman has commented that she&#39;s met several real life unschoolers who didn&#39;t learn to read and are now adults who can&#39;t read.  I think she&#39;s full of crap, but let&#39;s just give her the benefit of the doubt and say that she&#39;s telling the truth.  Are those kids really unschoolers who grew into adulthood?  Are they kids who have been unschooled their whole life?  Did they figure out how to read as adults?  What kind of unschooling family would have kids that grew into adulthood without ever learning how to read, even at the &quot;26% of 12th graders who can&#39;t read at basic level&quot;?  Something is missing in the puzzle.  If someone can read at basic level, whatever that means, does it mean they can&#39;t read at all, or that they don&#39;t want to read and so don&#39;t read well?<br/>\n<br/>\nWhat I know for sure, is that both of my kids learned how to read and read fluently with zero baggage attached to their reading experience.  I know of NO schooled kid who has that experience, even the &quot;good&quot; readers have baggage attached.  Personally, I would rather have a kid grow up happy and unable to read as a kid and learn it late, then to have a kid grow up with baggage attached to reading simply so they can be reading earlier than later.<br/>\n<br/>\nI think dyslexia is one of those things that creates baggage.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Literacy and dislexia","postDate":"1318950246","msgId":63458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg5NTAyNDYuODQ0MTcuWWFob29NYWlsTmVvQHdlYjgxNTA4Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEU0NEUyNkI4LThGNUItNDI4Qy05ODNCLTQ1RkI4MEJBNTAzOEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":63457,"nextInTopic":63463,"prevInTime":63457,"nextInTime":63459,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"Someone posted this on unschoolingbasics and I hope it is OK to bring it here for me because I found something really interesting! Here is is: From what I","messageBody":"<div id=\"ygrps-yiv-2098157117\">Someone posted this on unschoolingbasics and I hope it is OK to bring it here for me because I found something really interesting!<br/>\n<br/>\nHere is is:<br/>\n&quot;From what I read everywhere, learning to read the natural way can happen<br/>\nanytime between 3 à 15...<br/>\n<br/>\nAnd yet most school children I have met learn to read between 3 à 7 or 8.<br/>\nDoman and mothers following the doman method have taught young babies to<br/>\nread. So it&#39;s not true that nothing can be done until children come to<br/>\nreading naturally.&quot;<br/>\n<br/>\nBecause I know this is to not be true I found some really interesting quotes like:<br/>\n<br/>\n<br/>\nForty-four percent of American 4th grade students cannot read fluently, <br/>\neven when they read grade-level stories aloud under supportive testing <br/>\nconditions. <br/>\nNational Assessment of Educational Progress (NAEP)<br/>\nPinnell et al., 1995<br/>\n<br/>\n50 percent of American adults are unable to read an eighth grade level book. <br/>\nJonathan Kozol, Illiterate America<br/>\n<br/>\nAccording to the 2003 National Assessment of Educational Progress <br/>\n(NAEP), 37 percent of fourth graders and 26 percent of eighth graders <br/>\ncannot read at the basic level; and on the 2002 NAEP 26 percent of <br/>\ntwelfth graders cannot read at the basic level. That is, when reading <br/>\ngrade appropriate text these students cannot extract the general meaning<br/>\nor make obvious connections between the text and their own experiences <br/>\nor make simple inferences from the text. In other words, they cannot <br/>\nunderstand what they have read. <br/>\nNational Assessment of Educational Progress (NAEP)<br/>\n  <br/>\n<br/>\nBut The most interesting one I found had to do with dislexia :<br/>\n<br/>\nOver 50% of NASA employees are dyslexic. They are deliberately sought <br/>\nafter because they have superb problem solving skills and excellent 3D <br/>\nand spatial awareness. <br/>\n<br/>\nThose are probably the kids that did not learn to read until 11 or older. The diference with the school kids and the unschooling kids is that the unschooling kids do not feel like they have something wrong with them. They were not sent to &quot;special &quot; classes because they were behind their peers. They did not have to do Summer school to catch up. They do not feel less then.<br/>\n<br/>\nIf a parent thinks that their child would be reading if they were in classes and someone was teaching them  they may need a lot of deschooling. They still believe that teaching is the same as learning.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Looking for encouragement, advise, connection","postDate":"1318946434","msgId":63457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEQjY1RUNCLUY4QjQtNDdDMS04OENFLUM0ODRENUQyODNBQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEU0NEUyNkI4LThGNUItNDI4Qy05ODNCLTQ1RkI4MEJBNTAzOEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPiA8RTQ0RTI2QjgtOEY1Qi00MjhDLTk4M0ItNDVGQjgwQkE1MDM4QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":63456,"nextInTopic":63458,"prevInTime":63456,"nextInTime":63458,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"A combination of history and video game knowledge make these funny: http://www.howtobearetronaut.com/2011/10/mario-propaganda-posters The purpose of knowledge","messageBody":"<div id=\"ygrps-yiv-908875940\">A combination of history and video game knowledge make these funny:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.howtobearetronaut.com/2011/10/mario-propaganda-posters\">http://www.howtobearetronaut.com/2011/10/mario-propaganda-posters</a><br/>\n<br/>\nThe purpose of knowledge can be to get jokes.<br/>\n<br/>\nMore to the point, the more one knows, the more connections can be made, and that is learning, and that is knowledge.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/jokes\">http://sandradodd.com/connections/jokes</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Looking for encouragement, advise, connection","postDate":"1318942656","msgId":63456,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0NEUyNkI4LThGNUItNDI4Qy05ODNCLTQ1RkI4MEJBNTAzOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPg==","referencesHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPg=="},"prevInTopic":63455,"nextInTopic":63457,"prevInTime":63455,"nextInTime":63457,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"-=-As Marc Prensky explains clearly and comprehensively in Don t Bother Me, Mom - I m Learning!, games are NOT the enemy . Games are a medium. TV is a medium.","messageBody":"<div id=\"ygrps-yiv-1464298582\">-=-As Marc Prensky explains clearly and comprehensively in Don&#39;t Bother Me, Mom - I&#39;m Learning!, &quot;games are NOT the enemy&quot;. Games are a medium. TV is a medium. Books are a medium. Did you know that even the piano was once considered by many to be dangerous new-fangled technology?-=-<br/>\n<br/>\nHolly was playing albums the other day--33rpm records--and put on an old &quot;Fame&quot; album from the early 80&#39;s movie.  She asked me if I had seen the new version of Fame.  I had not.  She said that the character who used the most modern technology, which had been keyboard synthesizers in the older movie, was a creator of YouTube videos in the newer version.<br/>\n<br/>\nThirty years from now YouTube videos will seem ancient.  Maybe fifteen years from now.  I have no idea what a revival/remake of &quot;Fame&quot; will involve sixty years from now.  Nobody does.   It will have nothing to do with 19th century sod houses.  SERIOUSLY, there are homeschooling families (not unschoolers, as far as I know) who dress their kids like extras from  a TV show about a novel.  How is THAT not zombifying fantasy!?<br/>\n<br/>\nI went to check the dates of that series and found I didn&#39;t care, but here&#39;s a fun list on wikipedia of glaring historical bloopers:<br/>\n<br/>\n===================<br/>\nAt the end of the episode &quot;Country Girls&quot; an airplane can be heard flying overhead. Little House on the Prairie was largely filmed on Big Sky Ranch at Simi Valley, California and as a result camera vistas sometimes pick up rugged chaparral terrain, far too mountainous and scrubby for Minnesota. One episode even depicted Laura running away and climbing up a mountain. California&#39;s oak savannas appears in many of the scenes and are considered to be representative of the real Walnut Grove. Dr. Baker&#39;s telephone was an anachronism since the telephone only existed in large cities in the 1880s. Also during the series run, several married women take teaching jobs during an era when only single women could teach. Several episodes mentioned peanut butter sandwiches, which were not introduced until the early 1900s. Another episode (&quot;Wave Of The Future&quot;, from season eight) shows an elderly man, ostensibly Colonel Harland Sanders, attempting to sell his restaurant franchise to Mrs. Oleson. Sanders was actually born in 1890. In the episode titled &quot;A Wiser Heart&quot; Laura Ingalls Wilder attends an 1885 lecture by Ralph Waldo Emerson, however Emerson died in 1882.<br/>\n====================<br/>\n<br/>\nThere&#39;s a telephone reference in H.M.S. Pinafore, which opened in 1867, about there not being a telephone in &quot;the dungeon&quot; of the ship.  There were hardly telephones anywhere then.   So there&#39;s a dot-to-dot.<br/>\n<br/>\nHe�ll hear no tone<br/>\n\t\tOf the maiden he loves so well!<br/>\n\tNo telephone<br/>\n\t\tCommunicates with his cell!<br/>\n<br/>\n<br/>\nNow where was I?  Connecting dots.  Pointing at crazy.  <br/>\n<br/>\nBob wrote: <br/>\n-=-Something that quickly became apparent to me as I read this book was that negative opinions about computer and video games tend to come from people who don&#39;t play them! Indeed, it seems to be that many parents who are worried about the games their children are playing don&#39;t actually know what it is they&#39;re worried about.-=-<br/>\n<br/>\nI think that&#39;s apparent even from just seeing which unschooling parents are terrified of electronic anything.  They&#39;re afraid of the unknown, and they&#39;re afraid of learning.   Even unschooling parents seem to have the idea that because they&#39;re through with school they don&#39;t have to learn anything, or then because they&#39;ve done some introductory reading and declare themselves &quot;deschooled&quot; that it will be an easy slide for a few years, but that&#39;s not how it works!<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n-=-<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Looking for encouragement, advise, connection","postDate":"1318934828","msgId":63455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3amxmYyszZG9lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRzB1VzhrbXBuSGZON3VqZ01oSmFPWlF6NS14dDJyeEJ5X2hYY2ErQ2lrV0xxRVpPd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":63449,"nextInTopic":63456,"prevInTime":63454,"nextInTime":63456,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"... A review from the November 2009 issue of my newsletter that may be of interest: Don t Bother Me, Mom - I m Learning! How Computer and Video Games Are","messageBody":"<div id=\"ygrps-yiv-226253323\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Claire Darbaud &lt;cdarbaud@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n<br/>\n&gt; <br/>\n&gt; You might also enjoy &quot;Don&#39;t bother me mum, I&#39;m learning&quot; by Marc Prensky<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Dont-Bother-Me-Mom--Im-Learning/dp/1557788588\">http://www.amazon.com/Dont-Bother-Me-Mom--Im-Learning/dp/1557788588</a><br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>A review from the November 2009 issue of my newsletter that may be of interest:<br/>\n<br/>\n<br/>\n&quot;Don&#39;t Bother Me, Mom - I&#39;m Learning!<br/>\nHow Computer and Video Games Are Preparing Your Kids For 21st Century Success - and How You Can Help!<br/>\nby Marc Prensky<br/>\n<br/>\n[I&#39;ve been re-reading my copy of this book this month and it&#39;s as great a read as ever. What others are saying now about the benefits of videogaming, Marc Prensky was saying five years ago. The following is a slightly abridged version of a review of Don&#39;t Bother Me, Mom - I&#39;m Learning! I wrote for the April 2006 issue of the Parental Intelligence Newsletter.]<br/>\n<br/>\nLong time readers of the Parental Intelligence Newsletter will know, I&#39;m sure, that I&#39;m a huge fan of Marc Prensky and his work, so it will probably come as no surprise that I believe Don&#39;t Bother Me, Mom - I&#39;m Learning! is a vital book to read if you&#39;re the least bit worried about the computer and video games your children are playing (or would like to play).<br/>\n<br/>\nThere are, however, many aspects to this book that make it much more than an enlightening and positive response to all the objections, criticisms, negativity and fears that surround the world of digital gaming - it&#39;s an equally important read if you&#39;re simply interested in the probable future of our day to day lifestyles and/or the rapidly changing world of teaching and learning.<br/>\n<br/>\nOf particular interest to me as the father of a 10-year old home educated boy [now 14] was the mention in the book of developments in the application of games technology to the school curriculum - including a little something called &quot;disintermediation&quot;, or &#39;cutting out the middleman&#39;, a subject I&#39;ve written about myself elsewhere.<br/>\n<br/>\nTo be honest, I was almost bouncing up and down with excitement as I read of the possibilities for learning and self-development that are emanating from the most recent advances in video gaming technology. The potential now unfolding is absolutely thrilling.<br/>\n<br/>\nBut, even if you&#39;re not as ready as I am to share Marc Prensky&#39;s enthusiasm for computer and video games as a means of educating and preparing our children for 21st century success, you&#39;ll discover at the very least from reading Don&#39;t Bother Me, Mom - I&#39;m Learning! that what you may have been reading or hearing in the media about the games melting our children&#39;s brains and turning them into violent zombies has been both highly selective and greatly exaggerated.<br/>\n<br/>\nSomething that quickly became apparent to me as I read this book was that negative opinions about computer and video games tend to come from people who don&#39;t play them! Indeed, it seems to be that many parents who are worried about the games their children are playing don&#39;t actually know what it is they&#39;re worried about.<br/>\n<br/>\nBoth of my children play computer and video games. Without restrictions of any kind.<br/>\n<br/>\nComputer and video games are the biggest passion in my son&#39;s life right now, and I think it would be most odd if I didn&#39;t know at least a little bit about every game he plays. Because I play them, too!<br/>\n<br/>\nAs Marc Prensky explains clearly and comprehensively in Don&#39;t Bother Me, Mom - I&#39;m Learning!, &quot;games are NOT the enemy&quot;. Games are a medium. TV is a medium. Books are a medium. Did you know that even the piano was once considered by many to be dangerous new-fangled technology?<br/>\n<br/>\nThough it certainly does seem to me at times that there&#39;s a very questionable motive behind the making of certain individual games, of course, that really is no different to the questionable motives behind the making of certain movies or TV programs, or the writing of certain books, and so on.<br/>\n<br/>\nSo, as with movies, TV and books, it&#39;s crucially important to separate the medium from the message. To optimise the positive qualities of the medium and exercise informed choice as far as the message is concerned. Which, no surprise, requires parental involvement - something that Marc Prensky advocates throughout his book, despite what its title might suggest.<br/>\n<br/>\nIn fact, this is one of the book&#39;s great strengths. It&#39;s a book of solutions for parents. It does acknowledge the problems and it does offer thoughtful, experience-based advice on how to make things better, do things in a more positive way,  improve our relationships with our children and move forward and upward together into a new world of opportunity and accomplishment. Does that seem a little too dramatic for you?<br/>\n<br/>\nWell, Marc Prensky doesn&#39;t have to convince me that computer and video games are preparing our children for 21st century success. I&#39;m already convinced. I&#39;ve been watching my son learning at the speed of thought for the past three years.<br/>\n<br/>\nAnd, if I wasn&#39;t convinced before reading Don&#39;t Bother Me, Mom - I&#39;m Learning!, I certainly would be after I&#39;d read it.<br/>\n<br/>\nIf you have a child or children who play computer and video games, I hope you&#39;ll read this book, too. For reassurance, if that&#39;s all you need - or for mind expanding inspiration if you&#39;re ready for it.&quot;<br/>\n<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Looking for encouragement, advise, connection","postDate":"1318862758","msgId":63449,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1Vzg9dDNTbUU2TW9pUjgxMnZOcE91RDZOb0VQbj1jK0UySk84WEp0WXNWMlZBQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PENBRzB1Vzg9WUpEU0pMU2hQamYxNkpNZUZVY1d0akpHOFRDdGZRaGc3dWFadl9CZzdaUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGo3ZWRkYitpdGZnQGVHcm91cHMuY29tPgk8Q0FHMHVXOGttcG5IZk43dWpnTWhKYU9aUXo1LXh0MnJ4QnlfaFhjYStDaWtXTHFFWk93QG1haWwuZ21haWwuY29tPgk8Q0FHMHVXOD1ZSkRTSkxTaFBqZjE2Sk1lRlVjV3RqSkc4VEN0ZlFoZzd1YVp2X0JnN1pRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":63447,"nextInTopic":63455,"prevInTime":63448,"nextInTime":63450,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"Another thing you can do to help with changing how you view video games is to join the unschooling_gamers yahoo list. ","messageBody":"<div id=\"ygrps-yiv-709467008\">Another thing you can do to help with changing how you view video<br/>\ngames is to join the unschooling_gamers yahoo list.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://games.groups.yahoo.com/group/unschooling_gamers/\">http://games.groups.yahoo.com/group/unschooling_gamers/</a><br/>\n<br/>\nBeing connected to other crazy people like me who let their kids play<br/>\nvideo games all day, including the so called &quot;violent&quot; ones really<br/>\nhelps me :-)</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Looking for encouragement, advise, connection","postDate":"1318854168","msgId":63447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1VzhrbXBuSGZON3VqZ01oSmFPWlF6NS14dDJyeEJ5X2hYY2ErQ2lrV0xxRVpPd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGo3ZWRkYitpdGZnQGVHcm91cHMuY29tPg==","referencesHeader":"PGo3ZWRkYitpdGZnQGVHcm91cHMuY29tPg=="},"prevInTopic":63444,"nextInTopic":63449,"prevInTime":63446,"nextInTime":63448,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"You might enjoy Jane McGonigal. She sheds an amazing new ligh on gamers and gaming. Showing how positive the world of gaming is and how it can very well be the","messageBody":"<div id=\"ygrps-yiv-1134800076\">You might enjoy Jane McGonigal. She sheds an amazing new ligh on gamers and<br/>\ngaming. Showing how positive the world of gaming is and how it can very well<br/>\nbe the evolutionary response to our world&#39;s challenges.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ted.com/talks/jane_mcgonigal_gaming_can_make_a_better_world.html\">http://www.ted.com/talks/jane_mcgonigal_gaming_can_make_a_better_world.html</a><br/>\n<br/>\nHer book is also totally amazing, optimistic, heart warming. It&#39;s<br/>\ncalled &quot;Reality<br/>\nIs Broken: Why Games Make Us Better and How They Can Change the World&quot; It<br/>\nhas helped me tremendously in seing my son&#39;s passion for video games in a<br/>\nnew, more positive light.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/dp/1594202850\">http://www.amazon.com/dp/1594202850</a><br/>\n<br/>\nYou might also enjoy &quot;Don&#39;t bother me mum, I&#39;m learning&quot; by Marc Prensky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Dont-Bother-Me-Mom--Im-Learning/dp/1557788588\">http://www.amazon.com/Dont-Bother-Me-Mom--Im-Learning/dp/1557788588</a><br/>\n<br/>\nAnd then there are plenty more pointers to ressources on video games on<br/>\nSandra&#39;s page:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sandradodd.com/videogames/\">http://www.sandradodd.com/videogames/</a><br/>\n<br/>\n<br/>\n<br/>\n2011/10/16 sebrina w &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sunmamma@...\">sunmamma@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi all: I joined this group and few weeks ago and since then I have been<br/>\n&gt; reading everything. I grab my morning coffee and go through all the posts of<br/>\n&gt; the day and try and soak it all in. I&#39;d love to introduce myself. My name is<br/>\n&gt; Sebrina. I live in Ontario Canada and my road to unschooling has been a bit<br/>\n&gt; rocky. I am realizing that I haven&#39;t truly deschooled myself. I am married<br/>\n&gt; and have 4 children. 3 boys ages 11, 10 and 8 and 1 girl age 5. My 10 year<br/>\n&gt; old and 5 year old go to school, they love it and it&#39;s completely their<br/>\n&gt; choice. My 10 year old stays home when he feels like it. The school knows I<br/>\n&gt; homeschool my other two boys and seems fine with Jayden staying home a day<br/>\n&gt; or two a week to be with his brothers. Anyways my oldest son who is 11 is<br/>\n&gt; the reason I started looking into homeschooling so many years ago. He is<br/>\n&gt; very spirited. Very sweet, very sensitive. He also does things on his own<br/>\n&gt; schedule. He is not yet reading (although he is reading some words and knows<br/>\n&gt; all his letters now). I know I have done a fair amount of damage to my poor<br/>\n&gt; sweet son by trying to force my idea&#39;s of learning onto him. I have tried to<br/>\n&gt; make him do lessons in the past to learn how to read. I have put limits on<br/>\n&gt; his favourite thing (video games and computer) I am sad to say I even have<br/>\n&gt; had negative feeling towards this things that he is the best at (video<br/>\n&gt; games, computer). I realized after joining this group a few weeks ago that I<br/>\n&gt; was doing that and I felt awful! My 10 year old is in school and he is very<br/>\n&gt; schooly, he loves lessons and math sheets and we put a positive association<br/>\n&gt; with those, my daughter is also very schooly and gets the positive<br/>\n&gt; reinforcement that what she loves is good, my youngest son is very athletic<br/>\n&gt; and musical and again we put a positive association with those too. My my<br/>\n&gt; oldest is amazing at video games and here I am, his own mother, putting<br/>\n&gt; negative associations with them. So in the past few weeks I have tried to<br/>\n&gt; change the way I feel about the games. I have played them with him, I sat<br/>\n&gt; with him while he plays and asked questions about what&#39;s going on. I have<br/>\n&gt; pointed out all the amazing things he HAS learned from them.<br/>\n&gt;<br/>\n&gt; I have removed some of the limits from the games. We used to let them play<br/>\n&gt; 2 hours per day only and not at all on weekends. I didn&#39;t announce it but I<br/>\n&gt; have been letting him play more during the week, he will play for as long as<br/>\n&gt; I let him. So if I let him play from 8-6 he will. He will stop only to eat.<br/>\n&gt; I guess I am asking how many limits should I let go. Should I let him spend<br/>\n&gt; all day on the computer? Should I let him play all the time?<br/>\n&gt;<br/>\n&gt; I have been reading about strewing. The other thing he seems to like is<br/>\n&gt; comics so I have been leaving them about the house but it&#39;s not getting his<br/>\n&gt; attention.<br/>\n&gt;<br/>\n&gt; I&#39;m feeling a little lost, a little worried and a little unsure of what my<br/>\n&gt; role should be with my son. How to help him be the best he can be. So many<br/>\n&gt; questions. There is so much negative stuff out there in mainstream with<br/>\n&gt; regard to TV and video games and it&#39;s hard to break away from this evokes in<br/>\n&gt; my head!<br/>\n&gt;<br/>\n&gt; Thanks for reading!<br/>\n&gt;<br/>\n&gt; Sebrina<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Looking for encouragement, advise, connection","postDate":"1318782574","msgId":63444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3ZjBwZStrYWlrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGo3ZW11aStjbjlqQGVHcm91cHMuY29tPg=="},"prevInTopic":63443,"nextInTopic":63447,"prevInTime":63443,"nextInTime":63445,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"... This is one place I still get stuck sometimes too, but, these days, I find it is lessening.  Sharing in my son s play has given me the wonderful","messageBody":"<div id=\"ygrps-yiv-1279495429\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;You are right though. Nothing needs to be fixed. Well maybe my own idea&#39;s and thoughts on what other&#39;s might think or care about my family.<br/>\n<br/>\n </span></blockquote>This is one place I still get stuck sometimes too, but, these days, I find it is lessening.  Sharing in my son&#39;s play has given me the wonderful opportunity to really discover what he is getting out of whatever he is doing, from video games to sharpening sticks to twirling on the driveway.  The exploration and discovery that fill each activity that he is really engaged in is inspiring.  He is so motivated and creative.  To someone standing on the sidelines, it might not look like much.  But, to someone who really gets in there and understands what he learning, it is truly remarkable.  That focus on him has helped me concern myself less with what others think and do.  <br/>\n<br/>\nJoyce, Sandra and others have written this many times...look closely at your child, not at others.  That insight has helped me greatly.</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Looking for encouragement, advise, connection","postDate":"1318781679","msgId":63443,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg3ODE2NzkuNTA1NC5ZYWhvb01haWxOZW9Ad2ViODE1MDEubWFpbC5tdWQueWFob28uY29tPg==","inReplyToHeader":"PGo3ZW1vMys1bGU1QGVHcm91cHMuY29tPg==","referencesHeader":"PEVCQjM2RDVCRUQ0NjREM0M5OUY0NjY1RUVBRjJEOUE2QEVkUEM+IDxqN2VtbzMrNWxlNUBlR3JvdXBzLmNvbT4="},"prevInTopic":63442,"nextInTopic":63444,"prevInTime":63442,"nextInTime":63444,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"Gaming guides from the internet are great and free and we have used them a lot but once in a while we get the big ones you buy from the gaming store, the","messageBody":"<div id=\"ygrps-yiv-1556580929\">Gaming guides from the internet are great and free and we have used them a lot but once in a while we get the big ones you buy from the gaming store, the official game guide, are awesome and full of pictures and maps and cool stuff.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Looking for encouragement, advise, connection","postDate":"1318781261","msgId":63442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTg3ODEyNjEuMzQxMjguWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGo3ZWRkYitpdGZnQGVHcm91cHMuY29tPg==","referencesHeader":"PGo3ZWRkYitpdGZnQGVHcm91cHMuY29tPg=="},"prevInTopic":63440,"nextInTopic":63443,"prevInTime":63441,"nextInTime":63443,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"Say yes more. Can I play another 30 minutes mom? Yes Find him new games, books about the games ( My son devoured the Legends of Zelda Graphic Novels), Get him","messageBody":"<div id=\"ygrps-yiv-1673224195\">Say yes more.<br/>\nCan I play another 30 minutes mom? <br/>\n<br/>\nYes<br/>\n<br/>\nFind him new games, books about the games ( My son devoured the Legends of Zelda Graphic Novels), Get him guides for the games ( my son loves them too), movies, videos ....<br/>\n It seems you still value anything but video games. Don&#39;t just extend the hours he can play. Embrace it.<br/>\n<br/>\nI have a 9 year old son that loves video games and his computer. He learned to read playing games.  I have never limited him in how much TV or games he can play. He still does it many hours a day most days ( unless we are out and about or he has friends over)<br/>\nHe loves them. My daughter in the other hand loves the cows ( we are dairy farmers) and spends hours a day with her dad doing chores and working with the cows ( she is 5). She plays video games here and there. She can go even a month without playing. It is there for her. She has games she likes that I got for her. Being able to play unlimited video games did not make her play  many hours a day. But my son loves them and thrives in them. Does my daughter passion for being outside doing chores  more valuable than my son for video games?<br/>\n<br/>\nIf you are still seeing video games less valuable and not embracing it you will still feel doubt and fear.<br/>\n<br/>\n<br/>\nSome great links to read:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames/\">http://sandradodd.com/videogames/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":173560398,"authorName":"sebrina w","from":"&quot;sebrina w&quot; &lt;sunmamma@...&gt;","profile":"sebrinawilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Looking for encouragement, advise, connection","postDate":"1318772498","msgId":63440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3ZW11aStjbjlqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDREMzk4NEVELTY2RTYtNDZGRS1BMDg5LTdFMkExNEQ4M0FGREBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":63439,"nextInTopic":63442,"prevInTime":63439,"nextInTime":63441,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"** If they re intended to lure him away from the games, your motives aren t pure. :-)  ** True! My motives were to lure him away from the video games. Thank","messageBody":"<div id=\"ygrps-yiv-656185935\">** If they&#39;re intended to lure him away from the games, your motives aren&#39;t pure. :-)  **<br/>\n<br/>\nTrue! My motives were to lure him away from the video games. Thank you for pointing that out.<br/>\n<br/>\n **But don&#39;t leave them &quot;about the house&quot; like Easter eggs on a rainy Sunday.  Put them in one place where he sits anyway.  Bathroom?  Near the computer?  And you need to take &quot;no&quot; or &quot;not now&quot; or &quot;didn&#39;t even notice&quot; for an answer, in the field of strewing.  Put them up a while and try again another month, maybe. **<br/>\n<br/>\nGreat idea. I think I will put the comics in the bathroom.<br/>\n<br/>\n<br/>\n ** To choose between your son and the negative stuff in mainstream media, make the better choice.  Is your obligation to what vague, distant others think of you?  Or of your son&#39;s moment? **<br/>\n<br/>\nI have a problem worrying about what other&#39;s think of me. That&#39;s not problem and shouldn&#39;t become my sons. I Need to work on that.<br/>\n<br/>\n<br/>\n **Nothing will fix it but time and acceptance.  Time and acceptance will lead you to see that nothing needed to be &quot;fixed,&quot; and by the time you really believe that, he&#39;ll probably ask you where those comics went and want a ride to the comics or gaming shop.  It might not be this year or  next.  Still, he&#39;ll be learning. **<br/>\n<br/>\nThanks Sandra. Just reading your words gives me some comfort. You are right though. Nothing needs to be fixed. Well maybe my own idea&#39;s and thoughts on what other&#39;s might think or care about my family.<br/>\n<br/>\nSebrina</div>","specialLinks":[]},{"userId":173560398,"authorName":"sebrina w","from":"&quot;sebrina w&quot; &lt;sunmamma@...&gt;","profile":"sebrinawilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Looking for encouragement, advise, connection","postDate":"1318772291","msgId":63439,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3ZW1vMys1bGU1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEVCQjM2RDVCRUQ0NjREM0M5OUY0NjY1RUVBRjJEOUE2QEVkUEM+"},"prevInTopic":63437,"nextInTopic":63440,"prevInTime":63438,"nextInTime":63440,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"Gaming - does he like game guides?  We printed from the internet many game guides and I would read to him, to help him figure out a particularilly tough spot","messageBody":"<div id=\"ygrps-yiv-2130397606\">Gaming - does he like game guides?  We printed from the internet many game guides and I would read to him, to help him figure out a particularilly tough spot in the game.  Now when he has need of a game guide he uses my laptop next to his laptop so we don&#39;t have to print.  The fun thing about game guides from the internet is that they are mostly written by other players so there are many game guides from many perspectives for one game.<br/>\n<br/>\nThat&#39;s a great idea thank you!!</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Looking for encouragement, advise, connection","postDate":"1318770617","msgId":63437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCQjM2RDVCRUQ0NjREM0M5OUY0NjY1RUVBRjJEOUE2QEVkUEM+","inReplyToHeader":"PGo3ZWRkYitpdGZnQGVHcm91cHMuY29tPg==","referencesHeader":"PGo3ZWRkYitpdGZnQGVHcm91cHMuY29tPg=="},"prevInTopic":63435,"nextInTopic":63439,"prevInTime":63436,"nextInTime":63438,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"Comics: Are they the ones he enjoys?  I know with our son (now 17) when he was that age he loved comics and we would take him to the book store / library to","messageBody":"<div id=\"ygrps-yiv-1694391694\">Comics:  <br/>\n<br/>\nAre they the ones he enjoys?  I know with our son (now 17) when he was that age he loved comics and we would take him to the book store / library to pick out the ones he wanted because invariably if we brought them home for him he would never even pick them up.<br/>\n<br/>\nComics in the newspaper: we would simply say &quot;Hey Zac here&#39;s a great comic you might like and then take it to him, show him while reading it to him.  In fact we still do that - though he mostly reads them himself now.  We even find funny ways to laugh at ourselves - as in &quot;Hey they have mom/dad/Zac in the comics today.&quot; and then we pass it around and show each other. (we&#39;re a light teasing kind of family though - we are silly that way sometimes - we&#39;re pretty good at laughing at ourselves - mostly ;)<br/>\n<br/>\n<br/>\n<br/>\nManga & Anime:<br/>\n<br/>\nManga was the main reason he really started reading - fell in love with reading beyond reading captions below pictures - Manga and gaming.  Once he started reading manga he was off and running.<br/>\n<br/>\nHe reads manga on line mostly now but for several years we bought and bought and bought!<br/>\n<br/>\nHe discovered Manga after immersing himself in Anime for about a year.<br/>\n<br/>\nWith Manga we have also learned that what we think he&#39;d be interested in is not necessarily so.  It is really hard to guess which series will capture his interest so if I discover something I think he&#39;ll be interested in I always share it with him and let him look it up and explore it before we get it.  His interests are basically never what is the most popular.<br/>\n<br/>\nThere are a lot of Manga series that have been made into shows.  He went through a period of time where he would only read the series after he watched the shows.  Then he got frustrated that the books and shows were not the exact same so he chose to watch some series and read others.<br/>\n<br/>\n<br/>\nIt changed and ebbed over the years as his reading developed - at least I think that was what was happening.<br/>\n<br/>\n<br/>\n<br/>\nGaming - does he like game guides?  We printed from the internet many game guides and I would read to him, to help him figure out a particularilly tough spot in the game.  Now when he has need of a game guide he uses my laptop next to his laptop so we don&#39;t have to print.  The fun thing about game guides from the internet is that they are mostly written by other players so there are many game guides from many perspectives for one game.<br/>\n<br/>\n<br/>\nLisa W.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Looking for encouragement, advise, connection","postDate":"1318769193","msgId":63435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDREMzk4NEVELTY2RTYtNDZGRS1BMDg5LTdFMkExNEQ4M0FGREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGo3ZWRkYitpdGZnQGVHcm91cHMuY29tPg==","referencesHeader":"PGo3ZWRkYitpdGZnQGVHcm91cHMuY29tPg=="},"prevInTopic":63434,"nextInTopic":63437,"prevInTime":63434,"nextInTime":63436,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"-=-I have been reading about strewing. The other thing he seems to like is comics so I have been leaving them about the house but it s not getting his","messageBody":"<div id=\"ygrps-yiv-1710579611\">-=-I have been reading about strewing. The other thing he seems to like is comics so I have been leaving them about the house but it&#39;s not getting his attention. -=-<br/>\n<br/>\nIf they&#39;re intended to lure him away from the games, your motives aren&#39;t pure. :-)  But don&#39;t leave them &quot;about the house&quot; like Easter eggs on a rainy Sunday.  Put them in one place where he sits anyway.  Bathroom?  Near the computer?  And you need to take &quot;no&quot; or &quot;not now&quot; or &quot;didn&#39;t even notice&quot; for an answer, in the field of strewing.  Put them up a while and try again another month, maybe.<br/>\n<br/>\n-=-I&#39;m feeling a little lost, a little worried and a little unsure of what my role should be with my son. How to help him be the best he can be. So many questions. There is so much negative stuff out there in mainstream with regard to TV and video games and it&#39;s hard to break away from this evokes in my head! -=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<br/>\nTo choose between your son and the negative stuff in mainstream media, make the better choice.  Is your obligation to what vague, distant others think of you?  Or of your son&#39;s moment?<br/>\n<br/>\nThe value of video games was created by you, as to the hours being spent.  You limited it artificially and the price went up. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/economics\">http://sandradodd.com/t/economics</a><br/>\n<br/>\nNothing will fix it but time and acceptance.  Time and acceptance will lead you to see that nothing needed to be &quot;fixed,&quot; and by the time you really believe that, he&#39;ll probably ask you where those comics went and want a ride to the comics or gaming shop.  It might not be this year or  next.  Still, he&#39;ll be learning.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":173560398,"authorName":"sebrina w","from":"&quot;sebrina w&quot; &lt;sunmamma@...&gt;","profile":"sebrinawilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Looking for encouragement, advise, connection","postDate":"1318762731","msgId":63434,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo3ZWRkYitpdGZnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":63435,"prevInTime":63433,"nextInTime":63435,"topicId":63434,"numMessagesInTopic":0,"msgSnippet":"Hi all: I joined this group and few weeks ago and since then I have been reading everything. I grab my morning coffee and go through all the posts of the day","messageBody":"<div id=\"ygrps-yiv-17420628\">Hi all: I joined this group and few weeks ago and since then I have been reading everything. I grab my morning coffee and go through all the posts of the day and try and soak it all in. I&#39;d love to introduce myself. My name is Sebrina. I live in Ontario Canada and my road to unschooling has been a bit rocky. I am realizing that I haven&#39;t truly deschooled myself. I am married and have 4 children. 3 boys ages 11, 10 and 8 and 1 girl age 5. My 10 year old and 5 year old go to school, they love it and it&#39;s completely their choice. My 10 year old stays home when he feels like it. The school knows I homeschool my other two boys and seems fine with Jayden staying home a day or two a week to be with his brothers. Anyways my oldest son who is 11 is the reason I started looking into homeschooling so many years ago. He is very spirited. Very sweet, very sensitive. He also does things on his own schedule. He is not yet reading (although he is reading some words and knows all his letters now). I know I have done a fair amount of damage to my poor sweet son by trying to force my idea&#39;s of learning onto him. I have tried to make him do lessons in the past to learn how to read. I have put limits on his favourite thing (video games and computer) I am sad to say I even have had negative feeling towards this things that he is the best at (video games, computer). I realized after joining this group a few weeks ago that I was doing that and I felt awful! My 10 year old is in school and he is very schooly, he loves lessons and math sheets and we put a positive association with those, my daughter is also very schooly and gets the positive reinforcement that what she loves is good, my youngest son is very athletic and musical and again we put a positive association with those too. My my oldest is amazing at video games and here I am, his own mother, putting negative associations with them. So in the past few weeks I have tried to change the way I feel about the games. I have played them with him, I sat with him while he plays and asked questions about what&#39;s going on. I have pointed out all the amazing things he HAS learned from them. <br/>\n<br/>\nI have removed some of the limits from the games. We used to let them play 2 hours per day only and not at all on weekends. I didn&#39;t announce it but I have been letting him play more during the week, he will play for as long as I let him. So if I let him play from 8-6 he will. He will stop only to eat. I guess I am asking how many limits should I let go. Should I let him spend all day on the computer? Should I let him play all the time?<br/>\n<br/>\nI have been reading about strewing. The other thing he seems to like is comics so I have been leaving them about the house but it&#39;s not getting his attention. <br/>\n<br/>\nI&#39;m feeling a little lost, a little worried and a little unsure of what my role should be with my son. How to help him be the best he can be. So many questions. There is so much negative stuff out there in mainstream with regard to TV and video games and it&#39;s hard to break away from this evokes in my head! <br/>\n<br/>\nThanks for reading!<br/>\n<br/>\nSebrina</div>","specialLinks":[]}],"prevTopicId":63554,"nextTopicId":63576}}