{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"A good bad example","postDate":"1393178516","msgId":73785,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExREU4OUY4LTVGMTctNDFGQy04M0VDLUUzNDFGOUEzNEI5MEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":73784,"nextInTime":73786,"topicId":73785,"numMessagesInTopic":0,"msgSnippet":"I saved this for over a week so it would be cold.  It s not by an unschooler, but by a mainstream parent commenting on a mutual facebook friend s wall.  I hope","messageBody":"<div id=\"ygrps-yiv-801143328\">I saved this for over a week so it would be cold.  It&#39;s not by an unschooler, but by a mainstream parent commenting on a mutual facebook friend&#39;s wall.  I hope it will be (for everyone who reads it) an example of how far one can move away from what is acceptable mainstream parenting:<br/>\n________________________<br/>\n<br/>\nI always told my children that I never speculate about things that don&#39;t pertain to anything right here and now, but they were welcome to be philosophical all they wanted, as long as their rooms were clean & homework was done.<br/>\n<br/>\nMy kids always wanted to have deep, philosophical conversations when there were &quot;boring&quot; things to be done, hahaha! Little smarties! <br/>\n________________________<br/>\n<br/>\nThere was a book I had and read a couple of time when Marty was little, so 1989, 1990, by Gareth Matthews called Philosophy and the Young Child.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hup.harvard.edu/catalog.php?isbn=9780674666061\">http://www.hup.harvard.edu/catalog.php?isbn=9780674666061</a><br/>\n<br/>\nMarty was my example.  He&#39;s always been a deep thinkier, but in a light-hearted way.  Just last week he complained that his art history professor has no imagination.  If it&#39;s not in the book, she doesn&#39;t want to discuss it.  When he speculated, to a question about an Egyptian sculpture, that it might have been propaganda, she said &quot;No, all sculptures were approved.&quot;  To Marty (and to me, when he told me) that wasn&#39;t even NEARLY a decent answer. :-)   Just because a sculpture wasn&#39;t approved doesn&#39;t mean it was destroyed.  And there surely were practice things, goofs, private pieces.  But she doesn&#39;t care what anyone thinks if they don&#39;t have a PhD.   Marty will never have that prejudice, and she&#39;s just given him cause to hesitate about listening just because someone DOES have one.<br/>\n<br/>\nIn California last October when I was speaking at HSC&#39;s unschooling symposium, someone asked me to say what books I liked.  I kind of understood the question, but at the age of 60, I have read a LOT of books that influenced me.  And if another person were to read those same books, they wouldn&#39;t get the same messages or information I had, because I read them from my own curiosity and made my own connections as I was reading, and later.  The order of reading them probably mattered.  Being who I was, from where I was, with my moods probably mattered.<br/>\n<br/>\nSo the book above might be great for some people, not interesting to others, might be the portal to a rest-of-life interest to someone.  <br/>\n<br/>\nI think putting a child&#39;s desire to speak of deep philosophical things should be put ahead of just about everything else, and never laughed at or belittled.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":73769,"nextTopicId":73796}}