{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Joshua Heath","from":"&quot;Joshua Heath&quot; &lt;heathfam@...&gt;","replyTo":"LIST","senderId":"ABVpTqWvvkx-8T1ThnIAAKo1TWnurw_0FznCSYS68nU9w2O7gdGoeEVeK484wM9tMMhoHNI1FjQDuthZrZspioVbKstfJoi6V0E","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Typical unschooling day","postDate":"954492439","msgId":7575,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNjAwMWJmOWFlZCRkOTFmNTg2MCQzNzgzNDJkOEBKb3NoSGVhdGg+","referencesHeader":"PGM0LjI0MDU3YTQuMjYxMzllZjBAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7574,"nextInTime":7576,"topicId":7575,"numMessagesInTopic":0,"msgSnippet":"I am still not through all my messages... but I thought i would share my day today as it was a fairly typical day- in  that not too much in the way of ","messageBody":"<div id=\"ygrps-yiv-652240239\">I am still not through all my messages... but I thought i would share my day<br/>\ntoday as it was a fairly typical day- in  that not too much in the way of<br/>\nstructured activities happened.<br/>\n<br/>\nThis morning... Kids woke up as usual around 7:00, and joined us in bed for<br/>\nabout half an hour... Jordan(8) got dressed first and started playing lego.<br/>\nDaylon(almost 6) had a shower fist with my wife, and then with me.  (he<br/>\nwould have stayed in longer too...)  Jordan made his own bed, and i helped<br/>\ndaylon. We were relaxing in the kitchen with a cup of strong coffee and<br/>\nJordan came in and began chatting about our frends who have three birthdays<br/>\nin a row (in their family)coming up.... he was worried about how he could<br/>\nafford to purchase them all a gift.  We ended up telling him that adults<br/>\noften like thigs that are hand-made better... He ended up getting us all<br/>\ninspired and drawing pictures that remind us of our friends.  My<br/>\npartner(selina) didnt have to rush off to work, so we all ate porrage<br/>\ntogether, and then the boys did their morning chores...<br/>\n<br/>\nNext, I think they went out and played in the yard (there were lots of kids<br/>\naround today as spring break has been extened by a teacher strike)  Daylon<br/>\ncame in soon to play inside with 2 friends.  They played an elaborate<br/>\nimagination game utilizing every plastic toy animal we have.<br/>\nLunch (we invited their uncle(18) who lives in our basement suite to eat<br/>\nwith us... )<br/>\nSelina popped in to grab a bite to eat... )<br/>\nMore chores...<br/>\nI did many loads of laundry...<br/>\nI drove Selina back to work while Uncle watched the boys<br/>\nMade a sawhorse with Jordan with the tools he got for his birthday<br/>\nIntervened in back yard play that was getting too out of control<br/>\nEstablished that from now on neighbourhood kids have to knock on our door<br/>\nfirst before playing in our yard...<br/>\nUncle took the the boys to see a Stewart Little downtown<br/>\nI went grocery shopping<br/>\nJordan played &quot;Sonic school house&quot; on CD-Rom<br/>\nDaylon played some more outside<br/>\nI got dinner in the oven...<br/>\njordan phoned a friend up and invited him over...<br/>\nDaylon came in and joined in as they dumped all the lego&#39;s on a blanket in<br/>\nthe middle of the living room.<br/>\nSelina called needing a ride home... packed all three boys in the car  to go<br/>\npick her up.<br/>\nlet the boys play for a few minutes untel dinner was ready... (7:15 today)<br/>\n<br/>\nAfter dinner the boys put away all their laundry that I folded, and got<br/>\nready for bed.<br/>\nI read stores for half an hour...<br/>\nand then come on here to check my mail for the first time all week.<br/>\n<br/>\nMany days we do more constructive things... but there are just as many days<br/>\nlike this...   Partly I feel we are still de-schooling after half a year in<br/>\nWaldorf school... Jordan is just taking off with his reading... and so he<br/>\nwas reading things througout the day...<br/>\nTommorow my only planned activity for the kids is for Jordan to do thankyou<br/>\nnotices for his birthday party... Daylon has a &quot;nature club&quot; he is working<br/>\non and I want to help him &quot;work&quot; on it some more.  Also, there is swimming<br/>\nlessons.<br/>\n<br/>\nYou really can not have a typical day unschooling... you never know what<br/>\nwill hapen... you might find you get a clearer picture from a &quot;typical week&quot;<br/>\nthough, as that would include all regularly scheduled activities, as well as<br/>\nexceptional things like a &quot;field trip&quot; or outings.<br/>\n<br/>\nblessings<br/>\nJoshua</div>","specialLinks":[]}],"prevTopicId":7574,"nextTopicId":7576}}