{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] frustrations","postDate":"1163011943","msgId":27307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNDIzOURBLTc0NjUtNDg3Ni1BM0IxLTUzQTUzNDlENEE0RUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwNTQwMWM3MDM2MSRhYWZmMDgyMCQwYTAwYThjMEBib3Jnbm9kZT4=","referencesHeader":"PDExNjI5OTAxNDIuMjYxLjY5NzMwLm0xOEB5YWhvb2dyb3Vwcy5jb20+IDwwMDU0MDFjNzAzNjEkYWFmZjA4MjAkMGEwMGE4YzBAYm9yZ25vZGU+"},"prevInTopic":27306,"nextInTopic":0,"prevInTime":27306,"nextInTime":27308,"topicId":27306,"numMessagesInTopic":0,"msgSnippet":"-=-So, if I am being and doing all this for her then shouldn t it be her choices, opportunities, and wants? I say yes. Expectations of a magical unschooling","messageBody":"<div id=\"ygrps-yiv-1219861909\">-=-So, if I am being and doing all this for her then<br/>\nshouldn&#39;t it be her choices, opportunities, and wants? I say yes.<br/>\nExpectations of a magical unschooling life are just that...expectations.<br/>\nExpectations are set-ups with little trap doors waiting to snatch  <br/>\nSorscha<br/>\nup. -=-<br/>\n<br/>\nOr to snatch you away from her, or to snatch your joy and peace away  <br/>\nso that you&#39;re more separate.<br/>\n<br/>\nParents who are sure they need to avoid &quot;compromise&quot; or who are  <br/>\nthemselves needy of attention and freedom and choices probably had  <br/>\nchildren too early, before they themselves were ready to be parents.<br/>\n<br/>\nSo what happens at that point?  They  need to buck up and stop  <br/>\nwhining and GET GROWN.  Kids can&#39;t wait forever for their moms to  <br/>\ngrow out of their angst.  If for whatever reason a mom has a child  <br/>\nand the mom wants to do what&#39;s good for that child (even to the  <br/>\nextent of unschooling), she&#39;s going to *have* to make some  <br/>\nsacrifices.  She can sacrifice some of her whims and desires and  <br/>\nfantasies, or she can just go straight to sacrificing any hope of a  <br/>\nlongterm close relationship with that child.<br/>\n<br/>\nReally, honestly, there are lots, and tons, of unschooling moms who  <br/>\nstarted off angsty and whiney and blaming their kids for their own  <br/>\nmom-lives not being like magazine articles, and then when they TRULY,  <br/>\nreally, simply started living with their children, playing with their  <br/>\nchildren, talking with their children, eating what and where their  <br/>\nkids wanted to eat instead of trying to mold their kids into  <br/>\nminiature-yet-better versions of themselves, THEN they started  <br/>\nfinding happiness, and found they had things to rejoice about instead  <br/>\nof whining, etc.<br/>\n<br/>\nThe chance for happiness is right between you and your child, it&#39;s  <br/>\nright in you, only you need to get yourself right next to your child,  <br/>\nso the &quot;between&quot; is not so big.   You become one with your child and  <br/>\nthere will be enough happiness to envelope you both.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":232480378,"authorName":"Crystal Miller","from":"&quot;Crystal Miller&quot; &lt;willowsfortress@...&gt;","profile":"ethelwynnesquest","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"frustrations","postDate":"1163009641","msgId":27306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTQwMWM3MDM2MSRhYWZmMDgyMCQwYTAwYThjMEBib3Jnbm9kZT4=","referencesHeader":"PDExNjI5OTAxNDIuMjYxLjY5NzMwLm0xOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":27307,"prevInTime":27305,"nextInTime":27307,"topicId":27306,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-715638321\">&lt;&lt;I have tried speaking with the kids about my frustrations,<br/>\nexplaining that I&#39;d like to meet more homeschoolers, find friends they like <br/>\nwho can play during the<br/>\nday, that I&#39;d like to try more classes or outings&gt;&gt;<br/>\n<br/>\nHi, it&#39;s Crystal.  I&#39;d like to note that sometimes just because I want <br/>\nsomething (here&#39;s me again...just like Veruca Salt from Willy Wonka...&quot;But <br/>\nDaddy I WANT) doesn&#39;t mean that Sorscha wants it.  I have learned how to <br/>\n&#39;shut-up&#39; (that is one of my favorite self talks the last few months) about <br/>\nmy frustrations.   Frustrations that range the whole spectrum of life.  If I <br/>\nlook at my past I can see Sorscha singing that song in her head, &quot;You talk <br/>\nto much...you never shut up&quot;.  I can&#39;t remember the name of it.<br/>\n<br/>\nI used to drag Sorscha everywhere to meet friends, do classes, do <br/>\nfieldtrips, etc.  I truly believed that it was in her best interest.  I was <br/>\nexposing her to all those wonderful opportunities.  I think I thought that <br/>\nif I missed an opportunity that Sorscha would have one less peg in her life <br/>\nboard and that I would be doing her a disservice as her parent.  In the last <br/>\nyear Sorscha has chosen to mostly be at home hangin out with me or the <br/>\nhomeschooled girl across the street. As a family we often choose to cocoon <br/>\ntogether.  Our activities have dwindled so much.  The importance of this is <br/>\nthat Sorscha is happy.<br/>\n<br/>\nI really enjoy being with people, Sorscha is so so about it.  I really enjoy <br/>\ngoing on trips, Sorscha is so so about it.  I really enjoy all sorts of <br/>\nparties and events, Sorscha is so so.  What I have realized is that <br/>\nultimately I am at home and unschooling for her...not for me (okay, but WOW <br/>\nhave I learned so much on the journey).  If Sorscha were never born I would <br/>\nnot be doing what we do.  So, if I am being and doing all this for her then <br/>\nshouldn&#39;t it be her choices, opportunities, and wants?  I say yes. <br/>\nExpectations of a magical unschooling life are just that...expectations. <br/>\nExpectations are set-ups with little trap doors waiting to snatch Sorscha <br/>\nup.  Day by day it does not matter that we meet more home schoolers, find <br/>\nfriends, or take classes.  Day by day we choose to live the magical <br/>\nunschooling life and that brings amazing adventures.  I realized that it is <br/>\nnot my responsibility to choose which holes Sorscha wants to fill with pegs. <br/>\nIt is my responsibility to respect her choices and gently help her when she <br/>\nask questions.  It&#39;s not my responsibility to &#39;fill&#39; her life with stuff she <br/>\ndoes not choose<br/>\n<br/>\nRambling like my typical, thought pondering, unschooling brain does.<br/>\n~Crystal~<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://daikinicrossroads.blogspot.com\">http://daikinicrossroads.blogspot.com</a><br/>\n<br/>\nPS: This non-grammar and not great spelling gal just spelled checked and it <br/>\nsaid everything was correct.  I&#39;ve got this huge smile on my face.  You know <br/>\nthis could get me starting a whole new paragraph regarding children and <br/>\nlearning to spell.  I&#39;ll just make it short and sweet.  I went to school for <br/>\n13 years and was an honors student but can&#39;t spell.  Just by typing away <br/>\ndaily and using spell-check...I&#39;m getting it (but then again...what is <br/>\n&#39;getting it&#39; anyway).  heehee</div>","specialLinks":[]}],"prevTopicId":27292,"nextTopicId":27295}}