{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"hsmominoz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Sounding superior? Long","postDate":"1030597766","msgId":42424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFiYy5jNWQ4NDY5LjJhOWYwNjg2QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":42423,"nextInTime":42425,"topicId":42424,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/28/02 10:24:52 PM Central Daylight Time, sheran@ptd.net ... doesn t mean ... My bestfriend, Penny, and I try to get together a few times a","messageBody":"<div id=\"ygrps-yiv-1678311743\">In a message dated 8/28/02 10:24:52 PM Central Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a> <br/>\nwrites:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know a lady who was talking to me about how she felt when she sent <br/>\n&gt; her girls to kindergarten.  She hated it.  She wished she didn&#39;t have <br/>\n&gt; to.  But she just didn&#39;t know there was another way.  She might have <br/>\n&gt; vaguely heard of homeschooling, but didn&#39;t know anyone who ever did <br/>\n&gt; it.  Compulsory age in our state is 8, but NO ONE, other than <br/>\n&gt; homeschoolers, really knows that.  Everyone just assumes that when <br/>\n&gt; kids turn 5 they HAVE to go to kindergarten.  As far as most people <br/>\n&gt; are concerned their only choice is whether or not to send their kids <br/>\n&gt; to pre-K.  &lt;snip&gt;  Yes, I do believe I&#39;ve made a superior choice.  That <br/>\n </span></blockquote>doesn&#39;t mean <br/>\n<blockquote><span title=\"ireply\"> &gt; that I&#39;m superior to other people, it just means that in this one <br/>\n&gt; life decision, I think I&#39;ve made the better choice.  If I didn&#39;t <br/>\n&gt; think it was a better choice, I wouldn&#39;t bother--I&#39;d just send my <br/>\n&gt; kids to school! <br/>\n&gt; <br/>\n&gt; Sheila<br/>\n<br/>\n </span></blockquote>My bestfriend, Penny, and I try to get together a few times a month to <br/>\nscrapbook and let the kids play. Two weekends ago we were discussing her dd, <br/>\nAlex, starting school the following Monday. I asked if Alex was ready, and <br/>\nher reply was of course she is ready! She was ready last year, but since her <br/>\nbirthday falls later in September, she had to wait a year. She continued to <br/>\nsay that if Alex had been born just a few weeks earlier, she would have sent <br/>\nher last year. I stepped off the cliff and informed her that Alex really <br/>\ndidn&#39;t *have* to go until she was 7, and there are opinions that delayed <br/>\nschooling was good for children. I went on about reading readiness and other <br/>\nthings when she stopped me and said Alex was/is ready to read now. I made the <br/>\ncomment that it wasn&#39;t all that bad to delay reading until a child was older <br/>\nand she stated that if a child read at a later date, the child would have <br/>\nproblems later in life. I offered that I doubted she could tell if a child at <br/>\n16 had learned to read at 5 or 6 or if said child hadn&#39;t learned to read at <br/>\n9, 10, or even 12. (she looked at me blankly and shrugged) I offered to loan <br/>\nher my Holt or Gatto books. (I really think her kids would love to homeschool <br/>\nand have told her so in the past.) She just can&#39;t get past the <br/>\nhave-to-go-to-school-at-5 attitude. Both Alex and her little brother have <br/>\nbeen in daycare (if you can call it that, they were in my home) since birth <br/>\nor preschool since the age of 3. She will never accept that what I do is <br/>\nnatural or right. She firmly believes the choice she has made (along with the <br/>\nmasses) is the superior choice. She never misses a chance to tell me all the <br/>\nthings Moly and Jack have missed out on by not going to school. She can&#39;t <br/>\naccept that Jack&#39;s one year of school was enough. <br/>\n<br/>\nI was devastated the first day of school last year. And almost everyday after <br/>\nthat was a battle in my head and heart. I stayed in Jack&#39;s class that first <br/>\nday until the teacher finally told the parents (who were there) it was time <br/>\nto go. I was always on of the last to drop my child off every morning, and <br/>\none of the first to pick him up. I told that to Penny the other day and she <br/>\nsaid, Yeah, there were parents at the school like that. She stated it didn&#39;t <br/>\nhave any effect on her to leave her daughter off at school, in fact it <br/>\nexcited her that the venture had *finally* started. I asked Alex the other <br/>\nday how she was liking school (with warning looks from Penny) all I got was a <br/>\ndull *fine* I asked whether or not she liked riding the bus and Alex shrugged <br/>\nand said it was *okay, but very loud* later I told Penny I didn&#39;t think Alex <br/>\nwas liking school as much as she would have me believe. This is what she said <br/>\nto me, *Alex likes school just fine, just because she isn&#39;t as excited about <br/>\nit doesn&#39;t mean anything. School isn&#39;t new to Alex, she has been going since <br/>\nshe was 3 and I shouldn&#39;t read anything into her lackluster replies.* All I <br/>\ncould say was it is too bad for Alex that Penny feels that way. <br/>\n<br/>\nMy point in this long post? I know that the decision I have made is the only <br/>\nright and true way. I don&#39;t want my children to have *lackluster* lives. <br/>\nPenny OTOH firmly believes that her choice is the only right way. She knows <br/>\nthe choices I have made will come back to *bite me in the ass* someday. She <br/>\nthinks my homeschooling the kids is weird, she knows they will never learn <br/>\nanything if I don&#39;t use a curriculum. The day I told her (years ago) that I <br/>\ndidn&#39;t plan on sending either of my kids to school she told me this. &quot;Nancy, <br/>\nI know you, and I know you won&#39;t be able to pull this off. You better get a <br/>\ndamn good curriculum and force yourself to stick to it or your kids will <br/>\nsuffer the consequences!&quot; When I try to talk to her about homeschooling (I <br/>\ndon&#39;t know why I do, other than I love her kids like my own.) she puts up a <br/>\nwall, she sees it as me criticizing her. So although we all know <br/>\nhomeschooling/unschooling is the right choice, we will always know people who <br/>\nknow that going to school is the right choice. <br/>\n~Nancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":42419,"nextTopicId":42348}}