{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":218241818,"authorName":"Tracy","from":"&quot;Tracy&quot; &lt;scott.hutchins@...&gt;","profile":"twohundredacres","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I&#39;m on the way.....","postDate":"1118509111","msgId":106541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4ZjU3bis4OWJvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQ4OGpycitxZmFlQGVHcm91cHMuY29tPg=="},"prevInTopic":106508,"nextInTopic":0,"prevInTime":106540,"nextInTime":106542,"topicId":106508,"numMessagesInTopic":0,"msgSnippet":"... will probably find a way.","messageBody":"<div id=\"ygrps-yiv-422811108\"><blockquote><span title=\"ireply\">&gt;I tell him that he is very smart and to continue what is he doing- he<br/>\n </span></blockquote>will probably find a way.&lt;<br/>\n<br/>\nOh Rachel...for some reason that line put a little tear in my eye! I <br/>\nlove those moments - just before the peak, when they have the option <br/>\nto hang in there or let go...and you hand the reins to them and <br/>\nsay &quot;Whoa, or go, it&#39;s up to you&quot;. <br/>\n<br/>\nCongratulations and thanks for sharing. Your story was inspirational <br/>\nto me today!<br/>\n<br/>\nTracy</div>","specialLinks":[]},{"userId":206906115,"authorName":"Rachel","from":"&quot;Rachel&quot; &lt;jachiebell1@...&gt;","profile":"wvcaterer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"I&#39;m on the way.....","postDate":"1118294715","msgId":106508,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ4OGpycitxZmFlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":106541,"prevInTime":106507,"nextInTime":106509,"topicId":106508,"numMessagesInTopic":0,"msgSnippet":"Hi all- one of the many lurkers here and newbee- wannabe unschooling family. I think I may have posted on here before but not sure- any how my name is Rachel,","messageBody":"<div id=\"ygrps-yiv-1617651306\">Hi all- one of the many lurkers here and newbee- wannabe unschooling <br/>\nfamily.<br/>\n<br/>\nI think I may have posted on here before but not sure- any how my <br/>\nname is Rachel, a single work at home mom, and ds (is that son?- a <br/>\nguide to abbreviations would helpful lol) is David. We reside in WV. <br/>\nIt is one that requires end of year testing or portfolio showing <br/>\nimprovment of a certain percent. Would love to hear from any <br/>\nunschoolers in WV. I pulled David out of school in Dec 04- We-- More <br/>\nlike &quot;I&quot; tried doing the traditional homeschool with county books in <br/>\nJan- with total failure!<br/>\n<br/>\nBut I digress- well that was background... My main reason for this <br/>\npost is to celebrate a wonderful unschoooling moment - which have <br/>\nbecome more common. (Getting here has not been easy- and I know I&#39;m <br/>\nnot over the hill yet lol) My son loves to play ps2- he recently got <br/>\na game that has voice control. However he does not have the <br/>\nconnection for it yet- we realized afterwards...lol. <br/>\n<br/>\nSo my adventursome son asked if he could tear up 2 headphones so that <br/>\nhe could connect the computer speakers, which he hooked to the tv, to <br/>\na separate subwoofer that allowed for input from a microphone. So I <br/>\nsaid sure just so long as you don&#39;t tear up my headset (ie- <br/>\nmicrophone). So David works out in his mind and puts his plan into <br/>\naction. I am starting dinner. He needs help splicing the 2 <br/>\nheadphones. So he waits till I can put a stop to dinner- even <br/>\npitching in. <br/>\n<br/>\nWe get to his work area- the living room floor- and I ask David to <br/>\nexplain to me all the intricacies (sp?) he has planned. Well come to <br/>\nfind out he was going to be putting the cords from an output into an <br/>\noutput. So he realized even before he finished speaking that what he <br/>\nwas planning would not work. <br/>\n<br/>\nHe is a very emotional 11 year old that gets upset very easily. He <br/>\nlooks up at me with these alligator tears, crooked mouth, and working <br/>\nhimself into a lather. But when he sees me I have this great big <br/>\ngrin! And he is like why are you happy- I messed up! I tore up 2 <br/>\nperfectly good head phones! And I jump up laughing and say &quot;WE DID <br/>\nIT!&quot; Of course he is giving me &quot;the look&quot;. And I say David this is <br/>\nwhat unschooling is about- finding your way! <br/>\n<br/>\nI tell him that he is very smart and to continue what is he doing- he <br/>\nwill probably find a way. So after dinner we look at it again and I <br/>\nask him ok- where does this connection lead to... the speakers, and <br/>\nthis one- the tv. So which one leads to the ps2? this one. And how <br/>\nwill connecting the headset to the tv get the commands to the ps2. <br/>\nAHHHHHHHH! So he grabs the PS2 looking for a head set connection- <br/>\nagain. The only hookup he can find he says looks like the one for my <br/>\ncamera. (USB port). <br/>\n<br/>\nSo I say well if this game has voice command ability and it needs to <br/>\nbe hooked to the ps2 then... David says then the microphone needs to <br/>\nbe hooked to the PS2- he pulls out the booklet. At which he finds the <br/>\nrequrement for a usb headset- microphone & headphone. <br/>\n<br/>\nSo the next question is can I tear up this really nice Logitec mouse <br/>\nthat has a usb connection and splice it to the headset? Of couse I <br/>\ncalled a halt there- The mouse is $40 and that&#39;s the only head set I <br/>\nhave. But he was thinking! He was LEARNING! I was LEARNING! <br/>\n<br/>\n<br/>\nBe Well,<br/>\nRachel<br/>\nPlease Don&#39;t Take Your Organs to Heaven,<br/>\nHeaven Knows We Need Them Here!</div>","specialLinks":[]}],"prevTopicId":106528,"nextTopicId":106350}}