{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Kid&#39;s social issue- Need advice - Long","postDate":"1222490240","msgId":38760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzRDc4NEZGLTkxRDAtNDFDMC1CNUZGLUI3QjYyNTQ5QUI2MkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDUxQTVERjQ1RTM4OTQ0QzVBRkMxNTNBNTdFNjBGMzA4QFJvYnluUEM+","referencesHeader":"PGdiaDFwNitlcjJyQGVHcm91cHMuY29tPiA8NTFBNURGNDVFMzg5NDRDNUFGQzE1M0E1N0U2MEYzMDhAUm9ieW5QQz4="},"prevInTopic":38747,"nextInTopic":0,"prevInTime":38759,"nextInTime":38761,"topicId":38679,"numMessagesInTopic":0,"msgSnippet":"-=I m thinking your son needed you to interfere a long time ago, so that it never got to the situation that it is now. The other boy probably needed any","messageBody":"<div id=\"ygrps-yiv-1080453467\">-=I&#39;m thinking your son needed you to<br/>\ninterfere a long time ago, so that it never got to the situation that  <br/>\nit is<br/>\nnow. The other boy probably needed any directive to come from an  <br/>\nauthority<br/>\nfigure - the parent. I would suggest you say very firmly, &quot;It bothers us<br/>\nwhen you use that kind of language. Please find better words.&quot; Also  <br/>\nif the<br/>\nbackseat driving bothered me and he didn&#39;t stop when asked, I would  <br/>\npull the<br/>\ncar over. &quot;I really don&#39;t need your help driving.-=-<br/>\n<br/>\nRobyn had already written some of what I recommended.  I&#39;m sorry to  <br/>\nbe repetitive.  I got two days behind on e-mail and am not catching  <br/>\nup in an orderly fashion.<br/>\n<br/>\nOne good thing about two people saying the same thing, though... it  <br/>\nmust be true. &lt;bwg&gt;  (Not really, but it sounds good sometimes to  <br/>\nthink it.)<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Kid&#39;s social issue- Need advice - Long","postDate":"1222478699","msgId":38747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3MzRENEU2LTc2M0UtNDk0RS1CQUMxLTk3MEI3QUI5N0REREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ4ZGM2MzYwLjE0YjQ4YzBhLjBjODEuZmZmZjhjOTNAbXguZ29vZ2xlLmNvbT4=","referencesHeader":"PGdiaDFwNitlcjJyQGVHcm91cHMuY29tPiA8NDhkYzYzNjAuMTRiNDhjMGEuMGM4MS5mZmZmOGM5M0BteC5nb29nbGUuY29tPg=="},"prevInTopic":38735,"nextInTopic":38760,"prevInTime":38746,"nextInTime":38748,"topicId":38679,"numMessagesInTopic":0,"msgSnippet":"-=-If a mother can t sweep her own homw and kick out dead rats, how does she raise her son!?!-=- Neither we nor child protective services should assume that a ","messageBody":"<div id=\"ygrps-yiv-396434524\">-=-If a mother can&#39;t sweep her own homw<br/>\nand kick out dead rats, how does she raise her son!?!-=-<br/>\n<br/>\n<br/>\n<br/>\nNeither we nor child protective services should assume that a  <br/>\ndescription of a situation is absolutely factual and objective.<br/>\n<br/>\nLet&#39;s talk about unschooling and leave the secondary and tertiary  <br/>\nstories where they are.  It&#39;s a big world, and the list is already a  <br/>\nflood these days.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Kid&#39;s social issue- Need advice - Long","postDate":"1222470971","msgId":38735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM5REREQkE5LTI2OUItNDA1Qi05MDU2LUQ0QkYyQkRDNkM3N0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdiaDFwNitlcjJyQGVHcm91cHMuY29tPg==","referencesHeader":"PGdiaDFwNitlcjJyQGVHcm91cHMuY29tPg=="},"prevInTopic":38722,"nextInTopic":38747,"prevInTime":38734,"nextInTime":38736,"topicId":38679,"numMessagesInTopic":0,"msgSnippet":"I m going to bring the last part up top. -=-I do feel very bad for the child because i really felt it s not fair for this kid to lose a friend because of his","messageBody":"<div id=\"ygrps-yiv-503543447\">I&#39;m going to bring the last part up top.<br/>\n-=-I do feel very bad for the child because i really felt it&#39;s not fair<br/>\nfor this kid to lose a friend because of his behaviour, and i don&#39;t<br/>\nwant this kid to lose self esteem (very fragile) because of his<br/>\nbehaviour again (same reason why he&#39;s so unpopular in previous<br/>\nschool).-=-<br/>\n<br/>\nThere is no better reason to lose a friend than over one&#39;s behavior.<br/>\n<br/>\nThere is no better reason to lose self esteem than one&#39;s behavior.<br/>\n<br/>\n<br/>\n-=-One time, he critised my driving, all the<br/>\nway his house to my house, a 40 minutes drive thru town, during<br/>\nafter office hour!! LOL! When i told his mum about it, she didn&#39;t<br/>\neven apologised, but just acknowlded that he is the back seat<br/>\ndriver.-=-<br/>\n<br/>\nWhy talk to his mom about it?  She wasn&#39;t even in the car.  Tell the  <br/>\nkid to be quiet while you&#39;re driving, and mean it.<br/>\n<br/>\n-=-The reason we&#39;re always having playdates in our house is because  <br/>\nthis family&#39;s house is digustingly dirty.-=-<br/>\n<br/>\nWhy not at a public place?  A park?  Miniature golf?  Hiking?  Picnic?<br/>\n<br/>\n-=- I&#39;m not being snotty but would you sent your kid over if there&#39;s  <br/>\nbroken<br/>\n<br/>\nglass on the floor, remains of a long ago broken window pane, or<br/>\ndead rats brought in by the cats, still scattered at the entrance<br/>\nhall, tumb tacks lying around, and I have yet to see the floor being<br/>\nswept in all the time I&#39;ve known them. Sorry, i&#39;m not being fussy or<br/>\nchoosy, but i would rather have my kid at home because my kid likes<br/>\nto play on floors.-=-<br/>\n<br/>\nThis is too much information if you&#39;re also going to say &quot;sorry&quot; and  <br/>\n&quot;not fussy or choosy.&quot;<br/>\n<br/>\nFirst, I wouldn&#39;t &quot;send&quot; my kid to play where she didn&#39;t want to play  <br/>\nat all.  Would I allow her to play in a dangerous place? If she  <br/>\nwanted to, and if there was a way for her to contact me to come and  <br/>\nget her the moment she was unhappy with it, sure.  I have.<br/>\n<br/>\n-=-i would rather have my kid at home because my kid likes to play on  <br/>\nfloors.-=-<br/>\n<br/>\nDoes your kid like to play on dead rats, thumb tacks and broken  <br/>\nglass?  I seriously doubt it.<br/>\n<br/>\n-=-For a start, my kid hates it when this kid swears at anything, and  <br/>\nsometimes including him. DS has a chat with his friend and even after  <br/>\npromising he&#39;ll try not to swear so much, he&#39;s still doing it.-=-<br/>\n<br/>\nYour child asked you for help.  Telling the kid to talk to the other  <br/>\nkid might not be the kind of help he wanted.  Stick around close  <br/>\nenough to hear what they say, and stop the kid every time he says  <br/>\nsomething  you don&#39;t want said.  That&#39;s mom help.  Or tell your kid  <br/>\nto let it slide.  But sending a child to do a mom&#39;s job doesn&#39;t seem  <br/>\nthe best thing.<br/>\n<br/>\n-=-Now, DS has always been taught to be nice to guest, and that guests<br/>\n<br/>\nalway get first preferance when they are in our house. If we don&#39;t<br/>\nfeel like being nice to anyone, we don&#39;t invite anyone home. So DS<br/>\nthought it was really not fair when this kid visit us, DS is being<br/>\nthe polite host, but it&#39;s not vice versa.-=-<br/>\n<br/>\nIf your policy is to give guests their preferences, that makes you  <br/>\ngood hosts.  You can&#39;t enforce that on other people, though.  Life  <br/>\nisn&#39;t &quot;fair.&quot;<br/>\n<br/>\n-=-DS maintained this kid wouldn&#39;t listen and wouldnt&#39; stop when  <br/>\neveryone told him to stop aggresively hitting the big log that they  <br/>\nwere playing on.-=-<br/>\n<br/>\nWhere were the parents?<br/>\n<br/>\n-=-. But<br/>\n<br/>\nanyhow, i told him i&#39;ll respect whatever decision he&#39;ll make about<br/>\nthis kid, but i did urged him to give it a few days of thought<br/>\nbefore deciding.-=-<br/>\n<br/>\nIt doesn&#39;t have to be all or nothing.  Kids get older and wiser, or  <br/>\nolder and worse, but you don&#39;t need to decide this week whether  <br/>\nyou&#39;ll never see him again.  You could have a few months off without  <br/>\na permanent, lifelong decision.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":357843301,"authorName":"lyeping2008","from":"&quot;lyeping2008&quot; &lt;lyeping2008@...&gt;","profile":"lyeping2008","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Kid&#39;s social issue- Need advice - Thank you.","postDate":"1222459601","msgId":38722,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdiamZjaCtjcHFvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM1MTU3My42MTk2OC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":38702,"nextInTopic":38735,"prevInTime":38721,"nextInTime":38723,"topicId":38679,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, Many thanks for your replies. I m sorry to say this. I thought I ll have the chance to gather everyone s view here before approaching her some","messageBody":"<div id=\"ygrps-yiv-1358304945\">Hi everyone,<br/>\n<br/>\nMany thanks for your replies. I&#39;m sorry to say this. I thought I&#39;ll <br/>\nhave the chance to gather everyone&#39;s view here before approaching <br/>\nher some other day. Unfortunately, other than reading the Laura&#39;s <br/>\nfirst reply, i didn&#39;t have the wisdom i needed, when the opportunity <br/>\narises today, for me and this mom to have a quiet chat. I guessed I <br/>\nws so stressed with her son baraging me about coming to my house, in <br/>\nfront of everyone, and me, kinda lost for words for I really didn&#39;t <br/>\nknow how to lie to this kid anymore. When the opportunity arises to <br/>\nspeak to her privately, I felt i just had to speak to her and tell <br/>\nher the reason we&#39;re not doing anymore playdates or sleepover, and <br/>\nto bring up the issues betweem our kids, and I supposed I was hoping <br/>\nshe&#39;ll say she understand and will speak to her son about it, and <br/>\nhopefully we&#39;ll be able to work this out. <br/>\n<br/>\nNo, it didn;t happen. She insisted that her kid is not wrong, and <br/>\nshe blamed the Grand Theft Auto for her kid&#39;s swearing (so this is a <br/>\npersonal poke at me because it is thru my kid&#39;s playing that she&#39;s <br/>\nconvinced that it&#39;s ok for her son to play too, despite her earlier <br/>\nmisgivings about GTA), and she think&#39;s I should talk to my kid about <br/>\nbeing not so sensitive (double poke!!). When I&#39;m brought up the <br/>\nsuggestion that maybe she needs to talk to her kid about <br/>\nconsideration for other people&#39;s feelings and the consequences of <br/>\nhis actions and swearings (because it is obvious now that she and <br/>\nher kid is no longer welcome in quite a number household tho I <br/>\ndidn&#39;t tell her.) She thinks that I ws imposing my ideas upon her <br/>\nwhen she didn&#39;t need it - in not many words, I&#39;m such a high and <br/>\nmighty bi**h. <br/>\n<br/>\nWell, i supposed i know where we both stand now. At least I don&#39;t <br/>\nhave to continue giving excuses out or avoid them. <br/>\n<br/>\nI am hurting and confused because I didn&#39;t realised how intrusive I <br/>\nwas to her. As I&#39;m writing this, I am crying but I dont&#39;know why. <br/>\nMaybe it&#39;s the shock of it all. Thank you for your replies and <br/>\nsupport, it is giving me big comfort now to read it, knowing that <br/>\nit&#39;s only common sense to do what I had to do. Yes, I agree, my kid <br/>\ncouldn&#39;t have possibly handle this well. <br/>\n<br/>\nOn the subject of abuse - This kid is very much loved by his mum, <br/>\nwhich is perhaps why she&#39;s so defensive, and blinkered with her <br/>\nviews. It is true a dirty house is no indication of abuse or <br/>\nneglect. It&#39;s just the way they live, and they are happy about it, <br/>\nand I have always respected that. It&#39;s just that I didn&#39;t want my <br/>\nson rolling on such dirty and dangerous floor. <br/>\n<br/>\nOnce again, I just want everyone to know how grateful I am for your <br/>\nreplies, despite the fact I&#39;ve acted, before reading most fo them. <br/>\n<br/>\nHugs,<br/>\nSharonBugs.</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Kid&#39;s social issue- Need advice - Long","postDate":"1222449025","msgId":38702,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1MTU3My42MTk2OC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":38697,"nextInTopic":38722,"prevInTime":38701,"nextInTime":38703,"topicId":38679,"numMessagesInTopic":0,"msgSnippet":"Maybe his house is dirty but  he is loved by his parents.Would he be happier in foster care on a clean house without them? That would be the question I would","messageBody":"<div id=\"ygrps-yiv-757996607\">Maybe his house is dirty but  he is loved by his parents.Would he be happier in foster care on a clean house without them?<br/>\nThat would be the question I would ask myself.<br/>\nMy house gets nesty dirty many times.<br/>\nIt does not mean that I neglect my kids.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Kid&#39;s social issue- Need advice - Long","postDate":"1222446678","msgId":38697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxQTVERjQ1RTM4OTQ0QzVBRkMxNTNBNTdFNjBGMzA4QFJvYnluUEM+","inReplyToHeader":"PGdiaDFwNitlcjJyQGVHcm91cHMuY29tPg==","referencesHeader":"PGdiaDFwNitlcjJyQGVHcm91cHMuY29tPg=="},"prevInTopic":38695,"nextInTopic":38702,"prevInTime":38696,"nextInTime":38698,"topicId":38679,"numMessagesInTopic":0,"msgSnippet":" This sounds like a very painful situation. I have been in one before too. I don t think that you","messageBody":"<div id=\"ygrps-yiv-367843780\">&lt;&lt;&lt;So how can I distance myself without making this ugly?&gt;&gt;&gt;<br/>\n<br/>\nThis sounds like a very painful situation. I have been in one before too. I <br/>\ndon&#39;t think that you can control whether something gets ugly, since you <br/>\ncan&#39;t control another person&#39;s reaction. It&#39;s probably no good to try to <br/>\nhelp with the obvious parenting problems unless the other mom has asked for <br/>\nit. Is there really any way to say &quot;we don&#39;t like your child&quot; without it <br/>\nbeing painful?<br/>\n<br/>\nThat being said, all you can do is be as kind and brief as you can. With the <br/>\nmom you might try something like, &quot;They aren&#39;t a good fit at the moment.&quot; I <br/>\nwould avoid getting drawn in to revealing details, unless you want to take <br/>\non the character of an intervention. With the boy...gosh that&#39;s even harder. <br/>\nHow much do you want to take on in telling the boy about his own behavior <br/>\nnow, when it&#39;s kinda too late? How about &quot;We are going to take a break from <br/>\nplaydates for a little while.&quot; I&#39;d keep a sharp eye on him if he comes to <br/>\nparkday, be a close presence even if it means missing out on the <br/>\nmom-chatting, since he might react badly to the restriction. He already <br/>\nsounds like he has a bunch of anger with no safe outlet.<br/>\n<br/>\nI&#39;m sure she knows her house is dirty. She may be in denial about the extent <br/>\nor the real effects of her house. I wonder if it would be taken well if you <br/>\nand some of the other moms were to say to the dirty one, &quot;It looks like you <br/>\nhave gotten a bit overwhelmed with your house. Can we come and help?&quot; and do <br/>\na group clean up day....I don&#39;t know. They sound like a candidate for that <br/>\nBBCA tv show &quot;How Clean Is Your House?&quot; In that they bring in a crew of <br/>\nabout 6 or 7 people to clean and professional carpet cleaners. They show the <br/>\nhomemaker various tricks, and help them make a schedule for themselves. Also <br/>\nthey send swabs and dead bugs &quot;to the lab&quot; to tangibly demonstrate the <br/>\nhealth dangers of having mold and carrion about. It always makes me feel two <br/>\nthings - way better about my house in general, and eager to do some <br/>\ncleaning.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&gt; I try not to interfere, hoping and allowing DS to resolve his own<br/>\n<blockquote><span title=\"ireply\"> &gt; friednship(which he ahsn&#39;t got many anyway) issue. The last few<br/>\n&gt; times me and DS had a chat about this, i suggested DS to talk to his<br/>\n&gt; friend about it, which DS did, and it kinda work for a while.&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>In the interests of the future - I&#39;m thinking your son needed you to <br/>\ninterfere a long time ago, so that it never got to the situation that it is <br/>\nnow. The other boy probably needed any directive to come from an authority <br/>\nfigure - the parent. I would suggest you say very firmly, &quot;It bothers us <br/>\nwhen you use that kind of language. Please find better words.&quot; Also if the <br/>\nbackseat driving bothered me and he didn&#39;t stop when asked, I would pull the <br/>\ncar over. &quot;I really don&#39;t need your help driving. I&#39;ll drive on when you are <br/>\nready to be quiet (or talk about something else).&quot; I&#39;m guessing he hears <br/>\nadults in his family doing it. If a child doesn&#39;t have empathy or doesn&#39;t <br/>\nknow how to behave kindly, he needs more instruction, more explanation of <br/>\nour boundaries - even if we wouldn&#39;t need to direct our own unschooled <br/>\nchildren in that way.<br/>\n<br/>\nI would absolutely not leave it up to Jayn to tell one of her visitors about <br/>\nsomething that was bothering me. I would not leave it up to Jayn to enforce <br/>\nor even express such restrictions on behavior as we have for guests in our <br/>\nhome. I would be a much closer presence during visits.<br/>\n<br/>\nI understand how tempting it is to just let a relationship with an <br/>\nuncongenial child or family implode, as seems to have happened now. Then you <br/>\nnever have to deal with your own feelings of repugnance. I&#39;m going through <br/>\nit some - BUT I know that Jayn&#39;s affection for kids (even those I may not <br/>\nlike) means that she will struggle to keep the relationship going until it <br/>\ngets to disaster and ends badly, instead of just coming to a place of <br/>\nequilibrium and reasonable peace. I have come to the conclusion that it is <br/>\nbest to be honest about my misgivings about a child&#39;s character, but also to <br/>\nask Jayn what she thinks, and what she needs from me.<br/>\n<br/>\nI have taken on the responsibility to do whatever I can to help the <br/>\nplaydates be pleasant. Equilibrium might mean that we only meet at parks or <br/>\noutings or our house, or that I make myself a much more visible presence, or <br/>\nthat I ask for something very specific from the other mom. (EG to avoid <br/>\nusing well meaning but vague words like &quot;later&quot; but instead be really clear <br/>\nthat they will be home too late to play tonight.)<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Kid&#39;s social issue- Need advice - Long","postDate":"1222444649","msgId":38695,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgwOTI2MDg1N2szMmY1Mzk2ZnYyOTIwNmIzZDkxYjczODcxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDQ4ZGM2MzYwLjE0YjQ4YzBhLjBjODEuZmZmZjhjOTNAbXguZ29vZ2xlLmNvbT4=","referencesHeader":"PGdiaDFwNitlcjJyQGVHcm91cHMuY29tPgkgPDQ4ZGM2MzYwLjE0YjQ4YzBhLjBjODEuZmZmZjhjOTNAbXguZ29vZ2xlLmNvbT4="},"prevInTopic":38687,"nextInTopic":38697,"prevInTime":38694,"nextInTime":38696,"topicId":38679,"numMessagesInTopic":0,"msgSnippet":"I ve seen a lot of different conditions in the homes of people and some might not neglect beyond crappy conventional parenting and being dirty around the house","messageBody":"<div id=\"ygrps-yiv-1554831530\">I&#39;ve seen a lot of different conditions in the homes of people and some<br/>\nmight not neglect beyond crappy conventional parenting and being dirty<br/>\naround the house (sign of depression I think).  I&#39;d hate to think of an<br/>\nalready sad family made sadder by my noseyness unless it&#39;s absolutely<br/>\nnecessary.  I remember a kid in particular in school.  He might have been<br/>\nabused but I don&#39;t know... he didn&#39;t seem that unhappy about it.  He always<br/>\nsmelled of dirty soiled undies and sniffed his nose constantly like he could<br/>\nreally use some help getting clean.  Seemed to me to have a pretty good<br/>\noutlook though, even if he was mean occasionally.  He mostly kept to<br/>\nhimself.  I think he managed not to end up in a foster home away from his<br/>\nfamily, whoever they were.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 9/26/08, Laura Beaudin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:laura.beaudin@...\">laura.beaudin@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   Before dealing with the issues of this friendship (which I don&#39;t feel<br/>\n&gt; qualified to comment on), I&#39;d worry more about his well-being.<br/>\n&gt;<br/>\n&gt; If you&#39;re convinced he is asthmatic and have seen his home as flthy<br/>\n&gt; as you describe it, I&#39;d consider contacting Youth Protective<br/>\n&gt; Services. This is unhealthy and if that&#39;s the lifestyle he has, I&#39;d<br/>\n&gt; bet that there&#39;s a lot more to that family that you don&#39;t know about.<br/>\n&gt; Seems like he&#39;s being neglected.If a mother can&#39;t sweep her own homw<br/>\n&gt; and kick out dead rats, how does she raise her son!?!<br/>\n&gt;<br/>\n&gt; Laura<br/>\n&gt;<br/>\n&gt; At 04:02 PM 25/09/2008, you wrote:<br/>\n&gt;<br/>\n&gt; &gt;How do you let someone down gently without making it ugly? i&#39;m in a<br/>\n&gt; &gt;social situation whereby the mother is kinda ok, but the kid&#39;s not.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; Don&#39;t let school get in the way of your education!&quot; --unknown<br/>\n&gt; Visit Practical Homeschooling and view our September contest for a<br/>\n&gt; chance to win free paint-me puzzles!<br/>\n&gt; Practical Homeschooling: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.practical-homeschooling.org\">http://www.practical-homeschooling.org</a><br/>\n&gt; Works in Progress: <a rel=\"nofollow\" target=\"_blank\" href=\"http://picasaweb.google.co.uk/Laura.Beaudin\">http://picasaweb.google.co.uk/Laura.Beaudin</a><br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":279376612,"authorName":"Laura Beaudin","from":"Laura Beaudin &lt;laura.beaudin@...&gt;","profile":"ilhamdolilah","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Kid&#39;s social issue- Need advice - Long","postDate":"1222402908","msgId":38687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4ZGM2MzYwLjE0YjQ4YzBhLjBjODEuZmZmZjhjOTNAbXguZ29vZ2xlLmNvbT4=","inReplyToHeader":"PGdiaDFwNitlcjJyQGVHcm91cHMuY29tPg==","referencesHeader":"PGdiaDFwNitlcjJyQGVHcm91cHMuY29tPg=="},"prevInTopic":38679,"nextInTopic":38695,"prevInTime":38686,"nextInTime":38688,"topicId":38679,"numMessagesInTopic":0,"msgSnippet":"Before dealing with the issues of this friendship (which I don t feel qualified to comment on), I d worry more about his well-being. If you re convinced he is","messageBody":"<div id=\"ygrps-yiv-989082382\">Before dealing with the issues of this friendship (which I don&#39;t feel <br/>\nqualified to comment on), I&#39;d worry more about his well-being.<br/>\n<br/>\nIf you&#39;re convinced he is asthmatic and have seen his home as flthy <br/>\nas you describe it, I&#39;d consider contacting Youth Protective <br/>\nServices. This is unhealthy and if that&#39;s the lifestyle he has, I&#39;d <br/>\nbet that there&#39;s a lot more to that family that you don&#39;t know about. <br/>\nSeems like he&#39;s being neglected.If a mother can&#39;t sweep her own homw <br/>\nand kick out dead rats, how does she raise her son!?!<br/>\n<br/>\nLaura<br/>\n<br/>\nAt 04:02 PM 25/09/2008, you wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;How do you let someone down gently without making it ugly? i&#39;m in a<br/>\n&gt;social situation whereby the mother is kinda ok, but the kid&#39;s not.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Don&#39;t let school get in the way of your education!&quot; --unknown<br/>\nVisit  Practical Homeschooling and view our September contest for a <br/>\nchance to win free paint-me puzzles!<br/>\nPractical Homeschooling: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.practical-homeschooling.org\">http://www.practical-homeschooling.org</a><br/>\nWorks in Progress: <a rel=\"nofollow\" target=\"_blank\" href=\"http://picasaweb.google.co.uk/Laura.Beaudin\">http://picasaweb.google.co.uk/Laura.Beaudin</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":357843301,"authorName":"lyeping2008","from":"&quot;lyeping2008&quot; &lt;lyeping2008@...&gt;","profile":"lyeping2008","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Kid&#39;s social issue- Need advice - Long","postDate":"1222380134","msgId":38679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdiaDFwNitlcjJyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":38687,"prevInTime":38678,"nextInTime":38680,"topicId":38679,"numMessagesInTopic":0,"msgSnippet":"How do you let someone down gently without making it ugly? i m in a social situation whereby the mother is kinda ok, but the kid s not. 8 months ago, we have","messageBody":"<div id=\"ygrps-yiv-1829892784\">How do you let someone down gently without making it ugly? i&#39;m in a<br/>\nsocial situation whereby the mother is kinda ok, but the kid&#39;s not.<br/>\n<br/>\n8 months ago, we have made friends with another homeschooling<br/>\nfamily - mother with 10 yr old son. Initially, DS like this kid<br/>\nenough to want to play with him, so we organised playdates on and<br/>\noff. We have had a few sleep over before at our house, but it&#39;s<br/>\nquite disasterous so I never repeat it again.<br/>\n<br/>\nPlus i believed he was going thru some deschooling (at that time,<br/>\njust out of school) of some sort, so having this kid over is hard<br/>\nwork - he&#39;s really loud and boistorous and swears alot and i do<br/>\nbelieve him to be rude. One time, he critised my driving, all the<br/>\nway his house to my house, a 40 minutes drive thru town, during<br/>\nafter office hour!! LOL! When i told his mum about it, she didn&#39;t<br/>\neven apologised, but just acknowlded that he is the back seat<br/>\ndriver. So, yes, it does stresses me and my hubby out alot when he&#39;s<br/>\nhere LOL!<br/>\n<br/>\nBut because DS likes him, i had to entertain DS&#39;s request for this<br/>\nfriend to come over. The reason we&#39;re always having playdates in our<br/>\nhouse is because this family&#39;s house is digustingly dirty. I&#39;m not<br/>\nbeing snotty but would you sent your kid over if there&#39;s broken<br/>\nglass on the floor, remains of a long ago broken window pane, or<br/>\ndead rats brought in by the cats, still scattered at the entrance<br/>\nhall, tumb tacks lying around, and I have yet to see the floor being<br/>\nswept in all the time I&#39;ve known them. Sorry, i&#39;m not being fussy or<br/>\nchoosy, but i would rather have my kid at home because my kid likes<br/>\nto play on floors.<br/>\n<br/>\nBut in the past few weeks, it&#39;s finally sinking into DS that this<br/>\nkid is constantly upsetting him. For a start, my kid hates it when<br/>\nthis kid swears at anything, and sometimes including him. DS has a<br/>\nchat with his friend and even after promising he&#39;ll try not to swear<br/>\nso much, he&#39;s still doing it.<br/>\n<br/>\nAnd the few times we went over to them, DS always gets upset because<br/>\nhe claimed his friend is not being very nice, and doesn&#39;t treat him<br/>\nlike a visiting guest, wouldn&#39;t let him play the games he wants to<br/>\nplay, and one time told DS to &quot;shut up&quot; when he just switch off the<br/>\nIndiana Jones movie that DS was wathcing half way thru.<br/>\n<br/>\nNow, DS has always been taught to be nice to guest, and that guests<br/>\nalway get first preferance when they are in our house. If we don&#39;t<br/>\nfeel like being nice to anyone, we don&#39;t invite anyone home. So DS<br/>\nthought it was really not fair when this kid visit us, DS is being<br/>\nthe polite host, but it&#39;s not vice versa. So DS is beginning to not<br/>\nlike this kid so much.<br/>\n<br/>\nI try not to interfere, hoping and allowing DS to resolve his own<br/>\nfriednship(which he ahsn&#39;t got many anyway) issue. The last few<br/>\ntimes me and DS had a chat about this, i suggested DS to talk to his<br/>\nfriend about it, which DS did, and it kinda work for a while.<br/>\n<br/>\nBut this afternnon at the park with a few more newly made friends<br/>\nfrom the HE groups, something happened and DS is adamant he doesn&#39;t<br/>\nwant this kid to come over anymore. He doesn&#39;t wanna be friends<br/>\nanymore with this kid. It does seems like this time, it&#39;s for real<br/>\nbecause DS is adamant that this kid has no consideration about other<br/>\npeople&#39;s feelings, because &quot;he keep trying to spoil the game for<br/>\neveryone&quot;. DS maintained this kid wouldn&#39;t listen and wouldnt&#39; stop<br/>\nwhen everyone told him to stop aggresively hitting the big log that<br/>\nthey were playing on. DS maintained this kid does not respect him at<br/>\nall because he is still swearing, and that this kid is very selfish,<br/>\nthink of himself only and DS said he doesn&#39;t want this kind of<br/>\nfriend.<br/>\n<br/>\nMy response was we all have weird characters, and perhaps this<br/>\nfriend cannot control himself that well, when he&#39;s excited. Yes, he<br/>\nswears but it doesn&#39;t mean that he&#39;s bad because we know he&#39;s not. I<br/>\nsuggested perhaps this kid is just goin thru some issues. But<br/>\nanyhow, i told him i&#39;ll respect whatever decision he&#39;ll make about<br/>\nthis kid, but i did urged him to give it a few days of thought<br/>\nbefore deciding. I also left him with the advice of that if we like<br/>\na friend, we should be tolerant and accpeting of thier short<br/>\ncomings, just as he(DS) would like other people to be tolerant and<br/>\naccpeting of his differences.<br/>\n<br/>\nDS is still angry and adamant he doesn&#39;t want them visiting.<br/>\n<br/>\nNow this kid has been asking to come over many times, especially<br/>\nearlier this morning during the HomeEd group. How am I to tell the<br/>\nmum tomorrow (we have another common Home-ed group to attend) that<br/>\nDS doesn&#39;t want them coming over, because they will suggest coming<br/>\nover after the group? This mum is quite a sensitive person, easily<br/>\noffended and very very defensive.<br/>\n<br/>\nLast time when I tried to tell her what happened during the sleep<br/>\nover, how her son was still jumping up and down shouting away at<br/>\n11.30pm and how another time we nearly lost him in Legoland because<br/>\nHE decided he&#39;ll go check out some other rides on his own- it didn&#39;t<br/>\ngo down well. When I tried hint to her about how stressful it was<br/>\nwith her kid, and that I might not be in contact so much because of<br/>\nthis, she never once apologised or acknowledge that she understood.<br/>\nOnce this kid even had a asthma attack at 1am in the morning!! When<br/>\nI called the mother, she deny the kid&#39;s got asthma, she kept<br/>\nsaying &quot;this is un-usual, it&#39;s never happened before&quot; but it was<br/>\nclearly the kid was wheezing very loudly, and I shoudl know because<br/>\nI&#39;m asthmatic. When she heard this, she suggested that I give him<br/>\nsome puffs off my inhaler because he has done it before with hers!!!<br/>\n<br/>\nI do feel very bad for the child because i really felt it&#39;s not fair<br/>\nfor this kid to lose a friend because of his behaviour, and i don&#39;t<br/>\nwant this kid to lose self esteem (very fragile) because of his<br/>\nbehaviour again (same reason why he&#39;s so unpopular in previous<br/>\nschool).<br/>\n<br/>\nSo how can I distance myself without making this ugly?<br/>\n<br/>\nThanks for reading.<br/>\n<br/>\nSharonC</div>","specialLinks":[]}],"prevTopicId":38708,"nextTopicId":38579}}