{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] My Own 2 Cents Worth....","postDate":"1131593099","msgId":109550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzZS5kNTg4ZTkuMzBhNDE3OGJAYW9sLmNvbT4="},"prevInTopic":109543,"nextInTopic":0,"prevInTime":109549,"nextInTime":109551,"topicId":109543,"numMessagesInTopic":0,"msgSnippet":"... http://sandradodd.com/unschoolingcurriculum ... Unschoolers are homeschoolers. Unschooing is to homeschooling as the open classroom is to traditional ","messageBody":"<div id=\"ygrps-yiv-615607944\">In a message dated 11/9/05 7:30:49 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freasabird2003@...\">freasabird2003@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-This is my first year<br/>\n&gt; as an unschooler and I provided them with a letter of intent that<br/>\n&gt; sort of followed the model that I had seen somewhere in the<br/>\n&gt; unschooling website. -=-<br/>\n&gt; <br/>\n<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum\">http://sandradodd.com/unschoolingcurriculum</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Do unschoolers have to write a letter of intent<br/>\n&gt; each year, the same as homeschoolers?-=-<br/>\n&gt; <br/>\n </span></blockquote>Unschoolers are homeschoolers.    <br/>\nUnschooing is to homeschooling as the open classroom is to traditional <br/>\nschool.    You&#39;ll still need to describe it, if you&#39;re going to register with the <br/>\nstate.   (Not all states have such requirements.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":189179665,"authorName":"freasabird2003","from":"&quot;freasabird2003&quot; &lt;freasabird2003@...&gt;","profile":"freasabird2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"My Own 2 Cents Worth....","postDate":"1131589052","msgId":109543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRrdWFqcytpaWloQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":109550,"prevInTime":109542,"nextInTime":109544,"topicId":109543,"numMessagesInTopic":0,"msgSnippet":"Wow, I have been lurking in the shadows of this unschooling discussion forum for a number of months and now feel so moved to chime in with my own 2 cents","messageBody":"<div id=\"ygrps-yiv-1738122324\">Wow, I have been lurking in the shadows of this unschooling <br/>\ndiscussion forum for a number of months and now feel so moved to <br/>\nchime in with my own 2 cents worth, and also ask a question or two, <br/>\nthat I hope won&#39;t become as &quot;hot&quot; a topic as Susan&#39;s recent one.<br/>\n<br/>\nFirst, talking about strewing...and I wonder if Susan has tried this <br/>\napproach....I subscribe to Weekly Reader and just leave it setting <br/>\nabout (sometimes in the bathroom) as well as hanging the posters <br/>\nthat sometimes accompany it on the inside of our front door. This <br/>\nmakes the material accessible without &quot;pushing&quot; it on my kiddos. <br/>\nThey always notice when a new poster goes up, and spend a few <br/>\nminutes each day (usually as they are leaving the house) to look <br/>\nover the poster, read it (either aloud or to themselves) and <br/>\nsometimes the material will spark a conversation. Last week the <br/>\nposter was of a skeleton with the bones labeled and described. This <br/>\nweek is general health information to prevent catching colds and <br/>\nflus. The posters are colorful and interesting (for both the <br/>\nchildren and for me). I have a world map on the wall and a globe in <br/>\nthe middle of the dining room table. My girls enjoy finding <br/>\ndifferent locations they hear mentioned on TV and in books. <br/>\n<br/>\nSecondly, I actually thought I was going to be a &quot;relaxed <br/>\nhomeschooler&quot;, but have become an unschooler instead. Having raised <br/>\na number of children (I did foster care and adopted several) and <br/>\nwatching them struggle and flounder within the public and private <br/>\nschool sector, (my oldest is 32, the youngest is 7) I almost made <br/>\nthe same &quot;mistake&quot; with the youngest, but fortunately SHE stopped me <br/>\njust in time. And now we are so enjoying one another&#39;s company and <br/>\nlearning from the world around us each and every day. She is very <br/>\ncreative and artistic; give her paper and crayons and a pair of <br/>\nscissors and she makes the most detailed projects totally on her <br/>\nown! (Her latest is a &quot;pop-up&quot; scene of animals, birds and their <br/>\nnests in trees, flowers, and clouds.) I knew that traditional <br/>\nschooling, either at home or away, was going to stifle this <br/>\nwonderful creativity that she has going for herself; she is witty <br/>\nand stubborn and a bit of a free spirit, all attributes that I <br/>\nadmire, but didn&#39;t think she would fit inside the &quot;box&quot; with 30 <br/>\nothers her age (nor did I want her to!). I grew up in a family who <br/>\nput great pressure on educational success and who STILL are doing so <br/>\nwith the grandchildren! One of the best things I did was to move <br/>\n3600 miles away; we have daily communication via email and IM, but I <br/>\ncan CHOOSE what I care to share and not share.....and believe me, I <br/>\nhave plenty of good stuff to share with them!<br/>\n<br/>\nThird, we reside in the state of Virginia. I am required to notify <br/>\nmy school district of my intention to provide &quot;alternative <br/>\neducation&quot; by August 15 of each school year. This is my first year <br/>\nas an unschooler and I provided them with a letter of intent that <br/>\nsort of followed the model that I had seen somewhere in the <br/>\nunschooling website. Do unschoolers have to write a letter of intent <br/>\neach year, the same as homeschoolers? Can they claim religious <br/>\nexemption, thus eliminating the need for the letter?<br/>\n<br/>\nAnd last, I have to provide &quot;information on educational progress&quot; by <br/>\nAugust 1; this can be in the form of either a standardized test, OR <br/>\ngrades from a correspondence school OR a portfolio with examples of <br/>\nmy child&#39;s work in English and Math. (testing or grades are also <br/>\nrequired in only English and Math) What do unschoolers typically <br/>\npresent as their child&#39;s educational progress for this requirement?<br/>\n<br/>\nThanks in advance; best wishes to all.<br/>\n<br/>\n~Wilda aka &quot;the wild, untamed one&quot; LOL</div>","specialLinks":[]}],"prevTopicId":109240,"nextTopicId":109551}}