{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":53,"messages":[{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Interesting TV question","postDate":"1264207945","msgId":49904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqZGg4OStjdmJvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM5N0Q1ODk0LTEwQjItNDgyQy1BRDUyLTc1MzQzQ0ZGREI3MkB2ZXJpem9uLm5ldD4="},"prevInTopic":49894,"nextInTopic":49909,"prevInTime":49903,"nextInTime":49905,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... I don t think an 18 mo needs TV. Does that make you feel better? Then it s a good thing to examine! Is it relief that you don t need to bring that thing","messageBody":"<div id=\"ygrps-yiv-118470601\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Joyce Fetteroll &lt;jfetteroll@...&gt; wrote:<br/>\n<br/>\nI don&#39;t think an 18 mo needs TV. Does that make you feel better? Then<br/>\nit&#39;s a good thing to examine! Is it relief that you don&#39;t need to<br/>\nbring that thing into your house? Is it relief that you thought you<br/>\nwere doing damage to your child&#39;s learning by not having a particular<br/>\nthing? Is it something else?<br/>\n<br/>\nI don&#39;t think 18 mo kids particularly need books either. They tend<br/>\ntowards more full body and hands on at that age. But that&#39;s not<br/>\nintended to help people make their children&#39;s worlds smaller by<br/>\neliminating books and TV. That&#39;s intended to suggest that if someone<br/>\nis looking for ways to enlarge their child&#39;s world, a bucket full of<br/>\nsponges and containers and a tub of water will probably be a bigger<br/>\nhit than TV or books. (But, as always, the answer really is: It<br/>\ndepends.)<br/>\n<br/>\n<br/>\n&gt;&gt;<br/>\n<br/>\nI agree with Joyce, for a lot of 18 month olds, both TV and books are pretty pointless. My son at 18 months used books as chew toys and couldn&#39;t be coerced into sitting still in front of a TV for more than 5 minutes if I wanted to go to the bathroom alone. I suspect this isn&#39;t uncommon for toddlers, yet my daughter, currently 18 months, as mentioned, can and will sit and watch her favorite shows over and over. She also has loved books from a very early age, NEVER ripping, chewing or otherwise playing with them for other than their intended purpose. She loves to be read to, and not just baby books, but longer picture books with real text and stories as well. Most 18 month olds also don&#39;t do much drawing and are clumsy with their hands, hence those big blocky toddler crayons, but my daughter has a perfect pencil grip and will lay on her tummy and draw circles and spirals for ages, whereas my 9 year old son still shows little interest in writing or drawing, although he did more before the pleasure was schooled out of him. <br/>\n<br/>\nThe point I am trying to make is, it takes knowing your child and their interests, not &quot;what I think they can handle&quot; because I am the gatekeeper for them and need to protect them from things I am afraid could possibly, but not certainly, harm them, but &quot;what would bring them the most joy and wonder?&quot; because I am their partner and I want to see them joyful and full of wonder. If that is an adventure outside into the fresh snow, a trip to the swimming pool or the taste of a new flavour of ice cream, is that of any more value than a video of Elmo or a beautiful, animated lullaby or flickr photo stream of rubber duckies (when dd was going through her duckie phase)? <br/>\n<br/>\nAs for the wifi issue, is the wifi network in your house? Because if it is then aren&#39;t those waves all over your whole house? Not just in front of the screen? (I am not an expert on that by any means, that is just a guess). Our lives are full of radiation, toxins, additives, and my kids are going to be living in this world their whole lives, so I choose to live life now rather than living in fear. Not that I don&#39;t buy organic when I can afford it, trade in my crt monitors for LCD, etc, but I don&#39;t let it keep me from living life or letting my children explore theirs. <br/>\n<br/>\n-Tammy </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264164118","msgId":49894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5N0Q1ODk0LTEwQjItNDgyQy1BRDUyLTc1MzQzQ0ZGREI3MkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhqYm9ybCtpdnFlQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqYm9ybCtpdnFlQGVHcm91cHMuY29tPg=="},"prevInTopic":49893,"nextInTopic":49904,"prevInTime":49893,"nextInTime":49895,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... The goal -- or even the ideal -- of unschooling isn t to have TV. Because TV is such a hot topic, the thing gets focused on too much and the principles get","messageBody":"<div id=\"ygrps-yiv-139948636\">On Jan 22, 2010, at 3:49 AM, clara_bellar wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What if you don&#39;t have a TV?<br/>\n<br/>\n </span></blockquote>The goal -- or even the ideal -- of unschooling isn&#39;t to have TV.  <br/>\nBecause TV is such a hot topic, the thing gets focused on too much  <br/>\nand the principles get ignored.<br/>\n<br/>\nThe deal is to broaden their worlds so they can explore what they  <br/>\nlike and give them access to explore things they might like.<br/>\n<br/>\nThe deal is for parents to be self aware to see where their fears and  <br/>\nvalues and personal tastes may be getting in the way of their  <br/>\nchildren exploring new and future interests.<br/>\n<br/>\nThe deal in helping people understand unschooling isn&#39;t for us to  <br/>\ncreate a rule like &quot;You must have TV to unschool&quot; and then for people  <br/>\nto search for exceptions to the rule so they can feel comfortable.  <br/>\nThe deal is to explain the principles, to discuss where parents can  <br/>\nlet their fears and old scripts get in the way of putting the  <br/>\nprinciples into practice and how to help them get past them. The rest  <br/>\nis up to them.<br/>\n<br/>\nIs the goal unschooling or is it &quot;mom being comfortable&quot;? When there  <br/>\nare two goals (or philosophies) and they pull a decision in two  <br/>\ndifferent directions, to make a decision, one goal has to win and the  <br/>\nother has to lose.<br/>\n<br/>\nIn explaining the principles of unschooling, people can be as clear  <br/>\nas clear can be but if someone has shifting primary goals, those  <br/>\ngoals can interfere and get in each other&#39;s way. That person can  <br/>\n(subconsciously) twist an interpretation of the unschooling  <br/>\nprinciples to let them comfortably move further from trust and  <br/>\nrespect and enlarging their child&#39;s world while maintaining an  <br/>\nillusion they&#39;re moving closer.<br/>\n<br/>\nWhat if you didn&#39;t have books?<br/>\n<br/>\nWhat if you were allergic to peanuts?<br/>\n<br/>\nWhat if you didn&#39;t live near Disneyland?<br/>\n<br/>\nWhat if you didn&#39;t like artichokes?<br/>\n<br/>\nWhat if your child was deaf?<br/>\n<br/>\nThe answer in terms of making a child&#39;s world bigger is: It depends.<br/>\n<br/>\nMore helpful questions, questions that lead toward unschooling are:<br/>\n<br/>\nHow can I help my child explore what interests her and have access to  <br/>\nthings that might interest her?<br/>\n<br/>\nIn what ways can I make her world bigger instead of smaller?<br/>\n<br/>\nI don&#39;t think an 18 mo needs TV. Does that make you feel better? Then  <br/>\nit&#39;s a good thing to examine! Is it relief that you don&#39;t need to  <br/>\nbring that thing into your house? Is it relief that you thought you  <br/>\nwere doing damage to your child&#39;s learning by not having a particular  <br/>\nthing? Is it something else?<br/>\n<br/>\nI don&#39;t think 18 mo kids particularly need books either. They tend  <br/>\ntowards more full body and hands on at that age. But that&#39;s not  <br/>\nintended to help people make their children&#39;s worlds smaller by  <br/>\neliminating books and TV. That&#39;s intended to suggest that if someone  <br/>\nis looking for ways to enlarge their child&#39;s world, a bucket full of  <br/>\nsponges and containers and a tub of water will probably be a bigger  <br/>\nhit than TV or books. (But, as always, the answer really is: It  <br/>\ndepends.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Wifi uses pulsed micro-waves (like cell phones) which are not  <br/>\n&gt; talked about much here but in some countries of Europe wifi is no  <br/>\n&gt; longer allowed in schools<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>If the research is on cell phones that are  held against the body,  <br/>\nhow does that apply to an antenna that&#39;s not near the body? (That&#39;s a  <br/>\nlegitimate question people should ask, not a snarky question.)<br/>\n<br/>\nRadiation (of all kinds: visible light, microwaves, radio waves,  <br/>\nnuclear) decreases with the square of the distance. I didn&#39;t see that  <br/>\nmentioned. So if less than 6 inches is the most dangerous, then 12  <br/>\ninches (2 times the distance) means only 1/4 the radiation received  <br/>\nat 6 inches. 2 feet (4 times the distance) is 1/16th. And so on.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:Priming the Pump/Deschooling WAS: Interesting TV question","postDate":"1264161785","msgId":49893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3MDIzNS45ODM2Ni5xbUB3ZWI1MzkwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGhqYmRjaCtxdWZyQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqYmRjaCtxdWZyQGVHcm91cHMuY29tPg=="},"prevInTopic":49892,"nextInTopic":49894,"prevInTime":49892,"nextInTime":49894,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"Anyways, I am glad that TV came up again because it has been on my mind a lot lately. You would think that after 2 years of thinking about this I might have it","messageBody":"<div id=\"ygrps-yiv-1020350773\">Anyways, I am glad that TV came up again because it has been on my mind a lot lately. You would think that after 2 years of thinking about this I might have it figured out! My daughter is 3 1/2 and absolutely LOVES television. Her father and I do too :-)<br/>\n <br/>\n<br/>\n*****<br/>\nAnd some kids just like TV more than others.  Eli almost always wants the TV on.  We have set up the house so he can play, eat, and be with us, all while watching the TV.  Samuel is different.  He would rather play and interact more with us.<br/>\n<br/>\nI know there is tons of stuff going on in the house that Eli enjoys and could participate in, but he does not choose it.  He likes to stay home, often for a week at a time, so going out does not tempt him.  We have thousands of legos (his favorite toys) and he builds while he watches.  He often does not like board or card games, but sometimes will play.  He does not like playing video games, but will watch others.  He is not really interested in many other children than his brother.  He has a few friends, but seeing them every few weeks is enough for him.<br/>\n<br/>\n<br/>\nWe have asked, he would rather stay home and watch TV and play with legos than go almost anywhere.<br/>\n<br/>\nHe is a kid that knows what he likes.  It may be different later, it may not.  We can accept him or we can make him feel bad, but we can&#39;t change him.<br/>\n<br/>\nAmanda <br/>\n<br/>\nEli 8, Samuel 7<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193946716,"authorName":"Guillaume JAY","from":"Guillaume JAY &lt;gjay@...&gt;","profile":"gaegui","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:Priming the Pump/Deschooling WAS: Interesting TV question","postDate":"1264151408","msgId":49891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwNTcxNTMxNDQuMTk2NjQ2MTI2NDE1MTQwODA3NC5KYXZhTWFpbC5yb290QHNwb29sZXIxMC1nMjcucHJpdi5wcm94YWQubmV0Pg==","inReplyToHeader":"PDQ2MDIzODg2LjE5NjU5OTEyNjQxNTEzMjQ0MzkuSmF2YU1haWwucm9vdEBzcG9vbGVyMTAtZzI3LnByaXYucHJveGFkLm5ldD4="},"prevInTopic":49888,"nextInTopic":49892,"prevInTime":49890,"nextInTime":49892,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... I never wanted to say my kids never watch tv when the weather is fine :) . I just wanted to say that they watch a lot less tv when the weather is fine. I","messageBody":"<div id=\"ygrps-yiv-2019948125\">----- &quot;DaBreeze21&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:susanmay15@...\">susanmay15@...</a>&gt; a écrit : <br/>\n<blockquote><span title=\"ireply\"> &gt; Marisol loves TV and she is not bored, it doesn&#39;t matter if it is nice out, she isn&#39;t necessarily sick, tired, or sad, and we have playdates when she is up for them. <br/>\n<br/>\n </span></blockquote>I never wanted to say my kids never watch tv when the weather is fine :) . I just wanted to say that they watch a lot less tv when the weather is fine. <br/>\nI think it&#39;s in fact totally natural, and &quot;traditional&quot;: in the old days (when most of the people were peasants, no electric lightning), spring/summer was the time to go outside to work in the fields, winter was the time when humans stayed inside and swapped stories around the fireplace) <br/>\n<br/>\nThey also watch TV with playdates, which is for me a social thing, sharing a story. But they&#39;re going to watch only one or two shows, before doing something else (maybe replaying the show :)) (with TV-restricted kids, it&#39;s harder, and my kids sometimes complains that the other kid can&#39;t stop playing computer games or watching tv) <br/>\n<br/>\nI think it&#39;s normal for kids to watch TV. Watching too much TV can be a warning sign. Can, not must. I&#39;m going to introduce Mathieu to Star Wars the movie, I know he&#39;s going to watch it six times in three days :) <br/>\n<br/>\nBTW, when I say TV, since they can&#39;t read, and are not remote-proficient, it&#39;s mostly recorded shows. <br/>\n<br/>\nGuillaume <br/>\nMathieu 5.9, Mathilde 4.8 <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":366686190,"authorName":"clara_bellar","from":"&quot;clara_bellar&quot; &lt;claramont@...&gt;","profile":"clara_bellar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Interesting TV question","postDate":"1264150197","msgId":49892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYm9ybCtpdnFlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqYWwwNStuMzhrQGVHcm91cHMuY29tPg=="},"prevInTopic":49891,"nextInTopic":49893,"prevInTime":49891,"nextInTime":49893,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... you mean the general idea of letting your child be a part of your life, then if you re watching TV, there it will be. What if you don t have a TV? Not that","messageBody":"<div id=\"ygrps-yiv-406079393\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Kristi&quot; &lt;foehn_jye@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Your kids are young.  Nothing magically occurs between the ages of 5 and 6 that would make a sudden release of TV limits important.  How would this work, anyway?  Would you suddenly start allowing your 6 or 7 year old watch TV with no limits, while continuing to limit the TV time of your youngest? Would you wait until your youngest was 6 or 7? How do you think the transition would be taken by your kids? <br/>\n<br/>\n&gt;You&#39;ve mentioned attachment parenting. If<br/>\n </span></blockquote>you mean the general idea of letting your child be a part of your<br/>\nlife, then if you&#39;re watching TV, there it will be. <br/>\n<br/>\nWhat if you don&#39;t have a TV? Not that you had one and hid it out of fear for your child&#39;s brain development, but if you simply didn&#39;t have one before the child was born. Then what,  you wait until they ask for one?... Which is not withholding or controlling, you&#39;re living your life and they&#39;re a part of your life... if your life happens to be a TV-free life. We live btw 3 different countries so we don&#39;t have cable or a TV. But we watch movies on the computer so then we need to accept that the computer is the TV in our home = no limits on the computer... Our son is only 18 months and so far I haven&#39;t felt comfortable with him being at the computer at all, because from what I&#39;ve read I believe computers are worse than TVs... Wifi uses pulsed micro-waves (like cell phones) which are not talked about much here but in some countries of Europe wifi is no longer allowed in schools, cell phone antennas need to be a certain distance from schools, etc. The UK had a cell phone designed for toddlers and the government ended up recalling them.<br/>\nIn answer to Joyce&#39;s post, I happened to do an awful lot of research on the subject when DH got cancer on his tongue and palate in 2007 at 40 year old. I wanted to get to the bottom of it. I read three books on the subject, one by a journalist who went and spoke to scientists all over the world and who read all the studies available. From what I got, there has been enough independent studies now to know that pulsed micro-waves are not harmless like, say, radio waves. Unfortunately there is much less data available here in the US, and hardly any independent, solid studies done here (because so much money is at stake? because nobody&#39;s willing to finance studies whose results won&#39;t generate any income? Those are good questions too :( ) Anyway here is a link with some tips on how to make the use safer.<br/>\n<br/>\nSecret Link Between Cigarettes and Cell Phones<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://articles.mercola.com/sites/articles/archive/2009/09/29/More-Confirmation-That-Cell-Phones-Cause-Brain-Tumors.aspx\">http://articles.mercola.com/sites/articles/archive/2009/09/29/More-Confirmation-That-Cell-Phones-Cause-Brain-Tumors.aspx</a><br/>\n<br/>\nAnd this one has a graph that shows skull sickness (wow that was a crazy tipo. I meant thickness of course) in a 5 year old, a 10 year old and an adult<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://articles.mercola.com/sites/articles/archive/2009/09/03/Brain-Damage-From-Mobile-Phone-Radiation.aspx\">http://articles.mercola.com/sites/articles/archive/2009/09/03/Brain-Damage-From-Mobile-Phone-Radiation.aspx</a></div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:Priming the Pump/Deschooling WAS: Interesting TV question","postDate":"1264138449","msgId":49888,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYmRjaCtxdWZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg5MjcxNjAwNy4xNzc4MDExMjY0MDcwNDAxODY3LkphdmFNYWlsLnJvb3RAc3Bvb2xlcjEwLWcyNy5wcml2LnByb3hhZC5uZXQ+"},"prevInTopic":49886,"nextInTopic":49891,"prevInTime":49887,"nextInTime":49889,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"Hello to all once again! I can hardly believe it, but I have been reading this list for almost 2 years now, almost every day! I find that the intense, swirly","messageBody":"<div id=\"ygrps-yiv-861072387\">Hello to all once again! I can hardly believe it, but I have been reading this list for almost 2 years now, almost every day! I find that the intense, swirly thoughts and growth happen in bursts. <br/>\n<br/>\nAnyways, I am glad that TV came up again because it has been on my mind a lot lately. You would think that after 2 years of thinking about this I might have it figured out! My daughter is 3 1/2 and absolutely LOVES television. Her father and I do too :-)<br/>\n<br/>\nI still feel guilty sometimes though that it is on all day lots of times. And I think that the guilt must mean something - that I should be DOING more, OFFERING more. Instead of feeling guilty anyways. I have been refraining from posting and have been reading a lot on Sandra&#39;s and Joyce&#39;s websites which does help. But there are still things nagging at my mind almost all the time lately.<br/>\n<br/>\nOne thing that I have noticed in this thread a lot is that many people are giving examples of their children having no limits on TV and choosing to do so many other things, or playing while it&#39;s on etc. Or as stated here:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In my personal experience, my kids ( 4.7/5.8) watch a lot of tv if<br/>\n&gt; - there is a new thing available which they enjoy a lot, and want to watch it again and again <br/>\n </span></blockquote>- they&#39;re bored and don&#39;t have anything else/more interesting to do  <br/>\n<blockquote><span title=\"ireply\"> &gt; - bad weather <br/>\n&gt; - no parental support to suggest/participate in activities (games, craft, and so on) <br/>\n&gt; - no friends to play with  <br/>\n&gt; - they&#39;re a bit sick, tired, or sad. <br/>\n<br/>\n </span></blockquote>Marisol loves TV and she is not bored, it doesn&#39;t matter if it is nice out, she isn&#39;t necessarily sick, tired, or sad, and we have playdates when she is up for them. So that really only leaves me not offering enough &quot;other&quot; opportunities/activities. I have refrained from posting because I know that no one here can know or tell me if I am &quot;doing&quot; enough, I have to decide that. But part of me also wonders if part of this has to do with deschooling for myself. *I* am the one feeling bad and out of sorts not my daughter. Also if TV should be valued as much as any other activity, then when I offer other things (or just start doing them) and she continues to choose TV, that should be ok... (in theory and with me)<br/>\n<br/>\nI think I remember a few weeks ago Sandra posting that she wasn&#39;t sure &quot;unlimited television&quot; should be the goal for very small children - That it wasn&#39;t a big deal to turn the TV off and move on to something else when her kids were little because it hadn&#39;t been limited. One thing that has been helpful for me to realize is that sometimes things that a mainstream parent versus an unschooling parent say or do might look the same but the history of the relationships or the intent is different which is what makes the overall interaction different. For example, when Sandra said that she might have something else for the kids to do when they were little it sounded almost like a &quot;mainstream&quot; strategy to me - but how the unschooling parent would proceed based on their child&#39;s reaction would be very different. If the child made it clear that their choice was to watch TV in that moment that would be respected in the best way possible.<br/>\n<br/>\nI guess I&#39;m trying to get a handle on how to really get things &quot;swirling&quot; in my own home and life. While I continue to read and learn TV STILL continues to be an issue for me. Considering I had 13 years of public school, 4 years or university, 2 years for a masters, and 4 years of teaching in a public school that is a lot of deschooling! I am lucky in that my daughter LOVES to be home and to be with me. And I want to keep it that way :-)A couple of my challenges - a 3 year old and a 6 month old baby, a very spirited little girl who ABSOLUTELY knows what she wants, when, and how, her being much more introverted and liking to stay home, while I am more extraverted and would get out a lot more if I could. Maybe I&#39;m doing what I should be for right now and am just overanalyzing... or maybe I need a kick in the pants... or maybe both? <br/>\n<br/>\nThanks if you actually read all that and have some input! <br/>\n<br/>\nSusan<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://crunchyconmom.xanga.com/\">http://crunchyconmom.xanga.com/</a></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264133592","msgId":49886,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3RjM0QjJDLTYwNTItNEMxQy1CMkUwLUFENEY0QjNGMEZEQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDc2NTEwMi41NDAwMy5xbUB3ZWIxMTIwMTQubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDc2NTEwMi41NDAwMy5xbUB3ZWIxMTIwMTQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49885,"nextInTopic":49888,"prevInTime":49885,"nextInTime":49887,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... I didn t read it as obnoxious. Though I suspect you may have heard a tone in some of the replies. Written words carry no tone ;-) It s supplied by the","messageBody":"<div id=\"ygrps-yiv-1049045241\">On Jan 21, 2010, at 9:21 PM, zoie dubinsky wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My original email read as obnoxious.<br/>\n<br/>\n </span></blockquote>I didn&#39;t read it as obnoxious.<br/>\n<br/>\nThough I suspect you may have heard a tone in some of the replies.  <br/>\nWritten words carry no tone ;-) It&#39;s supplied by the reader. That&#39;s  <br/>\nwhy it&#39;s suggested that people try to hear the words said by their  <br/>\nbest gentle friend :-)<br/>\n<br/>\nAlso, replies are written with the understanding that hundreds of  <br/>\nother people are reading silently asking the same questions and  <br/>\ncurious about the answers. So often replies take into account more  <br/>\ncommon attitudes and common questions that didn&#39;t get asked in the  <br/>\noriginal post. (For example, it&#39;s quite common for parents to limit  <br/>\nTV for the reasons you were giving. Whether you intended to or not,  <br/>\ndoesn&#39;t change the fact that there are those who do and some who are  <br/>\nweighing whether or not to.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Interesting TV question","postDate":"1264133300","msgId":49885,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYjhiays3MDExQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZFMTkxRkVEQTdCOTREQUFBRDAwM0I4QUQ4QzZCMUQ0QFJvY2tldFNhdWNlMj4="},"prevInTopic":49884,"nextInTopic":49886,"prevInTime":49884,"nextInTime":49886,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"I want to put a big ditto on this post, and in fact, I could have written every word and detail.  And, like Melissa, I have only seen creativity flourish.  And","messageBody":"<div id=\"ygrps-yiv-1867851873\">I want to put a big ditto on this post, and in fact, I could have written every word and detail.  And, like Melissa, I have only seen creativity flourish.  And I was at the Joseph Chilton Pierce (sp?) lecture where he detailed all the &quot;hard science&quot;about cortisol, etc. And, even though it didn&#39;t match any of my own experience I believed it &quot;must&quot; be true.  Life at our house is so much better for having let go of these fears that ended up pitting us against our children. <br/>\n<br/>\nJoanna<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;DJ250&quot; &lt;dj250@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Just wanted to chime in, here, and say I used to be an avid Waldorfer!  The limits were placed on my children and I really hesitated letting those go when I came to unschooling.  Having read all the Waldorf stuff, heard teachers, etc (we homeschooled with Waldorf), I was SURE I&#39;d see damage.  But, I haven&#39;t!!!  I was told their creativity would go out the window, they&#39;d only imitate the shows, lose brain cells, etc.  Nope, in fact, the opposite has happened.  A friend (long-time unschooler) told me people used to say the same thing about books--they&#39;ll rot your brain, be a waste of time, etc.  Now, we PUSH books!  She also said TV is a form of modern storytelling and I agree.  What a neat form we humans have created!<br/>\n&gt; <br/>\n&gt; ~Melissa, in MD :)<br/>\n&gt; <br/>\n&gt;   ----- Original Message ----- <br/>\n&gt;   From: Joyce Fetteroll <br/>\n&gt;   To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n&gt;   Sent: Thursday, January 21, 2010 8:31 AM<br/>\n&gt;   Subject: Re: [AlwaysLearning] Interesting TV question<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;     <br/>\n&gt; <br/>\n&gt;   On Jan 20, 2010, at 11:49 PM, Sandra Dodd wrote:<br/>\n&gt; <br/>\n&gt;   &gt; I&#39;m not sure if the no<br/>\n&gt;   &gt; limits thing is appropriate for kids under 7 or around that age.<br/>\n&gt; <br/>\n&gt;   What knowledge, what personal experience, are you basing that theory on?<br/>\n&gt; <br/>\n&gt;   Is the &quot;knowledge&quot; personal experience or just other&#39;s theories?<br/>\n&gt; <br/>\n&gt;   What does this unhealthiness look like long term?<br/>\n&gt; <br/>\n&gt;   If there are actual unhealthy kids, have the been radically <br/>\n&gt;   unschooled? Or are there other factors at play that have caused this <br/>\n&gt;   &quot;unhealthiness&quot;?<br/>\n&gt; <br/>\n&gt;   I think it&#39;s natural, especially when it comes to our kids, to hear <br/>\n&gt;   &quot;That&#39;s bad for kids!&quot; and grab that like a life preserver. You don&#39;t <br/>\n&gt;   want to examine it too closely (for rot, for rusty nails -- for <br/>\n&gt;   necessity!) because it might be preserving your kids lives.<br/>\n&gt; <br/>\n&gt;   So it&#39;s much easier, much more soothing to build walls against <br/>\n&gt;   possible dangers than it is to examine them.<br/>\n&gt; <br/>\n&gt;   If freely chosen TV were unhealthy, then unschooled kids would be the <br/>\n&gt;   most unhealthy kids in the world ;-) (Or they&#39;re special and immune. <br/>\n&gt;   That&#39;s another possibility.)<br/>\n&gt; <br/>\n&gt;   So, what you&#39;re saying is -- without realizing it I assume! -- is <br/>\n&gt;   that Sandra&#39;s and my and dozens of other always unschooled kids *are* <br/>\n&gt;   unhealthy. And we either don&#39;t realize or don&#39;t care, that pushing <br/>\n&gt;   unschooling is way more important than our kids!<br/>\n&gt; <br/>\n&gt;   That&#39;s not said in an &quot;I am so insulted&quot; way. It&#39;s said as &quot;Does that <br/>\n&gt;   make sense?&quot; Waldorfers are saying it&#39;s unhealthy. But the kids that <br/>\n&gt;   should show the greatest damage -- radically unschooled kids -- <br/>\n&gt;   either aren&#39;t showing it or their parents are too dumb or uncaring to <br/>\n&gt;   notice.<br/>\n&gt; <br/>\n&gt;   Anyone who&#39;s on the list for a while will feel fairly confident that <br/>\n&gt;   dumb or uncaring doesn&#39;t fit ;-) (Some are accused of being mean to <br/>\n&gt;   new unschoolers but that&#39;s not the same ;-)<br/>\n&gt; <br/>\n&gt;   If anyone&#39;s been to a conference, I think they would have a hard time <br/>\n&gt;   seeing damage from TV. If radically unschooled kids are compared to <br/>\n&gt;   conventionally parented kids, I&#39;d say they are more polite, lively, <br/>\n&gt;   have greater ability to socialize without respect to age, have a <br/>\n&gt;   greater sense of self, have a depth and/or breadth of knowledge about <br/>\n&gt;   their passions.<br/>\n&gt; <br/>\n&gt;   So maybe that&#39;s what the Waldorfers are calling damage?<br/>\n&gt; <br/>\n&gt;   If the damage isn&#39;t apparent to a parent, if it takes an expert <br/>\n&gt;   trained in that specific damage to be able to tell it&#39;s there, does <br/>\n&gt;   the damage really exist? (Another question: are they making money <br/>\n&gt;   from you believing the damage exists?)<br/>\n&gt; <br/>\n&gt;   &gt; Like I wouldn&#39;t give my kid a cell<br/>\n&gt;   &gt; phone to play with bcs of all the EMF&#39;s it emits which children are<br/>\n&gt;   &gt; more affected by<br/>\n&gt;   &gt;<br/>\n&gt; <br/>\n&gt;   That&#39;s another thing to question. (Was the discussion of cell phones <br/>\n&gt;   here recently or Unschooling Basics?) I think it was pointed out that <br/>\n&gt;   the studies connecting EMFs and cancer came from police and other <br/>\n&gt;   emergency workers who had their phones on all the time right next to <br/>\n&gt;   their bodies.<br/>\n&gt; <br/>\n&gt;   Would a child&#39;s use of a cell phone come anywhere near that amount or <br/>\n&gt;   that nature of use? *Maybe* (speculating here) children&#39;s still <br/>\n&gt;   growing bodies might be more sensitive to EMFs, but *that* much more <br/>\n&gt;   sensitive? And do cell phones emit the same level of EMFs as the <br/>\n&gt;   phones in the emergency workers&#39; study? (I&#39;m not asking for answers. <br/>\n&gt;   Those are the kinds of questions someone should be asking.)<br/>\n&gt; <br/>\n&gt;   It&#39;s much much easier to fear and say no than to pick apart the fear <br/>\n&gt;   and decide if it has any foundation.<br/>\n&gt; <br/>\n&gt;   When a fear doesn&#39;t impact anyone other than yourself, it&#39;s not such <br/>\n&gt;   a big deal. You&#39;re deciding that the limit to you is easier than <br/>\n&gt;   digging to find out the truth. I tossed out my aluminum cookware <br/>\n&gt;   rather than dig into the scientific literature when a connection was <br/>\n&gt;   speculated with Alzheimer&#39;s. Since it was cheap, easier to toss than <br/>\n&gt;   dig. But, especially with the new smart phones with all the cool apps <br/>\n&gt;   on them, a choice to limit because of an unexamined fear, can narrow <br/>\n&gt;   a child&#39;s world. To the child it can feel like you&#39;re saying &quot;I care <br/>\n&gt;   more about my fears than I care about what you want.&quot; (And no amount <br/>\n&gt;   of words that explain that it&#39;s because you love him will change what <br/>\n&gt;   the actions are saying and feeling to him.)<br/>\n&gt; <br/>\n&gt;   That doesn&#39;t mean everyone should go out and buy an iPhone for their <br/>\n&gt;   child because some fool said no one can unschool unless their child <br/>\n&gt;   has a smart phone! It means that fears should be dragged out into the <br/>\n&gt;   light to examine them with a big magnifier when they become walls <br/>\n&gt;   between the child and the world they might like to explore.<br/>\n&gt; <br/>\n&gt;   Joyce<br/>\n&gt; <br/>\n&gt;   [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ------------------------------------------------------------------------------<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;   No virus found in this incoming message.<br/>\n&gt;   Checked by AVG - www.avg.com <br/>\n&gt;   Version: 9.0.730 / Virus Database: 271.1.1/2636 - Release Date: 01/21/10 02:34:00<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264132849","msgId":49884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBGNTlBOUQ5LTQwQ0UtNDE1OC05OTJDLTQyMkFBQTUwMkNFNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc2NTEwMi41NDAwMy5xbUB3ZWIxMTIwMTQubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDc2NTEwMi41NDAwMy5xbUB3ZWIxMTIwMTQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49882,"nextInTopic":49885,"prevInTime":49883,"nextInTime":49885,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"-=My original email was not meant to sound like a here I am presenting you with a whole lof of profound facts kind of tone. It was more I m sure you ve","messageBody":"<div id=\"ygrps-yiv-1554866825\">-=My original email was not meant to sound like a &quot;here I am  <br/>\npresenting you with a whole lof of profound facts&quot; kind of tone. It  <br/>\nwas more &quot;I&#39;m sure you&#39;ve heard of the theories, or maybe you have  <br/>\nread and what do you think?&#39; kind of tone.-=-<br/>\n<br/>\nIt did come across that way.  I think people were arguing with the  <br/>\nother voices in your head, not with you. &lt;g&gt;  With your source ideas.<br/>\n<br/>\n-=-I guess I don&#39;t really see the big deal in not having TV for EC in  <br/>\nthe house -=-<br/>\n<br/>\nIs &quot;EC&quot; &quot;early childhood&quot;?  Maybe it would be good not to think of it  <br/>\nas separate from real childhood, or real life.  When Winston Churchill  <br/>\nwas one year old, he was already Winston Churchill.<br/>\n<br/>\n-=-(I realize EC is really only up to about 31/2 and that children are  <br/>\nalways developing but they develop in stages right? No one is going to  <br/>\ngrow a third arm from watching TV, or not be able to smell or taste  <br/>\nanymore, I just wondered how some of you all do it and what are your  <br/>\nexperiences.-=-<br/>\n<br/>\nThey don&#39;t develop in stages the same way cicadas do.  The stages have  <br/>\nto do with awareness and intellectual ability and hormones, not with  <br/>\nphysical form.  They always have the same number of arms. &lt;g&gt;<br/>\n<br/>\nIf a child were forced to watch television against his will, I would  <br/>\nthink it could be detrimental.  If a child has the freedom of movement  <br/>\nto get away from it, or the ability to push the &quot;off&quot; button, that&#39;s a  <br/>\nwhole different situation.<br/>\n<br/>\n-=-My original email read as obnoxious.-=-<br/>\n<br/>\nI didn&#39;t think it was obnoxious, and it was written to me, so you are  <br/>\nabsolved.  Don&#39;t feel at all bad. &lt;g&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":258071506,"authorName":"zoie dubinsky","from":"zoie dubinsky &lt;avocadostew@...&gt;","profile":"avocadostew","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264126879","msgId":49882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2NTEwMi41NDAwMy5xbUB3ZWIxMTIwMTQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhqYWwwNStuMzhrQGVHcm91cHMuY29tPg=="},"prevInTopic":49877,"nextInTopic":49884,"prevInTime":49881,"nextInTime":49883,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"Totally thought about the age gaps and how I could limit or rather, not have TV in the house until a certain age and realized that this cannot work with more","messageBody":"<div id=\"ygrps-yiv-1309232314\">Totally thought about the age gaps and how I could limit or rather, not have TV in the house until a certain age and realized that this cannot work with more than one child. I guess it&#39;s just that since. tee hee. My main concern is really with early childhood and the development of the senses. I was thinking about whether I would be depriving the senses if I let my child watch TV as much as he wanted. My original email was not meant to sound like a &quot;here I am presenting you with a whole lof of profound facts&quot; kind of tone. It was more &quot;I&#39;m sure you&#39;ve heard of the theories, or maybe you have read and what do you think?&#39; kind of tone.<br/>\n<br/>\n<br/>\nI guess I don&#39;t really see the big deal in not having TV for EC in the house (I realize EC is really only up to about 31/2 and that children are always developing but they develop in stages right? No one is going to grow a third arm from watching TV, or not be able to smell or taste anymore, I just wondered how some of you all do it and what are your experiences.<br/>\n<br/>\nAgain, thanks very much. I appreciate the honesty, courtesy, and feedback. My original email read as obnoxious. I&#39;m still learning about all this stuff. Very newbie.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOh well, we shall figure it out. <br/>\n<br/>\nthanks<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- On Thu, 1/21/10, Kristi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:foehn_jye@...\">foehn_jye@...</a>&gt; wrote:<br/>\n<br/>\nFrom: Kristi &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:foehn_jye@...\">foehn_jye@...</a>&gt;<br/>\nSubject: [AlwaysLearning] Re: Interesting TV question<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nReceived: Thursday, January 21, 2010, 5:37 PM<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      &gt;&gt; I think of myself as someone who would probably be good at unschooling. I feel I&#39;m an intuitive person and have been practicing attachment parenting with my two sons under 3 thus far.&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nIf you identify yourself as a potential unschooler, work from that starting place.  Don&#39;t expect to understand everything right away, and question the things that you&#39;ve read or been told. Take small steps and start working forward. Your children are young, not even school age, so you have time to really start learning about what it is and how it might look for your family. <br/>\n<br/>\n<br/>\n<br/>\n&gt;&gt;My only thing about the no limits on TV thing with unschooling is that I&#39;m not sure if the no limits thing is appropriate for kids under 7 or around that age.&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nWhat is it that you are thinking &quot;no-limits&quot; means? I think so many people get hung up on this idea of no limits. But they don&#39;t explore what it really means to not limit something. It&#39;s as if this idea of life without limits invokes images of chaos--wild, mangy children running muddy-footed and sugar-mouthed through the house, jumping all over the furniture with the TV blaring in the background while the parents stand befuddled and fearful in the corner.  My kids (4 and 7) have no TV restrictions- -they can watch what they want when they want, but the actuality is, the TV is on very little throughout the day. Some days more than others, some days not at all. Look at what your idea of no limits on the TV means, and think about how limits on the TV might look like, do these images match reality? Is fear getting in the way? How will either of these choices affect your children?<br/>\n<br/>\n<br/>\n<br/>\n&gt;&gt;I am  a trained teacher as well. I went to Teacher&#39;s College only to find out that I didn&#39;t want to &quot;teach&quot; I just have a hard time getting the whole unschooling toddlers and under 7&#39;s. Coming from a bit of the  Waldorf philosophy, I&#39;m sure you&#39;ve read/heard that the body of a  child under 7 is still developing their organs, that TV raises  cortisol levels and that all that children do in this age group plays  a part in developing their organs, brains etc.&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nDid what you learned in Teacher&#39;s College discuss real scientific studies regarding this?  What were the results?  Do you have any real reason to believe what the Waldorf folks are claiming as fact? Are these facts real, or speculation? Everything a child under 7 does MUST have a part in developing their bodies, but do you really believe TV somehow has this real, debilitating impact?   <br/>\n<br/>\n<br/>\n<br/>\n&gt;&gt;I just wonder, is it possible to continue attachment parenting/unschooli ng a child until 7 without TV? Is it possible to accept the fact that it MIGHT be better for at least really young kids to steer clear of TV? I worry from a health standpoint.&lt; &lt;<br/>\n<br/>\n<br/>\n<br/>\nFirst of all, I would suggest that if you choose to steer clear of TV, do so from a mindful and well though-out standpoint, and not one that stems from worry.  That said, I know an unschooling family that does not own a TV (gasp!). They have several computers, however, and can often be found watching movies together, or streaming shows, amongst other cool computer-y things.  Their kids are 10 and 7. The parents are highly attentive, very involved with their kids&#39; lives. These kids are not staying up all night at friends houses with their eyelids propped open (lol, Pam!) because TV is not worth more to these kids than their other interests. Maybe one day they will want a TV, maybe not.  I imagine that if they do one day want one, the parents would gladly accommodate this desire.   <br/>\n<br/>\n <br/>\n<br/>\n&gt;&gt;So, do you see what I mean? I don&#39;t want to be totally Waldorfy in my home but something in my gut tells me that kids under a certain age should just be outside more, experiencing touch and taste and lots of other things that TV cannot be and will never be.&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nSince I seem to need to use personal stories today to get my viewpoint across, I&#39;ll add another one. :)  My husband and I are outdoors freaks. Literally. We have owned an outdoor retail store, bike shop, adventure guide service, etc. for years. We live in the mountain, we ski, snowboard, rock climb, ice climb, hike, mountain bike, road bike, walk, look at trees, study mushrooms (yes, really, Mycology was one of my primary studies in college), collect medicinal herbs, garden, and many things I&#39;m probably leaving out. We LOVE the outdoors. However, while my youngest would drop anything in a heartbeat to accompany me outside, my oldest would much rather stay inside and continue with what she is doing. So, while all I ever hoped for, dreamed of, and imagined for my kids was to experience a life outside, touching, tasting, getting muddy, etc. I rapidly discovered that this was not going to be my reality, at least with my oldest. While I would agree that TV<br/>\n cannot replace the real world, I think that it is worth looking at TV as a valuable asset when it comes to entertainment and learning...and sometimes just simple relaxing. <br/>\n<br/>\n<br/>\n<br/>\n&gt;&gt;I  would be much more open to letting the TV be on with no limits  <br/>\n<br/>\n&gt; after 6-7.&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\nYour kids are young.  Nothing magically occurs between the ages of 5 and 6 that would make a sudden release of TV limits important.  How would this work, anyway?  Would you suddenly start allowing your 6 or 7 year old watch TV with no limits, while continuing to limit the TV time of your youngest? Would you wait until your youngest was 6 or 7? How do you think the transition would be taken by your kids?  I imagine that what would happen would be exactly what you were hoping wouldn&#39;t...meaning, if your kids lived their lives with limited TV, and suddenly that limit disappeared, they are going to want to watch a LOT of TV for a while, because it was doled out in limited quantities before.  Is that what you would want to see?  <br/>\n<br/>\n<br/>\n<br/>\nSpeaking from my own experience, the TV is just another thing that is available. It&#39;s not a sought after commodity, it&#39;s not a babysitter, my kids are not drones that sit blank-faced in front of it for hours at a time. It&#39;s there if they feel like watching it, it&#39;s there if they don&#39;t. My kids are thriving, healthy, imaginative, and playful.  And yes, my oldest does get outside from time to time. ;)<br/>\n<br/>\n<br/>\n<br/>\nKristi Beguin<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      __________________________________________________________________<br/>\nLooking for the perfect gift? Give the gift of Flickr! <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.flickr.com/gift/\">http://www.flickr.com/gift/</a><br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264125582","msgId":49877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxOTA4My45OTAyMy5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDhGNkMwMEZBLTJFM0QtNEQ5OS1CMjZBLTQ1MDFEMjQ0RDU0M0BnbWFpbC5jb20+","referencesHeader":"PGhqYWwwNStuMzhrQGVHcm91cHMuY29tPiA8QTYxNTIxMUMtNjcyOC00QkZGLThFMDctRkU3NzI4NzYxRjRBQFNhbmRyYWRvZGQuY29tPiA8OTg2ODc3LjIyOTEwLnFtQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4gPDc0Nzc2NzU3LUI1MkMtNEM2RS1COEMyLTkwNDU4RERDNTMzMUBjb21jYXN0Lm5ldD4gPDhGNkMwMEZBLTJFM0QtNEQ5OS1CMjZBLTQ1MDFEMjQ0RDU0M0BnbWFpbC5jb20+"},"prevInTopic":49876,"nextInTopic":49882,"prevInTime":49876,"nextInTime":49878,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"Brian is great. One of the great things about Brian is that he trusts the kids. He is way more trusting than I am when it comes to the kids abilities to do","messageBody":"<div id=\"ygrps-yiv-1579871660\">Brian is great. One of the great things about Brian is that he trusts the kids. He is way more trusting than I am when it comes to the kids abilities to do chores. He also does not expect them to do it just like he does or perfectly.<br/>\nI have to hold the urge to go and help them , or finish up for them if its not exactly the way I would have done it.<br/>\nIts a good thing he is like that.eq<br/>\nThey way he is with them makes my kids feel very capable.<br/>\nI tend to take over sometimes.<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":342163414,"authorName":"Chris Sanders","from":"Chris Sanders &lt;iowaunschoolers@...&gt;","profile":"iaunschoolers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264124484","msgId":49876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGNkMwMEZBLTJFM0QtNEQ5OS1CMjZBLTQ1MDFEMjQ0RDU0M0BnbWFpbC5jb20+","inReplyToHeader":"PDc0Nzc2NzU3LUI1MkMtNEM2RS1COEMyLTkwNDU4RERDNTMzMUBjb21jYXN0Lm5ldD4=","referencesHeader":"PGhqYWwwNStuMzhrQGVHcm91cHMuY29tPiA8QTYxNTIxMUMtNjcyOC00QkZGLThFMDctRkU3NzI4NzYxRjRBQFNhbmRyYWRvZGQuY29tPiA8OTg2ODc3LjIyOTEwLnFtQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4gPDc0Nzc2NzU3LUI1MkMtNEM2RS1COEMyLTkwNDU4RERDNTMzMUBjb21jYXN0Lm5ldD4="},"prevInTopic":49875,"nextInTopic":49877,"prevInTime":49875,"nextInTime":49877,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... Oh! I hadn t seen that!  What a happy girl!  And I love how her Daddy got down on her eye level and talked to her about feeding the other cow.  So gently. ","messageBody":"<div id=\"ygrps-yiv-1433587439\"><blockquote><span title=\"ireply\">&gt; &gt; Here is she at righ after she turned 2 giving hay to the cows:<br/>\n&gt; &gt;<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=tZIM4ToaZOY\">http://www.youtube.com/watch?v=tZIM4ToaZOY</a><br/>\n&gt; &gt;<br/>\n&gt; I loved this video of Gigi the first time I saw it (a year ago?). I<br/>\n&gt; just smile through the entire thing!<br/>\n<br/>\n<br/>\n </span></blockquote>Oh! I hadn&#39;t seen that!  What a happy girl!  And I love how her Daddy  <br/>\ngot down on her eye level and talked to her about feeding the other  <br/>\ncow.  So gently.<br/>\n<br/>\nChris<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/tZIM4ToaZOY?wmode=opaque","type":"VIDEO"}]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264123363","msgId":49875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxODQ4MS45NzU4OS5xbUB3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDc0Nzc2NzU3LUI1MkMtNEM2RS1COEMyLTkwNDU4RERDNTMzMUBjb21jYXN0Lm5ldD4=","referencesHeader":"PGhqYWwwNStuMzhrQGVHcm91cHMuY29tPiA8QTYxNTIxMUMtNjcyOC00QkZGLThFMDctRkU3NzI4NzYxRjRBQFNhbmRyYWRvZGQuY29tPiA8OTg2ODc3LjIyOTEwLnFtQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4gPDc0Nzc2NzU3LUI1MkMtNEM2RS1COEMyLTkwNDU4RERDNTMzMUBjb21jYXN0Lm5ldD4="},"prevInTopic":49874,"nextInTopic":49876,"prevInTime":49874,"nextInTime":49876,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"It will be two years we made that video this February!. She is such a big girl now! She knows so much about the cows its amazing. She is a little famer girl!","messageBody":"<div id=\"ygrps-yiv-714697141\">It will be two years we made that video this February!. She is such a big girl now!<br/>\nShe knows so much about the cows its amazing. She is a little famer girl!<br/>\n <br/>\nAlex <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Robin Bentley &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:robin.bentley@...\">robin.bentley@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Thu, January 21, 2010 7:19:47 PM<br/>\nSubject: Re: [AlwaysLearning] Re: Interesting TV question<br/>\n<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; Here is she at righ after she turned 2 giving hay to the cows:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube\">http://www.youtube</a> com/watch? v=tZIM4ToaZOY<br/>\n&gt;<br/>\n </span></blockquote>I loved this video of Gigi the first time I saw it (a year ago?). I <br/>\njust smile through the entire thing!<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264123187","msgId":49874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0Nzc2NzU3LUI1MkMtNEM2RS1COEMyLTkwNDU4RERDNTMzMUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDk4Njg3Ny4yMjkxMC5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PGhqYWwwNStuMzhrQGVHcm91cHMuY29tPiA8QTYxNTIxMUMtNjcyOC00QkZGLThFMDctRkU3NzI4NzYxRjRBQFNhbmRyYWRvZGQuY29tPiA8OTg2ODc3LjIyOTEwLnFtQHdlYjgxNTAzLm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":49871,"nextInTopic":49875,"prevInTime":49873,"nextInTime":49875,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... I loved this video of Gigi the first time I saw it (a year ago?). I just smile through the entire thing! Robin B.","messageBody":"<div id=\"ygrps-yiv-1751560165\"><blockquote><span title=\"ireply\">&gt; Here is she at righ after she turned 2 giving hay to the cows:<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=tZIM4ToaZOY\">http://www.youtube.com/watch?v=tZIM4ToaZOY</a><br/>\n&gt;<br/>\n </span></blockquote>I loved this video of Gigi the first time I saw it (a year ago?). I  <br/>\njust smile through the entire thing!<br/>\n<br/>\nRobin B.</div>","specialLinks":[{"url":"http://www.youtube.com/embed/tZIM4ToaZOY?wmode=opaque","type":"VIDEO"}]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264118163","msgId":49871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4Njg3Ny4yMjkxMC5xbUB3ZWI4MTUwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PEE2MTUyMTFDLTY3MjgtNEJGRi04RTA3LUZFNzcyODc2MUY0QUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhqYWwwNStuMzhrQGVHcm91cHMuY29tPiA8QTYxNTIxMUMtNjcyOC00QkZGLThFMDctRkU3NzI4NzYxRjRBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":49869,"nextInTopic":49874,"prevInTime":49870,"nextInTime":49872,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":" My kids are young My son MD is 7 and Gigi will be 4 this Sunday They grew up with unlimited TV We live in MN so its usually too cold in the winter to be","messageBody":"<div id=\"ygrps-yiv-312640436\"> My kids are young My son MD is 7 and Gigi will be 4 this Sunday<br/>\nThey grew up with unlimited TV<br/>\nWe live in MN so its usually too cold in the winter to be playing outside We had a strech of day this winter where the temperature never made above 0 degrees and that is in Farenheit!!<br/>\n Then it got warmer about 30 degrees and my husband took Gigi to go do chores in the evening in our Dairy Farm<br/>\nShe was so happy.<br/>\nShe came in saying that chores are her favorite thing in the whole world.<br/>\nShe spends up to 8 hours a day in the Summer doing chores with her dad.<br/>\nShe will drop TV anytime for going outside and doing chores, or playing.<br/>\nTV has no hold on her. SHe is watching a lot today. Its icky outside and I have been in the computer  a lot plus she got 3 DVD&#39;s in the library yesterday. <br/>\nHere is she at righ after she turned 2 giving hay to the cows:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=tZIM4ToaZOY\">http://www.youtube.com/watch?v=tZIM4ToaZOY</a><br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Thu, January 21, 2010 5:40:12 PM<br/>\nSubject: Re: [AlwaysLearning] Re: Interesting TV question<br/>\n<br/>\n  <br/>\n-=-Speaking from my own experience, the TV is just another thing that <br/>\nis available. It&#39;s not a sought after commodity, it&#39;s not a <br/>\nbabysitter, my kids are not drones that sit blank-faced in front of it <br/>\nfor hours at a time. It&#39;s there if they feel like watching it, it&#39;s <br/>\nthere if they don&#39;t. My kids are thriving, healthy, imaginative, and <br/>\nplayful. And yes, my oldest does get outside from time to time. ;)-=-<br/>\n<br/>\nMarty and I watched an hour of TV together the other night. I had <br/>\nwanted to watch House, but 24 was on. Out of sympathy, maybe, he sat <br/>\nwith me through two sitcoms I don&#39;t usually watch.<br/>\n<br/>\nWe were sitting in the den, with a fire, each of us with a laptop, <br/>\nwatching two half-hour shows together. Then Holly took his place for <br/>\nthe two I usually do watch, Two and a Half Men and The Big Bang <br/>\nTheory. I got up during commercials to feed the fire in the hot tub <br/>\nstove. When the second show was over, Holly turned it off. I might <br/>\nwatch Emma on Sunday night. Other than that, I have no television <br/>\nplans. Holly might watch Emma with me. I haven&#39;t asked her yet, but <br/>\nI figure she might.<br/>\n<br/>\nLast night Holly went to a poetry reading at a coffee shop. She could <br/>\nhave stayed home and watched TV.<br/>\n<br/>\nMarty&#39;s watching a TV series, while he does other things, and <br/>\nsometimes it&#39;s on and sometimes it isn&#39;t. He&#39;s watching Heroes, <br/>\nthrough the XBox, by Netflix.<br/>\n<br/>\nNone of this is reactionary, It&#39;s one choice from a vast array of <br/>\nchoices.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/tZIM4ToaZOY?wmode=opaque","type":"VIDEO"}]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264117212","msgId":49869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE2MTUyMTFDLTY3MjgtNEJGRi04RTA3LUZFNzcyODc2MUY0QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqYWwwNStuMzhrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqYWwwNStuMzhrQGVHcm91cHMuY29tPg=="},"prevInTopic":49866,"nextInTopic":49871,"prevInTime":49868,"nextInTime":49870,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"-=-Speaking from my own experience, the TV is just another thing that is available. It s not a sought after commodity, it s not a babysitter, my kids are not","messageBody":"<div id=\"ygrps-yiv-1982500054\">-=-Speaking from my own experience, the TV is just another thing that  <br/>\nis available. It&#39;s not a sought after commodity, it&#39;s not a  <br/>\nbabysitter, my kids are not drones that sit blank-faced in front of it  <br/>\nfor hours at a time. It&#39;s there if they feel like watching it, it&#39;s  <br/>\nthere if they don&#39;t. My kids are thriving, healthy, imaginative, and  <br/>\nplayful. And yes, my oldest does get outside from time to time. ;)-=-<br/>\n<br/>\nMarty and I watched an hour of TV together the other night.  I had  <br/>\nwanted to watch House, but 24 was on.  Out of sympathy, maybe, he sat  <br/>\nwith me through two sitcoms I don&#39;t usually watch.<br/>\n<br/>\nWe were sitting in the den, with a fire, each of us with a laptop,  <br/>\nwatching two half-hour shows together.  Then Holly took his place for  <br/>\nthe two I usually do watch, Two and a Half Men and The Big Bang  <br/>\nTheory.  I got up during commercials to feed the fire in the hot tub  <br/>\nstove.  When the second show was over, Holly turned it off.   I might  <br/>\nwatch Emma on Sunday night.  Other than that, I have no television  <br/>\nplans.  Holly might watch Emma with me.  I haven&#39;t asked her yet, but  <br/>\nI figure she might.<br/>\n<br/>\nLast night Holly went to a poetry reading at a coffee shop.  She could  <br/>\nhave stayed home and watched TV.<br/>\n<br/>\nMarty&#39;s watching a TV series, while he does other things, and  <br/>\nsometimes it&#39;s on and sometimes it isn&#39;t.  He&#39;s watching Heroes,  <br/>\nthrough the XBox, by Netflix.<br/>\n<br/>\nNone of this is reactionary,  It&#39;s one choice from a vast array of  <br/>\nchoices.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240358028,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;foehn_jye@...&gt;","profile":"foehn_jye","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Interesting TV question","postDate":"1264113477","msgId":49866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYWwwNStuMzhrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENGMTdDOTQ1LTQ5NzktNDE2OS1CRDcyLUY4QzE2MTkxNjE2MEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":49864,"nextInTopic":49869,"prevInTime":49865,"nextInTime":49867,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... If you identify yourself as a potential unschooler, work from that starting place.  Don t expect to understand everything right away, and question the","messageBody":"<div id=\"ygrps-yiv-849397062\"><blockquote><span title=\"ireply\">&gt;&gt; I think of myself as someone who would probably be good at unschooling. I feel I&#39;m an intuitive person and have been practicing attachment parenting with my two sons under 3 thus far.&lt;&lt;<br/>\n<br/>\n </span></blockquote>If you identify yourself as a potential unschooler, work from that starting place.  Don&#39;t expect to understand everything right away, and question the things that you&#39;ve read or been told. Take small steps and start working forward. Your children are young, not even school age, so you have time to really start learning about what it is and how it might look for your family. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;My only thing about the no limits on TV thing with unschooling is that I&#39;m not sure if the no limits thing is appropriate for kids under 7 or around that age.&lt;&lt;<br/>\n<br/>\n </span></blockquote>What is it that you are thinking &quot;no-limits&quot; means? I think so many people get hung up on this idea of no limits. But they don&#39;t explore what it really means to not limit something. It&#39;s as if this idea of life without limits invokes images of chaos--wild, mangy children running muddy-footed and sugar-mouthed through the house, jumping all over the furniture with the TV blaring in the background while the parents stand befuddled and fearful in the corner.  My kids (4 and 7) have no TV restrictions--they can watch what they want when they want, but the actuality is, the TV is on very little throughout the day. Some days more than others, some days not at all. Look at what your idea of no limits on the TV means, and think about how limits on the TV might look like, do these images match reality? Is fear getting in the way? How will either of these choices affect your children?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I am  a trained teacher as well. I went to Teacher&#39;s College only to find out that I didn&#39;t want to &quot;teach&quot; I just have a hard time getting the whole unschooling toddlers and under 7&#39;s. Coming from a bit of the  Waldorf philosophy, I&#39;m sure you&#39;ve read/heard that the body of a  child under 7 is still developing their organs, that TV raises  cortisol levels and that all that children do in this age group plays  a part in developing their organs, brains etc.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Did what you learned in Teacher&#39;s College discuss real scientific studies regarding this?  What were the results?  Do you have any real reason to believe what the Waldorf folks are claiming as fact? Are these facts real, or speculation? Everything a child under 7 does MUST have a part in developing their bodies, but do you really believe TV somehow has this real, debilitating impact?   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I just wonder, is it possible to continue attachment parenting/unschooling a child until 7 without TV? Is it possible to accept the fact that it MIGHT be better for at least really young kids to steer clear of TV? I worry from a health standpoint.&lt;&lt;<br/>\n<br/>\n </span></blockquote>First of all, I would suggest that if you choose to steer clear of TV, do so from a mindful and well though-out standpoint, and not one that stems from worry.  That said, I know an unschooling family that does not own a TV (gasp!). They have several computers, however, and can often be found watching movies together, or streaming shows, amongst other cool computer-y things.  Their kids are 10 and 7. The parents are highly attentive, very involved with their kids&#39; lives. These kids are not staying up all night at friends houses with their eyelids propped open (lol, Pam!) because TV is not worth more to these kids than their other interests. Maybe one day they will want a TV, maybe not.  I imagine that if they do one day want one, the parents would gladly accommodate this desire.   <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;So, do you see what I mean? I don&#39;t want to be totally Waldorfy in my home but something in my gut tells me that kids under a certain age should just be outside more, experiencing touch and taste and lots of other things that TV cannot be and will never be.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Since I seem to need to use personal stories today to get my viewpoint across, I&#39;ll add another one. :)  My husband and I are outdoors freaks. Literally. We have owned an outdoor retail store, bike shop, adventure guide service, etc. for years. We live in the mountain, we ski, snowboard, rock climb, ice climb, hike, mountain bike, road bike, walk, look at trees, study mushrooms (yes, really, Mycology was one of my primary studies in college), collect medicinal herbs, garden, and many things I&#39;m probably leaving out. We LOVE the outdoors. However, while my youngest would drop anything in a heartbeat to accompany me outside, my oldest would much rather stay inside and continue with what she is doing. So, while all I ever hoped for, dreamed of, and imagined for my kids was to experience a life outside, touching, tasting, getting muddy, etc. I rapidly discovered that this was not going to be my reality, at least with my oldest. While I would agree that TV cannot replace the real world, I think that it is worth looking at TV as a valuable asset when it comes to entertainment and learning...and sometimes just simple relaxing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I  would be much more open to letting the TV be on with no limits  <br/>\n&gt; after 6-7.&lt;&lt;<br/>\n<br/>\n </span></blockquote>Your kids are young.  Nothing magically occurs between the ages of 5 and 6 that would make a sudden release of TV limits important.  How would this work, anyway?  Would you suddenly start allowing your 6 or 7 year old watch TV with no limits, while continuing to limit the TV time of your youngest? Would you wait until your youngest was 6 or 7? How do you think the transition would be taken by your kids?  I imagine that what would happen would be exactly what you were hoping wouldn&#39;t...meaning, if your kids lived their lives with limited TV, and suddenly that limit disappeared, they are going to want to watch a LOT of TV for a while, because it was doled out in limited quantities before.  Is that what you would want to see?  <br/>\n<br/>\nSpeaking from my own experience, the TV is just another thing that is available. It&#39;s not a sought after commodity, it&#39;s not a babysitter, my kids are not drones that sit blank-faced in front of it for hours at a time. It&#39;s there if they feel like watching it, it&#39;s there if they don&#39;t. My kids are thriving, healthy, imaginative, and playful.  And yes, my oldest does get outside from time to time. ;)<br/>\n<br/>\nKristi Beguin</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Interesting TV question","postDate":"1264112513","msgId":49864,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwN0ZBRUMwLTYzRkItNDYzMi04QjYyLUYxQUFEQUY0QTZBQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqYWdnMCs2NzhmQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqYWdnMCs2NzhmQGVHcm91cHMuY29tPg=="},"prevInTopic":49857,"nextInTopic":49866,"prevInTime":49863,"nextInTime":49865,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"-=- ...especially the music, which is think is one of the best things about most of the TV we watch. -=-I remember hearing from a friend with kids in waldorf","messageBody":"<div id=\"ygrps-yiv-1412143735\">-=- ...especially the music, which is think is one of the best things  <br/>\nabout most of the TV we watch.<br/>\n<br/>\n-=-I remember hearing from a friend with kids in waldorf school a few  <br/>\nyears ago that the kids shouldn&#39;t even listen to recorded music at  <br/>\nhome until they are teens. As a musician, I thought this was one of  <br/>\nthe most ridiculous things I had ever heard.-=-<br/>\n<br/>\nI am SO with you about that!!<br/>\n<br/>\nA hundred years ago, or 500, if a kid was in a musical family, or  <br/>\nlived near a church or a pub, maybe music would be a part of everyday  <br/>\nlife but to have to make all of one&#39;s own music puts quite a limit on  <br/>\nit.  My mom&#39;s mom sang ballads, and songs from the radio, and I have  <br/>\nsome of that directly, but I&#39;m glad I have much more and different  <br/>\nstyles.<br/>\n<br/>\n-=I have long since come to believe that any philosophy that suggests  <br/>\nthat taking parts of the world and pretending they don&#39;t exist is good  <br/>\nfor kids (like the colour black or plastic or TV) is not something I  <br/>\nwant to put any faith in. Unschooling is about making the world as big  <br/>\nand full and rich as possible for my kids and TV and media is a huge  <br/>\npart of that.<br/>\n-=-<br/>\n<br/>\nSome families pine to be &quot;Little House on the Prairie&quot; families, or to  <br/>\nlive as though it were 1955.  I don&#39;t understand what magical  <br/>\nadvantage they hope to gain by it.  IF they were able to somehow fool  <br/>\ntheir children into believing they were living in a different century,  <br/>\nTHEN what!?  Parents with those fantasies should maybe join historical  <br/>\nre-creation groups, make costumes, immerse themselves in some  <br/>\nhistorical period, and still go home at the end of the weekend to the  <br/>\nreal, normal, modern world.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Interesting TV question","postDate":"1264108864","msgId":49856,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYWdnMCs2NzhmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZFMTkxRkVEQTdCOTREQUFBRDAwM0I4QUQ4QzZCMUQ0QFJvY2tldFNhdWNlMj4="},"prevInTopic":49854,"nextInTopic":49857,"prevInTime":49855,"nextInTime":49857,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"I can relate to having the anti-TV, waldorf, natural living voices in my head, telling me that my kids watching TV, using computers and other media is bad for","messageBody":"<div id=\"ygrps-yiv-2141459156\">I can relate to having the anti-TV, waldorf, natural living voices in my head, telling me that my kids watching TV, using computers and other media is bad for them. I have two kids, one is 9 and was very limited until last year. One is 19 months and has never had limits. What I can see so far is that my 9 y/o son has found some of his biggest passions (anime, gaming, comedy) since we have allowed screens. He has also become way more flexible, reasonable and less prone to explosions as a result of me honouring what he wants and chooses to do with his time rather than forcing my own beliefs and fears onto him. Screens were always a huge area we would battle over because he was never a child who accepted limits &quot;graciously&quot;, ie: compliantly.<br/>\n<br/>\nMy daughter, with no limits, LOVES to watch. She sings and dances along with her favorite shows and asks for them by name. She sometimes watches quietly, sometimes laughs and talks to the shows, sometimes gets frustrated or bored and figures out how to change the channel or use the mouse to change the show if we are not right there to help, which we usually are. This is a child who learned how to crawl at 4 months, walk at 9 and sign over 30 signs by age 1. Now she can &quot;count&quot; to 10 in order (she has remembered the number order, from books or shows, I am not sure where). She has an exceptional vocabulary for 19 months, including words in Bengali, her dad&#39;s first language from watching bengali nursery rhyme videos on you tube. She is very social and active and a delight to be around. I sometimes still worry about her watching &quot;too much&quot; but that is usually because I am feeling like I haven&#39;t offered her enough other engaging things, so when that comes up for me I bring her a book or engage her in some active play or draw with her or sit with her and snuggle and watch the show if she is really focused on that. My point is that, far from harming her, I think she has really benefitted from her early exposure to media. Including my husband&#39;s iphone, incidentally, which she uses to watch elmo videos, listen to music and have impromptu dance parties, play games (there are some great toddler game apps) and look at pictures (her favorite is the kitten stream on flickr). <br/>\n<br/>\nIf I had kept listening to the fear voices rather than the voices of experience I have found in the unschooling community, I would be missing out on something that gives both my kids so much joy. I also wouldn&#39;t know that Hannah Montana is actually really funny and that whoever writes Phineas and Ferb is brilliant. My daughter&#39;s favorite shows, Yo Gabba Gabba and Backyardigans are both also way better than the children&#39;s TV of my childhood, especially the music, which is think is one of the best things about most of the TV we watch. <br/>\n<br/>\n I remember hearing from a friend with kids in waldorf school a few years ago that the kids shouldn&#39;t even listen to recorded music at home until they are teens. As a musician, I thought this was one of the most ridiculous things I had ever heard. Apparently the idea was that the family should make music themselves, but come on, really? I have long since come to believe that any philosophy that suggests that taking parts of the world and pretending they don&#39;t exist is good for kids (like the colour black or plastic or TV) is not something I want to put any faith in. Unschooling is about making the world as big and full and rich as possible for my kids and TV and media is a huge part of that.  <br/>\n<br/>\n-Tammy</div>","specialLinks":[]},{"userId":156418579,"authorName":"dana_burdick","from":"&quot;dana_burdick&quot; &lt;DanaBurdick@...&gt;","profile":"dana_burdick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Interesting TV question","postDate":"1264108694","msgId":49854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqYWdhbStubW9uQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRDM0FGNjk0LUExODAtNEM4Ri1BRTEzLTYyNDNGREQ5RDNDN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49848,"nextInTopic":49856,"prevInTime":49853,"nextInTime":49855,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"Sandra Wrote: -=-Sometimes kids to sit quietly, mesmerized, thinking. Sometimes they dance and talk back to the screen (and with some kids shows they re ","messageBody":"<div id=\"ygrps-yiv-1352691793\">Sandra Wrote:<br/>\n-=-Sometimes kids to sit quietly, mesmerized, thinking. Sometimes they<br/>\ndance and talk back to the screen (and with some kids&#39; shows they&#39;re<br/>\ninvited to do so). Sometimes they get out paper and pencils and copy<br/>\nsomething that&#39;s being done.-=-<br/>\n<br/>\nI just learned of a local movie theatre around here (SF Bay Area) that has special show times for kids with autism and other disabilities.  The kids are allowed to stand and talk during the show if they want.  Since the expectation is set, no one is shushing the kids up.  I think it&#39;s a great idea, really.  It&#39;s just too bad that a kid has to have a disability to enjoy a show in a normal fashion.  I would have loved this when my kids were 4 and 5.<br/>\n<br/>\n-Dana</div>","specialLinks":[]},{"userId":193946716,"authorName":"Guillaume JAY","from":"Guillaume JAY &lt;gjay@...&gt;","profile":"gaegui","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Interesting TV question","postDate":"1264107003","msgId":49857,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwNzUwMTg5MTAuMTkxNDIzMTI2NDEwNzAwMzk3NS5KYXZhTWFpbC5yb290QHNwb29sZXIxMC1nMjcucHJpdi5wcm94YWQubmV0Pg==","inReplyToHeader":"PDE5RUVDMzQyLTRDM0ItNERGOC1BM0E3LUNDNEY2MkYwRDkzQ0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49856,"nextInTopic":49864,"prevInTime":49856,"nextInTime":49858,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... -=-I think you just have to give him/her the text on Economics of TV ... I m a he. Guillaume ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1494912145\">----- &quot;Sandra Dodd&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; a écrit : <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>-=-I think you just have to give him/her the text on Economics of TV <br/>\n<blockquote><span title=\"ireply\"> &gt; (which, BTW, I asked you nearly a year ago about me doing a french <br/>\n&gt; translation, which I have done, but not proofed enough (for my taste) <br/>\n&gt; or made available yet - must do) -=- <br/>\n&gt; <br/>\n&gt; By that she means this: <br/>\n<br/>\n </span></blockquote>I&#39;m a he. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nGuillaume <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Interesting TV question","postDate":"1264104850","msgId":49848,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCMjZBQTc2LTI2Q0YtNDg0Qi1BQUNELTVFQzgzNjhDODlBNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENGMTdDOTQ1LTQ5NzktNDE2OS1CRDcyLUY4QzE2MTkxNjE2MEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PENGMTdDOTQ1LTQ5NzktNDE2OS1CRDcyLUY4QzE2MTkxNjE2MEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":49833,"nextInTopic":49854,"prevInTime":49847,"nextInTime":49849,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"-=-I ll answer tomorrow. I m going to sleep a while now.-=- I slept eleven hours.  That was quite a while. Then I read e-mail.  There were some great","messageBody":"<div id=\"ygrps-yiv-1001542909\">-=-I&#39;ll answer tomorrow. I&#39;m going to sleep a while now.-=-<br/>\n<br/>\nI slept eleven hours.  That was quite a while.<br/>\n<br/>\nThen I read e-mail.  There were some great responses.  Then I talked  <br/>\nto Holly, and Ashlee, and took care of pets.<br/>\n<br/>\nNow I&#39;m going to answer the questions.  I didn&#39;t really mean for it to  <br/>\ntake so long; sorry.<br/>\n<br/>\n-=-We go to a parent and child Waldorf group. We are not full-on  <br/>\nWaldorf. We have TV and computers and cell phones etc. My only thing  <br/>\nabout the no limits on TV thing with unschooling is that I&#39;m not sure  <br/>\nif the no limits thing is appropriate for kids under 7 or around that  <br/>\nage-=-<br/>\n<br/>\n&quot;Approprirate&quot; needs a context.  Appropriate to Waldorf beliefs?  No.   <br/>\nAppropriate to unschooling principles?  Yes.<br/>\nAppropriate to your family?  We can&#39;t say.<br/>\nBut if you declare yourself to want help to really, deeply unschool,  <br/>\nthen we can say more.<br/>\n<br/>\n-=- I went to Teacher&#39;s College only to find out that I didn&#39;t want to  <br/>\n&quot;teach&quot; I just have a hard time getting the whole unschooling toddlers  <br/>\nand under 7&#39;s.-=-<br/>\n<br/>\nToddlers wouldn&#39;t have been in school anyway.  So if a toddler is  <br/>\ntreated as the mother would have treated him without regard to whether  <br/>\nhe was going to school or not later, that might be a better thing to  <br/>\nthink than &quot;unschooling.&quot;  You&#39;ve mentioned attachment parenting.   If  <br/>\nyou mean the general idea of letting your child be a part of your  <br/>\nlife, then if you&#39;re watching TV, there it will be.  If you mean the  <br/>\nrecent incarnation of attachment parenting which seems to think that  <br/>\nMickey Mouse is the devil (or any sheets or pajamas with &quot;corporate  <br/>\nimages&quot; on them will ruin sleep and future happiness), I can&#39;t say  <br/>\nexcept that I think it&#39;s fad and fashion more than science or natural,  <br/>\nplain logic.<br/>\n<br/>\n-= Coming from a bit of the Waldorf philosophy, I&#39;m sure you&#39;ve read/ <br/>\nheard that the body of a child under 7 is still developing their  <br/>\norgans-=-<br/>\n<br/>\nI hadn&#39;t heard it, but don&#39;t you think that children were still  <br/>\ndeveloping before Rudolf Steiner was ever born?  Sixteen year olds are  <br/>\nstill developing, too.<br/>\n<br/>\n-=-. You mention Piaget in your book and I know Steiner refers to him  <br/>\nalot-=-<br/>\n<br/>\nYes....    And?<br/>\nFor one thing, Iike Piaget, but my kids were also very verbal,  <br/>\nanalytical kids, so his stages match my kids fine.  As he didn&#39;t study  <br/>\na scientific sample of kids but was writing about his observations of  <br/>\nhis own biological children, it&#39;s just what it is. Others have  <br/>\nsuggested I drop Piaget in favor of Erikson:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Erikson&#39;s_stages_of_psychosocial_development\">http://en.wikipedia.org/wiki/Erikson&#39;s_stages_of_psychosocial_development</a><br/>\nI read Erikson in college too.  I liked Piaget.  I don&#39;t know why.  It  <br/>\ndoesn&#39;t matter much.  Both have just drawn up charts and graphs which  <br/>\npeople either fit or don&#39;t.   The best part about either of them is  <br/>\nhelping parents and teachers not expect things of younger children of  <br/>\nwhich they&#39;re entirely incapable.<br/>\n<br/>\nBut the other more important thing is that while Piaget&#39;s children  <br/>\nwere growing up, there was no such thing as TV.  I don&#39;t know whether  <br/>\nhe let them listen to the radio. &lt;g&gt;<br/>\n<br/>\nSteiner also refers to Jung, I think.  I love Jung&#39;s stuff!  But that  <br/>\ndoesn&#39;t mean I want to marry him.  He&#39;s not my role model.  I don&#39;t  <br/>\nwant to BE Jung, but I do enjoy the heck out of his theories about  <br/>\nfairy tales and archetypes!  There are some Rolling Stones songs I  <br/>\nlike a whole lot, too, but it doesn&#39;t mean I want to model my whole  <br/>\nlife on Bill Wyman&#39;s or Mick Jagger&#39;s<br/>\n<br/>\nMy very favorite part of the original post is this:  &quot;is learning more  <br/>\nimportant than health?&quot;<br/>\n<br/>\n-=-I&#39;m not doubting that my child has learned from TV nor do I doubt  <br/>\nthat he can continue learn from TV at the age of 3 but is it HEALTHY?  <br/>\nI just wonder....is learning more important than health? -=-<br/>\n<br/>\nIf those were the only two choices, I think I would choose health.   <br/>\nBut it&#39;s a false dichotomy.<br/>\nFor humans, learning is part of natural, normal life.   Without  <br/>\nlearning, I don&#39;t think a person could be emotionally healthy.  I  <br/>\ndon&#39;t think physical health is more important than emotional health.<br/>\n<br/>\nBut as to all the weird EMF theories and the threats and promises  <br/>\nabout damage or advantage to children&#39;s growth, it does kind of remind  <br/>\nme of wearing an aluminum foil helmet to keep the government from  <br/>\nreading your thoughts, or to keep aliens from putting ideas into your  <br/>\nhead, or whatever it is.<br/>\n<br/>\nPerhaps it will be shown that living around electrical fields caused  <br/>\nserious problems, or blood diseases, or something.  I know someone who  <br/>\nset her whole house up so that she can turn off the electricity while  <br/>\nshe sleeps.  She became so afraid of electrical fields that she  <br/>\nstopped visiting some other places, can&#39;t stay in a hotel, and hardly  <br/>\nleaves her house.   For her, that&#39;s a choice.  She has no children.   <br/>\nHer husband still goes out and visits without her, but I think he was  <br/>\nhappier when she would still go.  We were in a singing group  <br/>\ntogether.  She used to be fun.<br/>\n<br/>\nI don&#39;t think that isolating herself from the world is healthier than  <br/>\nknowingly risking exposure to something that might possibly eventually  <br/>\nprove to have been disadvantageous.<br/>\n<br/>\n-=-So, do you see what I mean? I don&#39;t want to be totally Waldorfy in  <br/>\nmy home but something in my gut tells me that kids under a certain age  <br/>\nshould just be outside more, experiencing touch and taste and lots of  <br/>\nother things that TV cannot be and will never be-=-<br/>\n<br/>\nTV didn&#39;t keep my kids from being outside.  My mother said MANY times  <br/>\n&quot;Get your nose out of that book and go outside and play.&quot;  That wasn&#39;t  <br/>\nfun for me.  Being ordered out of the house to be in the sunshine  <br/>\nseemed like a punishment for being bookish when my mother was not.    <br/>\nShe wasn&#39;t going outside with us.  She was staying inside, but we were  <br/>\nsent out.<br/>\n<br/>\nWhen a family is playful and together, kids will be outside as much as  <br/>\nthe parents make it inviting and fun and a great shared adventure!    <br/>\nKids will be more likely to play outside happily if its their idea, if  <br/>\nthere are very cool things to do outside in the yard, or if the  <br/>\nparents take them to parks, or picnics, or hikes or camping.   To have  <br/>\na child in a house, and to tell him to go outside instead of watching  <br/>\nTV is not great. It&#39;s not togetherness.<br/>\n<br/>\n-=- I  would be much more open to letting the TV be on with no limits  <br/>\nafter 6-7. At least at this point. Am I alone on this one?  HELP! -=-<br/>\n<br/>\nYou&#39;re not alone in the world.  You&#39;re probably not even alone within  <br/>\nunschooling.  There are unschoolers who want to live without  <br/>\ntelevision, and unschoolers who have all kinds of rules about bedtime  <br/>\nand food.  They&#39;re out there, but they&#39;re not usually in here.<br/>\n<br/>\nIf you (the original writer who is &quot;anonymous&quot; on this list) decide  <br/>\nyou want to keep the limits, there are probably people here who can  <br/>\ndirect you to other unschoolers who would agree with you and tell you  <br/>\nwe were all irresponsible bad parents.  That wouldn&#39;t hurt my  <br/>\nfeelings, if you went with that group for support.  My kids are grown  <br/>\nand happy.  It won&#39;t hurt me.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Interesting TV question","postDate":"1264094837","msgId":49833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDM0FGNjk0LUExODAtNEM4Ri1BRTEzLTYyNDNGREQ5RDNDN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIyMDI5LjU2NjM0LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PENGMTdDOTQ1LTQ5NzktNDE2OS1CRDcyLUY4QzE2MTkxNjE2MEBTYW5kcmFEb2RkLmNvbT4gPDIyMDI5LjU2NjM0LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":49832,"nextInTopic":49848,"prevInTime":49832,"nextInTime":49834,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"-=-it is one small piece of the bigger fear picture you ve built for yourself.-=- I think it came pre-built and is being sold.  For money.   Promising magical","messageBody":"<div id=\"ygrps-yiv-1208523226\">-=-it is one small piece of the bigger fear picture you&#39;ve built for  <br/>\nyourself.-=-<br/>\n<br/>\nI think it came pre-built and is being sold.  For money.   Promising  <br/>\nmagical results and instant friends.<br/>\n<br/>\nChildren need arousal to learn.  Too much excitement can keep learning  <br/>\nfrom happening (if it&#39;s at the edge of giddy fear or fright) but too  <br/>\nlittle also keeps learning from happening.  If the mind is too still,  <br/>\nnothing can swirl.   School generally keeps kids at the too-still  <br/>\nlevel so that nearby classrooms can also keep their kids at a too- <br/>\nstill level.  Any teacher who whoops the kids up into a learning  <br/>\nfrenzy will be asked by other teachers and the principal to tone it  <br/>\ndown, keep the kids in their chairs.<br/>\n<br/>\nYears ago one of the coolest anti-TV arguments *ever* was lost in this  <br/>\nway (and I totally wish I had kept some of those early AOL exchanges  <br/>\nto have on my site).<br/>\n<br/>\nOne mom (conservative homeschooler) said she didn&#39;t like her kids to  <br/>\nwatch TV because they were too passive.<br/>\n<br/>\nI said my kids aren&#39;t passive, that lately they had been watching The  <br/>\nSound of Music and jumping up and singing and dancing.<br/>\n<br/>\nThe first mom, in a stunning rhetorical fumble, said that when HER  <br/>\nfamily watched television, they required their children to sit quietly  <br/>\nso that others could enjoy the show.<br/>\n<br/>\nTOUCHDOWN!!!   Woohooo for the pay-attention-to-children team!  She  <br/>\nhanded us the trophy.<br/>\n<br/>\nSometimes kids to sit quietly, mesmerized, thinking.  Sometimes they  <br/>\ndance and talk back to the screen (and with some kids&#39; shows they&#39;re  <br/>\ninvited to do so).  Sometimes they get out paper and pencils and copy  <br/>\nsomething that&#39;s being done.<br/>\n<br/>\nMy niece, who&#39;s 25 now, used to watch a drawing program on the  <br/>\neducational network with a host called Mark Kistler, called  <br/>\nImagination Station.  He showed them to draw with perspective and all  <br/>\nkinds of tricks, with just pencils!  She made a cardboard desk and had  <br/>\nher supplies in it, and she was young, seven, eight, but that formed a  <br/>\ngreat basis for her for future art, which she still does.<br/>\n<br/>\nWhen Holly was 12 or so, Mark Kistler was doing a week long session in  <br/>\nAlbuquerque (where he has relatives) and each child had to be  <br/>\naccompanied by an adult.  Holly had gone the year before with another  <br/>\nfamily and their dad.  I invited Gina to come to Albuquerque to be  <br/>\n&quot;Holly&#39;s adult.&quot;  I think Gina was sixteen or so.    Too old to  <br/>\nenroll, and not too young to be the accompanying adult.<br/>\n<br/>\nThey had fun there, but they were both surprised and dismayed that one  <br/>\nof the strongest messages outside the drawing was that TV is bad and  <br/>\nshould be avoided.  Without TV, Gina wouldn&#39;t have been there.  He  <br/>\nsaid the parents and children should spend their time drawing and not  <br/>\nwatching TV.  Both Gina and Holly were able to do both.  I think there  <br/>\nwas a promise or oath or agreement at some point in there that they  <br/>\nwould promise not to watch TV for the week of the drawing workshops,  <br/>\nand neither Gina nor Holly would promise, nor would they fib and  <br/>\npretend.<br/>\n<br/>\nThose unschooled kids... they can stand up to &quot;experts,&quot; especially  <br/>\nwhen the experts are spouting illogical nonsense.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Interesting TV question","postDate":"1264094155","msgId":49832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5RUVDMzQyLTRDM0ItNERGOC1BM0E3LUNDNEY2MkYwRDkzQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDg5MjcxNjAwNy4xNzc4MDExMjY0MDcwNDAxODY3LkphdmFNYWlsLnJvb3RAc3Bvb2xlcjEwLWcyNy5wcml2LnByb3hhZC5uZXQ+","referencesHeader":"PDg5MjcxNjAwNy4xNzc4MDExMjY0MDcwNDAxODY3LkphdmFNYWlsLnJvb3RAc3Bvb2xlcjEwLWcyNy5wcml2LnByb3hhZC5uZXQ+"},"prevInTopic":49831,"nextInTopic":49833,"prevInTime":49831,"nextInTime":49833,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"-=-I think you just have to give him/her the text on Economics of TV (which, BTW, I asked you nearly a year ago about me doing a french translation, which I","messageBody":"<div id=\"ygrps-yiv-769959804\">-=-I think you just have to give him/her the text on Economics of TV  <br/>\n(which, BTW, I asked you nearly a year ago about me doing a french  <br/>\ntranslation, which I have done, but not proofed enough (for my taste)  <br/>\nor made available yet - must do) -=-<br/>\n<br/>\nBy that she means this:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/economics\">http://sandradodd.com/t/economics</a><br/>\n<br/>\nIt&#39;s an article by Pam Sorooshian who teaches economics at a college.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231930081,"authorName":"DJ250","from":"&quot;DJ250&quot; &lt;dj250@...&gt;","profile":"wibberbie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Interesting TV question","postDate":"1264085401","msgId":49831,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFMTkxRkVEQTdCOTREQUFBRDAwM0I4QUQ4QzZCMUQ0QFJvY2tldFNhdWNlMj4=","inReplyToHeader":"PDFGMDZFNThGLTY4OTctNDNGOC05MkY1LTQwMEZBQTMwMTNGREB2ZXJpem9uLm5ldD4=","referencesHeader":"PENGMTdDOTQ1LTQ5NzktNDE2OS1CRDcyLUY4QzE2MTkxNjE2MEBTYW5kcmFEb2RkLmNvbT4gPDFGMDZFNThGLTY4OTctNDNGOC05MkY1LTQwMEZBQTMwMTNGREB2ZXJpem9uLm5ldD4="},"prevInTopic":49830,"nextInTopic":49832,"prevInTime":49830,"nextInTime":49832,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"Just wanted to chime in, here, and say I used to be an avid Waldorfer!  The limits were placed on my children and I really hesitated letting those go when I","messageBody":"<div id=\"ygrps-yiv-1265852312\">Just wanted to chime in, here, and say I used to be an avid Waldorfer!  The limits were placed on my children and I really hesitated letting those go when I came to unschooling.  Having read all the Waldorf stuff, heard teachers, etc (we homeschooled with Waldorf), I was SURE I&#39;d see damage.  But, I haven&#39;t!!!  I was told their creativity would go out the window, they&#39;d only imitate the shows, lose brain cells, etc.  Nope, in fact, the opposite has happened.  A friend (long-time unschooler) told me people used to say the same thing about books--they&#39;ll rot your brain, be a waste of time, etc.  Now, we PUSH books!  She also said TV is a form of modern storytelling and I agree.  What a neat form we humans have created!<br/>\n<br/>\n~Melissa, in MD :)<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Joyce Fetteroll <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Thursday, January 21, 2010 8:31 AM<br/>\n  Subject: Re: [AlwaysLearning] Interesting TV question<br/>\n<br/>\n<br/>\n    <br/>\n<br/>\n  On Jan 20, 2010, at 11:49 PM, Sandra Dodd wrote:<br/>\n<br/>\n  &gt; I&#39;m not sure if the no<br/>\n  &gt; limits thing is appropriate for kids under 7 or around that age.<br/>\n<br/>\n  What knowledge, what personal experience, are you basing that theory on?<br/>\n<br/>\n  Is the &quot;knowledge&quot; personal experience or just other&#39;s theories?<br/>\n<br/>\n  What does this unhealthiness look like long term?<br/>\n<br/>\n  If there are actual unhealthy kids, have the been radically <br/>\n  unschooled? Or are there other factors at play that have caused this <br/>\n  &quot;unhealthiness&quot;?<br/>\n<br/>\n  I think it&#39;s natural, especially when it comes to our kids, to hear <br/>\n  &quot;That&#39;s bad for kids!&quot; and grab that like a life preserver. You don&#39;t <br/>\n  want to examine it too closely (for rot, for rusty nails -- for <br/>\n  necessity!) because it might be preserving your kids lives.<br/>\n<br/>\n  So it&#39;s much easier, much more soothing to build walls against <br/>\n  possible dangers than it is to examine them.<br/>\n<br/>\n  If freely chosen TV were unhealthy, then unschooled kids would be the <br/>\n  most unhealthy kids in the world ;-) (Or they&#39;re special and immune. <br/>\n  That&#39;s another possibility.)<br/>\n<br/>\n  So, what you&#39;re saying is -- without realizing it I assume! -- is <br/>\n  that Sandra&#39;s and my and dozens of other always unschooled kids *are* <br/>\n  unhealthy. And we either don&#39;t realize or don&#39;t care, that pushing <br/>\n  unschooling is way more important than our kids!<br/>\n<br/>\n  That&#39;s not said in an &quot;I am so insulted&quot; way. It&#39;s said as &quot;Does that <br/>\n  make sense?&quot; Waldorfers are saying it&#39;s unhealthy. But the kids that <br/>\n  should show the greatest damage -- radically unschooled kids -- <br/>\n  either aren&#39;t showing it or their parents are too dumb or uncaring to <br/>\n  notice.<br/>\n<br/>\n  Anyone who&#39;s on the list for a while will feel fairly confident that <br/>\n  dumb or uncaring doesn&#39;t fit ;-) (Some are accused of being mean to <br/>\n  new unschoolers but that&#39;s not the same ;-)<br/>\n<br/>\n  If anyone&#39;s been to a conference, I think they would have a hard time <br/>\n  seeing damage from TV. If radically unschooled kids are compared to <br/>\n  conventionally parented kids, I&#39;d say they are more polite, lively, <br/>\n  have greater ability to socialize without respect to age, have a <br/>\n  greater sense of self, have a depth and/or breadth of knowledge about <br/>\n  their passions.<br/>\n<br/>\n  So maybe that&#39;s what the Waldorfers are calling damage?<br/>\n<br/>\n  If the damage isn&#39;t apparent to a parent, if it takes an expert <br/>\n  trained in that specific damage to be able to tell it&#39;s there, does <br/>\n  the damage really exist? (Another question: are they making money <br/>\n  from you believing the damage exists?)<br/>\n<br/>\n  &gt; Like I wouldn&#39;t give my kid a cell<br/>\n  &gt; phone to play with bcs of all the EMF&#39;s it emits which children are<br/>\n  &gt; more affected by<br/>\n  &gt;<br/>\n<br/>\n  That&#39;s another thing to question. (Was the discussion of cell phones <br/>\n  here recently or Unschooling Basics?) I think it was pointed out that <br/>\n  the studies connecting EMFs and cancer came from police and other <br/>\n  emergency workers who had their phones on all the time right next to <br/>\n  their bodies.<br/>\n<br/>\n  Would a child&#39;s use of a cell phone come anywhere near that amount or <br/>\n  that nature of use? *Maybe* (speculating here) children&#39;s still <br/>\n  growing bodies might be more sensitive to EMFs, but *that* much more <br/>\n  sensitive? And do cell phones emit the same level of EMFs as the <br/>\n  phones in the emergency workers&#39; study? (I&#39;m not asking for answers. <br/>\n  Those are the kinds of questions someone should be asking.)<br/>\n<br/>\n  It&#39;s much much easier to fear and say no than to pick apart the fear <br/>\n  and decide if it has any foundation.<br/>\n<br/>\n  When a fear doesn&#39;t impact anyone other than yourself, it&#39;s not such <br/>\n  a big deal. You&#39;re deciding that the limit to you is easier than <br/>\n  digging to find out the truth. I tossed out my aluminum cookware <br/>\n  rather than dig into the scientific literature when a connection was <br/>\n  speculated with Alzheimer&#39;s. Since it was cheap, easier to toss than <br/>\n  dig. But, especially with the new smart phones with all the cool apps <br/>\n  on them, a choice to limit because of an unexamined fear, can narrow <br/>\n  a child&#39;s world. To the child it can feel like you&#39;re saying &quot;I care <br/>\n  more about my fears than I care about what you want.&quot; (And no amount <br/>\n  of words that explain that it&#39;s because you love him will change what <br/>\n  the actions are saying and feeling to him.)<br/>\n<br/>\n  That doesn&#39;t mean everyone should go out and buy an iPhone for their <br/>\n  child because some fool said no one can unschool unless their child <br/>\n  has a smart phone! It means that fears should be dragged out into the <br/>\n  light to examine them with a big magnifier when they become walls <br/>\n  between the child and the world they might like to explore.<br/>\n<br/>\n  Joyce<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n<br/>\n  No virus found in this incoming message.<br/>\n  Checked by AVG - www.avg.com <br/>\n  Version: 9.0.730 / Virus Database: 271.1.1/2636 - Release Date: 01/21/10 02:34:00<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Interesting TV question","postDate":"1264080703","msgId":49830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGMDZFNThGLTY4OTctNDNGOC05MkY1LTQwMEZBQTMwMTNGREB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENGMTdDOTQ1LTQ5NzktNDE2OS1CRDcyLUY4QzE2MTkxNjE2MEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PENGMTdDOTQ1LTQ5NzktNDE2OS1CRDcyLUY4QzE2MTkxNjE2MEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":49829,"nextInTopic":49831,"prevInTime":49829,"nextInTime":49831,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... What knowledge, what personal experience, are you basing that theory on? Is the knowledge personal experience or just other s theories? What does this","messageBody":"<div id=\"ygrps-yiv-872982815\">On Jan 20, 2010, at 11:49 PM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m not sure if the no<br/>\n&gt; limits thing is appropriate for kids under 7 or around that age.<br/>\n<br/>\n </span></blockquote>What knowledge, what personal experience, are you basing that theory on?<br/>\n<br/>\nIs the &quot;knowledge&quot; personal experience or just other&#39;s theories?<br/>\n<br/>\nWhat does this unhealthiness look like long term?<br/>\n<br/>\nIf there are actual unhealthy kids, have the been radically  <br/>\nunschooled? Or are there other factors at play that have caused this  <br/>\n&quot;unhealthiness&quot;?<br/>\n<br/>\nI think it&#39;s natural, especially when it comes to our kids, to hear  <br/>\n&quot;That&#39;s bad for kids!&quot; and grab that like a life preserver. You don&#39;t  <br/>\nwant to examine it too closely (for rot, for rusty nails -- for  <br/>\nnecessity!) because it might be preserving your kids lives.<br/>\n<br/>\nSo it&#39;s much easier, much more soothing to build walls against  <br/>\npossible dangers than it is to examine them.<br/>\n<br/>\nIf freely chosen TV were unhealthy, then unschooled kids would be the  <br/>\nmost unhealthy kids in the world ;-) (Or they&#39;re special and immune.  <br/>\nThat&#39;s another possibility.)<br/>\n<br/>\nSo, what you&#39;re saying is -- without realizing it I assume! -- is  <br/>\nthat Sandra&#39;s and my and dozens of other always unschooled kids *are*  <br/>\nunhealthy. And we either don&#39;t realize or don&#39;t care, that pushing  <br/>\nunschooling is way more important than our kids!<br/>\n<br/>\nThat&#39;s not said in an &quot;I am so insulted&quot; way. It&#39;s said as &quot;Does that  <br/>\nmake sense?&quot; Waldorfers are saying it&#39;s unhealthy. But the kids that  <br/>\nshould show the greatest damage -- radically unschooled kids --  <br/>\neither aren&#39;t showing it or their parents are too dumb or uncaring to  <br/>\nnotice.<br/>\n<br/>\nAnyone who&#39;s on the list for a while will feel fairly confident that  <br/>\ndumb or uncaring doesn&#39;t fit ;-) (Some are accused of being mean to  <br/>\nnew unschoolers but that&#39;s not the same ;-)<br/>\n<br/>\nIf anyone&#39;s been to a conference, I think they would have a hard time  <br/>\nseeing damage from TV. If radically unschooled kids are compared to  <br/>\nconventionally parented kids, I&#39;d say they are more polite, lively,  <br/>\nhave greater ability to socialize without respect to age, have a  <br/>\ngreater sense of self, have a depth and/or breadth of knowledge about  <br/>\ntheir passions.<br/>\n<br/>\nSo maybe that&#39;s what the Waldorfers are calling damage?<br/>\n<br/>\nIf the damage isn&#39;t apparent to a parent, if it takes an expert  <br/>\ntrained in that specific damage to be able to tell it&#39;s there, does  <br/>\nthe damage really exist? (Another question: are they making money  <br/>\nfrom you believing the damage exists?)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Like I wouldn&#39;t give my kid a cell<br/>\n&gt; phone to play with bcs of all the EMF&#39;s it emits which children are<br/>\n&gt; more affected by<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>That&#39;s another thing to question. (Was the discussion of cell phones  <br/>\nhere recently or Unschooling Basics?) I think it was pointed out that  <br/>\nthe studies connecting EMFs and cancer came from police and other  <br/>\nemergency workers who had their phones on all the time right next to  <br/>\ntheir bodies.<br/>\n<br/>\nWould a child&#39;s use of a cell phone come anywhere near that amount or  <br/>\nthat nature of use? *Maybe* (speculating here) children&#39;s still  <br/>\ngrowing bodies might be more sensitive to EMFs, but *that* much more  <br/>\nsensitive? And do cell phones emit the same level of EMFs as the  <br/>\nphones in the emergency workers&#39; study? (I&#39;m not asking for answers.  <br/>\nThose are the kinds of questions someone should be asking.)<br/>\n<br/>\nIt&#39;s much much easier to fear and say no than to pick apart the fear  <br/>\nand decide if it has any foundation.<br/>\n<br/>\nWhen a fear doesn&#39;t impact anyone other than yourself, it&#39;s not such  <br/>\na big deal. You&#39;re deciding that the limit to you is easier than  <br/>\ndigging to find out the truth. I tossed out my aluminum cookware  <br/>\nrather than dig into the scientific literature when a connection was  <br/>\nspeculated with Alzheimer&#39;s. Since it was cheap, easier to toss than  <br/>\ndig. But, especially with the new smart phones with all the cool apps  <br/>\non them, a choice to limit because of an unexamined fear, can narrow  <br/>\na child&#39;s world. To the child it can feel like you&#39;re saying &quot;I care  <br/>\nmore about my fears than I care about what you want.&quot; (And no amount  <br/>\nof words that explain that it&#39;s because you love him will change what  <br/>\nthe actions are saying and feeling to him.)<br/>\n<br/>\nThat doesn&#39;t mean everyone should go out and buy an iPhone for their  <br/>\nchild because some fool said no one can unschool unless their child  <br/>\nhas a smart phone! It means that fears should be dragged out into the  <br/>\nlight to examine them with a big magnifier when they become walls  <br/>\nbetween the child and the world they might like to explore.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Interesting TV question","postDate":"1264079809","msgId":49829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5NTU2Mi42NDA4MC5xbUB3ZWI1MzkwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":49828,"nextInTopic":49830,"prevInTime":49828,"nextInTime":49830,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"We did not start unschooling until my oldest ds was 4.  Before that we had a tv in the house, but highly restricted its use.  It caused much more contention","messageBody":"<div id=\"ygrps-yiv-1850665350\">We did not start unschooling until my oldest ds was 4.  Before that we had a tv in the house, but highly restricted its use.  It caused much more contention than joy.  If I was to do it again, I would not have had it in the house until I was ready to have it on when he asked.  It was the regulating that caused most of the problems.  When we did not have it around or plugged in, he did not miss it much.  But if it was visible he would ask and then would get upset if I said no.<br/>\n<br/>\nThat said, our experience now with the TV is not what I envisioned when I would not let them watch.  Eli likes it on much of the time, but rarely sits and just watches it.  He often plays in the same room, but not really watching.  He is very intense child, and I think he has learned to turn to the TV as a short break to help him get in control of his emotions.  For example, if he is building legos and gets frustrated, he will put his creation down and watch for a minute or two, then he can pick it up and start again a bit calmer.<br/>\n<br/>\nSamuel really does not like the TV all that much.  He rarely initiates watching and plays anywhere in the house.  He likes pretend play.  It is amazing when I listen, how his characters have traits from many of shows they watch.  He does not use everything from a single show or character, but mixes them to build his own unique personality.<br/>\n<br/>\nThey both take a lot of ideas from what they see, pause or turn off the program, and go do their own version of what they saw.  It gives them lots of jumping off points for their play.  They are exposed to lots of things we could not do otherwise.  They watch a large variety of shows, some cartoons and some reality TV (mythbusters, mail call, monster garage) and some documentaries.<br/>\n<br/>\nMy only real problem with the TV now is the the volume.  It tends to make the living room very loud.   It helps we don&#39;t have actual channels so everything can be paused or gotten back to later when things are a bit quieter.  Both boys are usually agreeable to turning it off when things get too loud.<br/>\n<br/>\nAs to health, I really cannot say.  I don&#39;t know there is any way to be certain that it is either benign or harmful.  I do know a good friend died when he fell off a swing.  Samuel had staples in his head after falling off the couch while just sitting on it.  I don&#39;t think you can protect your kids from everything out there that could possibly be dangerous.  I do think living joyfully together is the greatest gift your can give your children physically and spiritually.<br/>\n<br/>\n<br/>\nAmanda<br/>\nEli 8, Samuel 7<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Interesting TV question","postDate":"1264076098","msgId":49828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMDI5LjU2NjM0LnFtQHdlYjg2MjAyLm1haWwuaXJkLnlhaG9vLmNvbT4=","inReplyToHeader":"PENGMTdDOTQ1LTQ5NzktNDE2OS1CRDcyLUY4QzE2MTkxNjE2MEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PENGMTdDOTQ1LTQ5NzktNDE2OS1CRDcyLUY4QzE2MTkxNjE2MEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":49827,"nextInTopic":49829,"prevInTime":49827,"nextInTime":49829,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"TV raises cortisol levels, oh my! It sounds very lions and tigers and bears :). Cortisol often signals engagement. Cortisol rises when you wake, it mirrors","messageBody":"<div id=\"ygrps-yiv-442866954\">TV raises cortisol levels, oh my! It sounds very lions and tigers and bears :). Cortisol often signals engagement. Cortisol rises when you wake, it mirrors your active time of the day and tends to taper off when you are resting, relaxed. Constant high cortisol is bad, it signifies stress beyond what someone can cope with. But being engaged with television, being engaged with someone else, being engaged with play, all of those things raise cortisol in appropriate ways. <br/>\n<br/>\nThat might not help, it is one small piece of the bigger fear picture you&#39;ve built for yourself. It&#39;s easy enough to get another piece in to replace the higher cortisol levels fear. It feels like good parenting to go with the fear, to avoid the unknown risk. But so much of life is an unknown risk. In my experience it is better to be maybe not afraid, but aware of the known risks and to withhold judgement on the unknown ones. Television hasn&#39;t been among the riskier things we&#39;ve done, by a long shot. Television has prompted so much discovery and exploration and conversations and laughter and ideas, I can&#39;t even begin to think of television as an evil. Not that I didn&#39;t used to, not that it wasn&#39;t some hulking monster in the corner of the living room waiting to devour my small young son&#39;s mind and body when I was first parenting. I think it is such a huge weight, parenting. You feel so responsible for these little minds and bodies that you tend and care<br/>\n for and love that all risk seems too great. It is easy to believe that if it could possibly do harm, why even let it through the door. But what if it is something that brings joy to your child? What if it is something that brings laughter to your home? Why would you want to keep it out? Why would you want to damage your relationship with your child by not trusting the thing he enjoys to actually be something that is enjoyable and engaging? <br/>\n<br/>\n&quot;So, do you see what I mean? I don&#39;t want to be totally Waldorfy in my  <br/>\nhome but something in my gut tells me that kids under a certain age  <br/>\nshould just be outside more, experiencing touch and taste and lots of  <br/>\nother things that TV cannot be and will never be. In spaces that  <br/>\naren&#39;t as limiting as the living room or whatever room the TV might be  <br/>\nin.  I  would be much more open to letting the TV be on with no limits  <br/>\nafter 6-7. At least at this point. Am I alone on this one?  HELP! &quot;<br/>\n<br/>\nI can see where you are coming from, but I think you are warding off evil spirits with magical signs, a bit. You hope that by getting this first period right you will have made the rest safer for your child. But by not trusting him to make the little easy choices of childhood how on earth will you be able to trust him with the choices that you have so very little say over and that are so much bigger in comparison? And how will he trust you if you haven&#39;t been helping him to achieve his goals now? <br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Thursday, 21 January, 2010 4:49:18<br/>\nSubject: [AlwaysLearning] Interesting TV question<br/>\n<br/>\nGreetings to the group!  This question came by e-mail from someone not  <br/>\non this list.  As usual with such things, I&#39;m posting it as an  <br/>\ninteresting question and will copy the author anonymously.  If she  <br/>\nwants to join the list and read directly that&#39;s up to her.<br/>\n<br/>\nIf anyone here would like to respond, please do!  I&#39;ll forward the  <br/>\nresponses to the author.<br/>\n<br/>\nI&#39;ll answer tomorrow.  I&#39;m going to sleep a while now.<br/>\n<br/>\nSandra<br/>\n---------------------------------------------------------------<br/>\n<br/>\nHi Sandra,<br/>\n<br/>\nI just got your book and am so blown away. I think of myself as  <br/>\nsomeone who would probably be good at unschooling. I feel I&#39;m an  <br/>\nintuitive person and have been practicing attachment parenting with my  <br/>\ntwo sons under 3 thus far. I&#39;m sure you&#39;ve heard all the Waldorf stuff  <br/>\nso many times before that you  must sometimes want to gag but here goes:<br/>\n<br/>\nWe go to a parent and child Waldorf group. We are not full-on Waldorf.  <br/>\nWe have TV and computers and cell phones etc. My only thing about the  <br/>\nno limits on TV thing with unschooling is that I&#39;m not sure if the no  <br/>\nlimits thing is appropriate for kids under 7 or around that age. I am  <br/>\na trained teacher as well. I went to Teacher&#39;s College only to find  <br/>\nout that I didn&#39;t want to &quot;teach&quot; I just have a hard time getting the  <br/>\nwhole unschooling toddlers and under 7&#39;s. Coming from a bit of the  <br/>\nWaldorf philosophy, I&#39;m sure you&#39;ve read/heard that the body of a  <br/>\nchild under 7 is still developing their organs, that TV raises  <br/>\ncortisol levels and that all that children do in this age group plays  <br/>\na part in developing their organs, brains etc. You mention Piaget in  <br/>\nyour book and I know Steiner refers to him alot....I&#39;m not doubting  <br/>\nthat my child has learned from TV nor do I doubt that he can continue  <br/>\nlearn from TV at the age of 3 but is it HEALTHY? I just wonder....is  <br/>\nlearning more important than health?<br/>\n<br/>\nThis is not meant as a direct criticism of your book or ideas. I just  <br/>\nwonder, is it possible to continue attachment parenting/unschooling a  <br/>\nchild until 7 without TV? Is it possible to accept the fact that it  <br/>\nMIGHT be better for at least really young kids to steer clear of TV? I  <br/>\nworry from a health standpoint. Like I wouldn&#39;t give my kid a cell  <br/>\nphone to play with bcs of all the EMF&#39;s it emits which children are  <br/>\nmore affected by, but I also wouldn&#39;t whip mine out and play or talk  <br/>\non it in front of my child if I knew it was tempting. It&#39;s just not  <br/>\nsafe for kids to use cell phones... not wee ones anyway. I have those  <br/>\nweird EMF neutralizing stickers on my phone now but that&#39;s just an  <br/>\nexample of what I mean by keeping kids healthy.<br/>\n<br/>\nSo, do you see what I mean? I don&#39;t want to be totally Waldorfy in my  <br/>\nhome but something in my gut tells me that kids under a certain age  <br/>\nshould just be outside more, experiencing touch and taste and lots of  <br/>\nother things that TV cannot be and will never be. In spaces that  <br/>\naren&#39;t as limiting as the living room or whatever room the TV might be  <br/>\nin.  I  would be much more open to letting the TV be on with no limits  <br/>\nafter 6-7. At least at this point. Am I alone on this one?  HELP! <br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":193946716,"authorName":"Guillaume JAY","from":"Guillaume JAY &lt;gjay@...&gt;","profile":"gaegui","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Interesting TV question","postDate":"1264070402","msgId":49827,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5MjcxNjAwNy4xNzc4MDExMjY0MDcwNDAxODY3LkphdmFNYWlsLnJvb3RAc3Bvb2xlcjEwLWcyNy5wcml2LnByb3hhZC5uZXQ+","inReplyToHeader":"PDkyMjA0NTk4Ni4xNzczNDExMjY0MDY5NDIyNDk4LkphdmFNYWlsLnJvb3RAc3Bvb2xlcjEwLWcyNy5wcml2LnByb3hhZC5uZXQ+"},"prevInTopic":49825,"nextInTopic":49828,"prevInTime":49826,"nextInTime":49828,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"... I think you just have to give him/her the text on Economics of TV (which, BTW, I asked you nearly a year ago about me doing a french translation, which I","messageBody":"<div id=\"ygrps-yiv-201649397\"><blockquote><span title=\"ireply\">&gt; So, do you see what I mean? I don&#39;t want to be totally Waldorfy in my <br/>\n&gt; home but something in my gut tells me that kids under a certain age <br/>\n&gt; should just be outside more, experiencing touch and taste and lots of <br/>\n&gt; other things that TV cannot be and will never be. In spaces that <br/>\n<br/>\n </span></blockquote>I think you just have to give him/her the text on Economics of TV (which, BTW, I asked you nearly a year ago about me doing a french translation, which I have done, but not proofed enough (for my taste) or made available yet - must do) <br/>\n<br/>\nIn my personal experience, my kids ( 4.7/5.8) watch a lot of tv if : <br/>\n<br/>\n- there is a new thing available which they enjoy a lot, and want to watch it again and again <br/>\n<br/>\n<br/>\n- they&#39;re bored and don&#39;t have anything else/more interesting to do : <br/>\n<br/>\n- bad weather <br/>\n<br/>\n- no parental support to suggest/participate in activities (games, craft, and so on) <br/>\n<br/>\n- no friends to play with <br/>\n<br/>\n<br/>\n- they&#39;re a bit sick, tired, or sad. <br/>\n<br/>\n<br/>\nAs for Waldorf, I don&#39;t know what it is. It seems that it&#39;s what we call Steiner in France, but I do not believe that Steiner schooling means no TV/Computer. <br/>\n<br/>\nAnyway, I think unschooled kids are already enough &quot;out of &#39;normal&#39; society&quot; that we should not make them even more different by restricting things every kids have access to. <br/>\n<br/>\n(even if on the other hand, the sentence &quot;you can&#39;t unschool without TV&quot; just seems weird (wrong ?) to me) <br/>\n<br/>\nGuillauùe <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Interesting TV question","postDate":"1264049358","msgId":49825,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENGMTdDOTQ1LTQ5NzktNDE2OS1CRDcyLUY4QzE2MTkxNjE2MEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":49827,"prevInTime":49824,"nextInTime":49826,"topicId":49825,"numMessagesInTopic":0,"msgSnippet":"Greetings to the group!  This question came by e-mail from someone not on this list.  As usual with such things, I m posting it as an interesting question and","messageBody":"<div id=\"ygrps-yiv-86555215\">Greetings to the group!  This question came by e-mail from someone not  <br/>\non this list.  As usual with such things, I&#39;m posting it as an  <br/>\ninteresting question and will copy the author anonymously.  If she  <br/>\nwants to join the list and read directly that&#39;s up to her.<br/>\n<br/>\nIf anyone here would like to respond, please do!  I&#39;ll forward the  <br/>\nresponses to the author.<br/>\n<br/>\nI&#39;ll answer tomorrow.  I&#39;m going to sleep a while now.<br/>\n<br/>\nSandra<br/>\n---------------------------------------------------------------<br/>\n<br/>\nHi Sandra,<br/>\n<br/>\nI just got your book and am so blown away. I think of myself as  <br/>\nsomeone who would probably be good at unschooling. I feel I&#39;m an  <br/>\nintuitive person and have been practicing attachment parenting with my  <br/>\ntwo sons under 3 thus far. I&#39;m sure you&#39;ve heard all the Waldorf stuff  <br/>\nso many times before that you  must sometimes want to gag but here goes:<br/>\n<br/>\nWe go to a parent and child Waldorf group. We are not full-on Waldorf.  <br/>\nWe have TV and computers and cell phones etc. My only thing about the  <br/>\nno limits on TV thing with unschooling is that I&#39;m not sure if the no  <br/>\nlimits thing is appropriate for kids under 7 or around that age. I am  <br/>\na trained teacher as well. I went to Teacher&#39;s College only to find  <br/>\nout that I didn&#39;t want to &quot;teach&quot; I just have a hard time getting the  <br/>\nwhole unschooling toddlers and under 7&#39;s. Coming from a bit of the  <br/>\nWaldorf philosophy, I&#39;m sure you&#39;ve read/heard that the body of a  <br/>\nchild under 7 is still developing their organs, that TV raises  <br/>\ncortisol levels and that all that children do in this age group plays  <br/>\na part in developing their organs, brains etc. You mention Piaget in  <br/>\nyour book and I know Steiner refers to him alot....I&#39;m not doubting  <br/>\nthat my child has learned from TV nor do I doubt that he can continue  <br/>\nlearn from TV at the age of 3 but is it HEALTHY? I just wonder....is  <br/>\nlearning more important than health?<br/>\n<br/>\nThis is not meant as a direct criticism of your book or ideas. I just  <br/>\nwonder, is it possible to continue attachment parenting/unschooling a  <br/>\nchild until 7 without TV? Is it possible to accept the fact that it  <br/>\nMIGHT be better for at least really young kids to steer clear of TV? I  <br/>\nworry from a health standpoint. Like I wouldn&#39;t give my kid a cell  <br/>\nphone to play with bcs of all the EMF&#39;s it emits which children are  <br/>\nmore affected by, but I also wouldn&#39;t whip mine out and play or talk  <br/>\non it in front of my child if I knew it was tempting. It&#39;s just not  <br/>\nsafe for kids to use cell phones... not wee ones anyway. I have those  <br/>\nweird EMF neutralizing stickers on my phone now but that&#39;s just an  <br/>\nexample of what I mean by keeping kids healthy.<br/>\n<br/>\nSo, do you see what I mean? I don&#39;t want to be totally Waldorfy in my  <br/>\nhome but something in my gut tells me that kids under a certain age  <br/>\nshould just be outside more, experiencing touch and taste and lots of  <br/>\nother things that TV cannot be and will never be. In spaces that  <br/>\naren&#39;t as limiting as the living room or whatever room the TV might be  <br/>\nin.  I  would be much more open to letting the TV be on with no limits  <br/>\nafter 6-7. At least at this point. Am I alone on this one?  HELP!</div>","specialLinks":[]}],"prevTopicId":50094,"nextTopicId":50083}}