{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Jaam1224@cs.com","from":"Jaam1224@...","replyTo":"LIST","senderId":"wteR5GCLeVpuuKFuQYpfjK5AfMLFk7Ugd4aaEdvNUmKdjSQ6PeYhIHcQ3SAnJ-9Z-8QpetWd","spamInfo":{"isSpam":false,"reason":"0"},"subject":"tv show about simple living-7/9 at 9 on PBS","postDate":"962974412","msgId":10763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwLjgyYjUyMDUuMjY5NzJjY2NAY3MuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":10762,"nextInTime":10764,"topicId":10763,"numMessagesInTopic":0,"msgSnippet":"Hi all, I found this in a newsletter I get:  I thought maybe you all might be interested.....I hope it is good. Escape from Affluenza [by permission] -  Gary","messageBody":"<div id=\"ygrps-yiv-520048988\">Hi all,<br/>\n<br/>\nI found this in a newsletter I get:  I thought maybe you all might be <br/>\ninterested.....I hope it is good.<br/>\n<br/>\n&quot;Escape from Affluenza&quot; [by permission] -  Gary Foreman<br/>\n<br/>\nYour doctor examines you and asks about your symptoms. &quot;Well, Doc, I&#39;ve <br/>\ngot swollen expectations, shopping fever, chronic stress and <br/>\nexhaustion.&quot; He looks a little more closely and then pronounces, &quot;I know <br/>\nwhat it is. It&#39;s Affluenza!&quot; <br/>\n<br/>\nYou, too, may be like the patient portrayed in the PBS special &quot;Escape <br/>\nfrom Affluenza&quot; (July 7, 9 p.m. EDT). This hour-long special mixes a <br/>\nlight, tongue-in-cheek approach with a serious subject. Can you really <br/>\nbe happier living a simpler, more natural lifestyle? <br/>\n<br/>\nThe show&#39;s hostess, Wanda Ubanska, and her husband answered that <br/>\nquestion a few years ago by moving to the country and adopting a <br/>\nslower-paced existence. <br/>\n<br/>\nWanda introduces the viewer to a number of people who have come to <br/>\nsimple living from widely varying backgrounds. We meet a personnel <br/>\ndirector who earned a &quot;six-figure income.&quot; His function? To tell other <br/>\nemployees that they were being &quot;downsized&quot; and losing their jobs. <br/>\nFinally, it was his turn to join the unemployed. Today he works as a <br/>\nphysical therapist making one-fifth his old salary. He finds that <br/>\nthere&#39;s more time to spend with his family. Not only have they learned <br/>\nto live on less than he makes, they&#39;re paying off bills that were <br/>\naccumulated during his &quot;big income&quot; days. <br/>\n<br/>\nAlong with interviews, the show intersperses some history and even a <br/>\nlight-hearted look at some ads from the 1950&#39;s. One section examines how <br/>\nthe frugal lifestyle of the original settlers has fared over the <br/>\ncenturies. Noted proponents including Ralph Waldo Emerson, Henry David <br/>\nThoreau and Abraham Lincoln are quoted. Attempts to foster simple living <br/>\nfrom those first settlers to the hippies of the &#39;60&#39;s are discussed. <br/>\n<br/>\nSome have turned their passion for simple living into a vocation. Dick <br/>\nRoy left a lucrative legal career to form the North West Earth <br/>\nInstitute, a private, non-profit organization that provides creative <br/>\nopportunities for citizens to consider how their habits and values <br/>\naffect the earth. <br/>\n<br/>\nOthers were motivated by events to examine their lives. Evie was <br/>\nclimbing the career ladder when she was diagnosed with a terminal <br/>\nillness. She decided that she wanted to be remembered for &quot;understanding <br/>\nlove, understanding service and a feeling of wholeness.&quot; Her recovery <br/>\nhas not shaken her conviction in her new-found, simpler life. <br/>\n<br/>\nToday&#39;s simplicity advocates come from a variety of philosophical <br/>\nbackgrounds. Some are environmentalists concerned with the one ton of <br/>\nsolid waste the average American produces each year. Others come from a <br/>\nreligious view that dates back to the Puritans and Quakers. A third <br/>\ngroup has decided to turn their backs on the &quot;rat race&quot; and embrace <br/>\nanti-consumerism. <br/>\n<br/>\nAs you might expect with a movement that&#39;s looking for a more <br/>\nfulfilling, less commercial lifestyle, much of the energy comes from <br/>\ngrass-roots activists. We meet Cecile Andrews, the author of &quot;Circle of <br/>\nSimplicity&quot;, in which she promotes small support groups for simple <br/>\nliving. The goal is not merely a less cluttered life, but rather <br/>\n&quot;putting positive things in place of negative things&quot;. Members meet <br/>\nregularly to share goals, ideas and success stories. <br/>\n<br/>\nNot all viewers will be ready to jump into this new way of living. Few <br/>\nare likely to imitate the gentleman who uses a kayak for his daily work <br/>\ncommute. One 15-year-old exercises the prerogative of every teenager, <br/>\nthe pursuit of rebellion. She openly questions her parents&#39; frugal <br/>\nlifestyle and spends less time at home because it&#39;s &quot;boring.&quot; <br/>\n<br/>\nBut, even if you&#39;re not ready to sell everything and move to the <br/>\ncountry, you&#39;ll find this a thought provoking and entertaining hour. At <br/>\nthe least, you&#39;ll learn something (that there are 25 times as many <br/>\nself-storage facilities as there were in 1970). You might be motivated <br/>\nto change something, like the way you brew your tea (a claimed lifetime <br/>\nsavings of $600). Then again, you might be the one who quits your <br/>\nhigh-tech job to pursue a career in acting, as did one gentleman <br/>\ninterviewed. <br/>\n<br/>\nThe biggest problem with &quot;Escape from Affluenza&quot; is that the people who <br/>\ncould most benefit from watching the show won&#39;t have enough time to do <br/>\nso. They&#39;ll be working a second job to keep up with their credit card <br/>\nbills, or wandering the malls looking for a cure for depression. <br/>\n<br/>\nBut if you can spare an hour, this show deserves to be on your <br/>\n&quot;must-see&quot; list. In fact, you should watch it with someone who is <br/>\nimportant in your life. Oh, and don&#39;t forget to schedule some time to <br/>\ndiscuss it afterwards. You&#39;re bound to find some material for an <br/>\ninteresting conversation in &quot;Escape from Affluenza&quot;. <br/>\n__________<br/>\n<br/>\nGary Foreman is a former Certified Financial Planner who currently edits<br/>\nThe Dollar Stretcher website &lt;www.stretcher.com/save.htm&gt;. You&#39;ll find<br/>\nhundreds of free articles to help you save time and money. Visit Today!</div>","specialLinks":[]}],"prevTopicId":10749,"nextTopicId":10552}}