{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Defining Unschooling","postDate":"1016005654","msgId":32342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk0MmI4YjRhZmVjOGE3M0BbMjA4LjI2LjIzNS4yMTRdPg==","inReplyToHeader":"PDEwMTYwMDMxNDMuNDM5My41NzA5NC5tMkB5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDEwMTYwMDMxNDMuNDM5My41NzA5NC5tMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":32341,"nextInTime":32343,"topicId":32342,"numMessagesInTopic":0,"msgSnippet":"... I ve been catching up with lists this evening, mostly just reading and thinking to myself, but Tia s question made me click on reply, as I thought this","messageBody":"<div id=\"ygrps-yiv-69469674\">At 7:05 AM +0000 3/13/2002, Tia Leschke &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;So how *do* the rest of you define unschooling?<br/>\n<br/>\n </span></blockquote>I&#39;ve been catching up with lists this evening, mostly just reading <br/>\nand thinking to myself, but Tia&#39;s question made me click on reply, as <br/>\nI thought this would be of interest at this point in the discussion: <br/>\nIt&#39;s an editorial from Home Education Magazine, I forget the date, <br/>\nand I couldn&#39;t find it anywhere online, so I&#39;ll just post the entire <br/>\narticle and hope the formatting stays readable and the length doesn&#39;t <br/>\ncause problems for anyone.<br/>\n<br/>\nDefining Unschooling<br/>\n<br/>\nby Helen Hegener<br/>\n<br/>\n\tOver the past few months there has been a lot of discussion <br/>\nin homeschooling circles about unschooling, what it is, what it <br/>\nisn&#39;t, and how one does it - or doesn&#39;t. Workshops on unschooling <br/>\nhave become standard fare at homeschool conferences and conventions, <br/>\nand several homeschooling publications have tried to define the word. <br/>\nThere are even derivatives now, like Christian unschooling and <br/>\nstructured unschooling and radical unschooling.<br/>\n<br/>\n\tUnschooling is an interesting word, or at least I think it&#39;s <br/>\na word. How many people need to use a word, and more or less <br/>\nunderstand and agree on what it means, before it officially joins our <br/>\nlanguage - as in it gets added to our dictionaries? I don&#39;t think the <br/>\nword homeschooling was around for more than six or seven years before <br/>\nit showed up in a major dictionary. Maybe with a few more years of <br/>\nuseage unschooling will join the ranks of publicly recognized and <br/>\nrespectable words.<br/>\n<br/>\n\tBut to be included in a dictionary, a word needs a <br/>\ndefinition, and unschooling is a particularly difficult word to <br/>\ndefine. Just last month there was a long and involved discussion <br/>\nabout what it means - and doesn&#39;t mean - on one of America Online&#39;s <br/>\nhomeschooling forums. There were those who felt unschooling totally <br/>\nprecludes the use of school-type materials, and those who said the <br/>\nmaterials don&#39;t matter, it&#39;s your attitude that counts. From the <br/>\nonline discussions, one could gather that unschooling generally seems <br/>\nto refer to the act of not learning in the same ways we were expected <br/>\nto learn in school, i.e. with textbooks, workbooks, lesson plans, <br/>\ndrills and all the rest. But many avowed unschoolers said they do use <br/>\nthese handy educational tools, just not always in the ways they were <br/>\noriginally designed for.<br/>\n<br/>\n\tMost unschoolers agree that it goes a little further than <br/>\nthat, tho, and can mean the entire process of shaking off schoolish <br/>\nhabits, patterns, and expectations. Of course others will say that <br/>\nit&#39;s not a process at all, but just what they do with their kids <br/>\nevery day. It&#39;s their interactions, their interconnectedness, their <br/>\nvery lives.<br/>\n<br/>\n\tIn the Dec/Jan 1995 issue of Growing Without Schooling, <br/>\neditor Susannah Sheffer had some interesting comments on the history <br/>\nof the word &#39;homeschooling,&#39; and I was surprised to learn that <br/>\nunschooling was actually the predecessor of that word. For a long <br/>\ntime now I&#39;ve thought it was the other way around!<br/>\n<br/>\n\tSusannah noted that John Holt had used the word &#39;unschooling&#39; <br/>\nin GWS #2, noting &quot;at the beginning Holt simply used it as a synonym <br/>\nfor what we now call homeschooling.&quot; She adds &quot;By issue #12, which <br/>\nI&#39;d date at June 1979, you can see that the magazine was using <br/>\n&#39;unschooling&#39; and &#39;homeschooling&#39; pretty much interchangeably, and <br/>\ngradually the term &#39;homeschooling&#39; became the more common one.&quot;<br/>\n<br/>\n\tGrace Llewellyn gives our term an interesting spin in The <br/>\nTeenage Liberation Handbook. Throughout the book she prefers the term <br/>\nunschooling, explaining early on that it has fewer negative <br/>\nconnotations than homeschooling. But in Chapter 11, on Legal Issues, <br/>\nshe writes: &quot;I am shifting my terminology a little. In this chapter, <br/>\nI will mostly use the euphemism &#39;homeschooling&#39; rather than <br/>\n&#39;unschooling.&#39; &#39;Unschooling&#39; is not a legally recognized term, and <br/>\nprobably never will be. Don&#39;t use it when you talk to schools, <br/>\ncourts, or legislators; it will confuse them.&quot;<br/>\n<br/>\n\tWell, maybe we shouldn&#39;t get our hopes up about getting it <br/>\ninto the dictionaries.<br/>\n<br/>\n\tFor that matter, do we even want official dictionary-style <br/>\nrecognition of the word&#39;s meaning? Unschooling means many things to <br/>\nmany people... that became quite obvious in the America Online <br/>\ndiscussions. And that&#39;s part of its appeal. Each family, each <br/>\nindividual, can decide what they want it to mean for themselves <br/>\nwithin a loosely-accepted larger context.<br/>\n<br/>\n\tThere&#39;s an odd dynamic at work in that once a word is <br/>\ndefined, it begins to lose its meaning through overuse, <br/>\noverpopularity. The word homeschooling, officially recognized for <br/>\nsome time now, has been showing up in some strange places, most <br/>\nnotably as what parents do with their children after school and on <br/>\nweekends. Because the term is widely recognized and accepted, it&#39;s <br/>\nbeing used to stretch the meaning of other activities, with the very <br/>\nreal danger that the word&#39;s own original meaning will be completely <br/>\nlost.<br/>\n<br/>\n\tThis has already happened with the term &#39;alternative <br/>\nschools.&#39; Where that once meant schools which functioned outside the <br/>\neducational bureaucracy, it now also means special public schools for <br/>\nkids who don&#39;t fit well into the usual regimen. If one uses the term <br/>\nalternative schools but means free schools, or student-participatory <br/>\nschools, or any of the other originally accepted definitions, the <br/>\ndistinction needs to be made clear.<br/>\n<br/>\n\tUnschooling is still a wonderfully nebulous term, subject to <br/>\nindividual interpretation. Homeschoolers can argue themselves in <br/>\ncircles about what it means, and that&#39;s as it should be. We need <br/>\nwords that are vague yet descriptive, changeable while unchanging. In <br/>\nmuch the same way that homeschoolers have taken leave of the <br/>\neducational bureaucracy, we&#39;ve taken leave of the English language <br/>\nbureaucracy and are exploring new options in communication. We&#39;re <br/>\nunschooling in the best sense of the word.</div>","specialLinks":[]}],"prevTopicId":32325,"nextTopicId":32343}}