{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":5493754,"authorName":"lite2yu@aol.com","from":"lite2yu@...","profile":"lite2yu2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] back in the loop","postDate":"1012698981","msgId":31876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0LjIyMTEzMWEwLjI5OGRlOTY1QGFvbC5jb20+"},"prevInTopic":31868,"nextInTopic":0,"prevInTime":31875,"nextInTime":31877,"topicId":31868,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/2/2002 3:28:25 PM Eastern Standard Time, ... Welcome Kama. . . and welcome back to the loop. My daughter also chose to go to school a","messageBody":"<div id=\"ygrps-yiv-721321568\">In a message dated 2/2/2002 3:28:25 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:steliga@...\">steliga@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; .  I guess that <br/>\n&gt; this was a pretty long intro but I wanted to share our &quot;family&quot; <br/>\n&gt; moment, to say that I am glad to be back in the loop, and to share a <br/>\n&gt; little about where we are and where we&#39;ve been.  <br/>\n&gt; Kama<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Welcome Kama. . . and welcome back to the loop. My daughter also chose to go <br/>\nto school a couple of years ago and made the decision to not do so again. <br/>\nWhat a great experience it was though in that she was able to fully come to <br/>\nunschooling of her own choice. It was a challenge to have to stick to my &quot;it <br/>\nis always your choice whether to homeschool or not&quot;. . . yikes!! But now she <br/>\nis so committed to it and understands how she loses part of her soul in the <br/>\nschool system (even though it was  Montessori). As with everything, it was a <br/>\ngreat learning adventure and opportunity.<br/>\n<br/>\nliving in abundance<br/>\nlovemary<br/>\n<br/>\nThere are no victims in this world. . . only opportunities<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":87034427,"authorName":"spicesuccess","from":"&quot;spicesuccess&quot; &lt;steliga@...&gt;","profile":"spicesuccess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"back in the loop","postDate":"1012681636","msgId":31868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEzaGkzNCtxNm5iQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":31876,"prevInTime":31867,"nextInTime":31869,"topicId":31868,"numMessagesInTopic":0,"msgSnippet":"Hi all, my name is Kama and our family lives in Lillooet, BC.  I thought I would introduce myself and share a moment.  We have been learning outside of Public","messageBody":"<div id=\"ygrps-yiv-1924681835\">Hi all, my name is Kama and our family lives in Lillooet, BC.  I <br/>\nthought I would introduce myself and share a moment.  We have been <br/>\nlearning outside of Public School for three years.  We have a son <br/>\n(13) and a daughter (11 on Monday).  Last fall the kids decided that <br/>\nthey wanted to return to PS.  That was a difficult time in our <br/>\njourney.  Although it was scary (re-entering the tyrranic system - my <br/>\nthoughts of course) we dicided to support them in their path toward <br/>\nexploring  <br/>\noptions and choices.  About the end of November, our son started to <br/>\nshare some of his thoughts and feelings about this new direction.  &quot;I <br/>\ncan&#39;t believe we are there for seven hours&quot;, &quot;I am tired of waiting <br/>\nfor everyone and everything&quot;, &quot;They keep us in ONE place and they <br/>\neven have a fence around it to keep us in&quot;, and &quot;I am so bored&quot;.  I <br/>\nhave <br/>\nto admit it was music to my ears.  Not that he was following what I <br/>\nvalued but that he was coming to this place all on his own.  Over the <br/>\nnext month I observed him weighing out the choices, the options, and <br/>\nthe results.  He finally made a decision at the end of December.  He <br/>\ntold us that he had realized that he was loosing his &quot;self&quot; and that <br/>\nhis own level of self-expectations were dropping.  He chose to return <br/>\nhome and re-enter the &quot;world&quot; of learning.  I am very proud and <br/>\nexcited for our family and for my son.  His own sense of self, self-<br/>\nconfidence, and trust empowered him to acknowledge his own needs, <br/>\nfind a way to honour them, and meet them.  I know this was a <br/>\ndifficult <br/>\nprocess for him.  Over the time I watched him struggle, formulate, <br/>\nand choose a choice even in the midst of peer and adult pressure from <br/>\nthe world.  All this at the age of 13.  My daughter has made the <br/>\ndecision to stay in PS for the remainder of the year and then return <br/>\nto the world to learn.  This is her current choice although I do see <br/>\nher struggling with some of the same experiences as my son.  We&#39;ll <br/>\nsee how the process unfolds for her.  I know that we have once again <br/>\nentered a new path on the same journey and my hope is that we <br/>\ncontinue to examine and learn what is best for each of us.  I hope to <br/>\nlearn, teach, share, and post with everyone as we continue our <br/>\njourney.  I know for me that life is about a process and this is no <br/>\ndifferent.  When our kids first came home to learn we developed our <br/>\nown experiences to fit Ministry of Education goals and objectives <br/>\n(mostly theme unit oriented stuff), then we tried distance Ed stuff, <br/>\nthen back to our own identified goals and put together our own <br/>\ncurriculum.  Towards <br/>\nthen end of the first three years we had moved through the process <br/>\nand developed our own understanding, value, and philosophy, of <br/>\nunschooling.  We now are &quot;unschooling&quot; ( quotations are loosly used <br/>\nto reflect that obviously there is a large encompassing understanding <br/>\nof what this may mean to different people)and we are constantly <br/>\nlearning, developing, and formulating our own process and definition <br/>\nof what that is.  This is our <br/>\npath for now, our understanding as of today, and the place that fits <br/>\nwith our world and our perception of it at this moment.  I guess that <br/>\nthis was a pretty long intro but I wanted to share our &quot;family&quot; <br/>\nmoment, to say that I am glad to be back in the loop, and to share a <br/>\nlittle about where we are and where we&#39;ve been.  <br/>\nKama</div>","specialLinks":[]}],"prevTopicId":31871,"nextTopicId":31867}}