{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":53620434,"authorName":"Christina Morrissey","from":"Christina Morrissey &lt;cvw@...&gt;","profile":"christa_wa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] protecting them from schoolyard  bullies","postDate":"1047065923","msgId":60320,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjIuMjAwMzAzMDcxMTMyMjUuMDMxOTMyMTBAcG9zdG9mZmljZS53b3JsZG5ldC5hdHQubmV0Pg==","inReplyToHeader":"PDAwMTcwMWMyZTQxMiRmYjQyODRhMCQ3YjdlNTI0NEBjZWxlcm9uMTc+","referencesHeader":"PGI3LjJmNTAwMWRiLjJiOThkZWU4QGFvbC5jb20+"},"prevInTopic":60238,"nextInTopic":0,"prevInTime":60319,"nextInTime":60321,"topicId":60203,"numMessagesInTopic":0,"msgSnippet":"Hey Kristen, I was sorry to hear about you Junior Scout experience. It has been my experience that everything depends on the leader!  My daughter is the only","messageBody":"<div id=\"ygrps-yiv-1071482961\">Hey Kristen,<br/>\n<br/>\nI was sorry to hear about you Junior Scout experience.<br/>\n<br/>\nIt has been my experience that everything depends on the leader!  My <br/>\ndaughter is the only homeschooled kid in her troop of 14 Juniors.  But I am <br/>\na very involved mom.  The leaders here let the girls decided at the <br/>\nbeginning of the year which badges to do and so on, but then during the <br/>\nyear at each individual meeting they do lead the meetings...I suspect that <br/>\nif the whole troop were homeschoolers, we would do it entirely <br/>\ndifferently.  The &quot;school&quot; presence has something to do with it.  Although <br/>\nI understand that as they go up in &quot;rank&quot; they are expected to do most of <br/>\nthe stuff at meetings.  I can&#39;t imagine a leader belittling like that <br/>\nthough.  I know that I would have to let me leader know about my daughter <br/>\nbeing homeschooled and if she could read or so, since they are so <br/>\nsystemized, but if the leader couldn&#39;t deal with that in an appropriate and <br/>\ngentle manner, then that would not be the troop for us!!<br/>\n<br/>\nEach troop can be so different as are the leaders.  I&#39;m glad you started <br/>\nyour own!!<br/>\n<br/>\nChristina in Seattle area<br/>\n<br/>\n<br/>\n<br/>\nAt 02:02 PM 3/6/2003 -0500, you wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;I just have to address the girl scouts thing.  Last year my daughter was <br/>\n&gt;in a Junior troop and she hated it.  When the Juliette Lowe Bazarr came <br/>\n&gt;around and they were all making things to sell, Sierra spelled something <br/>\n&gt;wrong on one of the items to sell.  Spelling is not her strong suit, but <br/>\n&gt;its not for many people.  The leader picked the item up and showed it to <br/>\n&gt;the whole troop, not naming who did it (but of course, who DIDNT know!), <br/>\n&gt;and made a stink about the spelling and how they couldn&#39;t sell that one.<br/>\n&gt;<br/>\n&gt;It also seemed as though the leaders decided everything for the girls: <br/>\n&gt;which badges they worked on, etc. I don&#39;t remember Sierra ever saying that <br/>\n&gt;she was part of any decision making.  And it was run like a classroom.<br/>\n&gt;<br/>\n&gt;This year a friend of mine and I decided WE would start a second junior <br/>\n&gt;troop.  Our troop hasn&#39;t really earned any badges yet.  We are working on <br/>\n&gt;the Sign of the Star and we will be earning all our badgework on a camping <br/>\n&gt;trip that we are planning (today as a matter of fact).  (We only meet <br/>\n&gt;every other week so it cuts down on time for badges.)<br/>\n&gt;<br/>\n&gt;BUT, the girls decide everything.  THey pick what they want to do.  They <br/>\n&gt;run the meetings.  And they LOVE girl scouts.  They&#39;ve learned that making <br/>\n&gt;choices means that you have to priortize, and that sometimes we can&#39;t do <br/>\n&gt;things we otherwise might have done.<br/>\n&gt;<br/>\n&gt;For example, we didin&#39;t have time to make things for the bazarr this year <br/>\n&gt;(which is this Saturday).  But we ARE going shopping!!<br/>\n&gt;<br/>\n&gt;Jenna is in the brownie troop.  She doesn&#39;t read yet either.  And I&#39;m so <br/>\n&gt;thankful that her leader doesn&#39;t make an issue of it.  I know she is <br/>\n&gt;wondering about it, but she doesn&#39;t ever embarass Jenna, at least never <br/>\n&gt;intentionally.  Our junior leader is also the assistant brownie leader, so <br/>\n&gt;the three of us work together a lot.  It really worked out well this year <br/>\n&gt;and I&#39;m so pleased.<br/>\n&gt;<br/>\n&gt;Kristen<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;[Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n&gt;<br/>\n&gt;If you have questions, concerns or problems with this list, please email <br/>\n&gt;the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list <br/>\n&gt;owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n&gt;<br/>\n&gt;To unsubscribe from this group, click on the following link or address an <br/>\n&gt;email to:<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> </span></blockquote></div>","specialLinks":[]},{"userId":132394532,"authorName":"Have a Nice Day!","from":"Have a Nice Day! &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] protecting them from schoolyard bullies","postDate":"1046977369","msgId":60238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTcwMWMyZTQxMiRmYjQyODRhMCQ3YjdlNTI0NEBjZWxlcm9uMTc+","referencesHeader":"PGI3LjJmNTAwMWRiLjJiOThkZWU4QGFvbC5jb20+"},"prevInTopic":60235,"nextInTopic":60320,"prevInTime":60237,"nextInTime":60239,"topicId":60203,"numMessagesInTopic":0,"msgSnippet":"I just have to address the girl scouts thing.  Last year my daughter was in a Junior troop and she hated it.  When the Juliette Lowe Bazarr came around and","messageBody":"<div id=\"ygrps-yiv-457897260\">I just have to address the girl scouts thing.  Last year my daughter was in a Junior troop and she hated it.  When the Juliette Lowe Bazarr came around and they were all making things to sell, Sierra spelled something wrong on one of the items to sell.  Spelling is not her strong suit, but its not for many people.  The leader picked the item up and showed it to the whole troop, not naming who did it (but of course, who DIDNT know!), and made a stink about the spelling and how they couldn&#39;t sell that one.<br/>\n<br/>\nIt also seemed as though the leaders decided everything for the girls: which badges they worked on, etc. I don&#39;t remember Sierra ever saying that she was part of any decision making.  And it was run like a classroom.<br/>\n<br/>\nThis year a friend of mine and I decided WE would start a second junior troop.  Our troop hasn&#39;t really earned any badges yet.  We are working on the Sign of the Star and we will be earning all our badgework on a camping trip that we are planning (today as a matter of fact).  (We only meet every other week so it cuts down on time for badges.)<br/>\n<br/>\nBUT, the girls decide everything.  THey pick what they want to do.  They run the meetings.  And they LOVE girl scouts.  They&#39;ve learned that making choices means that you have to priortize, and that sometimes we can&#39;t do things we otherwise might have done.<br/>\n<br/>\nFor example, we didin&#39;t have time to make things for the bazarr this year (which is this Saturday).  But we ARE going shopping!!<br/>\n<br/>\nJenna is in the brownie troop.  She doesn&#39;t read yet either.  And I&#39;m so thankful that her leader doesn&#39;t make an issue of it.  I know she is wondering about it, but she doesn&#39;t ever embarass Jenna, at least never intentionally.  Our junior leader is also the assistant brownie leader, so the three of us work together a lot.  It really worked out well this year and I&#39;m so pleased.  <br/>\n<br/>\nKristen<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":132394532,"authorName":"Have a Nice Day!","from":"Have a Nice Day! &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] protecting them from schoolyard bullies","postDate":"1046976833","msgId":60235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTEwMWMyZTQxMSRiYmVkOGU0MCQ3YjdlNTI0NEBjZWxlcm9uMTc+","referencesHeader":"PDE5ZS4xMWJlOGIxMy4yYjk4YWU4OEBhb2wuY29tPg=="},"prevInTopic":60225,"nextInTopic":60238,"prevInTime":60234,"nextInTime":60236,"topicId":60203,"numMessagesInTopic":0,"msgSnippet":"... From: genant2@aol.com To: Unschooling-dotcom@yahoogroups.com Sent: Thursday, March 06, 2003 9:00 AM Subject: Re: [Unschooling-dotcom] protecting them from","messageBody":"<div id=\"ygrps-yiv-837601077\"><blockquote><span title=\"qreply\">----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Thursday, March 06, 2003 9:00 AM<br/>\n  Subject: Re: [Unschooling-dotcom] protecting them from schoolyard bullies<br/>\n<br/>\n<br/>\n  In a message dated 3/6/03 4:45:08 AM Eastern Standard Time, <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:warblwarbl@...\">warblwarbl@...</a> writes:<br/>\n<br/>\n  &gt; My son offered to give him chocolate if he never challenged him <br/>\n  &gt; to a math duel again!  He accepted...that&#39;s what happened to the Hershey&#39;s <br/>\n  &gt; kisses!  I was so mad I told my son that the neighbor had no idea of what <br/>\n  &gt; 9x9 <br/>\n  &gt; even meant and that he&#39;d probably never figure out how to figure it out for <br/>\n  &gt; <br/>\n  &gt; himself they way my son did and that his thinking process ran circles <br/>\n  &gt; around <br/>\n  &gt; the neighbor. <br/>\n<br/>\n  Sounds like your son solved the issue.  I have no answers as we haven&#39;t run <br/>\n  into that but was thinking about that last night.  Not sure who posted or <br/>\n  what it was in reference to but someone said something about their child <br/>\n  learning the times tables at his own pace.  I was thinking that my son will <br/>\n  probably never learn his times tables as &quot;times tables.&quot;  He knows how to get <br/>\n  at an answer to a particular problem but doesn&#39;t recite them from memory like <br/>\n  I was made to in school.  We will never look at multiplication the same way.<br/>\n  Pam G.<br/>\n<br/>\n  Thats how we do it here too.  We did have one of those &quot;math duals&quot; in the car once right after I picked up one of Jenna&#39;s school friends.  I turned around and told her &quot;We dont&#39; do school that way, we do what we WANT and learn as we go&quot;.  That shut her down and there were no more &quot;math duals or spelling duals&#39; after that.<br/>\n  Kristen<br/>\n<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] protecting them from schoolyard bullies","postDate":"1046971624","msgId":60225,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI3LjJmNTAwMWRiLjJiOThkZWU4QGFvbC5jb20+"},"prevInTopic":60218,"nextInTopic":60235,"prevInTime":60224,"nextInTime":60226,"topicId":60203,"numMessagesInTopic":0,"msgSnippet":"-=- My son offered to give him chocolate if he never challenged him to a math duel again!  He accepted...that s what happened to the Hershey s kisses!  . . .","messageBody":"<div id=\"ygrps-yiv-1530469126\">-=- My son offered to give him chocolate if he never challenged him <br/>\nto a math duel again!  He accepted...that&#39;s what happened to the Hershey&#39;s <br/>\nkisses!  . . . .But I haven&#39;t seen the neighbor kid since then.<br/>\n<br/>\n-=-Any suggestions?-=-<br/>\n<br/>\nKeep chocolate on hand for the future and smile at your son extra big every <br/>\ntime you think of that story.  If school kids can be bought so cheaply, just <br/>\npay them to shut up.<br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;  What kinds of things do you call them on? &gt;&gt;<br/>\n<br/>\nPlayground dialog for which my kids don&#39;t know the traditional responses.  <br/>\nThe taunts PeeWee Herman makes fun of.  That sort of gratuitous insult like <br/>\n&quot;I know you are, but what am I?&quot;  (Not thinking of specific examples, but <br/>\nthings for which kids at school just supply the traditional comeback, without <br/>\nactually thinking about what the kid said and why he said it.  My kids would <br/>\ncome to me when they were sixish and say &quot;Nick said this.  What does he mean?&quot;<br/>\n<br/>\nAnd my response was sometimes, &quot;Nick just said that without thinking, because <br/>\nit&#39;s something schoolkids say on playgrounds.&quot;<br/>\n<br/>\nAnd those incidents seemed most often to be on the swingset.  As though the <br/>\nrecess behavior kicked in in the presence of playground equipment.<br/>\n<br/>\n&lt;&lt;The 3rd grade neighbor said, no I asked my teacher and he said 82, I win.  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>That teacher worship is freakish.<br/>\n<br/>\nHolly was in a girl scout troop for a while and when Juliette Lowe day or <br/>\nsome such came, girls grouped up and chose a country to represent.<br/>\n<br/>\nHolly came home saying she was one of the three doing China, and one thing <br/>\nshe needed to do was make a flag.  &quot;Make&quot; a flag was color in the printout <br/>\nthey had given her of the outline, I think.  <br/>\n<br/>\nThat was a horrible time.  I had encouraged her to be a girl scout, but every <br/>\nsingle week the stories were worse.  Seems the leaders knew little about <br/>\nanything and the other girls conspired to do as little as possible.<br/>\n<br/>\nThe horror was this:  She said she was supposed to make the flag blue and <br/>\nyellow.  I said no, it&#39;s red.  Blue, she said.  The leader said so.<br/>\n<br/>\nIt was internet time.  The worst damage done was her faith in adults&#39; <br/>\nknowledge.  <br/>\n<br/>\nAnd one of the other girls had suggested they bring fortune cookies, but I <br/>\nknew from an article in Smithsonian magazine that fortune cookies are purely <br/>\nan American invention.<br/>\n<br/>\nAND, I said, they don&#39;t have girl guides or girl scouts in China anyway.<br/>\n<br/>\nWhy didn&#39;t the leaders say so when the girls chose China?<br/>\n<br/>\nSo I dug around and found out that Hong Kong still had some Girl Guide troops <br/>\nwhich would be phased out as the girls get older and Hong Kong folds back <br/>\ninto China, having had its British colonial connection dissolved not so long <br/>\nago.  No new Brownies or anything, though.<br/>\n<br/>\nHolly, the only kid in her troop who couldn&#39;t read (who had been razzed for <br/>\nit by the other girls and treated very condescendingly by a leader who seems <br/>\nto have thought blue was a fine flag color for China&#39;s girl guides to carry) <br/>\nmade the second best presentation of the evening.  Other kids haltingly read <br/>\ntheir speeches which they had written.  One couldn&#39;t sound out &quot;Juliette <br/>\nLowe,&quot; reading it as though she&#39;d never heard it or seen it.   But Holly <br/>\nstood and spoke, and told about the last vestige of Girl Guides in Hong Kong, <br/>\nand held her paper flag of China.  <br/>\n<br/>\nThat was school behavior five layers deep.  The casual disregard for fact and <br/>\nreason and connection, the emphasis on &quot;reading&quot; which wasn&#39;t a useful sort <br/>\nof reading...   it was sad.<br/>\n<br/>\nI never talked to the other girls because I wasn&#39;t in the meetings.  Holly <br/>\nwas going with the dim-witted daughter of a dim-witted (now former) friend <br/>\nwho badmouthed homeschooling to her daughter rather than discuss it openly <br/>\neven though the daughter has step-siblings who homeschool (or probably <br/>\nbecause of that) and her best friend was homeschooled.  I could have talked <br/>\nto that girl, but I had before and it wasn&#39;t going to help.  She had begged <br/>\nHolly to join the troop with her, and promised to help her read.  Then she <br/>\nsuccumbed to school-style pressure and spoke right aloud in front of everyone <br/>\nthat Holly couldn&#39;t read so SHE had to HELP her **SIGH** and Holly felt <br/>\nbetrayed.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] protecting them from schoolyard bullies","postDate":"1046963527","msgId":60218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjgwMWMyZTNmMiRlZDNkM2YwMCQ2NDAxYThjMEBvZW1jb21wdXRlcj4=","referencesHeader":"PDk3LjM1MmVlMWY2LjJiOTg3MjdiQGFvbC5jb20+"},"prevInTopic":60211,"nextInTopic":60225,"prevInTime":60217,"nextInTime":60219,"topicId":60203,"numMessagesInTopic":0,"msgSnippet":"One of 10yod s best friends goes to school.  Her older sister often says things to dd about how she needs to go to school to learn, and she better plan on","messageBody":"<div id=\"ygrps-yiv-859094497\">One of 10yod&#39;s best friends goes to school.  Her older sister often says<br/>\nthings to dd about how she needs to go to school to learn, and she better<br/>\nplan on going to school for middle school because that&#39;s when they really<br/>\nstart learning things.  I explained to dd that because these children go to<br/>\nschool, their parents and teachers have convinced them that school is where<br/>\nyou must go to learn.  The parents don&#39;t want to homeschool, and are telling<br/>\ntheir kids &quot;reasons&quot; why they should go to school instead.<br/>\n<br/>\nMary Ellen</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] protecting them from schoolyard bullies","postDate":"1046959240","msgId":60211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ZS4xMWJlOGIxMy4yYjk4YWU4OEBhb2wuY29tPg=="},"prevInTopic":60203,"nextInTopic":60218,"prevInTime":60210,"nextInTime":60212,"topicId":60203,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/6/03 4:45:08 AM Eastern Standard Time, ... Sounds like your son solved the issue.  I have no answers as we haven t run into that but was","messageBody":"<div id=\"ygrps-yiv-755366459\">In a message dated 3/6/03 4:45:08 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:warblwarbl@...\">warblwarbl@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son offered to give him chocolate if he never challenged him <br/>\n&gt; to a math duel again!  He accepted...that&#39;s what happened to the Hershey&#39;s <br/>\n&gt; kisses!  I was so mad I told my son that the neighbor had no idea of what <br/>\n&gt; 9x9 <br/>\n&gt; even meant and that he&#39;d probably never figure out how to figure it out for <br/>\n&gt; <br/>\n&gt; himself they way my son did and that his thinking process ran circles <br/>\n&gt; around <br/>\n&gt; the neighbor. <br/>\n<br/>\n </span></blockquote>Sounds like your son solved the issue.  I have no answers as we haven&#39;t run <br/>\ninto that but was thinking about that last night.  Not sure who posted or <br/>\nwhat it was in reference to but someone said something about their child <br/>\nlearning the times tables at his own pace.  I was thinking that my son will <br/>\nprobably never learn his times tables as &quot;times tables.&quot;  He knows how to get <br/>\nat an answer to a particular problem but doesn&#39;t recite them from memory like <br/>\nI was made to in school.  We will never look at multiplication the same way.<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78954203,"authorName":"warblwarbl@aol.com","from":"warblwarbl@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"protecting them from schoolyard bullies","postDate":"1046943867","msgId":60203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3LjM1MmVlMWY2LjJiOTg3MjdiQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":60211,"prevInTime":60202,"nextInTime":60204,"topicId":60203,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/5/2003 3:19:30 PM Central Standard Time, ... Hmmm..  this is interesting.  What kinds of things do you call them on?  I just found out a","messageBody":"<div id=\"ygrps-yiv-1649422389\">In a message dated 3/5/2003 3:19:30 PM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Asking kids not to be such schoolkids is probably shocking to them at first, <br/>\n&gt; <br/>\n&gt; but if they get it it will benefit them for life.  And if they don&#39;t get <br/>\n&gt; it, <br/>\n&gt; they can go somewhere else, because I really do want my kids to feel safe <br/>\n&gt; at <br/>\n&gt; home.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Hmmm..  this is interesting.  What kinds of things do you call them on?  I <br/>\njust found out a neighbor was challenging my 8 yo to a &quot;math duel,&quot;  Asked <br/>\nhim what 9x9 was.  My son added up the 18s in that (and the odd 9) and came <br/>\nup with 81.  The 3rd grade neighbor said, no I asked my teacher and he said <br/>\n82, I win.   I think the kid was lying to my son and he knew the answer but <br/>\nmaybe not.  My son offered to give him chocolate if he never challenged him <br/>\nto a math duel again!  He accepted...that&#39;s what happened to the Hershey&#39;s <br/>\nkisses!  I was so mad I told my son that the neighbor had no idea of what 9x9 <br/>\neven meant and that he&#39;d probably never figure out how to figure it out for <br/>\nhimself they way my son did and that his thinking process ran circles around <br/>\nthe neighbor.  But I haven&#39;t seen the neighbor kid since then.<br/>\n<br/>\nAny suggestions?<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":3300,"nextTopicId":60216}}