{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"7"},"subject":"Re: [UnschoolingDiscussion] sleeping","postDate":"1130446281","msgId":109126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhOS40Mjk5MGViYS4zMDkyOTdjOUBhb2wuY29tPg=="},"prevInTopic":109117,"nextInTopic":0,"prevInTime":109125,"nextInTime":109127,"topicId":109117,"numMessagesInTopic":0,"msgSnippet":"I just found a quote from June 1997, so Kirby was 9.     Commenting that we d been staying up late a lot, Kirby said, It s like the only time I want to go to","messageBody":"<div id=\"ygrps-yiv-157758066\">I just found a quote from June 1997, so Kirby was 9.     Commenting that we&#39;d <br/>\nbeen staying up late a lot, Kirby said, &quot;It&#39;s like the only time I want to go <br/>\nto bed is when I&#39;m sleepy.&quot;<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"sleeping","postDate":"1130413631","msgId":109117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRhLjMwMjU3YTBmLjMwOTIxODNmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":109126,"prevInTime":109116,"nextInTime":109118,"topicId":109117,"numMessagesInTopic":0,"msgSnippet":"I went to look at the sleeping page to see what I had put there that was causing so much grief.    The first bit is Nancy K. /aisliin who had done a ","messageBody":"<div id=\"ygrps-yiv-667553719\">I went to look at the sleeping page to see what I had put there that was <br/>\ncausing so much grief.    The first bit is Nancy K. /aisliin who had done a <br/>\npoint-by-point to someone on the Always Learning list, and I saved it.    Maybe as a <br/>\nlead article there it&#39;s a little strong. &lt;g&gt;<br/>\n<br/>\nWith anything, if a family moves from rules (about food, freedoms, clocks, <br/>\nwhat to wear) to something new there&#39;s going to be the backlash, and thinking of <br/>\ncatapults (or trebuchets, more technically, or of a rubber band airplane, or <br/>\nother crank-it-up projectiles...) the more pressure that&#39;s built up, the <br/>\nfurther that kid is going to launch if you let it go all at once.   <br/>\n<br/>\nIn the absence of pressure in the first place, there&#39;s no reaction to <br/>\nresistence.   My kids didn&#39;t WANT to stay up all night, because they were used to <br/>\ngoing to sleep happily and peacefully since before they could remember.   That <br/>\ndoesn&#39;t mean they were used to never being &quot;put to bed&quot; in their whole lives, it <br/>\nmeans going to bed had to do with real and variable factors, but there were <br/>\nprinciples behind it.   Bed was about sleeping, not about control or punishment <br/>\nor discipline or schedules.   Sleeping was a cool, desireable thing that <br/>\nadults liked to do.    <br/>\n<br/>\nSome kids never see adults sleep.   They are &quot;put to bed&quot; by adults (scary <br/>\nadults who turn the lights off and say &quot;STAY IN THE BED&quot; sometimes) and then <br/>\nthey wake up to the faces of adults who probably (to them) seem to have been <br/>\nawake all the whole time.    That&#39;s one way &quot;family bed&quot; arrangements add to peace <br/>\nand togetherness--the kids KNOW other people sleep, and they learn to help <br/>\nthe other people sleep comfortably.<br/>\n<br/>\nSome unschoolers are more radical than I am.   That&#39;s okay, but here&#39;s an <br/>\nexample of a radical Nancy K. response &lt;bwg&gt;:<br/>\n<br/>\n[someone once wrote:<br/>\nIt is not against the unschooling train of thought to insist that your <br/>\nchildren be in their rooms by a certain time each night.]<br/>\n If Unschooling (damned insufficient word) is a lifestyle choice, NOT an <br/>\neducational style, per se; then I disagree with this statement. &quot;Insisting&quot; that <br/>\nthe kids be banished to their rooms after a certain time, on room arrest as it <br/>\nwere, regardless of their wills, desires, or plans for the evening, is not <br/>\nrespectful of them as people. Treating kids as second class citizens and <br/>\nsubservient members of the family, subject to your whims, is not in sync with an <br/>\n&quot;unschooling train of thought.&quot; Saying that you &quot;insist&quot; in the first place implies <br/>\nthat you have some leverage you are using in order to bend them to your will. <br/>\nHow will that be accomplished in a respectful and unschooly manner?<br/>\n<br/>\n-==================================<br/>\n(back to Sandra:)<br/>\n<br/>\nI think she was respnding to &quot;insist.&quot;   But honestly, parents DO have <br/>\nleverage to bend children to their will.   If children have freedom to choose, it&#39;s <br/>\nbecause the parents GIVE them that freedom, because they have the power to <br/>\ngive it to them.<br/>\n<br/>\nFor a parent to absolutely decide that he will never &quot;insist&quot; is going way to <br/>\nfar, I think.   Not only could it be, in some cases, illegal and neglectful, <br/>\nif the parent isn&#39;t even clear on what her duties and responsibilities are as <br/>\na parent, maybe she isn&#39;t thinking clearly about other things, either.    <br/>\n<br/>\nIf I let Kirby make the decision about something every single time, thousands <br/>\nof times, still I LET him, because the state, the county, and the people <br/>\naround me expect me to make that decision.   I delegated.   I can&#39;t say &quot;It&#39;s none <br/>\nof my business, he can do what he wants&quot; to people outside the famly, because <br/>\nit makes me look clueless and unconcerned.   <br/>\n<br/>\nIf Keith lets me decide how to spend money and doesn&#39;t make me check with him <br/>\nbefore I buy a DVD or some expensive groceries or clothes for the kids, <br/>\nthat&#39;s cool.   He lets me know when it&#39;s a really bad month to spend money.   The <br/>\nfact that he doesn&#39;t check doesn&#39;t mean it would be okay for me to buy a <br/>\nBentley or to charge tickets for a cruise.    If I asked in advance about doing <br/>\nthat, he would insist (if he weren&#39;t insane) that I NOT do that, because we really <br/>\ncan&#39;t afford it.     I live my live in such a way that Keith doesn&#39;t have to <br/>\ninsist that I do something different.   We&#39;ve moved gradually from the point <br/>\nthat we consulted about $30 purchases (when we were young and not both <br/>\nemployed, or one or both in college) to where now he might buy a power tool and tell <br/>\nme later, or I put a $300 eBay bid on a $1500 microscope without asking (I <br/>\ndidn&#39;t get it, but he wouldn&#39;t have freaked out if I had).<br/>\n<br/>\nIf a child goes from a 9:00 bedtime to staying up until midnight DOING <br/>\nsomething, that&#39;s not too bad.   If the jump is to staying up until 3:00 by any <br/>\npossible means just to do it, that&#39;s not so cool.<br/>\n<br/>\nI need Joyce-logic summary, I think. &lt;g&gt;   Or any help making this point, <br/>\nplease!<br/>\n<br/>\nWhen I was a kid I would stay out until I &quot;had&quot; to be home.   <br/>\nMy kids come back when   they&#39;re through doing what they&#39;re doing.<br/>\n<br/>\nI didn&#39;t NEED a &quot;thing&quot; to do to be away from   home.   I would just kill <br/>\ntime being gone.   <br/>\nMy kids have never felt the need to do that.   Being home isn&#39;t a bad thing <br/>\nto be avoided.<br/>\n<br/>\nThat&#39;s the parallel that worked with food and bed and reading and all kinds <br/>\nof learning, too.   But somewhere in there is the tension (good tension, not <br/>\nemotional distress) that kept it all together and nobody was wound up and <br/>\nlaunched away from the cooperative togetherness.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":109118,"nextTopicId":109124}}