{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":36,"messages":[{"userId":230706843,"authorName":"Betsy Hill","from":"Betsy Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Bedtimes...","postDate":"1133192665","msgId":110268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzOEIyNUQ5LjIwMDAwMDhAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PDE1OC41ZDdlOTYxNC4zMGJiYzk5ZEBhb2wuY29tPg==","referencesHeader":"PDE1OC41ZDdlOTYxNC4zMGJiYzk5ZEBhb2wuY29tPg=="},"prevInTopic":110267,"nextInTopic":110270,"prevInTime":110267,"nextInTime":110269,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"I d guess that the reality at your house is that everyone is tired and everyone has been really stressed out by your daughter s illness and by dad leaving.  On","messageBody":"<div id=\"ygrps-yiv-1325826729\">I&#39;d guess that the reality at your house is that everyone is tired and <br/>\neveryone has been really stressed out by your daughter&#39;s illness and by <br/>\ndad leaving.  On top of that there might naturally be a feeling of <br/>\nsibling rivalry and jealousy in the hearts of the kids that weren&#39;t sick <br/>\nand didn&#39;t get the extra time and worry that one child did get.<br/>\n<br/>\nIt&#39;s really hard that you can&#39;t have people over to babysit or help <br/>\nbecause of the immune issues.  Maybe people can at least leave <br/>\ncasseroles on your porch or loan you some new DVDs and books on tape?  <br/>\n(When I&#39;m exhausted, I think the easiest way to love a kid is <br/>\nhalf-asleep cuddling on the couch while they watch something on TV.)  <br/>\nMaybe they can take one or two of the kids on outings?  Or chat with <br/>\nyour kids on the phone or at least be penpals?  Secret Santas?<br/>\n<br/>\nGive as much love and attention as you can, possibly looking for the <br/>\neasiest ways you can think of to make your kids feel great. (Hugs in <br/>\npassing?  Tiny favors?  Serving special foods?  Reading very favorite <br/>\nbooks?)  Your life will be easier and their behavior better once they <br/>\nfeel more secure.  You are undoubtedly frazzled, but summon up as much <br/>\ngooey love and serenity as you possibly can in each moment.  Smell the <br/>\nkids heads and remember everything you love most about them.  Get out <br/>\nphoto albums and talk to them affectionately about things they did when <br/>\nthey were little.<br/>\n<br/>\nSome of my favorite stress-management techniques are deep breathing, <br/>\nlaughing and singing.  While listening to music cheers me up, singing <br/>\nalong feels like an even better stress release.  So play some Christmas <br/>\ncarols, or other music that you like, and sing and frolic a little with <br/>\nyour kids.  It&#39;s the cheapest therapy I can think of.<br/>\n<br/>\nBest wishes,<br/>\nBetsy<br/>\n<br/>\n<br/>\nPS  I encourage my son to go to bed at around 10 because his dad gets up <br/>\nat 5:30 and it&#39;s easier to get enough sleep.  Often he&#39;ll just read <br/>\nuntil he falls asleep.  If he feels to energetic to do that, then he <br/>\nstays up watching TV until 11 or so, but that isn&#39;t great for me, as our <br/>\nhouse is fairly open and he laughs really loud at The Simpsons.  My <br/>\npersonal rule isn&#39;t &quot;no bedtimes&quot; it&#39;s &quot;no bullying the kid into going <br/>\nto bed&quot;.</div>","specialLinks":[]},{"userId":143188961,"authorName":"Ann","from":"Ann &lt;ann_mv05@...&gt;","profile":"ann_mv05","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Bedtimes...","postDate":"1133188527","msgId":110267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUxMTI4MTQzNTI3LjcyOTM3LnFtYWlsQHdlYjUzNDA5Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDE1OC41ZDdlOTYxNC4zMGJiYzk5ZEBhb2wuY29tPg=="},"prevInTopic":110261,"nextInTopic":110268,"prevInTime":110266,"nextInTime":110268,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"There are reasons for quiet.   Quiet doesn t have to be get in bed with the lights out and go to sleep or get a spanking.   There s a wide world of option","messageBody":"<div id=\"ygrps-yiv-508087799\">There are reasons for quiet.   Quiet doesn&#39;t have to be &quot;get in bed with the <br/>\nlights out and go to sleep or get a spanking.&quot;   There&#39;s a wide world of <br/>\noption between that and screaming at 3:00 a.m.   They are absolutely and not even <br/>\nNEAR the only two choices.   <br/>\n________________<br/>\n   <br/>\n  We had to try a few options because just eliminating bedtime didn&#39;t work for us either.  We have &#39;bedroom time&#39;.  This is is so that Dad can get the rest he needs to be at work by 8am.  Thus Sunday-Thursday everyone goes to their own rooms at that time, they may do anything they want in their room as long as no one else hears them.  If it ever even once disturbs some one else, then that activity is off the list of choices for that time.  My teen often listens to music with headphones on and falls asleep that way.  My 12 year old often reads or draws for about an hour but then goes to sleep.  My 11 yr old son is a &#39;lark&#39;, he usually puts himself to bed around 9. <br/>\n   <br/>\n   If I had a little one, I would let them have a bottle anytime they wanted.  Recovering from traumatic family circumstances means that whatever aids comfort and healing needs to be the priortiy.  Do your little ones co-sleep?  When mine were little, just being in bed with me, having their bottle or nursing with lights out and quiet setled them down very quickly.  Oh and it really helped to give them a nice warm bath before bed it was a soothing transition thing.  Even now, my kids like a hot shower before bed.  I hope something works for you and you get some sleep soon.  It sounds like you have really been through hell.<br/>\n  Ann<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\n Yahoo! Music Unlimited - Access over 1 million songs. Try it free.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":71749548,"authorName":"Marge Adams","from":"&quot;Marge Adams&quot; &lt;jorie6568@...&gt;","profile":"jorie6568","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Bedtimes...","postDate":"1133151015","msgId":110261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRtZHZ2Nys2Z3FzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1OC41ZDdlOTYxNC4zMGJiYzk5ZEBhb2wuY29tPg=="},"prevInTopic":110259,"nextInTopic":110267,"prevInTime":110260,"nextInTime":110262,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"Sandra, Thank you for posting cause I find your perspective and style effective.  There were several things I wanted to respond to, so I m going to do a blow","messageBody":"<div id=\"ygrps-yiv-1008401139\">Sandra,<br/>\nThank you for posting &#39;cause I find your perspective and style <br/>\neffective.  There were several things I wanted to respond to, so I&#39;m <br/>\ngoing to do a blow by blow in the body of your post...<br/>\nMarge<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; In a message dated 11/27/05 7:09:33 PM, jorie6568@y... writes:<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; On top of not being able to afford<br/>\n&gt; &gt; it, Jossilyn&#39;s post-transplant restrictions are very <br/>\nconservative.  No<br/>\n&gt; &gt; one is allowed in the house and she can&#39;t go inside anywhere <br/>\nexcept<br/>\n&gt; &gt; our house, clinic, or hospital.<br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; That being the case, perhaps you need special restrictions for a <br/>\nwhile in the <br/>\n&gt; house so that she can recover and YOU can recover.   But why can&#39;t <br/>\nall people <br/>\n&gt; be in the same room (those who want to?) And why can&#39;t that baby <br/>\nhave a <br/>\n&gt; bottle to go to sleep?   If you&#39;re worried about sugar, maybe <br/>\nwater? <br/>\n <br/>\n<br/>\nAahh, but you should see what it is doing to her little baby <br/>\nteeth... (One of my sisters is a dental hygienist.)  But Josie still <br/>\ngets her bottle, usually with water unless she really wants milk.  <br/>\nBut last night all bottles disappeared in the shuffle and we had a <br/>\nvery angry little girl...  <br/>\n<br/>\n <br/>\n&gt; <br/>\n&gt; Anything you do that creates less comfort is flatly less <br/>\ncomforting.<br/>\n&gt; <br/>\n&gt; And there&#39;s no excuse for kids screaming in the middle of the <br/>\nnight in the <br/>\n&gt; absence of blood.   If they&#39;re not old enough to be quiet if <br/>\nthey&#39;re awake, then <br/>\n&gt; they&#39;re too young to make the decision to stay up.<br/>\n<br/>\n&gt; <br/>\n&gt; There are reasons for quiet.   Quiet doesn&#39;t have to be &quot;get in <br/>\nbed with the <br/>\n&gt; lights out and go to sleep or get a spanking.&quot;   There&#39;s a wide <br/>\nworld of <br/>\n&gt; option between that and screaming at 3:00 a.m.   They are <br/>\nabsolutely and not even <br/>\n&gt; NEAR the only two choices. <br/>\n<br/>\nHmmm, did I insinuate otherwise?   As I said (I think) Jacob has <br/>\nalways stayed up late, quietly reading or on his computer or <br/>\nwhatever.  If the others are up, it is usually fine--TV, books, <br/>\nmaybe a low key game.  When the older ones are tired, they go to <br/>\nbed.  The yelling at each other has occurred three times in the past <br/>\nweek, so I need to contemplate what is going on to create this new <br/>\nbehavior.  Perhaps is has been from recent discussions to reinstate <br/>\nvisits with dad? (Just rhetorical musing on my part...) <br/>\n   <br/>\n&gt; <br/>\n&gt; -=- Do I sound like I am blaming him?  I<br/>\n&gt; hope not,-=-<br/>\n&gt; <br/>\n&gt; You&#39;ve got to be kidding.<br/>\n<br/>\nYeah, I know, I know...<br/>\n<br/>\n&gt; You wrote this:<br/>\n&gt; <br/>\n&gt; -=-It&#39;s really Jacob&#39;s current decision to antagonize everyone in <br/>\nthe <br/>\n&gt; house. -=-<br/>\n&gt; <br/>\n&gt; It&#39;s not &quot;really&quot; his decision; he&#39;s needy.<br/>\n<br/>\n<br/>\nYeah, I know.<br/>\n<br/>\n&gt; <br/>\n&gt; -=-  I&#39;ve tried talking to him about why this is going on and what <br/>\nwould be <br/>\n&gt; helpful.-=-<br/>\n&gt; <br/>\n&gt; He probably doesn&#39;t know what would be helpful.   You&#39;re grown and <br/>\nyou&#39;re not <br/>\n&gt; figuring it out, so don&#39;t expect him to know.<br/>\n<br/>\nWell, I have some ideas.  We just can&#39;t change all the contributing <br/>\nfactors.  But he can&#39;t take his frustrations out on the other <br/>\nchildren either.  We are working on it.<br/>\n<br/>\n<br/>\n&gt; <br/>\n&gt; -=-Most days I just think of how much better our lives have been <br/>\nsince<br/>\n&gt; we don&#39;t live with their father anymore, even considering <br/>\nJossilyn&#39;s<br/>\n&gt; diagnosis. -=-<br/>\n&gt; <br/>\n&gt; Do the kids feel the same way?<br/>\n&gt; Does Jacob feel his life is better?   <br/>\n&gt; (You don&#39;t need to answer that on the list, but you should <br/>\nconsider it inside <br/>\n&gt; yourself.)<br/>\n<br/>\n<br/>\nOh, I can answer on list and the answer is a resounding YES!  Jacob <br/>\nwas his father&#39;s favorite scapegoat.  I know he still has <br/>\nconflicting emotions about his father but he has come to an <br/>\nacceptance (of sorts) of his father&#39;s limitations.  This does not <br/>\nmean that it is easy for him.  In fact, its tough and it sucks for <br/>\nall of them.<br/>\n<br/>\n&gt; <br/>\n&gt; Be careful of using &quot;we&quot; and &quot;our&quot; if you can&#39;t really speak for <br/>\neveryone in <br/>\n&gt; the group.   <br/>\n&gt; Maybe you&#39;re right and &quot;our&quot; was the thing to use, but it sounds <br/>\npretty close <br/>\n&gt; to unmanageable, and maybe therapy for the dad and the marriage <br/>\nwould have <br/>\n&gt; been better than a divorce.   Maybe not, but you&#39;ve made choices <br/>\nthat affect <br/>\n&gt; other people, and you might need to make that up to them, and be <br/>\nsensitive to <br/>\n&gt; that.<br/>\n<br/>\nI will completely take responsibility for the decisions I have <br/>\nmade.  It is not so unmanageable now as it sounds, believe it or <br/>\nnot.  I posted in a state of high frustration, which I should know <br/>\nbetter than to do but there you have it.  Ross(their father) is in <br/>\ntherapy, has been in therapy and there is little improvment to be <br/>\nexpected given his &quot;diagnosis.&quot;  Given the fact that he still <br/>\nCOMPLETELY denies that there is any problem after more than two <br/>\nyears of therapy, and a few different psych evals, improvement will <br/>\nbe a loonnggg time coming.  The description of NPD does not even <br/>\nbegin to convey the difficulty of living with someone who is that <br/>\nway.  (I am not a big fan of the label wagon, but this one has <br/>\nhelped return sanity to my life.) <br/>\n<br/>\n<br/>\n<br/>\n&gt; <br/>\n&gt; -=-Do I sound like I am blaming him?  I hope not-=-<br/>\n&gt; -=-It&#39;s really Jacob&#39;s current decision to antagonize everyone in <br/>\nthe <br/>\n&gt; house.-=-<br/>\n&gt; <br/>\n&gt; When you post to this list, please be as kind toward your children <br/>\nas you can <br/>\n&gt; be, and please be as carefully honest as you can be.   If you <br/>\nhoped it didn&#39;t <br/>\n&gt; sound like you were blaming him, you could have edited the <br/>\nparagraph.   The <br/>\n&gt; simple act of editing your paragraph to make it consistent would <br/>\nhave been <br/>\n&gt; therapeutic and revealing for you.<br/>\n<br/>\nActually, I did edit the paragraph because as it was first written, <br/>\nit was completely unacceptable and not true.   I mean, even worse <br/>\nthan what it ended up as, &#39;cause that is unacceptable and not true <br/>\nalso.  To be honest, I guess I knew it still sounded blaming but I <br/>\njust didn&#39;t know how to say what I wanted to say.  Heck, I&#39;ll skip <br/>\nthe excuses.  I was operating on about 3 hours sleep when I wrote it <br/>\nand was still pissed off.  Meanwhile, all the kids except Josie were <br/>\nstill sleeping.  After I wrote about it, I felt better and we have <br/>\nhad a good day.  We are all in the living room watching the <br/>\nDiscovery channel.  Kaylin is asleep on the floor and Josie is out <br/>\non the futon.  Life seems normal. <br/>\n<br/>\n   <br/>\n&gt; <br/>\n&gt; -=-when it is 3AM and I am woken up by kids screaming at<br/>\n&gt; each other over purposely annoying behavior, I am NOT a happy<br/>\n&gt; person.-=-<br/>\n&gt; <br/>\n&gt; It doesn&#39;t sound like they&#39;re happy people either, but at 3:00 <br/>\nyour house <br/>\n&gt; should REALLY be quiet.   There are probably laws being violated <br/>\nif anyone is <br/>\n&gt; your house is screaming at 3:00 a.m. unless you live way out in <br/>\nthe country with <br/>\n&gt; no neighbors.   You could quite honestly tell your children that <br/>\npolice or <br/>\n&gt; social services people could step in if they can&#39;t be quiet from <br/>\n10:00 at night <br/>\n&gt; to morning on &quot;school nights,&quot; because that&#39;s the plain and honest <br/>\ntruth.   But <br/>\n&gt; don&#39;t shame them about it, because you decided not to have a <br/>\nbedtime without <br/>\n&gt; having corresponding deals in place to make it safe and peaceful <br/>\nat night.   <br/>\n<br/>\nThere has never been a need to spell out a &quot;corresponding deal&quot; <br/>\nbecause it has never been a problem.  I never expected it to be a <br/>\nproblem.<br/>\n  <br/>\n<br/>\n&gt; EVERYone in your family needs quiet and peace, but you&#39;re the <br/>\noldest and wisest <br/>\n&gt; and it&#39;s your responsibility.<br/>\n&gt; <br/>\n&gt; Sandra </span></blockquote></div>","specialLinks":[]},{"userId":1379016,"authorName":"Kathleen Whitfield","from":"Kathleen Whitfield &lt;kmckernan@...&gt;","profile":"kathwhit2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Bedtimes...","postDate":"1133150220","msgId":110259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJGQUZDMDBDLjQ4MTE4JWttY2tlcm5hbkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGRtZG42aysyajVuQGVHcm91cHMuY29tPg=="},"prevInTopic":110257,"nextInTopic":110261,"prevInTime":110258,"nextInTime":110260,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"Can everyone just bunker down in one big family bed? I ve had two big beds in the living room during particularly tough times in our family. It does sound like","messageBody":"<div id=\"ygrps-yiv-1387339760\">Can everyone just bunker down in one big family bed? I&#39;ve had two big beds<br/>\nin the living room during particularly tough times in our family. It does<br/>\nsound like a time to bring everyone closer, if they&#39;re willing and if that&#39;s<br/>\nOK for your daughter&#39;s recovery. It could be one big slumber party for a<br/>\nwhile. Acknowledging the stress everyone is going through might make them<br/>\nfeel somewhat better. Missing both parents for a while had to have been very<br/>\ndifficult.<br/>\n<br/>\nI also wanted to say that my just-shy-of-4-year-old also frequently insists<br/>\nthat *I* do everything for her -- and I&#39;m only rarely gone from her, never<br/>\nfor more than an hour or two.<br/>\n<br/>\nKathleen</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Bedtimes...","postDate":"1133146013","msgId":110257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1OC41ZDdlOTYxNC4zMGJiYzk5ZEBhb2wuY29tPg=="},"prevInTopic":110256,"nextInTopic":110259,"prevInTime":110256,"nextInTime":110258,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"... That being the case, perhaps you need special restrictions for a while in the house so that she can recover and YOU can recover.   But why can t all people","messageBody":"<div id=\"ygrps-yiv-1676081709\">In a message dated 11/27/05 7:09:33 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jorie6568@...\">jorie6568@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On top of not being able to afford<br/>\n&gt; it, Jossilyn&#39;s post-transplant restrictions are very conservative.  No<br/>\n&gt; one is allowed in the house and she can&#39;t go inside anywhere except<br/>\n&gt; our house, clinic, or hospital.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>That being the case, perhaps you need special restrictions for a while in the <br/>\nhouse so that she can recover and YOU can recover.   But why can&#39;t all people <br/>\nbe in the same room (those who want to?) And why can&#39;t that baby have a <br/>\nbottle to go to sleep?   If you&#39;re worried about sugar, maybe water?   <br/>\n<br/>\nAnything you do that creates less comfort is flatly less comforting.<br/>\n<br/>\nAnd there&#39;s no excuse for kids screaming in the middle of the night in the <br/>\nabsence of blood.   If they&#39;re not old enough to be quiet if they&#39;re awake, then <br/>\nthey&#39;re too young to make the decision to stay up.<br/>\n<br/>\nThere are reasons for quiet.   Quiet doesn&#39;t have to be &quot;get in bed with the <br/>\nlights out and go to sleep or get a spanking.&quot;   There&#39;s a wide world of <br/>\noption between that and screaming at 3:00 a.m.   They are absolutely and not even <br/>\nNEAR the only two choices.   <br/>\n<br/>\n-=- Do I sound like I am blaming him?  I<br/>\nhope not,-=-<br/>\n<br/>\nYou&#39;ve got to be kidding.<br/>\nYou wrote this:<br/>\n<br/>\n-=-It&#39;s really Jacob&#39;s current decision to antagonize everyone in the <br/>\nhouse. -=-<br/>\n<br/>\nIt&#39;s not &quot;really&quot; his decision; he&#39;s needy.<br/>\n<br/>\n-=-  I&#39;ve tried talking to him about why this is going on and what would be <br/>\nhelpful.-=-<br/>\n<br/>\nHe probably doesn&#39;t know what would be helpful.   You&#39;re grown and you&#39;re not <br/>\nfiguring it out, so don&#39;t expect him to know.<br/>\n<br/>\n-=-Most days I just think of how much better our lives have been since<br/>\nwe don&#39;t live with their father anymore, even considering Jossilyn&#39;s<br/>\ndiagnosis. -=-<br/>\n<br/>\nDo the kids feel the same way?<br/>\nDoes Jacob feel his life is better?   <br/>\n(You don&#39;t need to answer that on the list, but you should consider it inside <br/>\nyourself.)<br/>\n<br/>\nBe careful of using &quot;we&quot; and &quot;our&quot; if you can&#39;t really speak for everyone in <br/>\nthe group.   <br/>\nMaybe you&#39;re right and &quot;our&quot; was the thing to use, but it sounds pretty close <br/>\nto unmanageable, and maybe therapy for the dad and the marriage would have <br/>\nbeen better than a divorce.   Maybe not, but you&#39;ve made choices that affect <br/>\nother people, and you might need to make that up to them, and be sensitive to <br/>\nthat.<br/>\n<br/>\n-=-Do I sound like I am blaming him?  I hope not-=-<br/>\n-=-It&#39;s really Jacob&#39;s current decision to antagonize everyone in the <br/>\nhouse.-=-<br/>\n<br/>\nWhen you post to this list, please be as kind toward your children as you can <br/>\nbe, and please be as carefully honest as you can be.   If you hoped it didn&#39;t <br/>\nsound like you were blaming him, you could have edited the paragraph.   The <br/>\nsimple act of editing your paragraph to make it consistent would have been <br/>\ntherapeutic and revealing for you.<br/>\n<br/>\n-=-when it is 3AM and I am woken up by kids screaming at<br/>\neach other over purposely annoying behavior, I am NOT a happy<br/>\nperson.-=-<br/>\n<br/>\nIt doesn&#39;t sound like they&#39;re happy people either, but at 3:00 your house <br/>\nshould REALLY be quiet.   There are probably laws being violated if anyone is <br/>\nyour house is screaming at 3:00 a.m. unless you live way out in the country with <br/>\nno neighbors.   You could quite honestly tell your children that police or <br/>\nsocial services people could step in if they can&#39;t be quiet from 10:00 at night <br/>\nto morning on &quot;school nights,&quot; because that&#39;s the plain and honest truth.   But <br/>\ndon&#39;t shame them about it, because you decided not to have a bedtime without <br/>\nhaving corresponding deals in place to make it safe and peaceful at night.   <br/>\nEVERYone in your family needs quiet and peace, but you&#39;re the oldest and wisest <br/>\nand it&#39;s your responsibility.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":71749548,"authorName":"Marge Adams","from":"&quot;Marge Adams&quot; &lt;jorie6568@...&gt;","profile":"jorie6568","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Bedtimes...","postDate":"1133144419","msgId":110256,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRtZHBoMythNHJuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQzOEE0NTI1LjUwNDAxMDZAY294Lm5ldD4="},"prevInTopic":110255,"nextInTopic":110257,"prevInTime":110255,"nextInTime":110257,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"... situation ... _you_ ... be. ... while ... hire ... that you ... Well, the hiring is out due to Jossilyn s post-transplant restictions.  And I HAVE talked","messageBody":"<div id=\"ygrps-yiv-2064451200\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Lisa M. Cottrell <br/>\nBentley&quot; &lt;cottrellbentley@c...&gt; wrote:<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Sleep doesn&#39;t have to exist only at night.  I&#39;d discuss the <br/>\n </span></blockquote>situation <br/>\n<blockquote><span title=\"ireply\"> &gt; with your kids.  They might have some great ideas about how to get <br/>\n </span></blockquote>_you_ <br/>\n<blockquote><span title=\"ireply\"> &gt; completely rested so that you can be the best mother that you can <br/>\n </span></blockquote>be. <br/>\n<blockquote><span title=\"ireply\"> &gt; Since you have older children, could they watch the younger ones <br/>\n </span></blockquote>while <br/>\n<blockquote><span title=\"ireply\"> &gt; you napped?  Can you sleep only when the youngest sleeps?  Can you <br/>\n </span></blockquote>hire <br/>\n<blockquote><span title=\"ireply\"> &gt; a mother&#39;s helper for a couple of hours in the early morning so <br/>\n </span></blockquote>that you <br/>\n<blockquote><span title=\"ireply\"> &gt; could sleep or spend time with a subset of your children?  Sleep <br/>\n&gt; deprivation is a difficult situation!<br/>\n&gt; <br/>\n&gt; -Lisa in AZ<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Well, the hiring is out due to Jossilyn&#39;s post-transplant <br/>\nrestictions.  And I HAVE talked with them, and they are really <br/>\nhelpful.  Unfortunately, Kaylin(4) just wants me ALL the time--no <br/>\none can get anything for her, do anything for her, etc. except me.  <br/>\n(She hasn&#39;t always been like this, it&#39;s just since the cancer <br/>\ndiagnosis and treatment when I was gone so much.  I do hope and <br/>\nexpect that to get better over time.) <br/>\n<br/>\nIt&#39;s really Jacob&#39;s current decision to antagonize everyone in the <br/>\nhouse.  There are all kinds of dynamics going on, with a variety of <br/>\ncontributing factors.  One aspect is that he really misses that time <br/>\nwe used to share after everyone went to bed.  I&#39;ve tried talking to <br/>\nhim about why this is going on and what would be helpful.<br/>\nI&#39;ve tried arranging one on one time, which can be a challenge.  But <br/>\nit seems like its not enough... Do I sound like I am blaming him?  I <br/>\nhope not, but when it is 3AM and I am woken up by kids screaming at <br/>\neach other over purposely annoying behavior, I am NOT a happy <br/>\nperson. <br/>\n<br/>\nMost days I just think of how much better our lives have been since <br/>\nwe don&#39;t live with their father anymore, even considering Jossilyn&#39;s <br/>\ndiagnosis.  I expect this will sort out and become one of those &quot;Do <br/>\nyou remember when...&quot; things.    <br/>\n<br/>\nMarge</div>","specialLinks":[]},{"userId":71749548,"authorName":"Marge Adams","from":"&quot;Marge Adams&quot; &lt;jorie6568@...&gt;","profile":"jorie6568","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Bedtimes...","postDate":"1133142036","msgId":110255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRtZG42aysyajVuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDN0MxQjVBNjk3QUQwRi00MzAtQzgyOEBGV00tRDE5LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":110252,"nextInTopic":110256,"prevInTime":110254,"nextInTime":110256,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"... I don t really have that option.  On top of not being able to afford it, Jossilyn s post-transplant restrictions are very conservative.  No one is allowed","messageBody":"<div id=\"ygrps-yiv-2145493146\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, kbcdlovejo@a... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d really consider hiring help!<br/>\n&gt;  <br/>\n&gt; ~Kelly<br/>\n<br/>\n </span></blockquote>I don&#39;t really have that option.  On top of not being able to afford <br/>\nit, Jossilyn&#39;s post-transplant restrictions are very conservative.  No <br/>\none is allowed in the house and she can&#39;t go inside anywhere except <br/>\nour house, clinic, or hospital.<br/>\n<br/>\nMarge</div>","specialLinks":[]},{"userId":100122184,"authorName":"Lisa M. Cottrell Bentley","from":"&quot;Lisa M. Cottrell Bentley&quot; &lt;cottrellbentley@...&gt;","profile":"cottrellbentley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1133135141","msgId":110252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzOEE0NTI1LjUwNDAxMDZAY294Lm5ldD4=","inReplyToHeader":"PGRtY2xsYityc3RqQGVHcm91cHMuY29tPg==","referencesHeader":"PGRtY2xsYityc3RqQGVHcm91cHMuY29tPg=="},"prevInTopic":110250,"nextInTopic":110255,"prevInTime":110251,"nextInTime":110253,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"... Sleep doesn t have to exist only at night.  I d discuss the situation with your kids.  They might have some great ideas about how to get _you_ completely","messageBody":"<div id=\"ygrps-yiv-427656048\"><blockquote><span title=\"ireply\">&gt; I don&#39;t think bedtimes would really <br/>\n&gt; be helpful, but I really need some sleep.  <br/>\n<br/>\n </span></blockquote>Sleep doesn&#39;t have to exist only at night.  I&#39;d discuss the situation <br/>\nwith your kids.  They might have some great ideas about how to get _you_ <br/>\ncompletely rested so that you can be the best mother that you can be. <br/>\nSince you have older children, could they watch the younger ones while <br/>\nyou napped?  Can you sleep only when the youngest sleeps?  Can you hire <br/>\na mother&#39;s helper for a couple of hours in the early morning so that you <br/>\ncould sleep or spend time with a subset of your children?  Sleep <br/>\ndeprivation is a difficult situation!<br/>\n<br/>\n-Lisa in AZ</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1133129059","msgId":110250,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDN0MxQjVBNjk3QUQwRi00MzAtQzgyOEBGV00tRDE5LnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PGRtY2xsYityc3RqQGVHcm91cHMuY29tPg==","referencesHeader":"PGRtY2xsYityc3RqQGVHcm91cHMuY29tPg=="},"prevInTopic":110238,"nextInTopic":110252,"prevInTime":110249,"nextInTime":110251,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"... From: Marge Adams jorie6568@yahoo.com I m exhausted.  What to do? I wanted to keep this brief, and I don t even know if I was very clear.  I forgot to","messageBody":"<div id=\"ygrps-yiv-421280029\">-----Original Message-----<br/>\nFrom: Marge Adams <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jorie6568@...\">jorie6568@...</a><br/>\n <br/>\n I&#39;m exhausted.  What to do?  <br/>\n<br/>\nI wanted to keep this brief, and I don&#39;t even know if I was very <br/>\nclear.  I forgot to mention that my mother was putting Josie to bed <br/>\nwith a bottle of milk, or attempts at breaking the habit is also <br/>\nadding to bedtime difficulties.  I don&#39;t think bedtimes would really <br/>\nbe helpful, but I really need some sleep.  <br/>\n <br/>\n-=-=--<br/>\n <br/>\nI&#39;d really consider hiring help!<br/>\n <br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":71749548,"authorName":"Marge Adams","from":"&quot;Marge Adams&quot; &lt;jorie6568@...&gt;","profile":"jorie6568","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Bedtimes...","postDate":"1133107691","msgId":110238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRtY2xsYityc3RqQGVHcm91cHMuY29tPg=="},"prevInTopic":91607,"nextInTopic":110250,"prevInTime":110237,"nextInTime":110239,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"Since I have not posted on this list before, I feel a little background is in order before I broach my question.  I will try to be brief... I have 6 children","messageBody":"<div id=\"ygrps-yiv-2128096035\">Since I have not posted on this list before, I feel a little <br/>\nbackground is in order before I broach my question.  I will try to be <br/>\nbrief...<br/>\n<br/>\nI have 6 children ages 19 months, 4,8,11, 13(in Jan) and 14 years.  I <br/>\nleft their father in March 2004 and am now divorced.  (He has many <br/>\nissues and has subsequently been labelled &quot;Narcissistic Personality <br/>\nDisorder.&quot;  His visitation w/the kids has been suspended since May <br/>\n2005 by CPS because of some bizarre behavior on his part--loonng <br/>\nstory.)  My oldest three spent some time in ps (2,3, qnd 4 years <br/>\nrespectively)  Jossilyn (now 8) had not gone to ps at all until last <br/>\nfall.  She begged to go and I allowed others to convince me it would <br/>\nbe &quot;easier&quot; to send the kids back to ps--boy were they ever wrong!!  A <br/>\nfew weeks into the year they were all back at home.  We have always <br/>\nbeen more unschoolers towards &quot;school stuff&quot; but their father is a <br/>\nmajor control freak so had strict rules for just about everything.<br/>\n<br/>\n  In May Jossilyn was diagnosed with AML (acute myeloid leukemia.)  <br/>\nShe and I spent most of the summer in the hospital 90 miles from home <br/>\nand in August we went to Boston (210 miles away) for a bone marrow <br/>\ntransplant.  We came home in Oct.  (Her father was allowed visits in <br/>\nhospital w/Jossilyn--the others still haven&#39;t seen him since May.)<br/>\nThe kids stayed with my parents--not great but...--and with good <br/>\nfriends--better but limited time possible.<br/>\n<br/>\nNow that we are home, everyone wants to be with Mom.  Which brings me <br/>\nto the bedtime question.  Pre-cancer, the little ones went to bed <br/>\nearlier--between 8-9pm.  The baby was nursing and Kaylin would go to <br/>\nbed with us and fall asleep.  The others would wander off to bed at <br/>\nvarious times, usually leaving Jacob and I and sometimes Kelsey to <br/>\nstay up later.  Jacob(almost 13) has ALWAYS been a nightowl and would <br/>\noften read in bed until 2am even when he was 8.  Those late nights <br/>\nkind of became &quot;our&quot; time to chat or whatever.  Kelsey (14)joining us <br/>\nwas never a problem because he has always been close to her.<br/>\n<br/>\nOver the summer things changed, of course.  Kaylin had no bedtime, and <br/>\nwould just fall asleep where-ever and when-ever.  My mother &quot;made&quot; the <br/>\nolder kids go to bed by 11, which they did not fuss about.  In the <br/>\nhospital, Jossilyn developed a new schedule, often staying up until <br/>\n2am watching TV.  She had always been a very active, healthy child and <br/>\nthe inactivity and confinement were tough.  Still, not a problem.<br/>\n<br/>\nNow that we are home NO ONE WANTS TO GO TO BED!  Even if they are so <br/>\ntired they just can&#39;t stand themselves.  Still, I understand that they <br/>\nmissed me and the little ones have separation anxiety, etc.  I could <br/>\ndeal with it.  But the older ones really miss &quot;our&quot; time together <br/>\nwithout the littles.  I&#39;ve tried putting them to bed, but the instant <br/>\nI get back up, Kaylin wakes up screaming.  Or she bugs Josie so she <br/>\nwon&#39;t go to sleep.  To top it all off, when the others do go to bed <br/>\nJacob has taken to harassing the others until the entire house is in <br/>\nan uproar and we are lucky to settle down by 3am.  Josie is usually up <br/>\nby 7am, like clockwork so I get up with her.  Naps are scarce.  I&#39;m <br/>\nexhausted.  What to do?  <br/>\n<br/>\nI wanted to keep this brief, and I don&#39;t even know if I was very <br/>\nclear.  I forgot to mention that my mother was putting Josie to bed <br/>\nwith a bottle of milk, or attempts at breaking the habit is also <br/>\nadding to bedtime difficulties.  I don&#39;t think bedtimes would really <br/>\nbe helpful, but I really need some sleep.  <br/>\nMarge</div>","specialLinks":[]},{"userId":140885507,"authorName":"Kathleen Gehrke","from":"&quot;Kathleen Gehrke&quot; &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedtimes...","postDate":"1078432721","msgId":91607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMyODQ0aCtyNHV0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTctRjEwNGttcE5DSkp4c3YwMDAzYTg2M0Bob3RtYWlsLmNvbT4="},"prevInTopic":91605,"nextInTopic":110238,"prevInTime":91606,"nextInTime":91608,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"My kids love their spin brushes.. Sometimes brushing far more than needed. Also in the evenning I usually put my comfy clothes on. THe kids do too. They get","messageBody":"<div id=\"ygrps-yiv-730724094\">My kids love their spin brushes.. Sometimes brushing far more than <br/>\nneeded. Also in the evenning I usually put my comfy clothes on. THe <br/>\nkids do too. They get sweats or jammies and then we play or whatever <br/>\nin our &#39;nightclothes&#39;. My four year old put her nightclothes on <br/>\ntoday.. Cause she likes them.. <br/>\nKathleen--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Erika Nunn&quot; <br/>\n&lt;erikanunn@h...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Everybody - thank you for your advice regarding the teeth.  Now <br/>\n </span></blockquote>that I know <br/>\n<blockquote><span title=\"ireply\"> &gt; my kids aren&#39;t in grave danger of their teeth rotting if I don&#39;t <br/>\n </span></blockquote>religiously <br/>\n<blockquote><span title=\"ireply\"> &gt; brush them before bedtime, I can relax more.  The motorized <br/>\n </span></blockquote>toothbrush idea <br/>\n<blockquote><span title=\"ireply\"> &gt; is great too....as well as me brushing with them.<br/>\n&gt; <br/>\n&gt; And as far as pajamas go....why was I so worried about that to <br/>\n </span></blockquote>begin with?  <br/>\n<blockquote><span title=\"ireply\"> &gt; I would feel guilty if I thought my kids were not comfortable at <br/>\n </span></blockquote>night....<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Amazing how I believe there are certain things that I feel that <br/>\n </span></blockquote>I &quot;have&quot; to <br/>\n<blockquote><span title=\"qreply\"> &gt; do.  Now I am moving on and breathing a sigh of relief....<br/>\n&gt; <br/>\n&gt; Erika  :)<br/>\n&gt; <br/>\n&gt; _________________________________________________________________<br/>\n&gt; FREE pop-up blocking with the new MSN Toolbar  get it now! <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://clk.atdmt.com/AVE/go/onm00200415ave/direct/01/\">http://clk.atdmt.com/AVE/go/onm00200415ave/direct/01/</a> </span></blockquote></div>","specialLinks":[]},{"userId":140408439,"authorName":"Erika Nunn","from":"&quot;Erika Nunn&quot; &lt;erikanunn@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1078425956","msgId":91605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjEwNGttcE5DSkp4c3YwMDAzYTg2M0Bob3RtYWlsLmNvbT4="},"prevInTopic":91603,"nextInTopic":91607,"prevInTime":91604,"nextInTime":91606,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"Everybody - thank you for your advice regarding the teeth.  Now that I know my kids aren t in grave danger of their teeth rotting if I don t religiously brush","messageBody":"<div id=\"ygrps-yiv-926521485\">Everybody - thank you for your advice regarding the teeth.  Now that I know <br/>\nmy kids aren&#39;t in grave danger of their teeth rotting if I don&#39;t religiously <br/>\nbrush them before bedtime, I can relax more.  The motorized toothbrush idea <br/>\nis great too....as well as me brushing with them.<br/>\n<br/>\nAnd as far as pajamas go....why was I so worried about that to begin with?  <br/>\nI would feel guilty if I thought my kids were not comfortable at night....<br/>\n<br/>\nAmazing how I believe there are certain things that I feel that I &quot;have&quot; to <br/>\ndo.  Now I am moving on and breathing a sigh of relief....<br/>\n<br/>\nErika  :)<br/>\n<br/>\n_________________________________________________________________<br/>\nFREE pop-up blocking with the new MSN Toolbar � get it now! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://clk.atdmt.com/AVE/go/onm00200415ave/direct/01/\">http://clk.atdmt.com/AVE/go/onm00200415ave/direct/01/</a></div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Cavities, was bedtimes","postDate":"1078411498","msgId":91597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjUwMWM0MDFmNyQ0NDk0MzUxMCQ2NDAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PDE0MS4yMzliNTI1Ny4yZDc4NGE0OEBhb2wuY29tPg=="},"prevInTopic":91596,"nextInTopic":91603,"prevInTime":91596,"nextInTime":91598,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"We recently switched dentists, cause the first one was obnoxious (although highly recommended by everyone I asked).  Dentist 1 had said that Lydia had 2","messageBody":"<div id=\"ygrps-yiv-503325313\">We recently switched dentists, cause the first one was obnoxious (although highly recommended by everyone I asked).  Dentist 1 had said that Lydia had 2 cavities, we got one filled by him and then switched dentists because I was so unhappy with his behavior during the filling.  The Dentist 2 said that Dentist 1 had taken the xrays wrong and that Lydia did *not* have a second cavity.   Made me wonder about being paid by the procedure also. <br/>\n<br/>\nLydia didn&#39;t brush with toothpaste until she was over 6, and now uses a toothpaste that is &quot;low foaming&quot; which she likes. The toothpaste cap also plays music for the lenght of time you are supposed to brush - which is corny but she really likes it. <br/>\n<br/>\nWe never forced brushing (although we did a lot of playing, like counting teeth and singing songs, etc., when she was younger).  About 3 days a week, brushing just didn&#39;t happen.  She has had only the one cavity (which I am now suspicious of whether she had it or not).  I agree with the people who think cavities are largely controlled by genes. <br/>\n<br/>\nOddly enough, Jonathan (16 months) LOVES to brush his teeth.  He brushes his teeth (pretty well, too, I might add - of course, he only has 10) every time we go into the bathroom.  I guess it is just somehting that he sees adults and his older sister doing.  <br/>\n<br/>\nBack to the rest of the original issue, also - the kids and I all wear loose cotton clothes all day and usually sleep in them.  Lydia does have some princess nightgowns which she sometimes chooses to wear -- but mostly she sleeps in clothes. <br/>\n<br/>\n-Cat  <br/>\n<br/>\n<br/>\nBasically, I think when a dentist who is paid by how many procedures he does <br/>\nlike in the US, suggests something then get a second and third opinion before submitting your child to a lifetime of fillings.  <br/>\n<br/>\nShyrley who gets all Grrrr at dentists<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":140885507,"authorName":"Kathleen Gehrke","from":"&quot;Kathleen Gehrke&quot; &lt;gehrkes@...&gt;","profile":"gehrkes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedtimes...","postDate":"1078409601","msgId":91596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMyN2RpMStoM2VlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM2MjdDMzdELTZEQjYtMTFEOC04QUU1LTAwMEE5NUUyOTJDNkBtYWMuY29tPg=="},"prevInTopic":91594,"nextInTopic":91597,"prevInTime":91595,"nextInTime":91597,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"... (only ... has a ... since ... try ... sneak in ... including ... My four year old just had to undergo surgery because her teeth were in such horrible","messageBody":"<div id=\"ygrps-yiv-1273387615\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, pam sorooshian <br/>\n&lt;pamsoroosh@m...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; On Mar 3, 2004, at 2:38 PM, brenjenem@a... wrote:<br/>\n&gt; <br/>\n&gt; &gt;        My 9 yo. who brushes his teeth the least has the fewest <br/>\n </span></blockquote>(only <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; one or<br/>\n&gt; &gt; two) cavities. My middle one, 6yo, brushes most of the time and <br/>\n </span></blockquote>has a <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; few more<br/>\n&gt; &gt; than him and now the little one has horrible teeth. The dentist <br/>\n&gt; &gt; insists that<br/>\n&gt; &gt; it is bottle rot, even though she has been exclusively nursed <br/>\n </span></blockquote>since <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; birth. They<br/>\n&gt; &gt; said I should stop the night nursings (I didn&#39;t though). I just <br/>\n </span></blockquote>try <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; harder to<br/>\n&gt; &gt; clean her teeth before bed and sometimes during the night I <br/>\n </span></blockquote>sneak in <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; there<br/>\n&gt; &gt; and wipe them. Anyway, she&#39;s had extensive dental work done <br/>\n </span></blockquote>including <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; at least 5<br/>\n&gt; &gt; root canals and 2 caps on her molars so she can chew.<br/>\n&gt; <br/>\n </span></blockquote>My four year old just had to undergo surgery because her teeth were <br/>\nin such horrible shape. THe dentist tried telling me it was because <br/>\nof her diet. I felt horrible. Her diet is really pretty okay, I <br/>\nthought.. Then I talked to her bio grandma.. It is genetic. The <br/>\nfamily has horrible teeth. Grandma said her mother had all gold <br/>\nteeth for her entire life.  Grandma  also said she does not have a <br/>\ntooth that has not been rebuilt. I had a foster daughter that had <br/>\nnot been to a dentist in nine years. She did not have one cavity. <br/>\nShe rarely brushed. I think far more things of that nature are <br/>\ngenetic. <br/>\nKathleen</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Cavities, was bedtimes","postDate":"1078402733","msgId":91594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMyNzZyZCtkZ3J0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE0MS4yMzliNTI1Ny4yZDc4NGE0OEBhb2wuY29tPg=="},"prevInTopic":91593,"nextInTopic":91596,"prevInTime":91593,"nextInTime":91595,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"... Shyrley, this happened to us. We moved from a dentist we trusted to another state without any clue who to go to. We took a recommendation from a friend. ","messageBody":"<div id=\"ygrps-yiv-256376152\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, sblingle@a... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Basically, I think when a dentist who is paid by how many procedures he does <br/>\n&gt; like in the US, suggests something then get a second and third opinion before <br/>\n&gt; submitting your child to a lifetime of fillings. I don&#39;t know any child here <br/>\n&gt; who has root canals. Plently have normal fillings. But in VA they seemed more <br/>\n&gt; common than braces (which are of course, compulsory in the US..;-)    )<br/>\n&gt; <br/>\n&gt; If I&#39;d believed that man my kids would have a mouthful of mercury now.<br/>\n<br/>\n </span></blockquote>Shyrley, this happened to us.<br/>\n<br/>\nWe moved from a dentist we trusted to another state without any clue who to go to. We <br/>\ntook a recommendation from a friend.<br/>\n<br/>\nAcouple of the kids had had one or two cavities but nothing much. Suddenly three out of <br/>\nfive had cavities and one of them supposedly had five cavities!!!<br/>\n<br/>\nI found another dentist who says things like, &quot;Well, I see one developping there but it&#39;s a <br/>\nbaby tooth and if he&#39;s not complaining, let&#39;s just leave it until it falls out.&quot; The interesting <br/>\nthing is that since we switched dentists, only one of my kids has had one cavity (in two <br/>\nyears).<br/>\n<br/>\nFirst dentist: very fancy office.<br/>\n<br/>\nSecond dentist: ugly little out of the way thing.<br/>\n<br/>\nHad the very same thing happen with braces too and did research into the &quot;phase&quot; style <br/>\nbraces treatments. Paid over $7000 for the first child. Have come to the conclusion it&#39;s a <br/>\nmoney making racket. We use the old fashioned style braces for half of the price now.<br/>\n<br/>\nA good friend who gave up his private dentistry practice to do dentistry with the elderly <br/>\n(this is a good man) told us that waiting until your permanent teeth come in is perfectly <br/>\nacceptable for braces treatment and that there will be less likelihood of teeth shifting after <br/>\ntreatment... which is why adults who wear braces wear them for less time and it costs far <br/>\nless money (which we discovered when my dh wore tham at age 32).<br/>\n<br/>\n<br/>\nJulie</div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa H","from":"&quot;Lisa H&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1078400785","msgId":91603,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtREFWMjFsMTU4TkpRRDYwMDAwOGE0N0Bob3RtYWlsLmNvbT4=","referencesHeader":"PGM5LjNlNzFjMjJhLjJkNzdiODU5QGFvbC5jb20+IDwzNjI3QzM3RC02REI2LTExRDgtOEFFNS0wMDBBOTVFMjkyQzZAbWFjLmNvbT4="},"prevInTopic":91597,"nextInTopic":91605,"prevInTime":91602,"nextInTime":91604,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"Brushing teeth has become a bit of a game for us here.  For the past year my five year old is obsessed with counting so we count to ten together while both","messageBody":"<div id=\"ygrps-yiv-2074546717\">Brushing teeth has become a bit of a game for us here.  For the past year my five year old is obsessed with counting so we count to ten together while both brushing our own teeth in one spot at a time.  She now asks me to brush the spots where she can&#39;t reach.  I&#39;ve never forced my kids to brush their teeth as i don&#39;t force them to brush their hair or take a bath or shower.  I was told by a dental hygienist that as long as the plaque is disturbed (brushed) once in a 24hour period that&#39;s enough.<br/>\n<br/>\nAs for pjs.  Well clothes choices are just that - choices...my kids sleep in anything from pjs to the clothes they&#39;ve worn that day to nothing at all.<br/>\n<br/>\nLisa Heyman.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":170863101,"authorName":"sblingle@aol.com","from":"sblingle@...","profile":"bobalinga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Cavities, was bedtimes","postDate":"1078390856","msgId":91593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0MS4yMzliNTI1Ny4yZDc4NGE0OEBhb2wuY29tPg=="},"prevInTopic":91592,"nextInTopic":91594,"prevInTime":91592,"nextInTime":91594,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/3/2004 8:08:50 PM Pacific Standard Time, ... I m beginning to wonder about all these cavities, especially in the US. My kids had a dental","messageBody":"<div id=\"ygrps-yiv-1636738248\">In a message dated 3/3/2004 8:08:50 PM Pacific Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joylyn@...\">joylyn@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; did a lot of research on the cause of cavities (from the perspective <br/>\n&gt; of:  Does breastfeeding/breastmilk cause cavities.)  It doesn&#39;t.  In <br/>\n&gt; fact, it makes teeth stronger.  Not to toot my own horn, but go to this <br/>\n&gt; site to see my article...<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lalecheleague.org/NB/NBSepOct02p164.html\">http://www.lalecheleague.org/NB/NBSepOct02p164.html</a><br/>\n&gt; <br/>\n&gt; Joylyn<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I&#39;m beginning to wonder about all these cavities, especially in the US. My <br/>\nkids had a dental exam just before we moved to VA. All fine, no cavities etc <br/>\netc, one might need braces as his teeth were crowded.<br/>\nWe then saw a dentist 6 months later in VA. He said Heather was clear, Bryn <br/>\nhad a grey area that *might* become a cavity but lets wait and see and Rhodri <br/>\nwas fine apart from having 5 teeth knocked out with a golf club.<br/>\n8 months later we saw a paediatric dentist as the first had stopped seeing <br/>\nchildren. Very swish offices....<br/>\nAccording to him, Heather had 9 cavities, Bryn none and Rhodri 5. They all <br/>\nneeded pre-brace braces. He strated talking payment plans etc etc. I told him <br/>\nI&#39;d think about it as we were moving home shortly.<br/>\nBack home we went to see a dentist and gosh, no cavities anywhere. I told him <br/>\nabout the VA dentist and he was shocked. He said the kids teeth were fine and <br/>\nthat it is extremely rare that a child under about 12 needs something as <br/>\ndrastic as root canal. Root canals trap bacteria inside the tooth and lead the <br/>\nproblems later. They are nasty things and to be avoided unless you have an abcess <br/>\nunder that tooth that can&#39;t be drained any other way.<br/>\n<br/>\nBasically, I think when a dentist who is paid by how many procedures he does <br/>\nlike in the US, suggests something then get a second and third opinion before <br/>\nsubmitting your child to a lifetime of fillings. I don&#39;t know any child here <br/>\nwho has root canals. Plently have normal fillings. But in VA they seemed more <br/>\ncommon than braces (which are of course, compulsory in the US..;-)    )<br/>\n<br/>\nIf I&#39;d believed that man my kids would have a mouthful of mercury now.<br/>\n<br/>\nShyrley who gets all Grrrr at dentists<br/>\n<br/>\nif everyone owned a car, what a smelly, dangerous, noisy, stressful, <br/>\nunhealthy, expensive society this would be... oh, wait... it is! <br/>\n    <br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1078389036","msgId":91592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2MjdDMzdELTZEQjYtMTFEOC04QUU1LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGM5LjNlNzFjMjJhLjJkNzdiODU5QGFvbC5jb20+","referencesHeader":"PGM5LjNlNzFjMjJhLjJkNzdiODU5QGFvbC5jb20+"},"prevInTopic":91591,"nextInTopic":91593,"prevInTime":91591,"nextInTime":91593,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"... Sounds genetic. My kids brushed their own teeth since they could and I didn t clean their teeth before that except occasionally.  I know they aren t","messageBody":"<div id=\"ygrps-yiv-769853091\">On Mar 3, 2004, at 2:38 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brenjenem@...\">brenjenem@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;        My 9 yo. who brushes his teeth the least has the fewest (only <br/>\n&gt; one or<br/>\n&gt; two) cavities. My middle one, 6yo, brushes most of the time and has a <br/>\n&gt; few more<br/>\n&gt; than him and now the little one has horrible teeth. The dentist <br/>\n&gt; insists that<br/>\n&gt; it is bottle rot, even though she has been exclusively nursed since <br/>\n&gt; birth. They<br/>\n&gt; said I should stop the night nursings (I didn&#39;t though). I just try <br/>\n&gt; harder to<br/>\n&gt; clean her teeth before bed and sometimes during the night I sneak in <br/>\n&gt; there<br/>\n&gt; and wipe them. Anyway, she&#39;s had extensive dental work done including <br/>\n&gt; at least 5<br/>\n&gt; root canals and 2 caps on her molars so she can chew.<br/>\n<br/>\n </span></blockquote>Sounds genetic. My kids brushed their own teeth since they could and I <br/>\ndidn&#39;t clean their teeth before that except occasionally.  I know they <br/>\naren&#39;t brushing after meals - just usually at night and in the morning. <br/>\nThree kids - one little tiny cavity between them all - just a spot on <br/>\nthe surface that was zapped off, but no filling.<br/>\n<br/>\nMy husband never saw a dentist until he was 26 years old. He had ONE <br/>\nproblem in one tooth at that time. I think my kids got lucky - good <br/>\nteeth genes.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Bedtimes...","postDate":"1078388364","msgId":91591,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE1M0YzNEM0LTZEQjQtMTFEOC04QUU1LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PGMyNWMyMCtsbWk4QGVHcm91cHMuY29tPg==","referencesHeader":"PGMyNWMyMCtsbWk4QGVHcm91cHMuY29tPg=="},"prevInTopic":91590,"nextInTopic":91592,"prevInTime":91590,"nextInTime":91592,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"Oh yeah - our pediatric dentist told me that the important thing was getting teeth brushed at least once every 24 hours and not to do it at bedtime if it was a","messageBody":"<div id=\"ygrps-yiv-1132978830\">Oh yeah - our pediatric dentist told me that the important thing was <br/>\ngetting teeth brushed at least once every 24 hours and not to do it at <br/>\nbedtime if it was a bad time (I&#39;m like you, really tired and NOT filled <br/>\nwith calm and patience at night). He said that it was nice to brush <br/>\nteeth after every meal and at bedtime, but that realistically what <br/>\nreally mattered was just getting them done sometime each day.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 3, 2004, at 11:35 AM, Julie Bogart wrote:<br/>\n<br/>\n&gt; Two ideas: Keep the brushes in the kitchen and brush right after <br/>\n&gt; dinner instead of waiting<br/>\n&gt; until bedtime. If it&#39;s part of the dinner routine, perhaps it won&#39;t <br/>\n&gt; feel like they&#39;re being<br/>\n&gt; yanked away from what they are doing at the time.<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations. </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1078387694","msgId":91590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NDU1NkZELTZEQjMtMTFEOC04QUU1LTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PEJBWTctRjEwb1RrMm03THZTVkQwMDAzYzAwY0Bob3RtYWlsLmNvbT4=","referencesHeader":"PEJBWTctRjEwb1RrMm03THZTVkQwMDAzYzAwY0Bob3RtYWlsLmNvbT4="},"prevInTopic":91589,"nextInTopic":91591,"prevInTime":91589,"nextInTime":91591,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"They can brush their own teeth, Erika. If you re worried about them doing a good job, get them the little battery operated ones - they do a good job. AND -","messageBody":"<div id=\"ygrps-yiv-1447248772\">They can brush their own teeth, Erika. If you&#39;re worried about them  <br/>\ndoing a good job, get them the little battery operated ones - they do a  <br/>\ngood job. AND - they don&#39;t need toothpaste - maybe that&#39;s part of what  <br/>\nthey don&#39;t like about it. They can sit and watch tv with the electric  <br/>\ntoothbrush in their mouth and that&#39;ll work fine. Show them how to use  <br/>\nit - going over each surface of each tooth.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mar 3, 2004, at 10:42 AM, Erika Nunn wrote:<br/>\n<br/>\n&gt; Hey all,<br/>\n&gt;<br/>\n&gt; I have a question for everybody.  First off, our household is way more<br/>\n&gt; relaxed ever since I let go of controlling my kid&#39;s eating, TV  <br/>\n&gt; watching,<br/>\n&gt; bedtimes (my kids are ages 3 and 4).  I am happier, my husband is  <br/>\n&gt; happier,<br/>\n&gt; and my kids are happier.  However, there is still one event that takes  <br/>\n&gt; place<br/>\n&gt; every evening that seems to still send everybody into a tizzy.  The  <br/>\n&gt; simple<br/>\n&gt; act of brushing my children&#39;s teeth and getting them into something<br/>\n&gt; comfortable to wear to bed.<br/>\n&gt;<br/>\n&gt; It usually goes something like this....I get tired and inform my  <br/>\n&gt; children<br/>\n&gt; that I am going to go lie down soon and that I want to brush their  <br/>\n&gt; teeth and<br/>\n&gt; get them ready for bed.  This is met with, &quot;I don&#39;t want to go to  <br/>\n&gt; bed!&quot;  I<br/>\n&gt; explain that they don&#39;t have to go to bed, but that they need their  <br/>\n&gt; teeth<br/>\n&gt; brushed and to get into pajamas, and then they can play the rest of the<br/>\n&gt; night if they want to.  So then I usually tell them that we will brush  <br/>\n&gt; their<br/>\n&gt; teeth in the next five minutes.  Five minutes later I attempt again  <br/>\n&gt; and it<br/>\n&gt; is met with a lot of struggle.  Then I usually have to just be firm  <br/>\n&gt; and make<br/>\n&gt; them do it which is not fun.  I am tired at this time of day and do  <br/>\n&gt; not have<br/>\n&gt; tons of patience. After that they are fine but irritated with being<br/>\n&gt; interrupted in their play.  As far as their pajamas go, they usually  <br/>\n&gt; just<br/>\n&gt; sleep in that day&#39;s T-shirt, which is fine.  After the teeth brushing,  <br/>\n&gt; they<br/>\n&gt; are fine staying up and playing and then just go to sleep when they are<br/>\n&gt; tired.<br/>\n&gt;<br/>\n&gt; I have explained the importance of brushing teeth and why we do it.   <br/>\n&gt; We have<br/>\n&gt; gone out and picked out fun brushes and special cups for rinsing.  I  <br/>\n&gt; have<br/>\n&gt; asked why they don&#39;t like it and I get mixed responses from &quot;it hurts&quot;  <br/>\n&gt; to &quot;I<br/>\n&gt; just don&#39;t want to.&quot;  I make sure I am very gentle and my son knows to  <br/>\n&gt; raise<br/>\n&gt; his hand in the air if he wants me to stop brushing.  I try to think of<br/>\n&gt; something fun we can do afterwards like read a book in bed.  Nothing  <br/>\n&gt; works.<br/>\n&gt;<br/>\n&gt; So I am assuming that I am just not getting something here.  Should I  <br/>\n&gt; just<br/>\n&gt; not even suggest that they change into clothes for sleeping in?  That  <br/>\n&gt; I can<br/>\n&gt; see would make sense.  Maybe I should get them pajamas that they can  <br/>\n&gt; change<br/>\n&gt; into by themselves so they have that choice.  But with the teeth thing  <br/>\n&gt; I am<br/>\n&gt; at a loss.  I feel like it is my parental duty to make sure they have  <br/>\n&gt; clean<br/>\n&gt; teeth before they go to sleep, and that they are too young to  <br/>\n&gt; understand the<br/>\n&gt; importance of this.  What if I just gave up and later in life they had  <br/>\n&gt; bad<br/>\n&gt; teeth - I don&#39;t think they would appreciate that.<br/>\n&gt;<br/>\n&gt; Anybody else deal with this before?  Any advice would be greatly<br/>\n&gt; appreciated.  I think our whole family really dreads the teeth brushing<br/>\n&gt; every night and I would love to get past it.<br/>\n&gt;<br/>\n&gt; Thank you,<br/>\n&gt; Erika  :)<br/>\n&gt;<br/>\n&gt; _________________________________________________________________<br/>\n&gt; Create a Job Alert on MSN Careers and enter for a chance to win $1000!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://msn.careerbuilder.com/promo/kaday.htm?\">http://msn.careerbuilder.com/promo/kaday.htm?</a> <br/>\n&gt; siteid=CBMSN_1K&sc_extcmp=JS_JASweep_MSNHotm2<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------ Yahoo! Groups Sponsor  <br/>\n&gt; ---------------------~--&gt;<br/>\n&gt; Buy Ink Cartridges or Refill Kits for your HP, Epson, Canon or Lexmark<br/>\n&gt; Printer at MyInks.com. Free s/h on orders $50 or more to the US &  <br/>\n&gt; Canada.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.c1tracking.com/l.asp?cid=5511\">http://www.c1tracking.com/l.asp?cid=5511</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://us.click.yahoo.com/mOAaAA/3exGAA/qnsNAA/0xXolB/TM\">http://us.click.yahoo.com/mOAaAA/3exGAA/qnsNAA/0xXolB/TM</a><br/>\n&gt; --------------------------------------------------------------------- <br/>\n&gt; ~-&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:  <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations. </span></blockquote></div>","specialLinks":[]},{"userId":161577375,"authorName":"Regina Stevenson-Healy","from":"Regina Stevenson-Healy &lt;regstehe@...&gt;","profile":"regstehe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1078373613","msgId":91589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENEFCM0ZDLTZEOTItMTFEOC1BMEQ5LTAwMEE5NTdEQUY2MkBhY2Nlc3N0b2xlZG8uY29tPg==","inReplyToHeader":"PGM5LjNlNzFjMjJhLjJkNzdiODU5QGFvbC5jb20+"},"prevInTopic":91588,"nextInTopic":91590,"prevInTime":91588,"nextInTime":91590,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"... Last week a friend mentioned something about how an acquaintance of hers had a disturbing bone scan.  Her poor bone density was attributed to the caffeine","messageBody":"<div id=\"ygrps-yiv-1465727517\">On Wednesday, March 3, 2004, at 05:38  PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brenjenem@...\">brenjenem@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;        I nursed my first 2 children the same way that I did her. The <br/>\n&gt; only<br/>\n&gt; difference is that maybe my diet has not been as good with her and I <br/>\n&gt; have to<br/>\n&gt; admit I drink too much diet coke. I do wonder if that is what may have <br/>\n&gt; caused the<br/>\n&gt; problems. It may sound awful that a mother could drink diet coke while <br/>\n&gt; nursing<br/>\n&gt; her child. I do so many things for my children but that is one thing <br/>\n&gt; that is<br/>\n&gt; an addiction. If anyone has any literature about the effects of diet <br/>\n&gt; coke on<br/>\n&gt; the body or nursing I would like to see it.<br/>\n&gt;<br/>\n </span></blockquote>Last week a friend mentioned something about how an acquaintance of <br/>\nhers had a disturbing bone scan.  Her poor bone density was attributed <br/>\nto the caffeine in the diet coke she drank a lot of daily.  Your post <br/>\ngot me to google the subject.  Here are two links with opposing views.<br/>\n<br/>\nThis was on the Soft Drink Association site and their study, not <br/>\nsurprisingly, found little evidence of a link between soft drink use <br/>\nand tooth decay.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nsda.org/Issues/Partnerships/nutrition.html\">http://www.nsda.org/Issues/Partnerships/nutrition.html</a><br/>\n<br/>\nThis one found a link between caffeine use and loss of bone density.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.healthandage.com/Home/gid2=1684\">http://www.healthandage.com/Home/gid2=1684</a><br/>\n<br/>\nRegina</div>","specialLinks":[]},{"userId":118406848,"authorName":"joylyn","from":"joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Cavities, was bedtimes","postDate":"1078373182","msgId":91588,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNDZBQjNFLjMwNTAwMDhAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGM5LjNlNzFjMjJhLjJkNzdiODU5QGFvbC5jb20+","referencesHeader":"PGM5LjNlNzFjMjJhLjJkNzdiODU5QGFvbC5jb20+"},"prevInTopic":91586,"nextInTopic":91589,"prevInTime":91587,"nextInTime":91589,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"I did a lot of research on the cause of cavities (from the perspective of:  Does breastfeeding/breastmilk cause cavities.)  It doesn t.  In fact, it makes","messageBody":"<div id=\"ygrps-yiv-208008208\">I did a lot of research on the cause of cavities (from the perspective <br/>\nof:  Does breastfeeding/breastmilk cause cavities.)  It doesn&#39;t.  In <br/>\nfact, it makes teeth stronger.  Not to toot my own horn, but go to this <br/>\nsite to see my article...<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lalecheleague.org/NB/NBSepOct02p164.html\">http://www.lalecheleague.org/NB/NBSepOct02p164.html</a><br/>\n<br/>\nJoylyn<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brenjenem@...\">brenjenem@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My middle one, 6yo, brushes most of the time and has a few more<br/>\n&gt; than him and now the little one has horrible teeth. The dentist <br/>\n&gt; insists that<br/>\n&gt; it is bottle rot, even though she has been exclusively nursed since <br/>\n&gt; birth. They<br/>\n&gt; said I should stop the night nursings (I didn&#39;t though). <br/>\n<br/>\n&gt; If anyone has any literature about the effects of diet coke on<br/>\n&gt; the body or nursing I would like to see it. <br/>\n<br/>\n </span></blockquote>There is a huge amount of stuff on the web regarding this... start here...<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.holisticmed.com/aspartame/\">http://www.holisticmed.com/aspartame/</a><br/>\n<br/>\nHere is a list of side effects... Good stuff! <br/>\n<br/>\nJoylyn (who avoids nutradeath with a passion...only rarely in gum, it&#39;s <br/>\none of the few things I have asked my children to never eat.)<br/>\n<br/>\n<br/>\n      Toxicity Effects of Aspartame Use<br/>\n<br/>\n<br/>\n        Selection of adverse effects from short-term and/or long-Term use<br/>\n<br/>\nNote: It often takes at least sixty days without *any* aspartame or <br/>\nnutrasweet to see a significant improvement. Improvement in health is <br/>\nalso often accompanied by weight loss. Check all labels very carefully <br/>\n(including vitamins and pharmaceuticals). Look for the word &quot;aspartame&quot; <br/>\non the label and avoid it. (Also, it is a good idea to avoid <br/>\n&quot;acesulfame-k&quot; or &quot;sunette.&quot;) Finally, avoid getting nutrition <br/>\ninformation from junk food industry PR organizations such as IFIC or <br/>\norganizations that accept large sums of money from the junk and chemical <br/>\nfood industry such as the American Dietetic Association.<br/>\n<br/>\n    * seizures and convulsions<br/>\n    * dizziness<br/>\n    * tremors<br/>\n    * migraines and severe headaches (Trigger or Cause From Chronic Intake)<br/>\n    * memory loss (common toxicity effects)<br/>\n    * slurring of speech<br/>\n    * confusion<br/>\n    * numbness or tingling of extremities<br/>\n    * chronic fatigue<br/>\n    * depression<br/>\n    * insomnia<br/>\n    * irritability<br/>\n    * panic attacks (common aspartame toxicity reaction)<br/>\n    * marked personality changes<br/>\n    * phobias<br/>\n    * rapid heart beat, tachycardia (another frequent reaction)<br/>\n    * asthma<br/>\n    * chest pains<br/>\n    * hypertension (high blood pressure)<br/>\n    * nausea or vomitting<br/>\n    * diarrhea<br/>\n    * abdominal pain<br/>\n    * swallowing pain<br/>\n    * itching<br/>\n    * hives / urticaria<br/>\n    * other allergic reactions<br/>\n    * blood sugar control problems (e.g., hypoglycemia or hyperglycemia)<br/>\n    * menstrual cramps and other menstraul problems or changes<br/>\n    * impotency and sexual problems<br/>\n    * food cravings<br/>\n    * weight gain<br/>\n    * hair loss / baldness or thinning of hair<br/>\n    * burning urination & other urination problems<br/>\n    * excessive thirst or excessive hunger<br/>\n    * bloating, edema (fluid retention)<br/>\n    * infection susceptibility<br/>\n    * joint pain<br/>\n    * brain cancer (Pre-approval studies in animals)<br/>\n    * death<br/>\n<br/>\n<br/>\n        Aspartame Disease Mimmicks Symptoms or Worsens the Following<br/>\n        Diseases<br/>\n<br/>\n    * fibromyalgia<br/>\n    * arthritis<br/>\n    * multiple sclerosis (MS)<br/>\n    * parkinson&#39;s disease<br/>\n    * lupus<br/>\n    * multiple chemical sensitivities (MCS)<br/>\n    * diabetes and diabetic Complications<br/>\n    * epilepsy<br/>\n    * alzheimer&#39;s disease<br/>\n    * birth defects<br/>\n    * chronic fatigue syndrome<br/>\n    * lymphoma<br/>\n    * lyme disease<br/>\n    * attention deficit disorder (ADD and ADHD)<br/>\n    * panic disorder<br/>\n    * depression and other psychological disorders<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Bedtimes...","postDate":"1078359280","msgId":91581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PEJBWTctRjEwb1RrMm03THZTVkQwMDAzYzAwY0Bob3RtYWlsLmNvbT4="},"prevInTopic":91580,"nextInTopic":91585,"prevInTime":91580,"nextInTime":91582,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-75622970\">&lt;&lt;I have explained the importance of brushing teeth and why we do it.  We<br/>\nhave <br/>\ngone out and picked out fun brushes and special cups for rinsing.  I have <br/>\nasked why they don&#39;t like it and I get mixed responses from &quot;it hurts&quot; to &quot;I<br/>\n<br/>\njust don&#39;t want to.&quot;  I make sure I am very gentle and my son knows to raise<br/>\n<br/>\nhis hand in the air if he wants me to stop brushing.  I try to think of <br/>\nsomething fun we can do afterwards like read a book in bed.  Nothing works.<br/>\n<br/>\nSo I am assuming that I am just not getting something here.  Should I just <br/>\nnot even suggest that they change into clothes for sleeping in?  That I can <br/>\nsee would make sense.  Maybe I should get them pajamas that they can change <br/>\ninto by themselves so they have that choice.  But with the teeth thing I am <br/>\nat a loss.  I feel like it is my parental duty to make sure they have clean <br/>\nteeth before they go to sleep, and that they are too young to understand the<br/>\n<br/>\nimportance of this.  What if I just gave up and later in life they had bad <br/>\nteeth - I don&#39;t think they would appreciate that.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nThis tooth brushing issue has been discussed before to the point that it<br/>\nreally seems to be absolutely genetic � everyone has examples of folks who<br/>\nalmost never grab a toothbrush yet have wonderful teeth, and the polar<br/>\nopposite too. <br/>\n<br/>\nWith Jayn I have totally let go. She is 4 and at the moment is refusing to<br/>\nbrush with �no thanks� when I invite her to do so � usually while I am<br/>\nbrushing. We go through stages of lots of brushing, and I have to say that<br/>\nshe often asks for new little brushes and new toothpastes at the market when<br/>\nshe sees them, but then uses the paste for painting the sink pink! She hates<br/>\nall flavors that we have tried, including the new �orange� one (urk!). When<br/>\nshe brushes she uses water. I think she has one cavity in one tooth, but I<br/>\nwould rather let her have that and go to the dentist when she is more<br/>\nmature, than force her, drag her to the dentist, make her afraid and angry<br/>\nand generally lose any chance of her being willing to engage in good oral<br/>\ncare as she ages. After all she will lose these teeth, and they are not very<br/>\nold since she didn�t get any teeth at all until she was one. I want her to<br/>\ngrow up seeing her health as in her own hands with the medical professionals<br/>\nbeing her helpers and advisors, rather than magisterial authorities. I have<br/>\nshown her pictures from the internet of bad teeth as an encouragement � it<br/>\nmay have backfired as she certainly sees nothing like it in her mouth. She<br/>\nalso drinks lots of water, especially at night, so hopefully that helps to<br/>\nrinse them a bit. <br/>\n<br/>\nAs for pyjamas � Jayn sometimes changes into her princess pj�s because she<br/>\nloves them, sometimes sleeps in her clothes if they are soft and comfy, and<br/>\nsometimes just wears her panties. This changing into special sleepwear is a<br/>\ncarry over from the traditional parenting (which I call �ordinary<br/>\nparenting�) idea that you MUST have a ROUTINE in order to get the children<br/>\nto bed at BEDTIME � kind of Pavlov�s kids. The purpose of routine is to<br/>\nremove questioning and free thought or alternative desires as much as<br/>\npossible. Stop caring what they wear to sleep. Seriously. Let them see that<br/>\nyou are taking care of your own needs and going to bed when you need to, but<br/>\nlet them be. If they really want to wear pj�s themselves, let them be slip<br/>\nover types and maybe the elders could help the younger if really needed. <br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nIncoming mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.567 / Virus Database: 358 - Release Date: 1/24/2004<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.567 / Virus Database: 358 - Release Date: 1/24/2004<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela","from":"&quot;Angela&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Bedtimes...","postDate":"1078356279","msgId":91586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMzAzMjMyNDM0LklZSkkxNDc5NC5tdGExMy5hZGVscGhpYS5uZXRAbGVpZ2g+","inReplyToHeader":"PGFhLjI4ZThhNTU3LjJkNzc5OGQ1QGFvbC5jb20+"},"prevInTopic":91585,"nextInTopic":91588,"prevInTime":91585,"nextInTime":91587,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"My seven year old often puts on a clean outfit for the next day the night before and sleeps in that.  She hates to get dressed and that cuts down on the amount","messageBody":"<div id=\"ygrps-yiv-1333649566\">My seven year old often puts on a clean outfit for the next day the night<br/>\nbefore and sleeps in that.  She hates to get dressed and that cuts down on<br/>\nthe amount of times she has to change her clothes. (And on days where we<br/>\ndon&#39;t go anywhere, both girls stay in their pajamas all day and sleep in<br/>\nthem again that night unless they are completely filthy.)  I have also found<br/>\nthat by phrasing some sentences as requests (would you be willing to brush<br/>\nyour teeth now so that I won&#39;t feel anxious and worried about you getting<br/>\ncavities?)  works well for my kids. They don&#39;t feel like I&#39;ve demanded<br/>\nsomething of them.  They can choose not to and I&#39;ll drop it.  They know that<br/>\nI am asking out of concern for them.  Most of the time they are<br/>\nwilling...but often they want to do it in their own time frame and feel more<br/>\nin control if they choose the time.  (I&#39;ll do it during the next commercial,<br/>\nMom.)  Happy Mom, Happy kids.  Hope that helps.<br/>\n <br/>\nAngela <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":71627792,"authorName":"brenjenem@aol.com","from":"brenjenem@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1078353497","msgId":91585,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5LjNlNzFjMjJhLjJkNzdiODU5QGFvbC5jb20+"},"prevInTopic":91581,"nextInTopic":91586,"prevInTime":91584,"nextInTime":91586,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"About a year or so ago, during a regular night of the brushing argument, I somehow lifted the top lip of my then 2 1/2 year old (the youngest of 3). I was","messageBody":"<div id=\"ygrps-yiv-343565600\">About a year or so ago, during a regular night of the brushing <br/>\nargument, I somehow lifted the top lip of my then 2 1/2 year old (the youngest of 3). <br/>\nI was shocked to see that all along her gumline her top teeth were all <br/>\ncorroded. She was actually the one who always brushed her teeth without any <br/>\nargument. I felt awful. I always allowed her to brush her own teeth. I guess she <br/>\ndidn&#39;t always do such a good job. I&#39;m not sure how long it took for that to happen <br/>\nto her. I guess I just never lifted her top lip, even if I brushed for her. <br/>\n       My 9 yo. who brushes his teeth the least has the fewest (only one or <br/>\ntwo) cavities. My middle one, 6yo, brushes most of the time and has a few more <br/>\nthan him and now the little one has horrible teeth. The dentist insists that <br/>\nit is bottle rot, even though she has been exclusively nursed since birth. They <br/>\nsaid I should stop the night nursings (I didn&#39;t though). I just try harder to <br/>\nclean her teeth before bed and sometimes during the night I sneak in there <br/>\nand wipe them. Anyway, she&#39;s had extensive dental work done including at least 5 <br/>\nroot canals and 2 caps on her molars so she can chew.<br/>\n       I nursed my first 2 children the same way that I did her. The only <br/>\ndifference is that maybe my diet has not been as good with her and I have to <br/>\nadmit I drink too much diet coke. I do wonder if that is what may have caused the <br/>\nproblems. It may sound awful that a mother could drink diet coke while nursing <br/>\nher child. I do so many things for my children but that is one thing that is <br/>\nan addiction. If anyone has any literature about the effects of diet coke on <br/>\nthe body or nursing I would like to see it. <br/>\n       I guess my point is be careful about being too lax and even if you <br/>\ndon&#39;t force them to brush, keep an eye on their teeth.<br/>\n       good luck, Teresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"&quot;Danielle Conger&quot; &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1078349054","msgId":91580,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTUwMWM0MDE2NSRlMGE4N2U4MCQ2NTAxYThjMEBqZ2s2OTAwPg==","referencesHeader":"PEJBWTctRjEwb1RrMm03THZTVkQwMDAzYzAwY0Bob3RtYWlsLmNvbT4="},"prevInTopic":91579,"nextInTopic":91581,"prevInTime":91579,"nextInTime":91581,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"Erika wrote: I have explained the importance of brushing teeth and why we do it.  We have gone out and picked out fun brushes and special cups for rinsing.  I","messageBody":"<div id=\"ygrps-yiv-1270129992\">Erika wrote:<br/>\n  I have explained the importance of brushing teeth and why we do it.  We have <br/>\n  gone out and picked out fun brushes and special cups for rinsing.  I have <br/>\n  asked why they don&#39;t like it and I get mixed responses from &quot;it hurts&quot; to &quot;I <br/>\n  just don&#39;t want to.&quot;  I make sure I am very gentle and my son knows to raise <br/>\n  his hand in the air if he wants me to stop brushing.  I try to think of <br/>\n  something fun we can do afterwards like read a book in bed.  Nothing works.<br/>\n  =========================================================<br/>\n<br/>\nI had the same response as Julie--move the brushing time. Even if they eat something afterwards, their teeth&#39;ll still be getting brushed twice a day, and that&#39;s a good thing.<br/>\n<br/>\nAlso, I&#39;m wondering why you have to brush them. My kids (6, 5, and 3) all brush their own teeth, always brushed them by themselves first before I had a go when they were *very* young, and they all love to brush their teeth. I think it&#39;s more important for the kids to take care of their own teeth and enjoy doing it than it is to make sure that a perfect job is done. Once in a while, I&#39;ll ask my little guy to let me have a turn--sometimes he says yes, sometimes no. They all have great teeth and no cavities--maybe good genetics.  But, I think the important thing is that it&#39;s always been something fun to do instead of a battleground, you know?<br/>\n<br/>\nI&#39;d say relax about it, talk to them about how important it is to *you* that they brush their teeth every day and how it would best work for them to get that done.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1078345512","msgId":91579,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjcwMWM0MDE1ZCRhMjAxZjRjMCRkYjgwZWU0MEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PEJBWTctRjEwb1RrMm03THZTVkQwMDAzYzAwY0Bob3RtYWlsLmNvbT4="},"prevInTopic":91578,"nextInTopic":91580,"prevInTime":91578,"nextInTime":91580,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"Toothbrushing---Could it be that toothbrushing is associated with seperating from you?  They don t have to go to bed, but you are.  What if they just did it","messageBody":"<div id=\"ygrps-yiv-185253000\">Toothbrushing---Could it be that toothbrushing is associated with seperating<br/>\nfrom you?  They don&#39;t have to go to bed, but you are.  What if they just did<br/>\nit right after they eat before they start to play again?  Would they be<br/>\nwilling to just wipe their teeth with a cloth rather than brush them?<br/>\n<br/>\nJulie S.---who has been down this road with both boys<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Erika Nunn&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:erikanunn@...\">erikanunn@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Wednesday, March 03, 2004 12:42 PM<br/>\nSubject: [UnschoolingDiscussion] Bedtimes...<br/>\n<br/>\n<br/>\n&gt; Hey all,<br/>\n&gt;<br/>\n&gt; I have a question for everybody.  First off, our household is way more<br/>\n&gt; relaxed ever since I let go of controlling my kid&#39;s eating, TV watching,<br/>\n&gt; bedtimes (my kids are ages 3 and 4).  I am happier, my husband is happier,<br/>\n&gt; and my kids are happier.  However, there is still one event that takes<br/>\nplace<br/>\n&gt; every evening that seems to still send everybody into a tizzy.  The simple<br/>\n&gt; act of brushing my children&#39;s teeth and getting them into something<br/>\n&gt; comfortable to wear to bed.<br/>\n&gt;<br/>\n&gt; It usually goes something like this....I get tired and inform my children<br/>\n&gt; that I am going to go lie down soon and that I want to brush their teeth<br/>\nand<br/>\n&gt; get them ready for bed.  This is met with, &quot;I don&#39;t want to go to bed!&quot;  I<br/>\n&gt; explain that they don&#39;t have to go to bed, but that they need their teeth<br/>\n&gt; brushed and to get into pajamas, and then they can play the rest of the<br/>\n&gt; night if they want to.  So then I usually tell them that we will brush<br/>\ntheir<br/>\n&gt; teeth in the next five minutes.  Five minutes later I attempt again and it<br/>\n&gt; is met with a lot of struggle.  Then I usually have to just be firm and<br/>\nmake<br/>\n&gt; them do it which is not fun.  I am tired at this time of day and do not<br/>\nhave<br/>\n&gt; tons of patience. After that they are fine but irritated with being<br/>\n&gt; interrupted in their play.  As far as their pajamas go, they usually just<br/>\n&gt; sleep in that day&#39;s T-shirt, which is fine.  After the teeth brushing,<br/>\nthey<br/>\n&gt; are fine staying up and playing and then just go to sleep when they are<br/>\n&gt; tired.<br/>\n&gt;<br/>\n&gt; I have explained the importance of brushing teeth and why we do it.  We<br/>\nhave<br/>\n&gt; gone out and picked out fun brushes and special cups for rinsing.  I have<br/>\n&gt; asked why they don&#39;t like it and I get mixed responses from &quot;it hurts&quot; to<br/>\n&quot;I<br/>\n&gt; just don&#39;t want to.&quot;  I make sure I am very gentle and my son knows to<br/>\nraise<br/>\n&gt; his hand in the air if he wants me to stop brushing.  I try to think of<br/>\n&gt; something fun we can do afterwards like read a book in bed.  Nothing<br/>\nworks.<br/>\n&gt;<br/>\n&gt; So I am assuming that I am just not getting something here.  Should I just<br/>\n&gt; not even suggest that they change into clothes for sleeping in?  That I<br/>\ncan<br/>\n&gt; see would make sense.  Maybe I should get them pajamas that they can<br/>\nchange<br/>\n&gt; into by themselves so they have that choice.  But with the teeth thing I<br/>\nam<br/>\n&gt; at a loss.  I feel like it is my parental duty to make sure they have<br/>\nclean<br/>\n&gt; teeth before they go to sleep, and that they are too young to understand<br/>\nthe<br/>\n&gt; importance of this.  What if I just gave up and later in life they had bad<br/>\n&gt; teeth - I don&#39;t think they would appreciate that.<br/>\n&gt;<br/>\n&gt; Anybody else deal with this before?  Any advice would be greatly<br/>\n&gt; appreciated.  I think our whole family really dreads the teeth brushing<br/>\n&gt; every night and I would love to get past it.<br/>\n&gt;<br/>\n&gt; Thank you,<br/>\n&gt; Erika  :)<br/>\n&gt;<br/>\n&gt; _________________________________________________________________<br/>\n&gt; Create a Job Alert on MSN Careers and enter for a chance to win $1000!<br/>\n&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://msn.careerbuilder.com/promo/kaday.htm?siteid=CBMSN_1K&sc_extcmp=JS_JASweep_MSNHotm2\">http://msn.careerbuilder.com/promo/kaday.htm?siteid=CBMSN_1K&sc_extcmp=JS_JASweep_MSNHotm2</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Bedtimes...","postDate":"1078345429","msgId":91578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFhLjI4ZThhNTU3LjJkNzc5OGQ1QGFvbC5jb20+"},"prevInTopic":91574,"nextInTopic":91579,"prevInTime":91577,"nextInTime":91579,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/3/04 11:46:10 AM, erikanunn@hotmail.com writes:  Before","messageBody":"<div id=\"ygrps-yiv-653222813\">In a message dated 3/3/04 11:46:10 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:erikanunn@...\">erikanunn@...</a> writes:<br/>\n<br/>\n&lt;&lt; Then I usually have to just be firm and make <br/>\nthem do it which is not fun.  &gt;&gt;<br/>\n<br/>\nBefore you convince yourself or try to convince us that you &quot;have to&quot; do <br/>\nsomething, please read this:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/haveto\">http://sandradodd.com/unschool/haveto</a><br/>\n<br/>\n&quot;I have to&quot; is not a phrase that should be used in any case in which the <br/>\nspeaker/writer has not REALLY examined alternatives.  <br/>\n<br/>\n-=-Should I just <br/>\nnot even suggest that they change into clothes for sleeping in?  That I can <br/>\nsee would make sense.  Maybe I should get them pajamas that they can change <br/>\ninto by themselves so they have that choice. -=-<br/>\n<br/>\nKirby lived in sweat suits for a couple of years when he was three to five or <br/>\nso, so it didn&#39;t matter what he was wearing when.  In summer he went to <br/>\nshorts and t-shirts, but cottony elastic-waist shorts.  He changed clothes when <br/>\nthey were dirty or wet or he wanted to wear a costume, and other than keeping his <br/>\nclean-clothes drawer stocked, I didn&#39;t sort night from day wear.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Bedtimes...","postDate":"1078342528","msgId":91574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMyNWMyMCtsbWk4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTctRjEwb1RrMm03THZTVkQwMDAzYzAwY0Bob3RtYWlsLmNvbT4="},"prevInTopic":91570,"nextInTopic":91578,"prevInTime":91573,"nextInTime":91575,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"... Two ideas: Keep the brushes in the kitchen and brush right after dinner instead of waiting until bedtime. If it s part of the dinner routine, perhaps it","messageBody":"<div id=\"ygrps-yiv-405831828\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Erika Nunn&quot; &lt;erikanunn@h...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Anybody else deal with this before?  Any advice would be greatly <br/>\n&gt; appreciated.  I think our whole family really dreads the teeth brushing <br/>\n&gt; every night and I would love to get past it.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Two ideas: Keep the brushes in the kitchen and brush right after dinner instead of waiting <br/>\nuntil bedtime. If it&#39;s part of the dinner routine, perhaps it won&#39;t feel like they&#39;re being <br/>\nyanked away from what they are doing at the time.<br/>\n<br/>\nSecond, they are very young so they may not know why they don&#39;t want to brush their <br/>\nteeth. I had a daughter who could not ever get dressed in the morning without a wrestling <br/>\nmatch but was perfectly happy if she picked out her clothes the night before. Go figure.<br/>\n<br/>\nI might be tempted to moving the teeth brushing time to a different of day and trust that <br/>\nthat one time per day was enough while they are resistant. Maybe ask them the &quot;When do <br/>\nyou want me to brush your teeth - after dinner every day or after lunch?&quot; Or set a timer <br/>\nthat goes off and when it buzzes, that&#39;s the time.<br/>\n<br/>\nGood luck!<br/>\nJulie</div>","specialLinks":[]},{"userId":140408439,"authorName":"Erika Nunn","from":"&quot;Erika Nunn&quot; &lt;erikanunn@...&gt;","profile":"soupythesnail","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Bedtimes...","postDate":"1078339326","msgId":91570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTctRjEwb1RrMm03THZTVkQwMDAzYzAwY0Bob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":91574,"prevInTime":91569,"nextInTime":91571,"topicId":91570,"numMessagesInTopic":0,"msgSnippet":"Hey all, I have a question for everybody.  First off, our household is way more relaxed ever since I let go of controlling my kid s eating, TV watching, ","messageBody":"<div id=\"ygrps-yiv-1092038959\">Hey all,<br/>\n<br/>\nI have a question for everybody.  First off, our household is way more <br/>\nrelaxed ever since I let go of controlling my kid&#39;s eating, TV watching, <br/>\nbedtimes (my kids are ages 3 and 4).  I am happier, my husband is happier, <br/>\nand my kids are happier.  However, there is still one event that takes place <br/>\nevery evening that seems to still send everybody into a tizzy.  The simple <br/>\nact of brushing my children&#39;s teeth and getting them into something <br/>\ncomfortable to wear to bed.<br/>\n<br/>\nIt usually goes something like this....I get tired and inform my children <br/>\nthat I am going to go lie down soon and that I want to brush their teeth and <br/>\nget them ready for bed.  This is met with, &quot;I don&#39;t want to go to bed!&quot;  I <br/>\nexplain that they don&#39;t have to go to bed, but that they need their teeth <br/>\nbrushed and to get into pajamas, and then they can play the rest of the <br/>\nnight if they want to.  So then I usually tell them that we will brush their <br/>\nteeth in the next five minutes.  Five minutes later I attempt again and it <br/>\nis met with a lot of struggle.  Then I usually have to just be firm and make <br/>\nthem do it which is not fun.  I am tired at this time of day and do not have <br/>\ntons of patience. After that they are fine but irritated with being <br/>\ninterrupted in their play.  As far as their pajamas go, they usually just <br/>\nsleep in that day&#39;s T-shirt, which is fine.  After the teeth brushing, they <br/>\nare fine staying up and playing and then just go to sleep when they are <br/>\ntired.<br/>\n<br/>\nI have explained the importance of brushing teeth and why we do it.  We have <br/>\ngone out and picked out fun brushes and special cups for rinsing.  I have <br/>\nasked why they don&#39;t like it and I get mixed responses from &quot;it hurts&quot; to &quot;I <br/>\njust don&#39;t want to.&quot;  I make sure I am very gentle and my son knows to raise <br/>\nhis hand in the air if he wants me to stop brushing.  I try to think of <br/>\nsomething fun we can do afterwards like read a book in bed.  Nothing works.<br/>\n<br/>\nSo I am assuming that I am just not getting something here.  Should I just <br/>\nnot even suggest that they change into clothes for sleeping in?  That I can <br/>\nsee would make sense.  Maybe I should get them pajamas that they can change <br/>\ninto by themselves so they have that choice.  But with the teeth thing I am <br/>\nat a loss.  I feel like it is my parental duty to make sure they have clean <br/>\nteeth before they go to sleep, and that they are too young to understand the <br/>\nimportance of this.  What if I just gave up and later in life they had bad <br/>\nteeth - I don&#39;t think they would appreciate that.<br/>\n<br/>\nAnybody else deal with this before?  Any advice would be greatly <br/>\nappreciated.  I think our whole family really dreads the teeth brushing <br/>\nevery night and I would love to get past it.<br/>\n<br/>\nThank you,<br/>\nErika  :)<br/>\n<br/>\n_________________________________________________________________<br/>\nCreate a Job Alert on MSN Careers and enter for a chance to win $1000! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://msn.careerbuilder.com/promo/kaday.htm?siteid=CBMSN_1K&sc_extcmp=JS_JASweep_MSNHotm2\">http://msn.careerbuilder.com/promo/kaday.htm?siteid=CBMSN_1K&sc_extcmp=JS_JASweep_MSNHotm2</a></div>","specialLinks":[]}],"prevTopicId":110358,"nextTopicId":110395}}