{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Hafidha","from":"&quot;Hafidha&quot; &lt;hafidha@...&gt;","replyTo":"LIST","senderId":"0TFMv9P6IxhdJ9Gx_bPeDJ3bpLk3uTgtaMIsewpdazJ0sXzxKsfiu_2_HOIa5kr9gEFa0d-CwJkfvL0TsvgN3tur","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Oprah","postDate":"955567131","msgId":8069,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTcwMWJmYTRiMyRmMTQ2OTgyMCRkYjcwM2ZkMUBkZWZhdWx0Pg=="},"prevInTopic":0,"nextInTopic":8070,"prevInTime":8068,"nextInTime":8070,"topicId":8069,"numMessagesInTopic":0,"msgSnippet":"Hi, I saw the Oprah show yesterday and taped the homeschooling segment. The first family I felt were all right, and probably representative of a lot of","messageBody":"<div id=\"ygrps-yiv-2054389620\">Hi,<br/>\nI saw the Oprah show yesterday and taped the homeschooling segment.<br/>\nThe first family I felt were all right, and probably representative of<br/>\na lot of homeschooling families, but I didn&#39;t think they made a great<br/>\nimpression. Then the girl who was a former homeschooler ... she had a<br/>\npoint, and I could understand that she was speaking about her<br/>\nexperience, but I did NOT agree with her statement that it&#39;s taken her<br/>\nFOUR years to be a teacher therefore parents can&#39;t do it. I think<br/>\nafter she actually starts teaching, she will realize it&#39;s not four<br/>\nyears of college that will make her a good teacher.<br/>\n<br/>\nAlso it frightens me that parents feel so inadequate to teach their<br/>\nchildren how to live and be adults. If you can&#39;t be a good teacher<br/>\nwithout college, how can you POSSIBLY be a good parent without some<br/>\nsort of parenting college? After all, parents have more influence than<br/>\nteachers.  The second family - the ones with four kids who went to<br/>\ncollege - were much better. They didn&#39;t have much time to talk,<br/>\nthough.<br/>\n<br/>\nWhen Oprah did the show with that Dr. who suggested eliminating high<br/>\nschool, I sent her an email, explaining that I agreed with him and<br/>\nthat I had home/unschooled and was now a functional, well-adjusted<br/>\nadult.  I don&#39;t think I&#39;ll be sending her another email, however,<br/>\nbecause I believe we&#39;d all be better off if we left homeschooling off<br/>\nof television and educated people about it through other mediums.<br/>\n<br/>\nAs I watched the show I kept thinking back to Jerry Manders&#39;, &quot;Four<br/>\nArguments of the Elimination of Television&quot; in which he writes about<br/>\nhow television is inherently terrible at conveying the ESSENCE of<br/>\nthings. If you have the book, you can refer to pages 278-279, when he<br/>\ntalks about the news story about a marsh that was in danger of being<br/>\nmade into a development. &quot;A whole world of sensory information [about<br/>\nthe marsh] has been abandoned, and yet it is in this world that real<br/>\nunderstanding of marshes exist. And without the understanding who can<br/>\ncare about the marsh? .... Images of mud and reeds do not inspire the<br/>\nmind....&quot; His point is that in order for people to care about the<br/>\nmarsh, they need to EXPERIENCE it, not watch it on television. What&#39;s<br/>\nworse, people see something on television and think they know all they<br/>\nneed to know about it; they are under the mistaken impression that<br/>\nthey DO understand, when in fact they don&#39;t.  That inhibits many<br/>\npeople from seeking further information outside of television. And<br/>\nthis is bad, bad news for alternative movements.<br/>\n<br/>\nLater, on page 324 he writes, &quot;When dealing with primitive peoples,<br/>\nobjective events such as hunting, building, fighting or dancing are<br/>\neasier to convey through television than subjective details of<br/>\nqualities of experience, ways of mind, alternative perceptions. The<br/>\nlatter qualities, which form the heart of life for primitive people,<br/>\nare dropped out in favor of the former.&quot;<br/>\n<br/>\nThis applies to us, too. Whenever I see a story about homeschooling on<br/>\ntelevision, there are images of mom sitting around the table with the<br/>\nkids, the kids getting their schoolbooks, mom asking the kids<br/>\nquestions. This would not encourage ME to homeschool my kids. But this<br/>\nis what television people are looking for because this is ALL THEY CAN<br/>\nSHOW. They don&#39;t know that unschooling isn&#39;t about what you can<br/>\nnecessarily see on paper. It&#39;s about development, growth, independence<br/>\nand love of learning - none of which can be conveyed on television in<br/>\na 2 minute video segment.<br/>\n<br/>\nJust my opinion,<br/>\nHafidha<br/>\n<br/>\nPortland, Oregon</div>","specialLinks":[]},{"userId":0,"authorName":"marbleface@aol.com","from":"marbleface@...","replyTo":"LIST","senderId":"R8ZY_ILrs0hbTCbVkVONKYBYh76qs64RdxQAeIOWAxCrPqs2PRmGnvMld7W7XSXzkn3tcXBrulrA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Oprah","postDate":"955566963","msgId":8070,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdjLjQxMjYzNDkuMjYyNjI1NzNAYW9sLmNvbT4="},"prevInTopic":8069,"nextInTopic":0,"prevInTime":8069,"nextInTime":8071,"topicId":8069,"numMessagesInTopic":0,"msgSnippet":"In a message dated 04/12/2000 6:31:19 PM !!!First Boot!!!, yschild@hotmail.com writes: ","messageBody":"<div id=\"ygrps-yiv-1293143159\">In a message dated 04/12/2000 6:31:19 PM !!!First Boot!!!, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yschild@...\">yschild@...</a> writes:<br/>\n<br/>\n&lt;&lt; Do you mean to tell me they were not contacted by ANY <br/>\n unschoolers? This is one of those things that started to make me doubt <br/>\n myself, then it just made me angry!<br/>\n     Thanks for letting me vent! Any way I&#39;d like to hear if anyone else had <br/>\n any thoughts on the show. &gt;&gt;<br/>\n<br/>\n<br/>\nWell, they were contacted by me.  But they didn&#39;t call!  Told hubby he was <br/>\ngoing to have to watch the kids and everything!<br/>\n<br/>\nI&#39;m sorry I missed the show now.<br/>\n<br/>\nNance</div>","specialLinks":[]}],"prevTopicId":7957,"nextTopicId":8067}}