{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Gay and parents","postDate":"1011846810","msgId":2947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTI0MDQzMzMwLjEzNzkxLnFtYWlsQHdlYjEzNzA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMTE4NDA2MDIuNzc5LjMyNDkwLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":2942,"nextInTopic":0,"prevInTime":2946,"nextInTime":2948,"topicId":2930,"numMessagesInTopic":0,"msgSnippet":"Having known many gay, bisexual, hetero and shades in between teens when I was a teen myself in San Francisco, I advise this girl to be very careful with her","messageBody":"<div id=\"ygrps-yiv-298690044\">Having known many gay, bisexual, hetero and shades in<br/>\nbetween teens when I was a teen myself in San<br/>\nFrancisco, I advise this girl to be very careful with<br/>\nher parents.  She is under their thumb at this age and<br/>\nthey can do many things to her that they should not be<br/>\nable to, legally and otherwise.  I have seen firsthand<br/>\nthe terrible nastiness that can result when parents<br/>\n&quot;lose it&quot; over their kid&#39;s coming out.  <br/>\n<br/>\nA lot of the kids I knew in San Francisco were from<br/>\nshelters and halfway houses.  There are a LOT of them<br/>\nthere, as California is a destination for homeless<br/>\npeople seeking milder climate, and San Francisco a<br/>\nhaven for gay culture that these abused and disowned<br/>\nyoung people flock to like moths to a flame.  Taking<br/>\naway what they consider &quot;privledges&quot; and screaming at<br/>\nher are not even close to the worst they could do.  I<br/>\nthink the idea of an ally of the opposite sex who can<br/>\nhelp calm the parents with a &quot;hetero deception&quot; while<br/>\nshe is still in their house is an excellent idea, and<br/>\na preserving one for this girl, for her mind, spirit<br/>\nAND body.  <br/>\n<br/>\nNanci K.<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nGreat stuff seeking new owners in Yahoo! Auctions! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com\">http://auctions.yahoo.com</a></div>","specialLinks":[]},{"userId":74604204,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"mom2zimmy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Gay and parents","postDate":"1011812697","msgId":2942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMTIzLjEyMjUwOC4tOTk2NzcuMS5kZHppbWxld0BqdW5vLmNvbT4="},"prevInTopic":2939,"nextInTopic":2947,"prevInTime":2941,"nextInTime":2943,"topicId":2930,"numMessagesInTopic":0,"msgSnippet":"... My nephew did something like this.  He is gay and knew at about 14.  He didn t come out to his parents until he was living on his own. In high school he","messageBody":"<div id=\"ygrps-yiv-935657121\">On Wed, 23 Jan 2002 13:27:33 EST <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hell, let them think Cameron&#39;s her boyfriend and she has reformed <br/>\n&gt; herself!!<br/>\n&gt; Then she can have her computer back.<br/>\n<br/>\n </span></blockquote>My nephew did something like this.  He is gay and knew at about 14.  He<br/>\ndidn&#39;t come out to his parents until he was living on his own.   <br/>\nIn high school he met a girl, also gay, and they sort of teamed up.  They<br/>\nwent to school functions together, dances, etc. and genuinely liked each<br/>\nother.  They got a few lectures from their parents about &quot;getting too<br/>\nserious&quot;, but it was better than what they would have had to deal with if<br/>\nthey&#39;d come out.  Their senior year book had a picture of them together<br/>\nwith a &quot;next stop, wedding chapel&quot;  caption, which they both thought was<br/>\nvery funny.<br/>\n<br/>\nThey are still good friends now at 27,  both happy in openly gay<br/>\nrelationships,  both, sadly, still dealing with angry parents.  But the<br/>\nlittle deception was a way for them to survive, support each other and<br/>\nhave a kind of social life they wouldn&#39;t have had if they&#39;d come out<br/>\nsooner.  <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Gay and parents","postDate":"1011810453","msgId":2939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Ni43OTlmYzhiLjI5ODA1YTk1QGFvbC5jb20+"},"prevInTopic":2931,"nextInTopic":2942,"prevInTime":2938,"nextInTime":2940,"topicId":2930,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/23/02 6:21:15 AM, kbcdlovejo@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-97753583\">In a message dated 1/23/02 6:21:15 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\n&lt;&lt; &lt; I guess the &quot;straight&quot; boy&#39;s not <br/>\nseen as a threat.&gt; And she seems to need to talk both to Cameron and to me.<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>Hell, let them think Cameron&#39;s her boyfriend and she has reformed herself!!<br/>\nThen she can have her computer back.<br/>\n<br/>\nWhat a horror show for her, poor thing.<br/>\n<br/>\n&lt;&lt;And to write a letter telling her parents calmly and gently how <br/>\nshe feels (all conversations turn into &quot;who can yell the loudest&quot;). &gt;&gt;<br/>\n<br/>\nYeah, but not until she moves out and has her own place.  No sense on earth <br/>\ntrying to change the point of view of dogged fundamentalists, not if you&#39;re <br/>\nthe daughter whose very disobedience is a huge personal shame for them <br/>\npersonally.<br/>\n<br/>\nI&#39;d talk Cameron into an acting job for a few months or years.  If they can <br/>\ndo it kinda campy and tongue in cheek they might not feel like liars, but <br/>\nlike they&#39;re players putting on a show for people whose social awareness <br/>\ncould use some adjustment.<br/>\n<br/>\nAnd when the girl&#39;s finally independent and writing her letter, she could say <br/>\n&quot;Cameron and I put on an act for you because it would make you feel better, <br/>\nand you NEEDED to feel better.  He was never really my boyfriend.&quot;<br/>\n<br/>\nBut then, on the other hand, consider that one girl/girl affair doesn&#39;t mean <br/>\nshe isn&#39;t going to end up heterosexual or bisexual, and be the married mother <br/>\nof half a dozen cool kids.  So because that IS a potential maybe Cameron <br/>\ndoesn&#39;t want to go too far in the act unless he really likes her, too.<br/>\n<br/>\nToo many people see sexuality as a plain two-way switch, either you&#39;re <br/>\n&#39;queer&#39; and that&#39;s that, or you&#39;re &#39;straight&#39; and that&#39;s that, but people are <br/>\nnot that extreme in most cases.  <br/>\n<br/>\nWe played an ongoing game once for a few weeks when there were was NO reason <br/>\nnot to have sex, no risk of disease, pregnancy or emotional betrayal would <br/>\nmatter because we were all about to be obliterated...  who would we want to <br/>\nmess with?   The guys were disgusted that three or more of the women named <br/>\nthis one certain dangerous white-trash Missouri drug dealer of all our <br/>\nacquaintance.  Scuzzy, had been beaten by his dad with a 2x4 and his jaw was <br/>\nall crooked, he was a liar and at the age of 32 had never yet had a real job. <br/>\n And we said GLEN!   But almost every person, male AND female, named one <br/>\nhetero lady we know.  Nobody was going to actually act on this stuff, and she <br/>\nwas in a long term relationship that is now past 25 years.  Nobody was much <br/>\nsurprised that she was top of all lists.  And she said &quot;Glen!&quot;<br/>\n<br/>\nSo attraction isn&#39;t easy, and being in love once doesn&#39;t make a life pattern. <br/>\n Every gay friend I&#39;m thinking of was either once married (and I went to some <br/>\nof those weddings), or they had a true heterosexual love in high school (one <br/>\nin particular, I still know both people, and was then at the lesbian wedding <br/>\nthat followed years later).<br/>\n<br/>\nI&#39;d help her calm down and be happy about flowers, ice cream, other things <br/>\nentirely, and let her know it is NOT something that has defined the rest of <br/>\nher life, neither the letter nor her parents&#39; reaction, but that every moment <br/>\nis new and she can come to clarity slowly--it doesn&#39;t have to be today.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":10252599,"authorName":"rsrascals@cs.com","from":"rsrascals@...","profile":"diannarascal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Gay and parents","postDate":"1011793768","msgId":2931,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5OC4xN2E5ZjY3LjI5ODAxOTY4QGNzLmNvbT4="},"prevInTopic":2930,"nextInTopic":2939,"prevInTime":2930,"nextInTime":2932,"topicId":2930,"numMessagesInTopic":0,"msgSnippet":"Wow, Kelly! I feel so much for this girl you described.  I am bisexual and am still not out to my parents (who are so Catholic that I am already sentenced to","messageBody":"<div id=\"ygrps-yiv-397290447\">Wow, Kelly!<br/>\n<br/>\nI feel so much for this girl you described.  I am bisexual and am still not <br/>\nout to my parents (who are so Catholic that I am already sentenced to eternal <br/>\nflame for marrying a man who was protestant!) at age 30.  I wish I had the <br/>\ncourage to confront my feelings for both genders when I was younger and still <br/>\nliving at home.  <br/>\n<br/>\nI think you are doing the best thing you can...giving her a safe place.  She <br/>\nis going through the normal teen stuff of hormones and cliques at her school <br/>\nand now to have her parents against her, too, is so hard.  Most teens feel <br/>\nthat their parents are against them (and, unfortunately, most parents are not <br/>\ngreat at supporting the growth processes of their children), but this <br/>\nsituation is way more overt than many teens deal with.<br/>\n<br/>\nAs long as you are giving her love, support and information (this is a major <br/>\nkey issue, too for your son to see and hear) for agencies and stuff.  I would <br/>\nencourage helping her find a support group.  The Unitarian Universalist <br/>\nChurch in Columbia would be a good place to start asking as well as a local <br/>\nuniversity.  I would also feel comfortable talking with her via email if she <br/>\nwished.  <br/>\n<br/>\nHang in there and keep reminding her of her choices.  Some times it is hard <br/>\nto see all the paths that are open when we are in the midst of anguish  ( I <br/>\ngot that from Ren!).  I will keep you in my thoughts.<br/>\n<br/>\nBlessed Be,<br/>\nDiAnna</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Gay and parents","postDate":"1011791991","msgId":2930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzLjE4MDIyMDcyLjI5ODAxMjc3QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":2931,"prevInTime":2929,"nextInTime":2931,"topicId":2930,"numMessagesInTopic":0,"msgSnippet":"We have a situation here right now. My son, who is 14 today (wow! when did THAT happen??) has a very good (also 14) friend who confided in him a year ago","messageBody":"<div id=\"ygrps-yiv-1515200359\">We have a &quot;situation&quot; here right now. My son, who is 14 today (wow! when did <br/>\nTHAT happen??) has a very good (also 14) friend who confided in him a year <br/>\nago that she&#39;s gay. She&#39;s been debating for months on how/when to tell her <br/>\nparents, and it came out vaguely in a heated argument a week ago. Two days <br/>\nago, her parents had rummaged through her room and found a love letter from <br/>\nher girlfriend. They attacked her with it, and she ran over here in tears <br/>\nthat night.<br/>\n<br/>\nHer parents are very religious (SC, remember) and homophobic and know that <br/>\nshe&#39;s going straight to hell. Her older sister was &quot;Miss Blue Devil&quot;, a <br/>\nsocial butterfly, and modeled for a while; and this girl can&#39;t do anything <br/>\nright.<br/>\n<br/>\nShe&#39;s really a delightful girl---her parents only see &quot;dyke&quot;. They&#39;ve taken <br/>\naway her phone, her computer, all functions (no going out with friends, no <br/>\nmovies, no parties, etc), and (worst of all) called her friend&#39;s parents and <br/>\n&quot;outed&quot; this girl as well to her parents! Both girls are very upset---and <br/>\ncan&#39;t even speak to each other! They don&#39;t go to the same school, so they <br/>\ncan&#39;t even see each other there.<br/>\n<br/>\nShe&#39;s welcome to use our phone and computer (although the other girl&#39;s <br/>\nparents have agreed that they are NEVER to speak to each other again) and <br/>\njust to hang out here as much as possible.&lt; I guess the &quot;straight&quot; boy&#39;s not <br/>\nseen as a threat.&gt; And she seems to need to talk both to Cameron and to me.<br/>\n<br/>\nAnyway, I was hoping for *something* from y&#39;all---especially maybe <br/>\nKathrynB---something that I could give her to help her through this. My <br/>\nadvice so far has been to &quot;lay low&quot; and not stir things up. And that they can <br/>\ncontrol her environment, but not her thoughts, feelings, beliefs, and <br/>\nsexuality. And to write a letter telling her parents calmly and gently how <br/>\nshe feels (all conversations turn into &quot;who can yell the loudest&quot;). <br/>\n<br/>\nAnything else from y&#39;all?<br/>\n<br/>\nThanks so much!<br/>\n<br/>\nKelly</div>","specialLinks":[]}],"prevTopicId":2935,"nextTopicId":2950}}