{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] TIME OUT, WARNING!  was Re: Dyslexia","postDate":"1453322171","msgId":76558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwQkQyNzlFLTEzMUEtNDNDOC1BRjVBLTZBQjM4RkI4MEUyREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFGQkU1NUJDLTk4M0EtNEM4Qi1BOThBLTJDOTc5RjRBRkZGNEBjb21jYXN0Lm5ldD4=","referencesHeader":"PEFGQkU1NUJDLTk4M0EtNEM4Qi1BOThBLTJDOTc5RjRBRkZGNEBjb21jYXN0Lm5ldD4="},"prevInTopic":76557,"nextInTopic":0,"prevInTime":76557,"nextInTime":76559,"topicId":76547,"numMessagesInTopic":0,"msgSnippet":"By listing jobs, I didn’t mean to go to the child and say “Here are some things you could do when you’re grown.” PLEASE don’t do that. I meant, in","messageBody":"<div id=\"ygrps-yiv-2076944611\">By listing jobs, I didn’t mean to go to the child and say “Here are some things you could do when you’re grown.”<br/>\nPLEASE don’t do that.<br/>\n<br/>\nI meant, in connection with looking at the page on multiple intelligences, then look at how many jobs require ZERO alphabetical order or phonics. :-)<br/>\nAnd maybe explore some of those interests yourself (as a mom, not as a schooly project at home, and the kids might see you and be interested in joining, but at least would see you do it).  <br/>\n<br/>\nMix it up and do more things.  Instead of waiting and watching for a child to learn a behavior (like training a dog—waiting for them to sit, stay, roll over), FILL YOUR LIFE with other things so that the time passing isn’t like a ticking clock, so that when he DOES read, it will come on the side of other wonderful things that adults do, that real people do, because they want to.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Dyslexia","postDate":"1453321831","msgId":76557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM3MDcxN0Q4LUMxNUEtNEE3Mi04MUVDLUFCRDc1RjkzNzhCQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFGQkU1NUJDLTk4M0EtNEM4Qi1BOThBLTJDOTc5RjRBRkZGNEBjb21jYXN0Lm5ldD4=","referencesHeader":"PEFGQkU1NUJDLTk4M0EtNEM4Qi1BOThBLTJDOTc5RjRBRkZGNEBjb21jYXN0Lm5ldD4="},"prevInTopic":76556,"nextInTopic":76558,"prevInTime":76556,"nextInTime":76558,"topicId":76547,"numMessagesInTopic":0,"msgSnippet":"-=-In an effort to be very clear I just wonder if there is an instance where there is something we can do as unschooling parents that assist/help/support a","messageBody":"<div id=\"ygrps-yiv-1682257711\">-=-In an effort to be very clear I just wonder if there is an instance where there is something we can do as unschooling parents that assist/help/support a child who is dyslexic? -=-<br/>\n<br/>\nWhat you described doesn’t sound at all like dyslexia, so please let that term slip away.<br/>\n<br/>\nI can’t remember numbers.  I’ve never been able to.  In school when I had a locker combination, I figured out that the best thing to do was write it tiny on the wall somewhere—NOT on or near my own locker.  I would remember it for a while but when there was a school break—even just four days for Thanksgiving—I didn’t know it when I came back.<br/>\n<br/>\nThe first time Pam Sorooshian and I were at a conference together,  didn’t know my room number at the hotel.  She laughed as though I was joking, but I wasn’t.  I still can’t.  I carry my ID and credit card in a paper envelope in my pocket, and I take notes on that.  When the envelope is getting worn out or full,  I transfer whatever numbers or names I need to save.  <br/>\n<br/>\nMy husband, on the other hand (who DOES, though that’s not what I’m talking about, have the traits of dyslexia—unrelated to this, entirely) CAN remember numbers.  ALL kinds of numbers.  When he does banking by phone, he doesn’t use papers or notes.  He knows all the codes for all our accounts.  He knows my social security number.  He knows highway numbers of any road near anyplace he’s lived or driven.  He knows all our kids’ phone numbers.  My cell phone knows them, and my address book on my computer knows. but it took me over a year to learn my own cellphone number.<br/>\n<br/>\nToday I couldn’t think of my house number, and looked at a piece of mail.  I’ve lived here for 19 years.<br/>\n<br/>\nHOW can I function!??<br/>\nBecause I know my limitation and I don’t volunteer for jobs that require people to remember numbers!  It’s as though in my head there is no white board that will take a number.  Words, I have tens of thousands, and older forms, and variants, and why they’re spelled as they’re spelled, and how it’s said or used differently other places from the U.S.  I have a hard time remembering names, but I sang a ballad to Holly the other day that I hadn’t sung since before she was born.  It only has six verses or so, maybe , but I remembered it all.  I know the tunes to songs I heard on commercials in the 1950’s.<br/>\n<br/>\nPeople are different.  That’s what I’m saying. :-)  <br/>\nNot remembering the alphabet, or not recognizing sounds, in childhood, will not be a life-ruining condition.  <br/>\n<br/>\nReading here might make you feel much better!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/intelligences\">http://sandradodd.com/intelligences</a><br/>\n<br/>\nI just asked Keith how he remembers those numbers.  Bank account and transfer numbers, I said—are they visually in his head like a list, or recited l ike a song?  He thought.  He said “There are patterns.”  I said “like pictures?  like graphs?”  He said that my social security number is a variation of his.  <br/>\n<br/>\nLet me tell you what:  It is NOT. :-)   Not in any way I can see.<br/>\n<br/>\nI’m also increasingy face-blind, as I get older.  That’s an odd one.  People can look the same to me.  I can see someone all day, and the next day, if they’ve changed clothes or hair, I don’t know who it is. <br/>\n<br/>\nPeople who are confused by numbers shouldn’t be bookeepers.  People who can’t spell shouldn’t be proofreaders.  People who are very klutzy shouldn’t be cooks—too many knives, too much fire and hot steel.<br/>\n<br/>\nThere are MANY things in the world to do, depending on people’s interests and skills.  <br/>\n<br/>\nThere’s a long list of jobs here, and some are duplicated, and I was thinking the other day that it might not include swimming pool maintenance, or greenhouse/hydroponics.  It probably doesn’t include the now-legal jobs (in several U.S. states, anyway) of running medical marijuana shops (or recreational shops, in a few states now).  Making cigars isn’t on the list.   Tile contracting (or production of tile) is not there.   I’ve done tile before—that I made twice; that I bought twice.  If I were young and starting over, I would do way more tile.  No flooring is on there, and that’s a great job.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/jobs\">http://sandradodd.com/jobs</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":171174582,"authorName":"Karen Lindberg","from":"Karen Lindberg &lt;karenandjoe2@...&gt;","profile":"lukesmama2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Dyslexia","postDate":"1453305436","msgId":76556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFGQkU1NUJDLTk4M0EtNEM4Qi1BOThBLTJDOTc5RjRBRkZGNEBjb21jYXN0Lm5ldD4="},"prevInTopic":76549,"nextInTopic":76557,"prevInTime":76555,"nextInTime":76557,"topicId":76547,"numMessagesInTopic":0,"msgSnippet":"Thank you for your response. And the reminder to reread stories of late readers and others who learned in different ways in their own. Just to clarify I have","messageBody":"<div id=\"ygrps-yiv-1723164949\">Thank you for your response. And the reminder to reread stories of late readers and others who learned in different ways in their own. Just to clarify I have never tried to teach my son or any of my children to read. No phonics - nothing. My question was based on observations alone and I know my assessments are colored by the ways I have learned things and also by the way my other boys seem to learn on their own.  So I wanted to have it scrutinized here.<br/>\n<br/>\n<br/>\n  Oscar often (daily) asks for help to spell words and my husband or I or his brothers answer him and help when it is asked. Without pressure or shaming. That&#39;s not an issue at all just explaining that there are lot of interactions with regard to reading, letters, typing, texting, communication etc with which to make observations.   I notice that he is confused by letters and specific ones every time. Or days of the week or some numbers.   Or doesn&#39;t know the names of them or the order in the alphabet or the order on his keyboard no matter now many times he has seen it.  Up until now I thought maybe he showed signs of dyslexia but frankly I didn&#39;t research it, he is learning every day I know he is I didn&#39;t need to get in the way of that wtc. he wasn&#39;t asking for help specifically so I figured I needed to just stay out of the way for him to navigate his journey to reading on his own.  My other sons have tried to help  when he asks for words while at the computer just so they can continue with their games or help him so they can play with him) by sounding stuff or making the sound of the letter they are calling out to him because that what makes sense to them. It during these instances that I have observed that the way they explain to him or try to define the letter or help him find it doesn&#39;t make sense to Oscar.<br/>\n<br/>\n<br/>\nI believe he can get there on his own however he needs to. I don&#39;t want to get in the way of his own ability to learn at whatever pace he needs.  I especially don&#39;t want to make it harder or cause him to NOT want to learn to read.  That is exactly why I asked the question.  He now notices that he is seeing letters/words different than his brothers and would like to be able to sort it out. More of a comment then a frustration. His older brother reads and younger brother reads. So he is aware all on his own. I know plenty of kids that learned to read even later so that is not what has me concerned. I am just acting upon his desire and question. I don&#39;t want to not do my part in assisting and supporting his efforts if there are things I could be doing to make things less confusing for him.<br/>\n<br/>\n<br/>\nIn an effort to be very clear I just wonder if there is an instance where there is something we can do as unschooling parents that assist/help/support a child who is dyslexic?  Maybe I&#39;m wrong but I kind of think of it like if a kid needs glasses and you just get them glasses. It&#39;s not a big deal or a label or something wrong with them but it might not be kind or supportive to not help them see the world more clearly.<br/>\n<br/>\n<br/>\nJust tossing it around and looking for ideas from the people I know won&#39;t say I should get him tested.<br/>\n<br/>\n<br/>\nI will reread the links. Thank you!<br/>\n<br/>\n<br/>\n-Karen<br/>\n Sent from my iPhone</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Dyslexia","postDate":"1453219189","msgId":76549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERBNzQ2NDdFLTkwNjctNDBEMy1BODA2LTBDNDJBNEYwRkFDRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG43anNmbytvOHA1ZEBZYWhvb0dyb3Vwcy5jb20+","referencesHeader":"PG43anNmbytvOHA1ZEBZYWhvb0dyb3Vwcy5jb20+"},"prevInTopic":76547,"nextInTopic":76556,"prevInTime":76548,"nextInTime":76550,"topicId":76547,"numMessagesInTopic":0,"msgSnippet":"-=-My 10 year old exhibits some signs that he might have this condition.  He has difficulty remembering words (passwords he has typed a million times over the","messageBody":"<div id=\"ygrps-yiv-1574607030\">-=-My 10 year old exhibits some signs that he might have this condition.  He has difficulty remembering words (passwords he has typed a million times over the past few years), sounds of letters (has trouble specifically with W, M, V and U are and sometimes can&#39;t remember other names of letters as well), days of the week, schedules etc. -=-<br/>\n<br/>\nThose aren’t dyslexia symptoms.  Some people don’t have a good memory.  <br/>\nUnless you’re trying to teach him to read, how would you know he has trouble with sounds of letters?  Teaaching reading creates non-readers.  It creates failure.  If you want unschooling to work, please stop trying to teach him to read.  Don’t quiz him.  <br/>\n<br/>\nNO ONE learns to read in a way that makes no sense to him, or her.  Schools create non-readers in the course of believing they’ve taught others to read.  <br/>\n<br/>\nIf you look at learning instead of teaching, these problems you’re seeing (and maybe helping create) will fall away.<br/>\n<br/>\n-=-So no worries about him but …-=-  then you cataloged worries. :-)<br/>\n<br/>\nPlease read all the stories you can find linked here.  Don’t rush through.  That’s not good reading. <br/>\nRead a little, try a little, wait a while, watch.<br/>\n<br/>\nDon’t read them by the page.  Read them by the individual account, by the individual phrase.  Parents of children who have learned to read all kinds of ways, at all kinds of ages, have shared those unschooling stories with others.  I’ve collected lots of them in one place.  Please make good use of that very large and freely provided collection.  Don’t read them through school-colored glasses.  <br/>\n<br/>\nYou can’t make your son read.  You can make him afraid of it, and make him not want to try.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/hsc/readinglater.html\">http://sandradodd.com/hsc/readinglater.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":171174582,"authorName":"","from":"karenandjoe2@...","profile":"lukesmama2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Dyslexia","postDate":"1453159736","msgId":76547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG43anNmbytvOHA1ZEBZYWhvb0dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":76549,"prevInTime":76546,"nextInTime":76548,"topicId":76547,"numMessagesInTopic":0,"msgSnippet":"Hello.  Wondering how one would support/help/assist a child who is interested in reading but is possibly dyslexic?  My 10 year old exhibits some signs that he","messageBody":"<div id=\"ygrps-yiv-763736395\"><p><span>Hello. &nbsp;Wondering how one would support/help/assist a child who is interested in reading but is possibly dyslexic? &nbsp;My 10 year old exhibits some signs that he might have this condition. &nbsp;He has difficulty remembering words (passwords he has typed a million times over the past few years), sounds of letters (has trouble specifically with W, M, V and U are and sometimes can&#39;t remember other names of letters as well), days of the week, schedules etc. &nbsp;We don&#39;t care about diagnosing him, but not sure how to help as he wants to read, but not much progress has been made over the last few years. &nbsp;We, my husband and I, think because he is dyslexic. &nbsp;My 12 year old reads as does my 7 year old. &nbsp;They both learned at their own pace, but it was more a process of them putting the pieces of the puzzle together for themselves and each layer built upon the one before it. &nbsp;It is not that way with my 10 year old. &nbsp;In fact, that hasn&#39;t been much change in several years, although he is a mastermind at deciphering games, and text messages and using apps to convey his message to people. &nbsp;He is also musical and very creative. &nbsp;So no worries about him but we don&#39;t want to pretend that there isn&#39;t possibly something going on and he may need us to help/support in different ways to help him with *his* reading puzzle.</span></p><p><span><br></span></p><p><span>Thank you in advance,</span></p><p><span>Karen</span></p></div>","specialLinks":[]}],"prevTopicId":76552,"nextTopicId":76559}}