{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":2375171,"authorName":"sluror@juno.com","from":"sluror@...","profile":"sluror","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Proud Mamma","postDate":"1058468913","msgId":15528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwNzE3LjEzMDgzNC4xNTE2LjM4LnNsdXJvckBqdW5vLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":15527,"nextInTime":15529,"topicId":15528,"numMessagesInTopic":0,"msgSnippet":"I wrote this during the same days I posted sweet sixteen . I guess I got a writing bug. I thought I d post this so you don t think all isn t well between my","messageBody":"<div id=\"ygrps-yiv-359356353\">I wrote this during the same days I posted &quot;sweet sixteen&quot;. I guess I got<br/>\na writing bug. <br/>\nI thought I&#39;d post this so you don&#39;t think all isn&#39;t well between my son<br/>\nand I, plus there was some talk about sex ed so I thought this kinda fit<br/>\nwith the topic. <br/>\n<br/>\nSharon<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nYesterday my son asked if I could give him and hid friends a ride to<br/>\nplanned parenthood. I asked were it was, that if it was on my way to the<br/>\nstore, I&#39;d do it. Of course I also asked why they wanted to go there. He<br/>\nsaid &quot;Wednesdays are free condom day&quot;. It was on the way, so I said I&#39;d<br/>\ndrop them off and they could walk over to meet me at the store when they<br/>\nwere done. On the ride over I asked what they wanted the condoms for 8 ),<br/>\nthat if they planned on using them, they should probably talk to their<br/>\nparents about this stuff. My son said he knew I would cause a problem if<br/>\nI went along. He was driving so it&#39;s not like I was taking them, he was,<br/>\nI was just along for the ride cause he only has a driving permit. His<br/>\nfriend that already has a bun in someone&#39;s oven said he can&#39;t talk to his<br/>\nparents about this stuff, they&#39;d just yell, drink and/or do more drugs if<br/>\nhe brings it up. Sad! : (  The girl that was with us kinda just laughed<br/>\nit off. My son didn&#39;t want to hear a lecture but I said I have to do &quot;the<br/>\nmom thing&quot;. I told them condoms weren&#39;t 100% guaranteed, I don&#39;t think<br/>\nanything is and they really should talk to someone, a parent, doctor. I<br/>\nasked if they give out condoms at school or if that was just something I<br/>\nsaw on TV. They said the school has an abstinence policy. I said well<br/>\nthat&#39;s probably 100% guaranteed except for that immaculate conception<br/>\nthing going round. My son didn&#39;t know what I was talking about so I<br/>\nfilled him in on Mary from back in the day. The girl said someone came<br/>\ninto one of her classes and besides other things, talked about an 8 yr<br/>\nold girl who immaculately conceived, the doctors said her hymen was never<br/>\nbroken but she was pregnant. I don&#39;t know. I&#39;ve never heard about it<br/>\nbefore. I don&#39;t think I lectured them, and I don&#39;t think they felt as if<br/>\nI were, we were just talking. I dropped them off, or should I say they<br/>\nabandoned me in the parking lot but left me the keys, so I continued on<br/>\nto the store. They took a backpack with them thinking they&#39;d load up on<br/>\ncondoms, I found this funny. They met up with me shortly after, at the<br/>\nstore, but with no condoms. The governor of our state cut funding so no<br/>\nfreebies. I guess he&#39;s pro life. <br/>\nThe last thing on my shopping list was calling cards. I like the kids to<br/>\ncarry them if they need to make a call while they&#39;re out. They&#39;d prefer<br/>\ncell phones but we tried that route and it&#39;s not in our budget. That&#39;s a<br/>\nwhole other story. My son grabbed a pack and pointed out that some charge<br/>\n9 mins. while others charge 12 mins. automatically when you use them at a<br/>\npay phone. The packaging for both kinds looked identical, from the same<br/>\ncompany. The small print. It&#39;s amazing to me that he&#39;d pick that up in<br/>\nthe small print. I wouldn&#39;t have noticed. A gentleman was looking at the<br/>\nrack of cards. Being the good citizen I try to be, I pointed out to him<br/>\nwhat my son just showed me. I said &quot;my son is so smart&quot;, I&#39;m a proud<br/>\nmama! The gentleman agreed that it wasn&#39;t a noticeable difference in<br/>\npackaging. At the same time a woman must have overheard half our<br/>\nconversation, grabbed a pack of cards also, and said it&#39;s just 25 cents,<br/>\nwhat&#39;s the big deal, it&#39;s still cheaper than using the pay phone with<br/>\nchange, and she proceeded to the register. She missed the point, sounded<br/>\ndefensive, and I didn&#39;t want to start an argument so I just smiled, so<br/>\ndid the gentleman. <br/>\n<br/>\nI&#39;ve got a whole rant about cards but I&#39;ll save it for later.<br/>\n<br/>\n________________________________________________________________<br/>\nThe best thing to hit the internet in years - Juno SpeedBand!<br/>\nSurf the web up to FIVE TIMES FASTER!<br/>\nOnly $14.95/ month - visit www.juno.com to sign up today!</div>","specialLinks":[]}],"prevTopicId":15459,"nextTopicId":15530}}