{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":150,"messages":[{"userId":164542605,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104675234","msgId":102074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRDgwMUEyLjQwNzAxMDBAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDc4LjY5ODkwMjM1LjJmMDg2Yjg4QGFvbC5jb20+","referencesHeader":"PDc4LjY5ODkwMjM1LjJmMDg2Yjg4QGFvbC5jb20+"},"prevInTopic":102073,"nextInTopic":102075,"prevInTime":102073,"nextInTime":102075,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"====== ","messageBody":"<div id=\"ygrps-yiv-761818140\">======<br/>\n<br/>\n&lt;&lt; The advice goes out to newbies and people who are struggling to get unschooling going or &quot;enhance&quot; it.  To me, it&#39;s contrived, manipulating and disrespectful- all antithetical to unschooling. &gt;&gt;<br/>\n<br/>\nWhen people ask me how I do it, I tell them what I do.   It&#39;s just one piece of advice, and everyone else here has the opportunity to give their own, but I don&#39;t think it&#39;s contrived, manipulative or disrespectful, and I&#39;m sure it&#39;s not antithetical to unschooling as it works at my house and at some others.<br/>\n<br/>\n======<br/>\n<br/>\nHere&#39;s my most recent descriptions of what I do--not a bit of it is <br/>\ndisrespecting my children, imo or theirs. Granted, my children are <br/>\nyoung, but I&#39;ve been unschooling, as in officially declared, for three <br/>\nyears now--not veteran, but not newbie either.<br/>\n<br/>\nStrewing, for me, is all about having cool and interesting things in the<br/>\nhouse. If I see something I think is cool, I pick it up.<br/>\n<br/>\nI think that &quot;strewing&quot; is a way of creating a rich environment from<br/>\nwhich children can freely pick and choose. It is *not* a way of slyly<br/>\nconstructing a curriculum that includes all the requisite subjects, like<br/>\nmath, science, literature, history, etc. Does that difference make<br/>\nsense? Some folks hear the word &quot;strew&quot; and think, &quot;oh, okay, so I can<br/>\nstrew that science book or math book or classic.&quot;  That, in my mind, is<br/>\nnot what strewing is about; that&#39;s replacing a canned curriculum with a<br/>\nmanipulative one.<br/>\n<br/>\nSome things I strew could be considered &quot;schooly,&quot; but mostly they&#39;re<br/>\njust interesting. I can remember quite clearly in elementary school,<br/>\nback when we were in the same classroom all day with the same people:<br/>\nthere was one girl identified as &quot;gifted&quot; before the &quot;gifted and<br/>\ntalented&quot; program existed. She was allowed to go to the back of the room<br/>\nand learn things like typing and other stuff that seemed so cool, but<br/>\nwhich we weren&#39;t allowed to do. I also remember the G&T kids getting to<br/>\ngo on archeology digs while the rest of us stayed in school. The things<br/>\nthey were doing were still &quot;educational&quot; but they were intriguing in a<br/>\nway that rote math and reading were not. This is the way I think about<br/>\nthe schooly stuff we have around the house: it&#39;s there because it&#39;s<br/>\ncool, not because it will offer a specific lesson or a specific skill.<br/>\nIt&#39;s there to explore because someone may find it interesting, not<br/>\nbecause it&#39;s a required subject.<br/>\n<br/>\nWe got the kids an elementary chemistry set for Christmas, which I know<br/>\nwill prove to be one of their favorite gifts of all because they&#39;re into<br/>\nthat kind of thing. I&#39;ve found it really interesting and enlightening to<br/>\nwatch and analyze what about this gift is schooly vs. unschooly, and it<br/>\nillustrates quite well the difference that I&#39;m trying to get at. What<br/>\nI&#39;ve realized is that I&#39;m not going let dh use it anymore with the kids.<br/>\n;) He&#39;s just not far enough along yet on his unschooling journey.<br/>\n<br/>\nWhen the kids get to play around, follow their curiosity, experiment<br/>\nfreely, learn empirically about the different reactions and parts, then<br/>\nthis is a cool gift to strew in an unschooling way. When dh sits down<br/>\nwith them and performs a specific experiment, tells the kids to sit and<br/>\nwatch, won&#39;t let them use the test-tubes because *this* experiment<br/>\ndoesn&#39;t require them, then it becomes a lesson and a disappointing,<br/>\nschooly gift with lots of rules and parameters that discourage genuine<br/>\ncuriosity and experimentation. Same gift, different outcome. See what I<br/>\nmean? That&#39;s the difference between strewing for genuine interest and<br/>\nstrewing a hidden curriculum, in my opinion.<br/>\n<br/>\nStrewing needs to be about all things interesting holding equal value<br/>\nand importance. We ought to be just as excited to strew some Teen Titan<br/>\ntoys that will fuel a current passion as we are about strewing that<br/>\nchemistry set because both will offer innumerable opportunities for<br/>\nlearning and exploration. I value learning--life-long learning, natural<br/>\nlearning, organic learning. I think we learn with every breath, that&#39;s<br/>\nwhat makes us sentient beings. I think it is impossible not to learn<br/>\nunless one actively shuts down and closes off the learning<br/>\nopportunity--that&#39;s what schools and lessons teach us to do, acting in<br/>\ndirectly antithetical ways to true learning. Unschooling to me isn&#39;t<br/>\nabout devaluing learning, but about valuing learning in all its forms,<br/>\nabout valuing the act of living itself as providing the means of<br/>\nlearning with every step and every breath.<br/>\n<br/>\nAnother example: I had some money from my mom to spend on the kids for<br/>\nChristmas, some of which I spent on beautiful wooden bead sets, some of<br/>\nwhich I spent at the bookstore. (I had intended to spend all of it at<br/>\nthis great art supply store, but it had closed down! I was very grumpy<br/>\nabout that.) From the bookstore, I bought:<br/>\n-- a book on knitting because Julia and I both would like to learn to knit<br/>\n--a book on MC Escher because Em and I had been talking about him<br/>\nrecently and the kids are into tessellations<br/>\n--a klutz book on magic<br/>\n--a klutz book on paper twirling, or quilling<br/>\n--a belly dancing kit, complete with finger cymbals, CD and DVD<br/>\n--a book on paper airplanes<br/>\n--a book of poetry for children, called _Animal Poems_ because it has<br/>\none of the kids&#39; favorite poems, &quot;Tyger&quot; by William Blake<br/>\n--a deck of Tarot cards<br/>\n<br/>\nThis is a really practical example of the way I &quot;strew.&quot; I&#39;m also<br/>\nnotorious for buying things at museum gift shops--I buy all kinds of<br/>\nthings that look interesting. I&#39;ve gotten books, coloring books, nature<br/>\njournals, craft kits, rebus makers, instruments, CDs, cards and games. I<br/>\nbuy interesting stuff at the hardware store--spools of colored wire,<br/>\nfunnels, different size measuring tapes, seeds of plants we&#39;ve<br/>\nread/heard about. I buy cool computer game bundles at Sam&#39;s Club, pick<br/>\nup interesting books at the library, rent topical DVDs of stuff we&#39;re<br/>\ncurrently interested in, order toys online. I subscribe to magazines,<br/>\nbuy museum memberships, research vacations, explore new parks or<br/>\nclimbing areas. We have all kinds of stuff to explore and pull out in<br/>\nour home, none of which is required. Often, things sit for months, even<br/>\nyears before someone takes an interest in it or the moment presents<br/>\nitself to pull it out.<br/>\n<br/>\nI think there&#39;s probably a fine line somewhere between the kind of<br/>\nstrewing I do and blatant consumerism, but I&#39;m still discovering what<br/>\nthat is. ;)  How much do I spend on unschooling? Everything and nothing. *g*<br/>\n<br/>\n<br/>\nSandra Dodd&#39;s strewing page is good, but my favorite piece that<br/>\nillustrates most closely what I do is her &quot;House as a Museum&quot; piece.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/museum\">http://sandradodd.com/museum</a><br/>\n<br/>\nThere&#39;s also an interesting thread along these lines going on now on the<br/>\nUnschoolingDiscussion list.<br/>\n<br/>\nAnd, here&#39;s something from an essay I&#39;m working on now that touches on<br/>\nthis topic:<br/>\n<br/>\n&quot;Shelves, cabinets, baskets and bins are filled with goodies to explore<br/>\nand excite. I accumulate and acquire stuff with an obsessive quality<br/>\nthat rivals the above mother&#39;s obsession to control the stuff in her<br/>\nhome. As Unschoolers, we dive into topics with gusto, devouring all that<br/>\nwe can get our hands on and then moving onto the next entrée. Many<br/>\ntimes, I&#39;ll see something that whets my own appetite with its future<br/>\npromise and I pick it up, waiting for just the right time to pull it out.<br/>\n<br/>\nI also keep stuff forever, like the calligraphy set I picked up when I<br/>\nwas probably twelve or thirteen. Its multiple nibs and colors fascinated<br/>\nmy girls as we played with them and compared the pens to a quill my five<br/>\nyear old daughter had bought at Colonial Williamsburg. My husband&#39;s<br/>\nmolecule model set from college chemistry has also proven quite<br/>\ninteresting and offered hours of fun building in addition to<br/>\nillustrating conversations on water molecules and, most recently,<br/>\nchirality in nature spurred by Jim&#39;s work and Emily&#39;s recent interest in<br/>\ngenetic mutation, thanks to the X-men.&quot;<br/>\n<br/>\n<br/>\n--Danielle<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":194790463,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104653965","msgId":102073,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRDdBRThELjUwNTA0MDFAc2lvLm1pZGNvLm5ldD4=","inReplyToHeader":"PDQxRDYyODU3LjYwMTAyMDdAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDkuM2E4M2IyZTMuMmYwNzZiNGRAYW9sLmNvbT4gPDQxRDYyODU3LjYwMTAyMDdAZWFydGhsaW5rLm5ldD4="},"prevInTopic":102072,"nextInTopic":102074,"prevInTime":102072,"nextInTime":102074,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"I *do* this   even if it s just to the room-at-large... I ve had those *strewn words* come back in later conversations by the kids - and they re 6 & 8!!","messageBody":"<div id=\"ygrps-yiv-1627814441\">I *do* this &lt;bg&gt;  even if it&#39;s just to the room-at-large... I&#39;ve had <br/>\nthose *strewn words* come back in later conversations by the kids - and <br/>\nthey&#39;re 6 & 8!!  Especially three of the four examples you gave: we did <br/>\nthe whole political circuit this summer/fall, my kids would get the <br/>\nKerry reference; we&#39;re on Social Security, so they get that; AND Thomas <br/>\nJefferson is one of our heroes (homeschooled himself and often <br/>\nconsidered &quot;of UU mindset&quot;), they know him, too; (I&#39;m not big on <br/>\nmethodology, but if it was interesting, I&#39;d share!)-- ya never know what <br/>\nthey may not have interest in *yet* [not yet exposed] that you may spark <br/>\nby one of your outbursts &lt;bg&gt;<br/>\n:) diana<br/>\n<br/>\nElizabeth Hill wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m considering the scenario when I&#39;m reading a book and finding an idea <br/>\n&gt;or fact that I (at my advanced age) find interesting.  While I&#39;m doing <br/>\n&gt;this, it&#39;s most likely that my son is watching TV or playing a computer <br/>\n&gt;game.  Does he want to hear me say &quot;Here&#39;s an interesting anecdote.  <br/>\n&gt;Apparently John Kerry has trouble deciding what to order in a <br/>\n&gt;restaurant.  Maybe the flip-flopping rap wasn&#39;t as unfair as I <br/>\n&gt;thought.&quot;  How about &quot;The proposed social security reforms look like <br/>\n&gt;they are really going to shaft stay-at-home moms that end up <br/>\n&gt;divorced.&quot;?  Or &quot;Thomas Jefferson really is my kind of guy.  I really <br/>\n&gt;like this quote of his about his perception of Jesus.&quot;  Or &quot;This study <br/>\n&gt;of media bias in the early Seventies had really screwy methodology.&quot;  <br/>\n&gt;These are all things that I remember really lighting up my brain in the <br/>\n&gt;last month that I did not think would be interesting to my ten year old kid.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.298 / Virus Database: 265.6.7 - Release Date: 12-30-2004</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104648939","msgId":102072,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMTAxLjIyNTUzOS4xMjcyLjMuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":102071,"nextInTopic":102073,"prevInTime":102071,"nextInTime":102073,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"... science, ... And that seems manipulative to me. You ve started by separating science out from life and turned it into something done with certain tools,","messageBody":"<div id=\"ygrps-yiv-1446988559\">On Sat, 1 Jan 2005 16:09:28 EST <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; If someone were really worried that her child seemed uninterested in<br/>\n </span></blockquote>science, <br/>\n<blockquote><span title=\"ireply\"> &gt; I wouldn&#39;t fault her a bit if she got a microscope and some cool <br/>\n&gt; slides and <br/>\n&gt; left it on the kitchen table, or better yet--one of those that hooks <br/>\n&gt; to the <br/>\n&gt; computer so what you see in there shows on the screen.  But I would <br/>\n&gt; also play <br/>\n&gt; with it myself and probably squeal &quot;OH MY GOSH!&quot;  <br/>\n<br/>\n </span></blockquote>And that seems manipulative to me. You&#39;ve started by separating &quot;science&quot;<br/>\nout from life and turned it into something done with certain tools, and<br/>\nthen you&#39;ve acquired things and used them not because you&#39;re interested,<br/>\nbut because you&#39;re worried that your child  is uninterested. And<br/>\nsquealing is sort of the icing on the cake? How is this not trying to<br/>\nmanipulate a child?<br/>\n<br/>\nI don&#39;t think I&#39;d fault anyone, but I wouldn&#39;t consider it unschooling,<br/>\neither. Why is it a problem for me if my child isn&#39;t doing a lot of<br/>\nscience-things? I&#39;d look at my assumptions, rather than trying to get my<br/>\nchild interested in something.<br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104648913","msgId":102071,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMTAxLjIyNTUzOS4xMjcyLjIuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":102068,"nextInTopic":102072,"prevInTime":102070,"nextInTime":102072,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"On Sat, 1 Jan 2005 17:16:15 -0800 pam sorooshian  ... bit ... very ... I guess the difference for me is that I do this as part of living  -","messageBody":"<div id=\"ygrps-yiv-1151350068\">On Sat, 1 Jan 2005 17:16:15 -0800 pam sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nwrites:<br/>\n<blockquote><span title=\"ireply\"> &gt; Another is when I&#39;m reading something on the internet or in the <br/>\n&gt; newspaper and I say, &quot;Hey - listen to this!&quot; And I read some little <br/>\n </span></blockquote>bit <br/>\n<blockquote><span title=\"ireply\"> &gt; of something that I think they might find interesting. If they are <br/>\n </span></blockquote>very <br/>\n<blockquote><span title=\"ireply\"> &gt; interested, they might want to hear more or read themselves. Or not. <br/>\n&gt; But I&#39;m &quot;strewing&quot; opportunities in front of them when I do this.<br/>\n<br/>\n </span></blockquote>I guess the difference for me is that I do this as part of living  - I<br/>\nread stuff aloud to my dad, too, or anyone else who happens to be around,<br/>\njust because I think it&#39;s cool stuff. My dad and brother and I<br/>\noccasionally clip and send articles to each other, from JAMA or the<br/>\nHonolulu newspaper or whatever. I don&#39;t do it, though, because I&#39;m hoping<br/>\nthey&#39;ll learn something new or it will pique their interest in a topic -<br/>\nthere&#39;s no agenda to it, I guess. It&#39;s the agenda part that feels wrong<br/>\nto me. And sometimes people talk about &quot;strewing&quot; as a way to &quot;hook&quot;<br/>\nkids, to expose them to things or to get them interested in a topic....<br/>\nand other times people talk about it simply as sharing things with your<br/>\nchildren that you think they&#39;ll enjoy or find interesting. I&#39;m<br/>\ncomfortable with the latter but not the former.<br/>\n<br/>\nAriel Gore said, &quot;Children need interesting mothers&quot;,  and I&#39;ve found<br/>\nthat to be a good unschooling tenet (feel free to substitute the primary<br/>\ncaregiver of your choice). <br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104640349","msgId":102068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRDc3OTVELjgwNTAwMDVAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDc4LjY5ODkwMjM1LjJmMDg2Yjg4QGFvbC5jb20+","referencesHeader":"PDc4LjY5ODkwMjM1LjJmMDg2Yjg4QGFvbC5jb20+"},"prevInTopic":102062,"nextInTopic":102071,"prevInTime":102067,"nextInTime":102069,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"** When people ask me how I do it, I tell them what I do.   It s just one piece of advice, and everyone else here has the opportunity to give their own, but I ","messageBody":"<div id=\"ygrps-yiv-1714842752\">** When people ask me how I do it, I tell them what I do.   It&#39;s just <br/>\none piece<br/>\nof advice, and everyone else here has the opportunity to give their own, <br/>\nbut I<br/>\ndon&#39;t think it&#39;s contrived, manipulative or disrespectful, and I&#39;m sure <br/>\nit&#39;s<br/>\nnot antithetical to unschooling as it works at my house and at some <br/>\nothers.**<br/>\n<br/>\nRight.  I feel that strewing does work for me, when I remember to do <br/>\nit.  (It isn&#39;t always something I think about.)  A strewn object (kit, <br/>\ngame, book, or thingumabob) quietly asks &quot;do you find me interesting&quot;, <br/>\nbut it doesn&#39;t shout and even better, it doesn&#39;t interrupt.  It&#39;s <br/>\nquieter than me coming home and trumpeting &quot;Lookie, lookie what I <br/>\nfound.  Do you want to play with this now?&quot;  (You might phrase it <br/>\ndifferently, of course.)<br/>\n<br/>\nI agree that strewing can feel unnatural.  But I think if it&#39;s done in a <br/>\ncalm and detatched way, I don&#39;t see it something that can do harm.  <br/>\n(Unless you strew the back seat of the car with reading material and <br/>\nsomeone gets carsick! &lt;g&gt;)<br/>\n<br/>\nMy son has kind of a perfectionist thing where he likes privacy where <br/>\nhe&#39;s learning something, esp. if he might struggle or make mistakes.  <br/>\nWhat he wants may be the opposite of what a more sociable kid would <br/>\nwant.  A sociable kid might strongly prefer that a new game come <br/>\nattached to the hand of a parent who is available to play right now.  My <br/>\nkid tends to say &quot;no&quot; first and sidle up to stuff later.<br/>\n<br/>\nAt my house, strewing isn&#39;t always about buying new stuff or thrift <br/>\nstore stuff.  It&#39;s also about remembering stuff we already have in the <br/>\nback of closets that my son may have forgotten and making it visible.  <br/>\nSome stuff that wasn&#39;t interesting two years ago might be interesting <br/>\nnow.  It&#39;s certainly possible for him to enjoy something that he doesn&#39;t <br/>\nrecall.<br/>\n<br/>\nI&#39;m not talking about workbooks or not-fun learning games or yucky <br/>\nstuff.  This is not about tricking my child into being interested in <br/>\nthings that he inherently finds uninteresting.  This is more about <br/>\nkeeping the scenery and the environment stimulating.  I think that <br/>\nclutter that is constantly present, even really fun clutter in really <br/>\nbright boxes, can end up being tuned out and overlooked.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104629278","msgId":102062,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5NEJERjY1LTVDNUQtMTFEOS1BMEZCLTAwMEE5NTdFRkU0NkBtYWMuY29tPg==","inReplyToHeader":"PGNyNzFqOStzMDd0QGVHcm91cHMuY29tPg==","referencesHeader":"PGNyNzFqOStzMDd0QGVHcm91cHMuY29tPg=="},"prevInTopic":102061,"nextInTopic":102068,"prevInTime":102061,"nextInTime":102063,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"... Maybe you re way more organized . If I get a new game or cd or book or puzzle - I leave it on the coffee table in the living room where somebody will","messageBody":"<div id=\"ygrps-yiv-1901371327\">On Jan 1, 2005, at 12:35 PM, Holly Furgason wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I tell my family if I bring home something interesting.  Just<br/>\n&gt; different family dynamics, I guess.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Maybe you&#39;re way more organized &lt;G&gt;. If I get a new game or cd or book <br/>\nor puzzle - I leave it on the coffee table in the living room where <br/>\nsomebody will for sure find it. Otherwise, I might leave it in a bag <br/>\nand forget I even ever got it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But- the point seems to have been to put things out in hopes that<br/>\n&gt; they&#39;ll become interested.  The advice goes out to newbies and people<br/>\n&gt; who are struggling to get unschooling going or &quot;enhance&quot; it.  To me,<br/>\n&gt; it&#39;s contrived, manipulating and disrespectful- all antithetical to<br/>\n&gt; unschooling.<br/>\n<br/>\n </span></blockquote>Put things out because we think they might BE interested.<br/>\nThis is doing a kindness to others in the family, not contrived or <br/>\nmanipulative.<br/>\n<br/>\nWe get TIME magazine but I don&#39;t read it much. When there is an article <br/>\nthat my dh thinks I&#39;ll like, he&#39;ll open the magazine to that page and <br/>\nleave it on my chair. Should I feel that he is manipulating me and <br/>\nbeing disrespectful? He&#39;s being thoughtful and showing that he&#39;s <br/>\nthinking of me and it is sweet and I appreciate it.<br/>\n<br/>\nWhen I am rummaging in a cupboard and run across the pattern blocks and <br/>\nI put them on the dining room table and something notices them there <br/>\nand plays happily with them for several hours, how the heck am I doing <br/>\nanything disrespectful?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104629142","msgId":102061,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2LjQ5YWUyMzI5LjJmMDhhNzk2QGFvbC5jb20+"},"prevInTopic":102060,"nextInTopic":102062,"prevInTime":102060,"nextInTime":102062,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/1/2005 6:44:47 PM Central Standard Time, pamsoroosh@mac.com writes: She said  Sunday evening she was going to study for a test. Why","messageBody":"<div id=\"ygrps-yiv-195662988\">In a message dated 1/1/2005 6:44:47 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\nShe said  Sunday evening she was going to <br/>\nstudy for a test. &quot;Why Sunday evening?&quot;  (She&#39;s been on vacation for <br/>\nover 2 weeks.) Because the test is on Monday  and she didn&#39;t want to <br/>\nstudy &quot;too soon&quot; or she&#39;d forget most of it before  the test. Apparently <br/>\neven Saturday (today) would be &quot;too  soon.&quot;<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nI have recently personally experienced this phenomenon.  I took a new  job, <br/>\nand they made me sit through 6 weeks of boring and dull training, with  tests.  <br/>\nAt the end there are two finals (different subjects).  If I  didn&#39;t pass the <br/>\nfinals, I didn&#39;t get to keep the job.<br/>\n <br/>\nHowever, I knew once I got through the training, all the information I  would <br/>\nneed while I&#39;m on the job would be at my fingertips in a book or a  computer, <br/>\nor from the person at the next desk.  I had been actually doing  the job <br/>\nunder supervision, and not studying as I had the first few weeks.   I was actually <br/>\ndoing the job.  When I was notified I would be taking the  final, I decided <br/>\nto cram for it as soon as I realized how many of the minute  details I had <br/>\nforgotten, or simply didn&#39;t use in the course of the job.   Yet, I needed to know <br/>\nthem ALL for these several moments in time where it would  all be put to the <br/>\ntest.  So, I crammed for the finals test, and I  passed.  <br/>\n <br/>\nShortly after that on the same day, they put me back on the job, which I  had <br/>\nbeen doing already, it was starkly clear that I would soon forget the  <br/>\ninformation I crammed in.  I remeber what I need for the job, and WHERE TO  FIND IT <br/>\nwhen I need it, and I&#39;m learning that better as I need it.<br/>\n <br/>\nIt&#39;s the binge and purge method.  I thought I had forgotten how to do  that.  <br/>\nApparently it&#39;s like riding a bike.<br/>\n <br/>\nKaren  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104628575","msgId":102060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU1RjlGQjA2LTVDNUItMTFEOS1BMEZCLTAwMEE5NTdFRkU0NkBtYWMuY29tPg==","inReplyToHeader":"PDIwMDUwMTAxLjA5NTE0MC4xMjcyLjAuZnJlZWZvcm1AanVuby5jb20+","referencesHeader":"PDIwMDUwMTAxLjA5NTE0MC4xMjcyLjAuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":102056,"nextInTopic":102061,"prevInTime":102059,"nextInTime":102061,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"... I think maybe you re rigidly interpreting the idea of strewing the child s life with interesting stuff as only making things appear unexpectedly in front","messageBody":"<div id=\"ygrps-yiv-387614580\">On Jan 1, 2005, at 9:51 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freeform@...\">freeform@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve always felt exactly the same way. I don&#39;t think this &quot;strewing&quot;<br/>\n&gt; thing is a necessary part of unschooling - at least, we&#39;ve been happily<br/>\n&gt; unschooling for years without it.<br/>\n<br/>\n </span></blockquote>I think maybe you&#39;re rigidly interpreting the idea of &quot;strewing the <br/>\nchild&#39;s life with interesting stuff&quot; as only making things appear <br/>\nunexpectedly in front of them without you saying anything?  Like when I <br/>\ngo up into our game storage and pull out games nobody has played with <br/>\nfor a long time and just put them out where people will see them?<br/>\n<br/>\nI think that&#39;s just one style of &quot;strewing.&quot;<br/>\n<br/>\nAnother is when I&#39;m reading something on the internet or in the <br/>\nnewspaper and I say, &quot;Hey - listen to this!&quot; And I read some little bit <br/>\nof something that I think they might find interesting. If they are very <br/>\ninterested, they might want to hear more or read themselves. Or not. <br/>\nBut I&#39;m &quot;strewing&quot; opportunities in front of them when I do this.<br/>\n<br/>\nAnother is when I&#39;m out shopping and I buy something I think they&#39;ll <br/>\nenjoy. I was at a 99 cent store and saw a big package of different <br/>\ncolored neon post-it notes. I bought a couple of packs and brought them <br/>\nhome and said - &quot;Here you guys, I got these if anybody has any use for <br/>\nthem. I&#39;ll put them here.&quot; That is &quot;strewing&quot; things.<br/>\n<br/>\nALL the things we do to offer our children interesting experiences and <br/>\nobjects and opportunities are &quot;strewing their world.&quot;<br/>\n<br/>\nSometimes we just put something out where they&#39;ll find it and sometimes <br/>\nwe&#39;ll say &quot;Here, look at this,&quot; but I don&#39;t see a big difference. Lots <br/>\nof times, in fact, I put something out, fully intending to tell someone <br/>\nabout it, and they discover it before I get around to it. Strewing - <br/>\nwhichever way it happens, imo.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104626632","msgId":102056,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVGQTU4NUFFLTVDNTctMTFEOS1BMEZCLTAwMEE5NTdFRkU0NkBtYWMuY29tPg==","inReplyToHeader":"PDQxRDZENkRCLjgwNzAyMDdAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDhhLjFkNGQ4ZTI4LjJmMDgwM2I4QGFvbC5jb20+IDw0MUQ2RDZEQi44MDcwMjA3QGVhcnRobGluay5uZXQ+"},"prevInTopic":102051,"nextInTopic":102060,"prevInTime":102055,"nextInTime":102057,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"... I m missing why you think his array of hooks is sparser, Betsy. He could be in school where his brain is turned off and resistant and the teachers are","messageBody":"<div id=\"ygrps-yiv-774219353\">On Jan 1, 2005, at 8:59 AM, Elizabeth Hill wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  With<br/>\n&gt; a much sparser set of hooks, my son is going to get a different level <br/>\n&gt; of<br/>\n&gt; hook-up response from stuff that I have to say, though?<br/>\n<br/>\n </span></blockquote>I&#39;m missing why you think his array of hooks is sparser, Betsy.<br/>\n<br/>\nHe could be in school where his brain is turned off and resistant and <br/>\nthe teachers are under the mistaken impression that they are providing <br/>\nhundreds of hooks but, truth is, very few of those hooks are remotely <br/>\npermanent.<br/>\n<br/>\nMy niece is 17 - senior in high school - honors student. I just gave <br/>\nher a ride somewhere and, just making small talk, asked her what her <br/>\nplans were for the weekend. She said Sunday evening she was going to <br/>\nstudy for a test. &quot;Why Sunday evening?&quot; (She&#39;s been on vacation for <br/>\nover 2 weeks.) Because the test is on Monday and she didn&#39;t want to <br/>\nstudy &quot;too soon&quot; or she&#39;d forget most of it before the test. Apparently <br/>\neven Saturday (today) would be &quot;too soon.&quot;<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104613768","msgId":102051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4LjY5ODkwMjM1LjJmMDg2Yjg4QGFvbC5jb20+"},"prevInTopic":102047,"nextInTopic":102056,"prevInTime":102050,"nextInTime":102052,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/1/05 1:37:15 PM, unschooler@swbell.net writes: ","messageBody":"<div id=\"ygrps-yiv-595504707\">In a message dated 1/1/05 1:37:15 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooler@...\">unschooler@...</a> writes:<br/>\n<br/>\n&lt;&lt; The advice goes out to newbies and people <br/>\n<br/>\nwho are struggling to get unschooling going or &quot;enhance&quot; it.  To me, <br/>\n<br/>\nit&#39;s contrived, manipulating and disrespectful- all antithetical to <br/>\n<br/>\nunschooling. &gt;&gt;<br/>\n<br/>\nWhen people ask me how I do it, I tell them what I do.   It&#39;s just one piece <br/>\nof advice, and everyone else here has the opportunity to give their own, but I <br/>\ndon&#39;t think it&#39;s contrived, manipulative or disrespectful, and I&#39;m sure it&#39;s <br/>\nnot antithetical to unschooling as it works at my house and at some others.<br/>\n<br/>\nIf I put an article in the bathroom because I know Marty will read it when <br/>\nhe&#39;s in there, and Holly might pick it up and take it into her room, either they <br/>\ndo or they don&#39;t.  I never ask.  Sometimes one will come and say &quot;That was so <br/>\ncool!&quot; and want to talk about it.  I don&#39;t call a family meeting and say <br/>\n&quot;I&#39;ve put an article on Danny Elfman in the bathroom, because I hadn&#39;t known he&#39;d <br/>\ncomposed some of the music for PeeWee&#39;s Playhouse, and I thought you&#39;d be <br/>\ninterested.&quot;  I just put it there, often when they&#39;re asleep or gone.<br/>\n<br/>\n-=-But I don&#39;t buy things that I know <br/>\n<br/>\nthey&#39;re not interested in hopes that it will *spark* something <br/>\n<br/>\nbecause they don&#39;t seem involved enough.-=-<br/>\n<br/>\nIf someone were really worried that her child seemed uninterested in science, <br/>\nI wouldn&#39;t fault her a bit if she got a microscope and some cool slides and <br/>\nleft it on the kitchen table, or better yet--one of those that hooks to the <br/>\ncomputer so what you see in there shows on the screen.  But I would also play <br/>\nwith it myself and probably squeal &quot;OH MY GOSH!&quot;   We play with the microscopes <br/>\nevery time we go to the natural science museum, so I know my kids would be <br/>\ninterested, but we keep a membership there and that&#39;s where we play microscopes.  <br/>\nBut someone, especially one whose kids had been in school and might have <br/>\nlearned things like &quot;science is stupid,&quot; who worries could effectively plant <br/>\ninteresting stuff where her kids would see it.<br/>\n<br/>\nThat was one of the main &quot;methods&quot; of the open classroom, a method John Holt <br/>\nand his contemporaries promoted in the late 60s and early 70s.  If there are <br/>\ninteresting things for kids to mess around with, they learn without the teacher <br/>\ndroning on or explaining.  They learn by their own discovery and <br/>\nexperimentation and play.<br/>\n<br/>\nIn some states homeschoolers are required to report subject matter.  Texas <br/>\nand New Mexico aren&#39;t among them, but there are people here from those other <br/>\nstates.<br/>\n<br/>\nWhen my husband brings things home from work that we&#39;d find cool, I don&#39;t <br/>\nfeel manipulated.  I feel like he thought of me.  He did that before we had kids. <br/>\n I save thing for my friends to see, and I buy them things from thrift stores <br/>\nI think they&#39;d be interested in.<br/>\n<br/>\nI don&#39;t see any evil manipulation in it at all.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":127152010,"authorName":"Holly Furgason","from":"&quot;Holly Furgason&quot; &lt;unschooler@...&gt;","profile":"hollyfurgason","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104611753","msgId":102047,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNyNzFqOStzMDd0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyOS41MzcyYjIzZS4yZjA4MmExN0Bhb2wuY29tPg=="},"prevInTopic":102035,"nextInTopic":102051,"prevInTime":102046,"nextInTime":102048,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"... coffeetables), or glass paperweights on end tables. I tell my family if I bring home something interesting.  Just different family dynamics, I guess. But-","messageBody":"<div id=\"ygrps-yiv-539641866\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If I bring something for a particular person, I give it to her or <br/>\n&gt; him. If I bring something cool into the house because it&#39;s a cool <br/>\n&gt; thing we didn&#39;t have before, or something that hasn&#39;t been out for <br/>\n&gt; a while, I just put it out, just as people have (kinda boringly) <br/>\n&gt; for years put magazines or &quot;coffeetable books&quot; out (on <br/>\n </span></blockquote>coffeetables), or glass paperweights on end tables.<br/>\n<br/>\nI tell my family if I bring home something interesting.  Just <br/>\ndifferent family dynamics, I guess.  <br/>\n<br/>\nBut- the point seems to have been to put things out in hopes that <br/>\nthey&#39;ll become interested.  The advice goes out to newbies and people <br/>\nwho are struggling to get unschooling going or &quot;enhance&quot; it.  To me, <br/>\nit&#39;s contrived, manipulating and disrespectful- all antithetical to <br/>\nunschooling.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Why would something they&#39;re  not interested in be worth bringing <br/>\n </span></blockquote>home?  And <br/>\n<blockquote><span title=\"ireply\"> &gt; how do you know they&#39;re not interested in something before they see <br/>\n </span></blockquote>it? <br/>\n<br/>\nConsidering that I have limitations of time, money and space, I can <br/>\nonly bring home so much.  I&#39;m not limiting in that, if they have <br/>\nnever shown an interest, I don&#39;t think they&#39;ll like it.  Living a <br/>\nblock from one thrift store and less than a mile from 4 others, <br/>\nthere&#39;s a whole lot that comes in that we never knew existed or ever <br/>\nthought we&#39;d be interested in.  But I don&#39;t buy things that I know <br/>\nthey&#39;re not interested in hopes that it will *spark* something <br/>\nbecause they don&#39;t seem involved enough.<br/>\n<br/>\nHolly<br/>\n2 COOL 4 SCHOOL<br/>\nUnschooling t-shirts with an edge!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cafepress.com/2cool4school\">http://www.cafepress.com/2cool4school</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104607274","msgId":102035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkZi4zMjE1ZmExZC4yZjA4NTIyYUBhb2wuY29tPg=="},"prevInTopic":102031,"nextInTopic":102047,"prevInTime":102034,"nextInTime":102036,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/1/05 10:54:44 AM, freeform@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-623823708\">In a message dated 1/1/05 10:54:44 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freeform@...\">freeform@...</a> writes:<br/>\n<br/>\n&lt;&lt; And yeah, there&#39;s not much room for<br/>\nstrewing stuff because all available surfaces are filled with stuff we&#39;re<br/>\nusing already...  &gt;&gt;<br/>\n<br/>\nThen stuff&#39;s &quot;strewn&quot; already.<br/>\n<br/>\nSome people live in houses that look like they&#39;re waiting for the magazine <br/>\nphotographers, and a really stark environment isn&#39;t ideal for the random <br/>\nsparking of creative idea-getting.<br/>\n<br/>\n-=-<br/>\nMaybe if I had a kid who was sort of at loose ends and wasn&#39;t into<br/>\ndirectly talking about it, and who didn&#39;t mind things appearing on<br/>\ntables, I could see it.-=-<br/>\n<br/>\nOr maybe if you had several kids who liked surprises and new stuff.<br/>\n<br/>\nMaybe kids who are more still and quiet don&#39;t need the newness and input as <br/>\nmuch as the more jabbery hyper ones?<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104601900","msgId":102031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMTAxLjA5NTE0MC4xMjcyLjAuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":102026,"nextInTopic":102035,"prevInTime":102030,"nextInTime":102032,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"On Sat, 01 Jan 2005 16:22:39 -0000 Holly Furgason ... I ve always felt exactly the same way. I don t think this strewing thing is a necessary part of","messageBody":"<div id=\"ygrps-yiv-82670337\">On Sat, 01 Jan 2005 16:22:39 -0000 &quot;Holly Furgason&quot;<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooler@...\">unschooler@...</a>&gt; writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think I&#39;m also having a problem with strewing.  It seems to me <br/>\n&gt; people are talking about strewing items to catch the interest of a <br/>\n&gt; child so that they might learn something new.  If I bring home <br/>\n&gt; anything that would interest a family member, whether it&#39;s something <br/>\n&gt; they&#39;re interested in now or not, I tell them.  If I bring home  items <br/>\n&gt; I know they&#39;re not interested in but hope that they will be, that&#39;s  <br/>\n&gt; my issue.  I&#39;d feel I was being disrespectful and I wouldn&#39;t be <br/>\n&gt; surprised if my kids chose to have no interest in such an <br/>\n&gt; underhanded  affair.<br/>\n<br/>\n </span></blockquote>I&#39;ve always felt exactly the same way. I don&#39;t think this &quot;strewing&quot;<br/>\nthing is a necessary part of unschooling - at least, we&#39;ve been happily<br/>\nunschooling for years without it.<br/>\n<br/>\nThings don&#39;t just &quot;appear&quot; on a table here. That would be off-putting to<br/>\nboth of us. We like knowing what&#39;s here, and we&#39;re not big on surprises<br/>\nappearing in our living room. And yeah, there&#39;s not much room for<br/>\nstrewing stuff because all available surfaces are filled with stuff we&#39;re<br/>\nusing already... <br/>\n<br/>\nMaybe if I had a kid who was sort of at loose ends and wasn&#39;t into<br/>\ndirectly talking about it, and who didn&#39;t mind things appearing on<br/>\ntables, I could see it. I have the kid who (after 6 months of rereading<br/>\ncomic bookcs) will say, &quot;I need something to read. What do you think I<br/>\nwould like?&quot;, and I&#39;ll pull down a half-dozen books that I think she<br/>\nmight like and hand them to her, and she&#39;ll look through them and read<br/>\none or two... or not... Curently she&#39;s working her way through both Noel<br/>\nStreatfeild&#39;s &quot;Shoes&quot; series and Orson Scott Card&#39;s &quot;Ender&quot; series,<br/>\ndepending on her mood at the moment. <br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104600415","msgId":102026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyYS41M2M3NzU2OC4yZjA4Mzc1ZkBhb2wuY29tPg=="},"prevInTopic":102025,"nextInTopic":102031,"prevInTime":102025,"nextInTime":102027,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/1/2005 10:54:56 AM Central Standard Time, ecsamhill@earthlink.net writes: I like  your insight, and the image of you as a teenager. ~~~ ","messageBody":"<div id=\"ygrps-yiv-443141408\">In a message dated 1/1/2005 10:54:56 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\nI like  your insight, and the image of you as a teenager.<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nYou should have seen me.  I was something else!  ;)<br/>\n <br/>\n~~~<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I wouldn&#39;t deliberately expose my child to something IF I thought  he <br/>\n </span></blockquote>would not find interesting.  Deliberate exposure seems kind of  schooly.  <br/>\nI wouldn&#39;t consciously promote rounding out his knowledge in  areas he <br/>\nseemed unenthusiastic about.  But I *would* share something  that related <br/>\nto things that I know he IS interested in.&lt;&lt;<br/>\n <br/>\n~~~<br/>\n <br/>\nYeah, deliberate exposure is something schooly.  But  honest-to-goodness <br/>\nconnections from your point of view to something he  definitely has in his point <br/>\nof view is not deliberate exposure.  It&#39;s  having a relationship with your kid. <br/>\n It&#39;s being excited about the  connection and helping him make the <br/>\nconnection, too.  Maybe he&#39;ll only make  the connection halfway, or maybe he won&#39;t see <br/>\nthe connection at all.  You  talked to your kid, though, and you shared some <br/>\nenthusiasm.<br/>\n <br/>\nWill and I talk in the car, mostly.  Well, he talks to me all the time  he&#39;s <br/>\nin my presence, but I&#39;m not interested in a lot of what he tells me about  <br/>\nSpongebob, so I tune out sometimes.  (When he really wants me to  listen, he says <br/>\nso.  Otherwise, he recognizes that I&#39;m not so interested  and he&#39;ll find <br/>\nsomething else to talk about!)  But I am interested  when talks to me about the <br/>\nmusic he&#39;s listened to recently, and I try to find  some relevance to Linkin <br/>\nPark in my life.  I told him about the Lincoln  Park Zoo in Chicago, where I went <br/>\na lot as a kid, and how I wonder if the Linkin  Park band has anything to do <br/>\nwith the zoo or Chicago.  So we make  connections to each other in that way.<br/>\n <br/>\nI can see the influence of the way my parents treated us as kids in my  <br/>\nparenting, too.  My mother didn&#39;t want to listen to arguments, ever.   Her word was <br/>\nlaw, and we couldn&#39;t be right.  Unfortunately, I inherited the  same trait.  <br/>\nI temper mine (I hope!).  I still see where the same  situations that I <br/>\nencountered with my mother are being recreated with my  children.  Best I can do is <br/>\ntry to be aware and minimize the impact.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104600337","msgId":102025,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmOS4zYzJkNTNhLjJmMDgzNzExQGFvbC5jb20+"},"prevInTopic":102021,"nextInTopic":102026,"prevInTime":102024,"nextInTime":102026,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/1/05 9:55:01 AM, ecsamhill@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-2087097737\">In a message dated 1/1/05 9:55:01 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n&lt;&lt; I really like the &quot;hook&quot; model of learning.  Things that leap across <br/>\n<br/>\nfrom one set of clumps to another are the most fascinating for me.  With <br/>\n<br/>\na much sparser set of hooks, my son is going to get a different level of <br/>\n<br/>\nhook-up response from stuff that I have to say, though? &gt;&gt;<br/>\n<br/>\nHe&#39;s not dependent on you for dots to connect, but the more you know about <br/>\nwhat he knows, the more easily you can provide him dots (as it were, tid-bits, <br/>\nexposures, suggestions) from your side.   Common experience breeds more common <br/>\nexperience, and the more interface you have, the easier it will be.<br/>\n<br/>\nWhen I see a friend every week, we have LOTS to talk about.  When there&#39;s a <br/>\nfriend I haven&#39;t talked to for a year, there&#39;s less to talk about.  Seems odd, <br/>\nbut it works with kids too.  I think it&#39;s one of the main reasons kids in <br/>\nschool and their parents can get to where they hardly communicate at all, and <br/>\ncan&#39;t have an honest, candid conversation but resort to speaking in preformatted <br/>\ndialogs.<br/>\n<br/>\n-=-I wouldn&#39;t consciously promote rounding out his knowledge in areas he <br/>\n<br/>\nseemed unenthusiastic about.-=-<br/>\n<br/>\nI have, but it&#39;s easy to do from the context of their own interests, and it&#39;s <br/>\neasy to be subtle, so that I&#39;m only amusing myself.  And I learned a long <br/>\ntime ago (not easily, but long time &lt;g&gt;) not to take it personally and get my <br/>\nfeelings hurt if some song or movie or game that seems GREAT to me is not <br/>\ninteresting to my kid.  I didn&#39;t like it the first few dozen times, and then I <br/>\nlearned.  &lt;g&gt;  But WAY more dozens of times they have been interested, so I kept <br/>\nmaking suggestions and showing them the good parts.  No kid needs to watch ALL of <br/>\nBen Hur just to see the chariot race, for instance.<br/>\n<br/>\n-=-This may be rooted in an old emotional issue for me.  I feel I may have <br/>\n<br/>\ninternalized the idea that my dad wasn&#39;t very interested in what I had <br/>\n<br/>\nto say as a kid.  (Squirming and looking away and not responding were <br/>\n<br/>\nthe kind of clues he gave me.)  So, now, thinking that what I have to <br/>\n<br/>\nsay is uninteresting, I may not start very many conversations with my <br/>\n<br/>\nkid.  So I&#39;m perpetuating the problem, yet for opposite reasons.-=-<br/>\n<br/>\nThat&#39;s possible.  So  maybe keep your comments really short and only the good <br/>\nparts (just the chariot race &lt;g&gt;), and if you get a good response, let THAT <br/>\nbe your message, not memories of your dad&#39;s distraction.   You&#39;re not talking <br/>\nto your dad now.<br/>\n<br/>\n-=Thanks to all of you who have hung in for this much gazing at my navel.  <br/>\n<br/>\nI&#39;m (ironically) pretty sure that it hasn&#39;t been very interesting. -=-<br/>\n<br/>\nBut there are things you can do to feel better, and one might be to realize <br/>\nyou don&#39;t have to be the most fascinating and mesmerizing orator of the age to <br/>\npass on something cool.<br/>\n<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104598747","msgId":102021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRDZENkRCLjgwNzAyMDdAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDhhLjFkNGQ4ZTI4LjJmMDgwM2I4QGFvbC5jb20+","referencesHeader":"PDhhLjFkNGQ4ZTI4LjJmMDgwM2I4QGFvbC5jb20+"},"prevInTopic":102018,"nextInTopic":102025,"prevInTime":102020,"nextInTime":102022,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"** When I was a senior in high school, I got in a huge argument with my history teacher, during class.  I almost got suspended over it.  I sat  there and ","messageBody":"<div id=\"ygrps-yiv-931166673\">** When I was a senior in high school, I got in a huge argument with my  <br/>\nhistory<br/>\nteacher, during class.  I almost got suspended over it.  I sat  there and<br/>\nargued how irrelevant whatever he was saying was to me.  This was  a <br/>\nparticularly<br/>\nstodgy old skinny-60s-tie history teacher.  But I could find  no <br/>\nrelevance to<br/>\nmy life to what he was trying to tell us about.  His  only defense was that<br/>\n&quot;someday&quot; history would mean more to me.<br/>\n<br/>\nWell, he was right.  Certain history does mean something to me,  now.  <br/>\nWhat I<br/>\nwas trying to get him to see was that I needed to be able to  *apply* <br/>\nwhat he<br/>\nwas saying in order to understand and he was doing a piss-poor  job of<br/>\nfinding relevance to the life of an 17 yo girl in 1979. **<br/>\n<br/>\nHi, Tuck --<br/>\n<br/>\nI like your insight, and the image of you as a teenager.<br/>\n<br/>\nAnd it&#39;s especially relevant to me, because my husband teaches 14 year <br/>\nold students.  When he&#39;s planning lessons and sometimes bouncing ideas <br/>\noff of me, he has an awareness that many of the students have their <br/>\ndeflector shields up and find most abstract stuff to be painfully <br/>\nuninteresting.  Being unschooled, James is less closed to incoming <br/>\ninformation, but I may get stuck with the selection &quot;filter&quot; that my <br/>\nhusband uses for his classroom.<br/>\n<br/>\n** Of course, he doesn&#39;t always see the common ground, or the steps of <br/>\nhow I <br/>\ngot from here to there.  But he&#39;s been exposed to something *beyond* <br/>\nwhat  he<br/>\nknow, and maybe he&#39;s put another hook on his model of the universe.   <br/>\nOnly he<br/>\ncan tell you that. **<br/>\n<br/>\nI really like the &quot;hook&quot; model of learning.  Things that leap across <br/>\nfrom one set of clumps to another are the most fascinating for me.  With <br/>\na much sparser set of hooks, my son is going to get a different level of <br/>\nhook-up response from stuff that I have to say, though?<br/>\n<br/>\nI wouldn&#39;t deliberately expose my child to something IF I thought he <br/>\nwould not find interesting.  Deliberate exposure seems kind of schooly.  <br/>\nI wouldn&#39;t consciously promote rounding out his knowledge in areas he <br/>\nseemed unenthusiastic about.  But I *would* share something that related <br/>\nto things that I know he IS interested in.  &quot;Look -- they&#39;re going to <br/>\nbroadcast a Simpson&#39;s marathon.&quot;  &quot;There&#39;s a cat in our backyard.&quot;  <br/>\n&quot;It&#39;s hailing!&quot;  (Maybe I&#39;ve just failed to adjust these &quot;upwards&quot; as he <br/>\nhas grown more sophisticated.)  The possible discrepancy between my <br/>\nbehavior and the suggested behavior is if I find something that is only <br/>\nborderline interesting, when we aren&#39;t presently talking, then I&#39;m not <br/>\nlikely to pass that information on to him right then as a statement or <br/>\nquestion or comment.  That doesn&#39;t mean it might not come out later, IF <br/>\nwe were talking about something related.  But, I *am* looking for advice <br/>\non this issue because we don&#39;t have many conversations, especially not <br/>\nlong conversations, that are sparked by ideas that come up watching TV.  <br/>\n(Yes, I do comment on TV.  Usually brief comments.)  Maybe conversations <br/>\nare getting squelched by a lack of listening skills on my part.  <br/>\nProbably he finds it easier to think when I&#39;m not talking. &lt;g&gt; (Of <br/>\ncourse.)  Perhaps he even finds it easier to think when *he* isn&#39;t <br/>\ntalking, either.<br/>\n<br/>\nThis may be rooted in an old emotional issue for me.  I feel I may have <br/>\ninternalized the idea that my dad wasn&#39;t very interested in what I had <br/>\nto say as a kid.  (Squirming and looking away and not responding were <br/>\nthe kind of clues he gave me.)  So, now, thinking that what I have to <br/>\nsay is uninteresting, I may not start very many conversations with my <br/>\nkid.  So I&#39;m perpetuating the problem, yet for opposite reasons.<br/>\n<br/>\nThanks to all of you who have hung in for this much gazing at my navel.  <br/>\nI&#39;m (ironically) pretty sure that it hasn&#39;t been very interesting.  Feel <br/>\nfree to delete!<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104597015","msgId":102018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyOS41MzcyYjIzZS4yZjA4MmExN0Bhb2wuY29tPg=="},"prevInTopic":102017,"nextInTopic":102021,"prevInTime":102017,"nextInTime":102019,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/1/05 9:22:46 AM, unschooler@swbell.net writes: ","messageBody":"<div id=\"ygrps-yiv-1975219970\">In a message dated 1/1/05 9:22:46 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooler@...\">unschooler@...</a> writes:<br/>\n<br/>\n&lt;&lt; I think I&#39;m also having a problem with strewing.  It seems to me <br/>\n<br/>\npeople are talking about strewing items to catch the interest of a <br/>\n<br/>\nchild so that they might learn something new. -=-<br/>\n<br/>\nOr have fun, or be surprised, or have a conversation piece, or for them to <br/>\nthink of something altogether different to do with the thing/stuff/whatever.<br/>\n<br/>\n<br/>\n-=-If I bring home <br/>\n<br/>\nanything that would interest a family member, whether it&#39;s something <br/>\n<br/>\nthey&#39;re interested in now or not, I tell them. -=-<br/>\n<br/>\nIf I bring something for a particular person, I give it to her or him.<br/>\nIf I bring something cool into the house because it&#39;s a cool thing we didn&#39;t <br/>\nhave before, or something that hasn&#39;t been out for a while, I just put it out, <br/>\njust as people have (kinda boringly) for years put magazines or &quot;coffeetable <br/>\nbooks&quot; out (on coffeetables), or glass paperweights on end tables. <br/>\n<br/>\n-=- If I bring home items <br/>\n<br/>\nI know they&#39;re not interested in but hope that they will be, that&#39;s <br/>\n<br/>\nmy issue.  I&#39;d feel I was being disrespectful and I wouldn&#39;t be <br/>\n<br/>\nsurprised if my kids chose to have no interest in such an underhanded <br/>\n<br/>\naffair. &gt;&gt;<br/>\n<br/>\nWhy would something they&#39;re  not interested in be worth bringing home?  And <br/>\nhow do you know they&#39;re not interested in something before they see it?  <br/>\nSomeone who isn&#39;t interested in light physics as far as you know might have an hour <br/>\nof fun with an air pig.  It&#39;s all about reflections and refractions, but who <br/>\ncares?  We didn&#39;t use those words.  It&#39;s been on one table or another for <br/>\nmonths, and ever guest who comes in plays with it.  At some point it will be packed <br/>\nup, and at some other point(s) it will be brought back out, and someday one <br/>\nof the kids will take it away to some other house.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":127152010,"authorName":"Holly Furgason","from":"&quot;Holly Furgason&quot; &lt;unschooler@...&gt;","profile":"hollyfurgason","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104596559","msgId":102017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNyNmlvZis1dWgyQGVHcm91cHMuY29tPg=="},"prevInTopic":102016,"nextInTopic":102018,"prevInTime":102016,"nextInTime":102018,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"All this seems so contrived to me.  Maybe unschooling just came easily for me so I don t understand how it can be enhanced .  I learn; the kids learn.  I do;","messageBody":"<div id=\"ygrps-yiv-868419133\">All this seems so contrived to me.  Maybe unschooling just came <br/>\neasily for me so I don&#39;t understand how it can be &quot;enhanced&quot;.  I <br/>\nlearn; the kids learn.  I do; the kids do.  I share; the kids share.  <br/>\nSometimes we&#39;re together on this; sometimes we&#39;re not.  We all <br/>\ndiscuss because it comes naturally.  I would never read a book as a <br/>\ngood conversation starter nor would I come up with questions to draw <br/>\nthem into a discussion before hand.  <br/>\n<br/>\nI think I&#39;m also having a problem with strewing.  It seems to me <br/>\npeople are talking about strewing items to catch the interest of a <br/>\nchild so that they might learn something new.  If I bring home <br/>\nanything that would interest a family member, whether it&#39;s something <br/>\nthey&#39;re interested in now or not, I tell them.  If I bring home items <br/>\nI know they&#39;re not interested in but hope that they will be, that&#39;s <br/>\nmy issue.  I&#39;d feel I was being disrespectful and I wouldn&#39;t be <br/>\nsurprised if my kids chose to have no interest in such an underhanded <br/>\naffair.<br/>\n<br/>\nMaterials in my house are strewn because we (all of us) are always in <br/>\nthe process of doing things.  Right now there&#39;s a screen printing kit <br/>\non the dining room table, JRR Tolkien quiz book on the end table, a <br/>\npaper airplane book and planes in various stages of development on <br/>\nthe living room floor, a guitar in the corner with music off the <br/>\nInternet and the rock tumbler going in the kitchen (where we can&#39;t <br/>\nreally hear it).  I guess we don&#39;t have room for items I hope someone <br/>\nwill be interested in.  <br/>\n<br/>\nHolly<br/>\n2 COOL 4 SCHOOL<br/>\nUnschooling t-shirts with an edge!<br/>\nhttp://www.cafepress.com/2cool4school<br/>\n  <br/>\n--- In UnschoolingDiscussion@yahoogroups.com, &quot;Robyn Coburn&quot; <br/>\n&lt;dezigna@c...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &lt;&lt;&lt;&lt;&lt;If I intentionally read books to myself about topics he was <br/>\n </span></blockquote>interested <br/>\n<blockquote><span title=\"ireply\"> &gt; in I might have more good conversations starters.  I suppose I <br/>\n </span></blockquote>would do <br/>\n<blockquote><span title=\"ireply\"> &gt; that if I was 20 years old and trying to impress a guy.  (Ahem, sad <br/>\n </span></blockquote>but <br/>\n<blockquote><span title=\"ireply\"> &gt; true.)  Does that seem like a reasonable tactic for enhancing<br/>\n&gt; unschooling?&gt;&gt;&gt;&gt;<br/>\n&gt; <br/>\n&gt; Taken in the same spirit as watching the tv show they love with <br/>\n </span></blockquote>them once or<br/>\n<blockquote><span title=\"ireply\"> &gt; twice to understand what *they* like about it, even if you don&#39;t, I <br/>\n </span></blockquote>think it<br/>\n<blockquote><span title=\"ireply\"> &gt; sounds very Unschooling-enhancing. Of course, if it turns out to be <br/>\n </span></blockquote>so<br/>\n<blockquote><span title=\"ireply\"> &gt; soul-numbingly stultifying that you can hardly bear to turn the <br/>\n </span></blockquote>next page,<br/>\n<blockquote><span title=\"ireply\"> &gt; perhaps asking for a summary from the kid might be better. Hey <br/>\n </span></blockquote>there&#39;s an<br/>\n<blockquote><span title=\"ireply\"> &gt; idea - asking questions as conversation starters - depending on the <br/>\n </span></blockquote>kid&#39;s<br/>\n<blockquote><span title=\"qreply\"> &gt; personality of course.<br/>\n&gt; <br/>\n&gt; Robyn L. Coburn<br/>\n&gt; <br/>\n&gt; ---<br/>\n&gt; Outgoing mail is certified Virus Free.<br/>\n&gt; Checked by AVG anti-virus system (http://www.grisoft.com).<br/>\n&gt; Version: 6.0.822 / Virus Database: 560 - Release Date: 12/22/2004 </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104591815","msgId":102016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5LjFkNTc3NWE0LjJmMDgxNWM3QGFvbC5jb20+"},"prevInTopic":102014,"nextInTopic":102017,"prevInTime":102015,"nextInTime":102017,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/1/05 6:47:08 AM, tuckervill2@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-921068484\">In a message dated 1/1/05 6:47:08 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tuckervill2@...\">tuckervill2@...</a> writes:<br/>\n<br/>\n&lt;&lt; Will and I have had great fun being Lemony Snicket fans, and sharing other <br/>\n <br/>\nbooks together, and being interested in baseball together.  So, maybe just  <br/>\ndeveloping an interest together would be helpful, too.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>Oh yeah!  A new mutual interest might be cool.<br/>\n<br/>\nThere are hiking clubs, and various societies involving gardening and birds <br/>\nand astronomy and history.   Bonuses:  Out of the house, new people, possible <br/>\nconnections to who other things not imagined before.<br/>\n<br/>\nI read aloud the best paragraph or two from an article in Smithsonian or <br/>\nNational Geographic sometimes.  Nobody else wants to read those in full, just me.  <br/>\nOnce, though, I read a little bit, and ended up reading the whole article <br/>\naloud to Keith and Marty.  It was about a big carbon dioxide burb a lake in <br/>\nAfrica makes once in a while, and it kills all the people an animals in the vally, <br/>\nbut it wasn&#39;t until this last time that anyone figured out what did it.<br/>\n<br/>\nWe don&#39;t have a common interest in death by carbon dioxide, but it was a <br/>\nshared thing, and we have that knowledge in common now, and can connect other <br/>\nthings to it down the road.  It has at LEAST to do with people thinking their <br/>\nactions caused normal earth-stuff.  No sense making sacrifices to a lake so it <br/>\nwon&#39;t kill you once you know that it wasn&#39;t a lake-god all cranky at something <br/>\nyou did or didn&#39;t do.<br/>\n<br/>\nIt was just a little thing, but it was a real thing and not a &quot;kid&quot; thing, to <br/>\nread that article.  There was no follow-up, no post-test, nothing but what it <br/>\nwas.    What it was, though, was one of very many similar moments.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104587192","msgId":102014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhhLjFkNGQ4ZTI4LjJmMDgwM2I4QGFvbC5jb20+"},"prevInTopic":102004,"nextInTopic":102016,"prevInTime":102013,"nextInTime":102015,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/31/2004 10:30:08 PM Central Standard Time, ecsamhill@earthlink.net writes: If I  intentionally read books to myself about topics he was","messageBody":"<div id=\"ygrps-yiv-368816734\">In a message dated 12/31/2004 10:30:08 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\nIf I  intentionally read books to myself about topics he was interested <br/>\nin I  might have more good conversations starters.  I suppose I would do  <br/>\nthat if I was 20 years old and trying to impress a guy.  (Ahem, sad  but <br/>\ntrue.)  Does that seem like a reasonable tactic for enhancing  unschooling?<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\nI happen to think that if you could find *nothing* in your life that was  <br/>\ninteresting to your son, then yeah, you should probably find something to read  <br/>\nthat you could discuss with him.<br/>\n <br/>\nThe other thing that struck me...and the John Kerry thing cracked me  <br/>\nup...When you read something like that, take steps backwards from what lights  your <br/>\nfire until you find something that will be relevant to your son.  <br/>\n <br/>\nWhen I was a senior in high school, I got in a huge argument with my  history <br/>\nteacher, during class.  I almost got suspended over it.  I sat  there and <br/>\nargued how irrelevant whatever he was saying was to me.  This was  a particularly <br/>\nstodgy old skinny-60s-tie history teacher.  But I could find  no relevance to <br/>\nmy life to what he was trying to tell us about.  His  only defense was that <br/>\n&quot;someday&quot; history would mean more to me. <br/>\n <br/>\nWell, he was right.  Certain history does mean something to me,  now.  What I <br/>\nwas trying to get him to see was that I needed to be able to  *apply* what he <br/>\nwas saying in order to understand and he was doing a piss-poor  job of <br/>\nfinding relevance to the life of an 17 yo girl in 1979.  <br/>\n <br/>\nWhen Will and I talk about historical things, I try to relate it to  his <br/>\nexperience in some way.  Our house is 110 years old, which is  usually a good <br/>\nreference point.  When he was younger, I used the year his  Poppy was born (1935) <br/>\nor when I was born (1962) or when his big brother was born  (1982).  Sometimes <br/>\nI say, &quot;When this house was brand new...&quot; and I  draw him a word picture <br/>\nabout what we&#39;re talking about.  In order to  draw that picture, I have to take <br/>\nstep backwards into what I know until I reach  what he knows (not always a <br/>\nlinear progression) and find that common  ground.<br/>\n <br/>\nOf course, he doesn&#39;t always see the common ground, or the steps of how I  <br/>\ngot from here to there.  But he&#39;s been exposed to something *beyond* what  he <br/>\nknow, and maybe he&#39;s put another hook on his model of the universe.   Only he <br/>\ncan tell you that.  <br/>\n <br/>\nWill and I have had great fun being Lemony Snicket fans, and sharing other  <br/>\nbooks together, and being interested in baseball together.  So, maybe just  <br/>\ndeveloping an interest together would be helpful, too.<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104558603","msgId":102004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2LjQ5YTNiNTg5LjJmMDc5NDBiQGFvbC5jb20+"},"prevInTopic":102002,"nextInTopic":102014,"prevInTime":102003,"nextInTime":102005,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/31/2004 9:29:48 P.M. Mountain Standard Time, ecsamhill@earthlink.net writes: tomorrow  I can stick post-it notes in the good parts of","messageBody":"<div id=\"ygrps-yiv-591443851\">In a message dated 12/31/2004 9:29:48 P.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\ntomorrow  I can stick post-it notes in <br/>\nthe &quot;good parts&quot; of what I&#39;m reading and drop  them into conversation <br/>\nsometime when James seems to be in the mood to  talk.  (Those of you that <br/>\nhave talkative, extraverted kids should  imagine a different attitude at <br/>\nmy house. &lt;g&gt;)  And I can  review them and prioritize them first so that <br/>\nthe seemingly dullest topics  are at the bottom of the list.<br/>\n<br/>\n<br/>\n<br/>\n--------<br/>\n <br/>\nThat sounds kind of horrible to me.<br/>\nHorrible in a strained and artificial way, I mean.<br/>\n <br/>\n-=If I intentionally read books to myself about topics he was interested  <br/>\nin I might have more good conversations starters.  I suppose I would do  <br/>\nthat if I was 20 years old and trying to impress a guy. -=-<br/>\n <br/>\nThere&#39;s something between accepting a chasm between you and  reading a book <br/>\nabout a topic he&#39;s interested in.  There are magazine  articles and webpages <br/>\nyou could read about things he&#39;s interested in, and show  him the good parts.  <br/>\nDon&#39;t work it into the conversation in a weird way,  just say &quot;Hey, did you <br/>\nalready know this about Halo II?&quot; or whatever,  maybe.<br/>\n <br/>\n-=-If I intentionally read books to myself about topics he was interested  <br/>\nin I might have more good conversations starters.  I suppose I would do  <br/>\nthat if I was 20 years old and trying to impress a guy.  (Ahem, sad but  <br/>\ntrue.)  Does that seem like a reasonable tactic for enhancing  unschooling?<br/>\n-=-<br/>\n <br/>\nNot if it seems stilted and false to you (like trying to impress a  guy).  <br/>\nBut what if you were 20 and had a boyfriend who loved hockey?   Between &quot;hockey <br/>\nsucks&quot; and immersing yourself in all things hockey, there would  be a balance <br/>\npoint for you.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104556178","msgId":102002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDQxRDYyODU3LjYwMTAyMDdAZWFydGhsaW5rLm5ldD4="},"prevInTopic":101999,"nextInTopic":102004,"prevInTime":102001,"nextInTime":102003,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-583835124\">&lt;&lt;&lt;&lt;&lt;If I intentionally read books to myself about topics he was interested <br/>\nin I might have more good conversations starters.  I suppose I would do <br/>\nthat if I was 20 years old and trying to impress a guy.  (Ahem, sad but <br/>\ntrue.)  Does that seem like a reasonable tactic for enhancing<br/>\nunschooling?&gt;&gt;&gt;&gt;<br/>\n<br/>\nTaken in the same spirit as watching the tv show they love with them once or<br/>\ntwice to understand what *they* like about it, even if you don&#39;t, I think it<br/>\nsounds very Unschooling-enhancing. Of course, if it turns out to be so<br/>\nsoul-numbingly stultifying that you can hardly bear to turn the next page,<br/>\nperhaps asking for a summary from the kid might be better. Hey there&#39;s an<br/>\nidea - asking questions as conversation starters - depending on the kid&#39;s<br/>\npersonality of course.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.822 / Virus Database: 560 - Release Date: 12/22/2004</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104554071","msgId":101999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRDYyODU3LjYwMTAyMDdAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDkuM2E4M2IyZTMuMmYwNzZiNGRAYW9sLmNvbT4=","referencesHeader":"PDkuM2E4M2IyZTMuMmYwNzZiNGRAYW9sLmNvbT4="},"prevInTopic":101991,"nextInTopic":102002,"prevInTime":101998,"nextInTime":102000,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"** Are all discussions purely for your enjoyment?  Sometimes it s courteous to include someone just because he s there.** Good point. I wouldn t start a","messageBody":"<div id=\"ygrps-yiv-817547385\">** Are all discussions purely for your enjoyment?  Sometimes it&#39;s  <br/>\ncourteous to<br/>\ninclude someone just because he&#39;s there.**<br/>\n<br/>\nGood point.<br/>\n<br/>\nI wouldn&#39;t start a discussion with my kid if I didn&#39;t think he would <br/>\nenjoy it, unless I had a strong need for information from him.<br/>\n<br/>\nI&#39;m considering the scenario when I&#39;m reading a book and finding an idea <br/>\nor fact that I (at my advanced age) find interesting.  While I&#39;m doing <br/>\nthis, it&#39;s most likely that my son is watching TV or playing a computer <br/>\ngame.  Does he want to hear me say &quot;Here&#39;s an interesting anecdote.  <br/>\nApparently John Kerry has trouble deciding what to order in a <br/>\nrestaurant.  Maybe the flip-flopping rap wasn&#39;t as unfair as I <br/>\nthought.&quot;  How about &quot;The proposed social security reforms look like <br/>\nthey are really going to shaft stay-at-home moms that end up <br/>\ndivorced.&quot;?  Or &quot;Thomas Jefferson really is my kind of guy.  I really <br/>\nlike this quote of his about his perception of Jesus.&quot;  Or &quot;This study <br/>\nof media bias in the early Seventies had really screwy methodology.&quot;  <br/>\nThese are all things that I remember really lighting up my brain in the <br/>\nlast month that I did not think would be interesting to my ten year old kid.<br/>\n<br/>\nI&#39;m already sleepy tonight, but tomorrow I can stick post-it notes in <br/>\nthe &quot;good parts&quot; of what I&#39;m reading and drop them into conversation <br/>\nsometime when James seems to be in the mood to talk.  (Those of you that <br/>\nhave talkative, extraverted kids should imagine a different attitude at <br/>\nmy house. &lt;g&gt;)  And I can review them and prioritize them first so that <br/>\nthe seemingly dullest topics are at the bottom of the list.<br/>\n<br/>\nIf I intentionally read books to myself about topics he was interested <br/>\nin I might have more good conversations starters.  I suppose I would do <br/>\nthat if I was 20 years old and trying to impress a guy.  (Ahem, sad but <br/>\ntrue.)  Does that seem like a reasonable tactic for enhancing unschooling?<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104548173","msgId":101991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkuM2E4M2IyZTMuMmYwNzZiNGRAYW9sLmNvbT4="},"prevInTopic":101985,"nextInTopic":101999,"prevInTime":101990,"nextInTime":101992,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/31/2004 5:10:07 P.M. Mountain Standard Time, ecsamhill@earthlink.net writes: I d  rather discuss politics with an informed adult who","messageBody":"<div id=\"ygrps-yiv-588426642\">In a message dated 12/31/2004 5:10:07 P.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\nI&#39;d  rather discuss politics <br/>\nwith an informed adult who remembers the last 5  presidential elections.<br/>\n<br/>\n<br/>\n---------------------<br/>\n <br/>\nHow does a person become an informed adult, though?  It has to start  <br/>\nsomewhere.<br/>\n <br/>\nAre all discussions purely for your enjoyment?  Sometimes it&#39;s  courteous to <br/>\ninclude someone just because he&#39;s there.   I like to talk  about music with <br/>\nsomeone who remembers the 60&#39;s, but when someone wasn&#39;t born  until the 80&#39;s, I <br/>\ndon&#39;t mind clarifying references, or naming one of the group&#39;s  songs to give <br/>\nthem a point of reference or something.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re:  Doing too little?","postDate":"1104529409","msgId":101985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhkLjFkNjAzNTIzLjJmMDcyMjAxQGFvbC5jb20+"},"prevInTopic":101982,"nextInTopic":101991,"prevInTime":101984,"nextInTime":101986,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/31/2004 2:13:13 P.M. Mountain Standard Time, queenjane555@yahoo.com writes: I was  happy at having company who was pleased to do all this","messageBody":"<div id=\"ygrps-yiv-1798784741\">In a message dated 12/31/2004 2:13:13 P.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:queenjane555@...\">queenjane555@...</a> writes:<br/>\n<br/>\nI was  happy at having <br/>\ncompany who was pleased to do all this shopping with me  without <br/>\nasking all the time &quot;are we done yet?&quot; ---------<br/>\n=========<br/>\n <br/>\nSounds like a really cool day for both of you!<br/>\n <br/>\nNone of my kids are really shoppers.  Holly gets tired of it before I  do, <br/>\nalways.  Luckily that&#39;s one thing I don&#39;t mind doing by myself  (thinking now of <br/>\nthrift stores...).<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  Doing too little?","postDate":"1104527417","msgId":101982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNyNGY3cCtxMm8yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGI3LjRlNGY0MTRjLjJmMDcxMzEwQGFvbC5jb20+"},"prevInTopic":101980,"nextInTopic":101985,"prevInTime":101981,"nextInTime":101983,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"I m not sure where this fits in, but someone mentioned taking another kid (rather than your own)to go do the things you want to do, if you dont want to go","messageBody":"<div id=\"ygrps-yiv-1989172161\">I&#39;m not sure where this fits in, but someone mentioned taking <br/>\nanother kid (rather than your own)to go do the things you want to <br/>\ndo, if you dont want to go alone and your kid isnt interested.<br/>\n<br/>\nI had an interesting time this week. Seamus was away visiting his <br/>\ndad, and i decided to spend some &quot;quality&quot; time with my niece who is <br/>\n9 yo. I never spend time alone with her. She&#39;s at that age, <br/>\nthe &quot;cusp of womanhood&quot; &lt;g&gt; where spending time with her older aunts <br/>\nmakes her feel all grown up and &quot;in the loop&quot; (i have two sisters <br/>\nand we are all very close.) <br/>\n<br/>\nI got to go to Borders and just hang out! I never get to do that <br/>\nwith seamus, he doesnt have the same book-worship thing i&#39;ve got. My <br/>\nniece is TOTALLY into books (one of those kids that reads a book a <br/>\nday, and spends hours in her room reading.) I even bought her a <br/>\ncouple books (she also had the gift card from my brother), and she <br/>\nwas sooo grateful like i&#39;d given her gold. We had fun reading the <br/>\nback of book jackets out loud to one another, with feeling, which <br/>\napparently no one else does, because we got some strange looks!<br/>\n<br/>\nWe then went to Pier One Import, which is another place i dont take <br/>\nseamus (the saying &quot;Bull in a China Shop&quot; comes to mind)because he <br/>\nhates going there and everything is so fragile...and we had so much <br/>\nfun! looking at all the little pretty things i got her some <br/>\nclearance xmas ornaments that were beaded and so pretty, and she was <br/>\nsooo happy at having all this attention. I was happy at having <br/>\ncompany who was pleased to do all this shopping with me without <br/>\nasking all the time &quot;are we done yet?&quot; <br/>\n<br/>\nWe went to the pet store to look at the animals and buy cat treats, <br/>\nand went to lunch. The previous day we went to see A Series of <br/>\nUnfortunate Events (and to the bookstore too, no way would seamus <br/>\ngo to a bookstore with me two days in a row. In fact we went to <br/>\nborders twice and waldenbooks, all within 24 hours!)Now i know who <br/>\ni&#39;m taking when i have the desire to just go hang out and explore a <br/>\nbookstore. In fact, i&#39;m thinking of planning a trip, just with my <br/>\nniece, to the huge (warehouse sized)used bookstore in Detroit. I <br/>\nthink she&#39;d die...she&#39;s never seen such a thing. <br/>\n<br/>\nAnyhow, its nice to switch kids once and awhile!<br/>\n<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104526869","msgId":101980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyYi41Mzc4M2Q2YS4yZjA3MTgxNUBhb2wuY29tPg=="},"prevInTopic":101977,"nextInTopic":101982,"prevInTime":101979,"nextInTime":101981,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/31/2004 11:16:27 A.M. Mountain Standard Time, unschooler@swbell.net writes: We ve  created an ADD society because of it. ... eeek! ","messageBody":"<div id=\"ygrps-yiv-1319043957\">In a message dated 12/31/2004 11:16:27 A.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooler@...\">unschooler@...</a> writes:<br/>\n<br/>\nWe&#39;ve  created an ADD society because of it.<br/>\n <br/>\n--------------<br/>\n<br/>\neeek!<br/>\n <br/>\n&quot;Created&quot;?<br/>\n <br/>\nIf my hobby were embroidery and I embroidered with all my free time and  read <br/>\nembroidery magazines and books, that wouldn&#39;t create much interaction with  <br/>\nmy kids, nor stir much discussion, I&#39;m afraid.  <br/>\n <br/>\n-=- Switching interests frequently is a <br/>\nschool thing.  I don&#39;t  think it happens naturally anywhere else in <br/>\nthe world.-=-<br/>\n <br/>\nI think it happens seasonally, with gardening and cooking and yardwork and  <br/>\ncrafts and such.<br/>\nIt happens in my life, because I immerse myself and then get tired of that  <br/>\nthing and want a balancing thing.<br/>\n <br/>\nIt&#39;s kind of like foods.  I love potatoes, but haven&#39;t had any for  over a <br/>\nweek.  If I eat potatoes every day, I&#39;ll get really tired of  them.  I like lots <br/>\nof things, and I binge, but if I stayed there  constantly, it could turn <br/>\nstagnant.<br/>\n <br/>\nSometimes I sew.  Sometimes I watch Shakespeare.  Sometimes I do  both at the <br/>\nsame time, and sometimes I do neither for three months.  That&#39;s  not schooly. <br/>\n That&#39;s the rhythm of a busy life.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104526306","msgId":101977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkLjU2Mzg3NDhhLjJmMDcxNWUyQGFvbC5jb20+"},"prevInTopic":101975,"nextInTopic":101980,"prevInTime":101976,"nextInTime":101978,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/31/2004 8:37:18 A.M. Mountain Standard Time, ecsamhill@earthlink.net writes: An offer  to go on an outing seems more ephemeral.  Should","messageBody":"<div id=\"ygrps-yiv-1636662137\">In a message dated 12/31/2004 8:37:18 A.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\nAn offer  to go on an outing seems more <br/>\nephemeral.  Should it be offered, say,  three times?  (Far in advance, a <br/>\nweek in advance and that  morning?)<br/>\n<br/>\n<br/>\n<br/>\n---------------<br/>\n <br/>\nDo you mean if he says no the first time ask again a week in advance and  <br/>\nthen again that morning!??<br/>\n <br/>\nIf I say &quot;We should go to this cool thing!&quot; and if a kid says &quot;Yeah!&quot;   then <br/>\nit&#39;s on the calendar, and I remind them when the time&#39;s near, and on the  day <br/>\nwe go.<br/>\n <br/>\nIf my husband asks me far in advance if I want to go to dinner for my  <br/>\nanniversary, he doesn&#39;t then offer again a week in advance and offer again that  <br/>\nmorning.  Done is done!<br/>\n <br/>\n-=-An offer to go on an outing seems more <br/>\nephemeral.  Should it be  offered, say, three times?  (Far in advance, a <br/>\nweek in advance and that  morning?)<br/>\n=-<br/>\n <br/>\nIf his answer is &quot;I don&#39;t know,&quot; then yeah, maybe ask again later.  A  second <br/>\n&quot;I don&#39;t know&quot; is probably no.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104525584","msgId":101975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI3LjRlNGY0MTRjLjJmMDcxMzEwQGFvbC5jb20+"},"prevInTopic":101972,"nextInTopic":101977,"prevInTime":101974,"nextInTime":101976,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/30/2004 11:29:25 P.M. Mountain Standard Time, pamsoroosh@mac.com writes: I have  started to be the one to say, How about we don t make","messageBody":"<div id=\"ygrps-yiv-1059287235\">In a message dated 12/30/2004 11:29:25 P.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a> writes:<br/>\n<br/>\nI have  started <br/>\nto be the one to say, &quot;How about we don&#39;t make any plans for  Friday - <br/>\njust stay home and putter around?&quot; This is still me doing the  <br/>\ninitiating.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n--------------<br/>\n <br/>\nanti-&#39;nitiation?<br/>\n <br/>\nYou&#39;re initiating halts?<br/>\nYou&#39;re scheduling putzing? &lt;g&gt;<br/>\n <br/>\n-=BUT - the goal is a satisfyingly-immersed-in-life present - not finding  <br/>\nways to sort of trick a kid into learning something.-=-<br/>\n <br/>\nGood description.<br/>\nIf the life is all a-swirl, they WILL learn, so you guarantee the learning <br/>\nand you get, as side benefits, the family togetherness, common experiences,  <br/>\nand fun!<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: .RE: [UnschoolingDiscussion] Doing too little?  WAS Unsch and &quot;gifted&quot; ch...","postDate":"1104525157","msgId":101972,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmMy4zYmNlMDFjLjJmMDcxMTY1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":101975,"prevInTime":101971,"nextInTime":101973,"topicId":101972,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/30/2004 1:55:25 P.M. Mountain Standard Time, mamaaj2000@yahoo.com writes: I m  still working on strewing without valuing the academic","messageBody":"<div id=\"ygrps-yiv-1705387802\">In a message dated 12/30/2004 1:55:25 P.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamaaj2000@...\">mamaaj2000@...</a> writes:<br/>\n<br/>\nI&#39;m  still working on strewing without valuing the &quot;academic&quot; activity <br/>\nmore. To  me that&#39;s the ideal: to strew all sorts of math games, <br/>\nbooks, games, toys  and outings without silently cheering for any <br/>\nparticular  choice.<br/>\n<br/>\n<br/>\n<br/>\n------------------<br/>\n <br/>\nSilently cheering isn&#39;t so harmful.  It takes parents a long time to  get <br/>\nover their own school pride/shame/attachment/fear.<br/>\n <br/>\nI was kinda thrilled when Marty asked for the Romance of the Three  Kingdoms, <br/>\nbecause it&#39;s historical (though it&#39;s a novel, it was written hundreds  of <br/>\nyears ago, in China) and it&#39;s not an easy read.   But I didn&#39;t say  those things <br/>\nto Marty.  I got it out of my system by telling others.   &lt;g&gt;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":101856,"nextTopicId":102307}}