{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Hi! I am new here","postDate":"1263326696","msgId":113364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNENENUU4LjcwOTAxMDBAbWFjLmNvbT4=","inReplyToHeader":"PDhFRTAwNzZCLUVGQTgtNDBCMi1BQkIxLUI2NTBFQzY5ODE4QUBnbWFpbC5jb20+","referencesHeader":"PGhpZnRmMytub2NuQGVHcm91cHMuY29tPiA8OEVFMDA3NkItRUZBOC00MEIyLUFCQjEtQjY1MEVDNjk4MThBQGdtYWlsLmNvbT4="},"prevInTopic":113363,"nextInTopic":0,"prevInTime":113363,"nextInTime":113365,"topicId":113356,"numMessagesInTopic":0,"msgSnippet":"Keith - I approved your post this time, but would like to ask you and everyone else to please trim the original post - only including the specific parts you","messageBody":"<div id=\"ygrps-yiv-524372170\">Keith - I approved your post this time, but would like to ask you and <br/>\neveryone else to please trim the original post - only including the <br/>\nspecific parts you are responding to, but not the entire post. People on <br/>\ndigest end up with many copies of every post and it is much more <br/>\ndifficult for them to follow the discussion.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 1/11/2010 4:10 PM, Keith Green wrote:<br/>\n&gt; I think what you&#39;re being is nice, not lazy. You aren&#39;t making her do things she dislikes. You aren&#39;t giving her cause for complaint. You aren&#39;t hurting her. That is all very good in my book.<br/>\n&gt;    <br/>\nI agree. One of the things I repeated to myself when my kids were young <br/>\nand we were just getting started unschooling was: &quot;Do no harm.&quot; It is <br/>\neasy to squash natural curiosity and love of learning - few kids can <br/>\nstand up to what schools do to them in this area and parents can do even <br/>\nmore harm than schools, sometimes.<br/>\n&gt; If she seems motivated to do some things, and isn&#39;t lazy about pursuing her own goals, then I don&#39;t think you have anything to worry about.<br/>\n&gt;    <br/>\nWell - you might have other things to worry about - but when a person <br/>\nshows energy and gumption in pursuing things they are interested in, <br/>\nresistance to doing other things can be a good sign. Resistance can be <br/>\npassive (which might look like being lazy) or active (which might be <br/>\nreferred to by parents as rebellious or disrespectful). On the other <br/>\nhand, maybe lazy is being used as a euphemism for uncaring or <br/>\nthoughtless or unhelpful. Or maybe the concern is appropriate because <br/>\nmaybe the child is depressed, not lazy. We don&#39;t really know, but these <br/>\nare just ideas for the parent to consider.<br/>\n&gt; If there is a genuine issue with laziness, then she could use help. But the best kind of help wouldn&#39;t be making her do stuff. Putting external pressure on people does not help them create internal motivation that will help them have drive in their whole life.<br/>\n&gt;    <br/>\nI can&#39;t even really wrap my head around what &quot;lazy&quot; would mean in a <br/>\nkid&#39;s life. A kid who doesn&#39;t have the urge to do much? Bored? Tired? <br/>\nDepressed? Disorganized? Angry?<br/>\n<br/>\n  Maybe they have a parent who is an over-achieving Type A personality <br/>\nand the kid looks lazy in comparison?<br/>\n&gt; The best kind help would be to help the person see that effort is fruitful and worthwhile and effective, and to help teach how to do things efficiently and thoughtfully so effort isn&#39;t wasted.....<br/>\n&gt;    <br/>\nI don&#39;t think this is the best kind of help - the best help is to <br/>\nsupport their interests so that they learn from their own experience how <br/>\nit is worth it to put a lot of effort into some things and not others. I <br/>\ndon&#39;t recommend trying to &quot;teach&quot; them anything.<br/>\n&gt; For the math issue, she might like to know that learning to do long division is a waste of time. It can easily be done by a calculator, a laptop, or an iPhone. She should be proud not to have wasted her time learning a useless skill she wasn&#39;t interested in. Similarly, learning to write in cursive is pretty useless nowadays; many people only ever use it for their signature. There are a lot of things she can point out she doesn&#39;t know and be proud not to know; instead of those things she knows better things, e.g. I bet she has better computer literacy than most of the school kids, which is genuinely useful. With this sort of attitude, encounters with school kids needn&#39;t be scary.<br/>\n&gt;    <br/>\nTwo of my three kids seemed to learn to do long division somehow <br/>\nsomewhere - I have no idea where or why they picked it up. My middle <br/>\ndaughter was trying to figure out how many days it would take us to <br/>\ndrive from Southern California to NYC to see the musical CATS on <br/>\nBroadway. She had asked me how far it was (3,000 miles) and how many <br/>\nmiles we could drive in a day (I said about 450). I noticed she was <br/>\nsubtracting 450 from 3,000, over and over, to figure how many 450&#39;s <br/>\nthere were in 3,000. She&#39;d misread her own handwriting and made a <br/>\nmistake toward the top and suddenly realized that the far right number <br/>\nHAD to be a zero and it wasn&#39;t. So she was frustrated. I said to her, &quot;I <br/>\ncan show you an easier way to do that, if you want.&quot; She did. I did. She <br/>\nthought it was cool. I told her it was called &quot;long division&quot; and her <br/>\nresponse was, &quot;NO WAY!! Why doesn&#39;t everybody hate it?&quot; She then asked <br/>\nme to give her some big hairy long division problems to do - ones with <br/>\n10 or 12 digits. She did those, I looked them over and she&#39;d done them <br/>\nall correctly. The entire process took about 30 minutes, maybe 45 <br/>\nminutes. She was excited and enthusiastic. I looked it up in the <br/>\nCalifornia state standards and they allocate 30 HOURS to do what we did <br/>\nin 30 to 45 minutes when it came up naturally, the interest was there, <br/>\nand she was 13 or 14 (can&#39;t remember). She thought it was really cool. <br/>\nShe kind of complained, momentarily, about why I hadn&#39;t shown it to her <br/>\nbefore - but I just said, &quot;I don&#39;t know - it never came up.&quot;<br/>\n<br/>\nIt isn&#39;t an entirely useless technique to know - but it isn&#39;t super <br/>\nimportant, either.<br/>\n<br/>\nReading cursive writing is potentially helpful - but not hard to pick <br/>\nup. A young friend of mine wanted to learn sign language, turns out the <br/>\ninstructor writes a lot of things on a board in the front and she always <br/>\nwrites in cursive.  I&#39;m sure there are other circumstances that have <br/>\npopped up where being able to read cursive would be nice - but it really <br/>\nisn&#39;t hard to pick it up if and when it is needed. Writing in cursive - <br/>\nnot needed ever, I don&#39;t think, unless it is for the love of it.<br/>\n<br/>\n-pam </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Hi! I am new here","postDate":"1263313717","msgId":113358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNENBMzM1LjkwMTA5MDVAbWFjLmNvbT4=","inReplyToHeader":"PGhpZnRmMytub2NuQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpZnRmMytub2NuQGVHcm91cHMuY29tPg=="},"prevInTopic":113357,"nextInTopic":113363,"prevInTime":113357,"nextInTime":113359,"topicId":113356,"numMessagesInTopic":0,"msgSnippet":"Unschooling is really impossible to confuse with being lazy. It takes a lot of time and energy and thought on the part of the parent. Now, for some people, it","messageBody":"<div id=\"ygrps-yiv-1376499369\">Unschooling is really impossible to confuse with being lazy. It takes a <br/>\nlot of time and energy and thought on the part of the parent. Now, for <br/>\nsome people, it is SO fun that it seems easy --- just like anything <br/>\nelse, when you&#39;re loving what you&#39;re doing, it doesn&#39;t seem like work.<br/>\n<br/>\nBut - it really does take a lot of time and devotion and focus -- the <br/>\nparent needs to really think about the child. A LOT. The parent needs to <br/>\nbring interesting things and ideas and experiences to the child and this <br/>\nmeans being always on the lookout for what the child might enjoy. It <br/>\nmeans becoming super aware of your child - not only getting a good sense <br/>\nof what might interest him or her, but how does h/she express that <br/>\ninterest and what is the best way for you to offer new and potentially <br/>\ninteresting ideas, experiences, and things. The parent needs to consider <br/>\nwhen and how to support the child in further pursuing a current interest <br/>\nand when the child might be more interested in moving on to something <br/>\nelse. The parent needs to be aware of when the child needs someone to <br/>\ntalk to and be with and interact with and when the child needs more <br/>\nsolitary time to think and pursue an interest on his/her own. The parent <br/>\nneeds to get a sense of when the kid needs a more active social life and <br/>\nwhen he needs to meet some new people or when he needs help in staying <br/>\nconnected with old friends.<br/>\n<br/>\nThe parent needs to be so aware of the child that the parent <br/>\nautomatically thinks of him/her and partially sees the world through <br/>\nh/her eyes.<br/>\n<br/>\nThis is all a tall order. Overly self-centered people can&#39;t do it <br/>\nbecause it requires a lot of empathy. People with too many personal <br/>\nproblems that they haven&#39;t addressed in their own lives probably can&#39;t <br/>\ndo it because they are too distracted by those. People who are too <br/>\nnegative or cynical can&#39;t do it because they tend to crush interest and <br/>\njoy, not build it up. People who lack curiosity and a certain amount of <br/>\ngusto for life can&#39;t really do it.<br/>\n<br/>\nOn the other hand, we grow into it. Turns out that we parents learn, too <br/>\n&lt;g&gt;. So - when we are making moves, taking steps, in the direction of <br/>\nunschooling, turns out the trail starts to open up in front of us and we <br/>\nget more and more sure-footed as we travel the unschooling path.<br/>\n<br/>\nMy suggestion is that you ask yourself really honestly, is there <br/>\nsomething more I could be doing for my child that would enhance my <br/>\nchild&#39;s life? If the answer is yes, then make the choice to do it. Then <br/>\nask this question of yourself again and again and, each time, make the <br/>\nlife-enriching choice. Apply this to small things and to big momentous <br/>\ndecisions. Small things - could I make something for dinner that would <br/>\nbe special and interesting? Did I see a cool rock on the ground outside <br/>\n- could I bring it in and wash it and set it on the table for others to <br/>\nnotice. Big things - would my child enjoy traveling - can we take a <br/>\nfamily vacation that involves exploring things my child would find <br/>\ninteresting?<br/>\n<br/>\nIn unschooling, &quot;lazy&quot; means not thinking about enriching and enhancing <br/>\nyour child&#39;s life. You change this by doing it - one choice at a time.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 1/11/2010 11:16 AM, shepelec2002 wrote:<br/>\n&gt; My husband feels that Unschooling is just another word for me being lazy,and that I do not want o take the time to sit with her and do her lessons, and not keeping my daughter accountable for doing her work. And that in life, you always have to answer to someone. No matter what age you are.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Hi! I am new here","postDate":"1263312538","msgId":113357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNEM5RTlBLjgwMjA3MDFAbWFjLmNvbT4=","inReplyToHeader":"PGhpZnRmMytub2NuQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpZnRmMytub2NuQGVHcm91cHMuY29tPg=="},"prevInTopic":113356,"nextInTopic":113358,"prevInTime":113356,"nextInTime":113358,"topicId":113356,"numMessagesInTopic":0,"msgSnippet":"Hi -- before I get to the rest of the post, I want to say to everyone (not directed just at this new person) - please don t worry about how you are","messageBody":"<div id=\"ygrps-yiv-560719946\">Hi -- before I get to the rest of the post, I want to say to everyone <br/>\n(not directed just at this new person) - please don&#39;t worry about how <br/>\nyou are &quot;classified.&quot; Look at unschooling more as treasure - the <br/>\nunschooling world is overflowing with great ideas and ways to enhance <br/>\nyour lifestyle and bring joy and enthusiasm and energy into your home. <br/>\nUse as much of it as you can use - there is always more treasure to be <br/>\nfound.<br/>\n<br/>\nSo - my point is, we do better to think of ourselves as all searching <br/>\nfor and digging through a mountain of treasure, rather than joining some <br/>\nsort of club. Yes, some of us have found a LOT of treasure and know a <br/>\nlot about what there is to find and how to dig it out. Ask us, we can <br/>\nhelp you find it and recognize it and we can help you separate the truly <br/>\nvaluable treasure from the fool&#39;s good &lt;G&gt;. But, really focus on your <br/>\nown discovery, use what you find to make your family&#39;s life better and <br/>\nbetter. Don&#39;t worry about whether you&#39;ve gathered enough to somehow <br/>\nqualify as part of the unschooling uppercrust or anything like that.<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 1/11/2010 11:16 AM, shepelec2002 wrote:<br/>\n&gt; I am new here. I am not sure if you classify me as an &quot;Unschooler&quot; or not.<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":426059133,"authorName":"Keith Green","from":"Keith Green &lt;popper256@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Hi! I am new here","postDate":"1263255051","msgId":113363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhFRTAwNzZCLUVGQTgtNDBCMi1BQkIxLUI2NTBFQzY5ODE4QUBnbWFpbC5jb20+","inReplyToHeader":"PGhpZnRmMytub2NuQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpZnRmMytub2NuQGVHcm91cHMuY29tPg=="},"prevInTopic":113358,"nextInTopic":113364,"prevInTime":113362,"nextInTime":113364,"topicId":113356,"numMessagesInTopic":0,"msgSnippet":"... I think what you re being is nice, not lazy. You aren t making her do things she dislikes. You aren t giving her cause for complaint. You aren t hurting","messageBody":"<div id=\"ygrps-yiv-644330329\">On Jan 11, 2010, at 11:16 AM, shepelec2002 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi everyone<br/>\n&gt; <br/>\n&gt; I am new here. I am not sure if you classify me as an &quot;Unschooler&quot; or not.<br/>\n&gt; <br/>\n&gt; I have an 11 year old daughter who has always been home with me, for the exception of one year in public school, 2 years ago for grade 3. She hated it.<br/>\n&gt; <br/>\n&gt; I have never really used a curriculum. Well, I can say that we have tried it, and after a month or so it peetered out, and my 11 yo has no interest in learning &quot;boring&quot; stuff.<br/>\n&gt; <br/>\n&gt; My husband feels that Unschooling is just another word for me being lazy,and that I do not want o take the time to sit with her and do her lessons, and not keeping my daughter accountable for doing her work. And that in life, you always have to answer to someone. No matter what age you are. <br/>\n&gt; <br/>\n&gt; So, my daughter sleeps until whenever she wants. Another thing that bugs him. And she likes to be on her computer all day. She likes to make movies, write stories, and talk with her friends. She also loves to read. Books she likes. Not anything really &quot;educational&quot;.<br/>\n&gt; <br/>\n&gt; So, I am not really sure if I have been &quot;Unschooling&quot; or am I really just lazy, and just do not want to deal with her whining about doing &quot;Schoolwork&quot;.<br/>\n&gt; <br/>\n&gt; I was thinking of ordering Sandra Dodd&#39;s new book, to give me a better idea on Unschooling.<br/>\n&gt; <br/>\n&gt; I do not want my daughter to turn out lazy and unmotivated, but I also do not want to force boring stuff on her either. And I do want her to get along in life. Or not have her be embarrassed if a public school friend of hers asks her about long division or fractions(Something she cannot do), and have her say &quot;I dunno&quot;.<br/>\n&gt; <br/>\n&gt; She is an excelent reader. Self taught. Math is not her thing.<br/>\n&gt; <br/>\n&gt; Computers, reading and writing. That is her thing.<br/>\n&gt; <br/>\n&gt; Any guidance? Am I doing the right thing?<br/>\n<br/>\n </span></blockquote>I think what you&#39;re being is nice, not lazy. You aren&#39;t making her do things she dislikes. You aren&#39;t giving her cause for complaint. You aren&#39;t hurting her. That is all very good in my book<br/>\n<br/>\nIf she seems motivated to do some things, and isn&#39;t lazy about pursuing her own goals, then I don&#39;t think you have anything to worry about.<br/>\n<br/>\nSome people have a problem with laziness or procrastination. They want to do something, but don&#39;t do it. Or they feel bad about trying hard to do something and want things to be easy. This only counts if it&#39;s a problem doing stuff one wants to do; many people resist doing stuff other people, like a school, want them to do, and that&#39;s not laziness.<br/>\n<br/>\nIf there is a genuine issue with laziness, then she could use help. But the best kind of help wouldn&#39;t be making her do stuff. Putting external pressure on people does not help them create internal motivation that will help them have drive in their whole life.<br/>\n<br/>\nThe best kind help would be to help the person see that effort is fruitful and worthwhile and effective, and to help teach how to do things efficiently and thoughtfully so effort isn&#39;t wasted, and also to help give advice on which things are worth doing and which aren&#39;t. It&#39;s good to make an effort, but not for everything, there are some things not worth doing, so learning to discriminate is important.<br/>\n<br/>\n<br/>\nFor the math issue, she might like to know that learning to do long division is a waste of time. It can easily be done by a calculator, a laptop, or an iPhone. She should be proud not to have wasted her time learning a useless skill she wasn&#39;t interested in. Similarly, learning to write in cursive is pretty useless nowadays; many people only ever use it for their signature. There are a lot of things she can point out she doesn&#39;t know and be proud not to know; instead of those things she knows better things, e.g. I bet she has better computer literacy than most of the school kids, which is genuinely useful. With this sort of attitude, encounters with school kids needn&#39;t be scary.</div>","specialLinks":[]},{"userId":26943692,"authorName":"shepelec2002","from":"&quot;shepelec2002&quot; &lt;pscs@...&gt;","profile":"shepelec2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Hi! I am new here","postDate":"1263237411","msgId":113356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpZnRmMytub2NuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":113357,"prevInTime":113355,"nextInTime":113357,"topicId":113356,"numMessagesInTopic":0,"msgSnippet":"Hi everyone I am new here. I am not sure if you classify me as an Unschooler or not. I have an 11 year old daughter who has always been home with me, for the","messageBody":"<div id=\"ygrps-yiv-1920275683\">Hi everyone<br/>\n<br/>\nI am new here. I am not sure if you classify me as an &quot;Unschooler&quot; or not.<br/>\n<br/>\nI have an 11 year old daughter who has always been home with me, for the exception of one year in public school, 2 years ago for grade 3. She hated it.<br/>\n<br/>\nI have never really used a curriculum. Well, I can say that we have tried it, and after a month or so it peetered out, and my 11 yo has no interest in learning &quot;boring&quot; stuff.<br/>\n<br/>\nMy husband feels that Unschooling is just another word for me being lazy,and that I do not want o take the time to sit with her and do her lessons, and not keeping my daughter accountable for doing her work. And that in life, you always have to answer to someone. No matter what age you are. <br/>\n<br/>\nSo, my daughter sleeps until whenever she wants. Another thing that bugs him. And she likes to be on her computer all day. She likes to make movies, write stories, and talk with her friends. She also loves to read. Books she likes. Not anything really &quot;educational&quot;.<br/>\n<br/>\nSo, I am not really sure if I have been &quot;Unschooling&quot; or am I really just lazy, and just do not want to deal with her whining about doing &quot;Schoolwork&quot;.<br/>\n<br/>\nI was thinking of ordering Sandra Dodd&#39;s new book, to give me a better idea on Unschooling.<br/>\n<br/>\nI do not want my daughter to turn out lazy and unmotivated, but I also do not want to force boring stuff on her either. And I do want her to get along in life. Or not have her be embarrassed if a public school friend of hers asks her about long division or fractions(Something she cannot do), and have her say &quot;I dunno&quot;.<br/>\n<br/>\nShe is an excelent reader. Self taught. Math is not her thing.<br/>\n<br/>\nComputers, reading and writing. That is her thing.<br/>\n<br/>\nAny guidance? Am I doing the right thing? <br/>\n<br/>\nThank you!<br/>\n<br/>\nCindy</div>","specialLinks":[]}],"prevTopicId":113327,"nextTopicId":48275}}