{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":142002410,"authorName":"Kristi","from":"&quot;Kristi&quot; &lt;hayes@...&gt;","profile":"morgainesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Subject: What to Say?","postDate":"1086744560","msgId":95504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNhNXA1ZytsdGY4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGY1LjNjODBkM2JkLjJkZjc4NTAyQGFvbC5jb20+"},"prevInTopic":95468,"nextInTopic":0,"prevInTime":95503,"nextInTime":95505,"topicId":95468,"numMessagesInTopic":0,"msgSnippet":"I ve considered doing this with my daughter, 4.5, and I ve heard of lots of parents who have taken this approach.  In the end, I decided it s too manipulative","messageBody":"<div id=\"ygrps-yiv-1114680093\">I&#39;ve considered doing this with my daughter, 4.5, and I&#39;ve heard of<br/>\nlots of parents who have taken this approach.  In the end, I decided<br/>\nit&#39;s too manipulative and have taken a different approach with her --<br/>\nwe&#39;ll try homeschooling for a while and if she doesn&#39;t like it and<br/>\nstill wants to try public school after a few years she can go (she has<br/>\nput the number 16 on this -- &quot;Like when I&#39;m 16?&quot;).  <br/>\n<br/>\nShe wants to go to school because her friends do.  Because she could<br/>\nride the bus.  Because it looks and sounds like fun.  Because teachers<br/>\non TV are usually awful nice (and in real life that&#39;s true, too). <br/>\nBecause in books and TV you see the fun interactions kids have in a<br/>\nclassroom and in the cafeteria.  And frankly, school can be fun. <br/>\nThere&#39;s a lot about it that I object to as a parent, and a lot she may<br/>\nor may not dislike.  As a mom I&#39;ve decided she&#39;s too young to make<br/>\nthat decision yet, and I hate telling her know. But to sit her at the<br/>\ntable and say &quot;This is what school is like ... oh you don&#39;t like it? <br/>\nOK&quot; in order to get her to say no seems like lying, because in truth,<br/>\nshe might find the negative things coupled with the positives not to<br/>\nmatter as much.  To draw a parallel, I dislike cutting clothing out of<br/>\npatterns.  I dislike the entire process.  But I really enjoy sewing<br/>\nand creating clothing for the kids, and I especially enjoy<br/>\nembellishing them, so I start with the patterns and also do the fuss<br/>\nwork with hems and the like, because I enjoy it enough to make it<br/>\nworth it.  She might like school enough that waiting for the bathroom<br/>\nisn&#39;t so bad.  And until she gets to experience it, she&#39;ll probably<br/>\nfeel like she&#39;s missing out, at least until we build a stronger<br/>\nhomeschooling network (we&#39;re working on it!).  But if I&#39;m brainwashing<br/>\nand manipulating her, IMO, I&#39;m not doing her any better service than<br/>\nthe schools I&#39;m keeping her from.  Does anybody have another angle on<br/>\nthis?  I&#39;m always glad to read about this topic as it&#39;s one we often<br/>\nstruggle with in our home.  <br/>\n<br/>\nKristi <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When my third son wanted to go to school I told him we&#39;d &quot;do school&quot;<br/>\n </span></blockquote>at home <br/>\n<blockquote><span title=\"ireply\"> &gt; first to see if it was what he really wanted.<br/>\n&gt; I got out some workbooks and had him sit at the table. He started to<br/>\n </span></blockquote>get up <br/>\n<blockquote><span title=\"ireply\"> &gt; and I asked what he was doing and he said he needed a drink. I told<br/>\n </span></blockquote>him he <br/>\n<blockquote><span title=\"ireply\"> &gt; would have to wait three more hours, until lunch. So he sat back<br/>\n </span></blockquote>down. Then he <br/>\n<blockquote><span title=\"ireply\"> &gt; started to get up again and I asked what he was doing. He said he<br/>\n </span></blockquote>had to go to <br/>\n<blockquote><span title=\"ireply\"> &gt; the bathroom. I told him he&#39;d have to sit down and wait his turn,<br/>\n </span></blockquote>because there <br/>\n<blockquote><span title=\"ireply\"> &gt; was already one child in the bathroom. This lasted about 15 min. and<br/>\n </span></blockquote>no one <br/>\n<blockquote><span title=\"qreply\"> &gt; has ever asked to go to school again. </span></blockquote></div>","specialLinks":[]},{"userId":149070321,"authorName":"Unschoolmom7@aol.com","from":"Unschoolmom7@...","profile":"bkjbcts","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Subject: What to Say?","postDate":"1086728962","msgId":95468,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1LjNjODBkM2JkLjJkZjc4NTAyQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":95504,"prevInTime":95467,"nextInTime":95469,"topicId":95468,"numMessagesInTopic":0,"msgSnippet":"When my third son wanted to go to school I told him we d do school at home first to see if it was what he really wanted. I got out some workbooks and had him","messageBody":"<div id=\"ygrps-yiv-795375043\">When my third son wanted to go to school I told him we&#39;d &quot;do school&quot; at home <br/>\nfirst to see if it was what he really wanted.<br/>\nI got out some workbooks and had him sit at the table. He started to get up <br/>\nand I asked what he was doing and he said he needed a drink. I told him he <br/>\nwould have to wait three more hours, until lunch. So he sat back down. Then he <br/>\nstarted to get up again and I asked what he was doing. He said he had to go to <br/>\nthe bathroom. I told him he&#39;d have to sit down and wait his turn, because there <br/>\nwas already one child in the bathroom. This lasted about 15 min. and no one <br/>\nhas ever asked to go to school again.<br/>\n I think school is horrid. I think it&#39;s a place set up to provide day care <br/>\nfor a lot of kids and teach our children to roam in herds, not to be individuals.<br/>\nMy kids started equating college with regular PS , so we sat down and talked <br/>\nabout that. I told them that they will get a lot more out of college (if they <br/>\ndecide to go) than a lot of people. They won&#39;t go with the expectations thrown <br/>\non them that they have to get a degree, not only that but they have to be a <br/>\nDr., a lawyer, a whatever. My kids are putting some of their money into <br/>\nsavings, plus they get savings bonds for their b-days. Right now none of them want to <br/>\ngo to college and two of my boys want to use the money to open a business and <br/>\nmy oldest wants to travel the world. Most of the family is OK with this. The <br/>\none who isn&#39;t, is a grandpa who was a college Prof, but he&#39;s coming around.<br/>\n<br/>\nKarena <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":95489,"nextTopicId":95507}}