{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":1058339,"authorName":"Juli Kearns","from":"Juli Kearns &lt;jmme@...&gt;","profile":"leavethekidsfoodalone","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning toys","postDate":"1082220302","msgId":92761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4xLjEuMi4yMDA0MDQxNzEwNTg0NC4wMWQ3M2VjOEBtYWlsLm1pbmRzcHJpbmcuY29tPg==","inReplyToHeader":"PDAwMDUwMWM0MjNkZiQwZjA4Y2E1MCRhOGQ4MDVjZkBkYW4+","referencesHeader":"PDAwMDUwMWM0MjNkZiQwZjA4Y2E1MCRhOGQ4MDVjZkBkYW4+"},"prevInTopic":92738,"nextInTopic":0,"prevInTime":92760,"nextInTime":92762,"topicId":92655,"numMessagesInTopic":0,"msgSnippet":"... Don t know how this would go over but if you have a zoo, museums in the area, perhaps you could suggest instead a gift of family passes. Juli [Non-text","messageBody":"<div id=\"ygrps-yiv-673003444\">At 02:17 PM 4/16/2004, you wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;They were pretty ticked off but<br/>\n&gt;the threat of my getting rid of the other ones deterred them.  I hate to<br/>\n&gt;impose such limits on them, and it makes them really angry. &lt;snip&gt;<br/>\n&gt;Anyway, now that I&#39;ve clarified the question does anyone have any more<br/>\n&gt;thoughts on this?  Thanks .<br/>\n&gt;&#39;<br/>\n&gt;Kristi<br/>\n<br/>\n<br/>\n </span></blockquote>Don&#39;t know how this would go over but if you have a zoo, museums in the <br/>\narea, perhaps you could suggest instead a gift of family passes.<br/>\n<br/>\nJuli  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Values","postDate":"1082214465","msgId":92738,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJDQTZCRDY1LjI1RjU1JWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMDAwMWM0MjQxYiRiZGFlZTg1MCRhOGQ4MDVjZkBkYW4+"},"prevInTopic":92716,"nextInTopic":92761,"prevInTime":92737,"nextInTime":92739,"topicId":92655,"numMessagesInTopic":0,"msgSnippet":"... (This is really more directed towards what Leo s been saying, but I couldn t find a good quote that summed up what she was saying as succinctly.) Choosing","messageBody":"<div id=\"ygrps-yiv-1720910699\">on 4/16/04 9:31 PM, Kristi Hayes at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hayes@...\">hayes@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I make choices for myself and my family, and I feel strongly that<br/>\n&gt; I do not want toys in *my* home whose sole purpose is to enact wounding<br/>\n&gt; and killing.<br/>\n<br/>\n </span></blockquote>(This is really more directed towards what Leo&#39;s been saying, but I couldn&#39;t<br/>\nfind a good quote that summed up what she was saying as succinctly.)<br/>\n<br/>\nChoosing for ourselves is good.<br/>\n<br/>\nAnd we can&#39;t *not* choose for our families. We&#39;re all going to choose to<br/>\nprovide for our children things we think are important.<br/>\n<br/>\nBut it&#39;s useful to examine our reasons when making choices for others. It&#39;s<br/>\nuseful to examine whether our decisions are based on reality or fallacy or<br/>\n&quot;better safe than sorry.&quot;<br/>\n<br/>\n&quot;Better safe than sorry&quot; is not a bad policy for decisions that affect only<br/>\nourselves. Sometimes we can&#39;t get access to better data to make a more<br/>\ninformed choice. We might choose to give up something to avoid something<br/>\nthat might or might not be true.<br/>\n<br/>\nBut it&#39;s not so good -- and should be examined thoroughly -- when used to<br/>\nmake decisions for other people.<br/>\n<br/>\nIf my husband decided it was better to be safe than sorry to not eat refined<br/>\nsugar, he&#39;s welcome to give up a lot of foods to get something that may be<br/>\nbetter. But if he decided the whole family needed to give up refined sugar<br/>\nbecause *he* had come to the conclusion it was better to be safe than sorry,<br/>\nthen that&#39;s more problematical.<br/>\n<br/>\nIt makes sense that playing acting violence, playing violent video games,<br/>\nrole-playing violence will reinforce violent tendencies. It makes sense that<br/>\nby not allowing children to use toy weapons and by discussing play that<br/>\nlooks violent and how real violence is bad, that they will be peaceful.<br/>\n<br/>\nThere is data that *seems* to support that theory: Not uncommonly people who<br/>\nhave committed horribly violent acts have enjoyed watching violence or<br/>\nenjoyed playing violent games.<br/>\n<br/>\nIt seems reasonable to assume that violent play leads to violence in real<br/>\nlife.<br/>\n<br/>\nBut is it true?<br/>\n<br/>\nBetter to be safe than sorry? That&#39;s not a good enough place to stop on a<br/>\ndiscussion list!<br/>\n<br/>\nWhat people take *away* from the list and *do* is up to them. People are<br/>\nfree to read all the arguments about not controlling our children&#39;s values,<br/>\nparticipate in the debate, and yet still decide to control at home.<br/>\n<br/>\nHere on this list we discuss and examine what *really* happens in real<br/>\nunschooling families. *Real* data that&#39;s applicable to unschooling families<br/>\nfor people to ponder and turn over to make decisions for their families.<br/>\n<br/>\nWhat happens in my home isn&#39;t necessarily what will happen in someone else&#39;s<br/>\nhome. But the outcome of what I do in my home is more likely to apply to<br/>\nsomeone whose values are similar, than the outcome of some criminal from<br/>\nwho-knows-what home life.<br/>\n<br/>\nYou and Leo are theorizing that preventing violent play will yeild peaceful<br/>\nchildren. You have two experiments going (your families) and so far your<br/>\nresults support that theory. But you both have young children so the results<br/>\nare, scientifically speaking, not conclusive.<br/>\n<br/>\nWhat you don&#39;t have are a large pool of families who are preventing violent<br/>\nplay to see the range of outcomes. What you don&#39;t have are families where<br/>\nchildren are loved and treated with respect *and* have violent play (toy<br/>\nguns, boffers, video games, etc.)<br/>\n<br/>\nOne of the pieces of data being offered is that control is widely used. It&#39;s<br/>\none of the more common parenting techniques so there are lots of examples of<br/>\noutcomes. Sometimes control works and children adopt their parents values.<br/>\nSometimes control doesn&#39;t work and children choose differently. Sometimes<br/>\ncontrol fails miserably and children choose what&#39;s been forbidden *because*<br/>\nit&#39;s been forbidden. Since control doesn&#39;t universally work, there is some<br/>\nother factor that caused the children to adopt their family&#39;s values.<br/>\n<br/>\n(There are families here who use to control and now don&#39;t and they can tell<br/>\nyou what the differences are that they&#39;ve seen if you ask.)<br/>\n<br/>\nControl doesn&#39;t work. People *think* it works because it appears to work for<br/>\nsome families (sometimes it really does and sometimes the kids are very<br/>\ndifferent people when out of their parents&#39; sight) and it makes sense that<br/>\nit should work. But control often doesn&#39;t work. Unfortunately when it fails<br/>\npeople don&#39;t usually conclude that control doesn&#39;t work. They conclude that<br/>\nthey just didn&#39;t control enough.<br/>\n<br/>\nThe other piece of data being offered is many real unschooling familes who<br/>\nhave allowed their children to explore the pretend violence to the extent<br/>\nthat intrigues them, and their children are peaceful.<br/>\n<br/>\nWhat *isn&#39;t* happening, and what you theorize will happen, is that children<br/>\nwould extend that violent play into real life.<br/>\n<br/>\nWhat will happen in your home is unknowable. There are so many factors. But<br/>\nTrust and Respect are seeming to be very big factors in allowing children to<br/>\nbecome the decent loving children we hope for them.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Learning toys","postDate":"1082175024","msgId":92716,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwMDUwMWM0MjNkZiQwZjA4Y2E1MCRhOGQ4MDVjZkBkYW4+"},"prevInTopic":92708,"nextInTopic":92738,"prevInTime":92715,"nextInTime":92717,"topicId":92655,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-262696073\">&lt;&lt;Aside from super-frugal we also<br/>\nhave small space.  Right now it&#39;s pretty full.  I&#39;m wondering if I<br/>\nshould get rid of some of the stuff, such as the VTech, and get<br/>\nsomething else, such as tinkertoys, to get more bang per square foot.<br/>\nOr if, on the other hand, it really matters all that much.  Because part<br/>\nof my question involves how strongly I should try to influence the gifts<br/>\nthey get from mom and MIL, who, in spite of my protests, keep buying<br/>\nOrion stuffed Elmos and Morgaine more and more Barbie stuff.  They like<br/>\nthese, but it takes up space.&gt;&gt;<br/>\n<br/>\nWe live in a small space too, although admittedly perhaps not as small as<br/>\nyou - one bedroom apartment. Nor do we have room for visitors - one more<br/>\nreason why we are hoping to move soon. Boy I remember when she had only 15<br/>\nBarbie&#39;s.<br/>\n<br/>\nI can only go back to what we do with Jayn - we only get her toys she asks<br/>\nfor. Last Christmas Jayn wanted a particular baby doll. I asked my parents<br/>\nto get it for her, and Jayn knew they were bringing it (rather than us). Her<br/>\nanticipation and excitement was only matched by her delight when she finally<br/>\ngot it. She told everyone what she would be getting and who was giving it to<br/>\nher. On a similar note, for her birthday she wanted a particular doll only<br/>\navailable at Disneyland. Our tradition is to go there for family events like<br/>\nbirthdays. She was very excited at the thought of getting this doll on her<br/>\nbirthday trip. She actually refused to let me buy it for her when we went to<br/>\nDisneyland the month before her birthday! <br/>\n<br/>\nJayn doesn&#39;t like surprises much. She also has been reluctant to allow me to<br/>\nget rid of any of her baby toys - she sometimes gets them out and uses them<br/>\nfor something or other. Rarely, she offers me something for the Goodwill<br/>\nbag. I make room in the home by continually renouncing my own unused stuff<br/>\nor done with clothes. I find it very freeing, but I guess neither Jayn nor<br/>\nDH feel encumbered by their stuff in the same way I do. We turned the living<br/>\nroom coat closet into her play/storeroom, and I am assiduous in my sorting,<br/>\ntidying and organizing - with her permission when she is done with a game. I<br/>\nam going increasingly vertical with storage. I guess we have just adjusted<br/>\nto living with our space taken up with kid stuff, instead of our stuff. <br/>\n<br/>\nWhat about asking your folks for gift certificates to the stores that you<br/>\nmay not be able to frequent as often? Then your kids could have the<br/>\nopportunity to make their own choices. You can certainly use your lack of<br/>\nspace as a good reason that they might find understandable.<br/>\n<br/>\nPersonally we never toss/remove technologically based toys unless they have<br/>\nbecome totally broken and even then we sometimes take them apart or to the<br/>\ninfrequently organized take-apart days at our local HS group. Jayn goes back<br/>\nto old computer games in the same way that she goes back to old dvd&#39;s - on<br/>\nno particular schedule and in response to who-knows-what external stimuli.<br/>\nActually she rotates through all her toys like that, including the vast<br/>\nseeming supply of stuffed animals she has. I&#39;m excited that she responds to<br/>\ntechno toys as well as &quot;creative&quot; toys like construction stuff and art<br/>\nstuff. <br/>\n<br/>\nAt one point you wrote &quot;Strewing is great, but you need space in which to do<br/>\nit.&quot; It is also a state of mind as well as a physical action. (Trying to<br/>\nthink of an example and failing!)<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.658 / Virus Database: 421 - Release Date: 4/9/2004</div>","specialLinks":[]},{"userId":142002410,"authorName":"Kristi Hayes","from":"&quot;Kristi Hayes&quot; &lt;hayes@...&gt;","profile":"morgainesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Values","postDate":"1082165498","msgId":92708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM0MjQxYiRiZGFlZTg1MCRhOGQ4MDVjZkBkYW4+","inReplyToHeader":"PDY3LjI2Yjk5NWUwLjJkYjFkZTY0QGFvbC5jb20+"},"prevInTopic":92696,"nextInTopic":92716,"prevInTime":92707,"nextInTime":92709,"topicId":92655,"numMessagesInTopic":0,"msgSnippet":"I don t have a problem with others who choose to let their children own toy weapons.  Those are not my children to raise, nor my choices to make.  I make","messageBody":"<div id=\"ygrps-yiv-44907448\">I don&#39;t have a problem with others who choose to let their children own<br/>\ntoy weapons.  Those are not my children to raise, nor my choices to<br/>\nmake.  I make choices for myself and my family, and I feel strongly that<br/>\nI do not want toys in *my* home whose sole purpose is to enact wounding<br/>\nand killing.  I try hard not to judge the decisions of others, though I<br/>\nam only human and not always successful.  I hope this, too, this<br/>\nunwillingness to be judgemental of other people, is a value I&#39;ll pass to<br/>\nthem.  <br/>\n <br/>\nSometimes we pass on our values in surprising ways.  It did sadden me,<br/>\nfor example, when Morgaine one evening commented, &quot;Wow daddy, your steak<br/>\nlooks really good.&quot;  And I said, &quot;You know honey, if you want to try it<br/>\nit&#39;s okay with me.  I think you&#39;re old enough to choose whether to eat<br/>\nanimals or not,&quot; and she decided to be a meat eater.  But what was<br/>\ninteresting was the discussion that came later - one value I&#39;ve tried to<br/>\nshare is the idea that all life is equal; we live in an intricate web<br/>\nand no one life is more important than another.  When we discussed it<br/>\nlater, the choice of eating meat, I told her that if she wanted to try<br/>\nother kinds of animals she&#39;d have to talk with her daddy or her<br/>\ngrandparents, because, I reminded her, I choose not to buy or cook them.<br/>\nShe looked out her windows and started a line of thought - &quot;I&#39;d like to<br/>\neat squirrels, and fish, and seagulls.  But I couldn&#39;t eat a cat,<br/>\nbecause cats are people&#39;s pets.  But tigers aren&#39;t people&#39;s pets, and I<br/>\ncould eat tigers.  And what about mice, mommy, do people eat mice?&quot;  Of<br/>\ncourse nobody will agree to kill and cook a squirrel or seagull for her,<br/>\nso I&#39;ve told her that when she&#39;s 10 (hunter safety age in Maine and New<br/>\nHampshire) she can ask her grandfather to teach her to hunt, and she can<br/>\nkill the animals and take the skin off and cook them if she wants to.<br/>\nSome days she&#39;s a vegetarian again, but when she decides to be an<br/>\nomnivore she looks forward to this.  So I went from being sad to being<br/>\nglad - she didn&#39;t share my value of not eating animals, but she shared<br/>\nthe larger, more important value of the equality of life. <br/>\n <br/>\nIncidentally (was it Sandra?) had mentioned we have to kill to eat.  Not<br/>\ntrue.  There are people who only eat food that does not require the<br/>\nkilling of a plant - for example, eating animal products that do not<br/>\nrequire killing of animals, eating vegetables and fruits that do not<br/>\nrequire death of a mother plant (eat a strawberry but not a potato;<br/>\nbroccoli but not a head of lettuce, etc.).  Not the lifestyle I lead,<br/>\nbut one that is possible.  <br/>\n <br/>\nKristi  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning toys","postDate":"1082164324","msgId":92696,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY3LjI2Yjk5NWUwLjJkYjFkZTY0QGFvbC5jb20+"},"prevInTopic":92691,"nextInTopic":92708,"prevInTime":92695,"nextInTime":92697,"topicId":92655,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/16/04 6:51:02 PM, mais1mae@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-863766525\">In a message dated 4/16/04 6:51:02 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mais1mae@...\">mais1mae@...</a> writes:<br/>\n<br/>\n&lt;&lt;  That&#39;s what the pro-toy-gun parents are doing,<br/>\n<br/>\nthey just don&#39;t get it that their ideas are not our<br/>\n<br/>\nown. ;) &gt;&gt;<br/>\n<br/>\nIt&#39;s not &quot;pro-toy-gun.&quot;<br/>\nIt&#39;s pro-respect-for-children.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Learning toys","postDate":"1082163339","msgId":92691,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1cHZhYis5ZmgxQGVHcm91cHMuY29tPg=="},"prevInTopic":92689,"nextInTopic":92696,"prevInTime":92690,"nextInTime":92692,"topicId":92655,"numMessagesInTopic":0,"msgSnippet":"That s what the pro-toy-gun parents are doing, they just don t get it that their ideas are not our own. ;) First of all, I m not pro-gun, I m pro-child. ","messageBody":"<div id=\"ygrps-yiv-888242300\">&quot;That&#39;s what the pro-toy-gun parents are doing,<br/>\nthey just don&#39;t get it that their ideas are not our<br/>\nown. ;)&quot;<br/>\n<br/>\nFirst of all, I&#39;m not pro-gun, I&#39;m pro-child.<br/>\n<br/>\nSecondly, I get it quite well that my ideas are not yours...thank <br/>\nGod.<br/>\n<br/>\nAnd thirdly, quit insulting the long time list members, it&#39;s getting <br/>\nold.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":116191878,"authorName":"Leonor Gomes","from":"=?iso-8859-1?q?Leonor=20Gomes?= &lt;mais1mae@...&gt;","profile":"mais1mae","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning toys","postDate":"1082162195","msgId":92689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNDE3MDAzNjM1LjI4MTcwLnFtYWlsQHdlYjk1MDIubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDAwMDUwMWM0MjNkZiQwZjA4Y2E1MCRhOGQ4MDVjZkBkYW4+"},"prevInTopic":92668,"nextInTopic":92691,"prevInTime":92688,"nextInTime":92690,"topicId":92655,"numMessagesInTopic":0,"msgSnippet":"Hi Kristy, I m enjoying your opinions and that you understood what I ve meant. Thank you. :) I think there might be a problem in pressuring children to get rid","messageBody":"<div id=\"ygrps-yiv-879277112\">Hi Kristy,<br/>\n<br/>\nI&#39;m enjoying your opinions and that you understood<br/>\nwhat I&#39;ve meant. Thank you. :)<br/>\n<br/>\nI think there might be a problem in pressuring<br/>\nchildren to get rid of their things. My mum did that a<br/>\nlot, and now I&#39;m sorry many of my books and toys are<br/>\ngone. They would have been wonderful to play with my<br/>\nchild now. I also feel a bit ressented she didn&#39;t get<br/>\nrid of one piece of her huge china collection, you<br/>\nknow what I mean?<br/>\n<br/>\nBut if you really have too much stuff lying around<br/>\nthat is a real problem. Maybe you can ask your<br/>\nchildren what are the toys they want to play with more<br/>\nnow, and box the others? Then ask a relative with more<br/>\nspace to keep them for you. You can always get them<br/>\nback later.<br/>\n<br/>\nGet rid of some of your things, as an example, it<br/>\nmight inspire selection of toys in your children. My<br/>\nchild always joins in my activities.<br/>\n<br/>\nI also wouldn&#39;t be shy to say to my family to stop<br/>\noffering so many toys. It&#39;s not an uncommon<br/>\ncharicature the poor bored child with thousands of<br/>\ntoys. Presents can be suffocating too.<br/>\n<br/>\nThen there&#39;s libraries that have toys. You can go<br/>\nthere, your children can play with them, and they stay<br/>\nthere.<br/>\n<br/>\nWhen my child really wants something, I usually buy<br/>\nfrom Ebay - always informing my child it&#39;s usedfor<br/>\nrespect - but this way of buying it goes more with my<br/>\necological ideas.<br/>\n<br/>\nWe can treat ourselves to the toys we like to play<br/>\nwith our children. I do that. I buy a nice wooden dice<br/>\ngame and we play it together. It&#39;s good to share our<br/>\nideas. That&#39;s what the pro-toy-gun parents are doing,<br/>\nthey just don&#39;t get it that their ideas are not our<br/>\nown. ;)<br/>\n<br/>\nJust my random thoughts, hope it helps.<br/>\n<br/>\nLeo<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n\t\t<br/>\n____________________________________________________________<br/>\nYahoo! Messenger - Communicate instantly...&quot;Ping&quot; <br/>\nyour friends today! Download Messenger Now <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://uk.messenger.yahoo.com/download/index.html\">http://uk.messenger.yahoo.com/download/index.html</a></div>","specialLinks":[]},{"userId":94040812,"authorName":"Lisa H","from":"&quot;Lisa H&quot; &lt;Lmanathome@...&gt;","profile":"lmanathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Learning toys","postDate":"1082159699","msgId":92668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtREFWNXpHWnVOWTFTV28wMDAxMTIzN0Bob3RtYWlsLmNvbT4=","referencesHeader":"PDAwMDUwMWM0MjNkZiQwZjA4Y2E1MCRhOGQ4MDVjZkBkYW4+"},"prevInTopic":92655,"nextInTopic":92689,"prevInTime":92667,"nextInTime":92669,"topicId":92655,"numMessagesInTopic":0,"msgSnippet":"Hi Kristi, Since your question is about a space issue and you are considering removing some toys that are not used - i would reply to this by asking you what","messageBody":"<div id=\"ygrps-yiv-1556468140\">Hi Kristi,<br/>\nSince your question is about a space issue and you are considering removing some toys that are not used - i would reply to this by asking you what your kids think and want.  In a similar situation, I&#39;ve talked to my girls about my concerns and considerations and together we&#39;ve come up with solutions that work for all.  (Actually - they almost always come up with great solutions - better than i left to my own devices)<br/>\n<br/>\nLisa H.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Kristi Hayes <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Friday, April 16, 2004 2:17 PM<br/>\n  Subject: [UnschoolingDiscussion] Learning toys<br/>\n<br/>\n<br/>\n  Assomeone pointed out, I put the &quot;learning&quot; in &quot;learning toys&quot; in<br/>\n  quotes.  My daughter taught her how to subtract while eating a bowl of<br/>\n  cereal.  I certainly don&#39;t feel anything more than a welcoming<br/>\n  environment is necessary for learning.  I was just wondering the<br/>\n  thoughts of others on the importance of &quot;learning&quot; toys such as pattern<br/>\n  blocks, tinkertoys, the gear toy, etc.  Aside from super-frugal we also<br/>\n  have small space.  Right now it&#39;s pretty full.  I&#39;m wondering if I<br/>\n  should get rid of some of the stuff, such as the VTech, and get<br/>\n  something else, such as tinkertoys, to get more bang per square foot.<br/>\n  Or if, on the other hand, it really matters all that much.  Because part<br/>\n  of my question involves how strongly I should try to influence the gifts<br/>\n  they get from mom and MIL, who, in spite of my protests, keep buying<br/>\n  Orion stuffed Elmos and Morgaine more and more Barbie stuff.  They like<br/>\n  these, but it takes up space.  If I decide (and I&#39;ve been pondering a<br/>\n  while) to put my foot down on variety, I&#39;ll have to be stronger.  For<br/>\n  example, at Christmas I told them in no uncertain terms if they bought<br/>\n  her more Barbie dolls then I&#39;d get rid of some of the worn ones she<br/>\n  already has.  This was a space issue.  She already has 15 or more<br/>\n  barbies and at least as many Kelly&#39;s.  They were pretty ticked off but<br/>\n  the threat of my getting rid of the other ones deterred them.  I hate to<br/>\n  impose such limits on them, and it makes them really angry.  But I am<br/>\n  wondering if I should fill my kids stuff with different sorts of toys?<br/>\n<br/>\n  That really was the reasoning behind my questions.  Strewing is great,<br/>\n  but you need space in which to do it.  Is it worth getting rid of stuff<br/>\n  they have and play with occasionally for stuff they haven&#39;t asked for<br/>\n  and may or may not play with?  I don&#39;t have much storage space for<br/>\n  rotating large groups of toys; we live in a trailer.  <br/>\n<br/>\n  Anyway, now that I&#39;ve clarified the question does anyone have any more<br/>\n  thoughts on this?  Thanks . <br/>\n  &#39;<br/>\n  Kristi<br/>\n<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":142002410,"authorName":"Kristi Hayes","from":"&quot;Kristi Hayes&quot; &lt;hayes@...&gt;","profile":"morgainesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Learning toys","postDate":"1082139435","msgId":92655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDUwMWM0MjNkZiQwZjA4Y2E1MCRhOGQ4MDVjZkBkYW4+"},"prevInTopic":0,"nextInTopic":92668,"prevInTime":92654,"nextInTime":92656,"topicId":92655,"numMessagesInTopic":0,"msgSnippet":"Assomeone pointed out, I put the learning in learning toys in quotes.  My daughter taught her how to subtract while eating a bowl of cereal.  I certainly","messageBody":"<div id=\"ygrps-yiv-1621737856\">Assomeone pointed out, I put the &quot;learning&quot; in &quot;learning toys&quot; in<br/>\nquotes.  My daughter taught her how to subtract while eating a bowl of<br/>\ncereal.  I certainly don&#39;t feel anything more than a welcoming<br/>\nenvironment is necessary for learning.  I was just wondering the<br/>\nthoughts of others on the importance of &quot;learning&quot; toys such as pattern<br/>\nblocks, tinkertoys, the gear toy, etc.  Aside from super-frugal we also<br/>\nhave small space.  Right now it&#39;s pretty full.  I&#39;m wondering if I<br/>\nshould get rid of some of the stuff, such as the VTech, and get<br/>\nsomething else, such as tinkertoys, to get more bang per square foot.<br/>\nOr if, on the other hand, it really matters all that much.  Because part<br/>\nof my question involves how strongly I should try to influence the gifts<br/>\nthey get from mom and MIL, who, in spite of my protests, keep buying<br/>\nOrion stuffed Elmos and Morgaine more and more Barbie stuff.  They like<br/>\nthese, but it takes up space.  If I decide (and I&#39;ve been pondering a<br/>\nwhile) to put my foot down on variety, I&#39;ll have to be stronger.  For<br/>\nexample, at Christmas I told them in no uncertain terms if they bought<br/>\nher more Barbie dolls then I&#39;d get rid of some of the worn ones she<br/>\nalready has.  This was a space issue.  She already has 15 or more<br/>\nbarbies and at least as many Kelly&#39;s.  They were pretty ticked off but<br/>\nthe threat of my getting rid of the other ones deterred them.  I hate to<br/>\nimpose such limits on them, and it makes them really angry.  But I am<br/>\nwondering if I should fill my kids stuff with different sorts of toys?<br/>\n <br/>\nThat really was the reasoning behind my questions.  Strewing is great,<br/>\nbut you need space in which to do it.  Is it worth getting rid of stuff<br/>\nthey have and play with occasionally for stuff they haven&#39;t asked for<br/>\nand may or may not play with?  I don&#39;t have much storage space for<br/>\nrotating large groups of toys; we live in a trailer.  <br/>\n <br/>\nAnyway, now that I&#39;ve clarified the question does anyone have any more<br/>\nthoughts on this?  Thanks . <br/>\n&#39;<br/>\nKristi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":92756,"nextTopicId":92758}}