{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"HEM","from":"HEM &lt;HEM-Editor@...&gt;","replyTo":"LIST","senderId":"aHXzt3l8B_LstVknwuRmYMubaLU6qe8AnvKt_EeTzcIBQTHIH1x2BmboT7USGRjn0GQ1be2cLJdtO9YJBBUSUgDdf3_ZKkl4E-ZMwQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Special Overview: Military Survey Fact Sheet","postDate":"947975660","msgId":5622,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zNzEuNTYyMi45NTkyNjk3NDVAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":5621,"nextInTime":5623,"topicId":5622,"numMessagesInTopic":0,"msgSnippet":"Special Overview from Home Education Magazine - January 15th, 2000 Military Survey Fact Sheet Problems raised by the recent survey on military recruitment of ","messageBody":"<div id=\"ygrps-yiv-789618412\">Special Overview from<br/>\nHome Education Magazine - January 15th, 2000<br/>\n<br/>\nMilitary Survey Fact Sheet<br/>\n<br/>\nProblems raised by the recent survey on military recruitment of<br/>\nhomeschoolers that was sent to many homeschooling organizations will be<br/>\naddressed in Larry and Susan Kaseman&#39;s next &quot;Taking Charge&quot; column in the<br/>\nMarch/April issue of Home Education Magazine. However, because you may need<br/>\ninformation on this topic now, they have written this overview we are<br/>\ndistributing.<br/>\n<br/>\nSummary: Many homeschooling support groups and organizations have recently<br/>\nbeen sent a survey designed to help the military recruit homeschoolers.<br/>\nThis survey could cause serious problems for homeschoolers and undermine<br/>\nour homeschooling freedoms, as explained below. If you receive a survey<br/>\nform, please read the following information before deciding whether to<br/>\nsubmit it. Also, share this information with other homeschoolers.<br/>\n<br/>\nBackground: A recent law establishes a five-year pilot program during which<br/>\nthe military will treat homeschoolers the same way they treat graduates of<br/>\nconventional high schools if the homeschoolers have a diploma from their<br/>\nhomeschool or another institution and &quot;a transcript demonstrating<br/>\ncompletion of high school.&quot;<br/>\n<br/>\nThe survey is supposedly intended to help the military (1) &quot;reach out to&quot;<br/>\nand recruit homeschoolers and (2) &quot;identify genuine home school graduates.&quot;<br/>\nEach of these causes problems.<br/>\n<br/>\n(1) Problems Created by Homeschoolers Helping the Military Recruit<br/>\nHomeschoolers<br/>\n<br/>\n* To help the military recruit homeschoolers, the survey asks homeschool<br/>\norganizations to provide specific information about their newsletters,<br/>\nconventions, radio programs, and web pages. Since the data from this survey<br/>\nbelong to the federal government, the survey will enable the government to<br/>\nbegin developing a more extensive data base about the homeschooling<br/>\nmovement than currently exists anywhere. Do we want the government to have<br/>\nthis kind of information?<br/>\n<br/>\n* Under the Freedom of Information Act, the survey results may be available<br/>\nto anyone who wants them. People targeting the homeschooling market would<br/>\ncertainly be interested.<br/>\n<br/>\n* Should homeschooling support groups and organizations help the military<br/>\nor anyone else target or market to homeschoolers?<br/>\n<br/>\n* Information about enlisting in the military is already widely available.<br/>\nHomeschoolers do not need more recruiting directed at us.<br/>\n<br/>\n(2) Problems Created by Homeschoolers Helping the Military Define<br/>\nHomeschooling and Identify &quot;Genuine&quot; Homeschool Graduates<br/>\n<br/>\n* If the government defines homeschooling, it will have much greater<br/>\ncontrol over homeschoolers, because we will be expected to live by whatever<br/>\ndefinition the government chooses.<br/>\n<br/>\n* Question 9 on the survey says, &quot;To help military recruiters define home<br/>\nschooling, check the statements that apply to home schooling.&quot; People who<br/>\ncomplete the survey are indicating that they agree that the military should<br/>\ndefine homeschooling. If homeschoolers participate in the survey, the<br/>\ngovernment will be able to claim that homeschoolers voluntarily<br/>\nparticipated in the development of the definition and therefore have<br/>\nimplicitly agreed to it.<br/>\n<br/>\n* At present, education (including homeschooling) is covered by state laws,<br/>\nregulations, and definitions. A definition of homeschooling by the federal<br/>\ngovernment would be much more rigid, harder to change, and might over time<br/>\nbecome the definition that states use, especially since it would<br/>\nundoubtedly mean greater regulation in many states.<br/>\n<br/>\nPoints to Remember<br/>\n<br/>\n* This survey is unnecessary. Part (1) above is unnecessary because the<br/>\nmilitary can reach homeschoolers through the recruiting campaigns it is<br/>\nalready conducting via television advertising, etc., and homeschoolers are<br/>\nenlisting. In addition, the military does not need a formal definition of<br/>\nhomeschooling. Employers are hiring homeschoolers, colleges and<br/>\nuniversities are accepting them, the federal government is giving them<br/>\nstudent loans, all without formal definitions. The military can recruit and<br/>\nenlist homeschoolers in ways that are similar to the ones used by others<br/>\nand spare homeschoolers the problems caused by having a government agency<br/>\ncreate a formal definition of homeschooling.<br/>\n<br/>\n* The survey is misdirected. Very few people will try to falsely claim that<br/>\nthey are homeschool graduates when they actually are high school drop-outs<br/>\nwho lack the background and skills necessary to serve in the military. The<br/>\nnumber of problems that might be prevented by having a formal way in which<br/>\nthe military can identify &quot;genuine homeschool graduates&quot; is infinitesimal<br/>\ncompared to the number of homeschoolers who will lose substantial<br/>\nhomeschooling freedoms through such a definition. Put another way, &quot;hard<br/>\ncases make bad law.&quot; That is, a law designed to take care of the worst<br/>\npossible hypothetical case is almost certain to be long, difficult to<br/>\nenforce, and more likely to prevent good people from doing good than bad<br/>\npeople from doing bad.<br/>\n<br/>\n* To maintain our homeschooling freedoms, we need to minimize the<br/>\nopportunities that the government has to define and in this way control<br/>\nhomeschooling.<br/>\n<br/>\n* The number of people currently enlisting in the military is decreasing.<br/>\nProposals have been made that the military lower its standards to increase<br/>\nenlistments. Therefore, it seems likely that this attempt to identify<br/>\n&quot;genuine home school graduates&quot; is simply the latest example of the general<br/>\nnotion that homeschools need to be regulated more strongly than they are<br/>\ncurrently being. As homeschoolers who want to maintain our homeschooling<br/>\nfreedoms, we need to counter this attempt as we have countered previous<br/>\nones.<br/>\n<br/>\n[end]<br/>\n<br/>\nFor an online version of this overview:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/wnw/mlsurvey.html\">http://www.home-ed-magazine.com/wnw/mlsurvey.html</a><br/>\n<br/>\nFor a PDF version of this overview:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/wnw/mlsurvey.pdf\">http://www.home-ed-magazine.com/wnw/mlsurvey.pdf</a><br/>\n<br/>\nHome Education Magazine<br/>\nPO Box 1083, Tonasket, WA 98855<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM@...\">HEM@...</a></div>","specialLinks":[]}],"prevTopicId":5620,"nextTopicId":5623}}