{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Beth  Oberle","from":"&quot;Beth  Oberle&quot; &lt;baosjo@...","replyTo":"LIST","senderId":"6eVVTdehBNRNDgTJTJ0IbM6Fwlys-F9Acf63839AFe9QTL8gK5n_DzKLiOiCt3ppD_mbaX98ZaaqV59Nbe9_MkM5r1Fu8mc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"","postDate":"934765798","msgId":2076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4xNTUuMjA3Ni45NTkyNjk3NDFAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2075,"nextInTime":2077,"topicId":2076,"numMessagesInTopic":0,"msgSnippet":"This message is in response not just to this one, but to the others who posted about handwriting or good (I would say standard ) grammar being important.","messageBody":"<div id=\"ygrps-yiv-1097918179\">This message is in response not just to this one, but to the others who<br/>\nposted about handwriting or &quot;good&quot; (I would say &quot;standard&quot;) grammar being<br/>\n&quot;important.&quot;  I think it&#39;s fine for all of us to discuss our pet peeves but<br/>\nthere&#39;s a world of difference between acknowledging that something bugs us<br/>\nand between saying it&#39;s &quot;important&quot; to know it.<br/>\n<br/>\nMy understanding of unschooling is that it&#39;s up to the person who is<br/>\nlearning<br/>\nto determine what is important, not anyone else.  You may find a closer,<br/>\nmore<br/>\nspiritual connection to words through handwriting, but I may not.<br/>\nTherefore,<br/>\nit is not important for me to learn beautiful handwriting.  The same is true<br/>\nof spelling or grammar.<br/>\n<br/>\nVery good points and I appreciate the difference in viewpoint.  I always<br/>\nfind it interesting and insightful to hear others points of view.  As usual,<br/>\nI usually find that what I find to be &quot;important&quot; and meaningful is held in<br/>\na totally different light to someone else.  As unschooling is very new to me<br/>\nand I know a lot (I feel) about the theory of unschooling but not<br/>\nnecessarily the practice of it I&#39;m very interested in discussing and<br/>\nlearning more about both.  The only experience in practice I have is very<br/>\nlimited to our family which includes myself, my husband and our daughters,<br/>\nages 6 and 2.  I know that which I find important and meaningful isn&#39;t<br/>\nalways important and meaningful to my husband and daughters.  It would<br/>\ndefinitely be a boring world if we all were &quot;good&quot; in the same things and<br/>\nfound meaning and importance in the same things.  That is why some of us are<br/>\nartist, mathematicians, musicians, accountants, engineers, carpenters, etc.<br/>\netc.  ......<br/>\n<br/>\nThis message is in response not just to this one, but to the others who<br/>\nposted about handwriting or &quot;good&quot; (I would say &quot;standard&quot;) grammar being<br/>\n&quot;important.&quot;  I think it&#39;s fine for all of us to discuss our pet peeves but<br/>\nthere&#39;s a world of difference between acknowledging that something bugs us<br/>\nand between saying it&#39;s &quot;important&quot; to know it.<br/>\n<br/>\nMy understanding of unschooling is that it&#39;s up to the person who is<br/>\nlearning<br/>\nto determine what is important, not anyone else.  You may find a closer,<br/>\nmore<br/>\nspiritual connection to words through handwriting, but I may not.<br/>\nTherefore,<br/>\nit is not important for me to learn beautiful handwriting.  The same is true<br/>\nof spelling or grammar.<br/>\n<br/>\nEven better, &quot;deep thought&quot;,  I don&#39;t think I have an answer today.....It is<br/>\ntrue that any academic thought or fact will be learned when needed and not<br/>\nbefore.  As an example, I recently had need of the formula for figuring the<br/>\ndiameter of a circle using the circumference as the only &quot;known&quot; fact.  I<br/>\nknow I &quot;learned&quot; this formula in 9th grade algebra but didn&#39;t &quot;know&quot; it<br/>\nuntil I needed it......<br/>\n<br/>\nInteresting.  I find that a computer makes it much easier for me to<br/>\norganize my thoughts and get them written down.  I often have several<br/>\ndifferent ideas at once, and I can just quickly make notes, and then refer<br/>\nto them as I go.  I wouldn&#39;t do that in a handwritten journal.<br/>\n<br/>\nMy experience is much the same and the pen and paper help to slow me down<br/>\nand gather my thoughts....to each his own!  My schooling makes me think that<br/>\nwhen I&#39;m typing I must have it all together first!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  He points out that there is no<br/>\n&gt; &quot;grammar and usage check&quot; on computers<br/>\n<br/>\n </span></blockquote>Yes there is.  At least I have one.  I don&#39;t always agree with it, but it&#39;s<br/>\ninteresting.<br/>\n<br/>\nI have recently found that he (my husband) also has one on his computer but<br/>\nalso doesn&#39;t usually agree with it!!!LOL<br/>\n<br/>\n<br/>\nI think you make a very good argument that really fine penmanship is more of<br/>\nan art than a skill.  I can practice and get to be a better typist -- get<br/>\nfaster and more accurate and get better at this skill.  I could practice<br/>\nuntil forever and my penmanship would not improve.  Nor do I need or want it<br/>\nto.  I think it would be neat to teach kids about how pretty and fun some<br/>\npenmanship can be but to require good artistic talent seems cruel to me --<br/>\nI&#39;m no artist -- my daughter is very talented (I think) -- but I hope noone<br/>\never makes my kids feel bad that they aren&#39;t talented this way.<br/>\n<br/>\nAgain, good points.  As this ability and talent comes naturally for me and<br/>\nmy oldest daughter I tend to think it should be easy and natural for<br/>\neveryone, given practice.  On the other hand my husband and most of his<br/>\nimmediate family aren&#39;t talented in this manner and they are still very<br/>\ntalented and intelligent people so I should know better than to judge.<br/>\n<br/>\nWell, I still have another digest to digest so I&#39;d better save some<br/>\ncomments!LOL<br/>\n<br/>\nBeth</div>","specialLinks":[]}],"prevTopicId":2074,"nextTopicId":2047}}