{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Yes... what is a road grader/providing for interests","postDate":"1108837853","msgId":103687,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGREZGN0ZBLjJFREQwRTkzLjBDOEQ0NUE4QGFvbC5jb20+"},"prevInTopic":103680,"nextInTopic":0,"prevInTime":103686,"nextInTime":103688,"topicId":103680,"numMessagesInTopic":0,"msgSnippet":"-=-how does one tell when your child really has an interest that will last more than a few weeks... or when they have a more intense interest that will last","messageBody":"<div id=\"ygrps-yiv-562994795\">-=-how does one tell when your <br/>\nchild really has an interest that will last more than a few weeks... or when they have a more intense interest that will last longer... -=-<br/>\n<br/>\nIt doesn&#39;t make any difference, at the beginning.<br/>\n<br/>\nIf a child expresses interest in having an aquarium at home, you don&#39;t have to go and spend $3000 and find out he wasn&#39;t all that interested.  Find him a book on fish, and talk about the difference between fresh water and salt water aquariums.  Visit pet shops and look at theirs.  Browse the aisles of fun stuff to stick in there.  Maybe visit friends who have one, or an office or restaurant or other public building with an aquarium.  Talk to the person who takes care of it.  Get a beta fish or a gold fish that doesn&#39;t need special equipment.<br/>\n<br/>\nDo one thing.  Does he want more?  Do one more thing.  Has his interest waned?  That doesn&#39;t mean it&#39;s gone forever.  <br/>\n<br/>\n-=-Should all things be made available to <br/>\na child, even ones that are passing fancies? How can you tell? <br/>\n-=-<br/>\n<br/>\n&quot;Things&quot; or information and encouragment?<br/>\nI can&#39;t make all THINGS available to my child, but I&#39;m willing to discuss or research or find exposure (drive him somewhere, find a person who can do the thing he wants, go to a museum, find a sample, a book, a model...).<br/>\n<br/>\nIf a child asks about clockmaking, you don&#39;t have to ship him to Switzerland and pay a clockmaker to show him something.  Get a book, go on a website, find a clock model (there are some plastic models of historical kinds of clocks that nearly work, kind of &lt;g&gt;).  Take an broken old watch or clock apart, and look at the parts with a magnifying glass.  Go to a clockshop and ask if they&#39;ll show you the oldest clock they have.  They probably have books right behind the counter they would let you look through.<br/>\n<br/>\n-=-My son gets intense interests... hugely intense. We have limited funds... if I spent money on ever single interest that came up, we&#39;d be penniless. -=-<br/>\n<br/>\nYou don&#39;t have to spend money to find information.<br/>\n<br/>\n<br/>\nAs to what a road grader is, it always surprises me when someone asks questions like that on the list instead of opening up a web window, going to google and looking.  I should get over being surprised, I guess, but if I were in a public meeting and didn&#39;t understand what someone was talking about, I wouldn&#39;t take the mike and ask.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":199737775,"authorName":"bookwood01","from":"&quot;bookwood01&quot; &lt;bookwood01@...&gt;","profile":"bookwood01","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Yes... what is a road grader/providing for interests","postDate":"1108834227","msgId":103680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN2N3Qzais2ZDltQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":103687,"prevInTime":103679,"nextInTime":103681,"topicId":103680,"numMessagesInTopic":0,"msgSnippet":"And I think the (below) posted is a great point. And I think it s important to be able to provide those things for your child to be able to use and learn if","messageBody":"<div id=\"ygrps-yiv-1773341665\">And I think the (below) posted is a great point. And I think it&#39;s <br/>\nimportant to be able to provide those things for your child to be <br/>\nable to use and learn if the child is interested in it. It often <br/>\ndoes come down to money, though. Doesn&#39;t it? That&#39;s why I was <br/>\nthrilled that the video game design course wasn&#39;t hugely expensive <br/>\nor I would never have been able to do that for my son. His heart was <br/>\nset on it. It worked out. It doesn&#39;t always. Like, once he wanted to <br/>\nhave a four wheeler. Well, there is no way I could afford that. No <br/>\nway. Plus, he was five at the time and wasn&#39;t coordinated all that <br/>\nwell either. He was in physical therapy. He also wouldn&#39;t have been <br/>\nable to fit on one comfortably and safely. So... even if it weren&#39;t <br/>\nfor the money issues, I would have had to tell him he&#39;d have to wait <br/>\ntill he was older and had a little more length and weight on him. LOL<br/>\n(He was a skinny little thing... now he&#39;s so big I can&#39;t believe <br/>\nit!) Within a few months he totally could have cared less about four <br/>\nwheelers and hasn&#39;t cared about them since. Even though he&#39;s got two <br/>\nbuddies with them, he could care less. He wants to do other things <br/>\n(they&#39;re too loud for him now, he says.) He&#39;d rather bike ride. <br/>\n<br/>\nSo... that leads to another question... how does one tell when your <br/>\nchild really has an interest that will last more than a few weeks... <br/>\nor when they have a more intense interest that will last longer... <br/>\nand even so, does it matter? Should all things be made available to <br/>\na child, even ones that are passing fancies? How can you tell? <br/>\n<br/>\nMy son gets intense interests... hugely intense. We have limited <br/>\nfunds... if I spent money on ever single interest that came up, we&#39;d <br/>\nbe penniless. It comes down to really being able to help your child <br/>\nchoose which ones are important to them by putting the facts (the <br/>\nones you and the child are aware of ) into plain view so your child <br/>\ncan make an educated choice. <br/>\n<br/>\nSusan and I don&#39;t know what a road grader is either. <br/>\n<br/>\nIf your<br/>\nchild wants a road grader (i dont even know what that is!), and<br/>\nthere are valid reasons to not run out and get him one (and if i<br/>\nknew what it was i could probably list some....not enough space?<br/>\ntheyre expensive??), i would expect as an unschooling parent you<br/>\nwould try to satisfy the need in other ways.</div>","specialLinks":[]}],"prevTopicId":103674,"nextTopicId":103690}}