{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":284278731,"authorName":"susanleeb52","from":"&quot;susanleeb52&quot; &lt;jgsbmg@...&gt;","profile":"susanleeb52","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: telling time","postDate":"1212264905","msgId":35152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcxc2JrOSsxNGtqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcxb3Vxais2MDY1QGVHcm91cHMuY29tPg=="},"prevInTopic":35134,"nextInTopic":0,"prevInTime":35151,"nextInTime":35153,"topicId":35134,"numMessagesInTopic":0,"msgSnippet":"I just found a book at the library book sale called It s About Time. It s by Marilyn Burns, from the Brown Paper School series.  It is copyright 1978 (which","messageBody":"<div id=\"ygrps-yiv-1997426716\">I just found a book at the library book sale called &quot;It&#39;s About Time.&quot;  <br/>\nIt&#39;s by Marilyn Burns, from the Brown Paper School series.  It is <br/>\ncopyright 1978 (which was a good year, for some of us), but still has <br/>\nlots of useful information about time that I imagine is, ahem, timeless-<br/>\n-history of time and time zones, circadian rhythms in people and <br/>\nanimals, stuff like that.  I notice that copies are available on Amazon <br/>\nstarting at 26 cents.</div>","specialLinks":[]},{"userId":271637621,"authorName":"melissa_hice","from":"&quot;melissa_hice&quot; &lt;mhice@...&gt;","profile":"melissa_hice","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"telling time","postDate":"1212153491","msgId":35134,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcxb3Vxais2MDY1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":35152,"prevInTime":35133,"nextInTime":35135,"topicId":35134,"numMessagesInTopic":0,"msgSnippet":"My daugher(9) has always been interested in clocks.  She taught herself to tell time at the age of 6 1/2 by staring at the analog clock for long periods of","messageBody":"<div id=\"ygrps-yiv-1418357607\">My daugher(9) has always been interested in clocks.  She taught herself <br/>\nto tell time at the age of 6 1/2 by staring at the analog clock for <br/>\nlong periods of time, looking at the analog clock and then looking at <br/>\nthe digital clock on the microwave, and by asking me what time it is (a <br/>\nlot!).  One day she came up to me and said, &quot;Mommy, I can tell time.&quot;  <br/>\nAt first I didn&#39;t believe it because I had never &quot;taught&quot; her much <br/>\nabout the clock (pre unschooling days).  She told me the time on the <br/>\nclock and she was correct.  She&#39;s been able to tell time to the minute <br/>\nsince then.<br/>\n<br/>\nThis morning the clock on my nightstand said 7:00 a.m.  My daughter cme <br/>\nin to wake me because she was concerned because Curious George was not <br/>\non and it ALWAYS comes on at 7:00 a.m.  I said, &quot;Maybe my clock is <br/>\nwrong.&quot;  She checked the clock on the vcr and it was 4 minutes behind <br/>\nmy clock.  She was confused as to why the clocks were different.  She <br/>\nsaid that maybe the clock on the vcr was wrong and that Curious George <br/>\nwas just not going to come on anymore.  We had a discussion about how <br/>\nclocks can be wrong (human error, malfunctions, etc.).  I told her that <br/>\nthe clock on the vcr was probably more accurate than my alarm clock <br/>\nbecause it receives a signal and sets the time automatically.<br/>\n<br/>\nThat lead to her wondering how people know what time it is in the first <br/>\nplace -- how they know what time to set their clocks to.  I got online <br/>\nand found a coule of sites for kids that talk about the history of <br/>\nclocks (obelisks, sundials, waterclocks, etc.)  She looked at some of <br/>\nthe animated clocks on the computer and said she wanted a sundial <br/>\n(she&#39;s made this request before).  She got curious about the Obelisk <br/>\nand wondered how people could tell time if it was so high up in the <br/>\nair.  I told her we could make a sort of obelisk by using a stick or <br/>\nsomething and marking the time with chalk on our sidewalk.  I noticed <br/>\nthe paper towel holder which is on a stand so I grabbed that and we <br/>\nheaded outside.  She is excited about marking the time each hour.<br/>\n<br/>\nThe problem is that she wants to know more about how we know nowadays <br/>\nhow to set our clock.  I googled Greenwich but I just couldn&#39;t come up <br/>\nwith anything that would show pictures (we found pictures of the <br/>\noutside of The Royal Observatory in Greenwich, London but no pictures <br/>\nof the inside or anything to do with any kind of Main Clock or <br/>\nsomething that everyone sets their clocks and watches to) or <br/>\ninformation that would be good for a kid.  <br/>\n<br/>\nThis is, of course, leading to the Prime Meridian and I&#39;m not sure how <br/>\nto go about helping her understand this.  Help!  I checked our library <br/>\nwebsite and couldn&#39;t find any books or videos on this subject.  Does <br/>\nanyone have any links or ideas to help me help my daugher?<br/>\n<br/>\nMelissa</div>","specialLinks":[]}],"prevTopicId":35126,"nextTopicId":35143}}