{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Aaaaarrrrggghhhh!","postDate":"1062709300","msgId":79901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyNzgwMWMzNzMyOCQwMDI5NTI2MCQwOTAwYThjMEB3ZXN0Pg==","referencesHeader":"PDIwMDMwOTA0LjA3Mzc1Ni4yNzMxMy4yNjk3MjRAd2VibWFpbDA2Lm55Yy51bnRkLmNvbT4="},"prevInTopic":79879,"nextInTopic":0,"prevInTime":79900,"nextInTime":79902,"topicId":79876,"numMessagesInTopic":0,"msgSnippet":"... finally realizing just how VERY different his lifestyle is from all his friends. Maybe his desire to fit in (a normal thing) is just stronger right now?","messageBody":"<div id=\"ygrps-yiv-541819914\"><blockquote><span title=\"ireply\">&gt; Ok, so maybe he&#39;s going throught this transition into adulthood and<br/>\n </span></blockquote>finally realizing just how VERY different his lifestyle is from all his<br/>\nfriends. Maybe his desire to fit in (a normal thing) is just stronger right<br/>\nnow? Too bad you don&#39;t have some COOL unschoolers to hang with!<br/>\n<br/>\nI *wish*!  There aren&#39;t any close by, and he just never hit it off with the<br/>\nones in town.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; But what about buying the Peter Kowalke documentary on grown unschoolers?<br/>\n </span></blockquote>Maybe finding some stories of cool grown unschoolers would help him see the<br/>\npossibilities and help him feel not so unusual.<br/>\n<br/>\nHave you seen it?  Would a kid who doesn&#39;t want to be &quot;different&quot; think that<br/>\nthe people in the documentary were cool?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Another thing I did with the kids last year (and I want to do it with them<br/>\n </span></blockquote>again) is BHAG&#39;S. Big Hairy Audacious Goals. Someone wrote about it in HEM I<br/>\nbelieve (sorry for not remembering the name) and I thought it was really<br/>\ncool. We&#39;d always written down ideas and goals, but I loved the NAME! So we<br/>\nsat down and said what we&#39;d really, really like to do if there were not<br/>\nlimits in our lives. Some were reasonable, some were outrageous, but it gave<br/>\nus a way to focus on that person&#39;s dreams and needs.<br/>\n<blockquote><span title=\"ireply\"> &gt; We had things like a trip to Disneyworld, building a robot, learning<br/>\n </span></blockquote>guitar (he DID!) and such. Some of them we accomplished, others are still<br/>\npending and yet others have become non-important in that time.<br/>\n<blockquote><span title=\"ireply\"> &gt; So maybe instead of giving into his schoolish desires (which it sounds<br/>\n </span></blockquote>like he&#39;s not really all that into) ask him for his BHAG&#39;S and share yours<br/>\nwith him. If you can get him thinking of the coolest, most awesome stuff he<br/>\nwants to do in life, maybe it will give new direction to your days and be<br/>\nfodder for some interesting conversations.<br/>\n<br/>\nI think we&#39;ll try that.  I did take my daughter&#39;s suggestion and make him up<br/>\na &quot;worksheet&quot;.  It basically asked him about subjects he was interested in,<br/>\nsince that&#39;s what he&#39;s talking about wanting, and it gave me a clearer idea<br/>\nas to where he feels he doesn&#39;t &quot;measure up&quot;.  I&#39;m going to give him some<br/>\n&quot;assignments&quot; over the next little while, since he&#39;s asking for them, but<br/>\nI&#39;m not going to hold him to doing them.  But the BHAG sounds like a good<br/>\nidea for both of us.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe....<br/>\n&gt; I hope something helps. It sounds like he&#39;s struggling within himself and<br/>\n </span></blockquote>you may just have to ride it out. Make him all his favorite foods, I&#39;ve<br/>\nfound that making delicious meals brings out the best in my kids!!<br/>\n<br/>\nSomething like the way his girlfriend keeps baking pies and brownies for<br/>\nhim?  &lt;g&gt;<br/>\nTia<br/>\n<br/>\n&quot;They that can give up essential liberty to obtain a little temporary safety<br/>\ndeserve neither liberty nor safety.&quot;  Ben Franklin<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a></div>","specialLinks":[]},{"userId":77522235,"authorName":"Julie Bogart","from":"&quot;Julie Bogart&quot; &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Aaaaarrrrggghhhh!","postDate":"1062686765","msgId":79879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJqN2o3ZCs0NmxzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMwOTA0LjA3Mzc1Ni4yNzMxMy4yNjk3MjRAd2VibWFpbDA2Lm55Yy51bnRkLmNvbT4="},"prevInTopic":79876,"nextInTopic":79901,"prevInTime":79878,"nextInTime":79880,"topicId":79876,"numMessagesInTopic":0,"msgSnippet":"... with them again) is BHAG S. Big Hairy Audacious Goals. Someone wrote about it in HEM I believe (sorry for not remembering the name) and I thought it was","messageBody":"<div id=\"ygrps-yiv-1516009215\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Ren <br/>\n&lt;starsuncloud@n...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Another thing I did with the kids last year (and I want to do it <br/>\n </span></blockquote>with them again) is BHAG&#39;S. Big Hairy Audacious Goals. <br/>\nSomeone wrote about it in HEM I believe (sorry for not <br/>\nremembering the name) and I thought it was really cool. We&#39;d <br/>\nalways written down ideas and goals, but I loved the NAME! <br/>\n<br/>\nROFL! That was me! I wrote that article. :) Thanks. It&#39;s had lots of <br/>\nrequests for reprints so I think it was a fairly popular concept.<br/>\n<br/>\nJulie B(ogart)</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Aaaaarrrrggghhhh!","postDate":"1062686261","msgId":79876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwOTA0LjA3Mzc1Ni4yNzMxMy4yNjk3MjRAd2VibWFpbDA2Lm55Yy51bnRkLmNvbT4="},"prevInTopic":0,"nextInTopic":79879,"prevInTime":79875,"nextInTime":79877,"topicId":79876,"numMessagesInTopic":0,"msgSnippet":"No, actually he s never been in school, though all his friends are. Sorry..it s hard to remember all the details!:) Ok, so maybe he s going throught this","messageBody":"<div id=\"ygrps-yiv-384170345\">&quot;No, actually he&#39;s never been in school, though all his friends are.&quot;<br/>\n<br/>\nSorry..it&#39;s hard to remember all the details!:)<br/>\nOk, so maybe he&#39;s going throught this transition into adulthood and finally realizing just how VERY different his lifestyle is from all his friends. Maybe his desire to fit in (a normal thing) is just stronger right now? Too bad you don&#39;t have some COOL unschoolers to hang with!<br/>\n<br/>\nBut what about buying the Peter Kowalke documentary on grown unschoolers? Maybe finding some stories of cool grown unschoolers would help him see the possibilities and help him feel not so unusual.<br/>\n<br/>\nAnother thing I did with the kids last year (and I want to do it with them again) is BHAG&#39;S. Big Hairy Audacious Goals. Someone wrote about it in HEM I believe (sorry for not remembering the name) and I thought it was really cool. We&#39;d always written down ideas and goals, but I loved the NAME! So we sat down and said what we&#39;d really, really like to do if there were not limits in our lives. Some were reasonable, some were outrageous, but it gave us a way to focus on that person&#39;s dreams and needs.<br/>\nWe had things like a trip to Disneyworld, building a robot, learning guitar (he DID!) and such. Some of them we accomplished, others are still pending and yet others have become non-important in that time.<br/>\nSo maybe instead of giving into his schoolish desires (which it sounds like he&#39;s not really all that into) ask him for his BHAG&#39;S and share yours with him. If you can get him thinking of the coolest, most awesome stuff he wants to do in life, maybe it will give new direction to your days and be fodder for some interesting conversations.<br/>\nMaybe....<br/>\nI hope something helps. It sounds like he&#39;s struggling within himself and you may just have to ride it out. Make him all his favorite foods, I&#39;ve found that making delicious meals brings out the best in my kids!!<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":79823,"nextTopicId":79902}}