{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":361639019,"authorName":"joanne.lopers","from":"&quot;joanne.lopers&quot; &lt;wilmalv@...&gt;","profile":"joanne.lopers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Was business idea for older mama/ Community Support","postDate":"1355414953","msgId":69809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthY3VqOStmc2QxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":69808,"nextInTime":69810,"topicId":69809,"numMessagesInTopic":0,"msgSnippet":"I have not watched the movie mentioned Schooling the World , but I watched the trailer, get the idea and feel it deeply.  From talking with traveling","messageBody":"<div id=\"ygrps-yiv-456317423\">I have not watched the movie mentioned &quot;Schooling the World&quot;, but I watched the trailer, get the idea and feel it deeply.  From talking with traveling families, it sounds like there are places in the U.S. that have great unschooling communities and I think we have tried hard here in Las Vegas to create one. Because it is such a small community though and people live all over the valley, park days are spread from one side of town to the other.  I think the economy has made it difficult for people to be able to afford to make the drive.  It seems that as the kids get older, they stop coming to park days, either because they end up going to school or they don&#39;t want to come because there are no other kids attending their age anymore, that is what my kids are telling me.  I feel deeply the isolation, no family here, neighbors who don&#39;t let their kids out on week nights because of homework (though we do have a nice network on the weekends)and people in vegas move all the time!! This list of friends who have moved that we know is long.  I have looked for community in Boy Scouts, a small church(that is moving on because they couldn&#39;t develop a community here,a coop, and while there are friends we don&#39;t see them as regularly as we would like.  Not enough sometimes to really be called support.<br/>\nI know this has been talked about but maybe it can be revisited, I need a refresher on how others have sucessfully built community.  How do you keep it close to home?  We have one car and I often have to pick up my husband or don&#39;t have a car.  It makes starting my own group difficult because I am never sure which days I will have the car.  I guess my house is an option.  Has anyone done a home group of some sort and really made it work? My kids are sometimes funny though about having people come over before they know them or I&#39;ve had parties before and people have come who my kids don&#39;t know or like and they feel a little invaded having them in the house. I am not sure how I could navigate that better.</div>","specialLinks":[]}],"prevTopicId":69736,"nextTopicId":69793}}