{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":321729783,"authorName":"Angela Shaw","from":"&quot;Angela Shaw&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"And they&#39;re off","postDate":"1249602708","msgId":46608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjYwMWNhMTZmMCRkY2U3ZWViMCQ5NmI3Y2MxMCRAY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":46607,"nextInTime":46609,"topicId":46608,"numMessagesInTopic":0,"msgSnippet":"My always unschooled girls are now 12  and 14.  They were very shy as youngsters (esp. my oldest) and against the grain, I kept them home from school and I","messageBody":"<div id=\"ygrps-yiv-1190962355\">My always unschooled girls are now 12  and 14.  They were very shy as<br/>\nyoungsters (esp. my oldest) and against the grain, I kept them home from<br/>\nschool and I allowed them to blossom at their own rates of speed and I<br/>\nsupported them as they needed it.  I often answered questions for them.<br/>\nThey never stayed at other people&#39;s houses without me unless they felt<br/>\nreally comfortable with them.  They sometimes hid behind my legs and  had<br/>\nsuch a hard time talking to people that they weren&#39;t comfortable with.  They<br/>\nshared a family bed and then my room  long after most  people&#39;s kids were<br/>\nsleeping in their own beds in their own rooms.  (even other attachment<br/>\nparents I knew) But at 12 and 14 they are so self assured and confident.  It<br/>\nis such a joy to watch them blossom.  <br/>\n<br/>\n <br/>\n<br/>\nWe planned a trip to an island off the coast of Maine today where one of<br/>\ntheir pony club friends lives.  We have animals here at home and my husband<br/>\nis out of town, so I planned to ride the ferry over with them this morning<br/>\nand return on a ferry later today.  When we got to the ferry terminal, the<br/>\nboat was cancelled because the dock on the island side was malfunctioning.<br/>\nWe discussed our options and  returned home and waited to hear if a later<br/>\nferry was going over.  The only one available was the last ferry of the day.<br/>\nThat meant that we either had to wait a day so I could ride with them, or<br/>\nthey would have to go alone.  (together alone, lol!)  They decided to take<br/>\nthe ferry without me.<br/>\n<br/>\n <br/>\n<br/>\nWe arrived at the ferry this afternoon with a few minutes to spare and they<br/>\ngot out to grab a spot in line while I parked the truck.  It was busy<br/>\nbecause two of the earlier ferries had been cancelled.  They had their<br/>\ntickets and most of their luggage.  I told them I&#39;d grab the last bag when I<br/>\nparked and meet them in line.    Well, the ferry personnel loaded the<br/>\npassengers while I was still parking.  The girls boarded the boat and got<br/>\nseats and got their baggage settled and then came out to meet me as I<br/>\nbrought their last bag on board.  I left them with a few words of caution<br/>\nand reminded them to have fun and they were off.  I was so proud of them.<br/>\nAs they boarded, one of them had called me on my cell to let me know they<br/>\nwere getting on the boat. (I didn&#39;t have a chance to answer it as I was<br/>\nrunning with their last bag as I saw the line moving from my parking spot up<br/>\nthe road.)  <br/>\n<br/>\n <br/>\n<br/>\nThey are such responsible girls and they are such a pleasure to be around.<br/>\nI&#39;ll miss them, but I know they&#39;ll be good guests.  They will be swimming<br/>\nand possibly riding horses and hanging out with their friend and her family<br/>\nfor 3 days and nights.  I am truly not worried about them.  I know they make<br/>\ngood and safe decisions.  They were excited to be taking this journey and as<br/>\nmuch as I will miss them, I am so excited for them.  I am so happy they were<br/>\nable to do this on their own and feel confident and comfortable despite the<br/>\nfact that I never pushed them out of their comfort zones when it came to<br/>\nrelating with people.  I have no doubt that if they need help they will not<br/>\nbe afraid to approach the boat personnel and address them.  They have no<br/>\nfear of adults.  No us vs. them mentality.  This is their first trip where<br/>\nthey can&#39;t call in the middle of the night and have me come and get them.<br/>\nThey were not delivered to someone&#39;s door step.  They travelled on this<br/>\nsmall journey together, but alone.  <br/>\n<br/>\n <br/>\n<br/>\nI am filled with joy for them.  I have no idea what I&#39;ll do for the next 3<br/>\ndays to entertain myself.  I have lots of hobbies but my mind will<br/>\nconstantly return to them.  Not sure I&#39;ll be able to concentrate on<br/>\nanything.  Maybe I&#39;ll take long walks with the dog and muck lots of stalls.<br/>\n=)  <br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":46593,"nextTopicId":46621}}