{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":219597491,"authorName":"watersportgirl","from":"&quot;watersportgirl&quot; &lt;watersportgirl@...&gt;","profile":"watersportgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Newbie post: Seven MYTHS of Learning","postDate":"1112374343","msgId":105100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQyanU4NysxcjloQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":105099,"nextInTime":105101,"topicId":105100,"numMessagesInTopic":0,"msgSnippet":"I m a newbie here (more about me later in another post), but thought ... (I m in HSC and San Diego Education yahoo groups.....in case you recognize me! :) ... ","messageBody":"<div id=\"ygrps-yiv-2096517756\">I&#39;m a newbie here (more about me later in another post), but thought <br/>\nthis group might appreciate the following:<br/>\n<br/>\n:) Lori<br/>\n<br/>\n(I&#39;m in HSC and San Diego Education yahoo groups.....in case you <br/>\nrecognize me! :)<br/>\n<br/>\n-----<br/>\n(mind you, this info has passed through the filter of &quot;my&quot; brain,<br/>\nand are from my own notations and thoughts, so I encourage you to<br/>\nget the book!)<br/>\n<br/>\nAccording to Ellen Langer, author of &quot;The Power of Mindful<br/>\nLearning&quot;, the Seven &lt;&lt;&lt;MYTHS&gt;&gt;&gt; of Learning:<br/>\n<br/>\nMINDFUL learning involves the continuous creation of new categories,<br/>\nopenness to new information and the implicit awareness of more than<br/>\none perspective.<br/>\n<br/>\nMindLESS learning involves entrapment in established categories,<br/>\nautomatic behaviors in response to new signals and single<br/>\nperspectiveness.<br/>\n<br/>\n1) MYTH: Basic skills have to be ingrained to the point of being<br/>\nsecond nature. REALITY: We do not have to practice skills to the<br/>\npoint of them being automatic. We need to try out new skills in a<br/>\nvariety of ways, in different contexts and adjust them to our<br/>\nstrengths and experiences. Masters and experts at any skill have<br/>\nlearned to put their own twist on &quot;the basics&quot;. Trial and error are<br/>\nfruitful. Learning something abstract (pen/paper or in the mind<br/>\nonly) and then concrete (hands, real life, for yourself) is<br/>\nbackwards. It should be the other way around.<br/>\n<br/>\n2) MYTH:Paying attention means staying still and focusing on only one<br/>\nthing at a time. REALITY: &quot;Paying attention&quot; has been misconstrued<br/>\nto mean &quot;focus on one thing for the prescribed amount of time<br/>\nwithout focusing on anything else.&quot; Sometimes the distracting thing<br/>\nwarrants our attention and has fruitful learning associated with<br/>\nit. Sometimes it is a stress reliever (which then we must ask, what<br/>\nis stressful?). Sometimes we are distracted because we need to<br/>\nthink about the task at hand in a different way. It is natural for<br/>\nthe mind to seek variety and novelty. Mindless focus actually<br/>\ndesensitizes a person to the object.<br/>\n<br/>\n3) MYTH: Delaying gratification is important (work vs. play,<br/>\nrewards, etc). REALITY: Work should not be wrought with pressure,<br/>\ndeadlines, fear of failure, fatigue, lack of choice and drudgery.<br/>\nYou can turn any work into &quot;play&quot;. Reward/punishment reinforces the<br/>\nnegative value of &quot;getting what one deserves&quot; - for the child and<br/>\ntheir perceptions of others. Do things for the fun of doing them.<br/>\nFind different ways to do them. Make them fun.<br/>\n<br/>\n4) MYTH: Rote memorization is necessary. REALITY: Memorization as a<br/>\nstrategy has no personal meaning and is not correlated with<br/>\nsuccessful application. We remember things of interest, things we<br/>\nneed to know and that pertain to our world.<br/>\n<br/>\n5) MYTH: Forgetting is a problem. REALITY: It is good to be able to<br/>\ntake a fresh look at things. To unlearn something is more difficult<br/>\nthan to learn it. Many paradigms need to be abandoned for new ones<br/>\nas we gain information. Too much &quot;fact&quot; knowledge weighs down<br/>\ncreativity. Mindful information can be recalled in a variety of<br/>\ncontexts, whereas mindless information has to be recalled within a<br/>\nsimilar context in which it was originally stored.<br/>\n<br/>\n6) MYTH:Intelligence is the ability to know &quot;the facts out there&quot;<br/>\nand go from problem to solution in a linear, rapid fashion. REALITY:<br/>\nOne&#39;s own assumption of what is &quot;really out there to know&quot; compared<br/>\nwith one&#39;s own self evaluation of how well it is known can damage<br/>\nthe self esteem. Both &quot;what is out there&quot; to know and how much you<br/>\nknow change constantly. Intelligence is the ability to see from<br/>\nmultiple perspectives, knowing that none of them is optimal in all<br/>\ncontexts.<br/>\n<br/>\n7) MYTH: There are right and wrong answers. REALITY: Intelligence<br/>\nis hobbled in our society by the obsession to get to achiev desired<br/>\noutcome. Some answers are fitting for some contexts and unfitting<br/>\nfor others. Math presented in a step-by-step, &quot;this is how you do<br/>\nit&quot; fashion is mindless. Better than teaching the skills is for the<br/>\nperson to &quot;learn to learn&quot;. Believe in your child&#39;s unlimited<br/>\nintelligence.<br/>\n<br/>\nWe should not value what we do well and devalue what we do not. We<br/>\nshoudl not value some subjects over others. We should not consider<br/>\nourselves static and able to learn and function in limited ways. In<br/>\ntruth, we constantly change and adapt.<br/>\n<br/>\n...........enjoy!</div>","specialLinks":[]}],"prevTopicId":105049,"nextTopicId":105107}}