{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":359600026,"authorName":"maryann","from":"&quot;maryann&quot; &lt;maryannh@...&gt;","profile":"maryannhh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Sexy cartoons and the color pink...how can a parent help?","postDate":"1314192842","msgId":62470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozMnVrYSsyMG5xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGozMWNhYStodGw5QGVHcm91cHMuY29tPg=="},"prevInTopic":62469,"nextInTopic":0,"prevInTime":62469,"nextInTime":62471,"topicId":62462,"numMessagesInTopic":0,"msgSnippet":"My son s favorite color starting before he was 3, was very firmly green.  He LOVED green and actively sought out green things, talking about how much he liked","messageBody":"<div id=\"ygrps-yiv-1337280616\">My son&#39;s favorite color starting before he was 3, was very firmly green.  He LOVED green and actively sought out green things, talking about how much he liked them because green was his favorite.  Sometimes he wanted things JUST because they were green, and said so.  He was drawn to green!<br/>\n<br/>\nThen, somewhere around 4 1/2 or so, he suddenly decided he liked red better and he &quot;hates&quot; green.  He would reject things that he once loved (an outfit, a ball, a bag, a cup, stuff like that) JUST because they were green, and he would ask for red instead.  He has not at all shown the love of red like he did green, just states that red is his favorite.  For quite awhile, whenever he mentioned red was his favorite, he also said he hated green.  Sometimes he told me &quot;You know why I hate green?  Because Jabba the Hut is green and green things remind me of him.&quot;  He&#39;s never mentioned any other fear or issue related to that character, and he still uses a toy green light saber when pretending to be one of the good star wars characters, so I don&#39;t quite follow the reasoning.  <br/>\n<br/>\nHis daddy&#39;s favorite color is red, and I&#39;m guessing that has more to do with it.  But it doesn&#39;t really matter.  :)  I don&#39;t argue with him or show him his flawed reasoning.  <br/>\n<br/>\nMy point is that I&#39;ve observed another young boy having strong feelings about colors for whatever reason.  I would just give him a different pencil in an &quot;oh which color would you like&quot; sort of way, and try not to make a big deal out of it.  <br/>\n<br/>\nWhat we resist, persists.  -Carl Jung  <br/>\n<br/>\nYour son may be feeling like he has to over-emphasize it, too, if you are pretending to not get it.  If he has said he doesn&#39;t like pink or purple, and you are saying he shouldn&#39;t not like them or that indeed boys do like them, he is put on the defense.  That would seem to be more likely to make him try to prove his point and resist your arguments.  Probably after you let it go, when you least expect it there will be a situation where you&#39;ll get to point out a cool looking guy with a pink shirt or a purple hat.  But, only after your son gets to be right for awhile first.<br/>\n<br/>\nOne more thing....Once I had my daughter (okay, after a few months of getting used to the idea that I had a daughter) I relaxed a lot about pink and purple and dolls and gender neutral and all that.  Lots of girls clothes really *are* pink and purple with hearts and flowers, and I agree that it&#39;s pretty keen of your son to notice that on his own.  And my daughter really does prefer dolls alot so far, even though she has plenty of neutral and &quot;boy&quot; toys to choose from.  And her favorite color is red......<br/>\n<br/>\nMaryann<br/>\nDS 5<br/>\nDD 22mo</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Sexy cartoons and the color pink...how can a parent help?","postDate":"1314167783","msgId":62469,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTQxNjc3ODMuMjA4NjkuWWFob29NYWlsUkNAd2ViODczMDkubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PGozMWNhYStodGw5QGVHcm91cHMuY29tPg==","referencesHeader":"PGozMWNhYStodGw5QGVHcm91cHMuY29tPg=="},"prevInTopic":62466,"nextInTopic":62470,"prevInTime":62468,"nextInTime":62470,"topicId":62462,"numMessagesInTopic":0,"msgSnippet":"When Simon was little he didn t think he could love David. That isn t quite right. He didn t think it was okay for him to tell his dad he loved him. He would","messageBody":"<div id=\"ygrps-yiv-1847249226\">When Simon was little he didn&#39;t think he could love David. That isn&#39;t quite <br/>\nright. He didn&#39;t think it was okay for him to tell his dad he loved him. He <br/>\nwould happily, spontaneously tell me that he loved me, but not David. I asked <br/>\nhim about it a couple of times and he couldn&#39;t really express why, but there was <br/>\nsomething about being a boy telling a boy that he loved him that struck little 3 <br/>\nyear old or 4 year old Simon as wrong. <br/>\n<br/>\n<br/>\nHe&#39;s 14 now and will walk through town holding David&#39;s hand. He made different <br/>\ndecisions with different understandings of the world. He&#39;ll probably stop doing <br/>\nthat someday. But I&#39;m not going to worry about that either. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: plaidpanties666 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Wednesday, 24 August, 2011 0:15:22<br/>\nSubject: [AlwaysLearning] Re: Sexy cartoons and the color pink...how can a <br/>\nparent help?<br/>\n<br/>\n&quot;teresa&quot; &lt;treesock@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And this is going to seem silly, but I think one of the reasons I feel creeping <br/>\n&gt;&gt;doubt about this is the fact that my older boy is now certain that purple and <br/>\n&gt;&gt;pink are girl colors (&quot;even though you don&#39;t think so, mom&quot;).  The thing of it <br/>\n&gt;&gt;is, he knows a lot of girls and women who DO prefer pink and purple. So, he&#39;s <br/>\n&gt;&gt;trying to find the pattern there<br/>\n </span></blockquote>**********************<br/>\n<br/>\nIt might help to consider that he&#39;s trying to wrap his mind around the social <br/>\nconstructions of gender and what that all might mean to him, personally. It&#39;s <br/>\nnot a bad thing, it&#39;s part of how kids learn what it &quot;means&quot; to be male or <br/>\nfemale - it means something socially, for better or worse! and that&#39;s important <br/>\ninformation. <br/>\n<br/>\n<br/>\nSix year olds don&#39;t mull things over the same way an adult does, they play out <br/>\nideas very directly. So *thinking* about gender involves making gender-specific <br/>\nchoices and doing gender-specific things. It&#39;s no more a guarantee that he&#39;ll be <br/>\nlocked into those ways of thinking and being than wanting to play with toy guns <br/>\nmeans he&#39;ll eventually join the army. <br/>\n<br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sexy cartoons and the color pink...how can a parent help?","postDate":"1314141322","msgId":62466,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozMWNhYStodGw5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoydmV0Yys4czhsQGVHcm91cHMuY29tPg=="},"prevInTopic":62465,"nextInTopic":62469,"prevInTime":62465,"nextInTime":62467,"topicId":62462,"numMessagesInTopic":0,"msgSnippet":"... ********************** It might help to consider that he s trying to wrap his mind around the social constructions of gender and what that all might mean","messageBody":"<div id=\"ygrps-yiv-1652423891\">&quot;teresa&quot; &lt;treesock@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; And this is going to seem silly, but I think one of the reasons I feel creeping doubt about this is the fact that my older boy is now certain that purple and pink are girl colors (&quot;even though you don&#39;t think so, mom&quot;).  The thing of it is, he knows a lot of girls and women who DO prefer pink and purple. So, he&#39;s trying to find the pattern there<br/>\n </span></blockquote>**********************<br/>\n<br/>\nIt might help to consider that he&#39;s trying to wrap his mind around the social constructions of gender and what that all might mean to him, personally. It&#39;s not a bad thing, it&#39;s part of how kids learn what it &quot;means&quot; to be male or female - it means something socially, for better or worse! and that&#39;s important information. <br/>\n<br/>\nSix year olds don&#39;t mull things over the same way an adult does, they play out ideas very directly. So *thinking* about gender involves making gender-specific choices and doing gender-specific things. It&#39;s no more a guarantee that he&#39;ll be locked into those ways of thinking and being than wanting to play with toy guns means he&#39;ll eventually join the army. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":194427255,"authorName":"Julie","from":"&quot;Julie&quot; &lt;jmarkoski@...&gt;","profile":"jmarkoski","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Sexy cartoons and the color pink...how can a parent help?","postDate":"1314132491","msgId":62465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGozMTNtYis2a2xmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENCNUU5MjU3LTNCODctNDRENC04MUY5LUEwRjM5MjI2Qzc1N0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62464,"nextInTopic":62466,"prevInTime":62464,"nextInTime":62466,"topicId":62462,"numMessagesInTopic":0,"msgSnippet":"An Indian friend/coworker of my husband s and his wife gave our first son pink socks when he was born. They say that pink isn t a female only thing in India","messageBody":"<div id=\"ygrps-yiv-776662905\">An Indian friend/coworker of my husband&#39;s and his wife gave our first son pink socks when he was born. They say that pink isn&#39;t a female only thing in India (at least in Madras, where they are from).<br/>\n<br/>\nI had a friend in grad school who married a Chinese Canadian. They had two ceremonies. In the American ceremony, she wore a white gown; in the Chinese ceremony, she wore red. I think some cultures wear white to funerals, but can&#39;t remember who that includes.<br/>\n<br/>\nThere&#39;s definitely a cultural component, as well as a fad component to these things, and it may be interesting (or not) to your son. I think it&#39;s great that he&#39;s sensing patterns and drawing conclusions based on them.<br/>\n<br/>\nI eschew stereotypes too, but sometimes they are true. Many girls are drawn to pink and dolls and frills (I wasn&#39;t, but my 2 year old very much is). And, realistically, if there is a big physical threat, a smaller person (often female) may very well defer to a bigger person to protect them, like the Scooby Doo example you mentioned. In addition, males are also expected, even in subtle ways, to protect smaller or physically weaker people. Chances are, in a big physical confrontation, neither Daphne nor Velma will step up to the plate, unless they&#39;ve had some special self defense training. I have been training in Krav Maga for 8 months and am advancing in levels. I  think the best way to break stereotypes/broaden your kid&#39;s view of roles people play in life, I that&#39;s important to you,  is to be the exception yourself ;)<br/>\n<br/>\nJulie M<br/>\nJames, almost 6 and Not starting kindergarten next week...ah the sweet freedom for us all!!!!<br/>\nTyler, 4<br/>\nAudrey, 2<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Casually, without making it seem bad or wrong, maybe mention things like &quot;That was in the 1940s (or whenever the cartoon was made; you can google them by name) and men did whistle at women who were walking by sometimes.&quot;<br/>\n&gt; <br/>\n&gt; The old cartoons&#39; dates are in Roman numerals, at the end.  Don&#39;t start reading at the beginning.  It&#39;s going to be 19hundred something. :-)   It won&#39;t stay on screen long enough to do that.  Just look at the last three or five.  It will be something around 50--before or after 1950.  <br/>\n&gt; <br/>\n&gt; I wouldn&#39;t worry about pink being for girls or boys.  It&#39;s not worth trying to dam up a river.  I had friends who grew up hippies who were determined to prove that if they treated their girls &quot;neutrally&quot; that they would HAVE no preferences for pink, dolls or toy dishes.  It didn&#39;t work at all.  It was a huge waste of their energy, and the girls felt guilty at first for wanting fluffy lilac things, and later just thought less of their parents for it.<br/>\n&gt; <br/>\n&gt; The older of those two girls turned five and I gave her the sparkliest sequin-covered white swimsuit I had ever seen.  It had probably been done up for a dance recital or little-girl fashion show.  It had a gold ship&#39;s anchor on a swirl of silver sequins.  She LOVED that and wore it a bunch.  I still know those girls now that they&#39;re grown.  The younger one was at Kirby&#39;s birthday party last month. :-)<br/>\n&gt; <br/>\n&gt; You can say the colors aren&#39;t constants, they involve fads.  Costume historians say that pink was once a color for little boys.  I think 17th and 18th centuries, formal portraits.  I don&#39;t know.  When I was little, boys&#39; bikes were red and girls&#39; bikes were blue.  Then for a while boys&#39; bikes were silver and girls&#39; bikes were pink or purple.  Collecting data might be more interesting than telling them what you think it isn&#39;t (denying what is?) or what it should be (are manufacturers giving you the veto on their color choices?).   Finding pictures in catalogs or magazines of men wearing pink or purple clothes might help (if you think it needs &quot;help&quot;).<br/>\n&gt; <br/>\n&gt; The easiest thing might be for you as the mom to let it go.  But pointing out that one cartoon is showing cold war sensibilities (Russians as bad guys, as on Rocky and Bullwinkle) or WWII prejudices (airplanes with Japanese- or German-looking faces on them in cartoons from the 1940&#39;s) would be a way for the kids to realize cartoons have been around for a long time, and to start tying in those little bits of information into their own personal historical overlay of their model of the universe.  <br/>\n&gt; <br/>\n&gt; Gilligan&#39;s Island had some WWII stuff (the pilot who didn&#39;t know the war was over) and cold war (Cosmonauts land).<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/gilligan\">http://sandradodd.com/t/gilligan</a><br/>\n&gt; (Not a cartoon, of course, but a parallel situation for sexy and pink. :-)  )<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Sexy cartoons and the color pink...how can a parent help?","postDate":"1314111603","msgId":62464,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCNUU5MjU3LTNCODctNDRENC04MUY5LUEwRjM5MjI2Qzc1N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoydmV0Yys4czhsQGVHcm91cHMuY29tPg==","referencesHeader":"PGoydmV0Yys4czhsQGVHcm91cHMuY29tPg=="},"prevInTopic":62462,"nextInTopic":62465,"prevInTime":62463,"nextInTime":62465,"topicId":62462,"numMessagesInTopic":0,"msgSnippet":"Casually, without making it seem bad or wrong, maybe mention things like That was in the 1940s (or whenever the cartoon was made; you can google them by name)","messageBody":"<div id=\"ygrps-yiv-131196460\">Casually, without making it seem bad or wrong, maybe mention things like &quot;That was in the 1940s (or whenever the cartoon was made; you can google them by name) and men did whistle at women who were walking by sometimes.&quot;<br/>\n<br/>\nThe old cartoons&#39; dates are in Roman numerals, at the end.  Don&#39;t start reading at the beginning.  It&#39;s going to be 19hundred something. :-)   It won&#39;t stay on screen long enough to do that.  Just look at the last three or five.  It will be something around 50--before or after 1950.  <br/>\n<br/>\nI wouldn&#39;t worry about pink being for girls or boys.  It&#39;s not worth trying to dam up a river.  I had friends who grew up hippies who were determined to prove that if they treated their girls &quot;neutrally&quot; that they would HAVE no preferences for pink, dolls or toy dishes.  It didn&#39;t work at all.  It was a huge waste of their energy, and the girls felt guilty at first for wanting fluffy lilac things, and later just thought less of their parents for it.<br/>\n<br/>\nThe older of those two girls turned five and I gave her the sparkliest sequin-covered white swimsuit I had ever seen.  It had probably been done up for a dance recital or little-girl fashion show.  It had a gold ship&#39;s anchor on a swirl of silver sequins.  She LOVED that and wore it a bunch.  I still know those girls now that they&#39;re grown.  The younger one was at Kirby&#39;s birthday party last month. :-)<br/>\n<br/>\nYou can say the colors aren&#39;t constants, they involve fads.  Costume historians say that pink was once a color for little boys.  I think 17th and 18th centuries, formal portraits.  I don&#39;t know.  When I was little, boys&#39; bikes were red and girls&#39; bikes were blue.  Then for a while boys&#39; bikes were silver and girls&#39; bikes were pink or purple.  Collecting data might be more interesting than telling them what you think it isn&#39;t (denying what is?) or what it should be (are manufacturers giving you the veto on their color choices?).   Finding pictures in catalogs or magazines of men wearing pink or purple clothes might help (if you think it needs &quot;help&quot;).<br/>\n<br/>\nThe easiest thing might be for you as the mom to let it go.  But pointing out that one cartoon is showing cold war sensibilities (Russians as bad guys, as on Rocky and Bullwinkle) or WWII prejudices (airplanes with Japanese- or German-looking faces on them in cartoons from the 1940&#39;s) would be a way for the kids to realize cartoons have been around for a long time, and to start tying in those little bits of information into their own personal historical overlay of their model of the universe.  <br/>\n<br/>\nGilligan&#39;s Island had some WWII stuff (the pilot who didn&#39;t know the war was over) and cold war (Cosmonauts land).<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/gilligan\">http://sandradodd.com/t/gilligan</a><br/>\n(Not a cartoon, of course, but a parallel situation for sexy and pink. :-)  )<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":177967425,"authorName":"teresa","from":"&quot;teresa&quot; &lt;treesock@...&gt;","profile":"treesock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Sexy cartoons and the color pink...how can a parent help?","postDate":"1314078444","msgId":62462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoydmV0Yys4czhsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62464,"prevInTime":62461,"nextInTime":62463,"topicId":62462,"numMessagesInTopic":0,"msgSnippet":"My boys, especially my nearly 6 year old (the other one is 2 1/2), have been watching a lot of Boomerang channel TV shows lately--Looney Tunes, Tome & Jerry,","messageBody":"<div id=\"ygrps-yiv-725705143\">My boys, especially my nearly 6 year old (the other one is 2 1/2), have been watching a lot of Boomerang channel TV shows lately--Looney Tunes, Tome & Jerry, old Scooby Do, etc. There&#39;s a lot of sexism in those shows--you know, the lady with the sexy legs walks by and Tom whistles, pants, gets all distracted from chasing Jerry; Freddy asks Velma and Daphne to stay behind where they&#39;ll be safer; Bugs dresses in drag to woo a potential captor. <br/>\n<br/>\nI used to say things like, &quot;What a goofball!&quot; or, &quot;I bet Velma could have kicked that guy&#39;s butt by herself.&quot; But really, truly, I think my son prefers if I just sit and watch with him. So, I do, and like other things, I keep a keen on on when these ideas might come up again so that we can talk about them.<br/>\n<br/>\nI am trying to trust that with their whole and healthy senses of self, that my kids will take these pieces of information and put them together with what they know of their mama, their aunts, the way their dad does (and doesn&#39;t!) treat and talk about women, etc., and will come to an understanding of historical context and how entertainment differs from life.<br/>\n<br/>\nAnd this is going to seem silly, but I think one of the reasons I feel creeping doubt about this is the fact that my older boy is now certain that purple and pink are girl colors (&quot;even though you don&#39;t think so, mom&quot;).  The thing of it is, he knows a lot of girls and women who DO prefer pink and purple. So, he&#39;s trying to find the pattern there, which I understand, but meanwhile he will absolutely not even consider wearing anything that has a color even close to one of those two on it. Won&#39;t use a pink pencil. Won&#39;t throw purple water balloons. These are not life-damaging choices, but it makes me wonder what&#39;s kicking around in his brain when he makes that division, you know?<br/>\n<br/>\nAnd he&#39;s a pretty private kid. If I asked him about these choices, he&#39;d clam up immediately, suspecting, I think, that I feel differently, and not wanting to cause discord. Things do come up in conversation in very circuitous and vague ways--he&#39;s a deep, carefully, and mulling thinker, so a question or comment might be weeks or months down the road.<br/>\n<br/>\nSo, ugh. I&#39;m confused about my role in helping to contextualize or maybe mitigate ideas about life and relationships that I know won&#39;t serve my kids well. I&#39;m not opposed at all to watching and waiting if I know that&#39;s going to be the most supportive in the long run, but I also don&#39;t want to fail to offer what might be helpful as he does his weighing-out of ideas.<br/>\n<br/>\nThanks for any thoughts.</div>","specialLinks":[]}],"prevTopicId":62332,"nextTopicId":62427}}