{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":504517042,"authorName":"Lesa Owens","from":"&quot;Lesa Owens&quot; &lt;urcakedreams@...&gt;","profile":"urcakedreams","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Questions about daughter&#39;s attitude","postDate":"1326762365","msgId":65093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpmMmhodCtpZGwwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA2QTEzQUMzNjM0RDRDNkU5QzQ0NzkwNzI4NUE1NjdDQERlYm9yYWhQQz4="},"prevInTopic":65092,"nextInTopic":0,"prevInTime":65092,"nextInTime":65094,"topicId":65079,"numMessagesInTopic":0,"msgSnippet":"Defiant to what I wonder? To the polite way you are asking her to get ready for the dental appt? Why would she be defiant over something like that? What I hear","messageBody":"<div id=\"ygrps-yiv-1529040758\">Defiant to what I wonder? To the polite way you are asking her to get ready for the dental appt? Why would she be defiant over something like that? <br/>\nWhat I hear from-&quot;why do *I* have to do EVERYTHING- isinstead of or in comparison to my little brother. Do you have him put his clothes away after you fold them? Kids sometimes make comparisons like that. They are quick to point out what seems unequal,unfair,unbalanced.<br/>\nwhen she *out of the blue(which nothing is out of the blue, especially aggressive behavior. There&#39;s always a precursor ) do you side with him? Do you think she could be getting the impression that you are?  Maybe she sees what you don&#39;t in the way you treat them . Maybe to* her* there is a difference.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Deb Lewis&quot; &lt;d.lewis@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; ***Here lately she has been very defiant with me. Example, we had a dentist appt the other day and when I ask her to go get ready, she said &quot; make me&quot;. She tells me no all the time and looks at me like what are you going to do about it. ***<br/>\n&gt; <br/>\n&gt; You wrote, âwe had a dentist appointmentâ but I think you mean she had one.  Did she want to go?  Was it a routine visit?  Did she have any choice in making the appointment?   <br/>\n&gt; Or, was it your appointment and she had to come with you for some reason?  Itâs hard to be powerless in a world where adults are always arranging your life for their convenience.  If she had said, âI donât want to go would that have been ok?  Would you have changed or cancelled the appointment?   <br/>\n&gt; <br/>\n&gt; If she couldnât say, âI donât want to go.â then maybe jumping right to, âMake me,â felt to her like the only thing she could do to get you to understand her point of view.  Sometimes people shout, (figuratively, in this case) when they feel like no one is listening to them. <br/>\n&gt; <br/>\n&gt; Others have mentioned this and Iâll echo... a childâs behavior often mirrors that of a parent.  When she seems defiant to you, when you think you detect a tone or manner, stop and think about how you might be coming across to her.   What does she see, hear, feel when you talk to her?   Looking at a situation from your childâs point of view can help your understanding.  Other readers have mentioned that something in your post comes across as resentful.  Maybe think about that.  Think about whether you might be feeling a little sad and resentful about not having had the kind of life youâre trying to make for your daughter.  If itâs possible some resentment is oozing into your exchanges how can you change that? <br/>\n&gt; <br/>\n&gt; Whether itâs puberty related mood or something else, your response can be calm and sweet and over time might help lessen the frequency of the unhappy moments.   For example, if your response to, âmake meâ was something like, âOk, you donât want to go?  Iâll call and cancel.â  Sheâll have an example of a more thoughtful way to communicate.   And later, when sheâs happy and things are fine, you could say something like, âyou didnât have to say âmake meâ you could have said you didnât want to go.â  Thatâs all.  Not a lecture.  Just brief, clear information at a time it might be well received. <br/>\n&gt; <br/>\n&gt; ***Here lately she has been very defiant with me. Example, we had a dentist appt the other day and when I ask her to go get ready, she said &quot; make me&quot;. She tells me no all the time and looks at me like what are you going to do about it. ***<br/>\n&gt; <br/>\n&gt; Had you reminded her about the appointment beforehand?   If she was suddenly reminded at the time she was expected to get ready, did it interrupt something she was engrossed in?   If so, maybe talking about the appointment earlier, talking about what time youâd have to be ready and leave the house could have helped.  <br/>\n&gt; <br/>\n&gt; ***The only thing she has ever had to do is put her clothes up after I fold them and even then she says &quot; why do i have to do everything&quot;. ***<br/>\n&gt; <br/>\n&gt; Sometimes the things we feel we *have to* do are the things that are the hardest to do.  Can the clothes just reside in laundry baskets if you donât want to put them away.  You could buy a few extra laundry baskets just for her room.   <br/>\n&gt; <br/>\n&gt; ***She will do anything to aggrevate her brother, just out of the blue. They are both on computers then all of the sudden bam it starts.***<br/>\n&gt; <br/>\n&gt; Are they hungry?  Is she hungry?  Take them food when theyâre using the computer.  Listen to their conversation.  Stop by frequently to touch hair, rub backs, check in, make a connection.  Stay tuned in.  Nothing happens out of the blue.  Youâre missing something and if you can notice it you might be able to intercept it with a nice sandwich and a hug or whatever it is they may be needing. <br/>\n&gt; <br/>\n&gt; ***I really struggle with handling this without punishment.***<br/>\n&gt; <br/>\n&gt; If you can view the behavior as a form of communication then you can think of ways to respond instead of react.  If your child could say to you, âI feel generally cranky and yucky and donât know what to do,â you probably wouldnât think of punishment as a response to that.  Youâd think of ways to help your kids feel better, be happier, feel even more  loved and nurtured. <br/>\n&gt; <br/>\n&gt; Deb Lewis<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Questions about daughter&#39;s attitude","postDate":"1326757471","msgId":65092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2QTEzQUMzNjM0RDRDNkU5QzQ0NzkwNzI4NUE1NjdDQERlYm9yYWhQQz4=","inReplyToHeader":"PDNCQjkxRTAzLTA5RjMtNDA0Qy04QzkyLTZBN0NFQjc1RDkxQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDNCQjkxRTAzLTA5RjMtNDA0Qy04QzkyLTZBN0NFQjc1RDkxQUB2ZXJpem9uLm5ldD4="},"prevInTopic":65091,"nextInTopic":65093,"prevInTime":65091,"nextInTime":65093,"topicId":65079,"numMessagesInTopic":0,"msgSnippet":"***Here lately she has been very defiant with me. Example, we had a dentist appt the other day and when I ask her to go get ready, she said  make me . She","messageBody":"<div id=\"ygrps-yiv-173152041\">***Here lately she has been very defiant with me. Example, we had a dentist appt the other day and when I ask her to go get ready, she said &quot; make me&quot;. She tells me no all the time and looks at me like what are you going to do about it. ***<br/>\n<br/>\nYou wrote, “we had a dentist appointment” but I think you mean she had one.  Did she want to go?  Was it a routine visit?  Did she have any choice in making the appointment?   <br/>\nOr, was it your appointment and she had to come with you for some reason?  It’s hard to be powerless in a world where adults are always arranging your life for their convenience.  If she had said, “I don’t want to go would that have been ok?  Would you have changed or cancelled the appointment?   <br/>\n<br/>\nIf she couldn’t say, “I don’t want to go.” then maybe jumping right to, “Make me,” felt to her like the only thing she could do to get you to understand her point of view.  Sometimes people shout, (figuratively, in this case) when they feel like no one is listening to them. <br/>\n<br/>\nOthers have mentioned this and I’ll echo... a child’s behavior often mirrors that of a parent.  When she seems defiant to you, when you think you detect a tone or manner, stop and think about how you might be coming across to her.   What does she see, hear, feel when you talk to her?   Looking at a situation from your child’s point of view can help your understanding.  Other readers have mentioned that something in your post comes across as resentful.  Maybe think about that.  Think about whether you might be feeling a little sad and resentful about not having had the kind of life you’re trying to make for your daughter.  If it’s possible some resentment is oozing into your exchanges how can you change that? <br/>\n<br/>\nWhether it’s puberty related mood or something else, your response can be calm and sweet and over time might help lessen the frequency of the unhappy moments.   For example, if your response to, “make me” was something like, “Ok, you don’t want to go?  I’ll call and cancel.”  She’ll have an example of a more thoughtful way to communicate.   And later, when she’s happy and things are fine, you could say something like, “you didn’t have to say “make me” you could have said you didn’t want to go.”  That’s all.  Not a lecture.  Just brief, clear information at a time it might be well received. <br/>\n<br/>\n***Here lately she has been very defiant with me. Example, we had a dentist appt the other day and when I ask her to go get ready, she said &quot; make me&quot;. She tells me no all the time and looks at me like what are you going to do about it. ***<br/>\n<br/>\nHad you reminded her about the appointment beforehand?   If she was suddenly reminded at the time she was expected to get ready, did it interrupt something she was engrossed in?   If so, maybe talking about the appointment earlier, talking about what time you’d have to be ready and leave the house could have helped.  <br/>\n<br/>\n***The only thing she has ever had to do is put her clothes up after I fold them and even then she says &quot; why do i have to do everything&quot;. ***<br/>\n<br/>\nSometimes the things we feel we *have to* do are the things that are the hardest to do.  Can the clothes just reside in laundry baskets if you don’t want to put them away.  You could buy a few extra laundry baskets just for her room.   <br/>\n<br/>\n***She will do anything to aggrevate her brother, just out of the blue. They are both on computers then all of the sudden bam it starts.***<br/>\n<br/>\nAre they hungry?  Is she hungry?  Take them food when they’re using the computer.  Listen to their conversation.  Stop by frequently to touch hair, rub backs, check in, make a connection.  Stay tuned in.  Nothing happens out of the blue.  You’re missing something and if you can notice it you might be able to intercept it with a nice sandwich and a hug or whatever it is they may be needing. <br/>\n<br/>\n***I really struggle with handling this without punishment.***<br/>\n<br/>\nIf you can view the behavior as a form of communication then you can think of ways to respond instead of react.  If your child could say to you, “I feel generally cranky and yucky and don’t know what to do,” you probably wouldn’t think of punishment as a response to that.  You’d think of ways to help your kids feel better, be happier, feel even more  loved and nurtured. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Questions about daughter&#39;s attitude","postDate":"1326755152","msgId":65091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpmMmFnZys0b2s4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNCQjkxRTAzLTA5RjMtNDA0Qy04QzkyLTZBN0NFQjc1RDkxQUB2ZXJpem9uLm5ldD4="},"prevInTopic":65090,"nextInTopic":65092,"prevInTime":65090,"nextInTime":65092,"topicId":65079,"numMessagesInTopic":0,"msgSnippet":"... **************** It can help a lot to take a good look at the way you talk to her and try to see things from her perspective. For instance, when most","messageBody":"<div id=\"ygrps-yiv-927114547\"><blockquote><span title=\"ireply\">&gt;Example, we had a dentist appt the other day and when I ask her to go get ready, she said &quot; make me&quot;.  She tells me no all the time... <br/>\n </span></blockquote>****************<br/>\n<br/>\nIt can help a lot to take a good look at the way you talk to her and try to see things from her perspective. For instance, when most parents use the word &quot;ask&quot; as in &quot;I asked her to do x&quot; it doesn&#39;t sound to the child like a real question, one where the answer might be &quot;no&quot;. &quot;Would you please get ready to go?&quot; isn&#39;t really a question, its a gussied up demand, and kids know it. <br/>\n<br/>\nSo rather than making demands, have conversations with your daughter. Remind her in advance of an appointment and ask her if she wants help getting ready - does she want to take a shower or change clothes before hand? Would she like another reminder closer to time to go? Or would she prefer a last minute &quot;the car&#39;s warmed up, let&#39;s go!&quot; so she doesn&#39;t have to fret about it? <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I do not limit anything she wants to do.<br/>\n<br/>\n </span></blockquote>Then what does she have to say no to &quot;all the time&quot;? Try to see her perspective. If she&#39;s busy and you&#39;re &quot;asking&quot; her to do this and that, interrupting her and getting in her way, then from her point of view, you&#39;re being monumentally rude. That&#39;s even more true if she has a hard time focusing on things which she enjoys to begin with. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; She will do anything to aggrevate her brother, just out of the blue.  They are both on computers then all of the sudden bam it starts.  <br/>\n </span></blockquote>*****************<br/>\n<br/>\nAntagonizing siblings is a really good sign a child needs more attention. Spend more time with her. Hang out with her at the computer. Look for other fun things to do together. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; PS -- The thing is she just started acting this way, she hasnt always done this.<br/>\n </span></blockquote>**********************<br/>\n<br/>\nDevelopmental shifts of all kinds can leave kids feeling adrift and unsure - and as a result, shorter tempered. Give her lots of warm fuzzy mothering. Be gentle and thoughtful of her needs. If she&#39;s getting bored easily, it may be she needs some new ideas so she&#39;s not stuck between &quot;play on the computer&quot; and &quot;fight with my brother&quot; so much. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Questions about daughter&#39;s attitude","postDate":"1326745311","msgId":65090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENDQkYzOUE0LTJENDEtNDE2NS1BNDUzLTUxRTJCMzU5OTQ3RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpmMjBrMytjdGxjQGVHcm91cHMuY29tPg==","referencesHeader":"PGpmMjBrMytjdGxjQGVHcm91cHMuY29tPg=="},"prevInTopic":65089,"nextInTopic":65091,"prevInTime":65089,"nextInTime":65091,"topicId":65079,"numMessagesInTopic":0,"msgSnippet":"Below is something Pam Sorooshian wrote a couple of years ago, in response to someone saying she-the-mom was unhappy/frustrated, and her husband was depressed.","messageBody":"<div id=\"ygrps-yiv-619359282\">Below is something Pam Sorooshian wrote a couple of years ago, in response to someone saying she-the-mom was unhappy/frustrated, and her husband was depressed. But it can apply to anything.  <br/>\n<br/>\nI&#39;ve had it out on my desktop for two days trying to figure out where on my site to save it. :-)    Here&#39;s a good place for it for starters:<br/>\n<br/>\n<br/>\n=========================<br/>\nOne thing that you can do is change your attitude about housework. Seriously, it is very very possible. I know this because &quot;I&quot; did it. Looking back, seems like an easy switch in thinking; before I did it, seemed completely ridiculous.<br/>\n<br/>\nIt isn&#39;t an insignificant change though, because it is part of your everyday lives. So that&#39;s MY recommendation to you - that you focus on changing your thinking about housework. It won&#39;t take that long if you put some serious energy and commitment into it. Maybe a month for it to really be different.<br/>\n<br/>\nHere is the big &quot;secret.&quot; You think about the REAL reasons you are doing whatever you&#39;re doing. Not the negative reasons, the REAL reasons. Do it like you&#39;re reciting a prayer or an affirmation or even a mantra to yourself - &quot;I am washing these dishes because because it is so nice to come into the kitchen to make food and find all the dishes clean and ready to use.&quot; &quot;I am cleaning the cat litter box because it is so nice to see it all fresh and clean and smelling good and ready for the cat to enjoy.&quot; &quot;I am doing this laundry because I just love opening the closet and having all these clothing choices to pick from.&quot; &quot;I&#39;m making this food because I love to nurture and care for my family.&quot;<br/>\n<br/>\nAlso, pay really close attention to the nice feelings of doing housework - enjoy your pretty dishes, nice dishtowels, the smell of dish soap, the feeling of the warm water.<br/>\n<br/>\nIt takes self-discipline to do this stuff, at first. You can hang onto the resentment that you&#39;re &quot;stuck&quot; doing housework, or you can choose to be grateful that you have the chance to do it for your family.<br/>\n<br/>\nI didn&#39;t get this figured out until my kids were pretty old - older teens. Until then, housework was the one aspect of our lives that wasn&#39;t happy. I managed to completely change the way all of us look at housework. Even just today I was doing dishes and thinking how pretty my green bowls are, and I made soup for two of my kids and two of their friends. When I brought it out, I said, happily, &quot;Don&#39;t you love these bowls?&quot; It was a carry over from what I&#39;d been thinking while doing the dishes. One of my kids said, &quot;Such little things make my mom so happy.&quot; It was said kind of jokingly, but also proudly. And after we ate, they brought the bowls into the kitchen and rinsed them off carefully and, yes, lovingly.<br/>\n<br/>\n[Pam Sorooshian]</div>","specialLinks":[]},{"userId":338201201,"authorName":"dkjsv05","from":"&quot;dkjsv05&quot; &lt;dkjsv05@...&gt;","profile":"dkjsv05@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Questions about daughter&#39;s attitude","postDate":"1326745027","msgId":65089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpmMjBrMytjdGxjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNCQjkxRTAzLTA5RjMtNDA0Qy04QzkyLTZBN0NFQjc1RDkxQUB2ZXJpem9uLm5ldD4="},"prevInTopic":65083,"nextInTopic":65090,"prevInTime":65088,"nextInTime":65090,"topicId":65079,"numMessagesInTopic":0,"msgSnippet":"Hello, ~ Here lately she has been very defiant with me.  Example, we had a dentist appt the other day and when I ask her to go get ready, she said  make me .","messageBody":"<div id=\"ygrps-yiv-1807070667\">Hello,<br/>\n<br/>\n~&quot; Here lately she has been very defiant with me.  Example, we had a dentist appt the other day and when I ask her to go get ready, she said &quot; make me&quot;.  She tells me no all the time and looks at me like what are you going to do about it.&quot; ~<br/>\n<br/>\nWhen we first transitioned into radical unschooling (after deschooling)my now 11 year old daughter would test me all the time. Not to be defiant but because there was trust issues to be worked out between us. She was use to me becoming upset with what I thought ,at the time, was &quot;bad&quot; behaviors and use to being punished. Once she understood I was serious about changing ,and this does not happen overnight,the testing stopped. <br/>\n<br/>\n~&quot;The only thing she has ever had to do is put her clothes up after I fold them and even then she says &quot; why do i have to do everything&quot;.  She plays roblox on comp almost all day and night so she isn&#39;t really made to do anything so I dont know where this is coming from.&quot;~<br/>\n<br/>\nThis to me sounds like you resent the fact that this is *all* she does in a day. Maybe she is picking up on resentment too, even if you are not meaning to be resentful. This could play a part in why she may not think you are serious about peaceful parenting.<br/>\n<br/>\nI don&#39;t *make* my girls put their own clothes away. I *choose* to do laundry so my family can have clean clothes. I no longer view laundry as something I &quot;have to&quot; do but as an act of love. Now my girls sometimes choose to help me and sometimes they don&#39;t. This is with *all* household chores. So instead of fighting and being negative over folded clothes I get *more* help then before but this time it&#39;s because they want to and not because they &quot;have to&quot;.<br/>\n<br/>\n~&quot;She is such a sweet girl and very loving until this mood comes along.&quot;<br/>\n<br/>\nMy girls(21,11,&6) are very sweet and loving children period. I don&#39;t focus on &quot;ugly&quot; moods. Instead I try to find out why someone no longer is happy. What changed? This means I need to be more present with my family. <br/>\n<br/>\nI know I wouldn&#39;t like to be &quot;labeled&quot; as a sweet and loving mother &quot;until this mood comes along&quot; especially behind my back by my girls. If I have &quot;a mood&quot; it&#39;s because something&#39;s happened. Maybe understanding why you behave at certain times could help you not see your daughters moods as &quot;ugly&quot;.<br/>\n<br/>\n<br/>\nKim</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Questions about daughter&#39;s attitude","postDate":"1326728198","msgId":65083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0MkVEN0U3LTYzMDQtNDBEMy1BMzU2LTlCNEYxMkI4NkU3OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDNCQjkxRTAzLTA5RjMtNDA0Qy04QzkyLTZBN0NFQjc1RDkxQUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDNCQjkxRTAzLTA5RjMtNDA0Qy04QzkyLTZBN0NFQjc1RDkxQUB2ZXJpem9uLm5ldD4="},"prevInTopic":65079,"nextInTopic":65089,"prevInTime":65082,"nextInTime":65084,"topicId":65079,"numMessagesInTopic":0,"msgSnippet":"-=-PS -- The thing is she just started acting this way, she hasnt always done this.-=- People talk about an early puberty in nine-year-old girls--a first","messageBody":"<div id=\"ygrps-yiv-1841244551\">-=-PS -- The thing is she just started acting this way, she hasnt always done this.-=-<br/>\n<br/>\nPeople talk about an &quot;early puberty&quot; in nine-year-old girls--a first beginning of hormonal changes.  Not The Big One, that will come around 14, but something.<br/>\n<br/>\nBeing aware of that doesn&#39;t mean blaming it on that.<br/>\n<br/>\n-=-This unschooling, peaceful parenting thing is very new to me and I am struggling myself at changing the way I handle things ,especially when I get a response like that from her. -=-<br/>\n<br/>\nNow new is unschooling to you?<br/>\nNewer than when you made the dentist&#39;s appointment?<br/>\n<br/>\nI&#39;m going to point out what I saw in the description, and comment on those things that could possibly be factors.<br/>\n<br/>\n-=-I have some questions about handling my daughter. -=-<br/>\n-=-She has a mild case of adhd and i do not medicate. -=-<br/>\n-=-Here lately she has been very defiant with me.-=-<br/>\n<br/>\n-=-I have some questions about handling my daughter. -=-<br/>\n<br/>\nDon&#39;t think of her as something or someone you need to &quot;handle.&quot;  Work toward making decisions in what you do, say and think that will help build a strong relationship with her--a friendship, a trust, a partnership.  You can&#39;t do it overnight.<br/>\n<br/>\n-=-She has a mild case of adhd and i do not medicate. -=-<br/>\n<br/>\nIf she&#39;s not in school, and you&#39;re not doing school at home, then forget totally about &quot;adhd&quot; (mild or otherwise) and don&#39;t mention it and don&#39;t think about it.  You&#39;re branding her defective.  You&#39;re thinking it, and you chose to tell a bunch of people.  Not worth doing.  It&#39;s not productive.  It&#39;s divisive.  It will distract you from what will help unschooling take, and flourish.<br/>\n<br/>\n-=-Here lately she has been very defiant with me.-=-<br/>\n<br/>\nIt&#39;s not good to let go of everything at once.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\nBut as you let go of things you used to say were important, she will be confused and possibly resentful.  If you told her she HAD to do this or that or else she would be sick/slow/wrong/bad, now if you say &quot;I don&#39;t care,&quot; it might sound to her like you stopped caring whether she&#39;s wrong or bad.  <br/>\n<br/>\nShe can&#39;t &quot;defy&quot; you, though, if you&#39;re not trying to control her against her will.<br/>\n<br/>\n-=-This unschooling, peaceful parenting thing is very new to me...-=-<br/>\n<br/>\nIf I heard about tanning, but I didn&#39;t have a tan, if I wrote &quot;this tanning thing is very new to me,&quot; it would be too soon.  I don&#39;t HAVE a tanning thing if I don&#39;t have a tan.  <br/>\n<br/>\nIf I signed up for piano lessons and wrote &quot;this piano playing thing is very new to me,&quot; but I couldn&#39;t play anything yet, that would be awkward.<br/>\n<br/>\nWhen you ARE parenting more peacefully, you might not think of it as &quot;that thing,&quot; but as something on which you&#39;re basing your own decisions and actions.<br/>\n<br/>\n-=- I am struggling myself at changing the way I handle things -=-<br/>\n<br/>\n&quot;Struggle&quot; and &quot;handle&quot; will disappear as soon as you figure out how you want to live, what your new priorities will be, and you practice making conscious decisions.  It&#39;s easy to dabble with decisionmaking, and fairly easy to get good at it!<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\n-=- I do not limit anything she wants to do. The only thing she has ever had to do is put her clothes up after I fold them and even then she says &quot; why do i have to do everything&quot;. -=-<br/>\n<br/>\nYou limited her when she wanted to stay home instead of go to the dentist.<br/>\nYou limited her when she wanted to play or something instead of putting clothes away.<br/>\n<br/>\nThose aren&#39;t bad things.  I just want to help you be clear and honest with what you think and write and post.  There&#39;s no benefit to you saying/writing/thinking something that isn&#39;t true.  It will only muddy your thinking.<br/>\n<br/>\n-=- The only thing she has ever had to do is ...<br/>\n<br/>\nHad to why?<br/>\nHad to or what?<br/>\n<br/>\n-=- is put her clothes up after I fold them and even then she says &quot; why do i have to do everything&quot;. -=-<br/>\n<br/>\nIt sounds like you&#39;re feeling put upon for having folded them, but then you&#39;re surprised she&#39;d feeling put upon because she &quot;has to&quot; put them away.  <br/>\n<br/>\nYou&#39;re describing an antagonistic relationship.  She&#39;s only nine.  My mom told my sister and cousin that they &quot;had to&quot; fold the laundry, when they were 8 and 9.  They did NOT &quot;have to.&quot;  They ran away instead.   My mom really should have folded that laundry herself, or asked some of us to help her, in a nice and happy way.  We never folded things together except sheets.  It might have been fun, but my mom didn&#39;t think it was fun, and so she tried to make us do it.  It felt mean.  It felt like punishment.  We felt powerless.<br/>\n<br/>\nIs there a reason to put the clothes away?<br/>\nCan you think of alternatives?<br/>\nDoes she &quot;have to&quot; put the clothes away the moment you finish folding?<br/>\nWhy?<br/>\n<br/>\nYou don&#39;t need to tell us those things, but it would be helpful to you to think about the answers.<br/>\n<br/>\n-=- She will apologize most times after being ugly to me and she cries about it. She is such a sweet girl and very loving until this mood comes along.-=-<br/>\n<br/>\nHave you told her she&#39;s &quot;being ugly,&quot; or do you just say that behind her back?  You must think it, or you couldn&#39;t possibly have come up with that phrase.  Did your mom say that to you, years ago?  That you were &quot;being ugly&quot;?  It&#39;s not a nice way to see her communications with you.<br/>\n<br/>\n-=- She will apologize most times after being ugly to me and she cries about it. She is such a sweet girl and very loving until this mood comes along.-=-<br/>\n<br/>\nDoes that mood have nothing to do with how you acted toward her before the mood came along?  Is she a sweet girl who suddenly snaps with no stimulus, no provocation?   Does it happen when she&#39;s hungry or tired?  Does she need transition time and preparation or coaching that she&#39;s not getting?<br/>\n<br/>\nYou don&#39;t need to tell us anything, but put those on your checklist of things to look for as you try to figure it out.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Questions about daughter&#39;s attitude","postDate":"1326721501","msgId":65079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCQjkxRTAzLTA5RjMtNDA0Qy04QzkyLTZBN0NFQjc1RDkxQUB2ZXJpem9uLm5ldD4="},"prevInTopic":0,"nextInTopic":65083,"prevInTime":65078,"nextInTime":65080,"topicId":65079,"numMessagesInTopic":0,"msgSnippet":"Someone wanted their question posted anonymously -- Joyce ============= I have some questions about handling my daughter.  She has a mild case of adhd and i do","messageBody":"<div id=\"ygrps-yiv-293163948\">Someone wanted their question posted anonymously -- Joyce<br/>\n<br/>\n=============<br/>\nI have some questions about handling my daughter.  She has a mild case of adhd and i do not medicate.  Here lately she has been very defiant with me.  Example, we had a dentist appt the other day and when I ask her to go get ready, she said &quot; make me&quot;.  She tells me no all the time and looks at me like what are you going to do about it.  This unschooling, peaceful parenting thing is very new to me and I am struggling myself at changing the way I handle things ,especially when I get  a response like that from her.  I do not limit anything she wants to do.  The only thing she has ever had to do is put her clothes up after I fold them and even then she says &quot; why do i have to do everything&quot;.  She plays roblox on comp almost all day and night so she isn&#39;t really made to do anything so I dont know where this is coming from.  She will do anything to aggrevate her brother, just out of the blue.  They are both on computers then all of the sudden bam it starts.  I really struggle with handling this without punishment.<br/>\n<br/>\nshe is 9, almost 10.  She will apologize most times after being ugly to me and she cries about it.  She is such a sweet girl and very loving until this mood comes along.  I just dont know what to do about it.  Thanks for any help you can give me with this. <br/>\n<br/>\nPS -- The thing is she just started acting this way, she hasnt always done this.<br/>\n=============<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":65039,"nextTopicId":65098}}