{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Peter Gray&#39;s survey can be done by e-mail.","postDate":"1316016915","msgId":62889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGo0cWp1aytmYjdhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhGOTE4NjFELTZFRTQtNDhBOS1CODRFLTYwNzZFNDhFRTUwNEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62884,"nextInTopic":0,"prevInTime":62888,"nextInTime":62890,"topicId":62883,"numMessagesInTopic":0,"msgSnippet":"His email address is grayp  bc  edu   Yahoo groups truncates the address on some lists. Caren","messageBody":"<div id=\"ygrps-yiv-883161470\">His email address is grayp &lt;at&gt; bc &lt;dot&gt; edu   Yahoo groups truncates the address on some lists.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Peter Gray&#39;s survey can be done by e-mail.","postDate":"1315972198","msgId":62884,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGOTE4NjFELTZFRTQtNDhBOS1CODRFLTYwNzZFNDhFRTUwNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDZDQThBN0FELTc3RkQtNDZDQi1BQjY2LTdCRUY2RkY2QTExMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDZDQThBN0FELTc3RkQtNDZDQi1BQjY2LTdCRUY2RkY2QTExMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62883,"nextInTopic":62889,"prevInTime":62883,"nextInTime":62885,"topicId":62883,"numMessagesInTopic":0,"msgSnippet":"Unschooling Survey, Part I. Conducted by Peter Gray, Research Professor of Psychology, Boston College, and author of Freedom to Learn blog:","messageBody":"<div id=\"ygrps-yiv-508851710\">Unschooling Survey, Part I.<br/>\n<br/>\nConducted by Peter Gray, Research Professor of Psychology, Boston College, and author of Freedom to Learn blog: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.psychologytoday.com/blog/freedom-learn\">http://www.psychologytoday.com/blog/freedom-learn</a><br/>\n<br/>\nEmail:  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:grayp@...\">grayp@...</a>   [later note:  e-mail responses are acceptable]<br/>\n<br/>\nIf you are willing to participate, please answer these questions by typing directly on this form. Then return the form to me (Peter Gray) as an email attachment.  I have referred to this survey as “Part I,” because I may follow it up with a Part II. By filling out Part I, you are not necessarily agreeing to fill out Part II.  This, Part I, focuses mostly on your definition of unschooling and how you came to it.  Part II, most likely, will focus more on the specifics of your children’s unschooling experiences and what and how they learn.  In any publications that come from this work, I will not use names or other identifying material, for you or for any members of your family.  However, I ask you to give me your name (below) so I can keep appropriate track of all responses and collate them appropriately.  The questionnaire is designed to be filled out by a parent or guardian in the unschooling family.<br/>\n<br/>\n <br/>\n<br/>\nI realize that some of the questions below could produce very long answers, even books.  However, I am asking for relatively short answers, which just hit on the main points, without great detail. But don’t hesitate to provide those details that you feel are needed to make your main point(s) clear.<br/>\n<br/>\n <br/>\n<br/>\nHere are the questions:<br/>\n<br/>\n <br/>\n<br/>\n1.  Have all of the members of your immediate family who are capable of understanding and responding to this question agreed, willingly, to your filling out this form and returning it to me?  (If the answer is no, then please stop here and do not return the form.)<br/>\n<br/>\n <br/>\n<br/>\n2  Please give your<br/>\n<br/>\n            full name (first and last, in that order): <br/>\n<br/>\n            email address:<br/>\n<br/>\n            state in which you reside (if not from the US, give nation):<br/>\n<br/>\n <br/>\n<br/>\n3. What is your main employment?  Does that employment generate income, and does it take place primarily at home or away from home? If you have a spouse or other domestic partner in your family who is also a parent or guardian to the children, please also answer these questions for that person.<br/>\n<br/>\n <br/>\n<br/>\n4.  How many children are in your family?  For each child, please state name (you may omit name if you prefer), sex, and birth date; and, if the child was ever enrolled full time in a conventional or alternative school, please indicate the years (expressed either in terms of the child’s grade in school or the child’s age if it was an ungraded school) and duration of that enrollment.  Please include adult children no longer living at home as well as children still at home.<br/>\n<br/>\n <br/>\n<br/>\n5. Please describe briefly how your family defines unschooling.  What if any responsibility do you, as parent(s), assume for the education of your children? [I am asking only for generalities here. I may ask for more details in a subsequent survey.]<br/>\n<br/>\n <br/>\n<br/>\n6. Please describe the path by which your family came to the unschooling philosophy you now practice.  In particular: <br/>\n<br/>\n(a) Did any specific school experiences of one or more of your children play a role?  If so, briefly describe those experiences.<br/>\n<br/>\n(b) Did any particular author or authors play a role? If so, please name the author or authors and what most appealed to you about their writing. <br/>\n<br/>\n(c) Did you try homeschooling before unschooling?  If so, what led you from one to the other?<br/>\n<br/>\n <br/>\n<br/>\n7.  What, for your family, have been the biggest challenges or hurdles to surmount in unschooling?<br/>\n<br/>\n <br/>\n<br/>\n8.  What, for your family, have been the biggest benefits of unschooling?<br/>\n<br/>\n <br/>\n<br/>\nThank you very much for taking the time to fill out this questionnaire and email it to me.  My hope is that your efforts will help to document, and make the world more aware of, the realities of unschooling.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Peter Gray&#39;s survey can be done by e-mail.","postDate":"1315971885","msgId":62883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDQThBN0FELTc3RkQtNDZDQi1BQjY2LTdCRUY2RkY2QTExMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":62884,"prevInTime":62882,"nextInTime":62884,"topicId":62883,"numMessagesInTopic":0,"msgSnippet":"Sandra, thank you so much for your help in distributing the survey. I really appreciate it. Yes, it is OK to fill out the survey form directly on an email.","messageBody":"<div id=\"ygrps-yiv-51106417\">Sandra, thank you so much for your help in distributing the survey. I really appreciate it.<br/>\n<br/>\nYes, it is OK to fill out the survey form directly on an email.  I&#39;ve already received one that was done that way.  I just cut and pasted it into a Word document; no problem.<br/>\n<br/>\nBest wishes,<br/>\nPeter<br/>\n<br/>\nPeter Gray<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://blogs.psychologytoday.com/blog/freedom-learn\">http://blogs.psychologytoday.com/blog/freedom-learn</a><br/>\n<br/>\n---------<br/>\n<br/>\nSO I will post the entire text of the word file, for those who don&#39;t have or can&#39;t use Word, or for those using iPads or phones or whatnot.<br/>\n<br/>\nI&#39;m really glad he will take it by e-mail, because he&#39;ll get way more responses.  He works at a university and he&#39;s older, so the idea that every computer has Word makes sense.  I wouldn&#39;t have a computer without Word myself, but I&#39;m also old and I started off with word processing on computers, before there was much else. :-)<br/>\n<br/>\nNext post, the full text.<br/>\nI hope a bunch of you will take time to fill that out.<br/>\n<br/>\nThanks!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":62888,"nextTopicId":62879}}