{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":327852347,"authorName":"Lillie M","from":"Lillie M &lt;milesdt@...&gt;","profile":"abacaxi7476","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: how long is too long for deschooling?","postDate":"1361559467","msgId":70608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkxLeTMzYXVWajQrN0pfa1lZbmZFaTVwcHZUd1liUjFiUDBuUE5RSz12QkN5cC1Yd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGtnOGVrOCthYWhwQGVHcm91cHMuY29tPg==","referencesHeader":"PEJMVTE3My1EUzE3MzhGMUQzRDcxM0MzNzRBMzgyODhDNEYwMEBwaHguZ2JsPgk8a2c4ZWs4K2FhaHBAZUdyb3Vwcy5jb20+"},"prevInTopic":70599,"nextInTopic":0,"prevInTime":70607,"nextInTime":70609,"topicId":70590,"numMessagesInTopic":0,"msgSnippet":"Just wanted to mention that my daughter is 10 and didn t want me to read her any books about her changing body.  So we found a couple of videos on youtube that","messageBody":"<div id=\"ygrps-yiv-243954014\">Just wanted to mention that my daughter is 10 and didn&#39;t want me to read<br/>\nher any books about her changing body.  So we found a couple of videos on<br/>\nyoutube that explain menstruation.  One, in particular, is a hilarious<br/>\ncartoon rendering.  We watched it over and over together and my daughter<br/>\nhowled in laughter.  She enjoyed it and came away knowing what I wanted her<br/>\nto know about her body.<br/>\n<br/>\nI was raised by an emotionally distant stepmother who told me nothing.<br/>\n Those were also the years before schools taught anything about our bodies.<br/>\n I didn&#39;t want my daughter to be  terrified the way I was when I got my<br/>\nfirst period.<br/>\n<br/>\nTress<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Feb 22, 2013 at 1:49 PM, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;CASS KOTRBA&quot; wrote:<br/>\n&gt; &gt;&gt; So to answer the question of how long does it take to deschool, maybe<br/>\n&gt; the answer is &quot;You will probably feel confident and comfortable with some<br/>\n&gt; aspects after about 6 months. Other aspects will take longer,<br/>\n&gt; **************<br/>\n&gt;<br/>\n&gt; There will be hidden pockets of things which come up later, too - when you<br/>\n&gt; get to ages where you learned something significant, or had something<br/>\n&gt; special happen to you. Different issues will come up with sons and<br/>\n&gt; daughters, too. I didn&#39;t have to worry about Ray getting period, but Mo&#39;s<br/>\n&gt; the age I was when I started, and I find myself wondering how to teach her<br/>\n&gt; about that and catching myself, surprised.<br/>\n&gt;<br/>\n&gt; ---Meredith<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: how long is too long for deschooling?","postDate":"1361558984","msgId":70599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtnOGVrOCthYWhwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJMVTE3My1EUzE3MzhGMUQzRDcxM0MzNzRBMzgyODhDNEYwMEBwaHguZ2JsPg=="},"prevInTopic":70598,"nextInTopic":70608,"prevInTime":70598,"nextInTime":70600,"topicId":70590,"numMessagesInTopic":0,"msgSnippet":"... ************** There will be hidden pockets of things which come up later, too - when you get to ages where you learned something significant, or had","messageBody":"<div id=\"ygrps-yiv-528836363\">&quot;CASS KOTRBA&quot; &lt;caskot@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; So to answer the question of how long does it take to deschool, maybe the answer is &quot;You will probably feel confident and comfortable with some aspects after about 6 months.  Other aspects will take longer,<br/>\n </span></blockquote>**************<br/>\n<br/>\nThere will be hidden pockets of things which come up later, too - when you get to ages where you learned something significant, or had something special happen to you. Different issues will come up with sons and daughters, too. I didn&#39;t have to worry about Ray getting  period, but Mo&#39;s the age I was when I started, and I find myself wondering how to teach her about that and catching myself, surprised. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: how long is too long for deschooling?","postDate":"1361558380","msgId":70598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtnOGUxYytmdWJkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY1OTM4N0U1LTM4RDgtNENGRC1BOEEzLUZGMzcyOTJFMDM2MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":70596,"nextInTopic":70599,"prevInTime":70597,"nextInTime":70599,"topicId":70590,"numMessagesInTopic":0,"msgSnippet":"... ************** Older kids may be more likely to have internalized schoolish ideas about learning - what it is, how it happens, what the goals are. That was","messageBody":"<div id=\"ygrps-yiv-281635594\">Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I didn&#39;t ask how old the child was, so averaged it to the middle of the span of public school here I live.   <br/>\n </span></blockquote>**************<br/>\n<br/>\nOlder kids may be more likely to have internalized schoolish ideas about learning - what it is, how it happens, what the goals are. That was true to an extent with Ray and while he was getting a lot of reassurances at our house that real life learning was different than school, there was some push-back from his bio-mom who wanted to see things like unit studies. Some of Ray&#39;s deschooling took longer because he was never entirely free from the pressure to do something that looked more like school, at least like a very cool, alternative school.<br/>\n<br/>\nNow and then someone will pull an older kid out of school who&#39;s doing okay academically but struggling socially or emotionally... and maybe there&#39;s another kid home, a younger kid who mom knows won&#39;t do well at school and she&#39;s gotten excited about unschooling. I&#39;m thinking of a few posts over the years. So the kid isn&#39;t sure about unschooling, isn&#39;t convinced it&#39;s as good as school, or is worried about how she&#39;s going to &quot;learn what she needs to know&quot; on her own. That seems to slow things down and even keep unschooling from ever really happening with that kid. <br/>\n<br/>\nThere was an article on NPR some time ago where employers seemed to agree that it took young adults a year to as much as two years to deschool - they didn&#39;t use that word, but one said &quot;get school out of their heads&quot; and another said &quot;start thinking like workers rather than students&quot; so deschooling seems apt.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":443923164,"authorName":"CASS KOTRBA","from":"&quot;CASS KOTRBA&quot; &lt;caskot@...&gt;","profile":"cass.kotrba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] how long is too long for deschooling?","postDate":"1361556449","msgId":70596,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTE3My1EUzE3MzhGMUQzRDcxM0MzNzRBMzgyODhDNEYwMEBwaHguZ2JsPg==","inReplyToHeader":"PDY1OTM4N0U1LTM4RDgtNENGRC1BOEEzLUZGMzcyOTJFMDM2MEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDY1OTM4N0U1LTM4RDgtNENGRC1BOEEzLUZGMzcyOTJFMDM2MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":70591,"nextInTopic":70598,"prevInTime":70595,"nextInTime":70597,"topicId":70590,"numMessagesInTopic":0,"msgSnippet":"-=-I know you will probably say it differs for each child, however, how long is too long to DEschool?-=- * Any other comments are very welcome! * I feel like","messageBody":"<div id=\"ygrps-yiv-1254583092\">-=-I know you will probably say it differs for each child, however, how long is too long to DEschool?-=-<br/>\n<br/>\n* Any other comments are very welcome! *<br/>\n<br/>\nI feel like the word &quot;deschooling&quot; covers a very broad area.  Our family has been at this for about 6 months and my husband and I have given up around 98% of our previous thinking about teaching and education.    The kids have become really curious about everything and are eager to learn, as long as they are not told they are learning and are choosing to do things because it&#39;s fun.  A few weeks ago my son, 8, was talking to a former classmate of his.  I heard him loudly proclaim &quot;Math!?  I HATE math!  Wait... is it math that I hate Mom?&quot;  After 6 months he is starting to forget.  (It was reading, BTW.)  I&#39;d say we are pretty comfortable in the area of de-SCHOOLING, i.e. giving up the idea that schoolish things are helpful/necessary to learning. <br/>\n<br/>\nBut the real meat of unschooling is in the relationships and changing attitudes about parenting and control.  I&#39;d say we&#39;ve got a ways to go in this area.  I attended school for 16 years and for me letting go of the &quot;school&quot; part feels nearly complete.  But I&#39;ve been a living member of the family I was born into and my culture for 40 years.  It seems to me that there are 2 categories under the &quot;deschooling&quot; heading, one for &quot;school stuff&quot; and another for the rest would be something like &quot;other damaging things I&#39;ve internalized over the years&quot;.   I think each of the 4 members of our family will be working on some of those issues for some time.  If we have resolved 95% of those issues within another 6 months that would be fabulous but it&#39;s too soon for me to know. <br/>\n<br/>\nSo to answer the question of how long does it take to deschool, maybe the answer is &quot;You will probably feel confident and comfortable with some aspects after about 6 months.  Other aspects will take longer, depending on the amount of trauma that needs to be healed and each person&#39;s ability to release toxic thoughts and feelings.&quot;  To the question &quot;How long is too long to deschool?&quot; perhaps the answer is &quot;If a family still has significant areas of concern after a year or so then they would benefit from digging a little deeper or engaging the services of a third party in an effort to figure out what is holding them back.&quot;  Some aspects of life become so internalized and &quot;off limits&quot; that it might take an individual a long time to feel safe enough to challenge those ingrained beliefs.  I wonder, though, if that time frame holds true for people who are not receiving the wise, useful, honest feedback that is available on this list.  Without that advice and feedback I imagine I would still be wallowing around deep in the muck, unsure of which way to go.  This list is a tremendous, undiluted tool.  Sometimes the advice feels like a glass of cold water being thrown in the face but that is useful when you are trying to wake someone up!  Some people prefer to stay asleep and they may never reap the maximum benefit.<br/>\n<br/>\n-Cass<br/>\n<br/>\n<blockquote><span title=\"qreply\">  ----- Original Message ----- <br/>\n  From: Sandra Dodd&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; <br/>\n  To: Always Learning&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; <br/>\n  Sent: Thursday, February 21, 2013 1:00 PM<br/>\n  Subject: [AlwaysLearning] how long is too long for deschooling?<br/>\n<br/>\n<br/>\n    <br/>\n  I got an interesting question and answered it as follows, but I thought it might be good to put out here for other input. I didn&#39;t ask how old the child was, so averaged it to the middle of the span of public school here I live. <br/>\n<br/>\n  Any other comments are very welcome! <br/>\n<br/>\n  ----------------------------<br/>\n<br/>\n  -=-I know you will probably say it differs for each child, however, how long is too long to DEschool?-=-<br/>\n<br/>\n  IF everyone in the family is working toward deschooling (the parents are paying attention to their own thoughts, actions and reactions and consciously trying to move toward understanding and supporting natural learning), then (depending on the age of the child and how damaged he might have been by previous pressures and traumas) six months to a year. But six months of the school year he was on before, if any. School&#39;s summer vacation doesn&#39;t count toward deschooling, because if a child was in school, or schooled at home on a school schedule, he&#39;s earned that time off. THEN deschooling can start.<br/>\n<br/>\n  What can stall deschooling out is if anyone is still in school, or if a parent is very schoolish, and critical of anything else. Then it might take two years.<br/>\n<br/>\n  ----------------------------<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":459359078,"authorName":"D. Regan","from":"&quot;D. Regan&quot; &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] how long is too long for deschooling?","postDate":"1361495215","msgId":70591,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBBQTM2REUyLTE4MzEtNDdGQi04ODJELTFCMzY2NjRGRDI0NkBiaWdwb25kLmNvbT4=","inReplyToHeader":"PDY1OTM4N0U1LTM4RDgtNENGRC1BOEEzLUZGMzcyOTJFMDM2MEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDY1OTM4N0U1LTM4RDgtNENGRC1BOEEzLUZGMzcyOTJFMDM2MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":70590,"nextInTopic":70596,"prevInTime":70590,"nextInTime":70592,"topicId":70590,"numMessagesInTopic":0,"msgSnippet":"I think of it like developing anything else.  Say, a tennis player has been playing since childhood, has got to the point where they can win lots of matches.","messageBody":"<div id=\"ygrps-yiv-1069318009\">I think of it like developing anything else.  Say, a tennis player has been playing since childhood, has got to the point where they can win lots of matches.  But then they start to notice a few niggles, injuries start to crop up, what they&#39;ve been doing doesn&#39;t seem to be so sustainable.  They investigate and find that others have had similar experiences.  A few others have gone before and found some other ways of playing that seem to be more flowing.  Injuries are fewer.<br/>\n<br/>\nSo they work on their technique.  At first it&#39;s all very awkward; it&#39;s as though they&#39;re playing with their other hand.  What seems to help most is being very mindful of what they&#39;re doing and understanding how the body works.  Lots of awareness of what they need to do and the difference from how how they used to do it without thinking.<br/>\n<br/>\nOver time, with lots of dedication, the new technique grows, gets to feel more comfortable, but it takes time and conscious effort.  There are the old injuries that need to be taken care of and not exacerbated, so lots of care and thought is needed.  If they weren&#39;t keen to develop this new technique they would give up because playing tennis with the old technique meant they could play at quite a high level.  It looked like success.  Only someone who had thought about the differences and wanted something else would persist with letting go of the old ways and starting over with new ones.<br/>\n<br/>\nThe process of changing moves from slowly trying to incorporate a new technique, with lots of the old one showing through, to later when it&#39;s hard to see that there ever was another way that person played.  it becomes more and more comfortable.<br/>\n<br/>\nHow long is too long till the new technique is the comfortable technique?  For people who want something different, the more they can be mindful of what they&#39;re doing, understand the new ways, take advice from others who have understanding of more sustainable techniques, the sooner they will be in a better place.  <br/>\n<br/>\nPeople can take as long as they like to deschool.  And it does take some time - a new technique cannot be developed overnight.  But children get older all the time.  The longer they take, the more they may regret having persisted with unhelpful ways.  Their children&#39;s childhoods won&#39;t wait.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 22/02/2013, at 7:00 AM, Sandra Dodd wrote:<br/>\n<br/>\n&gt; I got an interesting question and answered it as follows, but I thought it might be good to put out here for other input.  I didn&#39;t ask how old the child was, so averaged it to the middle of the span of public school here I live.   <br/>\n&gt; <br/>\n&gt; Any other comments are very welcome!  <br/>\n&gt; <br/>\n&gt; ----------------------------<br/>\n&gt; <br/>\n&gt; -=-I know you will probably say it differs for each child, however, how long is too long to DEschool?-=-<br/>\n&gt; <br/>\n&gt; IF everyone in the family is working toward deschooling (the parents are paying attention to their own thoughts, actions and reactions and consciously trying to move toward understanding and supporting natural learning), then (depending on the age of the child and how damaged he might have been by previous pressures and traumas) six months to a year.  But six months of the school year he was on before, if any.   School&#39;s summer vacation doesn&#39;t count toward deschooling, because if a child was in school, or schooled at home on a school schedule, he&#39;s earned that time off.  THEN deschooling can start.<br/>\n&gt; <br/>\n&gt; What can stall deschooling out is if anyone is still in school, or if a parent is very schoolish, and critical of anything else.  Then it might take two years.<br/>\n&gt; <br/>\n&gt; ----------------------------<br/>\n&gt; <br/>\n&gt; ------------------------------------<br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"how long is too long for deschooling?","postDate":"1361476806","msgId":70590,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1OTM4N0U1LTM4RDgtNENGRC1BOEEzLUZGMzcyOTJFMDM2MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":70591,"prevInTime":70589,"nextInTime":70591,"topicId":70590,"numMessagesInTopic":0,"msgSnippet":"I got an interesting question and answered it as follows, but I thought it might be good to put out here for other input.  I didn t ask how old the child was,","messageBody":"<div id=\"ygrps-yiv-756289612\">I got an interesting question and answered it as follows, but I thought it might be good to put out here for other input.  I didn&#39;t ask how old the child was, so averaged it to the middle of the span of public school here I live.   <br/>\n<br/>\nAny other comments are very welcome!  <br/>\n<br/>\n----------------------------<br/>\n<br/>\n-=-I know you will probably say it differs for each child, however, how long is too long to DEschool?-=-<br/>\n<br/>\nIF everyone in the family is working toward deschooling (the parents are paying attention to their own thoughts, actions and reactions and consciously trying to move toward understanding and supporting natural learning), then (depending on the age of the child and how damaged he might have been by previous pressures and traumas) six months to a year.  But six months of the school year he was on before, if any.   School&#39;s summer vacation doesn&#39;t count toward deschooling, because if a child was in school, or schooled at home on a school schedule, he&#39;s earned that time off.  THEN deschooling can start.<br/>\n<br/>\nWhat can stall deschooling out is if anyone is still in school, or if a parent is very schoolish, and critical of anything else.  Then it might take two years.<br/>\n<br/>\n----------------------------</div>","specialLinks":[]}],"prevTopicId":70589,"nextTopicId":70581}}