{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"brendaclaspell@aol.com","from":"brendaclaspell@...","replyTo":"LIST","senderId":"evdsQc6ToOUJhzPlcW_ZhARzIC2d0yBa8Yi-_LyZJpboRGJwbRNWmyKzJxlpca_hHsh707WDdui67pTi6g","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Foreskin","postDate":"997730848","msgId":23252,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5LjE5NmJjYjkxLjI4YTk4NDIwQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":23251,"nextInTime":23253,"topicId":23252,"numMessagesInTopic":0,"msgSnippet":"THE FATE OF THE FORESKIN The British Medical Journal December 24, 1949 It is a curious fact that one of the operations most commonly performed in this country","messageBody":"<div id=\"ygrps-yiv-96285659\">THE FATE OF THE FORESKIN<br/>\nThe British Medical Journal<br/>\nDecember 24, 1949<br/>\n<br/>\n<br/>\nIt is a curious fact that one of the operations most commonly performed in <br/>\nthis country is also accorded the least critical consideration.  In order to <br/>\nthis country is also accorded the least critical consideration.  In order to <br/>\ndecide whether a child&#39;s foreskin should be ablated, the normal anatomy and <br/>\nfunction of the structure at different ages should be understood; the danger <br/>\nof conserving the foreskin must then be weighed against the hazards of the <br/>\noperation, the mortality and the after-effects of which must be known.  The <br/>\nintention of this paper is to marshal the facts required by those concerned <br/>\nwith deciding the fate of the child&#39;s foreskin.<br/>\n-----<br/>\nMale circumcision, often associated with analogous sexual mutilations of the <br/>\nfemale, such as clitoric circumcision and infibulation, is practised over a <br/>\nwide area of the world by one-sixth the population.  Over the Near East, <br/>\npatchily thoughout tribal Africa, amongst the Moslem peoples of India and of <br/>\nSouth-East Asia, and amongst the Australasian aborigines circumcision has <br/>\nbeen regularly practised for as long as we can tell.  The earliest Egyptian <br/>\nnummies (2300 B.C.) were circumcised, and wall paintings to be seen in Egypt <br/>\nshow it was customary several thousand years earlier still.<br/>\n-----<br/>\nThe Younger Child<br/>\nThe prepuce is still in the course of developing at the time of birth, and <br/>\nthe fact that its separation is usually still incomplete renders the normal <br/>\nprepuce of the newborn non-retractable.  (It will be seen that preputial <br/>\n&#39;adhesions&#39; is an inapposite term to apply to the incompletely separated <br/>\nprepuce, suggesting as it does that the prepuce and glans were formerly <br/>\nseparate structures.)  The age at which complete separation of the prepuce <br/>\nwith full retractability spontaneously occurs, varies up to five years.<br/>\nFunction of the Prepuce<br/>\nIt is often stated that the prepuce is a vestigial structure devoid of <br/>\nfunction.  However, it seems to be no accident that during the years when in <br/>\nchild is incontinent the glans is completely clothed the the prepuce, for, <br/>\ndeprived of this protection, the glans becomes susceptible to injury from <br/>\ncontact with sodden clothes or diapers.  Meatal ulcer is almost confined to <br/>\ncircumcised male infants, and is only occasionally seen in the uncircumcised <br/>\nchild when the prepuce happens to be unusually lax and the glans consequently <br/>\nexposed.  <br/>\n<br/>\nAmongst the Western nations the circumcision of infants is a common practice <br/>\nonly with the English speaking peoples.  It is, for the most part, not the <br/>\ncustom in continental Europe or Scandinavia, or in South America.<br/>\n-----<br/>\nCircumcision, like any other operation, is subject to the risks of <br/>\nhaemorrhage and sepsis, and, where a general anaesthetic is employed, to the <br/>\nrisk of anaisthetic death.<br/>\n<br/>\nAbout 16 deaths in children under five years occur each year from <br/>\ncircumcision.  In most of the fatalities which have come to my notice death <br/>\nhas occurred for no apparent reason under anaesthesia, but haemorrhage and <br/>\ninfection have sometimes proved fatal.<br/>\n-----<br/>\nSince in the newborn infant the prepuce is nearly always non-retractable, <br/>\nremaining so generally for much of the first year at least, and since this <br/>\nnormal non-retractability is not due to tightness of the prepuce relative to <br/>\nthe glans but to incomplete separation of these two structures, it follows <br/>\nthat phimosis (which implies a pathological constriction of the prepuce) <br/>\ncannot properly be applied to the infant.  Further, the commonly performed <br/>\nmanipulation known as &#39;stretching the foreskin&#39; by forcibly opening sinus <br/>\nforceps inserted in the preputial orifice cannot be justified on anatomical <br/>\ngrounds, besides being painful and traumatizing.  In spite of the fact that <br/>\nthe preputial orifice often appears minute-the so-called pin-hole meatus-its <br/>\neffective lumen, when tested by noting whether or not a good stream of urine <br/>\nis passed is almost invariably found to be adequate.<br/>\n<br/>\nInfants with umbilical or inguinal hernia are particularly liable to suffer <br/>\ncircumcision on account of &#39;phimosis&#39;, but if this simple test is applied, <br/>\nrarely will any obstruction to the urinary flow be found present.<br/>\n<br/>\nOccasionally the preputial orifice is imperfectly related to the external <br/>\nmeatus, so that the urinary stream balloons out the subpreputial space; this <br/>\ncan be easily remedied by gently separating the prepuce from the glans in the <br/>\nregion of the meatus by means of a probe.  True phimosis cauring urinary <br/>\nobstruction is exceedingly rare: in the cases I have seen in which this <br/>\ndiagnosis has been made, simple separation of the prepuce has shown that <br/>\nthere was no constriction of the preputial tributable to operation rather <br/>\nthan to any pathological orifice.<br/>\n-----<br/>\nThrough ignorance of the anatomy of the prepuce in infancy, mothers and <br/>\nnurses are often instructed to draw the child&#39;s foreskin back regularly, on <br/>\nthe supposition that stretching of the foreskin is what is required.  I have <br/>\non three occasions seen young boys with a paraphimosis caused by mothers or <br/>\nnurses who have obediently carried out such instructions; for, although the <br/>\nsize of the prepuce does allow the glans to be delivered, the fit is often a <br/>\nclose one and slight swelling of the glans, such as may result from forceful <br/>\nefforts at retraction, may make its reduction difficult.<br/>\n-----<br/>\nSummary<br/>\nThe development of the prepuce is incomplete in the newborn male child, and <br/>\nseparation from the glans, rendering it retractable, does not usually occur <br/>\nuntil some time between 9 months and 3 years.  True phimosis is extremely <br/>\nrare in infancy.<br/>\n<br/>\nDuring the first year or two of life, when the infant is incontinent, the <br/>\nprepuce fulfils an essential function in protecting the glans.  Its removal <br/>\npredisposes to meatal ulceration.<br/>\n<br/>\nThe many and varied reasons commonly advanced for circumcising infants are <br/>\ncritically examined.  None are convincing.<br/>\n<br/>\nIn the light of these facts a conservative attitude towards the prepuce is <br/>\nproposed, and a routine for its hygiene is suggested.  If adopted this would <br/>\neliminate the vast majority of the tens of thousands of circumcision <br/>\noperations performed anually in this country, along with their yearly toll of <br/>\nsome 16 child deaths.<br/>\n-----<br/>\n<br/>\nDr. Douglas Gairdner, a British paediatrician, published this famous and now <br/>\nclassic paper in the British Medical Journal on December 24, 1949<br/>\nThis paper was found in The Compleat Mother magazine, Spring 2000<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":23151,"nextTopicId":23255}}