{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":345472131,"authorName":"stephanie","from":"&quot;stephanie&quot; &lt;dohertysn@...&gt;","profile":"sndoherty1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: responsibility to strangers?","postDate":"1265161683","msgId":50429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMDI4MzcxOTgtMTI2NTE2MjEyMy1jYXJkaHVfZGVjb21ib2J1bGF0b3JfYmxhY2tiZXJyeS5yaW0ubmV0LTc0NjY1ODE0Mi1AYmRhMzgwLmJpc3gucHJvZC5vbi5ibGFja2JlcnJ5Pg=="},"prevInTopic":50428,"nextInTopic":0,"prevInTime":50428,"nextInTime":50430,"topicId":50419,"numMessagesInTopic":0,"msgSnippet":"I recently took my kids to the State House to oppose homeschooling legislation and I knew that there was a possibility that a Representative might ask them","messageBody":"<div id=\"ygrps-yiv-776438076\">I recently took my kids to the State House to oppose homeschooling legislation and I knew that there was a possibility that a Representative might ask them questions, so I thought I should talk to them about . \r<br/>\n\r<br/>\n I asked my son what he would say if someone asked him what he was learning.  His answer was, &quot; I would tell them that kids weren&#39;t just born to learn.  Kids need to play and have fun with their friends.&quot;  \r<br/>\n\r<br/>\nAfter some discussion, I realized that he equated learning with sitting at a desk being bored.  He didn&#39;t think that what he did every day could possibly be learning.  \r<br/>\n\r<br/>\nHe would not be persuaded, so my husband and I decided it would be better for the cause if he didn&#39;t speak to any Reps.  \r<br/>\n\r<br/>\nI guess my point is, my son doesn&#39;t know how to talk about learning in the context of subjects.  I try to throw in a &quot;we&#39;re always learning&quot;, when someone asks.  I don&#39;t think most people are particularly interested.  And those who are will stick around long enough to get a taste of what he&#39;s learning by having a conversation with him.\r<br/>\n\r<br/>\nSteph \r<br/>\nSent from my BlackBerry® smartphone with Nextel Direct Connect</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: responsibility to strangers?","postDate":"1265160101","msgId":50428,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrYWozNStrZjNzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhrOWJzNCtybzA1QGVHcm91cHMuY29tPg=="},"prevInTopic":50421,"nextInTopic":50429,"prevInTime":50427,"nextInTime":50429,"topicId":50419,"numMessagesInTopic":0,"msgSnippet":"-=-She now loves to tell people that she is homeschooled and can do pretty much whatever she wants to . ... I m glad she is enjoying our lifestyle, but I see","messageBody":"<div id=\"ygrps-yiv-2001235074\">-=-She now loves to tell people that she is homeschooled and can &quot;do pretty much whatever she wants to&quot;. ... I&#39;m glad she is enjoying our lifestyle, but I see strangers looking alarmed, thinking, slacker mom, takes her kid out of school, doesn&#39;t &quot;teach&quot; her anything, and lets her do &quot;whatever she wants&quot;  Gasp. Shock.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My dilemma is do I ask her not to tell people this?-=-<br/>\n<br/>\n </span></blockquote>One thing about *most* adults not taking kids seriously is that most people, when they hear that, will think she&#39;s exaggerating.<br/>\n<br/>\nMy son said once, &quot;I just play video games all day!&quot; At that time, it was true, he had just gotten a new game and was very engrossed in it. The adult he said that to just laughed, and quietly said to me, &quot;Oh, yeah... I&#39;m *sure* that&#39;s ALL he does!&quot; as if to say, &quot;We know better!&quot; Because Seth didn&#39;t hear him, I laughed, too, as if I agreed.<br/>\n<br/>\nIf it had been someone I was more invested in, I might have explained more, but I was fine with this person going off with their misconception.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] responsibility to strangers?","postDate":"1265135755","msgId":50421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE3OUM4QURGLUJDQUQtNEMwMy05RDE2LTYwNUY3QUU0MzhBMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhrOWJzNCtybzA1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhrOWJzNCtybzA1QGVHcm91cHMuY29tPg=="},"prevInTopic":50419,"nextInTopic":50428,"prevInTime":50420,"nextInTime":50422,"topicId":50419,"numMessagesInTopic":0,"msgSnippet":"-=-My dilemma is do I ask her not to tell people this? I don t know how much it is my responsibility to not shock strangers with our unconventional lifestyle.","messageBody":"<div id=\"ygrps-yiv-1398693817\">-=-My dilemma is do I ask her not to tell people this? I don&#39;t know  <br/>\nhow much it is my responsibility to not shock strangers with our  <br/>\nunconventional lifestyle. Any input is welcome-=-<br/>\n<br/>\nI&#39;d ask her just to give a short answer, unless they ask more.  That&#39;s  <br/>\nalways courteous.<br/>\n<br/>\nIf she says &quot;I&#39;m homeschooled,&quot; that answers the question.  Any more  <br/>\ncould be rude, honestly.   No sense shocking strangers. &lt;g&gt;<br/>\n<br/>\nIf they ask more, she could say &quot;Ask my mom,&quot; or she could say &quot;We&#39;re  <br/>\nunschoolers.&quot;<br/>\n<br/>\nIf they ask more questions you could ask if they&#39;re familiar with John  <br/>\nHolt.  If they say no, you could furrow your brow and nod, as though  <br/>\nit&#39;s going to be just too difficult to explain.   That&#39;s what I do!<br/>\n<br/>\nOr I ask if they&#39;re familiar with the open classroom research from the  <br/>\nearly 1970&#39;s.  If they say yes, I&#39;ll talk as much as they want.  If  <br/>\nthey say no, I&#39;ll say that it&#39;s like that, but without the limitations  <br/>\nof a classroom.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":316621995,"authorName":"verde_mama","from":"&quot;verde_mama&quot; &lt;nikole_verde@...&gt;","profile":"verde_mama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"responsibility to strangers?","postDate":"1265119940","msgId":50419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrOWJzNCtybzA1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":50421,"prevInTime":50418,"nextInTime":50420,"topicId":50419,"numMessagesInTopic":0,"msgSnippet":"This is my first post here.  I have two daughters (6 1/2 and 3) and a babe due in April.  I have known I wanted to homeschool/unschool my children since before","messageBody":"<div id=\"ygrps-yiv-1463544209\">This is my first post here.  I have two daughters (6 1/2 and 3) and a babe due in April.  I have known I wanted to homeschool/unschool my children since before they were born, but having the headstrong child I do, my oldest wanted desparately to go to school.  I tried painting a realistic picture of school life for her without demonizing it.  She has a lot of friends who do go to school.  We agreed to homeschool for kindergarten, and if she still felt strongly about it she could go to 1st grade.  Well, she did, and loved it for about a month, then became restless, and without going into a lot of detail, I will say that 1st grade girls can be very mean and sneaky.  She got teased a lot, and was specifically told that one girl wouldn&#39;t be friends with her because she was white and had dreadlocks.  (she also made friends, and had some good experiences, but began really missing our unschooling lifestyle)<br/>\n<br/>\nSo, we have returned to unschooling since the middle of December, per her request.  We are all so much happier since she was able to see for herself what she felt she was missing out on by not going to school.  She now loves to tell people that she is homeschooled and can &quot;do pretty much whatever she wants to&quot;.  (I have not presented her with this idea, but I am very likely to say yes to her, as long as it&#39;s within our budget to do so) People who know her, know that she is happy, curious, and loving, and will just smile when she says this.  I&#39;m glad she is enjoying our lifestyle, but I see strangers looking alarmed, thinking, slacker mom, takes her kid out of school, doesn&#39;t &quot;teach&quot; her anything, and lets her do &quot;whatever she wants&quot;  Gasp. Shock.<br/>\n<br/>\nMy dilemma is do I ask her not to tell people this?  I don&#39;t know how much it is my responsibility to not shock strangers with our unconventional lifestyle.  Any input is welcome.  On the other hand, woohoo, &quot;letting&quot; my daughter go to school was a terribly difficult thing to do for me, but because of her intense motivation to do so, and then again being allowed to change her mind, we have found a place where my daughter (and I) can be happy and proud of where we are at.<br/>\n<br/>\nThanks in advance for your advice,<br/>\nNikole</div>","specialLinks":[]}],"prevTopicId":50403,"nextTopicId":50387}}