{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"APPLEKJF@xxx.xxx","from":"APPLEKJF@...","replyTo":"LIST","senderId":"oIhm4wh0ep-Yq0-PoGrEwgtEX-0MZhhcc7fFjJHs_YCBtBHWlsliePgLsNKsTMh34q4mjOESOw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Replying to everyone and adding stuff!","postDate":"928420746","msgId":260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40Mi4yNjAuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":259,"nextInTime":261,"topicId":260,"numMessagesInTopic":0,"msgSnippet":"Hello All!  I just spent the last hour or so reading all the post from the last 12 hours!  EGADS!  Lot s to reply to! First of all, thank you Lois and others","messageBody":"<div id=\"ygrps-yiv-1191610412\">Hello All!  I just spent the last hour or so reading all the post from the <br/>\nlast 12 hours!  EGADS!  Lot&#39;s to reply to!<br/>\n<br/>\nFirst of all, thank you Lois and others who are having a tremendous impact on <br/>\nhelping me relax and get my head together.  YES, you are helping, things are <br/>\nalready smoothing out a great deal here! THANK YOU THANK YOU!<br/>\n\tOn to the replies about the boys and their time usage.  There is no <br/>\nproblem seeing the learing going on incessantly with the 11 year old.  he is <br/>\nalways busy doing something very creative and of interest to himself.  His <br/>\naspirations are to be an astronaut!  And is content to follow whatever course <br/>\nneeded to get him there.  he is an entrepenuer of sorts, makes beady things <br/>\nand sells them.  Big StarWars nut he is, spends a good amount of time <br/>\ncreating new characters (drawing them) and developing new story lines.  <br/>\nBuilds all kinds of space stuff out of household junk.  He has designed a <br/>\ncouple of spacecrafts for a mission to Mars.  here is where I would love to <br/>\nfind him a mentor, because he is way past me with the space stuff already!  <br/>\nMy 9 year old is a different story... he loves to play baseball and other <br/>\ngames with another person or in a group.  Yes, he is my social one!  He loves <br/>\nNintendo, though he understands that there a limit to that.  he loves to play <br/>\nchess.  he is picking up art projects more and more.  he is just a tough one <br/>\nto figure out sometimes.  he has always been led by others, now he has to <br/>\ndetermine his own direction and sometimes struggles with it.  he would be <br/>\ncontent to do whatever I tell him....sheeesh.<br/>\n\tYes, my freind, I chose the books on the shelf (most of them).  And I <br/>\nseem to remember them asking me why I was buying them when we were at the <br/>\nstore.  DUH!!!!   Did I not get it.  They are all the modern and traditional <br/>\nclassics in literature.  And I do beleive they will someday have an interest. <br/>\n My 9 yo ds is reading Jeremy Thatcher, Dragon Hatcher right now.<br/>\n\tAbout video games... unless the boys make a move to do some expansion <br/>\nactivities, I end the Nintendo fest.  For me, there is a lot of other <br/>\ncreative things they can be doing.  I did let them go for over a month with <br/>\nplaying Zelda everday, and I will tell you why.   They learned to sew by <br/>\nsewing Link costumes, they learned to use power tools by building swords and <br/>\nshields out of wood.  They used there imaginations to find things around the <br/>\nhouse and in thrift stores that would serve as the pieces parts in the games <br/>\n(rupies, coins, fairies, etc.).  They developed a monetary system from things <br/>\nfound in nature (gravel, ash, buckeyes, etc.).  They drew a map of the <br/>\nkingdoms and them went outside to set up the kingdoms in the yard and the <br/>\nwoods.  11 yr o Ds picked up the recorder (flutaphone) and translated all the <br/>\nmusic in the game for the recorder in written notes.  And of course they role <br/>\nplayed until they were exhausted!  this my idea of a good video game.  If <br/>\nthey don&#39;t expand on it, we move on.  It is amazing how it did turn all of <br/>\nthere attention away fom playing the game and  onto living!<br/>\nNow to the families putting in their views and quizzes.  My family would <br/>\nnever do that because they know they would catch all kinds of crap from me, <br/>\npossibly in the form of not seeing thier dear grandchildren again.  I am just <br/>\ntoo unpredicatble to mess with.  MIL does not quiz, she just asks how school <br/>\nis going, and the kids say fine.  She butts out of our business, always has.  <br/>\nMy mom, bless her heart, just said OK, if that is what you want to do... she <br/>\ndoes support it now becuase of how well the boys act towards her now and <br/>\nbecause she and I have had the opportunity to become a lot closer because of <br/>\nhomeschooling.  She even helps me when I get tripped up with math concepts <br/>\nand how to teach them.  This is the most interest I have ever seen her take <br/>\nin something I am doing.  She and I will sit there and and work on the latest <br/>\nmath manipulative, math problems, chess game or whatever.  When I get <br/>\nsomething new, I go straight to my mom&#39;s and we try it out!   its either that <br/>\nor she will never see us.  We have made a strong effort to include her in on <br/>\nour stuff and I think she is really enjoying all this.  we never used to have <br/>\nsuch interesting conversations before.  Bottom line, i think she sees how <br/>\nthis has changed me and made me a better person, how could she not support <br/>\nthat?  <br/>\n\tDH told me last night that his brothers had a few things to say about <br/>\nwhat we are doing when he visited them the night before.  they don&#39;t support <br/>\nwhat we are doing and worry about socialization.  Dh and I both bursted out <br/>\nlaughing when he told me this.  We have kids over every weekend, all weekend, <br/>\nand get together with other hs&#39;ers often.  How silly.  I was kind of miffed <br/>\nthat they said this to my husband, but Dh reassured me by saying that he <br/>\nconsidered the source, both bil&#39;s still live at home with mommy (both in the <br/>\n30&#39;s range), neither has ever been able to have a succesful fullfilling <br/>\nrelationship (women are meat to be taken advantage of) nor do they appear to <br/>\nknow what that is.  Both put their own value on how much money they can make. <br/>\n Both have been heavy partyers for long past the typical juvenile period of <br/>\nsilliness.  Neither one had done well in school.  there appears to be no real <br/>\nsubstance to them.  But they know better than to ever say anything to me <br/>\nabout what we are doing, again, I am too unpredictable.  I have a wonderful <br/>\nexample of this, please bear with me...<br/>\n\tOne Thanksgiving we were all sitting at the dinner table and bil #2 <br/>\nstarts talking about a &quot;fat chick&quot; at bar that was hitting on bil #1 and they <br/>\nbegin to laugh and carry on.  some background here, i am overweight by about <br/>\n60 pounds... I just lost 23 pounds this year.  Anyway, I put down my utensils <br/>\nand begin to giggle.  And they all looked at me in that &quot;uh, oh, she going to <br/>\ndo something way&quot;.  And I turned to bil #2 and say, &quot; I don&#39;t think that just <br/>\nbecause someone is overweight they have no value and intelligence and should <br/>\nbe considered less than human and not worthy of being socialized with.&quot; (all <br/>\nthe while both bil&#39;s are sitting there with their Barbie look alike <br/>\ngirlfriends who shouldn&#39;t be at holiday gathering unless they are engaged and <br/>\ncommitted, just my opinion) He began to stutter and sputter, then I chimed in <br/>\nagain &quot; Boy, you must think I am a fat pig!!!&quot;  And I picked up my fork and <br/>\nbegan to eat again, you know, as fat people should not be doing.  They all <br/>\nhung their heads and that was about it for the conversation that <br/>\nThanksgiving.  Hahahahahaha, you just never know what I will do, it is best <br/>\nto watch what you say and keep your mouth shut if you are in my family, lol.  <br/>\nI love it!  You know, they used to talk to me more when I was thin, egads!<br/>\n\tHey we are coming through Pittsburg on July 2 and again on the 5th.  <br/>\nwe could stop in too!!!!!!!!  We are going to Gettysburg for the Civil War <br/>\nre-enactments over the July 4th holiday!  we will be camping with another HS <br/>\nfamily from Cleveland.<br/>\n<br/>\nOk, that is enough for now,hahahaha. Sorry for the long post!  But it is <br/>\nsmall if you consider I am replying to 75 e-mails, lol.  So great ot hear <br/>\nfrom all of you and your experiences.  this is truly a God send, this little <br/>\ncommunity.  When you need, he provides.<br/>\n<br/>\nKim from Ohio</div>","specialLinks":[]}],"prevTopicId":28,"nextTopicId":171}}