{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"John O. Andersen","from":"&quot;John O. Andersen&quot; &lt;andersen@...","replyTo":"LIST","senderId":"Y7eZJfJGoQ2MuoYRUg0J7gjd6pYJAfiLHwGh9y_qjyaWUz9gzc3rG3kf0TLTk_Vq7lSoO43h1hi-b0AY_2as1Yfjkn9Rs56X6t2f9DdAgCtVQg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Age of Reason in France","postDate":"943622745","msgId":4862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMTUuNDg2Mi45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4861,"nextInTime":4863,"topicId":4862,"numMessagesInTopic":0,"msgSnippet":"Hey all, If you want to dig into some fascinating history, Time-Life Books has a What Life Was Like series.  The other day I picked up a volume published ","messageBody":"<div id=\"ygrps-yiv-1431219701\">Hey all,<br/>\n<br/>\nIf you want to dig into some fascinating history, Time-Life Books has a<br/>\n&quot;What Life Was Like&quot; series.  The other day I picked up a volume published<br/>\nthis year called:  &quot;What Life Was Like During the Age of Reason: France AD<br/>\n1660-1800.&quot;<br/>\n<br/>\nAt that time, France was the most powerful nation in Europe and arguably the<br/>\nworld.  There is a large section on the Sun King (Louis the XIV) who reigned<br/>\nfor 72 years!  The book also covers the other royals, great thinkers,<br/>\nartists, authors, musicians, etc. during that period.  The book traces the<br/>\nevents which led to the French Revolution and finishes with the rule of<br/>\nNapolean Bonaparte.<br/>\n<br/>\nHere are a few entertaining passages from the book:<br/>\n<br/>\n On the adolescent king, Louis the XV:<br/>\n<br/>\n&quot;The king&#39;s innermost thoughts and feelings might stay secret, but nothing<br/>\nelse about him did.  Virtually every aspect of his daily life was a public<br/>\nspectacle, conducted under his courtiers&#39; fascinated gaze.  On some<br/>\noccasions even the contents of his chamber pot became a subject for public<br/>\ndiscussion.  The whole court, for instance, worried when their young<br/>\nsovereign suffered an unpleasant bout of constipation.  Everyone applauded<br/>\nwhen the royal physician announced that he had administered a laxative,<br/>\nwhich, he declared, had caused &quot;a charming evacuation.&quot; pg. 27.<br/>\n<br/>\nOn the ritual of the king going to bed:<br/>\n(Note: this may sound ridiculous to us in 1999, but I&#39;d be willing to bet<br/>\nthat some of the ways people court favors and &quot;get ahead&quot; today will sound<br/>\njust as ridiculous to future generations.)<br/>\n<br/>\n&quot;At night, the last act in the ritual drama of the royal day, the &#39;coucher,&#39;<br/>\nwas played out when His Majesty retired--officially, though not always<br/>\nliterally--for the night.  As in the morning, access to the State Bedchamber<br/>\nwas a heatedly sought-after privilege.  Inside the room itself, lifelong<br/>\nenmities could be kindled between those who jockeyed for positions that<br/>\nwould bring them closest to the person of the king.  But only princes of the<br/>\nblood and the holders of a few exalted offices--the Grand Chamberlain, the<br/>\nFirst Gentleman of the Bedchamber, or the Grand Master of the Wardrobe--were<br/>\ndeemed worthy to hand the monarch his nightclothes.<br/>\n<br/>\nNo prize was more avidly pursued than the right to hold the royal<br/>\ncandlestick and light the king&#39;s way to bed.  When everyone else was shooed<br/>\nout of the State Bedchamber, only the recipient of this honor--chosen<br/>\nnightly--was allowed to remain.  A shrewd courtier could use this moment of<br/>\nunprecedented intimacy to make an impression, stand out from the crowd, and<br/>\ningratiate himself with his royal master.  It was an assignment coveted by<br/>\nany ambitious nobleman, for the king granted favors only to people he knew.&quot;<br/>\npg. 28-29<br/>\n<br/>\nJohn<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://members.xoom.com/joandersen\">http://members.xoom.com/joandersen</a></div>","specialLinks":[]}],"prevTopicId":4861,"nextTopicId":4868}}