{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":77522235,"authorName":"Julie Bogart","from":"Julie Bogart &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Limiting food and TV","postDate":"1086358482","msgId":95090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2MTI3MjQxLUI2MzEtMTFEOC05QjdBLTAwMEE5NUYwRjU2QUBicmF2ZXdyaXRlci5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":95089,"nextInTime":95091,"topicId":95090,"numMessagesInTopic":0,"msgSnippet":"After reading the posts on this thread, I wanted to offer a couple of experiences for consideration. I grew up with a nutrition conscious mother and was raised","messageBody":"<div id=\"ygrps-yiv-1365589195\">After reading the posts on this thread, I wanted to offer a couple of <br/>\nexperiences for consideration.<br/>\n<br/>\nI grew up with a nutrition conscious mother and was raised vegetarian <br/>\nfor 10 years. I went ten years without eating any sugar, too. My mother <br/>\nnever required us to eat her way. She simply shared information she <br/>\nfound with me. I had asthma and so did my brother. We both stopped <br/>\nhaving asthma problems when she changed our eating habits in the home. <br/>\nI felt different eating correctly so I took her values to heart.<br/>\n<br/>\nIf I went to the ice cream shop with a friend, I got a banana. My <br/>\nfriends thought I was weird.<br/>\n<br/>\nI believed that eating right would ensure good health and was morally <br/>\nright.<br/>\n<br/>\nMy parents split up at the end of high school. My brother, sister and I <br/>\nall &quot;fell off the nutrition wagon&quot; at that point. I continued to not <br/>\neat meat for four more years, but I did stop worrying about <br/>\npreservatives and additives in everything and ate some sugar. My sibs <br/>\nstarted smoking, eating junk food, drinking and my brother&#39;s asthma <br/>\nreturned full force.<br/>\n<br/>\nA broken home had more to do with our eating habits than all those <br/>\nyears of nutritional teaching.<br/>\n<br/>\nFast forward.<br/>\n<br/>\nAs an adult, I have resisted that level of nutrition consciousness. <br/>\nI&#39;ve known too many nutritional anorexics, and too many nutty adults <br/>\nwho live life as though food were the central issue for living. And <br/>\namazingly, so often the nutrition conscious are the ones who talk about <br/>\nall their health issues while others at McDonald&#39;s seem blissfully <br/>\nunaware...<br/>\n<br/>\nI can&#39;t afford the organic lifestyle. So I do the best I can with the <br/>\nbasics. And you know what? We&#39;re healthy. We eat supermarket foods and <br/>\nI cook real stuff.<br/>\n<br/>\nMy kids eat more junk than I did growing up, but they don&#39;t have asthma <br/>\neither. And they don&#39;t prefer junk to my cooking.<br/>\n<br/>\nWhat I didn&#39;t want to reproduce in my family from growing up was the <br/>\nidea that there is a standard or an ideal that ensures health and <br/>\nwholeness. My family had idealized eating.<br/>\n<br/>\nInstead, food is just a normal part of our lives and a tasty one when I <br/>\ntake the time to make food we love. We talk about nutrition the same <br/>\nway we talk about the books we read or the purchases we want to make. <br/>\nIt&#39;s not enshrined as the key to happiness and health.<br/>\n<br/>\nAnd as far as advertising goes... my kids watch cartoons solid for <br/>\nthree hours every Saturday. I can&#39;t think of the last time they asked <br/>\nme to buy anything based on advertising. I know it probably happens in <br/>\nsome homes, but they just don&#39;t feel deprived...<br/>\n<br/>\nMy two cents,<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":95013,"nextTopicId":95092}}