{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":132800757,"authorName":"encadia@aol.com","from":"encadia@...","profile":"lasvegashillgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I&#39;m Back/long","postDate":"1042406038","msgId":54565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhkLjIyNGYwZDkzLjJiNTMzNDk2QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":54564,"nextInTime":54566,"topicId":54565,"numMessagesInTopic":0,"msgSnippet":"Hello to all! I am back  and it feels like coming home. Put son back in the last month and a half of school last year. New school, it was great. Responsive","messageBody":"<div id=\"ygrps-yiv-450781772\">Hello to all!<br/>\n<br/>\nI am back  and it feels like coming home.<br/>\nPut son back in the last month and a half of school last year.<br/>\nNew school, it was great. <br/>\nResponsive special ed. teacher, and was open to everything I<br/>\ncould offer.  (this was the honeymoon)<br/>\nMy son went half a day, the comments were great,<br/>\nso polite, eagar to learn, he was this teachers total<br/>\ndelight. No problem that he has learning disablitlies.<br/>\nAs long as he was doing well, he would start a full day<br/>\nof the school year this fall. <br/>\nWhen school started this fall: Day one, they integrated him<br/>\ninto the sixth grade, gave him a Para who knew nothing<br/>\nabout him. Totally amazed they gave him 6th grade books<br/>\nand he was no where near that complex of materials, much<br/>\nless able to read them.<br/>\n<br/>\n The next day I called a IEP meeting, the tables<br/>\nturned everyone showed up for this meeting! and I was<br/>\ntold how mistaken I was about him being at school for<br/>\na full day. Hmm. I told them they better look at the paperwork that <br/>\ndocumented it all in writing.<br/>\nThe assit. superindendent, thought maybe in the afternoons<br/>\nI could teach him the &quot;little things&quot; I had been teaching <br/>\nprior. Well, now, that was HOMESCHOOLING! And I worked my hind end off!<br/>\n<br/>\nAnyway, I can see the set up now, I had the feeling he was being<br/>\nset up. <br/>\nHe was taught sitting in the hallways on the floor, or in the library,<br/>\nwhen the sixth grade teacher couldn&#39;t have him in there. Actually, it came <br/>\nout<br/>\nthat he was only in the room for lunch selection.<br/>\nHe was removed without my knowledge from classes that he spent<br/>\nwith the regular 6th graders. Science, social studies etc. I was assured that<br/>\nhe work would be modified. They didn&#39;t do this.<br/>\nThe full time Para that was being paid strictly for him, was off helping<br/>\nother children out of the room, in another part of the school. One day we <br/>\nwere<br/>\ntalking, and she told me she had to go and help her other student.<br/>\nFound out no one helped him read the lunch selections, so instead<br/>\nof the lunch he thought he wanted and was picking, he got what<br/>\nhe wasn&#39;t wanting for lunch. again, where was this Para?<br/>\n<br/>\nEnough, so I just gave all of you a confirmation of whats going on<br/>\nin the public school system for a child with learning needs  for those of you <br/>\nthat may be entertaing the thought.<br/>\n<br/>\nAll in all, it was a good break, he insisted on going back, and I needed to <br/>\nre-group.<br/>\n<br/>\nThe assist superintendent, also the homeschooling monitor, &quot;is very willing <br/>\nto provide<br/>\nme with the intent to homeschool papers, and shared with me that I didn&#39;t <br/>\nhave<br/>\nto worry about my son not testing well, as she knows him and knows he doesn&#39;t<br/>\ntest well. She would never insist that he be returned back to public school.&quot;<br/>\n<br/>\nHey all, good to be back, sorry so long.<br/>\n<br/>\nLinda<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":54243,"nextTopicId":54567}}