{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Letting go of overcontrol","postDate":"1049153633","msgId":62542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExMy4yMTJlODViYS4yYmJhMmE2MUBhb2wuY29tPg=="},"prevInTopic":62532,"nextInTopic":0,"prevInTime":62541,"nextInTime":62543,"topicId":62524,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/31/03 1:17:36 PM Eastern Standard Time, ... I always try to make it a win-win situation.  We talk things out so that everyone gets what","messageBody":"<div id=\"ygrps-yiv-1904543476\">In a message dated 3/31/03 1:17:36 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I then erased and redid our conversation. Told him about my plan. Told him <br/>\n&gt; what time I want to leave. This guy already has cleaned his room, made is <br/>\n&gt; own breakfast and now is happily watching part of a video. He has been <br/>\n&gt; awake for 30 minutes. He said watching part of a video was OK. Maturity <br/>\n&gt; conbined with  honesty of my plans.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I always try to make it a win-win situation.  We talk things out so that <br/>\neveryone gets what they want.  There is usually compromise on both sides but <br/>\neveryone is happy in the end.  You did a great job with this one.<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":108173680,"authorName":"Sorcha","from":"&quot;Sorcha&quot; &lt;sorcha-aisling@...&gt;","profile":"sorcha_aisling","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Letting go of overcontrol","postDate":"1049140832","msgId":62532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMyZjdjMCQzMzI3YzBlMCRiN2ViMTg0MUB5b3VyNmtyNHp4bGQ5MD4=","inReplyToHeader":"PDUuMS4wLjE0LjAuMjAwMzAzMzExMTIxMTQuMDBiZDEwODBAbWFpbC5keWtlbWEubmV0Pg=="},"prevInTopic":62530,"nextInTopic":62542,"prevInTime":62531,"nextInTime":62533,"topicId":62524,"numMessagesInTopic":0,"msgSnippet":"Guns were a huge issue for me.  I told my husband before we were married that I would divorce him if he ever brought a gun into our home.  It took three or","messageBody":"<div id=\"ygrps-yiv-375544503\">Guns were a huge issue for me.  I told my husband before we were married<br/>\nthat I would divorce him if he ever brought a gun into our home.  It<br/>\ntook three or four years of marriage before I said, &quot;You know, if you<br/>\nbrought a gun into the home, I wouldn&#39;t actually divorce you.&quot;  I had a<br/>\nlump in my throat just saying it.  <br/>\n <br/>\nI&#39;m the one in the family who can&#39;t handle violence in movies.  One<br/>\nnight my parents were over and they watched one of those Star Wars<br/>\nmovies with my husband and the kids while I stayed down the hall<br/>\nreading.  I watched Lord of the Rings with my husband and it was<br/>\nexcruciating for me.  He asked me if I liked it and all I could think to<br/>\nsay was that it certainly had a lot of screaming in it.  <br/>\n <br/>\nBut I&#39;m rethinking my stance on children and guns.  They should see guns<br/>\nand know what they are.  I mean, those kids who find guns and<br/>\naccidentally shoot their parents are probably kids who were never told<br/>\nwhat guns were and had no idea what would happen.  Also, it&#39;s harder to<br/>\nprotect children from the reality of violence when there&#39;s a war going<br/>\non.  I could theoretically keep all forms of media that might contain<br/>\nwar information out of our home, but how would my kids feel about that<br/>\nas adults?  Can you imagine being an adult and not knowing you grew up<br/>\nduring a time of war?  So I let my older son sit on my lap while I&#39;m<br/>\nchecking the news online and I try to answer his questions as well as I<br/>\ncan. I find that I&#39;m more sensitive about it than he is.  He takes it<br/>\nseriously but doesn&#39;t cry afterwards like I do.  And he appreciates<br/>\nknowing what&#39;s going on in the world he lives in.  <br/>\n <br/>\nI don&#39;t think it&#39;s fair to let children grow up not knowing anything<br/>\nabout the world they&#39;re going to be living in, and one of the things<br/>\nthis world has is violence.  That&#39;s the point behind fairy tales - to<br/>\nlet children know, gently, that in addition to sweet old grandmothers,<br/>\nthis world also contains big bad wolves.<br/>\n <br/>\nSorcha<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":50009731,"authorName":"Heidi Wordhouse-Dykema","from":"Heidi Wordhouse-Dykema &lt;heidi@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Letting go of overcontrol","postDate":"1049139161","msgId":62530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjAuMjAwMzAzMzExMTIxMTQuMDBiZDEwODBAbWFpbC5keWtlbWEubmV0Pg==","inReplyToHeader":"PDI4OTA0OTcuMTA0OTEzNDA5NTUwOC5KYXZhTWFpbC5ub2JvZHlAYmVydC5wc3AucGFzLmVhcnRobGkgbmsubmV0Pg=="},"prevInTopic":62524,"nextInTopic":62532,"prevInTime":62529,"nextInTime":62531,"topicId":62524,"numMessagesInTopic":0,"msgSnippet":"... Hooray for YOU! What an amazing feeling that must have been! I noticed that one of your issues was the whole violence/gunplay thing. Me too. I was a mum","messageBody":"<div id=\"ygrps-yiv-561080194\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;I can catch myself a bit sooner now. In the past I would have stuck with <br/>\n&gt;my way and we would have had a disrespectful meltdowny day. Yuck.<br/>\n<br/>\n </span></blockquote>Hooray for YOU!<br/>\nWhat an amazing feeling that must have been!<br/>\n<br/>\nI noticed that one of your issues was the whole violence/gunplay thing. Me <br/>\ntoo.<br/>\nI was a mum that didn&#39;t allow squirt guns, movies with guns, cops and <br/>\nrobbers games, etc, etc. I&#39;d promised there&#39;d *never* be a gun in my <br/>\nhome!  We are a pacifist family, by gum!  I didn&#39;t even like him picking up <br/>\na stick and pretending it was a gun!  It&#39;s been an evolution, but today&#39;s <br/>\nds&#39;s 14th birthday, and he&#39;ll be getting a fairly high-powered pellet gun <br/>\nto celebrate (complete with targets, shot, protective carrycase, <br/>\netc.)  He&#39;s so sure he&#39;d never get one, that he didn&#39;t even ask for it on <br/>\nhis birthday list, even though he talks about them frequently.  ...he&#39;s <br/>\nfascinated by guns.  Buying that gun marked the breaking of one of my <br/>\nbiggest barriers...  we even went to the local shooting range to get safety <br/>\nand shooting lessons; ds, dd... and me.  (and I was GOOD at it! <br/>\n(grin))  (we all were pretty good, ds the best mark.)<br/>\nHeidiWD  (still pacifist, but a darn good mark at the same time!)<br/>\n<br/>\n<br/>\n<br/>\n&quot;I prefer a person who will burn the flag and wrap themselves in the <br/>\nconstitution to a person who will burn the constitution and wrap themselves <br/>\nin the flag&quot; --- Molly Ivins</div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","profile":"mfhickman95616","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Letting go of overcontrol","postDate":"1049134118","msgId":62524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4OTA0OTcuMTA0OTEzNDA5NTUwOC5KYXZhTWFpbC5ub2JvZHlAYmVydC5wc3AucGFzLmVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":62530,"prevInTime":62523,"nextInTime":62525,"topicId":62524,"numMessagesInTopic":0,"msgSnippet":"Hello, I spent this am reading 3 digests here. I kept thinking how I felt letting go of control. Unsure, failing to parent right . Very scared of dooming my","messageBody":"<div id=\"ygrps-yiv-201610949\">Hello,<br/>\n<br/>\nI spent this am reading 3 digests here. I kept thinking how I felt letting go of control. Unsure, failing to parent &quot;right&quot;. Very scared of dooming my family. Academic unschooling came very easy, it was the rest of the lifestyle shifts. Rules vs. principles. Respect vs. disrespect, being an ally not an enemy. My biggest issues have been food: healthy vs. unhealthy and TV/computer use and guns/violent play. Well I have come along way and still I blow it. My parental &quot;authority&quot; kicks in and I make bad choices.<br/>\n<br/>\nFrom 30 minutes ago. Middle son 6 wakes up, goes straight to his room to tidy. (we had a family meeting last night and mutally decided the house needs more help staying clean and we are trying to all help at least 20 minutes each day). He proudly came out, asked me to see his made bed, play rug, teddy on pillow and Harry Potter 4 sitting on his bed for tonight&#39;s stories. He asked for help on a really messy corner. <br/>\n<br/>\nHe then asked if he could watch TV. I said no, not now but tonight would be good. He got mad, that beginning to blow state this kid gets. See I have another agenda. I want to go out to a Native American festival at 11 am. I know this guy. He likes to  finish what he starts. I put together the entire meltdown when I want to leave, harried feeling that happens when the TV goes on first thing in the morning. I am trying to have my way. I took a shower and thought about all the stories recently on the topic of control. Hum...I then erased and redid our conversation. Told him about my plan. Told him what time I want to leave. This guy already has cleaned his room, made is own breakfast and now is happily watching part of a video. He has been awake for 30 minutes. He said watching part of a video was OK. Maturity conbined with  honesty of my plans.<br/>\n<br/>\n Riley and Tessa really want to watch TV alot. Every day they want it on. gulp. my deal. I&#39;ll finish here and garden some outside. That way my needs will also get met. Tessa will probably join me outside. I hope we make it to the festival. Such issues we bring from our past. So many unnecessary worries stuck in my brain. I thought I was over my overcontrol, yet here it is creeping back into my life. Over the same worries I invented when I started this journey 9 years ago. <br/>\n<br/>\nI can catch myself a bit sooner now. In the past I would have stuck with my way and we would have had a disrespectful meltdowny day. Yuck.<br/>\n<br/>\nMary H.  off to the garden while Rudoulf and the misfit toys save Christmas.</div>","specialLinks":[]}],"prevTopicId":62534,"nextTopicId":62546}}