{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"susan","from":"susan &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"4s2JlR2X8hts1emI_RDl1sFJGTp3Pu0-ZudUpSx7Hm_vUuImjknmH6nyCnLDpbBb4vEQctXZmolYHRx-VnJ5ZN8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Math questions/unschooling-def.","postDate":"954947068","msgId":7804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4RUI1NTk3LkMyQTNBRDc3QGZsYXNoLm5ldD4=","referencesHeader":"PGRkLjJjOGMyMGEuMjYxY2VhYTRAYW9sLmNvbT4="},"prevInTopic":7797,"nextInTopic":0,"prevInTime":7803,"nextInTime":7805,"topicId":7797,"numMessagesInTopic":0,"msgSnippet":"... i think this is only human - it s the rare person who glides right on thrrough and that having an unschool attitude is an overall thing not a moment to","messageBody":"<div id=\"ygrps-yiv-556784796\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The only thing I would add is that some days my &quot;attitude&quot; is better than<br/>\n&gt; others -- sometimes I am a very relaxed hser, some days not so relaxed, some<br/>\n&gt; days it all works together, some days not.<br/>\n<br/>\n </span></blockquote>i think this is only human - it&#39;s the rare person who glides right on<br/>\nthrrough&lt;g&gt; and that having an unschool attitude is an overall thing not a<br/>\nmoment to moment or even a day to day thing.  i don&#39;t believe perfection is part<br/>\nof it.  i think striving for something other than this flux gives a false<br/>\nimpression and creates stress.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Cook or text books -- they are all books to me -- I agree.  But, no matter<br/>\n&gt; how _I_ do it, if I want to call it unschooling (and sometimes I do not<br/>\n&gt; because I think it just confuses some people when they really only want to<br/>\n&gt; have a pretty surface-y conversation anyway -- like, how&#39;s the hsing going?<br/>\n&gt; great.  OK, see you.) on any given day, then I feel free to.<br/>\n<br/>\n </span></blockquote>it&#39;s funny i tell people i&#39;m an unschooler so they won&#39;t bug me:)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t feel I have to eschew text or cook books or fit anyone else&#39;s<br/>\n&gt; definition in order to &quot;qualify.&quot;  But that&#39;s me.<br/>\n<br/>\n </span></blockquote>i was just curious because you said in your other post that some people would<br/>\nnot consider textbooks unschooling.  i was just trying to grasp to whole notion<br/>\nof what some believe to &#39;qualify&#39; - where the line was drawn for them.  it<br/>\ncertainly has no really baring on my personal beliefs just helps me understand<br/>\nanother&#39;s beliefs, something i enjoy doing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Some people question a lot of things that I don&#39;t.  Whether &quot;subjects&quot; should<br/>\n&gt; be taught at all, whether &quot;classes&quot; should be taken, what approach those<br/>\n&gt; classes should take, what books are informative and what are too textbook-y,<br/>\n&gt; etc.  My day-to-day answer to these and other questions is to do what works.<br/>\n&gt; There is not a big philosophical overlay.<br/>\n<br/>\n </span></blockquote>for me it&#39;s helpful to have a philosophy in place and use it as a sort of spring<br/>\nboard but i try and stay clear of a dogmatic or a purist type stance because it<br/>\nbecome rigid and exclusive which for me is not unschooling.  kind of middle of<br/>\nthe road thing:)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For instance, some people say they have been damaged by their school<br/>\n&gt; experience.  Personally, I don&#39;t feel that way.  But I can see how it can<br/>\n&gt; happen.  But that&#39;s not where I am starting from and so I don&#39;t have some of<br/>\n&gt; the negative reactions to school-y stuff that some people have.  They are<br/>\n&gt; right for them and, I think, we are doing right for us.<br/>\n<br/>\n </span></blockquote>my childhood is a bit of a blur so i can&#39;t really say that it was bad,  but i<br/>\ncan say i don&#39;t unschool because i&#39;m against something but i unschool because<br/>\ni&#39;m for something.    i was fortunate enough to have never lost my thirst for<br/>\nknowledge and love getting it where ever i can - i pick peoples brains because i<br/>\nfeel i&#39;m ever changing always on the move and if someone else values it it must<br/>\nhave some value whether it&#39;s clear to me or not:)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Many, many, many shades of grey (or is it gray? :) ) and they are all OK with<br/>\n&gt; me.  And I think if you want to call yourself an unschooler and you are any<br/>\n&gt; of those shades, good for you, call yourself whatever you want.<br/>\n<br/>\n </span></blockquote>i would assume that everyone one this list calls themselves an unschooler (at<br/>\nleast to themselves) or why would they subscribe.  but to be honest calling<br/>\nmyself anything has never been one of my issues.   using the label &#39;unschooling&#39;<br/>\nis merely for the sake of brevity and a way to find some common ground (or not:)<br/>\nwith other people.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe it&#39;s something that is too individual to actually define for everyone.<br/>\n&gt; Maybe we can only define it for ourselves.<br/>\n<br/>\n&gt; Take care.<br/>\n&gt;<br/>\n&gt; Nance<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>this is probably true but i really enjoy listening to other people&#39;s take on<br/>\nthings,  so i really appreciate you taking the time to post your thoughts.  i<br/>\nlearn a lot from this sort of thing and wanted to follow up on some curious<br/>\npoints you raised.<br/>\n<br/>\nthanks again<br/>\n-susan<br/>\naustin,tx<br/>\n&#39;unity through diversity&#39;</div>","specialLinks":[]},{"userId":0,"authorName":"susan","from":"susan &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"qrNqTnnb3wYDVYv-D2OVptVp74by1HMbxwrTFtLscuJPyN8ZCTFmg7n3tDYSYt8SCuOG-_pw0c7BjMHj6J4YHTU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Math questions/unschooling-def.","postDate":"954938654","msgId":7797,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4RUIzNEQ0LkY1ODM0ODhAZmxhc2gubmV0Pg==","referencesHeader":"PGExLjM5ODlhYjcuMjYxY2M1MzFAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":7804,"prevInTime":7796,"nextInTime":7798,"topicId":7797,"numMessagesInTopic":0,"msgSnippet":"hi, i guess the difference in my personal understanding of unschooling and the one you ve put forth is that in my mind unschooling lies squarely in ones","messageBody":"<div id=\"ygrps-yiv-1999590231\">\n<html>\nhi,\n<p>i guess the difference in my personal understanding of unschooling and\nthe one you&#39;ve put forth is that in my mind unschooling lies squarely in\nones attitude and is not dogmatic in any real way but flows and utilizes\n<u>everything</u>.&nbsp; i see that it&#39;s not a reject (as many surmise\nbecause of the un prefix) of anything but a shifting of perspective from\ncontrol and schedules to a more individualized organic growth based on\nthe inner workings of each individual.&nbsp;&nbsp; personally i &#39;m turned\noff by <u>any</u> restrictions at all including not using textbooks.&nbsp;\nit makes me wonder what&#39;s the difference between a textbook and a cookbook\n?&nbsp; how could a more unschooling person see the use one but not another?\n<p>just curious,\n<br>susan\n<p>marbleface@... wrote:\n<blockquote><span title=\"qreply\"> <blockquote TYPE=\"CITE\">&nbsp;\n<br>I just think some people are more un --\n<br>to me that means they absolutely do not approve of using, for example,\n<br>textbooks, or workbooks or anything at all school-y.</blockquote>\n\n<blockquote TYPE=\"CITE\">Take care.\n<p>Nance\n<br>&nbsp;\n<br><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@onelist.com\"></a>&nbsp;</p></blockquote>\n</span></blockquote></html>\n</div>","specialLinks":[]}],"prevTopicId":7800,"nextTopicId":7802}}