{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"How will they learn engineering?","postDate":"1074038678","msgId":88764,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczLjM5ZDBmODYwLjJkMzVlMTk2QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":88763,"nextInTime":88765,"topicId":88764,"numMessagesInTopic":0,"msgSnippet":"A few quotes: CONDITION:  If the designated condition is met, the Script Commands up to the Condition End will be executed.  If the condition is not met, they","messageBody":"<div id=\"ygrps-yiv-276896539\">A few quotes:<br/>\n<br/>\n<br/>\nCONDITION:  If the designated condition is met, the Script Commands up to the <br/>\nCondition End will be executed.  If the condition is not met, they will be <br/>\npassed by.<br/>\n<br/>\nTO END:  This command takes you to the Script Branch End when the conditions <br/>\nwithin a Repeat or Sort script branch are fulfilled.  In the in-game example, <br/>\n&quot;To End&quot; is entered after the correct password is given.<br/>\n<br/>\nTwo small paragraphs from page 49 of 150 pages of the &quot;Strategy Guide&quot; for <br/>\nthe Playstation II game RPG Maker II.<br/>\n<br/>\nThis is what Marty wanted for his birthday.  He turns 15 tomorrow.  We&#39;re <br/>\ngiving it to him tonight, because the whole family will be home.<br/>\n<br/>\nThe whole book is about script commands, and substituting variables for <br/>\nattributes, and all manner of computer-programming and logic stuff.  He could take <br/>\na college course to learn those terms, but I doubt he&#39;ll come across any he <br/>\ndoesn&#39;t already know and if he does he&#39;ll figure them out in practical ways, as <br/>\nhe goes, and when/if he needs to know them for a project or a job, there <br/>\nthey&#39;ll be.  And they won&#39;t be in his head as memorized definitions, but as 3-D <br/>\npictures with histories and pasts, failures and successes.   <br/>\n<br/>\nHe figured RPG Maker out (the first version) very painstakingly over many <br/>\nmonths of trial and error.  This one will be  much easier because it&#39;s the &quot;new <br/>\nimproved&quot; version &lt;g&gt; and because the strategy book shows &quot;screenshots&quot; <br/>\n(pictures of what he will be seeing at that point in the instructions or options, as <br/>\nhe builds his game) and has tips and clarifications for the little 50 page <br/>\nbooklet that comes with the game.<br/>\n<br/>\nI tried to talk him into wanting a different game, when we were discussing <br/>\nthis before Christmas.  We&#39;re lucky with Marty.  We can discuss a bunch of stuff <br/>\nbefore Christmas, and decide from that what to wait for his birthday to do.  <br/>\nRPG Maker II seemed to be too dry and technical and difficult.  I thought he <br/>\nshould get some merry four-player game.<br/>\n<br/>\nHe said he LIKES figuring out the little details of designing the games and <br/>\nworlds and characters.  <br/>\n<br/>\nSo there it is.   Another example of the depths &quot;playing&quot; can reach. &lt;g&gt;<br/>\n<br/>\n(And the reading level of that sort of technical writing is nothing to scoff <br/>\nat either.)<br/>\n<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":88693,"nextTopicId":88511}}