{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"dawn","from":"dawn &lt;dawn@...&gt;","replyTo":"LIST","senderId":"ok4sMK6xDOG_5jpwddlI6Hk2-_x40wG5klS90AF0om7Eblz3uPcuv-ENltJ-NUa1buQuQ9NhJuI0DgQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Hospital &quot;escape&quot; after birth","postDate":"939650086","msgId":3731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNTAuMzczMS45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":3730,"nextInTopic":0,"prevInTime":3730,"nextInTime":3732,"topicId":3730,"numMessagesInTopic":0,"msgSnippet":"What we have learned is that NO ONE can force you or your child to stay at the hospital if you don t want to tand there is no life and death compelling reason","messageBody":"<div id=\"ygrps-yiv-1908253645\">What we have learned is that NO ONE can force you or your child to stay at<br/>\nthe hospital if you don&#39;t want to tand there is no life and death<br/>\ncompelling reason to be there.  We left Against Medical Advice after our<br/>\nlast birth, sans tests, vaccinations, etc.  The baby wasn;t even looked at<br/>\nby a pedi at the hospital.  I trusted my midwife to recognize anything<br/>\nthat needed immediate attention, and since she didn&#39;t, we went home.  We<br/>\nwould have left sooner, but my husband and 2 yr old had fallen asleep and<br/>\nrefused to wake up, so I took several showers while a nurse sat in the<br/>\nbathroom and held the baby, helped the woman across the hall sort our<br/>\nnursing difficulties, and worked with my own little nasty nurser (we<br/>\nfinally worked his nursing problems out when he was about 5 months<br/>\nold--although at 4 he still has a bad latch).  After my husband and son<br/>\nwoke up, my midwife came in and checked us again, we packed up, and off we<br/>\nwent.  We did take him in when he was a week or 10 days old for a PKU test<br/>\nand we live in a state where we can waive vaccinations, if we ever find<br/>\nourselves in a place where they are &quot;needed&quot;--but even when he was on WIC<br/>\nwe got around that easily.  It did help to have a birth plan and a midwife<br/>\nwho believes that homes are where babies should be born, but if not,<br/>\nhospitals should be as homelike as possible.<br/>\n<br/>\ndawn h-s, Mama to two wonderful boyz</div>","specialLinks":[]},{"userId":0,"authorName":"Lori","from":"&quot;Lori&quot; &lt;HarmNone@...","replyTo":"LIST","senderId":"Z3Qr-nT9X0rHameu676tzBqIMsXaTx2FyV8T6ahZJvfP7DXf4sVZj5KAUQXel1rABOCkCgxgYsD_PDaNHqlupdUl3vE","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Hospital &quot;escape&quot; after birth","postDate":"939649322","msgId":3730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNTAuMzczMC45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":3731,"prevInTime":3729,"nextInTime":3731,"topicId":3730,"numMessagesInTopic":0,"msgSnippet":"For those of you who were released from the hospital inless than 24 hours,   How? I was absolutely miserable and wanted to come home so that maybe I could get","messageBody":"<div id=\"ygrps-yiv-415024344\">For those of you who were released from the hospital inless than 24<br/>\nhours,   How?<br/>\nI was absolutely miserable and wanted to come home so that maybe I could<br/>\nget some sleep.  The hospital would not release my son until he had some<br/>\nkind of test , at 24 hours.  Needless to say, when he was 24 hours old,<br/>\nI called the nurses station to come get him for his test, and we were<br/>\nreleased an hour and a half later. If I ever have another child , I&#39;d<br/>\nlove to stay home, but how do you get around all the tests and<br/>\nvaccinations that are required by the state?<br/>\nSusan<br/>\n<br/>\nThis is most easily facilitated by having a birth plan filed with both your doctor (and the baby&#39;s, if they are not the same) as well the hospital. Prior to this step, you must hire a doctor who respects your intentions...this is of paramount importance. We view our doctors as professionals with whom we contract for services....therefore, they must support our views. We signed all the necessary waivers both before and after the births to ensure that our children (and me as well) weren&#39;t subjected to the &quot;party line&quot; just becuase the correct forms weren&#39;t in evidence. I had two natural, vaginal births in hospital after which we left within 18hrs and two surgicla births after which we left within 72hrs....the key is to prepare in advance, IMO.<br/>\n<br/>\nLori</div>","specialLinks":[]}],"prevTopicId":3729,"nextTopicId":3654}}