{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Unschooling.com Newsletter  by way of Ho","from":"&quot;Unschooling.com Newsletter&quot; &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","senderId":"0vgnSL6le9CDPZLLKfpkSxmq6G1OTe8BeSAqmguYspMW-qBRjmS3sStbiWJU2Dxsx0ZPt66Y2KPRMqEYhsJZSQWKrp1cWVal1IMOuwut-H1L0T6Vy5a7R66rtqO7vYK55pWAxTSlJsTEBBCZicYMPKbbRMGKC4DU_DARiM4TNp8NLDnHNj_rP0M","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling.com&#39;s MidOctober Online Newsletter","postDate":"1003335755","msgId":26920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkxOWI3ZjM2MGM5YjQ4OUBbMjA4LjI2LjIzNS4xNDJdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":26919,"nextInTime":26921,"topicId":26920,"numMessagesInTopic":0,"msgSnippet":"Unschooling.com s MidOctober Online Newsletter **Perspectives **Former Hostages File Suit **RAWA **Kaleidoscopes **The Perspective **Art and Drawing **Healing","messageBody":"<div id=\"ygrps-yiv-1065676930\">Unschooling.com&#39;s MidOctober Online Newsletter<br/>\n<br/>\n<br/>\n**Perspectives<br/>\n**Former Hostages File Suit<br/>\n**RAWA<br/>\n**Kaleidoscopes<br/>\n**The Perspective<br/>\n**Art and Drawing<br/>\n**Healing and Dying<br/>\n**Transforming the World<br/>\n<br/>\n==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;<br/>\n<br/>\nPerspectives<br/>\n<br/>\nIn August I decided that the theme of the Septemeber issue of this<br/>\nnewsletter would be &quot;perspectives&quot;. Life has thrown me a few curve<br/>\nballs this year, my father has become bedridden, a dear friend has entered<br/>\nthe last phase of living with liver cancer, and three of my children all<br/>\nbecame<br/>\nfluent readers at the same time. Even in my own reading I was finding<br/>\ndifferent perspectives of old issues, leaving me to rethink things I<br/>\nalready thought I knew.<br/>\n<br/>\nThen those ill-fated planes flew into the World Trade Center and forever<br/>\nchanged our lives, the lives of our children, and their children&#39;s<br/>\nchildren. I couldn&#39;t find a perspective, much less write with one, as life<br/>\nwas now an ever-changing kaleidoscope of images, feelings and worries.<br/>\n<br/>\nDuring the last month I felt twinges of envy for our curriculum using<br/>\nbrothers and sisters. The main battle cry of unschooling is that we use<br/>\n*real life* as the vehicle for our families learning. Real life was no<br/>\nlonger what I wanted to offer my children. I wanted to offer them the safe<br/>\nhaven of badly written textbooks. Texts so devoid of meaning that their real<br/>\nquestions would be truncated before they could even think of them. I don&#39;t<br/>\nhave very many answers to the questions that now face us. How refreshing it<br/>\nwould be to be able to say, this is the *right* answer to the question at<br/>\nthe end of the chapter.<br/>\n<br/>\nOf course, my children, used to living authentic lives, had no interest in<br/>\nchanging course now. They still wanted their very real lives. I suspect no<br/>\none will be surprised when I say they led me to my own safe haven. They<br/>\nasked questions, offered opinions and they keep tabs on how the work in NY<br/>\nis progressing, but by and large they are living their normal lives,<br/>\nreading, playing computer games, going places and of course they continue to<br/>\neat me out of house and home.<br/>\n<br/>\nI watch them as they absorb the actions of the world around them, and then<br/>\ncontinue on with the job at hand, which is the simple living of their own<br/>\nlives. My world is not so simple, and since their father is an Army<br/>\nReservist, it&#39;s possible that their world won&#39;t stay simple forever, but for<br/>\nnow we are breathing deeply and moving ahead. By looking with the<br/>\nperspective of my children, I am able to one again gain a bit of<br/>\nperspective, at least enough to bring you this month&#39;s unschooling<br/>\nnewsletter.<br/>\n<br/>\nIn this issue you&#39;ll find websites and other resources that challenge our<br/>\nperspectives, from online kaleidoscopes to the very raw drawings of Afghani<br/>\nchildren.<br/>\n<br/>\n<br/>\n==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;<br/>\n<br/>\n<br/>\nFormer Hostages File Suit<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.foxnews.com/story/0,2933,36574,00.html\">http://www.foxnews.com/story/0,2933,36574,00.html</a><br/>\n<br/>\nStrange happenings in this war on terrorism --<br/>\n<br/>\nThe former hostages are suing Iran for monetary damages after their 444-day<br/>\ncaptivity, which followed the 1979 seizure of the U.S. embassy in the<br/>\ncapital city of Tehran. They say a law passed in 1996 allows Americans to<br/>\nsue in civil court countries on the State Department&#39;s list of state<br/>\nsponsors of terrorism.<br/>\n<br/>\nThe Justice Department said this week that the 1996 law does not trump the<br/>\naccord that freed the hostages in the first place.<br/>\n<br/>\n<br/>\n==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;<br/>\n<br/>\n<br/>\nRAWA, Revolutionary Association of the Women of Afghanistan<br/>\nwww.rawa.org<br/>\n<br/>\nRAWA has been in existence since 1977. Read that again. 1977 means that<br/>\nAfghani women have been fighting fundamentalism for 32 years. I give you the<br/>\nmain url in hopes that you will have your perspectives challenged but be<br/>\nwarned this site contains graphic and horrific information. The pages that<br/>\nwere the most compelling to me, as an unschooler, were the drawings by the<br/>\nchildren. It gives our phase &quot;learning from life&quot; a whole new twist. For<br/>\ntheir pictures visit - <a rel=\"nofollow\" target=\"_blank\" href=\"http://rawa.fancymarketing.net/kid-pic.htm\">http://rawa.fancymarketing.net/kid-pic.htm</a><br/>\n<br/>\n<br/>\n==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;<br/>\n<br/>\n<br/>\nKaleidoscopes<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.physics.orst.edu/~bulatov/vrml/kaleidoscopes/index.html\">http://www.physics.orst.edu/~bulatov/vrml/kaleidoscopes/index.html</a><br/>\n<br/>\nYou know, I always thought of kaleidoscopes as a child&#39;s fantasy toy. Never<br/>\ndid I realize the mathematics hidden within those mesmerizing pictures. This<br/>\nsite takes you to some high class &#39;scopes like these --<br/>\n<br/>\nEuclidean plane kaleidoscopes<br/>\nSpherical kaleidoscopes<br/>\nHyperbolic kaleidoscopes<br/>\n<br/>\nAnd then, if you understand this<br/>\n<br/>\nStep 1.<br/>\n#VRML V2.0 utf8<br/>\nShape {<br/>\ngeometry IndexedFaceSet{<br/>\ncoord Coordinate{<br/>\npoint [<br/>\n-1 0 0,<br/>\n0 0 0,<br/>\n-0.5 0.866025 0<br/>\n<br/>\nYour or your children can take the programming code and make your own! Good<br/>\nLuck!<br/>\n<br/>\n==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;<br/>\n<br/>\nCan you guess who would put out an online journal aptly named The<br/>\nPerspective? Come on guess.<br/>\n<br/>\nNope.<br/>\n<br/>\nThe Perspective - <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theperspective.org/\">http://www.theperspective.org/</a><br/>\n<br/>\nThe Liberian Democratic Future (LDF) is a group of Liberians from different<br/>\nethnic backgrounds, genders, religious beliefs and political persuasions who<br/>\nare dedicated to pluralistic, democratic Liberia. The Liberian Democratic<br/>\nFuture has great passion for democracy, peace with justice and equal<br/>\nopportunity for all Liberians, which are not only necessary but in deed<br/>\ncritically imperative if we are to transcend the wounds and deep division of<br/>\nour civil conflict. In recognition of this national need, LDF has decided to<br/>\nlaunch a medium of dialogue - THE PERSPECTIVE.<br/>\n<br/>\nAs a unique upscale newsmagazine, The Perspective is significantly different<br/>\nfrom other Liberian publications. Rather than dance around the problems, The<br/>\nPerspective will confront the issues head on by concentrating on telling the<br/>\ntruth, exposing the root causes, underlining contributing factors and<br/>\nidentifying the class divisions which are the undercurrent of the various<br/>\nproblems in Liberia<br/>\n<br/>\nReading through this site makes our own Revolutionary period seem quaint and<br/>\nalmost naive.<br/>\n<br/>\n<br/>\n==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;<br/>\n<br/>\n<br/>\nPerspective in Art and Drawing<br/>\n<br/>\nOf course, the newsletter wouldn&#39;t be complete without including art and<br/>\ndrawing in our theme of perspective. Hope you enjoy the sites below!<br/>\n<br/>\nFind it on the Web: Pictures in Perspective<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mathforum.org/sum95/math_and/perspective/perspect.html\">http://mathforum.org/sum95/math_and/perspective/perspect.html</a><br/>\n<br/>\nDrawing in One Point Perspective<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.olejarz.com/arted/perspective/\">http://www.olejarz.com/arted/perspective/</a><br/>\n<br/>\nWhat comes to mind when you think of 3-D glasses, holograms, and virtual<br/>\nimages? Ordinary objects coming alive? Looking at things in new, exciting<br/>\nways? Just as these modern-day 3-D innovations have caused a sensation in<br/>\nour time, the use of perspective in art caused a visual/sensual response in<br/>\nthe 15th, 16th, and 17th centuries. - <a rel=\"nofollow\" target=\"_blank\" href=\"http://library.thinkquest.org/3257/\">http://library.thinkquest.org/3257/</a><br/>\n<br/>\nExplore the world of art and artists through our interactive timeline and<br/>\nglossary - This is a megasite with more than anyone needs to know about art.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sanford-artedventures.com/study/study.html\">http://www.sanford-artedventures.com/study/study.html</a><br/>\n<br/>\n<br/>\n==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;<br/>\n<br/>\n<br/>\nHealing and Dying<br/>\n<br/>\nBelow are websites with very different perspectives on healing and dying. As<br/>\nI watch my father deal with becoming bedridden and what is the last stage of<br/>\nhis life, I find myself longing for a way to both hold on and to let go all<br/>\nwithin the same moment. It&#39;s hard and frustrating work, hampered by the fact<br/>\nthat we only have a superficial relationship. During this time I also hold<br/>\nin contrast of my friend living the last stages of liver cancer. Her<br/>\nstrength and joy while facing all that she must leaves me with the same<br/>\nsense of awe I have when watching a Harvest Moon rise into the night&#39;s sky.<br/>\nHow could something be so big and so beautiful and still be so untouchable?<br/>\n<br/>\n<br/>\nThe Art of Healing: A Tibetan Buddhist Perspective<br/>\nby Bonnie Pasqualoni<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dharma-haven.org/tibetan/tibetan-art-of-healing.htm\">http://www.dharma-haven.org/tibetan/tibetan-art-of-healing.htm</a><br/>\n<br/>\nI beseech you, Medicine Guru,<br/>\nwhose sky-colored holy body of lapis lazuli<br/>\nSignifies omniscient wisdom<br/>\nand compassion as vast as limitless space,<br/>\nplease grant me your blessings.<br/>\n<br/>\nTibetans use an ancient form of medicine known as Gso-wa Rig-pa or &quot;The<br/>\nKnowledge of Healing&quot; whose origins are believed to be based on the<br/>\nteachings of the historical Buddha. Tibetan medicine is held in high esteem<br/>\nin Tibet and central Asia.<br/>\n<br/>\nIn the Tibetan medical tradition, the concept of well-being takes into<br/>\naccount the full dynamics of mind, body and spirit to achieve an effective<br/>\nand comprehensive healing strategy. It is immersed in Buddhist tradition,<br/>\nwhich differs from non-Buddhist medicine in that it utilizes three types of<br/>\ntherapeutic intervention: medicinal entities, the power of mantra (a<br/>\ncreative, repetitive sound) and the power of meditative stabilization<br/>\n(Donden, p. 215). In doing so, the Tibetan healing traditions transport us<br/>\ninto a strange world of interconnectedness between macrocosmic principles<br/>\nand their microcosmic manifestations; harmony and balance between the cosmic<br/>\nmacrocosm and the human microcosm is believed to be essential for health and<br/>\nwell-being. This is true not only in the sense that balance is required for<br/>\nhealth, but also in the somewhat deeper sense that such balance is the<br/>\nessence of health; balance among the physical, psychological and spiritual<br/>\nelements of human existence is health.<br/>\n<br/>\n<br/>\nShare the Care<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://cancer.med.upenn.edu/reviews/coping/books/share.html\">http://cancer.med.upenn.edu/reviews/coping/books/share.html</a><br/>\n<br/>\n<br/>\nShare the Care was born when a group of women, including the authors, got<br/>\ntogether to try to help a friend who had been suffering with cancer. Each<br/>\nauthor approached the situation from very different perspectives based on<br/>\ntheir unique situations and experiences. Sheila describes herself as an<br/>\n&quot;burnt-out caregiver.&quot; As one of the few people that their friend had<br/>\nalready been relying heavily upon as her cancer progressed and she became<br/>\nincreasingly debilitated, she now was struggling as she attempted to balance<br/>\nthe new caregiver demands being placed on her by her ailing mother. She was<br/>\nskeptical of the group, their willingness and ability to meet the increasing<br/>\ndemands over a sustained period of time.<br/>\n<br/>\nDespite each author&#39;s concerns, the group was formed, and for a period of<br/>\nthree and one half years, provided almost total care to their friend until<br/>\nher death.<br/>\n<br/>\nNow, the authors have compiled not only the story of this group and their<br/>\nexperiences, but have turned the trials, tribulations, and the wisdom gained<br/>\ninto a practical guidebook for caregivers of seriously ill persons. Share<br/>\nthe Care gives the reader a step by step directions for creating and<br/>\nsustaining an &quot;alternate family&quot; to share the practical and emotional<br/>\nresponsibilities of caregiving<br/>\n<br/>\n<br/>\nJewish Healing Perspectives<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://web.wt.net/~cbenton/healing/heal.htm\">http://web.wt.net/~cbenton/healing/heal.htm</a><br/>\n<br/>\n<br/>\nA few years ago I woke up and said, &quot;Dang! I&#39;m getting old, and ugly, and my<br/>\nbody hurts more than it used to!&quot; Consequently, I began to search through<br/>\nthe literature and the traditions of Judaism to see what my ancestors had<br/>\nwritten about healing. I quickly realized that more has been said throughout<br/>\nJudaism&#39;s long history than one individual could ever hope to reclaim.<br/>\nNevertheless, I did find both general principles and specific advice and<br/>\nalso bits of wisdom that seemed to speak directly to what I needed to know<br/>\n<br/>\n<br/>\n==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;==&lt;&gt;<br/>\n<br/>\n<br/>\nTransforming the World - by William Martin<br/>\n<br/>\n<br/>\nThe world inists on achievement and progress<br/>\nand it is full of enmity and strife.<br/>\nCan you see all this and still help your children<br/>\nmaintain their trust and hope and peace?<br/>\nCan you accept the world as it is,<br/>\nyet live according to a different standard?<br/>\nCan you let your children see<br/>\na way of living<br/>\nthat transforms,<br/>\nheals<br/>\nnurtures,<br/>\nand loves?<br/>\n<br/>\nIf you complain about politics<br/>\nand gripe about taxes,<br/>\nand stew about the sorry state of things<br/>\nyour children will learn to whine instead of laugh.<br/>\nIf you can see in every moment<br/>\na chance to live,<br/>\nto accept,<br/>\nand to appreciate,<br/>\nyour children will transform the world.<br/>\n<br/>\n<br/>\n<br/>\nPlease, may it be so!<br/>\n<br/>\nThat&#39;s it for MidOctober. See you next month!<br/>\n<br/>\nLisa Bugg, Editor<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LisaBugg@...\">LisaBugg@...</a><br/>\n<br/>\nMark and Helen Hegener, Publishers<br/>\nwww.home-education-magazine.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM@...\">HEM@...</a></div>","specialLinks":[]}],"prevTopicId":26919,"nextTopicId":26921}}