{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: squabbles - Enough Already!","postDate":"1031435406","msgId":43253,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NS5lMjAxYjM2LjJhYWJjZThlQGFvbC5jb20+"},"prevInTopic":43232,"nextInTopic":0,"prevInTime":43252,"nextInTime":43254,"topicId":43191,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/7/2002 8:11:46 AM Central Standard Time, ... I have to say I agree with this!  This thread has been incredibly helpful to me. I love how","messageBody":"<div id=\"ygrps-yiv-1465648580\">In a message dated 9/7/2002 8:11:46 AM Central Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marydan@...\">marydan@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Even though you may have been the one who started this thread, the <br/>\n&gt; responses aren&#39;t intended for you alone.  It may be helpful to others-<br/>\n&gt; -me for instance.<br/>\n<br/>\n </span></blockquote>I have to say I agree with this!  This thread has been incredibly helpful to <br/>\nme. I love how everyone questions each other and leads me to re-think my own <br/>\nissues and convictions.  I&#39;m learning all the time too...<br/>\n<br/>\nElizabeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] squabbles - Enough Already!","postDate":"1031415696","msgId":43232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Ny5jYWY0ZGJmLjJhYWI4MTkwQGFvbC5jb20+"},"prevInTopic":43210,"nextInTopic":43253,"prevInTime":43231,"nextInTime":43233,"topicId":43191,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/6/02 10:49:29 PM, snowicke@cox.net writes: ","messageBody":"<div id=\"ygrps-yiv-1591799675\">In a message dated 9/6/02 10:49:29 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:snowicke@...\">snowicke@...</a> writes:<br/>\n<br/>\n&lt;&lt; From a childhood squabble to a domestic violence issue - Wow! Who would <br/>\nhave ever thought it could happen?   &gt;&gt;<br/>\n<br/>\nI doubt that you&#39;re suggesting that violence in adults has no roots in their <br/>\nupbringing, experiences or frustrations.<br/>\n<br/>\nAnd when the police are called because neighbors can hear arguing, the <br/>\nneighbors call either because it&#39;s disturbing their peace (legitimate <br/>\ncomplaint) or because they&#39;re afraid it could turn violent (as I called when <br/>\nmy neighbor was yelling full-throat at 6:30 in the morning, &quot;Do you WANT me <br/>\nto hit you?  I think you just WANT me to hit you!&quot;), the police call that, <br/>\nlegally, &quot;A domestic disturbance.&quot;<br/>\n<br/>\nWhat&#39;s described as a &quot;squabble,&quot; if it has any violence or fear or <br/>\ncontinuance, and if it&#39;s possible that it could turn violent (which any <br/>\nargument could in an instant), that is the same as &quot;a domestic disturbance,&quot; <br/>\nwhich is one action removed from &quot;domestic violence.&quot;  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":114787025,"authorName":"achisms5","from":"&quot;achisms5&quot; &lt;marydan@...&gt;","profile":"achisms5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: squabbles - Enough Already!","postDate":"1031404258","msgId":43210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFsY3R0MitpdGpmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMzcwMWMyNTYyOSRiMjIyMzdiMCQ2ODUyMDc0NEBzeXN0ZW0+"},"prevInTopic":43191,"nextInTopic":43232,"prevInTime":43209,"nextInTime":43211,"topicId":43191,"numMessagesInTopic":0,"msgSnippet":"... -=- Ok - This is getting way too distorted for me -=- Even though you may have been the one who started this thread, the responses aren t intended for you","messageBody":"<div id=\"ygrps-yiv-2038870460\"><blockquote><span title=\"qreply\">--- In Unschooling-dotcom@y..., &quot;B & S Nowicke&quot; &lt;snowicke@c...&gt; wrote:<br/>\n<br/>\n-=- Ok - This is getting way too distorted for me -=-<br/>\n<br/>\nEven though you may have been the one who started this thread, the <br/>\nresponses aren&#39;t intended for you alone.  It may be helpful to others-<br/>\n-me for instance.<br/>\n<br/>\n<br/>\n-=- My original post (intro - long) included a line about my kids <br/>\nsquabbling - fighting, disagreeing - I forget the exact word used - <br/>\nbut what I was - and still am trying to address is the typical every <br/>\nday squabbles that kids get into.  Not some DOMESTIC VIOLENCE issue - <br/>\ngive me a break already - talk abt an extreme and twisted version of <br/>\nthe original post!  My kids are 5 and 8 for God&#39;s sake!  We&#39;re not <br/>\ntalking domestic violence - GET IT?-=-<br/>\n<br/>\n<br/>\nWhen I try to think of a way to resolve an issue or what general, <br/>\nunderlying, philosophy to use, I often think about how it would apply <br/>\nin an extreme situation or in the world outside of our family <br/>\ncontext.  For instance, I don&#39;t say &quot;Hitting is no way to solve a <br/>\nproblem.&quot;  because in the rest of the world, in families that spank <br/>\nand in dictators who want more power, hitting and violence do help <br/>\nthem get what they want (solve a problem).  I do say &quot;I don&#39;t think <br/>\nhitting is the best way to solve a problem and in this house hitting <br/>\nis not ok.&quot;  I have told my children it is ok to hit in <br/>\nself-defense or to protect others but I have also told them it is <br/>\nnever ok to hit (in the context of a sqabble with each other--<br/>\nalthough I didn&#39;t make that clear to them).  Sandra&#39;s point about not <br/>\nsaying to never hit helped me to see that I was sending a mixed <br/>\nmessage. <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n-=- What I said and still stand by is I don&#39;t take sides - I don&#39;t <br/>\nteach my kids a victim mentality - i.e., laying blame and excepting <br/>\nno responsibility for a situation. (And no Sandra - I did not say <br/>\nyour kids have that mentality.  I don&#39;t know you or your kids!) Quite <br/>\nfrankly I don&#39;t need you passing judgment on me and mine or making a <br/>\nchildhood squabble into a friggin&#39; domestic violence issue.-=-<br/>\n<br/>\nAgain, take this to an extreme.  If your bil was beating your sister <br/>\nwould you tell her to accept her part of the responsibility (that is <br/>\nhow many women stay in these situations) or would you tell her that <br/>\nher husband was wrong and to get out?  Isn&#39;t the latter taking sides? <br/>\nIf it were me, I would tell her to get out.  After she was safely <br/>\naway, I might ask her to examine why she allowed herself to be <br/>\ntreated that way and to work on figuring out a way to make better <br/>\nchoices in the future.<br/>\n <br/>\n-=- Quit twisting and turning my original and subsequent posts into <br/>\nsome kind of ultra-violent situation going on! -=-<br/>\n<br/>\nNobody was turning *your* situation into an ultra-violent extreme.<br/>\n <br/>\n-=- So here&#39;s the bottom line - I withdraw my post abt squabble -=-<br/>\n<br/>\nToo late.  Once you say something you can&#39;t take it back.  That&#39;s <br/>\nanother thing I try to tell my children to help them be mindful of <br/>\nwhat they say to others.  I tell them they can change their mind or <br/>\nclarify or apolgize tho.  Someone said--I don&#39;t remember who-- that <br/>\nthey don&#39;t get involved with their children&#39;s arguements and leave <br/>\nthem to work it out for themselves.  I think that is a lot to ask of <br/>\nchildren.  My son, seemingly, isn&#39;t as hurt by words as his sister <br/>\nis. How will come to understand the difference in their sensibilities <br/>\nif no one bothers to point this out to him?<br/>\n<br/>\n<br/>\n-=- I will be using the delete key from this point forward.-=-<br/>\n<br/>\nYour choice but isn&#39;t that avoidance?  And aren&#39;t you failing to <br/>\naccept your part of the responsibility for this squabble?<br/>\n<br/>\n<br/>\nMary </span></blockquote></div>","specialLinks":[]},{"userId":99563824,"authorName":"B & S Nowicke","from":"&quot;B & S Nowicke&quot; &lt;snowicke@...&gt;","profile":"snowicke","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] squabbles - Enough Already!","postDate":"1031374059","msgId":43191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzcwMWMyNTYyOSRiMjIyMzdiMCQ2ODUyMDc0NEBzeXN0ZW0+","referencesHeader":"PDZmLjJkNDU3Y2E2LjJhYWFiODQ3QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":43210,"prevInTime":43190,"nextInTime":43192,"topicId":43191,"numMessagesInTopic":0,"msgSnippet":"Ok - This is getting way too distorted for me - My original post (intro - long) included a line about my kids squabbling - fighting, disagreeing - I forget the","messageBody":"<div id=\"ygrps-yiv-267786972\">Ok - This is getting way too distorted for me -<br/>\n<br/>\nMy original post (intro - long) included a line about my kids squabbling - fighting, disagreeing - I forget the exact word used - but what I was - and still am trying to address is the typical every day squabbles that kids get into.  Not some DOMESTIC VIOLENCE issue - give me a break already - talk abt an extreme and twisted version of the original post!  My kids are 5 and 8 for God&#39;s sake!  We&#39;re not talking domestic violence - GET IT?<br/>\n <br/>\nWhat I said and still stand by is I don&#39;t take sides - I don&#39;t teach my kids a victim mentality - i.e., laying blame and excepting no responsibility for a situation. (And no Sandra - I did not say your kids have that mentality.  I don&#39;t know you or your kids!) Quite frankly I don&#39;t need you passing judgment on me and mine or making a childhood squabble into a friggin&#39; domestic violence issue.<br/>\n<br/>\nQuit twisting and turning my original and subsequent posts into some kind of ultra-violent situation going on!  For the couple of folks who offered an author or book recommendation - Thank you.  That is what I was seeking in addition to needing to vent some steam after several VERY hot days the stretched little tempers to the snapping point on one to many occassions.<br/>\n<br/>\nSo here&#39;s the bottom line - I withdraw my post abt squabble in the interest of my own sanity and peoples delete fingers growing exhausted by this ridiculous escalation.  From a childhood squabble to a domestic violence issue - Wow! Who would have ever thought it could happen?  If the rest of you want to carry on with the topic - so be it - I will be using the delete key from this point forward.<br/>\n<br/>\nI guess I am under the impression that this is an online support group for unschooling minded homeschoolers.  In the past few days I&#39;ve seen cheap shots taken at Christian homeschoolers and others and seen words twisted into an unrecognizable form - my own and others.  There extremists in every avenue of education - ps, private, homeschool, school at home, unschoolers, etc. etc.  In fact, that can be said about virtually any topic of life.  I just didn&#39;t think this was an extremists forum, because that is in many instances how it is feeling to me.<br/>\n<br/>\nSandra, I sincerely need an answer to this question  - What exactly is the role of this list....because maybe I&#39;m the one in the wrong place?<br/>\n<br/>\nSusan N.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":43242,"nextTopicId":43218}}