{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooling ourselves","postDate":"1327422035","msgId":65228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhEQjNCQjI1LTFCOEItNDBFRi1BODg3LUY5MkY1MDNENTVFQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PENBT09UYVhNRUZ3WWl5U3pkaTd0eDA0Y1lOU3k4WjhLOE9lMmY4RzROU3ZkdXYtYmU3QUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGpmamY0Nit2cW0yQGVHcm91cHMuY29tPiA8REI0NTkyQUEtRDEyMS00NTE4LThGNTYtN0EyMjEyN0Q2NTAzQHZlcml6b24ubmV0PiA8Q0FPT1RhWE1FRndZaXlTemRpN3R4MDRjWU5TeThaOEs4T2UyZjhHNE5TdmR1di1iZTdBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":65222,"nextInTopic":0,"prevInTime":65227,"nextInTime":65229,"topicId":65214,"numMessagesInTopic":0,"msgSnippet":"... I guess it s been way too long since I saw it! I recall there were some connections they were trying to show between adding, subtracting, multiplying and","messageBody":"<div id=\"ygrps-yiv-494295075\">On Jan 23, 2012, at 4:19 PM, Pam Sorooshian wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ya think? I think it is the most boring part of school math with absolutely<br/>\n&gt; none of what might be the good part in some schools.<br/>\n<br/>\n </span></blockquote>I guess it&#39;s been way too long since I saw it! I recall there were some connections they were trying to show between adding, subtracting, multiplying and dividing. And they came at it from several different directions.<br/>\n<br/>\nI don&#39;t recall any interesting math that Kat brought home from her 2 months in 2nd grade so I was comparing it to that. In Massachusetts they start doing assessment testing in 3rd grade so my guess is there isn&#39;t much room for fun math. <br/>\n<br/>\nBut yes, you&#39;re right, it was all notation. Kat had zero interest in them.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooling ourselves","postDate":"1327353543","msgId":65222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhNRUZ3WWl5U3pkaTd0eDA0Y1lOU3k4WjhLOE9lMmY4RzROU3ZkdXYtYmU3QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PERCNDU5MkFBLUQxMjEtNDUxOC04RjU2LTdBMjIxMjdENjUwM0B2ZXJpem9uLm5ldD4=","referencesHeader":"PGpmamY0Nit2cW0yQGVHcm91cHMuY29tPgk8REI0NTkyQUEtRDEyMS00NTE4LThGNTYtN0EyMjEyN0Q2NTAzQHZlcml6b24ubmV0Pg=="},"prevInTopic":65218,"nextInTopic":65228,"prevInTime":65221,"nextInTime":65223,"topicId":65214,"numMessagesInTopic":0,"msgSnippet":"... Ya think? I think it is the most boring part of school math with absolutely none of what might be the good part in some schools. It is nothing but notation","messageBody":"<div id=\"ygrps-yiv-1247006952\">On Mon, Jan 23, 2012 at 9:14 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The Keys To curriculum is halfway between school curriculum and real life.<br/>\n<br/>\n<br/>\n </span></blockquote>Ya think? I think it is the most boring part of school math with absolutely<br/>\nnone of what might be the good part in some schools.<br/>\n<br/>\nIt is nothing but notation and how to do algorithms --- no explanations of<br/>\nwhy or when. There is no context at all - an extreme version of what<br/>\nSandra&#39;s husband pointed out - they are giving you a coded answer to a<br/>\nproblem without ever telling you anything about the problem. All you&#39;re<br/>\ndoing when you do math like that is working out the code to some unknown<br/>\nproblem.<br/>\n<br/>\nAt least when my oldest was in school, they did hands-on activities with<br/>\nmanipulatives - it wasn&#39;t entirely memorization. For example, in second<br/>\ngrade they had a little luncheon party in the classroom. They set 6 tables<br/>\nwith the same number of places at each table. They talked about how many<br/>\nplates and cups they&#39;d need at each table and how many total - the point<br/>\nwas to build up a sense of what multiplication meant. For example, they<br/>\nmight be able to put 5 plates at each table. The teacher often asked kids<br/>\nif they could think of other ways to figure something out. They could put<br/>\nplates out on each table and count them all. They could pretend there were<br/>\nplates out and count the empty spaces. They could set one table and then<br/>\nadd that many plates up 6 times (5 plus 5 plus 5 plus 5 plus 5 plus 5). And<br/>\nthen she&#39;d point out that that was the same as multiplying 6 times 5.<br/>\n<br/>\nThis kind of experience will occur naturally in life. We don&#39;t have to make<br/>\nup pretend luncheons. Multiplication is convenient - that&#39;s why it was<br/>\ninvented! And the convenience of it will become apparent naturally.<br/>\n<br/>\nDoing the &quot;Keys to&quot; workbooks won&#39;t help kids develop conceptual<br/>\nunderstanding at all and CAN work against it. Sometimes people think they<br/>\n&quot;know&quot; something and they never again really think about it. How many of<br/>\nyou &quot;know&quot; that you divide a fraction by another fraction by inverting the<br/>\nsecond fraction and multiplying them? How many of you have thought about<br/>\nthat since you memorized it sometime in elementary school? How many of you<br/>\ncould explain when to use it and why it works? Not many! That&#39;s because you<br/>\nthought you &quot;know&quot; all about multiplying fractions when all you&#39;d done is<br/>\nmemorize a trick (and had any curiosity about mathematical concepts drained<br/>\nout of you because of other aspects of math education).<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooling ourselves","postDate":"1327338858","msgId":65218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCNDU5MkFBLUQxMjEtNDUxOC04RjU2LTdBMjIxMjdENjUwM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGpmamY0Nit2cW0yQGVHcm91cHMuY29tPg==","referencesHeader":"PGpmamY0Nit2cW0yQGVHcm91cHMuY29tPg=="},"prevInTopic":65216,"nextInTopic":65222,"prevInTime":65217,"nextInTime":65219,"topicId":65214,"numMessagesInTopic":0,"msgSnippet":"... That s cool that you re figuring it out and feeling more comfortable. It s unfortunate that schools lead people to believe that the school approach to math","messageBody":"<div id=\"ygrps-yiv-289020108\">On Jan 23, 2012, at 6:08 AM, bellumswife77 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I started getting nervous about math and numbers and remember thinking for the first time that I was stupid. <br/>\n<br/>\n<br/>\n&gt; I also got Keys to Fractions-for myself. And am excited to finally be figuring it out!<br/>\n<br/>\n </span></blockquote>That&#39;s cool that you&#39;re figuring it out and feeling more comfortable. <br/>\n<br/>\nIt&#39;s unfortunate that schools lead people to believe that the school approach to math -- solving equations -- *is* math.<br/>\n<br/>\nSince you&#39;ve had a lifetime of experience living with fractions, the Keys To could be helping you connect dots you didn&#39;t realize were there between real live fractions and notation.<br/>\n<br/>\nBut without that lifetime of experience, what&#39;s being learned from the curriculum isn&#39;t the same as what gets learned by using fractions and decimals in real life. The Keys To curriculum is halfway between school curriculum and real life. Which for schools is good! But for unschoolers it means it&#39;s halfway to school math and further from real life math.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My daughter who is 12 enjoys math, after not &quot;getting it&quot; and<br/>\n&gt; in spite of also having discalculia LIKES math. She asked me<br/>\n&gt; to help her with decimals and is working through Keys to Decimals.<br/>\n<br/>\n </span></blockquote>Was she in school before? Is that where she got the idea she couldn&#39;t get math? And that she had dyscalculia?<br/>\n<br/>\nIf she can do numbers now, then the diagnosis of dyscalculia was unnecessarily upsetting and really only meant she wasn&#39;t developmentally ready to do math when the schools wanted to teach it. <br/>\n<br/>\nWhether kids have dyslexia or not, when they&#39;re given the opportunity to read when they&#39;re ready, they learn to read when they&#39;re ready. Same with math. (Though some kids will be better at it than others. Just as some are better at shooting baskets, writing, and talking to people.)<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Unschooling ourselves","postDate":"1327338770","msgId":65216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyRURGOEUyLTJERTQtNDcwMi04ODdDLUY4NTJFMzQwOTc4RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpmamY0Nit2cW0yQGVHcm91cHMuY29tPg==","referencesHeader":"PGpmamY0Nit2cW0yQGVHcm91cHMuY29tPg=="},"prevInTopic":65214,"nextInTopic":65218,"prevInTime":65215,"nextInTime":65217,"topicId":65214,"numMessagesInTopic":0,"msgSnippet":"-=-. My daughter who is 12 enjoys math, after not getting it and in spite of also having discalculia LIKES math. She asked me to help her with decimals and","messageBody":"<div id=\"ygrps-yiv-2052863628\">-=-. My daughter who is 12 enjoys math, after not &quot;getting it&quot; and in spite of also having discalculia LIKES math. She asked me to help her with decimals and is working through Keys to Decimals. I also got Keys to Fractions-for myself. And am excited to finally be figuring it out! -=-<br/>\n<br/>\nIf you&#39;re both having fun, that&#39;s nice. <br/>\nIf you&#39;re doing it for fun, that&#39;s sweet.<br/>\nIf you&#39;re doing it because you thought she needed to &quot;get it&quot; and because you were told or decided that she &quot;had discalulia,&quot; then it&#39;s probably not going to lead you toward a better understanding of unschooling.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/math/unerzogen\">http://sandradodd.com/math/unerzogen</a> might have ideas that would help you relax.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":502477525,"authorName":"bellumswife77","from":"&quot;bellumswife77&quot; &lt;stefanie@...&gt;","profile":"bellumswife77","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling ourselves","postDate":"1327316934","msgId":65214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpmamY0Nit2cW0yQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":65216,"prevInTime":65213,"nextInTime":65215,"topicId":65214,"numMessagesInTopic":0,"msgSnippet":"I always read posts about math and unschoolers and find them interesting. Math was always a struggle for me. My Dad was military and we had several moves when","messageBody":"<div id=\"ygrps-yiv-26918207\">I always read posts about math and unschoolers and find them interesting. Math was always a struggle for me. My Dad was military and we had several moves when I was in elementary school. I missed large chunks of lessons, struggles with multiplication (finally figured that out as an adult) and never GOT fractions and decimals beyond the basics. I remember being bewildered as a child when my parents would take away my tv, send me to my room with a multiplication chart and tell me to &quot;learn to multiply!&quot; . I was so sad, because I felt so misunderstood. I really didn&#39;t understand it! I started getting nervous about math and numbers and remember thinking for the first time that I was stupid. My daughter who is 12 enjoys math, after not &quot;getting it&quot;  and in spite of also having discalculia LIKES math. She asked me to help her with decimals and is working through Keys to  Decimals. I also got Keys to Fractions-for myself. And am excited to finally be figuring it out! Because of my struggles with math it is also important to me that my children not feel intimidated by math. I try to make my home &quot;math friendly,&quot; with games and puzzles for the children, just as I buy good literature.   Unschooling to me is.so wonderful and exciting because I finally have the time and inspiration, not being bogged down with homeschooling, to continue educating myself. And as *I* continue to learn my children are likewise encouraged to find their own interests to explore.<br/>\n<br/>\nBlessings,<br/>\nStefanie in AK</div>","specialLinks":[]}],"prevTopicId":65205,"nextTopicId":62078}}