{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":128695025,"authorName":"wifetovegman2002","from":"&quot;wifetovegman2002&quot; &lt;wifetovegman2002@...&gt;","profile":"wifetovegman2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Questions regarding video games","postDate":"1114007271","msgId":105499,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ0NW90Nys3MjJkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1LjQzMTMzZDI5LjJmOTZhNTQ0QGFvbC5jb20+"},"prevInTopic":105485,"nextInTopic":0,"prevInTime":105498,"nextInTime":105500,"topicId":105450,"numMessagesInTopic":0,"msgSnippet":"... to the ... but the ... especially if ... with ... parent has no ... And I think this applies to *any* interest or hobby a child has, not just video games","messageBody":"<div id=\"ygrps-yiv-722584800\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I would think that parental non-involvement would become detrimental<br/>\n </span></blockquote>to the <br/>\n<blockquote><span title=\"ireply\"> &gt; relationship between parent and child.  Development would continue,<br/>\n </span></blockquote>but the <br/>\n<blockquote><span title=\"ireply\"> &gt; parent and child relationship would be distanced and more strained,<br/>\n </span></blockquote>especially if <br/>\n<blockquote><span title=\"ireply\"> &gt; the parent oozes disapproval of the child&#39;s interest and involvement<br/>\n </span></blockquote>with <br/>\n<blockquote><span title=\"ireply\"> &gt; games.  Making a child stop playing a video game just because the<br/>\n </span></blockquote>parent has no <br/>\n<blockquote><span title=\"ireply\"> &gt; interest in it wouldn&#39;t be a good move, I don&#39;t think, either. <br/>\n<br/>\n<br/>\n </span></blockquote>And I think this applies to *any* interest or hobby a child has, not<br/>\njust video games or tv shows.  Not in a smothering or hovering way,<br/>\nbut I find unschooling means so much MORE parental involvement than<br/>\nschool-at-home ever did for us.  There is no 3-hour block of<br/>\n&quot;learning&quot; and then send them out to play because I&#39;m done for the<br/>\nday.  I&#39;m much more concious of who they are as persons because of the<br/>\ntime spent with them throughout the days.<br/>\n<br/>\nI go to my son&#39;s historical swordsmanship class and watch and listen<br/>\nbecause I want to be able to talk to him intelligently about it<br/>\nafterwards.  I watch my daughter painting her latest work because I<br/>\nwant to know what she is working on and how it is going.  I play Halo<br/>\nII or Luigi&#39;s Haunted Mansion and Animal Crossing with my sons because<br/>\nthe games are fun and it is time together building a mutual interest<br/>\nand skill.  I buy the ingredients for whatever recipe my 13yo son has<br/>\ndecided he wants to try, and I watch him prepare it and we talk about<br/>\nhow it goes together and then I eat it (or at least taste it! LOL).<br/>\n<br/>\nAnd I love watching them Shine while they do something they enjoy.<br/>\n<br/>\n~Susan McGlohn</div>","specialLinks":[]},{"userId":93086594,"authorName":"Sears Family","from":"&quot;Sears Family&quot; &lt;brewstersears@...&gt;","profile":"birthinlove","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Questions regarding video games","postDate":"1113949224","msgId":105485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMjkwMWM1NDUyZCRmYjU4YzFiMCQ2NDAxYThjMEBTRUFSU0M+","referencesHeader":"PDE1LjQzMTMzZDI5LjJmOTZhNTQ0QGFvbC5jb20+"},"prevInTopic":105456,"nextInTopic":105499,"prevInTime":105483,"nextInTime":105486,"topicId":105450,"numMessagesInTopic":0,"msgSnippet":"... ______________________________________ Hi Sandra, Yes, well, the real for-instance is my latest drop in confidence regarding video games timing itself with","messageBody":"<div id=\"ygrps-yiv-1797845508\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Do you have a real for-instance, or is this hypothetical?<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n </span></blockquote>______________________________________<br/>\n<br/>\nHi Sandra,<br/>\n<br/>\nYes, well, the real for-instance is my latest drop in confidence regarding <br/>\nvideo games timing itself with my ds&#39;s latest passion for Game Cube.  Of <br/>\ncourse!  But, what you are saying about the parent not getting involved <br/>\ncould strain the relationship with the child b/c tthe parent is not <br/>\nunderstanding and undermining the child - is really ringing true.  My <br/>\nknee-jerk reaction wanted to just limit the video games - but I knew I <br/>\ncouldn&#39;t, knew I wouldn&#39;t be accomplishing anything but fighting and <br/>\nresistance and more disconnect.  I was definitely needing some <br/>\nreminders/refocusing of my thinking and beliefs surrounding video game <br/>\nplaying so I could get back on board the confidence boat.  Your comments <br/>\nhelped tremendously - THANK-YOU - I am not a video game lover at heart, so I <br/>\nneed some prodding.  On my own, I was already realising that I need to sit <br/>\nback down with him and play a little bit, find more out about the games, and <br/>\nthis has already brought back my respect for the thinking that IS going on <br/>\nin various ways while he plays.<br/>\n<br/>\nIt is also very reassuring to hear that he will find benefit in the video <br/>\ngames even if I&#39;m not playing - b/c I do find it hard to sit down with him <br/>\nfor the length of time he plays, along with having 2 other children to <br/>\nattend to who do not love video games.  His father plays with him alot - so <br/>\nthey connect deeply over the video games, and I am going to make a more <br/>\nconcerted effort to get more involved than I have been - I really do love <br/>\nadmiring what he does, and it sure does make it easier when you understand <br/>\nwhy they&#39;re doing it.<br/>\n<br/>\nThank-you again!<br/>\n<br/>\nMichele</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Questions regarding video games","postDate":"1113934660","msgId":105456,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1LjQzMTMzZDI5LjJmOTZhNTQ0QGFvbC5jb20+"},"prevInTopic":105450,"nextInTopic":105485,"prevInTime":105455,"nextInTime":105457,"topicId":105450,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/19/05 10:28:26 AM, brewstersears@sympatico.ca writes: ","messageBody":"<div id=\"ygrps-yiv-200577384\">In a message dated 4/19/05 10:28:26 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brewstersears@...\">brewstersears@...</a> writes:<br/>\n<br/>\n&lt;&lt;  Can playing with them just mean watching them play and talking about it? <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>Yes!<br/>\n<br/>\nBeing with them, knowing why they love what they love, what they&#39;re good at <br/>\nin the game, what they&#39;re thinking about it, and learning, whom they&#39;re <br/>\nimpressing or impressed by.<br/>\n<br/>\n&lt;&lt;What exactly are the benefits of playing/watching video games with them <br/>\nversus NOT playing/watching the video games with them?  &gt;&gt;<br/>\n<br/>\n&quot;Exactly&quot;? Not vaguely?<br/>\nIt depends on the child, family and the game what the exact benefits will be.<br/>\n<br/>\nI think the main danger of NOT playing or even watching is that the parents <br/>\nwill be ignorant of the depth and difficulty of the game, and could easily and <br/>\nthoughtlessly belittle the child for &quot;doing nothing&quot; or wasting time or think <br/>\nthat it&#39;s a &quot;stupid game.&quot;  Even a parent who&#39;s a great actor and never <br/>\nindicates it overtly to the child is still damaging the parental image and <br/>\ndefinition of that child if she even THINKS the child is a time-waster doing and <br/>\nlearning nothing.<br/>\n<br/>\nUnschooling will work better when the parent really understands the child&#39;s <br/>\ndays and friends and interests and experiences than when the interactions <br/>\nbetween child and parent are all parentally chosen/approved/slanted.<br/>\n<br/>\nI haven&#39;t even tried to play Halo II, but I&#39;ve hung around it and watched <br/>\nenough that I get most of the jokes on Red vs. Blue, and had asked Kirby and <br/>\nMarty enough questions about what they were doing and how LAN parties worked that <br/>\nwhen they started playing online I could discuss it fairly intelligently (for <br/>\na non-playing mom).  Yesterday Holly and I were alone in the car (going to <br/>\npick Keith up from the hospital--hooray!) and I told her that Rosie Sorooshian <br/>\nhad gotten to go to a Halo II LAN party with 16 or 20 kids and Holly said <br/>\nprobably 16, because that&#39;s how many can play on one hub at once.  (LAN parties are <br/>\nwhere they get lots of computers or gaming systems in one physical building <br/>\nand network them together for one big interactive game.)   So I asked Holly if <br/>\nthat&#39;s why on X-Box live the teams are 8 on 8.  Yes.  That&#39;s why.     COOL! <br/>\n<br/>\nKirby played a WONDERFUL video of part of an a capella concert that&#39;s on <br/>\neBaum&#39;s world, with a group of a dozen or so singers doing theme songs and <br/>\nbackground music from video games.  It&#39;s incredible.  Then some of them act out parts <br/>\nof the games.   I recognized them (and so could get some of the jokes) on all <br/>\nbut one of the games, and had to ask which game that one was.   Had I never <br/>\npaid attention, we couldn&#39;t have shared that moment and I couldn&#39;t have <br/>\nspeculated with Kirby about how the music might&#39;ve been arranged and learned.<br/>\n<br/>\n-=-If we don&#39;t play video games with them, and they play unlimited, sometimes <br/>\nup to 6 hours a day without a parent present, then is the video game playing <br/>\nbecoming detrimental to the child&#39;s development? -=-<br/>\n<br/>\nI would think that parental non-involvement would become detrimental to the <br/>\nrelationship between parent and child.  Development would continue, but the <br/>\nparent and child relationship would be distanced and more strained, especially if <br/>\nthe parent oozes disapproval of the child&#39;s interest and involvement with <br/>\ngames.  Making a child stop playing a video game just because the parent has no <br/>\ninterest in it wouldn&#39;t be a good move, I don&#39;t think, either.  <br/>\n<br/>\nSome parents don&#39;t want to really know their children.  If those parents are <br/>\nunschoolers, they will run into problems, and it will be a shame if they blame <br/>\nvideo games or TV or books or something the child IS getting feedback from <br/>\nand being soothed by.<br/>\n<br/>\nDo you have a real for-instance, or is this hypothetical?<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":93086594,"authorName":"Sears Family","from":"&quot;Sears Family&quot; &lt;brewstersears@...&gt;","profile":"birthinlove","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Questions regarding video games","postDate":"1113913248","msgId":105450,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTMwMWM1NDRkYSQzODdlMDc3MCQ2NDAxYThjMEBTRUFSU0M+"},"prevInTopic":0,"nextInTopic":105456,"prevInTime":105449,"nextInTime":105451,"topicId":105450,"numMessagesInTopic":0,"msgSnippet":"Hello, What are the differences between unschoolers playing video games and school kids playing video games? If playing the video games with our children is an","messageBody":"<div id=\"ygrps-yiv-1470094083\">Hello,<br/>\n<br/>\nWhat are the differences between unschoolers playing video games and school kids playing video games?  <br/>\n<br/>\nIf playing the video games with our children is an important factor in maximizing the benefits of video games, then how much playing with them does this mean?  My son is so accomplished that playing with me means coming down about 10 levels.  Can playing with them just mean watching them play and talking about it?<br/>\n<br/>\nWhat exactly are the benefits of playing/watching video games with them versus NOT playing/watching the video games with them?  <br/>\n<br/>\nIf we don&#39;t play video games with them, and they play unlimited, sometimes up to 6 hours a day without a parent present, then is the video game playing becoming detrimental to the child&#39;s development? <br/>\n<br/>\n<br/>\nMichele <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":54066,"nextTopicId":105512}}