{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":40256956,"authorName":"jmcseals SEALS","from":"&quot;jmcseals SEALS&quot; &lt;jmcseals@...&gt;","profile":"sevenhavei","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest","postDate":"1053401386","msgId":70060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtRjVCWjQxN2JkSGQyVjQwMDAyZGU3OUBob3RtYWlsLmNvbT4="},"prevInTopic":46594,"nextInTopic":0,"prevInTime":70059,"nextInTime":70061,"topicId":10415,"numMessagesInTopic":0,"msgSnippet":"That s wonderful, Michele!  What a great story! :) Jennifer _________________________________________________________________ MSN 8 with e-mail virus","messageBody":"<div id=\"ygrps-yiv-1441981601\">That&#39;s wonderful, Michele!  What a great story! :)<br/>\n<br/>\nJennifer<br/>\n<br/>\n_________________________________________________________________<br/>\nMSN 8 with e-mail virus protection service: 2 months FREE*  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/virus\">http://join.msn.com/?page=features/virus</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest","postDate":"1034796217","msgId":46594,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxMDMtM0RBREJDQjktNjk4QHN0b3JlZnVsbC0yMzcyLnB1YmxpYy5sYXdzb24ud2VidHYubmV0Pg==","inReplyToHeader":"VW5zY2hvb2xpbmctZG90Y29tQHlhaG9vZ3JvdXBzLmNvbSdzIG1lc3NhZ2Ugb2YgMTYgT2N0IDIwMDIJMTY6MTE6MTggLTAwMDA="},"prevInTopic":43840,"nextInTopic":70060,"prevInTime":46593,"nextInTime":46595,"topicId":10415,"numMessagesInTopic":0,"msgSnippet":"I think marijuana should be made legal for pain relief. I recall my greatgrandmother purchasing some green powder from the local drugstore back in the 60 s and","messageBody":"<div id=\"ygrps-yiv-2056808395\">I think marijuana should be made legal for pain relief. I recall my<br/>\ngreatgrandmother purchasing some green powder from the local drugstore<br/>\nback in the 60&#39;s and burning it. She was dying of pnemonia at the time,<br/>\nI believe. I am not sure but I think it was pot or something of that<br/>\nnature. <br/>\nI have 6 kids and the older ones have all tried marijuana, alcohol and<br/>\ncigerettes. My husband and I have tried it all too when we were teens.<br/>\nWhat I try to get across to my kids is that it isn&#39;t only the drugs,<br/>\nalcohol, etc. it is the people that come with these experiences. The<br/>\nfist fights, the sex for drugs that ends up in an unwanted pregnancy,<br/>\nthe diseases, the guilt, shame, anger, defeat, etc. The negativity.<br/>\nPeople who feel worthy, loved, care-free, fulfilled usually are able to<br/>\nlet go of the idea quicker that some outside &quot;thing&quot; will MAKE them<br/>\nhappy, friends, quick money, etc. We live in a small town - about 10,000<br/>\n- in rural Vermont. Almost every teen male we know sells drugs to make<br/>\neasy money. Last week one of the teens that came to live with us<br/>\n(daughters friend since childhood) from Florida got drunk and fell/was<br/>\nthrown off a deck and broke her wrist so badly that she has 4-5 screws<br/>\nin it and a cast up to her shoulder. The other teen who came to live<br/>\nwith us who really likes drugs and alcohol but was not using went home<br/>\nto visit her parents and slit her wrist, needing 4-5 stitches. Her<br/>\nadoptive mother keeps telling her she is unwanted, besides other issues.<br/>\nOur family is in an unheavel at this time. My oldest daughter thinks we<br/>\nare all nuts and doesn&#39;t want to talk to any of us. I called my oldest<br/>\nson to talk to him. He lives with his girlfriend and her alcoholic<br/>\nfather. The father answered the phone by saying &quot;everyone is dead.&quot; I<br/>\nhung up because if I didn&#39;t I would have told him what I thought of him<br/>\nand I didn&#39;t want to cause my son any grief. That son smoked 4 joints a<br/>\nfew years ago with a few friends and it triggered a psychotic break<br/>\ndown. He hasn&#39;t been the same since. I mean that. He is a wonderful,<br/>\nsensitive, caring young man who has been deeply injured. He works at a<br/>\nliquor store and sees a great majority of adults from our town buying<br/>\nliquor Monday - Sunday. Some buy it in the little bottles so they can<br/>\nsneak it to work, while driving, etc. They say it is their &quot;happy<br/>\njuice.&quot; This is their life. Day in and day out. Trying to hide and<br/>\nself-medicate. It is supposed to be a secret. Yet, the secret is out. We<br/>\nall have choices to make no matter what happens to us or doesn&#39;t happen<br/>\nfor us in life. Looking back I did the best I knew how. I do the best I<br/>\ncan at this time, too. What I see for the kids who are using is that<br/>\nthere is a lack of communication, forgiveness, unconditional love,<br/>\ntalking, action, etc. in their lives with their parents. It is difficult<br/>\nand painful at times to come face to face with our own shortcomings, our<br/>\nown embarrassments, our shame, guilt, etc. When we have teens/kids they<br/>\nhave a way of triggering things in us. They push our buttons, push us to<br/>\nthe edge, push us away (and still have a need for us), etc. My kids know<br/>\nI used and what experiences I had. They know some of my friends are dead<br/>\nbecause they stayed on the negative path. Even with telling my kids and<br/>\nother teens this, they will still make their own decisions. We can guide<br/>\nand share - we do not own anyone. Today I may be saying goodbye to a<br/>\ndaughter. This is normal. It has been this way generation after<br/>\ngeneration. Kids grow up and seperate from us. I am letting go. It hurts<br/>\nand there is joy. I know I gave her all I had to give. It is up to her<br/>\nnow. Michele<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest","postDate":"1031869096","msgId":43840,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0NTUxLTNEODExMkE4LTUxMUBzdG9yZWZ1bGwtMjM3MS5wdWJsaWMubGF3c29uLndlYnR2Lm5ldD4=","inReplyToHeader":"VW5zY2hvb2xpbmctZG90Y29tQHlhaG9vZ3JvdXBzLmNvbSdzIG1lc3NhZ2Ugb2YgMTIgU2VwIDIwMDIJMTc6MTg6NDQgLTAwMDA="},"prevInTopic":10415,"nextInTopic":46594,"prevInTime":43839,"nextInTime":43841,"topicId":10415,"numMessagesInTopic":0,"msgSnippet":"I finally - after 4 months - got  a used computer - Dell 266. I bought my two sons Oregon Trail and they have been playing it for two days straight. My 14 year","messageBody":"<div id=\"ygrps-yiv-1966413980\">I finally - after 4 months - got  a used computer - Dell 266. I bought<br/>\nmy two sons Oregon Trail and they have been playing it for two days<br/>\nstraight. My 14 year old son has dyslexia and wasn&#39;t reading much -<br/>\ntired of being forced to read meaningless words, etc. at public school.<br/>\nI was concerned that he would get bored or frustrated quickly because<br/>\nthe game has a lot of reading to it. He really loves it. I am happy for<br/>\nhim. I have been watching the two boys as their interest and surprise<br/>\ngrows that they can go about their learning naturally. My 14 year old<br/>\nhas yelled at me a couple of times saying, &quot;You&#39;re the teacher tell me<br/>\nwhat to do!&quot; He is &quot;in transition&quot;:) as I am. Michele<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;tracy.oldfield@...&gt;","replyTo":"LIST","senderId":"WpAcXcjJikV4hERpt76La-V5tC8V6zkjtxRZjvd1s6gY9ZKWYuzE3PFye98j0LlqwHoiSOhZ8Ez0mkuwfNZ4LiJXemWfdWapy28YRfwlqRppymrczw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Digest","postDate":"962548979","msgId":10415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NUY2MzAzLjMzODAuMTNCMzg1RUBsb2NhbGhvc3Q+"},"prevInTopic":0,"nextInTopic":43840,"prevInTime":10414,"nextInTime":10416,"topicId":10415,"numMessagesInTopic":0,"msgSnippet":"As I said before, I ve returned home from a week away to find 37 digests for this group in my inbox.  Now, while I m glad to see that this list is thriving,","messageBody":"<div id=\"ygrps-yiv-1851715790\">As I said before, I&#39;ve returned home from a week away to find 37 <br/>\ndigests for this group in my inbox.  Now, while I&#39;m glad to see that <br/>\nthis list is &#39;thriving,&#39; (now where did I put that &#39;the life-cycle of an e-<br/>\nlist&#39; message???) I just want to point out that for anyone on digest <br/>\nit&#39;s a HUGE PITA to have posts repeated in folks replies.  I <br/>\nparticularly got bored of seeing the unschooling-dotcom egroup sig <br/>\nfile up to 5 times on certain messages.  I personally find it useful to <br/>\ninclude the relevant part(s) of the message I&#39;m replying to, but <br/>\nPLEASE use that ol&#39; pair of scissors when replying with the original <br/>\nmessage included.  Also, since the time-frame (and potential <br/>\nvolume of email) can be very variable from original to reply, it does <br/>\nhelp to follow the thread if the relevant part is included.  <br/>\n<br/>\nPlease, folks, spare a thought for those on digest!!<br/>\n<br/>\nTracy</div>","specialLinks":[]}],"prevTopicId":56509,"nextTopicId":70039}}