{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":149430489,"authorName":"Karin","from":"&quot;Karin&quot; &lt;roundhouse208@...&gt;","profile":"freeinphx","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064291679","msgId":81242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyZDcwMWMzODE4YyQwMjU0NzVjMCRlYjRkMzU0MkBnb2R6aWxsYT4=","referencesHeader":"PDEwNjQyNTM3MzAuNDQ2Mi41MTc2Ny5tMTZAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":81241,"nextInTopic":81255,"prevInTime":81241,"nextInTime":81243,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"... We had a very busy weekend so I was happy that nothing was planned for our Monday today. I spent most of the day catching up on e-mail and reading 45","messageBody":"<div id=\"ygrps-yiv-59120801\">Tia Graham &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Still green on unschooling, and hearing how others&#39; spend thier days is<br/>\n&gt;very helpful. I&#39;d imagine  you do this fairly often, but if you can stand<br/>\n&gt;it once more, please do ;-). &gt;&gt;<br/>\n<br/>\n </span></blockquote>We had a very busy weekend so I was happy that nothing was planned for our<br/>\nMonday today.<br/>\n<br/>\nI spent most of the day catching up on e-mail and reading 45 digests (I was<br/>\nWAY begind - not just this list, but a lot of it was!), did a couple loads<br/>\nof laundry, and made meals several times for my boys and me. Ben (12 yo) and<br/>\nJonny (10 yo) spent most of the day playing their game systems, alternating<br/>\nbetween the Gamecube, PS2 and their PC&#39;s. Ben got his PS1 working after<br/>\nbelieving that it was broken for over a year! He said he just plugged it in,<br/>\nand it worked. He was so excited. He played some games on it for a while,<br/>\nand then it stopped working again. :-/ I told him that maybe it has an<br/>\noverheating problem.<br/>\n<br/>\nI also unexpectedly found the plug-in cord for Ben&#39;s portable<br/>\nstereo/cassette player, which was hidden in a box in the closet, which has<br/>\nbeen lost since we moved (in May!). I always knew I would find it when I<br/>\nleast expected it. Ben and Jonny have also been watching a little TV now and<br/>\nthen, and they just got the (snail) mail for me, which involved a short bike<br/>\nride to our mailbox.<br/>\n<br/>\nI have to think about what to make for dinner, soon, then DH comes home and<br/>\nwe&#39;ll eat. We&#39;ll probably watch a couple hours of TV, and go to bed. And<br/>\nthat was our day! I need these relaxing, do nothing days as much as I need<br/>\nproductive, on-the-go days, too.<br/>\n<br/>\nTomorrow I&#39;ll probably tackle some bigger projects around the house (like<br/>\nlooking into curtains for my boys rooms) and I also want to pick my prickly<br/>\npear cactus fruits and experiment in making *something* edible with them -<br/>\nbecause they&#39;re just going rotten and the birds are getting them! And, my<br/>\nboys will probably help me do these things, because playing computer games<br/>\nand watching TV gets boring after a while. :o)<br/>\n<br/>\nKarin<br/>\nwho mostly lurks but felt like posting something today</div>","specialLinks":[]},{"userId":146409249,"authorName":"glad2bmadly","from":"glad2bmadly &lt;glad2bmadly@...&gt;","profile":"glad2bmadly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064282809","msgId":81255,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwOTIzMDIwNjQ5LjE4NDY5LnFtYWlsQHdlYjQyMDA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDIwMDMwOTIyLjExMTMzMC4tMzY5NjAxLjkuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":81242,"nextInTopic":0,"prevInTime":81254,"nextInTime":81256,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"Tia Graham  wrote: ***Still green on unschooling, and hearing how others spend thier days is very helpful. I d imagine  you do this","messageBody":"<div id=\"ygrps-yiv-2136411886\">Tia Graham &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a>&gt; wrote:<br/>\n***Still green on unschooling, and hearing how others&#39; spend thier days is<br/>\nvery helpful. I&#39;d imagine  you do this fairly often, but if you can stand<br/>\nit once more, please do ;-).**<br/>\n<br/>\nWe had rain here in GA for the first time in about a month, which was really good for our farm.  We drove 30 min away to drop off my car for a tune-up and went to Home Depot so that Nicolas could get a tool he needs to fix the irrigation.  We ended up wandering around Home Depot, Gillen (6yo) looking at wood and accessories for structures he wants to build, Jesse(3yo) trying to get us to buy dinosaur room border paper that we just don&#39;t have any wall space for.  It was neat seeing other school age kids there with parents or grandparents.  It wasn&#39;t the zoo it is on the weekends.<br/>\n<br/>\nNicolas dropped us off at home and went to the farm to work in the rain.  Gillen and Jesse  worked on an Endagered Species puzzle (it&#39;s round and very detailed with info about each animal on the back of each piece; Jesse&#39;s favorite) for about an hour.  Gillen found an old animal workbook that had a game in it which we pulled out and played a bit. Really, the best part of this was that they got to cut it out and put it together after which they lost interest. Jesse then talked us into playing a dinosaur game that he made up on the spot using his dinosaur parts cards.  Shortly therafter my friend came over with her 6 and 10 yo and the four of them jumped on the wet trampoline for over an hour.  It was only drizzling, no lightning.  This group takes turns jumping (with everyone on the tramp) and they also always end up creating scenarios (on the tramp) with one being mom, another dad and the others pets or babies.  They came in, changed out of wetclothes and in pairs played Zoombinies<br/>\n and Dinosaur Hunter on the computer.  They played store, in their room, at one point.  The big shocker was when my friend said it was time to go, we found Gillen and the 6yo girl in his bed with an early reader book.  They said they were reading it.  They aren&#39;t really reading much yet.  Later Gillen told me they were pretending to be mommy and daddy (just as they see their parents read in bed at night).  The shocker to me is not that they were &quot;playing mommy and daddy&quot; (although it did give me pause) but that they werechoosing reading, on their own. Not really so shocking when I read about other unschooling kids doing it. I don&#39;t think I had really known it would happen though or at least not yet. And it has been, in several ways lately! :)<br/>\n<br/>\nNicolas came home early which was very unusual and wonderful and we watched a movie my father had given to them, &quot;Napolean&quot; (about a dog&#39;s adventures in Australia) which started us talking about Australia, where my brother and his fiancee (she is from Australia) are soon to be married.  <br/>\n<br/>\nIt was very unusual to have hschooling friends over - their schedules and ours don&#39;t often allow for it, unfotunately.  So that was great.  I love rainy days. Tommorow, they go to the farm for the afternoon while I teach a kids&#39; theatre class at Montessori. <br/>\n<br/>\nMadeline <br/>\nYahoo! Groups SponsorADVERTISEMENT<br/>\n<br/>\n&quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\nTo unsubscribe from this send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nYahoo! SiteBuilder - Free, easy-to-use web site design software<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: how are ya&#39;ll spending your day today?","postDate":"1064273113","msgId":81241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJrbzBjcCtwM2d2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMwOTIyLjExMTMzMC4tMzY5NjAxLjkuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":81240,"nextInTopic":81242,"prevInTime":81240,"nextInTime":81242,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"Hi Tia :) I love what we did today posts, too...reminds me that my kids DON T spend every waking moment in front of the screen ...Today, Robby and I made","messageBody":"<div id=\"ygrps-yiv-634981609\">Hi Tia :)<br/>\n<br/>\nI love &quot;what we did today&quot; posts, too...reminds me that my kids DON&#39;T <br/>\nspend every waking moment in front of &quot;the screen&quot;...Today, Robby and <br/>\nI made hasbrowns and fried eggs for breakfast, and he helped dry the <br/>\ndishes; everyone pitched in on straightening up a (very!!!) cluttered <br/>\nliving space; Katie worked on some Bible memorization, hammered some <br/>\nboards together and smashed her finger, and then bandaged it up with <br/>\na thick pad of gauze and tape; Abbie sniffled and blew her nose all <br/>\nday...has a cold; she also cleaned up her room and spent a couple of <br/>\nhours writing in her journal. Because the local grocery store didn&#39;t <br/>\nhave Benadryl for colds, I bought her some medicinal tea, which she&#39;s <br/>\nbeen drinking all day. <br/>\n<br/>\nEveryone has played a little computer; We went rock hopping, and <br/>\neveryone including the dog, found a nice cool place to kick back and <br/>\nrelax. My cool kick back place had neon green lichen and we wondered <br/>\nwhy it would be such a bright green. Becaues it&#39;s always in the <br/>\nshade? Also, a dead fox that we saw up there in the spring, is now <br/>\nnothing but bones and bits of fur. Robby found the pelvic bone of a <br/>\nteeny tiny animal, probably a mouse; I cleaned off the back deck. <br/>\nWe&#39;ve been listening to Hank the Cow Dog books on tape all day long, <br/>\nmade some designs and pictures w/colored pencils, made toffee bars <br/>\n(slurp!) and right now, there&#39;s some food in the kitchen for when <br/>\nanyone gets hungry, to make themselves a plate. Which Abbie and Katie <br/>\ndid before leaving on a bike ride.<br/>\n<br/>\nTomorrow, it&#39;s dog-washing day. We also have a library run planned, <br/>\nalong with picking up a few ingredients needed for a Middle Earth <br/>\nFeast to celebrate the Autumn Equinox. I&#39;ll probably also pack a few <br/>\nmore boxes, and get boxes sealed and labeled, that are already packed.<br/>\nThe other day, I bought a three pack of famous marches at the dollar <br/>\nstore...gonna put those in while I get busy packing...energize me!<br/>\n<br/>\nOH! By the WAAAAY!!!<br/>\n<br/>\nKatie is taking huge strides forward in her reading! Yippeeee! <br/>\n<br/>\nblessings, HeidiC<br/>\n<br/>\np.s. I love your idea of the kids drawing pics while being read to, <br/>\nand tell us more about a grilled pizza?<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, Tia Graham <br/>\n&lt;sixredheads@j...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Still green on unschooling, and hearing how others&#39; spend thier <br/>\n </span></blockquote>days is<br/>\n<blockquote><span title=\"ireply\"> &gt; very helpful. I&#39;d imagine  you do this fairly often, but if you can <br/>\n </span></blockquote>stand<br/>\n<blockquote><span title=\"ireply\"> &gt; it once more, please do ;-).<br/>\n&gt; <br/>\n&gt; I&#39;ve got a 7 year old boy, almost 6 year old girl, and a 3 year old <br/>\n </span></blockquote>boy<br/>\n<blockquote><span title=\"ireply\"> &gt; here. Today we began reading the book of Luke from the bible...the<br/>\n&gt; miracles of Jesus Christ, straight from the bible rather than a <br/>\n </span></blockquote>story<br/>\n<blockquote><span title=\"ireply\"> &gt; book. We did another chapter of The Incredible Journey, which the <br/>\n </span></blockquote>kids<br/>\n<blockquote><span title=\"ireply\"> &gt; draw as I read, so that they end up with an illustrated version by <br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"qreply\"> &gt; end. </span></blockquote></div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064272626","msgId":81240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFjLjQ3ZDFkYjkyLjJjYTBkY2YyQGFvbC5jb20+"},"prevInTopic":81237,"nextInTopic":81241,"prevInTime":81239,"nextInTime":81241,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"I started the day with my typical Monday, Tuesday, Wednesday phone call from my bestfriend, at seven. I got up and went over to her house so she could leave","messageBody":"<div id=\"ygrps-yiv-514875414\">I started the day with my typical Monday, Tuesday, Wednesday phone call from <br/>\nmy bestfriend, at seven. I got up and went over to her house so she could <br/>\nleave for work by 7:30, and I get her kids on the bus an hour later, safe with <br/>\nbreakfast eaten and hair done etc. I gave the usual hugs and kisses good-bye and <br/>\nher little boy said; &quot;Nancy, you don&#39;t have to wait for the bus to come.&quot; and <br/>\nI told him that was all right, I liked to see that he got on safe. He asked if <br/>\nit was because his mom asked me to, and I said yes, partially, but mostly be<br/>\ncause I love him and his sister and would hate for something to happen when I <br/>\ncould have prevented it by just sticking around for five more minutes. Then his <br/>\nsister said; &quot;You always tell us you love us, do you really?&quot; (I&#39;m sitting in <br/>\nmy car wondering where all these questions are coming from!) and I told her <br/>\nthat yes, I do really love them both. That I love them like they are my own <br/>\nkids since their mom and I grew up together like sisters, and I was in their <br/>\nlives from the get go, and I would always love them. So I sent two beautiful kids <br/>\noff to school happy and safe this morning, and that made me happy, but sad too.<br/>\n<br/>\nI went home, it was almost nine. Darin took the day off after a weekend of <br/>\ninventory and was still asleep. Jack was playing on the computer and watching <br/>\ncartoons. Moly was asleep beside her daddy, so I kissed Jack and asked if he had <br/>\nfood. He did, I crawled back in bed and Moly, ever the mommy, asked me if I <br/>\nhad remembered to go to Penny&#39;s. &lt;g&gt; I had. Gotta love that kid! We all slept <br/>\nfor about an hour then everyone got up. Darin and Jack watched Moly train our <br/>\ndog Maggie. Then they all headed out to the basketball court. I did some <br/>\nlaundry, made an effort at pushing the vacuum around the room and decided it was too <br/>\nnice and followed the family to the court. I took a book and the dog and we <br/>\nlounged on the warm court while Darin and the kids played. Then we all took <br/>\nturns with Jack&#39;s new pocket knife, it has lots of cool gadgets! When we got home <br/>\nabout three, we ate and played some cards. The kids went outside to play, <br/>\nJack worked on his bike and got the chain on all by himself. Moly picked <br/>\ncucumbers, tomatoes, peppers and cantaloupe. Then Moly and I sorted through all our <br/>\nnewest finds from the second hand store. I spent about thirty dollars the other <br/>\nday and both kids have enough clothes for the winter. (Moly found a pair of <br/>\nearth shoes for 2.50 and it was white tag day so she got them for half off, she <br/>\nwas excited.) We just need to get coats, and neither found coats they liked. <br/>\nSo we will keep looking. I might even break down and go to *gasp* a department <br/>\nstore! Moly is making tapioca right now and Jack is at the neighbors. Darin is <br/>\nreading about the new Harry Potter movie to Moly. She is very disappointed <br/>\nthat the movie isn&#39;t coming out on my birthday this year and that she has to <br/>\nwait until June of next to see it. <br/>\n<br/>\nThis evening, I think we will watch some movies or maybe go for ice-cream, or <br/>\nmaybe both. I&#39;m going to finish my book and Moly says she is going to finish <br/>\nhers too. One of the kids who works for Darin called and said he has finished <br/>\nhis most recent Shoen Jump and is going to bring it by for Jack. Jack is <br/>\nexcited about that. <br/>\n<br/>\nIt was kind of a quiet day, but nice. Darin was home and the kids love that. <br/>\nWe have no plans for tomorrow.<br/>\n<br/>\n~Nancy<br/>\n<br/>\nHe felt that his whole life was some kind of dream and he sometimes wondered <br/>\nwhose it was and whether they were enjoying it.<br/>\nDouglas Adams <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":149995806,"authorName":"catherine aceto","from":"&quot;catherine aceto&quot; &lt;aceto3@...&gt;","profile":"cat4cat15217","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064269821","msgId":81237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2EwMWMzODE1OSQxYzBkNDUxMCQ2NDAyYThjMEAyMDAyZGVza3RvcD4=","referencesHeader":"PDIwMDMwOTIyLjExMTMzMC4tMzY5NjAxLjkuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":81233,"nextInTopic":81240,"prevInTime":81236,"nextInTime":81238,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"I love reading threads about what people do each day. I have a 5, almost 6 year old girl.  Today, we colored some salt with liquid watercolors and filled up","messageBody":"<div id=\"ygrps-yiv-1982103383\">I love reading threads about what people do each day. <br/>\n<br/>\nI have a 5, almost 6 year old girl.  Today, we colored some salt with liquid watercolors and filled up babyfood jars with designs. We played our way through a book called &quot;Gears&quot; or something like that where you make things with gears, rack and pinions, crank and rockers, etc. (cool book, I highly recommend it).  We went to Lydia&#39;s gymnastics class.    In the car on the way home from gymnastics, Lydia figured out (I guess she figured it out-  in any event, I didn&#39;t tell her) explained to me that you could add 4+4 by saying 1,5; 2,6;3,7,4,8.  We played with Dora colorforms and she made up a story (or maybe a play -- she &quot;closed the curtain/box lid&quot; between the &quot;acts&quot;) and illustrated it with the colorforms as she went along. She spelled some words with the letters from her alphabet pasta that was either an early dinner or a late lunch.  Right now she has a friend over and they are playing Scooby Doo Mystery on the computer.  Later we&#39;ll probably do some art/craft sort of thing (we usually do that in the evening while my husband plays with our 10month old son). <br/>\n<br/>\ncat<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Tia Graham <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschoolingdiscussion@yahoogroups.com\">unschoolingdiscussion@yahoogroups.com</a> <br/>\n  Sent: Monday, September 22, 2003 11:13 AM<br/>\n  Subject: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?<br/>\n<br/>\n<br/>\n  Still green on unschooling, and hearing how others&#39; spend thier days is<br/>\n  very helpful. I&#39;d imagine  you do this fairly often, but if you can stand<br/>\n  it once more, please do ;-).<br/>\n<br/>\n  I&#39;ve got a 7 year old boy, almost 6 year old girl, and a 3 year old boy<br/>\n  here. Today we began reading the book of Luke from the bible...the<br/>\n  miracles of Jesus Christ, straight from the bible rather than a story<br/>\n  book. We did another chapter of The Incredible Journey, which the kids<br/>\n  draw as I read, so that they end up with an illustrated version by the<br/>\n  end. That&#39;s coming out as a pretty hard book and I gave up going over the<br/>\n  vocabulary....just have to chalk it up to &quot;great language exposure&quot;. They<br/>\n  are enjoying it alot more now that I&#39;m not stopping every sentence to<br/>\n  tell them what a word means LOL! Sometimes we&#39;ve copied a nice sentence<br/>\n  from the chapter onto the drawing but no one wanted to do that today so<br/>\n  we skipped it. <br/>\n<br/>\n  From there we played a time-telling memory kind of game and put together<br/>\n  a puzzle of the human body, organ side up (bones are on the other side).<br/>\n  My 7 year old headed out to build on his fort and my 6 year old dd got<br/>\n  out a sequel movie of Lady and the Tramp ( a movie I barely tolerate<br/>\n  because of some very annoying parts of it).<br/>\n<br/>\n  I&#39;m thinking of making some banana pudding later today and a grilled<br/>\n  pizza; there&#39;s the ever constant housework to do and later this afternoon<br/>\n  will get interesting when the neighbor kids come home from school. We are<br/>\n  in a testy situation with some of them over bullying. Maybe I&#39;ll just<br/>\n  load everyone up and go to the library from then to dinner time!<br/>\n<br/>\n  How&#39;s your day going?<br/>\n<br/>\n  Tia in Florida<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  To unsubscribe from this send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":158112576,"authorName":"TeresaBnNC@aol.com","from":"TeresaBnNC@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064266718","msgId":81233,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OC4xOTdkMDhhYS4yY2EwYzVkZUBhb2wuY29tPg=="},"prevInTopic":81228,"nextInTopic":81237,"prevInTime":81232,"nextInTime":81234,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 3:52:19 PM Eastern Daylight Time, genant2@aol.com ... I like K nex better.  I dont know why.  To me K nex are like a cross between ","messageBody":"<div id=\"ygrps-yiv-134047719\">In a message dated 9/22/03 3:52:19 PM Eastern Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They are too hard for me to snap together and pull apart.  I <br/>\n&gt; prefer LEGOs although LEGOs are not as flexible.  But I have Kinex stuff <br/>\n&gt; everywhere.<br/>\n&gt; LOL<br/>\n&gt; Pam G<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I like K&#39;nex better.  I dont know why.  To me K&#39;nex are like a cross between <br/>\ntinker toys (LOVED those) and legos .   <br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":144628419,"authorName":"Kelli Traaseth","from":"&quot;Kelli Traaseth&quot; &lt;tktraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064260549","msgId":81228,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmMwMWMzODE0MyQ4NTRiOTFhMCRhMjMzMTlhY0B5b3VyZ2c4N3Zxem96cT4=","referencesHeader":"PDIwMDMwOTIyLjExMTMzMC4tMzY5NjAxLjkuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":81227,"nextInTopic":81233,"prevInTime":81227,"nextInTime":81229,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"... From: Tia Graham **Still green on unschooling, and hearing how others spend thier days is very helpful.** Remember, you asked for it   (sorry its so","messageBody":"<div id=\"ygrps-yiv-354777580\"><blockquote><span title=\"qreply\">----- Original Message ----- <br/>\n  From: Tia Graham <br/>\n<br/>\n  **Still green on unschooling, and hearing how others&#39; spend thier days is<br/>\n  very helpful.**<br/>\n<br/>\n  Remember, you asked for it &lt;g&gt;  (sorry its so long, I tried to condense it)<br/>\n<br/>\n  This was our morning... <br/>\n<br/>\n  First one up, my dh, out the door at 7:00.<br/>\n<br/>\n  Second one up, me,  shortly after I hear the door shut (it woke me up).  I like to have my morning tea/coffee at the computer,  reading through e-mail and news tidbits.<br/>\n<br/>\n  Third one up, Kyra dd(6), 9:00.  Sits with me a bit at the computer, decides she wants a ginger snap for breakfast, but loves them warm.  Pulls the chair over to microwave, asks how long, &quot;um, about 20 seconds&quot;, I say.  She asks &quot;what does 20 look like again?&quot;  &quot;2 and a 0&quot; I tell her.  &quot;Oh yeah&quot; she says.  Punches it in, hits start.  She likes to sit and watch the time click down from the start time.  She can also do this with just the clock portion,  using the timer.<br/>\n<br/>\n  As she is eating her cookie, she sees on Blues Clues that they have made some cars from cardboard boxes.  Ones that can hang on you and drive around, with you inside the box.  We go find a big box to make into a car.   I help her cut off some of the cardboard.  She takes it downstairs to start making it into a car.  I go back to the computer and finish up.<br/>\n<br/>\n  Fourth one up, Alec ds(10),10:30.  Sits down at the computer.  He had been playing the Lego backlot game on lego.com. this weekend, so continues that.  We find out that on movie making lots, cafeterias are called Commissaries.  I had to look that up. :) Finishes the three levels, beats the game.  He then goes into the Bionicle of Lego.com and finds the form to send in for his entry to &quot;Searching for the 7th Toa&quot;.  This is a contest that has been going on for about the last year.  Clues are given out each month through Lego magazine(free subscription).  The clues are written in the Bionicle language using their Matoran alphabet, so you have to decipher them. He&#39;s been doing this for months and now has the answer.  We print out the entry form.  Alec then goes downstairs to build some Bionicles.  <br/>\n<br/>\n  On a Bionicle tangent-- the Bionicle movie just came out, &quot;The Mask of Light&quot; and for a Lego type movie, its actually pretty cool.  Pretty good story.  So, we&#39;ve also been building Bionicles like crazy.  This has been really neat because all of us have been getting into building and playing with them.  We&#39;ve been reenacting the movie, making new adventures, using stuffed animals and other things, and creating other creatures to play with, out of other lego pieces.  Fun! <br/>\n<br/>\n  Fifth and final family member up, Abbi dd(8),11:00.  Abbi goes downstairs, watches TV for a bit. <br/>\n<br/>\n  Meanwhile, Kyra and I have been working on her car.  She figures out how to make a steering wheel, and attach it; a window out of aluminum foil; headlights; and how she&#39;s going to be able to steer the car and not hold the car up.  Her plan: pulls out yarn, is going to tie it to each side of the top of box(car) and then the car will hang around her neck.  She is then free to steer her car :)   This works, but the string digs into her neck!  Ouch!  So I go and grab an old sock to put between the string and her neck.  This works for a while, but the sock keeps falling out. <br/>\n<br/>\n  &quot;We could sew it on?&quot;  I say hesitantly because I am not a good sewer. &lt;-- (Eww, don&#39;t like the way that word looks!&lt;g&gt;)<br/>\n<br/>\n  Abbi is a good sewer though, so she would be glad to help.  She sews the sock together, on the yarn and Kyra has a pain free way of hanging her car on herself.<br/>\n<br/>\n  After sewing, Abbi and Alec start playing Crash Bash, a PS2 game.  <br/>\n<br/>\n  Kyra then wants to make a stop sign to put up in the house, so she can park her car.  Abbi stops playing PS2 for a minute, we talk about octagons, she helps to make a stop sign.<br/>\n  Kyra attaches the stop sign to her bedroom door, this is the parking lot for her car.  She then comes to me and wants the stairs up to the bedrooms to be a toll road.  We make a sign, a box to hold the toll and money to pay for the toll.<br/>\n<br/>\n  Now, since there is a toll road in our house, the kids have all decided that they need occupations to earn money.  They start making some money and credit cards (out of paper).  Each have decided on an occupation.  Kyra is a cab driver (with her car :)).  Abbi is an inn keeper with a restaurant, movie theater and store.  Alec is a hotel owner with an arcade(game systems), restaurant, and store.  I am the banker (at my computer screen) and I have to keep track of their credit card balances, they only get to charge $1000 on it. &lt;g&gt;<br/>\n<br/>\n  Eventually, we are going to go into town and order an icecream cake, Abbi&#39;s birthday is this week. Meet up with another family for Alec to sleep over at their house. And run some other errands.<br/>\n<br/>\n  These were all things that they thought up on their own.  I feel so lucky that I get to go along for the ride!<br/>\n<br/>\n<br/>\n  Kelli~<br/>\n<br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  .<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064260006","msgId":81227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEzLjQ5MGFhZjE3LjJjYTBhYmE2QGFvbC5jb20+"},"prevInTopic":81226,"nextInTopic":81228,"prevInTime":81226,"nextInTime":81228,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 2:07:31 PM Eastern Daylight Time, ... After we talked about Kinex stuff with you guys last Thursday my boys have been playing with","messageBody":"<div id=\"ygrps-yiv-824427895\">In a message dated 9/22/03 2:07:31 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:TeresaBnNC@...\">TeresaBnNC@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Ethan brought me his finished gargage.  It was  a spectacular creation.  He <br/>\n&gt; <br/>\n&gt; came up with a design of yellow and gray peices that made a solid wall.  It <br/>\n&gt; was <br/>\n&gt; totally cool.  <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>After we talked about Kinex stuff with you guys last Thursday my boys have <br/>\nbeen playing with the Kinex too.  Making all kinds of stuff to show JP the next <br/>\ntime you guys come over.  It is amazing to see what they can create.  I don&#39;t <br/>\nlike the stuff.  They are too hard for me to snap together and pull apart.  I <br/>\nprefer LEGOs although LEGOs are not as flexible.  But I have Kinex stuff <br/>\neverywhere.<br/>\nLOL<br/>\nPam G<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064259354","msgId":81226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MC4yMDAzOTU0NC4yY2EwYTkxYUBhb2wuY29tPg=="},"prevInTopic":81224,"nextInTopic":81227,"prevInTime":81225,"nextInTime":81227,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 12:31:56 PM Eastern Daylight Time, ... This is a description of Pharaoh from Dallen It is an Egyptian City building game.  You are","messageBody":"<div id=\"ygrps-yiv-839779864\">In a message dated 9/22/03 12:31:56 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amycats2@...\">amycats2@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Tell me about this game<br/>\n </span></blockquote>This is a description of Pharaoh from Dallen<br/>\nIt is an Egyptian City building game.  You are the position of Pharaoh, you <br/>\nhave to manage money, keep people happy, fed and entertained.  Some maps in the <br/>\ncustom games menu have no military activity, others have minor skirmishes to <br/>\nthe city is going to be besieged.  You also have to please the gods.  If you <br/>\ndo they will give you blessings.  If you don&#39;t they will curse your city.  Some <br/>\nmaps have only two gods available, some have many.  There are also natural <br/>\nresources such as gold.  You can earn money this way or collecting taxes.  There <br/>\nare animals to hunt such as antelope and birds. And you can farm. There are <br/>\nalso monuments and pyramids to build.  Over all it is a very good game. <br/>\nFrom Dallen and Pam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064254915","msgId":81224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkOC4xMTMxM2VkZS4yY2EwOTdjM0Bhb2wuY29tPg=="},"prevInTopic":81222,"nextInTopic":81226,"prevInTime":81223,"nextInTime":81225,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"... I answered some of this in another message.  We re sick here today, or at least two of us are. Got up at 8 or so and watched tv in bed while having","messageBody":"<div id=\"ygrps-yiv-303483798\"><blockquote><span title=\"ireply\">&gt; Still green on unschooling, and hearing how others&#39; spend thier days is<br/>\n&gt; very helpful<br/>\n<br/>\n </span></blockquote>I answered some of this in another message.  We&#39;re sick here today, or at <br/>\nleast two of us are.<br/>\n<br/>\nGot up at 8 or so and watched tv in bed while having breathing treatments.  <br/>\nBreakfast with Superman when they were ready.  The kids (5 and 4) held a <br/>\nbirthday party for Nemo with a lot of their animal friends while I did an <br/>\narcheological dig in the kitchen.  They put their friends down for a nap and then went <br/>\nupstairs to play with their fire station.  A short break for making cookies, <br/>\nrolling them out with cookie cutters and then the animals were awakened for the <br/>\npinata at the birthday party.<br/>\n<br/>\nRight now they are rolling around on my bed and I am contemplating providing <br/>\nsome kind of protein for lunch.  Because we&#39;ve been sick, they are really only <br/>\ninterested in toast and, today, cookies.  Aside from my lack of voice, we&#39;re <br/>\nhaving a pretty typical and fun day.  <br/>\n<br/>\nI&#39;ve got the easel up, so they might paint while I tie on a warp this <br/>\nafternoon.  Or they might decide to watch a movie and sleep.  We got the brio stuff <br/>\nout last night for the first time in months, so that&#39;s pretty inviting too.  <br/>\n<br/>\nOh, and Nathan read the word Vanilla, or guessed it, on the bottle.  Julia <br/>\ninstructed Nathan to put his cookie cutters at the edges so that they could make <br/>\nmore cookies in one roll.  So, we got math and reading in!<br/>\n<br/>\nElizabeth, trying to avoid pneumonia with this pregnancy.  That would be a <br/>\nfirst!<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064253613","msgId":81221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWEwMWMzODEzMyQ2MTMwYTkwMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PGQwLjNmMDFlMzM4LjJjYTA5MTgyQGFvbC5jb20+"},"prevInTopic":81220,"nextInTopic":81222,"prevInTime":81220,"nextInTime":81222,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"From:  ","messageBody":"<div id=\"ygrps-yiv-1881619314\">From: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a>&gt;<br/>\n<br/>\n&lt;&lt; Tomorrow Kirby gets his license and then goes to karate for two hours,<br/>\nand a<br/>\n staff meeting at work after that.  Marty is either going to help work<br/>\nelection<br/>\n reminders or pamphlets or something and get paid $40, or he&#39;s going to a<br/>\n gaming day with other homeschoolers,  He&#39;s still thinking about it.  Holly<br/>\nis<br/>\n unscheduled for Tuesday.&gt;&gt;<br/>\n<br/>\n<br/>\nJust curious about the laws there. You say Kirby is getting his license<br/>\ntomorrow and it sounds like he will just get it without having to do<br/>\nanything. Is there a test or did he already take one and has to have a<br/>\npermit for so long? Just wondering how that works where you are.<br/>\n<br/>\n<br/>\nMary B.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolingtshirts.com\">http://www.homeschoolingtshirts.com</a></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064253417","msgId":81220,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Yi4yNDA2OGE1NC4yY2EwOTFlOUBhb2wuY29tPg=="},"prevInTopic":81219,"nextInTopic":81221,"prevInTime":81219,"nextInTime":81221,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 9:34:31 AM, sixredheads@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-504986008\">In a message dated 9/22/03 9:34:31 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a> writes:<br/>\n<br/>\n&lt;&lt; Still green on unschooling, and hearing how others&#39; spend thier days is<br/>\nvery helpful. &gt;&gt;<br/>\n<br/>\nThere&#39;s a collection of lots of people&#39;s days here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064253314","msgId":81219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwLjNmMDFlMzM4LjJjYTA5MTgyQGFvbC5jb20+"},"prevInTopic":81209,"nextInTopic":81220,"prevInTime":81218,"nextInTime":81220,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 9:34:31 AM, sixredheads@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-147306117\">In a message dated 9/22/03 9:34:31 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sixredheads@...\">sixredheads@...</a> writes:<br/>\n<br/>\n&lt;&lt; That&#39;s coming out as a pretty hard book and I gave up going over the<br/>\nvocabulary....just have to chalk it up to &quot;great language exposure&quot;.  &gt;&gt;<br/>\n<br/>\nThe second or third time they hear a word in context, they&#39;ll pick up its <br/>\nmeaning.  Let it flow!<br/>\n<br/>\nToday so far is a sleep day.  Kirby got up and went to work.  I&#39;m glad he had <br/>\nset an alarm, because though I told him I&#39;d check at 10:30 to make sure he <br/>\nwas up, I forgot.  Today&#39;s the last day of his learner&#39;s permit, so I still have <br/>\nto be with him, but I think for work I&#39;ll still bring the car back because <br/>\nhe&#39;s there eight hours sometimes (like Mondays).<br/>\nStarting tomorrow, though, he can take himelf to karate, which will be really <br/>\nhelpful.<br/>\n<br/>\nMarty (14) camped all weekend and was really tired, so I don&#39;t expect him to <br/>\nwake up soon.<br/>\n<br/>\nHolly (11) had company yesterday, we went to Madrid (an hour or so away) and <br/>\nwalked all around town and up an arroyo and looked for rocks, and when we came <br/>\nback she and her friend worked for three hours playing with Barbies and <br/>\norganizing Barbieland (a closet under the stairs with shelves along the sides, and <br/>\nthe stairs turn, so it&#39;s a kid-only space).<br/>\n<br/>\nI expect today to be laundry and story-telling and putzing.  <br/>\n<br/>\nTomorrow Kirby gets his license and then goes to karate for two hours, and a <br/>\nstaff meeting at work after that.  Marty is either going to help work election <br/>\nreminders or pamphlets or something and get paid $40, or he&#39;s going to a <br/>\ngaming day with other homeschoolers,  He&#39;s still thinking about it.  Holly is <br/>\nunscheduled for Tuesday.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":158112576,"authorName":"TeresaBnNC@aol.com","from":"TeresaBnNC@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064252644","msgId":81222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNy4xMGQ3ODdjZS4yY2EwOGVlNEBhb2wuY29tPg=="},"prevInTopic":81221,"nextInTopic":81224,"prevInTime":81221,"nextInTime":81223,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 12:26:26 PM Eastern Daylight Time, genant2@aol.com ... YESS.. we are!  I am so excited.!  My kids and I actually went up on Friday ","messageBody":"<div id=\"ygrps-yiv-926608262\">In a message dated 9/22/03 12:26:26 PM Eastern Daylight Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We are going up in the mountains tomorrow to a Cheese <br/>\n&gt; Company and some site seeing in the beautiful fall mountains.  Should be <br/>\n&gt; tons of <br/>\n&gt; fun. <br/>\n<br/>\n </span></blockquote>YESS.. we are!  I am so excited.!  My kids and I actually went up on Friday <br/>\nfor a &quot;dry run&quot;  lol.. Good excuse to get the directions and such confirmed.  <br/>\nActually, we are going to my mother&#39;s hometown of West Jeffereson, NC.  She was <br/>\noff work Friday, so she took us up there to make sure we the best ( most <br/>\nscenic!) route.<br/>\n<br/>\n<br/>\nToday, I have been piddling on the computer.. Posting stuff about upcoming <br/>\nactivities for our local homeschool group..chatting with Pam, reading email, and <br/>\nI have to update the website for my church.   Anna has been making some bead <br/>\njewelry in her room.  Ethan and JP have alternated between watching TV, <br/>\nplaying N64 and playing with K&#39;nex.  We let our dog out, she just got spayed last <br/>\nweek.. She took the opportunity to run down to the pond.. We went after her and <br/>\ncorralled her back into the house.  We fed the puppies and the dogs and cats.<br/>\n<br/>\n   Anna, JP and I ( Ethan was engrossed in making a garage out of k&#39;nex)  <br/>\nwent to the store and picked up a few items. We ordered lunch to go at the <br/>\nadjoining grill.   JP didnt have any shoes on.. There was a lady and 3 children <br/>\neating in the restaurant.   Two of the kids looked early school age. ( say, 6-9).. <br/>\nthe other looked preschool age.   My first thought was &quot;OH, more <br/>\nhomeschoolers!.. But, they looked so unapproachable,I did not say anything to them.  We <br/>\nordered our lunch, and the kids did not speak one word, but they all stared at <br/>\nJP&#39;s feet!.. lol.  We went outside to sit on a bench on the porch wait for our <br/>\nfood.  Anna said as soon as we were out of earshot.. &quot;What is wrong with those <br/>\nkids?, they were sitting like zombies!&quot;  I said, &quot;I know, they didnt make a <br/>\npeep&quot;  Anna was just overly interested in why they were so still and quiet.. <br/>\nBut, we had only been in there a few minutes, I didn&#39;t think much of it.   We <br/>\nwent back inside to see if our food was ready, it wasn&#39;t, so we sat down at an <br/>\nempty table to wait. JP had a hot wheels car and he was &quot;driving&quot; it all over <br/>\nthe table, making car noises, while we waited.  The &quot;zombie&quot; kids kept staring <br/>\nat him.  The mother gave us a few furtive glances.   She was reading a book, I <br/>\nthink it was a bible, (not sure though.. she was taking notes )   Their food <br/>\ncame.. They got it, and started eating, after the Mother said the blessing  <br/>\nThey never said a word.   When we left, Anna was even more perplexed.  She <br/>\nthinks they were being &quot;controlled&quot; by thier mother.. threatened to not say a word, <br/>\nmaybe being punished.  I said, &quot;Well, Anna, not all kids make a lot of noise <br/>\nand commotion when they go out to eat.    She said, &quot;Yes, Mom, I know, kids <br/>\ncan eat quietly, but they were not even talking to each other.. AT ALL!&quot;  Then <br/>\nshe started talking like the thought the mother would sound. &quot;You better not <br/>\nsay one word, you hear me?  I said QUIET!  I don&#39;t want to hear a peep out you!&quot; <br/>\n She said, &quot;She probably does homeschool them for religious reasons.  I bet <br/>\nthey kept staring at JP because he didn&#39;t have any shoes on and he was driving <br/>\nthe car on the table.  I bet they would get a spanking for that&quot;    Sometimes <br/>\nit does take a stark opposite of what one is accustomed to  to see how much <br/>\n&quot;different&quot; we live our lives.  <br/>\n<br/>\nThis is funny, as I was writing this,  Anna came in and turned on the TV.. <br/>\nRiki Lake was on.  I couldnt see, but I could hear the TV.  Riki said something <br/>\nlike&quot; Why do you want to live this way&quot;   The guest gave some lame answer.. <br/>\nAnna said.. &quot;That girl has braces&quot;   ( she is 13 and just go her braces off a <br/>\ncouple of weeks ago)  Then Riki said to the guest.. &quot;So, you go to these <br/>\nparties, and there are usually about 40 people there&quot;  Guest - &quot;yeah&quot;<br/>\nRiki continues.. &quot;and at these parties you give oral sex to about 10-15 guys&quot; <br/>\n  Anna was standing right in front of the TV.. She said.. &quot;Yuck, I dont want <br/>\nto watch that.. and she turned the TV off&quot;  Then she said.. &quot;That girl still <br/>\nhad braces&quot;  I had to laugh.   I don&#39;t know if the braces thing struck Anna so <br/>\nmuch because the girl was obviously young, or because of the idea of giving <br/>\noral sex with braces on.. LOL.    She went out of the room to finish her <br/>\nbracelet.  <br/>\n<br/>\nEthan brought me his finished gargage.  It was  a spectacular creation.  He <br/>\ncame up with a design of yellow and gray peices that made a solid wall.  It was <br/>\ntotally cool.  <br/>\n<br/>\nPretty typical day<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":45073,"authorName":"amycats2@aol.com","from":"amycats2@...","profile":"amycats2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064248227","msgId":81209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0LjE5MmE4ZDlhLjJjYTA3ZGEzQGFvbC5jb20+"},"prevInTopic":81208,"nextInTopic":81219,"prevInTime":81208,"nextInTime":81210,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/2003 11:26:09 AM Central Daylight Time, ... Tell me about this game...Trevor is just barely 6yo. I saw it at a garage sale last week","messageBody":"<div id=\"ygrps-yiv-741046759\">In a message dated 9/22/2003 11:26:09 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:genant2@...\">genant2@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  We are on the computers.  Dallen is <br/>\n&gt; playing Pharaoh<br/>\n<br/>\n </span></blockquote>Tell me about this game...Trevor is just barely 6yo. I saw it at a garage <br/>\nsale last week and considered picking it up but thought it looked a little too <br/>\nhard for him.<br/>\nAmy Kagey<br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ubah.com/ecommerce/default.asp?sid=Z0939&gid=1684902&quot;\">http://www.ubah.com/ecommerce/default.asp?sid=Z0939&gid=1684902&quot;</a>&gt;Free shipping on &lt;/A&gt;&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ubah.com/ecommerce/default.asp?sid=Z0939&gid=1684902&quot;\">http://www.ubah.com/ecommerce/default.asp?sid=Z0939&gid=1684902&quot;</a>&gt;Usborne Books&lt;/A&gt; !<br/>\nJoin Usborne for only $29.95 in Sept! <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] how are ya&#39;ll spending your day today?","postDate":"1064247788","msgId":81208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NS4xOTYzYTY2MS4yY2EwN2JlY0Bhb2wuY29tPg=="},"prevInTopic":81204,"nextInTopic":81209,"prevInTime":81207,"nextInTime":81209,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"Well, it is still early for us.  LOL.  We are on the computers.  Dallen is playing Pharaoh and Phillip is playing Command and Conquer Generals.  I am answering","messageBody":"<div id=\"ygrps-yiv-848382622\">Well, it is still early for us.  LOL.  We are on the computers.  Dallen is <br/>\nplaying Pharaoh and Phillip is playing Command and Conquer Generals.  I am <br/>\nanswering E mail.  We need to go get groceries today and think about what we want <br/>\nto pack for a picnic.  We are going up in the mountains tomorrow to a Cheese <br/>\nCompany and some site seeing in the beautiful fall mountains.  Should be tons of <br/>\nfun.  Other than that I have no idea what the day will bring.  Maybe a game <br/>\nof Warhammer with my boys.  They want to make stuffed shells (pasta shells) for <br/>\nsupper so we will do that.  Otherwise it is up in the air.<br/>\nPam G<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":43907726,"authorName":"Tia Graham","from":"Tia Graham &lt;sixredheads@...&gt;","profile":"clarasmommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"how are ya&#39;ll spending your day today?","postDate":"1064243610","msgId":81204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwOTIyLjExMTMzMC4tMzY5NjAxLjkuc2l4cmVkaGVhZHNAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":81208,"prevInTime":81203,"nextInTime":81205,"topicId":81204,"numMessagesInTopic":0,"msgSnippet":"Still green on unschooling, and hearing how others spend thier days is very helpful. I d imagine  you do this fairly often, but if you can stand it once more,","messageBody":"<div id=\"ygrps-yiv-1078419883\">Still green on unschooling, and hearing how others&#39; spend thier days is<br/>\nvery helpful. I&#39;d imagine  you do this fairly often, but if you can stand<br/>\nit once more, please do ;-).<br/>\n<br/>\nI&#39;ve got a 7 year old boy, almost 6 year old girl, and a 3 year old boy<br/>\nhere. Today we began reading the book of Luke from the bible...the<br/>\nmiracles of Jesus Christ, straight from the bible rather than a story<br/>\nbook. We did another chapter of The Incredible Journey, which the kids<br/>\ndraw as I read, so that they end up with an illustrated version by the<br/>\nend. That&#39;s coming out as a pretty hard book and I gave up going over the<br/>\nvocabulary....just have to chalk it up to &quot;great language exposure&quot;. They<br/>\nare enjoying it alot more now that I&#39;m not stopping every sentence to<br/>\ntell them what a word means LOL! Sometimes we&#39;ve copied a nice sentence<br/>\nfrom the chapter onto the drawing but no one wanted to do that today so<br/>\nwe skipped it. <br/>\n<br/>\nFrom there we played a time-telling memory kind of game and put together<br/>\na puzzle of the human body, organ side up (bones are on the other side).<br/>\nMy 7 year old headed out to build on his fort and my 6 year old dd got<br/>\nout a sequel movie of Lady and the Tramp ( a movie I barely tolerate<br/>\nbecause of some very annoying parts of it).<br/>\n<br/>\nI&#39;m thinking of making some banana pudding later today and a grilled<br/>\npizza; there&#39;s the ever constant housework to do and later this afternoon<br/>\nwill get interesting when the neighbor kids come home from school. We are<br/>\nin a testy situation with some of them over bullying. Maybe I&#39;ll just<br/>\nload everyone up and go to the library from then to dinner time!<br/>\n<br/>\nHow&#39;s your day going?<br/>\n<br/>\nTia in Florida</div>","specialLinks":[]}],"prevTopicId":80933,"nextTopicId":81274}}