{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":40256956,"authorName":"jmcseals SEALS","from":"&quot;jmcseals SEALS&quot; &lt;jmcseals@...&gt;","profile":"sevenhavei","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] having kids...","postDate":"1052925844","msgId":69059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtRjMyWWhBT3lsaGduRlowMDAwZWVlOEBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":69058,"nextInTime":69060,"topicId":69059,"numMessagesInTopic":0,"msgSnippet":"**Also, I personally love kids.  However, life would certainly be *easier* without them.** What an interesting thread.  This line, in particular, really caught","messageBody":"<div id=\"ygrps-yiv-571921183\">**Also, I personally love kids.  However, life would certainly be<br/>\n*easier* without them.**<br/>\n<br/>\nWhat an interesting thread.  This line, in particular, really caught my eye. <br/>\n  I really don&#39;t think life would be easier without kids, for *me*.  Perhaps <br/>\nit is because I have always wanted so much to have them.  I think, for me, <br/>\nthere are definitly a lot of life circumstances surrounding that, though.  I <br/>\nalways wonder how differently I would feel about motherhood had I had a <br/>\ndifferent mother, or at least had my own mother been more attentive and <br/>\nloving.  Having my first child truly changed my life.  Gave me a focus and <br/>\ndreams and plans I really didn&#39;t have before.  I still have such a hard time <br/>\nwhen I see teen mother shows that tell teenagers that a baby won&#39;t change <br/>\ntheir lives for the better because for me, it certainly did.  Having a child <br/>\ngave me everything I felt was lacking in my life, internally and externally. <br/>\n  I would never encourage a teenager to have a baby, but I know that after <br/>\nthe fact, there are those who become better people because of it and find a <br/>\npeace they have never known.  I&#39;m not naive to the fact that having a baby <br/>\ncan be a life breaker for some people as well, sad as that is to say.<br/>\n<br/>\nWhen I lost my second daughter, Hillary was stillborn at 38 weeks, Haleigh <br/>\nwas my saving grace.  Having her to focus my energy and love into saved me <br/>\nfrom a deep and paralyzing depression.  It scares me to think of where I <br/>\nwould be now had it not been for having to come out of the darkness and face <br/>\nmy responsibilitites as a mother.  Strange as it may sound, and as much as I <br/>\nwould give anything to have Hillary here with me now, her brief passing <br/>\nthrough my life has given me so much and taught me so many lessons that I <br/>\nthink only losing a child can teach a person.  I felt this same sentiment in <br/>\nthe recent posts on losing children.<br/>\n<br/>\nNow, when I hear people tell me how hard having seven children must be, I <br/>\ncan honestly say how hard it would be for me not to have them.  They <br/>\nbrighten up my gloomiest days and fill me with a deep love and passion I had <br/>\nnever known was even humanly possible.  I&#39;ve had a terrible week.  I&#39;m <br/>\nfacing things that would drive many people into a spiraling depression.  I <br/>\n*have* been depressed.  But when I have to stop the turning world to nurse <br/>\nmy baby and peer into her beautiful eyes, I am reminded that what we are <br/>\ngoing through will pass.  Everytime we are turned away from a prospective <br/>\nhouse because of our credit, I look at my children and know that it doesn&#39;t <br/>\nreally matter where we live.  When the house is a mess and life becomes <br/>\noverwhelming and I feel like throwing in the towel, a sweet little face <br/>\nappears and says, &quot;Mommy, my love you&quot; or &quot;Can we read a story in the closet <br/>\nwith a flashlight tonight?&quot;  I realize the messes can wait, a house will <br/>\ncome along and soon, all will be right with my world.<br/>\n<br/>\nJennifer<br/>\n<br/>\n_________________________________________________________________<br/>\nTired of spam? Get advanced junk mail protection with MSN 8. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":68742,"nextTopicId":69067}}