{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":77817828,"authorName":"LOWRIEK@aol.com","from":"LOWRIEK@...","profile":"nancylowrie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] thoughts re: unschooling and  parenting","postDate":"1070120851","msgId":85549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4LjM4NGU2NjNlLjJjZmExOTkzQGFvbC5jb20+"},"prevInTopic":85539,"nextInTopic":0,"prevInTime":85548,"nextInTime":85550,"topicId":85486,"numMessagesInTopic":0,"msgSnippet":"In a message dated 28/11/2003 22:04:52 Pacific Standard Time, ... What a beautiful post, Mary. It brought tears tomy eyes to hear such a tribute, so obviously","messageBody":"<div id=\"ygrps-yiv-1536575068\">In a message dated 28/11/2003 22:04:52 Pacific Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mummy124@...\">mummy124@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He&#39;s a wonderful son.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>What a beautiful post, Mary. It brought tears tomy eyes to hear such a <br/>\ntribute, so obviously filled with love for your boy.<br/>\nNancy in BC, sniff sniff<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] thoughts re: unschooling and  parenting","postDate":"1070085744","msgId":85539,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWMzYjYzZSQ1Yzc2NzMwMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDIwMDMxMTI4MDQyOTA4Ljc1MjU4LnFtYWlsQHdlYjEyNjA2Lm1haWwueWFob28uY29tPiA8Ni4wLjAuMjIuMC4yMDAzMTEyODIwMTE0My4wMjU4YjdjMEBzaGF3bWFpbC5ndi5zaGF3Y2FibGUubmV0Pg=="},"prevInTopic":85538,"nextInTopic":85549,"prevInTime":85538,"nextInTime":85540,"topicId":85486,"numMessagesInTopic":0,"msgSnippet":"From: Tia Leschke  ","messageBody":"<div id=\"ygrps-yiv-414230031\">From: &quot;Tia Leschke&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a>&gt;<br/>\n<br/>\n&lt;&lt;I had to struggle like this with my vision of what an unschooled kid would<br/>\nbe like. My son is *nothing* like what I expected, and I did have to go<br/>\nthrough a kind of grieving process like you describe. Once I did that, I<br/>\ncould begin to see who he really is, and I like him better now than the kid<br/>\nI originally wanted him to be. (if that makes sense)&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nIt makes perfect sense to me. I think Joe and I have both gone through this<br/>\nwith Joseph. He&#39;s just not the &quot;typical&quot; boy we rather expected in a very<br/>\nloose kind of way. He doesn&#39;t like to get dirty and he doesn&#39;t especially<br/>\nlike sports. He loves his sports camp one day a week for a few hours, but<br/>\nthat&#39;s as far as it goes. He&#39;s a perfectionist and that means sometimes he<br/>\nwon&#39;t even try something if he thinks he won&#39;t be perfect the first time.<br/>\nHe&#39;s not silly like some kids can be. He&#39;s a lot more serious minded. You<br/>\ncan&#39;t kid with him or joke with him like the other kids. (I&#39;m meaning ours)<br/>\nHe doesn&#39;t like surprises. He&#39;s always questioning everything all the time.<br/>\nHe comes up with tough questions. He&#39;s not at all easy going like the girls<br/>\nare. It&#39;s hard sometimes to know what he needs.<br/>\n<br/>\nBut he&#39;s also very bright and engaging in conversation. He has us look at<br/>\nthings in ways we never have before. He&#39;s honest to a fault. He&#39;s also kind<br/>\nand sensitive. He&#39;s very aware of things around him. Especially little<br/>\nthings. He has a memory to rival none and that comes in handy a lot.<br/>\nEspecially since Joe and I have lost ours lately! He hs an incredible<br/>\nimagination and is so good at making up new games and coming up with<br/>\nwonderful ideas. He plays so well with other kids and is especially kind and<br/>\nsweet with his baby sister. He knows how to speak his mind without hurting<br/>\nfeelings. He&#39;s very comfortable being alone and playing or reading. He&#39;s<br/>\nhelpful to me when I ask and many times even when I don&#39;t. He loves the<br/>\nfamily and he loves this house. He has a wonderul smile. And when you do<br/>\nhear that laugh of his, as infrequent as it comes, it will make you laugh<br/>\nout loud with joy. He&#39;s a great friend and a really cool kid to be around.<br/>\nHe is so much more than we could have hoped for. He&#39;s a wonderful son.<br/>\n<br/>\n<br/>\nMary B.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolingtshirts.com\">http://www.homeschoolingtshirts.com</a></div>","specialLinks":[]},{"userId":129679134,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] thoughts re: unschooling and  parenting","postDate":"1070079285","msgId":85538,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4wLjIyLjAuMjAwMzExMjgyMDExNDMuMDI1OGI3YzBAc2hhd21haWwuZ3Yuc2hhd2NhYmxlLm5ldD4=","inReplyToHeader":"PDIwMDMxMTI4MDQyOTA4Ljc1MjU4LnFtYWlsQHdlYjEyNjA2Lm1haWwueWFob28uY29tPg==","referencesHeader":"PDIwMDMxMTI4MDQyOTA4Ljc1MjU4LnFtYWlsQHdlYjEyNjA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":85486,"nextInTopic":85539,"prevInTime":85537,"nextInTime":85539,"topicId":85486,"numMessagesInTopic":0,"msgSnippet":"... I had to struggle like this with my vision of what an unschooled kid would be like. My son is *nothing* like what I expected, and I did have to go through","messageBody":"<div id=\"ygrps-yiv-1404295020\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;I had thought, before Sarah was born, that I would have this lovely little <br/>\n&gt;daughter who was pretty much a blank slate, like I could REALLY influence <br/>\n&gt;who she would become. Uh no. First thing she taught me as a parent was the <br/>\n&gt;she well and truly is a totally and completely SEPARATE person. This hit <br/>\n&gt;me very early on in her infancy..like the first couple days. I cried. It <br/>\n&gt;hurt to realize I&#39;d been living in la-la land in regards to what parenting <br/>\n&gt;would really be like. I also realized if I followed that ideal I&#39;d become <br/>\n&gt;more like my mother than I wanted to be. I cried in some ways for the loss <br/>\n&gt;of how I thought things would be as well..for who I THOUGHT I would have <br/>\n&gt;as my child. I had to accept that she was not a dream child but herself. <br/>\n&gt;HERSELF being a key word...and something I still fight to have my mother <br/>\n&gt;recognize in me. Who I AM versus who she would rather me be. She&#39;s never <br/>\n&gt;gotten over being disappointed that I don&#39;t fit her ideal.<br/>\n<br/>\n </span></blockquote>I had to struggle like this with my vision of what an unschooled kid would <br/>\nbe like. My son is *nothing* like what I expected, and I did have to go <br/>\nthrough a kind of grieving process like you describe. Once I did that, I <br/>\ncould begin to see who he really is, and I like him better now than the kid <br/>\nI originally wanted him to be. (if that makes sense)<br/>\nTia</div>","specialLinks":[]},{"userId":164396504,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;mamabethuscg@...&gt;","profile":"mamabethuscg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"thoughts re: unschooling and parenting","postDate":"1069993748","msgId":85486,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMTI4MDQyOTA4Ljc1MjU4LnFtYWlsQHdlYjEyNjA2Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":85538,"prevInTime":85485,"nextInTime":85487,"topicId":85486,"numMessagesInTopic":0,"msgSnippet":"Thought I would share a recent thought regarding unschooling and parenting. Leaving behind traditional thinking in regards to academics and other areas of life","messageBody":"<div id=\"ygrps-yiv-1092340514\">Thought I would share a recent thought regarding unschooling and parenting. Leaving behind traditional thinking in regards to academics and other areas of life is both very easy and something I struggle with. But I&#39;m getting there. I&#39;m much more &quot;there&quot; than I used to be...and if some of the outside hassles would just go away to leave us to our lives it would probably be 100 times easier...but it&#39;s happening. <br/>\n <br/>\nSO: my thoughts, and feel free to comment...<br/>\n <br/>\nOne of the things that I am enjoying most about being a mother is watching my children&#39;s personalities emerge. Seeing what they like and don&#39;t like...in regards to food, to clothing, to books to be read, toys to play with. Do they laugh alot or are they prone to temper? Do they greet the day smiling or grumpy because it&#39;s morning (like me LOL)? WHO are they?! <br/>\n <br/>\nI had thought, before Sarah was born, that I would have this lovely little daughter who was pretty much a blank slate, like I could REALLY influence who she would become. Uh no. First thing she taught me as a parent was the she well and truly is a totally and completely SEPARATE person. This hit me very early on in her infancy..like the first couple days. I cried. It hurt to realize I&#39;d been living in la-la land in regards to what parenting would really be like. I also realized if I followed that ideal I&#39;d become more like my mother than I wanted to be. I cried in some ways for the loss of how I thought things would be as well..for who I THOUGHT I would have as my child. I had to accept that she was not a dream child but herself. HERSELF being a key word...and something I still fight to have my mother recognize in me. Who I AM versus who she would rather me be. She&#39;s never gotten over being disappointed that I don&#39;t fit her ideal.  <br/>\n <br/>\n I thought I&#39;d cuddle and snuggle and &quot;love on&quot; this child. She didn&#39;t want to be held. No thanks, places to go and things to do is her motto! While I naturally gave her choices even as a young infant when shopping like for clothes, holding up a pink outfit and the same in another color to see which got more of a reaction (anything GREEN was greeted with smiles and coos and kicks)...somehow I also thought I could still influence her in other ways. <br/>\n <br/>\nNope. Mommy wants my bedtime to be when?! Not going to do it. I&#39;m going to cry about it too (to give an example).  <br/>\n <br/>\nI&#39;ve relaxed much more with The Littles and Gracie. But by trying to guide their educations, aren&#39;t I also trying to influence them into being more like I want them to be instead of helping them to clarify who THEY ARE?! <br/>\n <br/>\nThey come into this world with their personality, likes, dislikes, abilities...it&#39;s my job as mother to help them to clarify that. Not to shape it. Oh, I can still teach them right from wrong, etc. But aside from things like that, when it comes to personal choices...who am I to tell them that they MUST study this? or do this? <br/>\n <br/>\nI need to really keep myself remembering what I disliked most growing up...both being forced to study what others wanted me to study when I had no interest in it, being required to write reports and do other things to show what I &quot;knew&quot; when I didn&#39;t know diddly but how to reword something and make it look like I did and when I wouldn&#39;t be writing reports on a &quot;plant or animal of your choosing&quot; in THE REAL WORLD and so on and so on ad nauseum....as well as my mother&#39;s total determination to make me who she wanted me to be rather than accept me for MYSELF. WHO I AM AS GOD MADE ME! Something she still, 28 years later, can&#39;t see. <br/>\n <br/>\nSO I struggle to leave behind the coulds and shoulds and learn to trust in my children more. They&#39;re happier for it, and in the long run I will be as well. <br/>\n <br/>\nAnd so, we unschool. <br/>\n <br/>\nMamaBeth<br/>\n<br/>\n<br/>\nEverything I need to know, I learned on my own!<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nFree Pop-Up Blocker - Get it now<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":85520,"nextTopicId":85552}}