{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Why I&#39;m Not an Unschooler---no, not *me*!!","postDate":"1122505781","msgId":107541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5YS4zODljMzdjNS4zMDE5NmUzNUBhb2wuY29tPg=="},"prevInTopic":107540,"nextInTopic":0,"prevInTime":107540,"nextInTime":107542,"topicId":107539,"numMessagesInTopic":0,"msgSnippet":"... Kirby. Right.   Nobody was twisting his arm.   I was prepared to twist his arm to quit that evil English 101 class, but he didn t need to have his arm","messageBody":"<div id=\"ygrps-yiv-739964190\"><blockquote><span title=\"ireply\">&gt; Yes, and if the *learner* chooses to use a structured method, that&#39;s<br/>\n&gt; great (as Sandra&#39;s recent posts on Marty&#39;s foray into college<br/>\n&gt; classes - it was Marty, not Kirby, correct?)<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Kirby.<br/>\n<br/>\nRight.   Nobody was twisting his arm.   I was prepared to twist his arm to <br/>\nquit that evil English 101 class, but he didn&#39;t need to have his arm twisted.   <br/>\nHe knew when to willingly take a structured class and when to bail out like <br/>\nhis book was on fire.<br/>\n<br/>\n-=-&gt; This standard may well ignore the fact that some learning requires<br/>\n<blockquote><span title=\"ireply\"> &gt; organization. Some subjects do not offer enough<br/>\n&gt;information/feedback to<br/>\n&gt; be<br/>\n&gt; learned effectively if only studied as infrequently and<br/>\n&gt;haphazardly as<br/>\n&gt; they<br/>\n&gt; may be encountered in day to day activity.-=-<br/>\n<br/>\n </span></blockquote>As I read that it sounded breathlessly thoughtless, like someone had all in <br/>\none great burst of writing packed in all the kneejerk nonsense she possibly <br/>\ncould, with the employment of a plethora of   multisyllabic obfuscatory verbiage. <br/>\n  I was impressed in the negative numbers.   The success of that writing was <br/>\nquite deferred.    <br/>\n<br/>\n-=-To disavow<br/>\n<blockquote><span title=\"ireply\"> &gt; structure as<br/>\n&gt; being bad in and of itself may result, under the best<br/>\n&gt;circumstances, in<br/>\n&gt; the<br/>\n&gt; child wasting time and energy and, in the worst, in the child<br/>\n&gt;becoming<br/>\n&gt; sufficiently frustrated and discouraged in the learning process<br/>\n&gt;that he<br/>\n&gt; loses interest.-=-<br/>\n<br/>\n </span></blockquote>To avow that structure is in and of itself to result in good might suggest <br/>\nthat sufficient engagement in strucutured study of English composition might <br/>\nresult in writing such as one would have read in the paragraph prior to this <br/>\nwhich was painful on the surface and unintentionally humorous at its core.<br/>\nIt was fluffed-up bullshit.<br/>\n<br/>\n-=-This provocative assumption argues that...-=-<br/>\n<br/>\n****YAWN****<br/>\n<br/>\n-=-&gt; Many will ascribe dire consequences to any subject being coerced,<br/>\n<blockquote><span title=\"ireply\"> &gt; forced, or<br/>\n&gt; required of children. These same parents, however, still have<br/>\n&gt;skills or<br/>\n&gt; behaviors that they consider &quot;non-optional.&quot;-=-<br/>\n<br/>\n </span></blockquote>**yawn**<br/>\nburp<br/>\nNon-optional (but easily obtained skill at our house is the recognition of <br/>\nnonsense.<br/>\nThat wasn&#39;t taught in the school the writer above attended, it seems, or <br/>\nmaybe it can&#39;t BE taught.   <br/>\n<br/>\n-=-&gt;It also flies in the face of historical<br/>\n<blockquote><span title=\"ireply\"> &gt; reality;<br/>\n&gt; learning from others is the way man has progressed from tribalism<br/>\n&gt;and<br/>\n&gt; barbarism to various levels of civilized endeavor.-=-<br/>\n<br/>\n </span></blockquote>Compulsory education is HOW old?<br/>\nI bet she&#39;s talking about people voluntarily submitting themselves to the <br/>\ninstruction of others.<br/>\n<br/>\n-=-We don&#39;t need to *tell* them what they<br/>\nneed to know because the general stuff is general, basic, and they<br/>\nknow they need it and they learn it because it is basic, necessary,<br/>\nstuff.-=-<br/>\n<br/>\nI KNEW my kids would need to be comfortable with computers, so I let them <br/>\nplay with them all they wanted from the time they could work the mouse.   I <br/>\ndidn&#39;t measure their useage and when they got older we got other computers (we <br/>\nhelped them get their own used computers; got an extra used one for Holly to use). <br/>\n  Maybe they&#39;ll never use computers in their jobs (maybe not;   probably <br/>\nwill), but they already use them for real in their lives, and will for the rest of <br/>\ntheir days.<br/>\n<br/>\n<br/>\n-=-&gt;math<br/>\n<blockquote><span title=\"ireply\"> &gt; through<br/>\n&gt; calculus will be likely to be helpful to most people in the future.<br/>\n </span></blockquote>Right. Sure. I&#39;ve had two semesters of college calculus and I use it<br/>\nZERO - and I&#39;m in a high tech industry-=-<br/>\n<br/>\nRight.   Deb had it and isn&#39;t using it.   Hours in class, homework, tests, <br/>\ngrades, cost of tuition...<br/>\nI have not a day of calculus ever, but I know Keith uses it in his head at <br/>\nwork and away from work, but he thinks in patterns and I think in words.    <br/>\nNever a day of calculus or trigonometry; dropped out of Algebra II in 10th grade, <br/>\nbut had a college degree before I was 21.    My ass is kissable.   New Mexico <br/>\nbeing a community property state, Keith&#39;s math is my math. &lt;bwg&gt;<br/>\n<br/>\n-=-most of us do not feel immobilized.-=-<br/>\n[Deb wrote:] -=- If keeping up with DS is immobilized I&#39;d hate to be mobile! <br/>\nphew-=-<br/>\n<br/>\nYes, and my kids have had to keep up with me!!!<br/>\n&quot;Immobilized&quot;!??   I have to be really very ill or wounded to be even <br/>\ntemporarily immobilized.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Why I&#39;m Not an Unschooler---no, not *me*!!","postDate":"1122497604","msgId":107540,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRjOHM4NCtwb2k3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhDNzYwREJEM0ZBQjQ2NS1FMzAtM0MzN0BNQkxLLU0zOC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":107539,"nextInTopic":107541,"prevInTime":107539,"nextInTime":107541,"topicId":107539,"numMessagesInTopic":0,"msgSnippet":"... Where to start? Where to start? So much time so little to say - stop, reverse that... ... I suppose one would have to lean somewhat in order to *embrace* ","messageBody":"<div id=\"ygrps-yiv-1940116695\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, kbcdlovejo@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; This was sent to me from someone who is researching unschooling. <br/>\n&gt;She <br/>\n&gt; didn&#39;t say where she found it, but I thought I&#39;d share and let a <br/>\n&gt;some <br/>\n&gt; you question of few of her statements.<br/>\n&gt; <br/>\n&gt; She said she found only three radicals---I guess she didn&#39;t come <br/>\n&gt;here <br/>\n&gt; to ask questions! &lt;g&gt;<br/>\n&gt; <br/>\n&gt; ~Kelly<br/>\n </span></blockquote>Where to start? Where to start? So much time so little to say - <br/>\nstop, reverse that...<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; Leans toward unstructured learning<br/>\n&gt; and/or<br/>\n&gt; Leans toward child-led learning<br/>\n </span></blockquote>I suppose one would have to lean somewhat in order to *embrace* <br/>\nsomeone or something... But, &quot;leaning toward unstructured learning&quot; <br/>\nor whatever is kind of like &quot;leaning toward being vegetarian&quot; - you <br/>\nmay agree in principle/philosophy, you do it sometimes (maybe most <br/>\nof the time even), but over all, you still like a good steak now and <br/>\nagain in practice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Depending on the subject at hand and the stage of learning the <br/>\n&gt;child has<br/>\n&gt; progressed to, structured learning may well be the most effective <br/>\n&gt;way to<br/>\n&gt; master a given material.<br/>\n </span></blockquote>Yes, and if the *learner* chooses to use a structured method, that&#39;s <br/>\ngreat (as Sandra&#39;s recent posts on Marty&#39;s foray into college <br/>\nclasses - it was Marty, not Kirby, correct?)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This standard may well ignore the fact that some learning requires<br/>\n&gt; organization. Some subjects do not offer enough <br/>\n&gt;information/feedback to <br/>\n&gt; be<br/>\n&gt; learned effectively if only studied as infrequently and <br/>\n&gt;haphazardly as <br/>\n&gt; they<br/>\n&gt; may be encountered in day to day activity.<br/>\n </span></blockquote>Such as? Yes, letting a person twingle with the piano at will on and <br/>\noff is less effective for learning a Beethoven sonata BUT it is <br/>\nstill not taking into account the purposes of the *learner*. When I <br/>\nwanted to learn to play piano, it was with a specific purpose in <br/>\nmind - I wanted to play a few favorite old hymns to at least a <br/>\nrecognizable, if not fluid, level. I played A LOT over and over for <br/>\na while. Then I stopped. Then I started. Then I stopped and started <br/>\na few more times. Not a paragon of structured, organized learning <br/>\n(and I was doing it without a teacher, just a beginner&#39;s book that I <br/>\nskipped around in at will, on my own time frame). I can pick out <br/>\nthose hymns plus figure out a bunch of others. I reached my goal. <br/>\nPerhaps not as quickly and efficiently, but I still enjoy it and <br/>\n*own* it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Learning any topic thoroughly and effectively, requires a healthy<br/>\n&gt; combination of both structure and free exploration. To disavow <br/>\n&gt; structure as<br/>\n&gt; being bad in and of itself may result, under the best <br/>\n&gt;circumstances, in <br/>\n&gt; the<br/>\n&gt; child wasting time and energy and, in the worst, in the child <br/>\n&gt;becoming<br/>\n&gt; sufficiently frustrated and discouraged in the learning process <br/>\n&gt;that he<br/>\n&gt; loses interest.<br/>\n </span></blockquote>Example? I&#39;ve got a child. When he wants to learn something, we do <br/>\nwhatever seems to work best. Numeracy is growing rapidly without any <br/>\nformal structure or set outline of steps. Reading was absorbed as <br/>\nbest as I can figure - sure wasn&#39;t formal anything involved. <br/>\nBasically, he absorbed until he outright said he wanted to learn to <br/>\nread. In 3 evenings (total maybe 90 minutes at bedtime) we went <br/>\nthrough a small set of &#39;primer&#39; type books designed to &#39;teach&#39; <br/>\nreading (Bob Books). That 90 minutes basically convinced DS that he <br/>\ncould read, was in fact already reading and we moved on from there. <br/>\nOther stuff (all those other &#39;subjects&#39; like geography and science <br/>\nand history) are indeed easily absorbed piece by piece, making new <br/>\nconnections and adding to existing connections as we go - that&#39;s <br/>\nwhat adults are doing all day long, if they haven&#39;t decide they <br/>\ndon&#39;t need to learn anything anymore.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This provocative assumption argues that learning only occurs if <br/>\n&gt; children are<br/>\n&gt; completely in charge of subject matter and timetable. But the <br/>\n&gt;logic is<br/>\n&gt; fundamentally flawed. In fact, all the unschoolers I know except <br/>\n&gt;three<br/>\n&gt; unwittingly disprove this theory by their practice.<br/>\n </span></blockquote>No, learning does occur even when forced - but rarely is the <br/>\nlearning involved related to the subject matter for the long term. <br/>\nThe &#39;data&#39; can be absorbed short term and may &#39;stick&#39; longer term if <br/>\nit is repeated enough over a long time. But, what sticks first and <br/>\nquickly is learning that learning is hard/boring/whatever and that <br/>\nthe child is &quot;bright/slow/average/good-at-math/gifted/disabled&quot; and <br/>\nmany other things. Learning that what you are good at defines you, <br/>\nrather than Who you are and where your passions take you.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Many will ascribe dire consequences to any subject being coerced, <br/>\n&gt; forced, or<br/>\n&gt; required of children. These same parents, however, still have <br/>\n&gt;skills or<br/>\n&gt; behaviors that they consider &quot;non-optional.&quot; These generally have <br/>\n&gt;to do <br/>\n&gt; with<br/>\n&gt; health and safety and family lifestyle. For example, these parents <br/>\n&gt; require<br/>\n&gt; their children to: brush their teeth, stay out of the road, help <br/>\n&gt;with<br/>\n&gt; chores, etc.<br/>\n </span></blockquote>Ah - this is where things diverge between those who look at <br/>\nunschooling as an &#39;educational method&#39; and those who consider it a <br/>\nlifestyle.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; These parents don&quot;t take the position that requiring a child to <br/>\n&gt;brush <br/>\n&gt; his<br/>\n&gt; teeth will make him hate tooth brushing so much that he will never <br/>\n&gt;brush<br/>\n&gt; again once the parent&quot;s influence is diminished. But they do claim <br/>\n&gt;that<br/>\n&gt; requiring math study will create math-haters and math-phobics who <br/>\n&gt;will <br/>\n&gt; avoid<br/>\n&gt; computation for the rest of their lives. They don&quot;t seem to <br/>\n&gt;recognize <br/>\n&gt; this<br/>\n&gt; inconsistency.<br/>\n </span></blockquote>Yes, we do indeed see that inconsistency - which is why forced <br/>\nanything is avoided. Discussion and information and modelling (and a <br/>\ngood look at the ugly fillings in my head) are all it needs for DS <br/>\nto be the most mindful regarding dental hygiene (since this is the <br/>\nexample used). Guess this person hasn&#39;t actually talked to any of <br/>\nus &quot;radicals&quot; huh? ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If entirely child-led learning is truly a sound educational <br/>\n&gt;foundation, <br/>\n&gt; it<br/>\n&gt; would not be limited so arbitrarily to subjects somehow labeled <br/>\n&gt; &quot;academic&quot;<br/>\n&gt; as opposed to &quot;real-life.&quot;<br/>\n </span></blockquote>EXACTLY! Gee, this is actually getting it kind of -  it is a sound <br/>\nfoundation and should not be limited to just &#39;academics&#39; but to all <br/>\nof life.<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;Children won&quot;t learn from the mistakes of others, they have to <br/>\n&gt;learn <br/>\n&gt; for<br/>\n&gt; themselves.&quot;<br/>\n  <br/>\n&gt; This speaks more of a lack of trust in the family relationships <br/>\n&gt;than it <br/>\n&gt; does<br/>\n&gt; of educational philosophy. <br/>\n </span></blockquote>For some people this is true - they do NOT want to take it from <br/>\nsomeone else, they need to experience things on their own - EVEN IF <br/>\nthey are in a loving, trusting family relationship. BUT, with a <br/>\nloving, trusting relationship built, when things go awry, they are <br/>\nsafe to come back and explore it freely without condemnation. And, <br/>\nover time, are more likely to heed concerns voiced by those loving, <br/>\ntrusted voices.<br/>\n<blockquote><span title=\"ireply\"> &gt;It also flies in the face of historical <br/>\n&gt; reality;<br/>\n&gt; learning from others is the way man has progressed from tribalism <br/>\n&gt;and<br/>\n&gt; barbarism to various levels of civilized endeavor. If every person <br/>\n&gt; truly had<br/>\n&gt; to learn everything on their own, no one would have been able to <br/>\n&gt;build <br/>\n&gt; on<br/>\n&gt; and surpass the accomplishments of prior generations.<br/>\n </span></blockquote>Learning from others and learning in a strictly formal way <br/>\n(especially via print as most &#39;formal learning&#39; is done) are two <br/>\ndifferent things. I learn from my DH. He learns from me. Neither of <br/>\nus are doing anything structured or formal. DS learns from us as <br/>\nwell - but not because we are sitting him down and requiring it of <br/>\nhim - he hears, sees, participates, explores, asks, answers; we do, <br/>\nassist, answer, ask (real questions, seeking his ideas). It may <br/>\ninvolve books. It may involve sitting in the back yard for several <br/>\nhours looking at clouds. Children learn to walk and talk from others <br/>\nyet few (barring physiological/physical/mental issues) would say <br/>\nthey &quot;taught&quot; their child to walk or talk. Learning happened. And <br/>\nthey learned from others. Yet there wasn&#39;t explicit teaching <br/>\ninvolved - assisting, facilitating, encouraging, modelling in spades <br/>\nbut there&#39;s no &quot;time to do our walking practice now&quot; involved.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &quot;I can&quot;t possibly know what my child will want to be or to do when <br/>\n&gt;they <br/>\n&gt; grow<br/>\n&gt; up, so I would never presume to tell them what they need to know.&quot;<br/>\n&gt; <br/>\n&gt; This statement implies that since a parent cannot make perfect, <br/>\n&gt;specific<br/>\n&gt; predictions, that he also cannot make very good, general <br/>\n&gt;predictions. <br/>\n&gt; This<br/>\n&gt; is completely inaccurate.<br/>\n </span></blockquote>Um, misunderstanding here. We don&#39;t need to *tell* them what they <br/>\nneed to know because the general stuff is general, basic, and they <br/>\nknow they need it and they learn it because it is basic, necessary, <br/>\nstuff. Like walking and talking - there is a purpose to it. I could <br/>\nmake a pretty good general prediction that DS would need to be able <br/>\nto walk. And sure enough he did. I didn&#39;t tell him that. Knowing <br/>\nthat, I didn&#39;t arrange lessons for him. I did, however, make a tot-<br/>\nfriendly environment available. I comforted him when he bumped hard <br/>\ninto something. I held his hands as he stepped or walked carefully <br/>\nand slowly when he was attached to the backs of my legs (one of his <br/>\nfavorite &quot;push toys&quot;). Likewise, letters and sounds are all around <br/>\n(hey I rhymed). DS knew they communicated something and with <br/>\nexploration and asking and playing with the symbols and the sounds, <br/>\nhe was eventually reading. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; While I may not always be able to guess exactly how many ounces of <br/>\n&gt; water any<br/>\n&gt; of my daughters will drink on a given day, I can tell you that <br/>\n&gt;each of <br/>\n&gt; them<br/>\n&gt; will drink at least some water on that day with nearly 100% <br/>\n&gt;accuracy.<br/>\n </span></blockquote>Really? And never a day goes by when they only drink milk and juice <br/>\nand soup of their own choice (removing, if possible, any <br/>\nrequirement, subtle or otherwise, of yours)? I *know* that there are <br/>\nsome days when DS drinks lots of milk and juice and no water <br/>\n(barring, perhaps, a bit that gets swallowed in the rinse/spit of <br/>\nbrushing). In the warm months, odds are good that he&#39;ll drink lots <br/>\nof water. In the winter, probably not as much and sometimes no H2O <br/>\ndirectly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The same principle holds true for most academic work. While I <br/>\n&gt;can&quot;t <br/>\n&gt; predict<br/>\n&gt; exactly how many math problems in a particular text would be of <br/>\n&gt;optimum<br/>\n&gt; benefit to my children, I can say that for most people in our <br/>\n&gt;society an<br/>\n&gt; understanding of math through the second year of algebra would be <br/>\n&gt; extremely<br/>\n&gt; beneficial given the cost (time, energy, expense) of learning. I <br/>\n&gt;can <br/>\n&gt; also<br/>\n&gt; say that if our society continues to progress technologically, <br/>\n&gt;math <br/>\n&gt; through<br/>\n&gt; calculus will be likely to be helpful to most people in the future.<br/>\n </span></blockquote>Right. Sure. I&#39;ve had two semesters of college calculus and I use it <br/>\nZERO - and I&#39;m in a high tech industry. Odds are actually LOWER <br/>\nbecause of technology, not higher - pocket calculators nowadays can <br/>\ndo all those calculations if you know the basic inputs (the fence is <br/>\nthis long and this wide ...). Also, *formal* calculus and algebra <br/>\nare different than the concepts they are used to convey (ask your <br/>\nscientist husband about how the notation for his equations is merely <br/>\nrepresenting a concept in symbolic language). My DS was using basic <br/>\nalgebra at age 3 - yup 3 yrs of age. He solved the following <br/>\nequation 3+x=7 (basic algebra right - solving for x is one of the <br/>\nfirst lessons). He had 3 cookies and wanted 7 so he figured out how <br/>\nmany more he needed to get what he wanted. He didn&#39;t write it down. <br/>\nHe didn&#39;t know it was algebra, let alone math or arithmetic. It was <br/>\njust information he needed to get what he wanted. And he used his <br/>\nfingers to calculate it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There is another underlying implication in this statement: that <br/>\n&gt;because<br/>\n&gt; parents do not have the ability to make perfect decisions, they <br/>\n&gt;should <br/>\n&gt; make<br/>\n&gt; none at all. It says that since we can&quot;t know exactly how much <br/>\n&gt;history <br/>\n&gt; will<br/>\n&gt; fit in perfectly with their future career and/or life choices, we <br/>\n&gt;have <br/>\n&gt; no<br/>\n&gt; right to say that they need to know any history at all.<br/>\n </span></blockquote>Actually, it is making a decision quite firmly that says I will <br/>\nassist my child in learning any and all history that my child <br/>\nchooses to pursue - whether or not it has any relationship to any <br/>\nfuture career or life choices. We spent a lovely, silly time, <br/>\nplaying with Shakespearean language one evening last winter (DS was <br/>\n6). He doesn&#39;t &quot;know&quot; Shakespeare but he does have connections <br/>\nfor &quot;Shakespeare&quot; &quot;Hamlet&quot; &quot;To be or not to be that is the question&quot; <br/>\n(the silly arose when DH said he had to use the bathroom as soon as <br/>\nwe got in - we were pulling into the driveway - I said To pee or not <br/>\nto pee that is the question whether it is nobler to pee thy pants or <br/>\nsuffer the slings and arrows of holding it...) He picked up the <br/>\naccent of the &#39;classical Shakespearean English&#39; and we tossed bits <br/>\nand pieces of Shakespeare back and forth and made up stuff that <br/>\nsounded good. DS may never *need* to know any of it, but if he runs <br/>\nacross a reference to it, he&#39;ll have something to attach it to.<br/>\n<blockquote><span title=\"ireply\"> &gt; Not only does this ignore the fact that parents have more <br/>\n&gt;experience and<br/>\n&gt; hopefully more wisdom to draw upon than their children, but it <br/>\n&gt;also <br/>\n&gt; ignores<br/>\n&gt; the fact that every decision we make is subject to our <br/>\n&gt;imperfections. In<br/>\n&gt; spite of this, most of us do not feel immobilized.<br/>\n </span></blockquote>If keeping up with DS is immobilized I&#39;d hate to be mobile! phew <br/>\n<blockquote><span title=\"ireply\"> &gt; Often, as before, the parents making these claims, themselves show <br/>\n&gt;the <br/>\n&gt; lack<br/>\n&gt; consistency in this argument. They cannot perfectly determine <br/>\n&gt;precisely <br/>\n&gt; how<br/>\n&gt; much and what manner of toothbrushing will be most beneficial to <br/>\n&gt;each <br/>\n&gt; child.<br/>\n&gt; Still they feel justified in compelling their children to brush. <br/>\n&gt;Why?<br/>\n </span></blockquote>Uh go back up and read the other section on required toothbrushing <br/>\net al<br/>\n<blockquote><span title=\"ireply\"> &gt; Because they feel that the cost (time, energy, expense) of <br/>\n&gt;brushing is<br/>\n&gt; outweighed by the benefit, and they feel qualified to make a good <br/>\n&gt; general<br/>\n&gt; estimate of how much brushing is required to reach an acceptable <br/>\n&gt; benefit.<br/>\n </span></blockquote>There&#39;s no guesswork needed - the ADA has guidelines on how much and <br/>\nhow often one needs to brush (I think it is currently something like <br/>\ntwo minutes of brushing at least twice per day).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Once again the most effective type of learning is a combination of<br/>\n&gt; well-thought out guidance in conjunction with personal initiative.<br/>\n </span></blockquote>Yes, exactly - but the guidance needs to be in the form of trail <br/>\nguide - the trail guide doesn&#39;t decide the goal, but rather takes <br/>\nthe goal of the guide-ee (is that a word?) as well as other <br/>\nabilities, interests, etc (expressed or otherwise) into account and <br/>\nprovides information for the guide-ee to make decisions on which <br/>\npath to take, how far to go, etc. The &#39;guidance&#39; is not &quot;You have to <br/>\nlearn algebra by the time you are 18&quot; but rather &quot;You&#39;re interested <br/>\nin... let&#39;s see what kinds of stuff would be useful... hmm looks <br/>\nlike algebra is important for ... here are a few ways to learn that. <br/>\nThis looks interesting. What do you think?&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; to watch and listen to my children with my heart.<br/>\n </span></blockquote>Gee if you spend all your time watching and listening to your <br/>\nchildren with all your heart, how do you have time to require stuff <br/>\nof them - wouldn&#39;t that be ignoring their hearts and ignoring what <br/>\nyou are hearing?<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Why I&#39;m Not an Unschooler---no, not *me*!!","postDate":"1122480193","msgId":107539,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDNzYwREJEM0ZBQjQ2NS1FMzAtM0MzN0BNQkxLLU0zOC5zeXNvcHMuYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":107540,"prevInTime":107538,"nextInTime":107540,"topicId":107539,"numMessagesInTopic":0,"msgSnippet":"This was sent to me from someone who is researching unschooling. She didn t say where she found it, but I thought I d share and let a some you question of few","messageBody":"<div id=\"ygrps-yiv-603799166\">This was sent to me from someone who is researching unschooling. She <br/>\ndidn&#39;t say where she found it, but I thought I&#39;d share and let a some <br/>\nyou question of few of her statements.<br/>\n<br/>\nShe said she found only three radicals---I guess she didn&#39;t come here <br/>\nto ask questions! &lt;g&gt;<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\nWhy I&#39;m Not An Unschooler<br/>\n<br/>\n<br/>\n<br/>\nWhen I joined the growing home education movement I was astounded to<br/>\ndiscover there was a large and growing subset who called themselves<br/>\nunschoolers. &quot;Unschoolers???!!!&quot; I exclaimed in disbelief, &quot;What kind of<br/>\nawful, neglectful parent would be an unschooler?&quot;<br/>\n<br/>\nAfter a few months of research into the subject, however, I came to the<br/>\nunbelievable realization that we actually are unschoolers.<br/>\n<br/>\nWith an additional couple of months of reading and discussion under my <br/>\nbelt,<br/>\nI came to the firm conclusion that we are nothing at all like most<br/>\nunschoolers.<br/>\n<br/>\nFurther study, however, revealed that we are pretty close to being<br/>\nunschoolers on Tuesdays and Thursdays, that any parent who doesn&quot;t <br/>\n&quot;whoop&quot;<br/>\ntheir kids is an unschooler, that everyone who doesn&quot;t use <br/>\nschool-in-a-box<br/>\nis an unschooler, that only three people on earth are pure unschoolers, <br/>\nand<br/>\nthat only people who eat granola and sleep in a family bed and don&quot;t <br/>\nbelieve<br/>\nin razors are unschoolers.<br/>\n<br/>\n*Unschooling Undefined<br/>\n<br/>\nI wasn&quot;t flip-flopping in my philosophy, I was hearing a new <br/>\n&quot;definition&quot;<br/>\nfor unschooling every week. On its face, the term only defines in the<br/>\nnegative, telling you what it is not, rather than what it is. Most <br/>\npeople in<br/>\nthe educational mainstreamÑoutside of the home education movementÑhave <br/>\nnever<br/>\nheard of it. And those inside the home education movement use the term <br/>\nin so<br/>\nmany different ways as to make the term nearly noncommunicative.<br/>\n<br/>\nEven a great deal of research did not clarify the issue. Nowhere could I<br/>\nfind even a broad definition that was generally accepted. I was sure <br/>\nthat<br/>\nall I needed to do was to get some information &quot;from the horse&quot;s <br/>\nmouth,&quot; so<br/>\nto speak. So I finally approached dozens of self-proclaimed unschoolers <br/>\nin<br/>\nvarious different forums and asked them to define unschooling.<br/>\n<br/>\nThe responses actually quite surprised me. By far the most common <br/>\ninitial<br/>\nresponse I received was, &quot;Unschooling does not have a definition and I <br/>\nsee<br/>\nno need to define it for anyone else!&quot;<br/>\n<br/>\nMy follow-up question was, &quot;If unschooling has no meaningful <br/>\ndefinition, why<br/>\ndo you label yourself as such?&quot; While this did not illicit a rush of <br/>\nwarm<br/>\nembraces, most people realized that I was not attacking their ideology, <br/>\nbut<br/>\nsimply asking for some philosophical analysis. At that point, a very<br/>\ninformative discussion ensued.<br/>\n<br/>\nTwo semi-definitions of unschooling resulted from these discussions<br/>\n(although every person I spoke with insisted that it could not be <br/>\nsuccinctly<br/>\ndefined). These were the most common answers that could garner any kind <br/>\nof<br/>\nsupport. An unschooler is someone who:<br/>\n<br/>\nLeans toward unstructured learning<br/>\n<br/>\nand/or<br/>\n<br/>\nLeans toward child-led learning<br/>\n<br/>\n*Unstructured<br/>\n<br/>\n&quot;Children should not sit still after hour after, being spoonfed <br/>\neverything<br/>\nthey need to know from some rigid, generic curriculum.&quot;<br/>\n<br/>\nMany homeschoolers have realized that too much &quot;schooly&quot; structure is <br/>\nnot<br/>\nbeneficial and is actually deleterious to learning. This freeing<br/>\nrealization, however, has led some to discard all structure, whether<br/>\nbeneficial or not.<br/>\n<br/>\nThis confuses two separate issues. One being the rigid structure of the<br/>\nenvironment (such as the restrictive discipline that is typically <br/>\nneeded to<br/>\nmaintain order in a classroom with one teacher and 30 students), and the<br/>\nother being the structure of the material being learned.<br/>\n<br/>\nDepending on the subject at hand and the stage of learning the child has<br/>\nprogressed to, structured learning may well be the most effective way to<br/>\nmaster a given material.<br/>\n<br/>\n&quot;We prefer natural learning, just letting life happens as it happens.&quot;<br/>\n<br/>\nThis standard may well ignore the fact that some learning requires<br/>\norganization. Some subjects do not offer enough information/feedback to <br/>\nbe<br/>\nlearned effectively if only studied as infrequently and haphazardly as <br/>\nthey<br/>\nmay be encountered in day to day activity.<br/>\n<br/>\nLearning any topic thoroughly and effectively, requires a healthy<br/>\ncombination of both structure and free exploration. To disavow <br/>\nstructure as<br/>\nbeing bad in and of itself may result, under the best circumstances, in <br/>\nthe<br/>\nchild wasting time and energy and, in the worst, in the child becoming<br/>\nsufficiently frustrated and discouraged in the learning process that he<br/>\nloses interest.<br/>\n<br/>\n*Undirected<br/>\n<br/>\n&quot;Children won&quot;t learn anything they are forced to do, they only truly <br/>\nlearn<br/>\nif they want to learn.&quot;<br/>\n<br/>\nThis provocative assumption argues that learning only occurs if <br/>\nchildren are<br/>\ncompletely in charge of subject matter and timetable. But the logic is<br/>\nfundamentally flawed. In fact, all the unschoolers I know except three<br/>\nunwittingly disprove this theory by their practice.<br/>\n<br/>\nMany will ascribe dire consequences to any subject being coerced, <br/>\nforced, or<br/>\nrequired of children. These same parents, however, still have skills or<br/>\nbehaviors that they consider &quot;non-optional.&quot; These generally have to do <br/>\nwith<br/>\nhealth and safety and family lifestyle. For example, these parents <br/>\nrequire<br/>\ntheir children to: brush their teeth, stay out of the road, help with<br/>\nchores, etc.<br/>\n<br/>\nThese parents don&quot;t take the position that requiring a child to brush <br/>\nhis<br/>\nteeth will make him hate tooth brushing so much that he will never brush<br/>\nagain once the parent&quot;s influence is diminished. But they do claim that<br/>\nrequiring math study will create math-haters and math-phobics who will <br/>\navoid<br/>\ncomputation for the rest of their lives. They don&quot;t seem to recognize <br/>\nthis<br/>\ninconsistency.<br/>\n<br/>\nIf entirely child-led learning is truly a sound educational foundation, <br/>\nit<br/>\nwould not be limited so arbitrarily to subjects somehow labeled <br/>\n&quot;academic&quot;<br/>\nas opposed to &quot;real-life.&quot;<br/>\n<br/>\n&quot;Children won&quot;t learn from the mistakes of others, they have to learn <br/>\nfor<br/>\nthemselves.&quot;<br/>\n<br/>\nThis speaks more of a lack of trust in the family relationships than it <br/>\ndoes<br/>\nof educational philosophy. It also flies in the face of historical <br/>\nreality;<br/>\nlearning from others is the way man has progressed from tribalism and<br/>\nbarbarism to various levels of civilized endeavor. If every person <br/>\ntruly had<br/>\nto learn everything on their own, no one would have been able to build <br/>\non<br/>\nand surpass the accomplishments of prior generations.<br/>\n<br/>\nTo my husband, a scientist, this is a most basic concept. He could not <br/>\nmake<br/>\nthe progress he has made in fuzzy logic research if he were not able, <br/>\nand<br/>\nwilling, to stand on the shoulders of those who laid the foundationÑto <br/>\nlearn<br/>\n from their success and failure paths. If he did not examine their work <br/>\nand<br/>\nmistakes and experience, trust in their validity, and learn from them, <br/>\nhe<br/>\nwould have to reinvent the wheel. He would be forced to learn <br/>\neverything on<br/>\nhis own, and simply wouldn&quot;t have enough hours in the day to make a <br/>\nuseful<br/>\ncontribution.<br/>\n<br/>\n&quot;I can&quot;t possibly know what my child will want to be or to do when they <br/>\ngrow<br/>\nup, so I would never presume to tell them what they need to know.&quot;<br/>\n<br/>\nThis statement implies that since a parent cannot make perfect, specific<br/>\npredictions, that he also cannot make very good, general predictions. <br/>\nThis<br/>\nis completely inaccurate.<br/>\n<br/>\nWhile I may not always be able to guess exactly how many ounces of <br/>\nwater any<br/>\nof my daughters will drink on a given day, I can tell you that each of <br/>\nthem<br/>\nwill drink at least some water on that day with nearly 100% accuracy.<br/>\n<br/>\nThe same principle holds true for most academic work. While I can&quot;t <br/>\npredict<br/>\nexactly how many math problems in a particular text would be of optimum<br/>\nbenefit to my children, I can say that for most people in our society an<br/>\nunderstanding of math through the second year of algebra would be <br/>\nextremely<br/>\nbeneficial given the cost (time, energy, expense) of learning. I can <br/>\nalso<br/>\nsay that if our society continues to progress technologically, math <br/>\nthrough<br/>\ncalculus will be likely to be helpful to most people in the future.<br/>\n<br/>\nTo make these generalizations a parent does not need to second-guess a<br/>\nchild&quot;s vocation nor require her to specialize.<br/>\n<br/>\nThere is another underlying implication in this statement: that because<br/>\nparents do not have the ability to make perfect decisions, they should <br/>\nmake<br/>\nnone at all. It says that since we can&quot;t know exactly how much history <br/>\nwill<br/>\nfit in perfectly with their future career and/or life choices, we have <br/>\nno<br/>\nright to say that they need to know any history at all.<br/>\n<br/>\nNot only does this ignore the fact that parents have more experience and<br/>\nhopefully more wisdom to draw upon than their children, but it also <br/>\nignores<br/>\nthe fact that every decision we make is subject to our imperfections. In<br/>\nspite of this, most of us do not feel immobilized.<br/>\n<br/>\nOften, as before, the parents making these claims, themselves show the <br/>\nlack<br/>\nconsistency in this argument. They cannot perfectly determine precisely <br/>\nhow<br/>\nmuch and what manner of toothbrushing will be most beneficial to each <br/>\nchild.<br/>\nStill they feel justified in compelling their children to brush. Why?<br/>\nBecause they feel that the cost (time, energy, expense) of brushing is<br/>\noutweighed by the benefit, and they feel qualified to make a good <br/>\ngeneral<br/>\nestimate of how much brushing is required to reach an acceptable <br/>\nbenefit.<br/>\n<br/>\nOnce again the most effective type of learning is a combination of<br/>\nwell-thought out guidance in conjunction with personal initiative.<br/>\n<br/>\n*The Good Stuff<br/>\n<br/>\nWe are not unschoolers. The label has so many varied definitions and <br/>\nthey<br/>\nare often inconsistent with our ideology.<br/>\n<br/>\nStill I have learned a great deal from the unschoolers I know. I&quot;ve <br/>\nlearned:<br/>\nto find education most anywhere; to ignore practices and methods that <br/>\ndon&quot;t<br/>\nserve us; to watch and listen to my children with my heart.<br/>\n<br/>\nThis was first published in 1996 in Super Learning Tools.</div>","specialLinks":[]}],"prevTopicId":107408,"nextTopicId":107543}}