{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Relatives who parent &#39;the regular way&#39;","postDate":"1342688786","msgId":68250,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1OGltaSt1dTgxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFFODc0MUIwLTBEMUMtNDQzMC1BM0ZBLTIxRjlCMDYzRTI5REBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":68245,"nextInTopic":0,"prevInTime":68249,"nextInTime":68252,"topicId":68232,"numMessagesInTopic":0,"msgSnippet":"... I have an alternative view of ADHD . It s here and free for anybody who wants to read it: http://www.parental-intelligence.com/HTAPATTSM.pdf Some other","messageBody":"<div id=\"ygrps-yiv-1276818696\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-I&#39;d be inclined to just listen to what she has to say. You could tell <br/>\n&gt; her &quot;I have access to lots of good information about alternatives. <br/>\n&gt; Let me know if you want it&quot; and leave it at that.-=-<br/>\n&gt; <br/>\n&gt; Oh, right!!<br/>\n&gt; At least alternative views of &quot;ADHD.&quot;  And accepting the range of differences in people, maybe.  <br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I have an alternative view of &quot;ADHD&quot;. It&#39;s here and free for anybody who wants to read it:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.parental-intelligence.com/HTAPATTSM.pdf\">http://www.parental-intelligence.com/HTAPATTSM.pdf</a><br/>\n<br/>\nSome other ideas that come to mind:<br/>\n<br/>\nDr. Peter Breggin&#39;s website for information on psychiatric drugs that&#39;s more accurate than the tosh most school teachers seem to believe:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.breggin.com/\">http://www.breggin.com/</a><br/>\n<br/>\nDr. John Breeding&#39;s parenting work (&quot;Education Resources For Adults Who Work With Challenging Young People (and themselves)&quot;):<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.wildestcolts.com/parenting.html\">http://www.wildestcolts.com/parenting.html</a><br/>\n<br/>\nThe Tyranny of Therapism (article)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.catholiceducation.org/articles/education/ed0262.html\">http://www.catholiceducation.org/articles/education/ed0262.html</a><br/>\n<br/>\nAlternative Education Resource Organization<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.educationrevolution.org/\">http://www.educationrevolution.org/</a> <br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Relatives who parent &#39;the regular way&#39;","postDate":"1342638435","msgId":68244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDI2Mzg0MzUuODAyODUuWWFob29NYWlsTmVvQHdlYjEyMjUwMS5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDQ4Qzk4NjE3LTNBNzktNDIxNC05Q0QzLTkyMDVDNEFGOTBFQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ4Qzk4NjE3LTNBNzktNDIxNC05Q0QzLTkyMDVDNEFGOTBFQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":68242,"nextInTopic":68245,"prevInTime":68243,"nextInTime":68245,"topicId":68232,"numMessagesInTopic":0,"msgSnippet":"***How can I help her (since she is discussing her situation all the time with me) given that I am not able to marry my unschooling beliefs with what may be","messageBody":"<div id=\"ygrps-yiv-869747884\">***How can I help her (since she is discussing her situation all the time with me) given that I am not able to marry my unschooling beliefs with what may be traditionally available in special ed...If there are families on this list who have been able to marry these two, please throw some light on how that has been possible.***<br/>\n<br/>\n<br/>\nI recently became aware of a school program in our area that does special ed very different than what I&#39;ve ever known it to be.  It&#39;s very play based, even for middle school aged kids.  I know a mom with a kid in that program.  The kid, also, as part of the program, sees a therapist on a regular basis.  The therapist works entirely on the premise that kids should have choices and that with lack of choices, a kid who doesn&#39;t fit the &quot;system&quot; will struggle.  <br/>\n<br/>\nIt was an eye opening moment for me to realize that there ARE therapist and programs within the public school system that are different, even if rare and hard to find.  The fact that they exist at all says to me that someone, somewhere had the foresight and knowledge that special ed doesn&#39;t need to be a one sized fits all, boxed in program, that it CAN be done differently.<br/>\n<br/>\nI don&#39;t need to agree with the need for special ed, or agree with any of the approaches they use, to see that alternatives can be good things and that they exist.  This particular program tries very hard to avoid medicating kids.<br/>\n<br/>\nThe scariest part of your story is the push for meds on a 5 yr old.  It literally makes me sick to my stomach when I hear of young children being medicated with these highly dangerous drugs.  I&#39;ve known many kids who have been on these meds and can give you very detailed descriptions of the side effects that they have, both good and bad.  The fact that many kids can sell them on the street should be enough for any parent to think twice about dosing their child with them.<br/>\n<br/>\nThose points would be the direction I&#39;d go:  The fact that there are special ed programs that don&#39;t operate the way her child&#39;s does and that medicating kids can be dangerous. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":509606312,"authorName":"jennifer_kembel","from":"&quot;jennifer_kembel&quot; &lt;jennifer_kembel@...&gt;","profile":"jennifer_kembel","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Relatives who parent &#39;the regular way&#39;","postDate":"1342636895","msgId":68245,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1NzAwditybzI2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4Qzk4NjE3LTNBNzktNDIxNC05Q0QzLTkyMDVDNEFGOTBFQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":68244,"nextInTopic":68250,"prevInTime":68244,"nextInTime":68246,"topicId":68232,"numMessagesInTopic":0,"msgSnippet":"It can be difficult to not want to share unschooling with those we love...it can bring such joy and peace to our lives and our childrens lives, so of course","messageBody":"<div id=\"ygrps-yiv-1479576875\">It can be difficult to not want to share unschooling with those we love...it can bring such joy and peace to our lives and our childrens&#39; lives, so of course we want to gift this knowledge to others we care about. As with any personal opinions or convictions, it will likely fall on deaf ears or irritate the recipient if they are not open to the concept. At best, you may plant a seed, that given the right conditions, may begin to grow inside the person sometime in the future. If your relative is asking for your opinion, she is opening the door, if even just a crack, to hearing more about your point of view on the subject. If she is not asking for your opinion, except regarding how to provide the best for her son within the school system, I would suggest being a good sounding board for her and helping her navigate the options within the school as well as outside of the school, but to not push unschooling.<br/>\n<br/>\nIf she is curious about unschooling, I will share some information about my oldest son who is now 5 1/2 years old and who experienced a very similar schooling experience to your relative.<br/>\n<br/>\nMy son began Pre-kindergarten in 2010, as suggested by an SLP due to a severe speech delay. He did show some progress by the year end but certainly not enough to advance to kindergarten the following year. The teachers were suggesting he may have adhd and may even be on the autism spectrum. The following summer, his speech improved vastly. Significantly more so over the two months of summer than all the previous school year. He was happier, more outgoing. Then he began his second year in Pre-k. I expected him to continue to progress but he regressed. Significantly. Both his speech and in his interactions with his peers. His teachers were lining up an OT for him, he still had a SLP working with him, and they were considering a PT because of his awkward way of running. They recommended he see a specialist to diagnose him for adhd and check into the possibility of aspergers. <br/>\n<br/>\nI saw my energetic happy boy becoming withdrawn and quiet. Mind you the description of him given by his teachers was quite different than the boy I saw at home. At parks he would interact freely with other kids, at school almost not at all. At home he could concentrate for long periods of time on projects he was interested in, but in school he was &quot;distracted, spaced-out, fidgety&quot;. I realized that school was not working for my son. He was not in an environment conducive to his natural way of learning. There was nothing wrong with my son, but rather the environment. By October I made the decision to homeschool. Soon after, I discovered unschooling and the philosophy made so much sense to me...reading about unschooling was like seeing some of my own thoughts written on paper, although much more eloquently written :-)<br/>\n<br/>\nVery shortly after pulling my son from school ( I did ask him if he would prefer school or to be at home. His answer was home) his speech again took such a progressive leap. He was so much more happy and lively. He picked up 95% of the letters of the alphabet within two months of leaving school... I was constantly surprised to discover what he knew (still am, every single day). I didn&#39;t &quot;teach&quot; him the letters. Goodness knows all the &quot;teaching&quot; his teachers did just couldn&#39;t get those letters in his head :-). One day months ago he spelled &#39;bumblebee&#39; while I was tucking him in bed. I asked him where he learned that. His reply...from his Bumblebee transformer lego :-)<br/>\n<br/>\nSorry to ramble on, but truth be told for me this is keeping my writing short!</div>","specialLinks":[]},{"userId":136234893,"authorName":"Shauna Reisewitz","from":"Shauna Reisewitz &lt;shaunareisewitz@...&gt;","profile":"shaunareisewitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Relatives who parent &#39;the regular way&#39;","postDate":"1342618367","msgId":68242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDI2MTgzNjcuNjIyNjEuWWFob29NYWlsTmVvQHdlYjE2MDMwMy5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":68241,"nextInTopic":68244,"prevInTime":68241,"nextInTime":68243,"topicId":68232,"numMessagesInTopic":0,"msgSnippet":"IN our particular school district, you could be enrolled in a homeschool program, basically unschool at home or homeschool any way that works for your family,","messageBody":"<div id=\"ygrps-yiv-1369198042\">IN our particular school district, you could be enrolled in a homeschool program, basically unschool at home or homeschool any way that works for your family, provided you do monthly paperwork, and have access to Special Ed through the homeschool program you are enrolled in. If that is an option in your school district, that may be a more comfortable option for her. You might start by seeing if there is such a homeschool program in your local school district. IF there is, I believe they must allow kids access to special ed;but that could be a California law. <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Relatives who parent &#39;the regular way&#39;","postDate":"1342613191","msgId":68241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1NjhzNytjOGRqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4Qzk4NjE3LTNBNzktNDIxNC05Q0QzLTkyMDVDNEFGOTBFQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":68237,"nextInTopic":68242,"prevInTime":68240,"nextInTime":68242,"topicId":68232,"numMessagesInTopic":0,"msgSnippet":"... Given that, do you have better ideas for how she can help her son cope within the school system? Can you use the information you have to help her find","messageBody":"<div id=\"ygrps-yiv-485530133\"><blockquote><span title=\"ireply\">&gt;&gt;she also is not able to pull away from the school system<br/>\n<br/>\n </span></blockquote>Given that, do you have better ideas for how she can help her son cope within the school system? Can you use the information you have to help her find better resources for helping her son at school or helping him decompress when he&#39;s home from school? Think of what you can do in those terms. Within the context of school, special ed programs can help a kid get something better than the &quot;one size fits all&quot; standard. Help her discover more options - that&#39;s an &quot;unschooling&quot; way of looking at things, if you like. If you were taking kids to something that might be dull or difficult, you&#39;d help them have options so they&#39;d have a better experience. You can do the same for this family, maybe. Because they&#39;re in the school system, that&#39;s going to look like &quot;working the system&quot;.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; She is unhappy with the constant feedback she gets from the school that tells her all the things her son has not been able to achieve and how medication is the only answer.<br/>\n </span></blockquote>***************<br/>\n<br/>\nPart of working the system, from a parent&#39;s point of view, is sometimes standing up to the &quot;experts&quot; and saying &quot;not my kid, find another way&quot;. If you do it all the time, you make an enemy of the staff. If you never do it, you may do your child a disservice - he won&#39;t get the special services he really needs (needs in order to have a better school experience). But standing up means mom needs some information as to alternatives. If not medication, what? Do the goals for him need to be re-evaluated? Does his learning plan (IEP or whatever) need to be changed? What can she do at home to help that? If may be that an outside evaluation would help in that regard. <br/>\n<br/>\nThat&#39;s the kind of information you might be able to offer - how to work the system kinds in information. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;is not very happy (has openly expressed her disapproval) with the way my own child is being raised without restrictions (e,g TV, technology access, food, no scheduled bed times). <br/>\n </span></blockquote>**************<br/>\n<br/>\nI hope you&#39;re letting her know there are other ways to homeschool! It could be very daunting for her to think the only alternative to school is to unschool. If you think she might try homeschooling, you can make cheerful comments about the fact that home-ed allows you to really tailor your educational program to your child&#39;s needs. She may still be daunted, given she&#39;s now been told over and over that her kid Needs all sorts of special programs etc to succeed, but its also possible she could get to the point where she doesn&#39;t see school helping at all. Then it would be good for her to know there are options.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Relatives who parent &#39;the regular way&#39;","postDate":"1342591324","msgId":68237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFODc0MUIwLTBEMUMtNDQzMC1BM0ZBLTIxRjlCMDYzRTI5REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDMwMDU1MzY3LTg5M0YtNDM2OS1BMUQxLTU4QkVFOTU2MUM5RkBjb21jYXN0Lm5ldD4=","referencesHeader":"PDQ4Qzk4NjE3LTNBNzktNDIxNC05Q0QzLTkyMDVDNEFGOTBFQUBTYW5kcmFkb2RkLmNvbT4gPDMwMDU1MzY3LTg5M0YtNDM2OS1BMUQxLTU4QkVFOTU2MUM5RkBjb21jYXN0Lm5ldD4="},"prevInTopic":68236,"nextInTopic":68241,"prevInTime":68236,"nextInTime":68238,"topicId":68232,"numMessagesInTopic":0,"msgSnippet":"-=-I d be inclined to just listen to what she has to say. You could tell her I have access to lots of good information about alternatives. Let me know if you","messageBody":"<div id=\"ygrps-yiv-465865505\">-=-I&#39;d be inclined to just listen to what she has to say. You could tell <br/>\nher &quot;I have access to lots of good information about alternatives. <br/>\nLet me know if you want it&quot; and leave it at that.-=-<br/>\n<br/>\nOh, right!!<br/>\nAt least alternative views of &quot;ADHD.&quot;  And accepting the range of differences in people, maybe.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Relatives who parent &#39;the regular way&#39;","postDate":"1342591228","msgId":68236,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhERkZBNDQyLTNBOTItNDA2My05OEQxLUI0NTFDQUU5OUQ2QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQ4Qzk4NjE3LTNBNzktNDIxNC05Q0QzLTkyMDVDNEFGOTBFQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ4Qzk4NjE3LTNBNzktNDIxNC05Q0QzLTkyMDVDNEFGOTBFQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":68235,"nextInTopic":68237,"prevInTime":68235,"nextInTime":68237,"topicId":68232,"numMessagesInTopic":0,"msgSnippet":"-=-How can I help her (since she is discussing her situation all the time with me) given that I am not able to marry my unschooling beliefs with what may be","messageBody":"<div id=\"ygrps-yiv-870939142\">-=-How can I help her (since she is discussing her situation all the time with me) given that I am not able to marry my unschooling beliefs with what may be traditionally available in special ed�-=-<br/>\n<br/>\n-=-Should I just not discuss any of this (parenting, special ed) with her at all?-=-<br/>\n<br/>\nBecause you&#39;re trained in special ed, though, she probably considers you a family resource. so it would be weird for you to just pretend you don&#39;t hear her.<br/>\n<br/>\nMaybe instead of feeling a need to educate her, just be conversational, and don&#39;t expect the conversation to take place all at once.<br/>\n<br/>\nIf you were to say &quot;I no longer feel the same way I did about early intervention,&quot; and then not say any more until/unless she does, that would be a way for you to state your change of mind honestly and plainly.<br/>\n<br/>\nIf she asks anything, maybe you could say that you didn&#39;t see any harm in it before, but you&#39;ve thought about it some more and been around people whose goals were different, and now you do see the damage that can come.  That&#39;s too many words, but something about harm or damage. :-)<br/>\n<br/>\nAnother point I&#39;m guessing is that when you studied special ed, you weren&#39;t a parent.  Having become a mother, you probably see it now as something that happens to an individual child within a family, rather than to groups of children in a statistical array.<br/>\n<br/>\nBut don&#39;t ask her to respond or to agree.  Leave a bit of reasoning and don&#39;t press it.<br/>\n<br/>\nThat&#39;s what I think might be most ideal for starters.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Relatives who parent &#39;the regular way&#39;","postDate":"1342590915","msgId":68235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwMDU1MzY3LTg5M0YtNDM2OS1BMUQxLTU4QkVFOTU2MUM5RkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDQ4Qzk4NjE3LTNBNzktNDIxNC05Q0QzLTkyMDVDNEFGOTBFQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDQ4Qzk4NjE3LTNBNzktNDIxNC05Q0QzLTkyMDVDNEFGOTBFQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":68232,"nextInTopic":68236,"prevInTime":68234,"nextInTime":68236,"topicId":68232,"numMessagesInTopic":0,"msgSnippet":"... I know what this feels like a bit, because as a La Leche League Leader, I wanted *every* mother, especially my sisters-in-law, to nurse their babies","messageBody":"<div id=\"ygrps-yiv-837024232\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Should I just not discuss any of this (parenting, special ed) with  <br/>\n&gt; her at all?<br/>\n<br/>\n </span></blockquote>I know what this feels like a bit, because as a La Leche League  <br/>\nLeader, I wanted *every* mother, especially my sisters-in-law, to  <br/>\nnurse their babies (preferably into toddlerhood). It wasn&#39;t realistic.  <br/>\nTheir lives and families and situations were different from mine. I  <br/>\nrealized that I could only be a source of information if they wanted  <br/>\nit. I offered and let it go.<br/>\n<br/>\nI&#39;d be inclined to just listen to what she has to say.  You could tell  <br/>\nher &quot;I have access to lots of good information about alternatives.  <br/>\nLet  me know if you want it&quot; and leave it at that.<br/>\n<br/>\nBe kind and helpful and show some ways of interacting with her child  <br/>\nby just doing it. No comments. No advice.<br/>\n<br/>\nShow her what a respectful, happy life can look like with your own  <br/>\nchild. Don&#39;t explain. If she asks or comments, you could say &quot;this  <br/>\nworks for us. When it stops working, we&#39;ll do something else.&quot;<br/>\n<br/>\nIf she asks for advice, you could send her some stories from Sandra&#39;s  <br/>\nsite for her to absorb. You could buy her Pam Laricchia&#39;s book &quot;Free  <br/>\nto Learn - Five Ideas for a Joyful Unschooling Life.&quot;<br/>\n<br/>\nIt will, after all, be her decision to live with, not yours. Be a calm  <br/>\nand happy resource, but only if she wants it.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Relatives who parent &#39;the regular way&#39;","postDate":"1342588938","msgId":68232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4Qzk4NjE3LTNBNzktNDIxNC05Q0QzLTkyMDVDNEFGOTBFQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":68235,"prevInTime":68231,"nextInTime":68233,"topicId":68232,"numMessagesInTopic":0,"msgSnippet":"From here down is a question from someone who would like to remain anonymous, but I want to add a couple of details.  The child of the host family is younger","messageBody":"<div id=\"ygrps-yiv-1117173838\">From here down is a question from someone who would like to remain anonymous, but I want to add a couple of details.  The child of the host family is younger than 5 and it&#39;s a six-week international visit.<br/>\n<br/>\nMy eyes glazed over on the technical special-ed paragraph, but keep going.  The real questions are at the bottom.  And I would like to generalize this topic to other families, too, where there are clashes of parenting styles regarding cousins.<br/>\n<br/>\n----------------------------------------------------------------------------------------------------------------------<br/>\n<br/>\nI have a very close family member has a child (K) who is 5. <br/>\nK has been diagnosed with various non specific special needs. <br/>\nK is in a special education program.<br/>\n<br/>\nPrevious to my introduction to Unschooling and becoming a mother myself, I was very much a cheerleader (trained in special-ed myself) to getting him tested, getting him therapy, doing the whole nine yards of trying to &quot;fix&quot; him and getting him &quot;caught up&quot;.<br/>\n<br/>\nNow I just look at him and see a happy kid who is getting way too many instructions from her and lots of &quot;talk-based-feedback&quot; which I am not sure half of which he understands or cares for. I see a lot of &quot;No&#39;s&quot; that he shouts back at her and she gets very stressed out to get him to do whatever it is that she is trying to get him to do.<br/>\n<br/>\nThe mother obviously thinks I have swung quite the other extreme, since from what I had described above, since I am suggesting that may be special ed may not be the best answer for her little one.This suggestion was made by me because of all the negativity she has been facing from the school district, the SLP&lt;OT&lt; PT including the fact that they have recommended that he been taken to a neuropysch/MD who has now diagnosed him with ADHD and prescribed medication- all over the course of the past school year.<br/>\n<br/>\nThe mother is obviously confused with her own situation and her intuitive understanding of her son, but she also is not able to pull away from the school system and is not very happy (has openly expressed her disapproval) with the way my own child is being raised without restrictions (e,g TV, technology access, food, no scheduled bed times). <br/>\n<br/>\nNeedless to say, there has been a lot of tension at home.They are visiting for an extended period of time.<br/>\n<br/>\nWhat I have told her so far - is that there may be options to find &quot;genuinely children friendly therapists&quot; and that &quot;play based therapy&quot; (outside of the school setting) itself may not be bad, if she can learn things from the therapist that will help her son meet his various needs.<br/>\n<br/>\nShe is too fearful to let go of the special ed classroom that he is a part of because she worries that she will be doing him a disservice if she pulls him out and that all the delays that everybody sees will not be addressed if he does not get that structured treatment. She is unhappy with the constant feedback she gets from the school that tells her all the things her son has not been able to achieve and how medication is the only answer.<br/>\n<br/>\nComing to my question.<br/>\n<br/>\nHow can I help her (since she is discussing her situation all the time with me) given that I am not able to marry my unschooling beliefs with what may be traditionally available in special ed...If there are families on this list who have been able to marry these two, please throw some light on how that has been possible.<br/>\n<br/>\nAlso, I am starting to realize it a bit more complicated than that. The more I talk to her, the more I feel the need to explain unschooling which makes it more apparent how different our parenting styles are and I don&#39;t think she is going to change her parenting style any time soon.<br/>\n<br/>\nShould I just not discuss any of this (parenting, special ed) with her at all?</div>","specialLinks":[]}],"prevTopicId":68200,"nextTopicId":68155}}