{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":98,"messages":[{"userId":0,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"mom2zimmy","replyTo":"LIST","senderId":"4_zghIYjYSSeg5Jg8Tv8gsI0-BZwYJG-4Y3SyBAX-KvakXzqBPkONURp4wSEZTBWoZ3L263agXk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004648021","msgId":27251,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTAxLjEzNTM1MS4tOTU5MTE3LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27250,"nextInTopic":27254,"prevInTime":27250,"nextInTime":27252,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... That s a real possibility, I m in a bubble here, and I have seen some nasty coercion by the ps *homeschool* programs.  I concede it may not be this ugly","messageBody":"<div id=\"ygrps-yiv-1163178420\"><blockquote><span title=\"ireply\">&gt; I wonder if you might be lumping all of these kinds of programs <br/>\n&gt; together <br/>\n&gt; and judging them by what you know about one or a few. <br/>\n<br/>\n </span></blockquote>That&#39;s a real possibility, I&#39;m in a bubble here, and I have seen some<br/>\nnasty coercion by the ps *homeschool* programs.  I concede it may not be<br/>\nthis ugly everywhere.  But it&#39;s proof it&#39;s not exactly nice everywhere,<br/>\neither.<br/>\n <br/>\n<blockquote><span title=\"ireply\">  &gt; In other words, my family makes all the choices, not the <br/>\n&gt; program.  <br/>\n<br/>\n </span></blockquote>If you&#39;re satisfied, then good for you.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; we still are required to &quot;provide an educational program&quot; for our <br/>\n&gt; kids, <br/>\n&gt; even if we are &quot;real&quot; homeschoolers. <br/>\n<br/>\n </span></blockquote>Yes, the law says we must, but that still doesn&#39;t mean it&#39;s right.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;parents need to be educated about choices in  <br/>\n&gt; education.<br/>\n<br/>\n </span></blockquote>I agree!  I just question whether parents will find education about all<br/>\nthe other choices at a ps homeschool program.  I think they may very well<br/>\nbe told they&#39;ve been informed though.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; So as long as you have the option to keep the government from making <br/>\n&gt; these <br/>\n&gt; decisions for *your* child, isn&#39;t that good enough? <br/>\n<br/>\n </span></blockquote>As long as I get what I want, to heck with everybody else?  How long do I<br/>\nget to keep this option if the government decides the example of<br/>\nhomeschoolers participating in programs proves homeschoolers don&#39;t mind<br/>\n*some* oversight -- and then some more? <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; So it&#39;s ok for the &quot;real&quot; homeschoolers to be working to limit *my* <br/>\n&gt; choices?  <br/>\n<br/>\n </span></blockquote>I would NEVER work to limit anyones choices. I don&#39;t want mine limited<br/>\neither.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; So work to keep the choices open, not shut down the ones you don&#39;t <br/>\n&gt; believe in.<br/>\n <br/>\n </span></blockquote>Ok, then.<br/>\n<br/>\nHere&#39;s what concerns me.  Some nut decides it&#39;s just too terrible that<br/>\nthere is no oversight of &quot;these homeschools&quot;.  But look here! <br/>\nHomeschoolers have been happy with charters and ps programs and<br/>\nalternative schools, no complaints about reporting, or whatever.  Let&#39;s<br/>\njust make it a law that kids can&#39;t be homeschooled except through one of<br/>\nthese handy little facilities.  Down the road a piece we can test all the<br/>\nkids and see how they&#39;re doing and then if it&#39;s necessary, we can require<br/>\nthis or that and it&#39;s still just like homeschooling except that we know<br/>\nwhat&#39;s really going on.  <br/>\n<br/>\nAm I paranoid?  ( or perceptive? &lt;g&gt; )  Am I an alarmist? ( or Chicken<br/>\nLittle?)  <br/>\nyou don&#39;t really have to answer.<br/>\n<br/>\nI  think you have every right to make your own choices.  I have agonized<br/>\nover my own, as parents do.  You show me your ulcer, I&#39;ll show you mine.<br/>\n&lt;g&gt;<br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":0,"authorName":"chrisoco@aol.com","from":"chrisoco@...","profile":"chrisoco_2","replyTo":"LIST","senderId":"_zT2exAITjEKcmhHI2I3eKFxu4duNyPHJq3mppB66HsWvrnUuf0d3C8eRs9ME5S0HtqeJzhfww","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Gobbling Up Homeschoolers","postDate":"1004646177","msgId":27250,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlyc2F2MStlMGhyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PHAwNTAwMTk5MmI4MDYxMDBkOTI0Y0BbMjA4LjI2LjIyNy4yMTBdPg=="},"prevInTopic":27249,"nextInTopic":27251,"prevInTime":27249,"nextInTime":27251,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... Count me as one, Helen. The parrallels between the home birth communitie and the home ed community are tremendous. As the hospitals and professionals took","messageBody":"<div id=\"ygrps-yiv-129850766\">--- In Unschooling-dotcom@y..., Helen Hegener &lt;HEM-Editor@h...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; At 11:51 AM -0800 10/31/01, Lynda wrote:<br/>\n&gt; <br/>\n&gt; The whole idea of homebirthing was co-opted by the professionals<br/>\n&gt; and institutions, and we&#39;re seeing the same thing happen with<br/>\n&gt; homeschooling.<br/>\n&gt; <br/>\n&gt; Anyone getting scared yet?<br/>\n<br/>\n </span></blockquote>Count me as one, Helen. The parrallels between the home birth <br/>\ncommunitie and the home ed community are tremendous. As the hospitals <br/>\nand professionals took on &quot;home-like&quot; settings and twisted ideas into <br/>\ntheir own, fewer home birth advocates were willing to &quot;fight the <br/>\nfight&quot;. Its tiring to go against the flow all the time and some folks <br/>\nare really just looking for when they can go back to an easier way <br/>\nwithout having to forego all of their views, thus, homelike hospital <br/>\nbirths and government homeschooling programs. Oxymorons to me, but to <br/>\nothers, an answer to walking against the wind.<br/>\n<br/>\nIn some part, I think economics are affecting us, but also, the <br/>\ndownside of a natural inflation/deflation progression. The home ed <br/>\ncommunity was on a rapid increase through much of the 90&#39;s.<br/>\n<br/>\nIt still worries me in some ways. In others, I think we&#39;ll just melt <br/>\nback down to a core group and move forward. Not sure yet.<br/>\n<br/>\nin peace,<br/>\n<br/>\nChris O&#39;Connor <br/>\n<br/>\nPS I love hearing from you, Helen. Any concrete ways we can help <br/>\ninsure HEM stays around? What could we do to help?</div>","specialLinks":[]},{"userId":0,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","senderId":"5l8OR9dyZ08KYQKheiDnEP73Cp6FmRpLiL_zZszs8bXZR0_9e6G8vI82IysX9SRT1LgVyNSz0wBC8kmhIQ9uHTdja8SGcvWA0q4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004641420","msgId":27249,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAxMTEwMTEwNTY0OS4wMGFhM2VjMEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PDAwY2QwMWMxNjJmZSQwYWUzYzhjMCQzNzVkZDFkMUBqaWRhMzU+","referencesHeader":"PDIwMDExMTAxLjA1MTc1Ny4tOTYyMDE3LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27247,"nextInTopic":27250,"prevInTime":27248,"nextInTime":27250,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... But how do you explain the many people in BC who start out with the government correspondance course and chuck it after a year or two (or even a couple of","messageBody":"<div id=\"ygrps-yiv-1969417923\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;IMNSHO the problem is those folks that make the decision to homeschool and<br/>\n&gt;walk straight into a ps program because they think that is homeschooling<br/>\n&gt;because it is becoming the accepted definition of homeschooling.  Am I clear<br/>\n&gt;as mud on this?<br/>\n<br/>\n </span></blockquote>But how do you explain the many people in BC who start out with the <br/>\ngovernment correspondance course and chuck it after a year or two (or even <br/>\na couple of months) because they realize they can do it just as well <br/>\nwithout them.  If they hadn&#39;t had the correspondance option to start with, <br/>\ntheir kids would likely still be in school.  Same thing happens with the <br/>\nElectronic Bus.  Usually people start with it for one of two <br/>\nreasons.  1.  They want the computer and money.  2.  They don&#39;t believe <br/>\nthat they can do it alone.<br/>\n<br/>\nNow the Electronic Bus may be unique because they *expect* parents to do it <br/>\non their own.  The teachers are there to offer assistance when it&#39;s wanted, <br/>\nbut the vast majority of them encourage parents to find their own way as <br/>\nmuch as possible.<br/>\n<br/>\nBoth families 1 and 2 might leave after a while.  Family 1 might leave when <br/>\nthey can get their own computer.  Family 2 might leave when they realize <br/>\nthat they *can* do it themselves.  Or they might stay, but they&#39;re all <br/>\nstill the ones in charge of their homeschooling &quot;program&quot;.  Maybe there <br/>\naren&#39;t any similar programs in the States?<br/>\nTia<br/>\n<br/>\nTia Leschke   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island<br/>\n**************************************************************************<br/>\nIt is the answers which separate us, the questions which unite us. - Janice <br/>\nLevy</div>","specialLinks":[]},{"userId":0,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","senderId":"xm_mrFuLMCDJ62EW_fbWRvXLUglaKPqM4t9GgZQ_YdS0xEohb-PjbisWhno0fheJ6lhE2q8SDZrTVihFL9oKE4-09rwj-OHZtyc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004639673","msgId":27247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAxMTEwMTEwMDAxMi4wMGE5ZDk3MEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PDIwMDExMTAxLjA1MTc1Ny4tOTYyMDE3LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27246,"nextInTopic":27249,"prevInTime":27246,"nextInTime":27248,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... I wonder if you might be lumping all of these kinds of programs together and judging them by what you know about one or a few.  Or maybe they re just a lot","messageBody":"<div id=\"ygrps-yiv-250881885\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;A whole range of educational choices sounds great.  But the deeper we go<br/>\n&gt;into homeschool friendly ps programs the *choice* becomes what the school<br/>\n&gt;deems educational.  If this is what a family believes is best for them,<br/>\n&gt;so be it, but I don&#39;t see how it helps homeschooling or homeschoolers.<br/>\n<br/>\n </span></blockquote>I wonder if you might be lumping all of these kinds of programs together <br/>\nand judging them by what you know about one or a few.  Or maybe they&#39;re <br/>\njust a lot different in the States, or even your state.  I can only talk <br/>\nabout my experience with the programs in BC.  The program we use does not <br/>\ndictate what a child learns, or when they have to learn it.  We are <br/>\nrequired to send in reports 3 times a year that show what our kids are <br/>\nlearning within the BC curriculum.  It doesn&#39;t mean they have to learn the <br/>\nsame things at the same time as the ps kids.  It just means that we have to <br/>\nshow that they are learning something from somewhere in the <br/>\ncurriculum.  It&#39;s true that they seem to tighten up the requirements at the <br/>\nhigh school level, but even then there are ways around it.  My son is 14, <br/>\nand I&#39;m still sending in anecdotal reports saying that we&#39;ve read this and <br/>\nthat book together and had these conversations about these subjects, <br/>\netc.  In other words, my family makes all the choices, not the program.  We <br/>\nonly report on the choices we&#39;ve made.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; I<br/>\n &gt;don&#39;t see how in the long run it helps kids, because we are still left<br/>\n &gt;with the notion that education is something someone else can give you,<br/>\n &gt;must give you, for the good of society.<br/>\n<br/>\n </span></blockquote>That&#39;s not really an argument against public programs.  I know that in BC, <br/>\nwe still are required to &quot;provide an educational program&quot; for our kids, <br/>\neven if we are &quot;real&quot; homeschoolers.  I can&#39;t imagine ever getting that <br/>\nchanged.  At least here, the parents get to decide what constitutes an <br/>\neducational program.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;When my mother&#39;s children were born, the first in &#39; 47, the last in &#39; 63<br/>\n&gt;the hospital experience was less than desirable, it&#39;s true.  Hospitals<br/>\n&gt;may have been forced to change because people demanded it but I&#39;m not<br/>\n&gt;convinced it&#39;s because they had any revelation about respecting peoples<br/>\n&gt;choices, it was about money, again.<br/>\n<br/>\n </span></blockquote>I don&#39;t think we&#39;re ever going to get governments or big businesses to <br/>\nrespect people&#39;s choices.  We&#39;ve always had to vote with our <br/>\npocketbooks.  I don&#39;t believe it matters that much how we got the <br/>\nchoices.  The important thing is to have them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The different birthing choices now<br/>\n&gt;are about money, and the more comfortable we get with them, the easier it<br/>\n&gt;will be for them to convince us we need more and more of what they alone,<br/>\n&gt;can provide.<br/>\n<br/>\n </span></blockquote>Then it all boils down to education, once again.  Pregnant women need to be <br/>\neducated as to the choices available (and the ones that aren&#39;t yet <br/>\navailable, as well) and parents need to be educated about choices in <br/>\neducation.<br/>\n<br/>\nThe main reason most people send their kids to public school is that they <br/>\nreally don&#39;t know of any other possibilities, or they&#39;re convinced that <br/>\nthose possibilities wouldn&#39;t work for them.  So if a parent who isn&#39;t happy <br/>\nwith the public schools finds out about one of the public school hs <br/>\nprograms and tries it, that&#39;s a first step  They should somehow be informed <br/>\nof the organizations that are out there to help them *in addition to* that <br/>\npublic program.  The fact that they would then be supporting an <br/>\norganization that is working to keep their other choices open would be a bonus.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;.&gt; Isn&#39;t having them pay for resources<br/>\n&gt; &gt; that<br/>\n&gt; &gt; our children need to learn and grow a logical next step?<br/>\n&gt;<br/>\n&gt;It would seem a logical next step as an educated population only benefits<br/>\n&gt;society.<br/>\n&gt;The problem comes from the government deciding what resources are<br/>\n&gt;educational, and who is meeting the criteria.<br/>\n<br/>\n </span></blockquote>In its eighth year now, the program we&#39;re on will pay for anything even <br/>\nremotely educational with our resource allowance.  I&#39;ve had sports and <br/>\nscouts registration  fees and the non-resident library card fee <br/>\npaid.  They&#39;ve paid for 2 printers, a cd burner, and a scanner.  Oh and <br/>\nthey&#39;ve bought books as well.  The only things they won&#39;t pay for are <br/>\nreligious materials because they&#39;re publicly funded, and the actual <br/>\nequipment for sports, etc.  (They&#39;ll pay for skating lessons but not <br/>\nskates, for instance.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;How much money is required<br/>\n&gt;to meet the educational needs of a child?  Is it the same everywhere, for<br/>\n&gt;every child?  When should the child start learning and when should they<br/>\n&gt;be finished?  Are these questions best answered by our government?  I<br/>\n&gt;don&#39;t personally think so.<br/>\n<br/>\n </span></blockquote>So as long as you have the option to keep the government from making these <br/>\ndecisions for *your* child, isn&#39;t that good enough?  Can we not simply work <br/>\nto keep choices available that will allow the parents who want to make <br/>\nthese decisions to do so?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And if we get comfortable letting them make a few of these choices now,<br/>\n&gt;it only gives them the compliance they need to make more,  require more.<br/>\n<br/>\n </span></blockquote>For at least a hundred years, government has been making these <br/>\nchoices.  Homeschoolers have gradually insisted on the right to make them <br/>\nfor themselves.  This is what we need to focus on.  As long as we can keep <br/>\non making these decisions ourselves if we choose to, what difference does <br/>\nit make that some will allow others to make them.  Public school parents <br/>\nhave been allowing that for years.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It used to be ok for kids to stay home, ( Ben Franklin,  Abe Lincoln )<br/>\n&gt;then it was decided parents couldn&#39;t provide real education for their<br/>\n&gt;kids.  Homeschoolers have made a lot of progress again since the &#39; 60&#39;s,<br/>\n&gt;but charters, and ps programs seem to be saying, once again, that someone<br/>\n&gt;else can do it better than parents can.  Call it choice if you want to, I<br/>\n&gt;see it as insidious.  ( conspiracy! conspiracy!)<br/>\n<br/>\n </span></blockquote>So it&#39;s ok for the &quot;real&quot; homeschoolers to be working to limit *my* <br/>\nchoices?  You&#39;re still lumping all public programs together and assuming <br/>\nthat they are making all the choices for the parents involved.  While this <br/>\nmay be true in some programs, it isn&#39;t for all of them.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I am all for choice, if it truly is our choice, if there are real<br/>\n&gt;choices.<br/>\n<br/>\n </span></blockquote>So work to keep the choices open, not shut down the ones you don&#39;t believe in.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If I say to my child, you have two choices, you can go to<br/>\n&gt;public school or you can sit down here and do this curriculum, is that<br/>\n&gt;real choice?<br/>\n<br/>\n </span></blockquote>Of course not.  You&#39;re leaving out quite a few options.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If we get lulled into believing we have real choices now,<br/>\n&gt;in governmental programs, I&#39;m afraid for the future of homeschooling.<br/>\n<br/>\n </span></blockquote>Well, homeschoolers of all stripes have real choices in BC.  And I&#39;m <br/>\nworking to keep it that way.<br/>\nTia<br/>\n<br/>\nTia Leschke   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island<br/>\n**************************************************************************<br/>\nIt is the answers which separate us, the questions which unite us. - Janice <br/>\nLevy</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"t0H9OsdYmZz-nJ1c_ELm4lxmQIok5-UjTL1_pxiCMlvnEJw9jM9irMVmmVvJtixmDKxlUR1-IRPX","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004638734","msgId":27244,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1LjExOTkyMWI4LjI5MTJlYzBlQGFvbC5jb20+"},"prevInTopic":27239,"nextInTopic":27246,"prevInTime":27243,"nextInTime":27245,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/1/01 10:54:28 AM, lurine@softcom.net writes: ","messageBody":"<div id=\"ygrps-yiv-233107232\">In a message dated 11/1/01 10:54:28 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lurine@...\">lurine@...</a> writes:<br/>\n<br/>\n&lt;&lt; IMNSHO the problem is those folks that make the decision to homeschool and<br/>\nwalk straight into a ps program because they think that is homeschooling<br/>\nbecause it is becoming the accepted definition of homeschooling.  Am I clear<br/>\nas mud on this? &gt;&gt;<br/>\n<br/>\nBut they find out pretty soon, IF the are looking around and listening, that <br/>\nthat&#39;s not what homeschooling is.<br/>\n<br/>\nThere&#39;s a school program here that originally billed itself as &quot;halftime <br/>\nhomeschool&quot; but it wasn&#39;t, and they&#39;ve shut up about that.  It&#39;s halftime <br/>\nREAL school (albeit alternative methods, some of which are very cool), and <br/>\nhalftime  homework assigned by the school that parents have to oversee, chart <br/>\nand report back about PLUS parents have to go to at least one meeting a week <br/>\nall year, nighttime.  <br/>\n<br/>\nAnd because they run a morning session and afternoon session with an hour in <br/>\nthe middle of overlap (so the kids can get to know those from the other <br/>\nsession, they say, and there is some truth to it), they can double dip--every <br/>\nkid earns them full funding.<br/>\n<br/>\nTadaa!!!<br/>\n<br/>\nIs it homeschooling?<br/>\nNo.<br/>\n<br/>\nIs it hurting homeschooling?<br/>\nNo.<br/>\n<br/>\nIf I were making a commission on every kid who didn&#39;t go to school and didn&#39;t <br/>\nuse a curriculum, I&#39;d be losing some money! &lt;g&gt;  But whether it&#39;s hurting the <br/>\nfamilies or the freedom to homeschool, no.  IF they had kept for ten years <br/>\ncalling it homeschooling, yes, it would have been muddying the waters.<br/>\n<br/>\nSandra<br/>\n<br/>\n&quot;Everything counts.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDoddArticles\">http://expage.com/SandraDoddArticles</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDodd\">http://expage.com/SandraDodd</a></div>","specialLinks":[]},{"userId":0,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","senderId":"swP4epqAD3mPGQwaoSP6NCGxjQekWzcIOK-gBHtDddPZFs45sD237pBTz_ugu-RC1NC9qMTcdu-pXSBdwyo0R7S3dVes0q41Vn0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004637591","msgId":27246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAxMTEwMTA5NDUwNC4wMGE5OGRlMEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PDIwMDExMDMxLjIzMDMzMi4tMTgwMjgxLjAuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":27244,"nextInTopic":27247,"prevInTime":27245,"nextInTime":27247,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... Soon after the Electronic Bus got started in BC, the BC Home Learners Association (BCHLA) got their knickers in a knot about how these programs were going","messageBody":"<div id=\"ygrps-yiv-2118434599\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;I do think, though, that we need to have a whole range of educational<br/>\n&gt;options, not just traditional school in one corner and independent<br/>\n&gt;homeschooling off in another. I think there&#39;s room for charters, for<br/>\n&gt;partial day programs, for 2 day a week programs, for drop-in programs...<br/>\n&gt;a continuum, to serve every family. If all of the options are out there,<br/>\n&gt;then people can chose freely.<br/>\n<br/>\n </span></blockquote>Soon after the Electronic Bus got started in BC, the BC Home Learners <br/>\nAssociation (BCHLA) got their knickers in a knot about how these programs <br/>\nwere going to grab all the homeschoolers in the province and the government <br/>\nwas going to think that we all wanted this kind of &quot;guidance&quot; and make it <br/>\nmandatory.  Or change the laws to require more monitoring, etc.  They <br/>\nstarted on a bit of a campaign to try to scare hs away from the <br/>\nprograms.  They said we weren&#39;t really homeschoolers, etc. etc.  I think <br/>\nthe net result of that was to turn a lot of hs away from BCHLA, including me.<br/>\n<br/>\nThe leadership has since changed, and the current leaders are a bit more <br/>\nopen-minded about the subject.  They still have fears, and they voice them, <br/>\nbut it seems they&#39;ve learned that the way to go is to get the hs who are <br/>\nusing those programs onside with the provincial group, rather than <br/>\nalienating them by saying that they aren&#39;t &quot;real&quot; homeschoolers.  It is <br/>\ntrue that we are not considered hs by the province.  I don&#39;t give a rat&#39;s <br/>\npatooty what the province calls me.  I know what I am.  Now that BCHLA is <br/>\nwilling to consider that I really am a hs, no matter what the province <br/>\ncalls me, I&#39;m backing BCHLA in their work to keep the hs laws as they <br/>\nare.  You see, I want to be sure there&#39;s someplace to stand if I ever <br/>\ndecide to get off the bus.  It&#39;s still all about choices, and I think there <br/>\nshould be more than 3 (public school, private school, &quot;pure&#39; homeschooling).<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; And about hospitals offering birthing choices now; it&#39;s NOT the same<br/>\n&gt; &gt; as home birth.<br/>\n&gt; &gt; Hospitals do their very best to scare women into believing that<br/>\n&gt; &gt; childbirth is an illness that needs special medical treatment.  They<br/>\n&gt; &gt; offer these programs because they were afraid of loosing money, not<br/>\n&gt; &gt; because of any great desire to serve the community, just like the<br/>\n&gt; &gt; schools.<br/>\n<br/>\n </span></blockquote>In BC, the hospitals have changed a lot over the years and do a pretty <br/>\ndecent  job now of serving the women who choose to use them for birth.  (I <br/>\nhad a good experience there with my youngest.  Of course we left 2 hours <br/>\nafter he was born.)<br/>\n<br/>\nWe also now have licensed midwives who can attend home *or* hospital <br/>\nbirths, and they&#39;re paid for by our provincial medical plan, just like <br/>\ndoctors.  I tell any pregnant woman who will listen that she can have a <br/>\nmidwife at the hospital and will get far better care that way.  Most women <br/>\nstill believe they can only have a midwife at a homebirth.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Now we have a continuum of servies - while in the hospital you can have a<br/>\n&gt;variety of medications, or no medications. You can go to a freestanding<br/>\n&gt;birthing center and have a CNM attending - and have your insurance pay<br/>\n&gt;for it. No we haven&#39;t gone all the way yet, but it&#39;s a lot better than it<br/>\n&gt;was 60 years ago.  There are options, and people are becoming informed.<br/>\n&gt;Insurance (often the gov&#39;t) now pays, in some cases, for a variety of<br/>\n&gt;medical treatments that were once considered too unconventional. No one<br/>\n&gt;ois forced to have thr traditional treatments or the non-traditional<br/>\n&gt;ones, but poeple have options. Isn&#39;t having them pay for resources that<br/>\n&gt;our children need to learn and grow a logical next step?<br/>\n<br/>\n </span></blockquote>Again, it&#39;s all about choices, the more the merrier, in my opinion.<br/>\nTia<br/>\n<br/>\nTia Leschke   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island<br/>\n**************************************************************************<br/>\nIt is the answers which separate us, the questions which unite us. - Janice <br/>\nLevy</div>","specialLinks":[]},{"userId":0,"authorName":"marbleface@aol.com","from":"marbleface@...","profile":"nanceconfer","replyTo":"LIST","senderId":"hNbMuR2uxp2Yg_3xS7D0j9HWOOM7ipizjQ6v1c0Mj6teyg0gqrqs04mLnVgbg2IcDZCQo5FfbC13","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004636730","msgId":27238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyLjE2NDA0MmY1LjI5MTJlNDNhQGFvbC5jb20+"},"prevInTopic":27235,"nextInTopic":27239,"prevInTime":27237,"nextInTime":27239,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/01/2001 5:07:44 PM !!!First Boot!!!, freeform@juno.com ... One little thing -- it may not be the point that these things are to help ","messageBody":"<div id=\"ygrps-yiv-192010425\">In a message dated 11/01/2001 5:07:44 PM !!!First Boot!!!, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freeform@...\">freeform@...</a> <br/>\nwrites:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &gt;If this is what a family believes is best for them,<br/>\n&gt; &gt; so be it, but I don&#39;t see how it helps homeschooling or homeschoolers. <br/>\n&gt; I<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>One little thing -- it may not be the point that these things are to help <br/>\nhomeschooling or homeschoolers.  <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","senderId":"eElorqS7BR4gqCWDOYjIoqAaHmOzkV-pqC9ZEIgb4XC5ZAlGMdTLXFE-xEj5ZGtUe_1TQgdt2ek","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004634482","msgId":27235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTAxLjEwMDgxMC4tMzE4NjQzLjQuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":27232,"nextInTopic":27238,"prevInTime":27234,"nextInTime":27236,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... go ... school ... A lot really depends on the program. Some of the people running these programs are truly unschoolers at heart. I did work for a program","messageBody":"<div id=\"ygrps-yiv-601702907\">On Thu, 1 Nov 2001 05:17:50 -0700 <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; A whole range of educational choices sounds great.  But the deeper  we<br/>\n </span></blockquote>go<br/>\n<blockquote><span title=\"ireply\"> &gt; into homeschool friendly ps programs the *choice* becomes what the<br/>\n </span></blockquote>school<br/>\n<blockquote><span title=\"ireply\"> &gt; deems educational.  <br/>\n<br/>\n </span></blockquote>A lot really depends on the program. Some of the people running these<br/>\nprograms are truly unschoolers at heart. I did work for a program that<br/>\nstarted out good and went downhill (we had a big thread on this about 6<br/>\nweeks ago, as I recall) and I spent a lot of  time convincing people that<br/>\nthey were doing great stuff already and their kids were learning and they<br/>\ndidn&#39;t need to stress out about it and throw workbooks at them.  We would<br/>\nchat for a while, and people would talk about everything they had been<br/>\ndoing naturally, and I would point out how much the kids were learning<br/>\nthrough all of this, and many people would be surprised and feel much<br/>\nmore confident. With the more experienced hsers it wasn&#39;t so much an<br/>\nissue, but a lot of the newer people seemed to need to hear this so that<br/>\nthey could relax. Obviously the charter wasn&#39;t the only way it could have<br/>\nhappened - I&#39;ve had similar conversations at park days or on email lists<br/>\n- but it was a venue.<br/>\n<br/>\nI also got to wear I could find a California State Standard to apply to<br/>\npretty much anything a kid had done, which was always impressive. Not<br/>\nthat I think the standards are worth much, but I think it helped some<br/>\npeople to see that there really wasn&#39;t anything magical about the schools<br/>\nand their curriculums<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If this is what a family believes is best for them,<br/>\n&gt; so be it, but I don&#39;t see how it helps homeschooling or homeschoolers. <br/>\n </span></blockquote>I<br/>\n<blockquote><span title=\"ireply\"> &gt; don&#39;t see how in the long run it helps kids, because we are still  left<br/>\n&gt; with the notion that education is something someone else can give <br/>\n&gt; you, must give you, for the good of society.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I don&#39;t know anyone who thinks this way. The notion is that learning<br/>\ndoesn&#39;t take place in a vacuum, you can&#39;t just sit in an empty room alone<br/>\nand learn much. The charters, when they were at their best, provided<br/>\nresources specific to what each specific child needed at that moment. The<br/>\ncharter paid for Calvin and Hobbes books, watercolors and watercolor<br/>\npaper, owl pellets, American Girls paper dolls, tie dye kits, games...<br/>\nthe list was pretty long and varied. I think there&#39;s a big difference<br/>\nbetween saying, &quot;Here is your edication&quot; and &quot;Here are some things you<br/>\nwere wanting to have so that you can continue your process.&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The problem comes from the government deciding what resources are<br/>\n&gt; educational, and who is meeting the criteria. How much money is <br/>\n </span></blockquote>required<br/>\n<blockquote><span title=\"ireply\"> &gt; to meet the educational needs of a child?  Is it the same <br/>\n&gt; everywhere, for every child?  When should the child start learning and<br/>\n </span></blockquote>when should <br/>\n<blockquote><span title=\"ireply\"> &gt; they be finished?  Are these questions best answered by our government?<br/>\n <br/>\n&gt; I don&#39;t personally think so. <br/>\n<br/>\n </span></blockquote>But they&#39;re not answering these questions,  they&#39;re offering options.<br/>\nAlthough technically they already have made these decisions - every state<br/>\nhas laws on the book covering what a child should learn.  Your arguments<br/>\nall rest on the premise that these programs are somehow mandatory, that<br/>\npeople don&#39;t just have the freedom to up and walk away.  They do. Oak<br/>\nMeadow is out there, and Laurel Springs, and Clonlara, and many other<br/>\noptions. Why are they not a threat if charter schools are?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am all for choice, if it truly is our choice, if there are real<br/>\n&gt; choices.  If I say to my child, you have two choices, you can go to<br/>\n&gt; public school or you can sit down here and do this curriculum, is  that<br/>\n&gt; real choice?   If we get lulled into believing we have real choices <br/>\n </span></blockquote>now,<br/>\n<blockquote><span title=\"ireply\"> &gt; in governmental programs, I&#39;m afraid for the future of <br/>\n&gt; homeschooling.<br/>\n<br/>\n </span></blockquote>But that&#39;s not a real choice, and that&#39;s not what&#39;s happening anywhere<br/>\nnow. We have real choice when we look  both within and without government<br/>\nprograms.  It&#39;s like food stamps, or medicaid, or public housing, or<br/>\nWIC... any of a myraid of public programs. If you decide that you want to<br/>\nenroll, you can, but no one forces you to do so.<br/>\n<br/>\nDaron<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/web/.\">http://dl.www.juno.com/get/web/.</a></div>","specialLinks":[]},{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","senderId":"ZEQ5OFpfoK1Uzqwsyir4Z1_QB3AHjPJhuj_yunOXikTqe77tgNRQMUHqe2D6P53v3pSTUAFCpQPothnk7pqlO_F4yA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004630841","msgId":27239,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwY2QwMWMxNjJmZSQwYWUzYzhjMCQzNzVkZDFkMUBqaWRhMzU+","referencesHeader":"PDIwMDExMTAxLjA1MTc1Ny4tOTYyMDE3LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27238,"nextInTopic":27244,"prevInTime":27238,"nextInTime":27240,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"Wellll, I understood it and the bottomline is the bottomline--MONEY! Hospitals didn t put in birthing rooms for mommies to be, they put in birthing rooms to","messageBody":"<div id=\"ygrps-yiv-1032143011\">Wellll, I understood it and the bottomline is the bottomline--MONEY!<br/>\nHospitals didn&#39;t put in birthing rooms for mommies to be, they put in<br/>\nbirthing rooms to make money.  They didn&#39;t sit down and discuss how can we<br/>\nmake this a better experience for women, their families and that new bundle<br/>\nof joy.  They sat down and discussed how to get those $$ back that were<br/>\nleaving for the comfort of home.<br/>\n<br/>\nThe same is true of the charters and satellite schools and ISPs and all the<br/>\nother various and sundry names they operate under.  Charters have gone down<br/>\nhill since Bennett Valley closed their&#39;s.  Each year or two they tighten up<br/>\nthe reins even more.<br/>\n<br/>\nBut one of the things that is happening IMHO (o.k., wise guys, sometimes I<br/>\ncan be humble &lt;g&gt;) is that the definition of &quot;homeschooling&quot; and<br/>\n&quot;unschooling&quot; is being diluted/changed/taken over by these programs.  Look<br/>\nback at how it has changed.  Back in the 60s we knew what it meant.  The<br/>\ngovernment didn&#39;t define it except with words like radical, crazy, etc.<br/>\n<br/>\nNow, this is a disclaimer.  PLEASE READ IT CAREFULLY!  I am NOT talking<br/>\nabout anyone on this list, I am talking about the uninitiated, the folks<br/>\nthat don&#39;t head out on their own and actually experience &quot;real&quot;<br/>\nun/homeschooling and don&#39;t make informed choices.<br/>\n<br/>\nIMNSHO the problem is those folks that make the decision to homeschool and<br/>\nwalk straight into a ps program because they think that is homeschooling<br/>\nbecause it is becoming the accepted definition of homeschooling.  Am I clear<br/>\nas mud on this?<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Thursday, November 01, 2001 4:17 AM<br/>\nSubject: Re: [Unschooling-dotcom] Gobbling Up Homeschoolers<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; &gt; I do think, though, that we need to have a whole range of<br/>\n&gt; &gt; educational<br/>\n&gt; &gt; options, not just traditional school in one corner and independent<br/>\n&gt; &gt; homeschooling off in another.<br/>\n&gt;<br/>\n&gt; A whole range of educational choices sounds great.  But the deeper we go<br/>\n&gt; into homeschool friendly ps programs the *choice* becomes what the school<br/>\n&gt; deems educational.  If this is what a family believes is best for them,<br/>\n&gt; so be it, but I don&#39;t see how it helps homeschooling or homeschoolers.  I<br/>\n&gt; don&#39;t see how in the long run it helps kids, because we are still left<br/>\n&gt; with the notion that education is something someone else can give you,<br/>\n&gt; must give you, for the good of society.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; But there has been change, because people chose alternatives and<br/>\n&gt; &gt; than try<br/>\n&gt; &gt; to get the system to provide them,  ...<br/>\n&gt;<br/>\n&gt; . If women had insisted that home birth with a midwife<br/>\n&gt; &gt; was<br/>\n&gt; &gt; the only way to do things, than the thousands of women who may have<br/>\n&gt; &gt; wanted something less drastic than what my grandma got but weren&#39;t<br/>\n&gt; &gt; comfortable birthing outside of a hospital would have been out of<br/>\n&gt; &gt; luck.<br/>\n&gt;<br/>\n&gt; My grandmother was a midwife and everyone of her children was born at<br/>\n&gt; home, the last in 1940.   She could have gone to the hospital, if it had<br/>\n&gt; been practical. She could have called the Dr. to her house.  Those were<br/>\n&gt; all choices from the time her first child was born in 1917.  Birthing<br/>\n&gt; choices vanished when hospitals saw how much money they could make if<br/>\n&gt; they could convince (scare) women they needed all the bells and whistles.<br/>\n&gt;<br/>\n&gt; When my mother&#39;s children were born, the first in &#39; 47, the last in &#39; 63<br/>\n&gt; the hospital experience was less than desirable, it&#39;s true.  Hospitals<br/>\n&gt; may have been forced to change because people demanded it but I&#39;m not<br/>\n&gt; convinced it&#39;s because they had any revelation about respecting peoples<br/>\n&gt; choices, it was about money, again.  The different birthing choices now<br/>\n&gt; are about money, and the more comfortable we get with them, the easier it<br/>\n&gt; will be for them to convince us we need more and more of what they alone,<br/>\n&gt; can provide.<br/>\n&gt;<br/>\n&gt; .&gt; Isn&#39;t having them pay for resources<br/>\n&gt; &gt; that<br/>\n&gt; &gt; our children need to learn and grow a logical next step?<br/>\n&gt;<br/>\n&gt; It would seem a logical next step as an educated population only benefits<br/>\n&gt; society.<br/>\n&gt; The problem comes from the government deciding what resources are<br/>\n&gt; educational, and who is meeting the criteria. How much money is required<br/>\n&gt; to meet the educational needs of a child?  Is it the same everywhere, for<br/>\n&gt; every child?  When should the child start learning and when should they<br/>\n&gt; be finished?  Are these questions best answered by our government?  I<br/>\n&gt; don&#39;t personally think so.<br/>\n&gt; And if we get comfortable letting them make a few of these choices now,<br/>\n&gt; it only gives them the compliance they need to make more,  require more.<br/>\n&gt; It used to be ok for kids to stay home, ( Ben Franklin,  Abe Lincoln )<br/>\n&gt; then it was decided parents couldn&#39;t provide real education for their<br/>\n&gt; kids.  Homeschoolers have made a lot of progress again since the &#39; 60&#39;s,<br/>\n&gt; but charters, and ps programs seem to be saying, once again, that someone<br/>\n&gt; else can do it better than parents can.  Call it choice if you want to, I<br/>\n&gt; see it as insidious.  ( conspiracy! conspiracy!)<br/>\n&gt;<br/>\n&gt; I am all for choice, if it truly is our choice, if there are real<br/>\n&gt; choices.  If I say to my child, you have two choices, you can go to<br/>\n&gt; public school or you can sit down here and do this curriculum, is that<br/>\n&gt; real choice?   If we get lulled into believing we have real choices now,<br/>\n&gt; in governmental programs, I&#39;m afraid for the future of homeschooling.<br/>\n&gt;<br/>\n&gt; Deb L, also tired and probably more than a bit unclear.(as usual)<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"qICKdBl-N574BpZNxaMlN7N89Vpks4Xcsipn8897E4jUGGY7ANUgIOU5p5Yh2j46DU7jb5g_GywE","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004628662","msgId":27232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZmLjFjZmMxZTljLjI5MTJjNGI2QGFvbC5jb20+"},"prevInTopic":27230,"nextInTopic":27235,"prevInTime":27231,"nextInTime":27233,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/1/01 5:26:36 AM, ddzimlew@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-822383801\">In a message dated 11/1/01 5:26:36 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\n<br/>\n&lt;&lt;  But the deeper we go<br/>\ninto homeschool friendly ps programs the *choice* becomes what the school<br/>\ndeems educational. &gt;&gt;<br/>\n<br/>\nThat&#39;s supposed to be what ALL homeschoolers are doing anyway.  The way state <br/>\nlaws are phrased, we&#39;re supposed to be teaching the (vague, but still) <br/>\nequivalent of what the schools teach.  Even in Texas.  The kids are supposed <br/>\nto be being educated, and the assumption is it will include all that <br/>\ntraditionally educational stuff.<br/>\n<br/>\n&lt;&lt;I<br/>\ndon&#39;t see how in the long run it helps kids, because we are still left<br/>\nwith the notion that education is something someone else can give you,<br/>\nmust give you, for the good of society.&gt;&gt;<br/>\n<br/>\nIn the long run that assumption is so pervasive in our culture that <br/>\nunschooled kids will spend their lifetimes looking into the cocked heads and <br/>\ndazed eyes of people who ask them &quot;You didn&#39;t go to school and you didn&#39;t use <br/>\na curriculum?&quot;   <br/>\n<br/>\nWe (culturally) will be left with that notion for another hundred years (more <br/>\nif we&#39;re not lucky).<br/>\n<br/>\n&lt;&lt;I am all for choice, if it truly is our choice, if there are real<br/>\nchoices.  If I say to my child, you have two choices, you can go to<br/>\npublic school or you can sit down here and do this curriculum, is that<br/>\nreal choice?  &gt;&gt;<br/>\n<br/>\nWell it&#39;s a huge choice for families who couldn&#39;t fathom, 20 years ago, that <br/>\nschool was in ANY way an option.<br/>\n<br/>\nIt&#39;s not a big educational difference, but it is for some kids still <br/>\nlifesaving because school itself was killing them.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n&quot;Everything counts.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDoddArticles\">http://expage.com/SandraDoddArticles</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDodd\">http://expage.com/SandraDodd</a></div>","specialLinks":[]},{"userId":0,"authorName":"marbleface@aol.com","from":"marbleface@...","profile":"nanceconfer","replyTo":"LIST","senderId":"iD7yu9WwwPKx3qVlYak7T6j-HqrIpjWvLnIFb2kT5vm-XtrOLAvnDQu4doja4rHMimuFNnLDkOfj","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004623713","msgId":27230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxLjFkMDI5NTI0LjI5MTJiMTYxQGFvbC5jb20+"},"prevInTopic":27227,"nextInTopic":27232,"prevInTime":27229,"nextInTime":27231,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"In a message dated 11/01/2001 12:26:35 PM !!!First Boot!!!, ddzimlew@juno.com ... Well, not all of us were manning the barricades of the 60 s so perhaps we ","messageBody":"<div id=\"ygrps-yiv-1614522492\">In a message dated 11/01/2001 12:26:35 PM !!!First Boot!!!, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> <br/>\nwrites:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; .  Homeschoolers have made a lot of progress again since the &#39; 60&#39;s,<br/>\n&gt; but charters, and ps programs seem to be saying, once again, that someone<br/>\n&gt; else can do it better than parents can.  Call it choice if you want to, I<br/>\n&gt; see it as insidious.  ( conspiracy! conspiracy!) <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Well, not all of us were manning the barricades of the &#39;60&#39;s so perhaps we <br/>\ndon&#39;t know a good conspiracy when we see one.<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"mom2zimmy","replyTo":"LIST","senderId":"IFiLxQ7tdMP6RIPy_qmXqPeWLYhXNSZzRhQ53a_fc75TRr2ptyKa398SuJ0x1i-LGGGx_OKj_0o","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004617070","msgId":27227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMTAxLjA1MTc1Ny4tOTYyMDE3LjAuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27218,"nextInTopic":27230,"prevInTime":27226,"nextInTime":27228,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... A whole range of educational choices sounds great.  But the deeper we go into homeschool friendly ps programs the *choice* becomes what the school deems","messageBody":"<div id=\"ygrps-yiv-1474101771\"><blockquote><span title=\"ireply\">&gt; I do think, though, that we need to have a whole range of <br/>\n&gt; educational<br/>\n&gt; options, not just traditional school in one corner and independent<br/>\n&gt; homeschooling off in another.<br/>\n<br/>\n </span></blockquote>A whole range of educational choices sounds great.  But the deeper we go<br/>\ninto homeschool friendly ps programs the *choice* becomes what the school<br/>\ndeems educational.  If this is what a family believes is best for them,<br/>\nso be it, but I don&#39;t see how it helps homeschooling or homeschoolers.  I<br/>\ndon&#39;t see how in the long run it helps kids, because we are still left<br/>\nwith the notion that education is something someone else can give you,<br/>\nmust give you, for the good of society.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But there has been change, because people chose alternatives and <br/>\n&gt; than try<br/>\n&gt; to get the system to provide them,  ... <br/>\n<br/>\n </span></blockquote>. If women had insisted that home birth with a midwife <br/>\n<blockquote><span title=\"ireply\"> &gt; was<br/>\n&gt; the only way to do things, than the thousands of women who may have<br/>\n&gt; wanted something less drastic than what my grandma got but weren&#39;t<br/>\n&gt; comfortable birthing outside of a hospital would have been out of <br/>\n&gt; luck.<br/>\n<br/>\n </span></blockquote>My grandmother was a midwife and everyone of her children was born at<br/>\nhome, the last in 1940.   She could have gone to the hospital, if it had<br/>\nbeen practical. She could have called the Dr. to her house.  Those were<br/>\nall choices from the time her first child was born in 1917.  Birthing<br/>\nchoices vanished when hospitals saw how much money they could make if<br/>\nthey could convince (scare) women they needed all the bells and whistles.<br/>\n<br/>\nWhen my mother&#39;s children were born, the first in &#39; 47, the last in &#39; 63<br/>\nthe hospital experience was less than desirable, it&#39;s true.  Hospitals<br/>\nmay have been forced to change because people demanded it but I&#39;m not<br/>\nconvinced it&#39;s because they had any revelation about respecting peoples<br/>\nchoices, it was about money, again.  The different birthing choices now<br/>\nare about money, and the more comfortable we get with them, the easier it<br/>\nwill be for them to convince us we need more and more of what they alone,<br/>\ncan provide.<br/>\n<br/>\n.&gt; Isn&#39;t having them pay for resources <br/>\n<blockquote><span title=\"ireply\"> &gt; that<br/>\n&gt; our children need to learn and grow a logical next step?<br/>\n<br/>\n </span></blockquote>It would seem a logical next step as an educated population only benefits<br/>\nsociety. <br/>\nThe problem comes from the government deciding what resources are<br/>\neducational, and who is meeting the criteria. How much money is required<br/>\nto meet the educational needs of a child?  Is it the same everywhere, for<br/>\nevery child?  When should the child start learning and when should they<br/>\nbe finished?  Are these questions best answered by our government?  I<br/>\ndon&#39;t personally think so. <br/>\nAnd if we get comfortable letting them make a few of these choices now,<br/>\nit only gives them the compliance they need to make more,  require more. <br/>\nIt used to be ok for kids to stay home, ( Ben Franklin,  Abe Lincoln )<br/>\nthen it was decided parents couldn&#39;t provide real education for their<br/>\nkids.  Homeschoolers have made a lot of progress again since the &#39; 60&#39;s,<br/>\nbut charters, and ps programs seem to be saying, once again, that someone<br/>\nelse can do it better than parents can.  Call it choice if you want to, I<br/>\nsee it as insidious.  ( conspiracy! conspiracy!) <br/>\n<br/>\nI am all for choice, if it truly is our choice, if there are real<br/>\nchoices.  If I say to my child, you have two choices, you can go to<br/>\npublic school or you can sit down here and do this curriculum, is that<br/>\nreal choice?   If we get lulled into believing we have real choices now,<br/>\nin governmental programs, I&#39;m afraid for the future of homeschooling.<br/>\n<br/>\nDeb L, also tired and probably more than a bit unclear.(as usual)</div>","specialLinks":[]},{"userId":0,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","senderId":"4_57m9Gxfiyo6AkO9G1Bv8NV21OW5EC325tjxSXcqVROqti5k-I0FDySCeq2c_ohbUxa11GNtx4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004594292","msgId":27218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMDMxLjIzMDMzMi4tMTgwMjgxLjAuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":27217,"nextInTopic":27227,"prevInTime":27217,"nextInTime":27219,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... it ... I dunno. We ve been with a charter, we ve been not with a charter. Nothing changed for us, except that we got stuff and did more documenting. We","messageBody":"<div id=\"ygrps-yiv-620322\">On Wed, 31 Oct 2001 17:30:07 -0700 <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; I see the gobbling up of homeschoolers too.  I think at least part of<br/>\n </span></blockquote>it<br/>\n<blockquote><span title=\"ireply\"> &gt; is that homeschoolers get so tired of being odd.  <br/>\n<br/>\n </span></blockquote>I dunno. We&#39;ve been with a charter, we&#39;ve been not with a charter.<br/>\nNothing changed for us, except that we got stuff and did more<br/>\ndocumenting. We went to the same groups and activities, did the same<br/>\nstuff, felt the same way. I don&#39;t feel odd, Cacie says she&#39;s weird but<br/>\nconsiders that a good thing... if people asked us about homeschooling,<br/>\nwe&#39;d be pretty far into the conversation before the charter school thing<br/>\neven came up. It just wasn&#39;t that important. The charter was fine when it<br/>\nmet our needs, and when it didn&#39;t, we left.<br/>\n<br/>\nI do think, though, that we need to have a whole range of educational<br/>\noptions, not just traditional school in one corner and independent<br/>\nhomeschooling off in another. I think there&#39;s room for charters, for<br/>\npartial day programs, for 2 day a week programs, for drop-in programs...<br/>\na continuum, to serve every family. If all of the options are out there,<br/>\nthen people can chose freely.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And about hospitals offering birthing choices now; it&#39;s NOT the same <br/>\n&gt; as home birth.<br/>\n&gt; Hospitals do their very best to scare women into believing that<br/>\n&gt; childbirth is an illness that needs special medical treatment.  They<br/>\n&gt; offer these programs because they were afraid of loosing money, not<br/>\n&gt; because of any great desire to serve the community, just like the<br/>\n&gt; schools.  <br/>\n<br/>\n </span></blockquote>But there has been change, because people chose alternatives and than try<br/>\nto get the system to provide them, and in many cases they succeed. When<br/>\nmy grandma gave birth to my dad, she was unconscious, flat on her back,<br/>\non a hospital. If women had insisted that homebirth with a midwife was<br/>\nthe only way to do things, than the thousands of women who may have<br/>\nwanted something less drastic than what my grandma got but weren&#39;t<br/>\ncomfortable birthing outside of a hospital would have been out of luck.<br/>\nNow we have a continuum of servies - while in the hospital you can have a<br/>\nvariety of medications, or no medications. You can go to a freestanding<br/>\nbirthing center and have a CNM attending - and have your insurance pay<br/>\nfor it. No we haven&#39;t gone all the way yet, but it&#39;s a lot better than it<br/>\nwas 60 years ago.  There are options, and people are becoming informed.<br/>\nInsurance (often the gov&#39;t) now pays, in some cases, for a variety of<br/>\nmedical treatments that were once considered too unconventional. No one<br/>\nois forced to have thr traditional treatments or the non-traditional<br/>\nones, but poeple have options. Isn&#39;t having them pay for resources that<br/>\nour children need to learn and grow a logical next step?<br/>\n<br/>\nDaron, really tired and perhaps a bit unclear...<br/>\n<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/web/.\">http://dl.www.juno.com/get/web/.</a></div>","specialLinks":[]},{"userId":0,"authorName":"Carol & Mac","from":"Carol & Mac &lt;mjcmbrwn@...&gt;","profile":"cally_marg","replyTo":"LIST","senderId":"5F5QkT_EWUe9ua8g9He0_Kb8kPl6S57IfyazB9I9fu-irw9e4sMyw_gktsYAlpEKl08wg78zejLHu8Jw-o6x6sxa5p667d0w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Catching up... FWIW... GWS and HEM","postDate":"1004593614","msgId":27217,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCRTBFMUNFLjMwNjAwMDFAaWh1Zy5jby5uej4=","referencesHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPiA8cDA1MDAxOTc1YjgwNTE0YmQ3MDZmQFsyMDguMjYuMjI3LjIxMF0+"},"prevInTopic":27210,"nextInTopic":27218,"prevInTime":27216,"nextInTime":27218,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"Helen, I discovered GWS shortly after starting homeschooling 15 years ago, and it was a real lifeline at a time when there were very few homeschoolers in the","messageBody":"<div id=\"ygrps-yiv-259615849\">Helen,<br/>\n<br/>\nI discovered GWS shortly after starting homeschooling 15 years ago, and <br/>\nit was a real lifeline at a time when there were very few homeschoolers <br/>\nin the *whole* of New Zealand, let alone in my area. Many years later I <br/>\ndiscovered HEM, and as time went by I found that I prefered your <br/>\nmagazine more and more, and found myself growing less happy with GWS. <br/>\nAfter reading your post I thought a lot about it and wanted to share <br/>\nwith you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If they, with their<br/>\n&gt; incredible legacy from John himself, couldn&#39;t make it, what&#39;s going<br/>\n&gt; to keep HEM afloat?<br/>\n&gt;<br/>\n&gt; GWS had much more going for it than our little publication has. Not<br/>\n&gt; just the long history and the still-tremendous name recognition of<br/>\n&gt; John Holt, but GWS has been reviewed and praised by some of the top<br/>\n&gt; mainstream media over the years. Pat Farenga, who took over when John<br/>\n&gt; passed away in 1985, is a very popular conference speaker and a savvy<br/>\n&gt; businessman. If he thinks it&#39;s time to quit fighting the good fight<br/>\n&gt; what does that mean we should do?<br/>\n<br/>\n </span></blockquote>It means you should keep going - please don&#39;t pull in the life line. <br/>\nJohn Holt was a great and inspiring man but that&#39;s all he was. I <br/>\nrealised last night why I prefer HEM. GWS places its focus on the words <br/>\nof people who don&#39;t homeschool their own children, or who didn&#39;t when <br/>\nthey started. The feature articles and interviews (apart from the focus) <br/>\nare non homeschoolers. The &#39;guru&#39; of  GWS, John Holt, had no working <br/>\nknowledge of living and loving and despairing and ailing and washing and <br/>\ncleaning and cooking and staying up all night with children of his own, <br/>\n24/7.  I have learnt so very much from John Holt and other observers, <br/>\nbut I love HEM and the way it recognises and values the *real* experts <br/>\nin the homeschooling field - the parents themselves. GWS relegates <br/>\nparents, I feel, to a secondary staus. Your magazine celebrates their <br/>\nstatus as the more important. Last year, finances meant I had to chose <br/>\nbetween HEM and GWS (the exchange rate makes the magazines terribly <br/>\nexpensive here) - and I chose HEM. Please keep it up.<br/>\n<br/>\nI do appreciate your fears about homeschooling, and see signs of similar <br/>\npaths opening up here in New Zealand. It is scary that so few people <br/>\nseem to suspect or even care that these paths might just (IMO &#39;will&#39;) <br/>\nlead everyone back onto the main highway. I guess it&#39;s the price we pay <br/>\nfor homeschooling becoming so successful! It&#39;s a bit depressing to think <br/>\nthat after years of battling to get homeschooling / unschooling <br/>\naccepted, we may find ourselves in the position of having to start to <br/>\nbattle all over. But it is worth it  - we just have to look at our <br/>\nchildren and grandchildren and we know that, tiring though it may be at <br/>\ntimes, it *is* worth putting in the energy. (Not that I can actually <br/>\nlook at my grandchild yet, as s/he won&#39;t be born until February!)<br/>\n<br/>\nTake heart, Helen, we&#39;ve done it once, we can do it again.<br/>\n<br/>\n((((hugs))))<br/>\nCarol Brown<br/>\nNew Zealand</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"olWLXjcI0i4_3LJY5CZnej_VbY6NuTqPpCEPXU-aA4wcBoRbZwjSzYRm02yjdDRaVOdM84jgqvHt","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004580618","msgId":27210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzZS4zYzY0Y2E2LjI5MTIwOTBhQGFvbC5jb20+"},"prevInTopic":27209,"nextInTopic":27217,"prevInTime":27209,"nextInTime":27211,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/31/01 5:40:39 PM, ddzimlew@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-1067685627\">In a message dated 10/31/01 5:40:39 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> writes:<br/>\n<br/>\n&lt;&lt; And about hospitals offering birthing choices now; it&#39;s NOT the same as<br/>\nhome birth. &gt;&gt;<br/>\n<br/>\nIt&#39;s not the same as a home birth, but it&#39;s WAY less controlled and invasive <br/>\nthan births 20 years ago, and it was homebirth advocates (and just plain <br/>\nhealthy homebirths) and VBAC advocates who shook the hospitals loose from <br/>\nsome of their &quot;truths&quot; about what wasn&#39;t safe and what couldn&#39;t possibly be <br/>\ndone without the mom dying in a puddle of blood.<br/>\n<br/>\nSame with unschooling and the dire predictions of &quot;if they don&#39;t read by 8&quot; <br/>\nand &quot;they&#39;ll never learn times tables.&quot;  Those kinds of arguments will go the <br/>\nway of &quot;you have to have an epidural&quot; and &quot;labor can&#39;t last more than 24 <br/>\nhours.&quot;<br/>\n<br/>\nAlternative schools are NOT homeschooling, but they&#39;re also not the <br/>\nyou-have-no-choice traditional classroom routine.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n&quot;Everything counts.&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDoddArticles\">http://expage.com/SandraDoddArticles</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://expage.com/SandraDodd\">http://expage.com/SandraDodd</a></div>","specialLinks":[]},{"userId":0,"authorName":"marbleface@aol.com","from":"marbleface@...","profile":"nanceconfer","replyTo":"LIST","senderId":"4erk6-Ma5eHX57bIttDm5R8QvEEH6LNZENpHIYC4SWIp0js6QpiUBRY_deevne3K-zm68M9QlerZ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004579677","msgId":27209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3LjFkODA1OTQwLjI5MTIwNTVkQGFvbC5jb20+"},"prevInTopic":27208,"nextInTopic":27210,"prevInTime":27208,"nextInTime":27210,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/31/2001 11:59:09 PM !!!First Boot!!!, ... Well, they are ps charters, aren t they?  They are public schools.  I wasn t expecting","messageBody":"<div id=\"ygrps-yiv-10848608\">In a message dated 10/31/2001 11:59:09 PM !!!First Boot!!!, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lurine@...\">lurine@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The same is happening with CA&#39;s charter laws.  Many years ago when places<br/>\n&gt; such as Bennett Valley were just about the lonesome cowboys of charters out<br/>\n&gt; there,  they gave each family a certain dollar amount to spend as they<br/>\n&gt; pleased.  The families had full use of all school facilities and supplies.<br/>\n&gt; If they wanted to use the school bus for field trips they could do that.  No<br/>\n&gt; strings, no reporting, no requirements.<br/>\n&gt; <br/>\n&gt; The current round of legislation wants to mandate that only a ps can have a<br/>\n&gt; charter.  They also are working to require that charters comply with ALL the<br/>\n&gt; same rules and paperwork requirements as &quot;traditional&quot; public schools.  That<br/>\n&gt; means testing and it means that the ps that is the &quot;owner&quot; of the charter<br/>\n&gt; will dictate curriculum and what text is used.  They are also working to<br/>\n&gt; remove the charters from certain organizations because of the fraud that is<br/>\n&gt; rampant in the outfits that have sprung up to &quot;manage&quot; charters.<br/>\n&gt; <br/>\n&gt; Slowly but surely the charters are becoming rigid and structured.<br/>\n&gt; <br/>\n&gt; Lynda<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Well, they are ps charters, aren&#39;t they?  They are public schools.  I wasn&#39;t <br/>\nexpecting tremendous insight or flexibility.  Just an option for parents.  An <br/>\noption that needs to be explained more clearly by hsers to hsers and <br/>\npotential hsers looking to use these programs.  <br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"marbleface@aol.com","from":"marbleface@...","profile":"nanceconfer","replyTo":"LIST","senderId":"wJxVZlEP9QwOHOdYxbTkNdiCVhpOxBxOptXL3W_w7F5Qmu0ylJM7UW5Q-3Hg9pJzaKbJlPs8-SLb","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004579454","msgId":27208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4LmU5YWM5ZDEuMjkxMjA0N2VAYW9sLmNvbT4="},"prevInTopic":27207,"nextInTopic":27209,"prevInTime":27207,"nextInTime":27209,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/31/2001 11:16:58 PM !!!First Boot!!!, ... And we, being the shy, retiring, delicate flowers that we are, couldn t do a thing about it.","messageBody":"<div id=\"ygrps-yiv-1432222333\">In a message dated 10/31/2001 11:16:58 PM !!!First Boot!!!, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If these programs remained <br/>\n&gt; what they claim to be it would be one thing, but they&#39;re notorious <br/>\n&gt; for changing the rules once enough people have been sucked through <br/>\n&gt; the door...<br/>\n&gt; <br/>\n&gt; Helen<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>And we, being the shy, retiring, delicate flowers that we are, couldn&#39;t do a <br/>\nthing about it.   Hmmm . . .<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"marbleface@aol.com","from":"marbleface@...","profile":"nanceconfer","replyTo":"LIST","senderId":"L-kKLt5KSbaMoNgOHRoGQSpDduFY6Z3VPzNCWZzDTwbub3uRyJZBDjH-Rl0k34ttEMAp5H95GYOo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004579349","msgId":27207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFjLjFkMWFjMDBmLjI5MTIwNDE1QGFvbC5jb20+"},"prevInTopic":27206,"nextInTopic":27208,"prevInTime":27206,"nextInTime":27208,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"LOL -- nope, not yet. What I am doing is admiring your daughters-in-law. I betcha their husbands are as strong-willed as you are and yet, these informed,","messageBody":"<div id=\"ygrps-yiv-1748207365\">LOL -- nope, not yet.<br/>\n<br/>\nWhat I am doing is admiring your daughters-in-law.<br/>\n<br/>\nI betcha their husbands are as strong-willed as you are and yet, these <br/>\ninformed, intelligent, liberated women evaluated all their options and made a <br/>\nchoice!<br/>\n<br/>\nGood for them.<br/>\n<br/>\nGood for all of us.<br/>\n<br/>\nEven if it&#39;s not what their MIL would have chosen. :)<br/>\n<br/>\nNance<br/>\n<br/>\nIn a message dated 10/31/2001 8:41:15 PM !!!First Boot!!!, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The whole idea of homebirthing was co-opted by the professionals and <br/>\n&gt; institutions, and we&#39;re seeing the same thing happen with <br/>\n&gt; homeschooling.<br/>\n&gt; <br/>\n&gt; Anyone getting scared yet?<br/>\n&gt; <br/>\n&gt; Helen<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","senderId":"lL29lcjAnQUZFNFCeVrUYmiprFuTTgUCnuO_KVzHrEQqk--7JClwdJYyWp-iOAgbhSHKZruPw1Z0fJXcJp_ayM3b3nJ2MfG-WzJVpdKdsVlU-V8O5Y8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004576730","msgId":27206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk5YWI4MDY0ZjNhNzVjYkBbMjA4LjI2LjIyNy4yMTBdPg==","inReplyToHeader":"PDIwMDExMDMxLjE3MzAxMy4tOTU1NDU1LjQuZGR6aW1sZXdAanVuby5jb20+","referencesHeader":"PDIwMDExMDMxLjE3MzAxMy4tOTU1NDU1LjQuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27205,"nextInTopic":27207,"prevInTime":27205,"nextInTime":27207,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... No kidding? Our only daughter was born one cold windy morning in a small cabin her father and I built about a mile off Knik Road, on Vine, back when it was","messageBody":"<div id=\"ygrps-yiv-1893476102\">At 5:30 PM -0700 10/31/01, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ddzimlew@...\">ddzimlew@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;My son was born at home in a cabin with no plumbing and no electricity in<br/>\n&gt;Knik, Alaska.  It just made no sense to load up and drive all the way to<br/>\n&gt;the hospital at Palmer, do all that work myself anyway, pay a huge bill<br/>\n&gt;and come back home. <br/>\n&gt;It was so much simpler, and more comforting to just stay home. <br/>\n<br/>\n </span></blockquote>No kidding? Our only daughter was born one cold windy morning in a <br/>\nsmall cabin her father and I built about a mile off Knik Road, on <br/>\nVine, back when it was still a dead end road... Small world. &lt;g&gt;<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":0,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"mom2zimmy","replyTo":"LIST","senderId":"z0lB_VqDFeL9cH5ls3d6ZCdgD6Ee0NsVNbCmnCrbcXdrOElUKBN-HZubsvxUp_-cZ57GwZuP51U","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004574607","msgId":27205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMDMxLjE3MzAxMy4tOTU1NDU1LjQuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":27203,"nextInTopic":27206,"prevInTime":27204,"nextInTime":27206,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"I see the gobbling up of homeschoolers too.  I think at least part of it is that homeschoolers get so tired of being odd.  I hear that homeschooling is more","messageBody":"<div id=\"ygrps-yiv-1079273292\">I see the gobbling up of homeschoolers too.  I think at least part of it<br/>\nis that homeschoolers get so tired of being odd.  I hear that<br/>\nhomeschooling is more accepted these days but I personally haven&#39;t seen<br/>\nit.  There are constant questions about socialization, qualifications,<br/>\ncurriculum.  Most of these questions asked because people don&#39;t know what<br/>\nelse to say, I suppose.  The quizzing of the kids,  &quot;what&#39;s bigger, a<br/>\nquarter square mile, or a quarter mile square?&quot;   The pressure from<br/>\nfamily and friends.  <br/>\nIf you&#39;re not really a person who enjoys life outside the mainstream, I<br/>\nthink it can just get tiring.  School programs take the heat off.  I&#39;ve<br/>\nseen it happen around here.  The gobbling has begun.  <br/>\n<br/>\nAnd about hospitals offering birthing choices now; it&#39;s NOT the same as<br/>\nhome birth.<br/>\nHospitals do their very best to scare women into believing that<br/>\nchildbirth is an illness that needs special medical treatment.  They<br/>\noffer these programs because they were afraid of loosing money, not<br/>\nbecause of any great desire to serve the community, just like the<br/>\nschools.  Women aren&#39;t respected, they told they can&#39;t possibly do it<br/>\nalone.    I realize there are some pregnancies that do require medical<br/>\nattention, but the real deal is a woman has to do the hard part all by<br/>\nherself.  <br/>\nMy son was born at home in a cabin with no plumbing and no electricity in<br/>\nKnik, Alaska.  It just made no sense to load up and drive all the way to<br/>\nthe hospital at Palmer, do all that work myself anyway, pay a huge bill<br/>\nand come back home.  <br/>\nIt was so much simpler, and more comforting to just stay home.  <br/>\n<br/>\nWe have made other choices that differ from the mainstream, and we&#39;re<br/>\ncomfortable with them and answering questions.  ( Who ever said there is<br/>\nno such thing as a stupid question, never met some of these folks around<br/>\nhere )  But I can really understand how and why some families find an<br/>\neasier way.  I don&#39;t like it, it does scare me, but I can see how it<br/>\nhappens. <br/>\n<br/>\nDeb L, who is against gobbling, and flag waving, and George Bush, and<br/>\nDang if I didn&#39;t miss that whole great discussion on Middle East<br/>\npolitics!   Oy.</div>","specialLinks":[]},{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","senderId":"3be-rHeMxvbt1rbISrNd3wg-LxbTE8OuLQrdCn_L0HWFX0BpDyl10KxcR7Ras4q9_YRSu3_IIH8PPkDyyTwn2xkkYg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004571885","msgId":27203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZjQwMWMxNjI2NyQ4ZWVkZmVjMCQ2ODVkZDFkMUBqaWRhMzU+","referencesHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPjxwMDUwMDE5NzViODA1MTRiZDcwNmZAWzIwOC4yNi4gMjI3LjIxMF0+IDwzQkUwMjRFQS44MjIyOTMwMEBlYXJ0aGxpbmsubmV0PiA8cDA1MDAxOTgzYjgwNWUyYzFlNDMwQFsyMDguMjYuMjI3LjIxMF0+IDwwMDdiMDFjMTYyNDYkMGJlNTYzZTAkYTg1ZGQxZDFAamlkYTM1PiA8cDA1MDAxOTkyYjgwNjEwMGQ5MjRjQFsyMDguMjYuMjI3LjIxMF0+IDwzQkUwN0IwRS43RTdDOUJGOEBpeC5uZXRjb20uY29tPg=="},"prevInTopic":27201,"nextInTopic":27205,"prevInTime":27202,"nextInTime":27204,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"A lot of it starts with all the ideals being incorporated to make the recipients happy.  Slowly, which the folks using the system don t notice, they start","messageBody":"<div id=\"ygrps-yiv-938125714\">A lot of it starts with all the ideals being incorporated to make the<br/>\nrecipients happy.  Slowly, which the folks using the system don&#39;t notice,<br/>\nthey start turning the system back to where it was.<br/>\n<br/>\nLet&#39;s take homebirthing.  They squaked and squaked about midwives and<br/>\nhomebirths.  So them they passed laws (spell that money and control) saying<br/>\nhow a midwife could be &quot;legal.&quot;  This usually means that the midwife has to<br/>\ncontract with and be supervised by an MD.  Then hospitals started building<br/>\nmidwife facilities.  Then they built birthingroom at hospitals.  Then the<br/>\nhospitals decided that for &quot;safety&quot; and &quot;insurance&quot; reasons an MD would have<br/>\nto supervise.  Now they are saying that only doctors can do the deliveries.<br/>\n<br/>\nSoooo, we are right back at square one which is an MD in charge in a<br/>\nhospital.<br/>\n<br/>\nThe same is happening with CA&#39;s charter laws.  Many years ago when places<br/>\nsuch as Bennett Valley were just about the lonesome cowboys of charters out<br/>\nthere,  they gave each family a certain dollar amount to spend as they<br/>\npleased.  The families had full use of all school facilities and supplies.<br/>\nIf they wanted to use the school bus for field trips they could do that.  No<br/>\nstrings, no reporting, no requirements.<br/>\n<br/>\nThe current round of legislation wants to mandate that only a ps can have a<br/>\ncharter.  They also are working to require that charters comply with ALL the<br/>\nsame rules and paperwork requirements as &quot;traditional&quot; public schools.  That<br/>\nmeans testing and it means that the ps that is the &quot;owner&quot; of the charter<br/>\nwill dictate curriculum and what text is used.  They are also working to<br/>\nremove the charters from certain organizations because of the fraud that is<br/>\nrampant in the outfits that have sprung up to &quot;manage&quot; charters.<br/>\n<br/>\nSlowly but surely the charters are becoming rigid and structured.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: Cindy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crma@...\">crma@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Wednesday, October 31, 2001 2:28 PM<br/>\nSubject: Re: [Unschooling-dotcom] Gobbling Up Homeschoolers<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Helen Hegener wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; The whole idea of homebirthing was co-opted by the professionals and<br/>\n&gt; &gt; institutions, and we&#39;re seeing the same thing happen with<br/>\n&gt; &gt; homeschooling.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; At what point does it become co-opting and not serving the needs of<br/>\n&gt; the community?   I can see that it is happening but I&#39;m not sure<br/>\n&gt; where the line is...<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt;<br/>\n&gt; Cindy Ferguson<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crma@...\">crma@...</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","senderId":"hW_XQREN76_tSrhqZUKjqJiELdgQBQXmaoocb0LoqYQuheHRH3KwUhnVV9fLP7g2HQj5FZBMHiEiJNpIG77saUWY65L_Xzrm3SxQU14WoeyNLd-EkZY","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004570465","msgId":27199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk5N2I4MDYzNjg5ZWJlZUBbMjA4LjI2LjIyNy4yMTBdPg==","inReplyToHeader":"PDNCRTA3QjBFLjdFN0M5QkY4QGl4Lm5ldGNvbS5jb20+","referencesHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPjxwMDUwMDE5NzViODA1MTRiZDcwNmZAWzIwOC4yNi4gIDIyNy4yMTBdPiA8M0JFMDI0RUEuODIyMjkzMDBAZWFydGhsaW5rLm5ldD4JIDxwMDUwMDE5ODNiODA1ZTJjMWU0MzBAWzIwOC4yNi4yMjcuMjEwXT4JIDwwMDdiMDFjMTYyNDYkMGJlNTYzZTAkYTg1ZGQxZDFAamlkYTM1PiA8cDA1MDAxOTkyYjgwNjEwMGQ5MjRjQFsyMDguMjYuMjI3LjIxMF0+IDwzQkUwN0IwRS43RTdDOUJGOEBpeC5uZXRjb20uY29tPg=="},"prevInTopic":27191,"nextInTopic":27201,"prevInTime":27198,"nextInTime":27200,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... If the community perceives it as a need then it s no longer co-opting, is it? The question becomes how the community perceives its own needs, which is","messageBody":"<div id=\"ygrps-yiv-1990714897\">At 2:28 PM -0800 10/31/01, Cindy wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;At what point does it become co-opting and not serving the needs of<br/>\n&gt;the community?   I can see that it is happening but I&#39;m not sure<br/>\n&gt;where the line is...<br/>\n<br/>\n </span></blockquote>If the community perceives it as a need then it&#39;s no longer <br/>\nco-opting, is it? The question becomes how the community perceives <br/>\nits own needs, which is based on the information they&#39;re given to <br/>\nwork with, which is sometimes misleading. If these programs remained <br/>\nwhat they claim to be it would be one thing, but they&#39;re notorious <br/>\nfor changing the rules once enough people have been sucked through <br/>\nthe door...<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","senderId":"wSMh_m-2JRB3mBvnonbvLPahAhv98thfAQo5UqGE4FVLu9SdrzDZ1As84Vmc7ctcjX78PJbuzbAYGuuSt3J3g-zFRw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004569875","msgId":27201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZWMwMWMxNjI2NyQ4OTdlNjRjMCQ2ODVkZDFkMUBqaWRhMzU+","referencesHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPjxwMDUwMDE5NzViODA1MTRiZDcwNmZAWzIwOC4yNi4yMjcuMjEwXT4gPDNCRTAyNEVBLjgyMjI5MzAwQGVhcnRobGluay5uZXQ+PHAwNTAwMTk4M2I4MDVlMmMxZTQzMEBbMjA4LjI2LjIyNy4yMTBdPjwwMDdiMDFjMTYyNDYkMGJlNTYzZTAkYTg1ZGQxZDFAamlkYTM1PiA8cDA1MDAxOTkyYjgwNjEwMGQ5MjRjQFsyMDguMjYuMjI3LjIxMF0+"},"prevInTopic":27199,"nextInTopic":27203,"prevInTime":27200,"nextInTime":27202,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"Yes, because the rules are changing and the numbers are being used to divide and conquer, so to speak.  All of those using the various ps options are counted","messageBody":"<div id=\"ygrps-yiv-861390895\">Yes, because the rules are changing and the numbers are being used to divide<br/>\nand conquer, so to speak.  All of those using the various ps options are<br/>\ncounted as ps students.  It doesn&#39;t make any difference if the only thing<br/>\nthey do is take the $$, they get counted as ps students.<br/>\n<br/>\nI am on the board for the local Title IX/JOM advisory committee and the<br/>\ntracking also uses those figures when they get to college.<br/>\n<br/>\nthey are now tracking the kids that are, at least in their parents minds,<br/>\nhomeschoolers and, guess who is doing better in college AND who are bringing<br/>\nthe numbers up for ps.<br/>\n<br/>\nso the ps system is happy--they get the $$ AND they get better stats at the<br/>\ncollege level.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: Helen Hegener &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Wednesday, October 31, 2001 12:37 PM<br/>\nSubject: [Unschooling-dotcom] Gobbling Up Homeschoolers<br/>\n<br/>\n<br/>\n&gt; At 11:51 AM -0800 10/31/01, Lynda wrote:<br/>\n&gt; &gt;It is here in CA also.  The charter schools are gobbling up homeschoolers<br/>\nat<br/>\n&gt; &gt;a tremendous rate.  Also, some of the charter schools are now doing drop<br/>\nin<br/>\n&gt; &gt;satellite schools and I&#39;ve seen about 5 families leave for that this year<br/>\nup<br/>\n&gt; &gt;here in the boonies.<br/>\n&gt;<br/>\n&gt; Gobbling up homeschoolers... Great Halloween image there, Lynda. &lt;g&gt;<br/>\n&gt;<br/>\n&gt; Mark says it&#39;s the same dynamic that made homebirthing a thing of the<br/>\n&gt; past. Yeah, some hearty souls still do it, but neither of my<br/>\n&gt; daughters-in-law did, even though both my sons argued for it, having<br/>\n&gt; witnessed the easy home births of their siblings. Nurse-midwives were<br/>\n&gt; the preferred route for both wives, and while both girls entertained<br/>\n&gt; the idea of doing something at home - though still with professional<br/>\n&gt; assistance - both ended up at hospitals when - pardon the bad pun -<br/>\n&gt; push came to shove.<br/>\n&gt;<br/>\n&gt; The whole idea of homebirthing was co-opted by the professionals and<br/>\n&gt; institutions, and we&#39;re seeing the same thing happen with<br/>\n&gt; homeschooling.<br/>\n&gt;<br/>\n&gt; Anyone getting scared yet?<br/>\n&gt;<br/>\n&gt; Helen<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","senderId":"Z0VjuYBoVevDa8QZrKf1QosFgPD3C6l0LaR5X5-p8dZ9BilqjQb0hiZm7rse2_8jexTi9Ys4pbe6","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Gobbling Up Homeschoolers","postDate":"1004564409","msgId":27191,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2LjEyMTY2MTQ1LjI5MTFjOWI5QGFvbC5jb20+"},"prevInTopic":27190,"nextInTopic":27199,"prevInTime":27190,"nextInTime":27192,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/31/01 1:41:09 PM, HEM-Editor@home-ed-magazine.com writes: ","messageBody":"<div id=\"ygrps-yiv-600833453\">In a message dated 10/31/01 1:41:09 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a> <br/>\nwrites:<br/>\n<br/>\n&lt;&lt; The whole idea of homebirthing was co-opted by the professionals and <br/>\ninstitutions, and we&#39;re seeing the same thing happen with <br/>\nhomeschooling.<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>But home births changed the beliefs and practices of professionals and <br/>\ninstitutions, and homescooling will do that too.<br/>\n<br/>\nIt&#39;s more than many would have hoped of homeschooling, that it could change <br/>\nthe face (or the edges) of &quot;real school.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","senderId":"mVZHaTz0pIXPJkSgXHWfbKT9OC_SWddkbCyhDiaYPg4NVeJhxG21uyb6diqelBy6K0p9NVHljdYlEFuZ19ptJb_1nvSnz9zXMm5eFCPn3tfIvk5xleQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Gobbling Up Homeschoolers","postDate":"1004560674","msgId":27190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk5MmI4MDYxMDBkOTI0Y0BbMjA4LjI2LjIyNy4yMTBdPg==","inReplyToHeader":"PDAwN2IwMWMxNjI0NiQwYmU1NjNlMCRhODVkZDFkMUBqaWRhMzU+","referencesHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPjxwMDUwMDE5NzViODA1MTRiZDcwNmZAWzIwOC4yNi4gMjI3LjIxMF0+IDwzQkUwMjRFQS44MjIyOTMwMEBlYXJ0aGxpbmsubmV0PiA8cDA1MDAxOTgzYjgwNWUyYzFlNDMwQFsyMDguMjYuMjI3LjIxMF0+IDwwMDdiMDFjMTYyNDYkMGJlNTYzZTAkYTg1ZGQxZDFAamlkYTM1Pg=="},"prevInTopic":27189,"nextInTopic":27191,"prevInTime":27189,"nextInTime":27191,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... Gobbling up homeschoolers... Great Halloween image there, Lynda.  Mark says it s the same dynamic that made homebirthing a thing of the past. Yeah, some","messageBody":"<div id=\"ygrps-yiv-968203366\">At 11:51 AM -0800 10/31/01, Lynda wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;It is here in CA also.  The charter schools are gobbling up homeschoolers at<br/>\n&gt;a tremendous rate.  Also, some of the charter schools are now doing drop in<br/>\n&gt;satellite schools and I&#39;ve seen about 5 families leave for that this year up<br/>\n&gt;here in the boonies.<br/>\n<br/>\n </span></blockquote>Gobbling up homeschoolers... Great Halloween image there, Lynda. &lt;g&gt;<br/>\n<br/>\nMark says it&#39;s the same dynamic that made homebirthing a thing of the <br/>\npast. Yeah, some hearty souls still do it, but neither of my <br/>\ndaughters-in-law did, even though both my sons argued for it, having <br/>\nwitnessed the easy home births of their siblings. Nurse-midwives were <br/>\nthe preferred route for both wives, and while both girls entertained <br/>\nthe idea of doing something at home - though still with professional <br/>\nassistance - both ended up at hospitals when - pardon the bad pun - <br/>\npush came to shove.<br/>\n<br/>\nThe whole idea of homebirthing was co-opted by the professionals and <br/>\ninstitutions, and we&#39;re seeing the same thing happen with <br/>\nhomeschooling.<br/>\n<br/>\nAnyone getting scared yet?<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","senderId":"iK8i4F92QF2V98pCRbVHCvLVXgJ53VW3dS4p9L6z7B9LPs2wrb4OjB74ktcnFdm9WvR-v5OuJGBF1EgbTpTjqrk70A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Catching up... FWIW... GWS and HEM","postDate":"1004557892","msgId":27187,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwN2IwMWMxNjI0NiQwYmU1NjNlMCRhODVkZDFkMUBqaWRhMzU+","referencesHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPjxwMDUwMDE5NzViODA1MTRiZDcwNmZAWzIwOC4yNi4yMjcuMjEwXT4gPDNCRTAyNEVBLjgyMjI5MzAwQGVhcnRobGluay5uZXQ+IDxwMDUwMDE5ODNiODA1ZTJjMWU0MzBAWzIwOC4yNi4yMjcuMjEwXT4="},"prevInTopic":27185,"nextInTopic":27189,"prevInTime":27186,"nextInTime":27188,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"It is here in CA also.  The charter schools are gobbling up homeschoolers at a tremendous rate.  Also, some of the charter schools are now doing drop in ","messageBody":"<div id=\"ygrps-yiv-86104303\">It is here in CA also.  The charter schools are gobbling up homeschoolers at<br/>\na tremendous rate.  Also, some of the charter schools are now doing drop in<br/>\nsatellite schools and I&#39;ve seen about 5 families leave for that this year up<br/>\nhere in the boonies.<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: Helen Hegener &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Wednesday, October 31, 2001 9:24 AM<br/>\nSubject: Re: [Unschooling-dotcom] Catching up... FWIW... GWS and HEM<br/>\n<br/>\n<br/>\n&gt; At 8:21 AM -0800 10/31/01, Elizabeth Hill wrote:<br/>\n&gt; &gt;I believe that people in the public school homeschooly programs won&#39;t all<br/>\nstay<br/>\n&gt; &gt;there forever.  Many of them will bust loose and become independent<br/>\n&gt; &gt;homeschoolers.<br/>\n&gt;<br/>\n&gt; Some will, but from what anecdotal evidence we&#39;ve been able to find most<br/>\nwon&#39;t.<br/>\n&gt;<br/>\n&gt; &gt;Am I wrong?  Are local homeschooling groups seeing shrinkage?  I have<br/>\nheard,<br/>\n&gt; &gt;from friends in Washington, that the programs offered are pretty<br/>\nappealing.<br/>\n&gt; &gt;(Much better than some places that offer only &quot;school in a can&quot;.)<br/>\n&gt;<br/>\n&gt; Some homeschooling groups in this state (WA) have seen shrinkage to<br/>\n&gt; almost nothing. Homeschooling groups in my home state (Alaska) are<br/>\n&gt; almost non-existent due to a particularly aggressive and effective<br/>\n&gt; program of co-opting homeschool families back into the school system.<br/>\n&gt;<br/>\n&gt; &gt;I know money is a lure keeping them &quot;in&quot;, but lack of information also<br/>\nkeeps<br/>\n&gt; &gt;some of them there.<br/>\n&gt; &gt;<br/>\n&gt; &gt;If it was feasible to donate one old copy of HEM to every public school<br/>\n&gt; &gt;&quot;outreach&quot; program, maybe a few more people would jump the fence and bolt<br/>\nto<br/>\n&gt; &gt;freedom.<br/>\n&gt;<br/>\n&gt; We have the copies, and we&#39;re willing to make the donations. What we<br/>\n&gt; don&#39;t have is enough staff or help to get them into the hands of<br/>\n&gt; people who need them. Think small, struggling, just keeping our heads<br/>\n&gt; above water publication... a big glossy well-financed operation we&#39;re<br/>\n&gt; not.<br/>\n&gt;<br/>\n&gt; &gt;(Of course, I&#39;d like to see it in dentist&#39;s waiting rooms around the<br/>\ncountry,<br/>\n&gt; &gt;too.)<br/>\n&gt;<br/>\n&gt; Indeed! Wouldn&#39;t that be nice? &lt;G&gt;<br/>\n&gt;<br/>\n&gt; Helen<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","senderId":"GrdFGO3ahAz0mHNDb2qex_Q4EcQ4MhR9zA0CqicMH35AIyyWhkn_HBpGlfJ3dpFVfZrG8n_tBvPHymQWa58vYJAxZ3DG6f621wo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Catching up... FWIW... GWS and HEM","postDate":"1004549735","msgId":27189,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAxMTAzMTA5MTc0NC4wMWMzYTZhMEBwb3AuaXNsYW5kbmV0LmNvbT4=","inReplyToHeader":"PDNCRTAyNEVBLjgyMjI5MzAwQGVhcnRobGluay5uZXQ+","referencesHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPiA8cDA1MDAxOTc1YjgwNTE0YmQ3MDZmQFsyMDguMjYuMjI3LjIxMF0+"},"prevInTopic":27187,"nextInTopic":27190,"prevInTime":27188,"nextInTime":27190,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... And at least some public system hs programs let families access the goodies with less monitoring than some states require for independent hs.  We ve been","messageBody":"<div id=\"ygrps-yiv-127534492\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;I believe that people in the public school homeschooly programs won&#39;t all stay<br/>\n&gt;there forever.  Many of them will bust loose and become independent<br/>\n&gt;homeschoolers.<br/>\n<br/>\n </span></blockquote>And at least some public system hs programs let families access the <br/>\n&quot;goodies&quot; with less monitoring than some states require for independent <br/>\nhs.  We&#39;ve been with a program in BC for 7 years now that requires only a <br/>\nvery brief report 3 times a year.  I&#39;m talking the , &quot;We had a conversation <br/>\nabout the immune system for science&quot; type of report.  Yes, it&#39;s a tiny bit <br/>\nmore than what I&#39;d have to do as a &quot;real&quot; hs in BC, which would be to just <br/>\nregister.  It&#39;s also less than *every* hs has to do in Alberta and some of <br/>\nour other provinces.  And it&#39;s less than &quot;real&quot; hs in many states have to <br/>\ndo, even though they&#39;re labelled independent.  It takes me maybe an hour at <br/>\nmost.  I really don&#39;t mind paying for the computer and internet access plus <br/>\nan extra $200 to spend on almost anything we want to with 3 hours of my <br/>\ntime each year.<br/>\n<br/>\nI don&#39;t change *anything* about the way I homeschool in order to please <br/>\nthem.  There has been no problem at all with the fact that my son didn&#39;t <br/>\nread until age 12 and still doesn&#39;t read well at 14.  The online teacher is <br/>\navailable to help if I want it, which I don&#39;t.  No problem.<br/>\n<br/>\nI&#39;m well aware of the antagonism many hs have toward public programs, but I <br/>\njust don&#39;t see the problem.  Many people use them for a while, while they <br/>\nget their bearings.  Many use them for the money or equipment they can <br/>\nget.  I would hope that all, as I do, work toward keeping the laws for <br/>\n&quot;real&quot; homeschoolers as unintrusive as possible, so that there will always <br/>\nbe that option to step back to.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Am I wrong?  Are local homeschooling groups seeing shrinkage?  I have heard,<br/>\n&gt;from friends in Washington, that the programs offered are pretty appealing.<br/>\n&gt;(Much better than some places that offer only &quot;school in a can&quot;.)<br/>\n<br/>\n </span></blockquote>Most of the people using public hs programs in BC also join their local <br/>\ngroup.  I know many of the families in our local hs group are using public <br/>\nprograms, either the one we use or the more intrusive correspondance course <br/>\nthe government provides.  We certainly make no distinction in our group <br/>\nbetween those who use these programs and those who don&#39;t.  Some of the most <br/>\nradical unschoolers in our group are using the one we&#39;re with.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I know money is a lure keeping them &quot;in&quot;, but lack of information also keeps<br/>\n&gt;some of them there.<br/>\n<br/>\n </span></blockquote>I got a lot of calls from new and prospective hs when I was the <br/>\nsubscription person for our newsletter.  I always told them about all their <br/>\noptions, and the reasons they might want to choose one over the other for <br/>\ntheir family.  I&#39;ve always been a believer in lots of educational options.<br/>\nTia<br/>\n<br/>\nTia Leschke   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island<br/>\n**************************************************************************<br/>\nIt is the answers which separate us, the questions which unite us. - Janice <br/>\nLevy</div>","specialLinks":[]},{"userId":0,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","senderId":"CowyxbkRAqpcQq-UlP1efYtn5wL83DkFekE0Lr1TYmsw8y7xKl4ijBPDzhkh1SVs3n_Q3WLzG7N0SO0wNk3spCM2HWShaIWFv8-xtFEGkOvhbtPPvT0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Catching up... FWIW... GWS and HEM","postDate":"1004549058","msgId":27185,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk4M2I4MDVlMmMxZTQzMEBbMjA4LjI2LjIyNy4yMTBdPg==","inReplyToHeader":"PDNCRTAyNEVBLjgyMjI5MzAwQGVhcnRobGluay5uZXQ+","referencesHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPiA8cDA1MDAxOTc1YjgwNTE0YmQ3MDZmQFsyMDguMjYuMjI3LjIxMF0+IDwzQkUwMjRFQS44MjIyOTMwMEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":27183,"nextInTopic":27187,"prevInTime":27184,"nextInTime":27186,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... Some will, but from what anecdotal evidence we ve been able to find most won t. ... Some homeschooling groups in this state (WA) have seen shrinkage to ","messageBody":"<div id=\"ygrps-yiv-1008044305\">At 8:21 AM -0800 10/31/01, Elizabeth Hill wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I believe that people in the public school homeschooly programs won&#39;t all stay<br/>\n&gt;there forever.  Many of them will bust loose and become independent<br/>\n&gt;homeschoolers.<br/>\n<br/>\n </span></blockquote>Some will, but from what anecdotal evidence we&#39;ve been able to find most won&#39;t.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Am I wrong?  Are local homeschooling groups seeing shrinkage?  I have heard,<br/>\n&gt;from friends in Washington, that the programs offered are pretty appealing.<br/>\n&gt;(Much better than some places that offer only &quot;school in a can&quot;.)<br/>\n<br/>\n </span></blockquote>Some homeschooling groups in this state (WA) have seen shrinkage to <br/>\nalmost nothing. Homeschooling groups in my home state (Alaska) are <br/>\nalmost non-existent due to a particularly aggressive and effective <br/>\nprogram of co-opting homeschool families back into the school system.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I know money is a lure keeping them &quot;in&quot;, but lack of information also keeps<br/>\n&gt;some of them there.<br/>\n&gt;<br/>\n&gt;If it was feasible to donate one old copy of HEM to every public school<br/>\n&gt;&quot;outreach&quot; program, maybe a few more people would jump the fence and bolt to<br/>\n&gt;freedom.<br/>\n<br/>\n </span></blockquote>We have the copies, and we&#39;re willing to make the donations. What we <br/>\ndon&#39;t have is enough staff or help to get them into the hands of <br/>\npeople who need them. Think small, struggling, just keeping our heads <br/>\nabove water publication... a big glossy well-financed operation we&#39;re <br/>\nnot.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;(Of course, I&#39;d like to see it in dentist&#39;s waiting rooms around the country,<br/>\n&gt;too.)<br/>\n<br/>\n </span></blockquote>Indeed! Wouldn&#39;t that be nice? &lt;G&gt;<br/>\n<br/>\nHelen</div>","specialLinks":[]},{"userId":0,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","senderId":"mmORILRtFaTWZPXdQSwiP5EpZVYDrfziU7AV05RJqZW015JE_gRJCTb0KudOE8227O6HYQjczu4d5i183GbJ4I6OrmxzTORnXtSU5UnYow","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Catching up... FWIW... GWS and HEM","postDate":"1004545261","msgId":27183,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCRTAyNEVBLjgyMjI5MzAwQGVhcnRobGluay5uZXQ+","referencesHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPiA8cDA1MDAxOTc1YjgwNTE0YmQ3MDZmQFsyMDguMjYuMjI3LjIxMF0+"},"prevInTopic":27167,"nextInTopic":27185,"prevInTime":27182,"nextInTime":27184,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... Hi, Helen -- I believe that people in the public school homeschooly programs won t all stay there forever.  Many of them will bust loose and become","messageBody":"<div id=\"ygrps-yiv-401634649\">Helen Hegener wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I&#39;ll be honest: I&#39;m concerned about many indicators. I&#39;m concerned<br/>\n&gt; about the rapid growth of public school &quot;outreach&quot; programs<br/>\n&gt; masquerading as some perversion of homeschooling (there&#39;s even one<br/>\n&gt; right here in our hometown of Tonasket, run by a long-time family<br/>\n&gt; friend - and no, I don&#39;t want to go into details...). I&#39;m concerned<br/>\n&gt; about the proliferation of cyberschools and programs like Bennett&#39;s<br/>\n&gt; K-12;<br/>\n<br/>\n </span></blockquote>Hi, Helen --<br/>\n<br/>\nI believe that people in the public school homeschooly programs won&#39;t all stay<br/>\nthere forever.  Many of them will bust loose and become independent<br/>\nhomeschoolers.<br/>\n<br/>\nAm I wrong?  Are local homeschooling groups seeing shrinkage?  I have heard,<br/>\nfrom friends in Washington, that the programs offered are pretty appealing.<br/>\n(Much better than some places that offer only &quot;school in a can&quot;.)<br/>\n<br/>\nI know money is a lure keeping them &quot;in&quot;, but lack of information also keeps<br/>\nsome of them there.<br/>\n<br/>\nIf it was feasible to donate one old copy of HEM to every public school<br/>\n&quot;outreach&quot; program, maybe a few more people would jump the fence and bolt to<br/>\nfreedom.<br/>\n<br/>\n(Of course, I&#39;d like to see it in dentist&#39;s waiting rooms around the country,<br/>\ntoo.)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":0,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","profile":"hemhelen","replyTo":"LIST","senderId":"Wp1rurDPCM6yNfl01WCOUwIWDqX1QYPZpRbs2oTSxT63aYTZec2Drc0swJBuqh5xjkUVY_Z0x6yz_pRnVYth3jFvvAPUNz8EBD-de1FbA-9KTRy0I9c","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Catching up... FWIW... GWS and HEM","postDate":"1004497731","msgId":27167,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk3NWI4MDUxNGJkNzA2ZkBbMjA4LjI2LjIyNy4yMTBdPg==","inReplyToHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPg==","referencesHeader":"PDEwMDQ0OTE2NTcuMjg5MS4yMjg1My5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":27183,"prevInTime":27166,"nextInTime":27168,"topicId":27167,"numMessagesInTopic":0,"msgSnippet":"... Ah, Caren, thank you for the vote of confidence. That s what keeps us going. We ll miss seeing GWS in the mailbox - it was somehow comforting to know HEM","messageBody":"<div id=\"ygrps-yiv-2124346490\">At 1:27 AM +0000 10/31/01, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Message: 8<br/>\n&gt;    Date: Tue, 30 Oct 2001 20:45:48 -0000<br/>\n&gt;    From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carenkh@...\">carenkh@...</a><br/>\n&gt;Subject: Re: GWS<br/>\n&gt;<br/>\n&gt;Yep - you can go to <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.holtgws.com\">http://www.holtgws.com</a>  There is an order form<br/>\n&gt;there, and also a 1-800 number to call.  I know it&#39;s true that the<br/>\n&gt;old stuff is just as good...there&#39;s just something fulfilling in<br/>\n&gt;seeing a new magazine in the mailbox.  I feel the same way about<br/>\n&gt;Mothering magazine...sometimes it&#39;s the same stuff rehashed, but I<br/>\n&gt;still feel support from seeing it in print.  On to HEM!<br/>\n<br/>\n </span></blockquote>Ah, Caren, thank you for the vote of confidence. That&#39;s what keeps us going.<br/>\n<br/>\nWe&#39;ll miss seeing GWS in the mailbox - it was somehow comforting to <br/>\nknow HEM wasn&#39;t the only homeschool magazine with a distinctly <br/>\nunschooling slant. Now we&#39;re feeling somewhat alone and vulnerable, <br/>\nwondering if the demise of our companion publication should be seen <br/>\nas some kind of wake-up call or something. If they, with their <br/>\nincredible legacy from John himself, couldn&#39;t make it, what&#39;s going <br/>\nto keep HEM afloat?<br/>\n<br/>\nGWS had much more going for it than our little publication has. Not <br/>\njust the long history and the still-tremendous name recognition of <br/>\nJohn Holt, but GWS has been reviewed and praised by some of the top <br/>\nmainstream media over the years. Pat Farenga, who took over when John <br/>\npassed away in 1985, is a very popular conference speaker and a savvy <br/>\nbusinessman. If he thinks it&#39;s time to quit fighting the good fight <br/>\nwhat does that mean we should do?<br/>\n<br/>\nI&#39;ll be honest: I&#39;m concerned about many indicators. I&#39;m concerned <br/>\nabout the rapid growth of public school &quot;outreach&quot; programs <br/>\nmasquerading as some perversion of homeschooling (there&#39;s even one <br/>\nright here in our hometown of Tonasket, run by a long-time family <br/>\nfriend - and no, I don&#39;t want to go into details...). I&#39;m concerned <br/>\nabout the proliferation of cyberschools and programs like Bennett&#39;s <br/>\nK-12; I wonder how true friends of homeschooling like Pat <br/>\nMontgomery&#39;s Clonlara School and the Williams&#39; Oak Meadow School are <br/>\nfaring in the wake of those newcomers. I&#39;m concerned about signs that <br/>\n&quot;one right way&quot; to homeschool is being advocated by some pretty <br/>\nstrong forces with political clout... oldtimers and regular HEM <br/>\nreaders will know who I mean. I&#39;m not trying to be scary - I&#39;ll save <br/>\nthat for Halloween - but it worries me that so many people have been <br/>\nso well prepared to change the face of homeschooling into something <br/>\nunrecognizable to many of us.<br/>\n<br/>\nI&#39;m concerned about all the various ways homeschooling and <br/>\nunschooling as we know it are being co-opted and changed and <br/>\nreconfigured to suit a changing world... On the one hand I can see <br/>\nand understand the natural progression of events (hindsight is always <br/>\n20/20), while on the other hand I have to wonder what it all means, <br/>\nand how we - as a fairly radical do-your-own-thing publication, fit <br/>\ninto the picture.<br/>\n<br/>\nSome days, when I&#39;m feeling less than optimistic, I worry about our <br/>\npublishing future, too.<br/>\n<br/>\nHelen</div>","specialLinks":[]}],"prevTopicId":27415,"nextTopicId":27373}}