{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Cat potty-training information from other sites","postDate":"1010855118","msgId":2530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Ny43YjY3MWVmLjI5NzFjNmNlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":2529,"nextInTime":2531,"topicId":2530,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/12/02 7:21:52 AM, strandbe@mediaone.net writes: ","messageBody":"<div id=\"ygrps-yiv-1194973000\">In a message dated 1/12/02 7:21:52 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:strandbe@...\">strandbe@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I wonder about a litter box with a hole<br/>\n<br/>\ncut in the bottom of it strapped to the toilet seat.... &gt;&gt;<br/>\n<br/>\nThey used to sell a toilet seat cap (with a hole, but with a rim the cats <br/>\ncould jump up on) and you put herbs in the rim, and theoretically cats could <br/>\nbe trained to use a toilet if you had an extra one you could leave that on.  <br/>\nYou&#39;d put the litter box in the same room, I think, but they might prefer the <br/>\ntoilet-one.  And once they got it you could take it off and they would use <br/>\nany toilet.<br/>\n<br/>\nOKAY, it was silly for me to be telling you, so I went to Google.com and put <br/>\nin &quot;toilet training cats&quot; and there&#39;s a fair bit of stuff.  <br/>\n<br/>\nHere&#39;s some, and a couple of links, and a (possibly still-going) discussion <br/>\nlist:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.CatGift.com/toilettrain.asp\">http://www.CatGift.com/toilettrain.asp</a><br/>\n<br/>\nWe are the exclusive distributors of this unique kit. The kit includes a <br/>\nspecial &quot;Kitty Toilet Training Seat&quot; (after 21 days they&#39;ll share your <br/>\nregular people toilet).  <br/>\n<br/>\nAnd the 60 page book that guides you step by step thru a 21 day program and <br/>\ncovers training mistakes, special situations, etc. Only $24.95 for the <br/>\ncomplete kit.<br/>\n<br/>\nLaura says&quot;I didn&#39;t believe it either. Sure I heard stories of cats using the <br/>\ntoilet, but I didn&#39;t believe it was possible until we trained ours in 21 <br/>\ndays. <br/>\nI used to hate emptying the kitty litter, lets face it, it&#39;s not that <br/>\npleasant. With this book and training toilet seat your cat can learn to use <br/>\nthe toilet in less than a month. &quot;<br/>\n <br/>\nForget what you&#39;ve heard<br/>\n&quot;Forget what you&#39;ve read or heard. This 60 page book takes you step by step <br/>\nthru a 21 day program and covers training mistakes, special situations, etc. &quot;<br/>\n<br/>\n----------------<br/>\n<br/>\nThe Toilet Training and Cats Mailing Lists<br/>\n <br/>\nSeveral years ago I started a mailing list about toilet training cats.  It <br/>\nstill goes on today but I am only involved because the list is set up in my <br/>\nname.  As much as she can, BJ Jones guides the list members.  But, the list <br/>\nreally runs on its own.  <br/>\n<br/>\nThe best way to join the list is to go to the list website.<br/>\n<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/toilet\">http://groups.yahoo.com/group/toilet</a><br/>\n<br/>\nThere is also a list for general cat discussions.  You can join at that <br/>\nlist&#39;s website.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/cats-list\">http://groups.yahoo.com/group/cats-list</a><br/>\n<br/>\n------------------------<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.execulink.com/~ritah/toilet.htm\">http://www.execulink.com/~ritah/toilet.htm</a><br/>\n <br/>\n <br/>\n &quot;TOILET TRAINING CATS&quot; <br/>\n<br/>\nOkay, here&#39;s how we trained Boots to go &quot;potty&quot; in the toilet:<br/>\n<br/>\nFirst, you move kitty&#39;s litter box into the bathroom right next to the <br/>\ntoilet. Take up bathroom rugs and any other things in the bathroom that might <br/>\ntempt kitty to go on them (just to be safe).<br/>\n<br/>\nWait til he&#39;s used to that, probably a day or two, then raise the litter box <br/>\na couple of inches by placing books or a box or whatever under it. Just be <br/>\nsure it remains stable so kitty doesn&#39;t get nervous from his litter box being <br/>\nshaky.<br/>\n<br/>\nKeep raising kitty&#39;s litter box a few inches at a time, giving him time to <br/>\nget used to the move with each height increase.<br/>\n<br/>\nOnce the bottom of the litter box is even with the toilet seat, move it over <br/>\nso that it is sitting on top of the seat. If kitty seems too reluctant at <br/>\nthis point, you might put just half on the seat & leave half remaining on the <br/>\nstack of books or whatever, as long as it remains steady.<br/>\n<br/>\nWith the litter box sitting on the toilet seat, kitty is getting used to <br/>\nhaving to jump onto the seat before getting into his box. Once he seems <br/>\ncomfortable with that, remove the litter box from the seat, raise the seat & <br/>\nmeasure the width of the toilet bowl. <br/>\n<br/>\nPurchase a stainless steel/metal bowl that is the same size as you measured & <br/>\nplace it in the toilet bowl. (Get rid of the litter box! Yeah!!) The rim of <br/>\nthe metal bowl keeps it from falling into the water by resting on the rim of <br/>\nthe toilet bowl. Place an inch or two of litter in the metal bowl, lower the <br/>\ntoilet seat, & gently show kitty what is expected of him by sitting him on <br/>\nthe toilet seat. Try to catch him in the act to see how many legs he has in <br/>\nthe bowl and how many are up on the seat. The more he has on the seat, the <br/>\nbetter. Place one back leg on either side of his front legs in a squatting <br/>\nposition. Be calm & gentle. Do this occasionally throughout the day. Praise <br/>\nhim each time he does what you want him to do. He will probably complain a <br/>\nlittle with each step & may even urinate elsewhere. If he does, just gently <br/>\nplace him on the toilet again & again and keep lifting his leg out of the <br/>\nbowl onto the seat, getting him used to it. Pet him & talk to him lovingly to <br/>\nshow this experience does not need to be traumatic for him. If you just can&#39;t <br/>\nconvince him to go in the bowl, you may have to bring back the litter box for <br/>\na day. Just take baby steps. Don&#39;t rush the training or kitty may feel <br/>\npressured and not cooperate as readily. (Naturally, the &quot;people&quot; in the <br/>\nhousehold will need to take the bowl out when using the toilet!) <br/>\n<br/>\nWhen he does go in the bowl, praise him, pet him, give him a snack, etc. <br/>\nYou&#39;ll probably be able to tell when he needs to go potty by his restlessness <br/>\nand/or meowing. When you think he&#39;s telling you he needs to go, call him into <br/>\nthe bathroom & coax him onto the seat. Make sure all family & friends know to <br/>\nkeep the toilet bowl lid up & the toilet bowl seat down! Also, they must keep <br/>\nthe bathroom door open when not in use.<br/>\n<br/>\nIt won&#39;t take long for kitty to get used to going in the bowl. The next step <br/>\nis decreasing the amount of litter in the bowl. If he resists as it gets too <br/>\nlow, add just a little & keep letting it get less until he&#39;s thrilled if he <br/>\ngets just a teaspoon! Some cats have a harder time than others giving up the <br/>\ndigging & covering up ritual.<br/>\n<br/>\nHere&#39;s the hardest part  and the smelliest part, but you can probably get <br/>\nthrough it in a day or two. Leave the bowl empty of litter. If kitty just <br/>\nwon&#39;t have it that way, add a sprinkle of litter, then try again for the <br/>\nempty bowl. <br/>\n<br/>\nOnce he goes in the empty bowl, the next step is putting just a little water <br/>\nin the bowl. As he gets used to that, add a little more water until you have <br/>\n2 to 3 inches of water in the bowl. Remember, you may have to back up a step <br/>\nor two if kitty is just too uncomfortable. With Boots, this is the only time <br/>\nhe urinated on the floor & had a bowel movement in the soil of a large plant. <br/>\nMy husband put plastic around the bottom of the plant covering the dirt so <br/>\nBoots couldn&#39;t get to it again. Where he urinated, we just deordorized the <br/>\nspot & sprinkled a little vinegar to get rid of his scent. <br/>\n<br/>\nIt won&#39;t be long before kitty feels fairly comfortable urinating in the bowl. <br/>\nHowever, he may take longer feeling comfortable enough to have a bowel <br/>\nmovement in there. It&#39;s because his squatting position for urinating is lower <br/>\nto the seat & he, therefore, feels more steady. But, unless your kitty has a <br/>\nproblem with balance or some other problem that might keep it from working, <br/>\nhe&#39;ll get through this final step eventually. You might try taking the bowl <br/>\nout occasionally now & sitting kitty on the seat til he gets used to the bowl <br/>\nbeing gone. He will probably prefer a clean, flushed toilet. I know that <br/>\nsounds strange, but cats are not like dogs. Cats want to hide the odor. <br/>\n<br/>\nIt took Boots a couple of months to master this completely. He&#39;s 6 years old <br/>\n& he&#39;s a big cat, so if your cat is younger and/or smaller, it may go much <br/>\nmore quickly. Sometimes a few weeks is all it takes!<br/>\nBefore you know it, kitty will be completely toilet trained!! <br/>\n<br/>\nFinally, here&#39;s the pictures of Boots &quot;In Action&quot;! They aren&#39;t the greatest, <br/>\nbut it&#39;s hard to get a good picture in a small bathroom. At least it will <br/>\ngive you an idea of the two positions: #1 is a lower squat, #2 is a higher <br/>\nsquat.<br/>\n<br/>\nBoots in his #1 squat.<br/>\n <br/>\n<br/>\nBoots in his #2 squat.<br/>\n <br/>\n<br/>\nJust finished #1. <br/>\nAll Done!!<br/>\n <br/>\nHOME CONTENTS ODDS N&#39;ENDS EMAIL<br/>\nUpdated August 22, 2000<br/>\n<br/>\n<br/>\nThe last time this page was updated was 04/01/01 </div>","specialLinks":[]}],"prevTopicId":2529,"nextTopicId":2533}}