{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":139549710,"authorName":"Olga","from":"&quot;Olga&quot; &lt;britcontoo@...&gt;","profile":"britcontoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: My unschooling journey, and &quot;getting it&quot;/handwriting","postDate":"1051753442","msgId":67031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4cHU1MitwMmhrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE2OC4xZGUzZjdjNC4yYmUwN2IxYUBhb2wuY29tPg=="},"prevInTopic":66749,"nextInTopic":0,"prevInTime":67030,"nextInTime":67032,"topicId":66731,"numMessagesInTopic":0,"msgSnippet":"Teresa, What an awsome post!  I have been wrestling with this issue.  We are new to homeschooling and unschooling.  My son went to preschool pretty much at his","messageBody":"<div id=\"ygrps-yiv-2115898886\">Teresa,<br/>\n<br/>\nWhat an awsome post!  I have been wrestling with this issue.  We are <br/>\nnew to homeschooling and unschooling.  My son went to preschool <br/>\npretty much at his leisure since I knew he would not continue to ps <br/>\nnext year.  When he was at home, I crammed handwriting books down his <br/>\nthroat, poor kid!  This kid will not want to look at any form of <br/>\nworkbook for the next few years, and you know what I am OK with that <br/>\nbecause there are better ways!!  Anyway, once I let go of those this <br/>\nlittle &quot;schooled&quot; voice kept saying, &quot;he needs to learn to write!&quot;.  <br/>\nFinally, the light bulb went off and I realized that this kid has <br/>\nnever been into drawing or artsy things, certainly never writing for <br/>\nmore than a few minutes if that.  Did I really think that because I <br/>\ndecided he was going to learn to write, that he would just like it <br/>\nand be good at it, never mind the fact that he is young and still <br/>\nlacking in small motor control!!  DUH to me!!  Your post came at just <br/>\nthe right time for me to realize it is not the writing but the small <br/>\nmotor control which he will get in other ways.  Now, he occasinally <br/>\nwill take me up on one of my offers to write something, i.e. a <br/>\ngrocery list, a ltter to his cousin.  It is rare and I accept his &quot;no <br/>\nthank you&quot; with a smile.  When he does accept I watch for any <br/>\nfrustration if he tries for too long.  But, I have learned and am <br/>\nlearning that it is alright if he is not ready.  Thank you for a <br/>\ngreat post that reminded me sometimes we are so caught up in the <br/>\ndetails we forget the bigger picture!<br/>\n<br/>\nOlga :)<br/>\n<blockquote><span title=\"ireply\"> &gt; You are so right about the handwriting thing.  When I really <br/>\n </span></blockquote>thought about <br/>\n<blockquote><span title=\"ireply\"> &gt; it.. I realized, writing is a small motor skill, those muscles and <br/>\n </span></blockquote>skills can <br/>\n<blockquote><span title=\"ireply\"> &gt; be just a easily ( if not MORE easily) developed doing things kids <br/>\n </span></blockquote>enjoy <br/>\n<blockquote><span title=\"ireply\"> &gt; doing.. Like playing with legos, coloring, playing video games.   <br/>\n </span></blockquote>Its like <br/>\n<blockquote><span title=\"ireply\"> &gt; magic.. VOILA, their handwriting improves!.. <br/>\n&gt; <br/>\n&gt; Now, a disclaimer.. lol.  Some folks never have good handwriting no <br/>\n </span></blockquote>matter <br/>\n<blockquote><span title=\"ireply\"> &gt; how much they &quot;practice&quot;, or exercise their fine motor skills.   My <br/>\n&gt; husband&#39;s, Landon&#39;s, and Ethan&#39;s handwriting SUCKS big time.  Thier <br/>\n&gt; handwriting all looks very similar.  It is labored and exhausting <br/>\n </span></blockquote>for them to <br/>\n<blockquote><span title=\"ireply\"> &gt; write.  But, thats OK. thats what keyboards are for :-).. Landon <br/>\n </span></blockquote>can type <br/>\n<blockquote><span title=\"qreply\"> &gt; close to 100 wpm with few mistakes.<br/>\n&gt; <br/>\n&gt; Teresa<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: My unschooling journey, and &quot;getting it&quot;","postDate":"1051664666","msgId":66749,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2OC4xZGUzZjdjNC4yYmUwN2IxYUBhb2wuY29tPg=="},"prevInTopic":66739,"nextInTopic":67031,"prevInTime":66748,"nextInTime":66750,"topicId":66731,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/29/03 8:41:06 PM Eastern Daylight Time, ... You re welcome.. :-) You are so right about the handwriting thing.  When I really thought","messageBody":"<div id=\"ygrps-yiv-703206997\">In a message dated 4/29/03 8:41:06 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bunsofaluminum60@...\">bunsofaluminum60@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; anyway. Excellent post, teresa. Thanks!<br/>\n&gt; <br/>\n&gt; Peace, HeidiC<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>You&#39;re welcome.. :-) <br/>\n<br/>\nYou are so right about the handwriting thing.  When I really thought about <br/>\nit.. I realized, writing is a small motor skill, those muscles and skills can <br/>\nbe just a easily ( if not MORE easily) developed doing things kids enjoy <br/>\ndoing.. Like playing with legos, coloring, playing video games.   Its like <br/>\nmagic.. VOILA, their handwriting improves!.. <br/>\n<br/>\nNow, a disclaimer.. lol.  Some folks never have good handwriting no matter <br/>\nhow much they &quot;practice&quot;, or exercise their fine motor skills.   My <br/>\nhusband&#39;s, Landon&#39;s, and Ethan&#39;s handwriting SUCKS big time.  Thier <br/>\nhandwriting all looks very similar.  It is labored and exhausting for them to <br/>\nwrite.  But, thats OK. thats what keyboards are for :-).. Landon can type <br/>\nclose to 100 wpm with few mistakes.<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi","from":"&quot;Heidi&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: My unschooling journey, and &quot;getting it&quot;","postDate":"1051663080","msgId":66739,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4bjV0OCtkbzQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFjZS44OGUwZjE2LjJiZTA2OTc1QGFvbC5jb20+"},"prevInTopic":66731,"nextInTopic":66749,"prevInTime":66738,"nextInTime":66740,"topicId":66731,"numMessagesInTopic":0,"msgSnippet":"wow. I am SO GLAD you read this. I didn t have much time to click on every link here this evening (hubby s gonna kick me off soon, and katie wants to play) so","messageBody":"<div id=\"ygrps-yiv-284789050\">wow. I am SO GLAD you read this. I didn&#39;t have much time to click on <br/>\nevery link here this evening (hubby&#39;s gonna kick me off soon, and <br/>\nkatie wants to play) so yours is the first I chose.<br/>\n<br/>\nwhat PERFECT timing! especially this part:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I see my children learning every day.  JP had not picked up a <br/>\n&gt;pencil in over  3 months.  Then on Easter he picked me some flowers <br/>\n&gt;and he wrote me a note  that said.  &quot;Mommy, I love you, I want you <br/>\n&gt;to have these for a Happy Easter, love, Jon.  I thought Anna had <br/>\n&gt;written it for him, but he has written it all <br/>\n&gt; by himself. . The last time he wrote anything, it was barely <br/>\n&gt;readable.. Now,  his letters were just about perfectly formed and <br/>\n&gt;his handwriting was much  improved.    <br/>\n<br/>\n </span></blockquote>one of the things I&#39;ve had a difficult time &quot;deschooling&quot; has been <br/>\nhandwriting. Being a piano player, I know that practice is needed in <br/>\norder to get the neural connections to be at a reflex level, in order <br/>\nto play well. I was thinking the same thing about the writing: lots <br/>\nof practice in order to form letters well...but Robby&#39;s handwriting <br/>\nlooks just like a 10 year old public schooled kid we know, and I KNOW <br/>\nRobby has had ONE TENTH the writing practice of a 4th grade kid in <br/>\npublic school. <br/>\n<br/>\nanyway. Excellent post, teresa. Thanks!<br/>\n<br/>\nPeace, HeidiC</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"My unschooling journey, and &quot;getting it&quot;","postDate":"1051660149","msgId":66731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjZS44OGUwZjE2LjJiZTA2OTc1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":66739,"prevInTime":66730,"nextInTime":66732,"topicId":66731,"numMessagesInTopic":0,"msgSnippet":"When I first read about unschooling, I thought. HEY, this is perfect.. this is ME, this is my family..  I hadn t taken my kids out of school yet and I was just","messageBody":"<div id=\"ygrps-yiv-1636299378\">When I first read about unschooling, I thought. HEY, this is perfect.. this <br/>\nis ME, this is my family..  I hadn&#39;t taken my kids out of school yet and I <br/>\nwas just looking around, gathering information, trying to decide which path <br/>\nto take.   I understood it.   I think having children in public school and <br/>\nseeing how it did NOT work, made it easy for me to say. OH YEAH, that sounds <br/>\nlike a much better approach.   The whole &quot;educational&quot; aspect of unschooling <br/>\nwas never a question or a concern to me.   Now, it is  a concern for everyone <br/>\nelse in my family ( that does not home/unschool).  From my own 16 yo son to <br/>\nmy parents and of course, my laws, I have gotten nothing but grief, <br/>\nquestioning, condemnation, and suspicion of my sanity.   But, that has <br/>\nimproved with time, they don&#39;t rag on me nearly as much as they did.  I guess <br/>\nthey just realized I was not giving in to thier pressure.    <br/>\n<br/>\nWhat was harder to grasp was some of the parenting approaches that most <br/>\nunschoolers (on this list) strongly uphold as the one, best, only way to <br/>\nparent children.  All the chores/bedtimes/TV/games/eating stuff.    I&#39;ve said <br/>\nbefore, about 90% of them make good sense to me and they are right in line <br/>\nwith the way I have always parented my children.  But some of the stuff that <br/>\nI struggled with became a bone of contention on this group as I tried and <br/>\ntried to figure out how to &quot;do it right&quot;.  Well, I finally just gave up.on <br/>\ntrying to suit the folks on this list, and I just followed my own instincts.  <br/>\nI thought, afterall, I was doing the same thing with my own family and <br/>\nfriends.. People who love and care about me and my children, I took thier <br/>\nthoughts about how I was raising my children with a grain of salt, because I <br/>\nfelt in my  heart I knew my own children better than anyone else.  <br/>\n<br/>\nThe best thing I have learned about unschooling is to just enjoy it.  It&#39;s <br/>\nnot nearly as complicated as some folks make it out to be.  It IS just living <br/>\nyour life, period.  Like there is no such thing as school ( stolen from Ned <br/>\nVare.. :-)  ..I don&#39;t worry about math.  I just don&#39;t.. period.   I don&#39;t <br/>\nworry about reading or writing or penmanship .. or history or any other <br/>\n&quot;subject&quot;..  It was very easy for me to let go of those worries because they <br/>\nwere so exhausting and stressful and just DIFFICULT to live with when my kids <br/>\nwere in school.  Those kinds of things never meant nearly as much to me as <br/>\nthey did to the school or the teacher.. But, dang it, they just wouldnt leave <br/>\nme alone about it.. lol.   Now, when I hear my neices and nephews complaining <br/>\nabout doing thier homework, thier math, thier spelling and phonics.. I want <br/>\nto shout  YAYYYYYY&gt;&gt; NA NA NA NA NA. .. we don&#39;t have to do that!!  It is a <br/>\ntremendous relief to not have hear all about EOG&#39;s and test results and blah <br/>\nblah blah.. <br/>\n<br/>\nI see my children learning every day.  JP had not picked up a pencil in over <br/>\n3 months.  Then on Easter he picked me some flowers and he wrote me a note <br/>\nthat said.  &quot;Mommy, I love you, I want you to have these for a Happy Easter, <br/>\nlove, Jon.  I thought Anna had written it for him, but he has written it all <br/>\nby himself. . The last time he wrote anything, it was barely readable.. Now, <br/>\nhis letters were just about perfectly formed and his handwriting was much <br/>\nimproved.    I told my husband, &quot;look at JP&#39;s letter he wrote to me, his <br/>\nhandwriting has really improved ( not within earshot of JP).  DH said.. yeah, <br/>\nI bet it would look exactly the same if he had to write his spelling words 5x <br/>\neach every week, write 2 stories every week, plus 10 sentences with his <br/>\nspelling words.. PLUS all the worksheets he had to fill out.  Heck, it may <br/>\nnot even be as good since he fought us tooth and nail over doing his school <br/>\nwork.   His improved handwriting ( by osmosis..lol) is just one the many many <br/>\nthings I see blossoming in my children, and it&#39;s wonderful to be so much a <br/>\npart of thier lives.  <br/>\n<br/>\nOH.. about non-stop gaming.. That was very difficult for me too.   Not that I <br/>\nreally cared if they played all the time, just that it caused so much <br/>\nconflict between my boys.  So many broken controllers, so much frustration <br/>\nand &quot;sharing&quot; arguements, it was indeed hard to see how all of that could be <br/>\n&quot;good&quot; for anyone.  But, I continued to let them play.  Ethan broke the 4th <br/>\nset of controllers on the Xbox.   They went through 3 sets of controllers on <br/>\nthe N64.. They were down to one last controller that they had to share on the <br/>\nN64, and then they just lost interest in the games.   Not a word from me.. <br/>\nnot a restriction ( well, except I couldnt continue to buy controllers every <br/>\nweek, they had to wait til the funds became available).   Maybe it just got <br/>\nwarm enough outside for them to find other things to do.  Maybe they got <br/>\ntired of fighting and breaking things.. Maybe they reached the levels in <br/>\nthier games that they wanted to.   Maybe they got tired of sitting in food <br/>\ncrumbs and spilled drinks all day.. I don&#39;t know, but they havent played a <br/>\ngame in almost a month.   They haven&#39;t mentioned it, asked about it, or even <br/>\nacted like they know video games exist.   Now, who knows, next week, they may <br/>\nstart in again with the games, want new controllers, new games, etc.. and if <br/>\nthey do, I will do my best to comply ( financially speaking)  But, I can say, <br/>\nhonestly, my boys are living proof that if given the opportunity to play <br/>\ngames  as much as they want.. They will NOT play them 24/7 for the rest of <br/>\nthier lives.. For mine, it was just about 3 mos.  :-)  Which, in the whole <br/>\nscheme of things, is really not long at all<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":66886,"nextTopicId":67035}}