{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Alexander the Great and the Terrible, Horrible, No Good Very Bad Day","postDate":"1257345311","msgId":48387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3MjI5NTYyLUNDNzEtNDBFMy05QkNELUZERUE2NzRFNjEzNkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":48386,"nextInTime":48388,"topicId":48387,"numMessagesInTopic":0,"msgSnippet":"Parodies are wonderful for effortless learning.   The one below was done by high school boys (gamers, I believe).  For people who like this, or Weird Al, I","messageBody":"<div id=\"ygrps-yiv-1007808730\">Parodies are wonderful for effortless learning.   The one below was  <br/>\ndone by high school boys (gamers, I believe).  For people who like  <br/>\nthis, or Weird Al, I also recommend Asterix and Obelix comics.<br/>\n<br/>\n<br/>\n<br/>\nAlexander the Great and the Terrible, Horrible, No Good Very Bad Day<br/>\n<br/>\nin the style of the children&#39;s story Alexander and the Terrible  <br/>\nHorrible No Good Very Bad Day; written for Honors English 11 last year<br/>\n<br/>\nBy William Aoki, Chris Condrat, and Ryan Merril-Johnson<br/>\n<br/>\n<br/>\n<br/>\nI left the battle with blood in my helmet and now there&#39;s blood in my  <br/>\nhair and when I got out of my armor this afternoon I tripped on a dead  <br/>\nsolder and by mistake I dropped my sword in the catapult while the  <br/>\nthing was launching and I could tell it was going to be a terrible,  <br/>\nhorrible, no good very bad day.<br/>\n<br/>\nAt dinner Aristotle found a fat juicy rabbit in the tall overgrown  <br/>\ngrass and Demetrius found a striking young buck in the tall overgrown  <br/>\ngrass but in my tall overgrown grass all I found was tall overgrown  <br/>\ngrass.<br/>\n<br/>\nI think I&#39;ll move to Carthage.<br/>\n<br/>\nIn the march my bodyguard told Homer to have the left flank. Plato and  <br/>\nHephestus were told to take the right flank.  I said I was being  <br/>\nscrunched. I said I was being smushed. I said if I don&#39;t get a place  <br/>\non a flank I am going to be homicidal. No one even saluted.<br/>\n<br/>\nI could tell it was going to be a terrible, horrible, no good very bad  <br/>\nday.<br/>\n<br/>\nIn battle Athena liked the Egyptians&#39; sacrifice of a lamb better than  <br/>\nmy sacrifice of the invisible cow. At praising time she said I praised  <br/>\ntoo quietly.  After I was done praying, she said I left out Zeus.  Who  <br/>\nneeds Zeus? I could tell it was going to be a terrible, horrible, no  <br/>\ngood very bad day.<br/>\n<br/>\nI could tell because Prometheus said I wasn&#39;t his best battle partner  <br/>\nanymore. He said that Philip was his best battle partner and Hector  <br/>\nwas his next best battle partner and that I was only his third best  <br/>\nbattle partner.<br/>\n<br/>\nI hope you sit on a pike, I said to Prometheus. I hope next time you  <br/>\nattack a fun-and-easily-killable blind old man your head part falls  <br/>\noff your neck part and lands in Carthage.<br/>\n<br/>\nThere were two biscuits in Philip&#39;s lunch bag and Perseus got cooked  <br/>\nmeat with spices and Prometheus&#39;s cook gave him a lamb&#39;s leg that had  <br/>\nbeen broiled to perfection. Guess whose cook forgot to cook the meat?<br/>\n<br/>\nIt was a terrible, horrible, no good very bad day.<br/>\n<br/>\nThat&#39;s what it was, because after battle my bodyguards took me to the  <br/>\narmorer and Corba found a small hole just in mine. Come back next week  <br/>\nand I&#39;ll fix it, said Corba.<br/>\n<br/>\nNext week, I said, I&#39;m going to Carthage.<br/>\n<br/>\nOn the way through the forest the thick brush snapped in my face and  <br/>\nwhile we were waiting for scouts to go get the report, Aristotle made  <br/>\nme fall where it was muddy and when I started to swear because of the  <br/>\nmud Demetrius said I was a Bronze-ager and while I was beating  <br/>\nDemetrius for saying Bronze-ager the scouts came back with the report  <br/>\nand laughed at me for being muddy and fighting.<br/>\n<br/>\nI am having a terrible, horrible, no good very bad day, I told  <br/>\neverybody. No one even saluted.<br/>\n<br/>\nSo then we went to a village to steal some women. Aristotle chose a  <br/>\nwhite one with brown hair, Demetrius chose a sunburned one with blond  <br/>\nhair. I wanted a freckled one with red hair, but we couldn&#39;t find one.  <br/>\nThere were none in the village. They made me take a plain old hag with  <br/>\ngreen hair, but they can&#39;t make me um...well.. you know..<br/>\n<br/>\nWhen we picked up a general at his tent he said I couldn&#39;t play with  <br/>\nhis longbow and arrows, but I forgot. He said to watch out for the  <br/>\nmaps on his desk, but I was careful as could be except for my sword  <br/>\nhand. He also said don&#39;t fool around with his carrier pigeon, but I  <br/>\nthink I sent it to Carthage. Thegeneral said please don&#39;t pick him up  <br/>\nanymore.<br/>\n<br/>\nIt was a terrible, horrible, no good very bad day.<br/>\n<br/>\nThere was stale bread for dinner and I hate stale bread.<br/>\n<br/>\nThere was flogging on the field and I hate flogging.<br/>\n<br/>\nMy bath was too cold, I got blood in my eyes, my sword fell in the  <br/>\nriver, and I had to wear my bronze-age armor. I hate my bronze-age  <br/>\narmor.<br/>\n<br/>\nWhen I went to battle Demetrius took back the flail he said I could  <br/>\nkeep and the Spartan Warrior (tm) wooden shield snapped apart and I  <br/>\nstubbed my toe.<br/>\n<br/>\nThe horse wants to sleep with Aristotle, not with me.<br/>\n<br/>\nIt has been a terrible, horrible, no good, very bad day.<br/>\n<br/>\nThe general says some days are like that.<br/>\n<br/>\nEven in Carthage.<br/>\n<br/>\n----------------------------<br/>\nI got the link from the medieval trivia list, and it&#39;s here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://everything2.net/title/Alexander+the+Great+and+the+Terrible%252C+Horrible%252C+No-Good+Very+Bad+Day\">http://everything2.net/title/Alexander+the+Great+and+the+Terrible%252C+Horrible%252C+No-Good+Very+Bad+Day</a></div>","specialLinks":[]}],"prevTopicId":48172,"nextTopicId":48395}}