{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dr. Gordon Neufeld and RU","postDate":"1206573191","msgId":33663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwNEJFMzlFLUI3MDEtNDU1NC1CQTlDLTYxRDRBODU2MjE0QkBtYWMuY29tPg==","inReplyToHeader":"PDEzRjk5RUE4LTc1MDgtNEUxMi04RTM2LUQyNEVGQjI1MzgxQUBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDEzRjk5RUE4LTc1MDgtNEUxMi04RTM2LUQyNEVGQjI1MzgxQUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":33662,"nextInTopic":0,"prevInTime":33662,"nextInTime":33664,"topicId":33648,"numMessagesInTopic":0,"msgSnippet":"... I didn t read his book (because it was expensive), and didn t hear any presentation of actual research in the parts of his talk that I heard. IS there","messageBody":"<div id=\"ygrps-yiv-334717628\">On Mar 26, 2008, at 11:10 AM, Emily Troper wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I am<br/>\n&gt; always looking for additional research/support for respectful<br/>\n&gt; parenting and unschooling.<br/>\n<br/>\n </span></blockquote>I didn&#39;t read his book (because it was expensive), and didn&#39;t hear any  <br/>\npresentation of actual research in the parts of his talk that I heard.<br/>\n<br/>\nIS there actual research involved, or is he presenting his ideas based  <br/>\non his years of experience?<br/>\n<br/>\nResearch - I&#39;m always interested (I read it critically, but I enjoy  <br/>\nreading it).<br/>\n<br/>\nExpert opinion? Not so much anymore. I used to read a lot of it, but  <br/>\nnow that unschoolers have been online for so long, there is such an  <br/>\naccumulated body of wisdom that I find the ideas of experts are kind  <br/>\nof -- well, the word that comes to mind is &quot;puny&quot; -- in comparison.<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dr. Gordon Neufeld and RU","postDate":"1206572887","msgId":33662,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhEMzBCQUFELTZFRTUtNEZGMy05NzBBLTZBNTcxODVBNDUwM0BtYWMuY29tPg==","inReplyToHeader":"PDEzRjk5RUE4LTc1MDgtNEUxMi04RTM2LUQyNEVGQjI1MzgxQUBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDEzRjk5RUE4LTc1MDgtNEUxMi04RTM2LUQyNEVGQjI1MzgxQUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":33648,"nextInTopic":33663,"prevInTime":33661,"nextInTime":33663,"topicId":33648,"numMessagesInTopic":0,"msgSnippet":"... If you read much about Summerhill, a big focus was on this issue - everyone, kids and adults, together deciding what the rules would be and also acting as","messageBody":"<div id=\"ygrps-yiv-1683741571\">On Mar 26, 2008, at 11:10 AM, Emily Troper wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Our local<br/>\n&gt; freeschool has some amazing caring people on staff who share our<br/>\n&gt; value of freedom for children, but they have recently instituted a<br/>\n&gt; Judicial System due to kids hurting other kids (instead of addressing<br/>\n&gt; the underlying needs), and now the kids are stressed about deciding<br/>\n&gt; about &quot;consequences&quot; for other children, and about how to budget<br/>\n&gt; appropriately so the electric bill gets paid.<br/>\n<br/>\n<br/>\n </span></blockquote>If you read much about Summerhill, a big focus was on this issue -  <br/>\neveryone, kids and adults, together deciding what the rules would be  <br/>\nand also acting as judges when someone broke the rules. It causes more  <br/>\nproblems than it solves to have a system in which everyone is  <br/>\nconsidered &quot;equal&quot; in all abilities, wisdom, intelligences, skills,  <br/>\nand talents. A system built on such a contradiction of reality is  <br/>\nguaranteed to be unwieldy and difficult and not to result in &quot;fair&quot;  <br/>\noutcomes. &quot;Fair&quot; doesn&#39;t mean &quot;equal.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":82889211,"authorName":"Emily Troper","from":"Emily Troper &lt;emtroper@...&gt;","profile":"emtroper2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Dr. Gordon Neufeld and RU","postDate":"1206555043","msgId":33648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzRjk5RUE4LTc1MDgtNEUxMi04RTM2LUQyNEVGQjI1MzgxQUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":33662,"prevInTime":33647,"nextInTime":33649,"topicId":33648,"numMessagesInTopic":0,"msgSnippet":"Thanks so much for the feedback about this, and for helping me to clarify what I think. ... Thank you for writing this Sandra, this is the distinction that I ","messageBody":"<div id=\"ygrps-yiv-168660164\">Thanks so much for the feedback about this, and for helping me to  <br/>\nclarify what I think.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;Another way to be unhealthy is to claim one&#39;s family is totally<br/>\n &gt;democratic, equals, all have an equal voice, etc. That doesn&#39;t make<br/>\n &gt;any sense either. Those who know the most and can do the most need<br/>\n &gt;to DO IT! More like communism, maybe. Socialism. &lt;bwg&gt; Those who<br/>\n &gt;have the ability to maintain cars and mow lawns and mend clothing<br/>\n &gt;really ought to do it cheerfully for the group, for the team! And<br/>\n &gt;those whose abilities are just growing will WANT to do what looks<br/>\n &gt;fun, and they will desire to be like the parents, if the parents keep<br/>\n &gt;themselves interesting and kind and supportive.<br/>\n<br/>\n<br/>\n </span></blockquote>Thank you for writing this Sandra, this is the distinction that I  <br/>\nthink a lot of parents in my area are having trouble with.  I like  <br/>\nbeing a kind, loving, attached, confident parent who takes care of  <br/>\nthe lawn and the clothing and the cars cheerfully!  :)  Our local  <br/>\nfreeschool has some amazing caring people on staff who share our  <br/>\nvalue of freedom for children, but they have recently instituted a  <br/>\nJudicial System due to kids hurting other kids (instead of addressing  <br/>\nthe underlying needs), and now the kids are stressed about deciding  <br/>\nabout &quot;consequences&quot; for other children, and about how to budget  <br/>\nappropriately so the electric bill gets paid.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;I think that he is acknowledging that the relationship is natural  <br/>\n </span></blockquote>that children depend on their<br/>\n<blockquote><span title=\"ireply\">  &gt;parents, and that that precious relationship must be carefully and  <br/>\n </span></blockquote>respectfully maintained in<br/>\n<blockquote><span title=\"ireply\">  &gt;a connected and positive way--not exploited by an abusive or  <br/>\n </span></blockquote>dysfunctional parent. A<br/>\n<blockquote><span title=\"ireply\">  &gt;parent (or other adult as the case may be) that is in that position  <br/>\n </span></blockquote>must tread very carefully<br/>\n<blockquote><span title=\"ireply\">  &gt;and sensitively because they are in a unique position to have even  <br/>\n </span></blockquote>more power to wound than<br/>\n<blockquote><span title=\"ireply\">  &gt;anyone else. That loving bond is what protects children and allows  <br/>\n </span></blockquote>for confident exploring of<br/>\n<blockquote><span title=\"ireply\">  &gt;their world as they grow and strengthen their sense of self.<br/>\n<br/>\n </span></blockquote>Yeah, thanks for this summary - this was my take on it too Joanna,  <br/>\nand his book/talk caused me to un-enroll my children in the  <br/>\nfreeschool (where they were attending 1-2 half days each week since  <br/>\nSeptember) and renew my commitment to total unschooling - they  <br/>\nweren&#39;t attached in a healthy way to any adults there, and we also  <br/>\nleft due to the reasons I mentioned above (I do NOT want my kids to  <br/>\nbe punished, even by other children, by vote!).<br/>\n<br/>\nDr. Neufeld was able to articulate things in a way that explains, for  <br/>\nme, the reasons behind things which I have felt intuitively but was  <br/>\nunable to fully understand.  Of course he&#39;s not the &quot;expert&quot; and I  <br/>\nget SO much from talking with other experienced parents and my lists,  <br/>\nand reading, but I do like some of what he has to offer, and in my  <br/>\nrole in my community (as a parent educator/child advocate) I am  <br/>\nalways looking for additional research/support for respectful  <br/>\nparenting and unschooling.<br/>\n<br/>\nSo, the things that were clarified for me:<br/>\n<br/>\n--when the attachment is intact, parenting is comparatively easy; ie  <br/>\nyour child &quot;follows&quot; you (given that there are no medical or other  <br/>\nhealth problems, or external trauma)<br/>\n--that it&#39;s not about what to do/say but how to be with your children<br/>\n--a very positive view of parent&#39;s &quot;power&quot; and &quot;hierarchy&quot; that is  <br/>\nbased on attachment and connection, and impossible through coercion<br/>\n--why contact with lots of other children is *not* neccessarily what  <br/>\nour children need and how it differs from continuum-intact cultures  <br/>\nwhere children spend lots of time together in healthy ways<br/>\n--why a child who is &quot;bored&quot; and begging for a playmate may need  <br/>\nsomething else entirely (connection with you!) and why sending them  <br/>\nto friends<br/>\ninstead may be harmful<br/>\n--why it&#39;s SO important to invite our children to be dependent on us  <br/>\nand why they need this until they become adults, not just as infants<br/>\n--why I unschool, why I don&#39;t encourage weaning, why I sometimes do  <br/>\nthings for my children that they can do for themselves<br/>\n--the importance of &quot;collecting&quot; or gathering and orienting our  <br/>\nchildren to us<br/>\n-why to give to a child, especially a needy or &quot;clingy&quot; child, when  <br/>\nthey aren&#39;t asking, not just answering when they ask<br/>\n--why being &quot;clingy&quot; in certain situations is very healthy and how  <br/>\noutwardly &quot;independent&quot; confident children may be suffering from a  <br/>\nlack of close attachment<br/>\n<br/>\nDr. Neufeld doesn&#39;t give a lot of practical parenting tools, he&#39;s  <br/>\nmore about the theory, which I like. I did get to hear some of his  <br/>\nreal life examples after the lecture, though, and they really  <br/>\nresonated with me, and I like that he said publicly that none of his  <br/>\n5 (now adult) children have ever been punished or &quot;consequenced&quot;.<br/>\n<br/>\nSome people may have a hard time with the &quot;honoring our instincts&quot;  <br/>\ntheory about parenting, especially when they were raised in a  <br/>\ndysfunctional or abusive environment, so those instincts might  <br/>\ninclude things that don&#39;t really feel like the &quot;wisdom of elders&quot;.   <br/>\nBeing someone who was abused for years, much of my parenting was  <br/>\nconscious override, until I settled into my real instincts. AP in the  <br/>\nearly years felt like an easy choice, but honoring feelings, giving  <br/>\nempathy, unschooling, etc. with older kids, were more &quot;learned arts&quot;  <br/>\nfor me.<br/>\n<br/>\nI find that a lot of what Dr. Neufeld talks about syncs up well with  <br/>\nThe Continuum Concept and The Law of Attraction - i.e. expecting that  <br/>\n(when kids are well-connected) they will follow your lead, and do  <br/>\ntheir best to live up to your expectations, and according to other  <br/>\nparenting theories (Patty Wipfler and NVC), if they don&#39;t &quot;follow&quot;  <br/>\nthere is an unmet need or hurt somewhere that needs to be addressed,  <br/>\nor it may just be a lack of connection in the first place. I worry  <br/>\nthat people will confuse the natural authority that GN talks about  <br/>\nwith authoritarian parenting, or that they will confuse firm  <br/>\nexpectations with consequences. I love the idea of being a confident  <br/>\nleader, not begging and pleading with my children to do what I want  <br/>\nthem to do, or explaining all my reasons, etc, but just  to matter-of- <br/>\nfactly expect that they want do the right thing, etc. and then when  <br/>\nthey don&#39;t - go back and re-connect and continue assuming positive  <br/>\nintent.<br/>\n<br/>\nI found &quot;special time&quot; to be almost like magic with my kids - when I  <br/>\nam able to REALLY do and get into it, on a regular basis, parenting  <br/>\nreally IS easy, the power struggles fall away, even with my most  <br/>\nspirited and challenging of children.<br/>\n<br/>\nSome examples from the last two days - this morning Seth (8.5) came  <br/>\nup and said &quot;I really want to spend some time with you&quot; and I was on  <br/>\nthe phone and folding laundry so I told him &quot;later, I&#39;m busy&quot; and 10  <br/>\nminutes later his sister Sara was screaming because Seth sprayed her  <br/>\nwith water.<br/>\n<br/>\nMorgan (16) was wanting to go to breakfast with me sometime, so we  <br/>\nplanned a time on Monday morning - he was so anxious that it wasn&#39;t  <br/>\ngoing to work out (that Jake, my toddler, wasn&#39;t going to go for  <br/>\nstaying with dad because he&#39;s been sick) that he started to get  <br/>\nreally grouchy and &quot;rude&quot;. I was so tempted to say &quot;You know, I don&#39;t  <br/>\nfeel like going to breakfast with you when you treat me like that&quot;,  <br/>\nbut I held my tongue and took him to breakfast (theorizing to my  <br/>\nskeptical husband that he needed it EVEN more because he was acting  <br/>\nlike this) and as usual he turned back into his loving, sweet,  <br/>\ncooperative self within 10 minutes and just that one breakfast time  <br/>\ntogether will probably last us about a week - before I will have to  <br/>\nagain find a way to reach out and &quot;collect&quot; him.<br/>\n<br/>\nI am so grateful to be here among you wise parents, and really  <br/>\nappreciate if you took the time to read all of this!!  I highly value  <br/>\nany input, reflections, or criticisms.<br/>\n<br/>\n<br/>\nEmily<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://myspace.com/memssj\">http://myspace.com/memssj</a><br/>\n<br/>\nin Portland, Oregon<br/>\nwith dh Michael<br/>\nds Morgan (12/91)<br/>\nds Seth (8/99)<br/>\ndd Sara Kate (7/01)<br/>\nand ds Jacob (12/04)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":33181,"nextTopicId":33717}}