{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":147376218,"authorName":"liza sabater","from":"liza sabater &lt;listdiva@...&gt;","profile":"lm_sabater","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Compassion","postDate":"1054309904","msgId":71419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlEMzFEMDAwLTkyQjYtMTFENy04QUE3LTAwMDM5M0I4NEZCNkBjdWx0dXJla2l0Y2hlbi5jb20+","inReplyToHeader":"PGJiM3Jkbyt0cGVqQGVHcm91cHMuY29tPg=="},"prevInTopic":71212,"nextInTopic":0,"prevInTime":71418,"nextInTime":71420,"topicId":71212,"numMessagesInTopic":0,"msgSnippet":"On Wednesday, May 28, 2003, at 22:31 America/New_York, moonstarshooter ... She sounds a lot like my best friend s son. Evan (my son) and Ethan ADORE each","messageBody":"<div id=\"ygrps-yiv-903918368\">On Wednesday, May 28, 2003, at 22:31 America/New_York, moonstarshooter <br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She does not realize when something she does is hurtful until I<br/>\n&gt; really sit her down and explain it.  Then she is very remorseful. <br/>\n&gt; That, I figure, may come with time.  What concerns me more is how<br/>\n&gt; unaffected she is by people in pain. <br/>\n<br/>\n </span></blockquote>She sounds a lot like my best friend&#39;s son. Evan (my son) and Ethan <br/>\nADORE each other. Actually, we are all so close that we are more like <br/>\nfamily than friends. Evan would hear a baby cry as an infant, and bawl <br/>\nhis eyes out. These days he takes it upon himself to soothe the baby <br/>\n(or child). Ethan can be standing right next to someone who has just <br/>\nhad an accident and not even notice. It used to freak me out because I <br/>\nadore that child and Hanna and I have discussed this to great lengths. <br/>\nWe have 2 theories. One is that he can&#39;t split his focus on two <br/>\ndifferent things.  Two, he freaks when he sees someone in distress and <br/>\nbasically shuts down emotionally ---in other words, it&#39;s his own way of <br/>\ncoping or bringing back balance to a stressful situation.<br/>\n<br/>\nAs to learning compassion, yes, I think it can be learned. He had an <br/>\nincident about a year and a half ago in which he hurt Evan. We were out <br/>\nin the playground and I had to come back home with him to clean the <br/>\ndirt and grit off his eyes (they actually were irritated for a few <br/>\ndays). Ethan was so upset, he described feeling his &#39;heart explode&#39; <br/>\nbecause he did not know what to do to make Evan feel better --he really <br/>\nhad not intended to hurt his friend. So I guess, that&#39;s why he shuts <br/>\noff --imagine his heart exploding all the time! Evan, on the other <br/>\nhand, is the polar opposite --he cries and shrieks about anything and <br/>\neverything ---he gets so overcome by his emotions that he plops in the <br/>\nfloor, a bag of tears*.<br/>\n<br/>\nSo it&#39;s funny because Ethan and Evan --although on different ends of <br/>\nthe empathy spectrum-- need to learn anyway how not to be overcome by <br/>\ntheir emotions and how to express them with words. So I guess they <br/>\nbalance each other out :-)<br/>\n<br/>\n/ l i z a<br/>\n<br/>\n<br/>\n* This may sound a bit harsh but when it happens 4,5,6,10 times a day, <br/>\nyou cannot but be a bit distant about this. And this coming from the <br/>\nmom that invented the &#39;anti-booboo kiss&#39;.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":101354964,"authorName":"moonstarshooter","from":"&quot;moonstarshooter&quot; &lt;torywalk@...&gt;","profile":"moonstarshooter","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Compassion","postDate":"1054175480","msgId":71212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJiM3Jkbyt0cGVqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":71419,"prevInTime":71211,"nextInTime":71213,"topicId":71212,"numMessagesInTopic":0,"msgSnippet":"I am not sure where to start with this, so I guess I will get right to the question:  Is compassion something you can learn?  Is it something a 6yo can learn?","messageBody":"<div id=\"ygrps-yiv-135773799\">I am not sure where to start with this, so I guess I will get right <br/>\nto the question:  Is compassion something you can learn?  Is it <br/>\nsomething a 6yo can learn?  Do some people just have it, and others <br/>\ndon&#39;t?<br/>\n<br/>\nBackground:  My daughter is a very factual, literal, not-overly-<br/>\nemotional child.  She is very lacking in intuition or compassion.  <br/>\nShe does not notice, or at least she does not seem affected by, <br/>\npeople in pain (physical or emotional.)  (She has millions of <br/>\nwonderful qualities, don&#39;t get me wrong, but they are not the ones I <br/>\nam concerned about.)<br/>\n<br/>\nShe does not realize when something she does is hurtful until I <br/>\nreally sit her down and explain it.  Then she is very remorseful.  <br/>\nThat, I figure, may come with time.  What concerns me more is how <br/>\nunaffected she is by people in pain.  <br/>\n<br/>\nFor instance, one morning during her gymnastics class I almost passed <br/>\nout, and had to lay down on a mat and several people were gathered <br/>\naround me.  It was near the end of class so the instructor led the <br/>\nclass to a side room so that they wouldn&#39;t see what was going on.  <br/>\n(Although they had to walk by me to get there.)  Most of the kids had <br/>\nlooks on their faces like they were worried or wondering what was <br/>\ngoing on.  All my daughter was concerned about was telling me she is <br/>\nthirsty, can she get a drink.  The other kids all picked up on the <br/>\nidea that something was wrong, but not her.<br/>\n<br/>\nFast forward to tonight:  My dad had back surgery yesterday, and it <br/>\nwas a much more serious operation than any of us realized.  So <br/>\nfinally tonight he was moved out of recovery and into surgical <br/>\nintensive care unit, so we went to visit him.  I took her, partly <br/>\nbecause I knew it wouldn&#39;t phase her, partly because I was hoping it <br/>\nwould.  When we walked into his room, she asked, &quot;Is that Papa?&quot; <br/>\nbecause he really looked different.  He was coming in and out of <br/>\nconsciousness, and kept wanting to change position (which hurt him <br/>\ntremendously) and was trying to pull at his many tubes, so they had <br/>\nto restrain him.  It was really pitiful.  But even in the midst of <br/>\nit, all she was worried about was whether she would be home in time <br/>\nfor a tv show.  Then she asked why we were staying so long (about 40 <br/>\nminutes) and I finally went over and explained to her that he had <br/>\nbeen there all by himself (without family, anyway) all day, and he <br/>\nwas in pain, and then I asked her to think about what she would want <br/>\nif she were in pain in a strange place.  I saw a glimmer of <br/>\nunderstanding.<br/>\n<br/>\nI don&#39;t expect her to ever be an overly-compassionate, merciful type <br/>\nof person.  But I do wonder if there is something I should be doing <br/>\nto help her see things from other people&#39;s perspectives.  Maybe just <br/>\ntaking it incident by incident is all I can do.  I know I am in a lot <br/>\nof conflict right now just over seeing my dad like that, so maybe I <br/>\nam making more of this than I should.  I don&#39;t know.  I would <br/>\nappreciate any thoughts.<br/>\n<br/>\nTory<br/>\n<br/>\nPS:  She did cry when she watched ET and Air Bud, so it is in there <br/>\nsomewhere.  Mainly for animals and extraterrestrials, though, it <br/>\nseems.  :-)</div>","specialLinks":[]}],"prevTopicId":71386,"nextTopicId":71424}}