{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":230706843,"authorName":"Betsy Hill","from":"Betsy Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] baffled II","postDate":"1140891914","msgId":112414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0MDBBMTBBLjkwNzA4MDZAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PDhCMTIxNjY1LTlBMUUtNDQzQi04MTU2LTQ2NjJCNUQ1NjQxNkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGR0cGx2MitwcGhhQGVHcm91cHMuY29tPiA8OEIxMjE2NjUtOUExRS00NDNCLTgxNTYtNDY2MkI1RDU2NDE2QHNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":112412,"nextInTopic":0,"prevInTime":112413,"nextInTime":112415,"topicId":112403,"numMessagesInTopic":0,"msgSnippet":"**I am looking for advice on how to handle the fact that we cannot afford it at the moment, not advice on how to figure out a way to afford it or how to manage","messageBody":"<div id=\"ygrps-yiv-658258842\">**I am looking for advice on how to handle the fact that we cannot<br/>\nafford it at the moment, not advice on how to figure out a way to<br/>\nafford it or how to manage our time better, if this makes sense.**<br/>\n<br/>\nI think the list will probably offer up both kinds of suggestions.  I <br/>\nbelieve it is worthwhile to consider the whole range of approaches.  <br/>\nSome might not comfortably fit your style or circumstances.  Some may be <br/>\nworth stretching for.  But even the ideas that are just wrong for you <br/>\nare likely to be *right for someone else* dealing with a similar <br/>\nsituation.  So it&#39;s worth looking at a whole range of ways to tackle a <br/>\nproblem, as the challenge you are dealing with does occur for many <br/>\nunschooling families. <br/>\n<br/>\nI was talking to a friend who takes her older child to a long gymnastics <br/>\nlesson that&#39;s more than a thirty minute drive from her house.  My <br/>\nimpression is that this wasn&#39;t much fun for her when the younger child <br/>\nhad to come as well.  But once they were able to set their lives up with <br/>\ndad working at home and the younger child able to be at home, it was fun <br/>\nfor the mom to go to a cafe with her laptop during the lesson.<br/>\n<br/>\nNaturally, not everyone has totally flexibility with work and childcare <br/>\narrangements and probably most of us don&#39;t have laptops.  (I don&#39;t.)  <br/>\nBut looking for ways to enjoy being where we are is always beneficial.<br/>\n<br/>\nProbably there were many other ways to make the class time fun for the <br/>\nrest of the family, especially if the older child didn&#39;t need a parent <br/>\nto stay.  But I&#39;m offering this as just one example of juggling things <br/>\naround to make the hanging around time more enjoyable.<br/>\n<br/>\nI also think carpooling is a great approach for classes that would be <br/>\ntiresome for a parent to wait through.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] baffled II","postDate":"1140885735","msgId":112412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhCMTIxNjY1LTlBMUUtNDQzQi04MTU2LTQ2NjJCNUQ1NjQxNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGR0cGx2MitwcGhhQGVHcm91cHMuY29tPg==","referencesHeader":"PGR0cGx2MitwcGhhQGVHcm91cHMuY29tPg=="},"prevInTopic":112410,"nextInTopic":112414,"prevInTime":112411,"nextInTime":112413,"topicId":112403,"numMessagesInTopic":0,"msgSnippet":"... When you re looking at two similar things and trying to figure out the logic, sometimes it helps to make two extreme examples instead. If she wanted to go","messageBody":"<div id=\"ygrps-yiv-1539180076\">On Feb 25, 2006, at 6:26 AM, kazitetalibuse wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I mean, we have already made the decision that it will not work for us<br/>\n&gt; financially or timewise. We would certainly try to explain and show<br/>\n&gt; her our thinking process, our financial situation, our priorities as<br/>\n&gt; to what fits into our schedule and what doesn&#39;t.<br/>\n<br/>\n<br/>\n </span></blockquote>When you&#39;re looking at two similar things and trying to figure out  <br/>\nthe logic, sometimes it helps to make two extreme examples instead.   <br/>\nIf she wanted to go to the convenience store that&#39;s walking distance  <br/>\nfrom you, or if she wanted to go to Africa.  NOW ask yourself whether  <br/>\nit fits your unschooling principles to say no.<br/>\n<br/>\nPeople can&#39;t say yes to everything.  Some families seem to find  <br/>\nvirtue in saying NO, even at times when Yes would&#39;ve been five ways  <br/>\nbetter.<br/>\n<br/>\n-=-I am looking for advice on how to handle the fact that we cannot<br/>\nafford it at the moment, not advice on how to figure out a way to<br/>\nafford it or how to manage our time better, if this makes sense. -=-<br/>\n<br/>\nIt makes sense in English, but it&#39;s not a reasonable thing to ask on  <br/>\nthis list, because though you might really get some good advice on  <br/>\nhow to handle your assertion and decision that you can&#39;t afford it  <br/>\n(&quot;facts&quot; don&#39;t come from declarations), the discussions here are not  <br/>\nsupposed to be for the benefit or in the direction of single  <br/>\nindividuals, but out on the table for the benefit of anyone who reads  <br/>\nit, now or in a  year or two.<br/>\n<br/>\nA family moving toward a more generous and respectful relationship  <br/>\nwith children sometimes goes too far.  If a family once decided  <br/>\nsimply by what was convenient for the parents, they might feel guilty  <br/>\nand give the kids their way ALL the time, kind of in penance.<br/>\nIf each decision is made with regard to everyone involved, though,  <br/>\nand the kids know that&#39;s they way decisions are being made, they&#39;ll  <br/>\nunderstand.  If they can&#39;t tell yet how you&#39;re deciding and it seems  <br/>\narbitrary they will likely ask for more, just to get less.  That &quot;ask  <br/>\nfor twice as much as you really want&quot; negotiating tool doesn&#39;t happen  <br/>\nat our house, but I&#39;ve seen it in effect in many others.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] baffled II","postDate":"1140884970","msgId":112410,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBCNzYzQTUwLTBDNzgtNDc5OS04QjQwLUQxRjdGOTI5NTA5RkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGR0cGx2MitwcGhhQGVHcm91cHMuY29tPg==","referencesHeader":"PGR0cGx2MitwcGhhQGVHcm91cHMuY29tPg=="},"prevInTopic":112407,"nextInTopic":112412,"prevInTime":112409,"nextInTime":112411,"topicId":112403,"numMessagesInTopic":0,"msgSnippet":"... There isn t an unschooling answer to this since it isn t about not schooling but there are respectful and less respectful ways of handling it. I m assuming","messageBody":"<div id=\"ygrps-yiv-843084904\">On Feb 25, 2006, at 8:26 AM, kazitetalibuse wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I mean, we have already made the decision that it will not work for us<br/>\n&gt; financially or timewise.<br/>\n<br/>\n </span></blockquote>There isn&#39;t an unschooling answer to this since it isn&#39;t about not  <br/>\nschooling but there are respectful and less respectful ways of  <br/>\nhandling it.<br/>\n<br/>\nI&#39;m assuming this is a class your daughter already is interested  in?<br/>\n<br/>\nWhat if there were a class you were interested in and your husband  <br/>\nthought it through on his own and came back with the decision you  <br/>\ncouldn&#39;t take it?<br/>\n<br/>\nYour approach of making a decision and then figuring out how to tell  <br/>\nyour daughter is turning your daughter into the problem. You could go  <br/>\nthrough the money issue with her. Perhaps she might come up with a  <br/>\ncreative solution. You could talk about the time commitment. You  <br/>\ncould research other options for classes with her.<br/>\n<br/>\nApproach it more as &quot;Here&#39;s the problems that I have with it that I  <br/>\ncan&#39;t find a way around,&quot; rather than &quot;Here&#39;s why it won&#39;t work and I  <br/>\nneed to convince you.&quot;<br/>\n<br/>\nThe more she trusts that you&#39;re on her side trying to help her get  <br/>\nwhat she wants, the easier it will be for her to accept when there  <br/>\nare times when she won&#39;t be able to have everything. If she trusts  <br/>\nyou, you might not need to go through the money issue as you might  <br/>\nnot need your husband to spell it all out for you.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Does this extend to parenting? Should I get my daughter&#39;s permission<br/>\n&gt; before I write about her on message boards?<br/>\n<br/>\n </span></blockquote>It doesn&#39;t hurt to ask her! Are you afraid she might tell you no? ;-)<br/>\n<br/>\nIf I were a kid and my mom told me she was trying to be a better mom  <br/>\nand wanted to ask some advice on better ways to handle something I&#39;d  <br/>\nwant to help her out by saying yes :-)<br/>\n<br/>\nBut if I knew my mothere was trying to rally the troops to support  <br/>\nher position against me, I wouldn&#39;t much like it!<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S.","from":"&quot;Angela S.&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [UnschoolingDiscussion] baffled II","postDate":"1140883971","msgId":112407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDMwMWM2M2EyNiQ1NDBkZGEwMCQ2NTAwYThjMEBlYm9ueT4=","inReplyToHeader":"PGR0cGx2MitwcGhhQGVHcm91cHMuY29tPg=="},"prevInTopic":112403,"nextInTopic":112410,"prevInTime":112406,"nextInTime":112408,"topicId":112403,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-229102477\">&lt;&lt;If my child wants something that my husband and I truly feel that we<br/>\ncannot afford (after much thinking and talking about it together)--<br/>\nsuch as an expensive class and time commitment to drive her to a<br/>\ncertain class two times a week plus waiting time of several hours --<br/>\nis it against the principles of unschooling to make this decision<br/>\nwithout her and for her?&gt;&gt;<br/>\n<br/>\nMaybe if you post the specifics of the class there is another option you<br/>\nhaven&#39;t considered.  Could she go the class and offer to be of assistance to<br/>\nthe teacher in order to learn about the subject?  Could she go to one class<br/>\nand see if someone lives nearby that could offer her a ride?  Sometimes it<br/>\ncan be difficult to reach out and ask for help or to ask for something<br/>\ndifferent than the norm, but I&#39;ve found it is worth it.  <br/>\n<br/>\nA couple years ago I was pretty certain we could not afford a horse.  Plus I<br/>\nalso felt I didn&#39;t know enough about them to care for them properly.  I went<br/>\noutside my comfort zone and asked the girls riding instructor if she&#39;d<br/>\nbarter board for my help around the place and she willingly agreed.  Not<br/>\nonly did it make it much ore affordable but I learned more about horses than<br/>\nI ever could have without the direct experience helping out at the farm.  <br/>\n<br/>\nNine months after getting the first horse we realized how much joy horses<br/>\nbrought to our lives and we found a way to add a second horse to our family<br/>\nby selling items we no longer used much and by keeping our older vehicles<br/>\nwhen they were paid off.<br/>\n<br/>\nI would urge you to brain storm even more ideas and find a way to make it<br/>\nwork for your daughter if at all possible.<br/>\n<br/>\nAngela<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a></div>","specialLinks":[]},{"userId":198283962,"authorName":"kazitetalibuse","from":"&quot;kazitetalibuse&quot; &lt;acudoc@...&gt;","profile":"kazitetalibuse","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"baffled II","postDate":"1140874018","msgId":112403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGR0cGx2MitwcGhhQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":112407,"prevInTime":112402,"nextInTime":112404,"topicId":112403,"numMessagesInTopic":0,"msgSnippet":"Here is another question on my mind. If my child wants something that my husband and I truly feel that we cannot afford (after much thinking and talking about","messageBody":"<div id=\"ygrps-yiv-746052913\">Here is another question on my mind.<br/>\n<br/>\nIf my child wants something that my husband and I truly feel that we<br/>\ncannot afford (after much thinking and talking about it together)--<br/>\nsuch as an expensive class and time commitment to drive her to a<br/>\ncertain class two times a week plus waiting time of several hours --<br/>\nis it against the principles of unschooling to make this decision<br/>\nwithout her and for her? <br/>\n<br/>\nI mean, we have already made the decision that it will not work for us<br/>\nfinancially or timewise. We would certainly try to explain and show<br/>\nher our thinking process, our financial situation, our priorities as<br/>\nto what fits into our schedule and what doesn&#39;t. We sympathize with<br/>\nher wish and we have always made all efforts to fulfill her wishes.<br/>\nShe has attended a wide variety of classes over the years. We usually<br/>\ngive her the choice of what we can handle (financilly and timewise) so<br/>\nthat she can prioritize her interests in different classes and choose<br/>\nthe ones she prefers. This time though we feel that this particular<br/>\nclass is beyond our means and abilities to manage other time commitments. <br/>\n<br/>\nI am looking for advice on how to handle the fact that we cannot<br/>\nafford it at the moment, not advice on how to figure out a way to<br/>\nafford it or how to manage our time better, if this makes sense. <br/>\n<br/>\nI am pretty good with brainstorming and looking at many different<br/>\noptions. I take my time and ask for advice. I visualize different<br/>\npossibilites and sit with them. I talk with my husband and kids,<br/>\nfriends, and I look for new ideas constantly. I am not afraid to<br/>\nchange my desisions if things are not working well. <br/>\n<br/>\nThis time I am, right or wrong, sure that we cannot afford this class<br/>\nwithout negative results to our finances and enjoyment of life due to<br/>\n  a time crunch. Is it against unschooling principles to look at my<br/>\nlife, decide that I cannot afford this class, and make this decision<br/>\nfor myself and therefore for my daughter? <br/>\n<br/>\nIf out of fear to upset her or disappoint her, I disregard my best (at<br/>\nthe moment) judgment and go ahead with the class, I would most likely<br/>\nend up feeling resentful of the financial situation this would put us<br/>\nin and the stress it would put on us due to the time crunch it would<br/>\nresult in. I wish it would not be so. The reality is that I would most<br/>\nlikely feel resentment. I am not the most &quot;together&quot; adult. I am<br/>\nlearning to handle difficult emotions better and to see my children&#39;s<br/>\nfeelings and wishes just as important as mine. I am learning to see<br/>\nthem as individuals worthy of respect. But it does not come to me<br/>\nnaturally. I know that in this situation I would feel resentment and<br/>\nhave a hard time hiding it. she would feel guilty for creating this<br/>\nsituation no matter how hard I would try to reassure her that it&#39;s not<br/>\nher fault, that I am just working on some difficult emotions and that<br/>\n it is my job, not hers, to deal with my feelings.<br/>\n<br/>\n<br/>\nI am learning a lot here. Thank you for letting me ask questions here.<br/>\nRenata</div>","specialLinks":[]}],"prevTopicId":112406,"nextTopicId":112415}}