{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Nicoletta Manns","from":"&quot;Nicoletta Manns&quot; &lt;snmanns@...&gt;","replyTo":"LIST","senderId":"1iF21hJ2QUp2EQbo2Br3MI_oNg0LleUR_IOswl0OmX2dd5ESLMrWZuVXcm8ozLKiU3NI9XEvYFWs0gLJV5TwZN2JcD5z6RufxIg6v565Jw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FW: MSAL - Maitland School of Advanced Learning","postDate":"985625035","msgId":17232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE1BQkJMUERKSUpQS0RERUxFSkZOQ0VFTkNEQUEuc25tYW5uc0BhdHRjYW5hZGEuY2E+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":17231,"nextInTime":17233,"topicId":17232,"numMessagesInTopic":0,"msgSnippet":"... From: Bill Ellis [mailto:tranet@rangeley.org] Sent: March 26, 2001 3:39 AM To: LearningCommunities Cc: PPSP-H@yahoogroups.com Subject:","messageBody":"<div id=\"ygrps-yiv-2003073103\">-----Original Message-----<br/>\nFrom: Bill Ellis [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tranet@...\">tranet@...</a>]<br/>\nSent: March 26, 2001 3:39 AM<br/>\nTo: LearningCommunities<br/>\nCc: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:PPSP-H@yahoogroups.com\">PPSP-H@yahoogroups.com</a><br/>\nSubject: [LearningCommunities] FYI<br/>\n<br/>\n<br/>\nIndex Projects Latest News Publications Links Email Co-Ordinator<br/>\nTable of Contents Study Groups About MSAL Email Webmaster<br/>\n<br/>\nWhat is MSAL?<br/>\n<br/>\nThe short answer: MSAL stands for Maitland School of Advanced Learning. It<br/>\nwas created in 1980 by rebellious thirteen year olds who could not stand to<br/>\ncontinue in traditional schools. It has evolved into an organization which<br/>\nis both an online alternative education organization and an experiment in<br/>\nhow to take full advantage of the information revolution.<br/>\n<br/>\nCharles ChampionMSAL Student & Founder <br/>\n<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.champgroup.com/MSAL/)\">http://www.champgroup.com/MSAL/)</a><br/>\n------------------------------------------------------------------------<br/>\n<br/>\n<br/>\nA more detailed overview of MSAL:<br/>\n<br/>\nMSAL is one of the few academic organizations in the world formed by<br/>\nstudents rather than by professional teachers or by institutions such as<br/>\ngovernments or churches. This has resulted in certain profound differences<br/>\nbetween MSAL and other organizations. A few key examples:<br/>\n(1) There are no teachers. Students learn from more advanced students or on<br/>\ntheir own.<br/>\n(2) There are no grades.<br/>\n(3) There are no attendance requirements.<br/>\n(4) There is no tuition.<br/>\n(5) There are no admission requirements.<br/>\n(6) There is no school building. MSAL operates on the internet and in the<br/>\nreal world, not isolated in classrooms.<br/>\n(7) There are MSAL students who are teenagers and others who are senior<br/>\ncitizens, and they come from around the world. They are not divided into<br/>\nclasses by age, race or religion but only by their own interests .<br/>\n<br/>\n------------------------------------------------------------------------<br/>\nAdditional information can be found in the two texts below. They detail the<br/>\nstory of the founding of MSAL, as well as MSAL&#39;s belief that the right of<br/>\nstudents to choose what they have to learn must be respected.<br/>\nQuestion Authority (1992) - <br/>\nThe HTML version is available here. Alternatively, download the original<br/>\ntext version here.<br/>\nThe MSAL Student Handbook 3rd Edition (1999)<br/>\nThe HTML version is available here. Alternatively, download the original<br/>\ntext version here.<br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.champgroup.com/MSAL/)\">http://www.champgroup.com/MSAL/)</a><br/>\n------------------------------------------------------------------------<br/>\n<br/>\nStudy Groups and Projects<br/>\n<br/>\nMSAL is not about grades or diplomas or degrees. It is about learning what<br/>\nyou want to learn, learning things you never imagined before and using that<br/>\nknowledge to carry out ambitious projects. Sometimes the projects are for<br/>\nfun. Sometimes projects are carried out to make a lot of money. Sometimes<br/>\nprojects are carried out to change the world.<br/>\nThere are two main forms of organization at MSAL. One is study groups which<br/>\nare simply groups of students informally learning about some particular<br/>\nsubject. The other is student projects. Projects are usually group efforts<br/>\nand typically attract students from more than one study group. Any student<br/>\nmay start a new study group or project, they are not part of any set<br/>\n&quot;curriculum&quot; decreed by the school.<br/>\n<br/>\n------------------------------------------------------------------------<br/>\n<br/>\nStudent Revolt and Information Revolution<br/>\nMSAL is still serving its original purpose of giving young people an<br/>\nalternative to the traditional school system. It is also striving to create<br/>\na new kind of future for its students.<br/>\n<br/>\nAmong college students, there is often an atmosphere of idealistic visions,<br/>\nof becoming aware of the wider world and the vast possibilities it holds.<br/>\nBut then comes graduation and the conventional wisdom is that you must at<br/>\nsome point leave school, get a job, settle into a routine existence and<br/>\nspend the rest of your life doing what someone tells you to do even if it is<br/>\nboring and has no great significance in the scheme of things.<br/>\nIt is becoming increasingly obvious that this is no longer a recipe for<br/>\nsuccess if it ever was. Success increasingly depends upon being able to<br/>\nconstantly learn new things and develop new products, new technologies and<br/>\nnew ways of doing business.<br/>\nThe ideals and visions of youth should not be abandoned. A sense of vision,<br/>\nan ability to see possibilities and effectively pursue them... this is what<br/>\nis needed to thrive when change is rapid and constant. Is there any reason<br/>\nto graduate and quit learning? On the contrary, we need that sense of<br/>\nyouthful idealism, those grand visions of the possible. We need lifelong<br/>\nlearning, not a degree. And we need it in the real world, not locked away in<br/>\na classroom somewhere, disconnected from everyone else.<br/>\nThe world is in the middle of a vast transformation which is sometimes<br/>\ncalled the &quot;information revolution.&quot; The most obvious result of this<br/>\nrevolution is to make available to us immense amounts of information and to<br/>\nquicken the pace of change.<br/>\nInformation is thrown at us in the form of junk mail, spam e-mail,<br/>\ntelemarketing and advertising of every kind. The pace of technological and<br/>\neconomic change is increasing and most individuals and organizations are not<br/>\nable to closely monitor the changes which affect them directly, much less<br/>\nthe changes which are longer term or indirect. Most people and organizations<br/>\ncan scarcely wade through the flood of information rushing at them, much<br/>\nless explore the oceans of information which are sitting out there on the<br/>\ninternet, but which are not part of the news announcements and<br/>\nadvertisements which grasp for our attention.<br/>\nModern library systems and the internet make it relatively easy, for the<br/>\nfirst time in human history, to access every bit of knowledge written down<br/>\nby the human race in the last 6,000 years and to access current information<br/>\non what is happening now in every part of the world.<br/>\nWho is fully using the potential of this global information network? There<br/>\nare trillions of dollars to be made from this, political upheavals waiting<br/>\nto happen, new frontiers which will be opened, and transformations of<br/>\nsociety which will occur because of the information revolution.<br/>\nIs there any government, any corporation, any charitable organization, any<br/>\nacademic organization, anyone at all who is putting to use the vast<br/>\npotential of the information revolution? No. There is not. Yet, the tools<br/>\nfor this revolution are available to anyone with a library card and internet<br/>\naccess.<br/>\nWhat is lacking is an understanding of how to set up an organization to<br/>\nprocess and act on such a vast amount of ever-changing information. For that<br/>\nmatter, there is a lack of understanding that this is a goal which<br/>\nindividuals and institutions should be working toward.  Yet the stakes could<br/>\nnot be higher.<br/>\nWhoever can create an organization which can effectively process ALL the<br/>\navailable information in the world, recognize the knowledge which is<br/>\nimportant, and act on it... whoever can do that first will have undreamt of<br/>\npossibilities before them.<br/>\nIf the chaotic mass of information which is now available can be<br/>\nassimilated, understood and used to guide the progress of mankind, it will<br/>\nbe a level of intelligence which has never existed before. No one has ever<br/>\nhad access to all the public information which exists, in real time, in a<br/>\nform which quickly and easily can be used to make informed decisions.<br/>\nEvery human being and every human organization in the world from<br/>\ncorporations to governments is stumbling through life without the benefit of<br/>\nthat knowledge. Life and death decisions affecting millions of people are<br/>\nbeing made based on an analysis of only one millionth of the available<br/>\ninformation simply because there is no way to assimilate it all. Whoever<br/>\nsolves that assimilation problem will transform civilization. It will be<br/>\nlike a blind man gaining sight for the first time. It will be like a<br/>\nsleepwalker awakening.<br/>\nHow much more money could be made, how much economic prosperity could be<br/>\nachieved, if business decisions had the benefit of most or all of the<br/>\nrelevant information? How much better would our government be if the voters<br/>\nhad most or all of the relevant information when they voted?<br/>\nWhat new technologies would be developed if scientists could know everything<br/>\nwhich was already known including things which had just been discovered<br/>\ntoday? Extended life spans, space colonization, utopian societies,<br/>\nunimagined prosperity, nanotechnology, understanding the workings of the<br/>\nhuman brain, genetic engineering... who knows what is possible with that<br/>\nkind of information processing capability?<br/>\n<br/>\nMSAL is trying to be such an organization, to be among the first of a new<br/>\ngeneration of human institutions, focused on the pursuit of knowledge and<br/>\nthe realization of the full potential of the information age.<br/>\n<br/>\nIndex Projects Latest News Publications Links Email Co-Ordinator<br/>\nTable of Contents Study Groups About MSAL Email Webmaster<br/>\n <br/>\n<br/>\n<br/>\nCommunity email addresses:<br/>\n  Post message: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LearningCommunities@onelist.com\">LearningCommunities@onelist.com</a><br/>\n  Subscribe:    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LearningCommunities-subscribe@onelist.com\">LearningCommunities-subscribe@onelist.com</a><br/>\n  Unsubscribe:  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LearningCommunities-unsubscribe@onelist.com\">LearningCommunities-unsubscribe@onelist.com</a><br/>\n  List owner:   <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:LearningCommunities-owner@onelist.com\">LearningCommunities-owner@onelist.com</a><br/>\n<br/>\nShortcut URL to this page:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com/community/LearningCommunities\">http://www.onelist.com/community/LearningCommunities</a><br/>\n<br/>\nYour use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a></div>","specialLinks":[]}],"prevTopicId":17210,"nextTopicId":17199}}