{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":92084939,"authorName":"Heidi &lt;bunsofaluminum60@hotmail.com&gt;","from":"&quot;Heidi &lt;bunsofaluminum60@...&gt;&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"What Robby learned from skiing...","postDate":"1044746349","msgId":58310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIyNDM5ZCtsNDNoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":58309,"nextInTime":58311,"topicId":58310,"numMessagesInTopic":0,"msgSnippet":"Hey We went skiing yesterday. First of all, did you know, it uses ARMPIT MUSCLES to ski? LOL As my aching body is reminding me today, eh? Well, my kids all","messageBody":"<div id=\"ygrps-yiv-1770572655\">Hey<br/>\n<br/>\nWe went skiing yesterday. First of all, did you know, it uses ARMPIT <br/>\nMUSCLES to ski? LOL As my aching body is reminding me today, eh?<br/>\n<br/>\nWell, my kids all fell down more than they skied, and my friend and <br/>\nher husband, who met us at Jackson Hole, were intent on giving them <br/>\ninstructions how to stand back up on skis: Parallel feet, <br/>\nperpendicular to the slope...and everyone was getting frustrated with <br/>\nRobby, because he couldn&#39;t get his skis right. Kept on saying &quot;I know!<br/>\nI know!&quot; and sitting there with his ski tips crossed, or his legs <br/>\nsplayed, skis pointing opposite directions.<br/>\n<br/>\nAnyway, when Katie plowed into me and knocked me over, I decided to <br/>\nlet my friends (more experienced skiers BY FAR) help my kids, and <br/>\nwent on a little ways to wait for my kids. By the time they caught up <br/>\nwith me, Katie&#39;s skis were off, and Robby was good at getting back <br/>\nup, but tired of falling all the time, so he took his skis off, too. <br/>\nWe ended the day with my kids dinking around in the bunny hill area, <br/>\nand I got a few more runs in.<br/>\n<br/>\nI could post my own frustrations about the ineptitude of the Jackson <br/>\nemployees who told me to take the kids on the slope for their very <br/>\nfirst ski experience. But I won&#39;t.<br/>\n<br/>\nThis morning, talking to my friend on the phone, I could hear her <br/>\nfrustration, because my kids weren&#39;t listening to her or her hubby. I <br/>\nshook my head in dismal agreement. Too bad they didn&#39;t listen. It <br/>\nmade me feel bad that my friends were so frustrated about my kids&#39; <br/>\nunteachability. EVen the ski instructor who tried to help at one <br/>\npoint, shook his head and skied away. <br/>\n<br/>\nSo, I began to think of ways to help Robby, especially, see the <br/>\nimportance of listening when someone is trying to tell him how to do <br/>\nsomething. I thought I&#39;d make the ski day into a lesson on Following <br/>\nInstructions, so I asked him about it. first of all, I was aware that <br/>\nhe had finally &quot;gotten it&quot; how to stand back up, so I asked him to <br/>\ndemonstrate the technique.<br/>\n<br/>\nhe showed me perfect form: parallel skis, squat, stand. So I <br/>\nsaid &quot;That&#39;s exactly what they were telling you to do! Were you <br/>\nlistening to them?&quot;<br/>\n<br/>\n&quot;Yeah, but I wanted to do it myself.&quot; hmmm. When I asked if their <br/>\ninstructions were helping or frustrating him, he said &quot;frustrating. I <br/>\nfigured it out okay.&quot; Everyone was frustrated: some, for having <br/>\ninstructions that they didn&#39;t think they needed, and some, for having <br/>\ntheir instructions not followed.<br/>\n<br/>\nNext time, it&#39;ll be bunny hill for the first hour, to learn <br/>\nsnowplowing and turning...and then maybe, the slope. And let him get <br/>\nhis butt off the snow his own self! And maybe we can still have that <br/>\ntalk about letting himself receive instruction from people who know <br/>\nwhat they&#39;re talking about.<br/>\n<br/>\nmy main lesson: Robby will figure it out for himself, just let him.<br/>\n<br/>\npeace, Heidi</div>","specialLinks":[]}],"prevTopicId":58297,"nextTopicId":58262}}