{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":90027250,"authorName":"Penne & Buddies","from":"&quot;Penne & Buddies&quot; &lt;crrbuddy@...&gt;","profile":"crrbuddy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: CPS Suggestions","postDate":"1114390731","msgId":105598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ0aGZjYitlMWppQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDUwNDIzMDQzNDQyLjQ4MjI5LnFtYWlsQHdlYjUxOTAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":105582,"nextInTopic":0,"prevInTime":105597,"nextInTime":105599,"topicId":105574,"numMessagesInTopic":0,"msgSnippet":"Katy, Don t bother with pouring your heart out to CPS; I m convinced that the majority of these people really don t care whether you re legit or not.  It s all","messageBody":"<div id=\"ygrps-yiv-1679985476\">Katy,<br/>\n<br/>\nDon&#39;t bother with pouring your heart out to CPS; I&#39;m convinced that <br/>\nthe majority of these people really don&#39;t care whether you&#39;re legit <br/>\nor not.  It&#39;s all about the money (foster care and adoption is big <br/>\nbusiness, as callous and unbelievable as that seems.)  I learned the <br/>\nhard way to stick to the facts and never discuss my personal <br/>\nbusiness without at least two friendly and knowledgeable witnesses <br/>\n(preferably, one being a reputable, private attorney) by my side.  <br/>\n<br/>\nThank God you made it to your son before they interviewed him <br/>\nwithout you there -- and no, they have absolutely no right to talk <br/>\nto _your_ child without your permission (nor to you) without legal <br/>\ncounsel.  The CPS agent declined to answer my request for <br/>\nrepresentation in front of a police officer (who also declined to <br/>\nacknowledge my rights) and after he departed, threatened to take the <br/>\nkids away if I didn&#39;t comply with her demand to interview us <br/>\nseparately.  I refused and after the interrogation, she ended up <br/>\ntaking them anyway (worst 48 hours of my life.) <br/>\n<br/>\nThis woman lied through her teeth to me (never had any official <br/>\npapers to snatch my kids in the first place) and to the judge at the <br/>\nhearing, but thankfully, we had a well-known lawyer representing us <br/>\nand our children were returned -- though not without their own tales <br/>\nof abuse and neglect at the foster home and shelter(!)  Little did I <br/>\nknow that we&#39;d have one of those homeschool horror stories of our <br/>\nown to tell someday.  But there&#39;s much, much more to this saga.  My <br/>\nbest advice is to turn all that fearful energy into pro-activism and <br/>\nkeep the faith that God will see you through this as he did our <br/>\nfamily.<br/>\n<br/>\nGreg Hession&#39;s MassOutrage is the best site I have ever found on the <br/>\nsubject of dealing with CPS/DCF/DSS, or so-called Child Protective <br/>\nServices by any other name:<br/>\n<br/>\nWhat to do if the DSS Comes to Your Door <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.massoutrage.com/dssatdoor.htm\">http://www.massoutrage.com/dssatdoor.htm</a><br/>\n<br/>\nHow to Fight False Allegations of Abuse and Neglect <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.massoutrage.com/dssfalseallegations.htm\">http://www.massoutrage.com/dssfalseallegations.htm</a><br/>\n<br/>\nDSS Dirty Tricks Series <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.massoutrage.com/dssdirtytricks.htm\">http://www.massoutrage.com/dssdirtytricks.htm</a><br/>\n<br/>\nVayan con Dios, Amigos ~</div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] CPS Suggestions","postDate":"1114286768","msgId":105582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyMDIyOTljNDk1ODNmZGRkNDdjMjhlOWJjYzgwODg4QGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDAwMjEwMWM1NDgzOSQ5YzZhYWUyMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDIwMDUwNDIzMDQzNDQyLjQ4MjI5LnFtYWlsQHdlYjUxOTAzLm1haWwueWFob28uY29tPiA8MDAyMTAxYzU0ODM5JDljNmFhZTIwJDYxMDFhOGMwQGxhdW5jaG1vZGVtLmNvbT4="},"prevInTopic":105581,"nextInTopic":105598,"prevInTime":105581,"nextInTime":105583,"topicId":105574,"numMessagesInTopic":0,"msgSnippet":"I ve  put some things into our files area, in a folder called CPS CONTACT. Katy - please read these carefully. They are written BY attorneys who are also","messageBody":"<div id=\"ygrps-yiv-979869176\">I&#39;ve  put some things into our files area, in a folder called &quot;CPS <br/>\nCONTACT.&quot;<br/>\n<br/>\nKaty - please read these carefully. They are written BY attorneys who <br/>\nare also homeschooling parents.<br/>\n<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] CPS Suggestions","postDate":"1114284071","msgId":105581,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjEwMWM1NDgzOSQ5YzZhYWUyMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PDIwMDUwNDIzMDQzNDQyLjQ4MjI5LnFtYWlsQHdlYjUxOTAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":105576,"nextInTopic":105582,"prevInTime":105580,"nextInTime":105582,"topicId":105574,"numMessagesInTopic":0,"msgSnippet":"Melinda, I was wondering if it would be okay for me to forward your email to my local homeschooling group? It was full of great advice. One of our members also","messageBody":"<div id=\"ygrps-yiv-1259808958\">Melinda,<br/>\n<br/>\nI was wondering if it would be okay for me to forward your email to my local<br/>\nhomeschooling group? It was full of great advice. One of our members also<br/>\nrecently had a run in with DCF here in FL. She too let them in out of fear.<br/>\nI have also always heard to never let anyone in you don&#39;t have to.<br/>\n<br/>\nAnyway, I would like to send your email on so that those who think it could<br/>\nnever happen to them can at least be aware of what to do if.<br/>\n<br/>\nMary B</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] CPS Suggestions","postDate":"1114268342","msgId":105576,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNi41YmI0YTRmZS4yZjliYmNiNkBhb2wuY29tPg=="},"prevInTopic":105574,"nextInTopic":105581,"prevInTime":105575,"nextInTime":105577,"topicId":105574,"numMessagesInTopic":0,"msgSnippet":"Melinda, Is there a webpage by any chance with advice gathered?  I ve saved  your response for the next time someone asks, but is there a place we could send","messageBody":"<div id=\"ygrps-yiv-1941857313\">Melinda, <br/>\n <br/>\nIs there a webpage by any chance with advice gathered?  I&#39;ve saved  your <br/>\nresponse for the next time someone asks, but is there a place we could send  them <br/>\nfor additional advice too?<br/>\n <br/>\nThanks.  I&#39;m really sorry it happened to you, and thanks for sharing  it here.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":61087048,"authorName":"Melinda","from":"Melinda &lt;melinda2u@...&gt;","profile":"melinda2u","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"CPS Suggestions","postDate":"1114230882","msgId":105574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNDIzMDQzNDQyLjQ4MjI5LnFtYWlsQHdlYjUxOTAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":105576,"prevInTime":105573,"nextInTime":105575,"topicId":105574,"numMessagesInTopic":0,"msgSnippet":"Dear Katy, An unschooling friend asked me to reply to your post. I went through what you are now experiencing 4 years ago. I was leaving to take my oldest to a","messageBody":"<div id=\"ygrps-yiv-1525712955\">Dear Katy,<br/>\n<br/>\nAn unschooling friend asked me to reply to your post.<br/>\n<br/>\nI went through what you are now experiencing 4 years<br/>\nago.  <br/>\n<br/>\nI was leaving to take my oldest to a friend&#39;s house<br/>\nwhen 2 young women drove up and confronted me in the<br/>\nfront yard.<br/>\n<br/>\nI won&#39;t go into the details, except to say that it was<br/>\na family member, on my side, that made the report. <br/>\n<br/>\nCPS gets a lot of these types of erroneous reports, so<br/>\nif that&#39;s what happened in your case, it  wouldn&#39;t<br/>\nsurprise me.  <br/>\n<br/>\nIt&#39;s very Sad, but some people would rather betray you<br/>\nand endanger your children and family than accept the<br/>\nfact that you have chosen a path different from<br/>\ntheirs.<br/>\n<br/>\nBack to The Subject.  If you consult with persons who<br/>\nhave been through this before, or lawyers that<br/>\nrepresent homeschool families, they will tell you in<br/>\nno uncertain terms:  DO NOT EVER invite CPS into your<br/>\nhome.   Never ever.<br/>\n<br/>\nNEVER.<br/>\n<br/>\nRight now, you are upset, confused, dismayed, feeling<br/>\nbetrayed, frightened, vulnerable and threatened.<br/>\n<br/>\nI know.  I have been there. <br/>\n<br/>\nI don&#39;t want my Insistent Advice to further disturb<br/>\nyou.  It&#39;s not my intention to add insult to injury<br/>\n<br/>\nIt IS my intention to give you the Best, hard earned,<br/>\nsolid and sound advice available.  I know it is<br/>\nbecause I spent an entire week researching, e-mailing<br/>\nand calling,(all over the country), those in the know.<br/>\n What I got was a Unanimous call for Not Allowing CPS<br/>\nin my door.<br/>\n<br/>\nI did not, at the time.  I had heard it mentioned<br/>\ncasually online, so I used that advice.  The worker<br/>\nthreatened to come back with the police and enter my<br/>\nhome against my will, if that&#39;s what it took to<br/>\ninterview each of my children -Alone- in our home.<br/>\n<br/>\nBefore my research, I called her office and arranged<br/>\nfor her to come to my house a few days later.  After<br/>\nmy research, I canceled that arrangement.<br/>\n<br/>\nWhere you live is important.  Where are you?  That is<br/>\na consideration.<br/>\n<br/>\nHowever, in most states, CPS is not the regulatory<br/>\nagency for homeschoolers.   If you are legal, then you<br/>\nneed to assemble all the documents that prove your<br/>\nlegality.  Get copies of everything the law requires.<br/>\n<br/>\n(In my state, SC, all that must be shown to prove<br/>\nlegality is an Association membership.  They got a<br/>\ncopy of my certificate.  Nothing else.)<br/>\n<br/>\nSecondly, &quot;messy house&quot; is NOT Criminal.  It was on my<br/>\nreport too : &quot;physical neglect&quot; was the check box<br/>\nmarked.   It was only after the case was  resolved<br/>\nthat the worker admitted that wasn&#39;t applicable to<br/>\n&quot;dishes in the sink&quot; and &quot;undone laundry&quot;, which was<br/>\nall the complainant asserted.  An &quot;office worker<br/>\nerred&quot; in checking that item.  <br/>\n<br/>\nNone the less,  I took all 4 of my children to my<br/>\nnurse practitioner and had her give them complete<br/>\nphysicals to refute their being &quot;neglected&quot;.  Your<br/>\ndoing the same wouldn&#39;t be  a bad idea as a<br/>\ncomprehensive refutation of the &quot;bad mother&quot; image.<br/>\n<br/>\nCPS has no ability to evaluate educational programs. <br/>\nThat is not their job. Furthermore, they do not want<br/>\nit.  They have too many cases of Real Abuse that keep<br/>\nthem busy every day.  So, it is Your Job to help them<br/>\ncomplete their mandatory &quot;investigation&quot;  and be on<br/>\ntheir merry way to save the children who are in really<br/>\nscary life-threatening situations.<br/>\n<br/>\nOnce you have your documents:  proof of legal<br/>\ncompliance certification- whatever that is in your<br/>\nstat, a physical, proving that your child is well<br/>\ncared for and whatever highest diploma you hold, (if<br/>\nit&#39;s required in your state),  xerox&#39;d all nice and<br/>\nneat and tucked into a manila envelope, take them to<br/>\nyour worker&#39;s office and hand deliver them to her.  <br/>\n<br/>\nDo it face-to-face.  Inform her, very kindly,<br/>\npleasantly and with the parental authority that is<br/>\nyours, that you discovered that you do not need to<br/>\nreplicate your reporting to CPS in order to fulfill<br/>\nyour state&#39;s homeschool requirements.  But, since you<br/>\nknow she&#39;s required to investigate even the most<br/>\nfrivolous claims, that you have assembled all the<br/>\ndocuments that she should need to complete her<br/>\npaperwork.<br/>\n<br/>\nAt that point, there is precious little that she can<br/>\ndo besides closing the case.  No judge will issue a<br/>\nwarrant with the documents in front of him that you<br/>\nhave supplied- and she Must present them to him if she<br/>\ndecides to pursue invading your home, without your<br/>\nconsent.<br/>\n<br/>\nAdditionally, as workers are Required to remove<br/>\nchildren from &quot;imminent danger&quot;, you have already<br/>\npassed that test.  She was in your home and left<br/>\nwithout your child, so she gave you her stamp of<br/>\napproval so far as your home not being beyond the<br/>\n&quot;normal house with children&quot; messy.<br/>\n<br/>\nThis Should end the investigation.<br/>\n<br/>\nBtw, do you have a copy of the report?  CPS is<br/>\nRequired by law to give it to you- minus the name of<br/>\nthe reporting individual.  They do not always offer<br/>\nit.  It took us over a week to get a copy, as the<br/>\nworker knew we did not know the law in the beginning.<br/>\n<br/>\nThat is how I discovered who&#39;d made the report- no one<br/>\nI knew- but my crazy family- would refer to me the way<br/>\nthat the &quot;reporting individual&quot; did.<br/>\n<br/>\nIt may offer clues as to who has behaved so<br/>\negregiously toward your family.  They tend to quote<br/>\nthe person who called it in.<br/>\n<br/>\nPlease, please, please Katy, DO NOT let any government<br/>\nofficial into your home, unless they have a warrant.<br/>\n<br/>\nIn doing so, you give up a constitutional right that<br/>\ncannot be reclaimed afterward.  You passed the first<br/>\ntime.  If she comes back and sees something that<br/>\nbothers her or hears something that she doesn&#39;t<br/>\nunderstand, you could find yourself watching your<br/>\nchild leave with a social worker.<br/>\n<br/>\nI am not an alarmist, but there are cases of exactly<br/>\nthat happening all over the country.  Since my<br/>\nexperience, I have subscribed to several national<br/>\nlegal homeschooler lists.  It does happen to Good<br/>\nPeople.  The best way to avoid it is to not make<br/>\nyourself vulnerable by letting them in the door.<br/>\n<br/>\nPlease post your result when you are up to writing<br/>\nabout it.  This is a traumatic experience that you<br/>\nwill have to deal with emotionally.  Following the<br/>\nproper steps will assure that it ends well for you and<br/>\nyours.<br/>\n<br/>\nPlease feel free to email me off-list and I will give<br/>\nyou my ph #, if you&#39;d like an empathetic ear.<br/>\n<br/>\nFor eveyone who&#39;s reading this now and breathing a big<br/>\nsigh of relief because you know it could never happen<br/>\nto you, don&#39;t be so sure.  I was as shocked as anyone<br/>\nwould be.  After all, I&#39;d been a member of an electic<br/>\ngroup, was a charter member of  another and <br/>\nco-founder of a state- wide unschoolers group.  <br/>\n<br/>\nJust remember, NEVER LET THEM IN YOUR HOME.  Even as<br/>\nrare as it may be in your area, that is the first<br/>\naction that every wrongly-reported parent takes before<br/>\ntheir child and their family is forever traumatized by<br/>\nCPS removing a child from the home.<br/>\n<br/>\nGood Luck.<br/>\n<br/>\nMelinda Nolan,<br/>\nco-founder School&#39;s Out Support,<br/>\n(unschooler&#39;s group)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/schoolsoutsupport/\">http://groups.yahoo.com/group/schoolsoutsupport/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:melinda2u@...\">melinda2u@...</a><br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nTired of spam?  Yahoo! Mail has the best spam protection around <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mail.yahoo.com\">http://mail.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":105597,"nextTopicId":105283}}