{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":117801964,"authorName":"Todd M.","from":"&quot;Todd M.&quot; &lt;Ozarkren@...&gt;","profile":"trozark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Education As Life","postDate":"1034115548","msgId":45807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4xLjYuMi4yMDAyMTAwODE3MTcxOC4wMDlmMjFjMEBlZGlzb24ucmlwaW50ZXJuZXQuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":45806,"nextInTime":45808,"topicId":45807,"numMessagesInTopic":0,"msgSnippet":"Education As Life by Donna M. De Poalo http://educationalfreedom.com/pages/editorials/ddepoalo_102002.html Those of you familiar with my writing know that most","messageBody":"<div id=\"ygrps-yiv-83362960\">Education As Life<br/>\nby Donna M. De Poalo<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://educationalfreedom.com/pages/editorials/ddepoalo_102002.html\">http://educationalfreedom.com/pages/editorials/ddepoalo_102002.html</a><br/>\n<br/>\nThose of you familiar with my writing know that most of the time I tend to <br/>\nfocus on the political side of education. I often hesitate to focus on the <br/>\nthings we do that would actually fall under the &quot;homeschooling experience&quot; <br/>\nlabel for a couple of reasons. As my daughter grows older it is <br/>\nincreasingly difficult, if not impossible, to make a distinction between <br/>\nher education and her life. I have also found it rare for one method or <br/>\nresource to work the same for all children and families thus I am hesitant <br/>\nto suggest that one book or another would be a good one for you.<br/>\n<br/>\nToday I would like to talk about this concept of education as a part of <br/>\nlife. Sometimes when I describe my daughter&#39;s education as being another <br/>\naspect of life, it is interpreted to mean that we simply wait for things to <br/>\nhappen that can be classified as educational. In fact, many times in <br/>\ndiscussions with home educators -- and I am sure you have witnessed this -- <br/>\nindividuals will attempt to prove how various life skills can be &quot;counted <br/>\nas school&quot;. This is especially true when a parent new to homeschooling <br/>\nexpresses concerns regarding the ability to insure their child receives a <br/>\ncomprehensive education.<br/>\n<br/>\nBut in the rush to reassure and calm the fears, an important point is <br/>\nmissed completely and a great disservice is done to the individual <br/>\nexpressing concern. The choice to educate a child at home generally means <br/>\nthat for one reason or another the school idea did not work for the child. <br/>\nSince it did not work, it makes little sense to replicate any part of the <br/>\nschool system. Many times it is assumed that as long as you don&#39;t set up a <br/>\nclassroom in your home and follow a rigid schedule you have successfully <br/>\navoided following the school model. However, I would suggest that as long <br/>\nas we are justifying any activity by drawing comparison to the school model <br/>\nof education we aren&#39;t doing a very good job at getting away from the <br/>\nschool mentality.<br/>\n<br/>\nI think you will agree that there are a wide variety of skills that are <br/>\nnecessary or important to our children before they go off on their own. <br/>\nMany times the acquisition of these skills would not require formal <br/>\ncurriculum or even books, but rather are learned through and by actual <br/>\nexperience. Often we will &quot;teach&quot; skills and impart knowledge to our <br/>\nchildren without lesson plans and in a very natural way as the child needs <br/>\nor shows an interest in a particular area or topic. In our home, cooking is <br/>\na good example of this.<br/>\n<br/>\nMy daughter has helped me in the kitchen in one way or another since she <br/>\nwas only nine months old. She is almost ten now and capable of preparing <br/>\nmany things, and for the most part with little assistance. Since I have <br/>\nalways enjoyed cooking, I am very pleased that my daughter also enjoys it, <br/>\nand look forward to many years of baking scrumptious things together. This <br/>\nlearning has been and will continue to be accomplished as a part of life; <br/>\nhowever, I do not think of cooking in terms of school. I don&#39;t describe the <br/>\nvarious activities I participate in as &quot;educational&quot;, nor do I justify the <br/>\ntime my daughter spends cooking by categorizing it by subject such as <br/>\nscience, math and/or reading which then can &quot;count as school&quot;.<br/>\n<br/>\nAnother problem with the reassurances that living life may be counted as <br/>\nschool is that often this is presented as being enough for all children. <br/>\nReassurances often include some form of the statement that &quot;children learn <br/>\nwhat they need to learn when they need to learn it&quot;. I do not dispute this <br/>\nstatement, and in fact, am quite supportive of this point of view. However, <br/>\nrelying only upon this leaves out those things that, as parents, we may <br/>\nfeel are necessary and important. I often say that educating a child is <br/>\nsimply another aspect of raising him and there will be times, even in <br/>\neducation, when you may require your child to do things they would not <br/>\nchoose on their own. Let me clarify that I am not advocating creating an <br/>\nenvironment where the child is being forced to &quot;learn&quot;, which I believe is <br/>\nimpossible anyway. However, there will be topics that you as a parent will <br/>\nconsider a necessary part of your child&#39;s education. For example, it is <br/>\nimportant to me that my daughter read good books. I do not subscribe to the <br/>\nbelief that reading is good regardless of the quality and content of the <br/>\nmaterial. As a result, there are books I will not purchase and I carefully <br/>\nselect reading material for her. I do not assign reading nor do I tell her <br/>\nwhen, where, and how she should read. I simply provide the materials that I <br/>\napprove of and don&#39;t buy the ones that fall short of my criteria. Some <br/>\nbooks I purchase may sit on our shelves for as long as six months before <br/>\nshe becomes interested; others never quite make it to the bookshelf at all.<br/>\n<br/>\nEducation is one aspect of raising our children. I believe that the <br/>\nlanguage we use to express our ideas regarding life with our children and <br/>\nparenting decisions, and every nuance of that language, warrants careful <br/>\nexamination so that it will reflect our beliefs as accurately as possible. <br/>\nAs parents who have chosen to accept and exercise completely our <br/>\nresponsibilities toward our children, it is important that the words used <br/>\ndo not imply guidance from or validation of the school model. Our children <br/>\nare not in school, and there is no reason to categorize their activities <br/>\naccording to school-defined and determined terms. You, the parent, must <br/>\ndefine a child&#39;s education, determined by what you believe is important. <br/>\nAnd most definitely_not_according to what can be &quot;counted&quot; as school.<br/>\n<br/>\n©Donna M. De Poalo<br/>\nOctober 2002<br/>\n<br/>\n<br/>\n---------------------------------------------------------------<br/>\n&quot;Respect the child. Be not too much his parent. Trespass not on his solitude.&quot;<br/>\n-Ralph Waldo Emerson</div>","specialLinks":[]}],"prevTopicId":45802,"nextTopicId":45705}}