{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Just starting out on the unschooling journey","postDate":"1263864806","msgId":49714,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFBNjhCQzY3RjkxQTRFMTQ5NDVDNDlCMDZEOTUwNDY2QEVkUEM+","inReplyToHeader":"PEM0MkIyRDAxLUM1ODEtNDVDOC04NjBFLTY0NDhERTFFMDI0OEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PGhqMTd2cCtncnZwQGVHcm91cHMuY29tPiA8QzQyQjJEMDEtQzU4MS00NUM4LTg2MEUtNjQ0OERFMUUwMjQ4QFNhbmRyYURvZGQuY29tPg=="},"prevInTopic":49697,"nextInTopic":0,"prevInTime":49713,"nextInTime":49715,"topicId":49681,"numMessagesInTopic":0,"msgSnippet":"We pulled our son out mid 3rd grade - like silly people we made the decision about a month before that and chose to not have him go back after Christmas","messageBody":"<div id=\"ygrps-yiv-665974201\">We pulled our son out mid 3rd grade - like silly people we made the decision about a month before that and chose to not have him go back after Christmas vacation - duh - what was one more month? - what was the purpose when we knew he was miserable???  Silly us - guess it seemed like a good stopping point at the time.  Well we should have stopped the misery at once - and our son was very miserable.  YES looking back I really wonder what we were thinking - obviously not that we were torturing our son for another month.  I think if someone would have simply of put it to us like that we would have laughed at ourselves and never sent him back again.  BUT we had to prepare  ;)  had not heard of unschooling until after we were doing it on our own so that was probably a factor, searched like crazy for a local support group, etc.  After we were convinced we could do this and had been on our own for a while THEN we found this thing called unschooling and a support group.<br/>\n<br/>\nYour son will not turn out to be a quitter - our son is 15 now and sticks with a lot of things (quits some things too and that&#39;s OK because all humans do - actually it&#39;s good to know WHEN to quit something - why continue a bad thing?)  anyway - he&#39;s had this job working at a pet store on Mondays cleaning for almost a year but about 2 months ago they decided not to have him work (down economy) and told him to call in on Sundays to see if he was on the schedule - it&#39;s been two months and he faithfully calls every Sunday - he said he is not going to be the one to quit!!!<br/>\n<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   -=-I don&#39;t know if the third is coming home during this school year or <br/>\n  when it&#39;s over. My husband wants him to finish 5th grade. He wants to <br/>\n  come home now.-=-<br/>\n<br/>\n  No one has ever said, after they were established unschoolers, &quot;I&#39;m <br/>\n  so glad the kid finished the school year!&quot; Many have said &quot;I can&#39;t <br/>\n  believe I didn&#39;t take him out of school that day.&quot;<br/>\n<br/>\n  Sandra<br/>\n  .<br/>\n   <br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Just starting out on the unschooling journey","postDate":"1263850339","msgId":49697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM0MkIyRDAxLUM1ODEtNDVDOC04NjBFLTY0NDhERTFFMDI0OEBTYW5kcmFEb2RkLmNvbT4=","inReplyToHeader":"PGhqMTd2cCtncnZwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqMTd2cCtncnZwQGVHcm91cHMuY29tPg=="},"prevInTopic":49686,"nextInTopic":49714,"prevInTime":49696,"nextInTime":49698,"topicId":49681,"numMessagesInTopic":0,"msgSnippet":"-=- It is O.K. to treat your children with as much respect as would a friend (and that is often a good benchmark!).-=- Right.  Would he have given a houseguest","messageBody":"<div id=\"ygrps-yiv-1704017240\">-=- It is O.K. to treat your children with as much respect as would a  <br/>\nfriend (and that is often a good benchmark!).-=-<br/>\n<br/>\nRight.  Would he have given a houseguest no choice about going with  <br/>\nhim to walk the dog?  And yet a houseguest might really have wanted to  <br/>\ngo, too.<br/>\n<br/>\n-=-I don&#39;t know if the third is coming home during this school year or  <br/>\nwhen it&#39;s over. My husband wants him to finish 5th grade. He wants to  <br/>\ncome home now.-=-<br/>\n<br/>\nNo one has ever said, after they were established unschoolers,  &quot;I&#39;m  <br/>\nso glad the kid finished the school year!&quot;   Many have said &quot;I can&#39;t  <br/>\nbelieve I didn&#39;t take him out of school that day.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Just starting out on the unschooling journey","postDate":"1263805241","msgId":49686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqMTd2cCtncnZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqMGM3cis1aDdxQGVHcm91cHMuY29tPg=="},"prevInTopic":49681,"nextInTopic":49697,"prevInTime":49685,"nextInTime":49687,"topicId":49681,"numMessagesInTopic":0,"msgSnippet":"An adult will go with them, but one of the children is responsible for holding the leash and picking up after her. ... Excellent change!  Families shouldn t","messageBody":"<div id=\"ygrps-yiv-1974817051\">An adult will go with them, but one of the children is responsible for holding the leash and picking up after her. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I&#39;m changing this now. <br/>\n<br/>\n </span></blockquote>Excellent change!  Families shouldn&#39;t get pets with the expectation that children be responsible for them.  It&#39;s a huge mistake that people make because they think that &quot;pets will teach kids responsibility&quot; and then decide how it needs to look for kids to learn, or develop responsibility.  Many long-time unschoolers on this list, myself included, have figured out that kids will learn from how they are treated.  They learn responsibility by how we as parents care for them, care for pets, care for others in our lives, handle our own responsibilities, etc.  You do not need to instill responsibility in a person--you allow it to bloom and flourish in its own time.<br/>\n<br/>\n&quot;I ask the children who wants to come with me walking the dog. They will usually say no. But yesterday, because I gave my son a choice, he replied that he would have if he wasn&#39;t too busy playing with his bionicles. It made me happy, and I told him how I felt, and that it was ok that he played.&quot;<br/>\n<br/>\nHow very nice and respectful of you!!<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &quot;This morning though, when my husband asked the kids if they wanted to come with him, they all said no because they were deep into their video games and tv. He said ok. Then after thinking about it, he decided that it wasn&#39;t ok after all and told them to get dressed and come with him. No choice after all. They went to the park for an hour and had a lot of fun.&quot;<br/>\n&gt; <br/>\n&gt; &quot;My husband reasoned that he was right to enforce this, since they ended up having a great time at the park. They got fresh air and exercise, as well as doing a daily chore. He did not regret his choice of action.&quot;<br/>\n&gt; <br/>\n&gt; &quot;My reaction is that I didn&#39;t like that he used control by forcing them, giving them no choice. That&#39;s what we&#39;re trying to move away from. I&#39;m happy they had a good time, but it kind of started wrong. &quot;<br/>\n<br/>\n </span></blockquote>Your gut feeling is right--he gave them choice and then took it away.  It will take longer for them to trust that they really do have choice if he decides to give it back.  They will test to see if they really have it.  They will react, for a time, instead of acting while they figure out the lay of the land.  <br/>\n<br/>\nThe happy ending could have happened as a result of many possibilities--not just the path he chose.  He could have walked the dog, come back and found the kids ready for something new.  He could have seen if anyone wanted to go in 15 minutes, and then made a deal for that.  He could have made choices that demonstrated respect for how they were choosing to learn in that moment.<br/>\n<br/>\nWhat he did confirmed that big people are smarter and more knowledgeable than littler people are about how they should spend their time, and that their time is limited by someone else&#39;s ideas about the value of what they are doing.<br/>\n <br/>\nIt sounds like your husband still has a pretty strong notion that the kids can do what they like, but mom and dad always know what&#39;s best for them in the end.  Imho, it&#39;s a dangerous thought to think that we always know what&#39;s best for our kids--and just downright wrong.  We don&#39;t.  And I don&#39;t think we should pretend that we do, because it takes away any real sense of choice and decision making about their own lives.  It all becomes a test--if you do what I think is right, then you got the right answer.<br/>\n<br/>\nHe doesn&#39;t see why what he did was a problem, because it all turned out o.k., but he also doesn&#39;t know what things would have looked like, in a very profound sense, if he had just walked the dog on his own and let the children continue their game.  A trade-off was made, and that should be recognized.  He had his way, things ended well, but at what ultimate price?<br/>\n<br/>\nAnd, fyi, what I&#39;ve said is about ideas--there is no implication that your husband isn&#39;t doing his best or doesn&#39;t love his children, but we&#39;ve all been raised in a culture that has some pretty definite, and destructive, ideas about the kind of relationship we are supposed to have with our kids &quot;for their own good,&quot; and we are not only questioning those beliefs, but are living very different ones.  It is O.K. to treat your children with as much respect as would a friend (and that is often a good benchmark!).<br/>\n<br/>\nIt does take practice, and questioning, and making mistakes and learning to get this very different way of connecting with our kids.  They payoff is huge, though, in terms of real connection rather than the pale, watery version that most people with kids in school (conventional parenting) are used to.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":139171607,"authorName":"kaclip","from":"&quot;kaclip&quot; &lt;katrine@...&gt;","profile":"kaclip","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Just starting out on the unschooling journey","postDate":"1263776827","msgId":49681,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqMGM3cis1aDdxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49686,"prevInTime":49680,"nextInTime":49682,"topicId":49681,"numMessagesInTopic":0,"msgSnippet":"My husband and I are learning about the unschooling way of life. This list has provided lots of great reading for me, and I m sharing much of it with my","messageBody":"<div id=\"ygrps-yiv-992880781\">My husband and I are learning about the unschooling way of life. This list has provided lots of great reading for me, and I&#39;m sharing much of it with my husband. We still have so much to learn though. Something happened today that I&#39;m not sure what to do with.<br/>\n<br/>\nWe have a dog that we walk twice a day. The children (8 and 10) take part in this. So far, they haven&#39;t really had a choice. I have mostly done the morning walk and the kids will take turn being responsible for the afternoon walk. They almost always protest, saying it&#39;s not my turn, and I don&#39;t want to go. They have been made to go anyway. We&#39;ve reasoned that it&#39;s our family&#39;s dog and we love her and this is something we are all responsible for doing for her. An adult will go with them, but one of the children is responsible for holding the leash and picking up after her. <br/>\n<br/>\nI&#39;m changing this now. I ask the children who wants to come with me walking the dog. They will usually say no. But yesterday, because I gave my son a choice, he replied that he would have if he wasn&#39;t too busy playing with his bionicles. It made me happy, and I told him how I felt, and that it was ok that he played.<br/>\n<br/>\nThis morning though, when my husband asked the kids if they wanted to come with him, they all said no because they were deep into their video games and tv. He said ok. Then after thinking about it, he decided that it wasn&#39;t ok after all and told them to get dressed and come with him. No choice after all. They went to the park for an hour and had a lot of fun.<br/>\n<br/>\nMy husband reasoned that he was right to enforce this, since they ended up having a great time at the park. They got fresh air and exercise, as well as doing a daily chore. He did not regret his choice of action.<br/>\n<br/>\nMy reaction is that I didn&#39;t like that he used control by forcing them, giving them no choice. That&#39;s what we&#39;re trying to move away from. I&#39;m happy they had a good time, but it kind of started wrong. <br/>\n<br/>\nI don&#39;t know how to formulate my thoughts into words. I still only have a &quot;feeling&quot; for unschooling, and lots and lots of impressions and thoughts and ideas from books and lists. Unschooling is still a bit vague and hard to describe and live. My husband is so supportive and trying to understand these concepts with me. It&#39;s a leap of faith for him, he&#39;s trusting me a lot because he knows I only want to do the best for our family. And unschooling feels so right!<br/>\n<br/>\nWe still have a way to go in our unschooling journey. This is coming very fast into our lives. We starting homeschooling two of our three kids only two months ago, I don&#39;t know if the third is coming home during this school year or when it&#39;s over. My husband wants him to finish 5th grade. He wants to come home now. It&#39;s a lot happening in a short time and it&#39;s not easy for my husband who&#39;s away most of the day to follow my/our development.<br/>\n<br/>\nThanks!<br/>\nKatrine</div>","specialLinks":[]}],"prevTopicId":49375,"nextTopicId":49690}}