{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Kids at Parkday","postDate":"1046627878","msgId":12711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwQzRFOTA1LTRDRDgtMTFENy05QTE5LTAwMDM5M0FGNUEyRUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDgyNTMwMTEuMTA0NjYxNjYyMjEyMi5KYXZhTWFpbC5ub2JvZHlAYmlnYmlyZC5wc3AucGFzLmVhcnRobGluay5uZXQ+"},"prevInTopic":12708,"nextInTopic":0,"prevInTime":12710,"nextInTime":12712,"topicId":12663,"numMessagesInTopic":0,"msgSnippet":"Mary, Have you read The Explosive Child yet? I really think it ll give you some ways to work with Riley and YOU will not be so frustrated when you have a","messageBody":"<div id=\"ygrps-yiv-1831145766\">Mary,<br/>\n<br/>\nHave you read &quot;The Explosive Child&quot; yet? I really think it&#39;ll give you <br/>\nsome ways to work with Riley and YOU will not be so frustrated when you <br/>\nhave a little more clarity and a &quot;plan&quot; in mind for what to do to help <br/>\nhim.<br/>\n<br/>\nAnother thing is that you sound like you&#39;re on the road to accepting <br/>\nhim as he is - which is a good thing because you&#39;re probably NOT going <br/>\nto change his personality and he is probably always going to be an <br/>\nexplosive type of person. What you want to do is not &quot;change&quot; his <br/>\npersonality, but help him develop self-control and self-direction for <br/>\nhis intensity.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sunday, March 2, 2003, at 06:50 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a> wrote:<br/>\n<br/>\n&gt;  I&#39;m at a frustration level, though, cuz my kid blows up. He doesn&#39;t <br/>\n&gt; always have impulse control and has hit/kicked/stepped on other <br/>\n&gt; people. And I can sense he is being labelled, throw aside as a <br/>\n&gt; valuable person because of his temper. I&#39;m probably helping label him <br/>\n&gt; because I ask my friends for ways to cope/handle his outbursts. So I&#39;m <br/>\n&gt; aslo keeping in mind ways I can talk great about him. Also remebering <br/>\n&gt; that what other people think does not matter. Riley does matter. </span></blockquote></div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","profile":"mfhickman95616","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Kids at Parkday","postDate":"1046616638","msgId":12708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyNTMwMTEuMTA0NjYxNjYyMjEyMi5KYXZhTWFpbC5ub2JvZHlAYmlnYmlyZC5wc3AucGFzLmVhcnRobGluay5uZXQ+"},"prevInTopic":12697,"nextInTopic":12711,"prevInTime":12707,"nextInTime":12709,"topicId":12663,"numMessagesInTopic":0,"msgSnippet":"Hi, Deb you are right on when you mention Riley was overstimulated, which I can help with. We had 1 more spot to go, pick up his big sis at dance class. We","messageBody":"<div id=\"ygrps-yiv-53193887\">Hi,<br/>\n<br/>\nDeb you are right on when you mention Riley was overstimulated, which I can help with. We had 1 more spot to go, pick up his big sis at dance class. We could have gone home, or the library. I gave Riley the choice. Next time I&#39;ll encourage something less stimulating. He had just had surgery and I think he wanted to show his friends his stitchey smile. Really these are small deals in a  wonderful day. I&#39;m at a frustration level, though, cuz my kid blows up. He doesn&#39;t always have impulse control and has hit/kicked/stepped on other people. And I can sense he is being labelled, throw aside as a valuable person because of his temper. I&#39;m probably helping label him because I ask my friends for ways to cope/handle his outbursts. So I&#39;m aslo keeping in mind ways I can talk great about him. Also remebering that what other people think does not matter. Riley does matter.<br/>\n<br/>\nRiley saved $100.00 and bought a gameboy and a game. Had I never found this list I bet I would have forbid him such an evil devise. He bought it, he owns it, and is saving again for his next purchase. He asked how many pennies it would cost to buy a $70.00 item. We told him 7000. He said he would save dollars then because it will only be 70 dollars.</div>","specialLinks":[]},{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning]Kids at Parkday","postDate":"1046554025","msgId":12697,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMzAxMjEyNzA1LjY4OTQzLnFtYWlsQHdlYjEzNzAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNDY1NDE0NjcuMjM0Mi42NjA1Lm00QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":12675,"nextInTopic":12708,"prevInTime":12696,"nextInTime":12698,"topicId":12663,"numMessagesInTopic":0,"msgSnippet":"... Sounds perfectly normal to this mom of 2 boys (5 and 6) also.  They were getting downright managable in restaurants last summer, then this year they both","messageBody":"<div id=\"ygrps-yiv-878710808\"><blockquote><span title=\"ireply\">&gt;I hope it&#39;s slightly reassuring to know that your son<br/>\n&gt;sounds perfectly normal to me!<br/>\n&gt;brenda<br/>\n<br/>\n </span></blockquote>Sounds perfectly normal to this mom of 2 boys (5 and<br/>\n6) also.  They were getting downright managable in<br/>\nrestaurants last summer, then this year they both went<br/>\nbonkers and I can&#39;t take them anywhere.  I figure they<br/>\nare doing some internal growing that takes up so much<br/>\nenergy that there is just not enough left to be polite<br/>\nand patient and civil all the time.  It leaves them<br/>\nkind of manic and with attention jack-knifing from one<br/>\nthing to another, and grumpy often.  Particularly my 6<br/>\nyear old.<br/>\n<br/>\nI also agree that your schedule sounds really<br/>\ndemanding.  My boys and I stay home most of the time<br/>\nand just enjoy each other, play outside (or play<br/>\naround me while I work on our land.)  When we go into<br/>\ntown to go grocery shopping once a week, we also go to<br/>\nthe park or the beach for an hour or two and maybe get<br/>\na bite to eat.  We are not in a hurry and don&#39;t rush<br/>\nfrom engagement to engagement.  (yech)  Sometimes<br/>\nwe&#39;ll just stay home by the fire and not do much.  I<br/>\nimagine that as they get older they will have more<br/>\ninterests outside of home and desires to go and do<br/>\nthings.  But right now they are content to stay home a<br/>\nlot, so we do.  I don&#39;t think many kids this age need<br/>\na passle of friends (except the exceptionally<br/>\ngregarious.)  One or three good pals is probably more<br/>\nthan enough, and likely not all at once either.<br/>\n<br/>\nFriends come out here to stay for a day or a week,<br/>\nwith their unschooling kids, once or twice a month. <br/>\nWe might go to the library, but we spend their max 20<br/>\nminutes inside, and then spend an hour or more<br/>\nwrestling on the lawn outside with some other boys,<br/>\nlike they did recently.<br/>\n<br/>\nI would try easing up on both your expectations of<br/>\nRiley (hey even adults backslide on PCness when they<br/>\nare mentally or emotionally preoccupied) and your<br/>\nschedule.  He may be going through a developmental<br/>\nstage that requires less social interaction.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]},{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Kids at Parkday","postDate":"1046495570","msgId":12675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYy4zMmRjMWYwLjJiOTE5YjUyQGFvbC5jb20+"},"prevInTopic":12673,"nextInTopic":12697,"prevInTime":12674,"nextInTime":12676,"topicId":12663,"numMessagesInTopic":0,"msgSnippet":"My first of the top of my head reaction is that neither I nor two of my four children could handle well that much varied socialization in one day. :) Was I","messageBody":"<div id=\"ygrps-yiv-1381757490\">My first of the top of my head reaction is that neither I nor two of my four <br/>\nchildren could handle well that much varied socialization in one day. :) Was <br/>\nI reading right, a group in the morning, a friend for lunch, another group <br/>\nfor the afternoon? Two of my kids would love that, two of them would have <br/>\nbeen melting down sometime in the afternoon. I&#39;d have been kicking myself <br/>\nlater for stupid things said. :-&#92; Is it possible that Riley also was socially <br/>\noverstimulated? Or would he have been as likely to rage when presented with <br/>\nthe same frustrations at an earlier point in the day?<br/>\n<br/>\nDeborah in IL</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Kids at Parkday","postDate":"1046487881","msgId":12673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY1LjJhMzI3M2JmLjJiOTE3ZDQ5QGFvbC5jb20+"},"prevInTopic":12667,"nextInTopic":12675,"prevInTime":12672,"nextInTime":12674,"topicId":12663,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/28/03 6:04:57 PM Eastern Standard Time, ... Dana, Such great advice. Pam G. [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-920416083\">In a message dated 2/28/03 6:04:57 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hoffmanwilson@...\">hoffmanwilson@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Make your child happy, and don&#39;t worry what the hell the other mothers<br/>\n&gt; think.<br/>\n&gt; <br/>\n&gt; Dana<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Dana,<br/>\nSuch great advice.<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":9543528,"authorName":"Dana","from":"&quot;Dana&quot; &lt;hoffmanwilson@...&gt;","profile":"hoffmanwilson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Kids at Parkday","postDate":"1046473169","msgId":12667,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOWMwMWMyZGY3ZCQwZDRmNDRjMCQxMzIxZmE0M0BkZWZhdWx0Pg==","referencesHeader":"PDYxNjY3NC4xMDQ2NDY4MTUzNDY1LkphdmFNYWlsLm5vYm9keUBiZXJ0LnBzcC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":12663,"nextInTopic":12673,"prevInTime":12666,"nextInTime":12668,"topicId":12663,"numMessagesInTopic":0,"msgSnippet":"Ideas? Playing with my child, rather than sitting with the grown-ups, helps a lot. Treating all of your child s requests as if it were *your* request, like ","messageBody":"<div id=\"ygrps-yiv-816653108\">Ideas?<br/>\nPlaying with my child, rather than sitting with the grown-ups, helps a lot.<br/>\n<br/>\nTreating all of your child&#39;s requests as if it were *your* request, like<br/>\n&quot;Oh, Suzy, can Riley and I play with that?&quot; Many times children and adults<br/>\nwill take the request more seriously from you.<br/>\n<br/>\n Being the one who brings the most cool toys, for yourself or to trade.<br/>\n<br/>\nBeing in the thick of things with the kids, rather than waiting on the<br/>\nsidelines for the explosions and hurt feelings to come out, and then having<br/>\nto deal with them.<br/>\n<br/>\nRemembering that a child&#39;s toys are a child&#39;s toys, and don&#39;t have to be<br/>\nshared.  Forced &quot;sharing&quot; isn&#39;t sharing.<br/>\n<br/>\nIf another child has some chalk, and your child doesn&#39;t, offer to buy a<br/>\npiece from the child.  Or half a piece.  And don&#39;t forget to buy a box<br/>\nbefore next play day.<br/>\n<br/>\nMake your child happy, and don&#39;t worry what the hell the other mothers<br/>\nthink.<br/>\n<br/>\nDana<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Friday, February 28, 2003 2:36 PM<br/>\nSubject: [AlwaysLearning] Kids at Parkday<br/>\n<br/>\n<br/>\n&gt; Hi Everyone,<br/>\n&gt;<br/>\n&gt; I think in terms of posts now, weird. Anyhow, I&#39;m having some difficulty<br/>\nagain, or I should say Riley is fighting with kids again when he does not<br/>\nget his way. Rememeber he didn&#39;t get invited to a party and spent hours<br/>\nbellowing how unfair things are.<br/>\n&gt;<br/>\n&gt; Riley is 6. When he gets frustrated he grabs, kicks, screams, pouts. He is<br/>\nsensitive and can get his feelings hurt or think people are rude or mean.<br/>\nRiley is extremely coordinated plays with big kids really well. For example,<br/>\nat a group activity yesterday there were 5 5-6 year olds playing and  1 12<br/>\nyear old. Riley played with the 12 year old the whole time and asked to come<br/>\nover to play again.<br/>\n&gt;<br/>\n&gt; We went to a park for lunch and a friend met us there with her 3 1/3 year<br/>\nold girl who loves Riley. They played for 2 hours without a squabble.<br/>\n&gt;<br/>\n&gt; We then went to an afternoon park day of homeschoolers, mostly unschoolers<br/>\nand we had an ok time. Except.. Riley had a toy grabbed from him, asked for<br/>\nit back and then not getting his way shreiked and grabbed something from the<br/>\ngirl who grabbed from him. Her little brother had given Riley the toy<br/>\nwalkie-talkie to play with. Riley never got back what was grabbed. The mom<br/>\nput it away. Later Riley asked a boy also 6 if he could have a turn with the<br/>\n1 piece of chalk the kid had. The kid was not finished and told Riley he was<br/>\nusing it. It was now time for us to go, so I told Riley we need ed to leave.<br/>\nRiley then grabbed the chalk. I helped him give it back, picked him up and<br/>\nleft. Now my son is in a rage. I can see it coming.<br/>\n&gt;<br/>\n&gt; Both issues were sharing issues. Handled differently by the parents. The<br/>\nfirst issue a grab was rewarded, the toy put away and the child who was<br/>\ngrabbed from not supported. The second issue, Riley was the grabber, I<br/>\nhelped him give back the item. He did not get a turn with either thing. What<br/>\nmy problem is is that my son is talked about away from us and is getting<br/>\nlabelled a problem, mean, bully. I tend to play/hang out with the kids and I<br/>\nsee hear alot of what is going on. So many other moms are watching the play<br/>\nfrom the picnic benches and do not really know all the sides of the issue.<br/>\nMy loud son is what is heard. Some options :<br/>\n&gt;<br/>\n&gt; Stop going to this play group<br/>\n&gt; Bring really fun cooperative activities and games<br/>\n&gt; talk to the moms in the group about how to handle conflict<br/>\n&gt; Try again next week<br/>\n&gt;<br/>\n&gt; Any thoughts on handling social situations at parkdays?<br/>\n&gt;<br/>\n&gt; Mary H.<br/>\n&gt;<br/>\n&gt; PS Riley is recovering from oral surgery. He had an extra front tooth<br/>\nremoved and his front baby tooth. He has 3 stitches and a new, 2 missing<br/>\nfront teeth, smile.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; To unsubscribe from this group, send an email to:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"maryfhickman@...","profile":"mfhickman95616","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Kids at Parkday","postDate":"1046468166","msgId":12663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxNjY3NC4xMDQ2NDY4MTUzNDY1LkphdmFNYWlsLm5vYm9keUBiZXJ0LnBzcC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":12667,"prevInTime":12662,"nextInTime":12664,"topicId":12663,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone, I think in terms of posts now, weird. Anyhow, I m having some difficulty again, or I should say Riley is fighting with kids again when he does not","messageBody":"<div id=\"ygrps-yiv-1654815717\">Hi Everyone,<br/>\n<br/>\nI think in terms of posts now, weird. Anyhow, I&#39;m having some difficulty again, or I should say Riley is fighting with kids again when he does not get his way. Rememeber he didn&#39;t get invited to a party and spent hours bellowing how unfair things are. <br/>\n<br/>\nRiley is 6. When he gets frustrated he grabs, kicks, screams, pouts. He is sensitive and can get his feelings hurt or think people are rude or mean. Riley is extremely coordinated plays with big kids really well. For example, at a group activity yesterday there were 5 5-6 year olds playing and  1 12 year old. Riley played with the 12 year old the whole time and asked to come over to play again. <br/>\n<br/>\nWe went to a park for lunch and a friend met us there with her 3 1/3 year old girl who loves Riley. They played for 2 hours without a squabble.<br/>\n<br/>\nWe then went to an afternoon park day of homeschoolers, mostly unschoolers and we had an ok time. Except.. Riley had a toy grabbed from him, asked for it back and then not getting his way shreiked and grabbed something from the girl who grabbed from him. Her little brother had given Riley the toy walkie-talkie to play with. Riley never got back what was grabbed. The mom put it away. Later Riley asked a boy also 6 if he could have a turn with the 1 piece of chalk the kid had. The kid was not finished and told Riley he was using it. It was now time for us to go, so I told Riley we need ed to leave. Riley then grabbed the chalk. I helped him give it back, picked him up and left. Now my son is in a rage. I can see it coming. <br/>\n<br/>\nBoth issues were sharing issues. Handled differently by the parents. The first issue a grab was rewarded, the toy put away and the child who was grabbed from not supported. The second issue, Riley was the grabber, I helped him give back the item. He did not get a turn with either thing. What my problem is is that my son is talked about away from us and is getting labelled a problem, mean, bully. I tend to play/hang out with the kids and I see hear alot of what is going on. So many other moms are watching the play from the picnic benches and do not really know all the sides of the issue. My loud son is what is heard. Some options :<br/>\n<br/>\nStop going to this play group <br/>\nBring really fun cooperative activities and games<br/>\ntalk to the moms in the group about how to handle conflict<br/>\nTry again next week <br/>\n<br/>\nAny thoughts on handling social situations at parkdays?<br/>\n<br/>\nMary H.<br/>\n<br/>\nPS Riley is recovering from oral surgery. He had an extra front tooth removed and his front baby tooth. He has 3 stitches and a new, 2 missing front teeth, smile.</div>","specialLinks":[]}],"prevTopicId":12701,"nextTopicId":12713}}