{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] 4 year old&#39;s anguish (unbelievably long)","postDate":"1036090642","msgId":48934,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczLjI4NjhjOTBkLjJhZjJkNzEyQGFvbC5jb20+"},"prevInTopic":48823,"nextInTopic":0,"prevInTime":48933,"nextInTime":48935,"topicId":48810,"numMessagesInTopic":0,"msgSnippet":"... Sandra, . I don t think it s just the pain killers talking here, but I m crying while reading your post.  It s exactly what I needed to hear. I used to","messageBody":"<div id=\"ygrps-yiv-1447531410\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt;  I think going through the story of your fall will help both of you.  All <br/>\n&gt;  three of you.<br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>Sandra,<br/>\n. <br/>\nI don&#39;t think it&#39;s just the pain killers talking here, but I&#39;m crying while <br/>\nreading your post.  It&#39;s exactly what I needed to hear.<br/>\n<br/>\nI used to tell both my kids their birth stories while nursing and rmember <br/>\nthose tender moments so well.  I&#39;ve worked on reconstructing my falling story <br/>\nand will repeat it to my little buddies as often as they will listen.  Last <br/>\nnight Nathan was playing with my electric bed while I was in the wheelchair.  <br/>\nHe looked up, smiled brightly and said &quot;Mommy, I DIDN&quot;T push you down the <br/>\nstairs!&quot;  Hopefully some day he will believe it.  <br/>\n<br/>\nJulia, my three year old, I think I haven&#39;t been talking to enough about the <br/>\nfall.  I assume she doesn&#39;t understand, but know that is wrong.  Last year <br/>\nNathan was three on september 11th.  He watched 5 to 1 minutes of the <br/>\ncoverage before I realized he was WATCHING it.  And he understood and was <br/>\nfrightened.  Don&#39;t know why i thought Julia didn&#39;t get it except that she is <br/>\nso verbal and hasn&#39;t talked about it.  But I think now that she&#39;s just <br/>\ninternalizing the experience and I want to change the tape in her head too.<br/>\n<br/>\nAnyway, all this is to say a big thank you.  I feel more confident that it <br/>\nwill be all right after some work.<br/>\n<br/>\nElizabeth</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] 4 year old&#39;s anguish (unbelievably long)","postDate":"1036026160","msgId":48823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2NC4xNjgwMDQzZC4yYWYxZGIzMEBhb2wuY29tPg=="},"prevInTopic":48810,"nextInTopic":48934,"prevInTime":48822,"nextInTime":48824,"topicId":48810,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/30/02 5:23:46 PM, ejcrewe@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-943557315\">In a message dated 10/30/02 5:23:46 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ejcrewe@...\">ejcrewe@...</a> writes:<br/>\n<br/>\n&lt;&lt;  In the hospital we talked about how scary it <br/>\nall was (my father in law dies in a hospital this past spring) and she said <br/>\n&quot;yeah, mommy, you died yesterday, but you are ok now.&quot; &gt;&gt;<br/>\n<br/>\nPoor thing!!<br/>\n<br/>\nAnd poor mom.<br/>\n<br/>\nListen, Marty is 13 and he was blaming himself for my falling.  Because we <br/>\nhad just been joking on the way to the elevators that he didn&#39;t want to be <br/>\nseen with me, and so as part of the whole humorous conversation he got in a <br/>\ndifferent elevator.  He thought that if he had been right with me he could <br/>\nhave caught me and I wouldn&#39;t have fallen.<br/>\n<br/>\nI had to talk to him a couple of times to convince him it was NOT his fault <br/>\nand I didn&#39;t ever think so for a minute.  He thought so for at least fifteen <br/>\nhours, though.<br/>\n<br/>\nSo for a four year old, I think telling him the story of your fall now that <br/>\nyou&#39;re calm would help.  Just telling it like a &quot;when I fell&quot; story.  You <br/>\ncould tell him how afraid you were, and how you wished you could see the <br/>\nphone.  And how sorry you were that your crying was scary to him, but how <br/>\nmuch you were hurting and how afraid YOU were too.  I think if you repeat it <br/>\nevery couple of days he will start to remember that instead of the version he <br/>\nhas now in his head, which is filled in with speculation and guessing.<br/>\n<br/>\nI was traumatized by Kirby&#39;s birth.  I went to a counsellor who specialized <br/>\nin women/birth/ACoA stuff, to talk about it.  She said I should talk to Kirby <br/>\nabout it, even though he was too young to understand, that he would <br/>\nunderstand some of it, and that it would be healing for me.<br/>\n<br/>\nKirby was about a year old.  He was nursing at naptime, and I was telling him <br/>\nthe story, lying on the bed with him.  I was crying when I was telling it.  I <br/>\nsaid I was so sorry that when he was first born they had to take him away and <br/>\nnurses washed him and measured him and weighed him, but I didn&#39;t get to be <br/>\nthere right away, and that they gave him to his daddy first, and that his dad <br/>\nloved him and held him until I got to be in the room and see him.   <br/>\n<br/>\nWhen I mentioned Keith holding him first, Kirby pulled off the breast with <br/>\nhis mouth open and milk still unswallowed and looked at my face with big <br/>\neyes.   He listened to some more of the story, and he reached over and got my <br/>\nhand and kissed it.  <br/>\n<br/>\nHe had never kissed my hand like that.  I lay with him and rubbed his head <br/>\nand he fell asleep.<br/>\n<br/>\nI went and called Keith at work and said, &quot;When you had Kirby in the hospital <br/>\nroom, when he was born, what were you doing before I came in?&quot;<br/>\n<br/>\nHe said, &quot;Just talking to him.  And kissing his hands and his feet.&quot;<br/>\n<br/>\nI think going through the story of your fall will help both of you.  All <br/>\nthree of you.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"4 year old&#39;s anguish (unbelievably long)","postDate":"1036023698","msgId":48810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIyLjE0NGY1ZGIwLjJhZjFkMTkyQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":48823,"prevInTime":48809,"nextInTime":48811,"topicId":48810,"numMessagesInTopic":0,"msgSnippet":"I m not even sure how to describe my situation here to ask for help.  But I know you all will be able to help me. As you know, I fell down the basement stairs","messageBody":"<div id=\"ygrps-yiv-716765001\">I&#39;m not even sure how to describe my situation here to ask for help.  But I <br/>\nknow you all will be able to help me.  <br/>\n<br/>\nAs you know, I fell down the basement stairs a week and a half ago and broke <br/>\nmy ankle - a plate and 8 screws were required in surgery.  It hurt.  A lot.  <br/>\nI was home alone with my three and four year olds at the time.  They were <br/>\nhappily watching Angelina Ballerina (!) when I decided to take too much stuff <br/>\ndown the stairs to do laundry.  <br/>\n<br/>\nAfter falling and trying, unsuccessfully, to correct the ankle, I called up <br/>\nto my boy, Nathan, to bring me the phone.  I was not calm.  In the first few <br/>\nminutes, at some conscious level, I knew I had to remain calm.  Nathan first <br/>\ndidn&#39;t want to look for the phone, I begged him.  Probably loudly.  Then he <br/>\ncouldn&#39;t find it.  It&#39;s a cordless and I probably moved it.  So I dragged <br/>\nmyself up, foot suspended, screaming in pain.  I remember screaming moments <br/>\nfollowed by calm moments, chanting to myself to remain calm and get a phone.  <br/>\nSort of like &quot;ok, you can do it, get the phone&quot; repeated several times <br/>\nfollowed by a scream and panting to calm down.  I know I was loud because my <br/>\nthroat hurt in the hospital.<br/>\n<br/>\nNathan did find me my purse with my cell phone in it and I managed to call <br/>\n911.  I think I was in shock.  I kept begging them to hurry and the operator <br/>\nwas trying to calm me down.  They called my neighbors and tried to get my <br/>\nhusband at work.  I scooted to get my palm pilot, it was chaos.  Paramedics <br/>\nbroke down the door.  My neighbor came to get the kids, I kept chanting &quot;my <br/>\nson is allergic to peanuts,&quot; they took me out.  Nathan asked them not to turn <br/>\nthe siren on.  I spoke to both my kids when I could, trying to tell them it <br/>\nwould be ok.  They both got kissed before I was carried out.<br/>\n<br/>\nOK, that&#39;s what I remember of the fall.  And then they played all day with <br/>\nfriends.  My parents came and they played with them.  They visited me in the <br/>\nhospital.  They were shuttled from house to house on the block, well taken <br/>\ncare of.  I came home a few days later, Mark&#39;s Mom was here to help out.  We <br/>\nhired a nanny who started on Monday.<br/>\n<br/>\nNathan had a really bad day today.  It&#39;s been raining and cold since I got <br/>\nhome, so the kids haven&#39;t been playing outside.  They wanted a friend to come <br/>\nover to play, so I arranged that.  Julia and Luke played with trains, Nathan <br/>\ndidn&#39;t want to.  I chatted with Luke&#39;s Mom, Dana (the nanny) supervised the <br/>\nkids.  So far, so good.<br/>\n<br/>\nThen the village people showed up.  Our streets have been torn up and to <br/>\ncomplicate things we have been unable to get in our car in the driveway.  I <br/>\ncalled the village to see if I would be able to get in and they stopped by to <br/>\ntalk to me about it.<br/>\n<br/>\nThen another friend came by with her four year old son and the noise level <br/>\nincreased.  Then my physical therapist arrived.  It was chaos.  Nathan hit <br/>\none of his friends and they left in tears.  Nathan was hysterical and I held <br/>\nhim for a bit.  The pt was behind schedule and needed me to do the stairs.  <br/>\nEventually Nathan calmed down and I successfully made it down and up the <br/>\noutside stairs.  I came back in and he and his friend were at it screaming.  <br/>\nHis other friend left in tears.  With his Mom.  The therapist left.  The <br/>\nnanny announced that she couldn&#39;t work like this and Nathan was still <br/>\nhysterical upstairs.  Eventually she calmed down and comforted him.  He slept <br/>\nfor two hours.<br/>\n<br/>\nJulia and the nanny went for a walk so Nathan and I could snuggle when he got <br/>\nup.  He was completely refreshed and we had a great conversation.  Now I <br/>\nunderstand that Nathan thinks he made me fall.  He thinks he pushed me down <br/>\nthe stairs.  He thinks the screaming was an awful person with an evil laugh <br/>\nin our front yard.  He thinks he causes me pain.  I know it&#39;s normal for a <br/>\nfour year old to blame himself for things, but I had no idea the extent.  <br/>\n<br/>\nAside from talking about it a lot, how can I comfort my son?  I used to yell <br/>\na lot more than I do now, he probably has a two year old memory of my <br/>\nyelling.  I do still lose my cool on occasion, so when I yell its because <br/>\nI&#39;ve reached my limit on whatever is driving me crazy.  So, he&#39;s interpreted <br/>\nmy screaming in pain as screaming at him for some horrible thing.<br/>\n<br/>\nHe&#39;s had a lot of anger at me the past few days - since the Nanny came.  I&#39;m <br/>\nright here in the house with them, but I think he feels like I&#39;m passing him <br/>\noff on her.  My daughter is doing better in this, but she just peed on my <br/>\nbed.  She&#39;s had her temper tantrums.  But she has even fewer words to express <br/>\nher fears than my son, really.  In the hospital we talked about how scary it <br/>\nall was (my father in law dies in a hospital this past spring) and she said <br/>\n&quot;yeah, mommy, you died yesterday, but you are ok now.&quot;<br/>\n<br/>\nMy poor babies!  <br/>\n<br/>\nElizabeth</div>","specialLinks":[]}],"prevTopicId":48691,"nextTopicId":48924}}