{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":0,"authorName":"susan","from":"susan &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"pi6sPtenBL8fv-wXR108gy7S0dgON9DV7sWTCTc5TfyjtsGbrotPkRdf194i35NFKtj00X6zuk5S1gnJPYBGkm8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 450","postDate":"952898366","msgId":7126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4Q0MxMzM2LkNBMDJGNjlGQGZsYXNoLm5ldD4=","referencesHeader":"PDdiLjIwZWJiNGEuMjVmOWQyNzhAYW9sLmNvbT4gPDAwZGQwMWJmOGM2OCQzNzIwMTRjMCQ4MzRhOWZkNEBsaW5rMTA1MjY2Pg=="},"prevInTopic":7120,"nextInTopic":0,"prevInTime":7125,"nextInTime":7127,"topicId":7089,"numMessagesInTopic":0,"msgSnippet":"hi, i don t think it s about living the books we ve read or integrating the philosophies because that s too mental.  you shouldn t have to plan how you act","messageBody":"<div id=\"ygrps-yiv-1214025368\">\n<html>\n \nhi,\n<p>i don&#39;t think it&#39;s about living the books we&#39;ve read or integrating\nthe philosophies because that&#39;s too mental.&nbsp; you shouldn&#39;t have to\nplan how you act with anyone especially your kids.&nbsp;&nbsp; kids have\ngreat bs detectors and will know when you&#39;re &#39;on shaky ground&#39; - that&#39;s\npart of the challenge.&nbsp; the reason i read lots of different philosophies\nis so i can have a picture of how i would like my life to be and what kind\nof relationship i want with my kids.&nbsp; coming from a highly dysfunctional\nfamily this was crucial for me so i could consciously make different choices.&nbsp;&nbsp;\nbeing true to who you are and at the same time desire something different\nmay sound contradictory but i think it is necessary to see them as actually\ncomplementary.&nbsp; you have to be equally compassionate and understanding\nwith yourself as you are with your kids - don&#39;t hold either up to a standard\nof &#39;the right way to be&#39; just desire honesty and contentment.&nbsp;&nbsp;\nthe more you accept the way things are -without harsh judgment, and the\nmore you have a clear idea of what you want then just live your life, the\nmore you are able to behave in a way that feels natural and promotes happiness\nin everyone.\n<p>the first few years of being a mom i spent feeling like a utter failure.&nbsp;\nthen i got sick and couldn&#39;t be a mom because i couldn&#39;t literally move\nuse my arms.&nbsp; the good side of this was it gave me time to get my\npriorities straight.&nbsp; i realized it has nothing to do with getting\nit right or being wrong but about loving being who you are, as you are\nright now and modeling that for your kids.&nbsp; whether it&#39;s washing poopie\ndiapers (something honestly i couldn&#39;t wait to do after being sick:)&nbsp;\nor watching or hearing about some fascinating discovery, be happy with\nit - recognizing the potential to be happy in every situation.&nbsp; screwing\nup is fine because it&#39;s real and honest and if you can accept yourself\nand continue loving yourself after a big screw up then just think of the\nlove and compassion you are modeling for your kids - essentially you are\nsaying: venture out,&nbsp; get it right or wrong,&nbsp; it doesn&#39;t matter\nbecause you did something, you challenged yourself and that&#39;s always a\ngood thing.\n<p>this has been the way i&#39;ve done things.&nbsp; i screw up and we argue\nyou and get frustrated and i shake my head at the way i respond but i never\nget judgemental - i do acknowledge it and think, i wish i handled it differently\nbut then i just move on and i do the same with everyone in my life.\n<p>-susan\n<br>austin,tx\n<br>&#39;unity through diversity&#39;\n<p>Tracy Oldfield wrote:\n<blockquote><span title=\"qreply\"> <blockquote TYPE=\"CITE\"><tt>From:</tt> <tt>&quot;Tracy Oldfield&quot; &lt;Tracy@...-online.co.uk&gt;</tt>\n<br>&nbsp;<font size=\"-1\">erin, I know exactly what you mean!&nbsp; Sometimes\nI think that although I agree with stuff intellectually, I don&#39;t believe\nit in my heart or I would use it.&nbsp; But most of the time (not today,\nhowever!!!) I try to use what I have in my head, (Faber and Mazlish et\nal :-) ) and it works out ok.&nbsp; I&#39;m guessing that you really NEEDED\nthat time on the treadmill!</font> <font size=\"-1\">LIving in hope that eventually\nI get more in tune with myself and my kids and we can live without winding\neach other up completely (yes it&#39;s been one of those &lt;g&gt;)Tracy</font>\n<blockquote\n style=\"BORDER-LEFT:#000000 2px solid;MARGIN-LEFT:5px;MARGIN-RIGHT:0px;PADDING-LEFT:5px;PADDING-RIGHT:0px;\">&nbsp;<tt>From:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MorelFam@...\">MorelFam@...</a></tt>\n<br>&nbsp;\n<p><tt>i love all of the ideas in some of these</tt>\n<br><tt>books but when it comes back to day to day stuff, many times i\ncant make</tt>\n<br><tt>reality jive with what i have read.&nbsp; and the more children\ni have added, the</tt>\n<br><tt>looser my hold on the idealistic model has had to become....</tt>\n<br><tt>erin</tt></p></blockquote>\n</blockquote>\n\n \n</span></blockquote></html>\n</div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;Tracy@...-online.co.uk&gt;","replyTo":"LIST","senderId":"d2Guh8XOWqdBOKLahZTuUNwemyMySK1UmxcRLKCHVx54XJIqN7uG7wuivOPar4ztVP-dVHa0ISJd3rDRZ54qea43B-orZvqy0nyl4F6jBdynfvIHIhxHaTsa","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 450","postDate":"952894069","msgId":7120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwZGQwMWJmOGM2OCQzNzIwMTRjMCQ4MzRhOWZkNEBsaW5rMTA1MjY2Pg==","referencesHeader":"PDdiLjIwZWJiNGEuMjVmOWQyNzhAYW9sLmNvbT4="},"prevInTopic":7104,"nextInTopic":7126,"prevInTime":7119,"nextInTime":7121,"topicId":7089,"numMessagesInTopic":0,"msgSnippet":"erin, I know exactly what you mean!  Sometimes I think that although I agree with stuff intellectually, I don t believe it in my heart or I would use it.  But","messageBody":"<div id=\"ygrps-yiv-672601003\">\n<html><head>\n \n \n<style></style>\n</head>\n \n<div><font size=\"2\">erin, I know exactly what you mean!&nbsp; Sometimes I think \nthat although I agree with stuff intellectually, I don&#39;t believe it in my heart \nor I would use it.&nbsp; But most of the time (not today, however!!!) I try \nto&nbsp;use what I&nbsp;have in my head, (Faber and Mazlish et al :-) )&nbsp;and \nit works out ok.&nbsp; I&#39;m guessing that&nbsp;you really NEEDED that time on the \ntreadmill!</font></div>\n<div>&nbsp;</div>\n<div><font size=\"2\">LIving in hope that eventually I get more in tune with myself \nand my kids and we can live without winding each other up completely (yes it&#39;s \nbeen one of those &lt;g&gt;)</font></div>\n<div><font size=\"2\">Tracy</font></div>\n<blockquote><span title=\"qreply\"> <blockquote\n style=\"BORDER-LEFT:#000000 2px solid;MARGIN-LEFT:5px;MARGIN-RIGHT:0px;PADDING-LEFT:5px;PADDING-RIGHT:0px;\">\n  <div><br></div><tt>From:</tt> <tt><a rel=\"nofollow\"\n target=\"_blank\" href=\"mailto:MorelFam@...\">MorelFam@...</a></tt> <br><br><tt><br>i \n  love all of the ideas in some of these <br>books but when it comes back to day \n  to day stuff, many times i cant make <br>reality jive with what i have \n  read.&nbsp; and the more children i have added, the <br>looser my hold on the \n  idealistic model has had to \nbecome....<br>erin<br></tt></blockquote></span></blockquote></html> \n</div>","specialLinks":[]},{"userId":0,"authorName":"ecsamhill@aol.com","from":"ecsamhill@...","replyTo":"LIST","senderId":"e9iXywemOj1R353itP9bS7bdyAzxBcBMGQAoKRgMhN4z72IRjKlMoYw6a5-WyM9DqcmOuuwexQ0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 450","postDate":"952790631","msgId":7104,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRmLjIzOWRiMmIuMjVmYmM4NjdAYW9sLmNvbT4="},"prevInTopic":7095,"nextInTopic":7120,"prevInTime":7103,"nextInTime":7105,"topicId":7089,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/9/2000 9:49:02 AM, Unschooling-dotcom@onelist.com writes: ","messageBody":"<div id=\"ygrps-yiv-1967789274\">In a message dated 3/9/2000 9:49:02 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a> writes:<br/>\n<br/>\n&lt;&lt;What I mean ... is that I don&#39;t know if I want to spend that much time with <br/>\nthem, but if not, why not, and I think it&#39;s societal conditioning against <br/>\nbeing with one&#39;s children, I hope you all understand cos I don&#39;t know how <br/>\nclear I&#39;m being...&gt;&gt;<br/>\n<br/>\nI think a lot of the social conditioning against moms spending lots of times <br/>\nwith kids came from Freud.  And he was wrong about a lot of things.  Let&#39;s <br/>\nre-examine this idea of his and get rid of it if it&#39;s not valid.<br/>\n<br/>\nA book that may help in working through this is _The Courage to Raise Good <br/>\nMen_ by Olga Sivertstein.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":0,"authorName":"MorelFam@aol.com","from":"MorelFam@...","replyTo":"LIST","senderId":"0PxGAe9a65sONRlZiWLofwMKe6lJjaOfc_4VQGK4I5G6LewCZxnShNSniRwuAfpa1nxt8NIsug","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 450","postDate":"952662136","msgId":7089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdiLjIwZWJiNGEuMjVmOWQyNzhAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":7095,"prevInTime":7088,"nextInTime":7090,"topicId":7089,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/9/00 3:49:15 AM, Unschooling-dotcom@onelist.com writes: ","messageBody":"<div id=\"ygrps-yiv-1800582554\">In a message dated 3/9/00 3:49:15 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@onelist.com\">Unschooling-dotcom@onelist.com</a> writes:<br/>\n<br/>\n&lt;&lt; i am very controlling by training and have spent more hours than i<br/>\n<br/>\ncare to count in power struggles and have found that cooperation is easier to<br/>\n<br/>\nattain when the child/person has the free will and chooses it rather than be<br/>\n<br/>\ncoerced into it &gt;&gt;<br/>\n<br/>\nthis thread has been so interesting, thanks susan and joshua and others.  i <br/>\nlike being able to be sparked by something i have read during my day (from <br/>\nthe list) with my children and then play around with the idea while in the <br/>\nmidst of the challenges.   my just turned four year old didnt want to go in <br/>\nto the Y with me tonite when i pulled up to go walk on the treadmill for <br/>\n20min.  i had been playing with these thoughts and others and have recently <br/>\ngotten both the alfie kohn book, and raising your child not by force..., so i <br/>\nwas much slower than usual to use my &quot;lets go in NOW, im going to count to <br/>\n3-- and you will lose your priveleges, blah blah blah&quot; these  unenlightened <br/>\ntactics sound so pitiful as i type, but in reality helps me get thru the day <br/>\nbc it brings cooperation.  i did end up going this route though, after i <br/>\ndecided that it was important to me to walk, and also, he had no reason that <br/>\nhe or i could find to not go in-- just that he didnt want to.  so i was a <br/>\nlovely picture entering the nursery with 21mo old clinging to my neck and 4yr <br/>\nold clinging to my leg.  (ive just gone 2wice before and my 4yo is quite <br/>\nsocial and usually loves the opp to play, etc)  anyway, the redeeming news is <br/>\nthat i was able to take the time to sit down in the nursery and play with <br/>\nthem a good 15min before i left them and they were comfortable by then.  <br/>\nwhew.  i guess what i am wondering after all that, is how another parent <br/>\n(susan?) might have handled it.  i love all of the ideas in some of these <br/>\nbooks but when it comes back to day to day stuff, many times i cant make <br/>\nreality jive with what i have read.  and the more children i have added, the <br/>\nlooser my hold on the idealistic model has had to become....<br/>\nerin</div>","specialLinks":[]},{"userId":0,"authorName":"susan","from":"susan &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"o71NBdze0av3vwJ07UjHcJZjSe85ATjiR7U7iLv716A3disdzNDSJaJYoEUvspzVTaFXKYup_30TFjrVJBZoJbU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 450","postDate":"952649719","msgId":7095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4Qzg0N0U0LkY1QTUzNjVGQGZsYXNoLm5ldD4=","referencesHeader":"PDdiLjIwZWJiNGEuMjVmOWQyNzhAYW9sLmNvbT4="},"prevInTopic":7089,"nextInTopic":7104,"prevInTime":7094,"nextInTime":7096,"topicId":7089,"numMessagesInTopic":0,"msgSnippet":"... hi erin, first i would like to say it s not about perfection - doing the right thing in every situation.  imo it s about being yourself, being flexible and","messageBody":"<div id=\"ygrps-yiv-707370265\">\n<html>\nMorelFam@... wrote:\n<blockquote><span title=\"qreply\"> <blockquote TYPE=\"CITE\">my just turned four year old didnt want to go in\n<br>to the Y with me tonite when i pulled up to go walk on the treadmill\nfor\n<br>20min.&nbsp; i had been playing with these thoughts and others and\nhave recently\n<br>gotten both the alfie kohn book, and raising your child not by force...,\nso i\n<br>was much slower than usual to use my &quot;lets go in NOW, im going to count\nto\n<br>3-- and you will lose your priveleges, blah blah blah&quot; these&nbsp;\nunenlightened\n<br>tactics sound so pitiful as i type, but in reality helps me get thru\nthe day\n<br>bc it brings cooperation.&nbsp; i did end up going this route though,\nafter i\n<br>decided that it was important to me to walk, and also, he had no reason\nthat\n<br>he or i could find to not go in-- just that he didnt want to.</blockquote>\nhi erin,\n<p>first i would like to say it&#39;s <u>not</u> about perfection - doing the\nright thing in every situation.&nbsp; imo it&#39;s about being yourself, being\nflexible and balancing everyone&#39;s needs -not necessarily easy tasks:) but\nfulfilling nonetheless:)&nbsp; and that it&#39;s really ok to mess up and lay\nthe law down but this approach should not be the norm.\n<p>when dealing with these kinds of frustrations - first we must remember\nthat we are modeling for our kids &quot;how to handle frustrations&#39; (i have\nnot done a stellar job in this area but am learning and recognizing just\nhow much kids mirror their parents - a concept i feel in crucial to unschooling)\nand therefore we must try and behave in a way in which we would want our\nkids to behave.&nbsp;&nbsp; as well as remember that often (because nothing\nis a hard and fast rule) &#39;bad&#39; behavior is learned and if it wasn&#39;t learned\nit probably developed because the child hasn&#39;t found a way to express her/his\nself and find a resolution to the frustrations they naturally experience.&nbsp;\n(this is just my opinion).\n<p>the next thing to take into account is the stage the child is at.&nbsp;\ndeepak chopra wrote a book <u>the seven spiritual laws for parents</u>\n.&nbsp; he says the &#39;preschool, 2-5 yrs.&nbsp; key words: deserving, exploring,\napproving&#39;&nbsp; he goes on to say:\n<p>&#39;a toddler begins to realize that &quot;i am&quot; can expand to &quot;i can&quot;.&nbsp;&nbsp;\nonce the ego realizes this, there is no stopping a two-year-old.&nbsp;\nhe thinks he has the whole world - and certainly everyone in the family\n-&nbsp; by the tail.&nbsp;&nbsp; &quot;i&quot;&nbsp; is like a power generator just\nplug it in, and what makes the two&#39;s terrible is that the newly born ego\nsurges with power in an undisciplined way.&nbsp;&nbsp; shouting, screaming,\nrunning around, wielding the all-powerful <i>no!</i> and generally trying\nto rule by sheer will - this is exactly what should be going at this stage.\n<p>spiritually, the value of the preschool stage is that power is spiritual\n- only the distortion of power leads to problems.&nbsp;&nbsp; so rather\nthan try to curb your child&#39;s rush to power, you need to channel it into\ntasks and challenges that teach balance.&nbsp;&nbsp; without being balanced\nthe power hunger of a preschooler will run into grief, because her experience\nis largely the illusion of power.&nbsp; a ranting two-year-old is still\na very tiny, vulnerable, uninformed person.&nbsp;&nbsp; in our love for\nthe child, we allow the illusion to exist, because we want her to grow\nup a strong, capable person who feels up to any challenge that comes along.&nbsp;&nbsp;\nthis sense of self-esteem won&#39;t develop if the feeling of being powerful\nis shut down or repressed at this stage.&#39;\n<p>ok i buy this, from my experience my son fits this description.&nbsp;&nbsp;\nthe next question would be:&nbsp; how do you fulfill your own needs?&nbsp;&nbsp;\nwe all know that if we neglect our own needs its not good for anyone!&nbsp;\nthe situation you conveyed is a clash of your needs and his need to express\nhis power -&#39;the all-powerful <i>no!&#39;</i> so how would you keep this &quot;illusion\nof power&quot; alive but get what you need and deserve?&nbsp; i would implement\nsomething along the lines of what harville hendrix and helen hunt talk\nabout in their book (which i&#39;ve mentioned before) <u>giving the love that\nheals: a parents guide</u>.&nbsp; they call it &#39;the process of intentional\ndialogue - mirroring, validating and emphasizing&#39;.&nbsp; for me this really\nfits in with my belief that you must balance trust, understanding and authority\nor you compromise the parent/child relationship.\n<p>so i would start out asking why he didn&#39;t want to go and repeat his\nreasons back to him so he knew i understood his position.&nbsp; then i\nwould tell him that i really needed to go and ask him what he would like\nso that it would make going enjoyable for him.&nbsp;&nbsp; by doing this\ni believe you begin to foster trust.&nbsp;&nbsp; or i would say we have\nto go that is not debatable (taking authority) but i would love to do something\nyou would enjoy afterwards and set up a situation were he had some power\n(a combination of trust and understanding) and at the same time experiences\ncooperation, which i believe is at the heart of this balance along with\ncompassion .&nbsp; i would tell him how much i appreciated and enjoyed\nhis cooperation and thank him for it.\n<p>if he will not cooperate (which happens a lot:) and has a fit, i would\nnot punish him, i would answer the questions i had asked him myself.&nbsp;\ni would tell him i know you like playing some game (i would stay clear\nof buy toys or fast food because then you wander into the realm of bribery\nand are really teaching them how to manipulate instead of cooperate- not\na good skill) or convey to him that when you get home he can have some\nalone uninterrupted time where he can be the all-powerful one calling all\nthe shots.&nbsp; so i think acknowledging the bad behavior is important\nbut assume that he will want to do the right thing he just doesn&#39;t know\nhow, yet.\n<p>i think one of the biggest mistakes parents and adults in general make\nis assuming that a child&#39;s motives are the same as an adult&#39;s.&nbsp; i\nfirmly believe this is not true.&nbsp; the example joshua gave regarding\ncruelty to animals, i believe a child doesn&#39;t necessarily mean to cause\nharm (there are however always exceptions and that&#39;s why parents must know\ntheir children) they are merely experiencing the world, learning fantasy\nand reality, learning about power - &#39;i can but should i?&#39;.&nbsp; so when\nwe are making decisions regarding children we must make sure we are not\nviewing them as adults but as children who need adults in their lives so\nthey can safely move toward adulthood and have the experience that will\nbest foster this journey.\n<p>well i&#39;ve gone on long enough and i thinks it&#39;s obvious i could and\n(would be happy to:) keep going:)&nbsp; so if something is unclear i could\nexpand upon it.&nbsp; i hope this is what you where after.\n<p>-susan\n<br>austin,tx\n<br>&#39;unity through diversity&#39;</p></span></blockquote></html>\n</div>","specialLinks":[]}],"prevTopicId":7125,"nextTopicId":7127}}