{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":283374811,"authorName":"Carol","from":"Carol &lt;carolfhs79@...&gt;","profile":"carolfhs79","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New Date and other new additions for 4th Annual Unschoolers Waterpark Gathering!","postDate":"1273194355","msgId":53912,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2ODgwNy40OTM3OC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":53911,"nextInTime":53913,"topicId":53912,"numMessagesInTopic":0,"msgSnippet":"We re excited to announce the 4th Annual Unschoolers Waterpark Gathering will be at Sandusky, Ohio s Kalahari Indoor Waterpark Resort, May 15 – 20, 2011.   ","messageBody":"<div id=\"ygrps-yiv-580755433\">We&#39;re excited to announce the 4th Annual Unschoolers Waterpark Gathering will be at Sandusky, Ohio&#39;s Kalahari Indoor Waterpark Resort, May 15 – 20, 2011.<br/>\n<br/>\n <br/>\n <br/>\nUNBELIEVABLY GROUP ROOM RATES – beginning as low as * $85 / night  We&#39;re pleased to announce, by moving our Gathering to mid-May, not only did our room rates not increase, but several room rates actually decreased!  (* Note  - rate above is for standard room, sleeps 6 & includes 4 waterpark passes.  Other room  types and rates are also available)<br/>\n<br/>\n <br/>\nAlso by moving our Unschoolers Waterpark Gathering to mid-May, we can take advantage of: <br/>\n<br/>\nKalahari&#39;s new Outdoor Adventure Park (opening later this month!) http://www.kalahariresorts.com/oh/newsevents/safariadventurepark/<br/>\n<br/>\n·         CTS Zip Line – zip rides at over 60 ft in the air along a 200 – 400 ft course<br/>\n·         Adventure Climbing Wall – (3) 32 ft. climbing walls <br/>\n·         Ropes Course  - 750 ft of thrilling African themed ropes adventures<br/>\nKalahari&#39;s Safari Animal Park - walk-about zoo featuring over 50 animals, along with camels rides, feeding of giraffes and other animals, etc… <br/>\n <br/>\nKalahari&#39;s educational Zoo Keeper&#39;s course - 2  hr. behind the scenes learning where participants can interact and assist with the feeding and care of various animals.<br/>\n<br/>\nAREA ATTRACTIONS <br/>\n<br/>\nThere are also lots of things to do and see in May, around Sandusky and Lake Erie.   We&#39;ll be arranging several offsite field trips, including ……..<br/>\n<br/>\n<br/>\nLake Erie Ferry Rides <br/>\n<br/>\n<br/>\nEnjoy a scenic 2 hr. ferry ride exclusively for our group, for only $6!  <br/>\n<br/>\nFerries leave from downtown Sandusky and view the nearby shorelines, coal docks and also the famed Marblehead Lighthouse – the oldest continuously running lighthouse on the Great Lakes. <br/>\n<br/>\nThomas Edison Birthplace Museum <br/>\n<br/>\n<br/>\nLess than 10 minutes from the Kalahari is Edison&#39;s hometown and birthplace Museum.  The Museum features a collection of rare Edisonia, including examples of many of Edison&#39;s early inventions, documents, and family mementos.  http://www.tomedison.org/index.html<br/>\n<br/>\nCedar Point Amusement Park http://www.cedarpoint.com/public/park/rides/index.cfm<br/>\n<br/>\n<br/>\nEnjoy a day at the world largest roller coaster park.  Features over 75 rides, including 17 roller coasters, along with lots of family friendly rides and entertainment.  For the last 10+ years, its been rated the #1 Amusement Park in the world!   http://www.wrsol.com/usatravelguide/2009/05/10bestamusementparksinamerica/<br/>\n<br/>\n <br/>\nINTERNATIONALLY KNOWN KEYNOTE SPEAKER<br/>\n<br/>\nWe&#39;ll again be having another outstanding, internationally known keynote speaker, along with several other well known and respected unschooling speakers. We&#39;re finalizing details will be announcing our speakers soon.<br/>\n<br/>\n<br/>\nWE&#39;LL ALSO BE ADDING SEVERAL NEW EVENTS…….<br/>\n<br/>\n<br/>\nMentoring<br/>\n<br/>\n<br/>\nFor those who would like to be grouped together with an unschooling family who&#39;s been to past Unschooling Waterpark Gatherings, we&#39;ll be offering group mentoring.  We&#39;ll put 3-4 families who liked to be mentored with a  &quot;seasoned&quot; unschooling family who&#39;s been to 2 or more past Unschooling Waterpark Gatherings. Mentoring groups will be assigned before the Gathering, so families can start to get to know their mentor and other families and to also begin sharing questions and info of what to expect at our unschooling Gatherings. Once at the Gathering, time will be allotted each morning, for mentoring families to gather and chat with their mentor, if so desired. Or families can choose other meeting times, as best works for them.  <br/>\n<br/>\nSpeed Dating<br/>\n<br/>\n<br/>\nFor a fun and quick way to get to know fellow attendees, we&#39;ll be doing speed dating for families and also individuals to partake.  Participants will be given a certain number of minutes to mingle, then change &quot;dates&quot; every so many minutes over approximately a 2 hour time period. <br/>\n<br/>\nMom&#39;s Night Out (MNO)<br/>\n<br/>\n<br/>\nOne evening will be geared toward the Moms this year!  We plan on having a mom&#39;s hot tub &quot;meeting&quot; or two  in the waterpark, evening henna painting, and a mom&#39;s night out to chat and mingle – stay tuned for more details……….<br/>\n <br/>\nOTHER EVENTS BACK BY POPULAR DEMAND<br/>\n<br/>\n<br/>\nMonday Night Carnival<br/>\n<br/>\n<br/>\nLots of games, food , entertainment and fun for all!<br/>\n<br/>\nFairy Godparents<br/>\n<br/>\n<br/>\nWe&#39;ll again let those who want to partake, secretly draw names and then spend the week making one&#39;s godchild feel special. <br/>\n<br/>\nKids&#39; Market Place<br/>\n<br/>\n<br/>\nKids again will have a chance to market and sell their wares. This has grown to become one of our most popular events and thus we&#39;ll be utilizing 3 times more ballroom space for this event next year. <br/>\n<br/>\nMusic Jam Session<br/>\n<br/>\n<br/>\nBring your own instruments and join along in a casual jamming session.  All ages welcomed!<br/>\n<br/>\nTalent Show<br/>\n<br/>\n<br/>\nAll ages and talents welcomed for a fun night of community and camaraderie.  <br/>\n<br/>\nMovie Night<br/>\n<br/>\n<br/>\nWe&#39;ll begin the evening showing a &quot;G&quot; rated kid friendly family movie.  Then, a PG / PG-13 movie geared more for our older kids.  As always, all ages are welcomed at one or both movies.<br/>\n<br/>\nSSUDs<br/>\n<br/>\n<br/>\nSecret Society of Unschooling Dads will again be convening throughout the week. Only men folk are granted access.  Cool conversation, new ideas and friendships are sure to result!<br/>\n<br/>\nThursday Night Family Dance<br/>\n<br/>\n<br/>\nJoin us on our last night for a remarkable grand ballroom family dance. Many find this the highlight of the entire week!  <br/>\n <br/>\nREGISTRATION<br/>\n<br/>\n<br/>\nRegistration will begin in September on a first come basis.  Be sure to register early, not only to take advantage of the early bird regstn ( see below), but to guarantee space, as last year several who tried to book late couldn&#39;t get a room.<br/>\n<br/>\nEarly Bird Reservation deadline is Feb. 15, 2011.  Great News - Our Early Bird bonuses have increased, from $20 to $45 in combination of Kalahari Gift and Gaming Room Cards and mini golf passes.<br/>\n <br/>\nFor further information,  please join our UWG Yahoo group now at: http://groups. yahoo.com/ group/UWG<br/>\n <br/>\nHappy Unschooling!<br/>\n<br/>\nCarol Reinhard – UWG Gathering Coordinator<br/>\nKimberly Conti – UWG Speaker Coordinator<br/>\nKim Lowery – UWG Main Events Coordinator<br/>\nBethany Ward – UWG Funshop Coordinator<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":53881,"nextTopicId":53914}}