{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"happiness, integrity (was  transcripts (was Re: Digest Number 4582)","postDate":"1082314313","msgId":92822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Ni4yNzMxOTM3Yy4yZGI0Mjg0OUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":92821,"nextInTime":92823,"topicId":92822,"numMessagesInTopic":0,"msgSnippet":"-=- I am not sure if unschooling in itself is extreme. I think it is a bad idea to not be willing to introduce knowledge to a child, as we have been doing it","messageBody":"<div id=\"ygrps-yiv-1431511764\">-=- I am not sure if unschooling in itself is extreme. I think it is a <br/>\n<br/>\nbad idea to not be willing to introduce knowledge to a child, as we <br/>\n<br/>\nhave been doing it for a very long time, far longer then we have had <br/>\n<br/>\nschools. -=-<br/>\n<br/>\nYes.<br/>\nAnd before there were schools, that knowledge was not presented in schoolish <br/>\nways.<br/>\nAnd it doesn&#39;t have to be.<br/>\n<br/>\nI&#39;m not sure where you got the idea that unschoolers don&#39;t &quot;introduce <br/>\nknowledge&quot; to their children.  I can&#39;t see in your head, so I don&#39;t know how <br/>\nschoolish your introduction to knowledge ideas are.  <br/>\n<br/>\n-=- I think it is a negative thing for a parent to not present a child <br/>\n<br/>\nwith what they think they should know. Like manners, and morals.-=-<br/>\n<br/>\nWell I agree with you totally.<br/>\nAnd I have no idea why you made the assumption that our children are kept <br/>\nclueless about manners and morals.<br/>\n<br/>\nBut it&#39;s interesting to me that your example includes morals.<br/>\nMorality is VERY important in our family.<br/>\n<br/>\n-=-At 4 <br/>\n<br/>\nyears old I can and feel I should teach my daughter these things. <br/>\n<br/>\nAlong with how to clean her room, not to run in the road and why. I <br/>\n<br/>\ntake the time to teach her things I know. Sometimes she is <br/>\n<br/>\ninterested, sometimes not.-=-<br/>\n<br/>\nIf she&#39;s not interested your &quot;teaching&quot; is song and dance without an <br/>\naudience.  But when she IS interested, her learning will astound you.  If you stop <br/>\ntrying to teach and look for her desire to learn, you&#39;ll move a step toward <br/>\nhelping HER live a life of learning.<br/>\n<br/>\n<br/>\n-=- I think it is a negative thing for a parent to not present a child <br/>\n<br/>\nwith what they think they should know. Like manners, and morals.-=-<br/>\n<br/>\nWell I agree with you totally.<br/>\nAnd I have no idea why you made the assumption that our children are kept <br/>\nclueless about manners and morals.<br/>\n<br/>\nBut it&#39;s interesting to me that your example includes morals.<br/>\nMorality is VERY important in our family.<br/>\n<br/>\nMorality is so important to me that I would not lie to get my child into <br/>\ncollege.  I&#39;ve never lied on a resume, and I won&#39;t start now.   <br/>\n<br/>\nIt is possible to get kids into college without a transcript.  I did it for <br/>\nmy sister in the early 70&#39;s.  I was a teenager.  If a teenager can figure out <br/>\nhow to do it for another teenager without compromising morals or integrity, <br/>\ncertainly a grown mother who has been consciously unschooling her child for years <br/>\ncan figure out how to do it.<br/>\n<br/>\nI know I&#39;m repeating myself, but a &quot;transcript&quot; doesn&#39;t have to look like a <br/>\nschool transcript, and if unschoolers make a transcript that DOES look just <br/>\nlike a school transcript (with numbers of credits and letter grades) they&#39;re not <br/>\npresenting their children with manners and morals to  MY standards.  My <br/>\nintegrity doesn&#39;t stretch far enough to falsify records.  If yours does, that&#39;s your <br/>\npersonal concern.  <br/>\n<br/>\nPart of the reason my children respect my opinion is they know I&#39;m honest.  <br/>\nIt&#39;s very important to me to maintain that integrity throughout their lives, <br/>\nnot just until I decide to lie about our whole lives to that point to get them <br/>\ninto school.<br/>\n<br/>\nIf you think a high school transcript is a necessity (for your four year old <br/>\ndaughter) then by all means, plan to send her to high school!  They give <br/>\ntranscripts out free.    Or sign up to use a curriculum by mail, or an online high <br/>\nschool course, or some means by which an accredited educational establishment <br/>\nwill give her a legitimate transcript.   <br/>\n<br/>\nNobody&#39;s telling you you have to unschool.  Nobody&#39;s telling you you have to <br/>\nbe honest.<br/>\n<br/>\nWhat people are trying to discuss here is the connection between the way one <br/>\nlives one&#39;s life and the ramifications of falsifying records (ESPECIALLY when <br/>\nthere is no need to falsify records whatsoever, because several alternatives <br/>\nhave been presented).<br/>\n<br/>\n<br/>\n-=- I am not talking about testing a child, I am talking about testing a <br/>\n<br/>\nyoung adult getting ready to go out into the world. Like age 16ish!-=--<br/>\n<br/>\nI believe you were suggesting earlier that testing children wouldn&#39;t hurt at <br/>\nall, because they would need to learn good test-taking skills.     By 16 if <br/>\nthey&#39;re ready to take ACT or SAT or A levels or whatever, then that is NOT the <br/>\nkind of test people here are objecting to.  People here tend to avoid the Iowa <br/>\nTest of Basic Skills being administered to their children every year or few, <br/>\nand the child being branded slow or gifted or average.  None of those labels <br/>\nhas ever helped a child learn.<br/>\n<br/>\n-=- I am one of those people that can say I shall do something and more <br/>\n<br/>\nthen likely I will do it. -=-<br/>\n<br/>\n&quot;Shall&quot; is just too strong a word.  Think about what it means.   Not &quot;maybe&quot; <br/>\nand not &quot;probably.&quot;<br/>\n<br/>\nHad you said &quot;I will probably...&quot; then your statement would&#39;ve been hunky <br/>\ndory, but if  say that when my daughter gets married I shall wear blue and sit in <br/>\nthe front pew with a flower in my hair,  I&#39;m saying more than I have any <br/>\nbusiness saying.<br/>\n<br/>\nYou don&#39;t know, today, that your daughter will ever want to go to college.<br/>\nYou don&#39;t know, today, that your daughter will be alive in twelve years.<br/>\nPerhaps the best thing you can do, today, is help her have a really great <br/>\nApril 18, 2004.<br/>\n<br/>\n-=- Goodness, did I say they are stupid? I do not think so, I think the <br/>\n<br/>\ndesition to not help their child get into a college that demands <br/>\n<br/>\ntranscrips because it would be in thier eyes lieing, mine changing, <br/>\n<br/>\nthat it would be stupid.-=-<br/>\n<br/>\nYou did say stupid.  Right in writing, right in public.<br/>\nNobody forced you to write, and nobody forced you to hit &quot;send,&quot; so take <br/>\nresponsibility for what you say in public.  People ARE reading, so if you don&#39;t <br/>\nmean what you write, please don&#39;t write.  <br/>\n<br/>\n<br/>\n-=-Picture me saying that I think it is <br/>\n<br/>\nbetter to change when needed a little then to fight the system that <br/>\n<br/>\nshall not change for you but could very well make your child very <br/>\n<br/>\nhappy. -=-<br/>\n<br/>\nYou said &quot;shall&quot; again.  Now you&#39;re guaranteeing the behavior of something <br/>\ncompletely outside yourself.<br/>\n<br/>\nHere are the acceptable uses of shall:  Of oneself (but it&#39;s a kind of <br/>\nguarantee of future behavior, so use it sparingly) or of others IF the speaker is in <br/>\na position to make it so.  A judge or a king declaring that somenoe shall be <br/>\nimprisoned or shall be hanged.<br/>\n<br/>\nOtherwise &quot;shall&quot; is too strong.  The system has changed more than it has <br/>\never stayed the same.  And since people here have shown and accounted and linked <br/>\nto evidence that it IS possible to get into college without transcripts, your <br/>\n&quot;shall not change&quot; is false and wrong.<br/>\n<br/>\nIf my child&#39;s happiness depended on my dishonesty, their world would not be <br/>\nthe open, honest place it is today.<br/>\n<br/>\nTheir happiness thusfar has benefitted from my honesty, and I question your <br/>\nmotives in counselling people to turn from honesty to sneakiness.<br/>\n<br/>\n-=- Since when is life about being happy? Life is not about being happy, <br/>\n<br/>\nnot that I have ever learned.-=-<br/>\n<br/>\nWell....<br/>\nOur house is happy.<br/>\nMy kids are happy,  I&#39;m happy.<br/>\n<br/>\nYou think children could be happier if moms falsify transcripts, yet you <br/>\ndon&#39;t think life is about being happy, maybe you should spend smoe more time <br/>\nthinking about what you really believe about life and happiness.<br/>\n<br/>\n-=- Life is about being useful, about being <br/>\n<br/>\na good person, about makeing life woth something. Happy comes with <br/>\n<br/>\nbeing useful.-=-<br/>\n<br/>\nMy children are good, useful people whose lives are worth more than most <br/>\nkids&#39; lives because they are living examples of happy goodness.  Honestly, they <br/>\nknew years ago they were poster children for unschooling, and they&#39;re such good <br/>\nsports about it.  I&#39;m relieved.  They could&#39;ve said, &quot;Stop talking about this <br/>\nso much,&quot; but they themselves will sometimes say &quot;You should tell the list <br/>\nabout this&quot; if something cool  happens at our house.<br/>\n<br/>\n-=-My child is so happy to help, she does not see work as <br/>\n<br/>\nsomething negative or as something she must do before she can have fun.-=-<br/>\n<br/>\nMine too, but in their case work is NOT something they must do before they <br/>\ncan have fun.<br/>\nI&#39;m guessing it&#39;s different at your house because you wrote the statement <br/>\nabove and I could never have conjured a statement like that from the patterns at <br/>\nour house.<br/>\n<br/>\n-=- Work, learning, playing, are all part of her learning and to her, all <br/>\nfun! -=-<br/>\n<br/>\nMy house too.<br/>\n<br/>\n-=-That in itself helps me think we are doing something right. -=-<br/>\n<br/>\nGood.  I bet you&#39;re doing lots of things right. <br/>\nYour recommendations on this list weren&#39;t on your glorious-right list, <br/>\nthough.  <br/>\n<br/>\nHere&#39;s what I think about happiness if you get any more reading-energy later:<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com/library/essays/essay06.shtml\">http://www.unschooling.com/library/essays/essay06.shtml</a><br/>\nIt&#39;s &quot;Rejecting a Pre-Packaged Life,&quot; an article I wrote when my kids were <br/>\nyoung.<br/>\nThey&#39;re 12, 15 and 17 now.<br/>\nI don&#39;t feel less strongly about my decisions now, but more.<br/>\n<br/>\nAnd I think life is about happiness, when you can manage well.<br/>\n<br/>\n-=-Since when is life about being happy? -=-<br/>\n<br/>\nHappy lives are about happiness.<br/>\nI&#39;m sorry yours isn&#39;t happier, but we could help you with ideas to tweak it a <br/>\nbit if you want.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":92821,"nextTopicId":92654}}