{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Kids & Respect & Stuff","postDate":"1043347557","msgId":55927,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NS4xYWJjYmViOS4yYjYxOTI2NUBhb2wuY29tPg=="},"prevInTopic":55850,"nextInTopic":0,"prevInTime":55926,"nextInTime":55928,"topicId":55850,"numMessagesInTopic":0,"msgSnippet":"The purpose of this post is for me to agree with Pam Hartley. In a message dated 1/23/03 1:18:21 AM, pamhartley@mindspring.com writes: ","messageBody":"<div id=\"ygrps-yiv-30923885\">The purpose of this post is for me to agree with Pam Hartley.<br/>\n<br/>\nIn a message dated 1/23/03 1:18:21 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamhartley@...\">pamhartley@...</a> writes:<br/>\n<br/>\n&lt;&lt; I don&#39;t bother about most other<br/>\n<br/>\nthings, I&#39;m only that way about games. &lt;g&gt; But they knew it was important to<br/>\n<br/>\nme, and they understand why, and they are cheerfully accommodating me. If I<br/>\n<br/>\nhad set up a punishment situation (&quot;You left Chutes and Ladders out for the<br/>\n<br/>\nfifth time this week, now you can&#39;t play it tomorrow.&quot;) it would have<br/>\n<br/>\ndevolved from them doing me a kindness to something far yuckier that I&#39;d<br/>\n<br/>\nrather not have in our relationship. &gt;&gt;<br/>\n<br/>\nWe still have the tiny plastic acorns for our Squirrel game.<br/>\n<br/>\nTwo reasons:  I used to check through the vacuum cleaner bags for Ninja <br/>\nTurtle weapons or game pieces.   And we had a &quot;lost parts&quot; drawer, and any <br/>\ngame piece found randomly about was (still is) returned to its box at some <br/>\npoint.<br/>\n<br/>\nMy kids played LOTS of games (still, sometimes, Holly especially) and we have <br/>\nalways been careful with game pieces.  They like the games, they see <br/>\nimmediately the purpose of keeping things together, and they do it not from <br/>\nfear of punishment or limitations but because it&#39;s right to do.  The <br/>\nlimitation and punishment is that they can&#39;t play if the parts aren&#39;t there.  <br/>\n<br/>\nAnd instead of making them put the games up when they were little we would <br/>\nget them to help us (or we would &quot;help them&quot; even though it was doing most of <br/>\nthe work), and talk about which pieces went where, and make a game of lining <br/>\nup the stuff in the box.<br/>\n<br/>\nAlso I bought little ziploc bags for games pieces.  And for jigsaw puzzles, <br/>\nwe put the pieces in a ziploc bag (gallon freezer bags, usually) inside the <br/>\nbox, so if the box falls being put up high or taken down, the pieces armans <br/>\nhave instincts which we try to extinguish.  Maybe we shouldn&#39;t do that.  <br/>\nBy forcing children to eat what we put on their plates regardless of their <br/>\npersonal gag factor, we don&#39;t teach them anything good.  We teach them to <br/>\nignore their bodies, to ignore their noses, and to do what bigger people tell <br/>\nthem to do.<br/>\n<br/>\n&lt;&lt;Sometimes, I stay up way too late even though I know I&#39;ll feel awful the<br/>\n<br/>\nnext day when I have to get up early for some reason.&gt;&gt;<br/>\n<br/>\nAfter I sent the post about sleeping, Holly asked me to forward it to her so <br/>\nshe could read it later.  I had to go to sent mail and all, and Holly was <br/>\nasking me whether there were really parents who thought a kid wouldn&#39;t go to <br/>\nsleep when he was sleepy.  &quot;They&#39;ll fall asleep in their chairs if they&#39;re <br/>\nreally sleepy.&quot;  <br/>\n<br/>\n&quot;But they&#39;ve never tried it, so they don&#39;t know.&quot;<br/>\n<br/>\nHolly laughed.  She said, &quot;Haven&#39;t THEY ever fallen asleep in a chair?&quot;  <br/>\n(meaning the parents)<br/>\n<br/>\nI said maybe the parents had always gone to bed by the clock too.  She just <br/>\nlaughed and went to wake Kirby up.  They&#39;re going to a Harry Potter <br/>\ntournament together in a bit.<br/>\n<br/>\n&lt;&lt;Children are young, less experienced humans. So yes, they are &quot;little<br/>\n<br/>\nadults&quot;. They can and will learn to listen to their own bodies, to treat<br/>\n<br/>\nfamily members with respect, etc., just as an adult learns the things they<br/>\n<br/>\nneed to function.&gt;&gt;<br/>\n<br/>\nPam&#39;s right.<br/>\n<br/>\nWhat is &quot;a little adult&quot;?<br/>\nWe don&#39;t have the &quot;adult&quot; distinction here.  Kirby has been on a growth curve <br/>\nhis whole live, and a learning curve, which is uniquely his.  We&#39;ve treated <br/>\nhim like a person.  We&#39;ve treated him like Kirby.  There isn&#39;t a point at <br/>\nwhich he becomes Kirby, or becomes a real person.  He already is.<br/>\n<br/>\nIt&#39;s our duty and privilege and joy to help him learn about the world, to <br/>\ngive him a safe haven and a launchpad.  <br/>\n<br/>\n&lt;&lt;&gt;To me, these are routines that support our unschooling lifestyle.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I don&#39;t see them competing with it at all.&gt;&gt;<br/>\n<br/>\n </span></blockquote>That wasn&#39;t Pam, that was Pam quoting.<br/>\n<br/>\nI think it&#39;s not a matter of &quot;competing,&quot; it&#39;s a philosophical matter.<br/>\n<br/>\nIf one doesn&#39;t believe that children can self-regulate as to sleeping or <br/>\neating, can they really believe that they will self-regulate watching movies <br/>\nor playing on the computer?   Will they believe that reading can happen <br/>\nwithout a schedule imposed from outside if they don&#39;t think a child will go <br/>\nto sleep when he&#39;s sleepy?  <br/>\n<br/>\nWe were lucky to have tried the flexibility about eating and sleeping before <br/>\nKirby was school-age, and I think that helped make unschooling really easy to <br/>\ntrust.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"Pam Hartley &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Kids & Respect & Stuff","postDate":"1043309854","msgId":55850,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBIOTUwMEQzSFIxQjlTQG10YTUuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":0,"nextInTopic":55927,"prevInTime":55849,"nextInTime":55851,"topicId":55850,"numMessagesInTopic":0,"msgSnippet":"Julie, I m combining two of your posts for my own selfish convenience. ;) ... What is the consequence if you or your husband is repeatedly careless? I assume","messageBody":"<div id=\"ygrps-yiv-1605388918\">Julie, I&#39;m combining two of your posts for my own selfish convenience. ;)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In our home, we do have family policies such as returning what<br/>\n&gt; you use or lose the privilege of using it. We are grace-oriented<br/>\n&gt; and will often say, &quot;Hey you left this out; come put it away.&quot; But if<br/>\n&gt; a child is being repeatedly careless, then there is discussion<br/>\n&gt; and a consequencelosing the privilege of borrowing for<br/>\n&gt; awhile.<br/>\n<br/>\n </span></blockquote>What is the consequence if you or your husband is repeatedly careless? I<br/>\nassume that occasionally happens (I know I can be careless, as can my<br/>\nhusband).<br/>\n<br/>\nProbably it&#39;s a natural consequence -- you leave something out that gets wet<br/>\nin the rain, you have to buy a new one. I don&#39;t know what grace-oriented is,<br/>\nbut I can tell you that here I&#39;m a little obsessive about our family board<br/>\ngames, etc. I like them to be put away right away, so pieces aren&#39;t lost.<br/>\n<br/>\nSo, when my daughters were old enough to take out a game, I&#39;d ask them to<br/>\nput it away right away when they were done. If it wasn&#39;t, I&#39;d pick it up and<br/>\njust mention it to them later (&quot;I put Chutes and Ladders away for you.&quot;).<br/>\nSometimes I&#39;d ask them to. The result of this is that at 8 and 5 I almost<br/>\nnever have to pick up any game pieces. I don&#39;t bother about most other<br/>\nthings, I&#39;m only that way about games. &lt;g&gt; But they knew it was important to<br/>\nme, and they understand why, and they are cheerfully accommodating me. If I<br/>\nhad set up a punishment situation (&quot;You left Chutes and Ladders out for the<br/>\nfifth time this week, now you can&#39;t play it tomorrow.&quot;) it would have<br/>\ndevolved from them doing me a kindness to something far yuckier that I&#39;d<br/>\nrather not have in our relationship.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I feel similarly about cleaning up after meals and doing a<br/>\n&gt; once-a-day pick up so that we start fresh each day with cleared<br/>\n&gt; counters and floors. I&#39;ve shared with the kids that this is how I<br/>\n&gt; function best as their mother and so we all do it together. I<br/>\n&gt; somehow have gotten the impression that some here would see<br/>\n&gt; that as coercion. I simply see it as a family practice.<br/>\n<br/>\n </span></blockquote>If your husband said to you, &quot;I function best as a husband if every day you<br/>\nand I clean up the yard&quot; and you have no choice, is that coercion, or a<br/>\nfamily practice?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; When we discussed chores etc. before, there was<br/>\n&gt; significant resistance on this list to &quot;imposing *anything*. So this<br/>\n&gt; is why I think there can be confusionwhy a mother would<br/>\n&gt; wonder if she should limit a child jumping on her bed.<br/>\n<br/>\n </span></blockquote>It&#39;s her bed, you see. If my daughters don&#39;t want me to do something to<br/>\ntheir beds, I won&#39;t (including jumping on it, making it with sheets they<br/>\nthink are ugly, whatever) so if I tell them I&#39;d rather they not do something<br/>\nto mine, they listen. If they didn&#39;t, I&#39;d stand up for my rights to an<br/>\nunjumped bed, just like if ANYONE (husband, friends, children) was doing<br/>\nsomething to me or my immediate and sole possessions that I didn&#39;t like, I&#39;d<br/>\nsee that they stopped.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; To my way of thinking, the philosophy of unschooling is one that<br/>\n&gt; supports our family values. It isn&#39;t the ideology that supercedes<br/>\n&gt; who we are as individuals. I want to blend the philosophy with<br/>\n&gt; what I realisitically know I need to function well with the kids.<br/>\n<br/>\n </span></blockquote>What about what they need to function well with you? What if one of your<br/>\nchildren realistically needs to stare out the window and not get involved<br/>\nwith cleanup 6 days next week. Where do his or her needs fit in? What if<br/>\nthey can&#39;t articulate them?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do you see it? Do you hear the tension being felt here? Is it<br/>\n&gt; &quot;imposing on a child&quot; to say, &quot;We take care of each other&#39;s<br/>\n&gt; posessions or you won&#39;t get to use them&quot;? I think so.<br/>\n&gt;<br/>\n&gt; Do some unschooling families set routines that support the<br/>\n&gt; functioning of the home that involve their kids? I think so.<br/>\n<br/>\n </span></blockquote>All unschooling families do, I imagine. But the key is &quot;families set<br/>\nroutines&quot; not &quot;mom sets routines that are most appealing to her and everyone<br/>\nelse falls in or else they lose things or are otherwise punished.&quot;<br/>\n<br/>\n:::snip to next post:::<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;On the other hand, one of the things that concerns me is that I<br/>\n&gt;hear women talking about children as though they are<br/>\n&gt; little adults. Kids are notoriously poor at imagining future<br/>\n&gt; They don&#39;t always tie past behavior with present<br/>\n&gt; results. (Sleep is an easy example of this, particularly with young<br/>\n&gt; kids.) They often won&#39;t try something new (as in food) just based<br/>\n&gt; on it&#39;s color. They often aren&#39;t conscious of other people&#39;s<br/>\n&gt; possessions or even their own. (I&#39;m talking about young children<br/>\n&gt; especially--under 10).<br/>\n<br/>\n </span></blockquote>I often won&#39;t try a new food based on color, or name of the food, or smell.<br/>\nSometimes, I stay up way too late even though I know I&#39;ll feel awful the<br/>\nnext day when I have to get up early for some reason.<br/>\n<br/>\nChildren are young, less experienced humans. So yes, they are &quot;little<br/>\nadults&quot;. They can and will learn to listen to their own bodies, to treat<br/>\nfamily members with respect, etc., just as an adult learns the things they<br/>\nneed to function.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Certainly I help them to put things away, I allow them to leave out<br/>\n&gt; a game over a couple of day period if they are in the middle. I&#39;m<br/>\n&gt; not talking about rigidity. I&#39;m talking about consideration for the<br/>\n&gt; fact that seven people are sharing this space together.<br/>\n<br/>\n </span></blockquote>They didn&#39;t choose to have seven people share the space. They are living<br/>\nwith a reality of a large family that was not their option or decision, nor<br/>\nshould it be their burden in any way you can help it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &#92;Setting a bedtime has helped my kids sleep well and spend the<br/>\n&gt; next day in good spirits. If a child is surprisingly alert one night,<br/>\n&gt; I might suggest she page through a book until she sleeps, or I<br/>\n&gt; might rube her back and sing to her. But having her in bed at<br/>\n&gt; 8:30 or 9:00 is important to her and to me, whether she totally<br/>\n&gt; gets why or not. She is willing and that&#39;s because we take great<br/>\n&gt; care in not laying a big burden of expectations on her in all her<br/>\n&gt; other waking hours. It&#39;s just the routine.<br/>\n<br/>\n </span></blockquote>Having her in bed at 8:30 or 9:00 is important to her how? If someone else<br/>\nset your bedtime, would you resent it? What if you weren&#39;t tired? What if<br/>\nyou really wanted to finish a project but someone else was saying, &quot;Nope,<br/>\nclock says 9 p.m., in bed with you.&quot; What if someone else got to decide<br/>\nthese important and personal things for you?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;To me, these are routines that support our unschooling lifestyle.<br/>\n&gt;I don&#39;t see them competing with it at all.<br/>\n<br/>\n </span></blockquote>If you set your own routines for the things that are important to you, and<br/>\nthe kids set their routines for the things they want to do and that are<br/>\nimportant to them, and you simply ask if someone will help you as you need<br/>\nthem, as you go through your day, just as they ask you for help as they go<br/>\nthrough theirs, you are likely to get help in my experience. There are<br/>\nunschoolers with large families and it really does work.<br/>\n<br/>\nI know this all sounds abrupt -- it&#39;s late :) and I want to get it sent. I<br/>\nam not intending to sound snippy.<br/>\n<br/>\nPam</div>","specialLinks":[]}],"prevTopicId":54825,"nextTopicId":55781}}