{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"faith vs. critical thinking (long)","postDate":"1090167539","msgId":96447,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1LjVjNTU5NjBiLjJlMmJmY2YzQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":96446,"nextInTime":96448,"topicId":96447,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/18/2004 9:26:41 AM Mountain Daylight Time, ecsamhill@earthlink.net writes: There are places where it is considered virtuous and even pious","messageBody":"<div id=\"ygrps-yiv-1765694183\">In a message dated 7/18/2004 9:26:41 AM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\nThere are places where it is considered virtuous and even pious to &quot;take <br/>\nthings on faith&quot;, but this isn&#39;t one of them.<br/>\n------------------<br/>\n<br/>\nThere are people in whose word I have great faith.  There are 85% reliable <br/>\npeople, whom I might press, question, or verify if the info is crucial and I&#39;m <br/>\ngoing to act on it.  There are WAY unreliable people in my life, and I won&#39;t <br/>\nact on their reports.<br/>\n<br/>\nThat kind of knowledge and experience affect faith.  <br/>\n<br/>\nI have great faith in my kids&#39; reports of what they did or what they saw.  <br/>\nGiven many opportunities to be dishonest they have not been.  If Holly or Marty <br/>\nbrought me change and said he didn&#39;t have a receipt, I wouldn&#39;t even count it. <br/>\n They are scrupulous with money and accounting.  Kirby is more likely to keep <br/>\nthe change, but to buy me lunck or give me gas money another time later.  <br/>\nThat&#39;s not a problem for me either.  He has money of his own.<br/>\n<br/>\nIt&#39;s not a lack of faith that would make me question them about something <br/>\nthey didn&#39;t know or experience directly.  <br/>\n<br/>\nMarty used to kind of bluff historical fact, and I would press him or look it <br/>\nup and show him he was wrong, and should say &quot;I think&quot; instead of &quot;was&quot; which <br/>\ntotally gets him off the hook when he&#39;s wrong.<br/>\n<br/>\nI e-mailed Keith and Holly witha  correction after a discussion about the two <br/>\nRoosevelt presidents.   Holly asked if Teddy was FDR&#39;s dad, and I said uncle. <br/>\n Turned out I was wrong.  He was Eleanor Roosevelt&#39;s uncle.  She was born <br/>\nRoosevelt..  The president gave her away at her wedding.   Franklin was her <br/>\ndistant cousin, so he was also a distant cousin (fifth, I read when I looked it up) <br/>\nof Theodore.<br/>\n<br/>\nI wan&#39;t very embarrassed to have made the mistake.  I wasn&#39;t an eye-witness. <br/>\nI didn&#39;t swear an oath. I had just mis-remembered what I had read years ago.  <br/>\nAnd I was willing to double-check my own answer and amend it.<br/>\n<br/>\nLast week Marty had role-playing kids over and he yelled outto me from the <br/>\nnext room, &quot;Mom what&#39;s a buckboard?&quot;  They were playing Deadlands, a wild west <br/>\nfantasy game.  I poured forth an answer, but realized nobody had ever asked me <br/>\nthat before and I had never had a true need to know. I told them it was an <br/>\nuncovered four-wheeled  bench in front, bed in back, kind of like a basic <br/>\npickuptruck now.   So when I got a free spot, I went to google images and then to <br/>\ndictionary definitions.  What I had described was a buckboard, but there was also <br/>\nanother type with just a bench and no box/wagonbed.   So I went and told <br/>\nMarty and the other guys that though what I had described was right (and it&#39;s what <br/>\nthey needed anyway, because they needed to imaginarily carry an imaginary <br/>\nwounded or dead or enchanted body), that it really had to do with the type of <br/>\nsuspension and the wagonbed wasn&#39;t a necessity.<br/>\n<br/>\nYesterday I had a bad conversation with Keith&#39;s longtime best friend, who was <br/>\nthe best man at our wedding 20 years ago.  He is accidentally, at the age of <br/>\n47, about to have his first child.   They&#39;re not being thoughtful, and they&#39;ve <br/>\ndone very little research.  Many things he indicated in that conversation <br/>\ndisturbed me, but one thing he said was the kid will be confused (the mom is <br/>\nApache and two aunts and her mom plan to take turns taking leave from work to help <br/>\nher--they all work for the tribe, mostly in the schools, and Bob works there <br/>\ntoo, formerly as a teacher and now as the computers guy).  So yeah, confusion, <br/>\nno planning.  But Bob said without joking &quot;I&#39;ll just tell him to believe what <br/>\nI tell him and not the rest.&quot;<br/>\n<br/>\nI never expect my children to believe what I say because I say it.  If they <br/>\nhave faith in my accounts or my opinions, it is or will be ultimately because <br/>\nof their experience in finding that what I said matched their own perceptions <br/>\nor what they double-checked later.  I don&#39;t ask to take what I say on faith, <br/>\nneither about which of their friends might be bad influences, or who Teddy <br/>\nRoosevelt&#39;s relatives were, or what a buckboard is.<br/>\n<br/>\nHe also talked about chores (the baby isn&#39;t even born) and said &quot;I was a <br/>\nslave for my parents, and my kid&#39;s going to be raised just like I was.&quot;  I said I <br/>\nthought it was a really bad idea.  <br/>\n<br/>\nI sent him some circumcision links, and looked at some other more attachment <br/>\nparenting things, and my chores page, but decided he&#39;s just not ready to think <br/>\nabout it yet. I did tell him not to make any big declarations about what he <br/>\nwould do when the child is six or twelve, because he hasn&#39;t even met him or her <br/>\nyet, and he should make his best decisions as time goes on instead of making <br/>\nadvance plans.  That made sense to him.<br/>\n<br/>\nHe expressed hope/faith that kid would be reading in just a few years.  I <br/>\nsuggested he might want to go to my website at some point and read about reading. <br/>\n He knows some kids who are perfectly smart never read well; he taught <br/>\nEnglish and has taught ESL (English as a second language) to adults here and in <br/>\nChina.  I was kind enough not to say, &quot;BOB, what good is reading if you&#39;re going <br/>\nto make decisions without any reading/research whatsoever?  Is it just for <br/>\nreading fantasy novels and engine tune-up manuals!?&quot;  I thought it, but I didn&#39;t <br/>\nsay it.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":96420,"nextTopicId":96454}}