{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Homeschooling is being turned into a custody issue - any suggestions?","postDate":"1264531697","msgId":113387,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBGRkRBMUZBLUZFQTQtNDg4OS04NDg3LTVEMkQ1NEI4RkFGNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhqbjh0MitkcDBuQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqbjh0MitkcDBuQGVHcm91cHMuY29tPg=="},"prevInTopic":113386,"nextInTopic":0,"prevInTime":113386,"nextInTime":113388,"topicId":113386,"numMessagesInTopic":0,"msgSnippet":"-=-Hi, after 6 years of wishing we could homeschool my stepson (12), his biomom (we have 50/50 joint custody) agreed to it this past fall. I have been doing","messageBody":"<div id=\"ygrps-yiv-809186246\">-=-Hi, after 6 years of wishing we could homeschool my stepson (12),  <br/>\nhis biomom (we have 50/50 joint custody) agreed to it this past fall.  <br/>\nI have been doing most of the work, with his dad helping when he can.  <br/>\nThe biomom hasn&#39;t even been checking to see that he&#39;s completed his  <br/>\nassignments when he&#39;s with her. (Although I&#39;m an unschooler at heart,  <br/>\nbiomom so completely does not understand homeschooling that we have  <br/>\nhad to use a curriculum as his base so that she can see something she  <br/>\nunderstands when he is with he-=-<br/>\n<br/>\nIf she&#39;s not checking &quot;assignments,&quot; maybe you could let them go, then?<br/>\n<br/>\n-=-Due to some inappropriate disciplinary actions that the biomom has  <br/>\ntaken against my stepson, we filed an order of protection against her  <br/>\non his behalf. We have not had the hearing for that yet, but she has  <br/>\nstated that because he is homeschooled and my husband is going to  <br/>\nschool full time and I am working full time, my stepson will be home  <br/>\nfor the majority of the day by himself and she would like full custody  <br/>\nso he can stay with her parents during the day and they can oversee  <br/>\nhis homeschooling. Her parents are very against homeschooling, so I  <br/>\ncan see where that will end up-=-<br/>\n<br/>\nThis is really about legalities and not about how learning works, so  <br/>\nalthough some people here might have ideas for you, it&#39;s not within  <br/>\nthe purview of the Always Learning list, really.<br/>\n<br/>\nHomeschooling will always be turned into a custody issue.<br/>\n<br/>\n-=-My one thought so far has been to approach a woman who lives across  <br/>\nthe street and homeschools her 4 kids and see if she would be willing  <br/>\nto &quot;babysit&quot; him. The thing is that he&#39;s fine by himself, and I check  <br/>\nin with him on a regular basis. It&#39;s not illegal; in fact, at age 12,  <br/>\nif I&#39;m not mistaken, he is legally allowed to babysit other kids for  <br/>\nmoney, at night! Anyway, does anyone have any suggestions?<br/>\n-=-<br/>\n<br/>\nIf he stays with the woman who is babysitting, maybe he could be her  <br/>\nhelper, if he&#39;s a responsible and fun kind of kid, so that you  <br/>\nwouldn&#39;t have to pay to have him there, and maybe he could get paid  <br/>\n(maybe by you) for helping out there.  Or if he won&#39;t be so much help  <br/>\nas hindrance at the other house, still it doesn&#39;t need to have  <br/>\nanything to do with his homeschooling.  There are a lot of hours in  <br/>\nthe week outside of traditional &quot;school hours.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":296689955,"authorName":"gracehopefaithjoy","from":"&quot;gracehopefaithjoy&quot; &lt;gracehopefaithjoy@...&gt;","profile":"gracehopefaithjoy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Homeschooling is being turned into a custody issue - any suggestions?","postDate":"1264527074","msgId":113386,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqbjh0MitkcDBuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":113387,"prevInTime":113385,"nextInTime":113387,"topicId":113386,"numMessagesInTopic":0,"msgSnippet":"Hi, after 6 years of wishing we could homeschool my stepson (12), his biomom (we have 50/50 joint custody) agreed to it this past fall. I have been doing most","messageBody":"<div id=\"ygrps-yiv-1798041496\">Hi, after 6 years of wishing we could homeschool my stepson (12), his biomom (we have 50/50 joint custody) agreed to it this past fall. I have been doing most of the work, with his dad helping when he can. The biomom hasn&#39;t even been checking to see that he&#39;s completed his assignments when he&#39;s with her. (Although I&#39;m an unschooler at heart, biomom so completely does not understand homeschooling that we have had to use a curriculum as his base so that she can see something she understands when he is with her.)<br/>\n<br/>\nDue to some inappropriate disciplinary actions that the biomom has taken against my stepson, we filed an order of protection against her on his behalf. We have not had the hearing for that yet, but she has stated that because he is homeschooled and my husband is going to school full time and I am working full time, my stepson will be home for the majority of the day by himself and she would like full custody so he can stay with her parents during the day and they can oversee his homeschooling. Her parents are very against homeschooling, so I can see where that will end up.<br/>\n<br/>\nMy one thought so far has been to approach a woman who lives across the street and homeschools her 4 kids and see if she would be willing to &quot;babysit&quot; him. The thing is that he&#39;s fine by himself, and I check in with him on a regular basis. It&#39;s not illegal; in fact, at age 12, if I&#39;m not mistaken, he is legally allowed to babysit other kids for money, at night! Anyway, does anyone have any suggestions? <br/>\n<br/>\nThanks,<br/>\nMichelle</div>","specialLinks":[]}],"prevTopicId":113250,"nextTopicId":113388}}