{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":36888606,"authorName":"Luz Shosie and Ned Vare","from":"Luz Shosie and Ned Vare &lt;nedvare@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Info Re: Number 2108","postDate":"1023940414","msgId":38325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5MkQ4RjVCLkFGNyVuZWR2YXJlQG50cGx4Lm5ldD4=","inReplyToHeader":"PDEwMjM4NzI4ODUuNTY0LjQwMDE3Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":38324,"nextInTime":38326,"topicId":38325,"numMessagesInTopic":0,"msgSnippet":"Group, Luz and I will be on a panel for aHSing information night in a few days. The organizer sent out some questions that she thought should be answered","messageBody":"<div id=\"ygrps-yiv-143228061\">Group, <br/>\nLuz and I will be on a panel for aHSing information night in a few days. The<br/>\norganizer sent out some questions that she thought should be answered during<br/>\nthe discussion. Maybe these will interest some of our egroup members. If you<br/>\ndon&#39;t live in CT, you might want to begin at #4.<br/>\n<br/>\n<br/>\nQuestions for Homeschooling Information Session<br/>\n<br/>\n                   <br/>\n1. What is the law in Connecticut on homeschooling?<br/>\nA. There is no law in CT about homeschooling (and that is a good thing). Any<br/>\nanswer to this question needs to say that the law that covers homeschooling<br/>\nis the one that covers all other forms of education. It was written in 1650<br/>\nand is still in effect. It says, simply that parents (or guardians) are<br/>\nresponsible for the education of their children, whether or not they send<br/>\nthem to school. <br/>\nThe answer would usually continue to address the &quot;guidelines&quot; for<br/>\nhomeschooling that were established in 1990, and it must be noted that<br/>\nguidelines are not laws, and that the guidelines are not in any way to be<br/>\nconstrued as requirements by homeschoolers, but only suggestions. If parents<br/>\nwish to use them or follow them, they can do so voluntarily. Some parents<br/>\ndo, some don&#39;t.<br/>\n<br/>\n2. Does the school provide materials?<br/>\nA.  No, and if you homeschool, you probably won&#39;t want to have &quot;public<br/>\nschooling&quot; at home, would you?<br/>\n<br/>\n3. Is testing required?<br/>\nA. No, not in CT. None at all. There are no requirements at all, other than<br/>\nthe state law that says your child must instructed in the basic skills, plus<br/>\nhow government works, but it doesn&#39;t say how, or how much, or when.<br/>\n<br/>\n4. My child is currently in school and receiving special education services.<br/>\nIf we homeschool, will the school discontinue them?<br/>\nA.  Yes. Unless your child is physically handicapped, the chances are<br/>\nextremely high that s/he does not belong in &quot;special&quot; education. If s/he has<br/>\nschooling problems, they were almost certainly caused by the school, and<br/>\nwill not ever be solved there, but only made worse. Getting away from<br/>\nSpecial Ed is one of the best reasons to homeschool your child.<br/>\n<br/>\n5. My child is an introvert, and generally isn&#39;t very social.  Although he<br/>\nwants to homeschool, I am reluctant because I think he needs school for<br/>\nsocialization.  I am concerned he would be alone too much as a homeschooler<br/>\nwith just his brother and me for company.  I am anxious for your thoughts on<br/>\nthis.<br/>\nA.  &quot;Socialization&quot; is a selling point for public schools, but is that what<br/>\nthey offer? Sitting with same age, same ability children all day in rows of<br/>\ndesks in bleak buildings (even &quot;decorated&quot; ones) and being told to sit still<br/>\nand keep quiet and that what you think or questions you have are not<br/>\nimportant, is not socialization. Being outside of that place, being with<br/>\npeople of all ages doing all sorts of real life activities in a variety of<br/>\nsettings is socialization -- learning how people behave in actual life<br/>\nsituations. (What&#39;s wrong with not being &quot;social&quot;? -- lots of kids are not<br/>\nsocial. Usually, a child does just fine with one friend to get together with<br/>\nwhen they can. They don&#39;t need to be in a crowd of peers all the time, or<br/>\neven at all.)<br/>\n<br/>\n6. I was not particularly good in math or science when I was in high school.<br/>\n How will I be able to teach subjects such as algebra or physics to my<br/>\nchild? <br/>\nA. It&#39;s not your job. (How much algebra and physics have you used since<br/>\nschool? Hmmm?) As a homeschooling parent, you are responsible only for what<br/>\nyou can do, and for other things, you find others who can help. First,<br/>\nunderstand that in schools, not every child is taught every subject. Many<br/>\nfail; many teachers are terrible and do not teach well, and so the children<br/>\nare neglected and denied much of what parents expect them to be given. The<br/>\nacademic level of MOST schools in America (including the so-called good<br/>\nones) is POOR. That is the best reason to homeschool for most parents. With<br/>\nhomeschooling, parents can at least have control over what is taught and<br/>\nhow, and (don&#39;t forget) they also control what is NOT taught that they don&#39;t<br/>\nwant to be taught.<br/>\n <br/>\n8. How do you teach several children who are all at different grade levels?<br/>\n(Unit studies? Prepared curriculum?)<br/>\nA. Our son&#39;s favorite expression regarding his own education was this (from<br/>\nWinston Churchill) : &quot;I love to learn, but I hate being taught.&quot;  Most<br/>\nparents, after they have been homeschooling a while, realize that most<br/>\nlearning does not require teaching. Another fact is that school subjects do<br/>\nnot relate to children&#39;s interests. Learning happens when the learner is<br/>\ncurious and interested in something; it does not happen when s/he is not<br/>\nengaged. Thus, education is up to the learner, not the &quot;schooler.&quot;  Unit<br/>\nstudies and prepared curriculum are tools for the control of masses by<br/>\nuncreative school employees. Use real books about real subjects by real<br/>\nauthors. In other words, get your information from libraries, not curriculum<br/>\nsalespeople or schools.<br/>\n<br/>\n9. What is unschooling?<br/>\nA. First, Homeschooling does not necessarily mean Schooling at Home. If you<br/>\nchoose homeschooling, you probably don&#39;t want to turn your home into the<br/>\nthing you&#39;re getting away from.<br/>\nAs for Unschooling: go to www.borntoexplore.org/unschool -- it&#39;s where Luz<br/>\nand I explain it in some depth.<br/>\nIn general, it is anything that doesn&#39;t look or feel like school. It is<br/>\nGrowing Without Schooling, sometimes referred to as learner-directed living,<br/>\nor self-education, or child-led learning. The key is trusting the child to<br/>\nfollow his/her curiosity wherever it leads. For parents, it can mean<br/>\nlearning from (or with) your child. Unschooling means allowing your child to<br/>\nbe responsible for his/her own learning instead of doing what someone else<br/>\ntells him/her for all those years. It means &quot;start your own life NOW&quot;<br/>\ninstead of waiting for someone to tell you when it should start -- usually<br/>\nwhen they&#39;re finished with you. This idea worked well for our son. He was<br/>\nalways glad that he was in charge of his own learning.<br/>\n<br/>\n10. What are some other teaching methods? (Classical, Charlotte Mason,<br/>\nMontessori, Waldorf, Eclectic)<br/>\nA.  I have no answer here. I&#39;m an unschooling advocate. Our son quit<br/>\nMontessori at age four after ten sessions. After that, he took charge of his<br/>\nown life and learning.<br/>\n <br/>\n11. How do I choose a teaching method?  What are the advantages and<br/>\ndisadvantages of each?<br/>\nA. Same. Every time we tell our child to think about a certain thing, we<br/>\ndeny them a chance to investigate something that interests them.<br/>\n<br/>\n12. I have such a hard time getting my kids to do homework now, when they<br/>\nare in school, that I cant imagine getting them to do their schoolwork if I<br/>\nhomeschool them.  How do you motivate your kids to do their work?<br/>\nA. Homework: No. NO!  Homework is the school system&#39;s way of controlling<br/>\nparents along with their children, making everyone&#39;s life totally<br/>\npreoccupied with SCHOOL instead of real life. In addition, being a parent is<br/>\ndemanding enough. Giving care, comfort, nurturing, etc, is plenty and it is<br/>\nwhat children need and is satisfying for parents. But when you turn yourself<br/>\ninto your child&#39;s taskmaster by requiring him/her to do schoolwork -- and<br/>\nhomework on top of that -- you create a huge risk of ruining your<br/>\nrelationship with your child. That&#39;s another good reason to UNschool. Be a<br/>\nparent, be your child&#39;s protector, role model, comforter. Do not be his/her<br/>\nboss or critic or judge. Be the person they ask questions of, not the person<br/>\nasking them questions, or deciding what they should think about. Trust them.<br/>\nGive them space. They&#39;ll love you for it...always.<br/>\n<br/>\n13. How do you choose which homeschool resources, books, and curricula to<br/>\nuse, and where do you get them?<br/>\nA. It doesn&#39;t matter.  (But if you must, go to a homeschool fair and buy<br/>\nused books from other homeschoolers -- it supports the organization, too)<br/>\nCurricula are all bad and limiting. Let your child decide what is<br/>\ninteresting in the world, and go to the library or the local museum or<br/>\nsomeplace else in order to find out what s/he wants to know about that<br/>\nsubject. HINT: It will never be algebra or french or social studies or etc,<br/>\netc. It will be airplanes, or dinosaurs or money or the sky or etc, etc.<br/>\nLearn with him/her about his/her interests.<br/>\n <br/>\n14. How do homeschoolers get a high school diploma?<br/>\nA. Homeschoolers don&#39;t get high school diplomas. That&#39;s another good thing,<br/>\nbecause almost nobody cares about them. What some hsers do is take the GED<br/>\n(State General Equivalency Test) and get a diploma from the state. The test<br/>\nis not hard -- it&#39;s designed at the eighth grade level.<br/>\n <br/>\n15. How do homeschoolers get into college?<br/>\nA. College takes some planning. There are counselors who can help, but you<br/>\ncan research it with your kid. More and more homeschoolers are entering<br/>\ncollege earlier than kids who go to school. Kids who have been in control of<br/>\ntheir education for a long time are especially well equipped and prepared<br/>\nfor college life, and do well. Colleges also are now aware that<br/>\nhomeschoolers are making a great impression with colleges, and are actually<br/>\nin demand, especially at good independent colleges.<br/>\n <br/>\n16. My husband is against homeschooling but I think it would be best for our<br/>\ntwo children.  How do I convince him to let me try it?<br/>\nA.  I can&#39;t know your husband, but he sounds like me -- I just didn&#39;t get it<br/>\nat first. Be patient as long as you can, then have him call me and Luz to<br/>\nget a copy of our homeschooling packet of information. Email for it at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nedvare@...\">nedvare@...</a> if you&#39;re in a rush.<br/>\nMeanwhile, ask him what he wants the children to learn, and then make it his<br/>\njob to teach it to them. It shouldn&#39;t take him long to realize that there<br/>\nreally isn&#39;t much that schools teach, and there&#39;s so much more to learn<br/>\nOUTSIDE school!<br/>\n<br/>\n17. Although I want to homeschool, I am concerned that I will never have any<br/>\ntime to myself.  How do other homeschoolers deal with that?<br/>\nA. Who is telling you that you have to spend all your time schooling. We<br/>\nraised our kid without ANY schooling -- we lived our lives and he joined in<br/>\nor didn&#39;t, as he wanted. In fact, time spent schooling is bad for everyone;<br/>\ntime spent doing other stuff is good for everyone. Schooling is a stupid<br/>\nactivity. Ask any kid. Schooling is the slowest possible way to learn. Don&#39;t<br/>\nwaste everyone&#39;s time with it.<br/>\n<br/>\n18. What made each of you decide to homeschool?<br/>\nA. Once we realized what an unhappy and unproductive experience school was<br/>\n(even accounting for the good moment with friends and a few satisfactions)<br/>\nwe saw schooling as mere babysitting by strangers and warehousing of<br/>\nchildren by not well educated adults who couldn&#39;t get other indoor work. On<br/>\nthe plus side, homeschooling allows parents to truly raise their own<br/>\nchildren, to get to know them well and not let the state take them<br/>\nemotionally away from them. Did you have children so that you could give<br/>\nthem to the government to raise for you, badly?<br/>\n<br/>\n19. What, in your opinion, have been the greatest benefits of homeschooling<br/>\nfor you/your family?<br/>\nA. Benefits: Mutual respect; happiness; trust; a lasting good understanding<br/>\nbetween parents and child. As for academics, schools can&#39;t touch<br/>\nhomeschooling by conscientious parents. Public schools do not educate; they<br/>\nmerely indoctrinate children.<br/>\nThe public school system is based on deceit, force and coercion, not love or<br/>\ntrust.<br/>\nHomeschooling: No institutional education system can compare to it.<br/>\n<br/>\nBest wishes, Ned Vare</div>","specialLinks":[]}],"prevTopicId":38200,"nextTopicId":38329}}