{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Children staying home... ?","postDate":"1184422084","msgId":29876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNjgwMWM3YzYyMCQ2NTcxZDMwMCQ3OTBhMWU0MUB1c2VyZTM4NWNiM2FkMD4=","referencesHeader":"PGY3OGFoOCtzYXF0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":29875,"nextInTime":29877,"topicId":29876,"numMessagesInTopic":0,"msgSnippet":"My parents were very authoritarian, etc. while we were growing up (I ll let you read between the lines on that) BUT they never stopped giving to all 4 of us.","messageBody":"<div id=\"ygrps-yiv-1757494726\">My parents were very authoritarian, etc. while we were growing up (I&#39;ll let you read between the lines on that) BUT they never stopped giving to all 4 of us.  My mom still gives when she can - mostly to the grand kids but last summer I was at her house and she had bought some shorts on sale - she told me to pick out a pair for myself.  Nothing much, probably around 10.00 worth but it thrilled me to know she thought of me in such a simple way.  I&#39;m sure I have way more money than she does.  My dad would just up and pay for lunch or some such, one time he came to our home and just gave me $100.00 - not sure why to this day - I was not needy at the time.  He took me shopping one time and let me pick out an outfit (my dad hated to shop) - I was married and had a good job.  He helped my younger sister multiple times (paid her rent, bought her a vehicle, etc.) as it seems she is always in a financial bind.  I&#39;ve always done these same types of &quot;small&quot; things for them through out my childhood and adulthood.<br/>\n<br/>\nThey never kicked any of us out of the house nor charged rent - I don&#39;t remember being responsible for any expenses such as car insurance (I bought my own car though) until I left home after college.  In fact dad gave me a credit card of his when I left for college - back in those days (1980) one could use a parent&#39;s card and just sign their name and all was OK.  He trusted me to not over use it and I didn&#39;t - I only used it for gas to get back and forth to college (a 12 hour drive).<br/>\n<br/>\nGuess what, when he got ill (a nasty illness that lasted 7 years) all 4 of us children gave him 100% of our support/help.  We were there for him 24/7.  My youngest sister moved her family in with him and that helped a lot for 2 years.  He ended up in a nursing home at age 65 and my brother and I set up a schedule so one of us went every day for 2 years until he passed away.  My brother and I paid for many comfort items for him (TV, clothing, books on tape, took him for rides out in the country to look at farm fields (he was a farmer) or anything to get him out of there for a few hours now and then, we&#39;d even push him in his wheelchair down the street to a park, brought him meals and treats from outside the home (he loved for us to all share ice-cream), had every holiday meal there as a family, made sure he got doctor and dental visits, monitored the home to make sure he was well cared for, etc.  Some things took money, some took grit and determination, some just took heart.<br/>\n<br/>\nI&#39;m saying all this because my father always put his children first and he reaped what he sowed - we returned in like kind when he really needed us. (mom walked out on him in 1980 so he did not have a spouse to take care of him).  He never said &quot;why should I pay for that&quot; to us and we never said it to him.<br/>\n<br/>\nLisa W.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":29781,"nextTopicId":29854}}