{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Unschooling sex","postDate":"1056893742","msgId":75715,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhNC4xNmFjNTFmYi4yYzMwNDUyZUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":75714,"nextInTime":75716,"topicId":75715,"numMessagesInTopic":0,"msgSnippet":"Do we unschool sex education? Well, here s the deal.I think unschooling is supporting one another in learning through passion and relationship. So we talk to","messageBody":"<div id=\"ygrps-yiv-1025857969\">Do we unschool sex education?<br/>\n<br/>\nWell, here&#39;s the deal.I think unschooling is supporting one another in <br/>\nlearning through passion and relationship. So we talk to one another all the time. I <br/>\ninitiate conversations about all kinds of things, as does Julian. Sex and <br/>\ndevelopment are some of those things. Do I always wait for a spark of interest <br/>\nbefore initiating a conversation? Nope. Do I force stuff on Julian he has no <br/>\ninterest in? Also nope, but I have to tell you that something that interests or <br/>\nmatters to the conversation initiator is unlikely to totally disinterest the <br/>\ninitiatee. (Yes, I am pretty sure that&#39;s not a word.)<br/>\n<br/>\nI&#39;ve talked to many adults who remember being unprepared for the changes <br/>\ntheir bodies make in puberty. Most girls are at least warned about menstruation, <br/>\nbut apparently lots of boys aren&#39;t about wet dreams, and are scared that <br/>\nthey&#39;ve started wetting the bed, that they have cancer, etc. I wanted Julian never <br/>\nto have to be afraid of that, and long before it was an issue we talked about <br/>\nit. When it finally happened, he knew immediately what it was, and told us.<br/>\n<br/>\nI also made sure there were good books about puberty, relationships, etc. <br/>\naround. I handed them to Julian (not all at once) and said, &quot;You might be <br/>\ninterested.&quot; He&#39;d usually dash off and read them, rarely, but sometimes, asking <br/>\nquestions.<br/>\n<br/>\nI am a great proponent of Car Sex Education. We have lots of conversations <br/>\nabout sex in the car driving places. Think about it. Uninterrupted time, and the <br/>\ndriver and kid are prevented from much eye-contact, which makes having a <br/>\ncasual conversation about a possibly embarassing subject much easier.<br/>\n<br/>\nI&#39;ve never planned or carried out a structured sex education plan. Just like <br/>\nwe talk about spirituality, what form of matter smoke is, civil rights, <br/>\nwhether Klingon or Esperanto is a more useful or noble second language to learn (I <br/>\nknow, weird kid), we talk. Sexuality is about relationship, and so is learning <br/>\nabout it.<br/>\n<br/>\nSo...yeah. We unschool sexuality. That said, if we can figure out a way to <br/>\npull it off, our church denomination offers a fabulous sexuality program called <br/>\nOur Whole Lives, and I would love to have Julian do it. Not that he can&#39;t <br/>\nlearn otherwise, and not that I would make him if he were disinterested, but <br/>\nbecause it&#39;s such an amazing opportunity.<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":75621,"nextTopicId":23126}}