{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"hsmominoz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Taking tests","postDate":"1022272703","msgId":37390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMS5lMzQ4ZWVhLjJhMWZmZWJmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":37389,"nextInTime":37391,"topicId":37390,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/24/02 2:19:17 PM Central Daylight Time, ... I remember when computers first became mainstream in our school. The library had two or","messageBody":"<div id=\"ygrps-yiv-519039343\">In a message dated 5/24/02 2:19:17 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;    Date: Fri, 24 May 2002 13:10:40 EDT<br/>\n&gt;    From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dbatiste7@...\">dbatiste7@...</a><br/>\n&gt; Subject: Re: Taking Tests<br/>\n&gt; <br/>\n&gt; Sometimes we think of computer experience as sending e-mail, drawing on <br/>\n&gt; paint <br/>\n&gt; and things of that nature. I am speaking of the other computer programs as <br/>\n&gt; well. Don&#39;t you think that kids these days should do more than just play <br/>\n&gt; games on the comp? Shouldn&#39;t they know how to do an excel spreadsheet? Add <br/>\n&gt; some information into Access and all of that good stuff. Most companies <br/>\n&gt; nowadays want someone who has this knowledge base of simple computer <br/>\n&gt; applications. Do you think this is leaning towards forced learning if the <br/>\n&gt; child has no interest in those things?<br/>\n<br/>\n </span></blockquote>I remember when computers first became &quot;mainstream&quot; in our school. The <br/>\nlibrary had two or three Apple 2E&#39;s (I think those were the ones!) and we <br/>\nwould wheel them on carts to our room, team up into groups and spend time <br/>\n&quot;writing&quot; simple programs (you remember the ones? <br/>\n10  x=2<br/>\n20  y=3<br/>\n30  z=5<br/>\n40  x+y<br/>\nand so on.... ) It was all time consuming, boring, and worst of all, the <br/>\ntechnology was obsolete with in months! I hated it, the experience put me off <br/>\ncomputers for years! I didn&#39;t learn to use ANYTHING remotely related to a <br/>\ncomputer for years. I thought it was all mumbo jumbo jargon too far advanced <br/>\nfor my addled brain. I never got the hang of how to write those old simple <br/>\nprograms, I heard all those hurtful comments from my teacher and peers about <br/>\nhow &quot;easy&quot; this all was, and even &quot;babies&quot; could get it, and a person had to <br/>\nbe really &quot;stupid&quot; not to understand and like to use computers. I was 26 <br/>\nbefore I touched a computer again, and I took to it like a duck out of water! <br/>\nI can now fix minor problems (Somehow our cookies setting got changed and <br/>\ntoday I reset it so I could get into our group, I would have never learned <br/>\nhow to do that if someone had said I had to learn it! I did it because I <br/>\nwanted to sign into our group, and Yahoo said if I wanted to play with you <br/>\nall, I had to fix some error, somewhere on my computer or Yahoo wouldn&#39;t let <br/>\nme play!) Our computer is in our dining, craft, freezer, laundry, library <br/>\nroom, the kids sit down and play Sim Park, Lego Harry Potter creator, <br/>\nPuzzlemania.... they sign on to the Internet and IM with their Grandma, and <br/>\nsend their Grandpa funny jokes, they scan and send pictures they have drawn <br/>\nto Grandma and Grandpa, their Aunt sends them links to fun sites and pictures <br/>\nof their Cousin. I didn&#39;t teach them how to do this, and neither did my <br/>\nHusband. Moly (8) and Jack (6) somehow learned to do all this by watching, <br/>\nreading the directions from the computer and trial and error. (the trial and <br/>\nerror part is how I learned to rescue a crashed computer!) I suppose if <br/>\neither of them need to learn how to run a spread sheet they will! (I don&#39;t <br/>\nknow how to do one, if I need to learn I guess I will, until that day...) And <br/>\nthat is how I look at computer literacy for my kids, they at 8 and 6 are more <br/>\ncomputer literate than I was at 14 so I suppose when they are my age they <br/>\nwill be computer geniuses, until then I won&#39;t worry. <br/>\n~Nancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":37347,"nextTopicId":37385}}