{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":0,"authorName":"lite2yu@aol.com","from":"lite2yu@...","replyTo":"LIST","senderId":"PZsDAb0_l3GPl1Q657g9D3INIm3ZKvg2T-r-UB80prhYYikzOO2W58EW1NGxEUgNyBF4d9hy","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;Betterness&quot;","postDate":"1001716515","msgId":26453,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Yy4xYmRmZjhiLjI4ZTY1NTIzQGFvbC5jb20+"},"prevInTopic":26451,"nextInTopic":0,"prevInTime":26452,"nextInTime":26454,"topicId":26398,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/28/2001 6:24:03 PM Eastern Daylight Time, ... It s exactly what I have been discussing. lovemary [Non-text portions of this message have","messageBody":"<div id=\"ygrps-yiv-2131360020\">In a message dated 9/28/2001 6:24:03 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:freeform@...\">freeform@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>It&#39;s exactly what I have been discussing.<br/>\n<br/>\nlovemary<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"freeform@juno.com","from":"freeform@...","replyTo":"LIST","senderId":"536kQCF13E4h0KsiETDNzexFP0mGo29f4q3CBGEDlmnkM67jqoEYsa2k9jK9rcObJmqn_6AsrRU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;Betterness&quot;","postDate":"1001715662","msgId":26451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwOTI4LjE1MjEwNS4tMjU5NTgxLjAuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":26433,"nextInTopic":26453,"prevInTime":26450,"nextInTime":26452,"topicId":26398,"numMessagesInTopic":0,"msgSnippet":"On Fri, 28 Sep 2001 11:12:16 EDT lite2yu@aol.com writes (quoting someone ... is  better than ... I don t thinkt his is the same better we ve been","messageBody":"<div id=\"ygrps-yiv-1315067629\">On Fri, 28 Sep 2001 11:12:16 EDT <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lite2yu@...\">lite2yu@...</a> writes (quoting someone<br/>\nnamed Neil Donald Walsch) :<br/>\n<blockquote><span title=\"ireply\">  &gt; Many people, most people, perhaps . . . seem to think that they are <br/>\n&gt; &quot;better&quot;  than those around them. THey believe that their neighborhood<br/>\n </span></blockquote>is  &quot;better&quot; than <br/>\n<blockquote><span title=\"ireply\"> &gt; the surrounding neighborhood, that their state is &quot;better&quot; than the <br/>\n&gt; neighboring state, and that their nation is better than the next <br/>\n&gt; nation.<br/>\n<br/>\n </span></blockquote>I don&#39;t thinkt his is the same &quot;better&quot; we&#39;ve been discussing.  It&#39;s not<br/>\nthe one I&#39;ve been discussing, anyway. I see a big difference between a<br/>\nperson and a person&#39;s actions. You and I might both bake cakes, and you<br/>\nmight bake a better cake, but that doesn&#39;t mean you&#39;re a better person.<br/>\nBaking skills can be improved and changed, they&#39;re not an unchangeable<br/>\npart of you. Over the years, people have shown me better ways to knit and<br/>\nbowl and write and make coffee and bake pizza... and better ways to be<br/>\nwith my kid, as well. I would be really sad and hurt if my friends saw me<br/>\ndoing something they thought was harmful to my kid - and that&#39;s really<br/>\nwhat this is about, because as an unschooler, I do believe that forcing<br/>\n&quot;schoolwork&quot; is harmful - and didn&#39;t say anything to me, didn&#39;t point out<br/>\nwhat I was doing and why I might want to change it. How would I learn and<br/>\ngrow that way? It would sure be a slow process, for me to have to find<br/>\nall of the answers on my own.<br/>\n<br/>\nAnd of course, like everyone, I always have the right to say, &quot;I hear you<br/>\nsaying that you think it would be better if Cacie had a schedule for<br/>\nsleeping and waking, and I&#39;ll keep it in mind if we start to have issues<br/>\naround fatigue, but right now this works for us.&quot; Although if I said it<br/>\non a list called &quot;The Joys of Scheduling every minute of Your Child&#39;s<br/>\nDay&quot;, then I might wonder what I was doing there...<br/>\n<br/>\nDaron<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/web/.\">http://dl.www.juno.com/get/web/.</a></div>","specialLinks":[]},{"userId":0,"authorName":"Rachel Wolfe Ravenhart","from":"Rachel Wolfe Ravenhart &lt;ravenhart@...&gt;","replyTo":"LIST","senderId":"IW88aTYw6ko1Zmv_d2Bo3xE20CF2pkKdKzbXo_pVSPgah9iN3O6fxzxMxm5GLbqVHmFmPA8PQmzQXlpLhiuJp6nMKNszSJI7TVA4ELvYpWJTvg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;Betterness&quot;","postDate":"1001705842","msgId":26433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCQjREMTcxLjQyNzNGNkI5QGhvbWUuY29tPg==","referencesHeader":"PDcyLjEwODcxZDZkLjI4ZTVlZDUwQGFvbC5jb20+"},"prevInTopic":26431,"nextInTopic":26451,"prevInTime":26432,"nextInTime":26434,"topicId":26398,"numMessagesInTopic":0,"msgSnippet":"Beautifully expressed. I don t think that way at all. But this was a clear example of YOUR meanings, so thank you. *S* Rachel ... [Non-text portions of this","messageBody":"<div id=\"ygrps-yiv-1177385412\">Beautifully expressed. I don&#39;t think that way at all. But this was a<br/>\nclear example of YOUR meanings, so thank you. *S*<br/>\n<br/>\nRachel<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lite2yu@...\">lite2yu@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am posting this as a way to explain a PORTION of how I believe. I am<br/>\n&gt; not<br/>\n&gt; interested in converting anyone to this way of thinking. . . I am not<br/>\n&gt; saying<br/>\n&gt; that what you may believe is wrong or bad or &quot;more evolved&quot;. I am<br/>\n&gt; putting<br/>\n&gt; forth ideas for consideration if so desired. Some people have<br/>\n&gt; expressed<br/>\n&gt; interest and in that vein, here you go. . .<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"lite2yu@aol.com","from":"lite2yu@...","replyTo":"LIST","senderId":"IdYM1glj7q35-3UlJvRP5IYtJQXihCFAZ9Hvy6pBc5fNW8jUrJUL3AQwlkgwGlI_zjjxR-5J","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;Betterness&quot;","postDate":"1001704016","msgId":26431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3LjFiY2Q0MjdlLjI4ZTYyNDUwQGFvbC5jb20+"},"prevInTopic":26421,"nextInTopic":26433,"prevInTime":26430,"nextInTime":26432,"topicId":26398,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/28/2001 2:50:52 PM Eastern Daylight Time, ... It s not a bad word. . . its a concept I dont wish to engage in, one that just doesn t fit","messageBody":"<div id=\"ygrps-yiv-649869968\">In a message dated 9/28/2001 2:50:52 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crma@...\">crma@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; it helps me understand<br/>\n&gt; why &quot;better&quot; is a &#39;bad&#39; word for you.  <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>It&#39;s not a bad word. . . its a concept I dont wish to engage in, one that <br/>\njust doesn&#39;t fit in with Who I Am. <br/>\n<br/>\nAlso, let me just add, that is not something that I am able to put into <br/>\npractice all the time as yet. . . as I have been programmed to believe lots <br/>\nof things, it is at times difficult to totally change old habits, just like <br/>\nit is with unschooling. . . hard to totally get rid of that teacher or school <br/>\nmentality. . . my goal is to just keep at it day in and day out.<br/>\n<br/>\nlovemary<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"XstwnJ0dOMMT6KnjId-knFD7c4dFMUw-vPOhRdm3E8s0DhRM5sAu6SmDY8450xwnNCnDAH0P2qmn","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] &quot;Betterness&quot;","postDate":"1001700219","msgId":26421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Mi4xYjIxZjNkLjI4ZTYxNTdiQGFvbC5jb20+"},"prevInTopic":26398,"nextInTopic":26431,"prevInTime":26420,"nextInTime":26423,"topicId":26398,"numMessagesInTopic":0,"msgSnippet":" This has a lot to do with language and concept.  The parts about religion, and","messageBody":"<div id=\"ygrps-yiv-1244868650\">&lt;&lt; As with most cultural myths, this story has nothing to do with reality.  &gt;&gt;<br/>\n<br/>\nThis has a lot to do with language and concept.  The parts about religion, <br/>\nand truth, and belief all go back to the very basics of language and kids <br/>\nasking &quot;Why?&quot;<br/>\n<br/>\nKids think their parents are godlike when they&#39;re little, so the earliest <br/>\nanswer to &quot;why is this this way?&quot; are answered and believed with big <br/>\ncertainty.  And because people speak different languages and have different <br/>\ntraditions of &quot;why,&quot; the answers are different from a very basic, toddler <br/>\nlevel.<br/>\n<br/>\nIf there were only two tribes of cavemen and they spoke different languages, <br/>\nall the problems mentioned would still be there.<br/>\n<br/>\nI don&#39;t think we can ignore  human nature or the realities of cultures.   The <br/>\nreminder (reminder for some, news for others) that different religions grew <br/>\nup differently from the same kinds of roots is valid only for the <br/>\nphilosophical and fairly non-religious.<br/>\n<br/>\nThe three religions with which most of us are most familiar--Christianity, <br/>\nJudaism and Islam--all have something at the base of them which doesn&#39;t allow <br/>\nfor the idea that others are equally as valid or applicable to them.  For <br/>\nthem to say &quot;we&#39;re all the same&quot; is the same as saying &quot;I&#39;ve been wrong and <br/>\nall my ancestors, and not only what my parents siad was wrong, but what I&#39;ve <br/>\nbelieved God said was wrong.&quot;<br/>\n<br/>\nMost people don&#39;t want that denial of their ancestry and beliefs.<br/>\n<br/>\nCulture is a reality.  The existence of mythology is a reality.  Linguistic <br/>\ndifferences are big, limiting realities.  <br/>\n<br/>\nMaybe under all big questions needs to be an &quot;IF&quot;--what is best if one wants <br/>\nto be a good Baptist?  Don&#39;t go to the bar, get drunk, dance and take a woman <br/>\nhome and sleep with her.   Within the set of &quot;b and some things don&#39;t.<br/>\n<br/>\nIf on a larger, cultural scale someone could persuade all religious leaders <br/>\nand followers to agree to the idea that they were all equally valid and right <br/>\nabout the afterlife and one another (it cancels itself out right there, but <br/>\n&quot;if&quot;) then that still woudln&#39;t change what it takes to be a good Baptist, or <br/>\nunchooler, or balloonist, or sculptor or plumber.<br/>\n<br/>\nThis is a big philosophical issue, but it makes more sense with the quote.  <br/>\nThanks.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"lite2yu@aol.com","from":"lite2yu@...","replyTo":"LIST","senderId":"3GAAopfcn3SVRsWFtb46HscKslqa1oT89Ga32w88jg00GzQofaQr7qlFBQ0uPhey53x-VFNp","spamInfo":{"isSpam":false,"reason":"0"},"subject":"&quot;Betterness&quot;","postDate":"1001689936","msgId":26398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyLjEwODcxZDZkLjI4ZTVlZDUwQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":26421,"prevInTime":26397,"nextInTime":26399,"topicId":26398,"numMessagesInTopic":0,"msgSnippet":"I am posting this as a way to explain a PORTION of how I believe. I am not interested in converting anyone to this way of thinking. . . I am not saying that","messageBody":"<div id=\"ygrps-yiv-6378387\">I am posting this as a way to explain a PORTION of how I believe. I am not <br/>\ninterested in converting anyone to this way of thinking. . . I am not saying <br/>\nthat what you may believe is wrong or bad or &quot;more evolved&quot;. I am putting <br/>\nforth ideas for consideration if so desired. Some people have expressed <br/>\ninterest and in that vein, here you go. . . <br/>\n<br/>\n<br/>\nWe had hoped that, as the quality of life continued to rise in our contry and <br/>\naround the world, our people and especially our young people, in whom should <br/>\nreside, it if resides anywhere, would be our promise of tomorrow. But we are <br/>\nseeing anger displayed in our youth as we have never seen it displayed <br/>\nbefore, and we are frightened and deeply troubled. The brutal murder of <br/>\nMatthew Shephard, left to die on the cow fence in Wyoming, and the startling <br/>\nevents at Columbine High School shock awake once again, just when we may <br/>\nhave been lulled into thinking, with our improving economic conditions and <br/>\nour seemingly greater social justice, that we are at least on the right <br/>\ntrack. <br/>\n<br/>\nYet, all that is happening here is not a mystery. THere is a reason that our <br/>\nspecies seems addicted to these behaviors. The reason is found in one single <br/>\nword: &quot;better&quot;&gt;<br/>\n<br/>\nThis one word, applied to themselves by members of the human family, has <br/>\ncaused all of the ills of human society. It is our idea that we are somehow <br/>\n&quot;better&quot; than another that is making us act worse. As individuals. As <br/>\nneighborhoods. As states. As nations.<br/>\n<br/>\nMany people, most people, perhaps . . . seem to think that they are &quot;better&quot; <br/>\nthan those around them. THey believe that their neighborhood is &quot;better&quot; than <br/>\nthe surrounding neighborhood, that their state is &quot;better&quot; than the <br/>\nneighboring state, and that their nation is better than the next nation.<br/>\n<br/>\nAll of this is part of our cultural history of Competition, which arises out<br/>\nof our cultural history of Separation. A &quot;cultural story&quot; is a story we tell <br/>\noursleves about how life is. It is based on fiction and has nothing to do <br/>\nwith reality, yet it persists, becuase it is told over and over again, and <br/>\nacted out, by the members of our species who have an interest in perpetuating <br/>\nit. Others follow the model.<br/>\n<br/>\nOur biggest cultural story, the one we have held onto the longest and that <br/>\nhas spread the farthest, is The Story Of Separation. In this story, we <br/>\nimagine oursleves to be separate from God, and therefore seprate from each <br/>\nother. As with most cultural myths, this story has nothing to do with <br/>\nreality. Yet it persists, and has informed our indidvidual and collective <br/>\nideas and actions for millinea.<br/>\n<br/>\nIn truth, God and we are One. There is no separation, no disunity. And in <br/>\ntruth, our fellow humans and we are One. We are as different parts of the One <br/>\nBody, called Humanity. Yet we do not know this, or if we do know it, we <br/>\ncannot accept it. Our culture will not allow us to.<br/>\n<br/>\nOut of our cultural story of separation, comes the idea of &quot;competition:, for <br/>\nif we are separate from each other, then we are each on our own, and must <br/>\ncompete with each other for the limited resources which we need to survive. <br/>\nThis is how the &quot;story&quot; goes. It is not the truth, but it is a long-told <br/>\nstory, and we believe it. And so, it might as well be the truth, since what <br/>\nyou believe is true enough for you.<br/>\n<br/>\nOut of our cultural Story of Competition comes the idea of &quot;better&quot;, for if <br/>\nwe are competing with each other, we must have a reason for ruthlessly <br/>\npursuing victory, for doing whatever it takes to come out on top. This <br/>\nreason, we tell ourselves, is that we are Better than our opponents. We <br/>\ndeserve to win. They deserve to lose. This judgement about our relative <br/>\ngoodness, or &quot;betterness&quot;, allows us to justify our actions. Any actions, <br/>\nreally, that we feel we have to take in order to &quot;win&quot;. And there&#39;s the rub. <br/>\nFor it is what we DO when we imagine ourselves to be &quot;better&quot; that sets the <br/>\nstage for the human tragedy. In the name of &quot;betterness&quot; we humans not only <br/>\nknock down and punch in the face of other hockey players, we not only use <br/>\n&quot;unnecessary roughness&quot; on our football fields, some of us &quot;ethnically <br/>\ncleanse&quot; our nations. Some of us claim prerogatives which are not ours.<br/>\n<br/>\n. . . . That is right, we actually end the life of others of our own species <br/>\nbecause we believe we have a &quot;better&quot; way of approaching God, a &quot;better&quot; <br/>\nmethod of governing, a &quot;better&#39; reason for claiming the land, a &quot;better&quot; <br/>\neconomic justicifation for our predatory action.<br/>\n<br/>\nThat is exactly what is happening today is Ksovo. It is what has happened <br/>\nbefore in our human history, and it is what will happen again, unless and <br/>\nuntil those who write our Cultural Story do so in a new way.<br/>\n<br/>\nAnd so who are the writers of our story? They are, in the main, our <br/>\nreligions. It is our religions that, from the beginning and to this very day, <br/>\nhave told us about oursleves. They&#39;ve told us who we are, and what to believe <br/>\nabout ourselves and others. And it is religions that have fostered and <br/>\nfurthered the Myth of Betterness.<br/>\n<br/>\nBecause religions teach their followers that they are &quot;better than the <br/>\nfollowers of other religions- so much better, in fact, that they, and only <br/>\nthey, will spend the Afterlife in the presence of God- and religions claim <br/>\nand believe that this Declaration of Betterness has come directly from God, <br/>\ncultures and traditons are ignited which give themselves permission to hurt <br/>\nand to kill in the name of this &quot;truth&quot;.<br/>\n<br/>\nTHe irony is that religions claim that this &quot;truth&quot; is what will save us, and <br/>\nin fact, it is exactly what is killing us instead. Indeed, the idea that one <br/>\nof us, or one group of us, is somehow &quot;better&quot; than another, and therefore <br/>\nhas a right and a need for more resources, more land, more oil, more <br/>\nwhatEVER, that has caused death and destruction on this planet hte likes of <br/>\nwhich the love of God could never in purity or truth justify.<br/>\n<br/>\nToday, I issue an invitation to all the world&#39;s religions. Say to your <br/>\nleaders and say to your followers this one sentence: &quot;Our religion is no <br/>\nbetter than any other, and WE are no better than any other. Our way is not a <br/>\nbetter way, our way is merely another way.&quot;<br/>\n<br/>\nNeil Donald Walsch<br/>\n<br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":26452,"nextTopicId":3434}}