{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1123183,"authorName":"dacunefare@aol.com","from":"dacunefare@...","profile":"undermom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"UNSCHOOLING.COM ONLINE NEWS Mid-May 2002","postDate":"1021563364","msgId":37108,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkxMmI5MDk4MjVmMDg0YkBbMjA4LjI2LjIzNS4xNTRdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":37107,"nextInTime":37109,"topicId":37108,"numMessagesInTopic":0,"msgSnippet":"... UNSCHOOLING.COM ONLINE NEWS Mid-May 2002 ... In this Issue: Katharine Kersey on Growing Children Gardening Resources Organic School Garden Awards","messageBody":"<div id=\"ygrps-yiv-241225658\">::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\nUNSCHOOLING.COM ONLINE NEWS<br/>\nMid-May 2002<br/>\n<br/>\n::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::<br/>\n<br/>\nIn this Issue:<br/>\n<br/>\nKatharine Kersey on Growing Children<br/>\nGardening Resources<br/>\nOrganic School Garden Awards Competition<br/>\nUnschooling-dotcom Email Discussion List<br/>\nThe Hole-in-the-Wall Experiment<br/>\nA Few Words About Math<br/>\nUncollege<br/>\nUnschool Friendly Conferences<br/>\nFUN Books Anniversary Special<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nChildren are given to us, on loan, for a very short period of time. They come<br/>\nto us like packets of flower seeds, with no pictures on the cover and no<br/>\nguarantees. We do not know what they will look like, act like, or have the<br/>\npotential to become. Our job, like the gardeners, is to meet their needs as<br/>\nbest we can: to give proper nourishment, love, attention, and caring, and to<br/>\nhope for the best.<br/>\n<br/>\nKatharine Kersey<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nGardening Resources<br/>\n<br/>\nPerhaps you too are gardening this season, planting and sowing hopes for<br/>\nbright blooms and fresh tastes in the future. These are a few of my familys<br/>\nfavorite garden resources.<br/>\n<br/>\nKids Valley WebGarden   http://raw-connections.com/garden/<br/>\nTons of usable hints and tips in a format friendly to newer readers<br/>\n<br/>\nGardening for Wildlife   http://wildlifegardening.com/<br/>\nA collection of links - How and why to invite wild creatures to share your<br/>\nland, whether you have several acres or just a few pots on a balcony.<br/>\n<br/>\nThe Garden Explored by Mia Amato and The Exploratorium<br/>\nHands on botany in a book for curious gardeners<br/>\n<br/>\nRebecca Rupps Good Stuff column in the May/June issue of Home Education<br/>\nmagazine is titled Full of Beans, and it is! She has resources about<br/>\ngrowing beans, cooking beans, the science of beans, and fictional beans. What<br/>\nfun! Unfortunately, the column isnt available online - if you dont have a<br/>\nsubscription check with your library, or with friends. (And consider<br/>\nsubscribing! http://www.home-ed-magazine.com)<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nOrganic School Garden Awards competition<br/>\n<br/>\nThe Rodale Institute Kidsregen.org is proud to introduce the 2002 Organic<br/>\nSchool Garden Awards<br/>\n<br/>\nSchool and home-school students nationwide, grades K through 12, are invited<br/>\nto enter this Organic School Garden Awards competition. If you&#39;re a kid who<br/>\nbelieves that you can improve your health and the health of the Earth by<br/>\ngardening, this contest is for you!<br/>\n<br/>\nThis years theme<br/>\nHow does your schools organic garden impact your health and eating habits?<br/>\nWe want to know if your garden has helped you change your eating habits,<br/>\ntaste new foods, or improve your health. Have you been able to introduce new<br/>\nfoods in the cafeteria, influence what food is served at home, learn about<br/>\nnutrition, and so on? We want to know everything! We&#39;ll share your success<br/>\nstories with others kids to inspire them to create a garden as good as yours.<br/>\n<br/>\nEntries must be received by July 1, 2002 to be eligible. For information and<br/>\nentry forms go to:<br/>\nhttp://www.kidsregen.org/krrn/exhibits/gardens/2002/intro.shtml<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUnschooling-dotcom Email Discussion List<br/>\n<br/>\nPointing out each thing he learns or each &quot;educational&quot; thing he does is<br/>\nprobably not the best approach, either.  Let it flow for a while.  If each<br/>\nmoment or conversation or activity is going to be reviewed for its<br/>\neducational content, the whole day becomes one long test, and life&#39;s being<br/>\nlived for the purpose of the review.  That makes things too self-conscious,<br/>\nand he might close down some, or avoid the situations...<br/>\n<br/>\n...We have a bunch of pumpkins and morning glories just sprouted.  We could<br/>\nthin them out and look at a few roots, but if we pull them ALL up to look we<br/>\nwon&#39;t have any adult plants.  Some have to be JUST watered and ignored.  And<br/>\nthe more we can water and ignore, the more we&#39;ll have grow to maturity.  Some<br/>\nare going to spread out all over our side yard.  Some are going to grow up<br/>\ninto the trees and bushes and make a happy all-flowery mess, but not until<br/>\nlater in the year.   Some are going to die a natural death.  Some are going<br/>\nto make seeds for next year, and some of those seeds (this being the desert,<br/>\nand we being disorganized) won&#39;t be sprouting for four or five years.<br/>\n<br/>\nSome of the best learning is like that.  You can plan something, and you can<br/>\nplant something, but you can&#39;t mess with it too much after that.  You just<br/>\nhave to let some stuff go at its own pace, and in its own season.<br/>\n<br/>\nSandra Dodd in a conversation on the Unschooling-dotcom Email list.<br/>\n<br/>\nThe Unschooling-dotcom Email list is affiliated with the Unschooling.com<br/>\nwebsite, and is a source of lively discussion about unschooling. Come join<br/>\nthe conversation! To subscribe send a blank Email to:<br/>\nUnschooling-dotcom-subscribe@yahoogroups.com<br/>\n<br/>\nOr visit the Email list website at:<br/>\nhttp://groups.yahoo.com/group/Unschooling-dotcom/<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThe Hole-in-the-Wall Experiment<br/>\n<br/>\nSugata Mitra has a PhD in physics and heads research efforts at New Delhi&#39;s<br/>\nNIIT, a fast-growing software and education company with sales of more than<br/>\n$200 million and a market cap over $2 billion. But Mitra&#39;s passion is<br/>\ncomputer-based education, specifically for India&#39;s poor. He believes that<br/>\nchildren, even terribly poor kids with little education, can quickly teach<br/>\nthemselves the rudiments of computer literacy. The key, he contends, is for<br/>\nteachers and other adults to give them free rein, so their natural curiosity<br/>\ntakes over and they teach themselves. He calls the concept &quot;minimally<br/>\ninvasive education.&quot;<br/>\n<br/>\nTo test his ideas, Mitra 13 months ago launched something he calls &quot;the hole<br/>\nin the wall experiment.&quot; He took a PC connected to a high-speed data<br/>\nconnection and embedded it in a concrete wall next to NIIT&#39;s headquarters in<br/>\nthe south end of New Delhi. The wall separates the company&#39;s grounds from a<br/>\ngarbage-strewn empty lot used by the poor as a public bathroom. Mitra simply<br/>\nleft the computer on, connected to the Internet, and allowed any passerby to<br/>\nplay with it. He monitored activity on the PC using a remote computer and a<br/>\nvideo camera mounted in a nearby tree.<br/>\n<br/>\nWhat he discovered was that the most avid users of the machine were ghetto<br/>\nkids aged 6 to 12, most of whom have only the most rudimentary education and<br/>\nlittle knowledge of English. Yet within days, the kids had taught themselves<br/>\nto draw on the computer and to browse the Net. Some of the other things they<br/>\nlearned, Mitra says, astonished him.<br/>\n<br/>\nRead the full article at:<br/>\nhttp://www.greenstar.org/butterflies/Hole-in-the-Wall.htm<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nA Few Words About Math<br/>\n<br/>\nhttp://www.borntoexplore.org/unschool/math.htm<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUncollege<br/>\n<br/>\nIn last months newsletter I recommended Herbert Kohl&#39;s book &quot;The Question is<br/>\nCollege&quot; for teens and parents considering the future. A reader replies<br/>\nAnother super great book for kids who want to do something other than<br/>\ncollege is, &quot;The Uncollege Alternative: Your Guide to Incredible Careers and<br/>\nAmazing Adventures Outside College&quot; by Danielle Kwatinetz-Wood.<br/>\n<br/>\nThanks, Ill be checking it out!<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nUnschool Friendly Conferences<br/>\n<br/>\nUnschoolers sometimes feel outnumbered and out of place at large curriculum<br/>\noriented homeschooling conventions. The following conferences have<br/>\nunschooling presenters and participants, including many regular posters at<br/>\nthe unschooling.com website and email discussion list.<br/>\n<br/>\nTrusting the Children, Trusting Ourselves<br/>\nAugust 16-18, 2002<br/>\nRadisson Hotel Sacramento<br/>\n<br/>\nhttp://conference.hsc.org/default.html<br/>\n<br/>\nLive and Learn Unschool Conference<br/>\nOctober 11 - 13, 2002<br/>\nColumbia, SC<br/>\n<br/>\nhttp://www.schoolsoutsupport.org/index.html<br/>\n<br/>\nIf you have information on other unschooling friendly conferences please<br/>\nemail the editor at newsletter@...<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nFUN Books Anniversary Special<br/>\n<br/>\nBilly and Nancy Greer of FUN Books are celebrating their 20th anniversary on<br/>\nMay 22 and they would like you to join in on the celebration. For one week<br/>\nbefore our anniversary and one week after, you can take an extra 20% off any<br/>\nsingle item on the FUN Books web site. We have the kinds of resources that<br/>\nare perfect for unschooling, unit studies, or eclectic homeschooling. We also<br/>\nhave many items that you can&#39;t find anywhere else.<br/>\n<br/>\nFUN Books already has great discounts, so an extra 20% off gives you a chance<br/>\nto really save.  Here&#39;s how it works. Place an order between May 15 and May<br/>\n29 and write &quot;Happy 20th Anniversary Nancy and Billy!&quot; somewhere on the order<br/>\n(for on-line orders, type it in the comments section). When we process your<br/>\norder, we will take an extra 20% off the highest priced item you purchased.<br/>\nWhile the discount can be used for anything we carry, please note that only<br/>\none item per family can receive this special discount.<br/>\n<br/>\nPlease visit us on-line at http://www.FUN-Books.com to place your order on<br/>\nour secure server, phone or fax your order to our voice mail at (888)<br/>\n386-7020, or mail it to FUN Books, 1688 Belhaven Woods Ct, Pasadena, MD<br/>\n21122-3727, or email us at fun@...<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this<br/>\nnewsletter, please contact the editor at:<br/>\nnewsletter@...<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nFinal Thoughts<br/>\n<br/>\nPeople say, Dont we have a duty to expose children to whatever seems to us<br/>\nbest, most enjoyable, most significant, etc. in human life? (Or, to use a<br/>\npopular cliche, The Best That Man Has Thought and Done.) Why think of it as a<br/>\nduty? It is a pleasure, one of the most natural things in human life. We<br/>\nconstantly tell our friends about the things we like, urge them to read<br/>\nbooks, see movies, hear music, or do this or that. The problem is that if we<br/>\nurge too strongly, our friend may think that he must do what what we urge<br/>\nlest he hurt our feelings. So with the gifted teacher in the open classroom,<br/>\nfilling it full of all kinds of wonderful things to look at, work with, do.<br/>\nHe must still leave the children a chance to say No. Otherwise exposure, or<br/>\ncall it temptation, crosses some kind of boundary and becomes seduction,<br/>\nhidden coercion, do it to make me happy, do it because otherwise Ill be<br/>\nunhappy and maybe even wont like you.<br/>\n<br/>\nJohn Holt, in Freedom and Beyond<br/>\n<br/>\n:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:+:<br/>\n<br/>\nThanks for reading the Unschooling.com newsletter! Feel free forward this<br/>\nnewsletter to all your friends, your local support group, and your<br/>\nmother-in-law!<br/>\n<br/>\nTo subscribe, visit our web site at http://www.unschooling.com or send an<br/>\nemail to majordomo@... with the words subscribe<br/>\nunschooling-newsletter followed by your name@your address.com in the body of<br/>\nthe email. (e.g. subscribe unschooling-newsletter youremailaddress). To<br/>\nunsubscribe, send an email to majordomo@... with the words<br/>\nunsubscribe unschooling-newsletter followed by your name@... in<br/>\nthe body of the email. (e.g. unsubscribe unschooling-newsletter<br/>\nyouremailaddress). To change the address at which you receive the newsletter,<br/>\nunsubscribe your old address and then subscribe with your new one.<br/>\n<br/>\nSee you in June!<br/>\n<br/>\nDeborah A Cunefare, Newsletter Editor<br/>\nnewsletter@...<br/>\n<br/>\nUnschooling.com is a service of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":37104,"nextTopicId":37103}}