{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unschooling and Autism, WAS food and anxiety","postDate":"1263996983","msgId":49783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4MjgzOS4zODc2OS5xbUB3ZWI1MzgwNi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":49782,"nextInTime":49784,"topicId":49783,"numMessagesInTopic":0,"msgSnippet":"The list description was changed.  So though Anne once thought it  would be great to have a list for  non-typical, out-of-sync, highly  sensitive, Aperger s","messageBody":"<div id=\"ygrps-yiv-1999777424\">The list description was changed.  So though Anne once thought it  would be great to have a list for  non-typical, out-of-sync, highly  sensitive, Aperger&#39;s explosive, etc., as the list gained speed and the  moderators gained experience, they decided maybe that was not a good  <br/>\n<br/>\nidea after all.  Just as others had said before that list was formed.<br/>\n<br/>\n<br/>\n****<br/>\n<br/>\nI find that Anne&#39;s list is a good place for talking about non-typical or highly sensitive responses to situations, often from a perspective of both children and parents who are highly sensitive or non-typical.  That list, and Anne&#39;s writings, were tremendously helpful to me in understanding myself and my own responses/reactions to my kids and has made such a difference in the Mom I am today.  <br/>\n<br/>\nI do sometimes find that Always Learning is not a good fit for me in my more sensitive moments (when I&#39;m slogging thru my own personal issues).  Since those are the moments when I&#39;m mostly likely to do something that complicates my kid&#39;s life, I need somewhere I can go to get ideas I&#39;m actually willing to hear (sometimes the answers here hit me wrong, and I know that&#39;s about me not about the person posting here).  I&#39;m on both lists because sometimes I need stark honesty and I can withstand it; other times I need to hear from people adept at talking about what it means to be highly sensitive, both as a child or an adult. Sometimes highly sensitive children become highly sensitive adults (I did!) and that&#39;s okay, too.     <br/>\n<br/>\nI don&#39;t find labels useful in unschooling either. We recently revisited that decision for one of our children, which turned out to be a wonderful conversation starter for us all, and helped us find more solutions as we all grow and change.  Ultimately, we again decided not to seek a label.  But if we&#39;d been completely unwilling to ask that question, we&#39;d have missed a very important conversation with our son.  I think, too often, having a label lets parents off the hook -- rather<br/>\nthan coming up with more creative solutions to really reach and help a<br/>\nchild, parents can just chalk it up to his &#39;disorder&#39; get some expert<br/>\nhelp, give him a drug or two, control his behavior and ignore the<br/>\nchild&#39;s very valid needs. <br/>\n<br/>\nI&#39;m often more sensitive to some situations than most people I know.  Not surprisingly, so are my children, each in his own way and to varying degrees. Looking around my family tree, I&#39;m not unlike other people who came before me.  I&#39;m certain there&#39;s a genetic component to it.  I, too, find that when I&#39;m wanting to &#39;fix&#39; my kids, it&#39;s that I&#39;m seeing something in them I don&#39;t/didn&#39;t like in myself.  <br/>\n<br/>\n<br/>\n*****<br/>\n<br/>\nPeople could join that list and have people deny it was ever intended  <br/>\n<br/>\nto be a special needs list, or they could stay here where people have  <br/>\n<br/>\nbeen saying for much longer that labelling children causes problems.<br/>\n<br/>\n<br/>\n*****<br/>\n<br/>\nOr people could join Shine, and stay here too, enjoying and benefiting from the abundance of perspectives and voices offered in both places.  I think it&#39;s like finding more resources for our families as unschoolers -- the more options, the better.  <br/>\n<br/>\nSylvia<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49713,"nextTopicId":49764}}