{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":15,"messages":[{"userId":363518215,"authorName":"claire.horsley08","from":"&quot;claire.horsley08&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too much choice?","postDate":"1249086606","msgId":46569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1MDJhZStmNHJ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBNzFENTQ3LjIwMTA3MDhAbWFjLmNvbT4="},"prevInTopic":46568,"nextInTopic":0,"prevInTime":46568,"nextInTime":46570,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"Thank you, wise mentors, for both the encouragement and the yeah but analysis .  I need both to keep travelling happily on our unschooling journey.  I truly","messageBody":"<div id=\"ygrps-yiv-858923333\">Thank you, wise mentors, for both the encouragement and the &#39;yeah but analysis&#39;.  I need both to keep travelling happily on our unschooling journey.  I truly believe that one of the best ways to learn parenting skills is from trusted role-models, of which I have very few in real life.  Thank goodness for this list and the advice from people who&#39;ve been doing this far longer than me!</div>","specialLinks":[]},{"userId":288325711,"authorName":"dinapug310","from":"&quot;dinapug310&quot; &lt;b38040@...&gt;","profile":"dinapug310","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too much choice?","postDate":"1249012568","msgId":46568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg0dHEwbytnbWVxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBNzFEM0EwLjcwOTA4MDlAbWFjLmNvbT4="},"prevInTopic":46567,"nextInTopic":46569,"prevInTime":46567,"nextInTime":46569,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"... Pam, first let me thank you for your thoughtful, thorough and very accurate response.  You have hit on every concern I had and are very clear. To be","messageBody":"<div id=\"ygrps-yiv-849675216\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; There is something about your questions, Dina, that makes me think <br/>\n&gt; you&#39;re complicating things, in your head, that you&#39;ve read a bunch of <br/>\n&gt; noncoercive parenting stuff and maybe some more conventional parenting <br/>\n&gt; stuff, plus the unschooling stuff, and all that is interfering with you <br/>\n&gt; being natural and honest and real with your daughter. Simplify it all - <br/>\n&gt; use simple words to think about it and don&#39;t use words that have baggage <br/>\n&gt; or specialized meanings (like coerce). Run everything through your OWN <br/>\n&gt; filter of - &quot;Does this seem to make sense with MY child right now?&quot;<br/>\n<br/>\n<br/>\n </span></blockquote>Pam, first let me thank you for your thoughtful, thorough and very accurate response.  You have hit on every concern I had and are very clear.  <br/>\n<br/>\nTo be honest, up until recently, I felt confident in most of what I was doing.  Not that I didn&#39;t feel I could always learn more and get great ideas, but that was part of what I was doing well in my approach.  I did also have a couple of questions and concerns that I voiced on another list and got clear on what I needed and kept going.  But, just now, as we&#39;re approaching 2 and I see these more emotional behaviors surfacing and feeling a few times like I was trying to control Thea, which I do not want to do, I did get stuck in my head about things and wondered &#39;is the behavioral stuff normal, is what I think I&#39;m doing really working/going to work in the long run, am I doing it right?  Sould I be able to be firm&#39; (I don&#39;t like the term, anyway!?  Plus, some unsolicited advice which I vetoed when I heard it, but then second guessed myself in the end...all lead to this questioning of myself.  And in going through it, I was thinking about it all a lot and I just haven&#39;t been as present with Thea and my true feelings and filters as I should be.   <br/>\n<br/>\nThank you for helping me get back on track and clearing this congestion!<br/>\n<br/>\nDina</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: too much choice?","postDate":"1248982073","msgId":46567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0MkUyOUU1LUZEQzUtNDNFNC05MTMzLUJGMUEwM0FEODgyNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg0c2RrdStzNGM0QGVHcm91cHMuY29tPg==","referencesHeader":"PGg0c2RrdStzNGM0QGVHcm91cHMuY29tPg=="},"prevInTopic":46566,"nextInTopic":46568,"prevInTime":46566,"nextInTime":46568,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"-=-Did you mean 2 year old? Not nit-picking, just wondering if you were making a diferent point that I don t understand. I think that she, at 2, can understand","messageBody":"<div id=\"ygrps-yiv-1290659158\">-=-Did you mean 2 year old? Not nit-picking, just wondering if you  <br/>\nwere making a diferent point that I don&#39;t understand. I think that  <br/>\nshe, at 2, can understand me validating her feeling of frustration  <br/>\neven if it&#39;s just through my tone and movement toward her and it to  <br/>\nhelp her-=-<br/>\n<br/>\nNearly two and nearly three are not so different, as to the way a  <br/>\nparent can act.  I can&#39;t pick Holly up and rock her, at 17.  When she  <br/>\nwas four and younger, I could.  I&#39;m unwilling to discuss in detail  <br/>\ndifferences in the way a parent might &quot;unschool&quot; a two year old or one  <br/>\nyear old or three year old.<br/>\n<br/>\nA week-old baby can understand a parent validating his feelings.  A  <br/>\nfive year old can too.<br/>\n<br/>\nJust because a child is becoming verbal does NOT mean her analytical  <br/>\nskills have kicked in.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/piaget\">http://sandradodd.com/piaget</a><br/>\n<br/>\n-=- Our home is very kid friendly, but sometimes, for example, when  <br/>\nshe takes the back off of the remote control to the dvd player which  <br/>\nshe has access to, because she can and does like to use it if she&#39;s  <br/>\nwatching a movie, she can&#39;t get it back on. She will then, sometimes,  <br/>\nthrow it down.-=-<br/>\n<br/>\nWhere&#39;s the parent?  Aren&#39;t there toys in there she can play with that  <br/>\nare more interesting than taking the back off the remote?<br/>\n<br/>\n-=-I could tape it, I guess, but then she knows that it comes off and  <br/>\nnow I&#39;ve prevented that. -=-<br/>\n<br/>\nSo what?<br/>\nThere are fragile parts in there.  She doesn&#39;t need to be touching the  <br/>\nbattery, and certainly not putting in her mouth.  It&#39;s not safe or  <br/>\nsensible to think that a child has the right to take the back off  <br/>\nsomething or that just because she knows how to dismantle something  <br/>\nthat the parent has lost the right to tape, latch, screw-together or  <br/>\nlock it down.<br/>\n<br/>\n-=- So if it&#39;s common for &#39;many kids&#39; let&#39;s say, to put they&#39;re heads  <br/>\ndown when they&#39;re frustrated, well, I&#39;m wondering if that&#39;s true or  <br/>\ntrue for conventional parenting practices-=-<br/>\n<br/>\nConventional parenting neither requires nor forbids children to put  <br/>\ntheir heads down if they&#39;re frustrated.   Most adults will put their  <br/>\nheads down when they&#39;re frustrated, don&#39;t you think?   Lean over onto  <br/>\na hand or two, or lean back on the couch or in a recliner, or go and  <br/>\nlie down a while?<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: too much choice?","postDate":"1248974151","msgId":46565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNzFENTQ3LjIwMTA3MDhAbWFjLmNvbT4=","inReplyToHeader":"PGg0cjhqNytqZWI1QGVHcm91cHMuY29tPg==","referencesHeader":"PGg0cjhqNytqZWI1QGVHcm91cHMuY29tPg=="},"prevInTopic":46564,"nextInTopic":46566,"prevInTime":46564,"nextInTime":46566,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"... Sometimes we have a hard time explaining what we re physically doing - we write about what we say and not so much about what we do. I liked the use of","messageBody":"<div id=\"ygrps-yiv-46614133\">On 7/29/2009 9:46 PM, claire.horsley08 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; What I do now is a) take her desires seriously by trying to get her the thing she wants, rather than fobbing her off with something else, b) model using respectful language, and explaining that throwing is not okay because she might hurt someone, and c) as a last resort, I put my hand on the object as well, so it can&#39;t be thrown.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Sometimes we have a hard time explaining what we&#39;re physically doing - <br/>\nwe write about what we &quot;say&quot; and not so much about what we &quot;do.&quot;<br/>\n<br/>\nI liked the use of the word &quot;jiggling&quot; in Claire&#39;s post. That&#39;s a good <br/>\ndescription of something I could do with Roya. I called it &quot;jollying her <br/>\nup.&quot; The problem is it can sound so disrespectful. But, with Roya, I <br/>\nknew sort of when she was ready to move on and I could cuddle her for a <br/>\nmoment and then turn it into silly physical play. She was a very <br/>\nphysical little girl - the tension of an upset time was well released <br/>\nwith some &quot;jiggling.&quot;<br/>\n<br/>\nIn what Claire wrote above - I think I would have been likely to have <br/>\nhad number 3 as number 1 --- just gently have my hand on the thing that <br/>\nmight be about to be thrown. I don&#39;t encourage lots and lots of talking <br/>\nand explaining. If you&#39;ve said it a few times already, don&#39;t insult <br/>\ntheir intelligence by repeating yourself as if THIS time they&#39;ll get <br/>\nit.  They&#39;ll stop paying attention to what you say, if what you say is <br/>\nrepetitive and not useful.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: too much choice?","postDate":"1248973728","msgId":46564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBNzFEM0EwLjcwOTA4MDlAbWFjLmNvbT4=","inReplyToHeader":"PGg0cjFraSthaDNxQGVHcm91cHMuY29tPg==","referencesHeader":"PGg0cjFraSthaDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":46563,"nextInTopic":46565,"prevInTime":46563,"nextInTime":46565,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"... First, have to start breakfast? Who is the breakfast for? You and your daughter only or do you have boarders you ve committed to feeding or something","messageBody":"<div id=\"ygrps-yiv-2107442359\">On 7/29/2009 7:47 PM, dinapug310 wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;   I gave her a heads up while we were playing that we&#39;d eat soon, so she knew, and after a decent amount of playing time (to me, I guess) I said let&#39;s go in the kitchen.<br/>\n </span></blockquote>First, &quot;have to start breakfast?&quot; Who is the breakfast for? You and your <br/>\ndaughter only or do you have boarders you&#39;ve committed to feeding or <br/>\nsomething like that?  It is terrifically helpful to catch yourself <br/>\nsaying &quot;have to&quot; and question that, right then and there. When I had a 2 <br/>\nyear old, breakfast was never something I had to &quot;get started.&quot; We&#39;d <br/>\nscrounge up a bowl of cereal and some fruit or make some toast and <br/>\npeanut butter WHEN we were hungry (when I saw the signs of hunger) or <br/>\nwhen it was convenient. Honestly, I&#39;d probably have stayed and played <br/>\nfor as long as my daughter wanted, if it was a sweet and happy game. <br/>\nSavor those times - I know she&#39;s only 2, but time will go quickly. Don&#39;t <br/>\nbe thinking about what else you &quot;have to&quot; do.<br/>\n<blockquote><span title=\"ireply\"> &gt; She didn&#39;t want to.  Here is where I start to internally squirm.  I don&#39;t want her to be upset, but we have to move on to the next thing at some point.<br/>\n </span></blockquote>Your &#39;next thing&#39; is being with your daughter. You&#39;ve got your <br/>\npriorities a little skewed. Ask yourself &quot;why&quot; about each of those <br/>\nthings you think you need to move on to. Especially ask, &quot;Why now?&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt; I rolled out of it by asking her if she wanted to crack the eggs, which I then wondered if was a form of coercion.<br/>\n<br/>\n </span></blockquote>Holy cow - seriously? You offered her a fun thing to do and she <br/>\naccepted. So - I suggest you get the word coercion out of your <br/>\nvocabulary - you are in NO danger of coercing your child. Far from it. <br/>\nStop worrying about it. Maybe just think about being nice and kind and <br/>\ngentle and supportive.<br/>\n<blockquote><span title=\"ireply\"> &gt; This is the kind of situation I wonder about.  What do you say and how do you be firm?<br/>\n </span></blockquote>&quot;Be firm&quot; is conventional parenting lingo, right? Parents are supposed <br/>\nto be kind, but firm?<br/>\n<br/>\nThere is something about your questions, Dina, that makes me think <br/>\nyou&#39;re complicating things, in your head, that you&#39;ve read a bunch of <br/>\nnoncoercive parenting stuff and maybe some more conventional parenting <br/>\nstuff, plus the unschooling stuff, and all that is interfering with you <br/>\nbeing natural and honest and real with your daughter. Simplify it all - <br/>\nuse simple words to think about it and don&#39;t use words that have baggage <br/>\nor specialized meanings (like coerce). Run everything through your OWN <br/>\nfilter of - &quot;Does this seem to make sense with MY child right now?&quot;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   I know the more creative I can be, the better, but sometimes,<br/>\n&gt;   things have to be a certain way and believe me, often I&#39;ll avoid things if I can, which is where part of the free reign I was speaking of comes in.<br/>\n&gt;    <br/>\n </span></blockquote>Things seldom have to be a certain way. Could you post more about this <br/>\nthought - what things are you thinking about here? I think if we <br/>\nconsider them together, we can loosen up your feelings and help you feel <br/>\nmore free to BE more creative in your daily living with your daughter.  <br/>\nAlso, if you find you&#39;re avoiding things - I have two responses. One - <br/>\nthose are things you don&#39;t want to do so see if you can figure out a way <br/>\nto avoid doing them at all. Put your creativity to work on that. Second <br/>\n- if it is things like housework that you&#39;re avoiding - there is a very <br/>\nvery good chance that you&#39;re making it too high a priority for someone <br/>\nwith a two year old. Do the minimum, enjoy it when you DO have a chance <br/>\nto do it, and consider hiring a mother&#39;s helper. If I had it to do over <br/>\nagain, the one thing that would have made our lives much smoother and <br/>\nhappier would have been to find a teenage girl who wanted to earn a <br/>\nlittle extra money and pay her to come in several days a week for just <br/>\nan hour or two and do some dishes, clean the bathroom, clear up some <br/>\nclutter.  Anyway, when you say, &quot;the more creative I can be, the <br/>\nbetter,&quot; I think you mean the more &quot;fun&quot; you can be with your daughter. <br/>\nThat&#39;s good. Be fun - support her life being fun, as much as you can. <br/>\nRelax. This is going to be SO good for you - you&#39;re a little high-strung <br/>\nand, as you said, perfectionistic, and your daughter is offering you the <br/>\nchance to mellow out and enjoy life more. Take the chance.<br/>\n<blockquote><span title=\"ireply\"> &gt; Sandra, I read in the archives a statement you said to the effect that you wouldn&#39;t let your kids carve into the wooden table.  How do you say the &#39;no, you can&#39;t carve into the wooden table&#39; part?<br/>\n&gt;    <br/>\n </span></blockquote>You say, &quot;Don&#39;t carve the table. Here, let&#39;s go outside and find some <br/>\nwood you can carve.&quot;  Or, &quot;Don&#39;t carve the table,&quot; and you turn on the <br/>\ntv to a movie she likes. Or, sometimes you don&#39;t even have to say <br/>\nanything - you just distract her from carving the table.<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, Thea is sometimes throwing down an object that frustrates her.<br/>\n </span></blockquote>That&#39;s okay. It is normal two-year-old behavior. Frustration is part of <br/>\nlife for two-year-olds and we can be there to help them, but we can&#39;t <br/>\neliminate all frustration - it is built into being unskilled and little <br/>\nand not having enough vocabulary yet to fully express themselves and all <br/>\nthat.<br/>\n<br/>\nIf she&#39;s throwing things down in frustration,  you might be able to pay <br/>\na little more attention and see the frustration about to build up and <br/>\nhelp her just at the right time to prevent it - but, honestly, don&#39;t <br/>\nexpect yourself to be able to always do that - 2 year olds will be <br/>\nfrustrated.<br/>\n<blockquote><span title=\"ireply\"> &gt;   I&#39;m always sure to let her know that I&#39;m there, that I see how it can be frustrating, etc and help her if she wants it, but when she gets upset, she&#39;ll do that or put her head down on the floor for a while.<br/>\n </span></blockquote>That&#39;s not bad, either. She&#39;s got herself a self-soothing mechanism - <br/>\nputting her head down on the floor - maybe think of it as her way of <br/>\ncentering herself - a moment of meditation. Just be there for her - but <br/>\ndon&#39;t TALK so much. Sometimes just a word or two - sometimes not even a <br/>\nword, just a soothing sound or a gentle little bit of a rub on the back <br/>\nis enough for her to know you&#39;re there. SHE knows you will help, you <br/>\ndon&#39;t have to tell her. Sometimes, when little ones are frustrated, <br/>\nparents add to their frustration by talking at them. It puts even more <br/>\npressure on them because not only they can&#39;t do or handle what they <br/>\nwanted, but often the last thing they want is someone else to do it for <br/>\nthem. That just makes them feel even less capable. Also, they don&#39;t have <br/>\nthe vocabulary to express their complicated feelings and so they get <br/>\neven more frustrated with not being able to think clearly, much less <br/>\nexpress to you, what the problem is.<br/>\n<blockquote><span title=\"ireply\"> &gt; I am wondering if these are normal behaviors that I should just be with or am I and dh creating some kind of distress in the home causing the behavior.<br/>\n </span></blockquote>Normal. But you might be making them happen more often than necessary if <br/>\nYOU are very often trying to make her move on to &quot;the next thing&quot; when <br/>\nshe&#39;s not ready. Sounds like you do need to slow down into more of a &quot;Be <br/>\nHere Now&quot; state of mind - not be thinking about the other things you <br/>\n&quot;have to&quot; do.<br/>\n<blockquote><span title=\"ireply\"> &gt;   I know everyone has an outlet, I think.  Part of my problem, which is completely my thing, is in thinking that this wonderful way of raising my daughter is going to help always have things go smoothly and she&#39;ll never have a problem.<br/>\n </span></blockquote>This wonderful way of living helps us respond to those not-smooth times <br/>\nwith gentleness and kindness and in helpful ways, rather than shaming or <br/>\nbeing punitive. And, over the years, life will be SO much easier and <br/>\nhappier and smoother. But there will ALWAYS be less-than-wonderful <br/>\nmoments, for various reasons. Right now, she&#39;s two and the reasons have <br/>\nmainly to do with her stage of development and your own development as a <br/>\nmother. But, later, there will be things that aren&#39;t in your control - <br/>\nother kids will be mean to yours, you won&#39;t be able to afford something <br/>\nshe wants, she won&#39;t get a role she auditioned for -- these are <br/>\nrealities of life  - there are disappointments, there are times we&#39;re <br/>\ntired and cranky and hard to get along with. There are times our kids <br/>\nwill be unreasonable and times we will be unreasonable.<br/>\n<br/>\nAha - I just had a little realization. Do some of you think that our <br/>\ngoal is to eliminate any possible unhappy moments from our children&#39;s <br/>\nlives? To give them a wrinkle-free childhood? You know the bumper <br/>\nsticker, &quot; Shit Happens,&quot; right? It is how we react to what happens that <br/>\nmatters - are we on their side or do we blame and shame them? We aren&#39;t <br/>\nfailing when things don&#39;t go right; we are failing when we don&#39;t respond <br/>\nhelpfully and supportively when things don&#39;t go right.<br/>\n<blockquote><span title=\"ireply\"> &gt;   In fact, recently in another post Pam said of her daughters from time to time having some behavior issues that needed to be worked out and that was helpful to hear, for me. I know I can have perfectionistic ideals, I do my best to be aware of and release them before they get in dd&#39;s way.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>First of all, a group of people living under one roof are going t have <br/>\nconflicts. You have just one little one and can put all your focus on <br/>\nher and STILL there are times that her needs and wants conflict with <br/>\nyours, right? So - you try to find ways of meeting each person&#39;s needs <br/>\nand wants, and you get to practice that now while it is pretty <br/>\nstraightforward (she wants to play ball, you want to make breakfast). By <br/>\nthe time she&#39;s older and might have siblings and will almost certainly <br/>\nhave other people in your lives (friends, neighbors, extended family), <br/>\nyou&#39;ll have some experience in working together to balance out <br/>\nconflicting wants and you&#39;ll have created a sense of teamwork and <br/>\nconsensual living with each other.<br/>\n<br/>\nWhen Roxana lived in France for 3 months, with a large group of other <br/>\nyoung adults - 18 to 20 year olds -  they began to turn to her to help <br/>\nthem sort out conflicts. SHE became known as the person who could find <br/>\nsolutions. She was struck by how little ability the others had to <br/>\nresolve apparent conflicts of interest and, mostly, she was struck by <br/>\nhow unwilling or unable they seemed to be to see a solution as even <br/>\npossible. The irony is that, in our family, she&#39;s the one who has had <br/>\nthe hardest time, over the years, staying solution-oriented, thinking of <br/>\nways to resolve conflicts to everyone&#39;s satisfaction. She&#39;s the one who <br/>\nwas always most likely to give up or get angry (frustrated). She&#39;s easy <br/>\nto get along with, these days. I thought, for some years, that she&#39;d <br/>\nnever be able to live with anyone but us - that nobody else would be <br/>\nwilling to just keep trying to get along with her. She went to a school <br/>\nfor kindergarten and our goal for her, there, was to get through a full <br/>\nday without having a big emotional melt down. But she&#39;s off to college <br/>\nin September and I have no doubt that she&#39;ll be the best roommate on the <br/>\ncampus. Seriously - she&#39;s the EASIEST person imaginable to get along <br/>\nwith, now. She&#39;s still very sensitive - she feels things very very <br/>\ndeeply. But she can handle herself - can handle her own emotional <br/>\nreactions. She&#39;s a person I would describe as very centered and stable, <br/>\nthese days.<br/>\n<br/>\nSo - keep reading. We DO talk about the problems and difficulties we&#39;ve <br/>\nhad and how this unschooling lifestyle has played out in our real lives.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":288325711,"authorName":"dinapug310","from":"&quot;dinapug310&quot; &lt;b38040@...&gt;","profile":"dinapug310","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too much choice?","postDate":"1248967134","msgId":46566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg0c2RrdStzNGM0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYyNDVFNERELTUxQ0EtNDcwMy04QUYxLTAxMjU0MTIyQ0U4MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46565,"nextInTopic":46567,"prevInTime":46565,"nextInTime":46567,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"=-Also, Thea is sometimes throwing down an object that frustrates ... Did you mean 2 year old?  Not nit-picking, just wondering if you were making a diferent","messageBody":"<div id=\"ygrps-yiv-967064262\">=-Also, Thea is sometimes throwing down an object that frustrates  <br/>\n<blockquote><span title=\"ireply\"> &gt; her. I&#39;m always sure to let her know that I&#39;m there, that I see how it  <br/>\n&gt; can be frustrating, etc and help her if she wants it, but when she  <br/>\n&gt; gets upset, she&#39;ll do that or put her head down on the floor for a  <br/>\n&gt; while.-=-<br/>\n&gt; <br/>\n&gt; Are you talking to a one year old about being there and knowing she  <br/>\n&gt; can be frustrated?   To a one year old, most of that will sound like  <br/>\n&gt; &quot;blah blah BLAHdee blah blah.&quot;  Help her with the objects or find less  <br/>\n&gt; frustrating objects.<br/>\n<br/>\n </span></blockquote>Did you mean 2 year old?  Not nit-picking, just wondering if you were making a diferent point that I don&#39;t understand.  I think that she, at 2, can understand me validating her feeling of frustration even if it&#39;s just through my tone and movement toward her and it to help her. Our home is very kid friendly, but sometimes, for example, when she takes the back off of the remote control to the dvd player which she has access to, because she can and does like to use it if she&#39;s watching a movie, she can&#39;t get it back on.  She will then, sometimes, throw it down.  I could tape it, I guess, but then she knows that it comes off and now I&#39;ve prevented that. <br/>\nShe was throwing a Mrs. Potato Head flower bracelet that didn&#39;t stay on, because it frustrated her. I put it away somewhere.  If she asks for it back, I&#39;ll give it to her, but for now it&#39;s out of sight.<br/>\n<br/>\n-=-I know everyone has an outlet, I think.-=-<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; An outlet such as what?  Putting her head down on the floor?  Throwing  <br/>\n&gt; things?<br/>\n&gt; <br/>\n&gt; People have MANY outlets.  &quot;Outlets&quot; are sometimes attempts at  <br/>\n&gt; communication.  Sometimes they&#39;re self-soothing ways to deal with  <br/>\n&gt; frustration, or ways to discharge adrenaline.<br/>\n&gt; <br/>\n&gt; Can you rephrase &quot;everyone has an outlet,&quot; please?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Yes, I mean a way of expressing a healthy release of emotions.  And I&#39;m wondering if they&#39;re good to have or should I be better able to handle every possibile frustration?  Of course it&#39;s not possible and I don&#39;t think that&#39;s healthy.  But creating circumstances that will limit those potentials, I do.<br/>\n<br/>\nI am also questioning conventional wisdom and am looking to bounce it off of people that I trust.  So if it&#39;s common for &#39;many kids&#39; let&#39;s say, to put they&#39;re heads down when they&#39;re frustrated, well, I&#39;m wondering if that&#39;s true or true for conventional parenting practices.  I may be lacking in an area that I need to adjust for her and myself.  Or I&#39;m simply overthinking the whole bit. &lt;g&gt;<br/>\n<br/>\nDina</div>","specialLinks":[]},{"userId":246197982,"authorName":"Ren Allen","from":"&quot;Ren Allen&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too much choice?","postDate":"1248966815","msgId":46563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg0c2RhditwZHFlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGg0cjFraSthaDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":46562,"nextInTopic":46564,"prevInTime":46562,"nextInTime":46564,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"~~How do you say the no, you can t carve into the wooden table part?~~ NO, you can t carve into the wooden table . Just NO is ok!! Or, hey, here s a piece","messageBody":"<div id=\"ygrps-yiv-1280045499\">~~How do you say the &#39;no, you<br/>\ncan&#39;t carve into the wooden table&#39; part?~~<br/>\n<br/>\n&quot;NO, you can&#39;t carve into the wooden table&quot;. <br/>\nJust NO is ok!!<br/>\n<br/>\nOr, &quot;hey, here&#39;s a piece of wood you can carve on, I don&#39;t want anyone carving on the table&quot;<br/>\n<br/>\nBut why would a two year old be carving into wood with a knife anyway? My children certainly didn&#39;t have the awareness or skills at that age to safely use sharp knives.<br/>\n<br/>\nRen<br/>\nradicalunschooling.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: too much choice?","postDate":"1248953117","msgId":46562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2RjI5NDdDLUI2RDktNDg2OC1BN0RGLTQwNUQ2MzcxMEI4MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg0cjFraSthaDNxQGVHcm91cHMuY29tPg==","referencesHeader":"PGg0cjFraSthaDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":46561,"nextInTopic":46563,"prevInTime":46561,"nextInTime":46563,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"-=- I m not sure if or how this was being applied to my email, Sandra, I just want to clarify that I was not blaming unschooling in any way.-=- Even talking","messageBody":"<div id=\"ygrps-yiv-86039932\">-=-<br/>\nI&#39;m not sure if or how this was being applied to my email, Sandra, I  <br/>\njust want to clarify that I was not blaming unschooling in any way.-=-<br/>\n<br/>\nEven talking about unschooling with a one-year-old, though, seems to  <br/>\nme to be shining the flashlight into the basement to look for  <br/>\nsomething in the attic.    And people DO &quot;blame&quot; unschooling, every  <br/>\nday, all the time.  Someone who doesn&#39;t have a car big enough for the  <br/>\nwhole family will complain that unschooling doesn&#39;t work because her  <br/>\nkids are tired of being stuck at home and there&#39;s not anywhere near  <br/>\nenough to walk to that they haven&#39;t already seen.   Someone who can&#39;t  <br/>\npersuade her own husband or mother that unschooling is a good idea  <br/>\nbecause she herself either can&#39;t understand it or can&#39;t articulate it  <br/>\nwill blame us or unschooling.<br/>\n<br/>\nWhen an idea is put on the list here it&#39;s the idea we&#39;re looking at  <br/>\nthen, not the original poster&#39;s life.  And in this case the original  <br/>\nposter was me! &lt;g&gt;  I was after a discussion of ideas.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: too much choice?","postDate":"1248952283","msgId":46561,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0OUNDODRCLUU0QkMtNEU3RS1BRTVGLTJEOTE5MkI3ODYxM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg0cjhqNytqZWI1QGVHcm91cHMuY29tPg==","referencesHeader":"PGg0cjhqNytqZWI1QGVHcm91cHMuY29tPg=="},"prevInTopic":46560,"nextInTopic":46562,"prevInTime":46560,"nextInTime":46562,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"Before any of my yeah but analysis, I want to quote this up top and say it s wonderful and everyone with young children should consider printing it out or","messageBody":"<div id=\"ygrps-yiv-1775114663\">Before any of my &quot;yeah but&quot; analysis, I want to quote this up top and  <br/>\nsay it&#39;s wonderful and everyone with young children should consider  <br/>\nprinting it out or setting it to a tune and singing it sometimes!<br/>\n<br/>\n&quot;[U]ltimately the best strategy is to create an environment in which  <br/>\nchildren are generally not frustrated, angry and upset. Two year<br/>\nolds thrive on lots of love, attention, physical play, variety,  <br/>\nplaying in the sand pit, water play, singing, being read to, plenty of  <br/>\nsnacks and drinks, swings and playgrounds. To allow Eden to do an  <br/>\nactivity and still keep her safe I stay right with her, and will  <br/>\nprobably need to keep doing this for at least the next 12 months.&quot;<br/>\n<br/>\n-=-Another example is that when she is angry Eden will throw any  <br/>\nobject within reach across the room (including food). Obviously I  <br/>\ndon&#39;t want this to happen because she may hurt someone. I used to  <br/>\nsternly say &#39;no, Eden, don&#39;t throw!&#39; until I realised the utter  <br/>\nfutility of this approach-=-<br/>\n<br/>\nI would think you don&#39;t want it to happen because it&#39;s damaging to the  <br/>\nhouse, wasteful of food, and it keeps her from finding other ways to  <br/>\nhandle frustration.<br/>\n<br/>\nInstead of &quot;No, Eden, don&#39;t throw,&quot; what about just &quot;Why are you  <br/>\nthrowing that?&quot;  or &quot;HEY!&quot;   But if she&#39;s two, and she has more ammo  <br/>\nto throw, take her supplies out.  If she&#39;s throwing blocks, get her  <br/>\naway from the blocks, or put something over them while you&#39;re talking  <br/>\nto her, like a blanket maybe.  Or pick her up and talk to her or get  <br/>\nher to a softer place--a bed or somewhere, and talk to her nicely.    <br/>\nIf she&#39;s throwing corn or peas and there&#39;s more where that came from,  <br/>\nscoot the bowl over or just pick it up and move it.<br/>\n<br/>\n-=-What I do now is a) take her desires seriously by trying to get her  <br/>\nthe thing she wants, rather than fobbing her off with something else,  <br/>\nb) model using respectful language, and explaining that throwing is  <br/>\nnot okay because she might hurt someone, and c) as a last resort, I  <br/>\nput my hand on the object as well, so it can&#39;t be thrown.-=-<br/>\n<br/>\nI think C should be the first option, and A might have been good  <br/>\nbefore she was throwing things, but it depends what the desired object  <br/>\nor activity in A is.  If a kid wants to take a hatchet to the cat,  <br/>\ndon&#39;t try to get her that thing.  Don&#39;t consider it &quot;fobbing off&quot; to  <br/>\nfind an interesting alternative.  You want her to be safe and engaged  <br/>\nwith something that makes her think, so if you have ideas you know  <br/>\nshe&#39;ll like and her original idea was problematical, don&#39;t think of it  <br/>\nas you having failed or taken a bad plan B.  It might be the most  <br/>\nbrilliant plan ever.<br/>\n<br/>\nYoung children really do need the presence and attention of an adult.   <br/>\nThere&#39;s no way around it.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: too much choice?","postDate":"1248951727","msgId":46560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyNDVFNERELTUxQ0EtNDcwMy04QUYxLTAxMjU0MTIyQ0U4MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGg0cjFraSthaDNxQGVHcm91cHMuY29tPg==","referencesHeader":"PGg0cjFraSthaDNxQGVHcm91cHMuY29tPg=="},"prevInTopic":46559,"nextInTopic":46561,"prevInTime":46559,"nextInTime":46561,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"-= I don t want her to be upset, but we have to move on to the next thing at some point. I rolled out of it by asking her if she wanted to crack the eggs,","messageBody":"<div id=\"ygrps-yiv-1353649459\">-= I don&#39;t want her to be upset, but we have to move on to the next  <br/>\nthing at some point. I rolled out of it by asking her if she wanted to  <br/>\ncrack the eggs, which I then wondered if was a form of coercion.-=-<br/>\n<br/>\nBe careful of &quot;have to.&quot;  If you think of it as something you &quot;have  <br/>\nto&quot; do, she becomes an obstacle.  I&#39;m not saying there aren&#39;t things  <br/>\nthat would hamper life if  you didn&#39;t do them.  Food, laundry,  <br/>\ncleaning the cat box, watering dying plants...  still they&#39;re choices.<br/>\n<br/>\n-=-What do you say and how do you be firm? I know the more creative I  <br/>\ncan be, the better,-=-<br/>\n<br/>\nDo you have to be firm or creative to get your husband to do things?   <br/>\nIf you make them seem fun, or if you simply state the reasons, your  <br/>\nhusband&#39;s probably willing to go along.  A baby doesn&#39;t have the same  <br/>\nkinds of awareness and reasoning an adult has, but still you could  <br/>\ntalk to her about why you want to (not &quot;have to&quot;) move to the  <br/>\nkitchen.  You could talk to her about it while you&#39;ve picked her and  <br/>\nher ball up and tell her you have an idea for another game.  And you  <br/>\ncould put some plastic bowls down for targets maybe, or a pan she  <br/>\ncould put the ball in.  Maybe give her a ladle to try to fish the ball  <br/>\nout with.    Meanwhile, you&#39;d be in the kitchen and she might be  <br/>\nhappily doing something new.<br/>\n<br/>\n-=-Sandra, I read in the archives a statement you said to the effect  <br/>\nthat you wouldn&#39;t let your kids carve into the wooden table. How do  <br/>\nyou say the &#39;no, you can&#39;t carve into the wooden table&#39; part?-=-<br/>\n<br/>\nHEY! Don&#39;t.<br/>\nJust like that.  Just as I would if my neighbor came over and  <br/>\ncommenced to look like she was going to carve something up in my house.<br/>\nFor the neighbor, I might say &quot;Carve your own table.&quot;  For the kids  <br/>\nI&#39;d offer something more interesting that that knife, put the knife  <br/>\naway, and be more careful in the future not to leave my kids bored  <br/>\nwith a knife and my table as their only toys.<br/>\n<br/>\n-=-Also, Thea is sometimes throwing down an object that frustrates  <br/>\nher. I&#39;m always sure to let her know that I&#39;m there, that I see how it  <br/>\ncan be frustrating, etc and help her if she wants it, but when she  <br/>\ngets upset, she&#39;ll do that or put her head down on the floor for a  <br/>\nwhile.-=-<br/>\n<br/>\nAre you talking to a one year old about being there and knowing she  <br/>\ncan be frustrated?   To a one year old, most of that will sound like  <br/>\n&quot;blah blah BLAHdee blah blah.&quot;  Help her with the objects or find less  <br/>\nfrustrating objects.<br/>\n<br/>\n-=-I know everyone has an outlet, I think.-=-<br/>\n<br/>\nAn outlet such as what?  Putting her head down on the floor?  Throwing  <br/>\nthings?<br/>\n<br/>\nPeople have MANY outlets.  &quot;Outlets&quot; are sometimes attempts at  <br/>\ncommunication.  Sometimes they&#39;re self-soothing ways to deal with  <br/>\nfrustration, or ways to discharge adrenaline.<br/>\n<br/>\nCan you rephrase &quot;everyone has an outlet,&quot; please?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":363518215,"authorName":"claire.horsley08","from":"&quot;claire.horsley08&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too much choice?","postDate":"1248929191","msgId":46559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg0cjhqNytqZWI1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyOTA3OC4xMTg1OS5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":46558,"nextInTopic":46560,"prevInTime":46558,"nextInTime":46560,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"My daughter Eden has also just turned two.  It s an interesting time because her ability to express her own will is increasing, but her emotions are also very","messageBody":"<div id=\"ygrps-yiv-808381528\">My daughter Eden has also just turned two.  It&#39;s an interesting time because her ability to express her own will is increasing, but her emotions are also very strong and can be overwhelming. I have lots of occasions to think about saying yes and saying no!<br/>\n<br/>\nFor example, last weekend my older daughter wanted to go on a pony ride, and when we got to the riding centre, Eden very much wanted to have a ride too.  Now the minimum age is supposed to be 3, but when I offered to walk next to her and hold her while she was sitting on the pony, the riding instructor agreed.  So, to generalise from this example, if a 2-year old wants to participate in something and it can be done safely, say yes.<br/>\n<br/>\nHowever, when the 1/2 hour ride was over, Eden was extremely upset (crying and throwing herself on the ground).  I stayed right next to her, comforting her until she calmed. I was not angry or even embarrassed (before reading here I would have been embarrassed!).  I just allowed her to express her emotions and then quickly moved on by jiggling and singing to her as we walked to the car.<br/>\n<br/>\nAnother example is that when she is angry Eden will throw any object within reach across the room (including food).  Obviously I don&#39;t want this to happen because she may hurt someone.  I used to sternly say &#39;no, Eden, don&#39;t throw!&#39; until I realised the utter futility of this approach.  What I do now is a) take her desires seriously by trying to get her the thing she wants, rather than fobbing her off with something else, b) model using respectful language, and explaining that throwing is not okay because she might hurt someone, and c) as a last resort, I put my hand on the object as well, so it can&#39;t be thrown.<br/>\n<br/>\nBut ultimately the best strategy is to create an environment in which children are generally not frustrated, angry and upset.  Two year<br/>\n olds thrive on lots of love, attention, physical play, variety, playing in the sand pit, water play, singing, being read to, plenty of snacks and drinks, swings and playgrounds.  To allow Eden to do an activity and still keep her safe I stay right with her, and will probably need to keep doing this for at least the next 12 months.<br/>\n<br/>\nThe great thing is that in dealing calmly, respectfully and lovingly with my daughter&#39;s emotions, I feel that I CAN do this, and that the reward of a close and happy relationship is so worth it!</div>","specialLinks":[]},{"userId":288325711,"authorName":"dinapug310","from":"&quot;dinapug310&quot; &lt;b38040@...&gt;","profile":"dinapug310","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too much choice?","postDate":"1248922066","msgId":46558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg0cjFraSthaDNxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyOTA3OC4xMTg1OS5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":46557,"nextInTopic":46559,"prevInTime":46557,"nextInTime":46559,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"Since this has been posted here, I do not mind saying that I was the original sender.  My name is Dina, I have a 2yo dd and am new to this list, but have been","messageBody":"<div id=\"ygrps-yiv-374680397\">Since this has been posted here, I do not mind saying that I was the original sender.  My name is Dina, I have a 2yo dd and am new to this list, but have been on a couple of others for a couple of years now. I found unschooling when I was pregnant and was thrilled, because it resonated so deeply and was an extension of the life I was living before motherhood.<br/>\n<br/>\n--And I&#39;ll say again up front that I don&#39;t think blaming unschooling for<br/>\nproblems with two year olds is any good, as there&#39;s nowhere I know of<br/>\nwhere two year olds are required by the government to go to school, so<br/>\nit&#39;s not the unschooling...--<br/>\n<br/>\nI&#39;m not sure if or how this was being applied to my email, Sandra, I just want to clarify that I was not blaming unschooling in any way.<br/>\n<br/>\nI&#39;d like to say that I have had a great deal of clarity since first writing.  It was just what I needed, to put the words out there and really chew on them.  Plus after I hit send on the email, I randomized on Sandra&#39;s site until I got what I needed and my issue of late is mindfulness.  I have not been as present as I should be lately.  It made a world of difference even just today.  <br/>\n<br/>\nFor the most part, we have a lovely, joyful home and life together.  If anything, and part of my recently doubting myself, I am sometimes nudged by dh and my mom if she can get it in there, that I am a bit over the top in accomodating dd.  I think it&#39;s in the &quot;normal&quot; range of this unconventional lifestyle, however.  And dh understands a bit, but I don&#39;t really bother with my mom, though I will at some point.  <br/>\n<br/>\nI think that with Thea reaching this new period, things have become much faster and I have to be much more &quot;on.&quot;  And, I am getting stuck on a few points that perhaps you can make suggestions for, now that I am more clear in my thinking.<br/>\n<br/>\nWhat I am looking for is terminology, verbage...this morning, upon waking (we cosleep), we nursed, read, played a bit, I said I wanted to change the sheets right away on Thea&#39;s bed so we had fun doing that together, then we got up and she quickly saw her ball and we recently made up a new game so she wanted to play that in the bedroom a bit more.  We did that.  At some point, I had to get breakfast going.  I gave her a heads up while we were playing that we&#39;d eat soon, so she knew, and after a decent amount of playing time (to me, I guess) I said let&#39;s go in the kitchen.  She didn&#39;t want to.  Here is where I start to internally squirm.  I don&#39;t want her to be upset, but we have to move on to the next thing at some point. I rolled out of it by asking her if she wanted to crack the eggs, which I then wondered if was a form of coercion.  This is the kind of situation I wonder about.  What do you say and how do you be firm? I know the more creative I can be, the better, but sometimes, things have to be a certain way and believe me, often I&#39;ll avoid things if I can, which is where part of the free reign I was speaking of comes in.<br/>\n<br/>\nSandra, I read in the archives a statement you said to the effect that you wouldn&#39;t let your kids carve into the wooden table.  How do you say the &#39;no, you can&#39;t carve into the wooden table&#39; part?<br/>\n<br/>\nAlso, Thea is sometimes throwing down an object that frustrates her.  I&#39;m always sure to let her know that I&#39;m there, that I see how it can be frustrating, etc and help her if she wants it, but when she gets upset, she&#39;ll do that or put her head down on the floor for a while.  I am wondering if these are normal behaviors that I should just be with or am I and dh creating some kind of distress in the home causing the behavior.  I know everyone has an outlet, I think.  Part of my problem, which is completely my thing, is in thinking that this wonderful way of raising my daughter is going to help always have things go smoothly and she&#39;ll never have a problem.  In fact, recently in another post Pam said of her daughters from time to time having some behavior issues that needed to be worked out and that was helpful to hear, for me. I know I can have perfectionistic ideals, I do my best to be aware of and release them before they get in dd&#39;s way.<br/>\n<br/>\nLet me stop here.<br/>\n<br/>\nThank you all for your help.<br/>\nDina</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] too much choice?","postDate":"1248884370","msgId":46557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyOTA3OC4xMTg1OS5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDdCQTUxN0E3LTNENjEtNDZFQS1BMzhFLTEzNDlEMjM5QkVGOUBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDdCQTUxN0E3LTNENjEtNDZFQS1BMzhFLTEzNDlEMjM5QkVGOUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":46556,"nextInTopic":46558,"prevInTime":46556,"nextInTime":46558,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"I think I would really need more information to be able to say anything about what is going on in this case. At this age kids need someoneconstantly next to","messageBody":"<div id=\"ygrps-yiv-1261273029\">I think I would really need more information to be able to say anything about what is going on in this case.<br/>\nAt this age kids need someoneconstantly next to them.<br/>\nI see too that some parents expect too much from little children and want them to be able to rationalize like adults.<br/>\nSandra talked aboutclothes choices.<br/>\nMy first question would be WHY?<br/>\nWhy can&#39;t mychild not wear a coat to the beach?( for example- if she was set on it)<br/>\nI would get her swimming suit under it and plenty of extra clothes and towels.<br/>\nMy kids were the kind of kids that always knew what theywanted to wear. Telling them NO would have created a battle and a huge melt down.<br/>\nSo I wasalways prepared with lots of extra clothes in the car. Once they got to thebeach they would have gotten hot and removed the coat. I always explainedto them that they might feel hot.More and more they would trust me and as they got older they were more likely to , and able, to correlate what I wassaying to their experience.<br/>\nJustyesterday atour County Fair my Mother -in-lawhad some new clothes for my 3 year old Gigi.<br/>\nRightaway Gigi wanted to wear the dress she got. It was a fall dress with long sleeves. I told her she might get hot. She still chose to do it and was OK with being hot.( It wasn&#39;t too hot anyways- but hot for ME)<br/>\nSoasking yourself why and taking in considerationhow your childhandles certain things.<br/>\nI know my sister&#39;s kidsnever cared what mom picked upfor them to wear, so totally different than my kids.<br/>\nThat is not to say we don&#39;t ever say no.<br/>\nWe have been at the County Fair for the last 3 days ( today will be the last) showing our animals. We bring our food and drinks because the prices are absurd there and we cannot really afford it.<br/>\nWe also cannot afford the rides this year. Really. We are Dairy Farmers and we are running on negative.<br/>\nSo we told the kids when they asked that no we could notdo the rides. They wanted to. They do trust us that when wesay no it is because we really can&#39;tand there is a good reason.<br/>\nI don&#39;t care if my daughter wears her pretty sandals to the barn. Why not? I got them on a garage sale.<br/>\nI don&#39;t care if my son does not want towear a jacketto go out in the winter. We take the jacket and warm up the car. Gosh I hate wearing a jacket in the car too. We won&#39;t frezze walking from the house to the car.<br/>\nEven when the temperatures are in the teens.<br/>\n<br/>\nIt pays to be always prepared , having extra clothes, foodand toys in the car, ...<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] too much choice?","postDate":"1248867845","msgId":46556,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxMDAyOS43NjA5Ny5xbUB3ZWI1MzkwMy5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PDdCQTUxN0E3LTNENjEtNDZFQS1BMzhFLTEzNDlEMjM5QkVGOUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":46555,"nextInTopic":46557,"prevInTime":46555,"nextInTime":46557,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"At two I think you have lots of control over the environment. Make the house, at least most of it, so kid friendly she cannot get into much trouble. Put","messageBody":"<div id=\"ygrps-yiv-566598159\">At two I think you have lots of control over the environment. Make the house, at least most of it, so kid friendly she cannot get into much trouble. Put markers, scissors, paint, breakables, etc out of her reach and view. Put away off season clothes so they are not a temptation. Don&#39;t go places inappropriate for a two year old. Keep out appropriate snacks so she does not need to go in the cupboards. Lay down with her at nap and bed time so going to bed is pleasant and looked forward to. <br/>\n<br/>\nThat&#39;s all I can offer without a specific problem.<br/>\n<br/>\nAmanda<br/>\nEli 8, Samuel 6 1/2<br/>\n<br/>\n\t <br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t<br/>\n<br/>\n<br/>\n\t<br/>\n\t<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"too much choice?","postDate":"1248851422","msgId":46555,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCQTUxN0E3LTNENjEtNDZFQS1BMzhFLTEzNDlEMjM5QkVGOUBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":46556,"prevInTime":46554,"nextInTime":46556,"topicId":46555,"numMessagesInTopic":0,"msgSnippet":"This came by e-mail from someone who s been on two other lists, and it seems maybe another example of bad advice elsewhere, but it could be general confusion","messageBody":"<div id=\"ygrps-yiv-1433005310\">This came by e-mail from someone who&#39;s been on two other lists, and it  <br/>\nseems maybe another example of bad advice elsewhere, but it could be  <br/>\ngeneral confusion about &quot;say yes.&quot;<br/>\n<br/>\nI didn&#39;t think of any links right offhand so I&#39;m hoping people here  <br/>\nwill have suggestions and philosophy and links.<br/>\n<br/>\nAnd I&#39;ll say again up front that I don&#39;t think blaming unschooling for  <br/>\nproblems with two year olds is any good, as there&#39;s nowhere I know of  <br/>\nwhere two year olds are required by the government to go to school, so  <br/>\nit&#39;s not the unschooling, as Mary Gold says.<br/>\n<br/>\n-----------------<br/>\n<br/>\nMy daughter is turning 2 on Saturday and I&#39;ve been feeling overwhelmed  <br/>\nlately.<br/>\n<br/>\nI&#39;m pretty in tune with unschooling and where I&#39;m out of tune. I&#39;ve  <br/>\nbeen looking on your site and in the archives for help in how to speak  <br/>\nto Thea. I don&#39;t want to be controlling, but in not wanting to be  <br/>\nthat, I feel like I&#39;m allowing too much. I know that doesn&#39;t sound  <br/>\nright. I&#39;m having trouble explaining this even to myself. Pam wrote  <br/>\nrecently, though I can&#39;t find it, some actual phrases she used when  <br/>\nspeaking with her children and they were very direct and clear as to  <br/>\nwhat needed to happen next say or say what was acceptable. I think I  <br/>\nget railroaded sometimes and because I don&#39;t want to control, Thea  <br/>\ngets free reign so to speak or I do find that I am trying to control  <br/>\nand unhappy with it and the results. This is long winded, I  <br/>\napologize.  I think I&#39;m feeling unsure of what I guess would be a  <br/>\ngentle discipline of sorts, what it&#39;s okay to do or say sometimes.  <br/>\nSomething is amiss, I can&#39;t even put my finger on it, hopefully that  <br/>\nmeans I&#39;m nearing some kind of a breakthrough.<br/>\n<br/>\nIf I&#39;m being clear enough, what I was hoping was that you could direct  <br/>\nme to perhaps something on your site or a previous discussion that  <br/>\nwould help, that I am having trouble locating. Or any advice would be  <br/>\nso appreciated or a book, if one comes to mind.<br/>\n<br/>\n---------------------<br/>\n<br/>\nFor me, for starters, I don&#39;t think a two year old should get &quot;free  <br/>\nreign.&quot;  I thing she should be presented with happy choices within the  <br/>\nrange of the day.  Instead of &quot;you can wear anything on earth that you  <br/>\ncan imagine, or nothing at all,&quot; maybe &quot;We&#39;re going to the woods, so  <br/>\npick long pants and close-toed shoes.&quot;  And in the case of a two year  <br/>\nold, that&#39;s more like showing her what you think she should wear, or  <br/>\njust dressing her very happily and taking into consideration if she  <br/>\nwants to reject something, and advising and maybe vetoing her other  <br/>\nsuggestions.<br/>\n<br/>\nA sparkly bathing suit isn&#39;t good for tree climbing.   A furry hoodie  <br/>\nisn&#39;t good for the beach (unless it&#39;s winter and nobody intends to  <br/>\ntouch water).<br/>\n<br/>\nIn a partnership between an adult and a two year old, the two year old  <br/>\ncan be given immense choice without the parent setting aside what she  <br/>\nknows would be helpful and useful and necessary.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":46497,"nextTopicId":46437}}