{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":146409249,"authorName":"glad2bmadly","from":"glad2bmadly &lt;glad2bmadly@...&gt;","profile":"glad2bmadly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New unschooling lists; why I&#39;ll choose this one","postDate":"1057010701","msgId":75783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwNjMwMjIwNTAxLjcyNjA1LnFtYWlsQHdlYjQyMDAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PEJCMjU3MzZELjFCNjMwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":75757,"nextInTopic":0,"prevInTime":75782,"nextInTime":75784,"topicId":75614,"numMessagesInTopic":0,"msgSnippet":"Fetteroll  wrote: ****I think one of the problems with this list is that since it s the one and only list that Unschooling.com","messageBody":"<div id=\"ygrps-yiv-702796192\">Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>&gt; wrote:<br/>\n<br/>\n****I think one of the problems with this list is that since it&#39;s the one and<br/>\nonly list that Unschooling.com provides, it gives the impression it provides<br/>\neverything to everyone. And I think the list often gets dragged down into<br/>\nrancourousness because people want something from the list that it isn&#39;t<br/>\nproviding and so they get angry, trying to get the list to provide what they<br/>\nneed.<br/>\n<br/>\nBut I think if people can get their unschooling support and conversation and<br/>\nwhatever else needs met elsewhere, then this list won&#39;t get dragged down by<br/>\npeople fighting for what they want the list to be. The discussion will be<br/>\nable to stick to discussion. And I think, as I did with unschooling<br/>\ninformation when I wanted formal schooling information, people will be able<br/>\nto tune in out of curiosity. And if something sounds goofy to them, they&#39;ll<br/>\nbe able to read without feeling they need to fight against it to get what<br/>\nthey need the list to be. And that will give time for the new ideas to<br/>\nslowly seep in. As they did with me who thought she wanted formal schooling.<br/>\n...<br/>\nWell it sounds good in theory, anyway! ;-)<br/>\n<br/>\nJoyce*****<br/>\n<br/>\nThat was very clear and makes a lot of sense to me.  <br/>\n<br/>\nMadeline<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\nIf you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a>), or the list owner, Helen Hegener (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a>).<br/>\n<br/>\nTo unsubscribe from this group, click on the following link or address an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a> <br/>\n<br/>\nVisit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nThe New Yahoo! Search - Faster. Easier. Bingo.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New unschooling lists; why I&#39;ll choose\tthis one","postDate":"1056963374","msgId":75757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCMjU3MzZELjFCNjMwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDMwNjI3MDQzMzQ5LjI5OTkwLnFtYWlsQHdlYjQyMDA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":75659,"nextInTopic":75783,"prevInTime":75756,"nextInTime":75758,"topicId":75614,"numMessagesInTopic":0,"msgSnippet":"... I liked your post Madeline! When I first started exploring homeschooling, I wanted Calvert. The idea of everything you need to know arriving in one box","messageBody":"<div id=\"ygrps-yiv-526301330\">on 6/27/03 12:33 AM, glad2bmadly at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:glad2bmadly@...\">glad2bmadly@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am afraid that a kinder and gentler or other option would mean that someone<br/>\n&gt; else who is new to this and looking for real answers wouldn&#39;t stay on the<br/>\n&gt; challenging list long enough to &quot;get it&quot; if there were too many other options.<br/>\n&gt; I have to say that if I hadn&#39;t been instructed to just lurk here for a few<br/>\n&gt; weeks, and had another easy option next door I don&#39;t think I would have come<br/>\n&gt; close to getting it.<br/>\n<br/>\n </span></blockquote>I liked your post Madeline!<br/>\n<br/>\nWhen I first started exploring homeschooling, I wanted Calvert. The idea of<br/>\neverything you need to know arriving in one box appealed to the engineer in<br/>\nme ;-). The unschoolers sounded too lacksadaisical but I stuck with reading<br/>\nwhat they (and everyone else) wrote. Eventually it sank in that the<br/>\nunschoolers were having fun while everyone else was dealing with how to make<br/>\nkids work or finding better products the kids would want to do.<br/>\n<br/>\nI think one of the problems with this list is that since it&#39;s the one and<br/>\nonly list that Unschooling.com provides, it gives the impression it provides<br/>\neverything to everyone. And I think the list often gets dragged down into<br/>\nrancourousness because people want something from the list that it isn&#39;t<br/>\nproviding and so they get angry, trying to get the list to provide what they<br/>\nneed.<br/>\n<br/>\nBut I think if people can get their unschooling support and conversation and<br/>\nwhatever else needs met elsewhere, then this list won&#39;t get dragged down by<br/>\npeople fighting for what they want the list to be. The discussion will be<br/>\nable to stick to discussion. And I think, as I did with unschooling<br/>\ninformation when I wanted formal schooling information, people will be able<br/>\nto tune in out of curiosity. And if something sounds goofy to them, they&#39;ll<br/>\nbe able to read without feeling they need to fight against it to get what<br/>\nthey need the list to be. And that will give time for the new ideas to<br/>\nslowly seep in. As they did with me who thought she wanted formal schooling.<br/>\n<br/>\nForcing information on people doesn&#39;t work well in school and it&#39;s caused<br/>\nproblems on the list too. But if there are more lists to choose from, people<br/>\nwon&#39;t be so dependent on this list and they&#39;ll allow it to be what it is.<br/>\n<br/>\nI hope people will use the conversational list so it can provide the<br/>\nconnetion with other unschoolers that many people need. (I suspect all the<br/>\nlists will be slow to begin with since even this list has slowed way down,<br/>\nperhaps with people off on vacation or just out enjoying the nice weather.<br/>\n:-) <br/>\n<br/>\nWell it sounds good in theory, anyway! ;-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] New unschooling lists; why I&#39;ll choose this one","postDate":"1056816535","msgId":75659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwLjNiYjBjYzc0LjJjMmYxNzk3QGFvbC5jb20+"},"prevInTopic":75614,"nextInTopic":75757,"prevInTime":75658,"nextInTime":75660,"topicId":75614,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/26/03 10:35:27 PM, glad2bmadly@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-1885720367\">In a message dated 6/26/03 10:35:27 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:glad2bmadly@...\">glad2bmadly@...</a> writes:<br/>\n<br/>\n&lt;&lt; As easy and comforting as it can be to sit around and chat with utterly <br/>\nlike-minded, like-categoried folk, it is the people in any community who <br/>\nchallenge me and keep me honest who keep me in the community.   Who knew that a <br/>\ncommunity of people in cyberspace could have more inpact on my parenting than my <br/>\nimmediate family community?  I am letting go of so many supposed convictions, <br/>\n... well, at least realizing that they are beliefs and that they can be held <br/>\nupside down for a while to lose some dust.<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>Madeline, I liked your post about this list, and just couldn&#39;t think of <br/>\nanything good (worthy) to say.  But I wanted to pass on that some time back an <br/>\nold-time homeschooler who has also done years of online helping was joking with me <br/>\nabout what some people seem to want, and we came up with an <br/>\nautomatic-response list idea!  A person could go to a webpage (or it could be a list) and write <br/>\nas much or as little as they want about their concerns about homeschooling, <br/>\nand they would get a response.  Randomized maybe, or geared to key phrases they <br/>\n might have used.  And the responses could be things like<br/>\n<br/>\n* Your kids are *so* lucky to have you as a mother!<br/>\n<br/>\n* You know your kids better than anyone; just do what you think is right!<br/>\n<br/>\n* Homeschooling&#39;s never the same for any two families, so don&#39;t worry about <br/>\nwhether yours is &quot;normal.&quot;<br/>\n<br/>\n* Whatever works for your family is good.  (that one was just added to my <br/>\nlist this week)<br/>\n<br/>\n* What you do isn&#39;t important, it&#39;s that you love your children and want the <br/>\nbest for them.<br/>\n<br/>\n* Children are very forgiving.  I&#39;m sure they&#39;ll understand when they&#39;re <br/>\ngrown why you had to do what you did.<br/>\n<br/>\nWhile there&#39;s truth in all those statements in some situations (and maybe <br/>\nmost) and while a full range of all kinds of parenting is justifiable within <br/>\nvarious frameworks, I still don&#39;t think automated feedback is really what people <br/>\nneed to get them from a lifetime of conditioning about the importance of books <br/>\nand courses and scores to Just LIVING and learning.<br/>\n<br/>\nAnd just living in the midst of the continuuing belief that each child NEEDS <br/>\neventually to be able to outline a chapter from a history textbook and to <br/>\nbalance equations before he&#39;s fourteen isn&#39;t the kind of living that experienced <br/>\nunschoolers have been talking about since before I came along.  They&#39;ve been <br/>\ntalking about things to do, places to go, interesting people and hobbies and <br/>\nfascinations.<br/>\n<br/>\nIt can&#39;t be described easily and simply.  It can&#39;t be understood without a <br/>\nfamily trying it and tweaking it.  But as with many things, the understanding <br/>\noften comes almost suddenly at some point, when people GET it, really, at a gut <br/>\nlevel, and begin to trust it.<br/>\n<br/>\nI&#39;m glad two LLL leaders named Lori and Carol were willing to let me hang out <br/>\nin their houses and they answered my questions and told me stories and made <br/>\nsuggestions I could use about how to have a warmer relationship with my own <br/>\nkids.  Not everyone is lucky enough to have two big unschooling families so near. <br/>\n  But this list can be even better than that, for people who want the ideas.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":146409249,"authorName":"glad2bmadly","from":"glad2bmadly &lt;glad2bmadly@...&gt;","profile":"glad2bmadly","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"New unschooling lists; why I&#39;ll choose this one","postDate":"1056688429","msgId":75614,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwNjI3MDQzMzQ5LjI5OTkwLnFtYWlsQHdlYjQyMDA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":75659,"prevInTime":75613,"nextInTime":75615,"topicId":75614,"numMessagesInTopic":0,"msgSnippet":"I am a relatively new member here.  I started reading about two months ago.  If there had been an Unschoolers who believe in food restrictions option, or an","messageBody":"<div id=\"ygrps-yiv-174296357\">I am a relatively new member here.  I started reading about two months ago.  If there had been an &quot;Unschoolers who believe in food restrictions&quot; option, or an &quot;Unschoolers who use positive discipline&quot; or  &quot;Theatre people who unschool&quot;  option, or &quot;Unschoolers from Atlanta&quot; option I would have never come here!!  And I may never have felt myself actually changing the way in which I view my responsibilities as a parent.   I came here for support in unschooling and found out I hadn&#39;t even understood how much more this could encompass than just education.  I, too,  feel the categories of life (as I had perceived them) shifting daily as I watch my kids living and learning.<br/>\n <br/>\nAs easy and comforting as it can be to sit around and chat with utterly like-minded, like-categoried folk, it is the people in any community who challenge me and keep me honest who keep me in the community.   Who knew that a community of people in cyberspace could have more inpact on my parenting than my immediate family community?  I am letting go of so many supposed convictions, ... well, at least realizing that they are beliefs and that they can be held upside down for a while to lose some dust.<br/>\n <br/>\nIf one&#39;s beliefs and convictions aren&#39;t challenged then how does one know if they are real?  I am afraid that a kinder and gentler or other option would mean that someone else who is new to this and looking for real answers wouldn&#39;t stay on the challenging list long enough to &quot;get it&quot; if there were too many other options.  I have to say that if I hadn&#39;t been instructed to just lurk here for a few weeks, and had another easy option next door I don&#39;t think I would have come close to getting it.  <br/>\n <br/>\n-Madeline <br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nThe New Yahoo! Search - Faster. Easier. Bingo.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":75763,"nextTopicId":75796}}