{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Homeschool4us123@aol.com","from":"Homeschool4us123@...","replyTo":"LIST","senderId":"-ur1x2N800gGoJ0FfMdlm7pTPGdpR3VdgEj5yqbE1pMiTgjVoWQZJYZOGug-eTC3jkQ9N2a2tvBTOWKSAl2b","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Daron: was Re: [Unschooling-dotcom] Fieldtrip to a Public School???","postDate":"1000245818","msgId":25310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OS4xNzM2ZjgyLjI4Y2ZlNDNhQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":25309,"nextInTime":25312,"topicId":25310,"numMessagesInTopic":0,"msgSnippet":"Daron- What you did sounds pretty much what we do. Just yesterday we met with our Educational Specialist. P.E. consisted of my children playing almost daily on","messageBody":"<div id=\"ygrps-yiv-323197632\">Daron- What you did sounds pretty much what we do. Just yesterday we met with <br/>\nour Educational Specialist. <br/>\n<br/>\nP.E. consisted of my children playing almost daily on their scooters and from <br/>\ntime to time playing tag and hide-n-seek with the neighborhood kids. <br/>\n<br/>\nReading was mostly me reading books to them, this month it&#39;s been American <br/>\nGirls Meet Samantha and Journey to the Center of the Earth. <br/>\n<br/>\nMath is the kids helping us balance the checkbook, them calculating their <br/>\nallowance and the interest they have earned in the bank, along with helping <br/>\nme keep track of how much money we spend at the grocery store and playing <br/>\ngames like monopoly. <br/>\n<br/>\nHistory has mostly stemed from our reading the American Girls, however my son <br/>\nhas had a facination with the Civil War since last year. <br/>\n<br/>\nScience is usually our gardening. We planted a pumkin patch, zucchini plant, <br/>\ntomato plants, garlic, and green onions alogn with our flowers. Science has <br/>\nalso been catching and observing bugs. <br/>\n<br/>\nPolitical process we don&#39;t get much of, but every once in a while the kids <br/>\nask questions about the president, govoner, voting, etc. Most of our <br/>\npolitical process comes from our visits to city hall. The kids love going <br/>\nthere, they get all kinds of flyers and pamphlets given to them. <br/>\n<br/>\nWriting often is notes, cards, letters to friends. I just make a quick <br/>\nphotocopy. Now that we have a printer the kids love me printing out those <br/>\nonline worksheets. We keep a pile of these around, and whenever the kids want <br/>\nthey pick one up and usually end up just coloring them, but they pretty much <br/>\nalways write their names at the top and will sometimes do a few of the <br/>\nproblems. I really don&#39;t care if they do them or not, they think their fun <br/>\nand it&#39;s a sample for the school. <br/>\n<br/>\nThe kids play TONS of computer games. They love the Jumpstart games, and <br/>\nthose have a &quot;progress report&quot; that you can print out. This is another <br/>\nsample. The kids love playing their Wishbone game (The amazing odessy), and <br/>\nlately we&#39;ve been creating a play using the American Girls Premiere cdrom <br/>\nwhich when we&#39;re done we can print out a screne play.<br/>\n<br/>\nSo, my kids generally cover all learning areas to some extent every month. <br/>\nEven if it&#39;s just one question about the subject, it&#39;s learning and I notate <br/>\nit. I just sit down each evening and I fill in a sheet that the teacher has <br/>\nfor us. It just lists the 7 learning areas and I just add on anything we did <br/>\nthat day that wasn&#39;t already listed as something we had done that month. End <br/>\nof the month we hadn this sheet to the teacher and as we go around doing <br/>\nthings I just keep an eye on things I can use as samples for when portfolios <br/>\nare due. <br/>\n<br/>\nLast year when we went to a Civil War renactment we snapped tons of pics, we <br/>\nphotocopied a couple and gave them to the school as a sample for history. I <br/>\nhad photographs of the kids playing monopoly, playing with magnets, building <br/>\nthings with legos and with our marble run, working in the garden. I had tape <br/>\nconversations of my son talking to the bank manager about his bank account. <br/>\n<br/>\nOur Educational Specialist is very open to unschooling. She tells me often <br/>\nthat we cover more subject and the kids retain more then her other families. <br/>\nI really don&#39;t know what to think about this as it&#39;s not me leading any of <br/>\nthis. My kids are naturally very curious. They love telling her about their <br/>\nrecent projects when she comes. They do this to anybody who visits. They are <br/>\nrightfully proud of their &quot;work&quot;.<br/>\n<br/>\nI&#39;m sorry your charter changed the way they did things. Were you with One2One?<br/>\n<br/>\nI know what you mean about the money. The kids choose a few things they want. <br/>\nThis year Annea wants to take ballet lessons, so we&#39;re seeing about that <br/>\nbeing done through the charter. Our educational specialist worked with one of <br/>\nour well known professional ballet schools. Stephen wants to learn to play <br/>\nviolin and he wants to get involved in theater. I have told both our <br/>\neducational specialist and my fiance that if the charter ever demands work <br/>\nassignments from us like One2One started doing to my friend we&#39;re outta <br/>\nthere. For now we&#39;re able to unschool while having the protection we need <br/>\nfrom our very troublesome neighbors.<br/>\n<br/>\nKimberly<br/>\n<br/>\n<br/>\nKimberly U  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":25307,"nextTopicId":25319}}