{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Another Child Joyfully Cleans Up, and other stuff","postDate":"1295533363","msgId":59009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFBRTI4RjhGOEQ4NzQ0RTlCNTMyODNFREE0ODIxNDgwQEVkUEM+","inReplyToHeader":"PENGQjgxRjJFLTIzRjYtNDU5Qy04OTQzLTVGNjAzODE4QkZEN0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGloNW5kYytpbGhtQGVHcm91cHMuY29tPiA8QUFOTGtUaW1vQlF0cVM3VVRuZ212NjlLU2hONnFielBwclFmeTU0UUR0ZTN2QG1haWwuZ21haWwuY29tPiA8Q0ZCODFGMkUtMjNGNi00NTlDLTg5NDMtNUY2MDM4MThCRkQ3QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":59004,"nextInTopic":0,"prevInTime":59008,"nextInTime":59010,"topicId":58981,"numMessagesInTopic":0,"msgSnippet":"Zachariah (16) has trouble getting his boots for air soft tied tight enough to hold and pretty much always now asks me or his dad to tie them for him so they","messageBody":"<div id=\"ygrps-yiv-1097948377\">Zachariah (16) has trouble getting his boots for air soft tied tight enough to hold and pretty much always now asks me or his dad to tie them for him so they will stay tied.  He always thanks me. <br/>\n<br/>\n Last night I had to drive home in a snow storm.  It took me almost 2 hours to make a normally 20 minute drive home from work.  The heater in the Blazer was not working correctly. Thankfully it would blow for the defroster, but would not blow out the bottom for heat - thus I was freezing from the waist down.  I had also left work with a really bad headache which just got worse as I drove home - so I was extrememly cold, tired and had a severe headache by the time I reached home.  I came in the house and Zac immediately came up to me, and without me even asking, he unzipped my boots for me and took them off my feet for me.  He even rubbed my back for me - which he does quite often lately.<br/>\n<br/>\n<br/>\nLisa<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Another Child Joyfully Cleans Up, and other stuff","postDate":"1295494661","msgId":59004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrMzBPN2lqX2FORFI3dEdzWTlGVlU0dU01QnIwMlIzUHdPQVBhQkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFBTkxrVGltb0JRdHFTN1VUbmdtdjY5S1NoTjZxYnpQcHJRZnk1NFFEdGUzdkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGloNW5kYytpbGhtQGVHcm91cHMuY29tPgk8QUFOTGtUaW1vQlF0cVM3VVRuZ212NjlLU2hONnFielBwclFmeTU0UUR0ZTN2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":59003,"nextInTopic":59009,"prevInTime":59003,"nextInTime":59005,"topicId":58981,"numMessagesInTopic":0,"msgSnippet":"... to help with his socks.  These days he rarely does.  But when he does, I just help.  The other day I looked up at him while I was putting on the second ","messageBody":"<div id=\"ygrps-yiv-397139705\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Likewise, with putting on socks.  He is eight.  He doesn&#39;t always ask me<br/>\n </span></blockquote>to<br/>\nhelp with his socks.  These days he rarely does.  But when he does, I just<br/>\nhelp.  The other day I looked up at him while I was putting on the second<br/>\none, and he said, &quot;I love you, mom.&quot;  I&#39;m sure glad I didn&#39;t miss that<br/>\nmoment by insisting he should be putting on his own socks.&lt;&lt;&lt;<br/>\n<br/>\nI love that. Brian and I relinquish the computers we&#39;re on in favor of<br/>\nKarl&#39;s preference. When he wants to recline he gets the laptop, when he<br/>\nwants the big screen that&#39;s his computer and any game that only works on my<br/>\nancient Mac he can have. I got a bear hug for playing &quot;musical&quot; &#39;puters just<br/>\na few minutes ago which pretty well squelches any temptation to ask him if<br/>\nhe hasn&#39;t been on them long enough already or some silly thing like that. He<br/>\nknows what he wants or he wouldn&#39;t have asked. I get that about putting<br/>\nsocks and shoes on too. Which isn&#39;t easy in the face of others asking<br/>\ndoesn&#39;t he know how to do that himself. At this point, I keep reminding<br/>\nmyself that he&#39;s halfway to 15 now and I&#39;m in no hurry for him to get<br/>\nindependent, thanks anyway.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Another Child Joyfully Cleans Up, and other stuff","postDate":"1295492277","msgId":59003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENGQjgxRjJFLTIzRjYtNDU5Qy04OTQzLTVGNjAzODE4QkZEN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGltb0JRdHFTN1VUbmdtdjY5S1NoTjZxYnpQcHJRZnk1NFFEdGUzdkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGloNW5kYytpbGhtQGVHcm91cHMuY29tPiA8QUFOTGtUaW1vQlF0cVM3VVRuZ212NjlLU2hONnFielBwclFmeTU0UUR0ZTN2QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":59002,"nextInTopic":59004,"prevInTime":59002,"nextInTime":59004,"topicId":58981,"numMessagesInTopic":0,"msgSnippet":"-=- one night I asked my husband to explain something to me. I knew it was an easy question for him to answer, but . . .-=- Keith and I were together  for six","messageBody":"<div id=\"ygrps-yiv-1437125355\">-=- one night I asked my<br/>\nhusband to explain something to me. I knew it was an easy question for him<br/>\nto answer, but . . .-=-<br/>\n<br/>\nKeith and I were together  for six years before we married, and another year and a half before I got pregnant.  He&#39;s quick at math, but not at writing and spelling.  We made a deal early on that if he wanted me to spell something I just would spell it, and if I wanted something figured out, or a percentage or whatever, he would just tell me.  It was sweet.  We didn&#39;t add any &quot;I told you that yesterday,&quot; or &quot;You can&#39;t figure out 20%!?&quot;  Just answered.    So when we had children, we were a giant step ahead.<br/>\n<br/>\n-=-Likewise, with putting on socks. He is eight. He doesn&#39;t always ask me to<br/>\nhelp with his socks. These days he rarely does. But when he does, I just<br/>\nhelp. The other day I looked up at him while I was putting on the second<br/>\none, and he said, &quot;I love you, mom.&quot; I&#39;m sure glad I didn&#39;t miss that<br/>\nmoment by insisting he should be putting on his own socks.-=-<br/>\n<br/>\nI&#39;m 58.  I wear loose socks to bed now, to keep my feet warm.<br/>\nA week ago my knee was hurting and I was really tired.  I asked Keith if he would put my socks on me.  I was already lying on the bed.  He did.<br/>\n<br/>\nIn a couple of weeks, Keith is having a shoulder replacement.  He had surgery on his other shoulder last February--not a replacement, but a serious procedure.   I will be doing just about everything for him at first, but I don&#39;t mind.   I could easily roll my eyes and cluck and tsk and remind him that if he hadn&#39;t done all that SCA armored combat he wouldn&#39;t HAVE this problem, or if he had let me buy a log splitter years back, he wouldn&#39;t have split all that wood by hand.    But I know he love SCA combat more than anything he&#39;s ever loved in his life (except our kids, I suppose), and  the wood he splits all the time.  He stacks it beautifully and lovingly.  He brings in my plastic yard cart full of split wood, into the enclosed sunroom in back, in the winter, so I don&#39;t have to go out to the woodpile EVER if I don&#39;t want to.  He has done all kinds of strong lifting and carrying of furniture, building materials, groceries, children and sleeping babies in car seats.  I&#39;m glad it&#39;s possible for him to have his shoulder repaired.  I&#39;m glad to help him.<br/>\n<br/>\nEven couples who have those feelings for each other, who will put each other&#39;s socks on, rarely extend that love to their children.  I&#39;m glad Keith and I did.  It has yielded stunning responses from them that many mainstream parents would never believe.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Another Child Joyfully Cleans Up, and other stuff","postDate":"1295488122","msgId":59002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltb0JRdHFTN1VUbmdtdjY5S1NoTjZxYnpQcHJRZnk1NFFEdGUzdkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGloNW5kYytpbGhtQGVHcm91cHMuY29tPg==","referencesHeader":"PGloNW5kYytpbGhtQGVHcm91cHMuY29tPg=="},"prevInTopic":58981,"nextInTopic":59003,"prevInTime":59001,"nextInTime":59003,"topicId":58981,"numMessagesInTopic":0,"msgSnippet":"... This was a big eye opener for me when I started reading here too.  I nearly killed the joy of learning to spell for our son by asking him to sound out the","messageBody":"<div id=\"ygrps-yiv-1357921766\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I didn&#39;t not help him when he asked for help and I felt sure he knew the<br/>\n&gt; answer.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>This was a big eye opener for me when I started reading here too.  I nearly<br/>\nkilled the joy of learning to spell for our son by asking him to sound out<br/>\nthe words when he would ask me how to spell them.  Instead of just spelling<br/>\nthe word, and trusting him to find the patterns to build on later, I would<br/>\nsay something like, &quot;Well, what makes the first sound?&quot;  He would get so<br/>\nfrustrated with me that I wouldn&#39;t just spell it for him.  I had no idea why<br/>\nhe reacted with such frustration toward me, until one night I asked my<br/>\nhusband to explain something to me.  I knew it was an easy question for him<br/>\nto answer, but he turned it into a kind of quiz, I guess with the hope of me<br/>\nfinding, what he perceived to be, the simple answer, myself.  I was really<br/>\nfrustrated.  I just wanted the answer.  Ah ha!!  That&#39;s why my son gets so<br/>\nfrustrated with me!!  Reading on this list helped me make the connections to<br/>\nwhat I was experiencing with my husband, and what our son experienced with<br/>\nme.<br/>\n<br/>\nLikewise, with putting on socks.  He is eight.  He doesn&#39;t always ask me to<br/>\nhelp with his socks.  These days he rarely does.  But when he does, I just<br/>\nhelp.  The other day I looked up at him while I was putting on the second<br/>\none, and he said, &quot;I love you, mom.&quot;  I&#39;m sure glad I didn&#39;t miss that<br/>\nmoment by insisting he should be putting on his own socks.<br/>\n<br/>\nKaren.<br/>\n<br/>\n----------<br/>\njamesfamilyedutrip.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":84923330,"authorName":"Michelle and Hub","from":"&quot;Michelle and Hub&quot; &lt;michelleandhub@...&gt;","profile":"michelleandhub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Another Child Joyfully Cleans Up, and other stuff","postDate":"1295409388","msgId":58981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGloNW5kYytpbGhtQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":59002,"prevInTime":58980,"nextInTime":58982,"topicId":58981,"numMessagesInTopic":0,"msgSnippet":"Hello All, I have been reading for well over a year, but this is my first post.  I felt compelled to share some sweet experiences (all from this evening!) that","messageBody":"<div id=\"ygrps-yiv-1760532073\">Hello All,<br/>\n<br/>\nI have been reading for well over a year, but this is my first post.  I felt compelled to share some sweet experiences (all from this evening!) that were not possible for me before I joined this list.<br/>\n<br/>\nFirst I want to say that I have a degree in Early Childhood Education, as well as a Masters in Early Intervention.   I taught in a preschool classroom for a few years, then spent more years in homes with young children who had been labeled as having disabilities.  All those years, I believe I did some good for children and their families.  But for the sake of this post, I am acknowledging that one of the things I spent a lot of time doing was interrupting children&#39;s play for the sake of a schedule. For something I, their teacher, deemed more important.  (Worse, I tried to make it all ok by singing in a lovely voice, &quot;Clean up, clean up, everybody do their share,&quot; or some other version.) <br/>\n<br/>\nSince my son was born I have rethought many many of the ideas I was trained to believe and practice about how children learn, and about how they deserve to be treated.  Some of those new ideas have been introduced to me through this list.  Here is some evidence:<br/>\n<br/>\nThis evening my 4.5 year old was playing games on his new favorite website.  At some point I was using the food processor in the kitchen and heard him scream, scream!  &quot;STOP THAT NOISE!  I&#39;M TRYING TO PLAY THIS GAME AND I CAN&#39;T HEAR!&quot;  I admit I had an impulse to say something about that tone of voice, Mister. But I didn&#39;t.  Instead I popped my head in and said, &quot;Oh, sorry.&quot; I watched for a break in the game (took about 12 seconds) and said, &quot;Hey can you pause your game for about a minute while I finish chopping?&quot;  He said, &quot;Sure Mom!&quot;  : )<br/>\n<br/>\nMoments later (food processing complete) I was doing something on my laptop when he very excitedly invited me to come in and see what he was doing.  I stopped and went in.  When I sat on a chair he climbed on my lap and I watched him play.  I giggled with him and cheered him on, even helped a few times when he asked. <br/>\n<br/>\nMoments later (ten minutes or so of my full attention to his game) I remembered that I really wanted to run the vacuum tonight before bed.  I waited for a pause in the game then said, &quot;Hey buddy, after this next turn I&#39;m going to clean up in the living room so I can vacuum up all the crumbs.&quot;  There was a pause, then he shut the lid to the computer and said, &quot;There.  I finished my turn.  Now I&#39;m coming to help you clean up the living room!&quot;  I called my own attention to the fact that I did not ask him to help me clean up the living room; he joyfully did it.  <br/>\n<br/>\nMoments later, once we were in the living room, I asked, &quot;Are there any things you&#39;d like to leave out for tomorrow?&quot;  He scanned the room and pointed to a building he had made out of blocks.  &quot;Leave this out please.  I want you to play with it with me tomorrow.&quot; (In the preschool world I might have said, &quot;I&#39;m sorry we can&#39;t leave your building up until tomorrow.  There&#39;s another class using the room this afternoon.&quot;)  &quot;OK,&quot; I said.  Then he delightedly picked up the other things with me.  <br/>\n<br/>\nAfter all these exchanges, I noticed I felt joyous, JOYOUS! and free.  Here are some of the reasons why:<br/>\n<br/>\n1.\tMy 4.5 year old has a computer.  I would never have considered getting one for him at this age before I found this list.  He loves it.  <br/>\n<br/>\n2.\tWhen he invited me in to see what he was working on I did not feel resentful at the idea that I was home with him all day and now I just want 5 minutes to myself.<br/>\n<br/>\n3.\tI did not praise him for playing by himself for a while, as I was taught (trained!) to do.  I did not roll my eyes at the nonsense of the game he was playing.  I did not suggest he might like to move on to another game because I was bored with watching the same game over and over.  I didn&#39;t not help him when he asked for help and I felt sure he knew the answer.  I sat down with him and enjoyed his enjoyment of the game. <br/>\n<br/>\n4.\tI could acknowledge that the need for a cleaned up living room (occasionally) is mine, not my kid&#39;s. <br/>\n<br/>\n5.\tI (we) do not have a schedule to keep.  And I am ever so grateful!  (I admit I am working on letting go of bedtimes, but the times we have to be somewhere are rare.)<br/>\n<br/>\n6.\tI have come to believe that children are not worth their potential; they are fully formed people right now, with thoughts and ideas that are worth listening to right now.<br/>\n<br/>\nThis is wondrous stuff!  Thanks to all of you for sharing your experience on this list.  I am so grateful.  I hope to become a more regular contributor as the years go on and my son grows up.  My husband and I are growing right along with him.  <br/>\n<br/>\n<br/>\n~Michelle</div>","specialLinks":[]}],"prevTopicId":58818,"nextTopicId":59013}}