{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...&gt;","replyTo":"LIST","senderId":"h4EsO-NNRONRl-EHyet8coY9gUem9UZyHgIjLToyH1DjJd1MfHQWheYyBfJo-FuPkfJKDsGOiac7erpsJ0VktcYZPQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] only children and TV","postDate":"954311168","msgId":7415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQuMS4yMDAwMDMyOTAwMzEzNy4wMDkxODEwMEBwb3AubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDk1NDI4MTYxMi42NzI2QG9uZWxpc3QuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":7414,"nextInTime":7416,"topicId":7415,"numMessagesInTopic":0,"msgSnippet":"... To Trisha and Tracy and other mothers of only homeschooled children: This subject could not have been raised at a more perfect time, since this is the","messageBody":"<div id=\"ygrps-yiv-506546836\"><blockquote><span title=\"ireply\">&gt;   Date: Tue, 28 Mar 2000 09:34:12 CST<br/>\n&gt;   From: &quot;Trisha Sides&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yschild@...\">yschild@...</a>&gt;<br/>\n&gt;      My son is an only child, and when the cable was on I think he used the <br/>\n&gt;tv alot for company. His friends are all in school during the day and we <br/>\n&gt;have met very few unschoolers in Topeka, KS. Does anyone else have a &quot;lonely <br/>\n&gt;only&quot;? How do you deal with it? My husband and I did not choose to not have <br/>\n&gt;more children, we have just been unable. It was amiracle that we got Gary. <br/>\n&gt;We might adopt someday but are not financially able now.<br/>\n<br/>\n<br/>\n </span></blockquote>To Trisha and Tracy and other mothers of only homeschooled children:<br/>\n<br/>\nThis subject could not have been raised at a more perfect time, since this<br/>\nis the issue I am struggling with right now. My son will be 7 next month<br/>\nand this has been our first year officially homeschooling. He has been<br/>\nfeeling more lonely lately, and has been turning back to the TV as a<br/>\nresult. He has expressed that  there is nobody to play with because<br/>\n&quot;everyone else is in school&quot;, and that he wished he had a friend around all<br/>\nthe time. We have joined two homeschooling groups and participate in<br/>\nseveral regular activities, but I think he misses a daily or one-on-one<br/>\nfriendship with someone other than me. We haven&#39;t had many playdates with<br/>\nother homeschoolers because they all have their own busy schedules, and a<br/>\nlot of the kids are older by 2-3 years. Plus, there aren&#39;t any other kids<br/>\nhis age in the neighborhood and his best friend from school last year has<br/>\nbecome distant; they don&#39;t seem to share the same interests anymore. He<br/>\nhasn&#39;t really complained too much about wanting more friends until this<br/>\nspring. I think it&#39;s because a lot of our regular activities are ending for<br/>\nthe year. Perhaps I am overly sensitive to how he feels because I was an<br/>\nonly myself. Unfortunately, I can&#39;t always provide him with a friend for<br/>\nall our field trips and outdoor activities. <br/>\n<br/>\n<br/>\n&lt;&lt;Date: Tue, 28 Mar 2000 10:30:11 EST <br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hartshape2@...\">hartshape2@...</a><br/>\nThat is the way my 5 yr old son is. He&#39;s an only child. Most of the time he <br/>\nwon&#39;t even want to paint without me! I try not to dwell on him being <br/>\ndependent, and I just jump in if I have time. Sometimes he just needs a <br/>\nstart with me and I can leave him. I think he sees me as a friend to play <br/>\nwith, too. Not just a provider or a guider!&gt;&gt;<br/>\n<br/>\n<br/>\nThis is usually true for us as well. So I feel badly when basic household<br/>\nduties (cooking, cleaning) leave him with large blocks of alone time.<br/>\n(Although I know kids need plenty of free time to think and be bored too.)<br/>\nSometimes I try to make suggestions for things that he can do to occupy his<br/>\ntime (he reads well but won&#39;t yet sit down and read alone), but he rejects<br/>\nthem all and turns on the TV. I say no TV and he turns it back on. I think<br/>\nI&#39;m going to need to pull the plug or remove the TV for a while to break<br/>\nthe habit. It&#39;s my own fault for turning the TV on 7 years ago! I have<br/>\ntried putting aside the household stuff and offering to do anything he<br/>\nwants (games, puzzles, etc.), but lately he seems to prefer TV watching. Is<br/>\nthis just a phase of homeschooling, or is it a function of being an only<br/>\nchild homeschooling without benefit of sibling play? I&#39;m hoping this is<br/>\njust a spring slump before a surge of new interests.<br/>\n<br/>\nSorry, but I just needed to worry and wonder out loud here...<br/>\n<br/>\nOlivia</div>","specialLinks":[]}],"prevTopicId":7404,"nextTopicId":7416}}