{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":45,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: TV, was Re: Is Unschooling A\tTransformation?","postDate":"1044540971","msgId":58053,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNjdEODVCLjEzOTMwJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMmIwMWMyY2RiNyQxYjI5MzViMCRkYjk2MWI0MUB5b3VyNXJscDNhOTUxNj4="},"prevInTopic":58047,"nextInTopic":58064,"prevInTime":58052,"nextInTime":58054,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"... How long did you try unlimited TV? They need time to realize that freedom isn t a temporary thing. If they fear it will be restricted, they re going to try","messageBody":"<div id=\"ygrps-yiv-19545335\">on 2/6/03 3:09 AM, Amie at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:amiersa2@...\">amiersa2@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I have tried doing the unlimited thing, and my kids WILL sit for 3-4 hours at<br/>\n&gt; a time.<br/>\n<br/>\n </span></blockquote>How long did you try unlimited TV? They need time to realize that freedom<br/>\nisn&#39;t a temporary thing. If they fear it will be restricted, they&#39;re going<br/>\nto try to pack in as much as they can. And their fears came true, didn&#39;t<br/>\nthey?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In fact, they choose that over other things I offer.<br/>\n<br/>\n </span></blockquote>Things that *you* think are better than TV or things *they* think are<br/>\nbetter?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am just not Ok with that.<br/>\n<br/>\n </span></blockquote>And what if your husband were not okay with how much time you spent reading?<br/>\nAn amount of time that you didn&#39;t feel interfered with what you wanted to do<br/>\nbut an amount of time that bugged him just because his fears told him it was<br/>\ntoo much?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It seems addicting to me, and I still am not ok about the research that has<br/>\n&gt; been done showing the affects on the developing brain and excess tv. Even<br/>\n&gt; though some have it on and aren&#39;t watching, I don&#39;t think that is healthy for<br/>\n&gt; anyone.<br/>\n<br/>\n </span></blockquote>But from what people are saying, the research doesn&#39;t match reality. Why<br/>\ndoes the research hold more importance for you than what people actually<br/>\nfind is true by living life?<br/>\n<br/>\nAnything that supports what we want to believe, takes on undue importance in<br/>\nour minds. Being objective is setting aside what we want to believe and<br/>\nlooking at what is real and true.<br/>\n<br/>\nWhat is real and true is that the reasearchers are wrong. At least in the<br/>\ncases of unschooled kids who have far more hours in their day than schooled<br/>\nkids. And even in the case of me who went to school *and* had unrestricted<br/>\nTV. I found the time for lots of TV *and* other things too like drawing and<br/>\nreading and writing and going outside. And I got into a good college.<br/>\n<br/>\nSo how does the research explain that?<br/>\n<br/>\nIf you consider all the hours in a child&#39;s day that are affected by going to<br/>\nschool -- which includes getting ready, homework, recovering from the day --<br/>\ncan you confidently say that what kids get out of those hours is better<br/>\nspent than if the child had spent those hours doing something that interests<br/>\nthem? Even if it&#39;s spent watching TV?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I rarely watch tv, and I don&#39;t feel as though I am missing anything.<br/>\n<br/>\n </span></blockquote>I rarely go to sports events, opera, tractor pulls, dog shows, lectures,<br/>\npoetry readings and don&#39;t feel like I&#39;m mising much. But what does that<br/>\nmean? It means my tastes are different than someone who adores those things.<br/>\nShould my not finding meaning in them mean that others shouldn&#39;t find<br/>\nmeaning in them?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I <br/>\n&gt; just can&#39;t sit back and watch my kids sit and sit. Even two hours a day seems<br/>\n&gt; like too much to me right now. My kids are 5 1/2.<br/>\n<br/>\n </span></blockquote>If you want to unschool, being comfortable with what your kids are<br/>\ninterested in shouldn&#39;t be of primary importance. Unschooling is about<br/>\nhelping *them* explore their interests, not in helping them explore what you<br/>\nfeel is important.<br/>\n<br/>\nSchools often cover up the windows because the teachers find they can&#39;t<br/>\ncompete with what&#39;s going on outside. Rather than figuring out what *would*<br/>\ninterest the kids, they choose to make other alternatives duller than the<br/>\nteacher.<br/>\n<br/>\nIf you can&#39;t find things that interest them *more* than TV then either TV is<br/>\nreally important to them or you&#39;re not being sensitive to what *they* are<br/>\ninterested in. Have you watched the programs with them and watched them to<br/>\nsee what they find funny or interesting? Have you asked them what they find<br/>\nso fascinating? Have you talked about their favorite characters and scenes?<br/>\nHave you tried sharing your favorite movies or old TV shows with them? Have<br/>\nyou looked their shows up on the internet to find behind the scenes types of<br/>\nthings that might interest them?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But, after reading it, I was back again to the tv is not a healthy thing.<br/>\n<br/>\n </span></blockquote>But if the thoughts in that book don&#39;t match what happens in real life, then<br/>\nwhat worth are they? They serve to help you feel that your fears are<br/>\njustified even in the face of real life examples that they aren&#39;t true.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t think it is a healthy thing for anyone, but especially the younger<br/>\n&gt; ones whose brains are still developing.<br/>\n<br/>\n </span></blockquote>And how do you reconcile that belief to what people are telling you is truth<br/>\nin their lives and the lives of their children? It&#39;s like believing that a<br/>\nhouse is haunted because someone presented a good case for it in a book, but<br/>\nthe people who have lived in the house their whole lives say that it isn&#39;t<br/>\nhaunted. Why believe a book over real life? Because you wish the book were<br/>\ntrue and the people living the life weren&#39;t?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I keep reading about the unlimited tv thing, and I just can&#39;t feel ok about<br/>\n&gt; it.<br/>\n<br/>\n </span></blockquote>So you hold onto what you want to believe is true rather than examining an<br/>\nuncomfortable reality and why reality doesn&#39;t match what you want to be<br/>\ntrue.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Plus, there is no way I will subject my kids to all of that advertising. That<br/>\n&gt; makes me angry (and we DO talk about advertising alot, in fact). And, they do<br/>\n&gt; ask me for the things they see on the ads, and that makes me angry that the<br/>\n&gt; advertisers are using our children like this.<br/>\n<br/>\n </span></blockquote>My daughter sees advertising as a resource. She sees what&#39;s available. (We<br/>\nhave discussed the purpose and she knows the purpose is to make money and<br/>\ncan be cynical at times at what advertisers are trying to get people to<br/>\nbelieve. I find it more effective to talk about commercials that are aimed<br/>\nat *me* so I can point out how they&#39;re trying to make me believe something<br/>\nis true to get me to buy something.)<br/>\n<br/>\nAgain, reality doesn&#39;t match what we fear will happen. Advertising isn&#39;t<br/>\nthat hard to understand. It&#39;s a pretty simple concept. I&#39;ve always trusted<br/>\nthat my daughter is intelligent enough to get the concept.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044534993","msgId":58047,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNy4xYTg3ODA1YS4yYjczYjBkMUBhb2wuY29tPg=="},"prevInTopic":58043,"nextInTopic":58053,"prevInTime":58046,"nextInTime":58048,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/5/2003 10:01:52 PM Eastern Standard Time, ... Well, they do it all the time in school. Maybe not ALL of them, but the good students do!","messageBody":"<div id=\"ygrps-yiv-643220443\">In a message dated 2/5/2003 10:01:52 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; Kids don&#39;t tend to watch stuff they&#39;re not interested in.  Why would they?<br/>\n&gt; They also won&#39;t read books they&#39;re not interested in.<br/>\n&gt; They also won&#39;t read magazines they don&#39;t like.<br/>\n<br/>\n </span></blockquote>Well, they do it all the time in school. Maybe not ALL of them, but the <br/>\n&quot;good&quot; students do! ;-PPP~~~~<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":133126509,"authorName":"Amie","from":"&quot;Amie&quot; &lt;amiersa2@...&gt;","profile":"mascire2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: TV, was Re: Is Unschooling A Transformation?","postDate":"1044518983","msgId":58043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmIwMWMyY2RiNyQxYjI5MzViMCRkYjk2MWI0MUB5b3VyNXJscDNhOTUxNj4="},"prevInTopic":58023,"nextInTopic":58047,"prevInTime":58042,"nextInTime":58044,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"I hardly ever post, but I feel the need to jump in. I was probably the one that was saying the tv didn t work. I have tried doing the unlimited thing, and my","messageBody":"<div id=\"ygrps-yiv-1594738842\">I hardly ever post, but I feel the need to jump in. I was probably the one that was saying the tv didn&#39;t work. I have tried doing the unlimited thing, and my kids WILL sit for 3-4 hours at a time. In fact, they choose that over other things I offer. I am just not Ok with that. It seems addicting to me, and I still am not ok about the research that has been done showing the affects on the developing brain and excess tv. Even though some have it on and aren&#39;t watching, I don&#39;t think that is healthy for anyone. I rarely watch tv, and I don&#39;t feel as though I am missing anything. I just can&#39;t sit back and watch my kids sit and sit. Even two hours a day seems like too much to me right now. My kids are 5 1/2. <br/>\n<br/>\nHas anyone read the book Magical Child, Magical Parent? It is excellent, I think. But, after reading it, I was back again to the tv is not a healthy thing. I don&#39;t think it is a healthy thing for anyone, but especially the younger ones whose brains are still developing.I keep reading about the unlimited tv thing, and I just can&#39;t feel ok about it. Plus, there is no way I will subject my kids to all of that advertising. That makes me angry (and we DO talk about advertising alot, in fact). And, they do ask me for the things they see on the ads, and that makes me angry that the advertisers are using our children like this.<br/>\n<br/>\nAnyway, just my two cents...<br/>\n<br/>\nAmie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044507795","msgId":58023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDE0MTlFRTlAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":58004,"nextInTopic":58043,"prevInTime":58022,"nextInTime":58024,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"... ALl the more reason to get TIVO! You *can* pause tv! I was kind of unsure about it at first, but I have to say that I would never want to go back to","messageBody":"<div id=\"ygrps-yiv-173716362\"><blockquote><span title=\"ireply\">&gt; If we can&#39;t pause it - like with a TV show, they&#39;ll leave <br/>\n&gt; the room or cover their eyes and ears.<br/>\n<br/>\n </span></blockquote>ALl the more reason to get TIVO! You *can* pause tv! I was kind of unsure about<br/>\nit at first, but I have to say that I would never want to go back to watching <br/>\nregular tv. It is so easy to use and it gives you so much freedom and control<br/>\nover tv...you are not tied to the tv schedule and have so much flexibility.<br/>\n<br/>\nI love how easy it is to record the kids shows (especially the ones after they go<br/>\nto bed) and it is there whenever they want to watch. No need to worry about missing<br/>\nfavorite programs.<br/>\n<br/>\nStephanie E (who does not work for the TIVO folks, really)</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044500794","msgId":58004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwLjJhMzEwMGFkLjJiNzMyYjNhQGFvbC5jb20+"},"prevInTopic":58003,"nextInTopic":58023,"prevInTime":58003,"nextInTime":58005,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":" ","messageBody":"<div id=\"ygrps-yiv-1292077660\">&lt;&lt;  But for me and my house &gt;&gt;<br/>\n<br/>\n&lt;&lt;I guess that is where we are different.  I don&#39;t consider it MY house.  I <br/>\nconsider it OUR house.  We all have to live here. &gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\n&quot;For me and my house&quot; is a Biblical phrase.  It&#39;s possible that the original <br/>\nwriter is a fundamentalist Christian and this phrase is not uncommon to hear.<br/>\n<br/>\nTo discuss the idea that children also should have rights in the house is <br/>\nlikely to cause a disagreement here which will look like a difference of <br/>\nphilosophy, but it would go along religious lines.<br/>\n<br/>\nWe&#39;re really back to whether there is an &quot;us and them&quot; (adults and children) <br/>\nor whether there can really be a &quot;we&quot; who live together and a we who make <br/>\ndecisions.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044500426","msgId":58003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYy4xMWVkMTBkLjJiNzMyOWNhQGFvbC5jb20+"},"prevInTopic":57963,"nextInTopic":58004,"prevInTime":58002,"nextInTime":58004,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/5/03 7:52:42 AM, debsusedbooks@aol.com writes: -=-","messageBody":"<div id=\"ygrps-yiv-942320207\">In a message dated 2/5/03 7:52:42 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debsusedbooks@...\">debsusedbooks@...</a> writes:<br/>\n<br/>\n-=-&lt;&lt;But for me and my house, I prefer some structure as far as me having a <br/>\nbit more knowledge about life and choices and consequences than my 8 & 11 <br/>\nyear old.  To me it equates to making sure my 9 month old doesn&#39;t stick <br/>\nanything into his mouth that might harm him or anything into a socket in the <br/>\nwall. &gt;&gt;-=-<br/>\n<br/>\nThe implication of this is that if we allow eight and eleven year olds to <br/>\nmake choices about their lives, we&#39;re letting babies eat bugs and cigar butts <br/>\nand stick things into the sockets.  Not a nice argument, truly.  If the <br/>\nmethods being discussed here were having nasty and dangerous results, nobody <br/>\nwould be recommending them.  But they&#39;re having sweet, peaceful, surprisingly <br/>\ngreat results.  <br/>\n<br/>\n&lt;&lt; if the tv is on, nothing gets done!  The older children neglect helping <br/>\nwith the baby, they don&#39;t do their chores unless constantly reminded and <br/>\nnagged.  And for me unschooling is about stopping the nagging...so why would <br/>\nI set that same situation up by allowing the tv to be on non-stop?   &gt;&gt;<br/>\n<br/>\nWith over 100 e-mails left to go, I realize I might be duplicating something, <br/>\nbut the good thing about two people saying the same thing is it keeps anyone <br/>\nfrom thinking the first was just a weirdo.<br/>\n<br/>\nAllowing children to choose when to watch television<br/>\nDOES NOT equal having it on non-stop.<br/>\n<br/>\nIf you don&#39;t have chores, there will be nothing to nag about.<br/>\n<br/>\nIf you have to turn the tv off to avoid nagging, that&#39;s probably indicative <br/>\nof some other problems.  <br/>\n<br/>\n&lt;&lt;What is currently happening around out house is the tv is not supposed to <br/>\nbe one during the day but after dinner we might sit and watch Jeopardy <br/>\ntogether, then maybe we watch another hour or two depending on what is on. &gt;&gt;<br/>\n<br/>\n&quot;Depending on what is on&quot; is the way television decisions work, exactly.<br/>\n<br/>\nBut &quot;what is on&quot; isn&#39;t the same as choosing days and hours in advance.  <br/>\nSometimes the one coolest thing is on at 9:30 a.m. on a weekday, or 11:00 at <br/>\nnight on Friday.  <br/>\n<br/>\n&lt;&lt;But honestly there is so much junk on tv.  &gt;&gt;<br/>\n<br/>\nThere are some truly trashy magazines.  Do you forbid magazines in your house?<br/>\n<br/>\nSome books are evil crap and should never have been published.  Do you still <br/>\nhave books in your house?<br/>\n<br/>\nThere are some atrocious talk shows on the radio, but I  never listen to <br/>\nthem.  I go through channels until I hear a song I like, and if I don&#39;t hear <br/>\none I like I turn it off, or put a tape in.<br/>\n<br/>\n-=-I guess it might be better if I had cable or satalite that I could program <br/>\nto show only the channels that might help educate or entertain my children in <br/>\nappropriate childlike ways but alas, that is not an option.  -=-<br/>\n<br/>\nVideos?  PBS?  <br/>\nKids don&#39;t tend to watch stuff they&#39;re not interested in.  Why would they?<br/>\nThey also won&#39;t read books they&#39;re not interested in.<br/>\nThey also won&#39;t read magazines they don&#39;t like.<br/>\n<br/>\n&lt;&lt;I guess anything in moderation is ok but I really hate the content on tv <br/>\nmost times.&gt;&gt;<br/>\n<br/>\nSome things in moderation are not okay because the kids don&#39;t want them.  Is <br/>\nmath homework okay in moderation?  Are standardized tests okay in moderation? <br/>\n <br/>\n<br/>\nIf children are limited to hearing and seeing only what moms don&#39;t hate, <br/>\nmaybe moms need to consciously learn to love lots of things.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":8226888,"authorName":"the_clevengers &lt;diamondair@email.msn.com&gt;","from":"&quot;the_clevengers &lt;diamondair@...&gt;&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"TV, was Re: Is Unschooling A Transformation?","postDate":"1044469080","msgId":57963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxcmtnbys5aWFxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBNjY2ODRCLjEzODBDJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":57925,"nextInTopic":58003,"prevInTime":57962,"nextInTime":57964,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"... restrict your ... imply that ... unschooling? What about porn? Or violence? Or if you know your child is super-sensitive to death or suffering? Well, what","messageBody":"<div id=\"ygrps-yiv-621317355\"><blockquote><span title=\"ireply\">&gt; on 2/4/03 10:52 PM, Kelle Kjeer at kelle@j... wrote:<br/>\n&gt; &gt; What I am trying to figure out is;  if you own a television and <br/>\n </span></blockquote>restrict your<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; children&#39;s viewing to shows that you deem appropriate, does that <br/>\n </span></blockquote>imply that<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; you are depriving them of a learning opportunity and you are not <br/>\n </span></blockquote>unschooling? What about porn? Or violence? Or if you know your child <br/>\nis super-sensitive to death or suffering?<br/>\n<br/>\n<br/>\nWell, what we do is if the kids want to watch a movie that they know <br/>\nwill have scary parts, I sit down with them and whenever a child <br/>\nwants to skip a part they say &quot;Pause&quot; and I pause it. Then I can fast-<br/>\nforward through the scary part for them. If one kid wants to see the <br/>\npart, they other one can leave the room until we tell them to come <br/>\nback in. This is what we did the first few times we watched Lord of <br/>\nthe Rings, which they both really wanted to see. After we bought the <br/>\nDVD and watched all the &quot;Making Of&quot; documentaries, they were a lot <br/>\nless scared of the bits and they chose to watch the whole thing <br/>\nthrough. If we can&#39;t pause it - like with a TV show, they&#39;ll leave <br/>\nthe room or cover their eyes and ears.<br/>\n<br/>\nLikewise, when both of my kids wanted to go see Harry Potter in the <br/>\ntheatre, we had read the books so they knew ahead of time that parts <br/>\nmight be scary. I arranged to go with a friend and her kids so that <br/>\nif I had to leave the theatre with one kid, the other could stay and <br/>\nwatch with our friends. Both kids stayed through the whole thing, but <br/>\nmy son chose to turn around and cover his eyes and ears for parts of <br/>\nit. <br/>\n<br/>\nThat&#39;s just what works here. The kids seem to self-regulate with <br/>\nregards to what they will find scary. <br/>\n<br/>\nBlue Skies,<br/>\n-Robin-</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A\tTransformation?","postDate":"1044459487","msgId":57925,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNjY5QTBGLjEzODRDJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDNGMjkyQTM3LjZBRUZDRDU1LjRENDk4NTg5QGFvbC5jb20+"},"prevInTopic":57923,"nextInTopic":57963,"prevInTime":57924,"nextInTime":57926,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"... The question for an unschooler though is what do the chldren think? What do the children want? What do the children find interesting and important? If","messageBody":"<div id=\"ygrps-yiv-1120102545\">on 2/5/03 9:50 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debsusedbooks@...\">debsusedbooks@...</a> at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debsusedbooks@...\">debsusedbooks@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I tend to disagree for my children.<br/>\n<br/>\n </span></blockquote>The question for an unschooler though is what do the chldren think? What do<br/>\nthe children want? What do the children find interesting and important?<br/>\n<br/>\nIf we&#39;re making the decisions about what is and isn&#39;t good for them and that<br/>\nour values must be their values then are we trusting that they can learn<br/>\nwhat they need from life? Or are we trusting that they can learn the things<br/>\nthat we don&#39;t care about and we need to make them do the things that are<br/>\nmost important to us until they choose to follow our example?<br/>\n<br/>\nI think it&#39;s helpful to step back and see what principles look like when<br/>\napplied to other parts of our lives. It&#39;s helpful to see what it looks like<br/>\nfrom the children&#39;s point of view.<br/>\n<br/>\nWhat if your husband made the decision that the only reading you could do<br/>\nwas an hour a night from a book he decided was good for the whole family?<br/>\nHow would that feel to you?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He has noticed that if the tv is on, nothing gets done!  The older children<br/>\n&gt; neglect helping with the baby, they don&#39;t do their chores unless constantly<br/>\n&gt; reminded and nagged.<br/>\n<br/>\n </span></blockquote>My daughter is happy to come help me when I ask. As longs as I see the<br/>\nchores as mine and don&#39;t force her to help, then she does help when she can.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And for me unschooling is about stopping the<br/>\n&gt; nagging...so why would I set that same situation up by allowing the tv to be<br/>\n&gt; on non-stop?<br/>\n<br/>\n </span></blockquote>And they never asked to watch TV after you decided they couldn&#39;t? How did<br/>\nyou stop them from asking? Does that mean that they now have no desire to<br/>\nwatch TV or that they have no desire to share what they really feel about TV<br/>\nwith you?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And every time I turn around there is some comment being made about sex-it<br/>\n&gt; doesn&#39;t matter what time of day it is either!<br/>\n<br/>\n </span></blockquote>Why would your children want to watch programs that comment on sex?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess it might be better if I had cable or satalite that I could program to<br/>\n&gt; show only the channels that might help educate or entertain my children in<br/>\n&gt; appropriate childlike ways but alas, that is not an option.<br/>\n<br/>\n </span></blockquote>We have cable. I&#39;ve never needed to program it in order for my daughter to<br/>\navoid &quot;inappropriate&quot; programs. She has no interest. Why would she?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; and they can feel like they aren&#39;t being deprived.<br/>\n<br/>\n </span></blockquote>So they *do* want to watch TV more than they are allowed? What do they do<br/>\nwhen they visit homes with unlimited TV?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But for me and my house, I prefer some structure as far as me having a bit<br/>\n&gt; more knowledge about life and choices and consequences than my 8 & 11 year<br/>\n </span></blockquote>old.<br/>\n<br/>\nAnd again, what do your kids want? What do they find value in?<br/>\n<br/>\nAttachment parenting is about helping our kids get what they want not in<br/>\nsetting up things so life is most comfortable and convenient for the<br/>\nparents.<br/>\n<br/>\nKids learn to make decisons by making decision. That doesn&#39;t mean making the<br/>\ndecisions we would, but weighing the pros and cons and deciding. They don&#39;t<br/>\nnecessarily have the experience we do to know all the pros and cons, but as<br/>\nlong as they aren&#39;t in any immediate danger, then they have the opportunity<br/>\nto build up confidence in their decision making powers. They may try out<br/>\nsome decisions that we wouldn&#39;t make. They may even see that there are some<br/>\nnot so great consequences but the consequences may be worth it for a while.<br/>\n(Say like staying up really late knowing that tomorrow they&#39;ll feel wiped<br/>\nout.) But eventually the bad parts out weigh the good parts and they choose<br/>\nmore sensibly.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To me it equates to making sure my 9 month old doesn&#39;t stick anything into his<br/>\n&gt; mouth that might harm him or anything into a socket in the wall.<br/>\n<br/>\n </span></blockquote>You know for certain that sticking something in a socket could be really<br/>\nbad. Do you also know for certain that a child who watches unlimited TV will<br/>\nbe harmed?<br/>\n<br/>\nLots of kids here aren&#39;t being harmed.<br/>\n<br/>\nI&#39;m not saying you need to remove the restrictions. But if your restrictions<br/>\nare based on things that aren&#39;t true, then they should be rethought.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am sure as <br/>\n&gt; my children age, I will offer more and more freedom as I have already done<br/>\n&gt; that in many areas of their lives.<br/>\n<br/>\n </span></blockquote>Many people say that. Many find that since they have made their children&#39;s<br/>\ndecisions for them that when given the opportunity the children will<br/>\ndeliberately choose the things they weren&#39;t allowed before just because they<br/>\ncan. And as the children get older, the things they can choose are a lot<br/>\nmore dangerous than how much TV they should watch so there is rarely a good<br/>\nlater age to start until it&#39;s too late and their gone.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044458993","msgId":57923,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNS4xZGNmZjZkYi4yYjcyODdmMUBhb2wuY29tPg=="},"prevInTopic":57917,"nextInTopic":57925,"prevInTime":57922,"nextInTime":57924,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/5/03 9:52:31 AM Eastern Standard Time, ... I guess that is where we are different.  I don t consider it MY house.  I consider it OUR","messageBody":"<div id=\"ygrps-yiv-1219224847\">In a message dated 2/5/03 9:52:31 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:debsusedbooks@...\">debsusedbooks@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; .  But for me and my house, I prefer some structure as far as me having a <br/>\n&gt; bit more knowledge about life and choices and consequences than my 8 &11 <br/>\n&gt; year old.  <br/>\n<br/>\n </span></blockquote>I guess that is where we are different.  I don&#39;t consider it MY house.  I <br/>\nconsider it OUR house.  We all have to live here.  We all have to be <br/>\ncomfortable with the environment, children included.  If it came down to who <br/>\npays the bills It would be my HUSBAND&#39;S house.  I don&#39;t work outside the <br/>\nhome.  I don&#39;t bring in any physical money.  But I am lucky in that my dh <br/>\nsees things the way I do.  He also believes that it is OUR house.  It doesn&#39;t <br/>\nbelong to who can pay the bills but it belongs to the people that live <br/>\ninside.<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":71656326,"authorName":"Kelle Kjeer","from":"&quot;Kelle Kjeer&quot; &lt;kelle@...&gt;","profile":"ivanandarthur","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044457226","msgId":57917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTgwMWMyY2QyNyQ1Mjg0MGU4MCQ2NTAxYThjMEBKS0pFRVI+","referencesHeader":"PDNGMjkyQTM3LjZBRUZDRDU1LjRENDk4NTg5QGFvbC5jb20+"},"prevInTopic":57916,"nextInTopic":57923,"prevInTime":57916,"nextInTime":57918,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"Thank you.  Learning all the time.......! ... From: debsusedbooks@aol.com To: Unschooling-dotcom@yahoogroups.com Sent: Wednesday, February 05, 2003 8:50 AM ","messageBody":"<div id=\"ygrps-yiv-1162749039\">Thank you.  Learning all the time.......!<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: debsusedbooks@... <br/>\n  To: Unschooling-dotcom@yahoogroups.com <br/>\n  Sent: Wednesday, February 05, 2003 8:50 AM<br/>\n  Subject: Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?<br/>\n<br/>\n<br/>\n  Kelle,<br/>\n<br/>\n  I too am new to officially choosing unschooling as our named &quot;method&quot; and I also feel like there is a lot of freedom here when it comes to tv.  I tend to disagree for my children.  <br/>\n<br/>\n  I own 2 television, one in my bedroom one in the living room.  Before my current partner came into my life we did not have the tvs on at all during the week (sunday at bedtime it went off and did not come back on until friday evening)  He changed that a bit in so much as he lived alone for many years and his habit was to ALWAYS have the tv on I guess even if just for the background noise.  Well with 3 children around, you don&#39;t need background noise!  So after 5 months living in &quot;our&quot; life he see the value of no tv during the week or at minimal during the day.  He has noticed that if the tv is on, nothing gets done!  The older children neglect helping with the baby, they don&#39;t do their chores unless constantly reminded and nagged.  And for me unschooling is about stopping the nagging...so why would I set that same situation up by allowing the tv to be on non-stop?  <br/>\n<br/>\n  What is currently happening around out house is the tv is not supposed to be one during the day but after dinner we might sit and watch Jeopardy together, then maybe we watch another hour or two depending on what is on.  But honestly there is so much junk on tv.  <br/>\n<br/>\n  Fortunately or unfortunately, we only get our 4 or 5 local channels.  And every time I turn around there is some comment being made about sex-it doesn&#39;t matter what time of day it is either!  For my personal likes there is just too much of this on.  I guess it might be better if I had cable or satalite that I could program to show only the channels that might help educate or entertain my children in appropriate childlike ways but alas, that is not an option.  <br/>\n<br/>\n  I did just join netflix so we will be getting some really cool documentary stuff in the mail soon.  That will be something the kids will enjoy and they can feel like they aren&#39;t being deprived.  They are also enjoying my new computer with some of the cool games on it.  Not sure how I feel about that one yet.  I guess anything in moderation is ok but I really hate the content on tv most times.<br/>\n<br/>\n  I also think it is just best if we do set some limits for our chilren.  Many times we have had this discussion on the unassisted birth board I belong to in so much as many of us there practice AP.  But for me and my house, I prefer some structure as far as me having a bit more knowledge about life and choices and consequences than my 8 & 11 year old.  To me it equates to making sure my 9 month old doesn&#39;t stick anything into his mouth that might harm him or anything into a socket in the wall.  I am sure as my children age, I will offer more and more freedom as I have already done that in many areas of their lives.  <br/>\n<br/>\n  Anyway...working it all out as we adjust to a new way of doing things. <br/>\n<br/>\n  Debra<br/>\n<br/>\n  &gt; New here, and I have to jump in about this TV thread.  What I am trying to figure out is;  if you own a television and restrict your children&#39;s viewing to shows that you deem appropriate, does that imply that you are depriving them of a learning opportunity and you are not unschooling?   What about porn?  Or violence?  Or if you know your child is super-sensitive to death or suffering?  Is there an age when you give kids <br/>\n  &gt; unlimited choices, or start from infancy?<br/>\n  &gt; <br/>\n  &gt; Trying to figure out if I fit in as an unschooler.<br/>\n  &gt; <br/>\n  &gt; Kelle<br/>\n<br/>\n  ~~~~ Don&#39;t forget! If you change topics, change the subject line! ~~~~<br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the moderator, Joyce Fetteroll (fetteroll@...), or the list owner, Helen Hegener (HEM-Editor@...).<br/>\n<br/>\n  To unsubscribe from this group, click on the following link or address an email to:<br/>\n  Unschooling-dotcom-unsubscribe@yahoogroups.com <br/>\n<br/>\n  Visit the Unschooling website: http://www.unschooling.com <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n  ---<br/>\n  Outgoing mail is certified Virus Free.<br/>\n  Checked by AVG anti-virus system (http://www.grisoft.com).<br/>\n  Version: 6.0.449 / Virus Database: 251 - Release Date: 01/27/2003<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":128904774,"authorName":"debsusedbooks@aol.com","from":"debsusedbooks@...","profile":"homebusinessmoms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044456602","msgId":57916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGMjkyQTM3LjZBRUZDRDU1LjRENDk4NTg5QGFvbC5jb20+"},"prevInTopic":57914,"nextInTopic":57917,"prevInTime":57915,"nextInTime":57917,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"Kelle, I too am new to officially choosing unschooling as our named method and I also feel like there is a lot of freedom here when it comes to tv.  I tend","messageBody":"<div id=\"ygrps-yiv-810236743\">Kelle,<br/>\n<br/>\nI too am new to officially choosing unschooling as our named &quot;method&quot; and I also feel like there is a lot of freedom here when it comes to tv.  I tend to disagree for my children.  <br/>\n<br/>\nI own 2 television, one in my bedroom one in the living room.  Before my current partner came into my life we did not have the tvs on at all during the week (sunday at bedtime it went off and did not come back on until friday evening)  He changed that a bit in so much as he lived alone for many years and his habit was to ALWAYS have the tv on I guess even if just for the background noise.  Well with 3 children around, you don&#39;t need background noise!  So after 5 months living in &quot;our&quot; life he see the value of no tv during the week or at minimal during the day.  He has noticed that if the tv is on, nothing gets done!  The older children neglect helping with the baby, they don&#39;t do their chores unless constantly reminded and nagged.  And for me unschooling is about stopping the nagging...so why would I set that same situation up by allowing the tv to be on non-stop?  <br/>\n<br/>\nWhat is currently happening around out house is the tv is not supposed to be one during the day but after dinner we might sit and watch Jeopardy together, then maybe we watch another hour or two depending on what is on.  But honestly there is so much junk on tv.  <br/>\n<br/>\nFortunately or unfortunately, we only get our 4 or 5 local channels.  And every time I turn around there is some comment being made about sex-it doesn&#39;t matter what time of day it is either!  For my personal likes there is just too much of this on.  I guess it might be better if I had cable or satalite that I could program to show only the channels that might help educate or entertain my children in appropriate childlike ways but alas, that is not an option.  <br/>\n<br/>\nI did just join netflix so we will be getting some really cool documentary stuff in the mail soon.  That will be something the kids will enjoy and they can feel like they aren&#39;t being deprived.  They are also enjoying my new computer with some of the cool games on it.  Not sure how I feel about that one yet.  I guess anything in moderation is ok but I really hate the content on tv most times.<br/>\n<br/>\nI also think it is just best if we do set some limits for our chilren.  Many times we have had this discussion on the unassisted birth board I belong to in so much as many of us there practice AP.  But for me and my house, I prefer some structure as far as me having a bit more knowledge about life and choices and consequences than my 8 & 11 year old.  To me it equates to making sure my 9 month old doesn&#39;t stick anything into his mouth that might harm him or anything into a socket in the wall.  I am sure as my children age, I will offer more and more freedom as I have already done that in many areas of their lives.  <br/>\n<br/>\nAnyway...working it all out as we adjust to a new way of doing things. <br/>\n<br/>\nDebra<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; New here, and I have to jump in about this TV thread.  What I am trying to figure out is;  if you own a television and restrict your children&#39;s viewing to shows that you deem appropriate, does that imply that you are depriving them of a learning opportunity and you are not unschooling?   What about porn?  Or violence?  Or if you know your child is super-sensitive to death or suffering?  Is there an age when you give kids <br/>\n&gt; unlimited choices, or start from infancy?<br/>\n&gt; <br/>\n&gt; Trying to figure out if I fit in as an unschooler.<br/>\n&gt; <br/>\n&gt; Kelle </span></blockquote></div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044456231","msgId":57914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4Mi4xNjYxM2Y3Yy4yYjcyN2QyN0Bhb2wuY29tPg=="},"prevInTopic":57894,"nextInTopic":57916,"prevInTime":57913,"nextInTime":57915,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/03 10:50:13 PM Eastern Standard Time, ... I believe in choice so my boys have always had the TV choice since they could get up and turn","messageBody":"<div id=\"ygrps-yiv-779478928\">In a message dated 2/4/03 10:50:13 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kelle@...\">kelle@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I am trying to figure out is;  if you own a television and restrict <br/>\n&gt; your children&#39;s viewing to shows that you deem appropriate, does that imply <br/>\n&gt; that you are depriving them of a learning opportunity and you are not <br/>\n&gt; unschooling?  What about porn?  Or violence?  Or if you know your child is <br/>\n&gt; super-sensitive to death or suffering?  Is there an age when you give kids <br/>\n&gt; unlimited choices, or start from infancy?<br/>\n&gt; <br/>\n&gt; <br/>\n </span></blockquote>I believe in choice so my boys have always had the TV choice since they could <br/>\nget up and turn the channel.  My boys can handle a certain amount of <br/>\nviolence.  We don&#39;t have any porn on our cable but seeing how they deal with <br/>\nthe sex scenes in some movies I don&#39;t&#39; believe that would appeal to them at <br/>\nthe ages they are now (5 and 8).  They are usually bored with the sex stuff <br/>\nright now.  If I think a movie is something that they won&#39;t like I tell them <br/>\nahead of time (it&#39;s kind of scary) if they want to watch we do and they have <br/>\nthe freedom to turn it off if they don&#39;t like it.  And they have before.  If <br/>\nthey happened to see something pornographic I would talk with them about it <br/>\nand why I don&#39;t feel it is a &quot;good thing&quot; to watch.  We discuss a lot of what <br/>\nwe see on TV even the commercials.<br/>\n<br/>\nI don&#39;t see the lack of TV as lack of a learning opportunity as much as a <br/>\nlack of choice.  A lack of trust on my part. But that is just my opinion and <br/>\nnonrestrictive TV for us has worked out just fine.<br/>\n<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A\tTransformation?","postDate":"1044446748","msgId":57894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNjY2ODRCLjEzODBDJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAxODkwMWMyY2NjYSQxMTJiMzZhMCQ2NTAxYThjMEBKS0pFRVI+"},"prevInTopic":57882,"nextInTopic":57914,"prevInTime":57893,"nextInTime":57895,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"... Well I would look at the principles involved rather than what is or isn t unschooling. What if you really wanted a sewing machine and your husband bought","messageBody":"<div id=\"ygrps-yiv-387092438\">on 2/4/03 10:52 PM, Kelle Kjeer at kelle@... wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I am trying to figure out is;  if you own a television and restrict your<br/>\n&gt; children&#39;s viewing to shows that you deem appropriate, does that imply that<br/>\n&gt; you are depriving them of a learning opportunity and you are not unschooling?<br/>\n<br/>\n </span></blockquote>Well I would look at the principles involved rather than what is or isn&#39;t<br/>\nunschooling.<br/>\n<br/>\nWhat if you really wanted a sewing machine and your husband bought one for<br/>\nyou but said you could only use it for an hour a day?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What about porn?<br/>\n<br/>\n </span></blockquote>Do your kids want to watch porn?<br/>\n<br/>\nQuite frankly when my 11 yo daughter is flipping through channels she<br/>\ndoesn&#39;t pause on shows that aren&#39;t cartoons or have animals in them or have<br/>\nkids no more than a couple years older than her.<br/>\n<br/>\nWhy would a chld choose to watch porn? (If it were even easily available to<br/>\nthem.) What in flipping through channels would make a child stop at porn and<br/>\nsay &quot;Hmm, that looks interesting&quot;?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Or violence?<br/>\n<br/>\n </span></blockquote>Again, do they want to watch violence? And if they did, what would it mean?<br/>\nDo you think that by treating them lovingly that they would watch violent<br/>\nshows and come to the conclusion that it&#39;s better to beat people up?<br/>\n<br/>\nMy daughter loves video games like Kirby and Mario where the cute main<br/>\ncharacter eats and beats up other &quot;cute&quot; characters before they beat him up.<br/>\nShe accepts it as the way things are in the game. But those &quot;values&quot; doesn&#39;t<br/>\ntranslate into real life.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Or if you know your child is super-sensitive<br/>\n&gt; to death or suffering?<br/>\n<br/>\n </span></blockquote>If you hated horror movies, would your husband rent one and put it on for<br/>\nyou two to watch together?<br/>\n<br/>\nLetting them choose doesn&#39;t translate into putting things on they don&#39;t want<br/>\nto watch. It means allowing them to trust their own fears and likes and<br/>\ndislikes to decide whether they want to watch something or not. It means<br/>\nhonoring their feelings and not putting on movies you know they wouldn&#39;t<br/>\nlike. It means if they find something disturbing in a movie that seemed okay<br/>\nthat the movie can be shut off or they can go do something else.<br/>\n<br/>\n(If you don&#39;t know about Screen It! (http://www.screening.com) it would help<br/>\nyou figure out what scenes might bother your children. Then you can warn<br/>\nthem if it&#39;s something they really want to see. Or pass it by if it doesn&#39;t<br/>\nsound interesting. They detail scenes in loads of different catagories that<br/>\nmight bother children (or parents), like sex and swear words and jump scenes<br/>\nand scary music and violence and so on.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Is there an age when you give kids unlimited choices,<br/>\n&gt; or start from infancy?<br/>\n<br/>\n </span></blockquote>It depends what you mean by unlimited. You don&#39;t need to bring everything in<br/>\nthe world home to them. You judge by your family&#39;s interests rather than by<br/>\nwhat&#39;s good for them or bad for them.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044424325","msgId":57882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0OC45ODc1NTAyLjJiNzIwMDg1QGFvbC5jb20+"},"prevInTopic":57879,"nextInTopic":57894,"prevInTime":57881,"nextInTime":57883,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/03 8:50:12 PM, kelle@joekjeer.com writes:  You can be an unschooler without","messageBody":"<div id=\"ygrps-yiv-1461020447\">In a message dated 2/4/03 8:50:12 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kelle@...\">kelle@...</a> writes:<br/>\n<br/>\n&lt;&lt; Trying to figure out if I fit in as an unschooler. &gt;&gt;<br/>\n<br/>\nYou can be an unschooler without caring what other people do about TV.<br/>\n<br/>\n&lt;&lt;What I am trying to figure out is;  if you own a television and restrict <br/>\nyour children&#39;s viewing to shows that you deem appropriate, does that imply <br/>\nthat you are depriving them of a learning opportunity and you are not <br/>\nunschooling?  What about porn?  Or violence?  Or if you know your child is <br/>\nsuper-sensitive to death or suffering?  Is there an age when you give kids <br/>\nunlimited choices, or start from infancy?&gt;&gt;<br/>\n<br/>\nDepends what your priorities are.<br/>\nDepends how old your children are.<br/>\n<br/>\nA child who is super-sensitive to death or suffering wouldn&#39;t choose to watch <br/>\nthe news, right?<br/>\nI myself choose not to watch the news.  It&#39;s a festival of death and <br/>\nsuffering.<br/>\n<br/>\n&lt;&lt; What about porn?&gt;&gt;<br/>\n<br/>\nWe don&#39;t have any porn channels.<br/>\n<br/>\n&lt;&lt;Or violence? &gt;&gt;<br/>\n<br/>\nI don&#39;t much like violence, but in the context of a story sometimes there&#39;s <br/>\nviolence.  <br/>\n<br/>\nDo you  mean Tom & Jerry or Roadrunner/Coyote violence?  Fight Club violence? <br/>\n War coverage violence?<br/>\n<br/>\nWe don&#39;t subscribe to Newsweek anymore, partly because I was tired of photos <br/>\nof dead people.  <br/>\n<br/>\nI hate to pass through where anyone&#39;s watching WWF (WWE, any kind of <br/>\ntheatrical soap-opera wrestling) but my husband watches it a couple of times <br/>\na month.  Sometimes the boys watch it with him.  I think it&#39;s awful.  They <br/>\nthink it&#39;s fun and funny.  It hasn&#39;t made them get tattoos or hit anyone with <br/>\na chair.<br/>\n<br/>\nBefore we were unschoolers we gave our kids choices about food.  Not <br/>\n&quot;unlimited choices,&quot; because we didn&#39;t have all the food in the world.  But <br/>\nfree choices, yes.  We didn&#39;t make them eat food they didn&#39;t want to eat.  We <br/>\nlet them try foods if they wanted to try them.  We let them have more if they <br/>\nwanted more.<br/>\n<br/>\nWe let them choose which clothes to wear, of the clothes they had.  Marty <br/>\nwore a tiger suit (no mask or hood, just the body part) for most of a year.<br/>\n<br/>\nWe let them choose what toys to play with, of the toys they had.<br/>\n<br/>\nWe let them choose what videos to watch, of the videos we had.  <br/>\nWe let them choose to watch TV shows.  They never were interested in things <br/>\nthey weren&#39;t interested in.   When they were little they didn&#39;t like things <br/>\nwithout kids or animals.  <br/>\n<br/>\nAs they got older and could understand stories they chose from a broader <br/>\nrange.  When they could request foods from the store, that increase their <br/>\nfood choices.  When they could save allowance and buy what they wanted to, <br/>\nthat increased their toy options.<br/>\n<br/>\nThere was never a time when we made all their choices for them, or limited <br/>\ntheir choices based on what WE thought was good for them against their will.  <br/>\nWhen there&#39;s been an edgy matter we&#39;ve told them what we thought, and they&#39;ve <br/>\ntold us why they wanted to try or do the thing, and we&#39;d convince them to <br/>\nwait a bit, or they&#39;d convince us they wanted to try it.  Lots of <br/>\ncommunication.<br/>\n<br/>\nI think the stereotype or the extreme examples in these case are presupposing <br/>\nthat a child given free reign will watch porn, smoke cigars and stay up 48 <br/>\nhours without sleeping.  The extreme examples are given in a reactionary and <br/>\nchallenging way, kind of as an insult to those who &quot;claim&quot; to give their <br/>\nchildren freedoms.   It does get tiring, but it&#39;s worth explaining again, <br/>\nbecause each time it comes around, some more families loosen up arbitrary <br/>\nrules that weren&#39;t serving any useful purposes but to give them something to <br/>\nstress and argue about.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044422155","msgId":57879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1YS4xYjU1OWVhZi4yYjcxZjgwYkBhb2wuY29tPg=="},"prevInTopic":57876,"nextInTopic":57882,"prevInTime":57878,"nextInTime":57880,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/03 7:19:22 PM, diamondair@email.msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-516631889\">In a message dated 2/4/03 7:19:22 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamondair@...\">diamondair@...</a> writes:<br/>\n<br/>\n&lt;&lt;  However, the Powderpuff girls would&#39;ve been <br/>\nan option for that family because they chose to use their money for <br/>\ncable TV and not for airplane payments.<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>We don&#39;t have either one.  It&#39;s Powerpuff girls.  I have the waffle iron.<br/>\n<br/>\n&lt;It seems to me that in this <br/>\nscenario, you see one family who is deprived because they don&#39;t have <br/>\na TV, and one family who is not deprived because they do. <br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>It&#39;s not &quot;deprivation,&quot; it&#39;s a question of villifying a medium.<br/>\n<br/>\n-=-&gt; But I worry more about a family without any bike, park, vaudeville <br/>\nshow who <br/>\n<blockquote><span title=\"ireply\"> &gt; just lies and says the TV doesn&#39;t work, or says yes it works, but <br/>\n </span></blockquote>you can&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; watch it.<br/>\n<br/>\n </span></blockquote>-=-Yeah, that would be a bit weird. But I don&#39;t see any families here <br/>\ndoing that, so I&#39;m not sure I see the point.-=-<br/>\n<br/>\nThere are people who do both.  There&#39;ve been a couple of people admit lying <br/>\nto kids.  One said when she didn&#39;t want them to watch it she would unplug it, <br/>\nthen try to turn it on and say, &quot;Oh.  It&#39;s not working.&quot;<br/>\n<br/>\n&lt;&lt;Right, but nobody has every choice. Some people live in areas where <br/>\nthey have snow, and therefore sledding, cross-country skiing, and <br/>\nsnowshoeing are available. &gt;&gt;<br/>\n<br/>\nI&#39;ve never heard of anyone saying &quot;If I let my kids ski, they would just ski <br/>\nall day,&quot; or &quot;When he&#39;s skiing he&#39;s like a zombie&quot; or &quot;Skiing rots his brain&quot; <br/>\nor &quot;I&#39;ve read a book that says skiing will affect his mental development, so <br/>\nwe just don&#39;t have skis.&quot;<br/>\n<br/>\nIf airplanes and televisions cost the same there would be lots more <br/>\nairplanes, no doubt.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1572768,"authorName":"Stephanie Elms","from":"&quot;Stephanie Elms&quot; &lt;stephanie.elms@...&gt;","profile":"elmsfam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044421517","msgId":57876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlENkNGOUNFQTc2ODNDNEQ4RjQxNUEzRjU0RDFDMDY2MDEzREM4QjRAZHN0cDEuZGVsdGFzb2x1dGlvbnMuY29tPg=="},"prevInTopic":57866,"nextInTopic":57879,"prevInTime":57875,"nextInTime":57877,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"... Unlimited tv does not mean that you sit your young kids down in front of NYPD blue or ER and tell them to enjoy. My kids are 6 and almost 3 and they would","messageBody":"<div id=\"ygrps-yiv-930191635\"><blockquote><span title=\"ireply\">&gt; New here, and I have to jump in about this TV thread.  What I <br/>\n&gt; am trying to figure out is;  if you own a television and <br/>\n&gt; restrict your children&#39;s viewing to shows that you deem <br/>\n&gt; appropriate, does that imply that you are depriving them of a <br/>\n&gt; learning opportunity and you are not unschooling?  What about <br/>\n&gt; porn?  Or violence?  Or if you know your child is <br/>\n&gt; super-sensitive to death or suffering?  Is there an age when <br/>\n&gt; you give kids unlimited choices, or start from infancy?<br/>\n<br/>\n </span></blockquote>Unlimited tv does not mean that you sit your young kids down in front of NYPD blue<br/>\nor ER and tell them to enjoy. My kids are 6 and almost 3 and they would not enjoy<br/>\nwatching something with a lot of violence or porn. Since reading here, I have become<br/>\nmore comfortable with trusting my children to decide if something is appropriate. <br/>\nMy oldest loves the crocodile hunter. When the movie came out, my immediate reaction was<br/>\nthat it was not something that I wanted Jason to see (things blowing up etc). We watched<br/>\na clips show on tv and Jason told me that he did not want to see the movie because<br/>\nit looked too scary. He did the same thing with Spider Man, saw some ads and decided that<br/>\nhe did not want to see it.<br/>\n<br/>\nSo, yes I am &quot;limiting&quot; tv because I am not taping (we have tivo) ER or NYPD Blue for the<br/>\nboys (and we choose only to watch it when they are in bed). But I am not limiting it because<br/>\nif they showed a real interest in wanting to see it for whatever reason, I would let them <br/>\nwatch it (with me next to them). It has actually been very freeing for me and I am seeing<br/>\nmy kids as people who have a good sense of what they are ready for rather then fragile<br/>\nthings that need to be protected (I am not sure that made sense). I used to be the type<br/>\nthat would try to flip the channel if an ad for a violent movie came on (fox football<br/>\nused to drive me nuts!). But I realized that it had the potential of creating more<br/>\ninterest, so I stopped. And neither of my kids have been traumatized so far!<br/>\n<br/>\nI think that &quot;no limits&quot; means that we as parents do not decide what is &quot;good&quot; for them...<br/>\nfor example, only letting them watch &quot;educational&quot; tv. It is trusting that kids can make<br/>\ngood choices for themselves, even if those choices are not the ones that we would make.<br/>\n<br/>\nStephanie E.</div>","specialLinks":[]},{"userId":71656326,"authorName":"Kelle Kjeer","from":"&quot;Kelle Kjeer&quot; &lt;kelle@...&gt;","profile":"ivanandarthur","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044417172","msgId":57866,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxODkwMWMyY2NjYSQxMTJiMzZhMCQ2NTAxYThjMEBKS0pFRVI+","referencesHeader":"PGIxcHM4cCs0MDRsQGVHcm91cHMuY29tPg=="},"prevInTopic":57855,"nextInTopic":57876,"prevInTime":57865,"nextInTime":57867,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"Hi, New here, and I have to jump in about this TV thread.  What I am trying to figure out is;  if you own a television and restrict your children s viewing to","messageBody":"<div id=\"ygrps-yiv-820693207\">Hi,  <br/>\n<br/>\nNew here, and I have to jump in about this TV thread.  What I am trying to figure out is;  if you own a television and restrict your children&#39;s viewing to shows that you deem appropriate, does that imply that you are depriving them of a learning opportunity and you are not unschooling?  What about porn?  Or violence?  Or if you know your child is super-sensitive to death or suffering?  Is there an age when you give kids unlimited choices, or start from infancy?<br/>\n<br/>\nTrying to figure out if I fit in as an unschooler.<br/>\n<br/>\nKelle<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.449 / Virus Database: 251 - Release Date: 01/27/2003<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8226888,"authorName":"the_clevengers &lt;diamondair@email.msn.com&gt;","from":"&quot;the_clevengers &lt;diamondair@...&gt;&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"TV, was Re: Is Unschooling A Transformation?","postDate":"1044411481","msgId":57855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxcHM4cCs0MDRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGEyLjMzMDEzOTVkLjJiNzE2MTIxQGFvbC5jb20+"},"prevInTopic":57815,"nextInTopic":57866,"prevInTime":57854,"nextInTime":57856,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"... of things ... I m not sure that any one family offers a full range of options to their kids. We all pick and choose, based on our own interests, abilities,","messageBody":"<div id=\"ygrps-yiv-467744779\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 2/4/03 8:50:39 AM, diamondair@e... writes:<br/>\n&gt; We are a family that chooses <br/>\n&gt; to offer a full range of options and see our children do all kinds <br/>\n </span></blockquote>of things <br/>\n<blockquote><span title=\"ireply\"> &gt; wholly by their own choice.<br/>\n<br/>\n </span></blockquote>I&#39;m not sure that any one family offers a full range of options to <br/>\ntheir kids. We all pick and choose, based on our own interests, <br/>\nabilities, etc. For instance, our children are offered the ability to <br/>\ngo flying in our airplane whenever they choose. Should I then say <br/>\nthat any other parents who choose not to purchase an airplane and <br/>\nlearn how to fly it are limiting their children&#39;s options because <br/>\nit&#39;s not available to their children?  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Our family&#39;s quite busy.  But I never have once thought they were <br/>\n </span></blockquote>only doing <br/>\n<blockquote><span title=\"ireply\"> &gt; something because TV wasn&#39;t an option.  <br/>\n<br/>\n </span></blockquote>Don&#39;t think I&#39;ve seen that implied or said.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think that&#39;s cooler than doing it <br/>\n&gt; without options.<br/>\n<br/>\n </span></blockquote>I sincerely doubt that any kids on this list have &quot;no options&quot;. <br/>\nThough some might have different options. This morning, my kids said <br/>\nthey wanted to go flying, and I could take them up. If they said they <br/>\nwanted to watch Powderpuff girls, that would&#39;ve been impossible as we <br/>\ndon&#39;t choose to use our money on cable TV. In another family, if the <br/>\nkids had said in the morning that they wanted to go flying, that <br/>\nwould&#39;ve been impossible. However, the Powderpuff girls would&#39;ve been <br/>\nan option for that family because they chose to use their money for <br/>\ncable TV and not for airplane payments.<br/>\n<br/>\nIn this scenario, I see two families who have chosen to use their <br/>\nmoney on two different options and therefore their children have <br/>\ndifferent options available to them. It seems to me that in this <br/>\nscenario, you see one family who is deprived because they don&#39;t have <br/>\na TV, and one family who is not deprived because they do. <br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; My kids have never had any interest in the Saturday morning <br/>\n </span></blockquote>cartoons (if <br/>\n<blockquote><span title=\"ireply\"> &gt; there even are any anymore).  Saturday isn&#39;t a &quot;special day&quot; for <br/>\n </span></blockquote>them.  <br/>\n<br/>\nDitto, we sometimes don&#39;t even realize it *is* Saturday, LOL!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I worry more about a family without any bike, park, vaudeville <br/>\n </span></blockquote>show who <br/>\n<blockquote><span title=\"ireply\"> &gt; just lies and says the TV doesn&#39;t work, or says yes it works, but <br/>\n </span></blockquote>you can&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; watch it.<br/>\n<br/>\n </span></blockquote>Yeah, that would be a bit weird. But I don&#39;t see any families here <br/>\ndoing that, so I&#39;m not sure I see the point. Our TV doesn&#39;t work in <br/>\nthe sense that it is not hooked up to a cable, therefore gets little <br/>\nprogramming, but our kids do watch movies on it (it has a VCR <br/>\nattached).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is still not a true representation of having television or <br/>\n </span></blockquote>videos <br/>\n<blockquote><span title=\"ireply\"> &gt; available.  It&#39;s not a choice to do that instead of reading, <br/>\n </span></blockquote>swimming or <br/>\n<blockquote><span title=\"ireply\"> &gt; playing games.<br/>\n<br/>\n </span></blockquote>Right, but nobody has every choice. Some people live in areas where <br/>\nthey have snow, and therefore sledding, cross-country skiing, and <br/>\nsnowshoeing are available. Some people live on a beach, and therefore <br/>\nswimming and surfing are available. Some people choose to own <br/>\nbicycles, some people choose not to put their money into bicycles. <br/>\nSome people choose to spend money on a membership to a club with a <br/>\npool, or in a house with a pool so that swimming is always an option. <br/>\nSome people own airplanes so that flying is always an option. Some <br/>\npeople choose to have TVs available as an option, or playstations, or <br/>\ncomputers. These are all options and not a single one of us has all <br/>\nof these available. <br/>\n<br/>\nFor some reason, TV is seen by many as a &quot;better&quot; option, or a <br/>\nnecessary one, or one that kids are &quot;deprived&quot; if they don&#39;t have <br/>\naccess to. I think that&#39;s about as strange as if I suddenly started <br/>\ninsisting that everyone who doesn&#39;t own an airplane is depriving <br/>\ntheir kids by not giving them the ability to go flying whenever they <br/>\nwant to. My kids do happen to have that option. They also have a TV <br/>\nthat does get a couple of channels fuzzily via rabbit-ear antennas <br/>\nand they occasionally ask to watch it, and they do watch it on those <br/>\noccasions. But they&#39;re as deprived by their lack of cable TV as other <br/>\nkids are by their lack of ability to take to the air.<br/>\n<br/>\nBlue Skies,<br/>\n-Robin-<br/>\n<br/>\nwho grew up with no cable TV but the marvelous gift of wings</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044401093","msgId":57815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzLjJhMTQxYWQ0LjJiNzFhNWM1QGFvbC5jb20+"},"prevInTopic":57809,"nextInTopic":57855,"prevInTime":57814,"nextInTime":57816,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/03 1:44:40 PM, love-it-here@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-1726253319\">In a message dated 2/4/03 1:44:40 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:love-it-here@...\">love-it-here@...</a> writes:<br/>\n<br/>\n&lt;&lt; When we have had groups of people over for Thanksgiving or New Years,<br/>\nboth adults and children have gotten upset with me that they could not<br/>\nwatch Football games. And I mean, really upset, to the point of<br/>\ndysfunctional.  &gt;&gt;<br/>\n<br/>\nThat&#39;s about sports, not TV.<br/>\n<br/>\nI think the assumption of gatherings on those days is generally that the <br/>\nfootball games will be available.  If they&#39;d known in advance they could&#39;ve <br/>\nstayed home and you wouldn&#39;t have had upset people or a story to tell us.<br/>\n<br/>\nI don&#39;t watch sports, and my husband rarely does, but I have friends who DO <br/>\nwatch football, and it would be cruel for someone to lure them with social <br/>\nobligation to a place where they couldn&#39;t watch the Cowboys or the Steelers, <br/>\nwere it one of their days.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044398929","msgId":57809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFlLjM3ZTY3YTZhLjJiNzE5ZDUxQGFvbC5jb20+"},"prevInTopic":57785,"nextInTopic":57815,"prevInTime":57808,"nextInTime":57810,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/03 2:13:54 PM Eastern Standard Time, cen46624@vol.com ... Friends of ours did that once.  Invited us over for dinner.  The boys were all","messageBody":"<div id=\"ygrps-yiv-540216578\">In a message dated 2/4/03 2:13:54 PM Eastern Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cen46624@...\">cen46624@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My big complaint was when I&#39;d go over to some (adult) friends&#39; house and <br/>\n&gt; all THEY&#39;d want to do was watch TV, even though they&#39;d invited us over! <br/>\n&gt; Not invited to watch TV, either, nor was it a particular show they <br/>\n&gt; wanted to share, just whatever was on that evening.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Friends of ours did that once.  Invited us over for dinner.  The boys were <br/>\nall off playing and we were eating.  It happened to be the time when one of <br/>\nthose reality shows was on so they turned on a TV in the kitchen and that is <br/>\nwhat we did...eat and watch this program that they &quot;couldn&#39;t miss&quot;.  <br/>\nLOL...sad<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128897139,"authorName":"love-it-here@juno.com","from":"love-it-here@...","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044391438","msgId":57785,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwMjA0LjE1NDQwMC4tNDU1OTQzLjAubG92ZS1pdC1oZXJlQGp1bm8uY29tPg=="},"prevInTopic":57780,"nextInTopic":57809,"prevInTime":57784,"nextInTime":57786,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"On Tue, 04 Feb 2003 15:49:23 -0000 the_clevengers ... discovered our TV downstairs and kept repeatedly  asking  me to turn it on were ones who had TVs in","messageBody":"<div id=\"ygrps-yiv-461147620\">On Tue, 04 Feb 2003 15:49:23 -0000 &quot;the_clevengers<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamondair@...\">diamondair@...</a>&gt;&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamondair@...\">diamondair@...</a>&gt; writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; When we&#39;ve had large groups of people over, the  only kids who<br/>\n </span></blockquote>discovered &gt;our TV downstairs and kept repeatedly  asking  me to turn it<br/>\non were ones &gt;who had TVs in their house. One 10 y.o.  boy actually<br/>\nbecame very upset with &gt;me when I explained that our TV  isn&#39;t hooked up<br/>\nto an antenna or cable, so it &gt;doesn&#39;t actually get  any TV shows. He was<br/>\nmad about that. <br/>\n<br/>\nI have had the same thing happen here. While we do have three televisions<br/>\nand one VCR, none of them are hooked up to antennas or cable. The only<br/>\nstation that comes in clearly is PBS, and we mostly just watch videos.<br/>\nWhen we have had groups of people over for Thanksgiving or New Years,<br/>\nboth adults and children have gotten upset with me that they could not<br/>\nwatch Football games. And I mean, really upset, to the point of<br/>\ndysfunctional. They would pace around like lost puppies. I&#39;d find them<br/>\nsitting in their cars in subzero weather tuned in to the radio. Some<br/>\npeople, (my Dad) actually went home. I would hate for something to have<br/>\nthat much of a hold on me. My children can watch TV or tapes at their<br/>\nwhim, and when they go to visit other people, they are there to spend<br/>\nthat time with those people. DD5 often comes home from Grandma&#39;s<br/>\ndisappointed, because the first thing my Mom does is turn on cartoons for<br/>\nher. DD would much rather spend the time doing something *with* Grandma.<br/>\nShe does think it is pretty cool that cartoons are on all night there<br/>\nthough.<br/>\nWende<br/>\n<br/>\n________________________________________________________________<br/>\nSign Up for Juno Platinum Internet Access Today<br/>\nOnly $9.95 per month!<br/>\nVisit www.juno.com</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044388879","msgId":57780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJmLjJkYjFiYWEyLjJiNzE3NjBmQGFvbC5jb20+"},"prevInTopic":57776,"nextInTopic":57785,"prevInTime":57779,"nextInTime":57781,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/03 12:13:45 PM, cen46624@vol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1073341523\">In a message dated 2/4/03 12:13:45 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cen46624@...\">cen46624@...</a> writes:<br/>\n<br/>\n&lt;&lt; My big complaint was when I&#39;d go over to some (adult) friends&#39; house and <br/>\nall THEY&#39;d want to do was watch TV, even though they&#39;d invited us over! <br/>\nNot invited to watch TV, either, nor was it a particular show they <br/>\nwanted to share, just whatever was on that evening. &gt;&gt;<br/>\n<br/>\nThat&#39;s horribly tacky.<br/>\n<br/>\nSometimes we do invite someone or people over to watch a movie, but they know <br/>\nand we know and we totally clean up enough good places to sit and make <br/>\npopcorn!  But more often if we have company it&#39;s to play games and so we <br/>\nsometimes eat fast so we can play longer.   <br/>\n<br/>\nFor such flighty, disorganized people we can be pretty focussed!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044385346","msgId":57776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNDAwRTQyLjMwMDAzMDNAdm9sLmNvbT4=","referencesHeader":"PDFkYS4xOThjNTdiLjJiNzEzM2RhQGFvbC5jb20+"},"prevInTopic":57767,"nextInTopic":57780,"prevInTime":57775,"nextInTime":57777,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"That s what I ve heard many times, so I try to be aware of what my kids are doing when there s TV available freely. If they looked like they really were","messageBody":"<div id=\"ygrps-yiv-987817032\">That&#39;s what I&#39;ve heard many times, so I try to be aware of what my kids <br/>\nare doing when there&#39;s TV available freely. If they looked like they <br/>\nreally were interested, I&#39;d probably start looking into getting one. I <br/>\nfigure it&#39;s inevitable someday, anyhow.<br/>\n<br/>\nMy big complaint was when I&#39;d go over to some (adult) friends&#39; house and <br/>\nall THEY&#39;d want to do was watch TV, even though they&#39;d invited us over! <br/>\nNot invited to watch TV, either, nor was it a particular show they <br/>\nwanted to share, just whatever was on that evening.<br/>\n<br/>\n:-) Diane<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;And when kids come over that are TV restricted at home <br/>\n&gt;all they want to do is watch TV or play the computer.  They aren&#39;t able to <br/>\n&gt;watch TV or play whatever computer game they like at home.  So they are glued <br/>\n&gt;to them at our house.  My boys are always complaining about that.  The kids <br/>\n&gt;come over to play and they won&#39;t play.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044383521","msgId":57767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGEyLjMzMDEzOTVkLjJiNzE2MTIxQGFvbC5jb20+"},"prevInTopic":57761,"nextInTopic":57776,"prevInTime":57766,"nextInTime":57768,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/03 8:50:39 AM, diamondair@email.msn.com writes: ","messageBody":"<div id=\"ygrps-yiv-227919800\">In a message dated 2/4/03 8:50:39 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:diamondair@...\">diamondair@...</a> writes:<br/>\n<br/>\n&lt;&lt; I guess I <br/>\nsee the TV/no TV thing as just a matter of choice. I know some folks <br/>\nthink kids who don&#39;t have TV are deprived, but really they just have <br/>\ndifferent things in their lives during that time when they&#39;d be <br/>\nwatching the TV. It doesn&#39;t have to be a value judgement - better or <br/>\nworse - it&#39;s just different. &gt;&gt;<br/>\n<br/>\nIf the value of the thought processes of the parents are really lame, then <br/>\nit&#39;s worse, not just different (in MY opinion and experience).<br/>\n<br/>\nSome parents have invalid reasons for their TV views.  Nonsensical reasons.  <br/>\nIllogical reasons.<br/>\n<br/>\nAnd passing illogical or dishonest reasoning on to kids doesn&#39;t promote <br/>\nnatural learning.  They figure out early that the parents are not being calm <br/>\nand accepting, but that they&#39;re kind of superstitious and paranoid.<br/>\n<br/>\n&lt;&lt; So, some families choose to watch TV, <br/>\nand some choose to do different things. &gt;&gt;<br/>\n<br/>\nWe have TVs.  But we are not a family that chooses to watch TV, as opposed to <br/>\na family that chooses to do different things.  We are a family that chooses <br/>\nto offer a full range of options and see our children do all kinds of things <br/>\nwholly by their own choice.<br/>\n<br/>\nHolly&#39;s watching Mr. Rogers.  She&#39;s 11.  I didn&#39;t tell her to.  She came in <br/>\nhere to show me the dress Lady Aberline&#39;s wearing.  Holly really liked it.  <br/>\nKeith came home from work sick.  He was watching Fight Club, from the bed, <br/>\nwhen I was in there last.  He&#39;s probably asleep now.  Last night Marty, Keith <br/>\nand I worked on tent repairs for a couple of mid-sized medieval-style tents <br/>\nwe have.  Tonight we have one more grommet repair (which will involve leather <br/>\nand glue).  Holly and I are going shopping today to a fabric store and to <br/>\nlook for some used shoes we can paint purple for an outfit she needs for <br/>\nSaturday.   The boys are both sick too, poor guys.  Sleeping.<br/>\n<br/>\nOur family&#39;s quite busy.  But I never have once thought they were only doing <br/>\nsomething because TV wasn&#39;t an option.  Every time they&#39;re out playing orc <br/>\nball or playing boffers in the back field or off gaming, it&#39;s because they <br/>\nwould rather do that than watch TV.  I think that&#39;s cooler than doing it <br/>\nwithout options.<br/>\n<br/>\n&lt;&lt;We spent Saturday morning <br/>\ngoing to a live vaudeville show, on a bike ride, and to a park. <br/>\nSomeone else might spend it watching Saturday morning cartoons. &gt;&gt;<br/>\n<br/>\nMy kids have never had any interest in the Saturday morning cartoons (if <br/>\nthere even are any anymore).  Saturday isn&#39;t a &quot;special day&quot; for them.  <br/>\n<br/>\nIf there were a live vaudeville show here they would never have let TV keep <br/>\nthem from going (though on Saturday morning nobody here ever watches any).  <br/>\nBut I worry more about a family without any bike, park, vaudeville show who <br/>\njust lies and says the TV doesn&#39;t work, or says yes it works, but you can&#39;t <br/>\nwatch it.<br/>\n<br/>\n&lt;&lt;It&#39;s <br/>\njust a different choice of activities for that time. We spend our <br/>\nevening hours playing games with the kids, reading books, going <br/>\nswimming, etc. Again, we&#39;ve just chosen a different set of activities.&gt;&gt;<br/>\n<br/>\nThis is still not a true representation of having television or videos <br/>\navailable.  It&#39;s not a choice to do that instead of reading, swimming or <br/>\nplaying games.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044382698","msgId":57761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNjLjJiNmZmNzFmLjJiNzE1ZGVhQGFvbC5jb20+"},"prevInTopic":57745,"nextInTopic":57767,"prevInTime":57760,"nextInTime":57762,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/03 8:30:40 AM, unschooling@prexar.com writes: ","messageBody":"<div id=\"ygrps-yiv-1099465801\">In a message dated 2/4/03 8:30:40 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooling@...\">unschooling@...</a> writes:<br/>\n<br/>\n&lt;&lt; I have a friend<br/>\nwho claims her kids would do nothing but watch tv all the time if she let<br/>\nthem.  I know you might think that is because she does restrict it, but I<br/>\nrestricted my kids tv viewing for many years and they still don&#39;t like it<br/>\nthat much.  &gt;&gt;<br/>\n<br/>\nYour kids are unrestricted and they don&#39;t like it that much.<br/>\n<br/>\nHer kids are restricted and she &quot;knows&quot; they would only watch tv if she let <br/>\nthem.<br/>\nShe won&#39;t know unless she lets them.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":8226888,"authorName":"the_clevengers &lt;diamondair@email.msn.com&gt;","from":"&quot;the_clevengers &lt;diamondair@...&gt;&quot; &lt;diamondair@...&gt;","profile":"the_clevengers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"TV, was Re: Is Unschooling A Transformation?","postDate":"1044373763","msgId":57745,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxb25lMytjZnNoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFkYS4xOThjNTdiLjJiNzEzM2RhQGFvbC5jb20+"},"prevInTopic":57740,"nextInTopic":57761,"prevInTime":57744,"nextInTime":57746,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"... opposite.  We ... hotel or when ... TV.  Maybe ... as yours ... at home ... able to ... are glued ... The kids ... Interesting, I ve found the opposite.","messageBody":"<div id=\"ygrps-yiv-1263364609\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, genant2@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I have found the opposite to be true well maybe not the exact <br/>\n </span></blockquote>opposite.  We <br/>\n<blockquote><span title=\"ireply\"> &gt; have many TVs.  And watch them off and on.  But when we go to a <br/>\n </span></blockquote>hotel or when <br/>\n<blockquote><span title=\"ireply\"> &gt; people come over my boys want to play.  They don&#39;t want to watch <br/>\n </span></blockquote>TV.  Maybe <br/>\n<blockquote><span title=\"ireply\"> &gt; because they can do that anytime.  So my boys are kind of the same <br/>\n </span></blockquote>as yours <br/>\n<blockquote><span title=\"ireply\"> &gt; but we do watch TV.  And when kids come over that are TV restricted <br/>\n </span></blockquote>at home <br/>\n<blockquote><span title=\"ireply\"> &gt; all they want to do is watch TV or play the computer.  They aren&#39;t <br/>\n </span></blockquote>able to <br/>\n<blockquote><span title=\"ireply\"> &gt; watch TV or play whatever computer game they like at home.  So they <br/>\n </span></blockquote>are glued <br/>\n<blockquote><span title=\"ireply\"> &gt; to them at our house.  My boys are always complaining about that.  <br/>\n </span></blockquote>The kids <br/>\n<blockquote><span title=\"ireply\"> &gt; come over to play and they won&#39;t play.<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>Interesting, I&#39;ve found the opposite. Most of our friends don&#39;t have <br/>\nTVs, but a few do. When we&#39;ve had large groups of people over, the <br/>\nonly kids who discovered our TV downstairs and kept repeatedly asking <br/>\nme to turn it on were ones who had TVs in their house. One 10 y.o. <br/>\nboy actually became very upset with me when I explained that our TV <br/>\nisn&#39;t hooked up to an antenna or cable, so it doesn&#39;t actually get <br/>\nany TV shows. He was mad about that. I&#39;ve just got it hooked up to a <br/>\nVCR so I can watch stuff while I&#39;m cycling. It was weird to see these <br/>\nkids keep coming back to the TV like moths to a flame. But the rest <br/>\nof the kids were upstairs playing.<br/>\n<br/>\nMy son was at a friend&#39;s house last week, one of our few friends who <br/>\ndoes have a TV out in the living room, and my son has never asked to <br/>\nturn it on when we&#39;ve been there. I think it depends a lot on the <br/>\npersonalities of the kids involved, most likely.<br/>\n<br/>\nSome random thoughts, unconnected to your particular post: I guess I <br/>\nsee the TV/no TV thing as just a matter of choice. I know some folks <br/>\nthink kids who don&#39;t have TV are deprived, but really they just have <br/>\ndifferent things in their lives during that time when they&#39;d be <br/>\nwatching the TV. It doesn&#39;t have to be a value judgement - better or <br/>\nworse - it&#39;s just different. So, some families choose to watch TV, <br/>\nand some choose to do different things. We spent Saturday morning <br/>\ngoing to a live vaudeville show, on a bike ride, and to a park. <br/>\nSomeone else might spend it watching Saturday morning cartoons. It&#39;s <br/>\njust a different choice of activities for that time. We spend our <br/>\nevening hours playing games with the kids, reading books, going <br/>\nswimming, etc. Again, we&#39;ve just chosen a different set of activities.<br/>\n<br/>\nAnd if kids who don&#39;t watch TV want to watch it when they go to a <br/>\nhouse where it&#39;s on, well that&#39;s natural. When my kids go to their <br/>\nfriend&#39;s house where the mom always does great crafts stuff, that&#39;s <br/>\nall they want to do there. I&#39;m more or less craft-impaired. :-) Does <br/>\nthat mean my kids are craft-deprived and will be in need of a <br/>\npsychiatrist to fix their craft-deprivation later in life? :-) And my <br/>\nexperience hasn&#39;t been that my kids crave TV at friend&#39;s houses in <br/>\nany case.<br/>\n<br/>\n<br/>\nBlue Skies,<br/>\n-Robin-</div>","specialLinks":[]},{"userId":89681911,"authorName":"Angela","from":"&quot;Angela&quot; &lt;unschooling@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044372466","msgId":57740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDQwMWMyY2M2MSRmOTA5ODU4MCQ2OTAwYThjMEBsZWlnaD4=","inReplyToHeader":"PDFkYS4xOThjNTdiLjJiNzEzM2RhQGFvbC5jb20+"},"prevInTopic":57737,"nextInTopic":57745,"prevInTime":57739,"nextInTime":57741,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"I think personalities come in to play in whether or not kids are drawn to the tv as much as whether it is restricted or not.  Some kids, like my oldest, are","messageBody":"<div id=\"ygrps-yiv-942503587\">I think personalities come in to play in whether or not kids are drawn to<br/>\nthe tv as much as whether it is restricted or not.  Some kids, like my<br/>\noldest, are just not drawn to the tv.  My youngest likes it a little more,<br/>\nbut both would leave it in a heart beat to play with their friends or to<br/>\nplay a game with me or listen to a book.  I used to restrict it when they<br/>\nwere little, but I don&#39;t anymore.  They are now 8 and 6.  I have a friend<br/>\nwho claims her kids would do nothing but watch tv all the time if she let<br/>\nthem.  I know you might think that is because she does restrict it, but I<br/>\nrestricted my kids tv viewing for many years and they still don&#39;t like it<br/>\nthat much.  So it seems to me that isn&#39;t just restriction vs. no restriction<br/>\nthat makes a kid want to watch more, but personalities of the kids come into<br/>\nplay there too.<br/>\n <br/>\nAngela in Maine<br/>\nmailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:unschooling@...\">unschooling@...</a><br/>\nMy Unschooling Page<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://userpages.prexar.com/rickshaw/\">http://userpages.prexar.com/rickshaw/</a><br/>\n<br/>\n&quot;What you are shouts so loudly in my ears I cannot hear what you say.&quot;<br/>\nEmerson<br/>\n<br/>\n<br/>\n <br/>\n <br/>\nPam wrote: <br/>\nI have found the opposite to be true well maybe not the exact opposite.Pam<br/>\nG.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi &lt;bunsofaluminum60@hotmail.com&gt;","from":"&quot;Heidi &lt;bunsofaluminum60@...&gt;&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"TV, was Re: Is Unschooling A Transformation?","postDate":"1044372163","msgId":57737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIxb2xzMytkaWJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNFM0ZDMjdBLjUwOTA2MDVAdm9sLmNvbT4="},"prevInTopic":57736,"nextInTopic":57740,"prevInTime":57736,"nextInTime":57738,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"We own a TV, but it is only for movies. We live in the middle of nowhere, and can only get the NBC channel IF the TV is upstairs. We brought it up last year","messageBody":"<div id=\"ygrps-yiv-544069295\">We own a TV, but it is only for movies. We live in the middle of <br/>\nnowhere, and can only get the NBC channel IF the TV is upstairs. We <br/>\nbrought it up last year for the Olympics...I&#39;m from SLC and simply <br/>\nHAD to watch. That was when I watched my first and only episode <br/>\nof &quot;Who Wants to Be a Millionaire&quot; and that hilarious ad lib/ <br/>\nimpromptu program. Otherwise the TV lives in the basement where ZERO <br/>\nlocal stations come through.<br/>\n<br/>\nAnyway. In discussing how unschooling is going to manifest itself in <br/>\nour home, the TV has come up often. I think the mind flourishes best <br/>\nwhen it is in contact with real stuff: building a treehouse, <br/>\nwrassling with your sister on the floor, reading Tom Swift, etc. so <br/>\nwe&#39;ve thought about putting a limit on the amount of time in front of <br/>\nthe TV. Hubby and I are already self-limited. It isn&#39;t ever on just <br/>\nbecause. But in thinking it through, the only way to really do it <br/>\nwould be to put the TV away. Maybe not get rid of it entirely, but <br/>\nstick in an out of the way place and make a movie night a very <br/>\nspecial event. <br/>\n<br/>\nDunno. Just thinking out loud. Again.<br/>\n<br/>\nHeidi<br/>\n<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, Bill and Diane <br/>\n&lt;cen46624@v...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;Are there people on this list that DON&#39;T own t.v.&#39;s?  Just <br/>\n </span></blockquote>wondering.<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;<br/>\n&gt; Yes. We don&#39;t. When dh and I met, I owned 3 TVs, and none of them <br/>\n&gt; worked. He brought in a small B&W, because he couldn&#39;t imagine life <br/>\n&gt; without TV. A year and a half later, we sold that one and haven&#39;t <br/>\n </span></blockquote>had <br/>\n<blockquote><span title=\"qreply\"> &gt; one since. </span></blockquote></div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044371930","msgId":57736,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkYS4xOThjNTdiLjJiNzEzM2RhQGFvbC5jb20+"},"prevInTopic":57727,"nextInTopic":57737,"prevInTime":57735,"nextInTime":57737,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/4/03 8:49:01 AM Eastern Standard Time, cen46624@vol.com ... I have found the opposite to be true well maybe not the exact opposite.  We ","messageBody":"<div id=\"ygrps-yiv-261286397\">In a message dated 2/4/03 8:49:01 AM Eastern Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cen46624@...\">cen46624@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When we&#39;re at friends&#39; houses and all the kids watch TV, my two just <br/>\n&gt; don&#39;t gravitate toward it. The other kids will all be yelling at them to <br/>\n&gt; &quot;come watch the movie!&quot; but they&#39;re just not interested. In motel rooms <br/>\n&gt; they love to play with the remote, but not really watch. I&#39;ll usually <br/>\n&gt; turn on the weather channel at some point, and that gets them started <br/>\n&gt; with it.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I have found the opposite to be true well maybe not the exact opposite.  We <br/>\nhave many TVs.  And watch them off and on.  But when we go to a hotel or when <br/>\npeople come over my boys want to play.  They don&#39;t want to watch TV.  Maybe <br/>\nbecause they can do that anytime.  So my boys are kind of the same as yours <br/>\nbut we do watch TV.  And when kids come over that are TV restricted at home <br/>\nall they want to do is watch TV or play the computer.  They aren&#39;t able to <br/>\nwatch TV or play whatever computer game they like at home.  So they are glued <br/>\nto them at our house.  My boys are always complaining about that.  The kids <br/>\ncome over to play and they won&#39;t play.<br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] TV, was Re: Is Unschooling A Transformation?","postDate":"1044365946","msgId":57727,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFM0ZDMjdBLjUwOTA2MDVAdm9sLmNvbT4=","referencesHeader":"PGIxZTRmNSs0bnRuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":57736,"prevInTime":57726,"nextInTime":57728,"topicId":57727,"numMessagesInTopic":0,"msgSnippet":"... Yes. We don t. When dh and I met, I owned 3 TVs, and none of them worked. He brought in a small B&W, because he couldn t imagine life without TV. A year","messageBody":"<div id=\"ygrps-yiv-751380196\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt;Are there people on this list that DON&#39;T own t.v.&#39;s?  Just wondering.<br/>\n&gt;<br/>\n </span></blockquote>Yes. We don&#39;t. When dh and I met, I owned 3 TVs, and none of them <br/>\nworked. He brought in a small B&W, because he couldn&#39;t imagine life <br/>\nwithout TV. A year and a half later, we sold that one and haven&#39;t had <br/>\none since. That was several years before we had kids, though.<br/>\n<br/>\nI figure at some point we&#39;ll probably get one, but no one seems that <br/>\ninterested right now. We&#39;ll need it for the game systems, right? I just <br/>\ndon&#39;t like it. I don&#39;t like noise, the pace of most programs seems <br/>\nboggling to me, but most of all, I can&#39;t have it on in the background. <br/>\nIf it&#39;s ON I&#39;m WATCHING it, and I don&#39;t like that. Maybe we could use <br/>\nthe basement idea.<br/>\n<br/>\nWhen we&#39;re at friends&#39; houses and all the kids watch TV, my two just <br/>\ndon&#39;t gravitate toward it. The other kids will all be yelling at them to <br/>\n&quot;come watch the movie!&quot; but they&#39;re just not interested. In motel rooms <br/>\nthey love to play with the remote, but not really watch. I&#39;ll usually <br/>\nturn on the weather channel at some point, and that gets them started <br/>\nwith it.<br/>\n<br/>\nThe thing I *most* disagree with, though, is the families who have TV, <br/>\nbut don&#39;t think the kids should watch it. Then they set the kids&#39; <br/>\nbedtimes so they can watch their own shows. Do as I say, not as I do.<br/>\n<br/>\n:-) Diane</div>","specialLinks":[]}],"prevTopicId":58244,"nextTopicId":57959}}