{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Question for Oldtimers -I can do guns, it&#39;s the gore","postDate":"1070760174","msgId":85768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE1LjQzMGFhMjMxLjJkMDNkYWVlQGFvbC5jb20+"},"prevInTopic":85765,"nextInTopic":0,"prevInTime":85767,"nextInTime":85769,"topicId":85741,"numMessagesInTopic":0,"msgSnippet":"In a message dated 12/6/03 9:07:45 AM, jrossedd@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-487291448\">In a message dated 12/6/03 9:07:45 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jrossedd@...\">jrossedd@...</a> writes:<br/>\n<br/>\n&lt;&lt;    Please refer me to threads in the archives or to other links if you&#39;d <br/>\nrather not explain onlist, but I am genuinely curious to know more about why <br/>\nit appears (at least to me, for the moment) that there&#39;s a pro-gun <br/>\norientation <br/>\namong experienced unschoolers. I  never expected this topic to come up in <br/>\nrelation to unschooling, and if I had expected it, I&#39;d likely have predicted <br/>\nthe <br/>\nopposite leaning -- JJ<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m reading my e-mail backwards.  Sorry.<br/>\n<br/>\nIt&#39;s not pro-gun, it&#39;s anti-controlling.<br/>\n<br/>\nToy guns or video games, like television, food, bedtime, reading, clothes, <br/>\netc., all involve issues of learning, experimentation, thought, sharing, <br/>\nindividual preference, and the same arguments against requiring or restricting or <br/>\nmom-chosen limits apply to guns as to so many other things.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Question for Oldtimers -I can do guns, it&#39;s the gore","postDate":"1070758675","msgId":85765,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFlLjRjOTQ5MzZlLjJkMDNkNTEzQGFvbC5jb20+"},"prevInTopic":85750,"nextInTopic":85768,"prevInTime":85764,"nextInTime":85766,"topicId":85741,"numMessagesInTopic":0,"msgSnippet":"Deb L s response was wonderful.  Some of my favorite parts: ","messageBody":"<div id=\"ygrps-yiv-1170470210\">Deb L&#39;s response was wonderful.  Some of my favorite parts:<br/>\n<br/>\n&lt;&lt;I wouldn&#39;t call myself pro gun any more than I would call myself pro<br/>\npointy stick.&lt;g&gt; &gt;&gt;<br/>\n&lt;&lt; So, no, I&#39;m not pro gun.  I&#39;m pro kid. &gt;&gt;<br/>\n<br/>\nI&#39;m not &quot;pro gun.&quot;  I&#39;m anti-&quot;anti-gun,&quot; because &quot;anti-gun&quot; not only doesn&#39;t <br/>\nserve its intended purpose, it causes damage in the relationship and IF a <br/>\nchild gets a gun-fascination and is deprived of even playing with toy guns, he&#39;s <br/>\ngoing to be a more dangerous teen/adult than one in whose lives guns were <br/>\ntreated like what they are instead of a demonized representation of all evil <br/>\nviolence.   Chain saws are dangerous, but I don&#39;t know any mothers going on <br/>\nanti-chain-saw rants.   Electric drills are dangerous.  Nail guns are dangerous.   <br/>\n(Even without exposure to the movies Texas Chainsaw Massacre, Pi and Color of <br/>\nNight, respectively.)<br/>\n<br/>\nBelieving that gun-banishment is wrong is not the same as feeling guns should <br/>\nbe issued to all children and they should be put on a gun-use regimen.<br/>\n<br/>\nThis swinging from one extreme to another isn&#39;t good for thinking and it&#39;s <br/>\nnot good for discussion and it&#39;s REALLY bad for unschooling.<br/>\n<br/>\nHere&#39;s what I think I thought about that a couple of months ago:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/206/ndunschool.html\">http://www.home-ed-magazine.com/HEM/206/ndunschool.html</a><br/>\n<br/>\n(Balancing in the Middle Ground)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":141102765,"authorName":"Mary","from":"&quot;Mary&quot; &lt;mummy124@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Question for Oldtimers -I can do guns, it&#39;s the gore","postDate":"1070734118","msgId":85750,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTgwMWMzYmMyMyRmOTQ3OTBjMCQ2MTAxYThjMEBsYXVuY2htb2RlbS5jb20+","referencesHeader":"PGJjLjQxMzNkMmVkLjJkMDM1ODRlQGFvbC5jb20+"},"prevInTopic":85747,"nextInTopic":85765,"prevInTime":85749,"nextInTime":85751,"topicId":85741,"numMessagesInTopic":0,"msgSnippet":"Just wanted to comment on this one. I wouldn t say we are pro gun here at home. We don t own any guns, never have and no one here has ever fired one. When","messageBody":"<div id=\"ygrps-yiv-1452990891\">Just wanted to comment on this one. I wouldn&#39;t say we are pro gun here at<br/>\nhome. We don&#39;t own any guns, never have and no one here has ever fired one.<br/>\n<br/>\nWhen Joseph (almost 9 now) was little, I was not wanting him to play with<br/>\nguns. Just didn&#39;t think it was a good idea. Not really sure why but I think<br/>\nin part it was because I didn&#39;t want a violent little child who ran around<br/>\nand pretended to shoot people. (like I had seen other children do at the<br/>\npark) So my idea to just never have anyone buy him toy guns was put in<br/>\neffect. I also must add that he never asked for any toy guns either.<br/>\n<br/>\nWell eventually he would build guns out of Legos and plastic whatevers he<br/>\nwould find. When I would ask him about the &quot;guns&quot; he would explain that they<br/>\nwere tranquilizer guns and he was hunting dinosaurs. (He saw Jurassic Park<br/>\nand that&#39;s where that all started) Starship Troopers was one of this<br/>\nfavorite movies also and well, you *need* guns to shoot the bad bugs! By<br/>\nthen I changed my thinking about guns, (along with watching wrestling on TV<br/>\n&lt;BG&gt;) and they both had squirt guns and laser noisy guns to play with. There<br/>\nwas never any desire for other real looking kinds and the play was still<br/>\nalways shooting &quot;bad&quot; stuff. When Joseph decided to be an army guy for<br/>\nHalloween because he liked the outfit, he wanted a machine gun to go alone.<br/>\nHe never played with, just carried it along on Halloween and put it away. I<br/>\nthink Alyssa broke it and no one missed it. He also has play knives from his<br/>\nninja costumes too.<br/>\n<br/>\nThe kids play wrestling games on playstation and Joseph likes army shooting<br/>\ngames and sniper type video games too. He&#39;s really pretty good at them and<br/>\neven finished one game all the way through long before Joe was ever able to<br/>\nget that far. Sierra loves wrestling and gets a kick out of smashing people<br/>\nall over the place.<br/>\n<br/>\nThey know they are games and they know they aren&#39;t hurting real people or<br/>\nanimals or whatever. All my kids are gentle when it comes to other living<br/>\nthings. Joseph has gotten himself in the middle of a few squabbles with<br/>\nother kids only because he tries to be the peacemaker. Sometimes the kids<br/>\ndon&#39;t want someone to stop them. He can&#39;t understand why people would want<br/>\nto fight.<br/>\n<br/>\nSo no matter how many studies come out saying violent video games create<br/>\nviolent kids, ( and another just recently did come out saying that&#39;s a fact)<br/>\nI don&#39;t listen. I can&#39;t possibly see how all the nurturing, love and respect<br/>\nwe give our kids would not be more of an influence than a game.<br/>\n<br/>\nMary B.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolingtshirts.com\">http://www.homeschoolingtshirts.com</a></div>","specialLinks":[]},{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Question for Oldtimers -I can do guns, it&#39;s the gore","postDate":"1070732606","msgId":85747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMjA2LjEwNDMyNy4xNzU2LjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":85741,"nextInTopic":85750,"prevInTime":85746,"nextInTime":85748,"topicId":85741,"numMessagesInTopic":0,"msgSnippet":"***but I am genuinely curious to know more about why it appears (at least to me, for the moment) that there s a pro-gun orientation among experienced","messageBody":"<div id=\"ygrps-yiv-1243806083\">***but I am genuinely curious to know more about why <br/>\nit appears (at least to me, for the moment) that there&#39;s a pro-gun<br/>\norientation <br/>\namong experienced unschoolers.***<br/>\n<br/>\nI wouldn&#39;t call myself pro gun any more than I would call myself pro<br/>\npointy stick.&lt;g&gt;  I don&#39;t own a gun and I&#39;ve never fired one.  My<br/>\nhusband, in a previous life, liked to shoot targets, but he hasn&#39;t in a<br/>\nfew years.   He was never a hunter. <br/>\n<br/>\nI think guns are tools.  They happen to be effective killing tools, but<br/>\nhumans are all about killing, and I&#39;m not surprised we develop better and<br/>\nbetter tools to help us do that.  I don&#39;t think it&#39;s the tool makes us<br/>\nkillers.  I think killers make their tools. <br/>\n<br/>\nWe evolved as hunters, defenders of self and territory.  I think those<br/>\nare part of our selves and to think we can ignore it or suppress it is<br/>\nnaive.   I&#39;m all for evolution, and I&#39;m idealistic enough to believe<br/>\nhumans will eventually be better able to control their violent natures.  <br/>\n<br/>\nFrom my vegan point of view it seems no more violent to me to own a gun,<br/>\nshoot targets or critters, play shooting games, than it does to buy<br/>\ncleanly packaged meat from a slaughter house or wear leather shoes or<br/>\nplay with a leather baseball glove or smear emu cream on our owies.  <br/>\n<br/>\nMaybe it&#39;s a matter of perspective.  Is my neighbor who hunts more<br/>\nviolent than my neighbor who lets someone else do her killing for her? <br/>\n<br/>\nAnd am I less violent when I drive my car forty miles to the vegie store<br/>\nall the while smashing a berzillion bugs on my windshield?   Dylan&#39;s<br/>\ngoing to invent pheromone mile markers that keep bugs from flying and<br/>\ncrawling over roads.&lt;g&gt;<br/>\n<br/>\nI have a really nice kid.  He doesn&#39;t eat meat because he loves animals<br/>\nand thinks they shouldn&#39;t have to die for his sake.  He loves bugs and<br/>\nall kinds of creeping things and happily carries flies and spiders out of<br/>\nour house.  He&#39;s kind and has never hurt anyone.  He likes to hit a<br/>\ntarget.  He likes Quake and Medal of Honor.  It won&#39;t hurt him because<br/>\nhis real life is full of respect and caring and decency.  <br/>\n<br/>\nI know parents who won&#39;t let their kids play violent video games but who<br/>\nstomp spiders and trap mice and chop heads of chickens by the back door. <br/>\n If we&#39;re going to get uptight about violence lets first start talking<br/>\nabout what is violent.  If we&#39;re so worried our kids won&#39;t have respect<br/>\nfor life, let&#39;s think about being respectful of life. <br/>\n<br/>\nI think we can gives games like that a lot of power they don&#39;t really<br/>\nhave.  They are not more powerful than loving parents, real compassion<br/>\nand kindness, or a life of goodness and joy.   <br/>\n<br/>\nNo one is harmed in a game.  None of it is real.  That steak on the<br/>\ndinner plate is real though and means someone really died.   No one will<br/>\never convince me the connection between kids and violence is video games<br/>\nor TV.<br/>\n<br/>\nSo, no, I&#39;m not pro gun.  I&#39;m pro kid.  I think my kid has more control<br/>\nover his mind and life than a gun or game has.&lt;g&gt; <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Question for Oldtimers -I can do guns, it&#39;s the gore","postDate":"1070726734","msgId":85741,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJjLjQxMzNkMmVkLjJkMDM1ODRlQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":85747,"prevInTime":85740,"nextInTime":85742,"topicId":85741,"numMessagesInTopic":0,"msgSnippet":"For the moderators and oldtimers here, from someone new: It s my impression that almost all the posts on this thread have been positive toward owning and using","messageBody":"<div id=\"ygrps-yiv-1934799200\">For the moderators and oldtimers here, from someone new:<br/>\n<br/>\n       It&#39;s my impression that almost all the posts on this thread have been <br/>\npositive toward owning and using guns, hunting, playing gory video games, et <br/>\ncetera, with no ill effects. The personal stories shared seem pretty positive <br/>\ntoward integrating guns with family life, society and entertainment.<br/>\n<br/>\n        Please refer me to threads in the archives or to other links if you&#39;d <br/>\nrather not explain onlist, but I am genuinely curious to know more about why <br/>\nit appears (at least to me, for the moment) that there&#39;s a pro-gun orientation <br/>\namong experienced unschoolers. I  never expected this topic to come up in <br/>\nrelation to unschooling, and if I had expected it, I&#39;d likely have predicted the <br/>\nopposite leaning -- JJ</div>","specialLinks":[]}],"prevTopicId":7932,"nextTopicId":85751}}