{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":126919745,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] school spankings?","postDate":"1047610002","msgId":61038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwNDUwOEE2LTU1QzctMTFENy1BNzRELTAwMDM5M0FGNUEyRUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDEyNy4yNGEwNDcxZi4yYmEwOTAxZkBjcy5jb20+"},"prevInTopic":60854,"nextInTopic":0,"prevInTime":61037,"nextInTime":61039,"topicId":60844,"numMessagesInTopic":0,"msgSnippet":"Oh my goodness. Blaming hitting kids instead of suspending them -  on standardized testing. Yet another lovely side-effect of standardized testing! -pam","messageBody":"<div id=\"ygrps-yiv-297240859\">Oh my goodness. Blaming hitting kids instead of suspending them -  on <br/>\nstandardized testing. Yet another lovely side-effect of standardized <br/>\ntesting!<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wednesday, March 12, 2003, at 05:29 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a> wrote:<br/>\n<br/>\n&gt; In Hendry County, a district that ranks second in the state for <br/>\n&gt; spankings,<br/>\n&gt; veteran educator Rick Shearer said he might suspend more students if it<br/>\n&gt; weren&#39;t for the Florida Comprehensive Assessment Test. After a few <br/>\n&gt; swats,<br/>\n&gt; children can return to class.<br/>\n&gt;<br/>\n&gt; &quot;We&#39;re under pressure for the kids to pass the FCAT and to do the best <br/>\n&gt; we can<br/>\n&gt; with these kids,&quot; said Shearer, principal of Westside Elementary <br/>\n&gt; School in<br/>\n&gt; Clewiston, south of Lake Okeechobee. &quot;If they&#39;re not in school, it&#39;s <br/>\n&gt; hard.&quot; </span></blockquote></div>","specialLinks":[]},{"userId":48651385,"authorName":"athom","from":"&quot;athom&quot; &lt;tessimal@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: school spankings?","postDate":"1047482308","msgId":60854,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI0bmo0NCtsN2tkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEyNy4yNGEwNDcxZi4yYmEwOTAxZkBjcy5jb20+"},"prevInTopic":60844,"nextInTopic":61038,"prevInTime":60853,"nextInTime":60855,"topicId":60844,"numMessagesInTopic":0,"msgSnippet":"... WARNING:  The following post is deeply disturbing to non-violent, non-punishment oriented parents. Unschoolers beware! Do not read if violence towards","messageBody":"<div id=\"ygrps-yiv-1244404649\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, starsuncloud@c... wrote:<br/>\n&lt;&gt;WARNING:  The following post is deeply disturbing to non-violent, <br/>\nnon-punishment oriented parents. Unschoolers beware! Do not read if <br/>\nviolence towards children will ruin your day. Seriously.  I can&#39;t <br/>\neven believe this stuff still goes on in our schools. THIS will help <br/>\nsome people understand why I think  things are different in the <br/>\nSouth. Ugh.&lt;&gt;<br/>\n<br/>\nIf you really want to put yourself into total shock about what is <br/>\nactually going on in the schools go get a job as a substitute <br/>\nteacher, especially in an urban school system.  I have written <br/>\nvolumes from my &quot;in the trenches&quot; experience as a sub.  It is so much <br/>\nworse than most can imagine.  So if you live in an urban area and can <br/>\nqualify for a sub license or certificate then try it, just for a <br/>\nlittle while, and you will quickly know why we homeschool and why we <br/>\nunschool.  So much psychological brutality out there that it amazes <br/>\nme.  And the folks doing it really believe they are helping the <br/>\nchildren.  I even run into parents who still say to me that if the <br/>\nschools would just reinstate the paddle that things would be much <br/>\nbetter!  I take the time to talk to them, to try to get them to <br/>\nunderstand a different point of view.  Sometimes I think a little bit <br/>\ngets through.  Most of the time, not.  <br/>\n<br/>\nAnd I don&#39;t live in Florida, or the south, but in the heart of the <br/>\nmidwest, in Ohio.  Some days it is just too much and I can&#39;t sub <br/>\nagain for a long time.  Right now I am about to do some other <br/>\ncontract work, which will give me another bit to write about, <br/>\ncorrecting state proficiency exams from different states.  That will <br/>\nkeep me out of the schools for the rest of this school year, but I am <br/>\nsure I will have an even more interesting subject to report after six <br/>\nmonths of learning all about these tests and how they are graded.  <br/>\n<br/>\nIf you&#39;re not up to subjecting yourself to being in the schools just <br/>\nrest assured that paddling is not the worst of what is going on in <br/>\nmany of them.  <br/>\n<br/>\nNorma<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/SosinkyHS\">http://groups.yahoo.com/group/SosinkyHS</a> </span></blockquote></div>","specialLinks":[]},{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"school spankings?","postDate":"1047475743","msgId":60844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNy4yNGEwNDcxZi4yYmEwOTAxZkBjcy5jb20+"},"prevInTopic":0,"nextInTopic":60854,"prevInTime":60843,"nextInTime":60845,"topicId":60844,"numMessagesInTopic":0,"msgSnippet":"WARNING: The following post is deeply disturbing to non-violent, non-punishment oriented parents. Unschoolers beware! Do not read if violence towards children","messageBody":"<div id=\"ygrps-yiv-804574612\">WARNING:<br/>\nThe following post is deeply disturbing to non-violent, non-punishment <br/>\noriented parents. Unschoolers beware! Do not read if violence towards <br/>\nchildren will ruin your day. Seriously.  I can&#39;t even believe this stuff <br/>\nstill goes on in our schools. THIS will help some people understand why I <br/>\nthink  things are different in the South. Ugh.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nFewer students feeling the sting<br/>\n<br/>\nBy Denise-Marie Balona | Sentinel Staff Writer <br/>\nPosted March 11, 2003 <br/>\n <br/>\nTALLAHASSEE -- Two-thirds of Florida school districts still spank students, <br/>\nalthough the latest state numbers show that suspensions are increasingly the <br/>\npreferred mode of discipline.<br/>\n<br/>\nAbout 11,000 Florida students felt the paddle during the last school year, <br/>\naccording to the Florida Department of Education, most of them in small, <br/>\nrural counties. Larger, urban counties are spanking fewer children, opting <br/>\ninstead to send them home or sentence them to programs that include <br/>\n&quot;in-school&quot; suspension, where the students are segregated from their <br/>\nclassmates.<br/>\n<br/>\nIn Hendry County, a district that ranks second in the state for spankings, <br/>\nveteran educator Rick Shearer said he might suspend more students if it <br/>\nweren&#39;t for the Florida Comprehensive Assessment Test. After a few swats, <br/>\nchildren can return to class.<br/>\n<br/>\n&quot;We&#39;re under pressure for the kids to pass the FCAT and to do the best we can <br/>\nwith these kids,&quot; said Shearer, principal of Westside Elementary School in <br/>\nClewiston, south of Lake Okeechobee. &quot;If they&#39;re not in school, it&#39;s hard.&quot;<br/>\n<br/>\nHendry County is one of 10 mostly tiny districts that in 2001-02 accounted <br/>\nfor the majority of school spankings, about 6,500. Parts of the Panhandle, <br/>\nNorth Florida and Hendry saw a rise in corporal punishment, while much of the <br/>\nrest of the state saw a drop.<br/>\n<br/>\nMany Florida school administrators haven&#39;t lifted a paddle in years, part of <br/>\na national trend toward banning the controversial practice altogether.<br/>\n<br/>\nAdministrators at Narcoossee Community School in Osceola County don&#39;t spank, <br/>\neven if parents request it.<br/>\n<br/>\n&quot;I&#39;ve had a parent pleading if you&#39;ll just do it [spank], he&#39;ll straighten <br/>\nup,&quot; said Principal Jim DiGiacomo, adding that in-school suspension works <br/>\nwell to curb discipline problems for his students because they hate the <br/>\nisolation. &quot;You can impose the consequences and you can control what&#39;s going <br/>\non because they are with you.&quot;<br/>\n<br/>\nSchools turned to corporal punishment 10,685 times in the 2001-02 academic <br/>\nyear, state records show. That&#39;s a tremendous drop from the 124,295 paddlings <br/>\nissued in 1985-86.<br/>\n<br/>\nThe small, rural districts issued the most spankings. Florida&#39;s 10 smallest <br/>\ndistricts, with less than 1 percent of all students, accounted for 10 percent <br/>\nof spankings. In contrast, the 10 largest districts, with 63 percent of the <br/>\nstate&#39;s total enrollment, accounted for 8 percent of spankings.<br/>\n<br/>\nMore than 240 spankings were reported in four Central Florida counties -- <br/>\nOrange, Osceola, Polk and Lake. However, Dianne Lovett, a district <br/>\nadministrator in Orange, said the five incidents reported there appear to be <br/>\nclerical mistakes. Orange banned corporal punishment in 1993, Lovett said.<br/>\n<br/>\nThe American Academy of Pediatrics, National Association of Elementary School <br/>\nPrincipals and other child-advocacy groups oppose corporal punishment, citing <br/>\nresearch through the years linking childhood paddlings to depression, <br/>\ndelinquency and lower rates of college graduation.<br/>\n<br/>\nA new study by a longtime family violence researcher suggests that spanked <br/>\nchildren don&#39;t read or do math as well as their peers.<br/>\n<br/>\n&#39;An extension of the parent&#39;<br/>\n<br/>\nFlorida lawmakers let school districts decide what&#39;s best, however. About a <br/>\nthird of the 67 counties have stopped the practice under pressure from <br/>\nparents and children&#39;s advocates, or because they feared lawsuits or <br/>\ncomplaints to police.<br/>\n<br/>\nMike Elmer, whose son, Nick, is a second-grader in DeLand, is glad Volusia <br/>\nCounty schools no longer paddle. Elmer doesn&#39;t spank his child.<br/>\n<br/>\n&quot;The way I look at it, the school is an extension of the parent and if the <br/>\nparent doesn&#39;t do it, why should the school?&quot; Elmer said.<br/>\n<br/>\nVolusia parent Cheryl Fitzpatrick disagrees. She thinks parents should be <br/>\nable to request spankings because the threat of being sent home may not carry <br/>\nmuch weight.<br/>\n<br/>\n&quot;I think you telling them &#39;You&#39;re going to get suspended&#39; probably just makes <br/>\nthem happy,&quot; she said.<br/>\n<br/>\nIn Polk County, where administrators paddle the most of any Central Florida <br/>\nschool system, only some elementary schools still do it. Now, schools mostly <br/>\nsuspend students, said Deputy Superintendent Rusty Payne.<br/>\n<br/>\n&quot;There&#39;s a lot of things we suspend for now that I probably would have given <br/>\nkids three licks for,&quot; said Payne, a former high school principal of 16 years.<br/>\n<br/>\nIn this regard, Polk is much like the rest of Florida. Suspensions reported <br/>\nstatewide during the last school year totaled 480,655, more than double the <br/>\n202,262 for 1985-86.<br/>\n<br/>\nChanging behavior<br/>\n<br/>\nEducators concede that spanking is not always effective, but the same goes <br/>\nfor suspensions. Instead of going home to study or contemplate poor behavior, <br/>\nmany children end up playing video games and watching television.<br/>\n<br/>\nIn-school suspensions don&#39;t provide the same opportunities for classroom <br/>\ndiscussion and projects, which educators say are key to learning.<br/>\n<br/>\nCitrus County officials, who rarely spanked children last year, sometimes <br/>\nrely on an alternative center as a way to discipline. Children who repeatedly <br/>\nmisbehave or commit serious offenses are transferred to the Renaissance <br/>\nCenter, where they can get more academic attention and counseling.<br/>\n<br/>\n&quot;The purpose of a discipline system is to change behaviors so learning takes <br/>\nplace,&quot; said Renna Jablonskis, the Citrus schools&#39; director of student <br/>\nservices. &quot;Spanking is quick to take effect but it doesn&#39;t have a long-term <br/>\nimpact.&quot;<br/>\n<br/>\nSmall districts often don&#39;t have the cash to build and staff alternative <br/>\ncenters, though. Neither can they always afford after-school detention <br/>\nprograms and in-school suspension programs, administrators said.<br/>\n<br/>\nShearer&#39;s school in Hendry County was able to offer in-school suspension this <br/>\nyear because one employee is used for several tasks, including making copies <br/>\nand monitoring students.<br/>\n<br/>\nA new attitude<br/>\n<br/>\nFlorida is not the only state where paddling in school is out of favor. About <br/>\n27 states have banned it outright, as have about 10 countries, including <br/>\nGermany, Sweden and Denmark.<br/>\n<br/>\nMuch of the change in attitude stems from research suggesting that paddling <br/>\nis particularly harmful to elementary-school children, who also are the most <br/>\nlikely to be spanked. A new study contends that such punishment may be <br/>\ncounterproductive for school officials trying to focus children on their <br/>\nstudies.<br/>\n<br/>\nMurray A. Straus, who co-directs the Family Research Laboratory at the <br/>\nUniversity of New Hampshire, tested 622 children ages 5 and 6 across the <br/>\ncountry. Those who were spanked by parents scored lower on a standardized <br/>\nexam when tested again two years later, he said.<br/>\n<br/>\nStraus speculates that learning slows because spankings can cause stress on <br/>\nchildren&#39;s developing brains. He hopes the American public, now obsessed with <br/>\nstandardized test scores, takes his study seriously.<br/>\n<br/>\n&quot;People do say, &#39;I was spanked and I&#39;m OK&#39; and they&#39;re not lying,&quot; Straus <br/>\nsaid. &quot;But it&#39;s like smokers saying, &#39;I smoked all my life and I don&#39;t have <br/>\nlung cancer.&#39; It ignores the fact there are lots of people who do.&quot;<br/>\n<br/>\nState Rep. Frank Attkisson, R-Kissimmee, argues that school boards should be <br/>\nable to choose for themselves how to handle behavior problems. One disruptive <br/>\nchild, he said, can hinder an entire class&#39;s learning.<br/>\n<br/>\n&quot;We have to balance his [Straus&#39;] concern with the overriding concern that <br/>\nevery child gets a year&#39;s worth of education with a year&#39;s worth of dollars <br/>\nspent,&quot; said Attkisson, who said he was spanked at home and in junior high. <br/>\nHe also spanked his three kids.<br/>\n<br/>\n&quot;You have to give tools to school boards and let them be the deciders of <br/>\nwhat&#39;s right for the students.&quot;<br/>\n<br/>\nPrevention is key<br/>\n<br/>\nIrwin Hyman, a child-discipline expert who heads the National Center for the <br/>\nStudy of Corporal Punishment and Alternatives in Philadelphia, said the <br/>\nanswer to handling behavior problems lies in prevention.<br/>\n<br/>\nSchools can use praise and rewards to encourage students to concentrate on <br/>\nassignments and behave well. They also can try to figure out why a child is <br/>\nacting out -- and help alleviate the problem.<br/>\n<br/>\n&quot;When you go to the doctor, they want to diagnose before they prescribe you <br/>\nanything,&quot; Hyman said. School districts that spank &quot;are giving the medicine <br/>\nbefore diagnosing what the problem is.&quot;<br/>\n<br/>\nHendry County principal Shearer said some answers to school discipline <br/>\nproblems may lie within families.<br/>\n<br/>\n&quot;The kids behave at school pretty much the way they&#39;ve been allowed to behave <br/>\nat home,&quot; he said. &quot;The bottom line is we have to have law and order in the <br/>\nschool so teachers can teach and students can learn.&quot;<br/>\n<br/>\nDenise-Marie Balona can be reached at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dbalona@...\">dbalona@...</a> or <br/>\n386-851-7923.<br/>\n<br/>\n<br/>\nRen<br/>\n&quot;The sun is shining--the sun is shining.  That is the magic.  The flowers are <br/>\ngrowing--the roots are stirring.  That is the magic.  Being alive is the <br/>\nmagic--being strong is the magic  The magic is in me--the magic is in <br/>\nme....It&#39;s in every one of us.&quot;<br/>\n<br/>\n                                    ----Frances Hodgson Burnett</div>","specialLinks":[]}],"prevTopicId":61014,"nextTopicId":60728}}