{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Different styles for diff kids?","postDate":"1298967268","msgId":60118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlraTl0NCtrMXF1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEY2QjVEMjI0LUIwNzEtNDVCRS05NkRCLTlGQzU4MjM0Q0ZFNUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":60115,"nextInTopic":0,"prevInTime":60117,"nextInTime":60119,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"===Unschoolers (of the sort of unschooling discussed on this list) can forget how different their lives would have been had their children gone to school.=== ","messageBody":"<div id=\"ygrps-yiv-355253522\">===Unschoolers (of the sort of unschooling discussed on this list) can forget how different their lives would have been had their children gone to school.===<br/>\n<br/>\nMy stepson attended public school through 12th grade, other than a six-month period when he lived with us and we homeschooled (he was 13; our youngest son was 2). <br/>\n<br/>\nHis experiences with public school were very front-and-center in our lives from grade school until graduation and were a huge catalyst in our decision to homeschool (and later, unschool) our youngest son. <br/>\n<br/>\n<br/>\n===Unschooling doesn&#39;t even always transform the relationships within a family, when the kids are older.===<br/>\n<br/>\nBut aspects of unschooling can be brought into the relationships with the older kids who are attending school. There&#39;s no way to know if or how those relationships can be transformed if the effort isn&#39;t made.<br/>\n<br/>\nAs we moved into unschooling with our youngest son, we applied aspects of unschooling to our relationship with my stepson. It certainly wasn&#39;t the same kind of result that I imagine we&#39;d have had if he&#39;d been unschooled, but he was aware of the changes, we talked about the changes, and they did have a positive impact on his relationship with both my husband and me (which was very important through some turbulent times in my stepson&#39;s late teens / early 20&#39;s). <br/>\n<br/>\n<br/>\n===It&#39;s a very common sort of &quot;relaxed homeschooling&quot; concept, unit studies. And if a family has always done unit studies, the child WOULD certainly ask for them, or think he wasn&#39;t learning.===<br/>\n<br/>\nI think it depends on the child. We did a very loose form of unit studies when my stepson was living with us, and he&#39;d done more structured unit studies in school up until that point, but when I could tell he wasn&#39;t enjoying the unit studies we dropped them and he didn&#39;t ask for them. <br/>\n<br/>\nThat&#39;s why I was questioning the original poster&#39;s use of &quot;we&quot; re: unit studies. Did the &quot;we&quot; in &quot;we like unit studies&quot; truly include her son, or would he be happy to never do a unit study again? I do think it&#39;s very possible for a child to not be interested in doing unit studies again if their parents never encouraged / suggested doing them again!<br/>\n<br/>\n<br/>\n===Glenda said: If you have concerns the older kids might resent their younger brother, are you *sure* they&#39;re &quot;thriving&quot; in public school?<br/>\n<br/>\nSandra said: I don&#39;t see that this follows at all===<br/>\n<br/>\nTo me, growing and flourishing in school (&quot;thriving&quot;) happens when a child enjoys being there -- it&#39;s an interesting and happy place for them. If they&#39;re happy there, thriving there, a sibling not being in school, not having that experience, isn&#39;t cause for resentment. That&#39;s how my brain got to, &quot;if you have concerns the older kids might resent their younger brother, are you sure they&#39;re thriving in public school?&quot;.<br/>\n<br/>\nBUT, I do understand what you (Sandra) are talking about in the following:<br/>\n<br/>\n===Thriving in school could make it MORE irritating.   If they love school it could be for lots of good reasons.  And they might love school.  If that involves doing and being the way their parents told them was good, then they could easily resent the parents taking back the reward-based behavior before they finish the project.  If the love of school involves loyalty to the entity, environment and other students, and they don&#39;t feel their mom is a strong partner, then the loss of even more of her time and attention would definitely be an irritant.===<br/>\n<br/>\nThat&#39;s not an aspect I had thought of.<br/>\n<br/>\n<br/>\n===I have vivid emotional memories of my childhood. &lt;snip&gt; Some parents might not have those kinds of memories.  When that&#39;s the case, it might be better for them to hold off on some sorts of advice or analysis of what families and teens and kids might/should feel.===<br/>\n<br/>\nI, too, have vivid emotional memories of my childhood, of resentments I felt towards my younger brothers, and towards my parents, because of choices my parents made. <br/>\n<br/>\nAnd, since becoming a mom myself, I&#39;ve kept those resentments in mind in my interactions with my stepson, and I&#39;ve been a better stepmom because of that.<br/>\n<br/>\n<br/>\nI understand now that my first reply to the original post was too harsh, and for that I apologize (and I apologized off-list to the original poster, because she&#39;d left the list before I drafted this post). I appreciate Sandra teasing out some parts of my reply, because that helped me be more thoughtful about both the original post and my first reply.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Different styles for diff kids?","postDate":"1298926623","msgId":60115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5MzI2My44ODE5My5xbUB3ZWIxMTA0MTQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGlrZjM2ZitqMnBsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrZjM2ZitqMnBsQGVHcm91cHMuY29tPg=="},"prevInTopic":60108,"nextInTopic":60118,"prevInTime":60114,"nextInTime":60116,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"***Here is my rub - it seems like I am two different parents and I m not sure if that is ok or not in the long run. I don t want my big kids to resent their ","messageBody":"<div id=\"ygrps-yiv-1165922843\">***Here is my rub - it seems like I am two different parents and I&#39;m not sure if <br/>\nthat is ok or not in the long run. I don&#39;t want my big kids to resent their <br/>\nyounger brother because he has &quot;different rules.&quot; I am sure logically they get <br/>\nwhy I do this with him, but they are teens and aren&#39;t always so <br/>\nunderstanding.***<br/>\n<br/>\nPerhaps it might help to think about it in terms of, sometimes other members in <br/>\nthe family aren&#39;t understanding.  It&#39;s possible the youngest doesn&#39;t entirely <br/>\nunderstand his older siblings and it&#39;s possible that they don&#39;t understand him <br/>\neither, with or without school in the mix.  The school aspect is just one way in <br/>\nwhich they are different with different experiences that they will view the <br/>\nworld.<br/>\n<br/>\nYesterday, my youngest, 9, wanted to have a conversation with my oldest, 16, <br/>\nabout something very specific.  I had been kind of putting it off because my <br/>\nyoungest wasn&#39;t in the best mood and my oldest wasn&#39;t either.  She insisted, so <br/>\nI tried to navigate the conversation.  Neither one of them were being <br/>\nunderstanding of each other and the least understanding one was my oldest.<br/>\n<br/>\nWe took a break.  I went and built a fort with my younger daughter, put on some <br/>\nhappy comedy with the aim to get in a better mood and mental place.  I left my <br/>\nolder daughter with the idea that it would need to be discussed eventually <br/>\nbecause the problem wasn&#39;t going to go away just because she was wishing it <br/>\nwould, that there was surely a solution to the problem being presented that <br/>\neveryone could find peace with.  I hugged her and then left to go build the <br/>\nfort.<br/>\n<br/>\nWe did find a solution after everyone was calm, BUT the initial reaction was not <br/>\none of understanding and my kids are VERY good at being understanding, <br/>\nespecially my oldest who IS a teenager.<br/>\n<br/>\nPerhaps it would be best to see that there is a problem, being that the kids may <br/>\nfeel that they are being treated differently, perhaps unfairly and that <br/>\nresentment will build up.  The best way that I know how to handle that is to <br/>\nfind a solution.  If the assumption is that the kids want to each be treated <br/>\nfairly and not feel resentment, then there will be things that work toward that <br/>\nsolution and things that work away from that.  <br/>\n<br/>\nSince 2 kids are in school, I&#39;d say that the mom is the one who needs to find <br/>\nways to navigate this, perhaps with input from her kids, but the onus is <br/>\ndefinitely on mom.  It would help to know whether or not the kids in school are <br/>\nthere by choice or not.  That makes a BIG difference. <br/>\n<br/>\n <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185743801,"authorName":"jennifer in IL","from":"&quot;jennifer in IL&quot; &lt;jennifer@...&gt;","profile":"jenniferinil","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Different styles for diff kids?","postDate":"1298907303","msgId":60108,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrZ2ZiNytkMTVtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlrZmo4NStsMmYyQGVHcm91cHMuY29tPg=="},"prevInTopic":60104,"nextInTopic":60115,"prevInTime":60107,"nextInTime":60109,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"Thanks all for your responses.  I do believe I may not be on the best list for me at the moment. Sorry to have stirred the pot with my question.","messageBody":"<div id=\"ygrps-yiv-958222880\">Thanks all for your responses.  I do believe I may not be on the best list for me at the moment. Sorry to have stirred the pot with my question.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;wtexans&quot; &lt;wtexans@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ===they are teens and aren&#39;t always so understanding===<br/>\n&gt; <br/>\n&gt; That&#39;s a derogatory remark. You&#39;re saying *because* they&#39;re teens, they&#39;re not always so understanding. <br/>\n&gt; <br/>\n&gt; Regardless of age, if they&#39;re being parented differently than their youngest sibling -- he&#39;s being given more freedom with how his days are spent & he&#39;s being parented in a more relaxed manner -- it&#39;d be challenging to *want* to be understanding of why he has those options and they don&#39;t. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ===I have 3 kids, 2 &quot;neuro typical&quot; in public school who thrive there===<br/>\n&gt; <br/>\n&gt; I looked up &quot;neurotypical&quot; on wikipedia and found that it refers to &quot;people who are not on the autism spectrum&quot;. <br/>\n&gt; <br/>\n&gt; On an autism-related list, it might be helpful to define kids in that way, but this isn&#39;t such a list. It&#39;d be helpful on this list to not use terms that aren&#39;t relevant to unschooling.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ===it seems like I am two different parents and I&#39;m not sure if that is ok or not in the long run. I don&#39;t want my big kids to resent their younger brother because he has &quot;different rules.&quot;===<br/>\n&gt; <br/>\n&gt; What about the here and now, the short run? There&#39;s no guarantee the two children in school will have a long enough life to qualify as &quot;the long run&quot;.<br/>\n&gt; <br/>\n&gt; Why can&#39;t those two children have the same opportunities and freedoms that your youngest child has? Today, right now?<br/>\n&gt; <br/>\n&gt; If you have concerns the older kids might resent their younger brother, are you *sure* they&#39;re &quot;thriving&quot; in public school?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ===So we did more unit studies, which we still like to do===<br/>\n&gt; <br/>\n&gt; By &quot;we&quot;, does that mean if you never brought up the idea of unit studies again, your youngest son would still ask to do them? <br/>\n&gt; <br/>\n&gt; Unit studies is not unschooling. &quot;Unit studies&quot; is school terminology, and it&#39;s hard to unschool if you&#39;re still thinking in school terminology.<br/>\n&gt; <br/>\n&gt; Glenda<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Different styles for diff kids?","postDate":"1298901266","msgId":60104,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY2QjVEMjI0LUIwNzEtNDVCRS05NkRCLTlGQzU4MjM0Q0ZFNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlrZmo4NStsMmYyQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrZmo4NStsMmYyQGVHcm91cHMuY29tPg=="},"prevInTopic":60103,"nextInTopic":60108,"prevInTime":60103,"nextInTime":60105,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"-=-===they are teens and aren t always so understanding=== -=-That s a derogatory remark. You re saying *because* they re teens, they re not always so","messageBody":"<div id=\"ygrps-yiv-2004725417\">-=-===they are teens and aren&#39;t always so understanding===<br/>\n<br/>\n-=-That&#39;s a derogatory remark. You&#39;re saying *because* they&#39;re teens, they&#39;re not always so understanding. -=-<br/>\n<br/>\nIt&#39;s derogatory, but if they&#39;ve been schooled according to the default plan in this culture, they are probably also on the default curve as teens, and are very likely not very understanding about family life.  They might know tons about the politics within their high school, but very little about their own mother&#39;s feelings.<br/>\n<br/>\nPart of what school does is break bonds between and among family members.   It&#39;s a &quot;we&#39;re your family now&quot; gang feeling sometimes, and it&#39;s a rare school student who doesn&#39;t feel some of that even if it&#39;s not stated.<br/>\n<br/>\nUnschoolers (of the sort of unschooling discussed on this list) can forget how different their lives would have been had their children gone to school.<br/>\n<br/>\nI don&#39;t see that this follows at all:  <br/>\n-=-If you have concerns the older kids might resent their younger brother, are you *sure* they&#39;re &quot;thriving&quot; in public school?-=-<br/>\n<br/>\nThriving in school could make it MORE irritating.   If they love school it could be for lots of good reasons.  And they might love school.  If that involves doing and being the way their parents told them was good, then they could easily resent the parents taking back the reward-based behavior before they finish the project.  If the love of school involves loyalty to the entity, environment and other students, and they don&#39;t feel their mom is a strong partner, then the loss of even more of her time and attention would definitely be an irritant.<br/>\n<br/>\nI have vivid emotional memories of my childhood.  I wasn&#39;t thrilled when I was seven and my parents took in a cousin 8 months older than I am, and later her sister who was two years younger (and a year older than my only younger sister, which made her #4 of 4, rather than #2 of 2).  My mom felt she was doing a great thing.  My dad had hoped it would be temporary.   <br/>\n<br/>\nI remember the feelings I had when I waited until I was ten years old to get a bicycle, and my sister (who couldn&#39;t even ride one) got one at the same time.<br/>\n<br/>\nSome parents might not have those kinds of memories.  When that&#39;s the case, it might be better for them to hold off on some sorts of advice or analysis of what families and teens and kids might/should feel.   Unschooling doesn&#39;t even always transform the relationships within a family, when the kids are older.   It doesn&#39;t even BEGIN to transform relationships outside of unschooling.<br/>\n<br/>\n-=-By &quot;we&quot;, does that mean if you never brought up the idea of unit studies again, your youngest son would still ask to do them? <br/>\n-=-Unit studies is not unschooling. &quot;Unit studies&quot; is school terminology-=-<br/>\n<br/>\nIt&#39;s a very common sort of &quot;relaxed homeschooling&quot; concept, unit studies.   And if a family has always done unit studies, the child WOULD certainly ask for them, or think he wasn&#39;t learning.<br/>\n<br/>\nWhen children are told that this or that is done because that&#39;s how learning works, because learning is important, because the child must do that to be successful, then it&#39;s evidence of a good relationship between parent and child that the child internalizes that.   It does take a while for that conditioning to be overcome, which is what deschooling is about.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different styles for diff kids?","postDate":"1298896773","msgId":60103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdEQ0E0MkE3LUMwN0QtNEVBQS05MEI2LUQ3NDVDMUJGMUI2REB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDJCMEJFQTMxLTZEMjYtNDgxQy04MENELTZEOUFCQTJENTFFMkB2ZXJpem9uLm5ldD4=","referencesHeader":"PGlrZjM2ZitqMnBsQGVHcm91cHMuY29tPiA8MkIwQkVBMzEtNkQyNi00ODFDLTgwQ0QtNkQ5QUJBMkQ1MUUyQHZlcml6b24ubmV0Pg=="},"prevInTopic":60102,"nextInTopic":60104,"prevInTime":60102,"nextInTime":60104,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"... Sorry, not clear. If they feel that their time *from you*, the resources they need *from you* are being channeled to him ... Joyce [Non-text portions of","messageBody":"<div id=\"ygrps-yiv-213824952\">On Feb 28, 2011, at 7:34 AM, Joyce Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; if<br/>\n&gt; they feel that their time, their resources are being taken and<br/>\n&gt; channeled to him<br/>\n<br/>\n </span></blockquote>Sorry, not clear.<br/>\n<br/>\nIf they feel that their time *from you*, the resources they need *from  <br/>\nyou* are being channeled to him ...<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different styles for diff kids?","postDate":"1298896475","msgId":60102,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJCMEJFQTMxLTZEMjYtNDgxQy04MENELTZEOUFCQTJENTFFMkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGlrZjM2ZitqMnBsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrZjM2ZitqMnBsQGVHcm91cHMuY29tPg=="},"prevInTopic":60098,"nextInTopic":60103,"prevInTime":60101,"nextInTime":60103,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"... If they feel you are less giving and more controling with them, then it will damage the relationship between you and them and perhaps between them and him.","messageBody":"<div id=\"ygrps-yiv-1337519272\">On Feb 27, 2011, at 10:01 PM, jennifer in IL wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Here is my rub - it seems like I am two different parents and I&#39;m  <br/>\n&gt; not sure if that is ok or not in the long run. I don&#39;t want my big  <br/>\n&gt; kids to resent their younger brother because he has &quot;different rules.&quot;<br/>\n<br/>\n </span></blockquote>If they feel you are less giving and more controling with them, then  <br/>\nit will damage the relationship between you and them and perhaps  <br/>\nbetween them and him.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I am sure logically they get why I do this with him, but they are  <br/>\n&gt; teens and aren&#39;t always so understanding.<br/>\n<br/>\n<br/>\n </span></blockquote>They can&#39;t have the same understanding as you because they aren&#39;t you  <br/>\nand he isn&#39;t their son. They have needs that they look to you to meet.  <br/>\nIf they *feel* you aren&#39;t meeting them, if they *feel* their needs are  <br/>\nbeing put in second place to his (or yours), then they&#39;re going to  <br/>\nresent that. Even if they understand why he needs more from you, if  <br/>\nthey feel that their time, their resources are being taken and  <br/>\nchanneled to him, they&#39;re understanding a very different situation  <br/>\nthan what you are.<br/>\n<br/>\nIf you feel the need to be the school&#39;s advocate to get them to do  <br/>\nwhat they &quot;need&quot; to do, The Parent/Teen Breakthrough: The Relationship  <br/>\nApproach by Mira Kirshenbaum will be a big help.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://tinyurl.com/23rhfms\">http://tinyurl.com/23rhfms</a><br/>\n<br/>\nIt&#39;s like the bible of parenting teens. It will help you see where you  <br/>\nmay be inadvertently damaging the relationship for what you feel are  <br/>\nsensible reasons.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Different styles for diff kids?","postDate":"1298878533","msgId":60098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrZmo4NStsMmYyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlrZjM2ZitqMnBsQGVHcm91cHMuY29tPg=="},"prevInTopic":60097,"nextInTopic":60102,"prevInTime":60097,"nextInTime":60099,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"===they are teens and aren t always so understanding=== That s a derogatory remark. You re saying *because* they re teens, they re not always so understanding.","messageBody":"<div id=\"ygrps-yiv-1234303133\">===they are teens and aren&#39;t always so understanding===<br/>\n<br/>\nThat&#39;s a derogatory remark. You&#39;re saying *because* they&#39;re teens, they&#39;re not always so understanding. <br/>\n<br/>\nRegardless of age, if they&#39;re being parented differently than their youngest sibling -- he&#39;s being given more freedom with how his days are spent & he&#39;s being parented in a more relaxed manner -- it&#39;d be challenging to *want* to be understanding of why he has those options and they don&#39;t. <br/>\n<br/>\n<br/>\n===I have 3 kids, 2 &quot;neuro typical&quot; in public school who thrive there===<br/>\n<br/>\nI looked up &quot;neurotypical&quot; on wikipedia and found that it refers to &quot;people who are not on the autism spectrum&quot;. <br/>\n<br/>\nOn an autism-related list, it might be helpful to define kids in that way, but this isn&#39;t such a list. It&#39;d be helpful on this list to not use terms that aren&#39;t relevant to unschooling.<br/>\n<br/>\n<br/>\n===it seems like I am two different parents and I&#39;m not sure if that is ok or not in the long run. I don&#39;t want my big kids to resent their younger brother because he has &quot;different rules.&quot;===<br/>\n<br/>\nWhat about the here and now, the short run? There&#39;s no guarantee the two children in school will have a long enough life to qualify as &quot;the long run&quot;.<br/>\n<br/>\nWhy can&#39;t those two children have the same opportunities and freedoms that your youngest child has? Today, right now?<br/>\n<br/>\nIf you have concerns the older kids might resent their younger brother, are you *sure* they&#39;re &quot;thriving&quot; in public school?<br/>\n<br/>\n<br/>\n===So we did more unit studies, which we still like to do===<br/>\n<br/>\nBy &quot;we&quot;, does that mean if you never brought up the idea of unit studies again, your youngest son would still ask to do them? <br/>\n<br/>\nUnit studies is not unschooling. &quot;Unit studies&quot; is school terminology, and it&#39;s hard to unschool if you&#39;re still thinking in school terminology.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":331885657,"authorName":"Jennifer Schuelein","from":"&quot;Jennifer Schuelein&quot; &lt;fairiedust66@...&gt;","profile":"jenfromtx6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Different styles for diff kids?","postDate":"1298874051","msgId":60097,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrZmVzMys3YWVlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlrZjM2ZitqMnBsQGVHcm91cHMuY29tPg=="},"prevInTopic":60096,"nextInTopic":60098,"prevInTime":60096,"nextInTime":60098,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"I would also like to know how you feel about giving your older 2 the option to homeschool. If they do want to still attend school, then that is their choice,","messageBody":"<div id=\"ygrps-yiv-1003552059\">I would also like to know how you feel about giving your older 2 the option to homeschool. If they do want to still attend school, then that is their choice, but if they want to homeschool I would try it! <br/>\n<br/>\nMy son has autism and that is one reason why he has never gone to school. He tried pre-school at age 2 and that was the first and last school type experience he&#39;s ever had. <br/>\n<br/>\nBe open and honest with the older kids. Have a conversation about their needs and desires. Ask them if the situation with their younger sibling bothers them. You might be worrying for little reason or they might have some issues that you need to work out. <br/>\n<br/>\nI would try approaching parenting the older kids the same way you are parenting the younger child. You might open up an entirely new relationship with them! If the dichotomy of your parenting styles is bothering you then I would say, &quot;Change it!&quot; <br/>\n<br/>\nJennifer<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;jennifer in IL&quot; &lt;jennifer@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi,<br/>\n&gt; <br/>\n&gt; I have been reading for a while now and so appreciate this list.  I wonder if I am alone in this type of situation....I have 3 kids, 2 &quot;neuro typical&quot; in public school who thrive there.  Never thought of homeschooling them, let alone unschooling them.  I parent them pretty typically - though I feel we have more of a partnership in more ways than I see my friends or neighbors have who are more authoritative with their kids.<br/>\n&gt; <br/>\n&gt; Enter my 3rd child with special needs.  Life is hard enough for him, let alone school.  He made it to his 6th day of 1st grade when I pulled him out and decided to homeschool him.  I NEVER thought I would homeschool!  This was not something I had a calling for but it was just clear he couldn&#39;t cut it in a cookie cutter system like public school.  <br/>\n&gt; <br/>\n&gt; Over the last 2 years I have relaxed quite a bit with him.  I used to just recreate school in my living room and that was pretty miserable.  So we did more unit studies, which we still like to do, but then I found unschooling/whole life learning/etc....  It seemed like the more I read, the more it made sense especially for my youngest.  <br/>\n&gt; <br/>\n&gt; Here is my rub - it seems like I am two different parents and I&#39;m not sure if that is ok or not in the long run.  I don&#39;t want my big kids to resent their younger brother because he has &quot;different rules.&quot;  I am sure logically they get why I do this with him, but they are teens and aren&#39;t always so understanding.<br/>\n&gt; <br/>\n&gt; I&#39;d love any ideas/thoughts on this.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Different styles for diff kids?","postDate":"1298873446","msgId":60096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERDOTVGMDdBRTZCNjQ3NEJBMUE3RjFEQ0YxRUE2RkUwQEx5bGFQQz4=","inReplyToHeader":"PGlrZjkyMCtka2htQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrZjkyMCtka2htQGVHcm91cHMuY29tPg=="},"prevInTopic":60095,"nextInTopic":60097,"prevInTime":60095,"nextInTime":60097,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"do they have to go to school or want to?  what would happen if they said they didn’t want to?  do they feel free to say they want to unschool too?  what","messageBody":"<div id=\"ygrps-yiv-1697864154\">do they have to go to school or want to?  what would happen if they said they didn’t want to?  do they feel free to say they want to unschool too?  what about skip a day here or there?  there are unschooling teens who have chosen to go to school for some period of time, but that’s very different from mandated school for some but not all kids in a family.  my son started unschooling (left school) about 6 months before my daughter.  but if she had been ready to/wanted to come home sooner, that would have been ok.    if the requirements are more external and their CHOICE (they are free to choose to be late, to skip school, to not do their home work, etc) then that’s really different from you mandating that they follow the requirements of a life that you are also mandating.  does that make sense?<br/>\n<br/>\nlyla<br/>\nFrom: jennifer in IL <br/>\nSent: Sunday, February 27, 2011 8:41 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSubject: [AlwaysLearning] Re: Different styles for diff kids?<br/>\n<br/>\n  <br/>\nHi,<br/>\n<br/>\nI mean that two go to school, they have to do homework, there are rules they have to follow, there are expectations that come from external sources. Then I have one with me all the time where he is more free - ie he doesn&#39;t have to get up at a certain time to get ready for school/bus/breakfast. Does that make sense? Clearly that is one example. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Different styles for diff kids?","postDate":"1298873282","msgId":60095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1OTcyOC4yMzc2My5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGlrZjkyMCtka2htQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrZjkyMCtka2htQGVHcm91cHMuY29tPg=="},"prevInTopic":60094,"nextInTopic":60096,"prevInTime":60094,"nextInTime":60096,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"This may help you: http://sandradodd.com/schoolchoice   Alex Polikowsky [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-272385198\">This may help you:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185743801,"authorName":"jennifer in IL","from":"&quot;jennifer in IL&quot; &lt;jennifer@...&gt;","profile":"jenniferinil","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Different styles for diff kids?","postDate":"1298868096","msgId":60094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrZjkyMCtka2htQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU0MTI4MC40NDI2MS5xbUB3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":60093,"nextInTopic":60095,"prevInTime":60093,"nextInTime":60095,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"Hi, I mean that two go to school, they have to do homework, there are rules they have to follow, there are expectations that come from external sources.  Then","messageBody":"<div id=\"ygrps-yiv-392355415\">Hi,<br/>\n<br/>\nI mean that two go to school, they have to do homework, there are rules they have to follow, there are expectations that come from external sources.  Then I have one with me all the time where he is more free - ie he doesn&#39;t have to get up at a certain time to get ready for school/bus/breakfast.  Does that make sense?  Clearly that is one example.  <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; What do you mean by you have different set of rules and parenting?<br/>\n&gt; Do you let your son eat what he wants when he wants but limits the other two ?<br/>\n&gt;  Do you punish your two older kids but does not punish the younger? </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Different styles for diff kids?","postDate":"1298867190","msgId":60093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0MTI4MC40NDI2MS5xbUB3ZWI4MTUwNC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGlrZjM2ZitqMnBsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlrZjM2ZitqMnBsQGVHcm91cHMuY29tPg=="},"prevInTopic":60092,"nextInTopic":60094,"prevInTime":60092,"nextInTime":60094,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"What do you mean by you have different set of rules and parenting? Do you let your son eat what he wants when he wants but limits the other two ?  Do you","messageBody":"<div id=\"ygrps-yiv-2087345169\">What do you mean by you have different set of rules and parenting?<br/>\nDo you let your son eat what he wants when he wants but limits the other two ?<br/>\n Do you punish your two older kids but does not punish the younger?<br/>\n<br/>\n If that is what you mean  it may be a problem.  Your two older ones can <br/>\nresent their younger brother <br/>\nand that will may harm your relationship with your children.<br/>\n<br/>\nI parents my kids with the same principles but the way I handle each situation <br/>\nmay be different from one<br/>\nchild and the other due to their personalities but not in a way that would make <br/>\none resent the other.<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185743801,"authorName":"jennifer in IL","from":"&quot;jennifer in IL&quot; &lt;jennifer@...&gt;","profile":"jenniferinil","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Different styles for diff kids?","postDate":"1298862095","msgId":60092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlrZjM2ZitqMnBsQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":60093,"prevInTime":60091,"nextInTime":60093,"topicId":60092,"numMessagesInTopic":0,"msgSnippet":"Hi, I have been reading for a while now and so appreciate this list.  I wonder if I am alone in this type of situation....I have 3 kids, 2 neuro typical in","messageBody":"<div id=\"ygrps-yiv-1447681916\">Hi,<br/>\n<br/>\nI have been reading for a while now and so appreciate this list.  I wonder if I am alone in this type of situation....I have 3 kids, 2 &quot;neuro typical&quot; in public school who thrive there.  Never thought of homeschooling them, let alone unschooling them.  I parent them pretty typically - though I feel we have more of a partnership in more ways than I see my friends or neighbors have who are more authoritative with their kids.<br/>\n<br/>\nEnter my 3rd child with special needs.  Life is hard enough for him, let alone school.  He made it to his 6th day of 1st grade when I pulled him out and decided to homeschool him.  I NEVER thought I would homeschool!  This was not something I had a calling for but it was just clear he couldn&#39;t cut it in a cookie cutter system like public school.  <br/>\n<br/>\nOver the last 2 years I have relaxed quite a bit with him.  I used to just recreate school in my living room and that was pretty miserable.  So we did more unit studies, which we still like to do, but then I found unschooling/whole life learning/etc....  It seemed like the more I read, the more it made sense especially for my youngest.  <br/>\n<br/>\nHere is my rub - it seems like I am two different parents and I&#39;m not sure if that is ok or not in the long run.  I don&#39;t want my big kids to resent their younger brother because he has &quot;different rules.&quot;  I am sure logically they get why I do this with him, but they are teens and aren&#39;t always so understanding.<br/>\n<br/>\nI&#39;d love any ideas/thoughts on this.</div>","specialLinks":[]}],"prevTopicId":60106,"nextTopicId":60124}}