{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":40,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Co-sleeping","postDate":"1312430320","msgId":62195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4RkZEMTQxLURFRTMtNERDQi1CMDQ1LTY5QTY2Njk5RTg5MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoxZDRqYisyaHNiQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxZDRqYisyaHNiQGVHcm91cHMuY29tPg=="},"prevInTopic":62194,"nextInTopic":65198,"prevInTime":62194,"nextInTime":62196,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"-=-I must be kind of bold, or unapproachable, or whatever, but i have gotten very little comment or criticism about our parenting choices, and it s not because","messageBody":"<div id=\"ygrps-yiv-1794545429\">-=-I must be kind of bold, or unapproachable, or whatever, but i have gotten very little comment or criticism about our parenting choices, and it&#39;s not because we know like minded people.-=-<br/>\n<br/>\nConfident?<br/>\n<br/>\nPeople don&#39;t press me about what I&#39;m doing, because they know I can defend my decisions and provide documentation for how I came to my current beliefs. :-)    I&#39;m not flighty.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194427255,"authorName":"Julie","from":"&quot;Julie&quot; &lt;jmarkoski@...&gt;","profile":"jmarkoski","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Co-sleeping","postDate":"1312429483","msgId":62194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxZDRqYisyaHNiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxMjF0YStzaGQyQGVHcm91cHMuY29tPg=="},"prevInTopic":62193,"nextInTopic":62195,"prevInTime":62193,"nextInTime":62195,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"I m a person who is both semi-private, yet unconcerned about the opinion of others in these things. So I don t go on and on about our great, closely bonded","messageBody":"<div id=\"ygrps-yiv-870465148\">I&#39;m a person who is both semi-private, yet unconcerned about the opinion of others in these things. So I don&#39;t go on and on about our great, closely bonded life, but if it comes up, I don&#39;t hide it. I can&#39;t imagine giving any credence to anyone not actually living our lives with us in our house about these kind of choices.<br/>\n<br/>\nI must be kind of bold, or unapproachable, or whatever, but i have gotten very little comment or criticism about our parenting choices, and it&#39;s not because we know like minded people. We know very few of them actually. But people know where I stand on things and must sense that if they give me grief over attachment parenting or unschooling or whatever, I may bring up things like their 9 year old having panic attacks at school, being medicated and forced to see a psychiatrist for his social immaturity, and yet throwing up their hands, completely baffled about what else to do and unwilling to remove him from the situation.<br/>\n<br/>\nJulie M<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Deb&quot; &lt;vwb777@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; Do you tell people about your sleeping arrangements and if so, what have their reactions been like? I think that might be my hangup-what if &quot;whomever&quot; finds out.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Chris Sanders &lt;iowaunschoolers@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us. I know most people would think there was something screwed up about this at his age, but other than the sleeping thing, he&#39;s a perfectly happy, well-adjusted, smart little guy. I know I&#39;m asking for it by bringing this situation here, but I truly do respect the opinions on this board. I appreciate any feedback you have for me. I can take it. Thanks.<br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; Both of our kids co-slept with us until 7 - 8 years old.   Zach (who is now 20) moved out and into his own room when our bed got to be too crowded after his sister was born.  We all co-slept for a couple months but he was a heavy sleeper and found his baby sister to be a soft pillow! She didn&#39;t like that much.  Their dad slept up in Zach&#39;s room for many months, until Zach felt comfortable sleeping alone. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Zoe (now 13) slept with us until she was 8 and wanted to sleep in her own bed.  We still tuck her in and hang out with her in her bedroom, often lying with her, until she&#39;s very sleepy. The usual routine is she&#39;ll come into my bed to snuggle with me first, because I go to sleep before she does.  Then her dad hangs out with her room until she&#39;s sleepy.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Co-sleeping -- healthy and normal.<br/>\n&gt; &gt; <br/>\n&gt; &gt; Chris S.<br/>\n&gt; &gt; <br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":194427255,"authorName":"Julie","from":"&quot;Julie&quot; &lt;jmarkoski@...&gt;","profile":"jmarkoski","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Co-sleeping","postDate":"1312428638","msgId":62193,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxZDNvdSszdGk0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg=="},"prevInTopic":62182,"nextInTopic":62194,"prevInTime":62192,"nextInTime":62194,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"Our sleeping arrangements have always been flexible and fluid depending on needs. I coslept with all 3 and nursed on demand for a year, then we night weaned by","messageBody":"<div id=\"ygrps-yiv-1331364968\">Our sleeping arrangements have always been flexible and fluid depending on needs. I coslept with all 3 and nursed on demand for a year, then we night weaned by having the baby sleep with only dad for 1-2 nights to see if they would accept him patting them down when they woke up. They all transitioned from nursing every 30 minutes to 2 hours (depending on the kid and the night) to sleeping at least 6-8 hours straight in those couple of days and then only another week or so before sleeping 10-12 hours?<br/>\n<br/>\nAfter the night weanings, we tried the crib for all three. James never took to it, so has coslept his entire life and is almost 6. I was lucky he was the first, because I took every nap with him, which would&#39;ve been hard with subsequent kids. He and I are night time people, so we usually stay up and go to sleep together. He sleeps as long as he needs to the next day based on when he goes to sleep.<br/>\n<br/>\nAfter the night weaning, Tyler really liked the crib. Went in happily for naps and bed time until about 3 years old. Then he could climb out of the crib and developed some fears, so we started putting him to sleep with one of us. He just turned 4 he wakes up at the same time every morning, no matter when he goes to sleep, so we make sure we get him down early enough for him to get a full night&#39;s sleep. Sometimes it&#39;s me and sometimes my husband that lays down with him. Larry is Not a night person, so he usually falls asleep for the night if he lays down with him, by 9:30pm. If I lay down with him, I get back up and spend time with Larry and James and then Larry joins him later. Ty has been having night terrors for quite a while, so we always make sure someone is with him by 11-12, because that&#39;s usually when they happen, if they happen. It was tough for a long time, because Ty woke up when Larry went to work, even if he hadn&#39;t had enough sleep. I think his sleep cycles are changing or maturing, or he&#39;s getting more secure or something, because now he&#39;ll stay asleep or come join me in the morning for more sleep.<br/>\n<br/>\nAfter night weaning, Audrey really liked the crib and still does. She just turned 2; I tried to bring her to bed last night with me and James, but it a just too stimulating, I guess. She&#39;s been waking up in the middle of the night for the last week (between 2am and 5am), wide awake and full of fun, babbling, laughing and jumping and rolling around in the crib. She&#39;s been staying awake for an hour or more. So last night I got her about 3am. She just couldn&#39;t sleep with us and I asked her after an hour if she wanted to go back to the crib and she did.  I assume she&#39;ll want to be with us again, maybe as she approaches 3 like Tyler. <br/>\n<br/>\nIn our house, anyone can sleep wherever they want or need to. Larry and I are on the same page about it and will welcome them to our beds as long as the want to be there. It&#39;s hard to define what impact cosleeping has had on them as people. I believe that NOT meeting that attachment need could certainly have been harmful, but can&#39;t tell how it has benefited them specifically. They are individuals regardless. James is super confident and outgoing and a mellow person and has coslept every day of his life. Tyler has seemed more insecure or anxious to us and is very passionate in his high and low emotions, and has the option to cosleep every night, but didn&#39;t prefer it from 1-3 years old. Audrey is an exuberant, energetic fireball, and she currently prefers sleeping alone. We meet that need, though, not expecting s certain outcome, but because it feels like the kind, humane thing to do and we can&#39;t imagine denying a night time need like that for anyone, let alone a child helpless to manipulate his own environment to meet his needs on his own.<br/>\n<br/>\nWe have an almost 10 year old  neighbor kid, traditionally parented, who is terrified of the dark and even more of thunderstorms. He has been forbidden to sleep with his parents his whole life despite his high level of fear and anxiety. Not only does he have to survive that terror alone, but his twin sister has made it known to everyone that he has this fear (there doesn&#39;t seem to be much empathy or compassion in anyone in that family) and he also has to suffer the humiliation of other kids judging him a coward. I think it&#39;s a cruelty to allow this suffering, and even more so that his parents judge him as an immature sissy boy for it. That&#39;s the opposite end of the spectrum, and I think not meeting, and even mocking, that need has done irreparable harm to that child. He&#39;ll, I&#39;d let him sleep with us when it stormed if I could figure out a way to not seem like an intrusive creepy weirdo! The ironic thing is they are very religious and big into the condemnation of the big sins, but don&#39;t recognize the &quot;sin&quot; in blatantly denying a child needed comfort, bonding, and security.<br/>\n<br/>\nJulie M<br/>\nJames, 2005<br/>\nTyler, 2007<br/>\nAudrey, 2009<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Deb&quot; &lt;vwb777@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us. I know most people would think there was something screwed up about this at his age, but other than the sleeping thing, he&#39;s a perfectly happy, well-adjusted, smart little guy. I know I&#39;m asking for it by bringing this situation here, but I truly do respect the opinions on this board. I appreciate any feedback you have for me. I can take it. Thanks.<br/>\n&gt;<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Deb&quot; &lt;vwb777@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us. I know most people would think there was something screwed up about this at his age, but other than the sleeping thing, he&#39;s a perfectly happy, well-adjusted, smart little guy. I know I&#39;m asking for it by bringing this situation here, but I truly do respect the opinions on this board. I appreciate any feedback you have for me. I can take it. Thanks.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":239531140,"authorName":"renee_cabatic","from":"&quot;renee_cabatic&quot; &lt;renee_cabatic@...&gt;","profile":"renee_cabatic","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Co-sleeping","postDate":"1312395375","msgId":62182,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxYzM5Zis2dDViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBK2FrTlJnR3BhS01lUm45eE5lbTM1c3ZnR2pMbVZnY0RPOVV4eGRCVW1XLVlXZ2thd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62159,"nextInTopic":62193,"prevInTime":62181,"nextInTime":62183,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"My DH, Chris wanted our twin babies in bed with us from the begining.  I resisted at first because I worried that I would get less sleep due to breastfeeding.","messageBody":"<div id=\"ygrps-yiv-1668643601\">My DH, Chris wanted our twin babies in bed with us from the begining.  I resisted at first because I worried that I would get less sleep due to breastfeeding. My fears were unfounded-we all slept better together. <br/>\n<br/>\n Ten years later we still all sleep in a giant bed together.  Right now it&#39;s a queen and 2 twin beds pressed together.  But through the years we have slept in a number of different configurations. <br/>\n<br/>\n  When XuMei and Xander were 6 they wanted to sleep in their own room but still with each other so we set that up.  Now they want to have their own seperate rooms with bedding for sleep overs with friends but still sleep in our big bed when friends aren&#39;t over. <br/>\n<br/>\n  Sometimes we get on different sleep schedules from each other.  Right now we are in sinc so XuMei gets up early with Chris to have an egg and a chat before he leaves for work.  Usually she falls back to sleep for a bit before Xander and I get up at 8am.<br/>\n<br/>\n  Flexibility has helped. Creativity has helped (especially with intimacy!)  <br/>\n<br/>\n  Unschooling principles have helped the most.  Really looking at my kids, being with them, meeting their needs and our family&#39;s and not at what books or friends or relatives are saying.<br/>\n<br/>\nmore later<br/>\nRenee Cabatic</div>","specialLinks":[]},{"userId":262318461,"authorName":"Sara Evans","from":"Sara Evans &lt;sunrayemomi@...&gt;","profile":"sunrayemomi","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Co-sleeping","postDate":"1312297964","msgId":62159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBK2FrTlJnR3BhS01lUm45eE5lbTM1c3ZnR2pMbVZnY0RPOVV4eGRCVW1XLVlXZ2thd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGI0YWY2LjM2ZDNkYmYwLjNiNjdhZmY5QGFvbC5jb20+","referencesHeader":"PGI0YWY2LjM2ZDNkYmYwLjNiNjdhZmY5QGFvbC5jb20+"},"prevInTopic":62125,"nextInTopic":62182,"prevInTime":62158,"nextInTime":62160,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"I posted this news video on my facebook today, this aired this morning I believe.  I thought I d share it here. Cosleeping is not just OK for my family and","messageBody":"<div id=\"ygrps-yiv-1575363995\">I posted this news video on my facebook today, this aired this morning I<br/>\nbelieve.  I thought I&#39;d share it here.<br/>\nCosleeping is not just &quot;OK&quot; for my family and I, it&#39;s a key part of a<br/>\nhealthy relationship between us and the kids.  We bedshared and coslept in<br/>\nthe same room since day one of both their lives.  I nursed on demand.  The<br/>\noldest (10) still comes down to get me whenever she needs, and the youngest<br/>\n(4.5) still ends up in our room and then bed every morning.  I&#39;m proud of<br/>\nthese things so I don&#39;t hide them and I&#39;ve researched them enough to feel<br/>\nconfident if anyone were to challenge my reasons behind bedsharing, but I<br/>\ntry to be encouraging when the topic comes up.  My kids are old enough now<br/>\nwhere it rarely does anymore, but when it does I extol its virtues.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://today.msnbc.msn.com/id/26184891/vp/43984891\">http://today.msnbc.msn.com/id/26184891/vp/43984891</a><br/>\n<br/>\n<br/>\n-- <br/>\nSara<br/>\nMomi to RayeAnne (&#39;01) and Arwen Vada (&#39;06)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"AngelOvFaith@aol.com","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Co-sleeping","postDate":"1312183801","msgId":62125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI0YWY2LjM2ZDNkYmYwLjNiNjdhZmY5QGFvbC5jb20+"},"prevInTopic":62122,"nextInTopic":62159,"prevInTime":62124,"nextInTime":62126,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"There are certain people i wouldn t want to find out too...but then again its funny i say that because i no longer have friendships with those people and","messageBody":"<div id=\"ygrps-yiv-452961253\">There are certain people i wouldn&#39;t want to find out too...but then again  <br/>\nits funny i say that because i no longer have friendships with those people <br/>\nand  neither does my daughter so i doubt they will ever be coming over our <br/>\nhouse  again. So nope wont be telling anyone, or having anyone over unless i <br/>\nknow they  are our real friends and would accept us unconditionally. <br/>\n-L.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276080282,"authorName":"delphini004","from":"&quot;delphini004&quot; &lt;delphini004@...&gt;","profile":"delphini004","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Co-sleeping","postDate":"1312172368","msgId":62122,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxNTlnZysyanZsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTWc9SHBlU1ljR0owWEJiazh3TWFWOWhaaWtDb1AxY0xlU3hTYmNhSEoxdHhnODlrZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62120,"nextInTopic":62125,"prevInTime":62121,"nextInTime":62123,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"When I was little, I had to sleep alone from birth, with my bottle and a bottle holder, without my mother. As a child, I often have nightmares. When my little","messageBody":"<div id=\"ygrps-yiv-562659561\">When I was little, I had to sleep alone from birth, with my bottle and a bottle holder, without my mother. As a child, I often have nightmares. When my little baby-brother was born, I took care of him as much as I could despite my young age. I loved him so much. I remember at the age of 3 and up, I went to bed with him until he falls asleep because he did not want to be alone and I understood him. Sometimes, I was asking, softly, &quot;do you sleep&quot;? And he was answering &quot;yes&quot;. :-) So I knew he was not asleep and I stayed there, lying by his side. He died when he was 15 and I am pleased to have such good memories. I never regret being with him to sleep.<br/>\nBecome parents, because of our ignorance, we have given in to social pressures: our first child was quickly placed in a separate room when he was only a few months, it was hard for him and for me. He had nightmares and night terrors. When we removed him from school (he was 7), it was so necessary that its needs were finally met. My husband slept with him in the living room as the TV helped them to connect together, while I was sleeping with our baby. There have been several different episodes of co-sleeping but basically, the eldest slept alone or with his father when he wanted to, after spending hours in bed with the baby and me reading or chating. Then, the children slept together a few months (but it was their&#39;s father choice), I ended up insist that they are free to do as they wanted to. So the elder asked to sleep alone, the youngest was sleeping with me and their father was sleeping in the living room, his choice. Then I finally decided to turn our room in a family room and then, all are welcome whenever they want. The eldest has lived a difficult time last winter (he was 18), and spent most of nights with us all. Sometimes, he like to be with us in the family room, taking his laptop for working while we fall asleep. The youngest (13) is still sleeping in the family room where we put mattresses for four people, side by side. We sleep happily for last few years. When summer came, our oldest son is now happy to sleep outside, as we did his father and me when we were young. And tonight I&#39;ll sleep again outside, me too, because he left for several days and when I sleep outside, I feel connected with him, we are under the same sky, under the same stars. The others are already sleeping at the moment, together, upstairs.</div>","specialLinks":[]},{"userId":345074016,"authorName":"Nina","from":"&quot;Nina&quot; &lt;millionairemama@...&gt;","profile":"fitmama2twins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Co-sleeping","postDate":"1312170115","msgId":62120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxNTdhMyt0dXZrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg=="},"prevInTopic":62106,"nextInTopic":62122,"prevInTime":62119,"nextInTime":62121,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"== My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us.== We also have 7yr old twins","messageBody":"<div id=\"ygrps-yiv-1805397556\">== My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us.==<br/>\n<br/>\nWe also have 7yr old twins who have been in our bed since birth and our 6 week old is in the family bed as well.  My husband works overseas a large portion of the year so it is mainly the kids and I in the bed but even when he&#39;s home, we&#39;re all together.  If you are all sleeping well and happy, then continue to co-sleep.<br/>\n<br/>\nNina</div>","specialLinks":[]},{"userId":475251512,"authorName":"Deb","from":"&quot;Deb&quot; &lt;vwb777@...&gt;","profile":"vwb777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Co-sleeping","postDate":"1312152849","msgId":62106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxNG1laCtsajU0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDI0MTI3MkJGLTcxOUMtNDU0Ri04OTEwLUE3Q0IxQjNEOUIwMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62105,"nextInTopic":62120,"prevInTime":62105,"nextInTime":62107,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"That breaks my heart and brings up horrible memories for me,too. I had night terrors as a child and was hard to wake from them. Even awake everything seemed","messageBody":"<div id=\"ygrps-yiv-1093245400\">That breaks my heart and brings up horrible memories for me,too. I had night terrors as a child and was hard to wake from them. Even awake everything seemed distorted and it was very scary. The memory that stands out is my mother smacking me across the face after I had awaken from one because she thought i was still out of it I guess. I must have been 5 or 6 but it sure stuck with me. And I was made to go back to sleep in my room with the door closed tight. <br/>\n      After reading all the responses and having that vivid memory, I won&#39;t question co sleeping again. Thank you for sharing so honestly.<br/>\n<br/>\nDeborah<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Vwb777@...\">Vwb777@...</a> <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-I am so glad he knows that that&#39;s OK, and that I&#39;m here for him, and that he doesn&#39;t have to lie sleepless in his room, alone and lonely.-=-<br/>\n&gt; <br/>\n&gt; Caren wrote that and it made me wistful and also glad that my children could always come and get us, after they moved to their own rooms.  I&#39;ve slept with my kids in their rooms, or one has been with Keith while I was with another...  <br/>\n&gt; <br/>\n&gt; When I was a kid, there was no such safety or comfort.  Even when I was a young teen and had the worst dream of my life (then or since), I asked if I could sleep on the couch in the room next to them, and was told no, go back to bed.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Co-sleeping","postDate":"1312134604","msgId":62105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0MTI3MkJGLTcxOUMtNDU0Ri04OTEwLUE3Q0IxQjNEOUIwMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoxM25lcCs5MGQ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGoxM25lcCs5MGQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":62104,"nextInTopic":62106,"prevInTime":62104,"nextInTime":62106,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"-=-I am so glad he knows that that s OK, and that I m here for him, and that he doesn t have to lie sleepless in his room, alone and lonely.-=- Caren wrote","messageBody":"<div id=\"ygrps-yiv-1345949071\">-=-I am so glad he knows that that&#39;s OK, and that I&#39;m here for him, and that he doesn&#39;t have to lie sleepless in his room, alone and lonely.-=-<br/>\n<br/>\nCaren wrote that and it made me wistful and also glad that my children could always come and get us, after they moved to their own rooms.  I&#39;ve slept with my kids in their rooms, or one has been with Keith while I was with another...  <br/>\n<br/>\nWhen I was a kid, there was no such safety or comfort.  Even when I was a young teen and had the worst dream of my life (then or since), I asked if I could sleep on the couch in the room next to them, and was told no, go back to bed.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":442033011,"authorName":"Gwen Montoya","from":"Gwen Montoya &lt;lifeisjustthis@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Co-sleeping","postDate":"1312132389","msgId":62104,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTWc9SHBlU1ljR0owWEJiazh3TWFWOWhaaWtDb1AxY0xlU3hTYmNhSEoxdHhnODlrZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDA0ODRGMDgxODNFOTRBMEFBMTVFQ0Q3MEVFN0M2MzIwQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPgk8MDQ4NEYwODE4M0U5NEEwQUExNUVDRDcwRUU3QzYzMjBAZGVib3JhaDQzZjEzZmQ+"},"prevInTopic":62101,"nextInTopic":62105,"prevInTime":62103,"nextInTime":62105,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"Megan will be ten on Tuesday and she still sleeps with me. Zoe, who will be five in October, also sleeps with me. I ve co-slept with both since they were born.","messageBody":"<div id=\"ygrps-yiv-1614461668\">Megan will be ten on Tuesday and she still sleeps with me. Zoe, who will be<br/>\nfive in October, also sleeps with me. I&#39;ve co-slept with both since they<br/>\nwere born. With Megan we had a crib (a gift) that ended up as a $400 laundry<br/>\nhamper :-) and with Zoe we never bothered.<br/>\n<br/>\nMegan has always had a problem with nightmares - the really scary<br/>\nwake-up-crying kind. They are getting less frequent as she gets older, but<br/>\nthey still happen several times a month. When she wakes up I am right there<br/>\nand can soothe her back to sleep. It would be hard for her to wake up alone<br/>\nand have to come get me. There was a brief period where she was complaining<br/>\nabout Zoe taking up too much space on the bed, so I tried placing her bed in<br/>\nthe same room as mine. She couldn&#39;t get to sleep on it and ended up still<br/>\nsleeping in the big bed.<br/>\n<br/>\nShe has her own room with a bed. My next project is to make it a fun &<br/>\ncomfortable place for her to hang out when she needs some alone time<br/>\n(something she has just recently started to ask for). I don&#39;t think she&#39;ll<br/>\nbe sleeping in her own bed/room for a while yet.<br/>\n<br/>\nGwen<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jul 31, 2011 at 7:39 AM, Deb Lewis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:d.lewis@...\">d.lewis@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ***My son is seven and for the last year has slept with us stating he was<br/>\n&gt; afraid of being alone and that he loved being with us. ***<br/>\n&gt;<br/>\n&gt; Dylan slept with us all the time until he was seven. At that time we&#39;d<br/>\n&gt; moved into a house with an open loft style second story, two small rooms<br/>\n&gt; divided by an archway, no door. He wanted a bunk bed with a futon on the<br/>\n&gt; bottom so he could have friends over. After he got his own bed he still<br/>\n&gt; slept with us sometimes, or went to sleep in his bed but came to the big bed<br/>\n&gt; sometime in the night. Sometimes he wanted me to sleep on the bottom bunk.<br/>\n&gt; He slept with us, or me with him, on and off until he was eleven or twelve.<br/>\n&gt;<br/>\n&gt; Deb Lewis<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Co-sleeping","postDate":"1312128466","msgId":62101,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxM3VraStkN3AxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxMXQwbCt1YmMwQGVHcm91cHMuY29tPg=="},"prevInTopic":62100,"nextInTopic":62104,"prevInTime":62100,"nextInTime":62102,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"... ******************** Usually the biggest obstacle to intimacy when you have kids is your own expectations - if you expect to get an hour and half of adult","messageBody":"<div id=\"ygrps-yiv-1960039214\">&quot;Deb&quot; &lt;vwb777@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;If you don&#39;t mind getting personal, how do you make time or find situations for intimacy. That seems to be our only drawback.<br/>\n </span></blockquote>********************<br/>\n<br/>\nUsually the biggest obstacle to intimacy when you have kids is your own expectations - if you expect to get an hour and half of &quot;adult time&quot; in the evenings, in your bed, where you can talk and connect and maybe make love, then you can find yourself stymied. It helps a lot to break up that expectation into seeing a lot of little needs that can all be met in other times and ways. <br/>\n<br/>\nLearn to multi-task a bit more, so that you can connect with your husband and child at the same time. Lean against each other while admiring your child&#39;s latest project, blow kisses across his head while you read together or play a game, say sweet things in passing, ambush one another in the bathroom while your kid is watching tv. Wake up late at night or early in the morning for sex and get out of the bedroom if you can do it without waking your son. <br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n Thanks again for your response.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Deborah<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Genevieve Raymond &lt;genevieve.raymond@&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; I&#39;ve been lurking here for awhile, but wanted to jump in and let you know<br/>\n&gt; &gt; that our almost 7-year old twins have been co-sleeping with us from the very<br/>\n&gt; &gt; beginning.  They&#39;ve yet to have any interest in sleeping in their own beds,<br/>\n&gt; &gt; and we&#39;ve always been happy to have them with us.  (Actually, the kids and I<br/>\n&gt; &gt; sleep together, and my husband sleeps in a different bed in the same room.<br/>\n&gt; &gt;  Occasionally my son will sleep with John.  And John and I find other ways<br/>\n&gt; &gt; to get our snuggly time together--I don&#39;t buy that co-sleeping by definition<br/>\n&gt; &gt; harms your relationship.)  I relish all the snuggles and know it won&#39;t be<br/>\n&gt; &gt; forever.  Like your son, my kids are very happy, well-adjusted, and<br/>\n&gt; &gt; confident.  I love cuddling up with them at night and reading books and<br/>\n&gt; &gt; falling asleep together.  And I remember how great it felt growing up when I<br/>\n&gt; &gt; was allowed to sleep in my dad&#39;s bed (my mom died when I was young).  Humans<br/>\n&gt; &gt; are social critters, and as I&#39;m sure you know, our Western culture is one of<br/>\n&gt; &gt; the few where it isn&#39;t the norm for families to sleep in close proximity.<br/>\n&gt; &gt;  I&#39;d say if he&#39;s needing that closeness, then give it to him.  I&#39;m curious<br/>\n&gt; &gt; what you felt you were &quot;asking for&quot; by bringing the question here--I haven&#39;t<br/>\n&gt; &gt; seen anything yet on this list that would make me think folks were either<br/>\n&gt; &gt; adamantly for or against co-sleeping, but I haven&#39;t been here that long<br/>\n&gt; &gt; either...<br/>\n&gt; &gt; <br/>\n&gt; &gt; Genevieve<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; On Sat, Jul 30, 2011 at 1:55 PM, Deb &lt;vwb777@&gt; wrote:<br/>\n&gt; &gt; <br/>\n&gt; &gt; &gt; **<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; My son is seven and for the last year has slept with us stating he was<br/>\n&gt; &gt; &gt; afraid of being alone and that he loved being with us. I know most people<br/>\n&gt; &gt; &gt; would think there was something screwed up about this at his age, but other<br/>\n&gt; &gt; &gt; than the sleeping thing, he&#39;s a perfectly happy, well-adjusted, smart little<br/>\n&gt; &gt; &gt; guy. I know I&#39;m asking for it by bringing this situation here, but I truly<br/>\n&gt; &gt; &gt; do respect the opinions on this board. I appreciate any feedback you have<br/>\n&gt; &gt; &gt; for me. I can take it. Thanks.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;  <br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Co-sleeping","postDate":"1312123170","msgId":62100,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0ODRGMDgxODNFOTRBMEFBMTVFQ0Q3MEVFN0M2MzIwQGRlYm9yYWg0M2YxM2ZkPg==","referencesHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg=="},"prevInTopic":62098,"nextInTopic":62101,"prevInTime":62099,"nextInTime":62101,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"***My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us. *** Dylan slept with us all","messageBody":"<div id=\"ygrps-yiv-1634955419\">***My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us. ***<br/>\n<br/>\nDylan slept with us all the time until he was seven.   At that time we&#39;d moved into a house with an open loft style second story, two small rooms divided by an archway, no door.   He wanted a bunk bed with a futon on the bottom so he could have friends over.    After he got his own bed he still slept with us sometimes, or went to sleep in his bed but came to the big bed sometime in the night.   Sometimes he wanted me to sleep on the bottom bunk.   He slept with us, or me with him, on and off until he was eleven or twelve. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Co-sleeping","postDate":"1312121113","msgId":62098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxM25lcCs5MGQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg=="},"prevInTopic":62097,"nextInTopic":62100,"prevInTime":62097,"nextInTime":62099,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"My oldest slept with me until he was 4 or so, and then, he d go to sleep in his room and end up in mine at some point in the early morning. My youngest, 12,","messageBody":"<div id=\"ygrps-yiv-1030715753\">My oldest slept with me until he was 4 or so, and then, he&#39;d go to sleep in his room and end up in mine at some point in the early morning. My youngest, 12, slept with us until he was 3 or so - he wanted to share the bunk bed with his brother - and he still comes in in the mornings for cuddles and talking if I&#39;m not up before him. <br/>\n<br/>\nI remember it was verboten for my sisters and I to even enter my parents&#39; room, unless our mom was with us - it was *off limits*. Any time we did get to go in, it felt like we were somehow getting away with something. I also remember it was NEVER OK to wake up our parents, no matter what.<br/>\n<br/>\nI don&#39;t react negatively to the boys coming into my room; I&#39;ve never made them feel like my sleep was more important then their needs. I go back to sleep very easily, and I&#39;m able to nap in the afternoons if I need. I suppose if someone else&#39;s circumstances were different, they&#39;d have different ways that worked for them.<br/>\n<br/>\nAll this to say - my oldest, now 18, has been going through a bit of a rough time lately and he has, several times now, come into my room, and laid down while I stroked his hair and we talked until he could get to sleep. I am so glad he knows that that&#39;s OK, and that I&#39;m here for him, and that he doesn&#39;t have to lie sleepless in his room, alone and lonely.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Co-sleeping","postDate":"1312117663","msgId":62097,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTIxMTc2NjMuNjQwOTguWWFob29NYWlsUkNAd2ViODczMDQubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PGoxMjF0YStzaGQyQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxMjF0YStzaGQyQGVHcm91cHMuY29tPg=="},"prevInTopic":62096,"nextInTopic":62098,"prevInTime":62096,"nextInTime":62098,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"I don t not tell, but I don t actively tell either. It s almost a don t ask, don t tell sort of situation. And if someone who is going to look askance at my ","messageBody":"<div id=\"ygrps-yiv-1437683619\">I don&#39;t not tell, but I don&#39;t actively tell either. It&#39;s almost a &quot;don&#39;t ask, <br/>\ndon&#39;t tell&quot; sort of situation. And if someone who is going to look askance at my <br/>\nparenting decisions finds out, I tend to be fairly light on details and change <br/>\nthe subject relatively quickly, if not aggresively. <br/>\n<br/>\n<br/>\nI don&#39;t need other people to approve of what I do, unless they actually have <br/>\nsome kind of authority over me. Most of the world doesn&#39;t have enough relevant <br/>\nauthority to make me nervous about their questions. Being calm about my response <br/>\nis usually the best way I&#39;ve found to keep others from being to invasive in <br/>\ntheir questions or comments. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n<br/>\n<br/>\nDo you tell people about your sleeping arrangements and if so, what have their <br/>\nreactions been like? I think that might be my hangup-what if &quot;whomever&quot; finds <br/>\nout.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":342163414,"authorName":"Chris Sanders","from":"Chris Sanders &lt;iowaunschoolers@...&gt;","profile":"iaunschoolers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Co-sleeping","postDate":"1312115330","msgId":62096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEzMzFEOEFCLTA3MkYtNEYyMC05RjE1LUMzNzJDRkNCRjQ5OUBnbWFpbC5jb20+","inReplyToHeader":"PGoxMjF0YStzaGQyQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxMjF0YStzaGQyQGVHcm91cHMuY29tPg=="},"prevInTopic":62095,"nextInTopic":62097,"prevInTime":62095,"nextInTime":62097,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"... I only told people if they brought it up in conversation or were asking.  I guess I always felt pretty empowered in most of my non-mainstream parenting","messageBody":"<div id=\"ygrps-yiv-239485006\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; <br/>\n&gt; Do you tell people about your sleeping arrangements and if so, what have their reactions been like? I think that might be my hangup-what if &quot;whomever&quot; finds out.<br/>\n<br/>\n </span></blockquote>I only told people if they brought it up in conversation or were asking.  I guess I always felt pretty empowered in most of my non-mainstream parenting decisions and so the only time anybody ever questioned me about it was when they were wanting more information or advice about co-sleeping, like at  La Leche League meetings and now.  I didn&#39;t volunteer it out of context to people to whom it was none of their business but I also did not complain about nighttime issues, or intimacy with my husband to those people either.  When my sisters-in-laws and I all had babies within weeks of each other, I just kept mum when the subjects of sleeping through the night etc. came up.  They didn&#39;t hear any complaints from me because, although I may not have been getting a full night of uninterrupted sleep, I was getting enough rest and happy with our arrangements.<br/>\n<br/>\nI&#39;ve figured out that for most issues, if you don&#39;t want other&#39;s scorn or advice, don&#39;t complain to them.<br/>\n<br/>\nChris S.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Co-sleeping","postDate":"1312110596","msgId":62095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwOEI3QTc1LTk2N0EtNEVBMy1COUFCLTA0RDE3RUFDNjc4MEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGoxMjF0YStzaGQyQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxMjF0YStzaGQyQGVHcm91cHMuY29tPg=="},"prevInTopic":62093,"nextInTopic":62096,"prevInTime":62094,"nextInTime":62096,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"... Why would you tell someone about co-sleeping who you suspected might react negatively if that isn t what you want? Not everything needs to be revealed to","messageBody":"<div id=\"ygrps-yiv-1269749198\">On Jul 30, 2011, at 6:51 PM, Deb wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you tell people about your sleeping arrangements and if so, what  <br/>\n&gt; have their reactions been like?<br/>\n<br/>\n </span></blockquote>Why would you tell someone about co-sleeping who you suspected might  <br/>\nreact negatively if that isn&#39;t what you want?<br/>\n<br/>\nNot everything needs to be revealed to everyone just because they ask!  <br/>\nThe art of telling people what they want to hear without actually  <br/>\nlying can be very useful :-)<br/>\n<br/>\nI find it easy to gauge what people are wanting to hear when they ask  <br/>\nquestions. Maybe that&#39;s not so easy for everyone.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Co-sleeping","postDate":"1312110115","msgId":62093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVERTM1OTJBLTM4N0YtNDgyNy1BN0MyLTZGMTY1MjI1NkM5RkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDk4NzRiLjZhNThhN2MxLjNiNjY1ZjZlQGFvbC5jb20+","referencesHeader":"PDk4NzRiLjZhNThhN2MxLjNiNjY1ZjZlQGFvbC5jb20+"},"prevInTopic":62092,"nextInTopic":62095,"prevInTime":62092,"nextInTime":62094,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"... It can be too close if it s closer than the child wants. It can be too close if the mom is putting her needs for closeness ahead of what her child","messageBody":"<div id=\"ygrps-yiv-100558379\">On Jul 31, 2011, at 3:34 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AngelOvFaith@...\">AngelOvFaith@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; how can you be too close<br/>\n&gt; with your child right??<br/>\n<br/>\n </span></blockquote>It can be too close if it&#39;s closer than the child wants.<br/>\n<br/>\nIt can be too close if the mom is putting her needs for closeness  <br/>\nahead of what her child indicates she wants and needs.<br/>\n<br/>\nIt can be too close if the mom is protecting her child rather than  <br/>\nbeing his or her support as they stretch their wings.<br/>\n<br/>\nWhat will help keep someone focused on what they want from radical  <br/>\nunschooling is not how well a mom listens to her needs for her child  <br/>\nbut how well she listens to the child&#39;s needs.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":197445047,"authorName":"AngelOvFaith@aol.com","from":"AngelOvFaith@...","profile":"angelovfaith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Co-sleeping","postDate":"1312097646","msgId":62088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4NzRiLjZhNThhN2MxLjNiNjY1ZjZlQGFvbC5jb20+"},"prevInTopic":62087,"nextInTopic":62090,"prevInTime":62087,"nextInTime":62089,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"Just wanted to add in my story- i was raised an only child, alone in a room at the same time every night, with only a nightlight. I had nightmares everynight.","messageBody":"<div id=\"ygrps-yiv-1127949250\">Just wanted to add in my story- i was raised an only child, alone in a room <br/>\n at the same time every night, with only a nightlight. I had nightmares  <br/>\neverynight. I can tell them in detail from early ages. To this day i still  <br/>\nsuffer from not sleeping through the night, (i wont take sleep meds or  <br/>\nanything), and i also attend a therapist mandated by other issues, but what  <br/>\nbothers me is when i mentioned to a different therapists ive had, (ive changed  <br/>\nthem over the years), i was chastised for co-sleeping with my now 7 yr old  <br/>\ndaughter. <br/>\nWe have been thru much trauma from an ex who would not let her sleep with  <br/>\nus, and i was too naive to know better, only really having my mother to tell <br/>\nme  how things work, as i was tearing my stitches getting up to walk down <br/>\nthe hall  to the &quot;nursery&quot; every night to feed her. i WISH i knew about <br/>\nco-sleeping, the  family bed, and so much more ive learned here and over the <br/>\nyears! <br/>\nIn recent years, i will never let my daughter cry helplessly thru a door or <br/>\n over a monitor again and we leave music or tv on all night whatever is <br/>\nsoothing  for her to fall asleep to. i also have decided that i will never let <br/>\na demand  for sex take precedence over my child&#39;s needs. so my issues with <br/>\nintimacy  are different due to my husbands emotional abuse, unfaithfulness, <br/>\netc. but  the therapists keep saying its unhealthy, that my daughter & i are <br/>\n&quot;too  close&quot;! <br/>\ni have just got a new one and i dont tell her. how can you be too close  <br/>\nwith your child right?? im sorry if a lot of this is me expressing my own  <br/>\nfeelings on it, but i hope it helps you to know as i do now finding comfort in  <br/>\nthat is IS ok. i will let my daughter continue to stay in &quot;our bed&quot; until <br/>\nshe  asks for her own. she has her own room still but only uses it when  <br/>\nfriends sleepover, even then she comes to lay with me sometimes. my mother or  <br/>\nanother man im my life or a therapist will never dictate to me to turn away  <br/>\nmy love for my child and her need for me again. i can only hope that she is  <br/>\nnot already scarred by those early years when i had no support or no <br/>\ninternet at  the time to know about that my instincts were right, i felt something <br/>\n was wrong, but followed what my closeminded little world told me. <br/>\nIm so glad this forum is here, i havnt added much, since im new, but its  <br/>\nall so helpful! <br/>\nL. in PA<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":72396713,"authorName":"windypines98","from":"&quot;windypines98&quot; &lt;rdashaffer@...&gt;","profile":"windypines98","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Co-sleeping","postDate":"1312079169","msgId":62090,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxMmVnMSs0MWFkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg=="},"prevInTopic":62088,"nextInTopic":62091,"prevInTime":62089,"nextInTime":62091,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"I must jump in as well. I am an older mother of a 33 yr old son who co-slept until 11 years old or so.  It comforted him and he felt safe. That simple.  What","messageBody":"<div id=\"ygrps-yiv-733754198\">I must jump in as well. I am an older mother of a 33 yr old son who co-slept until 11 years old or so.  It comforted him and he felt safe. That simple.  What is more loving than to provide an environment that enables any child at any age the security he/she needs in order to sleep?  When he was older, he had a favorite cat who slept with him who made him feel safe.  To this day, my son prefers not sleeping alone and when his wife is unable to visit us with him, we make a slumber party out of his visit and we all sleep in the family room together on couches and sleeping bags! How fun is that?<br/>\nI promise you, it only instills greater trust in you from your child. <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Deb&quot; &lt;vwb777@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us. I know most people would think there was something screwed up about this at his age, but other than the sleeping thing, he&#39;s a perfectly happy, well-adjusted, smart little guy. I know I&#39;m asking for it by bringing this situation here, but I truly do respect the opinions on this board. I appreciate any feedback you have for me. I can take it. Thanks.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":383546898,"authorName":"Sadie Bugni","from":"Sadie Bugni &lt;lotsagr8kidz@...&gt;","profile":"mesarylee","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Co-sleeping","postDate":"1312075346","msgId":62091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVoc3N4TnpBUlZTLUpkdjVtQ3BFaVBuS3RhVHowY2Y9bm81ZkxjTlI0WWNiUEM1QUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62090,"nextInTopic":62092,"prevInTime":62090,"nextInTime":62092,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"About a year and a half ago my family and and I lost our home and all our possessions due to a house fire at 1 AM.  7 of our 10 children were in our room when","messageBody":"<div id=\"ygrps-yiv-1874124744\">About a year and a half ago my family and and I lost our home and all our<br/>\npossessions due to a house fire at 1 AM.  7 of our 10 children were in our<br/>\nroom when I discovered the fire.  We had been watching Star Wars as we went<br/>\nto sleep, but I later moved to the downstairs couch because I was 7 months<br/>\npregnant and wanted more space.  This was our normal bedtime routine.  My<br/>\nhusband and our 12yo daughter had all the kids outside and across the<br/>\nstreet, safe and sound, before I returned from my 15yo son&#39;s room to get him<br/>\nout.<br/>\nWhen we met met with the fire Marshall the next morning, he was so fixated<br/>\non the fact that &quot;all those kids&quot; were in our room.  Had they not been, our<br/>\n4 girls would be gone.  Their room disappeared withing 5 minutes of the fire<br/>\nstarting, even before the smoke detectors went off.<br/>\nWe still co sleep.  I share this because I think we all have instincts to do<br/>\ncertain things within our families, even without knowing why certain things<br/>\nare right for us.  If you and your kids are comfortable with co sleeping,<br/>\nthen that&#39;s what&#39;s right for your family.  It may not be our society&#39;s norm,<br/>\nbut don&#39;t let that deter you from making the best choices for your family:)<br/>\n<br/>\nSadie Bugni<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":233098946,"authorName":"Lisa E Biesemeyer","from":"Lisa E Biesemeyer &lt;l.biesemeyer@...&gt;","profile":"l.biesemeyer@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Co-sleeping","postDate":"1312074790","msgId":62087,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTIwNzQ3OTAuMTIyMzAuWWFob29NYWlsUkNAd2ViODM1MDYubWFpbC5zcDEueWFob28uY29tPg==","inReplyToHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg=="},"prevInTopic":62086,"nextInTopic":62088,"prevInTime":62086,"nextInTime":62088,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"I second what everyone who has already posted has said. I want to add that if your son, at 7 (or 8 or 9or 10...) is  a perfectly happy, well-adjusted, smart ","messageBody":"<div id=\"ygrps-yiv-940757\">I second what everyone who has already posted has said. I want to add that if <br/>\nyour son, at 7 (or 8 or 9or 10...) is &quot; a perfectly happy, well-adjusted, smart <br/>\nlittle guy&quot;, then I think you have whatever answers you&#39;re seeking. Keep <br/>\nco-sleeping if it&#39;s working for him and for you.<br/>\n<br/>\nAs far as intimacy is concerned, there are likely plenty of rooms with  inviting <br/>\nareas/surfaces in your home where your partner and you can connect. My husband <br/>\nand I co-bed with our 3 children, and we spend our private time in the family <br/>\nroom. It works just fine. And, when I have discussed issues of intimacy with <br/>\nfriends who don&#39;t co-sleep, there are still plenty of challenges EVEN WHEN they <br/>\nare the only two in the bed/bedroom.<br/>\n<br/>\n<br/>\nLisa B <br/>\n<br/>\n <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211307854,"authorName":"Carol","from":"Carol &lt;mykaylabee@...&gt;","profile":"sognokids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Co-sleeping","postDate":"1312069821","msgId":62086,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVGNzMyQzY2LTk1REYtNDc0Ri04MTNELUE3RDJFRkI0REE4MUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGoxMjExaCtobTB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGoxMjExaCtobTB0QGVHcm91cHMuY29tPg=="},"prevInTopic":62084,"nextInTopic":62087,"prevInTime":62085,"nextInTime":62087,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"My daughter came to us at 11 months through the foster care system, and then we were finally (FINALLY!) able to adopt her when she was 3 1/2.  She co-slept","messageBody":"<div id=\"ygrps-yiv-209571702\">My daughter came to us at 11 months through the foster care system, and then we were finally (FINALLY!) able to adopt her when she was 3 1/2.  She co-slept with us from day one until she was 7-ish, then for the next year I slept with her off and on in a bed in her room, per her request.  It drove my mother nuts!  She was constantly telling me that we were &quot;spoiling&quot; her.  I never understood how making this child (who had come from an abusive background) feel safe and loved was spoiling her.  Ridiculous!<br/>\n<br/>\nIn all those years of co-sleeping, I don&#39;t remember sleeping particularly well.  But every time I woke up from a kick in the ribs or the sound of snoring in my ear, I would lay in bed and revel in my joy at having this child in my life.  It was a precious time for me, and it blanketed my daughter in love.<br/>\n<br/>\nCarol<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":475251512,"authorName":"Deb","from":"&quot;Deb&quot; &lt;vwb777@...&gt;","profile":"vwb777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Co-sleeping","postDate":"1312066282","msgId":62092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxMjF0YStzaGQyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4NkI2QUFGLUNDMTYtNDg5OS1BN0UwLTE5OEQzMjZGRDlBOUBnbWFpbC5jb20+"},"prevInTopic":62091,"nextInTopic":62093,"prevInTime":62091,"nextInTime":62093,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"Do you tell people about your sleeping arrangements and if so, what have their reactions been like? I think that might be my hangup-what if whomever finds","messageBody":"<div id=\"ygrps-yiv-1711227923\">Do you tell people about your sleeping arrangements and if so, what have their reactions been like? I think that might be my hangup-what if &quot;whomever&quot; finds out.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Chris Sanders &lt;iowaunschoolers@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt; My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us. I know most people would think there was something screwed up about this at his age, but other than the sleeping thing, he&#39;s a perfectly happy, well-adjusted, smart little guy. I know I&#39;m asking for it by bringing this situation here, but I truly do respect the opinions on this board. I appreciate any feedback you have for me. I can take it. Thanks.<br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; Both of our kids co-slept with us until 7 - 8 years old.   Zach (who is now 20) moved out and into his own room when our bed got to be too crowded after his sister was born.  We all co-slept for a couple months but he was a heavy sleeper and found his baby sister to be a soft pillow! She didn&#39;t like that much.  Their dad slept up in Zach&#39;s room for many months, until Zach felt comfortable sleeping alone. <br/>\n&gt; <br/>\n&gt; Zoe (now 13) slept with us until she was 8 and wanted to sleep in her own bed.  We still tuck her in and hang out with her in her bedroom, often lying with her, until she&#39;s very sleepy. The usual routine is she&#39;ll come into my bed to snuggle with me first, because I go to sleep before she does.  Then her dad hangs out with her room until she&#39;s sleepy.<br/>\n&gt; <br/>\n&gt; Co-sleeping -- healthy and normal.<br/>\n&gt; <br/>\n&gt; Chris S.<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":363518215,"authorName":"Claire","from":"&quot;Claire&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Co-sleeping","postDate":"1312065393","msgId":62082,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxMjExaCtobTB0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQ4NkI2QUFGLUNDMTYtNDg5OS1BN0UwLTE5OEQzMjZGRDlBOUBnbWFpbC5jb20+"},"prevInTopic":62081,"nextInTopic":62084,"prevInTime":62081,"nextInTime":62083,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"Our kids slept in our bed until they were around 2, then we set up extendable Ikea beds for them in the family bedroom so that we can all sleep in the one","messageBody":"<div id=\"ygrps-yiv-525817598\">Our kids slept in our bed until they were around 2, then we set up extendable Ikea beds for them in the family bedroom so that we can all sleep in the one room. Our 6.5 year old joins us in the &#39;big bed&#39; at some point every night, which is totally fine. I love cuddling her and knowing that she feels safe. I also hop into my younger daughter&#39;s bed at least once each night so that she can have a breast-feed (yes, a 4-year old still breast-feeding!)<br/>\n<br/>\nI want to second what the previous poster said, bed-sharing is healthy and normal. In Indonesia, where I have spent lots of time, it is unheard of for anyone, let alone babies and young children, to sleep alone.<br/>\n<br/>\nClaire</div>","specialLinks":[]},{"userId":342163414,"authorName":"Chris Sanders","from":"Chris Sanders &lt;iowaunschoolers@...&gt;","profile":"iaunschoolers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Co-sleeping","postDate":"1312063086","msgId":62081,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ4NkI2QUFGLUNDMTYtNDg5OS1BN0UwLTE5OEQzMjZGRDlBOUBnbWFpbC5jb20+","inReplyToHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg=="},"prevInTopic":62080,"nextInTopic":62082,"prevInTime":62080,"nextInTime":62082,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"... Both of our kids co-slept with us until 7 - 8 years old.   Zach (who is now 20) moved out and into his own room when our bed got to be too crowded after","messageBody":"<div id=\"ygrps-yiv-852679757\"><blockquote><span title=\"ireply\">&gt; My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us. I know most people would think there was something screwed up about this at his age, but other than the sleeping thing, he&#39;s a perfectly happy, well-adjusted, smart little guy. I know I&#39;m asking for it by bringing this situation here, but I truly do respect the opinions on this board. I appreciate any feedback you have for me. I can take it. Thanks.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Both of our kids co-slept with us until 7 - 8 years old.   Zach (who is now 20) moved out and into his own room when our bed got to be too crowded after his sister was born.  We all co-slept for a couple months but he was a heavy sleeper and found his baby sister to be a soft pillow! She didn&#39;t like that much.  Their dad slept up in Zach&#39;s room for many months, until Zach felt comfortable sleeping alone. <br/>\n<br/>\nZoe (now 13) slept with us until she was 8 and wanted to sleep in her own bed.  We still tuck her in and hang out with her in her bedroom, often lying with her, until she&#39;s very sleepy. The usual routine is she&#39;ll come into my bed to snuggle with me first, because I go to sleep before she does.  Then her dad hangs out with her room until she&#39;s sleepy.<br/>\n<br/>\nCo-sleeping -- healthy and normal.<br/>\n<br/>\nChris S.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Co-sleeping","postDate":"1312061458","msgId":62080,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxMXQ2aStmMDJjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg=="},"prevInTopic":62079,"nextInTopic":62081,"prevInTime":62079,"nextInTime":62081,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"... Deb, I m not even sure what you re asking. Are you asking if parents here find co-sleeping with older children odd or bad? Our daughter will be eight next","messageBody":"<div id=\"ygrps-yiv-456522846\">--- I know I&#39;m asking for it by bringing this situation here-----<br/>\n<br/>\nDeb, I&#39;m not even sure what you&#39;re asking.<br/>\n<br/>\nAre you asking if parents here find co-sleeping with older children odd or bad?<br/>\n<br/>\nOur daughter will be eight next month and she still sleeps with us, has since the day she was born.  I think you&#39;ll find that it is pretty common. Personally, I think it is a wonderful way for families to feel connected.  I was scared, every night as a 6-8 year old child, when I couldn&#39;t sleep with my parents.<br/>\n<br/>\nI read once that the percentage of kids who sleep with their parents is actually quite high, but many parents are afraid to admit it.  Ah, here is this statistic (65%): <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ncbi.nlm.nih.gov/pubmed/11341178?dopt=Abstract\">http://www.ncbi.nlm.nih.gov/pubmed/11341178?dopt=Abstract</a><br/>\n<br/>\nCo-sleeping is pretty common outside of the Western world: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dur.ac.uk/resources/sleep.lab/resources/11Meredith%20Small%20Mothering%20Article%201-11-98.htm\">http://www.dur.ac.uk/resources/sleep.lab/resources/11Meredith%20Small%20Mothering%20Article%201-11-98.htm</a><br/>\n<br/>\nThe Mothering magazine website has a whole section dedicated to co sleeping, and I found this lovely article by a co-sleeping dad there:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://mothering.com/parenting/real-men-sleep-with-their-kids\">http://mothering.com/parenting/real-men-sleep-with-their-kids</a><br/>\n<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":475251512,"authorName":"Deb","from":"&quot;Deb&quot; &lt;vwb777@...&gt;","profile":"vwb777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Co-sleeping","postDate":"1312061269","msgId":62084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxMXQwbCt1YmMwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBS0xzV1k3RlJYZUFUNE1naWNuaXRhWjRaaTJHM2p5LXFpaG5SZVM2MWMycVAtQmh4Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":62082,"nextInTopic":62086,"prevInTime":62083,"nextInTime":62085,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"Oh my gosh I m so thrilled to hear about your 7year old twins sleeping with you. I was kind of afraid of what responses I would get. If you don t mind getting","messageBody":"<div id=\"ygrps-yiv-700384164\">Oh my gosh I&#39;m so thrilled to hear about your 7year old twins sleeping with you. I was kind of afraid of what responses I would get. If you don&#39;t mind getting personal, how do you make time or find situations for intimacy. That seems to be our only drawback. Thanks again for your response.<br/>\n<br/>\nDeborah<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Genevieve Raymond &lt;genevieve.raymond@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I&#39;ve been lurking here for awhile, but wanted to jump in and let you know<br/>\n&gt; that our almost 7-year old twins have been co-sleeping with us from the very<br/>\n&gt; beginning.  They&#39;ve yet to have any interest in sleeping in their own beds,<br/>\n&gt; and we&#39;ve always been happy to have them with us.  (Actually, the kids and I<br/>\n&gt; sleep together, and my husband sleeps in a different bed in the same room.<br/>\n&gt;  Occasionally my son will sleep with John.  And John and I find other ways<br/>\n&gt; to get our snuggly time together--I don&#39;t buy that co-sleeping by definition<br/>\n&gt; harms your relationship.)  I relish all the snuggles and know it won&#39;t be<br/>\n&gt; forever.  Like your son, my kids are very happy, well-adjusted, and<br/>\n&gt; confident.  I love cuddling up with them at night and reading books and<br/>\n&gt; falling asleep together.  And I remember how great it felt growing up when I<br/>\n&gt; was allowed to sleep in my dad&#39;s bed (my mom died when I was young).  Humans<br/>\n&gt; are social critters, and as I&#39;m sure you know, our Western culture is one of<br/>\n&gt; the few where it isn&#39;t the norm for families to sleep in close proximity.<br/>\n&gt;  I&#39;d say if he&#39;s needing that closeness, then give it to him.  I&#39;m curious<br/>\n&gt; what you felt you were &quot;asking for&quot; by bringing the question here--I haven&#39;t<br/>\n&gt; seen anything yet on this list that would make me think folks were either<br/>\n&gt; adamantly for or against co-sleeping, but I haven&#39;t been here that long<br/>\n&gt; either...<br/>\n&gt; <br/>\n&gt; Genevieve<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On Sat, Jul 30, 2011 at 1:55 PM, Deb &lt;vwb777@...&gt; wrote:<br/>\n&gt; <br/>\n&gt; &gt; **<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; My son is seven and for the last year has slept with us stating he was<br/>\n&gt; &gt; afraid of being alone and that he loved being with us. I know most people<br/>\n&gt; &gt; would think there was something screwed up about this at his age, but other<br/>\n&gt; &gt; than the sleeping thing, he&#39;s a perfectly happy, well-adjusted, smart little<br/>\n&gt; &gt; guy. I know I&#39;m asking for it by bringing this situation here, but I truly<br/>\n&gt; &gt; do respect the opinions on this board. I appreciate any feedback you have<br/>\n&gt; &gt; for me. I can take it. Thanks.<br/>\n&gt; &gt;<br/>\n&gt; &gt;  <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":223034209,"authorName":"Genevieve Raymond","from":"Genevieve Raymond &lt;genevieve.raymond@...&gt;","profile":"genevieveraymond","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Co-sleeping","postDate":"1312060320","msgId":62079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBS0xzV1k3RlJYZUFUNE1naWNuaXRhWjRaaTJHM2p5LXFpaG5SZVM2MWMycVAtQmh4Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg=="},"prevInTopic":62078,"nextInTopic":62080,"prevInTime":62078,"nextInTime":62080,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"I ve been lurking here for awhile, but wanted to jump in and let you know that our almost 7-year old twins have been co-sleeping with us from the very ","messageBody":"<div id=\"ygrps-yiv-1767747009\">I&#39;ve been lurking here for awhile, but wanted to jump in and let you know<br/>\nthat our almost 7-year old twins have been co-sleeping with us from the very<br/>\nbeginning.  They&#39;ve yet to have any interest in sleeping in their own beds,<br/>\nand we&#39;ve always been happy to have them with us.  (Actually, the kids and I<br/>\nsleep together, and my husband sleeps in a different bed in the same room.<br/>\n Occasionally my son will sleep with John.  And John and I find other ways<br/>\nto get our snuggly time together--I don&#39;t buy that co-sleeping by definition<br/>\nharms your relationship.)  I relish all the snuggles and know it won&#39;t be<br/>\nforever.  Like your son, my kids are very happy, well-adjusted, and<br/>\nconfident.  I love cuddling up with them at night and reading books and<br/>\nfalling asleep together.  And I remember how great it felt growing up when I<br/>\nwas allowed to sleep in my dad&#39;s bed (my mom died when I was young).  Humans<br/>\nare social critters, and as I&#39;m sure you know, our Western culture is one of<br/>\nthe few where it isn&#39;t the norm for families to sleep in close proximity.<br/>\n I&#39;d say if he&#39;s needing that closeness, then give it to him.  I&#39;m curious<br/>\nwhat you felt you were &quot;asking for&quot; by bringing the question here--I haven&#39;t<br/>\nseen anything yet on this list that would make me think folks were either<br/>\nadamantly for or against co-sleeping, but I haven&#39;t been here that long<br/>\neither...<br/>\n<br/>\nGenevieve<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Jul 30, 2011 at 1:55 PM, Deb &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:vwb777@...\">vwb777@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; My son is seven and for the last year has slept with us stating he was<br/>\n&gt; afraid of being alone and that he loved being with us. I know most people<br/>\n&gt; would think there was something screwed up about this at his age, but other<br/>\n&gt; than the sleeping thing, he&#39;s a perfectly happy, well-adjusted, smart little<br/>\n&gt; guy. I know I&#39;m asking for it by bringing this situation here, but I truly<br/>\n&gt; do respect the opinions on this board. I appreciate any feedback you have<br/>\n&gt; for me. I can take it. Thanks.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":475251512,"authorName":"Deb","from":"&quot;Deb&quot; &lt;vwb777@...&gt;","profile":"vwb777","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Co-sleeping","postDate":"1312059357","msgId":62078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxMXI0dCtkZDlnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62079,"prevInTime":62077,"nextInTime":62079,"topicId":62078,"numMessagesInTopic":0,"msgSnippet":"My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us. I know most people would think","messageBody":"<div id=\"ygrps-yiv-289017510\">My son is seven and for the last year has slept with us stating he was afraid of being alone and that he loved being with us. I know most people would think there was something screwed up about this at his age, but other than the sleeping thing, he&#39;s a perfectly happy, well-adjusted, smart little guy. I know I&#39;m asking for it by bringing this situation here, but I truly do respect the opinions on this board. I appreciate any feedback you have for me. I can take it. Thanks.</div>","specialLinks":[]}],"prevTopicId":65214,"nextTopicId":65230}}