{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":218609473,"authorName":"b0b_5mith","from":"&quot;b0b_5mith&quot; &lt;rws@...&gt;","profile":"b0b_5mith","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Drugs and Rehabs...parents...","postDate":"1113692160","msgId":105365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzczU2MCthb2xyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMmEwMWM1NDI4NSQ0NDMyYTMyMCQwYjAwMDAwYUBNb20+"},"prevInTopic":105345,"nextInTopic":0,"prevInTime":105364,"nextInTime":105366,"topicId":105344,"numMessagesInTopic":0,"msgSnippet":"... ```````````````````````````````````````````````````````````````````````` ... not like to or ever want to put blame on any one for someone s drug use But","messageBody":"<div id=\"ygrps-yiv-1252722894\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;The Klein Crew&quot; &lt;kleincrew@p...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; So many teens really have nothing much to do with their parents - they <br/>\n&gt; don&#39;t communicate, the parents don&#39;t know their friends, the kids would <br/>\n&gt; never confide in their parents, ask their advice, care about what they <br/>\n&gt; think. Interestingly, by focusing on our relationship first, I think we <br/>\n&gt; DO tend to have far more influence <br/>\n </span></blockquote>````````````````````````````````````````````````````````````````````````<br/>\n```````````````<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>```````````````````````````````````````````````````````````````````````<br/>\n<blockquote><span title=\"ireply\"> &gt; Bob,<br/>\n&gt;  I feel for you about your 15 year old niece...I do But. The above is so very very true, I do <br/>\n </span></blockquote>not like to or ever want to put blame on any one for someone&#39;s drug use But there are <br/>\nthings in life that can help you make the decision to use or not use drugs and If a child <br/>\nisn&#39;t close to there parents,siblings then that could really affect them to the point of not <br/>\nreally knowing who they are or if they are really cared for or loved. <br/>\n<blockquote><span title=\"ireply\"> &gt; When I was young My parents owned a bar, so I grew up in bars and did my share of <br/>\n </span></blockquote>sipping some wine , beer, whatever very early on, I thought I had a close relationship with <br/>\nmy parents but now as I look back NO I did not, they both worked, and they didn&#39;t know <br/>\nmy friends, never really knew where I was or who I was with. They didn&#39;t do that on <br/>\npurpose, they did the best they knew how, they thought by my father holding down a full <br/>\ntime job in NYC and then coming back to Jersey at night and working at the bar with my <br/>\nMom was for the good of our family...Money was that way of thinking...anyway this is my <br/>\nstory please do not rip my head off about how I believe... For ME, I think the drinking lead <br/>\nto OK now I want to try the High from POT, which led to OK now I want to try the High <br/>\nfrom acid, then Coke which almost killed me, made me want to kill myself.... I moved out <br/>\nof my folks home at age 18 so they really didn&#39;t know I was using drugs ...just drinking, <br/>\nwhich if you own a bar and are with people that drink everyday that is normal...doesn&#39;t <br/>\nevery body drink daily...good day have a drink, BAD Day must drink...that&#39;s what I saw...<br/>\n<blockquote><span title=\"ireply\"> &gt; when I was 23 I packed up all I owned and moved across country to AZ. I was trying to <br/>\n </span></blockquote>&quot;find&quot; myself, I was running from myself but when I got to AZ who met me at the door but <br/>\nme...the drugs  and all the kind of people that went with that life. My family caught wind <br/>\nof what I mess I was. My brother ( not my father mind you) flew out to AZ to take me back <br/>\nto Jersey to put me away (rehab) well I was such a great manipulate that I talked my way <br/>\nout of that, they threatened me that I could never see my nephews again and yadda yadda <br/>\nyadda, none of that would have stopped me from using the drugs not even if they did haul <br/>\nme off and lock me up, NO ONE could stop another person from , drinking, or drug use or <br/>\novereating for that matter it HAS to come from within the person themselves. about 6 <br/>\nmonths after my brother came to AZ to take me to a rehab I moved back to Jersey into my <br/>\nparents house months went by and ME myself and I made a call one Monday after being up <br/>\nfor 3 or 4 days (from the coke)MIA my family called me cause I would be gone for days on <br/>\nend, I of course told them I was just staying with friends...partying...with whoever, <br/>\nwherever, whenever they did not know. They led busy lives too busy to see what was <br/>\nwrong with me and I felt very unloved and did not know how at this point to talk to anyone <br/>\nabout it let alone my family...So I made a call and called a rehab, I was there for 49 days ( <br/>\nit was a 28 day program ) from there I agreed to go to a halfway housefor 3 months and <br/>\nhave been clean and sober since 1989.<br/>\n<blockquote><span title=\"ireply\"> &gt; What I  am trying to say, be a parent that is NON threatening to your children, be there <br/>\n </span></blockquote>friend,  let them feel so close that they can come to you with anything, I did not have <br/>\nthat.... maybe your niece didn&#39;t have that, and that with the peer pressure at school was <br/>\njust too much to handle.<br/>\n<blockquote><span title=\"ireply\"> &gt; So many people tell me Oh I  am close to my kids , I am there friend...but they don&#39;t <br/>\n </span></blockquote>even know the kids favorite color,.... there dreams...... I think we have to be very intimate <br/>\nwith our kids and we have to be honest with ourselves...do we really know our own child? I <br/>\nhope that your aunt and uncle are trying to work on what they could do to KNOW there <br/>\nown child and that they don&#39;t put to much blame on her after all SHE IS STILL ALIVE TO <br/>\nLOVE. It could have been much much worse.<br/>\n<blockquote><span title=\"ireply\"> &gt; I do believe that alcoholism is in ones genes, my father is one , my husband is a <br/>\n </span></blockquote>recovering  as am I and my husbands father is a alcoholic..so if my kids want to drink...It <br/>\nwill be very hard but I will tell them all I know and let them decide. Do I think drinking <br/>\ncould lead to drug use ... it did for me so YES, does POT lead to harder drugs, it did for me <br/>\nso YES, so if my kids want to smoke pot ...well I will just have to cross that bridge when I <br/>\nget to it, for now my 14 year old really is against any kind of &quot;crap&quot; that people put into <br/>\nthere bodies , he is very natural and a vegetarian so I hope that he never wants to try to&quot; <br/>\nescape &quot; from his life and try drugs And since I have all that experience from using drugs <br/>\nbelieve me I pass it all on to my kids.<br/>\n<blockquote><span title=\"ireply\"> &gt; I think for me that and the peer pressure from the kids at school ( you know it wasn&#39;t <br/>\n </span></blockquote>pressure from the kids it was me feeling like crap about myself that led me to &quot;seek&quot; out <br/>\nthe drug users..they are there, I started at 12 with the drugs and today I here they are in <br/>\nthe grammar schools...scary and so sad) well all of that is one of my main reasons for <br/>\nnever putting my kids in a public school, I really didn&#39;t see much good in it , allot of bad <br/>\nnot much good!<br/>\n<blockquote><span title=\"ireply\"> &gt; sorry this was so long I hate to write stuff out I would much rather have &quot;talked&quot; it out <br/>\n </span></blockquote>so I know you all understood what I have just wrote.<br/>\n<blockquote><span title=\"ireply\"> &gt; Have a great weekend all,<br/>\n&gt; Heidi<br/>\n<br/>\n<br/>\n </span></blockquote>Thanks so much Heidi for your reply. I&#39;m glad you&#39;ve gotten a handle on your addiction <br/>\nand thanks for being so willing to share your past. My wife&#39;s parents owned a bar when <br/>\nshe was young as well and her experience, at least as a child and her opinions of drinking <br/>\nare similar to yours. I&#39;ve often said that I think another reasons that people are willing to <br/>\nexperiment with other drugs after pot is that they realize that pot is no big deal, at least <br/>\nno where near as bad as they were lead to believe in the videos they were forced to sit <br/>\nthrough in school. So then they wonder, if perhaps there&#39;s really no big deal with other <br/>\ndrugs as well. And unfortunately as you well know, that&#39;s the nature of other drugs. In the <br/>\nbeginning the drugs itself convinces you that it isn&#39;t a big deal.<br/>\n<br/>\nI know what you mean when you say that the addict has to choose the help. If he/she isn&#39;t <br/>\nready they are very likely to return to the drug. In fact, even when they are ready they are <br/>\nstill somewhat likely to return to the drug. I&#39;m glad you&#39;ve stayed sober and done so well <br/>\nfor yourself with your wonderful family.<br/>\n<br/>\nAs for my cousin and her family, they are still giving her her freedom. My uncle told me <br/>\nthat she told him she was going to go visit some friends. He asked her if she thought she <br/>\nwas making a good decision, and she said yes. Later that night, she called home and said <br/>\nshe had decided to spend the night. Again he asked if she thought she was making a good <br/>\ndecision, and again she said yes. At about 2am she came in because some of her &quot;friends&quot; <br/>\nhad decided to get high, and she knew she shouldn&#39;t be there anymore. My uncle and I <br/>\ncried together as he told me the story. As the saying goes, they are taking it one day at a <br/>\ntime.<br/>\n<br/>\nThanks for your thoughtful and personal reply,<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Drugs and Rehabs...parents...","postDate":"1113661212","msgId":105345,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRhLjIzZTNjZWQ4LjJmOTI3OTFjQGFvbC5jb20+"},"prevInTopic":105344,"nextInTopic":105365,"prevInTime":105344,"nextInTime":105346,"topicId":105344,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/16/2005 8:06:11 AM Mountain Daylight Time, kleincrew@power1.com writes: I do  believe that alcoholism is in ones genes, my father is one ,","messageBody":"<div id=\"ygrps-yiv-372679280\">In a message dated 4/16/2005 8:06:11 AM Mountain Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kleincrew@...\">kleincrew@...</a> writes:<br/>\n<br/>\nI do  believe that alcoholism is in ones genes, my father is one , my husband <br/>\nis a  recovering  as am I and my husbands father is a alcoholic..so if my <br/>\nkids  want to drink...It will be very hard but I will tell them all I know and <br/>\nlet  them decide<br/>\n<br/>\n<br/>\n===========<br/>\n <br/>\nMy parents raised two cousins with us. Both their parents were  bigtime <br/>\nalcoholics, with violence and threats and neglect thrown in.<br/>\n <br/>\nMy parents were one alcoholic (mom) and one non.  <br/>\nOf my mom&#39;s parents, I think one was (her dad) and one not (her mom).<br/>\nMy dads, neither.<br/>\n <br/>\nSo I had one in four alcoholic grandparents. <br/>\n <br/>\nMy cousins had at least two and maybe three alcoholic grandparents.   There <br/>\nwere five siblings.  I think one escaped alcoholism.  The girls  who grew up <br/>\nwith us are both, sadly, drinking very much.  Of their nine  combined children, <br/>\nI hear good stories of two of them, and alcohol and drug  stories of the other <br/>\nseven.<br/>\n <br/>\nI drink very infrequently, and have no urge between times, nor ever go past  <br/>\ntwo drinks (usually one, and more usually none).<br/>\nMy sister was drinking but quit when her three children were  young. She <br/>\nabstains entirely, out of knowledge and fear.   One of her kids been in trouble <br/>\nwith the law for alcohol and  drugs.  One is NOT using any thing (the eldest).  <br/>\nOne, I&#39;m not sure  (and he might not be yet either; he&#39;s 19).<br/>\n <br/>\nOf my three, unknown yet.  But my husband&#39;s parents aren&#39;t alcoholics,  so <br/>\nmine might only have one alcoholic grandparent and maybe only one alcoholic  <br/>\ngreat grandparent.  That&#39;s a pretty clean line, compared to my cousin&#39;s  kids who <br/>\nseem to have have four alcoholic grandparents (cousin&#39;s two parents and  her <br/>\nex husband&#39;s two).<br/>\n <br/>\nThat&#39;s not a huge statistical sampling, but it&#39;s a snapshot family  <br/>\ncomparison, and though they did have the trauma of the early childhood problems  and of <br/>\ngrowing up with relatives, we all grew up in the same household.  So  it <br/>\nseems clearly nature and not nurture there.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":200184763,"authorName":"The Klein Crew","from":"&quot;The Klein Crew&quot; &lt;kleincrew@...&gt;","profile":"kleincrew","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Drugs and Rehabs...parents...","postDate":"1113656858","msgId":105344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmEwMWM1NDI4NSQ0NDMyYTMyMCQwYjAwMDAwYUBNb20+","referencesHeader":"PGQzcHU0ciszZnVrQGVHcm91cHMuY29tPiA8MDcyMmZkZmI3OWNlNThkMjBlZjM5MmNhMmI2NjdjYTJAZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":105345,"prevInTime":105343,"nextInTime":105345,"topicId":105344,"numMessagesInTopic":0,"msgSnippet":"So many teens really have nothing much to do with their parents - they don t communicate, the parents don t know their friends, the kids would never confide in","messageBody":"<div id=\"ygrps-yiv-1115801881\">So many teens really have nothing much to do with their parents - they <br/>\ndon&#39;t communicate, the parents don&#39;t know their friends, the kids would <br/>\nnever confide in their parents, ask their advice, care about what they <br/>\nthink. Interestingly, by focusing on our relationship first, I think we <br/>\nDO tend to have far more influence ```````````````````````````````````````````````````````````````````````````````````````<br/>\n```````````````````````````````````````````````````````````````````````<br/>\nBob,<br/>\n I feel for you about your 15 year old niece...I do But. The above is so very very true, I do not like to or ever want to put blame on any one for someone&#39;s drug use But there are things in life that can help you make the decision to use or not use drugs and If a child isn&#39;t close to there parents,siblings then that could really affect them to the point of not really knowing who they are or if they are really cared for or loved. <br/>\nWhen I was young My parents owned a bar, so I grew up in bars and did my share of sipping some wine , beer, whatever very early on, I thought I had a close relationship with my parents but now as I look back NO I did not, they both worked, and they didn&#39;t know my friends, never really knew where I was or who I was with. They didn&#39;t do that on purpose, they did the best they knew how, they thought by my father holding down a full time job in NYC and then coming back to Jersey at night and working at the bar with my Mom was for the good of our family...Money was that way of thinking...anyway this is my story please do not rip my head off about how I believe... For ME, I think the drinking lead to OK now I want to try the High from POT, which led to OK now I want to try the High from acid, then Coke which almost killed me, made me want to kill myself.... I moved out of my folks home at age 18 so they really didn&#39;t know I was using drugs ...just drinking, which if you own a bar and are with people that drink everyday that is normal...doesn&#39;t every body drink daily...good day have a drink, BAD Day must drink...that&#39;s what I saw...<br/>\nwhen I was 23 I packed up all I owned and moved across country to AZ. I was trying to &quot;find&quot; myself, I was running from myself but when I got to AZ who met me at the door but me...the drugs  and all the kind of people that went with that life. My family caught wind of what I mess I was. My brother ( not my father mind you) flew out to AZ to take me back to Jersey to put me away (rehab) well I was such a great manipulate that I talked my way out of that, they threatened me that I could never see my nephews again and yadda yadda yadda, none of that would have stopped me from using the drugs not even if they did haul me off and lock me up, NO ONE could stop another person from , drinking, or drug use or overeating for that matter it HAS to come from within the person themselves. about 6 months after my brother came to AZ to take me to a rehab I moved back to Jersey into my parents house months went by and ME myself and I made a call one Monday after being up for 3 or 4 days (from the coke)MIA my family called me cause I would be gone for days on end, I of course told them I was just staying with friends...partying...with whoever, wherever, whenever they did not know. They led busy lives too busy to see what was wrong with me and I felt very unloved and did not know how at this point to talk to anyone about it let alone my family...So I made a call and called a rehab, I was there for 49 days ( it was a 28 day program ) from there I agreed to go to a halfway housefor 3 months and have been clean and sober since 1989.<br/>\nWhat I  am trying to say, be a parent that is NON threatening to your children, be there friend,  let them feel so close that they can come to you with anything, I did not have that.... maybe your niece didn&#39;t have that, and that with the peer pressure at school was just too much to handle.<br/>\nSo many people tell me Oh I  am close to my kids , I am there friend...but they don&#39;t even know the kids favorite color,.... there dreams...... I think we have to be very intimate with our kids and we have to be honest with ourselves...do we really know our own child? I hope that your aunt and uncle are trying to work on what they could do to KNOW there own child and that they don&#39;t put to much blame on her after all SHE IS STILL ALIVE TO LOVE. It could have been much much worse.<br/>\nI do believe that alcoholism is in ones genes, my father is one , my husband is a recovering  as am I and my husbands father is a alcoholic..so if my kids want to drink...It will be very hard but I will tell them all I know and let them decide. Do I think drinking could lead to drug use ... it did for me so YES, does POT lead to harder drugs, it did for me so YES, so if my kids want to smoke pot ...well I will just have to cross that bridge when I get to it, for now my 14 year old really is against any kind of &quot;crap&quot; that people put into there bodies , he is very natural and a vegetarian so I hope that he never wants to try to&quot; escape &quot; from his life and try drugs And since I have all that experience from using drugs believe me I pass it all on to my kids.<br/>\nI think for me that and the peer pressure from the kids at school ( you know it wasn&#39;t pressure from the kids it was me feeling like crap about myself that led me to &quot;seek&quot; out the drug users..they are there, I started at 12 with the drugs and today I here they are in the grammar schools...scary and so sad) well all of that is one of my main reasons for never putting my kids in a public school, I really didn&#39;t see much good in it , allot of bad not much good!<br/>\nsorry this was so long I hate to write stuff out I would much rather have &quot;talked&quot; it out so I know you all understood what I have just wrote.<br/>\nHave a great weekend all,<br/>\nHeidi<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Pam Sorooshian <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Saturday, April 16, 2005 1:21 AM<br/>\n  Subject: Re: [UnschoolingDiscussion] Re: Seeking some encouragement...<br/>\n<br/>\n<br/>\n<br/>\n  On Apr 15, 2005, at 7:43 PM, b0b_5mith wrote:<br/>\n<br/>\n  &gt; I suppose by not allowing it I meant to say I will judge it as <br/>\n  &gt; unacceptable. It seems like<br/>\n  &gt; some unschoolers are reluctant to make any sort of judgement statement <br/>\n  &gt; at all. It&#39;s as if<br/>\n  &gt; all behavior is considered fine as long as it&#39;s freely chosen by their <br/>\n  &gt; child. I&#39;m not sure I can<br/>\n  &gt; agreee with that idea.<br/>\n<br/>\n    I think we&#39;re actually a pretty darn judgmental bunch, on the whole. <br/>\n  But we&#39;re perhaps more willing to let other people make their own <br/>\n  mistakes. Or, maybe that&#39;s not quite it either - I think it is that <br/>\n  we&#39;re more realistic about the fact that our kids WILL make their own <br/>\n  mistakes and our focus is not on preventing them from ever making <br/>\n  mistakes, but on keeping our relationship strong.<br/>\n<br/>\n  So many teens really have nothing much to do with their parents - they <br/>\n  don&#39;t communicate, the parents don&#39;t know their friends, the kids would <br/>\n  never confide in their parents, ask their advice, care about what they <br/>\n  think. Interestingly, by focusing on our relationship first, I think we <br/>\n  DO tend to have far more influence than those parents who rely on <br/>\n  control through reward and punishment, for example.<br/>\n<br/>\n  -pam<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":105352,"nextTopicId":105373}}