{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":94803822,"authorName":"tonya wright","from":"&quot;tonya wright&quot; &lt;chatadict2t@...&gt;","profile":"mamamilk85204","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"&quot;Firms make room for maternal act&quot;","postDate":"1029184251","msgId":40815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxOTZCaUM2SGJTenhkV0dIcFAwMDAxNTNjNUBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":40814,"nextInTime":40816,"topicId":40815,"numMessagesInTopic":0,"msgSnippet":"... The secret to life isn t getting what you want it s wanting it once you get it-Katherine Hepburn in Love Affair Remember starting the fire is easy, the","messageBody":"<div id=\"ygrps-yiv-773181845\">______________________________________________________________________<br/>\n<blockquote><span title=\"ireply\"> &gt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:chatadict2t@...\">chatadict2t@...</a> has recommended this article from<br/>\n&gt;The Christian Science Monitor&#39;s electronic edition.<br/>\n&gt;----------------------------------------------------------------------<br/>\n<br/>\n&gt;&gt;Click here to read this story online:<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.csmonitor.com/2002/0805/p14s01-wmwo.html\">http://www.csmonitor.com/2002/0805/p14s01-wmwo.html</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Headline:  Firms make room for maternal act<br/>\n&gt;Byline:  Kathryn Tyler Special to The Christian Science Monitor<br/>\n&gt;Date: 08/05/2002<br/>\n<br/>\n&gt;This month, Emily Resa will return from maternity leave to her job as a<br/>\n&gt;product engineer for DaimlerChrysler in Detroit. She is among the 2.2<br/>\n&gt;million women with infants under age 1 now in the US labor force - a<br/>\n&gt;record high.<br/>\n&gt;<br/>\n&gt;But unlike many mothers who work outside the home, she won&#39;t have to<br/>\n&gt;give up breast-feeding her new daughter.<br/>\n&gt;<br/>\n&gt;DaimlerChrysler is one of the growing number of employers who have<br/>\n&gt;workplace lactation policies and nursing-mothers&#39; rooms.<br/>\n&gt;<br/>\n&gt;&quot;It&#39;s great that they have a room,&quot; says Ms. Resa. Otherwise, &quot;where<br/>\n&gt;would you pump? I wouldn&#39;t like pumping in the bathroom.&quot;<br/>\n&gt;<br/>\n&gt;In fact, that&#39;s where many working mothers go to express their baby&#39;s<br/>\n&gt;milk, a move that can be unsanitary, as well as uncomfortable.<br/>\n&gt;<br/>\n&gt;&quot;A lot of women don&#39;t have their own offices. Many have cubicles and<br/>\n&gt;there&#39;s not a lot of privacy. Most women wouldn&#39;t feel comfortable<br/>\n&gt;pumping in a cubicle,&quot; says Kim Cavaliero, spokeswoman for La Leche<br/>\n&gt;League International, a nonprofit breast-feeding support group based in<br/>\n&gt;Schaumburg, Ill.<br/>\n&gt;<br/>\n&gt;Perhaps that explains why 68 percent of women breast-feed their infants<br/>\n&gt;after birth, but only 31 percent breast-feed after six months, despite<br/>\n&gt;the American Academy of Pediatrics&#39; recommendation that infants be<br/>\n&gt;breast-fed for at least a year.<br/>\n&gt;<br/>\n&gt;&quot;Woman face social ostracism, people not understanding that<br/>\n&gt;breast-feeding is a health choice,&quot; says Elizabeth Baldwin, an attorney<br/>\n&gt;who specializes in breast-feeding and the law, in North Miami Beach,<br/>\n&gt;Fla. &quot;Sometimes they find themselves having to choose their job over<br/>\n&gt;breast-feeding.&quot;<br/>\n&gt;<br/>\n&gt;Finding a private place to pump is only one of the many challenges that<br/>\n&gt;new mothers face when they return to work. They also may be forced to<br/>\n&gt;confront misinformed co-workers whose reactions vary from indifference<br/>\n&gt;to harassment.<br/>\n&gt;<br/>\n&gt;&quot;Our society sexualizes women&#39;s breasts,&quot; says Ms. Cavaliero, so it<br/>\n&gt;makes some people uncomfortable, even when the woman isn&#39;t pumping in<br/>\n&gt;front of them. &quot;Most women breast-feed in a very discreet manner.&quot;<br/>\n&gt;<br/>\n&gt;If a co-worker makes a derogatory comment about pumping, Cavaliero<br/>\n&gt;suggests, &quot;Say &#39;I&#39;m pumping for my child&#39;s nutrition.&#39; Try to educate<br/>\n&gt;the person. If the person is going to be ignorant and rude, and<br/>\n&gt;education doesn&#39;t work, talk to the supervisor.&quot;<br/>\n&gt;<br/>\n&gt;Corner-office concerns<br/>\n&gt;<br/>\n&gt;For some women, it is the supervisor who is not supportive.<br/>\n&gt;<br/>\n&gt;Part of that disapproval may stem from concerns about how long it will<br/>\n&gt;take for an employee to pump. Representatives at companies with<br/>\n&gt;lactation programs say some supervisors worry that the employee will be<br/>\n&gt;gone for an hour at a time. But, experts say, that&#39;s inaccurate. &quot;Most<br/>\n&gt;women take two 15-minute breaks plus lunch to pump,&quot; says Baldwin.<br/>\n&gt;<br/>\n&gt;Even so, it is sometimes difficult to find time away from the job to<br/>\n&gt;pump. Factory workers find it next to impossible to take unscheduled<br/>\n&gt;breaks, while white-collar workers struggle with other time conflicts,<br/>\n&gt;such as meetings.<br/>\n&gt;<br/>\n&gt;If a meeting is scheduled during the time an employee would normally be<br/>\n&gt;expressing milk, she faces a dilemma: miss the meeting or disrupt her<br/>\n&gt;baby&#39;s milk supply. If a woman doesn&#39;t express milk regularly, her milk<br/>\n&gt;supply decreases and, eventually, dries up.<br/>\n&gt;<br/>\n&gt;In June, Sharon Cebulski, a fifth-grade teacher at Glengary Elementary<br/>\n&gt;School in Commerce Township, Mich., gave birth to her second child. She<br/>\n&gt;is worried about how she will continue to breast-feed once the school<br/>\n&gt;year begins again in September.<br/>\n&gt;<br/>\n&gt;&quot;With my first baby, when I went back to work, he got formula in the<br/>\n&gt;daytime [because it was difficult to pump breast milk at work]. But I<br/>\n&gt;was still able to breast-feed him when I came home from work and at<br/>\n&gt;night,&quot; says Ms. Cebulski. &quot;But with this baby, I don&#39;t know. In<br/>\n&gt;October, I am supposed to go to an overnight camp with my students for<br/>\n&gt;a week. I don&#39;t know how I am going to continue breast-feeding.&quot;<br/>\n&gt;<br/>\n&gt;Making &#39;reasonable efforts&#39;?<br/>\n&gt;<br/>\n&gt;Legislation in six states, including Minnesota and California, already<br/>\n&gt;require employers to make reasonable efforts to provide unpaid break<br/>\n&gt;time and a room where employees can express milk.<br/>\n&gt;<br/>\n&gt;Rep. Carolyn Maloney (D) of New York has introduced a bill which would<br/>\n&gt;clarify the Pregnancy Act of 1978 to protect a woman&#39;s right to<br/>\n&gt;breast-feed or express milk during the workday, but it is still being<br/>\n&gt;reviewed in a House subcommittee.<br/>\n&gt;<br/>\n&gt;Still, only 16 percent of employers provide &quot;lactation rooms,&quot;<br/>\n&gt;according to a 2001 benefits survey by the Society for Human Resource<br/>\n&gt;Management.<br/>\n&gt;<br/>\n&gt;Breast-feeding advocates say businesses cannot afford not to offer help.<br/>\n&gt;<br/>\n&gt;&quot;What some companies don&#39;t realize is that setting up a lactation room<br/>\n&gt;is really good for business,&quot; says Cavaliero. &quot;Mothers and babies are<br/>\n&gt;healthier, that saves on insurance and [means] fewer absent days for<br/>\n&gt;the mom. More mothers return to work after having their baby, so the<br/>\n&gt;company doesn&#39;t have to recruit and train new employees.&quot;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;(c) Copyright 2002 The Christian Science Monitor.  All rights reserved.<br/>\n&gt;<br/>\n&gt;&gt;The Christian Science Monitor-- an independent daily newspaper providing <br/>\n&gt;&gt;context and clarity on national and international news, peoples and <br/>\n&gt;&gt;cultures, and social trends.  Online at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.csmonitor.com\">http://www.csmonitor.com</a><br/>\n&gt;<br/>\n&gt;Click here to order a free sample copy of the print edition of the Monitor:<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.csmonitor.com/aboutus/sample_issue.html\">http://www.csmonitor.com/aboutus/sample_issue.html</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>The secret to life isn&#39;t getting what you want it&#39;s wanting it once you get <br/>\nit-Katherine Hepburn in &quot;Love Affair&quot;<br/>\n<br/>\nRemember starting the fire is easy, the hardest part is learning how to keep <br/>\nthe flame-Stevie Nicks &quot;Love&#39;s A Hard Game To Play&quot; Timespace<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nSend and receive Hotmail on your mobile device: <a rel=\"nofollow\" target=\"_blank\" href=\"http://mobile.msn.com\">http://mobile.msn.com</a></div>","specialLinks":[]}],"prevTopicId":40814,"nextTopicId":40813}}