{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Eileen M.","from":"&quot;Eileen M.&quot; &lt;ravensegg@...&gt;","replyTo":"LIST","senderId":"BPBtdKL2WybNPc11VG2RvJvpNfKQOPOGtyTE0z_szsY5ECI9rG5H-WM1-vPtNuGf7LS2gsdJJdrWFICPZ7XrSfNaVvQ5wVhu","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:[Unschooling-dotcom] Extraordinary unschoolers and specia","postDate":"989033231","msgId":20524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTA1MDMyNzExLjg1ODcyLnFtYWlsQHdlYjEwMjA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PGlkLjAyMDUyMDAxMDgwMzEzLjAwMDAwQEZQRT4="},"prevInTopic":20285,"nextInTopic":0,"prevInTime":20523,"nextInTime":20525,"topicId":20285,"numMessagesInTopic":0,"msgSnippet":"My child was not diagnosed officially (we didn t have insurance at the time), but his pediatrician felt that he was definitely on that spectrum, smackdab in","messageBody":"<div id=\"ygrps-yiv-251488247\">My child was not diagnosed officially (we didn&#39;t have<br/>\ninsurance at the time), but his pediatrician felt that<br/>\nhe was definitely on that spectrum, smackdab in the<br/>\nmiddle at least.  I am not a structured person.  He<br/>\nwas overexcitable as far as stimuli goes, so I took<br/>\ndown the pics on the walls and allowed him to set his<br/>\nown pace... the only real structure we had was that I<br/>\ndid &#39;holding&#39; per the book &#39;Holding Time&#39; every day...<br/>\nwe both hated it, but within two weeks of starting it<br/>\nhe was talking a bit and meeting our eyes f the first<br/>\ntime in two years, so we did it.  He was happy,<br/>\nconfident, curious and exploring between the ages of<br/>\ntwo and four (until four he was home with me<br/>\ntwentyfour hours a day)... distractible, overwhelmed<br/>\nby stimuli easily, not terrifically relational on more<br/>\nthan a very glancing way, but affectionate in a<br/>\nhug-and-run way.  <br/>\n<br/>\nThen I put him in a Montessori preschool.  Very<br/>\nstructured... the kids weren&#39;t told what activities<br/>\nthey should do individually, but there were expected<br/>\nroutines for everything, and the group activities were<br/>\nhighly structured.  It was *horrible*.  He lost his<br/>\npotty training, started sucking his thumb again, began<br/>\nhead-banging again, started physically attacking the<br/>\nother kids at random... stressed, stressed, stressed.<br/>\n<br/>\nHe was really damaged there.  I was dumb enough to<br/>\nkeep him in school... I didn&#39;t know about<br/>\nunschooling.... but at least I moved him to another,<br/>\nless structured program and teacher.  He did really<br/>\nwell.  Then he tested into a gifted magnet... back<br/>\ninto a structured program, and I didn&#39;t recognize that<br/>\nit was stressful for him (there were other problems<br/>\nwith the preschool teacher, and I attributed the<br/>\nstress to her personality and the Montessori<br/>\nphilosophy, which was only partly the case).  He&#39;s<br/>\nbeen increasingly unhappy.  This is only partially due<br/>\nto the structure; but he *isn&#39;t* happy with the<br/>\nstructure.  He is *sooooo* happy and relaxed in the<br/>\nsummer, adn soooooooooo stressed and unhappy in<br/>\nschool.  I&#39;m so *glad* we won&#39;t be doing that anymore!<br/>\n<br/>\nEileen<br/>\n<br/>\n<br/>\n--- ambersand &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ambersand@...\">ambersand@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Everyone, except us, says that ALL children need<br/>\n&gt; structure and discipline, but we know different.  It<br/>\n&gt; could be that way with autistic kids too.  Maybe<br/>\n&gt; autistic people are like all other people - some<br/>\n&gt; people like or need or enjoy more structure than<br/>\n&gt; others.  While at the other end of the spectrum,<br/>\n&gt; some want no form of stucture in their life.  I<br/>\n&gt; think if I were to make our days super structured<br/>\n&gt; and then, all of the sudden, change something in the<br/>\n&gt; routine, my kids would freak too.  <br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Auctions - buy the things you want at great prices<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://auctions.yahoo.com/\">http://auctions.yahoo.com/</a></div>","specialLinks":[]},{"userId":0,"authorName":"ambersand","from":"&quot;ambersand&quot; &lt;ambersand@...&gt;","replyTo":"LIST","senderId":"spJjklMxlHts1b1GlTu4qRMH8zLIxI0S3ePdkd760t4P9U6_sGVX7lDXB6iCVy5_VQDmY-vn2RJsjWDI61of9AFg5Q8DvwzEpTEGtPJQggA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:[Unschooling-dotcom] Extraordinary unschoolers and specia","postDate":"988804993","msgId":20285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkLjAyMDUyMDAxMDgwMzEzLjAwMDAwQEZQRT4="},"prevInTopic":0,"nextInTopic":20524,"prevInTime":20284,"nextInTime":20286,"topicId":20285,"numMessagesInTopic":0,"msgSnippet":"It s very widely understood that special  kids, especially those with autism, need structure much more than  regular kids.  I ll grant that this is true until","messageBody":"<div id=\"ygrps-yiv-100023593\">&quot;It&#39;s very widely understood that special  kids, especially those with autism, need structure much more than  regular kids.  I&#39;ll grant that this is true until proven otherwise,  because I know of one autistic boy who is so routine-centered that he  gets upset if his father takes a different route while driving him to  his school or if his teacher deviates from the daily schedule.<br/>\n<br/>\nAre there any parents of special needs kids in the group?  I&#39;m not  referring to dyslexia or ADD, but challenges like Down&#39;s Syndrome and  autism.&quot;<br/>\n<br/>\nA friend has an 8yo autistic son.  They started homeschooling two years ago because the ps would not put him in a class where he could start learning to read, like regular 1st grade.  The ps said he was not able to function at that level.  He reads very well now but they do not unschool.  He has a lot of structure and they do a lot of unit studies.  My friend believes that homeschooling is okay for some and even though her son has done well at home she would never consider letting her older daughter stay home.  <br/>\n<br/>\nAlthough her son has a lot of structure and repitition, I don&#39;t know how he would do otherwise.  Everyone, except us, says that ALL children need structure and discipline, but we know different.  It could be that way with autistic kids too.  Maybe autistic people are like all other people - some people like or need or enjoy more structure than others.  While at the other end of the spectrum, some want no form of stucture in their life.  I think if I were to make our days super structured and then, all of the sudden, change something in the routine, my kids would freak too.  I guess I hate it when people say what a &quot;whole&quot; group, like kids, need or want, instead of looking at the individual in that group. Maybe ALL autistic kids DO need structure....... BUT THEY STILL DON&#39;T NEED SCHOOL.  (I couldn&#39;t stand it - I had to throw that in.)<br/>\n<br/>\nambersand</div>","specialLinks":[]}],"prevTopicId":20330,"nextTopicId":20459}}