{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Elsa Haas","from":"&quot;Elsa Haas&quot; &lt;ElsaHaas@...&gt;","profile":"elsahaas","replyTo":"LIST","senderId":"rYxngn1bsjon9P-j5ge_qxkKkteBV2lmUl0QeUy2emfy0fdml--2kFdlzeonn6d6j5eLa6hiU2JtYZyXVefZnkTwxorun5E","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Re: encouraging writing....was unschooling(long..sorry)","postDate":"1006922997","msgId":28729,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PExPQkJJSkxOQU5GSEpHT05HRE1CS0VGUENHQUEuRWxzYUhhYXNAc2kucnIuY29tPg==","inReplyToHeader":"PDAwYmYwMWMxNzc2ZSQ2MjZiNmQ4MCQwMjAxYThjMEB6b29vZy5vcmc+"},"prevInTopic":28668,"nextInTopic":0,"prevInTime":28728,"nextInTime":28730,"topicId":28668,"numMessagesInTopic":0,"msgSnippet":"I’d hope that, come the time to apply to medical school, she could write a straightforward essay about relevant experience (volunteering in a hospital, for","messageBody":"<div id=\"ygrps-yiv-1724375338\">Id hope that, come the time to apply to medical school, she could write a<br/>\nstraightforward essay about relevant experience (volunteering in a hospital,<br/>\nfor example), and not have to employ the techniques of creative writing,<br/>\nwhich are better suited to fiction and poetry.<br/>\n<br/>\nDid you mean this facetiously?<br/>\n<br/>\nOne of the Colfax kids (of Homeschooling for Excellence, and other books)<br/>\ngot into the Harvard premed program, as I remember. Those kids did things<br/>\nlike goat embryo transplants (at home on their farm) and grinding their own<br/>\nhomemade telescope lenses. Sounds pretty hands-on to me. List a bunch of<br/>\nthings like that in an essay and you wont have to get all creative about<br/>\nit!<br/>\n<br/>\nElsa Haas<br/>\n<br/>\nThis child knows, though, that creative writing will be necessary when it<br/>\ncomes time to write that essay of why she should be admitted to med school<br/>\nover other students.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":0,"authorName":"Sarah Carothers","from":"&quot;Sarah Carothers&quot; &lt;puddles@...&gt;","profile":"sarahjocarothers","replyTo":"LIST","senderId":"MXfK2Lzck1UuXwrJpEQJuChNkFOpCORn3ZXF7MVhDq0NZ6snultyEBrwmmFd2OUMMPufJq3mbyGIxdABltcO8pN4iHHDGjMj4plxZe1nVw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: encouraging writing....was unschooling(long..sorry)","postDate":"1006884452","msgId":28668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYmYwMWMxNzc2ZSQ2MjZiNmQ4MCQwMjAxYThjMEB6b29vZy5vcmc+","referencesHeader":"PDEwMDY4NjE5OTAuNjE2Ljc1NzE3Lm0xMkB5YWhvb2dyb3Vwcy5jb20+IDwwMDQyMDFjMTc3NDQkNjJmNTI5MDAkZWE4OTg1MGFAcGF2aWxpb24+"},"prevInTopic":0,"nextInTopic":28729,"prevInTime":28667,"nextInTime":28669,"topicId":28668,"numMessagesInTopic":0,"msgSnippet":"Yes, I agree that you have to be careful encouraging your children to learn something you believe they need to know.  Having had the experience of living to","messageBody":"<div id=\"ygrps-yiv-1929416873\">Yes, I agree that you have to be careful &quot;encouraging your children&quot; to learn something you believe they need to know.  Having had the experience of living to this ripe old age of 49 (omg.. nearly 50 in a few weeks!), having held several jobs, having attended college, I think I have an understanding of what will be expected of my children in the future and in the careers they each choose to pursue. My children are like night and day... VASTLY different. One wants to become a doctor and, as such, will have to jump several hoops that are in place already if that goal is to become a reality. I have never forced her to write and *she* was the one who wanted the book mentioned earlier, Scraps & Scribbles (honestly, it was an earlier version of the same but had a different name).  Yes, it was *moi* who took her to Borders, guided her to that section and just *happened* to find that book and leave it out for her to &quot;find&quot;.  Controlling? well, yes.. you could certainly say so. Forcing the child to do something she doesn&#39;t want to do? Nope.. not on your life! If she hadn&#39;t picked up the book, I wouldn&#39;t have purchased it because I *know* from *past* experiences (and expenses!!!) that it just doesn&#39;t work!<br/>\nAnyway, when this dd asked me what it takes to become a doc, I read up on the subject, laid out the goundwork for her by telling her what would be required of her and *she* sent me to the store to buy what she needed. They were textbooks (Biology, Latin, Chemistry to be exact).... yessirree... something I *never* dreamed I&#39;d purchase, but there ya go... <br/>\nPart of getting into med school involves some fancy writing skills.... you have to really sell yourself as worthy of their attention. Will my child get that by designing websites and Instant Messaging her friends? nope.. I don&#39;t think so. I mean, take Instant messaging, for instance... from *that*, she&#39;s learned to write in code as the public schooled kids have shown her. (if you don&#39;t have a teen, you probably don&#39;t know what I&#39;m talking about... it&#39;s abbriviated stuff and lots of slang : u for you, cuz for because, &#39;mk for okay). We probably all agree that doctor&#39;s handwriting *looks8 like code, but I don&#39;t think it&#39;s the same thing :-) &lt;g&gt;. This child knows, though, that creative writing will be necessary when it comes time to write that essay of why she should be admitted to med school over other students. I&#39;ve told her about the computer program I mentioned in an earlier post but as of yet, she&#39;s not decided that it&#39;s important enough to address.  I feel sure that one day, it&#39;ll happen. She knows it&#39;s available, she knows what she has to do to reach her goals and I have the confidence in her that she will do what needs be to reach those goals. <br/>\nChild #2 will be another post.. this one is already too long..<br/>\nSarah<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\n  From: Joseph Fuerst <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Tuesday, November 27, 2001 8:06 AM<br/>\n  Subject: [Unschooling-dotcom] Re: encouraging writing....was unschooling<br/>\n<br/>\n<br/>\n  While I think many others posted more thoughtful and kind advice about<br/>\n  writing......I still say you have to be careful about &quot;encouraging your<br/>\n  children&quot; to learn something you believe they need to be taught.  I say<br/>\n  examine yourself thoroughly....where is this need coming from?  Often,  I<br/>\n  think parents efforts at *encouraging* are a thinly veiled attempt to direct<br/>\n  them to what the parent thinks is necessary.  I think pushing,  even subtly,<br/>\n  will drive most children away from the very topics you think they &quot;need to<br/>\n  be taught&quot;   Why can you believe in them learning some things on their own<br/>\n  and in their own good time,  but not others?  Isn&#39;t it because their natural<br/>\n  interest and intrinsic motivation drive them to excel at what they&#39;re<br/>\n  interested in?  Do you think your child will never want to write?  Does it<br/>\n  matter to the child or to you whether &quot;creative writing&quot; is learned?<br/>\n  Susan<br/>\n  (Does creative writing include my 4 yo dd taking the box of 300 Q-tips and<br/>\n  forming them into a reasonable facsimie of her name dozens of time over the<br/>\n  whole floor?)<br/>\n<br/>\n  Encouraging journal writing may be something you could look into. For the<br/>\n  younger kids, Borders has a book called Scraps & Scribbles which is a great<br/>\n  starting point. They offer suggestions of things to write about (past<br/>\n  birthday parties, vacations, favorite relatives, oneself, etc.), and the<br/>\n  book gives plenty of doodle space to get one going.<br/>\n<br/>\n  A friend used a writing program***for her older children when they were<br/>\n  ready to go to college and yet hadn&#39;t ever written any essays or term<br/>\n  papers.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.writeguide.com/\">http://www.writeguide.com/</a><br/>\n  They were very pleased with the program and the motivation it offered her<br/>\n  teen. You get to choose what type of writing you want to do and have a lot<br/>\n  of freedom of choices with their set up.<br/>\n  ***Before it&#39;s pointed out that this is an unschooling list, I know that but<br/>\n  I&#39;m of the belief that unschooling can encompass books of all kinds,<br/>\n  instruction from others can include what would normally be considered<br/>\n  &quot;schoolish&quot; *if* the child was the one asking to do &quot;it&quot;. To *me*,<br/>\n  unschooling means that the person doing the learning is doing so of their<br/>\n  own free will and not being coerced into it.<br/>\n  Sarah<br/>\n  ps.. Carol, if you&#39;re in the Gastonia area, I can put you in touch with the<br/>\n  person referenced in the above paragraph.<br/>\n<br/>\n<br/>\n<br/>\n  [<br/>\n<br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n       <br/>\n       <br/>\n<br/>\n  Message boards, timely articles, a free newsletter and more!<br/>\n  Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n  To unsubscribe, set preferences, or read archives:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n<br/>\n  Another great list sponsored by Home Education Magazine!<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a> <br/>\n<br/>\n<br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":28696,"nextTopicId":28732}}