{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":85626510,"authorName":"Dawn Falbe","from":"&quot;Dawn Falbe&quot; &lt;astrologerdawn@...&gt;","profile":"astrologerdawn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Math (public school, insensitive parents) Rant","postDate":"1032446965","msgId":9494,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGMwMWMyNWZlYiRjNWY4ZGVkMCRkMThlZGQxOEBkYXduPg==","inReplyToHeader":"PDEwMzI0MzYyNTUuMjQzLjMwODAubTEyQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":9490,"nextInTopic":0,"prevInTime":9493,"nextInTime":9495,"topicId":9489,"numMessagesInTopic":0,"msgSnippet":"I used to go out to dinner on a regular basis with 3 other women.  Our kids had known each other since they were 1 and had grown up together. When they all hit","messageBody":"<div id=\"ygrps-yiv-426078736\">I used to go out to dinner on a regular basis with 3 other women.  Our<br/>\nkids had known each other since they were 1 and had grown up together.<br/>\nWhen they all hit 5 I was the only one unschooling.  When we would go<br/>\nout to dinner we would be in a restaurant for 3 hours and I would sit<br/>\nand listen to these women complain about teachers, homework, the school<br/>\ndistrict, clothing, bullies, homework, homework, homework...  I once<br/>\neven said &quot;if you don&#39;t like all these things about school why are you<br/>\nsending them&quot;... 2 of these people were teachers and so they looked at<br/>\nme in horror as to what else they could do....<br/>\n<br/>\nI never had any intention of Zak doing homework regardless of whether he<br/>\nwent to school or not.  I remember being in school in England and in the<br/>\n5th year (which translates to age 16 here, not sure what Grade that is<br/>\nbecause as I unschool I&#39;ve never bothered to learn what grades meant) I<br/>\ndecided that it was a waste of time to do homework.  I went from a<br/>\nstudent that got A&#39;s and B&#39;s to D&#39;s and E&#39;s just because I wouldn&#39;t do<br/>\nany homework and my parents didn&#39;t make me..  <br/>\n<br/>\nI think of homework as more busywork except instead of doing it at<br/>\nschool, you are bringing that busywork home now and invading that safe<br/>\nplace.<br/>\n<br/>\nZak loves Math problems for about 1 hour and then he&#39;s bored and wants<br/>\nto play....Right now his favorite show is Stanley on Disney as they are<br/>\ndoing the alphabet of animals and he loves things in sequence.<br/>\n<br/>\nDawn <br/>\nTucson, AZ<br/>\n<br/>\n<br/>\nFrom: &quot;Katie&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katguts@...\">katguts@...</a>&gt;<br/>\nSubject: Math (public school, insensitive parents) Rant<br/>\n.....All afternoon his parents halfheartedly demand that he go sit down <br/>\nand do his homework or else he won&#39;t be able to go......</div>","specialLinks":[]},{"userId":118406848,"authorName":"Joylyn","from":"Joylyn &lt;joylyn@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Math (public school, insensitive parents) Rant","postDate":"1032416673","msgId":9490,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEODk2REExLjMwNzA1MDVAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PGFtYnE5YithdDlpQGVHcm91cHMuY29tPg=="},"prevInTopic":9489,"nextInTopic":9494,"prevInTime":9489,"nextInTime":9491,"topicId":9489,"numMessagesInTopic":0,"msgSnippet":"i feel so bad for this kid and all the other kids in this situation.... a few homeschooling friend s children tried school this year.  none of them stayed more","messageBody":"<div id=\"ygrps-yiv-1163034846\">i feel so bad for this kid and all the other kids in this situation....<br/>\n<br/>\n<br/>\na few homeschooling friend&#39;s children tried school this year.  none of <br/>\nthem stayed more than a week.  lexie says she wants nothing to do with <br/>\nit.  good for her.  however, she has asked me to teach her long <br/>\ndivision.  ok...  what ever you wish. so i found  mathbook and we will <br/>\nwork towards long division.  she doesn&#39;t want to learn subtraction with <br/>\ncarrying and doesn&#39;t understand why she has to do that first, so i tried <br/>\nto explain it.  i think she understood and is keen to get started so we <br/>\ndid the chapter test at the end of the first chapter and she got them <br/>\nall right.  so now we move on to chapter two.  we aren&#39;t going to do <br/>\nevery page, but just do the test at the end to see what things in that <br/>\nchapter she needs to know, and then go back and do that and then go <br/>\nforward.  it&#39;ll be interesting...<br/>\n<br/>\njoylyn<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; It&#39;s sad to see the schools<br/>\n&gt; crushing this creative, once happy kid.<br/>\n&gt;<br/>\n&gt; *sigh*<br/>\n&gt;<br/>\n&gt; Thanks for bearing with me through this.  I needed to vent.<br/>\n&gt;<br/>\n&gt; Kaite </span></blockquote></div>","specialLinks":[]},{"userId":10804628,"authorName":"Katie","from":"&quot;Katie&quot; &lt;katguts@...&gt;","profile":"birdiebutt2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Math (public school, insensitive parents) Rant","postDate":"1032416363","msgId":9489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFtYnE5YithdDlpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":9490,"prevInTime":9488,"nextInTime":9490,"topicId":9489,"numMessagesInTopic":0,"msgSnippet":"Can I rant here breifly amongst friends who won t think I m crazy?? I was at my sisters today and my 7yo first grade public schooled nephew came home.  My","messageBody":"<div id=\"ygrps-yiv-651516632\">Can I rant here breifly amongst friends who won&#39;t think I&#39;m crazy??<br/>\n<br/>\nI was at my sisters today and my 7yo first grade public schooled <br/>\nnephew came home.  My sister in law who is neither his mother or in <br/>\nanyway in charge of him (I was babysitting) demanded that he come <br/>\ninside immidiatly and do his homework.  He didn&#39;t want to (hates <br/>\nschool, hides his homework to avoid doing it).  So she told him if he <br/>\ndidn&#39;t she would call his mom and tell her and that he would be <br/>\ngrounded and not be able to go to the school skating party tomorrow.  <br/>\nHe went to his room to get away from her (I would have too)  She <br/>\nfollowed him and ragged on him them went and got into her backpack <br/>\nand dragged out his homework and took it to him.  When my sister came <br/>\nhome SIL ran out to tell her the punishment she had already set up <br/>\nand my sis went along with it.<br/>\n<br/>\nAll afternoon his parents halfheartedly demand that he go sit down <br/>\nand do his homework or else he won&#39;t be able to go.  This drags on <br/>\nfor more than an hour.  Finally I&#39;m tired of it so I finally offer to <br/>\nsit down with him and help him through it.<br/>\n<br/>\nFirst was spelling/vocab.  He has 12 words he&#39;s supposed to write <br/>\nthem into sentences.  I help him come up with sentences.  He has no <br/>\nproblems with the words or sentence structure just has a really hard <br/>\ntime deciding on a sentence.  he gets very frustrated several times <br/>\nand screams that he hates it.  I tell him I understand.  That it&#39;s <br/>\ntedious and boring.  As a break we go onto the math homework.  he <br/>\nquicky works the 5 or 6 double diget subtraction problems no prob.  <br/>\nThen there is the &#39;story problem&#39;.  I&#39;ve helped him with these <br/>\nbefore.  They suck!!  Just going through them makes it very obvious <br/>\nwhy kids are so afraid of math...<br/>\n<br/>\nJohn picked some apples.  His mother gave him 5 apples.  Now he has <br/>\nnine apples.  How many apples did John pick?<br/>\n<br/>\nSimple.  4, and my nephew knew that right off no problem.  The catch <br/>\nhere is they have to tell them how they know.  The paper looks like <br/>\nthis...<br/>\n<br/>\nThought___________<br/>\nInformation_________<br/>\nMethod____________<br/>\nSolution____________<br/>\n<br/>\nNone of this is clear to me as an adult.  I had no idea what they <br/>\ncould possible want in these spaces.  Apparently it goes like this.  <br/>\nThought is the opperation.  he chose + which seems appropriate if you <br/>\nread the problem because no one is taking anything away they are <br/>\nadding.  For &#39;Info&#39; they put in the numbers.  His were 5 and 9.  <br/>\nMethod they are supposed to write the problem.  So he wrote 5+9.  <br/>\nThen In solution they write the problem and the answer.  5+9=4.  <br/>\nObviously this is not right.  My option here is to either point this <br/>\nout or let the teacher point it out.  Either way someone is pointing <br/>\nout he&#39;s wrong.  When in fact the problem is just worded horribly for <br/>\na 7 yo.  So I asked him &quot;is 5+9 4?  He says no 5+9=14.  So he decides <br/>\nthe answer must be 14.  At this point he&#39;s so far from the original <br/>\nquestion that this seems correct.  So I showed him how to plug 14 <br/>\nback in to see if it was the right answer and he immidiatly saw that <br/>\nit wasn&#39;t.  So then he screams some more and throws the paper and is <br/>\nmad at the world.<br/>\n<br/>\nNo wonder they think it&#39;s hard.  They took a perfectly logical easy <br/>\nquestion that he could do in his head and made it so hard that he <br/>\ncame up with two wrong answers and got so frustrated he &#39;wouldn&#39;t&#39; do <br/>\nit.  The fact is the &#39;easiest&#39; way to solve this problem is X+5=9.  I <br/>\npointed this out to my sister and she actually wrote a note to the <br/>\nteacher on the homework paper asking why her 7yo is expected to know, <br/>\nunderstand, and explain algebra.  She hates the school and the <br/>\nteacher.  I wish she would wake up and just pull him out.  He threw a <br/>\nfan across the living room the otherday because the teacher called <br/>\nhim Sidney-poo in front of the whole class.  Last year they had him <br/>\nin remidial reading because he didn&#39;t like to read in front of <br/>\neveryone (oh and in remidial reading he had to read in front of <br/>\neveryone which only made things worse)  It&#39;s sad to see the schools <br/>\ncrushing this creative, once happy kid.<br/>\n<br/>\n*sigh*<br/>\n<br/>\nThanks for bearing with me through this.  I needed to vent.<br/>\n<br/>\nKaite</div>","specialLinks":[]}],"prevTopicId":9483,"nextTopicId":9495}}