{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"-QgeM1LvJgXgxBNSgEOK-tjOwy9caeHuRikIso8SYw_BLsvc0Zf0yUZceIwRlmB6reAk70VBWBMdHYl_RetbR3L0RmFPBQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"KnoK NEWS for 22 May 2001 (pt. 2)","postDate":"990514860","msgId":21686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwNTIyMDY1Ni5QQUExNjMwMEBzbXRwMy5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":21685,"nextInTime":21687,"topicId":21686,"numMessagesInTopic":0,"msgSnippet":"* * * *  KnoK NEWS  * * * * -- Views from the world of learning in Japan -- SAVING OUR CHILDREN: A JAPANESE APPROACH by Dayle Bethel (continued from part 1) ","messageBody":"<div id=\"ygrps-yiv-494841311\">* * * *  KnoK NEWS  * * * *<br/>\n           -- Views from the world of learning in Japan --<br/>\n<br/>\n<br/>\n                SAVING OUR CHILDREN: A JAPANESE APPROACH<br/>\n                            by Dayle Bethel<br/>\n<br/>\n<br/>\n                        (continued from part 1)<br/>\n<br/>\n<br/>\n<br/>\nLearning Through Living<br/>\n<br/>\nThe Earth, for Tsunesaburo Makiguchi, was a miracle. Life was a miracle, <br/>\nand he saw life vibrating and pulsating through all phenomena. A major <br/>\ngoal which began to motivate him early in his professional career was to <br/>\ncall his peers, particularly young people, to an awareness of and <br/>\nappreciation for the Earth and for the life pulsating through it. In his <br/>\nfirst major writing, &quot;A Geography of Human Life&quot; (first published as <br/>\n*Jinsei Chirigaku* in 1903), Makiguchi describes what for him was the <br/>\nultimate question:<br/>\n<br/>\n&quot;How, then, can we observe our surroundings? How can we make contact with <br/>\nthe earth? We are born of the earth; we are inspired by the earth; we die <br/>\non the earth; the earth is our home.&quot;  (p. 45)  <br/>\n                 <br/>\nIn our interaction with our environment, Makiguchi believed we should <br/>\n&quot;regard people, animals, trees, rivers, rocks, or stones in the same <br/>\nlight as ourselves and realize that we have much in common with them all. <br/>\nSuch interaction causes us to feel, if not consciously think, &#39;if I were <br/>\nin their (or its) place, what would I feel...or do?&#39; Sympathetic <br/>\ninteractions occur, therefore, when you regard or feel another person or <br/>\nobject that you are in contact with as a part of yourself or as one of <br/>\nyour kind. You share experience with that person or object and are able <br/>\nto place yourself in the position of that person or object.&quot;  (pp. 55-56)<br/>\n<br/>\nHe also believed that &quot;it is our nature as human beings to form <br/>\nsocieties. No one can live totally alone. It is through association in <br/>\nsociety that we can provide not only for our basic needs and security, <br/>\nbut for everything that makes our lives fulfilling and rewarding. This <br/>\nrealization leads to the universalization of sympathetic feelings which <br/>\nwere initially toward a specific individual or object. Growing awareness <br/>\nof our indebtedness to our society gives rise to feelings of appreciation <br/>\nand a sense of social responsibility within us. Beginning in our very <br/>\npersonal relationships...our sympathetic concern and appreciation expands <br/>\nto include the larger society and, ultimately, the whole world.&quot;  (pp. <br/>\n60-61)<br/>\n<br/>\nPerhaps more than any thing else, it was this reverence for nature, this <br/>\nsense of wonder and appreciation for life, this sense of being intimately <br/>\nconnected with both our natural and social environments, that Makiguchi <br/>\nlonged to communicate to his students and fellow beings. The development <br/>\nof such awareness and appreciation upon the part of human beings was, he <br/>\nbelieved, of crucial importance both for nature&#39;s sake and for the <br/>\ndevelopment of persons of moral character. <br/>\n<br/>\nMakiguchi was convinced that the development of a sense of <br/>\ninterdependence and interrelatedness with the natural world, of which he <br/>\nperceived humans a part, is a central aspect of what it means to be a <br/>\nhuman being. Not only is this holistic orientation the most pervasive <br/>\ntheme of &quot;A Geography of Human Life,&quot; it became the central theme of <br/>\nMakiguchi&#39;s own life:<br/>\n<br/>\n&quot;[B]eing aware of the rich variety of phenomena that influence my life, I <br/>\ncannot help thinking of the way the whole earth operates. I look around <br/>\nand, although my eyes can reach only a few kilometers in any direction, <br/>\nmy heart and mind is filled with excitement and wonder and curiosity <br/>\nabout the earth and about the relationship between the earth and our <br/>\nlives on the earth. I begin to realize that if we would seek a deeper <br/>\nunderstanding of this relationship, we must prepare ourselves to make <br/>\nobservations and inquiries into several different aspects of the planet, <br/>\nsuch as its topography, dimensions, movements, and structure.&quot;  (p. 86)<br/>\n<br/>\nSuch was Makiguchi&#39;s invitation to young people in particular, and to all <br/>\nhis contemporaries in general, to join him in a journey to explore the <br/>\nwonders of the Earth and life born of the Earth. &quot;A Geography of Human <br/>\nLife&quot; is something like a &quot;ship&#39;s log&quot; or diary of that journey. But it <br/>\nwas also intended as a handbook or travel guide for others who are <br/>\nmotivated to take the journey themselves.<br/>\n<br/>\nBefore embarking on this journey of discovery, Makiguchi explained that <br/>\nthe method of inquiry to be used was that of participant observation. But <br/>\nwhat was to be the scope of that observation?<br/>\n<br/>\n&quot;I arrived at a conviction that the natural beginning point of <br/>\nunderstanding the world we live in and our relationship to it is that <br/>\ncommunity of persons, land, and culture which gave us birth; that <br/>\ncommunity, in fact, which gave us our very lives and started us on the <br/>\npath toward becoming the persons we are. In other words, that community <br/>\nwhich has given us our rootedness as human beings. The importance of this <br/>\nrootedness and personal identity given us by our native cultural <br/>\ncommunity, our homeland, can scarcely be overemphasized.&quot;  (pp. 29-30)<br/>\n<br/>\n&quot;If we think seriously about it,&quot; he went on to say, &quot;we can see that <br/>\nevery aspect of this universe can be observed in this small area of our <br/>\nhomeland. And because our homeland is the place where we live, where we <br/>\nwalk, where we see and hear and gain impressions, it is possible for us <br/>\nto observe all these things directly. Thus, it is possible for us to <br/>\nexplain the general nature of complex phenomena anywhere in the world <br/>\nthrough use of examples which we can find in abundance even in the most <br/>\nremote village or hamlet.&quot;  (p. 38)<br/>\n<br/>\nPhilosophy of Learning<br/>\n<br/>\nMakiguchi often observed and spoke out strongly on what he saw as the <br/>\nlife-threatening damage being done to children&#39;s lives and personalities <br/>\nin the Japanese schools of his day:<br/>\n<br/>\n&quot;The detrimental effects of force-feeding a small child can be easily <br/>\nseen because of the small body&#39;s inability to metabolize more than it can <br/>\ndigest. The excessive bulk passes through the child&#39;s system, an <br/>\nundigested waste. Or worse, it may lodge in the digestive tract, slowly <br/>\nputrefying and poisoning the whole system. Unfortunately, the effects of <br/>\npsychological toxification in children caused by the forced learning of <br/>\nmasses of unintelligible information are not immediately visible. <br/>\nConsequently, the detrimental effect of this poisoning process in <br/>\nchildren&#39;s lives is not recognized. The situation is serious, but when we <br/>\nsearch for the causes of the problem, we are faced with the paradox that <br/>\nteachers and parents alike see themselves as providing for the future <br/>\nwell-being of the children even though they make them miserable in the <br/>\nprocess.&quot;  (Dayle Bethel, ed., &quot;Education for Creative Living,&quot; Iowa <br/>\nState University Press,  p. 21)<br/>\n<br/>\n&quot;The aim of education,&quot; Makiguchi stressed, &quot;is not to transfer <br/>\nknowledge; it is to guide the learning process, to put responsibility for <br/>\nstudy into the students&#39; own hands. It is not the piecemeal merchandising <br/>\nof information; it is the provision of keys that will allow people to <br/>\nunlock the vault of knowledge on their own. It does not consist in <br/>\npilfering the intellectual property amassed by others through no <br/>\nadditional effort of one&#39;s own; it would rather place people on their own <br/>\npath of discovery and invention. The words have been resounding in the <br/>\nears of educators like ourselves since the days of [Czech <br/>\ntheologian/educator J.A.] Comenius and [Swiss educational reformer <br/>\nJohann] Pestalozzi, but they have yet to be put into real practice.<br/>\n<br/>\n&quot;Thus, if one possesses the keys to unlock the vault of knowledge, it <br/>\nbecomes possible to obtain for oneself all the learning one will ever <br/>\nneed in life without having to memorize endless volumes of <br/>\nscholarship....There is no reason to overload our lives with mountains of <br/>\nuseless and trivial information that we may never need.&quot;  (&quot;Education for <br/>\nCreative Living,&quot; p. 168)<br/>\n<br/>\nMakiguchi believed that the indirect, secondhand educational system that <br/>\nhad developed in Japan was the height of folly. Primarily a product of <br/>\nimplantation from Western cultures, that system of education, he charged, <br/>\nconfined learners to classrooms and forced them to go through a <br/>\nmeaningless routine of memorizing and forgetting, memorizing, forgetting, <br/>\nand on and on. Furthermore, it severed the learners&#39; ties with the <br/>\nnatural systems making up their environment. Makiguchi, writing in the <br/>\nearly decades of the 20th century, described the effects of the <br/>\ndevelopment of modern schools in Japan as follows:<br/>\n<br/>\n&quot;In the days before there were schools, the prevailing method of guiding <br/>\nyoung people to the proper roles in the general scheme of life was an <br/>\nextended home life, whereby one apprenticed at the family trade <br/>\nthroughout one&#39;s formative years, with this training supplemented by <br/>\nthings learned from the local community. Then came the Meiji period <br/>\n(1868-1912) with its modern education and the spread of <br/>\nschools....Everyone was taken by the hand and dragged off to schools, and <br/>\nsoon the other two schemes of learning fell into disuse. This was the age <br/>\nof the school reigning unchallenged and omnipotent.<br/>\n<br/>\n&quot;Only in recent years have we seen the grave error of our ways and tried <br/>\nto fill in the gap with various kinds of adjunct education and youth <br/>\ngroups for extracurricular activity....From this point on, school <br/>\neducation must be aware of its own share of the educational role....It <br/>\nmust cooperate with the other two areas of education, the home and the <br/>\ncommunity, each with its own expertise....These three areas of education <br/>\nmust link together in an orderly system of mutual complementarity.&quot;  <br/>\n(&quot;Education for Creative Living,&quot; p. 181)<br/>\n<br/>\nTo accomplish this kind of community-based system of education, Makiguchi <br/>\nproposed what he called a &quot;half-day school&quot; system, from elementary <br/>\nschooling to the university, which would cut back on ill-managed <br/>\neducation that was wasting valuable work-learning time. If we were to <br/>\nreturn to the other two areas of education much of their pre-modern <br/>\nterritory in overall life guidance, he claimed, only the remainder would <br/>\nneed to be taught in schools -- and in a half day at that. This, he <br/>\nbelieved, would at once prove more efficient, and would create an organic <br/>\nbond with the other two areas.<br/>\n<br/>\nIn a marvelous statement summing up the fundamental purpose of half-day <br/>\nschooling, Makiguchi wrote that &quot;study is not seen as a preparation for <br/>\nliving, but rather study takes place while living, and living takes place <br/>\nin the midst of study. Study and actual living are seen as more than <br/>\nparallels; they inform one another intercontextually, study-in-living and <br/>\nliving-in-study, throughout one&#39;s whole life. In this sense, it is not <br/>\nthe better economic budgeting of school programs but the instilling of <br/>\njoy and appreciation for work that becomes the main focus of the proposed <br/>\nchanges.&quot;  (&quot;Education for Creative Living,&quot; p. 156)<br/>\n\t<br/>\nMakiguchi&#39;s &quot;A Geography of Human Life&quot; highlights a clash between two <br/>\ndifferent kinds of society based on radically different world views and <br/>\nsets of values. Makiguchi offered his vision of a good society, which <br/>\ncould nurture good, happy persons, as a model for the development of an <br/>\nindustrial system in Japan. At the time he was writing &quot;A Geography of <br/>\nHuman Life,&quot; the American version of the Western model of industrialism <br/>\nwas sweeping the Earth. The contrast between that type of industrialism <br/>\nand the type that Makiguchi proposed is sharp and clear. It is especially <br/>\nclear in the respective views of the two models toward nature. A basic <br/>\ntenet of the American model, what Alvin Toffler labels &quot;indust reality,&quot; <br/>\nis that &quot;nature is an object waiting to be exploited.&quot;  (Toffler, 1981, <br/>\np. 99)<br/>\n<br/>\nFor Makiguchi, on the other hand, to be human meant to live in harmony <br/>\nwith the Earth. To live as a human being meant to love and understand and <br/>\nappreciate the Earth: &quot;[I]t is through our spiritual interaction with the <br/>\nearth that the characteristics which we think of as truly human are <br/>\nignited and nurtured within us.&quot;  (pp. 47-48, 62)<br/>\n<br/>\nMakiguchi envisioned an industrial society developing in Japan upon a <br/>\nbasis of interdependence and interconnectedness between human beings and <br/>\nthe Earth. It was to the realization of such a society that he directed <br/>\nhis life and his teaching. <br/>\n<br/>\nEfforts at Implementation<br/>\n<br/>\nMakiguchi&#39;s professional life spanned four decades, from 1900 to 1930. <br/>\nDuring most of that time, he served as a teacher and principal of <br/>\nelementary schools in various parts of Japan, seeking, to the extent <br/>\npossible given the rigidity of the educational system, to experiment in <br/>\nimplementing his educational ideas. The results of these experiments were <br/>\nimpressive and Makiguchi received strong support and encouragement from <br/>\nsome of his former students and teachers who taught under him.<br/>\n<br/>\nHe was supported also -- and his educational ideas endorsed -- by many <br/>\nprominent persons in Japanese society, including Tsuyoshi Inukai, prime <br/>\nminister of Japan during the early 1930s. However, with but a few notable <br/>\nexceptions, Japanese academics and educational administrators bitterly <br/>\ndenounced Makiguchi as a rabble-rouser and troublemaker, and labeled his <br/>\nideas and proposed educational reforms as unworkable nonsense. These <br/>\nsentiments within the educational establishment, together with the <br/>\nincreasing influence of the military in Japanese society, led to <br/>\nMakiguchi&#39;s forced retirement from his post as a primary school <br/>\nprincipal, and thus to the &quot;official&quot; end of his long career as an <br/>\neducator.<br/>\n<br/>\nThe final blow came with the assassination of Prime Minister Inukai in <br/>\n1932 by military elements. After that, Makiguchi gave up trying to <br/>\nimprove Japanese education and society through educational channels, and <br/>\nturned his energy and convictions in other directions. <br/>\n<br/>\nBut while Tsunesaburo Makiguchi&#39;s ideas and his vision of an industrial <br/>\nsociety based on love and respect for the environment, and of holistic <br/>\nlearning occurring within nature and community, were rejected by Japanese <br/>\nsociety in his lifetime, his ideas and proposals have played -- and are <br/>\ncontinuing to play -- a significant role in creating the worldwide <br/>\nrevolution in education and society we are now witnessing.<br/>\n<br/>\n<br/>\n---------------------<br/>\nDayle Bethel (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dbethel@...\">dbethel@...</a>) is a holistic educator and author of <br/>\nseveral books on alternative learning, including &quot;Makiguchi -- The Value <br/>\nCreator&quot; (Weatherhill, 1971). He is also a contributor to the recently <br/>\npublished book &quot;Creating Learning Communities&quot; (Foundation for <br/>\nEducational Renewal, 2000). He has overseen and edited the translation of <br/>\nTsunesaburo Makiguchi&#39;s work *Jinsei Chirigaku* (A Geography of Human <br/>\nLife) from Japanese into English, and the book is due to be published by <br/>\nthe San Francisco-based Caddo Gap Press in 2002. Dayle and his wife, <br/>\nMiyoko, make their home between Kyoto, Japan and Honolulu, Hawaii.<br/>\n<br/>\n<br/>\n<br/>\n                                *   *   *   *<br/>\n<br/>\n<br/>\n<br/>\n                  WISH I&#39;D SAID THAT  (Quote of the Day):<br/>\n<br/>\n&quot;If we chose a theme like ocean, river, or forest, the students came up <br/>\nwith ideas. They imagined they were plankton, the fish, the trees. They <br/>\nhad to study what was in it. They learned how everything is <br/>\ninterconnected. They looked at the life of coral, dinosaurs, the birth of <br/>\nthe Earth. Children get very interested in nature. Their bodies come into <br/>\nresonance with the Earth....&quot;<br/>\n<br/>\n--Japanese teacher, writer and filmmaker Toshiko Toriyama, in *The Other <br/>\nJapan* (by David Suzuki & Keibo Oiwa), 1996</div>","specialLinks":[]}],"prevTopicId":21685,"nextTopicId":21690}}