{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":168437188,"authorName":"Andy Holly Clarke","from":"&quot;Andy Holly Clarke&quot; &lt;ahclarke@...&gt;","profile":"hcac","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"heather","postDate":"1091483205","msgId":97206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMTAwMWM0NzhkYSQzNGExMzQwMCQwNGI5MGU0NUB3b3d3YXkuY29tPg==","referencesHeader":"PEJEMzJGQjAzLjU2MTglaGVhdGhlcmV0dGVAY29tY2FzdC5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":97205,"nextInTime":97207,"topicId":97206,"numMessagesInTopic":0,"msgSnippet":"strangely enough, but your description sounds like how i feel when i am attempting to be social. i think part of it for me is that i feel judged by everyone","messageBody":"<div id=\"ygrps-yiv-422686097\">strangely enough, but your description sounds like how i feel when i am<br/>\nattempting to be social.<br/>\n<br/>\ni think part of it for me is that i feel judged by everyone around me...<br/>\nmaybe you feel judged by your children (some comments you made sound that<br/>\nway.)<br/>\n<br/>\nmaybe if you can think of how i can feel free and secure around people, i<br/>\ncan think of how you can feel free and secure playing with your kids.<br/>\n<br/>\nholly<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Heather Hall&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Heatherette@...\">Heatherette@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Sunday, August 01, 2004 4:54 PM<br/>\nSubject: Re: [UnschoolingDiscussion] Digest Number 4817<br/>\n<br/>\n<br/>\n&gt; &gt; You don&#39;t like general suggestions about changing your thinking?<br/>\n&gt; &gt;<br/>\n&gt; &gt; You don&#39;t like discussion of thinking patterns and priorities?<br/>\n&gt; It&#39;s not so much that I don&#39;t like generalities, more like I am going in<br/>\n&gt; circles and I can&#39;t figure out how to get off the merry go round.<br/>\n&gt; Generalities seem to make the merry go round go faster.  I have been<br/>\nreading<br/>\n&gt; here and nodding and absorbing and thinking, I can do that!  Then one<br/>\nthing<br/>\n&gt; goes wrong and the next thing you know I&#39;m hiding under the basements<br/>\nstairs<br/>\n&gt; until I can be calm enough to be in the same room with my kids and feel<br/>\n&gt; safe.  A lot of this is trying not to repeat patterns. So I am going to<br/>\ntry<br/>\n&gt; to figure out more specifically what it is I am looking for.<br/>\n&gt;<br/>\n&gt; Ok, so I went and read a bunch of the links you sent.  Right now I feel<br/>\nlike<br/>\n&gt; having a great big pity party all by myself.  I want to run and hide.  I<br/>\n&gt; feel like the biggest failure in the world.  Now that I have that behind<br/>\nme,<br/>\n&gt; I need to figure out what to do instead.  Since I had my second child my<br/>\n&gt; parenting goals have been very simple.  My very basic goal was to not hit<br/>\nmy<br/>\n&gt; kids. The others all seem like easy to me like providing organic food,<br/>\nonly<br/>\n&gt; using non toxic stuff in my house, read to them, make sure they get to<br/>\ncall<br/>\n&gt; their grandmas often enough to have a clue who they are.<br/>\n&gt; That just isn&#39;t enough anymore.  It seems like one of the biggest<br/>\nobstacles<br/>\n&gt; for me is play.<br/>\n&gt;<br/>\n&gt; Seems like so many people say to me, just get down and play with them.<br/>\n&gt; Follow their lead.  It sounds so easy, and often they are looking me in<br/>\nthe<br/>\n&gt; eye like, why is that so hard?  To me, it&#39;s like instant panic.  I want to<br/>\n&gt; pull up a corner of the carpet and get under it and hide!  Obviously I am<br/>\n&gt; working with some serious leftovers that are effecting my parenting.  I am<br/>\n&gt; working really hard on it.  However, I still have these awesome kids that<br/>\nI<br/>\n&gt; love and desperately want to give a better start.  What do I do in the<br/>\n&gt; meantime to cope?  I don&#39;t want to give up.  Like I said before, the<br/>\n&gt; afternoon is the hardest, so I make my plans accordingly - no changes<br/>\nduring<br/>\n&gt; those times to stress me more.  Ideally we can either be home then, or<br/>\n&gt; somewhere where we can stay put that is low key or contained enough that I<br/>\n&gt; am not worried about chasing Crispin down every 5 seconds.<br/>\n&gt;<br/>\n&gt; I feel like I am whining.  I don&#39;t want to be whining, but I am just<br/>\n&gt; drowning.  I am surrounded by awesome attachment parenting mamas who make<br/>\nit<br/>\n&gt; look easy.  And they spend all day with their kids!  My husband has mine a<br/>\n&gt; lot of the time.  I feel so hopeless about being able to keep them home.<br/>\nI&#39;m<br/>\n&gt; not willing to give up but I am just aching and sinking.  I am treating my<br/>\n&gt; kids very much like I was treated minus the hitting.  It is killing me.  I<br/>\n&gt; just don&#39;t know how to interact with them like I think I am supposed to,<br/>\nor<br/>\n&gt; at least want to.  I was a barely seen *never* heard kid without siblings<br/>\nor<br/>\n&gt; neighborhood kids that were &#39;acceptable&#39; playmates.  My kids have tons of<br/>\n&gt; friends to play with but we have to drive to them - which we do regularly.<br/>\n&gt; It&#39;s the play with mommy part - sigh.  I just never interacted with anyone<br/>\n&gt; that way.  It&#39;s almost like I get scared right away at the thought.  I<br/>\n&gt; literally sink in my chair and pull my shirt over my head sometimes.  Has<br/>\n&gt; anyone else remotely felt like this?  I feel so guilty like my kids are<br/>\njust<br/>\n&gt; going to hate me for screwing them up.  I wanted to be a cool mom that my<br/>\n&gt; kids really like.  My kids *do* like me, but the nasty little voice in my<br/>\n&gt; head says it&#39;s just because they don&#39;t know any different.  Eventually<br/>\nthey<br/>\n&gt; will figure out what they are missing like I did.<br/>\n&gt;<br/>\n&gt; This doesn&#39;t have to be so hard!!!  I&#39;ve got books, websites, people.  The<br/>\n&gt; answer isn&#39;t there, it&#39;s in me.  I keep asking anyway because I hope that<br/>\n&gt; something will turn on a light bulb.<br/>\n&gt; -- <br/>\n&gt; Heather, mom to<br/>\n&gt; Harriet 12.15.99<br/>\n&gt; Crispin 01.25.02<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heatherette@...\">heatherette@...</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":97168,"nextTopicId":97172}}