{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A warm hello from the UK","postDate":"1075648790","msgId":90050,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMjAxLjA3MjA1MC41MDEuMjUwMjVAd2VibWFpbDA0Lm55Yy51bnRkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":90049,"nextInTime":90051,"topicId":90050,"numMessagesInTopic":0,"msgSnippet":"And on the other hand maybe you should spend some time watching WITH him so you have more shared experience and things to talk about.  If watching TV is his","messageBody":"<div id=\"ygrps-yiv-1566873587\">&quot;And on the other hand maybe you should spend some time watching WITH him so <br/>\nyou have more shared experience and things to talk about.  If watching TV is <br/>\nhis thing and complaining about TV is your thing, you spoiled a chance to have a shared thing.&quot;<br/>\n<br/>\nThis is worthy of repeating.<br/>\nRead this over and over until you believe the truth here! <br/>\nThis was the very best advice that Mary and Anne and Sandra and Pam gave me when I had my knickers in a twist over the tv issue. Instead of being the enemy, we began building common ground where television was concerned. I started really loving Japanese anime, thanks to my kids, and now we have several shows we discuss regularly.<br/>\n<br/>\nThe other day I was singing a jingle to one of their shows while several neighbor kids were over. Hunter says &quot;you know an awful lot about kids shows for a grown up&quot;.<br/>\nYeah, that&#39;s right sweetie, I do.:)<br/>\n<br/>\nIt took me a while, but I finally got it. Tv is a non-issue now. It&#39;s something we use for entertainment/learning/connection time. It holds no more power than a book, or music or anything else in our lives. I gave it power by being all worked up about how much they were watching. Once you let go and truly trust, it loses it&#39;s power.<br/>\nYour child is fascinated because he&#39;s doing exactly what all human beings do when something had been forbidden and is suddenly available (the old forbidden fruit thing), he&#39;s gorging.<br/>\n<br/>\nGorging doesn&#39;t last forever, though it may take longer than you think (my kids took about a year) and he will do a lot of other cool things in spite of his long hours in front of the tv.  Contrary to myth, it does not dull imagination. Some of our best movie producers and artists spent many hours watching tv, apparently they&#39;re still very creative individuals.<br/>\n<br/>\nRen<br/>\n<br/>\n<br/>\n<br/>\n&quot;I never teach my pupils; I only attempt to provide the conditions in which they can learn.&quot;<br/>\nAlbert Einstein</div>","specialLinks":[]}],"prevTopicId":89991,"nextTopicId":90060}}