{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"0U5UjEGL93ywtgT-dRwaiYpAC4MRmFVkB8qShIqRzVSUFBL2vtHFhU3Q9gMfNZbo-fcR3CAWULN2jmQVRlw1dXGs93JAdV0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Dumbing down of Japanese students","postDate":"960184740","msgId":8905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNjA1MDU1MC5PQUEwOTQ1N0BtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":8904,"nextInTime":8906,"topicId":8905,"numMessagesInTopic":0,"msgSnippet":"Hello all, Here s a news story that came out today on the dumbing down of Japanese students and how the private-sector market is getting a piece of this ","messageBody":"<div id=\"ygrps-yiv-939351755\">Hello all,<br/>\n<br/>\nHere&#39;s a news story that came out today on the dumbing down of Japanese <br/>\nstudents and how the private-sector market is getting a piece of this <br/>\naction.<br/>\n<br/>\nJapan&#39;s Ministry of Education just can&#39;t get any respect these days: On <br/>\none side are the educators and critics who blast the ministry&#39;s idea of <br/>\ncutting school hours and other &quot;reforms&quot; as mere window dressing that <br/>\nwon&#39;t even come close to solving the nation&#39;s ongoing educational crises.<br/>\n<br/>\nThen there are the other educators and critics who claim just the <br/>\nopposite, that what public schools in Japan need from the Education <br/>\nMinistry is not less, but MORE: more school hours, more regulations for <br/>\nstudents, more resources for more teachers.<br/>\n<br/>\nIt is from a position of sympathy with this latter camp that Ms. <br/>\nKinoshita, the author of the following piece, seems to be writing.<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nin Osaka, Japan<br/>\n<br/>\n------------------------------<br/>\n  <br/>\n[Daily Yomiuri - 5 June 2000]<br/>\n<br/>\n<br/>\nKYOTO ACADEMIA TURNS TO PRIVATE SECTOR FOR HELP<br/>\n<br/>\n<br/>\n[by] Atsuko Kinoshita<br/>\nYomiuri Shimbun Staff Writer <br/>\n<br/>\nKYOTO -- The nation&#39;s university education system has entered a time of <br/>\nchange. Students&#39; academic abilities have worsened noticeably as a result <br/>\nof the reduction in educational content taught at high schools, which <br/>\nhave recently been set the goal of giving students more breathing room. <br/>\nIn addition, universities are seeing students exhibit the behavior of <br/>\nhigh school students, such as skipping classes and not showing the kind <br/>\nof maturity they previously exhibited upon becoming university students.<br/>\n<br/>\nMore change is on the horizon: In 2009, the decreasing child population <br/>\nwill reach college-entrance age. When that time comes, virtually all of <br/>\nthem will be able to attend university if they wish, as universities are <br/>\nexpected to experience a sharp fall in the number of applicants. This <br/>\nwill undoubtedly heat up competition among universities to acquire a <br/>\nsufficient number of students to support their operations. Some <br/>\nuniversities have already moved to take up the challenge, and Kyoto&#39;s <br/>\nRyukoku University is one of them. Students in the university&#39;s economics <br/>\ndepartment are currently taking classes in mathematics -- which in itself <br/>\nis nothing unusual.<br/>\n<br/>\nWhat&#39;s unusual is that the class is taught by a teacher dispatched from <br/>\nSundai Yobi Gakko, one of the nation&#39;s leading college-entrance prep <br/>\nschools. &quot;You break up a number into numbers that can&#39;t be divided any <br/>\nmore. This process is called factorizing into prime factors. Take the <br/>\nnumber six for example: Its prime factors are two and three,&quot; Shinichiro <br/>\nOchiai, the Sundai instructor, told one of his classes of about 30 <br/>\nstudents, who nodded to show they understood. <br/>\n<br/>\nThe class was part of a project started this spring as part of an <br/>\ninitiative of the University Consortium Kyoto, which consists of 48 <br/>\nuniversities and junior colleges in Kyoto Prefecture. Seven universities <br/>\ncurrently hold classes taught by instructors from outside of academia to <br/>\nhelp students acquire the basic necessary skills that they failed to <br/>\nacquire while in high school. <br/>\n<br/>\nOchiai&#39;s class is well received by the Ryukoku freshmen, one of whom <br/>\nsaid: &quot;His teaching is to the point, and it&#39;s easy to understand.&quot; <br/>\n<br/>\nBut he is disturbed by the surprisingly low skills of his students. <br/>\n<br/>\nIn one of his classes, Ochiai wrote out 10 equation and graph <br/>\ninterpretation problems. One problem was:<br/>\n<br/>\n0.125x plus 2/5 equals 7/8 <br/>\n<br/>\nwhich was something the students were supposed to have learned in the <br/>\nfirst year of middle school. But despite Ochiai&#39;s remark -- &quot;Just relax <br/>\nand enjoy solving it&quot; -- they apparently could not. They seemed slow in <br/>\nworking through the problem in their notebooks. In fact, only half of <br/>\nthem managed to solve it. <br/>\n<br/>\n&quot;I&#39;m shocked their skills are so low. It&#39;s much worse than simply <br/>\nforgetting formulas they had learned,&quot; Ochiai said. &quot;It seems to me they <br/>\nlack the ability to think logically. I&#39;m now worried about the future of <br/>\nJapan. I&#39;m not exaggerating.&quot;<br/>\n<br/>\nOchiai&#39;s class continues for the first half of this year, and by the 12th <br/>\nand final class, his plan said the students would have understood <br/>\neconomic theories using differential and integral calculus. <br/>\n<br/>\n&quot;Well, I do hope to get to at least teach differential calculus,&quot; Ochiai <br/>\nsaid. <br/>\n<br/>\nDeclining academic ability is not a problem that is limited to <br/>\nmathematics. <br/>\n<br/>\nSeian College of Art and Design in Nagaoka-kyo in the prefecture holds a <br/>\ncredit course teaching plain old Japanese, just to prop up the students&#39; <br/>\noften shaky skills in their native tongue. <br/>\n<br/>\nIn the first class this spring, Naoki Kamisaka was teaching how to write <br/>\na self-introduction. The class started virtually from the basics of <br/>\nwriting, and thus included such instructions as &quot;Leave the first square <br/>\nopen for an indentation&quot; on the Japanese manuscript sheets provided. Four <br/>\nhundred squares are printed on each sheet, and each square is filled by a <br/>\ncharacter or a punctuation mark. <br/>\n<br/>\nIndeed, Kamisaka, who was dispatched from the Japanese-language and <br/>\nwriting section of Kawai-juku, another leading college-entrance prep <br/>\nschool, detected a problem in students&#39; writing ability. <br/>\n<br/>\nAfter he collected the 40 or so students&#39; written papers, he noticed that <br/>\nthey had just written down their thoughts the way they would say them. <br/>\n<br/>\n&quot;I have a feeling young people&#39;s writing skills are affected by writing <br/>\ne-mail,&quot; Kamisaka said. &quot;They are good at dragging on and on about <br/>\nwhatever pops into their mind, but they aren&#39;t good at saying what they <br/>\nwant to say in a logical, organized way.&quot; <br/>\n<br/>\nKamisaka said that, from the second class on, he would present the <br/>\nstudents with model texts and teach uses of conjunctions such as &quot;mazu&quot; <br/>\n(first) and &quot;ippo&quot; (meanwhile). Kamisaka usually teaches test-taking <br/>\ntechniques for college entrance applicants in Kawai-juku&#39;s fast-paced <br/>\nclasses, but for Seian students he plans to go slowly, teaching one theme <br/>\nper class to make sure his students learn to express themselves well in <br/>\nwriting. <br/>\n<br/>\nAccording to a survey by the Education Ministry, 43 state-run <br/>\nuniversities and 56 private universities conducted courses to boost <br/>\nstudents&#39; basic skills in 1998. But the consortium&#39;s project is the first <br/>\nof its kind as it involves multiple universities. <br/>\n<br/>\n&quot;It&#39;s a costly undertaking for a single university, but since we have a <br/>\nconcentration of universities and colleges in Kyoto, we thought we would <br/>\nbe able to conduct the supplementary courses through a cooperative <br/>\nscheme,&quot; said Hiroshi Yamaguchi, an official of the consortium. &quot;And the <br/>\nimportant thing for us was to try this idea we came up with.&quot; <br/>\n<br/>\n&quot;At first, faculty members taught supplementary courses, but it seemed <br/>\ntoo hard for us to cope with the situation,&quot; said Prof. Susumu Misaki of <br/>\nRyukoku&#39;s economics department. &quot;And university teachers don&#39;t have the <br/>\nnecessary experience to conduct supplementary courses. So in the end, we <br/>\ndecided to enlist outside help.&quot; <br/>\n<br/>\nThe consortium&#39;s project also involves courses taught not only by <br/>\nprep-school teachers, but other private educational experts. <br/>\n<br/>\nStarting from the latter half of this academic year, the junior college <br/>\nof Otani University in Kyoto&#39;s Kita Ward is going to offer a course in <br/>\nverbal communication, including vocal exercises, by an instructor <br/>\ndispatched from an Osaka temporary-employment agency, which usually <br/>\noffers such courses for company employees as part of in-company training. <br/>\nThe Department of Food Science and Nutrition at Doshisha Women&#39;s College <br/>\nof Liberal Arts in Kyo-tanabe in the prefecture will have the Nihongo <br/>\nBunsho Noryoku Kentei Kyokai (Society for Testing Skills in Written <br/>\nJapanese) dispatch instructors to teach basic writing skills. <br/>\n<br/>\nExperts seem to be divided over whether to view the consortium&#39;s <br/>\ninitiative as a favorable development or representing a lamentable <br/>\nsituation in university education. <br/>\n<br/>\nKazuo Nishimura, who wrote about university students&#39; declining academic <br/>\nabilities in &quot;Bunsu ga Dekinai Daigakusei&quot; (University Students Who Can&#39;t <br/>\nHandle Fractions), which he coauthored, views the Kyoto institutions&#39; <br/>\nmove favorably. <br/>\n<br/>\n&quot;Universities usually try to strike a pose as proud institutions, and it <br/>\nmust have been a difficult decision for the (Kyoto) universities and <br/>\ncolleges to enlist outside help,&quot; said Nishimura, a professor at Kyoto <br/>\nUniversity&#39;s Institute of Economic Research. &quot;They faced the reality of <br/>\nthe situation bravely and made a courageous decision. These universities <br/>\nand colleges are working together, and that helps make things work <br/>\nbetter. It will also help them solve other problems that may crop up.&quot; <br/>\n<br/>\nBut Prof. Hidenori Fujita of Tokyo University&#39;s School of Education sees <br/>\nthe situation as evidence that universities are not fulfilling their <br/>\nfunctions. <br/>\n<br/>\n&quot;These schools seem to have first accepted students, and then told them, <br/>\n&#39;You must learn a few more things (to be able to learn what we teach),&#39; <br/>\nand that&#39;s like putting the cart before the horse,&quot; Fujita said. &quot;For <br/>\nsure, the current situation is one result of the nation&#39;s education <br/>\nsystem going wrong, and I recognize the need for complementary courses <br/>\nlike theirs.&quot; <br/>\n<br/>\n&quot;But when you get down to the bottom of things, universities must make <br/>\nclear what they want high schools to teach their prospective applicants, <br/>\nand make their entrance requirements clear,&quot; Fujita said. <br/>\n<br/>\nThe Kyoto universities pay 12,000 yen per class for the complementary <br/>\ncourses, and 200,000 yen for the development of each course. Though it is <br/>\nnot yet clear whether this is a worthwhile investment, one thing is clear <br/>\n-- as an instructor at one of the prep schools involved put it: &quot;I&#39;m <br/>\npretty sure this market for supplementary college courses is going to <br/>\ngrow.&quot; <br/>\n<br/>\n<br/>\n[Copyright 2000 - The Yomiuri Shimbun]</div>","specialLinks":[]}],"prevTopicId":8630,"nextTopicId":8784}}