{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"rant (was kgiuffre/Karen getting off the list, or anyone else","postDate":"1049737896","msgId":63415,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZiLmUzN2NlMGIuMmJjMzE0YThAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":63414,"nextInTime":63416,"topicId":63415,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/7/03 12:46:55 AM, kgiuffre@optonline.com writes: ","messageBody":"<div id=\"ygrps-yiv-1179596901\">In a message dated 4/7/03 12:46:55 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kgiuffre@...\">kgiuffre@...</a> writes:<br/>\n<br/>\n&lt;&lt; Thanks for the help dispite the sarcasm. I don&#39;t get to the bottom of the<br/>\n<br/>\nemails as I find them petty and self serving. And I must add truely<br/>\n<br/>\ndisappointing. K &gt;&gt;<br/>\n<br/>\nHUH!<br/>\n<br/>\nAt least we were writing about unschooling.<br/>\nThis and the first one were about Karen/kgiuffre and how disappointed she is <br/>\nand how she, Karen/kgiuffre needs help to get off the list.<br/>\n<br/>\nThat&#39;s a TOTAL waste of time.  So I&#39;m adding to it, but doing it in the name <br/>\nof the sadly disappointed Karen/kgiuffre.<br/>\n<br/>\nSo I&#39;ve needed a place for a rant and I shall append it here.<br/>\n<br/>\nFor one thing, writing that every e-mail has instructions for leaving the <br/>\nlist isn&#39;t sarcasm.<br/>\n<br/>\nIf I&#39;m to be accused of sarcasm, I&#39;d much prefer it to be by someone who <br/>\nknows what sarcasm is.<br/>\n<br/>\nTHIS is not sarcasm:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; At the bottom of every single e-mail there are instructions for getting<br/>\n<br/>\n </span></blockquote>off the list, which means that will appear at the bottom of this e-mail, and<br/>\n<br/>\nwas at the bottom of the e-mail saying &quot;help me get off the list.&quot;&gt;&gt;<br/>\n<br/>\nAnd now my little complaint, starting with a compliment.<br/>\n<br/>\nThere are people here whose kind and patient generosity shines with the <br/>\nsweetest light.  People will ask us whether there really ARE lists for <br/>\necelctic homeschooling, or where to find more information on unschooling, or <br/>\nwhat we mean by this thing, or that thing, or who some author or writer is, <br/>\nor something.<br/>\n<br/>\nAnd someone will patiently answer.<br/>\n<br/>\nAnd here is where the answers come from:<br/>\n<br/>\ngoogle.com<br/>\nor<br/>\nyahoogroups<br/>\n<br/>\nSomeone will go to those webpages and open them, type in the search word, <br/>\nlook through the first list offered, find a good one, cut and paste it or <br/>\nfind a URL, after checking to see if that&#39;s a good example, and then come <br/>\nback to the message board or e-mail list and offer it sweetly to the person <br/>\nwho asked.<br/>\n<br/>\nI&#39;ll do it if the thing is interesting to me, or was hard to find. <br/>\n<br/>\nBut if it&#39;s something the person could have easily found herself, I start to <br/>\nget edgy.<br/>\n<br/>\nAsking people who know is a reasonable way to get information, but if <br/>\nsomeone&#39;s being an unschooling mom, I think she should start moving toward <br/>\nbeing a model of resourcefulness for her children.   At least to the point of <br/>\nusing search functions at yahoogroups or a search engine.<br/>\n<br/>\nAt least to the point of looking at the bottom of an e-mail to see if it <br/>\ntells how to get off the list, without blaming the people on the list for <br/>\nboring her too much for her to be willing to get her own information.<br/>\n<br/>\nI do remember being new to the internet and it being a pretty weird and <br/>\ninefficient place.  But nowadays it&#39;s very efficient.<br/>\n<br/>\nIt&#39;s okay to ask a librarian where a book is instead of looking it up, I <br/>\nsuppose, and that&#39;s probably basically what&#39;s going on.  But the librarian <br/>\napplied for that job and is being paid to do it.  To just go in and ask the <br/>\nother patrons to find your books seems a little breezy to me.  <br/>\n<br/>\nAnd if someone&#39;s paying by the minute to be online, they can&#39;t goof around <br/>\nwith google for free.  I understand that, and am willing to help somone if <br/>\nthey&#39;re new or don&#39;t have a free dial-up or whatever.  <br/>\n<br/>\nAnyone who has never used www.google.com should go there and just goof with <br/>\nit.  Throw your own name in.  Your dog&#39;s name.  The name of the <br/>\nfunniest-sounding city you ever heard of.   Your favorite cartoon.   A <br/>\npresident.   <br/>\n<br/>\nKings of France.  There is a really cool list of those here:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.scotlandroyalty.org/france.html\">http://www.scotlandroyalty.org/france.html</a><br/>\n<br/>\nAnd there&#39;s music.   That song is commonly called (these days) &quot;Ding Dong <br/>\nMerrily on High&quot; because someone put Christmas words to it, but it was a <br/>\ndance piece before that, called &quot;Official Bransle&quot;---very  nice tune, and <br/>\nthat&#39;s a great midi of it, too!<br/>\n<br/>\nI&#39;ll start a new thread for people to show us the interesting webpages <br/>\nthey&#39;ve come across in their wanderings.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":63411,"nextTopicId":63375}}