{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1512150,"authorName":"Peggy","from":"Peggy &lt;peggy@...&gt;","profile":"margotapple","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"NEWS Peace Activist, Author Philip Berrigan Dies","postDate":"1039364486","msgId":50998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNERjM3MTg2LjIwRTUyNzA3QGxpbm1heC5zYW8uYXJpem9uYS5lZHU+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":50997,"nextInTime":50999,"topicId":50998,"numMessagesInTopic":0,"msgSnippet":"Peace Activist, Author Philip Berrigan Dies By Colman McCarthy Special to The Washington Post Sunday, December 8, 2002; Page C11 Philip Berrigan, 79, a","messageBody":"<div id=\"ygrps-yiv-1302129256\">Peace Activist, Author Philip Berrigan Dies<br/>\n<br/>\nBy Colman McCarthy<br/>\nSpecial to The Washington Post<br/>\nSunday, December 8, 2002; Page C11<br/>\n<br/>\nPhilip Berrigan, 79, a pacifist, writer and iron-willed advocate for peace<br/>\nwhose nonviolent protests against militarism led to repeated imprisonments,<br/>\ndied of cancer Dec. 6 at his home in Baltimore.<br/>\n<br/>\nFor nearly four decades, Mr. Berrigan, a former Roman Catholic priest, was a<br/>\nmajor figure in the American peace movement, with his stature bolstered by<br/>\nhis willingness to endure long prison stretches in county, state and federal<br/>\ncells.<br/>\n<br/>\nBelieving, as did Martin Luther King Jr., that &quot;war is our government&#39;s<br/>\nnumber one business,&quot; Mr. Berrigan began his dissent against military<br/>\nviolence in 1967, when he and three others destroyed draft records in a<br/>\ngovernment office in Baltimore. In 1968, he and another group struck again<br/>\nat a Catonsville, Md., selective service facility, where hundreds of draft<br/>\nrecords were burned with homemade napalm.<br/>\n<br/>\nArrested and convicted, he was the first American Catholic priest to be<br/>\njailed for political dissent, according to one biographer. He later<br/>\nescalated his high-stakes protests by furtively entering military bases to<br/>\ndo symbolic damage to warplanes, bombs and other weapons of mass<br/>\ndestruction.<br/>\n<br/>\nWhat juries and judges perceived as lawbreaking -- being &quot;a danger to the<br/>\ncommunity&quot; said a North Carolina judge in 1993 -- Mr. Berrigan saw as<br/>\nallegiance to international treaties forbidding nations to prepare for wars<br/>\nof annihilation.<br/>\n<br/>\nIn time, large numbers of pacifists, modeling themselves after Philip<br/>\nBerrigan, would engage in similar antiwar actions. Collectively, they became<br/>\nknown as the Plowshares Movement, a loosely organized coalition credited<br/>\nwith more than 80 separate actions that almost always resulted in jail<br/>\nterms. Nuns and priests were among those locked up.<br/>\n<br/>\nWhether by himself or with legal help from such human rights lawyers as<br/>\nRamsey Clark and William M. Kunstler, Mr. Berrigan argued to judges &quot;the<br/>\nnecessity defense.&quot;<br/>\n<br/>\nIn &quot;Fighting the Lamb&#39;s War: Skirmishes with the American Empire,&quot; his 1996<br/>\nautobiography, Mr. Berrigan writes: &quot;If a house full of children is burning,<br/>\nit is necessary to break the door down to rescue them. [In our trials] the<br/>\ngovernment refused to allow the necessity defense, arguing that we could not<br/>\nprove that nuclear war was imminent. We explained that nuclear war could<br/>\nhappen at any time. It was imminent because the government was designing,<br/>\nbuilding and deploying nuclear weapons. It was imminent because our air,<br/>\nwater and food supply were being poisoned with radioactive isotopes. All<br/>\nweapons, nuclear and conventional, reflect the spirit of murder, rather than<br/>\nof hope.&quot;<br/>\n<br/>\nAt a Pennsylvania trial in 1981, the judge snapped: &quot;Nuclear warfare is not<br/>\non trial here. You are.&quot;<br/>\n<br/>\nThrough the late 1990s, Mr. Berrigan, a sturdily-built, gregarious man,<br/>\naccumulated more than a dozen years of prison time, including federal stints<br/>\nin Danbury, Conn., and Lewisburg, Pa.<br/>\n<br/>\nHis methods of resistance often drew criticism. From the right, he was<br/>\nridiculed as a professional prisoner whose actions had no effect on public<br/>\npolicy. Some on the left said that his destroying of property -- damaging<br/>\nweapons, burning draft records -- was itself a form of violence.<br/>\n<br/>\n&quot;It is a curious argument,&quot; Mr. Berrigan wrote, &quot;one I&#39;ve heard many times.<br/>\nWarheads whose sole purpose is to vaporize cities are hardly to be thought<br/>\nlegitimate property. Bombs that indiscriminately murder millions of men,<br/>\nwomen and children are not &#39;property.&#39; &quot;<br/>\n<br/>\nThe youngest of six brothers in a Syracuse, N.Y., Irish, Catholic household,<br/>\nMr. Berrigan enthusiastically joined the Army during World War II. As an<br/>\ninfantry officer, &quot;I was a highly skilled young killer. I thought that&#39;s<br/>\nwhat patriots do. God may tell us not to kill, but when the state calls, we<br/>\nmust obey. We must become remorseless killers, willing to use any means to<br/>\ndefend against the enemy.&quot;<br/>\n<br/>\nHis conversion to nonviolence was years ahead.<br/>\n<br/>\nAfter the war, and a degree from Holy Cross College, Mr. Berrigan studied<br/>\nfor the priesthood in the Josephite order. Following his ordination in<br/>\nWashington in 1955, he served for a year in an impoverished parish in<br/>\nAnacostia.<br/>\n<br/>\nIn 1957, he was sent to New Orleans, where he taught theology for seven<br/>\nyears in an all-black parish high school. It proved to be a radicalizing<br/>\nexperience: &quot;I set out to discover why my black parishioners lived in<br/>\nghettos, why their children attended all-black schools, why hospitals<br/>\nrefused black patients, why the police routinely beat and even killed black<br/>\ncitizens. And the quest always returned to the same poisonous tree [of<br/>\nracism], the roots of which were strangling our nation&#39;s soul.&quot;<br/>\n<br/>\nBy the mid-1960s, and now serving in a Josephite parish in Newburgh, N.Y.,<br/>\nhe was ordered by his superiors to stop speaking out against injustice: &quot;I<br/>\nwas told, quite literally, to shut my mouth.&quot;<br/>\n<br/>\nHe declined.<br/>\n<br/>\nIn 1970, at 43, he married Elizabeth McAlister, a member of the Religious<br/>\nOrder of the Sacred Heart. Because he was a priest and she a nun, the couple<br/>\nat first did not make their union known publicly. When they did, in 1973,<br/>\nboth were immediately excommunicated by the Catholic church. Eventually Mr.<br/>\nBerrigan, gifted with Irish wit, would describe himself as &quot;a Catholic<br/>\ntrying to become a Christian.&quot;<br/>\n<br/>\nThe couple settled in a Baltimore working-class neighborhood. They called<br/>\ntheir home Jonah House, one that soon became a communal haven for prayer<br/>\nmeetings, antiwar strategizing and students looking for guidance in simple<br/>\nliving. Mr. Berrigan earned a modest income from house painting, lecturing<br/>\nand writing.<br/>\n<br/>\nAmong the regular visitors to Jonah House was the Rev. Daniel Berrigan, a<br/>\nJesuit priest and Philip&#39;s older brother. The two were soul mates and, often<br/>\nenough, cellmates. Linguist and political dissident Noam Chomsky called the<br/>\ntwo brothers &quot;heroic individuals, willing to do what many realize should be<br/>\ndone, regardless of the personal cost, with a simplicity of manner. There<br/>\nare not too many people of whom this can be said.&quot;<br/>\n<br/>\nAway from the barricades, Philip Berrigan was known less as a resolute<br/>\ndefier of state and church power than as a person of deep compassion, faith<br/>\nand generosity.<br/>\n<br/>\nActor Martin Sheen, a friend, described Mr. Berrigan as &quot;a Christian who<br/>\ntruly walks the radical way of the cross. [He] overturns the tables of<br/>\ninjustice and summons us to love our enemies and worship the God of peace.<br/>\nLike Thoreau, Gandhi, King and [activist and journalist] Dorothy Day, Phil<br/>\nBerrigan exemplifies courage. He is both an inspiration and a challenge to<br/>\nme and countless others.&quot;<br/>\n<br/>\nBooks by Philip Berrigan include &quot;The Catholic Church and the Negro&quot; (1962),<br/>\n&quot;No More Strangers&quot; (1966), &quot;A Punishment for Peace&quot; (1969), &quot;Prison<br/>\nJournals of a Priest Revolutionary&quot; (1970), &quot;Widen the Prison Gates:<br/>\nWritings from Jails, April 1970-December 1972&quot; (1973), &quot;Whereupon to Stand:<br/>\nthe Acts of the Apostles and Ourselves&quot; (1993) and, with Elizabeth<br/>\nMcAlister, &quot;The Time&#39;s Discipline: the Beatitudes and Nuclear Resistance&quot;<br/>\n(1993).<br/>\n<br/>\nIn addition to his wife and brother Daniel, survivors include three children<br/>\nand three other brothers.<br/>\n<br/>\n© 2002 The Washington Post Company</div>","specialLinks":[]}],"prevTopicId":50994,"nextTopicId":50990}}