{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":8151304,"authorName":"rubyprincesstsg@aol.com","from":"rubyprincesstsg@...","profile":"rubyprincesstsg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] painful memories, veering into other topics","postDate":"1133042919","msgId":110224,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0Ljc1YjMwNTRjLjMwYmEzNmU3QGFvbC5jb20+"},"prevInTopic":110219,"nextInTopic":0,"prevInTime":110223,"nextInTime":110225,"topicId":110219,"numMessagesInTopic":0,"msgSnippet":"My son still  doesn t remember the actual accident when he s in a conscious state.  He  only remembers seeing the deer and thinking he didn t have to hit it. I","messageBody":"<div id=\"ygrps-yiv-1430569485\">My son still  doesn&#39;t remember the actual accident when he&#39;s in a conscious <br/>\nstate.  He  only remembers seeing the deer and thinking he didn&#39;t have to hit  <br/>\nit.<br/>\n <br/>\nI think he has some memory below that conscious surface level because of  how <br/>\nhis body was reacting while he was sleeping, from peaceful to startled to  <br/>\njumping and reaching out and moaning, of which he also doesn&#39;t remember.<br/>\n <br/>\nI think sometimes it&#39;s a good thing that the really bad parts aren&#39;t easily  <br/>\nbrought to the conscious mind, especially when one is trying to physically <br/>\nheal  as well.<br/>\n <br/>\nThe pictures stunned him, he reacted in a way I&#39;ve never seen him  physically <br/>\nreact to anything, much less a photo of something passed.  I  think somewhere <br/>\ninside there probably is a terrified boy who couldn&#39;t control a  car veering <br/>\noff the road and smacking very loudly a large tree and breaking  glass and <br/>\nbody parts hitting and flying and landing.  It made me very sad  to see the look <br/>\nin his face and I had to put away the photos for some time  because of how he <br/>\nwas reacting.  I know he&#39;s changed in some ways, I guess  we all change with <br/>\nthings like that.<br/>\n <br/>\nThat is a really cool thing your friend is doing, thanks for passing it  <br/>\nalong, I believe it&#39;s something our family will want to participate in.<br/>\n <br/>\nglena<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"painful memories, veering into other topics","postDate":"1133040201","msgId":110219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5OS40MjA3MmYuMzBiYTJjNDlAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":110224,"prevInTime":110218,"nextInTime":110220,"topicId":110219,"numMessagesInTopic":0,"msgSnippet":"... =============== The reason I was asking is that it can take WAY longer than that for someone to remember what led up to a traumatic injury.   I m glad","messageBody":"<div id=\"ygrps-yiv-1335044620\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; No, he said  that later the next day, the last thing he remembered was <br/>\n&gt; coming<br/>\n&gt; around the  curve and seeing a deer standing there looking at him<br/>\n&gt; <br/>\n </span></blockquote>===============<br/>\n<br/>\nThe reason I was asking is that it can take WAY longer than that for someone <br/>\nto remember what led up to a traumatic injury.   I&#39;m glad there was another <br/>\nwitness. <br/>\n<br/>\nTwenty years ago I broke my leg in the mountains, and it &quot;just happened.&quot;   I <br/>\nwas saying &quot;I fell&quot; when people would ask me, and as soon as possible there <br/>\nwas morphine and sleeping and other forms of &quot;out&quot; and when I would try to <br/>\nremember what happened there was just whiteness in my brain, because it was so <br/>\nscary and unexpected, my brain just didn&#39;t know how to process it.   <br/>\nGradually the picture back up and up until I could remember it clearly, but <br/>\nit was six or seven days before that happened.     <br/>\n<br/>\nIt&#39;s hard to describe in words, but there was a stick on uneven ground in <br/>\npitch darkness.   I stepped on it with one foot, and was wearing used <br/>\nBirkenstocks I wasn&#39;t really used to yet and were a bit too big for me, and my foot <br/>\npivoted, like I was rocking on it and I didn&#39;t know whether I would fall forward or <br/>\nbackward, so I slammed my other leg down to catch myself, but the same stick <br/>\nwas there, only a little higher (I slammed my foot down like I would&#39;ve had I <br/>\nbeen standing on an absolutely flat floor) and so it also pivoted there and <br/>\nbroke.   <br/>\n<br/>\nI didn&#39;t break my leg because I fell, I fell because I broke my leg, myself, <br/>\nand then collapsed onto it with my whole weight.     Yuck.   No wonder the <br/>\nwhole peaceful picture didn&#39;t come flooding back at once.<br/>\n<br/>\nI think when people have an accident and someone else is killed, even without <br/>\nany drug or alcohol involvement, they might NEVER clearly remember all that <br/>\nhappened because their brain just won&#39;t think the thoughts or build the images.<br/>\n<br/>\nI new my friend Jay from before he remembered abuse by a priest, through the <br/>\ntime that he vaguely thought maybe something had happened until he could <br/>\ndetail several incidents.   And he felt guilty, like he was building the stories, <br/>\nbut I talked to him through years of that, and when he finally said &quot;Father <br/>\nWilkenson did this to me,&quot; others had reported similar things.    <br/>\n<br/>\nI went to Jay&#39;s site to get the name, but found something way better instead:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.weirdload.com/bestgift.html\">http://www.weirdload.com/bestgift.html</a><br/>\n<br/>\nIt&#39;s something he wrote about donating money to disaster survivors instead of <br/>\ngiving Christmas gifts, and then give a card to each person you would&#39;ve <br/>\ngiven a gift to instead.   He&#39;s even designed two cards and set the file up so you <br/>\ncan print them out in color or b&W to be colored.<br/>\n<br/>\nThat&#39;s cool.<br/>\n<br/>\nHe didn&#39;t say he did the art, but he did.   He&#39;s an artist and I&#39;ve seen his <br/>\nstuff for years, and he&#39;s done art for projects we were both working on, and <br/>\none year a Christmas card for me to send.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":110202,"nextTopicId":110211}}