{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valeries@...&gt;","replyTo":"LIST","senderId":"vMHulqud3XNUYUVa_TX9ED_HMtnq2-_WwBwYcLbestepZDsuu3lRWjmSoOowjCiG4titgkJ17Qst0Z5o2yj7QElVpeyxiQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FW: [Unschooling-dotcom] re:vaccination","postDate":"969656038","msgId":13290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDUwMWMwMjRkNyQzYTVlNDhjMCQxYTA1M2VhNkB3dnVzLm9yZz4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13289,"nextInTime":13291,"topicId":13290,"numMessagesInTopic":0,"msgSnippet":"... From:\tValerie [mailto:valeries@whyweb.com] Sent:\tFriday, September 22, 2000 12:45 PM To:\tcatwhois@home.net Subject:\tRE: [Unschooling-dotcom] re:vaccination","messageBody":"<div id=\"ygrps-yiv-1643494083\">-----Original Message-----<br/>\nFrom:\tValerie [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:valeries@...\">valeries@...</a>]<br/>\nSent:\tFriday, September 22, 2000 12:45 PM<br/>\nTo:\t<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:catwhois@...\">catwhois@...</a><br/>\nSubject:\tRE: [Unschooling-dotcom] re:vaccination<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I meant is, now the push in on for everyone to get this<br/>\n&gt; vaccination....everyone, not only those in a risk group. Have you ever<br/>\n&gt; heard of anyone not in the risk groups dying from complications of<br/>\n&gt; chickenpox?  (infections, pneumonia)  Why immunize healthy little<br/>\n&gt; children for it? Why not just those at risk?<br/>\n<br/>\n </span></blockquote>There is a tri-fold reason.  1.  Healthy children *do* die from this<br/>\ndisease.  There always have been healthy children dying from this<br/>\ndisease.  2.  Most people who are in a high risk group (AIDS,<br/>\nChemo) *can&#39;t* take the vaccines.  They dont&#39; have the immunities<br/>\nto fight off even the vaccination.  They *can&#39;t* build up immunities to<br/>\nthe disease.  So therefore the consideration is to immunize those<br/>\nthat can be immunized to save those that can&#39;t.  3.  Convenience.<br/>\n(Not a valid excuse imo, but it is one of the reasons that a lot of<br/>\nparents immunize their healthy children.)  We live in a culture<br/>\nwhere people don&#39;t want to have to take off 5-14 days of work<br/>\nbecause their children have a disease that they could have avoided<br/>\nby immunizing.<br/>\n<br/>\n**I thought of reason #2 after I posted, however, it still doesn&#39;t<br/>\ncompletely make sense to me. Should all little children be vaccinated<br/>\nagainst everything so that the seriously ill (fatally ill in some cases)<br/>\nwill supposedly not be exposed to these diseases? If that&#39;s a good reason,<br/>\nwhy hasn&#39;t it been promoted? The chicken pox vaccine is relatively new and<br/>\nis known not to be completely effective. So that argument is weak already.<br/>\nAnd since most adults (in America at least) have had chickenpox already,<br/>\nwouldn&#39;t they would be immune from it, even if they do have AIDS, etc?<br/>\n<br/>\n**About reason #1...the only otherwise healthy children I know of who had<br/>\ncomplications due to chickenpox have been Native Americans. &quot;White man&#39;s&quot;<br/>\ndiseases like cp or measles obliterated whole tribes, since they had no<br/>\nimmunities to them. If my children had NA blood you bet I&#39;d immunize. But<br/>\nthat&#39;s a whole different situation.<br/>\n<br/>\n**You probably don&#39;t need to ask what I think of #3.<br/>\n<br/>\nThis is one of the diseases that the CDC and the WHO wish to<br/>\nirradicate from Earth.  Small pox was once a rampant killer, yet<br/>\nthrough mass immunizations all around the work we have almost<br/>\ncompletely erased small pox from this planet.  The other diseases<br/>\nthat the WHO wish to iradicate are Diptheria, Pertussis, and Polio.<br/>\nPolio, BTW, is still a problem in this country.  There was not the<br/>\nwide spread immunization against polio like there was against<br/>\nsmall pox.  Many countries don&#39;t immunize against polio and<br/>\nstrains of it are showing up here in the US that have been brought<br/>\nin due to immigration and visitation.<br/>\n<br/>\n***Here&#39;s something to lose sleep over: smallpox is not completely gone. It<br/>\nwas thought to be eradicated, but here and there cases show up. We don&#39;t get<br/>\ninoculated for it anymore. It&#39;s &quot;gone&quot; so why vaccinate? I saw a news story<br/>\nabout smallpox being kept  in the old Soviet Union for possible germ<br/>\nwarfare. A left-over from the Cold War. The only thing is no one&#39;s getting<br/>\nrid of it or even really taking care of it. And there&#39;s no big storage of<br/>\nthe vaccine at the ready. What would happen if somehow this was unleashed?<br/>\n<br/>\n***I thought most new polio cases in the US were from the oral vaccine<br/>\nitself?  I&#39;ve certainly been wrong before.<br/>\n<br/>\nPlease don&#39;t get me wrong.  I am not a Rah-Rah Gotta Vaccinate<br/>\n&#39;Em All type person.  I really respect people&#39;s informed decisions<br/>\nnot to vaccinate.  However, I think it is important for people to fully<br/>\nunderstand the entire issue.  We don&#39;t immunize against Hep. B<br/>\nuntil our children get much older.  We are also delaying<br/>\nimmunizing our son against MMR until he is much older and has<br/>\nhad more chance to develop his language and motor skills.  MMR<br/>\ndoes not &quot;cause&quot; autism, but it can enhance it in people who are<br/>\nmore at a risk.  The statistics get a little skewed sometimes.<br/>\n<br/>\nI hope you can see where I am coming from.<br/>\n<br/>\nI do see where you&#39;re coming from Michelle and I appreciate the information.<br/>\nI am not rabidly anti-vaccination. I just want the truth...all the<br/>\npossibilities. I think we are &quot;on the same page&quot;. I understand what you mean<br/>\nabout MMR not &quot;causing&quot; autism, but it can trigger an autistic reaction that<br/>\nmay or may not be overcome. I really am fed up with the mainstream medical<br/>\ncommunity for not coming clean about things like this. I really don&#39;t<br/>\nbelieve the benefits always outweigh the risks.<br/>\n<br/>\n---Valerie</div>","specialLinks":[]}],"prevTopicId":13163,"nextTopicId":13299}}