{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"re: structured agendas","postDate":"1018257871","msgId":34210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2YS5iYjViMjlmLjI5ZTJiYmNmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":34209,"nextInTime":34211,"topicId":34210,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-70614978\">&lt;&lt;With regard to the comment that &quot;one cannot claim to be a vegetarian if one <br/>\nhas not eaten meat with breakfast,&quot; -- I don&#39;t claim to be an &quot;unschooler.&quot;  <br/>\nI claim to be, and am, a homeschooler who uses a blend of unschooling and <br/>\nsomething else. &lt;&lt;<br/>\n<br/>\nYou might just say your kids have &quot;free choice time,&quot; which is what it sounds <br/>\nlike you really mean when you say you &quot;use unschooling.&quot;<br/>\n<br/>\nIf you went to a vegetarian message board and said, &quot;I use a blend of both <br/>\nvegetarianism and carnivorism,&quot; the vegetarians there would say that that <br/>\nmakes you a carnivore, not a vegetarian.  <br/>\n<br/>\nI know someone who uses a curriculum-in-a-box. The kids are required to do <br/>\nit. The family is a joy-filled and pretty respectful-of-each-other family and <br/>\nthe kids and mom have a good time with their curriculum and are proud of the <br/>\nwork they do. They don&#39;t feel bound by the most stringent of the requirements <br/>\nof their program. The curriculum says do 2 pages each day and they are <br/>\nflexible and might do 3 pages one day and only 1 page another day. They SKIP <br/>\ndays altogether, to go on field trips, for example. On nice days they might <br/>\ntake their work outside. <br/>\n<br/>\nThey call themselves unschoolers and feel like they are being really <br/>\nflexible. But the use of that curriculum is teaching all kinds of unintended <br/>\nlessons that unschoolers want to avoid. It contradicts the basis of <br/>\nunschooling, to &quot;impose&quot; any school-like lessons at all. <br/>\n<br/>\nIt might be interesting to talk a bit more concretely about  why having some <br/>\nfree choice time mixed with imposed lessons isn&#39;t unschooling -- just as <br/>\nhaving some meatless meals isn&#39;t vegetarianism.<br/>\n<br/>\nUnschoolers often point out that it isn&#39;t unschooling if you do any schooling <br/>\nat all. The reason is that unschoolers believe there are negative <br/>\nconsequences of that time spent &quot;schooling.&quot; As one example, children become <br/>\nused to the idea that someone else should tell them what to learn and how to <br/>\nlearn it and they begin to see themselves as vessels that need to be filled <br/>\nrather than feeling responsible for their own learning. This is not how <br/>\nunschoolers see children, so imposing any lessons on children contradicts a <br/>\nbasic unschooling principle.<br/>\nKids given school-like lessons also start to think there is a time for <br/>\nlearning and a time for playing and that those are different things. That <br/>\nagain contradicts a basic unschooling principle. There are more, but those <br/>\ncouple of examples get the point across, I hope.<br/>\n<br/>\n--pamS</div>","specialLinks":[]}],"prevTopicId":34207,"nextTopicId":34186}}