{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Cathie _","from":"&quot;Cathie _&quot; &lt;cathie_98@...&gt;","replyTo":"LIST","senderId":"-CrrX5lLJRTWgZ03fZJenYAeWWd2-TkyfVZwRhR-jG-dM9K9Piv1CbnHtYBcrTyK0JETmWuPGtVJtf8hh6CtzxsQTBaBh2Z2HA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] self-healing circles","postDate":"968110209","msgId":12648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyMTFiS1A3SWU4dGxNYXpVU3gwMDAwMjU4M0Bob3RtYWlsLmNvbT4="},"prevInTopic":12632,"nextInTopic":0,"prevInTime":12647,"nextInTime":12649,"topicId":12632,"numMessagesInTopic":0,"msgSnippet":"... I would like a list. Thank you for sharing this with us. Cathie _________________________________________________________________________ Get Your Private,","messageBody":"<div id=\"ygrps-yiv-1271883864\"><blockquote><span title=\"ireply\">&gt;Let me know how it goes. There are a lot more books that I would recommend,<br/>\n&gt;such as &quot;Getting The Love You Want&quot; or &quot;Conscious Loving&quot;, and others. If<br/>\n&gt;you want I will send you a list.<br/>\n&gt;<br/>\n&gt;All the best,<br/>\n&gt;Nicoletta<br/>\n&gt;<br/>\n </span></blockquote>I would like a list. Thank you for sharing this with us.<br/>\n<br/>\nCathie<br/>\n_________________________________________________________________________<br/>\nGet Your Private, Free E-mail from MSN Hotmail at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hotmail.com\">http://www.hotmail.com</a><br/>\n<br/>\nShare information about yourself, create your own public profile at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://profiles.msn.com\">http://profiles.msn.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"RENEE WALLACE-MAYER","from":"RENEE WALLACE-MAYER &lt;floscean203@...&gt;","replyTo":"LIST","senderId":"njQ_vG7jFNEgvOHUoYTjYEcZMub42h86tthq3dox9bgEt0EbrntZ_M5inqT28MSwZ4sr37RoJsSx_n8SU6DGHICibcy9rdOVtup68B8GbBagAxRYdpuf","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] self-healing circles","postDate":"968093206","msgId":12632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2QwMWMwMTZhMCQ3YWMwYWQ4MCRkODU4OTBjZkAwMDM1NDIwMTI+","referencesHeader":"PDAwMzYwMWMwMTY4MCRjMDljY2I2MCRjYTcyOWE4ZUBmbWFubnM+"},"prevInTopic":0,"nextInTopic":12648,"prevInTime":12631,"nextInTime":12633,"topicId":12632,"numMessagesInTopic":0,"msgSnippet":"Hi Nicoletta, I d like to email you privately, if I could. Could you email me with your address at your convenience. Thanks, Renee I m at","messageBody":"<div id=\"ygrps-yiv-1862269009\">Hi Nicoletta,<br/>\nI&#39;d like to email you privately, if I could.<br/>\nCould you email me with your address at your convenience.<br/>\nThanks, Renee<br/>\nI&#39;m at  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:floscean203@...\">floscean203@...</a><br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;Shannon Nicoletta Manns&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:snmanns@...\">snmanns@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a>&gt;; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:floscean203@...\">floscean203@...</a>&gt;<br/>\nSent: Monday, September 04, 2000 10:59 AM<br/>\nSubject: [Unschooling-dotcom] self-healing circles<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; Thank you for your response to my long post, Renee.<br/>\n&gt;<br/>\n&gt; When you go looking for a self-healing circle, please be sure you look for<br/>\na<br/>\n&gt; place that allows for full expression of all emotions, especially the<br/>\n&gt; so-called negative ones (rage, sadness, etc). I am not talking about a<br/>\n&gt; circle of people sitting around talking about how they feel or what they<br/>\n&gt; have experienced, but rather people actually feeling and fully expressing<br/>\n&gt; their feelings. This can be done without blaming someone else for our<br/>\n&gt; feelings. Sometimes if a person just can&#39;t seem to get past blaming we set<br/>\n&gt; up what we call a &#39;container&#39;. Then the person can vent and rage and blame<br/>\n&gt; until they are finished, without anyone interrupting at all. Then the<br/>\n&gt; process of &#39;cleaning up&#39; needs to happen, especially if the intensity is<br/>\n&gt; between two people within the circle, say a husband and wife. We need to<br/>\n&gt; sometimes be allowed to just vent, but the person receiving the &#39;vent&#39;<br/>\nneeds<br/>\n&gt; to have enough substance to NOT TAKE ON THE RESPONSIBILITY FOR THE OTHER<br/>\n&gt; PERSON&#39;S FEELINGS (not take things personally).<br/>\n&gt;<br/>\n&gt; Say a wife really needs to express some strong anger at her husband,<br/>\ndoesn&#39;t<br/>\n&gt; quite know how to do it without sounding like she is blaming him, she can<br/>\n&gt; ask him to be a container for her. If he feels strong enough to handle her<br/>\n&gt; rage without taking it on and then getting defensive - great. If he<br/>\ndoesn&#39;t<br/>\n&gt; feel strong enough to do that, the wife may have to pick someone else  to<br/>\n&gt; take his place and he may be present as witness. In the end, whatever the<br/>\n&gt; wife is feeling towards her husband has at the core very little to do with<br/>\n&gt; her husband, but most likely originated within her own first family. The<br/>\n&gt; purpose of circle is to get to the core of things and deal with them at<br/>\nthat<br/>\n&gt; level.<br/>\n&gt;<br/>\n&gt; I have come to believe that we choose our partners and draw out of our<br/>\n&gt; partners the very things we need to heal in ourselves the most. That to me<br/>\n&gt; is the main purpose for intimate relationships. The more intimate you get,<br/>\n&gt; the greater the potential for healing for both partners.<br/>\n&gt;<br/>\n&gt; If you have trouble finding a self-healing circle where you are I could<br/>\ngive<br/>\n&gt; you some more info about exactly what we do and the tools we use and maybe<br/>\n&gt; you could start your own self-healing circle. To begin with here is a<br/>\n&gt; sample:<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; BEING IN CIRCLE by Sedonia Camu and Joshua Halpen<br/>\n&gt;<br/>\n&gt; Angeles Arrien says that we need to do four things to make our lives work<br/>\n&gt; and they apply to being authentic in the circle as       She says we must<br/>\n&gt; show up, pay attention, tell the truth, and not be attached to the<br/>\noutcome.<br/>\n&gt; A circling community allows many opportunities to practice these skills by<br/>\n&gt; teaching us to be fully present, to pay attention to our deepest impulses<br/>\n&gt; and to be alert and aware of others. We learn to tell the truth so that we<br/>\n&gt; can be deeply known just as we are while discovering more about our-<br/>\nselves.<br/>\n&gt; Our commitment needs to be so great to these principles that we do them<br/>\n&gt; regardless of the outcome. This means that we &quot;give away&quot; from the very<br/>\nbest<br/>\n&gt; of ourselves. What makes a circle safe for practising this radically<br/>\n&gt; authentic behaviour, for going through public transformation is the unique<br/>\n&gt; quality that arises when there is harmony between the personal and the<br/>\n&gt; transpersonal.<br/>\n&gt; This state of awareness, contained within a circle, generates an energy<br/>\nthat<br/>\n&gt; cannot come from any other place. This is what has been called in -many<br/>\n&gt; traditions &quot;the Witness&quot;. To be an effective witness requires that we pay<br/>\n&gt; attention, not project, interpret, judge, or try to &quot;Fix&quot; the other. There<br/>\n&gt; is no room for interference in another&#39;s process. The witness is asked to<br/>\n&gt; sit in his or her own circle of Power, pay attention, take responsibility<br/>\n&gt; for what he or she is feeling, and not project his or her experience onto<br/>\n&gt; the other. The only way to really see someone else is to fully own our<br/>\n&gt; emotions, feelings, and thoughts.<br/>\n&gt; The need to be really seen is as great as the need for food and shelter,<br/>\nyet<br/>\n&gt; most of us go though life starving for reflection. We al I need to be seen<br/>\n&gt; with eyes filled with love, acceptance, and adoration. There is terrible<br/>\n&gt; loneliness and alienation when we feel no one sees, hears, or understands<br/>\n&gt; us. This loneliness lingers in circles unless the quality of witnessing is<br/>\n&gt; present.<br/>\n&gt; Sometimes as part of witnessing, people go through a stage in which they<br/>\n&gt; seem to know what they are feeling and they take the certainty that<br/>\naffords<br/>\n&gt; them and assume they know what others are feeling. This is not witnessing.<br/>\n&gt; For instance, sometimes when people feel afraid of another&#39;s pain they<br/>\nwill<br/>\n&gt; immediately reach out to hug or stroke them, which stops the process, or<br/>\n&gt; they might come up with a solution to the other person&#39;s dilemma or<br/>\ndiscount<br/>\n&gt; the other&#39;s feelings by saying it&#39;s not really so bad.<br/>\n&gt; All these are the reactions of someone who is afraid of his or her own<br/>\npain,<br/>\n&gt; or someone who is not being in circle.<br/>\n&gt; Learning how to witness is essential because we live in a time when great<br/>\n&gt; numbers of people am beginning to tell their truths. Some of these truths<br/>\n&gt; are hard to hear, some involve terrible childhood abuse and betrayal, yet<br/>\n&gt; they must be told and heard. When they are not heard properly the telling<br/>\nis<br/>\n&gt; undermined and damage, rather than healing, may result. It can take a long<br/>\n&gt; time to regain the courage to tell the story again.<br/>\n&gt; In the circle process, when people sit and speak from the deepest part of<br/>\n&gt; themselves, no matter how wounded, how much anguish or how many tears,<br/>\nthey<br/>\n&gt; then, at that moment, are sitting in their circle of power. They need to<br/>\nbe<br/>\n&gt; witnessed, that is, to be respected for their willingness to go so deep<br/>\nand<br/>\n&gt; be so vulnerable. What is required of us as witnesses is to sit in our own<br/>\n&gt; circle of power, owning our own pain and fear, fully being with those<br/>\n&gt; feelings and not projecting them outward.<br/>\n&gt; Our stories need to be heard, not fixed. Nobody needs fixing, we are not<br/>\n&gt; machines. All we need is to be heard. We need someone else to know- how<br/>\nhard<br/>\n&gt; it was, to know, that we have survived with dignity and that we are not<br/>\n&gt; afraid to feel. We as human beings need more than any- thing else to be<br/>\n&gt; seen, known, felt, accepted, and loved.<br/>\n&gt; When people are real in the circle we love them for their process of<br/>\n&gt; becoming whole. We love each other for being who we are, with all our<br/>\n&gt; perfections and imperfections. The essence of the process is to validate<br/>\n&gt; that we are living, breathing, dancing, real people who feel pain and fear<br/>\n&gt; and make mistakes, while living and caring about each other. The circle<br/>\nform<br/>\n&gt; creates a place for everyone to work, pray, be real and feel at one with<br/>\n&gt; each other, all together.<br/>\n&gt; Being in a circle teaches us to respect ourselves and one another. When<br/>\nthis<br/>\n&gt; happens we are brought into an experience of immanence and sacredness,<br/>\n&gt; making us better able to honour the beauty and integrity of the earth. If<br/>\n&gt; enough people gather in circle and grapple with their identities within<br/>\nthis<br/>\n&gt; context, it enhances the possibilities for us all. Creative group dynamic<br/>\nis<br/>\n&gt; essential if we are going to mobilize healing and create an ecological<br/>\n&gt; environment for ourselves.<br/>\n&gt;<br/>\n&gt; Let me know how it goes. There are a lot more books that I would<br/>\nrecommend,<br/>\n&gt; such as &quot;Getting The Love You Want&quot; or &quot;Conscious Loving&quot;, and others. If<br/>\n&gt; you want I will send you a list.<br/>\n&gt;<br/>\n&gt; All the best,<br/>\n&gt; Nicoletta<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; Addresses:<br/>\n&gt; Post message: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a><br/>\n&gt; Unsubscribe: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@egroups.com\">Unschooling-dotcom-unsubscribe@egroups.com</a><br/>\n&gt; List owner: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-owner@egroups.com\">Unschooling-dotcom-owner@egroups.com</a><br/>\n&gt; List settings page: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":12466,"nextTopicId":12654}}