{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: One foot in public school and one foot home","postDate":"1348237182","msgId":69111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwMjM0RUE0LUU0QUQtNENCQi1CQkM1LURCQjc1OTE5OUIzQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGszaHNnMytmMWZyQGVHcm91cHMuY29tPg==","referencesHeader":"PGszaHNnMytmMWZyQGVHcm91cHMuY29tPg=="},"prevInTopic":69110,"nextInTopic":0,"prevInTime":69110,"nextInTime":69112,"topicId":69105,"numMessagesInTopic":0,"msgSnippet":"A couple of bits on starting with teens: http://sandradodd.com/later/","messageBody":"<div id=\"ygrps-yiv-1951810091\">A couple of bits on starting with teens:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/later/\">http://sandradodd.com/later/</a></div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: One foot in public school and one foot home","postDate":"1348236611","msgId":69110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGszaHNnMytmMWZyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFDM0MxRTNFLUU4MEMtNEU2Ri04QTk1LUVBRUY4NkMxNTBCMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69109,"nextInTopic":69111,"prevInTime":69109,"nextInTime":69111,"topicId":69105,"numMessagesInTopic":0,"msgSnippet":"==If he really doesn t want to go to school, though, at all, what deschooling will look like is summer vacation extended for a year.  And your son will","messageBody":"<div id=\"ygrps-yiv-873665449\">==If he really doesn&#39;t want to go to school, though, at all, what deschooling will look like is summer vacation extended for a year.  And your son will deschool before you do.  And your husband will deschool about a year and a half or two after he starts, which means if he&#39;s unwilling to start, he never will.==<br/>\n<br/>\nMy oldest &quot;dropped out&quot; of school when he was 16. He had been to public school from kindergarten, so about 5 year old, until halfway through 7th grade, so 12, almost 13, years old. We decided to start homeschooling then. When he became high school aged we gave him the choice to homeschool or attend the local high school. He chose school...for a year. Once he learned that in the state we now live teens can stop attending school at 16 without parents permission, he just didn&#39;t go back after finishing the 9th grade.<br/>\n<br/>\nI saw it as us doing more deschooling that would hopefully lead to unschooling. Everyone else just saw it as him dropping out. We talked about community college. He tried it but wasn&#39;t interested. He did eventually decide to get his GED at 18. He is now 12, getting close to 22, and working at a local restaurant where he has just been promoted to shift manager. His general manager is grooming him to become a manager, I think. So, it seems that he is doing pretty well for himself.<br/>\n<br/>\nI&#39;m not sure how that information can help. Maybe it can just give an idea of what deschooling with an older, almost adult, teen might look like. I figure my son has his entire lifetime to go back to school or get a more formal academic education if he chooses. It&#39;s not an expectation or a requirement or a failure if he doesn&#39;t.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: One foot in public school and one foot home","postDate":"1348183946","msgId":69109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGszZzkyYStnNDFlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGszZmRhYStrZ25xQGVHcm91cHMuY29tPg=="},"prevInTopic":69108,"nextInTopic":69110,"prevInTime":69108,"nextInTime":69110,"topicId":69105,"numMessagesInTopic":0,"msgSnippet":"... ************************* I haven t read Llewellyn s books, so I don t know how much they have to do with unschooling as its discussed here. 17 is old to","messageBody":"<div id=\"ygrps-yiv-1344775377\">&quot;maggiestrees&quot; &lt;vanko@...&gt; wrote: <br/>\n<blockquote><span title=\"ireply\"> &gt; My husband, son (17, 11th grade) and I are reading two of Llewellyn&#39;s books. I am doing most of the reading because I enjoy this topic and they are trying to understand unschooling as well.<br/>\n </span></blockquote>*************************<br/>\n<br/>\nI haven&#39;t read Llewellyn&#39;s books, so I don&#39;t know how much they have to do with unschooling as its discussed here. 17 is old to beging unschooling. It takes time to recover from the effects of school - after 11 years of school it will take at least a year, maybe two, and by then he&#39;ll be beyond mandatory school age (maybe he is now, depending on where you live). So in that sense you&#39;re not really looking at unschooling so much as opting out of the last year of high school somehow. It has become kind of faddish for people to say &quot;unschooling&quot; instead of &quot;taking a break from school&quot; but you don&#39;t have to do that. He&#39;s done with school. Good riddance. What&#39;s next? <br/>\n<br/>\nMaybe next is he takes a year or two to rest and recover. It can really help to think of &quot;deschooling&quot; as being like getting over a major illness... or maybe a broken bone. Sometimes there&#39;s a big rush of excitement after leaving school, but often kids who leave school in the teens need a good chunk of time to rest. It&#39;s not uncommon for teens new to unschooling to spend a loooooot of time playing computer games for awhile. It can be unsettling if you aren&#39;t prepared for it! I was glad, when we finally pulled my stepson out of school (at 13) that I&#39;d been reading about unschooling for awhile and had a sense of what to expect. <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Is it usual for one parent to be more open to unschooling?<br/>\n<br/>\n </span></blockquote>Yes, especially at first, and often that&#39;s the mom. Dads are often much more skeptical and conservative at first, but with time can grow to be staunch advocates. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; my husband is deeply rooted in traditional education.<br/>\n<br/>\n </span></blockquote>Does he see that working for your son? <br/>\nWhat are his concerns if his son doesn&#39;t get a &quot;traditional education&quot;? Listen to what he has to say without shutting him down - it&#39;s Natural for him to be concerned about his kid! His thoughts and fears are important for more than just him, to an extent what he thinks about education has formed the background of his son&#39;s life and is already affecting what your son thinks about education and about himself. So if education is Good, and he&#39;s walking away from school, is he a loser? A failure? A bad kid? Those are ideas which will lurk in the back of your son&#39;s mind. <br/>\n<br/>\nMy partner quit school in his mid-teens and although he has worked as a carpenter and custom cabinetmaker and now has his own small business making electric guitars, he still sees himself on some level as a loser. If you can help your son see leaving school as an active choice, rather than &quot;just giving up&quot; it will help him feel better about himself and his choices for years to come. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Son has missed three days of school this week, so far.  What is typical in deschooling?<br/>\n </span></blockquote>****************<br/>\n<br/>\nHere&#39;s where I don&#39;t know how much Llewellen&#39;s description of unschooling lines up with what I think of as unschooling - you can&#39;t De-school if you&#39;re In school... but maybe those words are being used differently? I don&#39;t know. <br/>\n<br/>\nMissing school says pretty clearly: I don&#39;t want to do this. If school is grinding him down, help him find other options rather than setting him up to &quot;just drop out&quot;. Help him make an active choice rather than a passive one.<br/>\n<br/>\nSince your husband isn&#39;t thrilled with the idea of unschooling, you might look for ways to compromise - online curricula, community college courses, an internship, a job, volunteer work, an apprenticeship... I don&#39;t know what your son&#39;s interests are, so it&#39;s hard to know what to suggest. <br/>\n<br/>\nMy 19yo still lives kinda-sorta at home - we have a &quot;mother-in-law&quot; house on our land, a little one room cottage with limited amenities. Ray lives there rent-free and we pay the utilities. Over the past year he&#39;s set up a kitchenette and started doing all his own meals there. He&#39;s learning to be an artisan blacksmith and woodworker while and periodically goes to shows and events to sell his work. He also does assorted odd jobs - mostly either light construction or agriculural work. He&#39;s currently getting ready to go work on an organic farm for the big upcoming harvest season. It&#39;s certainly not a &quot;traditional education&quot; but he&#39;s doing things he loves. That&#39;s more than I could say at 19, slogging through college classes I&#39;ve now mostly forgotten.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] One foot in public school and one foot home","postDate":"1348172433","msgId":69108,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDgxNzI0MzMuNDMwMzkuWWFob29NYWlsTmVvQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGszZmRhYStrZ25xQGVHcm91cHMuY29tPg==","referencesHeader":"PGszZmRhYStrZ25xQGVHcm91cHMuY29tPg=="},"prevInTopic":69106,"nextInTopic":69109,"prevInTime":69107,"nextInTime":69109,"topicId":69105,"numMessagesInTopic":0,"msgSnippet":"Anne, I am glad you reached out here. You will get a lot more responses here than in the Unschooling Minnesota. I wanted to say that I did receive your email","messageBody":"<div id=\"ygrps-yiv-1529073372\">Anne,<br/>\nI am glad you reached out here.<br/>\nYou will get a lot more responses here than in the Unschooling Minnesota.<br/>\nI wanted to say that I did receive your email but it was so short and I did not  really understand what you wanted. I replied but then I got an email back saying that for me to send a reply to your email address I needed to click on a link and that is just a red flag for getting a virus online so I did not do it.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] One foot in public school and one foot home","postDate":"1348160391","msgId":69106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFDM0MxRTNFLUU4MEMtNEU2Ri04QTk1LUVBRUY4NkMxNTBCMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGszZmRhYStrZ25xQGVHcm91cHMuY29tPg==","referencesHeader":"PGszZmRhYStrZ25xQGVHcm91cHMuY29tPg=="},"prevInTopic":69105,"nextInTopic":69108,"prevInTime":69105,"nextInTime":69107,"topicId":69105,"numMessagesInTopic":0,"msgSnippet":"-=-This is my first post here. I am also posting on the Minnesota Unschooling Forum.-=- Please don t cross post.  Some people are on both discussions.  Choose","messageBody":"<div id=\"ygrps-yiv-876852535\">-=-This is my first post here. I am also posting on the Minnesota Unschooling Forum.-=-<br/>\n<br/>\nPlease don&#39;t cross post.  Some people are on both discussions.  Choose the place you think will be best.  Or word the question differently in two places.  When I see that moderated posts are sent to more than one group, I usually return them   <br/>\n<br/>\n-=-My husband, son (17, 11th grade) and I are reading two of Llewellyn&#39;s books. I am doing most of the reading because I enjoy this topic and they are trying to understand unschooling as well.-=-<br/>\n<br/>\n-=-Is it usual for one parent to be more open to unschooling? I am open while my husband is deeply rooted in traditional education. We want to respect one another&#39;s views, however, we are at odds.-=-<br/>\n<br/>\nIt&#39;s nearly impossible for both parents to be equally open to unschooling right at first.<br/>\n<br/>\n-=-Son has missed three days of school this week, so far. What is typical in deschooling? What can we expect? I find it helpful to hear from other parents.-=-<br/>\n<br/>\nMissing school isn&#39;t deschooling.<br/>\nMissing three days of school in one week can lead to suspension, or legal action.  <br/>\n<br/>\nAt seventeen, is he old enough to leave school?  Is there a community college near you?  Maybe instead of deschooling and unschooling, he can move to &quot;some college,&quot; which will help solve the problem of him and your husband feeling that he&#39;s &quot;a dropout.&quot;  When applying for jobs, very often the question is &quot;highest level of education&quot; and one option will be &quot;some college.&quot;<br/>\n<br/>\nIf he really doesn&#39;t want to go to school, though, at all, what deschooling will look like is summer vacation extended for a year.  And your son will deschool before you do.  And your husband will deschool about a year and a half or two after he starts, which means if he&#39;s unwilling to start, he never will.<br/>\n<br/>\nBut by the time you and your husband could deschool yourselves (which could be good for your own daily lives, even if you didn&#39;t have a son) your son will be 19 or 20. <br/>\n<br/>\nMaybe you should look at information (which is increasingly available about success without college, and alternative views to the use of money for tuition, or alternatively as investment (in the bank, or in the child&#39;s alternate move into the world--equipment or training or opportunities other than full-time, expensive university life.<br/>\n<br/>\nAbout deschooling:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<br/>\nThoughts about college, and  alternatives, if others could bring links too, that would be great.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://blakeboles.com\">http://blakeboles.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://unschooling.blogspot.com/2010/08/reasons-not-to-send-kids-to-college.html\">http://unschooling.blogspot.com/2010/08/reasons-not-to-send-kids-to-college.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/collegeissues.html\">http://sandradodd.com/collegeissues.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/college\">http://sandradodd.com/college</a>   (BUT PAM&#39;S GIRLS ARE SCHOLARLY, and many people are not, so don&#39;t take that as a blueprint, just as evidence of possibilities!)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217009109,"authorName":"maggiestrees","from":"&quot;maggiestrees&quot; &lt;vanko@...&gt;","profile":"maggiestrees","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"One foot in public school and one foot home","postDate":"1348155530","msgId":69105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGszZmRhYStrZ25xQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":69106,"prevInTime":69104,"nextInTime":69106,"topicId":69105,"numMessagesInTopic":0,"msgSnippet":"This is my first post here.  I am also posting on the Minnesota Unschooling Forum. My husband, son (17, 11th grade) and I are reading two of Llewellyn s books.","messageBody":"<div id=\"ygrps-yiv-442722487\">This is my first post here.  I am also posting on the Minnesota Unschooling Forum.<br/>\n<br/>\nMy husband, son (17, 11th grade) and I are reading two of Llewellyn&#39;s books. I am doing most of the reading because I enjoy this topic and they are trying to understand unschooling as well.<br/>\n<br/>\nIs it usual for one parent to be more open to unschooling?  I am open while my husband is deeply rooted in traditional education.  We want to respect one another&#39;s views, however, we are at odds.<br/>\n<br/>\nSon has missed three days of school this week, so far.  What is typical in deschooling? What can we expect?  I find it helpful to hear from other parents.<br/>\n<br/>\nWarm regards,<br/>\nAnne Louise</div>","specialLinks":[]}],"prevTopicId":69092,"nextTopicId":69117}}