{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Reassuring well-intentioned, concerned friends and family about later readers?","postDate":"1467812880","msgId":77298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0MkYxODc5LUQyOUYtNDQ4Ri04MEYzLTM4M0VCRTREN0ZFQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG5saWxoYSsxYm80aTMyQFlhaG9vR3JvdXBzLmNvbT4=","referencesHeader":"PG5saWxoYSsxYm80aTMyQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":77294,"nextInTopic":0,"prevInTime":77297,"nextInTime":77299,"topicId":77294,"numMessagesInTopic":0,"msgSnippet":"My first thought was “don’t go” (to the next family gathering), and my next thought was “don’t wait.” Create a blog with photos of things you’re","messageBody":"<div id=\"ygrps-yiv-370287618\">My first thought was “don’t go” (to the next family gathering), and my next thought was “don’t wait.”<br/>\nCreate a blog with photos of things you’re doing, and with your thoughts about learning, and send the all links when you have a new post (or an especially good one) so that even if they’re not subscribing and following on their own, they get notices.<br/>\n<br/>\nIt would give them some real things to talk about.<br/>\n<br/>\nMaybe, in advance, write to the all and say you don’t want your children tested—not even casually by relatives.   You could send them all a copy of “Free to Learn” by Pam Laricchia.  It’s not expensive, it’s short, attractive and clear.   Tell them that you’ll discuss it with anyone who has read it all and considered it.<br/>\n<br/>\nOther ideas are here (that idea and others):<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/response\">http://sandradodd.com/response</a><br/>\nand there are links to other things.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":205686259,"authorName":"","from":"juniper1270@...","profile":"juniper1270","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Reassuring well-intentioned, concerned friends and family about later readers?","postDate":"1467799914","msgId":77294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG5saWxoYSsxYm80aTMyQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":77298,"prevInTime":77293,"nextInTime":77295,"topicId":77294,"numMessagesInTopic":0,"msgSnippet":"I ve been following the reading age thread with a lot of interest and thanks to Jo for compiling the graph as I think it may be a really useful tool for","messageBody":"<div id=\"ygrps-yiv-79683710\">I&#39;ve been following the reading age thread with a lot of interest and thanks to Jo for compiling the graph as I think it may be a really useful tool for situations like mine. I&#39;ve also been following the links back to Sandra&#39;s page and reading there as well.<br><br>We are about to change from over a decade living in my husband&#39;s country to living the US where we will be very close to my immediate and extended family. They are warm, caring and in general, just LOVE kids. They bring lots of warmth, enthusiasm and fun experiences into to our lives and tend to organize lots of opportunities to spend time together.&nbsp; My family has lots of social workers, teachers and even a few reading specialists in the mix. Up until now, our contact has been once a year and it hasn&#39;t been that difficult to field questions and concerns about my children not reading, knowing letters, etc. Distance, my children&#39;s ages and our multilingualism have been wonderful defenses. Now my children are 10 and nearly 8. I am not at all worried about them learning to read, I have complete faith it will happen and our daily life is filled with small clues, (often very subtle in the case of my 10 yo son) that demonstrate that this process is happening. <br><br>What does worry me is the imminent frequent contact with all of the loving, concerned relatives who are absolutely convinced that reading must be taught and that my children&#39;s futures are in peril because they do not read yet and we are not actively remedying this situation. During last year&#39;s visit, a few people began expressing concern and I listened calmly and read some things regarding illiteracy that were passed on to me and it was enough to maintain the peace. This year I am fairly confident that relatives will be pushing kids to demonstrate knowledge they either don&#39;t have or wish to share and others will be pushing for testing for my son who demonstrates a lot of characteristics typical in dyslexia diagnosis. I know it will all be motivated from a place of love and I want to do whatever I can to help everyone feel as comfortable as possible so that reading doesn&#39;t end up becoming a barrier to our relationships. I would love to hear from any other families who feel they have navigated this area well and how they managed, both as parents reducing family members&#39; concern and in supporting children in situations where people are questioning their inability to read yet. My son is particular is very private and tends to really shut down and feel quite embarrassed when quizzed or pushed. He deeply resents unsolicited instruction and/or correction while my daughter is able to handle it with more savvy and has a more visible learning style.<br><br>For what it&#39;s worth, our lives are pretty text and word rich; apart from what we come across out in the world (which is a lot!), we go to the library frequently, have lots of books and magazines lying around and a pretty good collection of graphic novels, watch almost everything with subtitles because of the different mother tongues of the adults in the family, look stuff up online a lot, read aloud together multiple times a day. The kids game a lot and ask a lot of questions about what things say or how to find wikis for information, we play around with words rhyming, punning and messing about with sounds, noticing differences and similarities between our three languages as well as others we encounter on a regular basis, playing around with different accents, etc. Both parents read for information and pleasure regularly.... actually, thanks to this list and Sandra&#39;s page, I can&#39;t imagine my kids NOT learning to read, but am not sure how to turn this into something that sounds less like naive instinct on my part and more like an unequivocal fact. Joy&#39;s &quot;Refuting the Same Old Arguments&quot; was helpful and I loved the piece about Holly and the benefits of being a late reader (my kids have prodigious memories too!) but I would love to see that section expanded.<br><br>And while I am writing, I would like to take the chance to thank everyone who so carefully, considerately and generously shares their time and experience here.... your collective words over the last several years have without a doubt pushed me to question and evolve as a mother, partner and friend. The positive impact you have had on my life is tremendous and absolutely invaluable.<br><br>Mil gracias!<br>Jenny<br><br><br><br><p><span><br class=\"ygrps-yiv-79683710yui-cursor\"></span></p></div>","specialLinks":[]}],"prevTopicId":77289,"nextTopicId":77275}}