{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Beavis, Hank, Captain Billy","postDate":"1028613898","msgId":39920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2OC4xMWFlZmQyYy4yYTgwYzEwYUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":39919,"nextInTime":39921,"topicId":39920,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/5/02 9:36:43 PM, PSoroosh@aol.com writes:  From here down is a series of quotes","messageBody":"<div id=\"ygrps-yiv-1953192912\">In a message dated 8/5/02 9:36:43 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:PSoroosh@...\">PSoroosh@...</a> writes:<br/>\n<br/>\n&lt;&lt; King of the Hill is based on Beavis and Butthead? &gt;&gt;<br/>\n<br/>\nFrom here down is a series of quotes from various easily found web info.  <br/>\nMide Judge went to Highland High in Albuquerque.   Beavis and Butthead go to <br/>\nHighland High.  <br/>\n<br/>\nI  just told someone the story of Captain Billy getting shot at the TV studio <br/>\nlast month!  And I find this guy remembering it the same way.  Captain Billy <br/>\nwas involved with raising money for the Heart association.   The woman in <br/>\ncharge of that got too friendly.  Her husband came to the studio where <br/>\nCaptain Billy worked and shot him, before the show one day.  I didn&#39;t see the <br/>\nshow that day, but heard about it the next day.  I don&#39;t remember hearing how <br/>\nthey station handled that first day.  I&#39;m guessing they just ran half an hour <br/>\nof solid cartoons.  [Anyone else here remember Captain Billy&#39;s show on <br/>\nKGGM/13?  Sponsored by Toys by Roy, in Winrock Mall.]<br/>\n<br/>\nSame guy who created and does all the crazy voices for King of the Hill wrote <br/>\nand did voices for Beavis and Butt-Head.  I haven&#39;t watched tons of that, but <br/>\nI&#39;ve seen the movie and a few episodes, and we own a Halloween episode with <br/>\nthe immortal line &quot;You cannot run from your own bunghole.&quot;<br/>\n<br/>\n(and finally now the quotes start)<br/>\n<br/>\n<br/>\n<br/>\n&quot;Creator Mike Judge has said he decided to wind down the show to concentrate <br/>\non King of the Hill, his Fox TV animated series about Hank Hill and family in <br/>\nthe fictional suburb of Arlen, Texas. &quot;<br/>\n<br/>\n&lt;&lt;He’s the creator of, and voice behind, MTV’s phenomena Beavis and <br/>\nButthead. His current creatiHe’s the creator of, and voice behind, MTV’s <br/>\nphenomena Beavis and Butthead. His current creation is the Fox series King of <br/>\nthe Hill, where he provides the voice for main character, Hank. He’s also the <br/>\nwriter, director and producer of the cult movie Office Space. A self-taught <br/>\nanimator with a physics degree, Kraft talks about animation and comedy. King <br/>\nof the Hill is an Emmy nominated series nearing its 100th episode next week.&gt;&gt;<br/>\n<br/>\n&lt;&lt;When I was in high school, I used to draw these pictures of somebody <br/>\nscreaming and running towards the camera. I got picked on a lot when I was at <br/>\nschool. They ussed to mek ssport of me,&quot; Judge cackles in perfect Billy-Bob <br/>\nThornton, Southern in-breed. He&#39;s superb at voices; he does almost all the <br/>\nmale characters in the show. For a while, you find yourself amazed at his <br/>\nfacility for imitating them, until you remember that he invented them.<br/>\n<br/>\nI was kind of a skinny little kid. I used to draw pictures of what ended up <br/>\nbeing Butt-head swinging the bat at Beavis&#39;s head.<br/>\n<br/>\n  Mike Judge now works out of a neat mini-studio in Austin Texas, from which <br/>\nhe supervises the New York production team and records the show&#39;s dialogue. <br/>\nHe is 34, balding, amiable and slyly amusing company. He has spent most of <br/>\nhis life in the kind of Southern suburbs portrayed with such flat accuracy in <br/>\nBeavis and Butt-head&#39;s home town of Highland.<br/>\n<br/>\nI grew up in Albuquerque, New Mexico and lived in Dallas. I always think of <br/>\nHighland as West Texas or East New Mexico. I&#39;ve always had that fascination <br/>\nwith suburbia. It&#39;s not like I just like to make fun of it from my ivory <br/>\ntower. I actually like suburban areas. Even when I was a kid - jeez, from the <br/>\nfirst time I can remember writing something for school. It was about this guy <br/>\nwho did these really horrible commercials on local TV, this fat guy with this <br/>\nslew of fences behind him - &#39;I&#39;m George Martinez for thee Albuquerque Fence <br/>\nQompanee. For strong doorable fenceeng please call four-five-seex <br/>\nnine-seex-three-seex.&#39; I wrote about what George&#39;s life was like, and I was <br/>\nreally proud of it. The teacher never gave it back. I don&#39;t think he read <br/>\nthose things or anything, just threw them away.<br/>\n<br/>\n<br/>\nWith this kind of encouragement, it&#39;s no wonder young Mike went on to become <br/>\nan electrical engineer.<br/>\n<br/>\n<br/>\n----------<br/>\n<br/>\nBEAVIS AND BUTTHEAD creator Mike Judge remembers watching Looney Toons as a <br/>\nkid. <br/>\n<br/>\n&quot;There was a show in Albuquerque called Captain Billy,&quot; Judge recalls. &quot;He <br/>\nwas a local guy and he&#39;d show cartoons and you&#39;d go there for your birthday <br/>\nand he got shot because he was fooling around with someone else&#39;s wife. I <br/>\nremember my mom trying to explain it to me. I was asking her, &#39;Why did he get <br/>\nshot?&#39; And she goes, &#39;Maybe he was just hugging her to say, &quot;good job,&quot; and <br/>\nsomeone walked in and saw it and shot him.&#39; &quot; <br/>\n<br/>\n------------</div>","specialLinks":[]}],"prevTopicId":39906,"nextTopicId":39922}}