{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"HEM-Online-Newsletter  by way of Home Ed","from":"HEM-Online-Newsletter &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  February 2003","postDate":"1044518462","msgId":58042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkyYWJhNjdjNmI1MzkxMEBbMTIuMjEuMjExLjE3OF0+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":58041,"nextInTime":58043,"topicId":58042,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS February 2003 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS! For","messageBody":"<div id=\"ygrps-yiv-1803764169\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nFebruary 2003<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS! For more information on Home Education <br/>\nMagazine, see the end of this newsletter or visit our web site at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home-ed-magazine.com\">http://home-ed-magazine.com</a> Send your comments and questions to <br/>\neditor Carol Narigon at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a>.<br/>\n<br/>\nIn the February issue:<br/>\n<br/>\n~ The View from 20 Years Out ~<br/>\n~ Black History Month ~<br/>\n~ Questions and Answers ~<br/>\n~ unschooling.com ~<br/>\n~ Lincoln Fellowship Contest ~<br/>\n~ Homeschool Volunteers ~<br/>\n~ Make Stuff ~<br/>\n~ Blue Web&#39;n ~<br/>\n~ Bridge Design Contest ~<br/>\n~ The Final Word ~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\n  I was watching old Looney Tunes cartoons with Casey last week. A <br/>\nlittle baby had crawled away without the babysitter noticing, so it <br/>\nwas up to Tom and Jerry to keep him out of trouble. (Made me thankful <br/>\nI didn&#39;t leave my babies with babysitters, but that&#39;s beside the <br/>\npoint.) Anyway, the baby crawls onto a flagpole extended out <br/>\nperpendicular from the tall apartment building. It looks like he&#39;ll <br/>\nfall for sure, but when he reaches the end, he crawls right around it <br/>\nand is now crawling back toward the building on the underside of the <br/>\nflagpole. I was just about to comment &quot;Hey that&#39;s not possible!&quot; when <br/>\nCasey says with a smile, &quot;I just love cartoon physics.&quot;<br/>\n<br/>\nWell, okay then. The learning is everywhere. ~~ Mary Gold ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nTHE VIEW FROM 20 YEARS OUT<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/201.html\">http://www.home-ed-magazine.com/HEM/201.html</a><br/>\n<br/>\nWhat then should be the end result of homeschooling? What great goal, <br/>\nwhat worthy purpose do we seek in educating our own? What do we know <br/>\nof our journey&#39;s eventual destination, what do we hope for and dream <br/>\nof for these children nearing adulthood?<br/>\n<br/>\nTwenty-plus years of homeschooling have only left me right back where <br/>\nI started: With more questions than answers. These are different <br/>\nquestions, to be sure; they address larger perspectives. Instead of <br/>\n&quot;How much should I teach my kids about science?&quot; or &quot;Will they really <br/>\nlearn to read on their own?&quot; the questions are now &quot;Do they have a <br/>\ngood grasp of how the world really works?&quot; or &quot;Will they find work <br/>\nthey like doing, and opportunities to spend their time among people <br/>\nthey enjoy being with?&quot;<br/>\n<br/>\nI have been fortunate to find work I enjoy - communicating with words <br/>\nand ideas - and to work with people I like - primarily other <br/>\nhomeschooling parents. It feels good to know the work we do with this <br/>\nmagazine makes a difference in the world.<br/>\n<br/>\nBut what of our children? Have we done as much as possible to help <br/>\nthem prepare to take their places in the world, in this rapidly <br/>\nchanging, ever-more confusing and perplexing world? And even now, as <br/>\nmost of them are grown and already working in the larger world, is <br/>\nthere more we - the older and presumably wiser ones - could be doing <br/>\nto help change things, change society, for the better? ~~ Helen <br/>\nHegener ~~<br/>\n<br/>\nYou can read the rest of this article, as well as a couple of other <br/>\narticles and columns from the current HEM at the address above, but <br/>\nyou&#39;ll have to get the magazine--the one you hold in your hands--to <br/>\nread them all! See special subscription information in this <br/>\nnewsletter, or visit your local bookseller to get your copy today.<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBLACK HISTORY MONTH<br/>\n<br/>\nFebruary is Black History Month. Why not take this opportunity to <br/>\nlearn more about African American history by trying some of the <br/>\nfollowing activities:<br/>\n<br/>\n* Go on an interactive treasure hunt at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kn.pacbell.com/wired/BHM/bh_hunt_quiz.html\">http://www.kn.pacbell.com/wired/BHM/bh_hunt_quiz.html</a><br/>\n<br/>\n* Read poetry by Langston Hughes on his birthday, February 1 at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.poets.org/poets/poets.cfm?prmID=84\">http://www.poets.org/poets/poets.cfm?prmID=84</a> .<br/>\n<br/>\n* To celebrate Frederick Douglass&#39;s birthday on February 14, read his <br/>\nfascinating autobiography at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sunsite.berkeley.edu/Literature/Douglass/Autobiography\">http://sunsite.berkeley.edu/Literature/Douglass/Autobiography</a> .<br/>\n<br/>\n* Try your hand at a history crossword at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.infoplease.com/xwords/bhm.html\">http://www.infoplease.com/xwords/bhm.html</a> .<br/>\n<br/>\n* Travel the Underground Railroad with National Geographic at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nationalgeographic.com/features/99/railroad\">http://www.nationalgeographic.com/features/99/railroad</a> .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nQUESTIONS AND ANSWERS<br/>\n<br/>\n&quot;I am furious. My 8 year old is the only homeschooled child, and the <br/>\nyoungest, in his den of fourth grade Boy Scouts. The den mother does <br/>\neverything in her power to make him an outsider. She&#39;s commented on <br/>\nhis limited reading skills in front of him, has scouting papers <br/>\ndistributed in school (meaning we aren&#39;t informed about some events) <br/>\nand pointedly ignores me. That my son is years ahead of the other <br/>\nboys in math, mechanical skills and simple politeness hasn&#39;t come to <br/>\nher attention. Last week when I picked him up I noticed most of the <br/>\nscouts were inattentive and rough but she only corrected one <br/>\nchild--mine--for not picking up a paper scrap. My son likes this den <br/>\nand I don&#39;t want to burn any bridges by saying the wrong thing to <br/>\nthis woman. Now what?&quot;  ~~ Derrick&#39;s mom ~~<br/>\n<br/>\n&quot;My two children aren&#39;t interested in sports or video games like <br/>\ntheir friends. My husband thinks I&#39;ve &#39;made&#39; our kids too different. <br/>\nI&#39;ll admit that we&#39;ve had fun learning about ancient history, <br/>\nphilosophy and drama---in fact my son contributes to a web site about <br/>\nphilosophic thought. But he&#39;s right, they don&#39;t have much in common <br/>\nwith their peers. I don&#39;t think they would have been like their <br/>\nclassmates if they were in school either. These are my children&#39;s <br/>\ninterests. To what degree do you think we &#39;make&#39; our children <br/>\ndifferent?&quot;  ~~ Kim Silas ~~<br/>\n<br/>\nTo answer a question, or propose your own question, please write to <br/>\nLaura Weldon via <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ReaderResponse@...\">ReaderResponse@...</a> or Questions & <br/>\nAnswers, c/o Home Education Magazine, PO Box 1083, Tonasket, WA <br/>\n98855. Your responses must meet our deadline of the 1st. Please <br/>\nrecognize that your submission may be edited for length or clarity. <br/>\nIndicate how you prefer your question or answer signed.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n<br/>\n&quot;It&#39;s very difficult to talk to people without making them think. <br/>\n&#39;Thought-provoking&#39; is generally considered, even by most unschoolers <br/>\nI know, to be a good thing. I see nothing wrong with intentionally <br/>\narousing a person&#39;s curiosity about any subject, including math. It&#39;s <br/>\nnot the same as making them sit down and study something that they <br/>\nare not interested in and have no need for...<br/>\n<br/>\nOne of the most common objections to unschooling that I hear is that <br/>\nchildren may not find and develop their true talents if they aren&#39;t <br/>\ncompelled to study a wide variety of unrelated subjects. We counter <br/>\nthis objection with the concept of &#39;strewing,&#39; which is certainly <br/>\nintended to make our children think. Sure, we&#39;re giving them freedom <br/>\nto think as much or as little as they please about any given topic; <br/>\nbut we&#39;re still trying to expose them to as much food for thought as <br/>\nwe can serve up.<br/>\n<br/>\nHolly was provoked into doing algebra in her head. Now she wonders <br/>\nwhy. That&#39;s good. It may lead her to wonder if and how other, more <br/>\ncomplicated real life problems can be rearranged into simpler <br/>\narithmetic expressions, which may lead to an interest in scientific <br/>\nmethod, statistics, engineering, economics, or numerous other <br/>\nmath-intensive fields. She just needs Dad to take a breath and think <br/>\nabout what it is she&#39;s really curious about and try to develop that <br/>\ninterest instead of doing a memory dump on her.&quot; ~~ anonymous poster <br/>\non the unschooling.com message boards ~~<br/>\n<br/>\nUnschooling.com offers a free monthly newsletter, message boards, an <br/>\nemail list and more just for unschoolers. To subscribe to the email <br/>\nlist send a blank email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-subscribe@yahoogroups.com\">Unschooling-dotcom-subscribe@yahoogroups.com</a><br/>\nOr visit the email list website at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/Unschooling-dotcom\">http://groups.yahoo.com/group/Unschooling-dotcom</a> .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM&#39;S CURRENT ISSUE<br/>\n<br/>\nThe Jan/Feb 2003 issue of Home Education Magazine features articles <br/>\non surviving tough times, non-school recess, homeschool empowerment, <br/>\nmath renovation and more.  From the columnists: the Kaseman&#39;s keep <br/>\nyour privacy; Becky Rupp tells folktales; David Albert learns to love <br/>\nmath; Sandra Dodd respects children; Elizabeth McCullough reviews <br/>\n&quot;Fundamentals of Homeschooling&quot;; and Carol Narigon gets a homeschool <br/>\nmom&#39;s dad off her back. Other columnists include Ann Zeise, Peter <br/>\nKowalke, Linda Dobson, and Laura Weldon. HEM also offers a special <br/>\nessay by publisher Helen Hegener, classified ads, letters and <br/>\ndiscussion, pen pals and networking, and more. <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/HEM/201/issuecontent.html)\">http://www.home-ed-magazine.com/HEM/201/issuecontent.html)</a><br/>\n<br/>\nTo mark our 20th year, Home Education Magazine is offering a one year <br/>\nintroductory subscription for $20.00! (reg $32.00)<br/>\n<br/>\nTo take advantage of this price mention HEM Online News when <br/>\ncontacting us. To order write: Home Education Magazine, PO Box 1083, <br/>\nTonasket WA 98855; call toll-free 1-800-236-3278; email <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:orders@...\">orders@...</a>.  Or use our secure online form at: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/ORD/_hemonline.html.\">http://www.home-ed-magazine.com/ORD/_hemonline.html.</a><br/>\nMC/Visa/Disc cards accepted.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nLINCOLN FELLOWSHIP CONTEST<br/>\nwww.gettysburg.edu/academics/cwi/Lincoln_Fellowship/index.htm<br/>\n<br/>\nThe Lincoln Fellowship of Pennsylvania invites students in 7th and <br/>\n8th grade to participate in its annual essay contest, &quot;What the <br/>\nGettysburg Address Means to Me.&quot; The deadline is March 31, 2003.<br/>\n<br/>\nHomeschoolers have dominated this contest the past two years with 2/3 <br/>\nof all entries. A homeschool student from MA won in 2001.The prize <br/>\nincludes a $100 cash award and a Gettysburg family vacation package <br/>\nfor four featuring 2 nights lodging, 5 meals, tours, and admission to <br/>\nmany local attractions during the annual November 19th Dedication Day <br/>\nceremony marking the anniversary of Lincoln&#39;s Gettysburg Address.<br/>\n<br/>\nThe featured speaker at this national event, which last year drew <br/>\nover 3000 attendees, is always a well-known personality. Past <br/>\nspeakers have included Gen. Colin Powell and Gov. Christy Todd <br/>\nWhitman. Mrs. Lynne V. Cheney, Senior Fellow at the American <br/>\nEnterprise Institute, former chairman of the National Endowment for <br/>\nthe Humanities, and wife of Vice President Dick Cheney, was last <br/>\nyear&#39;s speaker.<br/>\n<br/>\nThe highlight of the experience for the contest winner is the <br/>\nopportunity to read his or her essay at the annual luncheon of the <br/>\nLincoln Fellowship.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHOMESCHOOL VOLUNTEERS<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nhen.org/nhen/pov/editors/default.asp?id=451\">http://www.nhen.org/nhen/pov/editors/default.asp?id=451</a><br/>\n<br/>\nI do a lot of volunteer work for the National Home Education Network. <br/>\nOur motto is &quot;Changing the way the world sees homeschooling.&quot; Earlier <br/>\nthis year, as I was preparing a speech for our state conference, it <br/>\noccurred to me that if the hundreds of thousands of homeschooling <br/>\nfamilies across the country donated just ten hours each year, doing <br/>\nnothing but helping to further the public image of homeschooling, <br/>\nmillions of hours would be spent. Can you imagine the result of more <br/>\nthan a million hours, spent in communities across the nation, doing <br/>\nnothing more than helping the public understand homeschooling and <br/>\nhomeschoolers just a little better? What an incredibly powerful <br/>\neffect that would have!<br/>\n<br/>\nSo, I am advocating the just-ten-hours approach. Love to write? Write <br/>\nletters to the editor of your local paper or to national magazines. <br/>\nAre you a people person? Invite a local reporter to a homeschool <br/>\nouting and be your charming, outgoing self. You&#39;re the organization <br/>\nqueen or king? Volunteer to organize a project or outing for a <br/>\nhomeschooling organization, then find a way to let the community know <br/>\nabout it. Work together with others to spread the message that <br/>\nhomeschooling is a great choice for many families.<br/>\n<br/>\nKeep track of your hours and let us know, at NHEN, what you&#39;ve done. <br/>\nWe&#39;d love for your efforts to inspire others. And if you&#39;d like to do <br/>\nthat volunteer work through NHEN, or just want some ideas, contact us <br/>\nat <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:volunteers@...\">volunteers@...</a> and we&#39;ll be happy to help you get started. ~~ <br/>\nChristine Webb ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nMAKE STUFF<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.make-stuff.com\">http://www.make-stuff.com</a><br/>\n<br/>\nIf you&#39;re stuck inside a lot because of cold weather and <br/>\nprecipitation, why not try your hand at a new craft? Using the <br/>\ndirections at the Make Stuff website, you can make crystal hearts for <br/>\nValentine&#39;s Day, mix up some slime, cross stitch a sweet sampler and <br/>\nfind 60 uses each for vinegar, salt and baking soda. You might even <br/>\nwant to let your kids play too!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBLUE WEB&#39;N<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.kn.pacbell.com/wired/bluewebn/\">http://www.kn.pacbell.com/wired/bluewebn/</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;From the website: &quot;Blue Web&#39;n is an online library of 1700+ <br/>\n&gt;outstanding Internet sites categorized by subject, grade level, and <br/>\n&gt;format (lessons, activities, projects, resources, references, & <br/>\n&gt;tools). You can search by grade level, broad subject area, or <br/>\n&gt;specific sub-categories. Each week 5 new sites are added.&quot;  All I <br/>\n&gt;can add is that this site offers a huge list of educational <br/>\n&gt;websites. Don&#39;t try to see them all at once!<br/>\n<br/>\n </span></blockquote>&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBRIDGE DESIGN CONTEST<br/>\nbridgecontest.usma.edu<br/>\n<br/>\nThe second annual West Point Bridge Design Contest began in January. <br/>\nLast year several homeschool kids competed successfully and it would <br/>\nbe great if we were represented by more this year. Winners receive <br/>\nscholarships or notebook computers. If nothing else, the free <br/>\nsoftware is good for hours of fun. Both my 10- and 17-year-old <br/>\ncreated bridges with it, although the contest is only open to kids <br/>\nages 13 through grade 12.<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a>.<br/>\n<br/>\n________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nCastles, our newest internet-linked history title, will entice and <br/>\ndelight everyone in your family!  Browse our new titles list and <br/>\nenter a drawing for $50 in free books at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.UsborneAmerica.com\">http://www.UsborneAmerica.com</a>  Email <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sharonve@...\">sharonve@...</a> or call <br/>\n888-474-8499 for personal shopping service.  Sharon Vander Ende, <br/>\nIndependent supervisor, Usborne America.<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\ngnarlymath.com<br/>\n<br/>\nGALILEO PROVED THAT LIGHT THINGS FALL AS FAST AS HEAVY ONES in the <br/>\nsame years Shakespeare was writing plays! Read about his experiments, <br/>\nand look at selections from the first English Dictionary in the <br/>\ncurrent issue of our FREE math newsletter the Gnarly Gnews --- this <br/>\nissue dated January, 1599. Subscribe now at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gnarlymath.com\">http://www.gnarlymath.com</a> <br/>\n, where you&#39;ll discover a moneyback-guaranteed CD-ROM that will show <br/>\nyour kids how easy and fun math can be, and will help you refresh <br/>\nyour own math skills.<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nLooking for something to do? Why not:  ** Stage a Costume Ball from <br/>\nthe Middle Ages ** Fly Through Human Anatomy ** Take a Virtual Walk <br/>\nthrough the Rainforest ** Program a Robot ** Build a Computer Game ** <br/>\nThe Resourceful Homeschooler carries great books, science materials <br/>\nand kits, learning games, and the most interesting software. Visit <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.resourcefulhomeschooler.com\">http://www.resourcefulhomeschooler.com</a> Materials to involve, inspire <br/>\nand support independent learners of all ages!<br/>\n_________<br/>\n<br/>\nTEACH YOUR CHILD TO READ!  TRY ONLINE LESSONS NOW FOR FREE!<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading <br/>\nprogram that will give your child a real advantage by systematically <br/>\nteaching essential skills and strategies ensuring reading success and <br/>\nconfidence. Outstanding fast results!  After just five 20-minute <br/>\nanimated, interactive episodes, children read their first Headsprout <br/>\nbook. Act quickly! For a limited time you can try out Headsprout <br/>\nReading FOR FREE!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.headsprout.com\">http://www.headsprout.com</a> Please enter the promotional code: HENB3<br/>\n_________<br/>\n<br/>\n<br/>\nHomeSchool FreeStuff<br/>\nHomeschoolFREEStuff.com<br/>\n<br/>\nEvery week this FREE email newsletter brings you FREE curriculum, <br/>\nresources, lesson plans, unit studies, interactive online studies and <br/>\nmore! It&#39;s even FREE to subscribe! Because Everyone Deserves A Treat <br/>\nOnce In A While! <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeschoolfreestuff.com/html/home.asp?adid=26\">http://www.homeschoolfreestuff.com/html/home.asp?adid=26</a><br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\nIf you send up a weather vane or put your thumb up in the air every <br/>\ntime you want to do something different, to find out what people are <br/>\ngoing to think about it, you&#39;re going to limit yourself. That&#39;s a <br/>\nvery strange way to live. ~ Jessye Norman ~<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To <br/>\nsubscribe, visit our web site at <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com/wlcm_hemnewsltr.html\">http://www.home-ed-magazine.com/wlcm_hemnewsltr.html</a> or send an email <br/>\nto <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words subscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. subscribe hem-online-newsletter <br/>\nyouremailaddress). To unsubscribe, send an email to <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:majordomo@...\">majordomo@...</a> with the words unsubscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter <br/>\nyouremailaddress). To change the address at which you receive the <br/>\nnewsletter, unsubscribe your old address and then subscribe to your <br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Newsletter@...\">HEM-Newsletter@...</a><br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":58036,"nextTopicId":57865}}