{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":122754549,"authorName":"Mike Ebbers","from":"&quot;Mike Ebbers&quot; &lt;mikeebb@...&gt;","profile":"mikeebb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: the danger of dualism","postDate":"1035314881","msgId":47331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFwNDhzMStwYzlyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNWEwMWMyNzllMSQ4NGJhZWFjMCQwZTg5NTI0M0BBbm9saWNrRmFtaWx5Pg=="},"prevInTopic":47280,"nextInTopic":0,"prevInTime":47330,"nextInTime":47332,"topicId":47271,"numMessagesInTopic":0,"msgSnippet":"... My daughter Maribeth (age 9) has made friends with two girls her age from a nearby family.  They play both at our house and their house. One time at our","messageBody":"<div id=\"ygrps-yiv-1391826470\">--- In Unschooling-dotcom@y..., Rachel Ann &lt;hindar@o...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Esther started penpalling, to make more friends because of a dearth <br/>\n&gt;of homeschooling children in this area ... We got a letter back, <br/>\n&gt;along with a cross (crusifix, not sure which.)  and an angel.  <br/>\n&gt;Esther wrote back, thanking her for the gift, explaining that we are <br/>\n&gt;Jewish and don&#39;t use crosses etc, telling her we passed it on, and <br/>\n&gt;again, thanking her for the thought. She also made a little <br/>\n&gt;bracelet, and sent her stickers and maybe one or two other paper <br/>\n&gt;items.  It has been about a month, and I think we have given up on <br/>\n&gt;hearing from her.<br/>\n&gt; What can we conclude? Oh, possibilities abound, but the most likely <br/>\n&gt;scenario is we are Jewish, and therefore, in this child&#39;s eyes, or <br/>\n&gt;at least the eyes of mom or dad, pariahs.  <br/>\n<br/>\n </span></blockquote>My daughter Maribeth (age 9) has made friends with two girls her age <br/>\nfrom a nearby family.  They play both at our house and their house.  <br/>\nOne time at our house the TV was on and the announcer mentioned <br/>\nJesus.  One girl shut off the TV quickly (they are Jewish) and made <br/>\nsome comment like &quot;we don&#39;t believe that.&quot;  Play continued and has <br/>\ncontinued for months since then.  <br/>\n<br/>\nThey have a club with a fourth girl (from a non-religious family) and <br/>\nthey meet every Sunday afternoon.  That is our Sabbath and family <br/>\ntime but we try to be home so Maribeth can join the club meeting.  I <br/>\nam sorry that your girl&#39;s penpal experience turned out differently.&#39;<br/>\n<br/>\nMike</div>","specialLinks":[]},{"userId":122926724,"authorName":"Rachel Ann","from":"Rachel Ann &lt;hindar@...&gt;","profile":"salixj","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] the danger of dualism","postDate":"1035301299","msgId":47280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWEwMWMyNzllMSQ4NGJhZWFjMCQwZTg5NTI0M0BBbm9saWNrRmFtaWx5Pg==","referencesHeader":"PDE3Yi4xMDNjNmIxMy4yYWU2Yzc4ZUBhb2wuY29tPg=="},"prevInTopic":47271,"nextInTopic":47331,"prevInTime":47279,"nextInTime":47281,"topicId":47271,"numMessagesInTopic":0,"msgSnippet":"Perhaps,  if you will allow me, I can give an example of how Us vs Them can lead to sad consequences, from a personal experience. I admit the harm isn t","messageBody":"<div id=\"ygrps-yiv-1899016021\">Perhaps,  if you will allow me, I can give an example of how Us vs Them can lead to sad consequences, from a personal experience. I admit the harm isn&#39;t great...this isn&#39;t loss of limb in the case I am about to go into.  But it caused pain.<br/>\n<br/>\nEsther started penpalling, to make more friends because of a dearth of homeschooling children in this area (there is one whom she adores, but they can&#39;t always be together.)  We found on a list a posting from a child who stated she had no friends.  My daughter has the biggest heart...as soon as I mentioned that she decided to write the child.<br/>\n<br/>\nWe got a letter back, along with a cross (crusifix, not sure which.)  and an angel.  Esther wrote back, thanking her for the gift, explaining that we are Jewish and don&#39;t use crosses etc, telling her we passed it on, and again, thanking her for the thought.<br/>\n<br/>\nShe also made a little bracelet, and sent her stickers and maybe one or two other paper items.  <br/>\n<br/>\nIt has been about a month, and I think we have given up on hearing from her.<br/>\n<br/>\nWhat can we conclude? Oh, possibilities abound, but the most likely scenario is we are Jewish, and therefore, in this child&#39;s eyes, or at least the eyes of mom or dad, pariahs.  <br/>\n<br/>\nLuckily she does have other penpals (letters to penpals from this list went out last night!) And these friends will hopefully be true.  She is also going to meet one of her penpals Wednesday (at a pizza parlor... I&#39;m not totally naive!) So she is a bit sadder but wiser....<br/>\n<br/>\nWish the other family could be wiser and happier....Esther is a true friend.<br/>\n<br/>\nbe well,<br/>\nRachel Ann<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"the danger of dualism","postDate":"1035300238","msgId":47271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3Yi4xMDNjNmIxMy4yYWU2Yzc4ZUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":47280,"prevInTime":47270,"nextInTime":47272,"topicId":47271,"numMessagesInTopic":0,"msgSnippet":" I also can t figure out (yet) how proponents of unschooling can ... When people live their lives in an us vs. them mode, they feel confident that their","messageBody":"<div id=\"ygrps-yiv-2110573171\">&lt;&lt; &gt; I also can&#39;t figure out (yet) how proponents of unschooling can<br/>\n<blockquote><span title=\"ireply\"> &gt; expect that their children will eventually figure out the best ways<br/>\n&gt; to live their lives, but you see adults all around you who obviously<br/>\n&gt; haven&#39;t adopted the best ways.<br/>\n &gt;&gt;<br/>\n<br/>\n </span></blockquote>When people live their lives in an &quot;us vs. them&quot; mode, they feel confident <br/>\nthat their team is RIGHT and all other action is WRONG.<br/>\n<br/>\nWhen there are no shades of gray and when there are not explanations given <br/>\nother than &quot;I told you so&quot; or &quot;that&#39;s the way we do it&quot; or &quot;God wants it that <br/>\nway,&quot; then here&#39;s what happens:<br/>\n<br/>\nThey learn to hate &quot;the other.&quot;<br/>\nThey take pride in not BEING &quot;the other.&quot;<br/>\n<br/>\nThen if and when they begin to question their own side (say, for example, <br/>\nthey were in a very strict Church of Christ situation where the elders told <br/>\nthem what to do in every way, what to wear, what to bring for the potluck <br/>\ndinner), they feel their only choice is to stay and be hypocritical and <br/>\ndishonest, or cut the cords and be &quot;other&quot; and &quot;bad&quot; and &quot;hateful.&quot;<br/>\n<br/>\nSo young men who were raised to think that dancing, drinking, carrousing were <br/>\nthe work of the devil and that their only options were to go to a Christian <br/>\ncollege, marry a girl from the same denomination, be a virgin at marriage and <br/>\ntreat his children JUST as he was treated--that is success and there is no <br/>\nother success--if he departs from that, he&#39;s likely to go CRAZY and drink <br/>\nLOTS and use bad language, look at nasty magazines, go out with loose women, <br/>\nget stupid tattoos, whatever all he considers would bug his parents most.<br/>\n<br/>\nIn for a penny, in for a pound.  If he is not the one (good Christian on the <br/>\nnarrow road) he must be the other (wild party boy who doesn&#39;t care).<br/>\n<br/>\nThose raised with the God and Satan model, if you&#39;re not for us you&#39;re <br/>\nagainst us, seem to assume that without the same reasons for &quot;being good,&quot; <br/>\nthat everyone else must be totally debauched Satan worshippers.  If you don&#39;t <br/>\nbelieve in Hell, why wouldn&#39;t you shoot heroine and abuse strangers in <br/>\nalleys?  If you don&#39;t believe in God, how and why would your children learn <br/>\nANY morals?<br/>\n<br/>\nBecause their model allows for nothing between being an uptight teetotaller <br/>\nand being prison material, they don&#39;t see anything between the two.<br/>\n<br/>\nSandra, down another tangent.</div>","specialLinks":[]}],"prevTopicId":47321,"nextTopicId":47313}}