{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":135843572,"authorName":"24hrmom","from":"&quot;24hrmom&quot; &lt;24hrmom@...&gt;","profile":"learn2day2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: on the verge...","postDate":"1067090780","msgId":83214,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTkwMWMzOWIwMSQyYWFlODlhMCQwMzAwYThjMEBUaW5rZXJiZWxsPg==","referencesHeader":"PGJuY2xjdCt2dWozQGVHcm91cHMuY29tPg=="},"prevInTopic":83211,"nextInTopic":0,"prevInTime":83213,"nextInTime":83215,"topicId":83211,"numMessagesInTopic":0,"msgSnippet":"Not to put words in Sandra s mouth but I don t believe she was asserting assumptions, I think she was pointing out what may be going on in parents minds while","messageBody":"<div id=\"ygrps-yiv-2090227833\">Not to put words in Sandra&#39;s mouth but I don&#39;t believe she was asserting assumptions, I think she was pointing out what may be going on in parents&#39; minds while they are working to give their kids freedom in making their own decisions about bedtimes etc.  And I don&#39;t think she was advocating letting them go it alone; of course kids do well with parental input.  I think the point is that when the parents have preconceived ideas about what they see as a successful outcome to a situation and they press that point, that isn&#39;t real freedom.<br/>\n<br/>\nUsing your example:<br/>\n<br/>\n&lt;&lt;&quot;Yes, it&#39;s hard for you to stop playing with legos now, but if you want to wake up in time to see the balloons launch tomorrow morning, you need to get to bed&quot;&gt;&gt;<br/>\n<br/>\nWhat about &quot;It&#39;s getting late, and remember we were planning to go see the balloons launch tomorrow morning.  You may want to go to bed soon so you&#39;re not tired or grumpy when I wake you in the morning in time to go.&quot;<br/>\n<br/>\nIt lets you add your parental experience (consequences to staying up later) to the child&#39;s thinking while not directing the outcome.  And then let a discussion follow.  You may end up with a plan that looks like the child continuing to play legos for a while longer, waking up excited when you call him in the morning to go to the balloon launch, and having a nap in the afternoon if he gets tired.<br/>\n<br/>\nThe point is with the above example the only successful outcome from the parents point-of-view is that the child &quot;needs to get to bed&quot;, when in fact there are often a number of different ways to get from point A to B.  If the parent only sees one path from A to B and continues to talk with the child until they convince them to take that path, that is not freedom.  If the parent talks with the child without leading the discussion (at least when the parent feels they can add some experience / info to the discussion that they think the child may not consider) and they work out a solution together (including even dumping point B altogether - and this is often more possible than you first think), it gives the child the freedom to make decisions.  And the freedom to learn to make better decisions as they gain experience.<br/>\n<br/>\nI find that when I am truly open to all ideas, it is much easier to give my kids the freedom to make these kinds of decisions because I am often amazed at the workable solutions they come up with.  Sometimes it takes a child to help us think &quot;out-of-the-box&quot;!<br/>\n<br/>\nPam L.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":5029967,"authorName":"plumaria_1","from":"&quot;plumaria_1&quot; &lt;plumaria_1@...&gt;","profile":"plumaria_1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: on the verge...","postDate":"1067047133","msgId":83211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJuY2xjdCt2dWozQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":83214,"prevInTime":83210,"nextInTime":83212,"topicId":83211,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2116860580\">&lt;&lt; If your kids are not going to use their<br/>\n<blockquote><span title=\"ireply\"> &gt; freedom to choose their own bedtimes wisely, they really can&#39;t have that<br/>\n&gt; freedom.<br/>\n&gt;&gt;<br/>\n<br/>\n </span></blockquote>I think when people say &quot;wisely&quot; they mean sometimes &quot;choose what I<br/>\nwish they<br/>\nwould choose.&quot;<br/>\n<br/>\n&quot;Wisely&quot; means &quot;matches my preconceived notions&quot; too often.&gt;&gt;<br/>\n<br/>\n<br/>\nI think that is too broad of an assumption to make.<br/>\n<br/>\nKids do well with parental input on making wise choices.  Bedtime can<br/>\nbe one of these times.  This can be more true <br/>\nfor the younger ones, as many I know (including my own) live in the<br/>\npresent moment mostly,(an honorable, admirable <br/>\nand necssary quality)  but may need to be reminded of plans they or<br/>\nthe family have for the next day.  THose plans <br/>\ncould affect when the child goes to bed the night before.<br/>\n<br/>\n&quot;Yes, it&#39;s hard for you to stop playing with leggos now, but if you<br/>\nwant to wake up in time to see the balloons launch <br/>\ntomorrow morning, you need to get to bed&quot;<br/>\n<br/>\nI suppose this example could be looked at trying to get the child to<br/>\nmatch a parent&#39;s preconceived notion, but it could <br/>\nalso be looked at as the parent giving a broader perspective for the<br/>\nchild to think about.<br/>\n<br/>\n&lt;Decisions about bedtimes and &quot;enough sleep&quot; when made by parents<br/>\noften look<br/>\nlike &quot;go to bed at 9:00 and wake up at 7:00.&quot; If that&#39;s the only wise<br/>\ndecision a child can make, their freedom was not real.&gt;<br/>\n<br/>\nAgain, I think this is too broad.  Helping a child to choose a time to<br/>\ngo to sleep can help them have more freedom to do <br/>\nall they want/plan to do with their next day.</div>","specialLinks":[]}],"prevTopicId":83196,"nextTopicId":83208}}