{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"eH-pssaFYRLaAHdDWbZCyyFDJhbIgUgvfxuV6JwEdxt99RjMY2K7FS9v0eNsxX4Ma0CBKDrYqQZbb5ED_GzNgHRycA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: IDIOTS IN EVERYDAY LIFE:","postDate":"972687734","msgId":13810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMTEwMWMwNDA5MCQzN2I0Mzg4MCQxZDVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13809,"nextInTime":13811,"topicId":13810,"numMessagesInTopic":0,"msgSnippet":"SPEW ALERT!!!!!!!!!  Do not sit at the computer and read these while drinking anything it will end up on the screen! Lynda ... Subject: IDIOTS IN EVERYDAY","messageBody":"<div id=\"ygrps-yiv-1425533410\">SPEW ALERT!!!!!!!!!  Do not sit at the computer and read these while<br/>\ndrinking anything it will end up on the screen!<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- &gt;<br/>\n<br/>\nSubject: IDIOTS IN EVERYDAY LIFE:<br/>\n<br/>\n IDIOTS IN SERVICE:<br/>\n<br/>\nThis week, all our office phones went dead and I had to contact the<br/>\ntelephone repair people.  They promised to be out between 8:00 a.m. and 7:00<br/>\np.m.  When I asked if they could give me a smaller time window the pleasant<br/>\ngentleman asked, &quot;Would you like us to call you before we come?&quot;  I replied<br/>\nthat I didn&#39;t see how he would be able to do that, since our phones weren&#39;t<br/>\nworking. He also requested that we report future outages by email (Does YOUR<br/>\nemail work without a telephone line?).<br/>\n<br/>\nIDIOTS AT WORK:<br/>\n<br/>\nI was signing the receipt for my credit card purchase when the clerk noticed<br/>\nI had never signed my name on the back of the credit card. She informed me<br/>\nthat she could not complete the transaction unless the card was signed.<br/>\n<br/>\nWhen I asked why, she explained that it was necessary to compare the<br/>\nsignature I had just signed on the receipt.  So I signed the credit card in<br/>\nfront of her.  She carefully compared the signature to the one I had just<br/>\nsigned on the receipt.  As luck would have it, they matched.<br/>\n<br/>\nIDIOTS IN THE NEIGHBORHOOD:<br/>\n<br/>\nI live in a semi-rural area.  We recently had a new neighbor call the local<br/>\ntownship administrative office to request the removal of the Deer Crossing<br/>\nsign on our road.  The reason:  too many deer were being hit by cars and she<br/>\ndidn&#39;t want them to cross there anymore.<br/>\n<br/>\nIDIOTS IN FOOD SERVICE:<br/>\n<br/>\nMy daughter went to a local Taco Bell and ordered a taco.  She asked the<br/>\nperson behind the counter for &quot;minimal lettuce.&quot; He said he was sorry, but<br/>\nthey only had iceberg.<br/>\n<br/>\nIDIOT SIGHTING #1:<br/>\n<br/>\nI was at the airport, checking in at the gate when an airport employee<br/>\nasked, &quot;Has anyone put anything in your baggage without your knowledge?&quot;  To<br/>\nwhich I replied, &quot;If it was without my knowledge, how would I know?&quot;  She<br/>\nsmiled knowingly and  nodded, &quot;That&#39;s why we ask.&quot;<br/>\n<br/>\nIDIOT SIGHTING #2:<br/>\n<br/>\nThe stoplight on the corner buzzes when it&#39;s safe to cross the street.  I<br/>\nwas crossing with an intellectectually-challenged coworker of mine when she<br/>\nasked if I knew what the buzzer was for.  I explained that it signals blind<br/>\npeople when the light is red. Appalled, she responded,  &quot;What on earth are<br/>\nblind people doing driving?!&quot;<br/>\n<br/>\nIDIOT SIGHTING #3:<br/>\n<br/>\nAt a good-bye luncheon for an old and dear co-worker who is leaving the<br/>\ncompany due to &quot;downsizing,&quot; our manager commented cheerfully, &quot;This is fun.<br/>\nWe should do this more often.&quot; Not a word was spoken.  We all just looked at<br/>\neach other with that deer-in-the-headlights stare.<br/>\n<br/>\nIDIOT SIGHTING #4:<br/>\n<br/>\nI work with an individual who plugged her power strip back into itself and<br/>\nfor the life of her couldn&#39;t understand why her system would not turn on.<br/>\n<br/>\nIDIOT SIGHTING #5:<br/>\n<br/>\nWhen my husband and I arrived at an automobile dealership to pick up our<br/>\ncar, we were told the keys had been locked in it. We went to the service<br/>\ndepartment and found a mechanic working feverishly to unlock the driver&#39;s<br/>\nside door.  As I watched from the passenger side, I instinctively tried the<br/>\ndoor handle and discovered that it was unlocked.  &quot;Hey,&quot; I announced to the<br/>\ntechnician, &quot;It&#39;s open!&quot;  To which he replied, &quot;I know - I already got that<br/>\nside.&quot;<br/>\n<br/>\nNOW DON&#39;T YOU FEEL BETTER? </span></blockquote></div>","specialLinks":[]}],"prevTopicId":13807,"nextTopicId":13811}}