{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":90564959,"authorName":"starsuncloud@cs.com","from":"starsuncloud@...","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"My journey to unschooling","postDate":"1044072637","msgId":57484,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlOS5iZjQxODMuMmI2Y2EyYmRAY3MuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":57483,"nextInTime":57485,"topicId":57484,"numMessagesInTopic":0,"msgSnippet":"I ve been having discussion both here and at the message board about how my shift in thinking came about, how long it took etc... And I ve taken some heat for","messageBody":"<div id=\"ygrps-yiv-947431781\">I&#39;ve been having discussion both here and at the message board about how my <br/>\nshift in thinking came about, how long it took etc...<br/>\nAnd I&#39;ve taken some heat for it, so I thought I&#39;d share an old post here, <br/>\nhopefully to inspire someone (or maybe make someone laugh).<br/>\nThe cool thing is, I had argued for tv limits prior to the following post, <br/>\nand it&#39;s obvious I was thinking about things and not completely convinced <br/>\nabout tv limits anymore by the time I posted this.....so here it is, and it <br/>\nwas not long after that I let go completely.<br/>\nReading back on it, I realize where my sons obssesive behavior came <br/>\nfrom....ME!!<br/>\nMe and my controlling methods. sigh.....<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n--<br/>\nBy ren on Thursday, August 16, 2001 - 08:16 pm:<br/>\nKim, I totally know what you mean! I have one that will do nothing but veg if <br/>\nallowed complete access. He will even forget to eat...how healthy is that? I <br/>\nmean he could go ALL day with no food, completely excluding any and all <br/>\nactivity to focus on tv or gameboy. Dh and I just can&#39;t watch him do this day <br/>\nafter day...we encourage him to turn it off after a while, or we insist on <br/>\ngoing somewhere of his choosing to get him looking in other directions. There <br/>\nare some very addictive individuals...I really hope that by allowing him a <br/>\nlot of control and gradually giving more and more he will learn a balance for <br/>\nhimself. My other kids aren&#39;t like that at all. It could partly be the almost <br/>\n12 y.o. thing too in his case...I try to remember that. <br/>\n<br/>\nAs to the waiting for &quot;magical&quot; moments and trusting they will absorb <br/>\nlearning....it really does happen! My oldest was totally hyper at <br/>\nthree...couldn&#39;t seem to focus long at all. I even gave up on library story <br/>\ntimes with him, just too stressful for me! He didn&#39;t want to learn how to <br/>\ncount..all his friends seemed to pick up on this stuff before him. But guess <br/>\nwhat? It didn&#39;t matter that he learned it later than them...he knows it now. <br/>\nHe reads avidly. He&#39;s addicted to tv--read above whining--but when we <br/>\n&quot;unplug&quot; him he is full of interesting conversation and intellect. I recently <br/>\nwas taught the value of trusting him again (I know, I know Sandra...I don&#39;t <br/>\ntotally trust him if I limit tv or gameboy!) He had been interested in <br/>\nlearning some magic tricks a few months back so we went to the library <br/>\nand I helped him check out a bunch of books. He learned some cool card tricks <br/>\n(we still can&#39;t figure out how he does some of them) and then his interest <br/>\nfaded. I was kinda sad to see him not pursue something I saw as a positive <br/>\ninterest but knew I should not/could not push it or say anything....it would <br/>\nonly turn him off. So a few months passes and all of the sudden the last few <br/>\ndays he is online looking to buy some magic props and practicing up on his <br/>\nold tricks, now talking about starting a business out of entertaining at kids <br/>\nBirthday parties. So interests come and go. Same for us. And what seems to be <br/>\nno interest one day can turn into obsession not much later. I really do trust <br/>\nthem for the most part...obviously I have a hard time with too much tv, I see <br/>\nit as inactivity. I HAVE however, learned to not view it as a negative <br/>\ninfluence as I did previously. And I give them A LOT of say and control over <br/>\ntheir time now. If I think it&#39;s getting overwhelming I just ask them to come <br/>\nup with a plan for the day....&quot;where can we go that would be fun?&quot; usually <br/>\nworks. This 11 1/2 y.o. lethargy can be discouraging!! I hear some others <br/>\ngoing through it and try to relax..... <br/>\n<br/>\n<br/>\nRen from January 2003 now:<br/>\nI think that first paragraph shows how I was trying to &quot;transition&quot; also....I <br/>\nwas hearing what everyone was saying and trying to let go of control. It came <br/>\nin fits and starts before leveling out and becoming natural.<br/>\nSo any newbies that are discouraged, please don&#39;t think it&#39;s the relaxing and <br/>\ntrusting your kids that is wrong.<br/>\nWhen parents change, it is something the children don&#39;t understand <br/>\ncompletely. There is a transition time for all and it takes thought, <br/>\nencouragement, tweaking and trusting.<br/>\nIt doesn&#39;t happen overnight for those of us that don&#39;t have this <br/>\nunderstanding the moment our children are born.<br/>\nI envy those that do!!<br/>\nI was raised in a very strict Christian sect, so there was a lot to <br/>\novercome....but it DOES work. Trusting my children has changed the entire <br/>\ntone of our home. <br/>\nBeing  a mother has never been better. <br/>\nDon&#39;t give up. <br/>\nKeep posting when things don&#39;t work and let everyone give you input, even if <br/>\nit hurts and causes frustration.<br/>\nBecause that&#39;s what got me where I am today.<br/>\nI had so many times I&#39;d come back on and say JOYCE, SANDRA, ANNE!!! My kid is <br/>\nSTiLL addicted, what do I do?<br/>\nAnd they would calmly, pointedly tell me &quot;DEAL with it&quot; :) in a nicer way <br/>\nactually.<br/>\nThey gave me advice that changed our lives.<br/>\nIt worked. It will always work. But only if we as the adults are willing for <br/>\nimmensely difficult and sometimes painful change.<br/>\nHang in there ..........<br/>\n<br/>\nRen<br/>\n&quot;The sun is shining--the sun is shining.  That is the magic.  The flowers are <br/>\ngrowing--the roots are stirring.  That is the magic.  Being alive is the <br/>\nmagic--being strong is the magic  The magic is in me--the magic is in <br/>\nme....It&#39;s in every one of us.&quot;<br/>\n<br/>\n                                                    ----Frances Hodgson <br/>\nBurnett</div>","specialLinks":[]}],"prevTopicId":57480,"nextTopicId":57237}}