{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Empathy","postDate":"1311785582","msgId":62059,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowcGZwZStyZTEyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMTE3MTE2MjkuOTI4NTcuWWFob29NYWlsTmVvQHdlYjExMDQxNi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":62048,"nextInTopic":0,"prevInTime":62057,"nextInTime":62060,"topicId":62040,"numMessagesInTopic":0,"msgSnippet":"... I think this is something for me to keep in mind.  I do tend to think that because I experience one reality, others do too.  My husband calls this a","messageBody":"<div id=\"ygrps-yiv-1709943757\"><blockquote><span title=\"ireply\">&gt; It might have been very true too, that his friend doesn&#39;t care much about getting physically hurt!  Some kids really aren&#39;t bothered by a bump and fall and wouldn&#39;t think twice about getting up and moving on without drawing attention to it.  It might have come as a great surprise to the friend that this other kid needed to address this hurt.  Perhaps he was left feeling confused as to why your son would holler at him over something that he felt so insignificant that it didn&#39;t even hit his radar.<br/>\n<br/>\n </span></blockquote>I think this is something for me to keep in mind.  I do tend to think that because I experience one reality, others do too.  My husband calls this a classic blunder :)<br/>\n<br/>\nIn this case, our friend is equally sensitive.  It drives his parents crazy, which may or may not have anything to do with his reaction.  I think my son was feeling especially sensitive because of a past incident where this friend accidentally knocked out one of his baby teeth with a wooden sword, and didn&#39;t pause to check in with him to make sure he was okay.  Again, the hurt was relatively minor, (surprising, but not so painful), but my son spoke of how he wished his friend would have showed he cared about what had happened.  I suggested to my son then that perhaps he was frightened or feeling guilty, but it would have been nice if he had have checked in with him.<br/>\n<br/>\nIn any case, I will keep this in mind for future interactions.  I need to open my mind to more possibilities :)</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Empathy","postDate":"1311711629","msgId":62048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTE3MTE2MjkuOTI4NTcuWWFob29NYWlsTmVvQHdlYjExMDQxNi5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGowbWdybStwdnVyQGVHcm91cHMuY29tPg==","referencesHeader":"PGowbWdybStwdnVyQGVHcm91cHMuY29tPg=="},"prevInTopic":62046,"nextInTopic":62059,"prevInTime":62047,"nextInTime":62049,"topicId":62040,"numMessagesInTopic":0,"msgSnippet":"***The other day he was playing with a friend. He tripped and fell, and hurt himself. He paused to address that hurt. His friend kept talking about whatever","messageBody":"<div id=\"ygrps-yiv-133531051\">***The other day he was playing with a friend. He tripped and fell, and hurt himself. He paused to address that hurt. His friend kept talking about whatever they were playing. My son, yelled &quot;Can&#39;t you see I&#39;m hurt?&quot; His friend looked at him like there was something wrong with him besides the hurt.*** <br/>\n<br/>\n<br/>\nIt might have been very true too, that his friend doesn&#39;t care much about getting physically hurt!  Some kids really aren&#39;t bothered by a bump and fall and wouldn&#39;t think twice about getting up and moving on without drawing attention to it.  It might have come as a great surprise to the friend that this other kid needed to address this hurt.  Perhaps he was left feeling confused as to why your son would holler at him over something that he felt so insignificant that it didn&#39;t even hit his radar.<br/>\n<br/>\nIf you have a kid that is highly sensitive to pain and hurts, it&#39;s hard to imagine that there are kids who really don&#39;t care about it and would think nothing of moving on as if nothing had happened.  My oldest is the latter type and my youngest is the sensitive one.  They can and do clash over these things at times.  My oldest is, by the way, one of the most empathetic people I&#39;ve ever known, but little bumps and scrapes would never draw her attention.  Her response to someone reacting to a little bump and scrape would be &quot;really, is that all, geez get over it all ready&quot;, which to her younger sister, makes that little bump and scrape feel more painful.  However, if her little sister really was hurt either physically or emotionally, she&#39;d be right there offering support, but not so much for a scratch or hangnail or a stubbed toe.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Empathy","postDate":"1311697995","msgId":62046,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowbXE4Yit2dHI5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE0RTBCRjhBLUMxNDEtNDIxMC04MjUzLURFRjc4MzA1Q0E2N0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62044,"nextInTopic":62048,"prevInTime":62045,"nextInTime":62047,"topicId":62040,"numMessagesInTopic":0,"msgSnippet":"... This is so true, and I didn t see it before.  Thanks to both of you for pointing that out.  In fact, upon reflecting on this this morning, I realized I do","messageBody":"<div id=\"ygrps-yiv-1953250829\"><blockquote><span title=\"ireply\">&gt; In this case, you and your son didn&#39;t have much empathy for his friend&#39;s lack of empathy. :-)<br/>\n<br/>\n </span></blockquote>This is so true, and I didn&#39;t see it before.  Thanks to both of you for pointing that out.  In fact, upon reflecting on this this morning, I realized I do this often enough.  For example, when my husband is impatient with our son, I tend to be impatient with my husband.  When my family is critical of our life choices, I tend to think critically of my family.  Definitely a pattern here for me.  Thanks again.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Empathy","postDate":"1311695631","msgId":62044,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0RTBCRjhBLUMxNDEtNDIxMC04MjUzLURFRjc4MzA1Q0E2N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGowbWdybStwdnVyQGVHcm91cHMuY29tPg==","referencesHeader":"PGowbWdybStwdnVyQGVHcm91cHMuY29tPg=="},"prevInTopic":62041,"nextInTopic":62046,"prevInTime":62043,"nextInTime":62045,"topicId":62040,"numMessagesInTopic":0,"msgSnippet":"-=-He wasn t badly hurt, but he just wanted a pause in the play, and a caring word. Not such big expectation, I think? Or maybe that is me expecting our friend","messageBody":"<div id=\"ygrps-yiv-1317238503\">-=-He wasn&#39;t badly hurt, but he just wanted a pause in the play, and a caring word. Not such big expectation, I think? Or maybe that is me expecting our friend to act a certain way? Hmm.-=-<br/>\n<br/>\nSome people have it and some people don&#39;t (empathy).<br/>\n<br/>\nIn this case, you and your son didn&#39;t have much empathy for his friend&#39;s lack of empathy. :-)<br/>\n<br/>\nIt can be modelled, but it can&#39;t be required.  Fake empathy would be way more hollow and irritating than a fake apology.<br/>\n<br/>\nPeople with a lot of empathy become nurses and ministers, funeral directors, counsellors.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Empathy","postDate":"1311691228","msgId":62041,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ1RTgxMjg2LTA4NkMtNDkxNi1BREZDLUI2NDJEMUI5QjRCNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGowbWdybStwdnVyQGVHcm91cHMuY29tPg==","referencesHeader":"PGowbWdybStwdnVyQGVHcm91cHMuY29tPg=="},"prevInTopic":62040,"nextInTopic":62044,"prevInTime":62040,"nextInTime":62042,"topicId":62040,"numMessagesInTopic":0,"msgSnippet":"... Some reactions are better than others. And it s good to notice what others do that makes us feel good and makes us feel badly. And those are the things we","messageBody":"<div id=\"ygrps-yiv-851043138\">On Jul 26, 2011, at 9:52 AM, Karen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; He was quite irritated at the lack of empathy shown to him. He  <br/>\n&gt; wasn&#39;t badly hurt, but he just wanted a pause in the play, and a  <br/>\n&gt; caring word. Not such big expectation, I think? Or maybe that is me  <br/>\n&gt; expecting our friend to act a certain way? Hmm.<br/>\n<br/>\n </span></blockquote>Some reactions are better than others. And it&#39;s good to notice what  <br/>\nothers do that makes us feel good and makes us feel badly. And those  <br/>\nare the things we can adopt or stop doing ourselves :-)<br/>\n<br/>\nBut it&#39;s not very empathic to expect someone else to feel and react in  <br/>\ncertain way. They&#39;ve got their own agenda going on.<br/>\n<br/>\nSomeone can&#39;t be shamed into feeling empathy and acting on it. They  <br/>\nmight be shamed into acting as if they felt empathy. But it&#39;s far more  <br/>\nlikely what they&#39;ll feel is discomfort and perhaps annoyance.<br/>\n<br/>\nHe&#39;s most likely to pick up kind and thoughtful reactions from people  <br/>\nwho react to him with kindness. Especially his mom.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Empathy","postDate":"1311688374","msgId":62040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGowbWdybStwdnVyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62041,"prevInTime":62039,"nextInTime":62041,"topicId":62040,"numMessagesInTopic":0,"msgSnippet":"I have been thinking a lot about empathy these past several weeks.  Part of what has attracted my attention to this emotion is seeing just how much empathy my","messageBody":"<div id=\"ygrps-yiv-1298354290\">I have been thinking a lot about empathy these past several weeks.  Part of what has attracted my attention to this emotion is seeing just how much empathy my eight year old son has for others.  It is quite striking.  It also strikes me how he expects empathy from others when he is uncomfortable for whatever reason.  <br/>\n<br/>\nThe other day he was playing with a friend.  He tripped and fell, and hurt himself.  He paused to address that hurt.  His friend kept talking about whatever they were playing.  My son, yelled &quot;Can&#39;t you see I&#39;m hurt?&quot;  His friend looked at him like there was something wrong with him besides the hurt.  I think he (the friend) was uncomfortable, so he left, and went inside his home.  My son and I returned to our house.  He was quite irritated at the lack of empathy shown to him.  He wasn&#39;t badly hurt, but he just wanted a pause in the play, and a caring word.  Not such big expectation, I think?  Or maybe that is me expecting our friend to act a certain way?  Hmm.<br/>\n<br/>\nIn our world where parents expect children to just get up and shake it off ( I have heard this so very often ), or behave a certain way, or accept (and like) certain prescribed activities, I fear we risk raising people that learn to suppress their real desires, and become incapable of having empathy for themselves, and, ultimately, for others as well.  <br/>\n<br/>\nI know, for myself, it has been hard for me to sit with my son when he cries over a hurt or frustration.  Sometimes, I have found myself getting frustrated with him because *I* am so uncomfortable.  Thankfully, I have been blessed with a child who can tell me when I am not giving him what he needs, and help me understand when he wants help finding a solution, or when he just needs caring company.  I think he has helped me understand empathy.  I shiver to think of the course I might have taken if he were less bold.<br/>\n<br/>\nI would love to hear more about what some other experiences have been, especially those of you with older children.  Do you see more empathy in your children?  Do you think it is because of being raised the way they were?  If so, how and why?</div>","specialLinks":[]}],"prevTopicId":62014,"nextTopicId":61890}}