{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] what are you doing this morning?","postDate":"1062015426","msgId":79262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODI3LjEzMTcwNi4zMzIuNC5mcmVlZm9ybUBqdW5vLmNvbT4="},"prevInTopic":79258,"nextInTopic":0,"prevInTime":79261,"nextInTime":79263,"topicId":79240,"numMessagesInTopic":0,"msgSnippet":"On Wed, 27 Aug 2003 13:10:30 -0700 Betsy  ... No, I think you re right, at least in my experience... but all of the cases I know of","messageBody":"<div id=\"ygrps-yiv-360290983\">On Wed, 27 Aug 2003 13:10:30 -0700 Betsy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a>&gt;<br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t want to be too alarmist or too pessimistic, but it is my <br/>\n&gt; perception that school districts overall seem more inclined to pick  on<br/>\n<br/>\n&gt; single moms than on anyone else.<br/>\n&gt; <br/>\n&gt; Other people could mention whether they think I&#39;m blowing smoke.  I <br/>\n&gt; realize that I am passing on anecdotal evidence from a small <br/>\n&gt; sample.<br/>\n<br/>\n </span></blockquote>No, I think you&#39;re right, at least in my experience... but all of the<br/>\ncases I know of have involved either custody issues (which Diana doesn&#39;t<br/>\nhave) or families getting some sort of gov&#39;t aid (SSI, food stamps, AFDC,<br/>\netc).  And they&#39;re still very rare...<br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] what are you doing this morning?","postDate":"1062015030","msgId":79258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNEQxMDM2LjUwNjA2MDFAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDU3LjIxNTk0OGQ3LjJjN2U0Y2YzQGFvbC5jb20+"},"prevInTopic":79246,"nextInTopic":79262,"prevInTime":79257,"nextInTime":79259,"topicId":79240,"numMessagesInTopic":0,"msgSnippet":"**I do have a couple of errands to run, including registering Hannah with the school district (though I m really in a quandry, wanting to stay *underground* **","messageBody":"<div id=\"ygrps-yiv-81943893\">**I do have a couple of errands to run, including registering Hannah <br/>\nwith the school district (though I&#39;m really in a quandry, wanting to <br/>\nstay *underground* **<br/>\n<br/>\nHi, Diana --<br/>\n<br/>\nI don&#39;t want to be too alarmist or too pessimistic, but it is my <br/>\nperception that school districts overall seem more inclined to pick on <br/>\nsingle moms than on anyone else.<br/>\n<br/>\nOther people could mention whether they think I&#39;m blowing smoke.  I <br/>\nrealize that I am passing on anecdotal evidence from a small sample.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":4335759,"authorName":"HaHaMommy@aol.com","from":"HaHaMommy@...","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-Discussion] what are you doing this morning?","postDate":"1062007539","msgId":79246,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3LjIxNTk0OGQ3LjJjN2U0Y2YzQGFvbC5jb20+"},"prevInTopic":79243,"nextInTopic":79258,"prevInTime":79245,"nextInTime":79247,"topicId":79240,"numMessagesInTopic":0,"msgSnippet":"I got up first this morning (ah, the peace and quiet!) and checked my e-mail. Hayden woke up soon after and snuggled with me on the couch to watch LOTR-2 ","messageBody":"<div id=\"ygrps-yiv-1384556854\">I got up first this morning (ah, the peace and quiet!) and checked my e-mail. <br/>\n Hayden woke up soon after and snuggled with me on the couch to watch LOTR-2 <br/>\nTowers.  He asked for chicken nuggets and fries for breakfast so I popped some <br/>\ninto the oven.  Hannah missed the feast but woke in time for my favorite <br/>\nlines by Gimli, during the war.  (That dwarf cracks me up & my laughing really <br/>\nentertains the kids &lt;bg&gt;) She just finished the ramen noodles she requested & is <br/>\nmaking some apple juice.  I hear Hayden playing with his new &quot;Hulk Hands.&quot;  <br/>\nWe&#39;re still celebrating their birthdays (Aug 22 & 23) so they are King and Queen <br/>\nof the castle thru next weekend, meaning my vote doesn&#39;t much count right now <br/>\n&lt;g&gt;.  I do have a couple of errands to run, including registering Hannah with <br/>\nthe school district (though I&#39;m really in a quandry, wanting to stay <br/>\n*underground*); but we&#39;ll see how their plans/desires for the day mesh with mine.  I&#39;m <br/>\nsure we&#39;ll see the park across the street at some point, though indoor play <br/>\nis fine for now, considering it&#39;s over 90 outside right now!  Hayden just came <br/>\nin with his new spiral notebook to show me the pictures he&#39;s drawn and the <br/>\nwords he&#39;s written: mostly of our family and his *invisible* friends.  Hannah <br/>\ndressed herself, but Hayden and I are still in our nightclothes :)  and probably <br/>\nwill be until we are forced to go somewhere &lt;g&gt;<br/>\nYesterday, we spent a leisurely afternoon at a local toy store, playing with <br/>\ntheir new *Panama Canal* water toy, the train sets and the playmobile stuff.  <br/>\nWe will probably find ourselves there again before the week is out :)  <br/>\nIt is all about the play, both theirs and mine.  Hayden noticed a board game <br/>\nwe own that we&#39;ve never played (Mind Your Manners) and has requested a game <br/>\nthis afternoon.  Monopoly Jr. is played almost every day!  The TV is on, but <br/>\nignored as they go about their business of playing. Pretty typical of our days, <br/>\nthough today I think I must get the dishes done and the living room livable <br/>\nagain :)  <br/>\n diana,<br/>\nThe wackiest widow westriver...<br/>\n&quot;Education- compulsory schooling, compulsory learning- is a tyranny and a <br/>\ncrime against the human mind and spirit.  Let all those escape it who can, any <br/>\nway they can.&quot;  John Holt<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":72925035,"authorName":"Cay A. Gibson","from":"&quot;Cay A. Gibson&quot; &lt;caygibson@...&gt;","profile":"gibsevengang","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Ren&#39;s Talk on Play","postDate":"1062005971","msgId":79243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJpaXFjaithZWFnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMwODI3LjEwMTExNi4xOTU4MS4zMzU3NkB3ZWJtYWlsMDkubnljLnVudGQuY29tPg=="},"prevInTopic":79240,"nextInTopic":79246,"prevInTime":79242,"nextInTime":79244,"topicId":79240,"numMessagesInTopic":0,"msgSnippet":"... play. How the creative genius in human beings NEEDS play to stay active.  Ren, Is this talk on cassette tape or posted somewheres? I d love to read it if","messageBody":"<div id=\"ygrps-yiv-1083862208\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-Discussion@yahoogroups.com\">Unschooling-Discussion@yahoogroups.com</a>, Ren <br/>\n&lt;starsuncloud@n...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My workshop at the conference was all about the importance of <br/>\n </span></blockquote>play. How the creative genius in human beings NEEDS play to stay <br/>\nactive. &gt;&gt;<br/>\n<br/>\nRen,<br/>\nIs this talk on cassette tape or posted somewheres?<br/>\nI&#39;d love to read it if available.<br/>\nBlessings,<br/>\nCay<br/>\nmom to Corey 15.11, Kayleigh 13.3, Garrett 10.5, Chelsea 5.10, and <br/>\nAnnie 20 months<br/>\n<br/>\nAuthor of &quot;Literature Alive!&quot; <a rel=\"nofollow\" target=\"_blank\" href=\"http://literaturealive.tripod.com\">http://literaturealive.tripod.com</a><br/>\nTake the boredom out of reading and make literature come Alive! <br/>\nwithin your home!</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"what are you doing this morning?","postDate":"1062004214","msgId":79240,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwODI3LjEwMTExNi4xOTU4MS4zMzU3NkB3ZWJtYWlsMDkubnljLnVudGQuY29tPg=="},"prevInTopic":0,"nextInTopic":79243,"prevInTime":79239,"nextInTime":79241,"topicId":79240,"numMessagesInTopic":0,"msgSnippet":"Well... My kids have had the tv on all morning...coming and going from it as they gain or lose interest with what is on. We re winding down from our road trip,","messageBody":"<div id=\"ygrps-yiv-332124404\">Well...<br/>\nMy kids have had the tv on all morning...coming and going from it as they gain or lose interest with what is on. We&#39;re winding down from our road trip, trying to get the house somewhat clean again.<br/>\nJalen has been hauling around his hot wheels collection and showing us all his cool cars. When his uncle stopped by a few minutes ago to head out for work with dh, Jalen got REALLY excited by the car shirt Terry was wearing. Uncle is a car lover too!:)<br/>\nTrevor has been checking email frequently, due to an extra special connection he made at the conference.<br/>\nJared has been moping about, hoping to feel better because he&#39;s dealing with swimmer&#39;s ear post-conference. He was in the pool as much as he was out, so I&#39;m not surprised.<br/>\nSierra has packed her backpack with various toys and snacks, in preparation for &quot;school&quot;. She is fascinated with the idea of going to school, so she acts it out in these ways.<br/>\n<br/>\nThe plan is to get the house liveable again and then go downstairs for a movie fest. We have the Cowboy Bebop movie that didn&#39;t get watched at the conference (sorry Cat!!), Chocolat and Willow. We&#39;ll be plenty busy today.<br/>\n<br/>\nAn interesting connection was made on the drive home...a fun one for me. On the way up to the conference the kids were talking about transport pods and how they wish we could just transport to the conference. We talked about the technology it would involve and whether it would ever be possible. On the way home, a fly got trapped in the car and that started a whole convo about flies, how they eat, different types and whether they bite etc....<br/>\nSuddenly I said &quot;The Fly&quot;! The kids didn&#39;t know what I was talking about so I explained about how the movie combines two of our topics of conversation, transport pods and flies!! They thought that was pretty cool, so we&#39;ll have to rent that one soon. Maybe the old version and the newer 90&#39;s one also.<br/>\n<br/>\nMy workshop at the conference was all about the importance of play. How the creative genius in human beings NEEDS play to stay active. Play helps us stay in touch with our inner child, which is the time in our lives when we are most able to explore new ideas, toy with the imaginary and come up with incredible daydreams. THAT is what creative genius needs. Not academic know how. And no matter what area of life you are naturally skilled at, creativity is an extremely important skill. It helps business leaders develop new and better idea, it gets scientists coming up with innovative, amazing new research, it makes inventors famous! So I guess it depends on your goals. I value creativity and imagination above knowledge. I know that creative thinking needs lots of play and free time to grow and flourish. Therefore I value play highly in our lives!!<br/>\nIt&#39;s time to look at play through different eyes. Play is essential, it is important and it is absolutely necessary if you want to allow your child to continue their creative pursuits.<br/>\n<br/>\nAs I was typing this, my free children turned off the tv and set up a Yu-gi-oh battle on the coffee table. Jalen is now nursing and I&#39;m not sure where Sierra went.<br/>\n<br/>\nEbb and flow, rhythm and pulse..... this is the way of unschoolers. Life itself just swirls around us and we pick up the things that are meaningful along the way.<br/>\nPlay is important. Laughing and being silly is valued. Life is short and focusing on joy is far better than worry about knowledge they may never need. Although through their play, they DO pick up the essential ingredients for dealing with our culture, our society and the world beyond their society.<br/>\nThe most inventive, creative adults play with their work. Albert Einstein was playing when he came up with his formulas. Rolling ideas around in your mind, pondering, playing with them, fluffing them about like so many bits of swirling color...that is what I want my children to be able to continue doing throughout their lives, not only in childhood.<br/>\n<br/>\nRen</div>","specialLinks":[]}],"prevTopicId":79252,"nextTopicId":79263}}