{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":3088570,"authorName":"Holly Shaltz","from":"Holly Shaltz &lt;holly@...&gt;","profile":"hollyshaltz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: new member intro and beliefs and drought  and learning","postDate":"1064326027","msgId":81283,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGNzA1MzhCLkVDM0UxQkI5QHNoYWx0emZhcm0uY29tPg==","referencesHeader":"PDFhMS4xYTY4NzE3NC4yY2EwODVkM0Bhb2wuY29tPg=="},"prevInTopic":81210,"nextInTopic":0,"prevInTime":81282,"nextInTime":81284,"topicId":81210,"numMessagesInTopic":0,"msgSnippet":"Sandra writes: ","messageBody":"<div id=\"ygrps-yiv-1743506354\">Sandra writes:<br/>\n<br/>\n&lt;&lt;People who read without judgment aren&#39;t thinking or learning.&gt;&gt;<br/>\n<br/>\nI used the word &quot;judgmental&quot;, which I judge &lt;g&gt; to be quite different<br/>\nfrom using &quot;judgment&quot;.<br/>\n<br/>\nI use &quot;judgmental&quot; to mean being highly critical in a very negative<br/>\nsense.  <br/>\n<br/>\nI would say using &quot;judgment&quot; means weighing what has been communicated<br/>\nagainst one&#39;s own experience and deciding for oneself what is worthy and<br/>\nwhat not, what&#39;s positive and what&#39;s negative.<br/>\n<br/>\nI use judgment based on my personal experience every time I read a post,<br/>\ntake a phone call, write a letter, drive a car, assess a yarn I&#39;ve spun,<br/>\ndecide what veggies to grow next year.  The emotional tone of using<br/>\njudgment is, for me, positive--the goal is to learn from any mistakes so<br/>\nmy judgment is better each time.  When others are present, using good<br/>\njudgment fosters open dialog--or, occasionally, I withdraw from the<br/>\ndialog because my judgment tells me it will not be a positive<br/>\nexperience.<br/>\n<br/>\nIf I were judgmental about the above examples, I might decide the poster<br/>\nhad rocks for brains, or that I&#39;m a bad spinner, or that I&#39;ll never<br/>\nlearn how to grow enough vegetables for us to be self-sufficient.  The<br/>\ntone and experience are both negative and unpleasant, and has a strong<br/>\ntendency to kill any open exchange of ideas.  I grew up with a mother<br/>\nlike this, so I know what I&#39;m talking about :)<br/>\n<br/>\nIn my observation of my own and others&#39; tendencies toward being<br/>\njudgmental, the purpose generally seems to be a need to prove oneself to<br/>\nbe &#39;better&#39; than the other.  As when I figured out why I kept being<br/>\ncritical (only to myself, but it was still a negative thing) about<br/>\nanother Holly&#39;s hair.  She never seemed to trim it or comb it--and I&#39;m<br/>\nnot talking going to the beauty shop weekly :)  I finally realized it<br/>\nwas the only thing I could feel superior to her about.  Exploring why I<br/>\nneeded to feel superior led me to greater understanding of the impacts<br/>\nof growing up with a severely judgmental mother, and has in turn led to<br/>\nmuch less need to privately find ways to be superior to others.<br/>\n<br/>\nIOW, I used my judgment to understand why I was judgmental.<br/>\n<br/>\nHolly</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: new member intro and beliefs and drought and learning","postDate":"1064250323","msgId":81210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMS4xYTY4NzE3NC4yY2EwODVkM0Bhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":81283,"prevInTime":81209,"nextInTime":81211,"topicId":81210,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/22/03 8:31:16 AM, holly@shaltzfarm.com writes: ","messageBody":"<div id=\"ygrps-yiv-269754469\">In a message dated 9/22/03 8:31:16 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:holly@...\">holly@...</a> writes:<br/>\n<br/>\n&lt;&lt; My first impression is one of the list&#39;s atmosphere being<br/>\nsomewhat judgemental--at least when one particular button is pushed.  &gt;&gt;<br/>\n<br/>\nPeople who read without judgement aren&#39;t thinking or learning.<br/>\n<br/>\nThe particular button is &quot;this will make it harder for people to be good <br/>\nunschoolers,&quot; and your post didn&#39;t push that button for me.<br/>\n<br/>\n&lt;&lt;welcoming the first real rain to fall in over 2 months--too late to save<br/>\nour pastures--and wishing she could change the apparent physical reality<br/>\nof the world to not include drought &lt;g&gt;&gt;&gt;<br/>\n<br/>\nMay daughter&#39;s name is Holly too.   She has a fascination for a little town <br/>\nhere called Madrid, pronounced &quot;wrong,&quot; with emphasis on the MAD.  It was a big <br/>\ncoal mining town founded in the 1880&#39;s, which was a ghost town when WWII <br/>\ncame, and was repopulated by hippie artists in the 1970&#39;s.   We drove up there <br/>\nyesterday to have lunch and for her to show her friend some nice grafitti under a <br/>\nbridge that used to be a car bridge over an arroyo, but now is just a <br/>\nfootbridge.   The book that was under there in May was still there.  We looked at the <br/>\nwood joinery on the handrail, and talked about wood construction with simpler <br/>\ntools and methods.   <br/>\n<br/>\nBut as to drought, that area is high and dry, no regularly running water at <br/>\nall, and without mining, nobody would have lived there.  Without deep wells for <br/>\ndrinking water and other modern adaptations it would be uninhabitable.   We <br/>\nsaw dead evergreens on the way.  These are not giant trees, but they&#39;re old <br/>\ntrees.   Piñon and juniper, squat stuff that doesn&#39;t get more than maybe ten or <br/>\nfifteen feet high, even the big ones.  Round evergreens that look like crumbs <br/>\nfrom a distance, like the hills were sprinkled with some kind of cake-shop <br/>\ndecorations.   In some places a fourth of them were dead, and that creates quite a <br/>\nfire danger.   <br/>\n<br/>\nThe town itself was made of wooden shacks (there are a few little stone <br/>\nhouses from 1915 or so, and the newer construction is county code) and some of <br/>\nthose mining shacks still stand in their state of deterioration.   The ground is <br/>\ncoal dust in most places.   There are little paper signs around town that say <br/>\n&quot;Your cigarette could burn our town: watch your butts&quot; or something very like <br/>\nthat.<br/>\n<br/>\nWe didn&#39;t talk about any of that much.  I know Holly didn&#39;t miss any of it.<br/>\n<br/>\nWe thought the restaurant/tavern would be kind of empty, but there was a <br/>\nbiker group in town, and also a family reunion.  It was really crowded, but there <br/>\nwas a band.<br/>\n<br/>\nNice day.<br/>\n<br/>\nWelcome to the list, Holly who has a name like my daughter&#39;s!<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":81277,"nextTopicId":81292}}