{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How do you stop bullying when it happens in the family?","postDate":"1327857693","msgId":65340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpnM3Y2dCtuMXFsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpnMjkyOStlM2hhQGVHcm91cHMuY29tPg=="},"prevInTopic":65299,"nextInTopic":0,"prevInTime":65339,"nextInTime":65341,"topicId":65290,"numMessagesInTopic":0,"msgSnippet":"... *************** Do you mean showing that she s intimidated? My experience with bullies is that avoiding them actually knocks some of the wind out of their","messageBody":"<div id=\"ygrps-yiv-1169251736\">&quot;amyparkington&quot; &lt;amyparkington@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I feel that by moving her to a different class she is avoiding the stuation and showing intimidation.  <br/>\n </span></blockquote>***************<br/>\n<br/>\nDo you mean showing that she&#39;s intimidated? My experience with bullies is that avoiding them actually knocks some of the wind out of their sails, at least temporarily - it will take that person time to find another target and build up again. He won&#39;t feel a &quot;win&quot; because bullying is a defense mechanism to make him feel better about himself. And if he chose your daughter because she&#39;s related, that will slow him down in terms of acquiring a new target, maybe even prevent him from doing so.<br/>\n<br/>\nIf you daughter goes away entirely or goes away for awhile and comes back with more skills, she&#39;s in a better situation than if she stays. Staying in a situation with a bully most likely means she&#39;d continued to be bullied unless the bully slips up and hurts her badly enough to get kicked out of the class - which isn&#39;t either likely or something to hope for. A kid picking on his cousin is the sort of thing teachers will ignore all the harder Because of the family ties - they don&#39;t want to be in the middle of a situation which could very well have started with the parents (like this one!).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She wants to attend a 1-week sleep over karate camp. She would skip a belt and that would put her at the same belt level with her mean cousin. She thinks that would give her confidence.<br/>\n </span></blockquote>****************<br/>\n<br/>\nConfidence is good, but she shouldn&#39;t feel like she has to go back to the same class if there are others available. If you&#39;re telling her things like &quot;you can&#39;t let him intimidate you into leaving&quot; then stop - those messages are feeding into the situation and setting her up to get hurt. Some types of conflict are Best handled by avoidance because there&#39;s no &quot;once and for all&quot; solution - the other person&#39;s needs are such that he or she will keep picking and picking and picking. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: How do you stop bullying when it happens in the family?","postDate":"1327702713","msgId":65299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpmdjdycCs2NG9pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpmdWE1NysycWhiQGVHcm91cHMuY29tPg=="},"prevInTopic":65291,"nextInTopic":65340,"prevInTime":65298,"nextInTime":65300,"topicId":65290,"numMessagesInTopic":0,"msgSnippet":"... What would you do if you weren t related to your babysitter and the other sat child? That s an important question. Sometimes and ideal of family can","messageBody":"<div id=\"ygrps-yiv-2060725832\">&quot;amyparkington&quot; &lt;amyparkington@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; How do you stop bullying when it happens in the family?<br/>\n<br/>\n </span></blockquote>What would you do if you weren&#39;t related to your babysitter and the other &quot;sat&quot; child? That&#39;s an important question. Sometimes and ideal of &quot;family&quot; can seem so important that parents will overlook children&#39;s needs in the moment for that ideal, but the sad fact is that &quot;family&quot; more often protects bullies than the bullied. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What can I do to help my<br/>\n&gt; daughter?<br/>\n<br/>\n </span></blockquote>What does she want to do? If she&#39;s having stomach pains, she may be happiest if she can avoid him for awhile, so help her do that. Find another childcare option so she&#39;s not stuck in a situation where she can&#39;t get help and she&#39;s being made miserable. <br/>\n<br/>\nFind her another karate class, maybe an all-girl class or a women&#39;s self-defense class - because she doesn&#39;t need katas right now, she needs to know how to take a boy down who&#39;s giving her trouble. Or, if she likes martial arts in general but doesn&#39;t care what, shop around to different styles and also things like sword-fighting.<br/>\n<br/>\nMake other friends - people you can rely on not to make you feel cruddy or be mean to your daughter. Family can be a trap which keeps you from the world. See this as an opportunity to expand your world, rather than keeping it confined to what and who you know. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How do you stop bullying when it happens in the family?","postDate":"1327676437","msgId":65291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzNDQ3MTBFLTZCNDEtNDJDQi05REQ3LTg1REQ3QjdBQjZCMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpmdWE1NysycWhiQGVHcm91cHMuY29tPg==","referencesHeader":"PGpmdWE1NysycWhiQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":65299,"prevInTime":65289,"nextInTime":65292,"topicId":65290,"numMessagesInTopic":0,"msgSnippet":"-=-The grandparents are very impressed with my daughter and they always praise her in family reunions.-=- So they helped create the problem, and they re not","messageBody":"<div id=\"ygrps-yiv-1317404455\">-=-The grandparents are very impressed with my daughter and they always<br/>\npraise her in family reunions.-=-<br/>\n<br/>\nSo they helped create the problem, and they&#39;re not paying much attention while they babysit.<br/>\n<br/>\n-=-The cousin bumps into my daughter &quot;accidently&quot;, yells at her,<br/>\nrejects her and talks to her in a condescending manner. They take a<br/>\nkarate class together. In the class the cousin kicked my daughter very<br/>\nhard. Now my daughter is intimidated by her cousin. She gets stomach<br/>\npains when she sees her cousin.-=-<br/>\n<br/>\nDoes she yell &quot;STOP IT&quot; as loudly as she can?<br/>\nIn the karate class did she say &quot;DON&#39;T KICK ME&quot; full voice?<br/>\nIf she&#39;s accepting these things passively, she&#39;s feeding the situation, maybe.<br/>\n<br/>\n-=-My husband talked to his brother and his brother&#39;s wife about this<br/>\nsituation.-=-<br/>\n<br/>\nWell if they don&#39;t know how to help, you and your husband and your daughter should deal with the cousin directly.  <br/>\n<br/>\nBut they won&#39;t be the ages they are for very long.<br/>\n<br/>\n-=-My husband and I have been bullied by his own brother and his<br/>\nbrother&#39;s wife. They are aggressive people. They provoke us and<br/>\nwhen we react to them they accuse us of attacking them. I hardly talk to<br/>\nthem anymore because of this.-=-<br/>\n<br/>\nThen you pretty much knew that leaving the girls together was asking for trouble.<br/>\n<br/>\n-=Now the grandparents only babysit my daughter in the afternoon while I<br/>\nam at work. The damage has been done. What can I do to help my<br/>\ndaughter?-=-<br/>\n<br/>\nYou mean the cousin isn&#39;t there anymore?  <br/>\nThen if you move her to a different karate class, the immediate problem is solved.  <br/>\n<br/>\nAt family reunions or holidays, hang out with her or where you can see her, and the second you see the cousin gaze at her in that thoughtful-bully way, move closer.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":65236,"nextTopicId":65317}}