{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2785","postDate":"1041715904","msgId":53092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFMTc1MkJGLkUwNkNDNkI4QGVhcnRobGluay5uZXQ+","referencesHeader":"PDY5MzQtM0UxNzI1MEItMjU4MjVAc3RvcmVmdWxsLTIzNzEucHVibGljLmxhd3Nvbi53ZWJ0di5uZXQ+"},"prevInTopic":53068,"nextInTopic":0,"prevInTime":53091,"nextInTime":53093,"topicId":53068,"numMessagesInTopic":0,"msgSnippet":"** adoptive mom tells her she isn t wanted - never was - etc. many, many times a week** This is just awful! I m going to have to rethink my theory that it is","messageBody":"<div id=\"ygrps-yiv-1807800912\">** adoptive mom tells her she isn&#39;t wanted -<br/>\nnever was - etc. many, many times a week**<br/>\n<br/>\nThis is just awful!<br/>\n<br/>\nI&#39;m going to have to rethink my theory that it is *school* that makes<br/>\nmost teenagers miserable.  (I do think it&#39;s perfectly reasonable for an<br/>\naverage teen in school to be very pissed about having to be there.)<br/>\n<br/>\nWhen parents really make an effort to be rotten, they can out rotten the<br/>\nschools any day, because it strikes closer to the child&#39;s heart.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2785","postDate":"1041704203","msgId":53068,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5MzQtM0UxNzI1MEItMjU4MjVAc3RvcmVmdWxsLTIzNzEucHVibGljLmxhd3Nvbi53ZWJ0di5uZXQ+","inReplyToHeader":"VW5zY2hvb2xpbmctZG90Y29tQHlhaG9vZ3JvdXBzLmNvbSdzIG1lc3NhZ2Ugb2YgNCBKYW4gMjAwMwkxMjozNTo1OCAtMDAwMA=="},"prevInTopic":0,"nextInTopic":53092,"prevInTime":53067,"nextInTime":53069,"topicId":53068,"numMessagesInTopic":0,"msgSnippet":"My son wanted to get in trouble at school, told me all the violent things he was going to do to people, how cool it would be, etc. He has been labeled bi-polar","messageBody":"<div id=\"ygrps-yiv-587996354\">My son wanted to get in trouble at school, told me all the violent<br/>\nthings he was going to do to people, how cool it would be, etc. He has<br/>\nbeen labeled bi-polar and has dyslexia. The violent, emotional<br/>\ndisturbances and the way everyone who was looking in on the situation<br/>\nnearly drove many of us in the family to want to kill ourselves. It was<br/>\nawful. At first when he was diagnosed  with bi polar I thought &quot;great&quot; I<br/>\nfinally know what the &quot;label&quot; is. Then the heavy drugs took him over and<br/>\nhe was what he had feared the most a walking zombie. Then time went by.<br/>\nWe stopped giving him drugs and gave him a nutritional supplement for<br/>\npeople with bi polar. I took him out of public school and began<br/>\nunschooling. His anger/depression decreased greatly. I have been<br/>\nthinking again lately about a society that for the most part doesnt want<br/>\nto hear about the things that anger children/teens. We are too busy<br/>\ntrying to get them to comform so we can school them in a public<br/>\nbuilding. Forget that they are individuals. Forget the torment some are<br/>\ngoing through. MAKE them fit! This is an old scenario. It is too easy in<br/>\nmy opinion, to label teens bipolar, pigeon hole them, and &quot;put them<br/>\naway.&quot; It&#39;s a &quot;fix.&quot; Another teen we know has just been labeled bipolar<br/>\nby this same doctor and is taking lithium. I asked her has anyone talked<br/>\nto you about why you feel angry? She said &quot;no.&quot; She is black living in a<br/>\ntown with maybe two other blacks in 10,000, adopted (brings up issues<br/>\nespecially in the teen years), adoptive mom tells her she isn&#39;t wanted -<br/>\nnever was - etc. many, many times a week - she slit her wrist the last<br/>\ntime she told her that but didn&#39;t tell the doctor because she didn&#39;t<br/>\nwant to get her mom in trouble, etc. She just got her license and drives<br/>\nlike she wants to kill herself and/or anyone else - going through stop<br/>\nsigns for the &quot;fun&quot; of it. I know kids are angry. If people don&#39;t listen<br/>\nit gets worse because they want to be heard, cared about, etc. Just<br/>\nabout every child, teen and young adult we know is on depression/anxiety<br/>\nmedication. I wonder how many years it will take to figure out why,<br/>\nwhile they all suffer wondering &quot;what is wrong&quot; with them? Our local<br/>\nuniversity is doing a program to try to understand kids with emotional<br/>\ndisabilities and school issues. I think it should be looked at in the<br/>\nopposite way. School enables emotional disabilities in children. That is<br/>\nhard for people to hear so we will continue with what we are doing for a<br/>\nlong time, I am afraid. I keep speaking out about it. I tell any young<br/>\nperson who will listen to me to tell people how they really feel. It is<br/>\ntime to do that. They have been devalued far too long. Michele<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":53071,"nextTopicId":53088}}