{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":62434209,"authorName":"jenstarc4","from":"&quot;jenstarc4&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: self-proclaimed internet expert says...","postDate":"1176750445","msgId":28433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYwMGhoZStyc3BoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM4NUMyQ0E5LTI1NzktNEQ2Qi04ODJCLTlDOEE1OTI5QkFGOEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":28431,"nextInTopic":0,"prevInTime":28432,"nextInTime":28434,"topicId":28431,"numMessagesInTopic":0,"msgSnippet":"... Wow! Crazy!  My daughter talks to people online all the time, some of them by phone, and she definitely considers them friends, not strangers.  I very much","messageBody":"<div id=\"ygrps-yiv-910432194\"><blockquote><span title=\"ireply\">&gt; So here&#39;s the list of Alicia&#39;s Tips for Online Safety (page 118,  <br/>\n&gt; People Magazine, April 16, 2007):<br/>\n&gt; <br/>\n&gt; * Everyone is a stranger on the Internet.  Forever.<br/>\n<br/>\n </span></blockquote>Wow! Crazy!  My daughter talks to people online all the time, some of <br/>\nthem by phone, and she definitely considers them friends, not <br/>\nstrangers.  I very much don&#39;t agree with that assessment.  Heck that <br/>\nwould make Sandra a stranger, even though I&#39;ve met her IRL.  I <br/>\nadmittedly don&#39;t know her well personally but if I saw her again, I <br/>\nwould say hello and be happy to see her, as well as her kids.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; * Never give anyone online any information about yourself.<br/>\n&gt; <br/>\n&gt; * Profile pages contain too much information about you.  If you <br/>\n </span></blockquote>have  <br/>\n<blockquote><span title=\"ireply\"> &gt; one, take it down.<br/>\n<br/>\n </span></blockquote>What I see, is that most kids are really careful about giving out <br/>\npersonal info.  Even to the people they consider friends.  There is a <br/>\ngroup of people that my dd regularly chats with, some she likes way <br/>\nbetter than others.  For a long time she gaurded her real name, then <br/>\nshe held a bet sort of to see who could pronounce it right first.  <br/>\nIt&#39;s Chamille but pronounced with a K sound.  I think that everyone <br/>\nknows everyone&#39;s real name now.  All of these kids are on the up and <br/>\nup, most of them chat without their parent&#39;s knowledge or permission, <br/>\nyet there they are.  I&#39;ve seen a lot of them through web cams and <br/>\nheard their pubescent voices.  I&#39;ve answered the phone on a number of <br/>\noccasions.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; *  Use gender-neutral screen names.<br/>\n<br/>\n </span></blockquote>See, now most of these kids my dd talks to use anime names or just <br/>\nweird names.  However, you can generally tell what gender these kids <br/>\nare by the things they say and the way they talk, or what anime <br/>\nperson they name themselves after.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; * One in five kids are approached by pedophiles while online.<br/>\n<br/>\n </span></blockquote>There has been on occasion some weirdo online, but Chamille weeds <br/>\nthem out.  They don&#39;t get much say in the conversation, because these <br/>\nkids are smart enough to tell, who is who, by computer ID&#39;s and how <br/>\nthey say things.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; * Never have a computer in a private room or bedroom.<br/>\n<br/>\n </span></blockquote>We have laptops and wifi.  My kids are welcome to use the computer <br/>\nanywhere they want to.  My oldest just turned 13 and as a present, we <br/>\nredid her room.  It was a nice coming of age sort of present, take <br/>\nall the little kid stuff and give her some style.  She loves her room <br/>\nso much, we hardly see her anymore!  She used to sit out in the <br/>\nliving room and chat and stuff.  She has nothing to hide.  She shows <br/>\nme stuff and occasionally asks me to join her chat room.  I know all <br/>\nthe kids that she talks to, by their made up names and real names.  <br/>\nSome of their numbers are programmed into my cell phone.<br/>\n<br/>\nJust last night, my dd decided that she was bored chatting with her <br/>\nonline friends and requested time with me, just to chat and hang out <br/>\none on one.  We talked for hours and hours until I had to kick her <br/>\nout because I was falling asleep and I wanted to turn off the lights <br/>\nand go to bed.  It&#39;s possible that she went back to her room and <br/>\nchatted online more.  I don&#39;t know.  I completely trust her.  I&#39;m not <br/>\nafraid of the internet boogie man.  <br/>\n<br/>\nShe likes being at home so much that she usually wants her friends to <br/>\ncome over to our house, instead of the other way around.  Quite <br/>\nhonestly, most of her friends prefer that too.  I seriously don&#39;t see <br/>\nher wanting to go out and meet some 30 yr old man somewhere, just <br/>\nbecause she met him online and he wanted to meet her.  She knows <br/>\nplenty of 30 yr old men IRL to know that they&#39;re ok, but kids are <br/>\nmore fun to hang with.  The neighbor girl is much more at risk for <br/>\nthat because she hates her home, isn&#39;t allowed internet access, and <br/>\ncomes over here to use the internet and talk to people that her <br/>\nparents know nothing about.  When I am uncomfortable with someone she <br/>\nis talking to, I tell her and so does my daughter.<br/>\n<br/>\nRight now the neighbor is grounded from my daughter, so who knows <br/>\nwhat she&#39;s doing lately.  Our house is her safe house, and when it&#39;s <br/>\noff limits, I have no idea what she does.  But that&#39;s a whole other <br/>\nstory...</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"self-proclaimed internet expert says...","postDate":"1176745805","msgId":28431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4NUMyQ0E5LTI1NzktNEQ2Qi04ODJCLTlDOEE1OTI5QkFGOEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":28433,"prevInTime":28430,"nextInTime":28432,"topicId":28431,"numMessagesInTopic":0,"msgSnippet":"The discussion of the alleged evils of computer games reminded me of an article in the current People magazine, about a girl who left with someone she met on","messageBody":"<div id=\"ygrps-yiv-1156744372\">The discussion of the alleged evils of computer games reminded me of  <br/>\nan article in the current People magazine, about a girl who left with  <br/>\nsomeone she met on the internet and was a captive for years, was  <br/>\nrescued, and now is going around talking about it at schools.<br/>\n<br/>\nHer advice is AWFUL.  Terrible.<br/>\n<br/>\nHer experiences was awful and terrible too, but rather than talking  <br/>\nto younger kids about what horrors can happen if they&#39;re captured and  <br/>\nsexually abused and exploited, she&#39;s telling them not to be on the  <br/>\ninternet, and also telling them AWFUL things that won&#39;t help their  <br/>\nself esteem a bit.<br/>\n<br/>\nIn the article it says:  &quot;As she tells her audiences, &#39;There are lots  <br/>\nof predators on the Web.  They are older than us.  Smarter than us.   <br/>\nIf you give them any information, they&#39;ll get you.&#39;&quot;<br/>\n<br/>\nSo she&#39;s telling them they&#39;re little and stupid--that they&#39;re too  <br/>\nyoung and they&#39;re lacking in intelligence.<br/>\nYet she *KNEW* the guy was a liar.  He had pretended to be a girl her  <br/>\nage.  When she found out he was really a 31 year old an (according to  <br/>\nthe article, &quot;She said she was mad for a few hours, then got back  <br/>\nonline with her friend because, in her mind, &quot;Christine was still  <br/>\nChristine to me.&quot;<br/>\n<br/>\nWelll.... She also arranged for the guy to come to get her, and got  <br/>\ninto the car and left.<br/>\n<br/>\nSo here&#39;s the list of Alicia&#39;s Tips for Online Safety (page 118,  <br/>\nPeople Magazine, April 16, 2007):<br/>\n<br/>\n* Everyone is a stranger on the Internet.  Forever.<br/>\n<br/>\n* Never give anyone online any information about yourself.<br/>\n<br/>\n* Profile pages contain too much information about you.  If you have  <br/>\none, take it down.<br/>\n<br/>\n*  Use gender-neutral screen names.<br/>\n<br/>\n* One in five kids are approached by pedophiles while online.<br/>\n<br/>\n* Never have a computer in a private room or bedroom.<br/>\n<br/>\nI&#39;m going to comment on those in later e-mails.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":28426,"nextTopicId":28411}}