{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241832747","msgId":44782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxRUMzN0RELTc5MDgtNDcxNS05M0ZDLTFBQzYzM0E1QjIxMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDVGMjg0QTAzRDUyNTQ3NUY4M0Y3RDRGRjk3NzBBNjM0QFJvYnluUEM+","referencesHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPiA8NUYyODRBMDNENTI1NDc1RjgzRjdENEZGOTc3MEE2MzRAUm9ieW5QQz4="},"prevInTopic":44779,"nextInTopic":0,"prevInTime":44781,"nextInTime":44783,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"-=-That is like saying she would decide to breath. To be sure there are moments when she plays at holding her breath for some game or swimming, but in living","messageBody":"<div id=\"ygrps-yiv-188986248\">-=-That is like saying she would &quot;decide&quot; to breath. To be sure there  <br/>\nare<br/>\nmoments when she plays at holding her breath for some game or  <br/>\nswimming, but<br/>\nin living her life most of the time she just breathes.-=-<br/>\n<br/>\nThat&#39;s her deciding NOT to breathe.  For fun, or for a challenge.    <br/>\nBut when it comes down to it, if she can breathe she will.<br/>\n<br/>\nLast July 24 several families got in on a goof project not to learn.   <br/>\nOne whole day, learning nothing.   That was a FUN way to see whether  <br/>\npeople could decide to learn!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241827061","msgId":44779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2YTQ0ZWUzZjVjNzI2NDhmZGQwZjcwYjYyY2M4M2ZiQGdtYWlsLmNvbT4=","inReplyToHeader":"PDRBMDRCNjI0LjgwNjA1MDVAbWFjLmNvbT4=","referencesHeader":"PGd1MjA2cStxbmNrQGVHcm91cHMuY29tPiA8NEEwNEI2MjQuODA2MDUwNUBtYWMuY29tPg=="},"prevInTopic":44777,"nextInTopic":44782,"prevInTime":44778,"nextInTime":44780,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"... you mention. It s certainly not that I want to convert other people to being anything other than they are. I m here and talking about what I am because I","messageBody":"<div id=\"ygrps-yiv-2022136255\"><blockquote><span title=\"ireply\">&gt;&gt;Well, actually I would be interested to hear about the other lists <br/>\n </span></blockquote>you mention. It&#39;s certainly not that I want to convert other people to <br/>\nbeing anything other than they are. I&#39;m here and talking about what I <br/>\nam because I actually do unschooling, and try to do it in my life as a <br/>\nwhole, not only in my family.&lt;&lt;<br/>\n<br/>\nTry Freethinking Unschoolers.  Search in Yahoo groups.  I was on there <br/>\nfor a short while a long long time ago.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241824057","msgId":44777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVGMjg0QTAzRDUyNTQ3NUY4M0Y3RDRGRjk3NzBBNjM0QFJvYnluUEM+","inReplyToHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg=="},"prevInTopic":44776,"nextInTopic":44779,"prevInTime":44776,"nextInTime":44778,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":" I hope you didn t get the idea that this is","messageBody":"<div id=\"ygrps-yiv-618923782\">&lt;&lt;&lt;&lt; I find it very difficult to understand why anyone would apply their <br/>\nprinciples to only PART of their life.&gt;&gt;&gt;<br/>\n<br/>\nI hope you didn&#39;t get the idea that this is recommended here. My experience <br/>\nwith this list is encouragment to do the opposite.<br/>\n<br/>\n&lt;&lt;&lt;&lt; One way of putting into words the principle that inspires my <br/>\ninvolvement in unschooling is &quot;power over oneself&quot; (combined, and I hope <br/>\nthis goes without saying, with &quot;respect for others&quot;.) &gt;&gt;&gt;<br/>\n<br/>\nWell I don&#39;t think it does go without saying. The combination of the two <br/>\nconcepts makes all the difference.<br/>\n<br/>\nSandra and others have talked about where the word and idea of &quot;power&quot; in <br/>\nitself could be leading down a path that can make unschooling harder, almost <br/>\nlike a tangent to unschooling. I think I, and maybe more of us here, <br/>\nunderstand what you mean by &quot;power over oneself&quot;. It&#39;s a bit like the word <br/>\n&quot;autonomy&quot; discussion so recently canvassed here. You might like to look at <br/>\nthe archives for that. However if our word choices effect our thinking and <br/>\nour communication with others, sometimes it&#39;s better to just let go of a <br/>\nword that might be limiting.<br/>\n<br/>\nPersonally I believe by continuing to be attached to the idea of power - <br/>\npreserving personal power, giving power to our children, worrying or <br/>\nreacting to the perceived or real power that governmental authorities have <br/>\nover us, looking at relationships in terms of power - continues to keep all <br/>\nkinds of opportunities for conflict in our mindset. By talking to your <br/>\nchildren about &quot;power over oneself&quot; that continues to keep the idea alive <br/>\nthat they should or must be on the alert for the nebulous or the corporeal <br/>\nforces waiting to take it away. It keeps everyone living in a state of <br/>\ndefensiveness.<br/>\n<br/>\nThat feeling that power must be preserved and protected imbues the &quot;respect <br/>\nfor others&quot; side of the coin with an &quot;as long as they aren&#39;t trying to <br/>\ndisempower me&quot; mindset. At least that is what I am seeing could happen. By <br/>\nfocussing on power, instead of relationships, and preserving power as the <br/>\npriority insted of community and the family team, the danger is that you end <br/>\nup with &quot;you can&#39;t tell me what to do&quot; being said.<br/>\n<br/>\nI understand the attraction of offering our children &quot;power over oneself&quot;. <br/>\nBut having been through that thinking and out the other side, I have learnt <br/>\nthat keeping any notion of power, even good power, in the thinking <br/>\neventually leads to the ideas of power struggle and resentment over who has <br/>\npower in the relationship. This kind of thinking had me on an unpleasant <br/>\nstroll down bad childhood memory lane with all the knee jerk emotional <br/>\nreactions that old tapes can cause. Keeping my focus on &quot;making concious <br/>\nchoices now&quot; is better.<br/>\n<br/>\n&lt;&lt;&lt;&lt; the power to decide what to learn, how to learn, and when to learn it <br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>This is where I see a fundamental schism between different definitions of <br/>\nunschooling. Everything that I see from the stories of other long time <br/>\nunschoolers whose kids are now grown, from the stories of folks with kids <br/>\nthe same age as mine, and most importantly from closely observing my own <br/>\ndaughter is that she never, NEVER, has any reason to *decide* what, how or <br/>\nwhen to learn anything.<br/>\n<br/>\nThat is like saying she would &quot;decide&quot; to breath. To be sure there are <br/>\nmoments when she plays at holding her breath for some game or swimming, but <br/>\nin living her life most of the time she just breathes. In living her life <br/>\nand engaging in her passions she just learns.<br/>\n<br/>\nAutomatically, naturally, inevitably.<br/>\n<br/>\nWhat I do, and her father does, is help her *do* what she likes to. Provide <br/>\nthe space, the money (as much as possible), the time, the rides, the <br/>\nresources, the other people that *she* judges will help her do what she <br/>\nlikes to. This includes everything from arranging playdates to joining the <br/>\nYMCA for the swimming pool, to staying up late with her, to recording her <br/>\nfavorite tv shows, to listening to her stories, to reading aloud (she said <br/>\nshe wants me to read her books to her a couple of times so that it will be <br/>\neasier for her when she reads them for herself next time - her spontaneous <br/>\ncomment.)<br/>\n<br/>\nI would argue that she has no power to decide what to learn because learning <br/>\nis a natural biological process. It will happen. Nor can it be pushed or <br/>\nhurried. Many people have told stories of their kids being frustrated with <br/>\nthemselves because they want to read, but can&#39;t yet developmentally.<br/>\n<br/>\nTherefore I think you are using the word &quot;learn&quot; here as a synonym for <br/>\n&quot;study&quot;. Your kids are very young. I think if you move more towards the idea <br/>\nof helping them do what they enjoy, without adding your own value judgment <br/>\nto it, you will find that they learn plenty.<br/>\n<br/>\n&lt;&lt;&lt;&lt; If we are to live by the principle of &quot;power over oneself&quot; then this is <br/>\na most impertinent question. It makes no difference in principle whether the <br/>\nstranger who asks the question is a nosy neighbour or an agent of the <br/>\nstate;&gt;&gt;&gt;<br/>\n<br/>\nIt makes an enormous difference.<br/>\n<br/>\nJust like it makes a difference if the person asking you a health question <br/>\nis a nosy neighbor or your doctor.<br/>\n<br/>\nYou mentioned having &lt;&lt;&lt;complete power over our children, as long as we <br/>\nstick within the law&gt;&gt;&gt; Legal questions from police officers about the <br/>\nlegality of an activity are not impertinent. No-one gets to say that they <br/>\nhave power over themselves and it trumps the law.<br/>\n<br/>\nIn this country, the USA we have the right to remain silent, and choose not <br/>\nto incriminate oneself. It&#39;s the Fifth Amendment to the constitution. <br/>\nHowever that is not the same as saying, &quot;none of your business&quot;. Once the <br/>\npolice have a warrant or probable cause (in this original party case the <br/>\ncomplaints about noise) it has legally become their business.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241822756","msgId":44776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMDRCNjI0LjgwNjA1MDVAbWFjLmNvbT4=","inReplyToHeader":"PGd1MjA2cStxbmNrQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MjA2cStxbmNrQGVHcm91cHMuY29tPg=="},"prevInTopic":44774,"nextInTopic":44777,"prevInTime":44775,"nextInTime":44777,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"... You said it, not me. You wrote at length about power - you said that is what unschooling is all about and that politics is really about power and","messageBody":"<div id=\"ygrps-yiv-900513953\">On 5/8/2009 12:12 PM, Robert Alcock wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; &gt;  <br/>\n&gt;&gt; &gt;  Some people, like Robert, unschool their kids as a political<br/>\n&gt;&gt; &gt;  position/statement/act.<br/>\n&gt;&gt;      <br/>\n&gt;<br/>\n&gt; Sorry, but you&#39;re jumping to conclusions and this one is dead wrong, which says a fair bit about your prejudices about me.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>You said it, not me. You wrote at length about power - you said that is <br/>\nwhat unschooling is all about and that politics is really about power <br/>\nand therefore, &quot;unschooling is political, by definition.&quot; Your words, <br/>\nnot mine.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;<br/>\n<br/>\n </span></blockquote>I suppose that any activity that takes us away from our children could be construed as putting our own philosophy above the interests of our children.&gt;&gt;<br/>\n<br/>\nEncouraging our children to lie because we think the law is wrong, that is what I mean by putting our cause above the interests of our children. All your talk is about the law being wrong, but not about what the child is learning or feeling or about the relationship between the child and the parents or other people, etc.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;  Like spending our time getting into arguments on the internet, for instance... and I am wondering whether this discussion is worth continuing, if people are this prejudiced about what I&#39;m saying.&gt;&gt;<br/>\n<br/>\n </span></blockquote>So - twice you&#39;ve said I&#39;m prejudiced against you. Based on what, do you think? I&#39;m going by what you write here - nothing else to go on. That&#39;s not prejudice, even if I&#39;m misunderstanding.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n </span></blockquote>Well, actually I would be interested to hear about the other lists you mention. It&#39;s certainly not that I want to convert other people to being anything other than they are. I&#39;m here and talking about what I am because I actually do unschooling, and try to do it in my life as a whole, not only in my family.&lt;&lt;<br/>\n<br/>\nLook for HEM or AHA yahoogroups lists. I&#39;m not sure which ones are currently active, but the people on those lists tend to get off into politics a whole lot.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241820033","msgId":44774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1MmE3NDFmY2U4ZTg1Yjk4ZmY3YTcxOGEyNTM5Zjk4QGdtYWlsLmNvbT4=","inReplyToHeader":"PGd1MXJmcSthY2htQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MXJmcSthY2htQGVHcm91cHMuY29tPg=="},"prevInTopic":44773,"nextInTopic":44776,"prevInTime":44773,"nextInTime":44775,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"... into words. Not the only way, not necessarily the best way - just the best that occurs to me at the moment. You say tomato... ","messageBody":"<div id=\"ygrps-yiv-810732163\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; &quot;Power over oneself&quot; is only one way of putting this principle <br/>\n </span></blockquote>into words. Not the only way, not necessarily the best way - just the <br/>\nbest that occurs to me at the moment. You say tomato... &lt;&lt;&lt;&lt;<br/>\n<br/>\nMany parents come to unschooling and find that first they may want to <br/>\nlearn how to share power with their children.  The point of calling it <br/>\npartnering with our children is that focusing on getting power from the <br/>\nstate is a whole other issue that we as adults may indirectly influence <br/>\nthrough lobbying, voting and things like that (however that works out <br/>\nin Spain and elsewhere).  Probably a major difficulty in coming to <br/>\nunschooling is just that: figuring out which choices to allow our <br/>\nchildren to exercise within the protection of the family so that they <br/>\ndon&#39;t experience the most difficult results of their decision making <br/>\nright when they&#39;re just learning how to make decisions.  Children may <br/>\nnot necessarily value &quot;power over themselves&quot; so much as being able to <br/>\nrely on the people in their family for help in growing up, especially <br/>\ntheir parents.<br/>\n<br/>\nThe responsibility to obey laws is not transferable to children but <br/>\ngiven to adults.  Unschooling may have some effect on the law at some <br/>\npoint but I don&#39;t look for it and it&#39;s not my personal goal because, <br/>\nfor the most part, I haven&#39;t found myself in disagreement with the law <br/>\nwhere it pertains to me.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":159730175,"authorName":"Robert Alcock","from":"&quot;Robert Alcock&quot; &lt;ralcock@...&gt;","profile":"robertalcock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241819458","msgId":44773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1MjlnMitkZHJ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PERGQkM5QzhBLTgxNEEtNDEwOC1BMjcwLTUzNzhDRTBBNEM0QkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":44772,"nextInTopic":44774,"prevInTime":44772,"nextInTime":44774,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"... Excuse me, but I was trying to be as courteous as is possible when people start saying things like I unschool my children for political reasons when they","messageBody":"<div id=\"ygrps-yiv-307074315\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-Thanks for the welcome, anyway. (Does that mean I&#39;m off moderation  <br/>\n&gt; again?)-=-<br/>\n&gt; <br/>\n&gt; You&#39;ll be on moderation until you leave or you&#39;re out the trapdoor or  <br/>\n&gt; your posts start to be courteous and about unschooling.   The one in  <br/>\n&gt; which you tell Pam Sorooshian she&#39;s dead wrong is in the queue.  I&#39;m  <br/>\n&gt; going to let her decide whether to let that one through or not.<br/>\n<br/>\n </span></blockquote>Excuse me, but I was trying to be as courteous as is possible when people start saying things like I &quot;unschool my children for political reasons&quot; when they don&#39;t know a thing about my motives for doing so. Telling someone they&#39;re wrong, when they are, isn&#39;t discourteous. <br/>\n<br/>\nIf on top of that my responses to such allegations are going to be censored because I&#39;m not &quot;courteous&quot; enough, then, what can I say? It&#39;s not the kind of welcome I usually like to receive.<br/>\n<br/>\nAs for not writing about unschooling, in the present topic I&#39;m talking about what it&#39;s permissible to talk about on this list, and it is marked &quot;Off topic&quot;. <br/>\n<br/>\nThe reason I&#39;m asking is, quite frankly, that I think it&#39;s a waste of my time posting to a list where the decision about what counts as &quot;unschooling&quot; is made arbitrarily according to rules that I don&#39;t really understand. I mean, what part of &quot;Always Learning&quot; is it that I&#39;m not getting? Don&#39;t the wider implications of unschooling count as relevant?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-But I think that a life totally centred on the relationship between  <br/>\n&gt; children and parent/s within a nuclear family is not that good,  <br/>\n&gt; either. I want to have a bigger life (I guess I wasn&#39;t born just to  <br/>\n&gt; have children!)-=-<br/>\n&gt; <br/>\n&gt; You seem to be suggesting that there are people here who were born to  <br/>\n&gt; do nothing but have children and they have no bigger life than their  <br/>\n&gt; own families. <br/>\n<br/>\n </span></blockquote>No, I&#39;m not trying to suggest that at all. It was a rather flippant remark. As a matter of fact I don&#39;t think that anyone was born only to have children (if &quot;I was born to do X&quot; has any meaning at all, which I doubt.) But it&#39;s quite amazing what negative connotations people seem to be able to put on phrases that to me seem entirely innocent.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Either you intended to be that insulting, in which  <br/>\n&gt; case you probably shouldn&#39;t be here, or you&#39;re totally clumsy with  <br/>\n&gt; words and ideas, in which you should read much more and post much less.<br/>\n<br/>\n </span></blockquote>Definitely not the former, and I certainly hope not the latter, since writing/translation is actually my current profession (not about unschooling, as yet.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Reading more would have kept you from writing &quot;you can&#39;t ignore that  <br/>\n&gt; there is a world out there that your kids will be in when they grow  <br/>\n&gt; up.&quot;  That&#39;s in the post that might be voted off the island.<br/>\n<br/>\n </span></blockquote>You&#39;re right, that was a clumsy phrase.<br/>\n<br/>\nRobert<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241819130","msgId":44771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5NjM2QzcxLUY4OTUtNDFFQS1CQjkyLTI3NTAwQjZCMEEyQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg=="},"prevInTopic":44770,"nextInTopic":44772,"prevInTime":44770,"nextInTime":44772,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"http://sandradodd.com/ideas/consider6.html That s something I wrote in the late 1980s and was put into a collection (not just on webpages, but once on","messageBody":"<div id=\"ygrps-yiv-1281672142\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/ideas/consider6.html\">http://sandradodd.com/ideas/consider6.html</a><br/>\n<br/>\nThat&#39;s something I wrote in the late 1980s and was put into a  <br/>\ncollection (not just on webpages, but once on paper...)   It was  <br/>\nwritten in the context of the SCA, but says something I&#39;ve understood  <br/>\nabout politics for 25 years or so.<br/>\n<br/>\nAn objection to discussing politics on this list is not an indication  <br/>\nthat I&#39;m vague on what it means, or that I have no political  <br/>\npreferences of my own.   My well-considered practice of discussing  <br/>\nlearning without regard to where a person lives doesn&#39;t mean I&#39;m  <br/>\nunaware that there are differences in jurisdictions.<br/>\n<br/>\nI&#39;ve spoken at nearly 40 conferences.   There are always interpersonal  <br/>\nand regional politics involved in those situation, because there are  <br/>\nlimited resources of time and money, and people with different  <br/>\nfavorite interests.   There are politics in and around the creation of  <br/>\nlists and other online resources.   There are motives and purposes and  <br/>\npreferences.   There doesn&#39;t need to be drama and intrigue, though,  <br/>\nwhen people are honest and want to help children and parents more than  <br/>\nthey want to help themselves.<br/>\n<br/>\nAs to ideas like &quot;just rhetoric&quot; or &quot;just semantics&quot; (quoting from  <br/>\nmany prior discussions, not from this particular one), there is  <br/>\npersuasion used to help people understand unschooling, and then  <br/>\nthere&#39;s argumentative posturing designed to make the writer seem  <br/>\nclever or powerful.<br/>\n<br/>\nAnd as to semantics, because we&#39;re dealing with words, the better the  <br/>\nwriting, the easier the reading.  If ideas are fumbled or misstated,  <br/>\nit takes a LOT of people&#39;s time and energy (and I woke up this morning  <br/>\nthinking I didn&#39;t repair my misspelling of aqua, but...  sometimes  <br/>\nthere are glitches).<br/>\n<br/>\nThe idea of choices is not the same as &quot;power over oneself.&quot;   Respect  <br/>\nisn&#39;t the same as autonomy.   Teaching oneself isn&#39;t the same as  <br/>\nlearning.  Such discussions sometimes bring clarity to people who  <br/>\ndidn&#39;t even know they needed it, so I don&#39;t mind them coming around  <br/>\n(and coming around again later, and then...  eventually we start  <br/>\ngiving people webpages of previous good parts).<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241815663","msgId":44770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERGQkM5QzhBLTgxNEEtNDEwOC1BMjcwLTUzNzhDRTBBNEM0QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1MXJmcSthY2htQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MXJmcSthY2htQGVHcm91cHMuY29tPg=="},"prevInTopic":44769,"nextInTopic":44771,"prevInTime":44769,"nextInTime":44771,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"-=-Thanks for the welcome, anyway. (Does that mean I m off moderation again?)-=- You ll be on moderation until you leave or you re out the trapdoor or your","messageBody":"<div id=\"ygrps-yiv-517467319\">-=-Thanks for the welcome, anyway. (Does that mean I&#39;m off moderation  <br/>\nagain?)-=-<br/>\n<br/>\nYou&#39;ll be on moderation until you leave or you&#39;re out the trapdoor or  <br/>\nyour posts start to be courteous and about unschooling.   The one in  <br/>\nwhich you tell Pam Sorooshian she&#39;s dead wrong is in the queue.  I&#39;m  <br/>\ngoing to let her decide whether to let that one through or not.<br/>\n<br/>\n-=-But I think that a life totally centred on the relationship between  <br/>\nchildren and parent/s within a nuclear family is not that good,  <br/>\neither. I want to have a bigger life (I guess I wasn&#39;t born just to  <br/>\nhave children!)-=-<br/>\n<br/>\nYou seem to be suggesting that there are people here who were born to  <br/>\ndo nothing but have children and they have no bigger life than their  <br/>\nown families.   Either you intended to be that insulting, in which  <br/>\ncase you probably shouldn&#39;t be here, or you&#39;re totally clumsy with  <br/>\nwords and ideas, in which you should read much more and post much less.<br/>\n<br/>\nReading more would have kept you from writing &quot;you can&#39;t ignore that  <br/>\nthere is a world out there that your kids will be in when they grow  <br/>\nup.&quot;  That&#39;s in the post that might be voted off the island.<br/>\n<br/>\nYou were either addressing Pam Sorooshian or the list.  Either way,  <br/>\nthe idea that our kids will be in the world when they grow up seems to  <br/>\nindicate you have missed the basics of unschooling as many of us have  <br/>\nbeen discussing it since before you had children.   They have never  <br/>\nbeen removed from the world.  They ARE in the world.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":159730175,"authorName":"Robert Alcock","from":"&quot;Robert Alcock&quot; &lt;ralcock@...&gt;","profile":"robertalcock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241809946","msgId":44772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1MjA2cStxbmNrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRBMDQ3OEVDLjQwNjAzMDdAbWFjLmNvbT4="},"prevInTopic":44771,"nextInTopic":44773,"prevInTime":44771,"nextInTime":44773,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"... Sorry, but you re jumping to conclusions and this one is dead wrong, which says a fair bit about your prejudices about me. Actually, I started unschooling","messageBody":"<div id=\"ygrps-yiv-596500459\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pam Sorooshian &lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; Some people, like Robert, unschool their kids as a political <br/>\n&gt; position/statement/act.<br/>\n<br/>\n </span></blockquote>Sorry, but you&#39;re jumping to conclusions and this one is dead wrong, which says a fair bit about your prejudices about me.<br/>\n<br/>\nActually, I started unschooling my kids (rather than just thinking about doing it, and trying to unschool myself, as I had for years) for what I gather to be very typical reasons: because of the confidence I felt in reading about other people&#39;s experiences on lists like this, and because I became only too aware of the damage I had done them by not starting it earlier; and because other things that were happening in my life at the time gave me the confidence to do so.<br/>\n<br/>\nIt happens that I have learned a fair bit about politics by unschooling, because nothing stirs people up like when someone who goes against the flow on principle. But I certainly didn&#39;t start because I felt like going against the system for the sake of it. I don&#39;t need more hassle in my life, and I don&#39;t need to go looking for it. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; A word of warning. What I&#39;ve seen, over the years, is that parents who <br/>\n&gt; come at this as a political act, as an issue of &quot;freedom&quot; and &quot;power,&quot; <br/>\n&gt; often end up putting their political philosophy above the interests and <br/>\n&gt; needs of their own children.<br/>\n<br/>\n </span></blockquote>I suppose that any activity that takes us away from our children could be construed as putting our own philosophy above the interests of our children. Like spending our time getting into arguments on the internet, for instance... and I am wondering whether this discussion is worth continuing, if people are this prejudiced about what I&#39;m saying.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; The  &quot;lie to cops who ask impertinent questions&quot; position is a good <br/>\n&gt; example.<br/>\n<br/>\n </span></blockquote>In the original post on this thread, I corrected myself on that, actually. I said &quot;Let the teen do what her own conscience tells her, and not judge her for either lying or telling the truth.&quot;<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Our focus on this list is on the child. Why didn&#39;t she lie? What would <br/>\n&gt; it mean to her to lie? How would it feel to her? How would she feel to <br/>\n&gt; be a person who lies? How would it change how friends and coworkers and <br/>\n&gt; family members feel about her? How would it impact her sense of self? <br/>\n<br/>\n </span></blockquote>Pretty badly I&#39;d imagine, if her family had told her &quot;it&#39;s wrong to lie - full stop,&quot; but she was forced to do it in self defense. Suppose instead of a drink and a couple of days probation, it was some illegal drug and possibly jail time? It&#39;s only a difference of degree.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How did the whole incident play out that night and in the aftermath, and <br/>\n&gt; how did a lifetime of unschooling impact that? What was the relationship <br/>\n&gt; like between parents and between parents and the child during this time <br/>\n&gt; of stress and a time when conventional parents would probably have been <br/>\n&gt; throwing blame around, feeling ashamed and angry and punitive? How was <br/>\n&gt; this different? Why?<br/>\n&gt; <br/>\n&gt; We&#39;re not interested in debating whether or not the police should have <br/>\n&gt; the right to ask the question. We&#39;re not interested in debating drinking <br/>\n&gt; age laws, much less whether there should be governments at all and what <br/>\n&gt; kind of government.<br/>\n<br/>\n </span></blockquote>No, but you can&#39;t ignore that there is a world out there that your kids will be in when they grow up<br/>\n<br/>\nNo, and I&#39;m not proposing that we do. But are you interested in living with principles in general, or only within your family?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Robert - you are thinking about things like police power and citizen <br/>\n&gt; freedoms, but we&#39;re here to talk about living an unschooling life within <br/>\n&gt; our existing (and quite varied) societal constraints, whatever they may <br/>\n&gt; be, and in families with widely divergent political, religious, and <br/>\n&gt; other belief systems. Some of us may live in communes and some in <br/>\n&gt; socialist countries and some in near-police states. The principles of <br/>\n&gt; learning that we talk about here are universal, even though our <br/>\n&gt; particular circumstances might make them more or less difficult to live by.<br/>\n&gt; <br/>\n&gt; There are other lists where people talk about politics as they see it <br/>\n&gt; related to unschooling. Why try to make this list into that? <br/>\n<br/>\n </span></blockquote>Well, actually I would be interested to hear about the other lists you mention. It&#39;s certainly not that I want to convert other people to being anything other than they are. I&#39;m here and talking about what I am because I actually do unschooling, and try to do it in my life as a whole, not only in my family.<br/>\n<br/>\nRobert</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241807084","msgId":44768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMDQ3OEVDLjQwNjAzMDdAbWFjLmNvbT4=","inReplyToHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg=="},"prevInTopic":44767,"nextInTopic":44769,"prevInTime":44767,"nextInTime":44769,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"Some people, like Robert, unschool their kids as a political position/statement/act. A word of warning. What I ve seen, over the years, is that parents who ","messageBody":"<div id=\"ygrps-yiv-1562251655\">Some people, like Robert, unschool their kids as a political <br/>\nposition/statement/act.<br/>\n<br/>\nA word of warning. What I&#39;ve seen, over the years, is that parents who <br/>\ncome at this as a political act, as an issue of &quot;freedom&quot; and &quot;power,&quot; <br/>\noften end up putting their political philosophy above the interests and <br/>\nneeds of their own children.<br/>\n<br/>\nThe  &quot;lie to cops who ask impertinent questions&quot; position is a good <br/>\nexample.<br/>\n<br/>\nOur focus on this list is on the child. Why didn&#39;t she lie? What would <br/>\nit mean to her to lie? How would it feel to her? How would she feel to <br/>\nbe a person who lies? How would it change how friends and coworkers and <br/>\nfamily members feel about her? How would it impact her sense of self? <br/>\nHow did the whole incident play out that night and in the aftermath, and <br/>\nhow did a lifetime of unschooling impact that? What was the relationship <br/>\nlike between parents and between parents and the child during this time <br/>\nof stress and a time when conventional parents would probably have been <br/>\nthrowing blame around, feeling ashamed and angry and punitive? How was <br/>\nthis different? Why?<br/>\n<br/>\nWe&#39;re not interested in debating whether or not the police should have <br/>\nthe right to ask the question. We&#39;re not interested in debating drinking <br/>\nage laws, much less whether there should be governments at all and what <br/>\nkind of government.<br/>\n<br/>\nRobert - you are thinking about things like police power and citizen <br/>\nfreedoms, but we&#39;re here to talk about living an unschooling life within <br/>\nour existing (and quite varied) societal constraints, whatever they may <br/>\nbe, and in families with widely divergent political, religious, and <br/>\nother belief systems. Some of us may live in communes and some in <br/>\nsocialist countries and some in near-police states. The principles of <br/>\nlearning that we talk about here are universal, even though our <br/>\nparticular circumstances might make them more or less difficult to live by.<br/>\n<br/>\nThere are other lists where people talk about politics as they see it <br/>\nrelated to unschooling. Why try to make this list into that? I think it <br/>\nis because that is what unschooling is, to you, a political stance, and <br/>\nyou want to talk us into the &quot;believing in&quot; your political positions. <br/>\nEvangelism. We&#39;re not interested, so that&#39;s frustrating, but also a <br/>\nchallenge. You think you&#39;re doing &quot;good&quot; by trying to persuade us. We <br/>\nthink that it would do your children good if you&#39;d stop thinking you <br/>\nalready know so much about what&#39;s good for us and, instead, read and <br/>\nponder the much more mundane real-life day-to-day kinds of issues we <br/>\ngenerally talk about here.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":159730175,"authorName":"Robert Alcock","from":"&quot;Robert Alcock&quot; &lt;ralcock@...&gt;","profile":"robertalcock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241805114","msgId":44769,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1MXJmcSthY2htQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNBNjc5OEI4LTk1OUUtNDVFQS04RTgzLUNEMDY2NzhDQTUyMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":44768,"nextInTopic":44770,"prevInTime":44768,"nextInTime":44770,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"... Agreed. But I think that a life totally centred on the relationship between children and parent/s within a nuclear family is not that good, either. I want","messageBody":"<div id=\"ygrps-yiv-640849412\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-However, my life is bigger than just me, my partner and our  <br/>\n&gt; daughters.-=-<br/>\n&gt; <br/>\n&gt; This is true of everyone, but unless unschoolers have their children  <br/>\n&gt; as a high priority, they will neglect them in favor of a bigger life,  <br/>\n&gt; and that won&#39;t be good unschooling.<br/>\n<br/>\n </span></blockquote>Agreed. But I think that a life totally centred on the relationship between children and parent/s within a nuclear family is not that good, either. I want to have a bigger life (I guess I wasn&#39;t born just to have children!), but I also want to share my life with my daughters, to the extent that they want to share it. It&#39;s a question of balance, depending on each family&#39;s situation, I guess.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-I find it very difficult to understand why anyone would apply their  <br/>\n&gt; principles to only PART of their life.-=-<br/>\n&gt; <br/>\n&gt; If you would read more, I don&#39;t think you would find an example of  <br/>\n&gt; anyone here applying their principles to only part of their life. <br/>\n<br/>\n </span></blockquote>I&#39;m not suggesting that anyone is doing that - the point is that I wouldn&#39;t know, since people only talk about unschooling here. But from what I read here and in other places, it seems like we are following similar principles, at least in our practice of unschooling. Surely we can also discuss how those principles apply to the rest of our lives? Isn&#39;t &quot;Always Learning&quot; as applicable to adults learning how to live, as it is to children?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-One way of putting into words the principle that inspires my  <br/>\n&gt; involvement in unschooling is &quot;power over oneself&quot; (combined, and I  <br/>\n&gt; hope this goes without saying, with &quot;respect for others&quot;.) -=-<br/>\n&gt; <br/>\n&gt; We don&#39;t talk about power here much, but we have given our children a  <br/>\n&gt; life of choices.  <br/>\n<br/>\n </span></blockquote>No, I realise that &quot;power&quot; is not a commonly used word here. But &quot;choice&quot; and &quot;power&quot; have a great deal in common.<br/>\n<br/>\n&quot;Power over oneself&quot; is only one way of putting this principle into words. Not the only way, not necessarily the best way - just the best that occurs to me at the moment. You say tomato... <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; They don&#39;t need  <br/>\n&gt; power over themselves.  They need to BE themselves.<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n<br/>\n </span></blockquote>But they can&#39;t do that when someone else (teacher, parent) has power over them and wants them to become what THEY want them to be (a doctor, a lawyer...). That&#39;s what I&#39;m getting at. Perhaps someone can put it in a better way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-For me, the difference between unschooling and conventional  <br/>\n&gt; schooling/parenting is that in conventional schooling or parenting the  <br/>\n&gt; child is expected to submit to the authority of the parent or teacher,  <br/>\n&gt; whereas in unschooling we seek above all to give the child _power over  <br/>\n&gt; herself_ - the power to decide what to learn, how to learn, and when  <br/>\n&gt; to learn it, but also (in a more radical form of unschooling) what to  <br/>\n&gt; eat and when, when to sleep and how much, and so on. I hope everyone  <br/>\n&gt; is with me so far.-=-<br/>\n&gt; <br/>\n&gt; If by &quot;with you&quot; you mean &quot;understood English,&quot; no problem.<br/>\n&gt; If by &quot;with you&quot; you mean agree with it all, perhaps some will and  <br/>\n&gt; surely some won&#39;t.<br/>\n<br/>\n </span></blockquote>That is what I am interested in finding out!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &quot;The power to decide what to learn&quot; makes a pretzel of the straight  <br/>\n&gt; line between experience and knowing.<br/>\n<br/>\n </span></blockquote>OK, good point. People may decide what to do, what to investigate, but they can&#39;t decide what they will learn - that just comes.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My children don&#39;t &quot;decide what to learn, how to learn, and when to  <br/>\n&gt; learn it.&quot;  They learn all the time.  They learn from dreams, from  <br/>\n&gt; eating, from walking, from singing, from conversations, from watching  <br/>\n&gt; plants grow and storms roll.   They learn from movies, books,  <br/>\n&gt; websites, and asking questions.    They eat when they&#39;re hungry (when  <br/>\n&gt; possible or convenient; I&#39;m making a lunch for Holly to take to work  <br/>\n&gt; today as she&#39;s working in the flowershop for eight or nine hours, as  <br/>\n&gt; Mother&#39;s Day is Sunday here.  They sleep when they&#39;re tired, unless  <br/>\n&gt; there&#39;s something they&#39;d rather do that&#39;s worth staying awake for.   <br/>\n&gt; They don&#39;t always &quot;decide&quot; when to wake up.  They wake up when they&#39;re  <br/>\n&gt; through sleeping, or when the alarm goes off if they&#39;ve chosen to get  <br/>\n&gt; up early, or when I come and wake them up if they&#39;ve left me a note.<br/>\n<br/>\n </span></blockquote>Yes. Whereas children who have to get up and go to school, and whose parents make them go to bed the night before, do not have the power to make that sort of choices, or decisions, or whatever you prefer to call them. Children who are forced to sit in class do not have the power to choose to sing, walk, watch a movie or have a conversation.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-If we are to live by the principle of &quot;power over oneself&quot; then  <br/>\n&gt; this is a most impertinent question. It makes no difference in  <br/>\n&gt; principle whether the stranger who asks the question is a nosy  <br/>\n&gt; neighbour or an agent of the state; nor whether the question is posed  <br/>\n&gt; in a rude or a friendly way. The proper answer is &quot;none of your  <br/>\n&gt; business&quot;, although it may not be the most tactful one. -=-<br/>\n&gt; <br/>\n&gt; &quot;Proper&quot; is not a good word to use there.  It might be your preferred  <br/>\n&gt; answer.   When you say &quot;If we are to live by...&quot; I don&#39;t know whether  <br/>\n&gt; you mean to co-opt the flighty will of any who read your words, or  <br/>\n&gt; whether you mean your family.   As the idea of &quot;power over oneself&quot;  <br/>\n&gt; isn&#39;t one I use at my house, the paragraph wasn&#39;t of value to me. <br/>\n<br/>\n </span></blockquote>I wouldn&#39;t expect it to be an idea that you use at your house, since I only just came up with that particular phrase, as a way of expressing ideas that I&#39;ve been thinking about for a long time. (Incidentally, do you use different ideas at your house than you use elsewhere?) And the suggestion that I want to co-opt someone else&#39;s will is quite absurd, since I&#39;m clearly talking about exactly the opposite of having your will co-opted. I don&#39;t mean my family, either, since they each have their own conscience and I have mine.<br/>\n<br/>\nWhat I&#39;m intending by saying &quot;if we follow the principle...&quot; is that the reader will go along with my train of thought far enough to think about whether they agree with what I&#39;m saying. Of course, a reader who rejects out of hand the principle of having power over themselves (rather than, for instance, considering it provisionally as an admittedly imperfect way of saying something that they might or might not agree with) is not going to go along with me at all.<br/>\n<br/>\nPerhaps I shouldn&#39;t have said &quot;the proper answer.&quot; It is certainly the one that springs to my mind when a person asks me an impertinent question. But I&#39;m not usually very tactful.<br/>\n<br/>\n My  <br/>\n<blockquote><span title=\"ireply\"> &gt; children ARE tactful, and they&#39;re friendly, and they are not  <br/>\n&gt; impertinent.   So far this has served them very well.  If they decide  <br/>\n&gt; it&#39;s not, they can change course.<br/>\n<br/>\n </span></blockquote>I&#39;m not sure what this has to do with what I said.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-(Last week I posted that I would &quot;advise a teenager in this  <br/>\n&gt; situation to lie.&quot; I now think I was wrong to say that, and instead I  <br/>\n&gt; would advise her to follow her own conscience, and that I would not  <br/>\n&gt; judge her for either lying or telling the truth.)-=-<br/>\n&gt; <br/>\n&gt; Thanks for reconsidering that.   Your revised position is probably  <br/>\n&gt; true of  most parents of unschooling teens, for whom it isn&#39;t a  <br/>\n&gt; theoretical future &quot;probably&quot; but is what they&#39;ve already been living,  <br/>\n&gt; with examples to share, for years.<br/>\n<br/>\n </span></blockquote>I&#39;m glad you think so. So how does that square with saying that it is wrong to lie, even in a situation like this (which numerous people on this list have said, unless I read them wrong)? Isn&#39;t that judging the teen for lying, to protect themselves from punishment for having done something that affected nobody but themselves?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-If the teenager says &quot;yes&quot;, she resigns power over herself to the  <br/>\n&gt; state, and is punished. -=-<br/>\n&gt; <br/>\n&gt; This is quite overstated.<br/>\n<br/>\n </span></blockquote>In what way? I am talking about a teenager being punished for imbibing an alcoholic beverage... not for endangering anyone else by drunk driving (as another poster suggested), or for anything else. I&#39;m not talking about the specific case of what happened to Holly, but about what might happen to any person facing punishment for a &quot;crime&quot; that affects nobody but themselves. It seems irrelevant whether the punishment is a couple of days&#39; probation or five years in jail. Punishment is punishment.<br/>\n<br/>\nOverstated how?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-Which brings me to &quot;politics&quot;. If you understand politics as being  <br/>\n&gt; about power, and unschooling to be about giving children power over  <br/>\n&gt; themselves, then unschooling is political, by definition. -=-<br/>\n&gt; <br/>\n&gt; I understand politics to be about interpersonal relationships.<br/>\n<br/>\n </span></blockquote>In that case, of course unschooling is political.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-When people talk about &quot;politics&quot; they typically mean party  <br/>\n&gt; politics and government - which is really a matter of who has power  <br/>\n&gt; over whom, and what they make them do-=-<br/>\n&gt; <br/>\n&gt; This isn&#39;t a very good definition of politics. It might be common, but  <br/>\n&gt; it&#39;s not very philosophical or practical.<br/>\n<br/>\n </span></blockquote>Did it seem as if I was putting it forward as a good definition?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; -=-When people say &quot;let&#39;s not talk about politics,&quot; what they usually  <br/>\n&gt; mean is &quot;let&#39;s not question our obedience to those in positions of  <br/>\n&gt; authority.&quot;-=-<br/>\n&gt; <br/>\n&gt; This is rhetoric and nonsense.   <br/>\n<br/>\n </span></blockquote>It&#39;s certainly rhetoric, but I would disagree that it is nonsense.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And what is usually meant (or rather  <br/>\n&gt; what you wish us to accept that you believe is usually meant) has  <br/>\n&gt; nothing to do with this list nor with unschooling.<br/>\n<br/>\n </span></blockquote>I do actually think that is what is usually meant. Or maybe better, &quot;If we don&#39;t talk about politics then perhaps it will go away.&quot; However, it won&#39;t. As Marcus Aurelius (I think) said, &quot;Those who don&#39;t take an interest in politics often find that politics takes an interest in them.&quot; We live in interesting times, that is certain.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; As to this list when I say, as list owner, &quot;let&#39;s not talk about  <br/>\n&gt; politics,&quot; I  mean I don&#39;t want to mix the principles of natural  <br/>\n&gt; learning up with discussions of local homeschooling laws or who is or  <br/>\n&gt; should be in charge of any governmental agency in any nation  <br/>\n&gt; represented on the list, nor discuss the push and shove of HSLDA and  <br/>\n&gt; their increasingly international activities, nor argue about  <br/>\n&gt; reproductive choices, nor ask people to declare their religious  <br/>\n&gt; beliefs, nor twist the discussion toward ecology or divide people into  <br/>\n&gt; pro-wolves-run-wild unschoolers and let-ranchers-protect-cattle  <br/>\n&gt; unschoolers.<br/>\n<br/>\n </span></blockquote>Indeed. There are certainly many things in politics which are entirely irrelevant to unschooling, and many others that are not relevant to most people on the list. For that matter, a great many things on this and other unschooling lists are irrelevant to certain subgroups of unschoolers, such as those living outside North America, or unschooling fathers, or parents with young children only (all categories I fall into).<br/>\n<br/>\nBut discussing the principles underlying unschooling, and how to apply those principles both inside and outside our families? Is that irrelevant?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; You&#39;re welcome to stay, but  <br/>\n&gt; you&#39;re not welcome to change my intentions.<br/>\n<br/>\n </span></blockquote>Only you can do that, of course, but I hope I am allowed to make reasonable suggestions. Thanks for the welcome, anyway. (Does that mean I&#39;m off moderation again?)<br/>\n<br/>\nI hope nobody is offended by my arguments. The fact that I am still here arguing (despite a frankly hostile reception to some of the things I have said) is sincerely meant as a compliment to the list and some of the people on it. You have influenced me quite dramatically over the past 2 1/2 years, and my family and I have a lot to thank you for.<br/>\n<br/>\nRobert</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241803377","msgId":44767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcyOTAwMi4zODc2MC5xbUB3ZWI4NjIwNy5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg=="},"prevInTopic":44766,"nextInTopic":44768,"prevInTime":44766,"nextInTime":44768,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"... schooling/parenting is that in conventional schooling or parenting the child is expected to submit to the authority of the parent or teacher, whereas in","messageBody":"<div id=\"ygrps-yiv-1660182590\"><blockquote><span title=\"ireply\">&gt;For me, the difference between unschooling and conventional<br/>\n </span></blockquote>schooling/parenting is that in conventional schooling or parenting the<br/>\nchild is expected to submit &gt;to the authority of the parent or teacher,<br/>\nwhereas in unschooling we seek above all to give the child _power over<br/>\nherself_ - the power to decide what to learn, &gt;how to learn, and when to<br/>\nlearn it, but also (in a more radical form of unschooling) what to eat<br/>\nand when, when to sleep and how much, and so on. I hope &gt;everyone is<br/>\nwith me so far.<br/>\n<br/>\nI think some of the difference for me between what you are writing and what I understand about unschooling is the issue of power. I don&#39;t believe I have ever sought above all to give Simon or Linnaea power over themselves. Much of the power that they do have over their lives is because I protect them and because I give it to them, but that power has been more of a secondary effect of working to have a peaceful relationship with them. Unschooling is about trust for me. I trust that learning happens all the time, I trust that Simon&#39;s and Linnaea&#39;s interests are valuable and so I help to facilitate for those interests. The fact that I chose not to put them in school was about not thinking Simon was ready for school and not about power. It was about not wanting to be separated from him when he was 4 and then again when he was 5. It was mutual. It wasn&#39;t power, it was Simon, it wasn&#39;t bigger than us, it was us. <br/>\n<br/>\nUnschooling is a very personal thing to me. It isn&#39;t about bigger things, it isn&#39;t about making the world a better place, it isn&#39;t about bigger things than Simon and Linnaea and David and me. That&#39;s it. And that&#39;s a lot. And it becomes bigger in that ripple effect way, but it begins with us, here and now. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241802600","msgId":44766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0N0QxOTkwLTMzMzctNEU1MC04MzJBLTRDM0Y5NzIzNUU4NkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg=="},"prevInTopic":44763,"nextInTopic":44767,"prevInTime":44765,"nextInTime":44767,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"... I think it can look like that, but making that the goal is confusing and potentially damaging, even without the above all (which I think would be a","messageBody":"<div id=\"ygrps-yiv-1130202720\">On May 8, 2009, at 7:55 AM, Robert Alcock wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; whereas in unschooling we seek above all to give the child _power  <br/>\n&gt; over herself_ - the power to decide what to learn, how to learn,  <br/>\n&gt; and when to learn it, but also (in a more radical form of  <br/>\n&gt; unschooling) what to eat and when, when to sleep and how much, and  <br/>\n&gt; so on.<br/>\n<br/>\n </span></blockquote>I think it can look like that, but making that the goal is confusing  <br/>\nand potentially damaging, even without the &quot;above all&quot; (which I think  <br/>\nwould be a recipe for very anti-social kids).<br/>\n<br/>\nClearer is to see our goal as helping them find safe and respectful  <br/>\nways to meet their needs. It not only grows our relationship with  <br/>\nthem: they see us as someone who wants to help them. But they&#39;re  <br/>\nimmersed in the process of finding ways to meet needs while also  <br/>\nbeing respectful of others.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So we can choose to yield that power to the children themselves<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We could choose that but I wouldn&#39;t advise it. That&#39;s an idea that  <br/>\nhas kids up making noise at 2 AM when others are trying to sleep and  <br/>\nparents who can&#39;t figure out what they did wrong or how to correct it.<br/>\n<br/>\nThere&#39;s too much focus in your ideas on power. It&#39;s more helpful for  <br/>\npeople trying to get unschooling to focus on partnerships, not power.<br/>\n<br/>\nIt&#39;s very helpful in the process of thinking about unschooling to be  <br/>\naware of power. A parent who is worried that unschooling doesn&#39;t look  <br/>\nlike school but is putting on a happy face trying to promote  <br/>\nunschooling because it sounds good, is wielding a great deal of power  <br/>\nwithout realizing it just because the child inherently trusts the  <br/>\nparent. And if the parent is worried, that has enormous power over  <br/>\nthe child&#39;s choices.<br/>\n<br/>\nThere are other aspects of power it&#39;s useful to be aware of.<br/>\n<br/>\nBut for the purposes of getting and practicing unschooling, it&#39;s far  <br/>\nmore useful to focus on relationships, not power.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This may seem a trivial situation - but I think it was a good one  <br/>\n&gt; to discuss because it falls just on the boundary between  <br/>\n&gt; unschooling and adult life. If we try and live adult life by the  <br/>\n&gt; principles that inspire unschooling (which I&#39;ve tried to summarise  <br/>\n&gt; as &quot;power over oneself&quot;), we are continuously going to run up  <br/>\n&gt; against people who want to have power over us - whether they are  <br/>\n&gt; our neighbours or those in positions of authority.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>And the focus on power is leading down that thought path.<br/>\n<br/>\nUnschooling is about helping our kids learn and explore what  <br/>\ninterests them. Creating a peaceful home will make that a lot easier.  <br/>\nIt&#39;s not easy helping our kids learn when we&#39;re fretting over chores  <br/>\nand family rules and so forth.<br/>\n<br/>\nUnschoolers aren&#39;t working toward autonomy or power over self. Those  <br/>\nmight be useful ideas in some situations, but as overarching  <br/>\nprinciples for unschooling, they&#39;ll lead parents down paths that take  <br/>\nthem away from unschooling.<br/>\n<br/>\nThat&#39;s vague, I know. (Real examples are more helpful.) But if &quot;power  <br/>\nover oneself&quot; is written large as a principle for unschoolers, they  <br/>\nwon&#39;t see what they&#39;ve done wrong when a child is persuing their  <br/>\nneeds but trampling all over other people to get them done. There  <br/>\nisn&#39;t any guidance in that principle to help the kids exist  <br/>\npeacefully in society with others.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If you understand politics as being about power, and unschooling to  <br/>\n&gt; be about giving children power over themselves, then unschooling is  <br/>\n&gt; political, by definition.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>And if you don&#39;t, then it&#39;s not! ;-)<br/>\n<br/>\nIt&#39;s about helping them learn and be and meet their needs -- live --  <br/>\nin ways that are respectful of others.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So, with regard to this group, I would suggest that we don&#39;t limit  <br/>\n&gt; ourselves to applying our unschooling principles purely within the  <br/>\n&gt; nuclear family, nor our discussions to that context, either.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>We? There is no we. It&#39;s Sandra&#39;s list!<br/>\n<br/>\nI&#39;m not seeing how a discussion of whether a child should or should  <br/>\nnot admit to drinking to a police officer as helping a new unschooler  <br/>\nlet go of worry over math and what to do about the markers being used  <br/>\non the wall.<br/>\n<br/>\nWhile that may seem mundane, it&#39;s the foundation of creating an  <br/>\nunschooling environment where kids can explore what interests them  <br/>\nwhich is what unschooling is.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241792754","msgId":44763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBNjc5OEI4LTk1OUUtNDVFQS04RTgzLUNEMDY2NzhDQTUyMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg=="},"prevInTopic":44761,"nextInTopic":44766,"prevInTime":44762,"nextInTime":44764,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"-=-However, my life is bigger than just me, my partner and our daughters.-=- This is true of everyone, but unless unschoolers have their children as a high","messageBody":"<div id=\"ygrps-yiv-2092852250\">-=-However, my life is bigger than just me, my partner and our  <br/>\ndaughters.-=-<br/>\n<br/>\nThis is true of everyone, but unless unschoolers have their children  <br/>\nas a high priority, they will neglect them in favor of a bigger life,  <br/>\nand that won&#39;t be good unschooling.<br/>\n<br/>\n-=-I find it very difficult to understand why anyone would apply their  <br/>\nprinciples to only PART of their life.-=-<br/>\n<br/>\nIf you would read more, I don&#39;t think you would find an example of  <br/>\nanyone here applying their principles to only part of their life.   <br/>\nMaybe you don&#39;t understand why anyone would not apply YOUR principles  <br/>\nto their lives.<br/>\n<br/>\n-=-One way of putting into words the principle that inspires my  <br/>\ninvolvement in unschooling is &quot;power over oneself&quot; (combined, and I  <br/>\nhope this goes without saying, with &quot;respect for others&quot;.) -=-<br/>\n<br/>\nWe don&#39;t talk about power here much, but we have given our children a  <br/>\nlife of choices.  It&#39;s not &quot;power,&quot; it&#39;s rational thinking,  <br/>\nconsidering all sorts of factors and preferences.  They don&#39;t need  <br/>\npower over themselves.  They need to BE themselves.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n<br/>\n-=-For me, the difference between unschooling and conventional  <br/>\nschooling/parenting is that in conventional schooling or parenting the  <br/>\nchild is expected to submit to the authority of the parent or teacher,  <br/>\nwhereas in unschooling we seek above all to give the child _power over  <br/>\nherself_ - the power to decide what to learn, how to learn, and when  <br/>\nto learn it, but also (in a more radical form of unschooling) what to  <br/>\neat and when, when to sleep and how much, and so on. I hope everyone  <br/>\nis with me so far.-=-<br/>\n<br/>\nIf by &quot;with you&quot; you mean &quot;understood English,&quot; no problem.<br/>\nIf by &quot;with you&quot; you mean agree with it all, perhaps some will and  <br/>\nsurely some won&#39;t.<br/>\n<br/>\n&quot;The power to decide what to learn&quot; makes a pretzel of the straight  <br/>\nline between experience and knowing.<br/>\nMy children don&#39;t &quot;decide what to learn, how to learn, and when to  <br/>\nlearn it.&quot;  They learn all the time.  They learn from dreams, from  <br/>\neating, from walking, from singing, from conversations, from watching  <br/>\nplants grow and storms roll.   They learn from movies, books,  <br/>\nwebsites, and asking questions.    They eat when they&#39;re hungry (when  <br/>\npossible or convenient; I&#39;m making a lunch for Holly to take to work  <br/>\ntoday as she&#39;s working in the flowershop for eight or nine hours, as  <br/>\nMother&#39;s Day is Sunday here.  They sleep when they&#39;re tired, unless  <br/>\nthere&#39;s something they&#39;d rather do that&#39;s worth staying awake for.   <br/>\nThey don&#39;t always &quot;decide&quot; when to wake up.  They wake up when they&#39;re  <br/>\nthrough sleeping, or when the alarm goes off if they&#39;ve chosen to get  <br/>\nup early, or when I come and wake them up if they&#39;ve left me a note.<br/>\n<br/>\n-=-If we are to live by the principle of &quot;power over oneself&quot; then  <br/>\nthis is a most impertinent question. It makes no difference in  <br/>\nprinciple whether the stranger who asks the question is a nosy  <br/>\nneighbour or an agent of the state; nor whether the question is posed  <br/>\nin a rude or a friendly way. The proper answer is &quot;none of your  <br/>\nbusiness&quot;, although it may not be the most tactful one. -=-<br/>\n<br/>\n&quot;Proper&quot; is not a good word to use there.  It might be your preferred  <br/>\nanswer.   When you say &quot;If we are to live by...&quot; I don&#39;t know whether  <br/>\nyou mean to co-opt the flighty will of any who read your words, or  <br/>\nwhether you mean your family.   As the idea of &quot;power over oneself&quot;  <br/>\nisn&#39;t one I use at my house, the paragraph wasn&#39;t of value to me.  My  <br/>\nchildren ARE tactful, and they&#39;re friendly, and they are not  <br/>\nimpertinent.   So far this has served them very well.  If they decide  <br/>\nit&#39;s not, they can change course.<br/>\n<br/>\n-=-(Last week I posted that I would &quot;advise a teenager in this  <br/>\nsituation to lie.&quot; I now think I was wrong to say that, and instead I  <br/>\nwould advise her to follow her own conscience, and that I would not  <br/>\njudge her for either lying or telling the truth.)-=-<br/>\n<br/>\nThanks for reconsidering that.   Your revised position is probably  <br/>\ntrue of  most parents of unschooling teens, for whom it isn&#39;t a  <br/>\ntheoretical future &quot;probably&quot; but is what they&#39;ve already been living,  <br/>\nwith examples to share, for years.<br/>\n<br/>\n-=-If the teenager says &quot;yes&quot;, she resigns power over herself to the  <br/>\nstate, and is punished. -=-<br/>\n<br/>\nThis is quite overstated.<br/>\n<br/>\n-=-Which brings me to &quot;politics&quot;. If you understand politics as being  <br/>\nabout power, and unschooling to be about giving children power over  <br/>\nthemselves, then unschooling is political, by definition. -=-<br/>\n<br/>\nI understand politics to be about interpersonal relationships.<br/>\n<br/>\n-=-When people talk about &quot;politics&quot; they typically mean party  <br/>\npolitics and government - which is really a matter of who has power  <br/>\nover whom, and what they make them do-=-<br/>\n<br/>\nThis isn&#39;t a very good definition of politics. It might be common, but  <br/>\nit&#39;s not very philosophical or practical.<br/>\n<br/>\n-=-When people say &quot;let&#39;s not talk about politics,&quot; what they usually  <br/>\nmean is &quot;let&#39;s not question our obedience to those in positions of  <br/>\nauthority.&quot;-=-<br/>\n<br/>\nThis is rhetoric and nonsense.   And what is usually meant (or rather  <br/>\nwhat you wish us to accept that you believe is usually meant) has  <br/>\nnothing to do with this list nor with unschooling.<br/>\n<br/>\nAs to this list when I say, as list owner, &quot;let&#39;s not talk about  <br/>\npolitics,&quot; I  mean I don&#39;t want to mix the principles of natural  <br/>\nlearning up with discussions of local homeschooling laws or who is or  <br/>\nshould be in charge of any governmental agency in any nation  <br/>\nrepresented on the list, nor discuss the push and shove of HSLDA and  <br/>\ntheir increasingly international activities, nor argue about  <br/>\nreproductive choices, nor ask people to declare their religious  <br/>\nbeliefs, nor twist the discussion toward ecology or divide people into  <br/>\npro-wolves-run-wild unschoolers and let-ranchers-protect-cattle  <br/>\nunschoolers.<br/>\n<br/>\n-=- I can&#39;t live with a rule like that, and I find it hard to  <br/>\nunderstand how anyone can.-=-<br/>\n<br/>\nLuckily, you don&#39;t live on this list.  You&#39;re welcome to stay, but  <br/>\nyou&#39;re not welcome to change my intentions.<br/>\n<br/>\n-=-So, with regard to this group, I would suggest that we don&#39;t limit  <br/>\nourselves to applying our unschooling principles purely within the  <br/>\nnuclear family, nor our discussions to that context, either.-=-<br/>\n<br/>\nThanks for the suggestion.  The list has had a focus and purpose for  <br/>\nnearly eight years, and has over two thousand addresses on the list,  <br/>\nprobably half of which are reading and learning from it.   I assume  <br/>\nand expect that EVERYone on this list has other sources and outlets  <br/>\nfor ideas and beliefs.  Some read other lists about dogs, or mental  <br/>\nhealth, or history, or humor.   Many read current events extensively.   <br/>\nSome don&#39;t.   This list isn&#39;t intended to be everything to everyone,  <br/>\nbut a good source of the discussion of unschooling practice and  <br/>\nexperience.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"katherand@gmail.com","from":"katherand@...","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] (Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241788797","msgId":44761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGVhZDNhZTFkNWI1ZDU3NzYxMWY0Y2EwNDIwODhhMmJhQGdtYWlsLmNvbT4=","inReplyToHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg==","referencesHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg=="},"prevInTopic":44758,"nextInTopic":44763,"prevInTime":44760,"nextInTime":44762,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"... been drinking. If we are to live by the principle of power over oneself then this is a most impertinent question. It makes no difference in principle","messageBody":"<div id=\"ygrps-yiv-1058833363\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt; A teenager is &quot;stopped&quot; by the police and asked whether she has <br/>\n </span></blockquote>been drinking. If we are to live by the principle of &quot;power over <br/>\noneself&quot; then this is a most impertinent question. It makes no <br/>\ndifference in principle whether the stranger who asks the question is a <br/>\nnosy neighbour or an agent of the state; nor whether the question is <br/>\nposed in a rude or a friendly way. The proper answer is &quot;none of your <br/>\nbusiness&quot;, although it may not be the most tactful one. Other more <br/>\ntactful answers which might satisfy the neighbour would be, for <br/>\ninstance, &quot;Yes, plenty, this heat makes me very thirsty!&quot; (playing with <br/>\nthe definition of drinking). However, the policeman is not likely to be <br/>\nfobbed off with such a response. If the teenager says &quot;yes&quot;, she <br/>\nresigns power over herself to the state, and is punished. If she says <br/>\n&quot;no,&quot; she is being dishonest, but I would certainly not criticise her <br/>\nfor it. (Last week I posted that I would &quot;advise a teenager in this <br/>\nsituation to lie.&quot; I now think I was wrong to say that, and instead I <br/>\nwould advise her to follow her own conscience, and that I would not <br/>\njudge her for either lying or telling the truth.) &lt;&lt;&lt;&lt;<br/>\n<br/>\nI think the piece of the puzzle you may be missing is that much of the <br/>\nUS is heavily dependent on cars for travel.  This includes teens.  <br/>\nPoint in case, Holly drove to that party.  The police deal with a lot <br/>\nof drinking related risk behaviors, including driving under the <br/>\ninfluence.  Here in the US, driving under the influence (DUI) is an <br/>\noffense simply because of the loss of lives it incurs.  I don&#39;t know <br/>\nthe latest statistics.  Here in the US, drinking and driving results in <br/>\na lot of death and serious injury.  That&#39;s why the police officer asks <br/>\nquestions about drinking.  The point being: does this person need a <br/>\nride, are they a repeat offender who might put their own and other&#39;s <br/>\nlives in danger?<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":159730175,"authorName":"Robert Alcock","from":"&quot;Robert Alcock&quot; &lt;ralcock@...&gt;","profile":"robertalcock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"(Off topic?) Power over oneself, unschooling and &quot;politics&quot;","postDate":"1241783725","msgId":44758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd1MTZqZCttNWwyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":44761,"prevInTime":44757,"nextInTime":44759,"topicId":44758,"numMessagesInTopic":0,"msgSnippet":"This post is something of a follow up to last week s discussion under the title I ll tell this here, but not on my blog . It might be off topic; I would say","messageBody":"<div id=\"ygrps-yiv-2085006127\">This post is something of a follow up to last week&#39;s discussion under the title &quot;I&#39;ll tell this here, but not on my blog&quot;. It might be off topic; I would say it is an attempt to put the topic of unschooling in a wider context.<br/>\n<br/>\nMy awareness of and interest in unschooling goes back to, I think, 1987, when I first read &quot;Deschooling Society&quot; by Ivan Illich and &quot;Summerhill&quot; by A.S.Neill. From there, I embarked on a journey of discovery, de- / un-schooling myself and, later, my family.<br/>\n<br/>\nI&#39;ve been a member of various Unschooling discussion groups for 2 1/2 years now, which is just about the same length of time that my partner and I have been unschooling our two daughters Sofia (now 5 1/2) and Nora (3). We live in Bilbao, in the Basque country of northern Spain, where there is very little culture of unschooling. <br/>\n<br/>\nHowever, my life is bigger than just me, my partner and our daughters. I do lots of other things which I won&#39;t go into here, because you won&#39;t be interested. The point I wish to make is that the principles which inspired my unschooling also inspire the rest of my life. I find it very difficult to understand why anyone would apply their principles to only PART of their life.<br/>\n<br/>\nOne way of putting into words the principle that inspires my involvement in unschooling is &quot;power over oneself&quot; (combined, and I hope this goes without saying, with &quot;respect for others&quot;.) <br/>\n<br/>\nFor me, the difference between unschooling and conventional schooling/parenting is that in conventional schooling or parenting the child is expected to submit to the authority of the parent or teacher, whereas in unschooling we seek above all to give the child _power over herself_ - the power to decide what to learn, how to learn, and when to learn it, but also (in a more radical form of unschooling) what to eat and when, when to sleep and how much, and so on. I hope everyone is with me so far.<br/>\n<br/>\nThis much is already very challenging and incomprehensible to people who are not unschoolers. But there is nothing actually subversive about it. As parents in a Western culture, we basically have complete power over our children, as long as we stick within the law. So we can choose to yield that power to the children themselves - just as other parents (e.g. fundamentalist homeschoolers) may choose to subjugate their children totally, and as long as they remain within the law, we can do nothing about it.<br/>\n<br/>\nBut if we try to apply the same principle to other parts of life, outside the nuclear family, then it does become subversive (and, probably, off topic for this group.) The example which was discussed last week is a case in point. <br/>\n<br/>\nA teenager is &quot;stopped&quot; by the police and asked whether she has been drinking. If we are to live by the principle of &quot;power over oneself&quot; then this is a most impertinent question. It makes no difference in principle whether the stranger who asks the question is a nosy neighbour or an agent of the state; nor whether the question is posed in a rude or a friendly way. The proper answer is &quot;none of your business&quot;, although it may not be the most tactful one. Other more tactful answers which might satisfy the neighbour would be, for instance, &quot;Yes, plenty, this heat makes me very thirsty!&quot; (playing with the definition of drinking). However, the policeman is not likely to be fobbed off with such a response. If the teenager says &quot;yes&quot;, she resigns power over herself to the state, and is punished. If she says &quot;no,&quot; she is being dishonest, but I would certainly not criticise her for it. (Last week I posted that I would &quot;advise a teenager in this situation to lie.&quot; I now think I was wrong to say that, and instead I would advise her to follow her own conscience, and that I would not judge her for either lying or telling the truth.)<br/>\n<br/>\nIn my view, the most honest and brave response would be &quot;None of your business&quot;. Neither lying nor acquiescing to an impertinent request. This is the path of civil disobedience, but not many people take that path. We choose our battles.<br/>\n<br/>\nThis may seem a trivial situation - but I think it was a good one to discuss because it falls just on the boundary between unschooling and adult life. If we try and live adult life by the principles that inspire unschooling (which I&#39;ve tried to summarise as &quot;power over oneself&quot;), we are continuously going to run up against people who want to have power over us - whether they are our neighbours or those in positions of authority. <br/>\n<br/>\nWhich brings me to &quot;politics&quot;. If you understand politics as being about power, and unschooling to be about giving children power over themselves, then unschooling is political, by definition. <br/>\n<br/>\nWhen people talk about &quot;politics&quot; they typically mean party politics and government - which is really a matter of who has power over whom, and what they make them do. But the everyday matter of how we live our lives according to our principles is also political, in the sense that it is about having power over ourselves. When people say &quot;let&#39;s not talk about politics,&quot; what they usually mean is &quot;let&#39;s not question our obedience to those in positions of authority.&quot; I can&#39;t live with a rule like that, and I find it hard to understand how anyone can.<br/>\n<br/>\nSo, with regard to this group, I would suggest that we don&#39;t limit ourselves to applying our unschooling principles purely within the nuclear family, nor our discussions to that context, either.<br/>\n<br/>\nRobert</div>","specialLinks":[]}],"prevTopicId":44757,"nextTopicId":44710}}