{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"benliam@aol.com","from":"benliam@...","replyTo":"LIST","senderId":"7WVoQ077byXKJbQDxPKYn6sWY4y4f8ds_afvxu3P7ps0ikXF51hHaFXJmDIey2CIibXNzn9v","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Can i do this","postDate":"979607156","msgId":15107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxLmFiY2IxMWMuMjc5NGY4NzRAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":15106,"nextInTime":15108,"topicId":15107,"numMessagesInTopic":0,"msgSnippet":"I feel so grateful for all your thoughtful replies about the upcoming changes in my family (birth of twins, and wanting to keep my older child at home).  I ","messageBody":"<div id=\"ygrps-yiv-266165980\"><html><font FACE=\"arial,helvetica\"><font SIZE=\"3\" FAMILY=\"SERIF\" FACE=\"Book Antiqua\">I feel so grateful for all your thoughtful replies about the upcoming changes \n<br>in my family (birth of twins, and wanting to keep my older child at home). &nbsp;I \n<br>thank you all so much for the honest and helpful replies.\n<br>\n<br>My 3 year old is a spirited child and i know he would do horribly in a \n<br>preschool setting (but thank you to those who shared that arrangement worked \n<br>for them) As many of you pointed out, it is unlikely to be a positive \n<br>influence on him and the whole family when the arrival of his siblings is \n<br>coupled with being sent away. &nbsp;I don&#39;t have family nearby, and that scares \n<br>me, but i feel a mother&#39;s helper (a teen or younger) would be a good option, \n<br>and would give my son some extra attention while i am about the house. \n<br>Everyone&#39;s suggestions about good toys and supplies is appreciated too. We \n<br>already have all of them, which is a bonus. \n<br>\n<br>One of the points raised that really bolstered my view was the many reminders \n<br>of how getting a child to a &quot;program&quot; can be so time consuming and stressful, \n<br>especially with two carseats in tow. &nbsp;I had tried to explain this angle to a \n<br>friend and she said &quot;Oh, there will be people to help you, the other moms of \n<br>the preschool will help you work it out&quot;. &nbsp;While it is nice to imagine all \n<br>these helpful people out there that would watch my infants in the car while i \n<br>take my relatively unhappy child to pre-school, i fail to see how this makes \n<br>it all worthwhile!! I have rheumatoid arthritis, and watching my energy \n<br>levels and physical strain is very very key. &nbsp;Keeping things &quot;low key&quot; and \n<br>homebased has been the key to pain management so far.\n<br>\n<br>The other helpful thread for my husband and i was the fact my son will be \n<br>sharing in life with his siblings---starting with seeing parts of the birth, \n<br>then all the care required to raise children (which he can contribute to). &nbsp;\n<br>As well as being a unit study in home economics and the real work of making a \n<br>family, &nbsp;it is about valuing being together, and giving to one another above \n<br>all else (thank you to Amalia&#39;s older children&#39;s thoughts).\n<br>\n<br>I feel my instincts have been confirmed, which is a wonderful feeling!\n<br>\n<br>cath</font></font></html></div>","specialLinks":[]}],"prevTopicId":15102,"nextTopicId":15109}}