{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] need help for strewing with pure motives...","postDate":"1354765171","msgId":69735,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGNTNEQjhGLTcwMzktNDkxMS04QzRCLTM4QkU4QThBNTE0QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs5bDNtcitmb3ZxQGVHcm91cHMuY29tPg==","referencesHeader":"PGs5bDNtcitmb3ZxQGVHcm91cHMuY29tPg=="},"prevInTopic":69733,"nextInTopic":0,"prevInTime":69734,"nextInTime":69736,"topicId":69723,"numMessagesInTopic":0,"msgSnippet":"-=-EVERY fall I have been phoned by my local (not-so-unschooling friendly) gov t homeschooling liason about my plans , and fall notifications, despite being","messageBody":"<div id=\"ygrps-yiv-1627853004\">-=-EVERY fall I have been phoned by my local (not-so-unschooling friendly) gov&#39;t homeschooling liason about my &quot;plans&quot;, and fall notifications, despite being clear/specific on my forms and later my 2 progress reports, and it has made me even more nervous and aware of resources I use for my children, what I strew, etc -=-<br/>\n<br/>\nI would worry too, if I were you.  It&#39;s natural.  <br/>\nIt will lessen, this agitation, I think, as the years go by.  <br/>\n<br/>\nSometimes you might have a bout of fear, but I do think those become less frequent over time.<br/>\n<br/>\n-=-at times I cross a line into viewing everything in a school-y way or if a resource includes a school-y skill, or how would I indicate this in &quot;education-ese&quot; at evaluation time? I jot down in a notebook so I have things to recall at report time -=-<br/>\n<br/>\nI don&#39;t see any problem with that at all.<br/>\n<br/>\nThe problem would be if you told your child what you expected him to be learning, or what the intent was of what you had left o ut for him to find.<br/>\n<br/>\n-=-For example, dd (12yrs) was asking me about atoms last night based on something that came up in a vid game during the day, I recalled we had The Journey to the Center Of the Atom out from the Library and so we read it at bedtime, then I made a mental/literal note to see if she would like to go to some websites from Usbourne Quicklinks/our Usbourne science encyclopedia about it, and to see if they would like a planetarium movie I bookmarked a while back as that book touched on some things about the size of the universe, etc. Then, unfortunatley, I found myself thinking this morning that I would have very little &quot;science&quot; to report for her (reports are due this month). Sheesh....see what I mean?-=-<br/>\n<br/>\nI don&#39;t see a problem with that, either.<br/>\n<br/>\nIf you need to report, you need to report!  Don&#39;t feel bad about that.  You&#39;ll get more experience in seeing science in things that don&#39;t look like school science, too, as time goes on.<br/>\n<br/>\n-= I know I havent&#39; brought enough &quot;numeracy&quot; into our home, and then again I worry about reporting, etc. And now dd I think senses my worries, and clams up about anything number-wise.-=-<br/>\n<br/>\nYou-the-mom need to start seeing mathematics in things that don&#39;t involve numbers.  You probably have a picture of math that&#39;s very schoolish, I&#39;m guessing.    Here&#39;s a game that doesn&#39;t use numbers (other than counting to two or three, and even that&#39;s not necessary):  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Fred-Distribution-101308FRD-Bazaar-Board/dp/B005IRW0EE\">http://www.amazon.com/Fred-Distribution-101308FRD-Bazaar-Board/dp/B005IRW0EE</a>   It&#39;s called Bazaar.<br/>\n<br/>\nPatterns games, mandala art, music/rhythms.... report it without talking to your kids about it, but start looking for it everywhere.   <br/>\n<br/>\n-=- I have been ruminating on this lately, about strewing, what may make it manipulative, etc, and I really need to get to the root of this..-=-<br/>\n<br/>\nI don&#39;t think you need to &quot;get to the root of it.&quot;  I think you need to gradually relax.  See when you&#39;re nervous, and make a less-nervous-making choice.  <br/>\n<br/>\n&quot;Manipulation&quot; isn&#39;t what I would worry about.  If people say I&#39;m being manipulative because I set out the shells we found in Florida, they&#39;re really fishing for something to complain about.  Literally, I did manipulate those shells, and I manipulated the arrangement of my kitchen by putting them there.  I am NOT trying &quot;to manipulate&quot; my family or guests, but you know what?  If someone DOES &quot;take the bait&quot; and pick those up and ask about them, they get stories about the beach where Holly and I saw pelicans and cormorants, and that I accidentally caught an octopus and how exciting that was!     If they don&#39;t ask, I don&#39;t even notice.  It&#39;s a gift, it&#39;s a sharing opportunity, it&#39;s just some damned shells.   <br/>\n<br/>\n-=-I think I may know what it is, it&#39;s that I really after all these years haven&#39;t totally deschooled myself and its frustrating!-=-<br/>\n<br/>\nIf you&#39;re required to report to the government, you might never fully deschool.  Your life will have semesters and school years and grade levels.  No one here can change that for you.  Sorry.  But you can continue to approach deschooling without going to infinity on it. :-)<br/>\n<br/>\n-=-And also maybe I had/have this expectation all these years ago that unschooling would lead to someone who would have the same &quot;skills&quot; that a schooled kid would have. I am ashamed to admit this to myself! I know I need to be called out on some things and I am looking forward to discussing with you all.-=-<br/>\n<br/>\nThere are tons of skills schoolkids gain that I don&#39;t want my kids to have at all... cheating, dodging, ignoring adults, bullying other kids.<br/>\n<br/>\nIf you unschool to adulthood, your children probably WILL have the good skills they would have had, and few of the bad ones.<br/>\n<br/>\nHere&#39;s how to screw it up, though, and this list might be more helpful than anything else:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/screwitup\">http://sandradodd.com/screwitup</a><br/>\n<br/>\nKnowing what you don&#39;t want to do will help you see what TO do.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":171872689,"authorName":"Julie Finnin Day","from":"Julie Finnin Day &lt;julie@...&gt;","profile":"julipfinn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] need help for strewing with pure motives...","postDate":"1354688273","msgId":69733,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwQkVFNzExLjUwNjAzMDVAZmlubmluZGF5Lm5ldD4=","inReplyToHeader":"PGs5bDNtcitmb3ZxQGVHcm91cHMuY29tPg==","referencesHeader":"PGs5bDNtcitmb3ZxQGVHcm91cHMuY29tPg=="},"prevInTopic":69732,"nextInTopic":69735,"prevInTime":69732,"nextInTime":69734,"topicId":69723,"numMessagesInTopic":0,"msgSnippet":"... president (an unschooler herself so that helped) to liase with me in talking to them together due to the intimidation I have felt with all of this. So as","messageBody":"<div id=\"ygrps-yiv-142345713\"><blockquote><span title=\"ireply\">&gt;&gt;Once I even pulled in my provincial hs association/supoport group <br/>\n </span></blockquote>president (an unschooler herself so that helped) to liase with me in <br/>\ntalking to them together due to the intimidation I have felt with all of <br/>\nthis. So as you can guess I really do NOT want to go the ed psych route <br/>\nbecause I would not be in the &quot;take what works&quot; mindset after an <br/>\nevaluation... more like just fear/lack of faith in unschooling/doubting <br/>\nmyself.&lt;&lt;<br/>\n<br/>\nAs long as you are going to them for services, they are going to press <br/>\nyou in the ways they have decided you need to be pressed to advance your <br/>\nson&#39;s education.<br/>\n<br/>\nLike you, we were also on the &quot;early intervention&quot; radar with our <br/>\ndaughter, who has special needs. We had a physical therapist coming to <br/>\nour house weekly for a year. She played with my daughter in ways that <br/>\n*I* played with her, but she did not have a magic wand! She just did <br/>\nwhat humans do with toddlers! I realized that the system of early <br/>\nintervention isn&#39;t for *my child* per se, it is to help my child fit <br/>\ninto school -- sit at a desk, hold a pencil, get with the program, and <br/>\ncause the understaffed teachers as little disruption as possible. On top <br/>\nof it all, their &quot;services&quot; come with a lot of baggage (as you know), in <br/>\nterms of labeling children and fanning our fears. They seemed mostly to <br/>\nview her AS her disability -- really supportive!<br/>\n<br/>\nSo we decided to decline further services! I just told the therapist <br/>\nthat we were going a different route. (Actually, we took a year and <br/>\nmoved in with friends who live in the neighboring state -- out in the <br/>\nsticks, to get away from THE PROFESSIONALS! And rented our house out for <br/>\na year.) It was scary to disengage, because they do make you feel guilty <br/>\nand inadequate, but we did it anyway. By the time we moved back home, we <br/>\nwere homeschooling and have been happily living our lives ever since. We <br/>\nhave not registered with the education service district.<br/>\n<br/>\nWhat can they do to you if you just say, &quot;We are taking a break from <br/>\nservices right now and we will get in touch later [not really]&quot;, and you <br/>\njust stop making appointments? Or even say you are going a route with <br/>\nprivate service providers?<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;I share this as I really feel these two issues affecting the flow of <br/>\n </span></blockquote>our everyday unschooling lives. &lt;&lt;<br/>\n<br/>\nDo YOU trust that your children are learning what THEY need to learn in <br/>\ntheir time? If so, then writing the report might be easier. Just tell <br/>\nthe officials what they need to hear to feel OK about your kids, and be <br/>\non their way. But if you are doubting your path inwardly, then what&#39;s <br/>\nbehind that?<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt; And also maybe I had/have this expectation all these years ago that <br/>\n </span></blockquote>unschooling would lead to someone who would have the same &quot;skills&quot; that <br/>\na schooled kid would have. I am ashamed to admit this to myself!&lt;&lt;<br/>\n<br/>\nI think this is the crux of your issue :)<br/>\n<br/>\n<br/>\nJulie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":459359078,"authorName":"D. Regan","from":"&quot;D. Regan&quot; &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] need help for strewing with pure motives...","postDate":"1354680101","msgId":69732,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBRjE4RjRDLTVCMzYtNDcwMi05ODNDLTA4MTMxMzQzNDc5REBiaWdwb25kLmNvbT4=","inReplyToHeader":"PGs5bDNtcitmb3ZxQGVHcm91cHMuY29tPg==","referencesHeader":"PGs5bDNtcitmb3ZxQGVHcm91cHMuY29tPg=="},"prevInTopic":69731,"nextInTopic":69733,"prevInTime":69731,"nextInTime":69733,"topicId":69723,"numMessagesInTopic":0,"msgSnippet":"... From what you ve said, I see two separate issues being tangling up together - 1. official requirements and 2. living rich unschooling lives. 1/  You need","messageBody":"<div id=\"ygrps-yiv-442223856\">On 05/12/2012, at 2:09 AM, bragdontina wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am sharing something here that I am struggling with off and on, sometimes more than others.  It&#39;s the whole subject of strewing, and how not to be manipulative about it and have some &quot;school-think&quot; creep into it.<br/>\n<br/>\n&gt; Does anyone have any suggestions?  I want our unschooling life to just &quot;flow&quot; like it does when I manage to supress the &quot;School Think&quot;!! I want to be showing them things because it&#39;s cool and we live and learn and share together just as if I would share something with my dh (and I don&#39;t worry if it would affect his academics, or have to report on HIM, ha!) and they take from it what they will.  <br/>\n<br/>\n&gt; I would appreciate some discussion and advice. <br/>\n&gt; I think I may know what it is, it&#39;s that I really after all these years haven&#39;t totally deschooled myself and its frustrating!  And also maybe I had/have this expectation all these years ago that unschooling would lead to someone who would have the same &quot;skills&quot; that a schooled kid would have.  I am ashamed to admit this to myself! I know I need to be called out on some things and I am looking forward to discussing with you all.<br/>\n<br/>\n </span></blockquote>From what you&#39;ve said, I see two separate issues being tangling up together - 1. official requirements and 2. living rich unschooling lives.  <br/>\n<br/>\n1/  You need to find the best way for your family to meet the official requirements of your local area.  Getting in touch with people local to you who are jumping through the same official hoops will help a lot.   And then figuring out what will help your particular family meet those requirements.  It is an aspect of your children&#39;s lives that can be tackled as a family, if the requirements are not able to be fulfilled by the parents alone.  &quot;Here&#39;s the what we need to do/produce within this school year&quot; for example.  Think creatively.  Come up with options, share it all, ask for ideas - what would work best for each of them.  And then help them to achieve anything that needs to be done by them.  And do whatever you need to do for the officials.  Take as much of the load as you can, so that they can get on with living and learning. <br/>\n<br/>\n2/  Help your children&#39;s lives be as wonderful as you can.  Don&#39;t let the issue above cloud things - especially your relationships with your children.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And now dd I think senses my worries, and clams up about anything number-wise. ...<br/>\n<br/>\n<br/>\n&gt;  I have been ruminating on this lately, about strewing, what may make it manipulative, etc, and I really need to get to the root of this...<br/>\n<br/>\n </span></blockquote>Share your children&#39;s lives and interests more.  Share with them what you genuinely think will delight them.  Leave the official stuff as separate as you can.  With your example about the atoms, you could ask your daughter if she&#39;d like to tackle that as a schoolish project to meet whatever requirements you may have for the year.  She may say yes or no.  You may not have official requirements like that where you live.  It may have just been a simple question that she&#39;s only interested in a simple answer to.  it may join up with other things she&#39;s been talking about lately that point to a particular interest.  The more you&#39;re being there for them in their lives, the more simple this process will be for you.  Manipulation and &#39;clamming up&#39; do not need to come into lives shared with presence, love and clarity. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I jot down in a notebook so I have things to recall at report time (and so I remember to be involved with the kids ...<br/>\n<br/>\n </span></blockquote>It sounds like you may have been getting caught up in your thoughts and worries more than your children&#39;s lives.  Make steps towards getting to know your children more.  Be present to what&#39;s going on for them more.  Notice what delights them, what brings them down.  It may take time for you to feel at ease with being more present with them, but your relationships with them are so important to making your home a wonderful place in which to grow and learn.<br/>\n<br/>\nDebbie.</div>","specialLinks":[]},{"userId":252464818,"authorName":"Christina Daharry","from":"Christina Daharry &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: need help for strewing with pure motives...","postDate":"1354653062","msgId":69731,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTQ2NTMwNjIuODA0MjcuWWFob29NYWlsTmVvQHdlYjE2MTAwNC5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":69728,"nextInTopic":69732,"prevInTime":69730,"nextInTime":69732,"topicId":69723,"numMessagesInTopic":0,"msgSnippet":"-=Does anyone have any suggestions?  I want our unschooling life to just flow like it does when I manage to supress the School Think !!-= I have found it","messageBody":"<div id=\"ygrps-yiv-1916326602\">-=Does anyone have any suggestions?  I want our unschooling life to just <br/>\n&quot;flow&quot; like it does when I manage to supress the &quot;School Think&quot;!!-=<br/>\n<br/>\nI have found it helpful to NOT suppress.  :-)  Allow the &quot;school think&quot; to come up and find the source.  Mine is usually some fear.  When I let it arise and choose to consider it mindfully, I eventually and always get a new perspective that allows me to experience greater freedom, joy, and creativity.  <br/>\n<br/>\nChristina.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: need help for strewing with pure motives...","postDate":"1354646085","msgId":69728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs5bGZvNStrZTRzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs5bDNtcitmb3ZxQGVHcm91cHMuY29tPg=="},"prevInTopic":69723,"nextInTopic":69731,"prevInTime":69727,"nextInTime":69729,"topicId":69723,"numMessagesInTopic":0,"msgSnippet":"... ************** At ages 9 and 12, they may well Not have the same sorts of skills as kids the same age in school. My daughter could barely spell at 9, and","messageBody":"<div id=\"ygrps-yiv-1521300841\">&quot;bragdontina&quot; &lt;bragdontina@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;maybe I had/have this expectation all these years ago that unschooling would lead to someone who would have the same &quot;skills&quot; that a schooled kid would have. <br/>\n </span></blockquote>**************<br/>\n<br/>\nAt ages 9 and 12, they may well Not have the same sorts of skills as kids the same age in school. My daughter could barely spell at 9, and at 11 couldn&#39;t recite any of the multiplication table because those kinds of drills aren&#39;t useful or interesting to her. In the last year, though, her spelling had gone through an amazing transformation - most likely because she&#39;s started communicating with others on the internet and likes to be understood. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I really don&#39;t think we would manage to find one that is homeschooling let alone unschooling friendly...they operate from such a different paradigm/philosophy... and they would see how he is &quot;behind&quot; in thier academic standards<br/>\n </span></blockquote>**************<br/>\n<br/>\nWhy would it be a problem for him to be &quot;behind&quot;? I mean, would it set you up for more scrutiny, or is it more that it would be upsetting for you? I don&#39;t have to do a whole lot in the way of reporting, but this year Mo would have been tested and I wasn&#39;t interested in dealing with that, so I &quot;held her back&quot; in terms of her grade level. She doesn&#39;t know, so it has no effect on her whatsoever, other than saving her the stress of going to a testing facility and dealing with strange adults.<br/>\n<br/>\nIt may be that there aren&#39;t any useful services an educational psychologist can provide for you, though. In that case, it seems like the real issue is how to speak firmly to the professionals you&#39;re dealing with right now. Can you say &quot;thank you, happily since we&#39;re homeschooling I don&#39;t have the same sorts of problems as classroom teachers - I have the luxury of individualizing his education; it&#39;s really wonderful.&quot; <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I want to be showing them things because it&#39;s cool and we live and learn and share together just as if I would share something with my dh <br/>\n </span></blockquote>***************<br/>\n<br/>\nMaybe for awhile it would help to back off from the idea of strewing anything at all and pay more attention to what They want to share with You. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":470047657,"authorName":"bragdontina","from":"&quot;bragdontina&quot; &lt;bragdontina@...&gt;","profile":"bragdontina","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"need help for strewing with pure motives...","postDate":"1354633755","msgId":69723,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs5bDNtcitmb3ZxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":69728,"prevInTime":69722,"nextInTime":69724,"topicId":69723,"numMessagesInTopic":0,"msgSnippet":"I am sharing something here that I am struggling with off and on, sometimes more than others.  It s the whole subject of strewing, and how not to be","messageBody":"<div id=\"ygrps-yiv-964904855\">I am sharing something here that I am struggling with off and on, sometimes more than others.  It&#39;s the whole subject of strewing, and how not to be manipulative about it and have some &quot;school-think&quot; creep into it.<br/>\n<br/>\nAs a bit of background, I posted a response recently on this list about special needs and unschooling.  Ds (9) was diagnosed with a gene duplication at the age of 4, which moderately affects his gross and fine motor skills, and his speech pretty severely until recently  (enunciation and expressive abilities, but not his comprehension which everyone says is above average).  He has been involved in speech therapy since the age of 4 plus monthly OT and PT visits.   They all have been very play based with him and encouraging especially when he was younger, and I have gotten some great ideas such doing puzzles on the floor on our bellies for his motor strength, pencil grip tricks and devices, etc.  However, their focus seems to be changing recently (especially the last year or two) and now that he is older I have had it suggested more than once by all those working with him to take him to an educational psychologist to assess his learning style, etc.  They just ask each visit &quot;So, have you thought more about...?&quot; and give me names/numbers of people.  I really don&#39;t think we would manage to find one that is homeschooling let alone unschooling friendly...they operate from such a different paradigm/philosophy... and they would see how he is &quot;behind&quot; in thier academic standards for example math skills and writing ability and I am sure they would not like it that I don&#39;t use curriculum in the prescribed manner they would stereotypically expect homeschoolers to do.  As well, in the last 3 years, EVERY fall I have been phoned by my local (not-so-unschooling friendly) gov&#39;t homeschooling liason about my &quot;plans&quot;, and fall notifications, despite being clear/specific on my forms and later my 2 progress reports, and it has made me even more nervous and aware of resources I use for my children, what I strew, etc etc.  Once I even pulled in my provincial hs association/supoport group president (an unschooler herself so that helped) to liase with me in talking to them together due to the intimidation I have felt with all of this.  So as you can guess I really do NOT want to go the ed psych route because I would not be in the &quot;take what works&quot; mindset after an evaluation... more like just fear/lack of faith in unschooling/doubting myself.<br/>\n<br/>\nI share this as I really feel these two issues affecting the flow of our everyday unschooling lives. It&#39;s like the scrutiny gets to me and most times I am ok but at times I cross a line into viewing everything in a school-y way or if a resource includes a school-y skill, or how would I indicate this in &quot;education-ese&quot; at evaluation time? I jot down in a notebook so I have things to recall at report time (and so I remember to be involved with the kids and follow up on ideas or dh could).  For example, dd (12yrs) was asking me about atoms last night based on something that came up in a vid game during the day, I recalled we had The Journey to the Center Of the Atom out from the Library and so we read it at bedtime, then I made a mental/literal note to see if she would like to go to some websites from Usbourne Quicklinks/our Usbourne science encyclopedia about it, and to see if they would like a planetarium movie I bookmarked a while back as that book touched on some things about the size of the universe, etc.   Then, unfortunatley, I found myself thinking this morning that I would have very little &quot;science&quot; to report for her (reports are due this month).  Sheesh....see what I mean?  And then if she wasn&#39;t as interested in my &quot;strewing&quot; or expanding on what I see her interested in, then being in this mindset right now would lead me to start to doubt if unschooling &quot;works&quot;. Same thing with math...!  I have read Pam Sorooshian&#39;s &quot;How to be a Good Unschooler&quot; about cuddling up on the couch and doing math just like we would read a book, with no fears about it, but then I haven&#39;t been very good at &quot;balancing in the middle ground&quot; as Sandra says and I know I havent&#39; brought enough &quot;numeracy&quot; into our home, and then again I worry about reporting, etc.  And now dd I think senses my worries, and clams up about anything number-wise.  (Incidentally, Pam, if you are reading this, I actually am the one who posted the question on your recent call in Sept with Michelle Barone where you discussed math, but was unable to attend the call as it happened)<br/>\n<br/>\nDoes anyone have any suggestions?  I want our unschooling life to just &quot;flow&quot; like it does when I manage to supress the &quot;School Think&quot;!! I want to be showing them things because it&#39;s cool and we live and learn and share together just as if I would share something with my dh (and I don&#39;t worry if it would affect his academics, or have to report on HIM, ha!) and they take from it what they will.  <br/>\n<br/>\nI would appreciate some discussion and advice.  I have been ruminating on this lately, about strewing, what may make it manipulative, etc, and I really need to get to the root of this...I think I may know what it is, it&#39;s that I really after all these years haven&#39;t totally deschooled myself and its frustrating!  And also maybe I had/have this expectation all these years ago that unschooling would lead to someone who would have the same &quot;skills&quot; that a schooled kid would have.  I am ashamed to admit this to myself! I know I need to be called out on some things and I am looking forward to discussing with you all.</div>","specialLinks":[]}],"prevTopicId":69721,"nextTopicId":69737}}