{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":134300842,"authorName":"Brenda Rose","from":"&quot;Brenda Rose&quot; &lt;rosebl@...&gt;","profile":"homeanduva2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: May I vent?","postDate":"1113401104","msgId":105282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMmYwMWM1NDAzMSRjYjQ4ODViMCQ2NTAxYThjMEBCcmVuZGE+","referencesHeader":"PDExMTMzOTM4OTYuNjU2LjY5MjMxLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":105281,"nextInTopic":105284,"prevInTime":105281,"nextInTime":105283,"topicId":105260,"numMessagesInTopic":0,"msgSnippet":"... I ve felt the same way sometimes and been glad to come sit and read what others have to say.  There are always people with worse problems than I have, plus","messageBody":"<div id=\"ygrps-yiv-185715902\">Heidi wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m glad this place is here, because this morning, if there were no place <br/>\n&gt; to<br/>\n&gt; rant and rave, I&#39;d be hauling the kids out of bed (despite their 1 am or<br/>\n&gt; later bedtime) and cracking the whip.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I&quot;ve felt the same way sometimes and been glad to come sit and read what <br/>\nothers have to say.  There are always people with worse problems than I <br/>\nhave, plus the advice here is so positive and encouraging that it (almost) <br/>\nimmediately lifts my mood.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thank goodness, I needed to bake bread, too. :) that helped calm me <br/>\n&gt; down.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It&#39;s great that you have that positive outlet.:-)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; When I woke up this morning, the powdered milk and sugar were out on the<br/>\n&gt; table, along with a bottle of lemon juice (empty). There were crumbled<br/>\n&gt; tortilla chips in my chair and on the floor near it. There is also <br/>\n&gt; powdered<br/>\n&gt; milk...you know, milk powder?...on the floor. Not a whole lot, but enough <br/>\n&gt; to<br/>\n&gt; crunch under foot. ew.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I ask my children (and husband) to clean up their messes - sometimes they do <br/>\nit and other times they tell me that &quot;the commercial was over and the show <br/>\nwas starting&quot; or some other reason (not excuse).   If I ask them later all <br/>\nof them will usually do it without complaint.  Most of the time I just clean <br/>\nit up myself.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; The sink, which had a couple of bowls and a drinking<br/>\n&gt; cup or two last night, this morning had discarded ramen noodles (and <br/>\n&gt; smelled<br/>\n&gt; it...ramen noodle juice is strong) and more bowls, along with cups <br/>\n&gt; harvested<br/>\n&gt; from various other rooms around the house. &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I don&#39;t like to do dishes late at night, but in the morning it&#39;s as relaxing <br/>\nto me as the baking is for you.  I love the feel of the suds and water, the <br/>\nsense of accomplishment at seeing the (often huge) pile go down, and the <br/>\ntime alone to think my own thoughts and plans for the day.  Trust me, no one <br/>\nbothers me at that time (they might be asked to dry and put away!). &lt;BG&gt; <br/>\nActually, sometimes one will come talk and help, if it&#39;s later in the day.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In the laundry room, I just discovered piles and PILES of laundry, peed on<br/>\n&gt; by the cat. Someone had &quot;cleaned her room&quot; by bringing down all the dirty<br/>\n&gt; clothes that had accumulated on the floor over the past weeks, and dumping<br/>\n&gt; it on the floor. The cat found it, and it was DISGUSTING. This, all over<br/>\n&gt; night. There was dirty laundry in there, but not on the FREAKING FLOOR!<br/>\n<br/>\n </span></blockquote>We just got a kitten ths week and I hope that he&#39;s a good litter-box user. <br/>\nWe&#39;ve had both kinds, so I can definitely sympathize!<br/>\nCan you close the laundry room door to keep the cat out?  Or is that where <br/>\nthe litter box is?  I&#39;m always glad when the boys bring their laundry from <br/>\ntheir rooms and epecially if they do it unasked!  Could you give each child <br/>\na basket to carry down to the laundry room?  I&#39;ve tried this and it works a <br/>\nlittle bit (not consistently, but it helps).  My pattern is to do the <br/>\nlaundry, sort it on my bed, then put it in baskets in the hall for the boys <br/>\nto carry upstairs to their rooms.  But I found out our pomeranian Snoopy <br/>\nlikes to sleep in those baskets, so now I try to hand them the baskets when <br/>\nthey&#39;re on their way up.  I thought about having each do their own laundry, <br/>\nbut it&#39;s actually easier for us to mix it because then I wash fewer and full <br/>\nloads - saves on elec., water, soap, etc.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; I&#39;m calling &quot;kitchen closed&quot; when i go to bed. This is not the first <br/>\n&gt;&gt;&gt;&gt; time<br/>\n&gt; I&#39;ve found all kinds of messes in the morning, because they stay up and<br/>\n&gt; watch TV or play computer games after I&#39;ve gone to bed. &lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Mine almost always are up until after I go to bed and they definitely want <br/>\nto eat.  Also, my dh gets home from work many nights at 1 or 2 am, and he <br/>\nusually wants to eat then too.  I could never close the kitchen.   I do ask <br/>\nthem to put away perishables (refrig. or frozen stuff).  Maybe you could ask <br/>\nthem what they might want later for a snack and fix it for them before you <br/>\ngo to bed.  Or have some non-messy things to choose.  My children do a lot <br/>\nof microwave foods (and also Ramen noodles - John almost lives on those).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; In fact, we had two half gallons of ice cream. I<br/>\n&gt; got one bowl, my hubby got one bowl. I think my older girl had a bowl of<br/>\n&gt; each flavor. And the kids got the rest. And no money until the end of the<br/>\n&gt; week, to buy more groceries of any kind, let alone supply their stinking<br/>\n&gt; SUGAR HABIT.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>There are some foods that are so popular with our kids that we do portion <br/>\nthem to be &quot;fair.&quot;   When I buy yogurt I let them choose what kind they <br/>\nwant.  If they choose Trix and I can only afford one package, they each get <br/>\ntwo.   Last week, I was able to get them each their own package - James got <br/>\nTrix and John and Joshua chose X-something (only 4 to a pack and almost <br/>\n$3.00).  Often I buy three medium-size bottles of PowerAde so each boy has <br/>\nhis own.  This whole system works well for us, because some family members <br/>\neat or drink something in one day, while others take a little each day for <br/>\nseveral days. They all feel this is a good way to divide the special things <br/>\n(and sometimes when one has run out another will share, and other times I <br/>\nhear them bargaining and I think of the Bible story of Jacob and Esau).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; I&#39;m on the verge of telling them (especially my night owl 10 year old <br/>\n&gt;&gt;&gt; girl<br/>\n&gt; who hits her peak at 11pm and doesn&#39;t wind down until 3 or 4 in the <br/>\n&gt; morning)<br/>\n&gt; that they can stay awake IN THEIR OWN ROOMS. Don&#39;t raid the kitchen.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>My ds 26 and his wife gave John a mini-fridge for his (I think) 12th <br/>\nbirthday.  His friends think it is soooo cool.  He keeps his drinks, yogurt, <br/>\nand other snacks in his room.   If he wants warm (like Ramen or pizza) he <br/>\ndoes go down to the kitchen.  For a long time I had trouble getting him to <br/>\nbring the dishes back down, but now I have a huge stack of paper plates and <br/>\nhe can use those.  Also, for a dollar (sometimes free) his brother will get <br/>\nthem all for me and collect the cans (which he then recycles and gets paid <br/>\nagain).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Okay, thanks for letting me vent a bit. More than likely, it&#39;s &quot;family<br/>\n&gt; meeting time.&quot; and I&#39;ll be able to express my frustrations without <br/>\n&gt; trashing<br/>\n&gt; the kids. Lots of my anger was already dissipated from picking up and from<br/>\n&gt; baking bread. and practicing my piano.<br/>\n&gt;<br/>\n&gt; blessings, HeidiC&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n </span></blockquote>Thank You for sharing and trusting others to listen and support.  Best <br/>\nwishes for your family meeting and for the rest of your day!<br/>\n<br/>\nPeace,<br/>\n<br/>\nBrenda Rose</div>","specialLinks":[]},{"userId":187287599,"authorName":"Kandi Bolton","from":"&quot;Kandi Bolton&quot; &lt;KandiBolton@...&gt;","profile":"kandi21785","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: May I vent?","postDate":"1113396505","msgId":105284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMzYwMWM1NDAyNyQxNjgyMmZhMCQwMjAwYThjMEBWYWx1ZWRWUFJNYXRyaXg+","referencesHeader":"PDExMTMzOTM4OTYuNjU2LjY5MjMxLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":105282,"nextInTopic":0,"prevInTime":105283,"nextInTime":105285,"topicId":105260,"numMessagesInTopic":0,"msgSnippet":"Heidi, I was reading this post and I guess I have been there so many times that I really was laughing. Not at you, but at how familiar it all seemed. I have ","messageBody":"<div id=\"ygrps-yiv-314700692\">Heidi,<br/>\n  I was reading this post and I guess I have &quot;been there&quot; so many times that <br/>\nI really was laughing. Not at you, but at how familiar it all seemed. I have <br/>\nhad these very same things happen to me and reading your posts and the <br/>\nreplies helped me to understand how I was feeling. Thank you for putting my <br/>\nthoughts into words. Maybe the next time I am feeling this way, I might try <br/>\nventing to the cyber-world. Blessings, Kandi</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] May I vent?","postDate":"1113392510","msgId":105281,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Mi4zZGNiZjEyYS4yZjhlNWY3ZUBhb2wuY29tPg=="},"prevInTopic":105280,"nextInTopic":105282,"prevInTime":105280,"nextInTime":105282,"topicId":105260,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/13/2005 12:11:26 AM Central Standard Time, nellebelle@charter.net writes: I will  have no excuses for the messy house (except for dh,","messageBody":"<div id=\"ygrps-yiv-326896206\">In a message dated 4/13/2005 12:11:26 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nellebelle@...\">nellebelle@...</a> writes:<br/>\n<br/>\nI will  have no excuses for the messy house (except for dh,  maybe). <br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nMy mother retired, and lives alone.  A few years after her retirement,  while <br/>\nI was visiting she said, &quot;I used to think you kids were the reason the  house <br/>\nwas always a mess.  Now I realize it was ME all along!&quot;   :)<br/>\n <br/>\nKaren<br/>\n <br/>\nwww.badchair.net<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] May I vent?","postDate":"1113391975","msgId":105280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQuNDIyNjdiZDkuMmY4ZTVkNjdAYW9sLmNvbT4="},"prevInTopic":105279,"nextInTopic":105281,"prevInTime":105279,"nextInTime":105281,"topicId":105260,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/12/2005 5:48:35 PM Central Standard Time, SandraDodd@aol.com writes: Keith  had an array of puzzling system.  He has (at least, maybe","messageBody":"<div id=\"ygrps-yiv-1019460393\">In a message dated 4/12/2005 5:48:35 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\nKeith  had an array of puzzling system.  He has (at least, maybe other   <br/>\nthings, maybe not) a 7 cm abcess between lower colon and bladder, so  no  <br/>\nwonder.  No <br/>\nwonder LOTS of things, and he&#39;s on big IV  antibiotics.  He  had been very <br/>\nill <br/>\nfor 10 days.  Now we  know it&#39;s not a horrible  surgery-requiring thing, and <br/>\nhe will  probably recover pretty easily.  The  kids are healthy and  safe.  <br/>\nAnd I <br/>\ncan do some dishes and laundry and be   grateful.<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nThat sounds really painful.  I hope it&#39;s not.  I hope he recovers  really <br/>\nquick.<br/>\n <br/>\nKaren<br/>\n <br/>\nwww.badchair.net<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] May I vent?","postDate":"1113368939","msgId":105279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNjMwMWM1M2ZlNyQwNWI0M2FhMCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PEJBWTEwMi1GMjlFQjZDRkVGNUFGM0Q5RkY4OUVFQUMwMzMwQHBoeC5nYmw+"},"prevInTopic":105277,"nextInTopic":105280,"prevInTime":105278,"nextInTime":105280,"topicId":105260,"numMessagesInTopic":0,"msgSnippet":"... rant and rave, I d be hauling the kids out of bed (despite their 1 am or later bedtime) and cracking the whip. I m glad you let it out here, rather","messageBody":"<div id=\"ygrps-yiv-1350860970\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;&gt;I&#39;m glad this place is here, because this morning, if there were no place to <br/>\n </span></blockquote>rant and rave, I&#39;d be hauling the kids out of bed (despite their 1 am or <br/>\nlater bedtime) and cracking the whip.&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m glad you let it out here, rather than on your kids.  I hope that helped you to let it go.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;My unschooling sensors are BROKEN in this case. <br/>\n </span></blockquote>I&#39;m seeing red. It&#39;s just plain inconsiderate.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nReading your post, a couple things came to mind.  One: The sappy poem about rocking your baby instead of cleaning the cobwebs.  Two: Yes, it is sometimes overwhelming being the responsible party.  What a gift to our children that someone else is there to take care of things, for a few years anyway.<br/>\n<br/>\nHow many of us really paid attention when the more experienced mothers said &quot;nap with your baby&quot; &quot;the housework can wait&quot; &quot;they grow so fast&quot; and those other words of wisdom that are so true?<br/>\n<br/>\nMy babies are gone.  Forever.  Why did I think anything was more important than just holding them and playing with them?  They are 9 and 12 now.  Why do I still sometimes think that there is anything more important than just hanging out with my pre-teens or helping them meet their needs?  In about 10 years, they will be young adults and won&#39;t be &#39;bothering&#39; me about things like laundry, messy rooms, wanting snacks when I&#39;ve just cleaned the kitchen, or spilling the beverage they poured on their own (rather than asking me to do it for them).  I will have no excuses for the messy house (except for dh, maybe).  My children will no longer be the major part of my life.<br/>\n<br/>\nYes, it is frustrating to face never ending laundry, dishes, spills, etc.  Don&#39;t take it out on the kids!<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":180234378,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;sylgt04@...&gt;","profile":"sylgt04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] May I vent?","postDate":"1113359718","msgId":105277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwNDEzMDIzNTE5LjUxMDQucW1haWxAd2ViNTM4MDkubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDk2LjI1NDIxNDY5LjJmOGRhOTc4QGFvbC5jb20+"},"prevInTopic":105276,"nextInTopic":105279,"prevInTime":105276,"nextInTime":105278,"topicId":105260,"numMessagesInTopic":0,"msgSnippet":"they were alive and healthy and I had been  able to be at the hospital because I trust them and they didn t act differently  with me gone than they would ve","messageBody":"<div id=\"ygrps-yiv-921281722\">they were alive and healthy and I had been  able to be at the hospital because I trust them and they didn&#39;t act differently  with <br/>\nme gone than they would&#39;ve with me there.<br/>\n<br/>\nKeith had an array of puzzling system.  He has (at least, maybe other  things, maybe not) a 7 cm abcess between lower colon and bladder, so no  wonder.  No wonder LOTS of things, and he&#39;s on big IV antibiotics.  He  had been very ill for 10 days.  Now we know it&#39;s not a horrible  surgery-requiring thing, and he will probably recover pretty easily.  The  kids are healthy and safe.  And I <br/>\ncan do some dishes and laundry and be  grateful.<br/>\n<br/>\nSandra<br/>\n<br/>\n******<br/>\n <br/>\nI&#39;m glad to hear it&#39;s not any big, scary thing with Keith.  I&#39;d read another post from you about him not being well, and was thinking of you all.  It sounds like everyone did a great job of taking care of each other, and all went well enough to allow you to be where Keith needed you.  I hope he&#39;s feeling better and back home soon.<br/>\n <br/>\nSylvia<br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Make Yahoo! your home page   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92084939,"authorName":"bunsofaluminum","from":"&quot;bunsofaluminum&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: May I vent?","postDate":"1113358275","msgId":105276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzaHY0MytvZTU3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk2LjI1NDIxNDY5LjJmOGRhOTc4QGFvbC5jb20+"},"prevInTopic":105274,"nextInTopic":105277,"prevInTime":105275,"nextInTime":105277,"topicId":105260,"numMessagesInTopic":0,"msgSnippet":"... oops sorry. the kids didn t harvest the cups. I harvested the cups before I got started on the dishes. they were part of the pile I washed, because I went","messageBody":"<div id=\"ygrps-yiv-793589305\"><blockquote><span title=\"ireply\">&gt; -=-along with cups harvested <br/>\n&gt; from various other rooms around the  house=-<br/>\n&gt;  <br/>\n&gt; They picked up cups from the rest of the house!  Cool.<br/>\n<br/>\n </span></blockquote>oops sorry. the kids didn&#39;t harvest the cups. I harvested the cups <br/>\nbefore I got started on the dishes. they were part of the pile I <br/>\nwashed, because I went through and gathered them.<br/>\n<br/>\n <br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; -=- Someone had &quot;cleaned her room&quot; by bringing down all the dirty  <br/>\n&gt; clothes that had accumulated on the floor over the past weeks, and <br/>\n </span></blockquote>dumping  <br/>\n<blockquote><span title=\"ireply\"> &gt; it on the floor.   [... In the laundry room]-=-<br/>\n&gt;  <br/>\n&gt; Sounds like she brought it right by the washing machine.  Cool!<br/>\n<br/>\n </span></blockquote>Yeah. It was the cat pee that had me irritated this morning.<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; -=- If their dirty clothes make it into the baskets in the laundry <br/>\n </span></blockquote>room,  <br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ll wash it. If it&#39;s in piles <br/>\n&gt; on the floor...well, what will I do?  -=-<br/>\n<br/>\n <br/>\n&gt; Wash it?  It&#39;s a technicality, basket or out.  Were there enough  <br/>\n </span></blockquote>empty <br/>\n<blockquote><span title=\"ireply\"> &gt; baskets for the stuff from her room?  Was the washing machine  <br/>\n </span></blockquote>empty?  Was she more <br/>\n<blockquote><span title=\"ireply\"> &gt; excited about going right back and cleaning?<br/>\n&gt; Did she decide on her own to clean her room voluntarily?<br/>\n&gt;  <br/>\n  <br/>\n </span></blockquote>this is standard procedure. Cleaning the bedroom means taking all <br/>\nclothing off the floor and putting it in the laundry room. Both girls <br/>\ndo it. Laundry that has been folded is taken into their rooms by <br/>\nthem, and left on the bed until it dumps on the floor, and then <br/>\nclean, folded clothing is put back into the laundry room. I&#39;ve <br/>\nunfolded clean clothes from laundry baskets waiting to be washed. <br/>\nUsually, I can just put it back on whoever&#39;s folded pile, and get it <br/>\nback to them. Not when the cat&#39;s been in it. <br/>\n<br/>\nPart of what I was venting about this morning was the inconsiderate-<br/>\nness of &quot;cleaning her room&quot; simply meaning &quot;letting mom do all this <br/>\nlaundry&quot; and MOST of that was just because it&#39;s how it is done SO <br/>\noften around here.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-I&#39;m calling &quot;kitchen closed&quot; when i go to bed.-=-<br/>\n&gt;  <br/>\n&gt; What&#39;s the principle behind that?<br/>\n&gt; Would it be better to talk go them about leaving it cleaner than <br/>\n </span></blockquote>they found  <br/>\n<blockquote><span title=\"ireply\"> &gt; it, or could you have snacks already ready that are NOT really <br/>\n </span></blockquote>messy?<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; Making rules about times doesn&#39;t help them learn to clean up, or to <br/>\n </span></blockquote>help  <br/>\n<blockquote><span title=\"ireply\"> &gt; them decide what is and isn&#39;t a good late-night food project and <br/>\n </span></blockquote>why.<br/>\n<br/>\nYeah. I just needed to rattle it out. That was me, after a couple of <br/>\nhours getting some cleaning up done, making bread, practicing my <br/>\npiano, starting a load of laundry. I wasn&#39;t nearly as ticked off when <br/>\nI wrote that, as I was when I first got up and was confronted by the <br/>\nmess. <br/>\n<br/>\nI did ask the kid(s) responsible not to leave messes like that any <br/>\nmore. They said &quot;okay.&quot; I&#39;ll remind them tonight before I hit the <br/>\nsack.<br/>\n<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt; I came back last night to LOTS of dirty dishes, and a dishwasher <br/>\n </span></blockquote>full of  <br/>\n<blockquote><span title=\"ireply\"> &gt; clean dishes, not put away.  Well they weren&#39;t out of clean <br/>\n </span></blockquote>dishes.  I  waited <br/>\n<blockquote><span title=\"ireply\"> &gt; until this morning, and cleaned the kitchen. I COULD have worked up <br/>\n </span></blockquote>a  froth of <br/>\n<blockquote><span title=\"ireply\"> &gt; resentment, but I chose not to.  <br/>\n<br/>\n </span></blockquote>Usually, I&#39;m quite calm about the housework. I&#39;m relaxed anyway. <br/>\nThings are never pristine around here, and I pick up when the clutter <br/>\ngets too much for me. Sometimes the kids pitch in. Usually, if I ask <br/>\nthem to help,they jump right in. For some reason, this morning just <br/>\npushed me a bit more than usual.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Keith had an array of puzzling system.  He has (at least, maybe <br/>\n </span></blockquote>other  <br/>\n<blockquote><span title=\"ireply\"> &gt; things, maybe not) a 7 cm abcess between lower colon and bladder, <br/>\n </span></blockquote>so no  wonder.  No <br/>\n<blockquote><span title=\"ireply\"> &gt; wonder LOTS of things, and he&#39;s on big IV antibiotics.  He  had <br/>\n </span></blockquote>been very ill <br/>\n<blockquote><span title=\"ireply\"> &gt; for 10 days.  Now we know it&#39;s not a horrible  surgery-requiring <br/>\n </span></blockquote>thing, and <br/>\n<blockquote><span title=\"ireply\"> &gt; he will probably recover pretty easily.  The  kids are healthy and <br/>\n </span></blockquote>safe.  And I <br/>\n<blockquote><span title=\"ireply\"> &gt; can do some dishes and laundry and be  grateful.<br/>\n<br/>\n </span></blockquote>How scary for you and your hubby! I hope everything turns out okay. <br/>\nyikes! and it is a blessing to have self-reliant, trustworthy kids. I <br/>\nknow that. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt; Sandra<br/>\n&gt;  <br/>\n </span></blockquote>blessings, Heidic<br/>\n<blockquote><span title=\"qreply\"> &gt;  <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] May I vent?","postDate":"1113345912","msgId":105274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2LjI1NDIxNDY5LjJmOGRhOTc4QGFvbC5jb20+"},"prevInTopic":105265,"nextInTopic":105276,"prevInTime":105273,"nextInTime":105275,"topicId":105260,"numMessagesInTopic":0,"msgSnippet":"-=-along with cups harvested from various other rooms around the  house=- They picked up cups from the rest of the house!  Cool. -=- Someone had cleaned her","messageBody":"<div id=\"ygrps-yiv-79140369\">-=-along with cups harvested <br/>\nfrom various other rooms around the  house=-<br/>\n <br/>\nThey picked up cups from the rest of the house!  Cool.<br/>\n <br/>\n <br/>\n-=- Someone had &quot;cleaned her room&quot; by bringing down all the dirty  <br/>\nclothes that had accumulated on the floor over the past weeks, and dumping  <br/>\nit on the floor.   [... In the laundry room]-=-<br/>\n <br/>\nSounds like she brought it right by the washing machine.  Cool!<br/>\n <br/>\n-=- If their dirty clothes make it into the baskets in the laundry room,  <br/>\nI&#39;ll wash it. If it&#39;s in piles <br/>\non the floor...well, what will I do?  -=-<br/>\n <br/>\nWash it?  It&#39;s a technicality, basket or out.  Were there enough  empty <br/>\nbaskets for the stuff from her room?  Was the washing machine  empty?  Was she more <br/>\nexcited about going right back and cleaning?<br/>\n <br/>\nDid she decide on her own to clean her room voluntarily?<br/>\n <br/>\n-=-I&#39;m calling &quot;kitchen closed&quot; when i go to bed.-=-<br/>\n <br/>\nWhat&#39;s the principle behind that?<br/>\nWould it be better to talk go them about leaving it cleaner than they found  <br/>\nit, or could you have snacks already ready that are NOT really messy?<br/>\n <br/>\nMaking rules about times doesn&#39;t help them learn to clean up, or to help  <br/>\nthem decide what is and isn&#39;t a good late-night food project and why.<br/>\n <br/>\nI came back last night to LOTS of dirty dishes, and a dishwasher full of  <br/>\nclean dishes, not put away.  Well they weren&#39;t out of clean dishes.  I  waited <br/>\nuntil this morning, and cleaned the kitchen. I COULD have worked up a  froth of <br/>\nresentment, but I chose not to.  I had already thought lovely  thoughts about <br/>\nhow nice it was that when I had called a few hours before they  were all home, <br/>\neven though I hadn&#39;t been home since 10:30 a.m. and hadn&#39;t seen  them.  Kirby <br/>\nhad taken the car Marty usually drives and had put gas in  it!  Kinda sweet, <br/>\nbut Marty had been forced to take the big van Kirby  usually drives, which was <br/>\nalmost out of gas, and Marty didn&#39;t have as much  choice as Kirby to put gas <br/>\nin.  No way could he afford to fill it up.   But they were all home, each <br/>\nhaving put gas in a car.  All were getting  along well and being helpful.<br/>\n <br/>\nI had been at the hospital (emergency room and admission) with Keith for 13  <br/>\nor 14 hours, and yet the kids had still gone to class, work, had friends over, <br/>\n driven a friend home and come back, NOT been in any way  irresponsible.  <br/>\nHolly felt safe and happy, Marty wished he&#39;d been  driving the 30mpg instead of <br/>\nthe 8/9mpg monster, but he&#39;ll recover (only put in  $5). <br/>\n <br/>\nThey left a mess in the kitchen, but they had also fed themselves and put  <br/>\nthe dishes in the sink.  And they were alive and healthy and I had been  able to <br/>\nbe at the hospital because I trust them and they didn&#39;t act differently  with <br/>\nme gone than they would&#39;ve with me there.<br/>\n <br/>\nKeith had an array of puzzling system.  He has (at least, maybe other  <br/>\nthings, maybe not) a 7 cm abcess between lower colon and bladder, so no  wonder.  No <br/>\nwonder LOTS of things, and he&#39;s on big IV antibiotics.  He  had been very ill <br/>\nfor 10 days.  Now we know it&#39;s not a horrible  surgery-requiring thing, and <br/>\nhe will probably recover pretty easily.  The  kids are healthy and safe.  And I <br/>\ncan do some dishes and laundry and be  grateful.<br/>\n <br/>\nSandra<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":172750465,"authorName":"b229d655@cs.com","from":"b229d655@...","profile":"robeyboyz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] May I vent?","postDate":"1113327500","msgId":105265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFmNi43OGZmMDgyLjJmOGQ2MThjQGNzLmNvbT4="},"prevInTopic":105260,"nextInTopic":105274,"prevInTime":105264,"nextInTime":105266,"topicId":105260,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/12/2005 12:17:54 PM Eastern Standard Time, ... Fantastic vent.  I read it all and took a deep breath for you.  Thank goodness some things","messageBody":"<div id=\"ygrps-yiv-843350395\">In a message dated 4/12/2005 12:17:54 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bunsofaluminum60@...\">bunsofaluminum60@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; Okay, thanks for letting me vent a bit. More than likely, it&#39;s &quot;family <br/>\n&gt; meeting time.&quot; and I&#39;ll be able to express my frustrations without trashing <br/>\n&gt; the kids. Lots of my anger was already dissipated from picking up and from <br/>\n&gt; baking bread. and practicing my piano.<br/>\n<br/>\n<br/>\n </span></blockquote>Fantastic vent.  I read it all and took a deep breath for you.  Thank <br/>\ngoodness some things can help us cool off before we fire it all out.<br/>\n<br/>\nI ususally don&#39;t have much of an issue in the house cuz my kids are still <br/>\nreally little and we all kinda go to bed about the same time so I have no <br/>\nsurprises in the morning.  But for us, occasionally mine will get beyond my patience <br/>\nwhen we are out running errands or whatever and I am so thankful that we have <br/>\nthe ride home to listen to music or the DVD or the gameboys or whatever, to <br/>\ncalm us all down.  By the time we get home, it&#39;s no biggie and we can talk if we <br/>\nneed to.<br/>\n<br/>\nI think setting some rules for &quot;after hours&quot; is a good thing.  They may be <br/>\ntired and really aren&#39;t thinking about cleaning up at night, maybe the lights <br/>\nare low and they don&#39;t see all the crumbs and stuff.  If there are dishes <br/>\nthey&#39;ve used, they should help clean and put them away.  Same with toys, books, or <br/>\nwhatever.  Unless of course they are using those things again later.  Since we <br/>\nall share the same home, especially &quot;family rooms or common spaces&quot;, they can <br/>\nhelp by taking care of their things.  They probably won&#39;t mind, they may not <br/>\neven realize that you feel this way come morning time.  When it comes to the <br/>\ndispersing of food (goodies), I really don&#39;t know what helps.  When it comes to <br/>\nmoney and driving to shop, I think it&#39;s much more important to have a few <br/>\nguidelines.  If you don&#39;t have the funds to shop continuously then they should <br/>\nknow that there won&#39;t be more until next time.  No special trips.  If you usually <br/>\nbuy 2 gallons of milk, maybe when the first is gone, the other should be for <br/>\ncooking only.  With ice cream, buy the usual and if it&#39;s gone, see if they&#39;d <br/>\nlike to make their own.  It&#39;s funny with us because we have bought snacks or <br/>\nfoods that each family member enjoys and then everyone has something they like.  <br/>\nWell, now our boys are bigger and beginning to like Daddy&#39;s snacks so he <br/>\nalways says he&#39;ll have to start hiding his goodies :o)  Even though he wouldn&#39;t.  <br/>\nHe just remembers a time when they would turn their noses up to almost all of <br/>\nour stuff and now they are enjoying those things too.<br/>\n<br/>\nThanks for sharing, I feel like I&#39;m less alone when others have share their <br/>\nups and downs.  I hope all goes well with your family meeting.<br/>\n<br/>\nPamela<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi Crane","from":"&quot;Heidi Crane&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"May I vent?","postDate":"1113322617","msgId":105260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwMi1GMjlFQjZDRkVGNUFGM0Q5RkY4OUVFQUMwMzMwQHBoeC5nYmw+","inReplyToHeader":"PDExMTMzMDU5MTAuMzU4Ljg3MDAubTEyQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":105265,"prevInTime":105259,"nextInTime":105261,"topicId":105260,"numMessagesInTopic":0,"msgSnippet":"I m glad this place is here, because this morning, if there were no place to rant and rave, I d be hauling the kids out of bed (despite their 1 am or later","messageBody":"<div id=\"ygrps-yiv-306529372\">I&#39;m glad this place is here, because this morning, if there were no place to <br/>\nrant and rave, I&#39;d be hauling the kids out of bed (despite their 1 am or <br/>\nlater bedtime) and cracking the whip.<br/>\n<br/>\nThank goodness, I needed to bake bread, too. :) that helped calm me down.<br/>\n<br/>\nNow. When  I woke up this morning I had in my mind pictures of the things I <br/>\nknew I needed to do today. Since starting geo-caching, and spending more <br/>\ntime at a &quot;pin money&quot; side job, the house has been more cluttered than I <br/>\nlike. Yesterday I decluttered some surfaces, like the kitchen table and side <br/>\ntables in the front room. Swept. Dishes. etc. Things weren&#39;t super when I <br/>\nwent to bed, but they were...less irritatingly messy.<br/>\n<br/>\nWhen I woke up this morning, the powdered milk and sugar were out on the <br/>\ntable, along with a bottle of lemon juice (empty). There were crumbled <br/>\ntortilla chips in my chair and on the floor near it. There is also powdered <br/>\nmilk...you know, milk powder?...on the floor. Not a whole lot, but enough to <br/>\ncrunch under foot. ew. The sink, which had a couple of bowls and a drinking <br/>\ncup or two last night, this morning had discarded ramen noodles (and smelled <br/>\nit...ramen noodle juice is strong) and more bowls, along with cups harvested <br/>\nfrom various other rooms around the house. A little bowl with a few tortilla <br/>\nchips on the side table. On the other side table, a piece of yellow bell <br/>\npepper, (along with some stuff that belongs there).<br/>\n<br/>\nIn the laundry room, I just discovered piles and PILES of laundry, peed on <br/>\nby the cat. Someone had &quot;cleaned her room&quot; by bringing down all the dirty <br/>\nclothes that had accumulated on the floor over the past weeks, and dumping <br/>\nit on the floor. The cat found it, and it was DISGUSTING. This, all over <br/>\nnight. There was dirty laundry in there, but not on the FREAKING FLOOR!<br/>\n<br/>\nLet me tell you where I&#39;m at with this. 1) the kids are going to start doing <br/>\ntheir own laundry. I&#39;ve about had it. Actually, sending out my Unschooling <br/>\nSensor, I can&#39;t think of anything wrong with this. If their dirty clothes <br/>\nmake it into the baskets in the laundry room, I&#39;ll wash it. If it&#39;s in piles <br/>\non the floor...well, what will I do? I can&#39;t leave cat urine smelling <br/>\nclothes. sheesh. Never mind. My unschooling sensors are BROKEN in this case. <br/>\nI&#39;m seeing red. It&#39;s just plain inconsiderate.<br/>\n<br/>\n2) I&#39;m calling &quot;kitchen closed&quot; when i go to bed. This is not the first time <br/>\nI&#39;ve found all kinds of messes in the morning, because they stay up and <br/>\nwatch TV or play computer games after I&#39;ve gone to bed. Get the munchies? <br/>\nGreat! We&#39;ll make lemonade, and EAT POWDERED MILK? and chips and salsa. And <br/>\nany candy, or ice cream. In fact, we had two half gallons of ice cream. I <br/>\ngot one bowl, my hubby got one bowl. I think my older girl had a bowl of <br/>\neach flavor. And the kids got the rest. And no money until the end of the <br/>\nweek, to buy more groceries of any kind, let alone supply their stinking <br/>\nSUGAR HABIT.<br/>\n<br/>\nI also found my younger girl&#39;s art kit out, with a streak of chocolate sauce <br/>\nacross the top. This makes me think they made chocolate milk, and since we <br/>\nare out of regular milk (two gallons of which disappeared in two days, with <br/>\nthe breakfast cereal, a week ago) (I purchase my milk locally, from a dairy <br/>\nfarm that doesn&#39;t use BGH or antibi&#39;s. It&#39;s the same price, but 15 miles <br/>\nacross town, so...I hadn&#39;t gotten over there at $2.16 a gallon of gas to <br/>\npick up more...so sorry) Well, they made their milk from powdered, which I <br/>\nusually have on hand, and then put the chocolate syrup in it, and got THAT <br/>\nall over things, too.<br/>\n<br/>\nI&#39;m on the verge of telling them (especially my night owl 10 year old girl <br/>\nwho hits her peak at 11pm and doesn&#39;t wind down until 3 or 4 in the morning) <br/>\nthat they can stay awake IN THEIR OWN ROOMS. Don&#39;t raid the kitchen. Don&#39;t <br/>\nthis, don&#39;t that. She actually fell asleep on the floor in the front room, <br/>\nTV on. Who knows what kinds of advertising she&#39;s seeing. ew. Well, it&#39;s <br/>\nprobably cartoon network or Nickelodeon, but some of the channels have <br/>\nrevolting ads late at night. &quot;College Girls Naked!&quot; kind of things. ew.<br/>\n<br/>\nWhat I did: I picked up the &quot;big chunks&quot; in the front room. I&#39;m going to ask <br/>\nthem to help finish up in there by sweeping and vacuuming the floor. I did <br/>\nall the dishes and made sweet rolls and a loaf of bread. And cleaned up <br/>\nafter myself in there, so there are no dirty dishes at this time. I&#39;m going <br/>\nto ask one of them to put away the clean dishes and (maybe) sweep the floor. <br/>\nI have a load of laundry going and plan on getting a whole bunch done today. <br/>\nThe cat smell is pretty bad. I might ditch the freaking cat. I&#39;ve always had <br/>\nproblems with this one, anyway. Scratching around in house plants and peeing <br/>\nin...clothes.<br/>\n<br/>\nOkay, thanks for letting me vent a bit. More than likely, it&#39;s &quot;family <br/>\nmeeting time.&quot; and I&#39;ll be able to express my frustrations without trashing <br/>\nthe kids. Lots of my anger was already dissipated from picking up and from <br/>\nbaking bread. and practicing my piano.<br/>\n<br/>\nblessings, HeidiC</div>","specialLinks":[]}],"prevTopicId":105261,"nextTopicId":105287}}