{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;Tracy@...","replyTo":"LIST","senderId":"tdWWjvt6P-EAFaUyyMHlDH7VZnHU4wGnz4AGek2ZcY0STWTIfwt32lVNIv_MNBJ0I6ohd8hABfYIkHr7X_5P46LFFSp3QwqiKY3DX3f23T49kXO8NaVueTiP","spamInfo":{"isSpam":false,"reason":"0"},"subject":"interesting...","postDate":"944696344","msgId":5234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMzQuNTIzNC45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":5233,"nextInTime":5235,"topicId":5234,"numMessagesInTopic":0,"msgSnippet":"This was in my local home-ed group s newsletter, credited to being found on the net.  If anyone knows the original author, please let me know. ... Two women","messageBody":"<div id=\"ygrps-yiv-790077254\">This was in my local home-ed group&#39;s newsletter, credited to being found on<br/>\nthe &#39;net.  If anyone knows the original author, please let me know.<br/>\n<br/>\n----------------------------------------------------------------------------<br/>\n---------------------------------------<br/>\nTwo women meet in the park and start to chat:<br/>\n<br/>\nW1:    Hi.  I&#39;m Maggie.  My kids are the three in red shirts, helps me keep<br/>\ntrack of them.<br/>\nW2:    (Smiles)  I&#39;m Terri.  Mine are in the pink and yellow shirts.  Do you<br/>\ncome here a lot?<br/>\nMaggie:    Usually two or three times a week, after we go to the library.<br/>\nTerri:    Wow.  Where do you find the time?<br/>\nM:    We home school, so we do it during the day most of the time.<br/>\nT:    Some of my neighbours home school, but I send my kids to school.<br/>\nM:    How do you do it?<br/>\nT:    It&#39;s not easy, I go to all the PTA meetings and work with the kids<br/>\nevery day after school and stay real involved.<br/>\nM:    But what about socialisation?  Aren&#39;t you worried about them being<br/>\ncooped up all day with kids their own ages, never getting the opportunity<br/>\nfor natural relationships?<br/>\nT:    Well, yes.  But I&#39;ve worked hard to balance that.  They have some<br/>\nfriends who&#39;re home schooled, and we visit their grandparents almost every<br/>\nmonth.<br/>\nM:    Sounds like you&#39;re a very dedicated mom.  But don&#39;t you worry about<br/>\nall the opportunities they&#39;re missing out on?  I mean, they&#39;re so isolated<br/>\nfrom real life - how will they know what the world is like - what people do<br/>\nfor a living - how to get along with all different kinds of people?<br/>\nT:    Oh, we discussed that at PTA, and we started a fund to bring real<br/>\npeople into the classrooms.  Last month, we had a policeman and a doctor<br/>\ncome in to talk to every class, and next month, we&#39;re having a woman from<br/>\nJapan and a man from Kenya come to speak.<br/>\nM:    Oh, we met a man from Japan in the grocery store the other week, and<br/>\nhe got talking about his childhood in Tokyo.  My kids were absolutely<br/>\nfascinated.  We invited him to dinner and got to meet his wife and their<br/>\nthree children.<br/>\nT:    That&#39;s nice.  Hmm.  Maybe we should plan some Japanese food for the<br/>\nlunchroom on Multicultural Day.<br/>\nM:    Maybe your Japanese guest could eat witht eh children.<br/>\nT:    Oh, no.  She&#39;s on a very tight schedule.  She has two other schools to<br/>\nvisit that day.  It&#39;s a system-wide thing we&#39;re doing.<br/>\nM:    To tell you the truth, I never had time to think about it.  before I<br/>\neven saw him, my six-year-old had asked him what he was going to do with all<br/>\nthe oranges he was buying.<br/>\nT:    Your child talks to strangers?<br/>\nM:    I was right there with him.  Ho knows that as long as he&#39;s with me, he<br/>\ncan talk to anyone he wishes.<br/>\nT:    But you&#39;re developing dangerous habits in him.  My children never talk<br/>\nto strangers.<br/>\nM:    Not even when they&#39;re with you?<br/>\nT:    They&#39;re never with me, except at home after school.  So you see why<br/>\nit&#39;s so important for them to understand that talking to strangers is a big<br/>\nno-no.<br/>\nM:    Yes, I do.  But if they were with you, they could get to meet<br/>\ninteresting people and still be safe.  They&#39;d get a taste of the real world,<br/>\nin real settings.  They&#39;d also get a real feel for how to tell when a<br/>\nsituation is dangerous or suspicious.<br/>\nT:    They&#39;ll get that in the third and fifth grades in their health<br/>\ncourses.<br/>\nM:    Well, I can tell you&#39;re a very caring mom.  Let me give you my<br/>\nnumber - if you ever want to talk, give me a call.  It was good to meet you.</div>","specialLinks":[]}],"prevTopicId":5231,"nextTopicId":5229}}