{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"wi-f8dslZnOc9MlffIrAKgvRFijKT-pB9L6GDdvAvY2Lqj42mdospDZ2-w8XpxkKBwE0epdmbD4508mcUieNaiNoFrKiZ5I","spamInfo":{"isSpam":false,"reason":"0"},"subject":"KnoK NEWS for 30 March 2000","postDate":"954420209","msgId":7478,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwMzMwMTIzNi5WQUEyNTA5MEBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":7477,"nextInTime":7479,"topicId":7478,"numMessagesInTopic":0,"msgSnippet":"* * * *  KnoK NEWS  * * * * -- Views from the world of learning in Japan -- Welcome to the 30 March 2000 edition of KnoK (pronounced knock ) NEWS, an informal","messageBody":"<div id=\"ygrps-yiv-1546270519\">* * * *  KnoK NEWS  * * * *<br/>\n                -- Views from the world of learning in Japan --<br/>\n<br/>\n<br/>\nWelcome to the 30 March 2000 edition of KnoK (pronounced &quot;knock&quot;) NEWS, <br/>\nan informal and periodic bulletin concerning issues of learning in Japan. <br/>\nIt is brought to you by the Covert family -- Kazumi, Kenya and Brian -- a <br/>\nmulticultural, homelearning family in Osaka, Japan.<br/>\n<br/>\nKnoK stands for *Kodomo no Kokoro*, meaning &quot;Heart of a Child&quot; in <br/>\nJapanese. It is our belief that the heart of any child is indeed at the <br/>\ncenter of true learning, wherever and however such learning may take <br/>\nplace. <br/>\n<br/>\n<br/>\n                    &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n[EDITOR&#39;S WELCOME: Greetings all, in these final days of March!  In this <br/>\nedition of KnoK NEWS, we get down to some basics of homelearning in the <br/>\nLand of the Rising Sun: What is learning at home like in Japan? What kind <br/>\nof people are doing it? Why? And how many?<br/>\n<br/>\nWe hope to answer a few of these kinds of questions by way of a two-part <br/>\nQ & A list compiled by a Japanese homelearning parent, Tomiko Kugai. The <br/>\nbeginning portion of this list was originally compiled in 1997 by Ms. <br/>\nKugai to introduce the homelearning environment to the slowly (but <br/>\nsteadily) rising number of Japanese families seeking alternatives to <br/>\nschool. With Ms. Kugai&#39;s cooperation, KnoK NEWS has recently expanded, <br/>\nupdated and translated that original Japanese Q & A list into English so <br/>\nthat families in and out of Japan may get a clearer idea of what&#39;s <br/>\nhappening -- and what&#39;s at stake -- in the world of Japanese homelearning <br/>\ntoday.<br/>\n<br/>\nMs. Kugai, along with her partner, Mr. Junichi Ono, and their 14-year-old <br/>\ndaughter, Momo, have been doing homelearning for more than six years now. <br/>\nMs. Kugai also heads a support group called &quot;Home Schooling Network - <br/>\nHimeji&quot; based in the city of Himeji, Hyogo Prefecture, western Japan. Her <br/>\nfamily and homelearning activities have been reported on Japanese TV, as <br/>\nwell as in Japanese newspaper and magazine articles -- most recently in <br/>\nthe Kyoto Shimbun, a major metropolitan daily newspaper in the city of <br/>\nKyoto, which has carried a few articles over just the past week or so <br/>\nthat are supportive in tone of home-based learning in Japan.<br/>\n<br/>\nFor those who are interested, Ms. Kugai and her &quot;HSN Himeji&quot; support <br/>\ngroup have a homepage up (in Japanese) at the following URL:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www2h.biglobe.ne.jp/~hsn-hime/\">http://www2h.biglobe.ne.jp/~hsn-hime/</a><br/>\n<br/>\nAnd now a mention about the Q & A&#39;s to follow: In Part 1, we start out by <br/>\nintroducing the &quot;basic&quot; questions Japanese families seem to be asking <br/>\nabout homelearning in general (sound familiar?), then we slide into <br/>\nquestions that are more specific to current conditions here in Japan. We <br/>\ndo hope to take a more comprehensive look at legal and other related <br/>\nissues in Japan in the future. For now, however, we offer this Q & A <br/>\noverview in the spirit of honest, open information-exchange and <br/>\nnetworking. As always, we welcome any thoughts you have about this. Feel <br/>\nfree to pass it around. --BC]<br/>\n<br/>\n<br/>\n<br/>\n                  *  Q & A ON HOMESCHOOLING IN JAPAN -- Part 1  *<br/>\n<br/>\n<br/>\n<br/>\nQ-1: WHAT EXACTLY IS HOMESCHOOLING?<br/>\n<br/>\nA-1: It is a way of &quot;shared upbringing&quot; in which the home, libraries, <br/>\nmuseums, parks and so forth are used as learning resources for children <br/>\nalong with the support of grownups -- without the children attending <br/>\nschool. In Europe and the United States, the number of households <br/>\nchoosing this path as a way to meet the requirements for compulsory <br/>\neducation, both legally and socially, are increasing.<br/>\n<br/>\nQ-2: HOW DO YOU DO HOMESCHOOLING?<br/>\n<br/>\nA-2: There are various ways, depending on the household, but <br/>\nhomeschooling methods can generally be put into two categories: (1) <br/>\nSchool at home, in which a set of educational materials and curriculum is <br/>\nprepared in advance by grownups, and (2) Unschooling, which places <br/>\nimportance on children&#39;s hobbies or interests as a way to &quot;learn by <br/>\nliving.&quot;<br/>\n<br/>\nCorrespondence courses are also sometimes used, but even then at the <br/>\nchild&#39;s own pace. This is homeschooling&#39;s most favorable point. In <br/>\nhomeschooling, first and foremost, &quot;The child plays the leading role.&quot; <br/>\n<br/>\nQ-3: DON&#39;T PARENTS NEED TO HAVE SOME SPECIALIZED KNOWLEDGE IN A SUBJECT? <br/>\nALSO, WE DON&#39;T HAVE ANY EDUCATIONAL EQUIPMENT AT HOME.<br/>\n<br/>\nA-3: Parents don&#39;t need any &quot;specialized&quot; knowledge. While parents <br/>\ncertainly do have a strong influence on their children, parents aren&#39;t <br/>\nthe only ones children learn from. It is enough that parents help their <br/>\nchildren search for information, and broaden their experiences and human <br/>\nrelationships. That is to say, creating an environment is a vital role <br/>\nfor parents. Rather than parents leading the lessons, it is more <br/>\nimportant that a shared learning take place, while moving forward in the <br/>\nspirit of partnership.<br/>\n<br/>\nAnd no particular educational equipment is necessary. A kitchen in the <br/>\nhome serves sufficiently as a fun-filled laboratory. Beyond that, you can <br/>\nuse public facilities and any resources that other households may have <br/>\nfor the offering.          <br/>\n<br/>\nQ-4: DOESN&#39;T HOMESCHOOLING ISOLATE CHILDREN? AND WHAT ABOUT SOCIALIZATION?<br/>\n<br/>\nA-4: In Japan at present, the reality is that conditions exist under <br/>\nwhich children may be isolated and face social pressure -- by a society <br/>\nthat largely does not recognize homeschooling and accepts school as the <br/>\nonly way. Therefore, homeschooling groups have been created at the local <br/>\nlevels, and by developing these networks they can exchange information <br/>\nwith homeschoolers from other areas, thus helping to avoid isolation.<br/>\n<br/>\nThrough the activities of such groups and networks, a variety of <br/>\nacquaintances and friends may be made; this is sufficient, socially <br/>\nspeaking, for bringing up children. Children who homeschool are not <br/>\nforced, as they are in school, to compete against others of their age <br/>\ngroup; this, in turn, reduces social exclusion and aggressiveness on <br/>\ntheir part.        <br/>\n<br/>\nQ-5: WHAT&#39;S THE DIFFERENCE BETWEEN HOMESCHOOLING, AND *FU-TOKO* (AVOIDING <br/>\nSCHOOL) OR *TOKO-KYOHI* (REFUSING SCHOOL)?<br/>\n[The latter term, *toko-kyohi*, is usually associated with symptoms of <br/>\nneuroses among schoolchildren. --Editor]<br/>\n<br/>\nA-5: While there are many cases of families choosing homeschooling <br/>\nthrough *fu-toko* or *toko-kyohi*, such conditions of &quot;not going to <br/>\nschool&quot; are definitely NOT representative of homeschooling. We cannot <br/>\ncall it homeschooling if both children and parents oppose school in the <br/>\nmeantime but believe they must return to it eventually, as with *fu-toko* <br/>\nor *toko-kyohi*. When the idea of school is completely put aside and <br/>\nlearning proceeds in the home for the family&#39;s own constructive reasons <br/>\n-- and when children and parents choose this way as a separate form of <br/>\nalternative education in and of itself -- then we can call it <br/>\nhomeschooling.       <br/>\n<br/>\nQ-6: ISN&#39;T THERE AN OBLIGATION FOR CHILDREN TO GO TO SCHOOL?<br/>\n<br/>\nA-6: No, there is not. Under the Constitution of Japan, children have the <br/>\n&quot;right to receive an education&quot; [*kyoiku o ukeru kenri*], and people are <br/>\n&quot;obliged to have&quot; [*hosho-suru gimu*] children receive an education. If a <br/>\nchild does not suit a school or if a child dislikes going to school, <br/>\nshe/he still has the right to an education, even if it is outside of <br/>\nschool. But this is made especially hard for large numbers of children <br/>\nand parents because no systematic procedures are in place at the <br/>\nadministrative levels in Japan to deal with such situations.<br/>\n<br/>\nIt becomes necessary, then, to stand up for the right &quot;not to go to <br/>\nschool&quot; -- and for society to recognize that right. Citizens groups in <br/>\nJapan are already undertaking these very types of activities, and <br/>\nhomeschooling support groups are springing up in many areas.         <br/>\n<br/>\n[Editor&#39;s Note: The part of the Japanese Constitution pertaining to <br/>\neducation, Article 26, in two paragraphs, reads in its entirety as <br/>\nfollows: &quot;All people shall have the right to receive an equal education <br/>\ncorrespondent to their ability, as provided for by law.  2. All people <br/>\nshall be obligated to have all boys and girls under their protection <br/>\nreceive ordinary education as provided for by law. Such compulsory <br/>\neducation shall be free.&quot;]<br/>\n<br/>\nQ-7: BUT ISN&#39;T HOMESCHOOLING ILLEGAL IN JAPAN? DON&#39;T PEOPLE GET <br/>\nPROSECUTED OR GO TO JAIL IF THEY HOMESCHOOL IN JAPAN?<br/>\n<br/>\nA-7: Under Japan&#39;s compulsory education system, an ordinary education of <br/>\nnine years is guaranteed for children between the ages of six and 15. <br/>\nParents or guardians do have an obligation under the School Education Law <br/>\n[*Gakko Kyoiku-Ho*] in Japan to see that their children attend school. <br/>\nBut there is no provision of the law directed at children themselves, <br/>\nstating that children must attend a school to get an education. In other <br/>\nwords, the School Education Law addresses parental responsibility only, <br/>\nand not a child&#39;s own decision about where to learn. Therefore, if a <br/>\nchild does not fit in with a school or if a child does not like attending <br/>\nschool, other ways of learning outside of school can be done. So, <br/>\nhomeschooling is DEFINITELY NOT illegal in Japan. And people in Japan are <br/>\nnot being prosecuted or going to jail because of their decision to <br/>\nhomeschool.<br/>\n<br/>\n[Editor&#39;s Note: While it is a fact that there is no law in Japan that <br/>\nconcretely provides *for* home-based learning, it is also a fact that <br/>\nthere is no provision under law at present that expressly prohibits it. <br/>\nFor those families in Japan who do pursue homelearning as an alternative <br/>\nto school, the Ministry of Education generally does not stand in their <br/>\nway. At this stage, the ministry neither discourages nor encourages <br/>\nhomelearning in Japan.]<br/>\n<br/>\nEven so, there are lots of people in society who believe that children <br/>\nare required to attend school and many cases where boards of education <br/>\npossess no understanding of what homeschooling is about. Thus we still <br/>\nsee cases, depending on the local area or district, of interference by <br/>\nboards of education in trying to make children go to school. <br/>\n<br/>\nQ-8: IF WE CHOOSE TO DO HOMESCHOOLING, WHAT KIND OF RELATIONSHIP SHOULD <br/>\nWE HAVE WITH SCHOOL?<br/>\n<br/>\nA-8: For now, your child&#39;s *gaku-seki* [school register] will remain at <br/>\nthe school. You should nevertheless clearly inform the principal and <br/>\nteacher in charge that: (1) You will assume the responsibility of <br/>\nhomeschooling in placing priority on your child&#39;s own wishes, and (2) You <br/>\ndo not want their excessive interference in this matter. It is also <br/>\nimportant for you to add that if your child does happen to *want* to <br/>\nreturn to school later on, you&#39;ll expect their official cooperation then <br/>\ntoo.           <br/>\n<br/>\nQ-9: ABOUT HOW MANY HOMESCHOOLERS ARE THERE IN JAPAN?<br/>\n<br/>\nA-9: More than 120,000 children are reportedly avoiding school or <br/>\nrefusing school at the primary and middle school levels, according to <br/>\nresearch by the Ministry of Education. It is hard to say how many of <br/>\nthese are homeschoolers, however, since the research is not divided into <br/>\ncases of those actively learning outside of school versus otherwise. No <br/>\nresearch anywhere has yet been done on how many homeschoolers are in <br/>\nJapan, so the exact numbers are unknown. [Unofficial estimates place the <br/>\nnumber of homeschooled children in Japan at around 2,000 to 3,000 <br/>\nnationwide. --Editor]  In any case, the numbers of households that are <br/>\nchoosing homeschooling due to school not suiting their children are <br/>\nslowly increasing.  <br/>\n<br/>\nQ-10: WHAT IS THE BIGGEST PROBLEM FACING HOMESCHOOLERS IN JAPAN, AS A <br/>\nWHOLE?<br/>\n<br/>\nA-10: The biggest problem is that homeschooling remains unknown by many <br/>\npeople in this country. Also, as homeschoolers in Japan are still few in <br/>\nnumber, they may be isolated and find it hard to discover new friends, <br/>\neven if they do create support groups. In cases when children do stay at <br/>\nhome specifically to avoid or refuse school, this is usually with the <br/>\nidea that their parents will be sending them back to school again <br/>\neventually. Few parents are inclined to pursue learning at home.      <br/>\n<br/>\nQ-11: AMONG THOSE FAMILIES IN JAPAN THAT ARE CONSIDERING ALTERNATIVES, <br/>\nWHY ARE MORE AND MORE TURNING TO HOMESCHOOLING?<br/>\n<br/>\nA-11: For one thing, confidence in schools is beginning to falter because <br/>\nof physical punishment inflicted on students by teachers, bullying among <br/>\nchildren themselves, and a host of other problems. Japanese education is <br/>\ncarried out in an environment where the concept of &quot;doing something <br/>\ntogether&quot; is strong, and where there is a strong tendency to reject <br/>\ndifferences rather than acknowledge them. At the same time, though, there <br/>\nare also many parents who criticize such education and, in fact, many <br/>\nchildren who are starting to stand up and say &quot;NO!&quot; to school.<br/>\n<br/>\nMoreover, resources outside of school (such as libraries, art galleries <br/>\nand museums) have become more abundant. It is also easier to get <br/>\ninformation through television, the Internet and whatnot. Lots of <br/>\nteaching materials are being published these days. Such conditions make <br/>\nit easier to do homeschooling.<br/>\n<br/>\nThis, of course, speaks to the motivations of those households that have <br/>\nactually *chosen* to do homeschooling. As mentioned before, while the <br/>\nnumbers of households that choose homeschooling are known to be rising in <br/>\nJapan, they still are relatively few in this country. <br/>\n<br/>\n<br/>\n                                  *   *   *   *<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; NEXT TIME:  Q & A on Homeschooling in Japan -- Part 2<br/>\n<br/>\n<br/>\n </span></blockquote>                                  *   *   *   *<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt; LINKING UP: <br/>\n<br/>\nIn this edition of KnoK NEWS, we introduce you to some English-language <br/>\nwebsites in Japan. Info on Japanese-language homelearning websites to <br/>\ncome in the near future! <br/>\n<br/>\n<br/>\nHOMESCHOOLING IN JAPAN<br/>\n<br/>\n(a) Homeschooling in Japan Home Page:<br/>\n---&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www2.gol.com/users/milkat/index.html\">http://www2.gol.com/users/milkat/index.html</a> <br/>\nThis is the main page of the website, which is put together by Katherine <br/>\nCombs in Tokyo. A great website and gathering place that is long overdue <br/>\nfor homelearners in this country. <br/>\n<br/>\n(b) Homeschooling in Japan Newsletter Directory:<br/>\n---&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www2.gol.com/users/milkat/directory.html\">http://www2.gol.com/users/milkat/directory.html</a><br/>\nHere are just some of the people on the frontlines who are making <br/>\nhome-based learning and alternative education happen in Japan. Newsletter <br/>\neditor Aileen Kawagoe is doing a tremendous job of keeping us <br/>\nhomelearners here up to date with literally tons of resource info and <br/>\nsolid contacts, which you too can find at the resources and newsletter <br/>\nsections of this website.<br/>\n<br/>\nTOKYO WITH KIDS<br/>\n---&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.tokyowithkids.com/\">http://www.tokyowithkids.com/</a> <br/>\nA fun site for families in the Tokyo area of Japan. TWK is supportive of <br/>\nhomelearners in Japan, of course, and is just an excellent resource all <br/>\nthe way around. Whether you happen to be in Tokyo or somewhere else with <br/>\nkids, check it out!<br/>\n<br/>\nJAPAN INFORMATION NETWORK<br/>\n---&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://jin.jcic.or.jp/stat/category_16.html\">http://jin.jcic.or.jp/stat/category_16.html</a><br/>\nFor those who like their websites with &quot;just the facts,&quot; we offer you <br/>\nstatistics galore. This is a mostly &quot;official&quot; listing of academic stats <br/>\nabout Japan, including educational problems.<br/>\n<br/>\n<br/>\n                                  *   *   *   *<br/>\n<br/>\n<br/>\n                       WISH I&#39;D SAID THAT  (Quote of the Day):<br/>\n<br/>\n*Sixty-six years ago today....<br/>\n<br/>\n&quot;Real education consists in drawing the best out of yourself. What better <br/>\nbook can there be than the book of humanity?&quot;   <br/>\n    --Mohandas (Mahatma) Gandhi, in *Harijan*, 30 March 1934</div>","specialLinks":[]}],"prevTopicId":7475,"nextTopicId":7480}}