{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"The White&#39;s","from":"&quot;The White&#39;s&quot; &lt;jwwjr@...&gt;","replyTo":"LIST","senderId":"qKkk1je2i_7M_qVk0lHeZPSmNLM8UUtpwVfnzNHnAGwzqRvEN_0s6Q1zXiwAnQv44BdvySztrhD2tgCOoiXDxIm7WQ93E7AY","spamInfo":{"isSpam":false,"reason":"0"},"subject":"backyard scientist","postDate":"961092936","msgId":9313,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDUwMWJmZDcwNSRlOGI1Y2M2MCQwY2YyMGJkMEBuZW9jb21tLm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":9312,"nextInTime":9314,"topicId":9313,"numMessagesInTopic":0,"msgSnippet":"From: Rhonda C  Subject: Backyard Scientist I received this from a friend of mine and wanted to pass it on. I am sending this to multiple","messageBody":"<div id=\"ygrps-yiv-650943575\">From: &quot;Rhonda C&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rsc218@...\">rsc218@...</a>&gt;<br/>\nSubject: Backyard Scientist<br/>\n<br/>\nI received this from a friend of mine and wanted to pass it on. I am <br/>\nsending this to multiple lists and apologize if anyone receives more <br/>\nthan once.  I also apologize if this has already been around the <br/>\nlists and I&#39;ve missed it due to the fact I&#39;m only two weeks behind in <br/>\nreading emails.  I confess I am not aware of all the facts <br/>\nsurrounding this issue, but am willing to help out a fellow <br/>\nhomeschooler whose books have been of great value to me.  TYIA for <br/>\nyour help to Mrs. Hoffman.<br/>\n<br/>\nRhonda in SD<br/>\n<br/>\n**************************<br/>\nYou may be aware of the books and products written by Jane Hoffman, <br/>\ncalled Backyard Scientist.  I received a call from Mrs. Hoffman this <br/>\nmorning that asked that we spread the following news as fast as <br/>\npossible.  In January a large publishing company took the logo for <br/>\nher books and products.  It is a case of a large company against one <br/>\nindividual.  She is asking that we as home schoolers pass the word <br/>\nthat she needs us to e-mail, or fax letters to her to take to a <br/>\nmeeting that will be held on June 19th (Next Monday!)  It is <br/>\nextremely important that these faxes and letters reach her by Monday <br/>\nJune 19th so that she can show support for her materials.<br/>\nShe asked that we be honest.  If we have used the products, liked the <br/>\nproducts, and equate the product name with the author&#39;s name please <br/>\nwrite!  Explain how your family liked or used her books, if you <br/>\ncontinue to use them, and if another product by the same name would <br/>\nconfuse your choice of science materials.<br/>\n<br/>\nSome examples you can use in writing your letter are as follows:<br/>\n<br/>\nI associate the name Backyard Scientist in any product or <br/>\nadvertisement with Mrs. Jane Hoffman and the quality books and <br/>\nproducts that she has produced in the 10 or more years that she has <br/>\noffered her books for sale.  Any other books or products allowed to <br/>\nuse this name would create confusion as well as become very damaging <br/>\nto Mrs. Hoffman.<br/>\n<br/>\nI respect the hours and hard work Jane Hoffman put into her logo and <br/>\nher products.  The use of the logo Backyard Scientist by any other <br/>\ncompany or individual would definitely be very confusing to me as <br/>\nwell as damaging to the original author of  the Backyard Scientist <br/>\nbooks.<br/>\n<br/>\nI have used the books, Backyard Scientist, with my children since we <br/>\nbegan homeschooling in 19__.  I have equated this name with a high <br/>\nquality material that is easy to use in the education of our children <br/>\nin the area of science.  Mrs. Hoffman&#39;s books have provided many <br/>\nhours of enjoyment for our family.  To allow another company to come <br/>\nin and blatantly use the name Backyard Scientist would be a violation <br/>\nof the time Mrs. Hoffman and her family spent developing these books <br/>\nfor use by families who wish to turn their children onto science.  It <br/>\nwould confuse many families who are looking for these particular <br/>\nbooks and products as in the home school market, advertising often <br/>\nspreads by word of mouth. <br/>\n<br/>\nMrs. Hoffman&#39;s e-mail address is: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:backyrdsci@...\">backyrdsci@...</a><br/>\nYou can also fax your letters to (949) 552-5351<br/>\nPlease write as soon as possible to show your support for Jane <br/>\nHoffman and her Backyard Scientist series. Also, please pass this <br/>\nonto any other home schoolers that you know.  <br/>\nThanks and God Bless.<br/>\nNelda Griffin</div>","specialLinks":[]}],"prevTopicId":9311,"nextTopicId":9314}}