{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Advice on dealing with impending Separation","postDate":"1297034462","msgId":59551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlEMEUxRjJDLTlFRkQtNDUzMC1BMjIwLURGMEIzRDM0RDA3RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlpbXA5MCtraWhlQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpbXA5MCtraWhlQGVHcm91cHMuY29tPg=="},"prevInTopic":59549,"nextInTopic":0,"prevInTime":59550,"nextInTime":59552,"topicId":59545,"numMessagesInTopic":0,"msgSnippet":"-=- I am planning on telling her in the next week or so about this plan (that she had no input into). So she will have 2-3 weeks to process/prepare before I","messageBody":"<div id=\"ygrps-yiv-1330059073\">-=-<br/>\nI am planning on telling her in the next week or so about this plan (that she had no input into). So she will have 2-3 weeks to process/prepare before I leave. I am buying us matching lockets to put our pictures into,... I expect her to tell me not to go, that she doesn&#39;t want me to etc. -=-<br/>\n<br/>\nI suspect it will be worse for you than for her.  <br/>\n<br/>\nShe&#39;s so young that too much preparation might be more traumatic than if you just spend that time and energy being cheery and wonderful with her.<br/>\n<br/>\n-=-Assuming our plans remain the same, any thoughts about how to talk to Marisol about this and prepare her/us would be appreciated. I came here because I know that I won&#39;t get the, &quot;It&#39;s ok, she&#39;ll be fine, you have to think about YOUR needs sometimes&quot; etc.-=-<br/>\n<br/>\nShe can be distracted and jollied by the other relatives, and that will get easier over those few days, probably.  So if you were to call (or skype, which was one of my first thoughts) it might make it worse than better, to stir it up again and again.   When you get home she might seem rejecting (or not), and she might be super needy and physically expressive (or not) so that will be a mystery package, I guess, and you&#39;ll probably end up enduring complaints and commentary for a long time, and that will give you a chance to say you don&#39;t want to do that anymore and maybe it was a bad idea.  OR she might just not mind much.  <br/>\n<br/>\n-=-... guilt and doubts about a decision I made 6 months ago to do a training to become a child-birth educator.-=-<br/>\n<br/>\nWill the job itself take you away from her in distressing ways?<br/>\n<br/>\nWill the training company give you a raincheck on the fees and course so you could wait another year, maybe?<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187853867,"authorName":"aldq75","from":"&quot;aldq75&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Advice on dealing with impending Separation","postDate":"1297028031","msgId":59549,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpbjQzditwaTlxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlpbXA5MCtraWhlQGVHcm91cHMuY29tPg=="},"prevInTopic":59547,"nextInTopic":59551,"prevInTime":59548,"nextInTime":59550,"topicId":59545,"numMessagesInTopic":0,"msgSnippet":"Has she ever spent a night away from you before or is this the first time?","messageBody":"<div id=\"ygrps-yiv-1330895397\">Has she ever spent a night away from you before or is this the first time?<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;DaBreeze21&quot; &lt;susanmay15@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi!<br/>\n&gt; <br/>\n&gt; I am struggling right now with feelings of guilt and doubts about a decision I made 6 months ago to do a training to become a child-birth educator. I am VERY excited about the training and looking forward to starting a new chapter in my life, but my guilt surrounds the fact that I am going to be away from my daughter for almost 6 days. </span></blockquote></div>","specialLinks":[]},{"userId":420800158,"authorName":"Renee Boisvert","from":"Renee Boisvert &lt;learnavecjoie@...&gt;","profile":"wrenaeb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Advice on dealing with impending Separation","postDate":"1297018811","msgId":59547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltPThzX29EVEZVM1lNRkJCTmEtU2RVZVM5ZDBFSlUyYndYcjBUQ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlpbXA5MCtraWhlQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpbXA5MCtraWhlQGVHcm91cHMuY29tPg=="},"prevInTopic":59545,"nextInTopic":59549,"prevInTime":59546,"nextInTime":59548,"topicId":59545,"numMessagesInTopic":0,"msgSnippet":"When my oldest daughter was 3, my husband went to Switzerland for 10 days. During the time that he was away, I painted one of my daughter s fingernails each","messageBody":"<div id=\"ygrps-yiv-559098766\">When my oldest daughter was 3, my husband went to Switzerland for 10 days.<br/>\nDuring the time that he was away, I painted one of my daughter&#39;s fingernails<br/>\neach day. (she had never had nail polish before that) As I painted her nail,<br/>\nwe would count the fingers with and without polish. I reminded her that when<br/>\nall of her nails were pink, THAT was the day that Daddy would be home.<br/>\n<br/>\nRenee<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Feb 6, 2011 at 10:28 AM, DaBreeze21 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:susanmay15@...\">susanmay15@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Hi!<br/>\n&gt;<br/>\n&gt; I am struggling right now with feelings of guilt and doubts about a<br/>\n&gt; decision I made 6 months ago to do a training to become a child-birth<br/>\n&gt; educator. I am VERY excited about the training and looking forward to<br/>\n&gt; starting a new chapter in my life, but my guilt surrounds the fact that I am<br/>\n&gt; going to be away from my daughter for almost 6 days.<br/>\n&gt;<br/>\n&gt; Here is the situation as it stands now. I am flying from our home in<br/>\n&gt; Washington DC to St. Louis this first week in March with our 19 month old<br/>\n&gt; son. My mom is flying there to meet us and take care of him during the day<br/>\n&gt; while I am at the training. He still nurses a lot and I knew when I made<br/>\n&gt; these plans that being away from him for the whole training was not an<br/>\n&gt; option I would consider.<br/>\n&gt;<br/>\n&gt; As our plans are now, my daughter - who will be 4 years old and 8 months<br/>\n&gt; exactly! - is staying here with my husband. His mom is also coming here to<br/>\n&gt; be with them. He may or may not go to work one or two of the days.<br/>\n&gt;<br/>\n&gt; When I made the decision in September to do this, almost 6 months ago, I<br/>\n&gt; did not discuss this with Marisol. I &quot;knew&quot; that she would tell me she<br/>\n&gt; didn&#39;t want me to do it or go. She was seeming very independent at that time<br/>\n&gt; and did particulary well with my mom, seeming almost not to &quot;need&quot; me when<br/>\n&gt; we visitied. I knew that there was no way for me to know how either of my<br/>\n&gt; kids would be in 6 months, and recognized that either of them could be in a<br/>\n&gt; &quot;needier&quot; stage. It was not a decision that I took lightly at all, but after<br/>\n&gt; a lot of soul searching, discussions with my mom and husband, I decided that<br/>\n&gt; this was a good time for me and our family to go for it.<br/>\n&gt;<br/>\n&gt; Now we are down to less than a month till the training and I am having<br/>\n&gt; doubts. Marisol cried and was very upset this morning about me going to<br/>\n&gt; church for one hour. Part of me is unsure whether she has heard me talking<br/>\n&gt; about leaving and if that is part of the issue, or if she is just in a<br/>\n&gt; &quot;need-mommy more&quot; phase (maybe both).<br/>\n&gt;<br/>\n&gt; I am planning on telling her in the next week or so about this plan (that<br/>\n&gt; she had no input into). So she will have 2-3 weeks to process/prepare before<br/>\n&gt; I leave. I am buying us matching lockets to put our pictures into,... I<br/>\n&gt; expect her to tell me not to go, that she doesn&#39;t want me to etc.<br/>\n&gt;<br/>\n&gt; In being honest with myself I am trying to see ALL the options and that<br/>\n&gt; none of this is a &quot;have to&quot;. I could not do the training. We could change<br/>\n&gt; our plans and Marisol and Mike could come to St. Louis too (which would<br/>\n&gt; involve his mother canceling or changing a flight too). Or we can leave<br/>\n&gt; things the way they are. Both of the first two involve spending additional<br/>\n&gt; money or accepting that I put a lot of time/money into something that I<br/>\n&gt; would be backing out on for now. I&#39;m going to talk to my husband about what<br/>\n&gt; he thinks too. Mostly I think it is an excersise for me to move on in the<br/>\n&gt; most positive, compassionate way.<br/>\n&gt;<br/>\n&gt; Assuming our plans remain the same, any thoughts about how to talk to<br/>\n&gt; Marisol about this and prepare her/us would be appreciated. I came here<br/>\n&gt; because I know that I won&#39;t get the, &quot;It&#39;s ok, she&#39;ll be fine, you have to<br/>\n&gt; think about YOUR needs sometimes&quot; etc.<br/>\n&gt;<br/>\n&gt; Susan<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Advice on dealing with impending Separation","postDate":"1297016928","msgId":59545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpbXA5MCtraWhlQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":59547,"prevInTime":59544,"nextInTime":59546,"topicId":59545,"numMessagesInTopic":0,"msgSnippet":"Hi! I am struggling right now with feelings of guilt and doubts about a decision I made 6 months ago to do a training to become a child-birth educator. I am","messageBody":"<div id=\"ygrps-yiv-404810359\">Hi!<br/>\n<br/>\nI am struggling right now with feelings of guilt and doubts about a decision I made 6 months ago to do a training to become a child-birth educator. I am VERY excited about the training and looking forward to starting a new chapter in my life, but my guilt surrounds the fact that I am going to be away from my daughter for almost 6 days.<br/>\n<br/>\nHere is the situation as it stands now. I am flying from our home in Washington DC to St. Louis this first week in March with our 19 month old son. My mom is flying there to meet us and take care of him during the day while I am at the training. He still nurses a lot and I knew when I made these plans that being away from him for the whole training was not an option I would consider.<br/>\n<br/>\nAs our plans are now, my daughter - who will be 4 years old and 8 months exactly! - is staying here with my husband. His mom is also coming here to be with them. He may or may not go to work one or two of the days.<br/>\n<br/>\nWhen I made the decision in September to do this, almost 6 months ago, I did not discuss this with Marisol. I &quot;knew&quot; that she would tell me she didn&#39;t want me to do it or go. She was seeming very independent at that time and did particulary well with my mom, seeming almost not to &quot;need&quot; me when we visitied. I knew that there was no way for me to know how either of my kids would be in 6 months, and recognized that either of them could be in a &quot;needier&quot; stage. It was not a decision that I took lightly at all, but after a lot of soul searching, discussions with my mom and husband, I decided that this was a good time for me and our family to go for it. <br/>\n<br/>\nNow we are down to less than a month till the training and I am having doubts. Marisol cried and was very upset this morning about me going to church for one hour. Part of me is unsure whether she has heard me talking about leaving and if that is part of the issue, or if she is just in a &quot;need-mommy more&quot; phase (maybe both).<br/>\n<br/>\nI am planning on telling her in the next week or so about this plan (that she had no input into). So she will have 2-3 weeks to process/prepare before I leave. I am buying us matching lockets to put our pictures into,... I expect her to tell me not to go, that she doesn&#39;t want me to etc. <br/>\n<br/>\nIn being honest with myself I am trying to see ALL the options and that none of this is a &quot;have to&quot;. I could not do the training. We could change our plans and Marisol and Mike could come to St. Louis too (which would involve his mother canceling or changing a flight too). Or we can leave things the way they are. Both of the first two involve spending additional money or accepting that I put a lot of time/money into something that I would be backing out on for now. I&#39;m going to talk to my husband about what he thinks too. Mostly I think it is an excersise for me to move on in the most positive, compassionate way.<br/>\n<br/>\nAssuming our plans remain the same, any thoughts about how to talk to Marisol about this and prepare her/us would be appreciated. I came here because I know that I won&#39;t get the, &quot;It&#39;s ok, she&#39;ll be fine, you have to think about YOUR needs sometimes&quot; etc.<br/>\n<br/>\nSusan</div>","specialLinks":[]}],"prevTopicId":59542,"nextTopicId":59483}}