{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Is this a proper Radical Parenting Analogy?","postDate":"1130421353","msgId":109121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdmLjY5Y2YxNjkxLjMwOTIzNjY5QGFvbC5jb20+"},"prevInTopic":109119,"nextInTopic":0,"prevInTime":109120,"nextInTime":109122,"topicId":109118,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/27/2005 7:36:36 AM Central Standard Time, SandraDodd@aol.com writes: -=-It s  about Freedom and Rights and not about do s and don ts. -=-","messageBody":"<div id=\"ygrps-yiv-608599440\">In a message dated 10/27/2005 7:36:36 AM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n-=-It&#39;s  about Freedom and Rights and not about do&#39;s and don&#39;ts. -=-<br/>\n<br/>\nI  think it&#39;s neither of those.<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nI think Sandy is on the cusp of realizing it&#39;s about principles, and not  <br/>\nrules.<br/>\n <br/>\nFreedom and Rights=principles<br/>\n <br/>\ndo&#39;s and don&#39;ts= rules<br/>\n <br/>\nKaren<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Is this a proper Radical Parenting Analogy?","postDate":"1130416414","msgId":109119,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdlLjc0YzdhYTNkLjMwOTIyMzFlQGFvbC5jb20+"},"prevInTopic":109118,"nextInTopic":109121,"prevInTime":109118,"nextInTime":109120,"topicId":109118,"numMessagesInTopic":0,"msgSnippet":"... ============================== I don t think that s a good entry point. If a young child has freedom, it should be within a framework in which he s safe","messageBody":"<div id=\"ygrps-yiv-1953681201\">In a message dated 10/27/05 5:52:07 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aplan4life@...\">aplan4life@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; A person in the home,<br/>\n&gt; despite how old or young, has freedom.  Freedom to do what they<br/>\n&gt; want...so long as it does not infringe on anothers rights within the<br/>\n&gt; home<br/>\n&gt; <br/>\n </span></blockquote>==============================<br/>\n<br/>\nI don&#39;t think that&#39;s a good entry point.<br/>\nIf a young child has freedom, it should be within a framework in which he&#39;s <br/>\nsafe and with which he&#39;s familiar.<br/>\n<br/>\n-=-So, although the child has the freedom to stay up as late as they<br/>\nwant, but they do not have the right to make noise that infringes<br/>\nupon the right to sleep of other family members. -=-<br/>\n<br/>\nI used to say midnight (&quot;try to be asleep by midnight, please&quot;), but there <br/>\nwere always possible exceptions.  When Kirby was 13 or so I said 5:00 a.m. <br/>\nbecause I thought his dad would be cranky if Kirby was still up when he left for <br/>\nwork.   Turned out Keith was NOT cranky about it, kinda thought it was cute to <br/>\nsee Kirby slaving away over a complicated video game, and so I told Kirby <br/>\n&quot;never mind.&quot;<br/>\n<br/>\nI don&#39;t think the opposite of an arbitrary bedtime is &quot;the freedom to stay up <br/>\nas late as they want.&quot;   In a way it is, but if that latter is the frenzied <br/>\nfreedom of &quot;how far can I go?&quot; it&#39;s not healthy or good.<br/>\n<br/>\nI don&#39;t think any human has a natural god-given freedom, despite the <br/>\nattractive American mythology.    In any natural or historical human group, there are <br/>\nsafety issues and issues of power and need.   If it&#39;s good for the cavemen to <br/>\nget in the cave and stay there quietly, the alpha male (or let&#39;s be <br/>\nhonest--the alpha female) is likely to enforce that.   But why would a little caveboy <br/>\nWANT to hike out, or to stay awake while others are asleep?<br/>\n<br/>\nIn any fortified city scenario (Hittites through...   now) if the guy in <br/>\ncharge says &quot;Quiet after 10:00&quot; that&#39;s that!   The guy in charge wants it quiet <br/>\nand if you want to stay inside that fortification instead of being let out in <br/>\nthe dark (or worse), you&#39;ll be quiet.    On the other hand, some guys have been <br/>\nassigned NOT to go to sleep, but to stay awake as sentries or peacekeepers.   <br/>\nThey don&#39;t have the freedom to go to sleep when they want to, either.<br/>\n<br/>\nModern English-speaking democracies seem to have it all going on, <br/>\nfreedom-wise.   But still, the cave family and walled fortress models apply to a house <br/>\nwith people in it.   Should the doors be locked at a certain time?   If the dad <br/>\nthinks so, does a kid have the right to unlock them or leave them standing <br/>\nwide open?   Should the garage door be closed, the windows latched, the lights <br/>\noff (or certain lights left on for security or safety reasons)?    Alpha male <br/>\n(or female) will probably decide that for good reasons and enforce that.<br/>\n<br/>\n-=-When the rights of<br/>\nothers in the home have been infringed upon, certain freedoms get<br/>\ntaken away fully or are cut down, until the child understands that<br/>\nit is unacceptable to be disrespectful of others within the home.<br/>\n-=-<br/>\n<br/>\nIt&#39;s easier and friendlier and more empowering to start with the closer <br/>\nrelationship and let the child have more range gradually than to tell the child (or <br/>\nyourself) that the child has &quot;rights&quot; and &quot;freedom&quot; and then take it away <br/>\ngradually.   That doesn&#39;t make philosophical sense.<br/>\n<br/>\nIf a kid&#39;s not old enough to stay home alone, he doesn&#39;t &quot;have the right&quot; to <br/>\nstay home.   But he&#39;ll probably WANT to be with his mom anyway, unless she&#39;s <br/>\nbeing tacky, arbitrary and irritating.   If the mom likes the kid and wants the <br/>\nkid to be with her, they&#39;re experiencing a mutually beneficial relationship <br/>\nand kids don&#39;t tend to want to escape those.<br/>\n<br/>\n-=-It is okay that you watch whatever movie you want, so long as you don&#39;t<br/>\nact out the violence on anyone, or watch a sexually explicit movie<br/>\nand tell small children or other children what you have seen or<br/>\nspeak obscenities around other kids. ...-=-<br/>\n<br/>\nThis seems to suggest kids watching movies without the parents&#39; sharing and <br/>\ndiscussing.   And depending how old the kid is, some movies are probably NOT at <br/>\nall cool for them to watch.   If the parents haven&#39;t seen the movie to know <br/>\nif that child can handle that material, it&#39;s irresponsible for the parent to <br/>\nsay &quot;Sure, watch it, just follow the rules for afterwards.&quot;   <br/>\n<br/>\nOne of Holly&#39;s favorite movies is Lawn Dogs.   She&#39;ll be 14 next week.   When <br/>\nshe was 11 and 12 I watched it and would pause when she was in the room, and <br/>\nadvised her that I didn&#39;t think it was a movie she should see.  There were a <br/>\ncouple of aspects I thought would disturb her.   More recently, when she was 13 <br/>\nand wanting to see more Sam Rockwell movies, I warned her it could be <br/>\ndisturbing, and watched it with her.   Had she come to a part she didn&#39;t want to see, <br/>\nshe wouldn&#39;t have hesitated to pause it, fast-forward, or just turn it off <br/>\naltogether.   Having seen it, she knows why I asked her to hold off on it.   But <br/>\nshe&#39;s trusted my advice for years, because ti was REAL advice, personalized <br/>\nfor her herself, and not an arbitrary &quot;you can&#39;t watch it becuase it&#39;s rated <br/>\nR.&quot;<br/>\n<br/>\nTo say &quot;You can watch anything you want&quot; is as inflexible as &quot;You can&#39;t watch <br/>\nanything rated R.&quot;   It&#39;s not personalized.   It&#39;s not comforting, or <br/>\nprotective or compassionate.    <br/>\n<br/>\nMy friend Caroline can watch anything she wants.   She&#39;s in her 50&#39;s.   She <br/>\nhas the right.   But she does not want to watch any movies with snakes in them. <br/>\n  So people who know that always warn her against movies with snake scenes, <br/>\nand she&#39;s grateful.<br/>\n<br/>\nChildren don&#39;t want to be afraid or disturbed, and parents can and should <br/>\nhelp them find movies they will enjoy the same way parents would find them a good <br/>\npath down a steep hill while hiking.   &quot;You can go down the mountain however <br/>\nyou want to&quot; isn&#39;t very helpful when there are cliffs and gullies full of <br/>\nthorns and perfectly good trails.<br/>\n<br/>\n-=-Matter of fact, I don&#39;t see any of you experienced ones even having<br/>\nto say &quot;not to do that&quot; because I have a strong feeling that they<br/>\nnaturally wouldn&#39;t.  KWIM? -=-<br/>\n<br/>\nWe talk all the time about the differences in families caused by religion or <br/>\nparental trauma or personality differences, and about not rocking other kids&#39; <br/>\nboats, and about other people having the right NOT to be grossed out or afraid <br/>\n(kinda related to &#39;keep your boogers in your nose until you&#39;re in private&#39;).<br/>\n<br/>\n-=-It&#39;s about Freedom and Rights and not about do&#39;s and don&#39;ts. -=-<br/>\n<br/>\nI think it&#39;s neither of those.<br/>\nIt&#39;s ideally, as I see it, about learning to make decisions.<br/>\n<br/>\nPracticing that is going to result is some not-so-great decisions, but <br/>\npracticing on small things, inexpensive and not life-threatening things, is better <br/>\nthan waiting until late teens for the first tastes of freedom, responsibility <br/>\nand decisionmaking.<br/>\n<br/>\nParents could make ALL decisions for children, legally.   And ethically, <br/>\nmaking all is better than making NONE.   But there should be balance.   Pretending <br/>\nthat the child has all the legal rights of the adult, and all the <br/>\nresponsibilities, is not balance.   It&#39;s not honest or healthy or true, either.    The <br/>\nmost non-coercive family in the world really DOES need to buy clothes for their <br/>\nkids and persuade them to wear them in publiic, unless the parents are not <br/>\nparticular about whether the child lives with them or in the custody of social <br/>\nservices.   &quot;Whatever&quot; isn&#39;t compassion or care.<br/>\n<br/>\nParents can delegate a lot of decisionmaking, but they can&#39;t let go <br/>\naltogether.<br/>\n<br/>\nMy kids have a lot of freedom, but they came to that trust through years and <br/>\nyears of little good-decision moments, and from handling little situations <br/>\nwell.   Now I would trust them with big situations, but it didn&#39;t happen all of a <br/>\nsudden.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":175529137,"authorName":"aplan4life","from":"&quot;aplan4life&quot; &lt;aplan4life@...&gt;","profile":"aplan4life","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Is this a proper Radical Parenting Analogy?","postDate":"1130412280","msgId":109118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRqcWRkbys5cGIwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":109119,"prevInTime":109117,"nextInTime":109119,"topicId":109118,"numMessagesInTopic":0,"msgSnippet":"I never give advice on any of these questions because we are not there yet...LOL  However, after reading many of your posts, I just want to check if I m","messageBody":"<div id=\"ygrps-yiv-132682869\">I never give advice on any of these questions because we are not <br/>\nthere yet...LOL  However, after reading many of your posts, I just <br/>\nwant to check if I&#39;m understanding things properly....<br/>\n<br/>\nWe have laws in this country to protect the rights of others, not <br/>\nall are good and some are downright stupid; usually the ones that <br/>\ntell us what we can/cannot do in our own homes...those need to be <br/>\naxed, those kind of laws infringe on how people are, therefore an <br/>\nattempt to control people.  There are laws meant to keep peace, like <br/>\nnot starting your hammering or power tools up at 7 am and/or doing <br/>\nloud construction, blaring music, etc. til&#39; all hours of the night, <br/>\nmaking it hard for your neighbors to sleep.  Laws like that are not <br/>\nreally made for respectful people who are considerate and would <br/>\nnever do that just because they have principles and care about <br/>\nothers.<br/>\n<br/>\nI was thinking this morning about Radical Unschooling and have to <br/>\nadmit that at first, I thought it was a permission slip for <br/>\ndisaster.  I DO NOT ANYMORE! :-)  Now I see it kind of like our <br/>\nsystem in the US.  (Whether my husband will ever understand is one <br/>\nthing, but then again, he isn&#39;t the one reading and seeking answers <br/>\nto learn what I &quot;think&quot; I have learned)  A person in the home, <br/>\ndespite how old or young, has freedom.  Freedom to do what they <br/>\nwant...so long as it does not infringe on anothers rights within the <br/>\nhome; i.e.  a person needs to have a good nights sleep (at least I <br/>\ndo), in order to function properly the next day and you certainly <br/>\ncannot go to work tired the next day because of being kept awake.  <br/>\nSo, although the child has the freedom to stay up as late as they <br/>\nwant, but they do not have the right to make noise that infringes <br/>\nupon the right to sleep of other family members.  When the rights of <br/>\nothers in the home have been infringed upon, certain freedoms get <br/>\ntaken away fully or are cut down, until the child understands that <br/>\nit is unacceptable to be disrespectful of others within the home.<br/>\n<br/>\nOther areas I can see this now are with television. This is an <br/>\nexample, I don&#39;t know because we haven&#39;t let loose the reigns: It is <br/>\nokay that you watch whatever movie you want, so long as you don&#39;t <br/>\nact out the violence on anyone, or watch a sexually explicit movie <br/>\nand tell small children or other children what you have seen or <br/>\nspeak obscenities around other kids.  Although it is alright for you <br/>\nto watch those movies, some people are not ready for their children <br/>\nto hear those things. You can imagine pissed I was, when my daughter <br/>\nwas 6 and a 5 year old boy said &quot;I want to have sex with you, like <br/>\nNeo does to Trinity.  &#39;I want to have sex with you and wiggle&#39;, &#39;I <br/>\nwant to put my pee-pee in you like they do in the movies, etc. <br/>\netc.&quot;   My daughter already knew what sex was in a general sense <br/>\nbecause we talk about it for reasons of protection of her body and <br/>\nwhat is not allowed to be touched, etc.  But a 5 year old child <br/>\ntalking like that bothers me.  However, I highly doubt, that in a <br/>\nloving environment produced from a radical unschooling, natural <br/>\nparenting that any of your children would have ever said a thing <br/>\nlike that. I cannot see that happening with your children at all.  <br/>\nMatter of fact, I don&#39;t see any of you experienced ones even having <br/>\nto say &quot;not to do that&quot; because I have a strong feeling that they <br/>\nnaturally wouldn&#39;t.  KWIM?  <br/>\n<br/>\nI see this now with the food issues also.  A child is not infringing <br/>\non an adults rights by eating when they feel like it and not at a <br/>\nset supper time, or eating what they want.  It would be an <br/>\ninfringement though if they went and took a brand new package, can, <br/>\netc. and threw it in the trash or dumped it down the garbage <br/>\ndisposal just for the heck of it (my reasoning is that most people <br/>\ncan&#39;t afford to have that go on and can&#39;t just over look it)that <br/>\ncost mom and/or dad money or that was something a sibling had bought <br/>\nand desired.  Again, raised in a home with principles, it&#39;s one of <br/>\nthose things that would more than likely never have to be spoken, as <br/>\na &quot;don&#39;t do that&quot; because it just wouldn&#39;t happen.<br/>\n<br/>\nIt&#39;s about Freedom and Rights and not about do&#39;s and don&#39;ts.  Enjoy <br/>\nyour freedom, so long as it doesn&#39;t infringe upon the rights of <br/>\nothers.  If you misuse your freedoms, they will be dwindled down or <br/>\ncutoff, in the area of freedom that you have caused anothers rights <br/>\nto be violated.  Am I close or am I waaaaaay off?<br/>\n<br/>\n~Sandy, who is really trying her hardest to &quot;get this&quot;  :-)</div>","specialLinks":[]}],"prevTopicId":109120,"nextTopicId":109117}}