{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":5110492,"authorName":"Ned","from":"Ned &lt;les.carlson2@...&gt;","profile":"lmncarlson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:Reading, Spelling, Boston Accent","postDate":"1009193899","msgId":30209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNDMjcxM0FBLjExNDNCREVFQHN5bXBhdGljby5jYT4=","referencesHeader":"PDEwMDkxODgwNzIuMzMwLjIxMzUyLm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":30208,"nextInTime":30210,"topicId":30209,"numMessagesInTopic":0,"msgSnippet":"I think that Leslie made the first reference to a Boston accent here. She was referring to the flavour of the speech of some children (non-Bostonian) until","messageBody":"<div id=\"ygrps-yiv-2044213875\">I think that Leslie made the first reference to a &quot;Boston accent&quot; here.<br/>\n<br/>\nShe was referring to the flavour of the speech of some children (non-Bostonian) until they&#39;re able to distinguish and to make certain sounds (&lt;r&gt; and &lt;l&gt; in particular come to mind).  This isn&#39;t the same as growing up with a regional accent where certain sounds are made differently from &quot;Standard American&quot; and, &quot;car&quot;, say, is pronounced &quot;caah&quot; by many speakers.  Now<br/>\nI&#39;ll try to describe the difference.  The Boston child hears &quot;r&quot; in the adult speakers &quot;caah&quot;, my Toronto/Vancouver son (who also had this flavour to his speech) wouldn&#39;t have been sure quite what sound he was hearing when her heard us all say say &quot;carrr&quot;.  Anyhow, this is my understanding of it.<br/>\n<br/>\nHis speech slowly cleared up, although there were a few years when my husband (who has his own difficulties distinguishing sounds) often couldn&#39;t understand what our son was saying (but he&#39;s ALWAYS had this problem with my utterances, so I don&#39;t really know how much of it really  IS distinguishing sounds&lt;g&gt;). He was in school for grade 1 and did some speech therapy,<br/>\nbut I don&#39;t know how effective it was.<br/>\n<br/>\n My son learned to read very well at age 8ish.<br/>\n<br/>\nHis writing and spelling, however, were unspeakably inaccurate.  I was always a great speller and loved to write, so this time was challenging for me.  Although I wanted to just give it time, I admit to intervening a few times, with no real results.<br/>\n<br/>\nAt about 11 he got his hands on a computer. He did a little Mavis Beacon.  This year he began to correspond with people on (mostly Yahoo) lists which relate to his interests (computer games and gaming, urban transit, monorails, model rocketry) and to play games on-line (Warcraft and Ultima), which allow players to type  conversations .<br/>\n<br/>\nLo and behold his spelling has cleared up just as his speech did.<br/>\n<br/>\nWhat caused it? Maturing of some parts of his brain, I guess, combined with the need to communicate in print.<br/>\n<br/>\nWhen I read one of his posts, I can&#39;t usually tell that he&#39;s only 13.  Not only that, but when he writes in that shorthand that gamers seem to use, his shorthand is sometimes longhand (he seems to use apostrophes, capitalizes &quot;I&quot; and types out &quot;you&quot;). Handwritten stuff is still sometimes iffy, but that&#39;s more about impatience and slow motor coordination than not<br/>\nknowing how to spell.<br/>\n<br/>\nFor him, these developments seem to come in spurts.  As his height shot up five  inches this year, so his spelling improved immensely. I&#39;m awestruck by the changes in him.<br/>\n<br/>\nJoan</div>","specialLinks":[]}],"prevTopicId":30188,"nextTopicId":30210}}