{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":210979776,"authorName":"Jacqueline Parks","from":"Jacqueline Parks &lt;ivorygrace7@...&gt;","profile":"ivorygrace7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: Are you guys sure this is going to work???","postDate":"1114650397","msgId":105677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMDA1NzU5MDUwNDI3MTgwNjc0OGI3M2YwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGQ0b3RqYSt1aWZlQGVHcm91cHMuY29tPg==","referencesHeader":"PGQ0b284ZiszYzdwQGVHcm91cHMuY29tPiA8ZDRvdGphK3VpZmVAZUdyb3Vwcy5jb20+"},"prevInTopic":105664,"nextInTopic":0,"prevInTime":105676,"nextInTime":105678,"topicId":105663,"numMessagesInTopic":0,"msgSnippet":"*****I am just having serious doubts that she ll get tired of the computer and want to do anything else.***** We first got at home internet access in October","messageBody":"<div id=\"ygrps-yiv-751778792\">*****I am just having serious doubts that she&#39;ll<br/>\nget tired of the computer and want to do anything else.*****<br/>\n<br/>\n<br/>\nWe first got at home internet access in October 2003, and 24 hours a<br/>\nday was not enough time for my five children and me to explore.  We<br/>\nfought over time and continuously had to compromise.  Someone was on<br/>\nthe computer at every moment with sleep schedules staggered to squeeze<br/>\nout every second of computer time.  No one thought they had enough. <br/>\nWere we exploring all the wonderful information available here?  Not<br/>\nreally, the kids mostly played Neopets, and I mostly read email lists<br/>\nespecially this one.  &lt;g&gt;<br/>\n<br/>\nDo we still do that?  No.  Eventually our interests moved on and now<br/>\nmy 7 and 11 yo dd&#39;s rarely use the computer.  I could just see a more<br/>\ntraditionally inclined parent trying to limit them back then and now<br/>\nforcing them, lol!  I still use the computer about 8 hours a day, but<br/>\nfor a wide variety of things.  My 11 yo ds and 8 yo dd use it<br/>\nregularly for email, a few games, writing, and occasionally looking<br/>\nthings up.  My 16 yo dd progressed from a few months of nothing but<br/>\nNeopets to managing several websites, doing paid graphic design work,<br/>\nwriting award winning fan-fic, and keeping the entire family up on<br/>\ncurrent events.  She also currently spends around 8 hours a day on the<br/>\ncomputer.<br/>\n<br/>\nI wouldn&#39;t worry.  If you don&#39;t restrict her, she will find the path<br/>\nthat is best for her.  Of course, if her activities are seriously<br/>\naffecting other family members in a negative way some compromise might<br/>\nbe in order, not just by her but by others too.<br/>\n<br/>\n~Jacqueline</div>","specialLinks":[]},{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Are you guys sure this is going to work???","postDate":"1114634666","msgId":105664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ0b3RqYSt1aWZlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGQ0b284ZiszYzdwQGVHcm91cHMuY29tPg=="},"prevInTopic":105663,"nextInTopic":105677,"prevInTime":105663,"nextInTime":105665,"topicId":105663,"numMessagesInTopic":0,"msgSnippet":"... And I m guessing that for those two years you argued, limited, bargained, etc can t use the computer until you get your schoolwork/chores/whatever","messageBody":"<div id=\"ygrps-yiv-650828290\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;greencow32766&quot; <br/>\n&lt;McGeath3@a...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; get tired of the computer and want to do anything else.  We&#39;ve had <br/>\n&gt; problems for 2 years with her &quot;obsession&quot; with the computer - <br/>\n&gt; Tracie<br/>\n </span></blockquote>And I&#39;m guessing that for those two years you argued, limited, <br/>\nbargained, etc &quot;can&#39;t use the computer until you get your <br/>\nschoolwork/chores/whatever done...&quot; Now she&#39;s got the freedom to <br/>\nindulge herself at will. Ever had anyone tell you you *can&#39;t* have <br/>\nsomething (M&Ms, cookies, a bubble bath, whatever) until...? And you <br/>\nspent all that time thinking about it most likely and counting <br/>\nminutes until you could... And you counted and grabbed those M&Ms as <br/>\nquickly and as many as you could manage before they were again <br/>\nrestricted. Same thing she&#39;s doing right now. And it&#39;s only been a <br/>\nshort time.<br/>\n<br/>\nFlip side is that there may be things that cannot be rescheduled <br/>\nwithout cost or pain. That&#39;s when you two sit down and figure out a <br/>\ncompromise - you need her to be able to get up in the morning, she <br/>\nwants to play this game and whatall, is she willing to be home by <br/>\nherself (if she&#39;s old enough), all that stuff. Talk it out- LOTS of <br/>\ntalk. If there&#39;s one big common denominator I&#39;ve seen in all <br/>\nunschooling households is lots of TALK, for fun, for information, <br/>\nfor connection, for arriving at compromise to keep the *family* <br/>\nrunning relatively smoothly.<br/>\n<br/>\nAs far as the &quot;other people&quot;, again, sit down and discuss with her <br/>\nfreely, not to &#39;get&#39; her to do these things but rather &quot;These people <br/>\nare waiting on you for this. Do we need to tell them it&#39;s on hold <br/>\nfor now?&quot; (not worded well but you get the gist).<br/>\n<br/>\nCousin-wise, get her involved in the planning for their visit - she <br/>\nmight use the Internet to find interesting things to do for the time <br/>\nthey are in town, for example. Have her type up and print out a <br/>\nlist. USE her computer skills to make things fun for all. It&#39;s <br/>\npossible that by the time they arrive (if they&#39;re in school they <br/>\nlikely won&#39;t be there for at least a month from now or longer), she <br/>\nmight have eaten her fill on this game and be willing to ease back <br/>\nsome.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":56474202,"authorName":"greencow32766","from":"&quot;greencow32766&quot; &lt;McGeath3@...&gt;","profile":"greencow32766","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Are you guys sure this is going to work???","postDate":"1114629199","msgId":105663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ0b284ZiszYzdwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":105664,"prevInTime":105662,"nextInTime":105664,"topicId":105663,"numMessagesInTopic":0,"msgSnippet":"I m going to drive you all crazy I just know it!  Okay, I think it s been at least 2 weeks (I hope it s been that long)that I posted here and got some great","messageBody":"<div id=\"ygrps-yiv-1722336834\">I&#39;m going to drive you all crazy I just know it!  Okay, I think it&#39;s <br/>\nbeen at least 2 weeks (I hope it&#39;s been that long)that I posted here <br/>\nand got some great advice - the main thing being to just say school <br/>\nis done for the year, no more me asking her every day what she wants <br/>\nto do, filling her backpack with things to do while I work - to just <br/>\nback off!<br/>\n<br/>\nSince then, my daughter has LIVED on the computer, she discovered a <br/>\nnew game and the normal routine is for her to stay up until 2am, <br/>\nwatch Roseanne until 3am, read a little bit  and probably fall asleep <br/>\nby 4am or so.  She&#39;ll sleep in until anywhere between 2-3pm in the <br/>\nafternoon when all her friends get home from school then she&#39;s on the <br/>\nphone and playing this new game on the computer.  We are talking 11 <br/>\nhours on the computer most days.  This new schedule has stopped her <br/>\ngoing to chorus at school, she missed the last two art classes <br/>\nthrough our homeschool co-op which she liked going to but today was <br/>\nthe last one and she didn&#39;t want to get up for it. I&#39;m going to work <br/>\nfor a couple of hours in the morning which is okay I guess although <br/>\nshe&#39;s a little nervous about staying home alone so if she was awake <br/>\nshe&#39;d be nervous. I also know this new schedule makes it impossible <br/>\nfor me to keep certain scheduled appointments so I&#39;m having to cancel <br/>\nappointments and reschedule.   <br/>\n<br/>\nHer cousins are coming to stay with us for 8 weeks this summer and <br/>\nI&#39;d love to be able to take everyone to the park, beach, library <br/>\netc... but I&#39;m afraid that if I don&#39;t limit her computer time, she&#39;ll <br/>\nnot be starting her day until 3pm in the afternoon and her two <br/>\ncousins will have been waiting around all day for her - she&#39;s not <br/>\neasy to wake up.<br/>\n<br/>\nThis just seems like she&#39;s living a total seperate life than everyone <br/>\nelse.  She expressed an interest in a few 4H projects and earning the <br/>\nGirl Scout Silver Award so we bought several books etc... for these <br/>\ntwo things and she did a little until I backed off and now she&#39;s just <br/>\non the computer.  I haven&#39;t mentioned them but I&#39;ve got the 4H leader <br/>\nand people in our girl scout troop wanting her to come work with them <br/>\non different things and now she doesn&#39;t seem interested anymore.  <br/>\n<br/>\nI guess I&#39;m a bad parent, I am just having serious doubts that she&#39;ll <br/>\nget tired of the computer and want to do anything else.  We&#39;ve had <br/>\nproblems for 2 years with her &quot;obsession&quot; with the computer - this <br/>\ncaused a lot of problems when she was in school and had homework to <br/>\ndo.....I&#39;m trying to look at it as the computer is her passion and <br/>\nwho knows where that could lead and she&#39;s been saying she wants to <br/>\ncreate computer security systems for banks - that&#39;s great but how is <br/>\nplaying this game related to that?<br/>\n<br/>\nAHHHHHH!!!!<br/>\nTracie</div>","specialLinks":[]}],"prevTopicId":36220,"nextTopicId":105678}}