{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":12116257,"authorName":"michele-nappi@webtv.net","from":"michele-nappi@...","profile":"whitelight_2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]","postDate":"1033830947","msgId":45425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3ODgxLTNEOUYwMjIzLTExMzZAc3RvcmVmdWxsLTIzNzEucHVibGljLmxhd3Nvbi53ZWJ0di5uZXQ+","inReplyToHeader":"VW5zY2hvb2xpbmctZG90Y29tQHlhaG9vZ3JvdXBzLmNvbSdzIG1lc3NhZ2Ugb2YgNCBPY3QgMjAwMgkwNzo0MDoxMSAtMDAwMA=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":45424,"nextInTime":45426,"topicId":45425,"numMessagesInTopic":0,"msgSnippet":"Hi to all. Speaking of breastfeeding I breastfed all of my kids - 6 - for various lengths of time. The last child I breastfed for 5 years. My husband and other","messageBody":"<div id=\"ygrps-yiv-305614051\">Hi to all. Speaking of breastfeeding I breastfed all of my kids - 6 -<br/>\nfor various lengths of time. The last child I breastfed for 5 years. My<br/>\nhusband and other kids wanted me to stop so I did.<br/>\nFour of my kids still live at home and we have two teenaged girls living<br/>\nwith us - so it is 6 again. A week ago a 16 year old - &quot;B&quot; = came to us.<br/>\nShe knew one of my daughters. She told me her mom keeps telling her she<br/>\ndoesn&#39;t want her. They have arguements often. In a way it sounds like<br/>\nthe typical teen years. She was adopted at 6 months so these are the<br/>\nonly parents she knows. She is black and they are not. She has a strong,<br/>\ndominant personality. She is loud. We are usually fairly quiet. I put<br/>\ntogether a contract and she signed it. She promptly broke it. It was<br/>\nabout curfew. The 5 eldest went out last night. &quot;B&quot; was confronted by<br/>\nanother teen girl and this girls boyfriend called &quot;B&quot; the &quot;n&quot; word. &quot;B&quot;<br/>\nTook the girl down after the girl pulled her hair extensions and slapped<br/>\nher face. This scenario has been building up since the other girl &quot;L&quot;<br/>\ncame to live  us. This same girl who hit &quot;B&quot; has had it out for &quot;L&quot; (who<br/>\nhappens to be a Ford model) because whe asked if the girls boyfriend<br/>\nwould buy her a sandwich in a flirtatous manner. The girl was so jealous<br/>\nthat she began a crusade to get &quot;L&quot;- the scanky &quot;b&quot; word. What drama!<br/>\nAny way there was a football game in our town and they all went and<br/>\nended up in the fight in one way or another. The police were called. One<br/>\nwoman who knew little - if at all - said &quot;the black girl started it.&quot; I<br/>\nhope the energy has dissapated from the situation now. The police said<br/>\nthere is no harassment law in Vermont. They lie so often I am not sure<br/>\nif there is or not.Everyone was told to break it up. That was about it.<br/>\nMy 14 year old son feels the need to defend his sisters and any other<br/>\nfemale. He told the 6 foot - very large guy - in a loud way to never<br/>\ncall &quot;B&quot; an &quot;n&quot; name again. The poor kid has been called a &quot;little man&quot;<br/>\n3 times this summer by 3 other guys he has told to leave his sisters<br/>\nalone. At this point we could write a play... My son has the personality<br/>\nof a bull moose in heat at times.:) We talked it all out. I met with<br/>\n&quot;B&#39;s&quot; parents. They said they have been in family counseling. The father<br/>\nseems to protect his daughter (like my son) and the mother seems a bit<br/>\nangry and says her daughter feels she can do nothing wrong. I am not<br/>\ngetting in the middle of that. They thanked us for offering her a safe<br/>\nplace to live. She seems to prefer male company. She gets along with her<br/>\nfather, grandfather and has a male best friend. She is listening to me<br/>\nso far. Someone asked &quot;why are you putting this upon yourself?&quot; It<br/>\nseemed like the thing to do at the time. The parents are grateful and<br/>\nthe kids are as safe as they choose to be. They are 21, 17 (almost 18),<br/>\n17, 16, and 14. Michele<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":45403,"nextTopicId":45433}}