{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":34,"messages":[{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291672218","msgId":58391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3QTU2NjJGRTcwQTQ0MEE4OERFMTdBRkVBMzg1OUJBQENvbm5pZVBDPg==","inReplyToHeader":"PDRDRkQxRTY3LjMwNDA2MDhAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRkQxRTY3LjMwNDA2MDhAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58390,"nextInTopic":58392,"prevInTime":58390,"nextInTime":58392,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... If I remember correctly, your children are 2 and 4. Have you always put out presents and told them that they were from Santa? A lot of people don t do it","messageBody":"<div id=\"ygrps-yiv-577913855\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;This is very true for me. So how do we engage in Santa with this in mind. That is my question. I can see for myself that engaging in the Santa myth is about making the parent happy and playing out the parents fantasy. And not about providing a rich and supportive environment for them to discover and explore and figure out what they want to have (as you wrote).&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>If I remember correctly, your children are 2 and 4. Have you always put out presents and told them that they were from Santa? A lot of people don&#39;t do it from day one without any problems. Are you asking if you should tell your children and stop putting out presents from Santa because you are getting a lot of joy and happiness out of it? Are your children happy with the way things are done now? Have your children actually asked you if Santa is real? Are you looking for answers based on what you think might happen with your children or are you asking because your children have actually asked you if Santa is real?  <br/>\n<br/>\nWhat kind of personality do your children have? Do they like to engage in pretend and make believe? Are your children focused on facts and figures? <br/>\n<br/>\nHave your children shown any distress about Santa? Some kids find Santa creepy and scary. &quot;He knows when you&#39;ve been good, he knows when you&#39;ve been bad, he sees you when you&#39;re sleeping, he sees when you&#39;re awake&quot; sounds a bit like a stalker and might freak some kids out. <br/>\n<br/>\nYou don&#39;t have to answer any of these questions on list but they are things to think about when trying to figure out how to address Santa in your house. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;I love and agree with so much of what you have wrote. But what about when you children ask you with Santa really does exist or does Santa leave those presents. I am not advocating that the world NEEDS to know my truth about Santa. And preach to the word and try to break our fantasies and fun. I am just trying to be honest and caring with my kids.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Have your children actually asked those questions yet? Have they shown any interest in knowing those questions? It is really hard to understand responses if you are asking about a purely hypothetical situation. I know from my own experience that I try to avoid reading and participating in threads about teenagers because most of it is completely foreign to me. I can&#39;t imagine what it will be like to be in the situations that are posed because my oldest is only 9. I read and gather tools and ideas because some of the things mentioned are beyond my comprehension at this moment in time. I soak up the information provided even if I don&#39;t agree with it right now because there have been a lot of times that I encounter a situation that has been discussed on the list and it is like a light bulb goes off. <br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Santa Myth: Make-believe or believe?","postDate":"1291667618","msgId":58390,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkamhiMisxMHR2MUBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PDRDRkQxRTY3LjMwNDA2MDhAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58385,"nextInTopic":58391,"prevInTime":58389,"nextInTime":58391,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... Adam, I m having a hard time understand your writing - do you mean that engaging in the Santa myth would make You happy and you re skeptical of that -","messageBody":"<div id=\"ygrps-yiv-1840384263\">Adam Dealan-de &lt;adam@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I can see for myself that engaging in the <br/>\n&gt; Santa myth is about making the parent happy and playing out the parents <br/>\n&gt; fantasy.<br/>\n<br/>\n </span></blockquote>Adam, I&#39;m having a hard time understand your writing - do you mean that &quot;engaging in the Santa myth&quot; would make You happy and you&#39;re skeptical of that - afraid you&#39;ll prioritize your happiness over your child&#39;s? <br/>\n<br/>\nIf playing Santa will make you feel good about christmas, play Santa. Dig into this long thread full of ideas for how you can make it playful, and then, most important of all, see what happens, see how your kids react. Are you afraid you&#39;ll go overboard and turn it into some giant drama? A &quot;be good or no Santa?&quot; sort of scenario? You can choose not to do that - to catch yourself and say &quot;no, that&#39;s not what I mean, I&#39;m being silly, my parents used to say that to me and its not true&quot;. <br/>\n<br/>\nYou can choose, each time, to keep your own focus on joy and wonder *and* what you see as the truth. This isn&#39;t a once-and-for-all thing. Whatever you decide this moment isn&#39;t set in stone! <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;And not about providing a rich and supportive environment for <br/>\n&gt; them to discover and explore and figure out what they want to have (as <br/>\n&gt; you wrote).<br/>\n<br/>\n </span></blockquote>You can go too far with that kind of thinking and see every book and story and toy as a limit you&#39;re placing on your child&#39;s mind. Look at the idea from another direction. Playing the Santa game doesn&#39;t prevent your child from playing other games, too. It doesn&#39;t necessarily make his world and thinking smaller. It can be just one thing about your family. <br/>\n<br/>\nIf you&#39;re worried that playing Santa will somehow limit your child&#39;s world, look for other fun things to do around christmas and winter, too. Look for other sources of magic and make-believe, but also look to your child - what makes him light up with wonder? You may find that Santa is second best to saving icicles in the freezer, or making snow-angels, or making bird-feeders out of pinecones, or hunting for perfect round stones in a creek-bed. Santa, or his absence, won&#39;t make those things any less wonderful. <br/>\n<br/>\nHave you read the book Playful Parenting? maybe that would help you have more fun without getting bogged down in wondering where &quot;pretend&quot; becomes &quot;lying&quot;. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291661886","msgId":58384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9b0xlbU9vY3c0UGttaDBWRDAwakdzcVFtcWFKPVUzSzVlZEtLMUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRDRkQxOTNDLjYwMjAzMDdAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRkQxOTNDLjYwMjAzMDdAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58382,"nextInTopic":58385,"prevInTime":58383,"nextInTime":58385,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... children when they learn they have been deceived.  How can we keep the magic and play without lying?","messageBody":"<div id=\"ygrps-yiv-1518537542\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I have also heard stories on this thread and elsewhere about the hurt and embarrassment felt by<br/>\n </span></blockquote>children when they learn they have been deceived.  How can we keep the<br/>\nmagic and play without lying?&lt;&lt;&lt;<br/>\n<br/>\nHow often do we lose the moment by formulating or decoding stuff about<br/>\nthe past and the future (usually our own past or future). For me, the<br/>\nanswer to that is &quot;too often.&quot; I feel it&#39;s so important to think<br/>\nthings through.<br/>\n<br/>\nBut I have missed probably trillions of moments by doing that to excess.<br/>\n<br/>\nHow do you know your child would be bothered by the Santa myth? I<br/>\ndon&#39;t remember (and I don&#39;t need to know) if  you have already told<br/>\nthe Santa story. If so, does it look to you that your child is<br/>\ndistressed by it? Has your child made comments or asked questions that<br/>\nexpressed disillusionment about the Santa myth?<br/>\n<br/>\nHas your child expressed delight in Santa that you fear for? Who is<br/>\nuncomfortable? This is not that far from the &quot;binkie&quot; thread, to my<br/>\nway of thinking.<br/>\n<br/>\nIs anything happening right now?<br/>\n<br/>\nI remember when Karl was a lot younger, how it was totally helpful for<br/>\nme to hear that I should prefer to look at my child over looking to<br/>\nadvice or asking for ideas about how to avoid stuff.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291658366","msgId":58385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluazZnYmlFN1NFMnpYWV9pbWo9Ty13LTJpK1N3emZNTE5FQWYwNkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRDRkQxRTY3LjMwNDA2MDhAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRkQxRTY3LjMwNDA2MDhAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58384,"nextInTopic":58390,"prevInTime":58384,"nextInTime":58386,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"I have a 9 year old daughter and when she was younger she believed in Santa. And we live in India, so Santa comes through stories and movies. She is starting","messageBody":"<div id=\"ygrps-yiv-785024031\">I have a 9 year old daughter and when she was younger she believed in Santa.<br/>\nAnd we live in India, so Santa comes through stories and movies. She is<br/>\nstarting to see the truth in many things. When she asked me about Santa and<br/>\nother magical things, I say &quot;perhaps&quot; they do exist. Actually there is so<br/>\nmuch in this universe that is beyond the understanding of this logical mind,<br/>\nthat I am never too certain to say &quot;NO IT IS A LIE&quot;.<br/>\n<br/>\nBut then in India we have Hanuman, the monkey god. Ganesh the elephant god,<br/>\nDurga with 10 hands, Krishna, the avatar of Vishnu, the one who danced onthe<br/>\nthree hooded kalia serpent, and the sun god and moon god and yet we have<br/>\nscientists who are sending missions into the space, making nuclear power<br/>\nplants and creating great art and music and literature. And all kids grow up<br/>\nwith these stories in India. So what do we know of myths and legends and<br/>\nmagical creatures!!<br/>\n<br/>\nI would suggest &quot;just take it easy&quot;. It is only Santa and he brings joy and<br/>\nhappiness. They are all just symbolic of the immense goodness, strength,<br/>\nspirit, compassion and generousity that we as humans have.<br/>\n<br/>\nGood luck.<br/>\n<br/>\n<br/>\n<br/>\nOn Mon, Dec 6, 2010 at 11:03 PM, Adam Dealan-de &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:adam@...\">adam@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; Joyce: This says your kids aren&#39;t others with the right to have their<br/>\n&gt; beliefs. Your kids are yours to mold and shape into the form you<br/>\n&gt; prefer them to have.<br/>\n&gt;<br/>\n&gt; Not at all. My words were not accurate. What I am saying is that what<br/>\n&gt; others choose to believe is their right as it is my childrens right.<br/>\n&gt; But it is up to me as to how I interact with my kids. I do shape and<br/>\n&gt; mold them even if unconsciously. By my choices and actions no matter<br/>\n&gt; how allowing and unintrusive. My kids see what I like and what I<br/>\n&gt; believe played out and and are affected by this. My kids are in a<br/>\n&gt; separate category only in that they are so close and so influenced by me.<br/>\n&gt;<br/>\n&gt; Joyce: All parents, even the best meaning ones, have an idea of what they<br/>\n&gt; want for their kids. The far extreme might be a Harvard educated<br/>\n&gt; doctor. The other end might be happy. It&#39;s easy to see how molding a<br/>\n&gt; child into a doctor is about the parent, not about the child. It&#39;s<br/>\n&gt; less easy to see how wanting a child to be knowledgeable or logical or<br/>\n&gt; informed about healthy eating or loving to read is not about the<br/>\n&gt; child. It&#39;s very hard to see how wanting a child to be happy *can be*<br/>\n&gt; not about the child also.<br/>\n&gt;<br/>\n&gt; This is very true for me. So how do we engage in Santa with this in<br/>\n&gt; mind. That is my question. I can see for myself that engaging in the<br/>\n&gt; Santa myth is about making the parent happy and playing out the parents<br/>\n&gt; fantasy. And not about providing a rich and supportive environment for<br/>\n&gt; them to discover and explore and figure out what they want to have (as<br/>\n&gt; you wrote).<br/>\n&gt;<br/>\n&gt; Joyce: It&#39;s about trusting they won&#39;t always be the same and an idea<br/>\n&gt; that works<br/>\n&gt; for their today self may not work for their tomorrow self and they&#39;ll<br/>\n&gt; try something else.<br/>\n&gt;<br/>\n&gt; I love and agree with so much of what you have wrote. But what about<br/>\n&gt; when you children ask you with Santa really does exist or does Santa<br/>\n&gt; leave those presents. I am not advocating that the world NEEDS to know<br/>\n&gt; my truth about Santa. And preach to the word and try to break our<br/>\n&gt; fantasies and fun. I am just trying to be honest and caring with my kids.<br/>\n&gt;<br/>\n&gt; Joyce: But if a parent has ideas about those they&#39;d like to get into their<br/>\n&gt; kids heads, they will do the unschooling atmosphere of their home a<br/>\n&gt; favor by avoiding those until the parent can listen to his or her<br/>\n&gt; children&#39;s ideas without feeling a need to share their own.<br/>\n&gt;<br/>\n&gt; I agree and do struggle with this. I really dislike Barbie but know<br/>\n&gt; that my daughter loves to play Barbiegirl online and really loves this<br/>\n&gt; world. And she is learning a ton by it.<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291657974","msgId":58382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwQUEzMkY2LTNGOEEtNEVGNS1BNDY2LUM0MTI1N0NDRTkzNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRDRkQxRTY3LjMwNDA2MDhAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRkQxRTY3LjMwNDA2MDhAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58381,"nextInTopic":58384,"prevInTime":58381,"nextInTime":58383,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"-=-Joyce: This says your kids aren t others with the right to have their beliefs. Your kids are yours to mold and shape into the form you prefer them to have. ","messageBody":"<div id=\"ygrps-yiv-717046559\">-=-Joyce: This says your kids aren&#39;t others with the right to have their<br/>\nbeliefs. Your kids are yours to mold and shape into the form you<br/>\nprefer them to have.<br/>\n<br/>\n-=-Not at all. My words were not accurate.-=-<br/>\n<br/>\n<br/>\nStop a minute.<br/>\n<br/>\n&quot;Not at all&quot; suggests that Joyce&#39;s statement was incorrect.<br/>\n&quot;My words were not accurate&quot; suggests that Joyce&#39;s statement was correct, but you want a re-do.<br/>\n<br/>\nBefore posting again, please consider the guidelines for this list, some of which are quoted below, and the rest of which can be seen at the links.  <br/>\n<br/>\nPosts for this list need to fulfill at least one of these criteria:<br/>\n<br/>\nhelps lots of people understand unschooling<br/>\nasks a question that actually needs an answer<br/>\nrequests help seeing different aspects of a situation<br/>\nhelps people have more peaceful and joyful lives (helps lots of people on the list)<br/>\nALL posts should be<br/>\nhonest<br/>\nproofread<br/>\nsincere<br/>\nclear<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearningPOSTS\">http://sandradodd.com/lists/alwayslearningPOSTS</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":444938010,"authorName":"Adam Dealan-de","from":"Adam Dealan-de &lt;adam@...&gt;","profile":"adamdealande@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Santa Myth: Make-believe or believe?","postDate":"1291656807","msgId":58381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDRkQxRTY3LjMwNDA2MDhAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58380,"nextInTopic":58382,"prevInTime":58380,"nextInTime":58382,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"Joyce: This says your kids aren t others with the right to have their beliefs. Your kids are yours to mold and shape into the form you prefer them to have. Not","messageBody":"<div id=\"ygrps-yiv-921559287\">Joyce: This says your kids aren&#39;t others with the right to have their<br/>\nbeliefs. Your kids are yours to mold and shape into the form you<br/>\nprefer them to have.<br/>\n<br/>\nNot at all.  My words were not accurate.  What I am saying is that what <br/>\nothers choose to believe is their right as it is my childrens right.  <br/>\nBut it is up to me as to how I interact with my kids.  I do shape and <br/>\nmold them even if unconsciously.  By my choices and actions no matter <br/>\nhow allowing and unintrusive.  My kids see what I like and what I <br/>\nbelieve played out and and are affected by this.    My kids are in a <br/>\nseparate category only in that they are so close and so influenced by me.<br/>\n<br/>\nJoyce: All parents, even the best meaning ones, have an idea of what they<br/>\nwant for their kids. The far extreme might be a Harvard educated<br/>\ndoctor. The other end might be happy. It&#39;s easy to see how molding a<br/>\nchild into a doctor is about the parent, not about the child. It&#39;s<br/>\nless easy to see how wanting a child to be knowledgeable or logical or<br/>\ninformed about healthy eating or loving to read is not about the<br/>\nchild. It&#39;s very hard to see how wanting a child to be happy *can be*<br/>\nnot about the child also.<br/>\n<br/>\nThis is very true for me.  So how do we engage in Santa with this in <br/>\nmind.  That is my question.  I can see for myself that engaging in the <br/>\nSanta myth is about making the parent happy and playing out the parents <br/>\nfantasy.  And not about providing a rich and supportive environment for <br/>\nthem to discover and explore and figure out what they want to have (as <br/>\nyou wrote).<br/>\n<br/>\nJoyce: It&#39;s about trusting they won&#39;t always be the same and an idea <br/>\nthat works<br/>\nfor their today self may not work for their tomorrow self and they&#39;ll<br/>\ntry something else.<br/>\n<br/>\nI love and agree with so much of what you have wrote.  But what about <br/>\nwhen you children ask you with Santa really does exist or does Santa <br/>\nleave those presents.  I am not advocating that the world NEEDS to know <br/>\nmy truth about Santa.  And preach to the word and try to break our <br/>\nfantasies and fun.  I am just trying to be honest and caring with my kids.<br/>\n<br/>\n<br/>\n<br/>\nJoyce:  But if a parent has ideas about those they&#39;d like to get into their<br/>\nkids heads, they will do the unschooling atmosphere of their home a<br/>\nfavor by avoiding those until the parent can listen to his or her<br/>\nchildren&#39;s ideas without feeling a need to share their own.<br/>\n<br/>\nI agree and do struggle with this.  I really dislike Barbie but know <br/>\nthat my daughter loves to play Barbiegirl online and really loves this <br/>\nworld.  And she is learning a ton by it.</div>","specialLinks":[]},{"userId":444938010,"authorName":"Adam Dealan-de","from":"Adam Dealan-de &lt;adam@...&gt;","profile":"adamdealande@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Santa Myth: Make-believe or believe?","postDate":"1291655484","msgId":58380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDRkQxOTNDLjYwMjAzMDdAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58371,"nextInTopic":58381,"prevInTime":58379,"nextInTime":58381,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"Sandra wrote: When people don t think they re being negative and others try to point it out, it s intended to be clarifying and illuminating, to say I don t","messageBody":"<div id=\"ygrps-yiv-1031702467\">Sandra wrote: When people don&#39;t think they&#39;re being negative and others <br/>\ntry to point it out, it&#39;s intended to be clarifying and illuminating, to <br/>\nsay &quot;I don&#39;t know if you&#39;ve noticed, but...&quot;<br/>\n<br/>\nThe underlying intent of the parent when doing Santa things is probably <br/>\nmuch better and loftier than the underlying intent of a parent who <br/>\ndecides to kill the whole game in the name of &quot;truth.&quot; The intent to <br/>\ncreate happiness and magic over the intent to lay the whole magic show <br/>\nout as a sham of trickery.<br/>\n<br/>\nDid I miss something?  Am I being negative?  I didn&#39;t think so but I am <br/>\nopen to see where.  I never said to &quot;kill&quot; the whole game or to lay the <br/>\nwhole magic show out as a sham of trickery.<br/>\n<br/>\nSandra: It seems you&#39;re disregarding the several stories of not lying <br/>\nand still playing the magical story out.<br/>\nI hope you won&#39;t intentionally tell your children too much &quot;truth&quot; for <br/>\nyour own emotional benefit.<br/>\n<br/>\nI am not disregarding the several stories of not lying.  I found them <br/>\nvery valuable as I thought I pointed out earlier.<br/>\n<br/>\nSandra: You&#39;re not fine with it. You can&#39;t relax about your whole lies <br/>\nvs. truth stance. You&#39;re SAYING &quot;I respect everyone here,&quot; but your <br/>\nposts are not at all open to other possibilities.<br/>\n<br/>\nI am fine and I am open.  Maybe I have not expressed that clearly.  The <br/>\nheart of my posts have been about how to gently and kindly be truthful <br/>\nand still be magical.  To this day I have never attacked another for <br/>\nwhat they wish to do in this regard or tried to destroy the magic and <br/>\nfun my children and others have around Santa.  I have also heard stories <br/>\non this thread and elsewhere about the hurt and embarrassment felt by <br/>\nchildren when they learn they have been deceived.  How can we keep the <br/>\nmagic and play without lying?  I am open to learn.<br/>\n<br/>\nSandra: It&#39;s not a worthy goal to respect everyone anyway. Respecting <br/>\n*everyone* (sight unseen, thoughts unknown) is the same as respecting no <br/>\none. Yes, I&#39;m being picky. Yes, I want thoughtful clarity on the list <br/>\nwhenever possible. No one has to write anything, but anything that&#39;s <br/>\nwritten and posted is fodder for the discussion.<br/>\n<br/>\nI agree and I love the debate.  I think you can respect all people <br/>\nwithout agreeing with them or their ideas.  Holding others in high <br/>\nesteem as human beings and their right to expression without assaulting <br/>\nand attacking them physically or verbally is a lofty ideal to me.<br/>\n<br/>\n<br/>\nSandra wrote: understood your metaphor, but my objection was to the idea <br/>\nthat it&#39;s a big job like climbing a mountain, or that it was a large, <br/>\nlong journey. Unschooling happens in the moment, not in the future. Not <br/>\nall paths lead to a clearer understanding of unschooling.<br/>\n<br/>\nI agree that not all paths lead to an understanding of unschooling and <br/>\nthat unschooling happens in the moment.<br/>\n<br/>\nAdam</div>","specialLinks":[]},{"userId":147283564,"authorName":"Jill Parmer","from":"Jill Parmer &lt;jparmer@...&gt;","profile":"jparm02","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:  Santa Myth: Make-believe or believe?","postDate":"1291581016","msgId":58371,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRENjU3NTA1LTYwQUYtNDUzNS1CNzI5LThDNENDNEQ0N0M0OEBmcmlpLmNvbT4=","inReplyToHeader":"PEFBRkIyNjE3NjZCQjREOTQ4RjlCN0I3QkU3Mjg0NTcwQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+IDxGNTdFNDkwMy1GQUVFLTQ1MjgtQTc2Ni01NkI0RkEwOTNFNUFAU2FuZHJhZG9kZC5jb20+IDwxMjUwNEU4MzQyMDc0NEIxOUNBMDYzNjQ3RDE1QjcxRUBkZWJvcmFoNzZhNzlodj4gPEFBRkIyNjE3NjZCQjREOTQ4RjlCN0I3QkU3Mjg0NTcwQGRlYm9yYWg3NmE3OWh2Pg=="},"prevInTopic":58369,"nextInTopic":58380,"prevInTime":58370,"nextInTime":58372,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... I don t think it s a special skill.  I think it s about knowing your children and not doing things that disturb them. I just asked Addi (16) what she","messageBody":"<div id=\"ygrps-yiv-1599012935\">On Dec 5, 2010, at 12:40 PM, David Lewis wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But I know people who have done it happily and whose children  <br/>\n&gt; really enjoyed the magic of Santa and didn&#39;t feel duped later on.  <br/>\n&gt; They have some special skill I don&#39;t have.<br/>\n<br/>\n </span></blockquote>I don&#39;t think it&#39;s a special skill.  I think it&#39;s about knowing your  <br/>\nchildren and not doing things that disturb them.<br/>\n<br/>\nI just asked Addi (16) what she remembers as a kid about Santa.  She  <br/>\nsaid she imagined him bringing presents, but not coming down our  <br/>\nchimney, which is a gas stove pipe, leading to a locked glassed in  <br/>\nstove.  As she got older she realized no one ever saw Santa, and  <br/>\nseemed to think of him as any other character she saw in movies and  <br/>\nheard in stories, this cool idea that stays in imagination.<br/>\n<br/>\nWhen she was about 8 she did ask me if Santa was real or not, I asked  <br/>\nher if she was ok if the answer was yes, or no.  If she had said no,  <br/>\nthen I was going to say that she shouldn&#39;t ask that question yet.  At  <br/>\n8, she was fine with blunt questions and thinking about different  <br/>\npossible answers/outcomes, other kids might still be to young for  <br/>\nthat, depends on the kid.<br/>\n<br/>\nShe did say that Santas in malls or other santa&#39;s workshop places  <br/>\nwere creepy.<br/>\n<br/>\nThere is an old guy with a fat belly and bright white hair and a long  <br/>\nbeard that we see every now and again walking in the summer time  <br/>\naround our neighborhood, and every time we see him we cheer &quot;Santa!&quot;  <br/>\nquietly amongst ourselves.  We&#39;re kinda goofy that way.<br/>\n<br/>\nNeither Steve nor I pushed the Santa Claus idea or avoided it.<br/>\n<br/>\n~Jill P<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":454093105,"authorName":"lalow","from":"&quot;lalow&quot; &lt;lalougor@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Santa Myth: Make-believe or believe?","postDate":"1291578843","msgId":58367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkZ3FrcitqMDdrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGluR0ZWYmZkVEp1PUt5Y3dld0FIOHJ0PWErZjNOVm1yYW9CMUZNcEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58365,"nextInTopic":58369,"prevInTime":58366,"nextInTime":58368,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"When my oldest was 4 he loved to play Santa Claus.  He colored a Santa and a bunch of reindeer that he had me print off and taped them all together and then he","messageBody":"<div id=\"ygrps-yiv-1471959212\">When my oldest was 4 he loved to play Santa Claus.  He colored a Santa and a bunch of reindeer that he had me print off and taped them all together and then he would have me and his brother (who was 3) pretend to go to sleep and he would run through the house with the pictures and bang around going ho ho ho. he would wrap up toys and put them next to us and yell, &quot;wake up&quot;.   It was so funny and would go on until I couldnt stand it any longer and would distract him with hot chocolate or something.</div>","specialLinks":[]},{"userId":279647515,"authorName":"David Lewis","from":"&quot;David Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:  Santa Myth: Make-believe or believe?","postDate":"1291578001","msgId":58365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBRkIyNjE3NjZCQjREOTQ4RjlCN0I3QkU3Mjg0NTcwQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+IDxGNTdFNDkwMy1GQUVFLTQ1MjgtQTc2Ni01NkI0RkEwOTNFNUFAU2FuZHJhZG9kZC5jb20+IDwxMjUwNEU4MzQyMDc0NEIxOUNBMDYzNjQ3RDE1QjcxRUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":58364,"nextInTopic":58367,"prevInTime":58364,"nextInTime":58366,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"***repeat something she d told me and then find out it wasn t. *** Wasn t true. I can t imagine how I might have told Dylan about Santa when he was little, put","messageBody":"<div id=\"ygrps-yiv-1962831076\">***repeat something she&#39;d told me and then find out it wasn&#39;t. ***<br/>\n<br/>\nWasn&#39;t true.  <br/>\n<br/>\nI can&#39;t imagine how I might have told Dylan about Santa when he was little, put presents under the tree and pretended they were from Santa, and then explain why, later,  when he knew the truth.   Knowing (now) how he was when he got older, knowing his personality, I can&#39;t see how it would have been ok with him.  But I know people who have done it happily and whose children really enjoyed the magic of Santa and didn&#39;t feel duped later on.   They have some special skill I don&#39;t have. &lt;g&gt; <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291577941","msgId":58364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluR0ZWYmZkVEp1PUt5Y3dld0FIOHJ0PWErZjNOVm1yYW9CMUZNcEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEyNTA0RTgzNDIwNzQ0QjE5Q0EwNjM2NDdEMTVCNzFFQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+CTxGNTdFNDkwMy1GQUVFLTQ1MjgtQTc2Ni01NkI0RkEwOTNFNUFAU2FuZHJhZG9kZC5jb20+CTwxMjUwNEU4MzQyMDc0NEIxOUNBMDYzNjQ3RDE1QjcxRUBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":58363,"nextInTopic":58365,"prevInTime":58363,"nextInTime":58365,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"Deb, that s exactly how it went for us. We didn t tell Karl the Santa story but he learned it from other kids. And saying it s a game is how we described it.","messageBody":"<div id=\"ygrps-yiv-815853943\">Deb, that&#39;s exactly how it went for us. We didn&#39;t tell Karl the Santa<br/>\nstory but he learned it from other kids. And saying it&#39;s a &quot;game&quot; is<br/>\nhow we described it. The game parlance comes from the fact that Karl<br/>\nplays lots of vidgames, so it was an easy quick analogy on Santa. That<br/>\nhappened when he was 4.<br/>\n<br/>\nHe wanted to play the Santa game and so we did. Since we typically<br/>\ntravel more consistently during winter holidays, extended family have<br/>\nbaked birthday cakes and given gifts on his half-birthday which falls<br/>\nin mid-January actually but is celebrated late in December or near the<br/>\nNew Year to coincide with family visits and celebrations. He has had<br/>\nSanta gifts simultaneously with birthday gifts.<br/>\n<br/>\nIn considering how to interact with our children, it&#39;s possible to see<br/>\nthings as a glass half-full or glass half-empty. It&#39;s also possible to<br/>\nsee it as a life of more or a life of less. For unschooling, seeing<br/>\nthe glass full to overflowing with a life of more can make it amazing<br/>\nand memorable for the children and the parents. Opt for abundance.<br/>\nInclude as much as you can, seriously or playfully? No both seriously<br/>\nand playfully along with many other outlooks.<br/>\n<br/>\nOne of my own personal discoveries during the deschooling process was<br/>\nthat growing up with ideas about opposites, which are preset notions,<br/>\nmeant that my understanding of emotion could be very truncated at<br/>\ntimes. Becoming more emotionally fluent meant that I acknowledged more<br/>\nideas about feelings other than just happy or sad; happy or angry.<br/>\nIt&#39;s possible to be happy and sad at the same time. (Oh.) It&#39;s<br/>\npossible to be neither happy nor sad nor angry. (Well duh me.) It&#39;s<br/>\npossible to feel rather nonchalant or a bit ambiguous or whatever. Who<br/>\ndid I learn that from? Karl. It was one of our many discussions and<br/>\nit&#39;s been so long ago, I don&#39;t remember exactly how it went but it was<br/>\npretty amazing. He did most of the talking and explaining to me. I<br/>\nlearned from him.<br/>\n<br/>\nUnschooling is like that. You may at some point realize that you can<br/>\nlearn from your own kids. And that the whole Santa myth (any myth<br/>\nreally) is totally saturated with learning possibilities for yourself<br/>\nas well as your children.<br/>\n<br/>\nUnschooling = learning together = pretty good equation<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen James","from":"Karen James &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291577441","msgId":58369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9QXdOMVAxWE00V1FoczMzZnhhS1JIanVXVTk0eTF6PU1jeUdhZkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDAxRTVEMDdFOTkxNzQyRkU5OTJGQzlDQjc1QTU3NjYwQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+CTxGNTdFNDkwMy1GQUVFLTQ1MjgtQTc2Ni01NkI0RkEwOTNFNUFAU2FuZHJhZG9kZC5jb20+CTwwMUU1RDA3RTk5MTc0MkZFOTkyRkM5Q0I3NUE1NzY2MEBkZWJvcmFoNzZhNzlodj4="},"prevInTopic":58367,"nextInTopic":58371,"prevInTime":58368,"nextInTime":58370,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"Joyce: But for unschooling, it s not about what we want them to have but about providing the rich, supportive environment for them to discover and explore and","messageBody":"<div id=\"ygrps-yiv-687704597\">Joyce: But for unschooling, it&#39;s not about what we want<br/>\nthem to have but about providing the rich, supportive environment for<br/>\nthem to discover and explore and figure out what *they* want to have.<br/>\n<br/>\nMy husband and I avoided Santa as long as we could, but our son discovered<br/>\nhim around the age of 3 and fell in love with the idea.  We embraced this.<br/>\nHe is now 8. Recently, while we were at a coffee shop, he smiled, while<br/>\nlooking off in another direction, and said to himself: &quot;That boy believes in<br/>\nSanta too.&quot;  When I asked him what he had just seen, he said he had<br/>\nwitnessed a boy pick up a sleigh ornament and exclaim, &quot;Look, it&#39;s Santa&#39;s<br/>\nsleigh.&quot;  Then he smiled again, this time at Doug and I, and said &quot;It&#39;s<br/>\nmagic.&quot;  We left it at that.<br/>\n<br/>\nIt isn&#39;t about what we believe, or what we want Ethan to believe.  Both Doug<br/>\nand I are not particularly excited about the commercial aspect of Santa,<br/>\nwhich was initially why we resisted the story, but our son found Santa and<br/>\nhe loves him, and that is beautiful in our eyes.<br/>\n<br/>\nKaren.<br/>\njamesfamilyedutrip.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"David Lewis","from":"&quot;David Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291575799","msgId":58363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxRTVEMDdFOTkxNzQyRkU5OTJGQzlDQjc1QTU3NjYwQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+IDxGNTdFNDkwMy1GQUVFLTQ1MjgtQTc2Ni01NkI0RkEwOTNFNUFAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":58362,"nextInTopic":58364,"prevInTime":58362,"nextInTime":58364,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"***You re not fine with it. You can t relax about your whole lies vs. truth stance.*** I understand this.  Maybe because I was really embarrassed a couple of","messageBody":"<div id=\"ygrps-yiv-1673503412\">***You&#39;re not fine with it. You can&#39;t relax about your whole lies vs. truth stance.***<br/>\n<br/>\nI understand this.  Maybe because I was really embarrassed a couple of times when I believed my mom about something and then found out it wasn&#39;t the truth.   It made me trust her less and less as time went on.   I really wanted to be a trustworthy mom.   I didn&#39;t want  Dylan feeling embarrassed and humiliated if he repeated something I said was truth and someone told him it wasn&#39;t.   I didn&#39;t want him to think of my as a liar.   I didn&#39;t want him to have to go to someone else to find the truth. <br/>\n<br/>\nOther people probably have healthier psychology. &lt;g&gt; <br/>\n<br/>\nDeb<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291575348","msgId":58362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrZHpjcjRRMkpHeT0rUTJOMXFrMDc5V054eDhUQnNURUxqTzNEd0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+","referencesHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+"},"prevInTopic":58361,"nextInTopic":58363,"prevInTime":58361,"nextInTime":58363,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... Tweak the thinking above in order to get closer to the unschooling idea. Say it something like this: I trust my kids to have theories and ideas and then","messageBody":"<div id=\"ygrps-yiv-61008262\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I prefer and encourage my kids to have theories and ideas and then test those ideas to see and observe if they hold up to logic and experience.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Tweak the thinking above in order to get closer to the unschooling<br/>\nidea. Say it something like this:<br/>\n<br/>\nI trust my kids to have theories and ideas and then test those ideas<br/>\nto see and observe if they hold up in accordance to my kids&#39; various<br/>\nand ever-changing levels of development, logic and experience.<br/>\n<br/>\nBecause that&#39;s IS what they&#39;re doing and the parent who doesn&#39;t yet<br/>\ntrust the nature of how learning takes place can learn more about how<br/>\nanyone and everyone learns, in time. You don&#39;t want to directly do the<br/>\nthinking for your children in order to make learning take place in<br/>\nyour children&#39;s heads. You don&#39;t want to tell them how their own<br/>\nthinking can take place best. They are formulating it for themselves<br/>\nalready, right now, because they were born to think and learn and<br/>\nexperience and breathe and live and make and do.<br/>\n<br/>\nHere&#39;s a great way to see your own unschooling process. It&#39;s to<br/>\nnurture children like this:<br/>\n<br/>\n                 *********************************<br/>\n                   (This following is by Sandra)<br/>\n&quot;Each tree grows from a single seed, and when a tree is growing in<br/>\nyour yard what is the best thing you can do for it? You can nurture it<br/>\nand protect it, but measuring it doesn’t make it grow faster. Pulling<br/>\nit up to see how the roots are doing has never helped a tree a bit.<br/>\nWhat helps is keeping animals from eating it or scratching its bark,<br/>\nmaking sure it has water, good soil, shade when it needs it and sun<br/>\nwhen it needs it, and letting its own growth unfold peacefully. It<br/>\ntakes years, and you can’t rush it.&quot;<br/>\n<br/>\n&quot;So it is with children. They need to be protected from physical and<br/>\nemotional harm. They need to have positive regard, food, shade and<br/>\nsun, things to see, hear, smell, taste and touch. They need someone to<br/>\nanswer their questions and show them the world, which is as new to<br/>\nthem as it was to us. Their growth can’t be rushed, but it can be<br/>\nenriched.&quot;<br/>\n<br/>\nThe writing enclosed in asterisks from <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/thoughts\">http://sandradodd.com/thoughts</a><br/>\n                 *********************************<br/>\nThe key phrase there is &quot;growth can&#39;t be rushed&quot; no matter how we<br/>\nmight like to tamper with it to make it change course or inject it<br/>\nwith pre-fabbed germinators of our own, which were probably pre-fabbed<br/>\nwhen we were injected with them at school.<br/>\n<br/>\nI like to have in depth involved projects going all the time. If<br/>\nyou&#39;re a parent who has made projects out of your children&#39;s<br/>\ndeveloping world view, please find things to do rather than putting<br/>\nyour need for project-energy into your children.<br/>\n<br/>\nAnd by the way, if you do get engaged in your own things to do, your<br/>\nchildren will see that as an idea of how they too could choose to<br/>\nlearn or live or be, if it is their preference to be project-oriented.<br/>\nI&#39;m like that. And I understand the need for projects.<br/>\n<br/>\nI did myself, my sanity and Karl a huge favor by deciding to avoid<br/>\nmaking Karl into a comfy years-long project, since the temptation is<br/>\nthat I might believe my abiding care would have meant that I could do<br/>\nit the most justice. But that premise would leave out the primary fact<br/>\n-- Karl&#39;s life is his very own and he has his own ideas about that<br/>\nlife. He let me know that from very early on when he was still an<br/>\ninfant.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":279647515,"authorName":"David Lewis","from":"&quot;David Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:  Santa Myth: Make-believe or believe?","postDate":"1291575016","msgId":58361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyNTA0RTgzNDIwNzQ0QjE5Q0EwNjM2NDdEMTVCNzFFQGRlYm9yYWg3NmE3OWh2Pg==","referencesHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+IDxGNTdFNDkwMy1GQUVFLTQ1MjgtQTc2Ni01NkI0RkEwOTNFNUFAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":58358,"nextInTopic":58362,"prevInTime":58360,"nextInTime":58362,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"***It seems you re disregarding the several stories of not lying and still playing the magical story out. I hope you won t intentionally tell your children too","messageBody":"<div id=\"ygrps-yiv-1057966313\">***It seems you&#39;re disregarding the several stories of not lying and still playing the magical story out.<br/>\nI hope you won&#39;t intentionally tell your children too much &quot;truth&quot; for your own emotional benefit.***<br/>\n<br/>\nWe didn&#39;t tell Dylan the Santa story when he was little.  At some point he heard about Santa elsewhere and asked us.   I told him it was game people played at Christmas, told him how the game might have started and that some kids didn&#39;t know it was a game so he should just go along if his friends talked about Santa and not hurt their feelings by telling them it was pretend.  <br/>\n<br/>\nI did not start the Santa game at our house because I felt it would have been dishonest to tell my little kid there was this magic guy who brought toys.   My mom wasn&#39;t always honest and I remembered how it felt to repeat something she&#39;d told me and then find out it wasn&#39;t.   I would have been really uncomfortable telling him there was a Santa or a Tooth Fairy or whatever.   And I think he&#39;d have been kind of disgusted when he found out it wasn&#39;t real.   <br/>\nI think Dylan would have felt duped.   Other families are different.  As Sandra often says, &quot;it depends.&quot; <br/>\n<br/>\nBut I never said, &quot;Santa&#39;s a lie.&quot;  <br/>\n<br/>\nIf, after I&#39;d told Dylan it was a kind of happy game people played at Christmas he had gone on to talk about Santa as if it was real, I would not have insisted it wasn&#39;t.  I would not have hammered at the truth every time the subject of Santa came up.   He knew the truth and if he&#39;d decided to play something different I would have gone along and played too.  <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291568891","msgId":58358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFQTk4N0VFMEJERTRFMTI5NUMxOERFOTFBODdDQTM5QENvbm5pZVBDPg==","inReplyToHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+","referencesHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+"},"prevInTopic":58356,"nextInTopic":58361,"prevInTime":58357,"nextInTime":58359,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... As a parent that embraces the principles of unschooling, I do perpetuate things that are false for me if it is something that my children want me to","messageBody":"<div id=\"ygrps-yiv-1035488283\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;No, I am not saying that I am correct and any other way is a lie. Truth is relative to each individual. I don&#39;t want to perpetuate something that is I know to be false for me.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>As a parent that embraces the principles of unschooling, I do perpetuate things that are false for me if it is something that my children want me to perpetuate. <br/>\n<br/>\nHere is an example that has nothing to do with religion or Santa. My 6 year old has a fascination with ice cream trucks and she is always talking about what we are going to do if the ice cream truck comes. I have tried to gently tell her that the ice cream truck probably isn&#39;t going to come because it is the middle of December and we live in an area where we have only had an ice cream truck come by one time in the whole 7 years that we have lived here. She doesn&#39;t want to hear that. She wants to talk about what we are going to do if the ice cream truck comes. So, we talk about how we are going to catch it and what we are going to get. I try to remind her not to be disappointed if it doesn&#39;t show up today. Her response is always, &quot;But what if it does come?&quot; to which I always respond with, &quot;We are going to catch it and buy ice cream and sit on the porch while we eat it.&quot; She doesn&#39;t want to know the facts about why it won&#39;t come. All she wants to know is that if it comes, I will buy ice cream. It isn&#39;t make believe or a game that we are playing. It is all very real to my daughter. It isn&#39;t about me and what I know to be true or false. It is about my daughter and what she wants to think and believe. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I am suggesting the difference between lying to a child verses sharing in make-believe. I think it is about the underlying intent of the parent.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Claiming that a child believing in Santa or God or the ice cream truck is sharing in make believe isn&#39;t always a good idea. Some children take things very seriously and would be crushed if they thought that their parents didn&#39;t take them seriously. My 6 year old has a really big imagination. The things that I may think are make believe are very real to her. I have helped her kick a couple of imaginary butts. She had an imaginary friend that used to do mean stuff so I helped her set him straight. Was I perpetuating a lie by going along with her invisible friend? To dismiss her feelings by calling it a game of make believe isn&#39;t helpful in my opinion. It is dismissive of the child.<br/>\n<br/>\nIntent is important but at the same time, the parent&#39;s intent doesn&#39;t always look at what the child wants or needs. A lot of bad things have been done with good intent. If your intent is not to perpetuate something that you know to be a falsehood, how does that benefit the child? I am not saying that anybody should deliberately lie to their children. I am just saying that sometimes it doesn&#39;t really matter what I think. What matters is what my children want and need. My 9 year old has a tendency to feel lied to if you don&#39;t tell her the whole truth. When she was little, she asked about where babies come from so I gave her an age appropriate answer. When she got older, I gave her more information. When I gave her more details, she indicated that she felt lied to because I didn&#39;t tell her everything when she was 3 or 4. I know this about her so I take that into consideration when I talk to her about things. Now, I know to tell her that I am not comfortable telling her everything about some things because I haven&#39;t yet figured out how to talk about it because of her age or the fact that I haven&#39;t done my research. <br/>\n<br/>\nMy 6 year old is the exact opposite. If I begin to tell her some things, she will tell me, &quot;Mom, I don&#39;t want to know those things.&quot; Now, I know that I need to be very cautious about the information that I give her because she doesn&#39;t want to know the same kinds of things her sister does. With her, I feel like I leave out a lot of details to protect her from knowing more than she is comfortable with knowing. My 6 year old is also the same child that has decided to start going to church and absolutely loves it. Do I agree with everything that church she is going to teaches? No, I don&#39;t, but that doesn&#39;t matter. It is not up to me to tell her about all of the things that I disagree with about the church. She goes and she enjoys it. If she begins to ask questions, I will answer them without peppering the response with too much of my personal truths. I will try to phrase it as, &quot;Some people believe&quot; because I don&#39;t want her to feel judged by my difference in opinion (or personal truth). <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;I just don&#39;t want to intentional deceive or manipulate my kids for my own emotional benefit.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>It doesn&#39;t matter whether or not you benefit emotionally. What matters is your children! It is not about you. How can you intentionally manipulate or deceive if you are following your child&#39;s lead? Manipulation and deception don&#39;t even enter the equation if the focus stays on the individual child. <br/>\n<br/>\nConnie<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Santa Myth: Make-believe or believe?","postDate":"1291555567","msgId":58356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5M0U3RDY4LTVCNTQtNENEOS1BMTlBLTRFQkRCQjU0QTdBQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58355,"nextInTopic":58358,"prevInTime":58355,"nextInTime":58357,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... This says your kids aren t others with the right to have their beliefs. Your kids are yours to mold and shape into the form you prefer them to have. You","messageBody":"<div id=\"ygrps-yiv-1942291643\">On Dec 3, 2010, at 12:05 PM, Adam Dealan-de wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I respect others right to have their religion, but I prefer and<br/>\n&gt; encourage my kids<br/>\n<br/>\n </span></blockquote>This says your kids aren&#39;t others with the right to have their  <br/>\nbeliefs. Your kids are yours to mold and shape into the form you  <br/>\nprefer them to have.<br/>\n<br/>\nYou may be *saying* no, not true, but you wrote the above idea that  <br/>\nputs your kids and other people in two separate categories to be  <br/>\ntreated differently. Those are the glasses you&#39;re seeing situations  <br/>\nthrough and will color how you respond to them. And -- more important  <br/>\nto the purpose of the list -- colors the ideas you put on the list.<br/>\n<br/>\nAll parents, even the best meaning ones, have an idea of what they  <br/>\nwant for their kids. The far extreme might be a Harvard educated  <br/>\ndoctor. The other end might be happy. It&#39;s easy to see how molding a  <br/>\nchild into a doctor is about the parent, not about the child. It&#39;s  <br/>\nless easy to see how wanting a child to be knowledgeable or logical or  <br/>\ninformed about healthy eating or loving to read is not about the  <br/>\nchild. It&#39;s very hard to see how wanting a child to be happy *can be*  <br/>\nnot about the child also.<br/>\n<br/>\nThose things sound like good things and things any caring parent would  <br/>\nwant for their child. But for unschooling, it&#39;s not about what we want  <br/>\nthem to have but about providing the rich, supportive environment for  <br/>\nthem to discover and explore and figure out what *they* want to have.  <br/>\nIt&#39;s about trusting that kids do want the good stuff. But it&#39;s also  <br/>\nabout trusting kids to explore what they&#39;re drawn to to find what is  <br/>\ngood *for them*.<br/>\n<br/>\nIt&#39;s hard when kids hold ideas that go against our values. We want to  <br/>\nhelp them skip over the &quot;mistakes&quot; and go right to the good stuff. But  <br/>\nthe &quot;mistakes&quot; aren&#39;t mistakes. They will learn from all the paths  <br/>\nthey take, whether they continue to follow them or veer off. There&#39;s  <br/>\nlots of learning that happens on the paths that get rejected, like a  <br/>\ndeeper understanding of why it won&#39;t work for them. It&#39;s hard to see a  <br/>\nchild exploring a religion the parent doesn&#39;t believe in. Hard if a  <br/>\nchild of vegetarians explores meat eating (or vice versa). Hard if a  <br/>\nchild decides not to go to college. Hard if a child loves exploring  <br/>\nanything the parents don&#39;t see value in (video games, music genres,  <br/>\nhorror movies and so on)<br/>\n<br/>\nAs for the wanting kids to be happy, it will help someone turn toward  <br/>\nunschooling by thinking in terms of helping the child find their own  <br/>\nhappiness. It&#39;s tempting to jolly a kid out of sadness. But sometimes  <br/>\npeople need to be sad to work through something. Sympathy and  <br/>\nunderstanding are much better first thoughts than how to make the  <br/>\nchild happy.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but I prefer and<br/>\n&gt; encourage my kids to have theories and ideas and then test those ideas<br/>\n&gt; to see and observe if they hold up to logic and experience.<br/>\n<br/>\n </span></blockquote>Here&#39;s an unschooling tweak to that line of thought: Practice that  <br/>\nvalue for yourself. Use it when you&#39;re helping kids find solutions to  <br/>\nproblems. But allow your kids to pick it up or not for their own use.  <br/>\nAllow them to explore and play with different approaches to puzzles  <br/>\nwithout steering them toward what you believe is the best approach.  <br/>\nAllow them to explore the pros and cons of all sorts of ideas and ways  <br/>\nof tackling problems. Allow them to find what works and doesn&#39;t work  <br/>\n*for them*.<br/>\n<br/>\n(If they ask for help, a parent can say &quot;Here&#39;s one way of doing  <br/>\nthat ...&quot; &quot;Here&#39;s how I&#39;d approach it ...&quot; It&#39;s a good exercise for  <br/>\nunschooling muscles to let go of being positive that a parent knows  <br/>\nthe right way or the right answer, even when you&#39;re sure you do! ;-) I  <br/>\nremember a mom wrote to ask how to correct a child when they&#39;re wrong.  <br/>\nThere was a statue of (probably) a moose and the child called it a  <br/>\ndeer. The mom feared the child might feel betrayed and lied to if the  <br/>\nmom agreed it was a deer and later the child found out it was a moose.  <br/>\nAn approach that can help the child feel like a fellow explorer making  <br/>\ndiscoveries about the world rather than an empty vessel that needs  <br/>\nfilled up with the right facts of life is to share what you believe  <br/>\nwithout implying the child needs to believe too. She could have said  <br/>\n&quot;The thick antlers make me think it looks like a moose,&quot; while also  <br/>\nknowing it could be something she doesn&#39;t know about like an Irish Elk!)<br/>\n<br/>\nAdults could be wrong about Santa. Maybe he does exist for some  <br/>\nfamilies :-)<br/>\n<br/>\nAtheists and religious alike could be wrong about Jesus and Allah and  <br/>\nBuddha and Ganesh.<br/>\n<br/>\nThe pre-Copernicus parents who told their kids the sun circled the  <br/>\nearth were absolutely positive they were right but were absolutely  <br/>\npositively wrong.<br/>\n<br/>\nFor unschooling it helps to let go of the idea of what we want for our  <br/>\nkids and what kind of people we want them to be. *And in place of  <br/>\nthat* help them be who they are. *Trust* that if the values and  <br/>\nbeliefs around them feel right for them, they&#39;ll try them out for  <br/>\nthemselves.<br/>\n<br/>\nAdditionally, since unschooling is about the kids, we don&#39;t need to  <br/>\nmake sure they understand what we believe. We shouldn&#39;t cast ourselves  <br/>\nin the role of experts but as helpers who have a storehouse of  <br/>\nknowledge and experience the kids can choose to tap into and turn over  <br/>\nand consider.<br/>\n<br/>\nIt&#39;s helpful to realize that we have special powers to influence what  <br/>\nkids believe and, if the goal is to help *them* find their own truths,  <br/>\nto use that power responsibly. So it&#39;s not a matter of &quot;Yes, I  <br/>\nbelieve,&quot; or &quot;No, I don&#39;t believe,&quot; or &quot;Here&#39;s what really happens,&quot;  <br/>\nbut being sensitive to what journey the child is on. Which is why the  <br/>\ndiscussions here are so valuable to help parents shift their thinking  <br/>\nfrom their point of view to the child&#39;s.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Has magic been lost? No not really...in fact a more powerful reality  <br/>\n&gt; is<br/>\n&gt; coming forth.And greater questions and dreams are being born on a<br/>\n&gt; stronger foundation.<br/>\n<br/>\n </span></blockquote>More powerful?<br/>\n<br/>\nStronger?<br/>\n<br/>\nIn your opinion.<br/>\n<br/>\nBut unschooling isn&#39;t about you. Unschooling is not about moving kids  <br/>\nfrom where they are to where the parent believes it&#39;s best to be. It&#39;s  <br/>\neasy to see moving a child to be a nuclear physicist isn&#39;t about  <br/>\nunschooling. It&#39;s not so easy to see moving a child from childish  <br/>\n&quot;wrong&quot; notions of how the universe works to &quot;right&quot; adult ideas of  <br/>\nhow the universe works is not unschooling.<br/>\n<br/>\nUnschooling is about creating a supportive environment where they can  <br/>\nexplore what they believe and grow new understanding as they go along.  <br/>\nIt&#39;s about trusting they&#39;re thinking human beings who will pick up and  <br/>\ntry the ideas that intrigue them. It&#39;s about trusting they can make  <br/>\ntheir own judgements about how well those ideas worked for them. It&#39;s  <br/>\nabout trusting they won&#39;t always be the same and an idea that works  <br/>\nfor their today self may not work for their tomorrow self and they&#39;ll  <br/>\ntry something else.<br/>\n<br/>\nKids *will* explore and believe some ideas they will later reject.  <br/>\nIt&#39;s part of the process of moving from where they are to where  <br/>\nthey&#39;ll end up.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Like what is quantum physics, and paranormal<br/>\n&gt; research teaching us? what can we learn from nature, the butterfly and<br/>\n&gt; mystics?<br/>\n<br/>\n </span></blockquote>Sounds pretty!<br/>\n<br/>\nBut if a parent has ideas about those they&#39;d like to get into their  <br/>\nkids heads, they will do the unschooling atmosphere of their home a  <br/>\nfavor by avoiding those until the parent can listen to his or her  <br/>\nchildren&#39;s ideas without feeling a need to share their own.<br/>\n<br/>\nSharing is good! *Needing* to share will get in the way of unschooling.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291554433","msgId":58355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY1N0U0OTAzLUZBRUUtNDUyOC1BNzY2LTU2QjRGQTA5M0U1QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+","referencesHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+"},"prevInTopic":58350,"nextInTopic":58356,"prevInTime":58354,"nextInTime":58356,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"-=-I respect everyone here regardless of religious beliefs or whatever. I don t think that I have been negative in my past posts or tried to disprove","messageBody":"<div id=\"ygrps-yiv-2038897550\">-=-I respect everyone here regardless of religious <br/>\nbeliefs or whatever. I don&#39;t think that I have been negative in my <br/>\npast posts or tried to disprove unschooling.-=-<br/>\n<br/>\nWhen people don&#39;t think they&#39;re being negative and others try to point it out, it&#39;s intended to be clarifying and illuminating, to say &quot;I don&#39;t know if you&#39;ve noticed, but...&quot;<br/>\n<br/>\n-=-No. I am suggesting the difference between lying to a child verses <br/>\nsharing in make-believe. I think it is about the underlying intent of <br/>\nthe parent.-=-<br/>\n<br/>\nAgain there&#39;s a false dichotomy.<br/>\n<br/>\nThe underlying intent of the parent when doing Santa things is probably much better and loftier than the underlying intent of  a parent who decides to kill the whole game in the name of &quot;truth.&quot;   The intent to create happiness and magic over the intent to lay the whole magic show out as a sham of trickery.<br/>\n<br/>\n-=-<br/>\nI agree. I just don&#39;t want to intentional deceive or manipulate my kids <br/>\nfor my own emotional benefit.-=-<br/>\n<br/>\nIt seems you&#39;re disregarding the several stories of not lying and still playing the magical story out.<br/>\nI hope you won&#39;t intentionally tell your children too much &quot;truth&quot; for your own emotional benefit.<br/>\n<br/>\n-=-Some have stated that they would continue to not tell their children the <br/>\ntruth when asked by their children. Which is fine with me. That is <br/>\ntheir choice. I am fine with that-=-<br/>\n<br/>\nYou&#39;re not fine with it.  You can&#39;t relax about your whole lies vs. truth stance.  You&#39;re SAYING &quot;I respect everyone here,&quot; but your posts are not at all open to other possibilities.  It&#39;s not a worthy goal to respect everyone anyway.  Respecting *everyone* (sight unseen, thoughts unknown) is the same as respecting no one.   Yes, I&#39;m being picky.  Yes, I want thoughtful clarity on the list whenever possible.  No one has to write anything, but anything that&#39;s written and posted is fodder for the discussion.<br/>\n<br/>\n-=-There is a mountain in my metaphor. The mountain is a metaphor for <br/>\nlife&#39;s journey. And that everyone has their own path.-=-<br/>\n<br/>\nI understood your metaphor, but my objection was to the idea that it&#39;s a big job like climbing a mountain, or that it was a large, long journey.  Unschooling happens in the moment, not in the future.  Not all paths lead to a clearer understanding of unschooling.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":444938010,"authorName":"Adam Dealan-de","from":"Adam Dealan-de &lt;adam@...&gt;","profile":"adamdealande@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Santa Myth: Make-believe or believe?","postDate":"1291515717","msgId":58350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDRkFGNzQ1LjUwNTAyQGNsZWFuZnJlYWtzY2FycGV0Y2FyZS5jb20+"},"prevInTopic":58327,"nextInTopic":58355,"prevInTime":58349,"nextInTime":58351,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"Connie wrote: When you keep using the word truth, I get the feeling that you are implying that you are correct and that any other way would be a lie. For","messageBody":"<div id=\"ygrps-yiv-775470654\">Connie wrote: &quot;When you keep using the word &quot;truth,&quot; I get the feeling <br/>\nthat you are implying that you are correct and that any other way would <br/>\nbe a lie. For me, the word &quot;truth&quot; implies something that is absolute.&quot;<br/>\n<br/>\nNo, I am not saying that I am correct and any other way is a lie.  Truth <br/>\nis relative to each individual.  I don&#39;t want to perpetuate something <br/>\nthat is I know to be false for me.<br/>\n<br/>\n<br/>\nSandra wrote:  If your mind is made up and you&#39;ve come here to persuade <br/>\neveryone else to &quot;stop lying&quot; to their children, that&#39;s different. But <br/>\nthe purpose of the list is not to try to persuade longtime unschoolers <br/>\nthat what they found to have worked peacefully couldn&#39;t actually have <br/>\nworked.<br/>\n<br/>\nNot at all Sandra.  I am exploring this and finding what can work best <br/>\nas an unschooler.  I am sharing my thoughts.  Not trying to prove anyone <br/>\non this list wrong.  I respect everyone here regardless of religious <br/>\nbeliefs or whatever.    I don&#39;t think that I have been negative in my <br/>\npast posts or tried to disprove unschooling.<br/>\n<br/>\n<br/>\nSandra wrote: You seem to be suggesting that allowing a child to believe <br/>\nsomething is equal to lying.<br/>\n<br/>\nNo.   I am suggesting the difference between lying to a child verses <br/>\nsharing in make-believe.  I think it is about the underlying intent of <br/>\nthe parent.<br/>\n<br/>\n<br/>\nSandra: The feeling of magic and joy might be too. Some things that <br/>\naren&#39;t objective, scientific truth are still enjoyable comforts to humans.<br/>\n<br/>\nI agree.  I just don&#39;t want to intentional deceive or manipulate my kids <br/>\nfor my own emotional benefit.<br/>\n<br/>\nSandra: The belief that there is one single truth IS dualism.  Balance <br/>\nbalances dualism. Nothing can destroy dualism.<br/>\n<br/>\nI am not saying their is one single truth but multitude of truths <br/>\n(infinite and multidimentional really).  Maybe destroy is <br/>\ninaccurate...more neutralizes (balances?).<br/>\n<br/>\n-=- I would rather<br/>\nshare my truth (in a soft and loving way when appropriate and<br/>\nrespectful!) and continue to play. Instead of lying to my kids and &quot;you<br/>\nbetter be GOOD&quot; dualism. -=-<br/>\n<br/>\nSandra wrote: No one has recommended lying, and no one has recommended <br/>\nusing Santa to threaten children. If that&#39;s inside you, that&#39;s where it <br/>\nis. One person even specifically warned against behavior control use of <br/>\nSanta stories.   If you have a negative wad of emotion about lying and <br/>\nthreats, it might be better to untangle that inside your heart and soul <br/>\nand mind, than to untangle it outside where it affects your children <br/>\nunnecessarily.<br/>\n<br/>\nSome have stated that they would continue to not tell their children the <br/>\ntruth when asked by their children.  Which is fine with me.  That is <br/>\ntheir choice.  I am fine with that.  I don&#39;t wish to do this and have <br/>\nbeen exploring how with this list.  I have enjoyed the feedback and I am <br/>\nnot trying to tell anyone here how they should handle this issue.  I <br/>\ndon&#39;t have a lad of emotion on this issue, I just don&#39;t care to lie to <br/>\nmy kids.  Make-believe and play totally.<br/>\n<br/>\nSandra: There is no mountain. There are relationships between parents <br/>\nand children.<br/>\n<br/>\nThere is a mountain in my metaphor.  The mountain is a metaphor for <br/>\nlife&#39;s journey.  And that everyone has their own path.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nKatherine wrote: The underlying principle in holding Santa and Jesus <br/>\nover children&#39;s<br/>\nheads to threaten and cajol is ultimately about parents not accepting<br/>\ntheir children having their own ideas! In the first place! Otherwise<br/>\nthere would be no manipulating with stories as though they&#39;re<br/>\nrealities.<br/>\n<br/>\nI agree fully.<br/>\n<br/>\nAdam<br/>\n<br/>\nP.S.  I fine unschooling to be very challenging and engaging.  I find <br/>\nthis list to be very informative and stimulating.</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291486876","msgId":58327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9aWpUPUVDMzYxdFFZSlktSHVmZ1BOYjc0OFo9cEQ3c2N5Znp0c0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRDRkE3NDEyLjcwNzA2MDVAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRkE3NDEyLjcwNzA2MDVAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58324,"nextInTopic":58350,"prevInTime":58326,"nextInTime":58328,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... They can be. But that s not guaranteed. It s great when our children see us as friends. People who live their whole lives together disagree about things ","messageBody":"<div id=\"ygrps-yiv-107737023\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Pretend games are about sharing and being &quot;in&quot; on it together.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>They can be. But that&#39;s not guaranteed. It&#39;s great when our children<br/>\nsee us as friends.<br/>\n<br/>\nPeople who live their whole lives together disagree about things<br/>\nsometimes. Not focusing on the disagreements means children can form<br/>\ntheir own ideas about the world around them.<br/>\n<br/>\nThe underlying principle in holding Santa and Jesus over children&#39;s<br/>\nheads to threaten and cajol is ultimately about parents not accepting<br/>\ntheir children having their own ideas! In the first place! Otherwise<br/>\nthere would be no manipulating with stories as though they&#39;re<br/>\nrealities.<br/>\n<br/>\nThat&#39;s like taking a person&#39;s experience of life away from them and<br/>\nreplacing it with a counterfeit experience that doesn&#39;t and never will<br/>\nreally be the child&#39;s idea until they let go of their own ideas and<br/>\ntake on what others tell them as Truth. I read books my parents had<br/>\nnot read about feminism, witches, magic, all sorts of things. They had<br/>\nno idea what the books were about because either they didn&#39;t know I<br/>\nhad them or didn&#39;t know what the books were about and couldn&#39;t tell by<br/>\nlooking at the titles. I went to school and to the school library<br/>\nwhere there were lots of books my parents would never have chosen for<br/>\nme to read. I read many books while in the library without checking<br/>\nthem out. I also checked out books that stayed in a backpack or a<br/>\nlocker.<br/>\n<br/>\nThe same exact thing can happen in a non-religious household when a<br/>\nchild secretly believes things work a certain way and doesn&#39;t want to<br/>\ndisagree with people s/he lives with, so outwardly will seem to agree<br/>\nwhile giving him/herself time to test ideas about the world on their<br/>\nown terms.<br/>\n<br/>\nWhat&#39;s real and what isn&#39;t real isn&#39;t just about religion, in my<br/>\nexperience. And the same may be true in our children&#39;s experience.<br/>\nTheir experience of religion might very well be different from our<br/>\nown. One of the most rewarding parts of unschooling can be knowing<br/>\nthat our children&#39;s experiences will be somewhat different from ours<br/>\nas parents and celebrating some aspects in those differences.<br/>\n<br/>\nCorrecting and healing the mistakes and mishaps of our own childhoods<br/>\ndoesn&#39;t come through our children&#39;s childhoods but but in changes of<br/>\nhow we live our own lives.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291484134","msgId":58324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERFNDRGNjlBLUY4RTAtNDIxNy1BREYzLTUzMjU0NEQxRTU1REBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRDRkE3NDEyLjcwNzA2MDVAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRkE3NDEyLjcwNzA2MDVAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58323,"nextInTopic":58327,"prevInTime":58323,"nextInTime":58325,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"-=-It is about lying or not lying and being rigid and instead pretending and exploring Christmas without having my kids be duped.-=- My children were never","messageBody":"<div id=\"ygrps-yiv-968057179\">-=-It is about lying or not lying and being rigid and instead pretending and<br/>\nexploring Christmas without having my kids be duped.-=-<br/>\n<br/>\nMy children were never &quot;duped.&quot;  That&#39;s a very strong word to use, if you&#39;re actually interested in exploring these ideas.<br/>\n<br/>\nIf your mind is made up and you&#39;ve come here to persuade everyone else to &quot;stop lying&quot; to their children, that&#39;s different.  But the purpose of the list is not to try to persuade longtime unschoolers that what they found to have worked peacefully couldn&#39;t actually have worked.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\n<br/>\n-=-Lying: To present false information with the intention of deceiving-=-<br/>\n<br/>\nYou seem to be suggesting that allowing a child to believe something is equal to lying.<br/>\n<br/>\nMany children believe that they might someday figure out how to fly.  Many children believe that certain nighttime practices will protect them &quot;magically&quot;--covering up to the neck, if they&#39;re afraid, or using a night light, or (in my own case) closing closet doors.<br/>\n<br/>\nThings like that might not be true &quot;safeties&quot; but the feeling of safety is a feeling; it&#39;s in the individual.<br/>\n<br/>\nThe feeling of magic and joy might be too.  Some things that aren&#39;t objective, scientific truth are still enjoyable comforts to humans.<br/>\n<br/>\n-=-I don&#39;t see this as dualism (antagonistic forces of good and evil). In <br/>\nfact a deeper understanding of one&#39;s truth leads away from dualistic <br/>\npoints of view. Truth destroys dualism. -=-<br/>\n<br/>\nThe belief that there is one single truth IS dualism.<br/>\nBalance balances dualism.  Nothing can destroy dualism.<br/>\n<br/>\n-=- I would rather <br/>\nshare my truth (in a soft and loving way when appropriate and <br/>\nrespectful!) and continue to play. Instead of lying to my kids and &quot;you <br/>\nbetter be GOOD&quot; dualism. -=-<br/>\n<br/>\nNo one has recommended lying, and no one has recommended using Santa to threaten children.  If that&#39;s inside you, that&#39;s where it is.  One person even specifically warned against behavior control use of Santa stories.  <br/>\n<br/>\nIf you have a negative wad of emotion about lying and threats, it might be better to untangle that inside your heart and soul and mind, than to untangle it outside where it affects your children unnecessarily.<br/>\n<br/>\n-=-Just like unschooling this has been an exploration in Love. Not about <br/>\nsetting rigid rules and truths and laws. There are many paths up the <br/>\nmountain. :)-=-<br/>\n<br/>\nThere is no mountain.  There are relationships between parents and children.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Santa Myth: Make-believe or believe?","postDate":"1291483959","msgId":58323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJBOTBFMTg2QjFBNTRFQjdCRDc4QTRFMkJDRUZGNDQ2QENvbm5pZVBDPg==","inReplyToHeader":"PDRDRkE3NDEyLjcwNzA2MDVAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRkE3NDEyLjcwNzA2MDVAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58322,"nextInTopic":58324,"prevInTime":58322,"nextInTime":58324,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... I must be missing something in this discussion. I always thought that unschooling was about helping your children find their own truth. If my child can","messageBody":"<div id=\"ygrps-yiv-1557578690\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I don&#39;t see this as dualism (antagonistic forces of good and evil). In fact a deeper understanding of one&#39;s truth leads away from dualistic points of view. Truth destroys dualism. Which is why I would rather share my truth (in a soft and loving way when appropriate and respectful!) and continue to play. Instead of lying to my kids and &quot;you better be GOOD&quot; dualism.&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I must be missing something in this discussion. I always thought that unschooling was about helping your children find their own truth. If my child can provide logical arguments as to why they believe (or don&#39;t believe) in Santa, God, or their imaginary best friend, then I don&#39;t see a need to contradict them by sharing my truths. If you were to phrase it is as, &quot;I would rather share my views or ideas in a soft and loving way,&quot; I don&#39;t think that I would have a problem with what you are saying. When you keep using the word &quot;truth,&quot; I get the feeling that you are implying that you are correct and that any other way would be a lie. For me, the word &quot;truth&quot; implies something that is absolute. <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":444938010,"authorName":"Adam Dealan-de","from":"Adam Dealan-de &lt;adam@...&gt;","profile":"adamdealande@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Santa Myth: Make-believe or believe?","postDate":"1291482130","msgId":58322,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDRkE3NDEyLjcwNzA2MDVAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58307,"nextInTopic":58323,"prevInTime":58321,"nextInTime":58323,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"Sandra wrote: I still think this is too extreme and polarized. (The polarized express!) Dualism is the enemy of mindfulness.  The choices are NOT stop ","messageBody":"<div id=\"ygrps-yiv-2058470818\">Sandra wrote: I still think this is too extreme and polarized. (The <br/>\npolarized express!)<br/>\nDualism is the enemy of mindfulness.  The choices are NOT &quot;stop <br/>\nlying/keep lying.&quot;<br/>\nIt doesn&#39;t have to be about lying, or religion, or faith.<br/>\n<br/>\nIt is about lying or not lying and being rigid and instead pretending and<br/>\nexploring Christmas without having my kids be duped.<br/>\n<br/>\nPretend games are about sharing and being &quot;in&quot; on it together.<br/>\n<br/>\nExploring Santa and Jesus and learning from their stories and celebrating.<br/>\n<br/>\nLying: To present false information with the intention of deceiving<br/>\n<br/>\nPretending: To represent fictitiously in play; make believe<br/>\n<br/>\nI don&#39;t see this as dualism (antagonistic forces of good and evil).  In <br/>\nfact a deeper understanding of one&#39;s truth leads away from dualistic <br/>\npoints of view.  Truth destroys dualism.  Which is why I would rather <br/>\nshare my truth (in a soft and loving way when appropriate and <br/>\nrespectful!) and continue to play.  Instead of lying to my kids and &quot;you <br/>\nbetter be GOOD&quot; dualism.  I and my kids love Santa.<br/>\n<br/>\nJust like unschooling this has been an exploration in Love.  Not about <br/>\nsetting rigid rules and truths and laws.  There are many paths up the <br/>\nmountain.  :)</div>","specialLinks":[]},{"userId":420540815,"authorName":"Mirjam","from":"&quot;Mirjam&quot; &lt;mirjamkoopmans@...&gt;","profile":"mirjam_met_adam","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"step by step, was: Re: Santa Myth: Make-believe or believe?","postDate":"1291469368","msgId":58307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlkZGZubytxdHJvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDkwQTgxMTNDLThEM0ItNDdBQy04MkIxLTUzMTE2NzJGMzM5QkBjb21jYXN0Lm5ldD4="},"prevInTopic":58301,"nextInTopic":58322,"prevInTime":58306,"nextInTime":58308,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"This is so true! When I find out about something new, I want to do it all, at once, now! I ve tried that with (radical) unschooling, but that didn t work. It","messageBody":"<div id=\"ygrps-yiv-1939565530\">This is so true!<br/>\n<br/>\nWhen I find out about something new, I want to do it all, at once, now!<br/>\nI&#39;ve tried that with (radical) unschooling, but that didn&#39;t work. It was too much. So I was forced to do it step by step. Also for my husband&#39;s sake ;). And that works so much better! Step by step we&#39;re getting there. <br/>\n<br/>\nSome area&#39;s are easier to let go than others. That will be different for every family/person.<br/>\n<br/>\nEnjoy!<br/>\n<br/>\nGroetjes, Mirjam :o), mv Adam (9), Boaz (6) en Levi (3).<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.leermeer.blogspot.com\">http://www.leermeer.blogspot.com</a><br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Robin Bentley &lt;robin.bentley@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; P.S.S.  Still experiementing with unschooling and candy and  <br/>\n&gt; &gt; video... :)<br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; &quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n&gt; <br/>\n&gt; If you haven&#39;t checked out this page, take a look:<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help\">http://sandradodd.com/help</a><br/>\n&gt; <br/>\n&gt; Robin B.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":240002389,"authorName":"Andrea Catalano","from":"Andrea Catalano &lt;fennel1001@...&gt;","profile":"ajcm1207","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Santa Myth: Make-believe or believe?","postDate":"1291432447","msgId":58301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5NzE3Ljk5MTIucW1Ad2ViNTUwMDgubWFpbC5yZTQueWFob28uY29tPg=="},"prevInTopic":58294,"nextInTopic":58307,"prevInTime":58300,"nextInTime":58302,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"There is one aspect if the Santa story that has not been mentioned directly and that is that some (many?) parents use Santa as a way to control children s","messageBody":"<div id=\"ygrps-yiv-2007098735\">There is one aspect if the Santa story that has not been mentioned directly and that is that some (many?) parents use Santa as a way to control children&#39;s behavior. I am referring to tales that santa only visits &quot;good&quot; children who go to sleep on time, and &quot;behave,&quot; etc. I&#39;ve heard a lot of coersion and out-right threats made by parents toward their children in the name if Santa.  <br/>\n<br/>\n To the original poster, if that has been part of the Santa story for your family I suggest you leave it out going forward.<br/>\n<br/>\nAndrea  <br/>\n<br/>\n <br/>\n<br/>\nSent from my iPhone</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Santa Myth: Make-believe or believe?","postDate":"1291425121","msgId":58292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwQTgxMTNDLThEM0ItNDdBQy04MkIxLTUzMTE2NzJGMzM5QkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58289,"nextInTopic":58294,"prevInTime":58291,"nextInTime":58293,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... Read a little, try a little, wait a while, watch. If you haven t checked out this page, take a look: http://sandradodd.com/help Robin B.","messageBody":"<div id=\"ygrps-yiv-2010424308\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; P.S.S.  Still experiementing with unschooling and candy and  <br/>\n&gt; video... :)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n<br/>\nIf you haven&#39;t checked out this page, take a look:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help\">http://sandradodd.com/help</a><br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Santa Myth: Make-believe or believe?","postDate":"1291422733","msgId":58289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4QjVCNUE4Q0VEMjQyRDhCN0Q1RjlGQTUxQzU3QzIzQENvbm5pZVBDPg==","inReplyToHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58280,"nextInTopic":58292,"prevInTime":58288,"nextInTime":58290,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"... encourage my kids to have theories and ideas and then test those ideas to see and observe if they hold up to logic and experience.","messageBody":"<div id=\"ygrps-yiv-1474301991\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;For me believing and lying about Santa is in the realm of religion. Like believing and having faith that Jesus will deliver you to heaven. I respect others right to have their religion, but I prefer and <br/>\n </span></blockquote>encourage my kids to have theories and ideas and then test those ideas to see and observe if they hold up to logic and experience.&lt;&lt;&lt;&lt;<br/>\n<br/>\nWhen I was a kid, we always had presents and a big Christmas dinner. No matter how bad things were, we always had a Christmas. It defied logic from my point of view because my parents might be out of work and times were really tough. Even so, we still had a nice Christmas. My experience was that there had to be a Santa. I saw him at the malls. I saw him on all of the TV programs and movies. I knew that my parents couldn&#39;t be doing all of those things. I knew they didn&#39;t have the money. Even when I found out that it was my parents putting the presents under the tree, I still knew that there was more to the story that I wasn&#39;t getting. As I got much older, I found out how they always managed to give us a nice Christmas every year. I have an aunt (actually my mother&#39;s best friend from childhood) that always sent my mom money to make sure that us kids had a nice Christmas. Now that I am an adult, my aunt will send money directly to us kids to make sure that our kids have a nice Christmas. I have always referred to her as our personal Santa. <br/>\n<br/>\nConnie<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Santa Myth: Make-believe or believe?","postDate":"1291407966","msgId":58280,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltWnBjXzMySFpna0NReEswRmhiZ2lWWmtIVnJoeFBvVzBMRGZtTUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58276,"nextInTopic":58289,"prevInTime":58279,"nextInTime":58281,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"Santa is a story. And it s a very different story indeed to say he s a lie. To me that story seems a bit beside the point, which is fun! Karl is such a","messageBody":"<div id=\"ygrps-yiv-1877490162\">Santa is a story. And it&#39;s a very different story indeed to say he&#39;s a lie.<br/>\nTo me that story seems a bit beside the point, which is fun!<br/>\n<br/>\nKarl is such a storyteller. He&#39;s way better at it than I am. I write them<br/>\ndown. When my phone died a few weeks ago, I forgot one of his stories were<br/>\non it. When Karl asked me the other night if we could write more on it, I<br/>\nwas more upset than *he* was about it being gone. He has always preferred<br/>\ntelling stories (dictating them as I typed them into my old PDA phone or on<br/>\nmy computer) to any storybook reading I might do. Writing more on his<br/>\nstories has been a favorite pastime at night before getting to sleep.<br/>\n<br/>\nIt seems to me like some parents think their kids are not likely to be able<br/>\nto incorporate myths into daily life very well. I guess I don&#39;t want to<br/>\nimagine what our lives would be like without our continual stories. Today me<br/>\nand Karl dressed up like ninjas, he in his Halloween costume and me in a red<br/>\nblanket and a face mask. We decided to call ourselves The Contrivers,<br/>\nthinkers before doers. I totally don&#39;t want to miss that! The truth can<br/>\nwait.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Santa Myth: Make-believe or believe?","postDate":"1291405206","msgId":58294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExRkJDMjdFLTEwMDQtNENENC04Qjk4LURFN0Y4QjAyODQ0NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4=","referencesHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":58292,"nextInTopic":58301,"prevInTime":58293,"nextInTime":58295,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"-=-I guess for me the question becomes if we stop lying to our kids about Santa and all...do we destroy magic and as adults do WE really see (not believe) or","messageBody":"<div id=\"ygrps-yiv-1628762785\">-=-I guess for me the question becomes if we stop lying to our kids about <br/>\nSanta and all...do we destroy magic and as adults do WE really see (not <br/>\nbelieve) or know that magic exists and what is magic? And do we have a <br/>\nright to seek out the truth (experience) about magical things?-=-<br/>\n<br/>\nI still think this is too extreme and polarized.  (The polarized express!)<br/>\nDualism is the enemy of mindfulness.<br/>\n<br/>\nThe choices are NOT &quot;stop lying/keep lying.&quot;<br/>\nIt doesn&#39;t have to be about lying, or religion, or faith.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<br/>\n-=-My little ones seem totally happy with what I told them. Yeah!-=-<br/>\n<br/>\nI hope they won&#39;t feel the need to tell other kids what you told them.  Please ask them not to.  Another girl &quot;told me the truth&quot; in a mean and cruel way when I was seven years old, and I was at school.  It was very hurtful.  I still remember. <br/>\n<br/>\nI hope you won&#39;t tell them they their choice is to lie or to &quot;tell the truth.&quot;<br/>\nPerhaps it would be good to ask them not to talk about it to other children.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":444938010,"authorName":"Adam Dealan-de","from":"Adam Dealan-de &lt;adam@...&gt;","profile":"adamdealande@rocketmail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Santa Myth: Make-believe or believe?","postDate":"1291395919","msgId":58276,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDRjkyMzRGLjIwODA5MDNAY2xlYW5mcmVha3NjYXJwZXRjYXJlLmNvbT4="},"prevInTopic":0,"nextInTopic":58280,"prevInTime":58275,"nextInTime":58277,"topicId":58276,"numMessagesInTopic":0,"msgSnippet":"I am so happy to see so much sharing on this topic!  Thanks everyone! I guess for me the question becomes if we stop lying to our kids about Santa and all...do","messageBody":"<div id=\"ygrps-yiv-93671406\">I am so happy to see so much sharing on this topic!  Thanks everyone!<br/>\n<br/>\nI guess for me the question becomes if we stop lying to our kids about <br/>\nSanta and all...do we destroy magic and as adults do WE really see (not <br/>\nbelieve) or know that magic exists and what is magic?  And do we have a <br/>\nright to seek out the truth (experience) about magical things?<br/>\n<br/>\nFor me believing and lying about Santa is in the realm of religion.  <br/>\nLike believing and having faith that Jesus will deliver you to heaven.  <br/>\nI respect others right to have their religion, but I prefer and <br/>\nencourage my kids to have theories and ideas and then test those ideas <br/>\nto see and observe if they hold up to logic and experience.<br/>\n<br/>\nHas magic been lost?  No not really...in fact a more powerful reality is <br/>\ncoming forth.  And greater questions and dreams are being born on a <br/>\nstronger foundation.  Like what is quantum physics, and paranormal <br/>\nresearch teaching us?  what can we learn from nature, the butterfly and <br/>\nmystics?<br/>\n<br/>\nI told my kids in a carefree fun way that we carry on the magic that St. <br/>\nNicholas showed.  Parents leave the gifts at night.  That it is the <br/>\nchildren that start the dream by imagining what they wish and that what <br/>\nthey wish can come true in time.  I agree with many of you that myths <br/>\nand magical thinking should never be eliminated.  Maybe combining that <br/>\nwith the truth of our experience and fantastical dreaming and open minds <br/>\nwill lead to worlds of thought never imagined.<br/>\n<br/>\nThanks all!<br/>\n<br/>\nAdam<br/>\n<br/>\nP.S.  My little ones seem totally happy with what I told them.  Yeah!<br/>\n<br/>\nP.S.S.  Still experiementing with unschooling and candy and video... :)</div>","specialLinks":[]}],"prevTopicId":58302,"nextTopicId":58410}}