{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":40256956,"authorName":"jmcseals SEALS","from":"&quot;jmcseals SEALS&quot; &lt;jmcseals@...&gt;","profile":"sevenhavei","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: typical days-starting a group","postDate":"1052011815","msgId":67617,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtRjExNE5PUGswTzVTak0wMDAxOTdlOEBob3RtYWlsLmNvbT4="},"prevInTopic":67615,"nextInTopic":0,"prevInTime":67616,"nextInTime":67618,"topicId":67544,"numMessagesInTopic":0,"msgSnippet":"Thank you Olga!  I think we ve decided against RV ing.  I did check into it briefly and it seems *very* expensive considering the size we d need and the length","messageBody":"<div id=\"ygrps-yiv-1251086730\">Thank you Olga!  I think we&#39;ve decided against RV&#39;ing.  I did check into it <br/>\nbriefly and it seems *very* expensive considering the size we&#39;d need and the <br/>\nlength of travel.  There&#39;s also still the issue of seatbelts for car seats, <br/>\netc.  Maybe once the kids are a little older.<br/>\n<br/>\nWe got ahold of a Think Pad and I think we may put one on the list.  The <br/>\nkids really seemed to enjoy it and with 7, surely the money won&#39;t be wasted! <br/>\n  If anything, my boys (almost 2 and 3) will enjoy the noise it makes! LOL!<br/>\n<br/>\nI&#39;m still working out the details of how I&#39;m going to put together a <br/>\nwebpage/group for unschooling examples, but I will definitely let you know <br/>\nonce it is up!  Thanks for your interest!<br/>\n<br/>\nJennifer<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nThe new MSN 8: advanced junk mail protection and 2 months FREE*  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":139549710,"authorName":"Olga","from":"&quot;Olga&quot; &lt;britcontoo@...&gt;","profile":"britcontoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: typical days-starting a group","postDate":"1052010350","msgId":67615,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5MXAxZSszM2RqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTQtRjI1WXJUUEJHTHYzVmYwMDAwN2RlZUBob3RtYWlsLmNvbT4="},"prevInTopic":67592,"nextInTopic":67617,"prevInTime":67614,"nextInTime":67616,"topicId":67544,"numMessagesInTopic":0,"msgSnippet":"... I can t find your original post.  I would LOVE a site where everyone shared their life like that.  Especially for us new to this lifestyle.  Seeing how","messageBody":"<div id=\"ygrps-yiv-697637466\">--- <br/>\n<blockquote><span title=\"ireply\"> &gt; Jennifer,<br/>\n<br/>\n </span></blockquote>I can&#39;t find your original post.  I would LOVE a site where everyone <br/>\nshared their life like that.  Especially for us new to this <br/>\nlifestyle.  Seeing how others do it, makes it clearer where it is <br/>\nhappening in your own life!  I don&#39;t know if I can be of any help but <br/>\nlet me know if you can find some use for me!<br/>\n<br/>\nBTW, I looked up RV&#39;s for my family to go to the conference(we have a <br/>\nwedding in CT the following weekend so we had to go up anyway)  <br/>\nwww.cruiseamerica.com had some specials.  From Florida or Louisana it <br/>\nwas get 7 days and get 7 more free (about $1000).  Now, you may need <br/>\nto purchase additional miles and they charge you per hour for the <br/>\ngenerator running so I am sure that will add up.  However, we are <br/>\nweighing all that right now.  I personally think that is the ultimate <br/>\nfamily unschooling vacation!!<br/>\n<br/>\nAnother BTW, you mentioned the thinkpad for your daugther.  It <br/>\ndepends on her personality.  My son has a computer.  I debated for <br/>\nover a year on the leap pad system.  He kept bugging me so finally I <br/>\ngave in.  I figured even if he uses it in the car?? Right??  Wrong.  <br/>\nNever touches the thing!!!  I think after the animations in the <br/>\ncomputer or the personal interaction of reading to him it just <br/>\ndoesn&#39;t do it.  On the other hand my friends son, also 4 1/2 loves <br/>\nhis but he does not have his own computer.  Just a note, the books <br/>\nare expensive and rarely on sale, $15 each.  Computer games can <br/>\nalways be gotten cheaply.  I liked the fact that the reading was so <br/>\nclose to real reading but the words can read wrong.  So all in all, <br/>\nif you know someone who has one, see if you could borrow it!!  If you <br/>\nlived here I would be happy to lend you mine!! &lt;g&gt;<br/>\n<br/>\nHope to meet you at the conference, I always enjoy your posts!<br/>\n<br/>\nOlga<br/>\n<br/>\nShe who laughs...lasts!! :)<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":40256956,"authorName":"jmcseals SEALS","from":"&quot;jmcseals SEALS&quot; &lt;jmcseals@...&gt;","profile":"sevenhavei","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: typical days (was An unschooled lesson in balance)","postDate":"1051992951","msgId":67592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtRjI1WXJUUEJHTHYzVmYwMDAwN2RlZUBob3RtYWlsLmNvbT4="},"prevInTopic":67582,"nextInTopic":67615,"prevInTime":67591,"nextInTime":67593,"topicId":67544,"numMessagesInTopic":0,"msgSnippet":"***Remember, it s great to expand and enhance and enjoy what your kids are doing. The way your day took off from the fork balancing thing was a perfect example","messageBody":"<div id=\"ygrps-yiv-1723582662\">***Remember, it&#39;s great to expand and enhance and enjoy what your kids<br/>\nare doing. The way your day took off from the fork balancing thing<br/>\nwas a perfect example of a day just flowing and letting the learning<br/>\njust *be* right there where it is. Turning anything into a &quot;lesson&quot;<br/>\nis not the point. It&#39;s seeing the learning without the lesson that<br/>\nyou&#39;re looking to get to.***<br/>\n<br/>\nSomehow, that is what I was trying to say but didn&#39;t chose the best words to <br/>\nexpress it. &lt;g&gt;  My husband is so skeptical that he looks for me to explain <br/>\neverything in educational *lesson-learned* mode.  Makes it difficult to lose <br/>\nthe terms, even if you don&#39;t always identify with them.<br/>\n<br/>\nJennifer<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nSTOP MORE SPAM with the new MSN 8 and get 2 months FREE*  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":8378727,"authorName":"zenmomma2kids","from":"&quot;zenmomma2kids&quot; &lt;zenmomma@...&gt;","profile":"zenmomma2kids","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: typical days (was An unschooled lesson in balance)","postDate":"1051990156","msgId":67582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI5MTVhYyszdmc1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTQtRjM1Y2o2RTBFZk9MOGowMDAxODA1NkBob3RtYWlsLmNvbT4="},"prevInTopic":67557,"nextInTopic":67592,"prevInTime":67581,"nextInTime":67583,"topicId":67544,"numMessagesInTopic":0,"msgSnippet":"... make the connection and turn see-sawing into a balance lesson, without actually *teaching*. Remember, it s great to expand and enhance and enjoy what","messageBody":"<div id=\"ygrps-yiv-2098702244\"><blockquote><span title=\"ireply\">&gt;&gt;It&#39;s hard for a some people, myself included a lot of times!, to <br/>\n </span></blockquote>make the connection and turn see-sawing into a balance lesson, <br/>\nwithout actually *teaching*.&gt;&gt;<br/>\n<br/>\nRemember, it&#39;s great to expand and enhance and enjoy what your kids <br/>\nare doing. The way your day took off from the fork balancing thing <br/>\nwas a perfect example of a day just flowing and letting the learning <br/>\njust *be* right there where it is. Turning anything into a &quot;lesson&quot; <br/>\nis not the point. It&#39;s seeing the learning without the lesson that <br/>\nyou&#39;re looking to get to.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I also hear a lot of skeptics and nervous moms state that they <br/>\n </span></blockquote>aren&#39;t *creative enough* to turn everday situations into learning <br/>\nopportunities.&gt;&gt;<br/>\n<br/>\nWe don&#39;t need to turn them into learning opportunities. The learning <br/>\nis there from the start. Even if you had never noticed what your kids <br/>\nwere doing with the forks, they would still have gotten a little <br/>\npiece of the balance puzzle to store in the heads for future <br/>\nreference. Learning to play with ideas, and opportunities to expand <br/>\non them is maybe closer to what we&#39;re looking to do.<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It seems like if there were a place to read how others use those <br/>\n </span></blockquote>little moments to spring off of, it might help them to realize that <br/>\nlearning does, in fact, happen all the time.  And for those that need <br/>\ndocumentation (we don&#39;t in Texas) it would be a great asset when <br/>\ntrying to translate natural, daily activity into educationese.&gt;&gt;<br/>\n<br/>\nHere&#39;s an article I wrote about educationese. Maybe it&#39;s a little of <br/>\nwhat you&#39;re looking for.<br/>\n<br/>\nLife is good.<br/>\n~Mary<br/>\n<br/>\n---------------------------------------------------------------------<br/>\n<br/>\nA Day With Peter Pan<br/>\nby Mary Gold<br/>\n<br/>\nWhat could be more playful than Peter Pan? This well-loved musical <br/>\ntheater production was sure to be a big hit with my daughter and her <br/>\nfriend. Flying pixies, lost boys, pirates, silliness, songs and fun: <br/>\nthis was going to be a day for delight. We set off in great <br/>\nanticipation, leaving thoughts of learning and homeschooling behind. <br/>\nWe started off with lunch, whisked off to the production, and stayed <br/>\nafter to meet the actors for some Q&A. We were after entertainment, <br/>\nand that is what we got.<br/>\n<br/>\nBut a funny thing happened on the way to the forum. (Another fine <br/>\nmusical, by the way.) We experienced something else in the bargain. <br/>\nIt is something that our children understand instinctively, but we <br/>\nparents sometimes have a hard time seeing.  It is something that is <br/>\navailable in any fun day. We experienced a day of natural learning. <br/>\nIt was just as meaningful and productive as any day we may have <br/>\nscheduled as `educational,&#39; even more so in fact because it was all <br/>\nso natural.  We heard new music and rich dialogue. We asked questions <br/>\nand found our answers. We were learning! In fact, there was so much <br/>\nnew information flowing into our day that the girls and I were <br/>\nbubbling over with inspiration. Our discussions and enthusiasm  <br/>\nlasted the long drive home and beyond.<br/>\n<br/>\nJust for fun (and to inform a friend new to homeschooling) I decided <br/>\nto come home and jot it all down. I thought it would be inspiring to <br/>\nsee in print all the learning that takes place in a child&#39;s fertile <br/>\nmind. As an exercise in my own unschooling awareness, I tried to put <br/>\nall we had experienced into the language of school. It is what we <br/>\nhomeschoolers like to call educationese. <br/>\n<br/>\nSo let&#39;s see, what exactly could a professional educator come up with <br/>\nas a syllabus for a day at the theater? Putting on my best <br/>\nbureaucratic curriculum-writin&#39; hat, here is some of what I came up <br/>\nwith.  <br/>\n<br/>\nEnglish:  <br/>\n-Classical Literature: Introduction to James Barrie&#39;s classic novel <br/>\nPeter Pan. Discussed origins of story and compared and contrasted <br/>\nvisual interpretations of the same story. (We talked about the book, <br/>\nthe Disney version and the show.)<br/>\n-Vocabulary: <br/>\n-Introduced the phrase `non sequitur.&#39; Practiced pronunciation and <br/>\nused examples in definition.      (This actually did come up, totally <br/>\nby accidentalmost as if it were a non sequitur. It was a funny <br/>\nconversation.)<br/>\n-Introduced the words overture, conductor, director, technician, and <br/>\nintermission. (These have a more obvious origin.)<br/>\n-Poetry: Created rhymes using classic folk songs.<br/>\n <br/>\nMusic:<br/>\n-Choral participation: Sang traditional songs and composed and sang <br/>\noriginal compositions to traditional tunes. (This happened during the <br/>\ndrive down to the show. You haven&#39;t lived until you&#39;ve heard that new <br/>\nclassic, &quot;Dashing through the snow, on a pair of broken skis...&quot; a <br/>\nfew dozen times.)<br/>\n-Attended a musical performance with a full orchestral accompaniment. <br/>\nListened to and discussed different instruments in an orchestra. <br/>\n <br/>\nTheater:<br/>\n-Attended a professional theater performance. (I guess that one is <br/>\nkind of a given.)<br/>\n-Researched and presented ideas on technical theater applications. <br/>\n(We talked beforehand about how we thought they would do the stunts <br/>\nand stage the show.)<br/>\n-Attended a presentation on staging, vocal prep, acting techniques, <br/>\nscene design and overall production. (This was included as part of <br/>\nthe Q&A with the actors.)<br/>\n <br/>\n<br/>\n<br/>\n<br/>\nScience:<br/>\n-Intro to physics: Learned about momentum, force, and simple <br/>\nmachines. (We saw a demonstration of pulleys and counterweights and <br/>\nlearned exactly how much force it really does take to make Peter Pan <br/>\nfly. Apparently the stagehand on the other end of the rope must jump <br/>\noff a very high ladder to get the actor airborne.)<br/>\n-Electronics: Saw demonstration of microphone and sound technology.  <br/>\n(Did you know that microphones are now so small and sensitive that <br/>\nthey can hide them in the actor&#39;s hair?)<br/>\n <br/>\nMath:<br/>\n-Money skills, simple addition: Counted out change for tip using <br/>\nbills, quarters, dimes and nickels.<br/>\n-Intro to Economics: Discussed basic service industry economics. (As <br/>\nin &quot;why do we leave a tip?&quot;)<br/>\n-Simple multiplication: Figured out the lunch cost per child based on <br/>\nthe $.55 per year of age formula used at the restaurant.<br/>\n <br/>\nSocial Sciences:<br/>\n-Interpersonal Relationships: Explored and experimented with various <br/>\ninterpersonal scenarios. Evaluated efficacy of basic skills and <br/>\nadjusted according to explicit circumstances. (There always seems to <br/>\nbe opportunity to hone these skills.)<br/>\n-Careers: Explored careers in the theater such as acting, set design, <br/>\nsound technician, and lighting technician. <br/>\n <br/>\nWow, what a day! Keep in mind that my daughter is only eight years <br/>\nold and her friend is just six. And yet there they were seeking out <br/>\nall sorts of new information. They were soaking it up like little <br/>\nsponges. Now if I had planned all this out beforehand, it would have <br/>\nbeen a pretty impressive syllabus for one afternoon. Apparently we <br/>\ncovered an awful lot of `topics.&#39; In fact, if I had written it down <br/>\nbeforehand, I would have doubted my ability to fit it all in.  It is <br/>\nquite a little curriculum the girls built into their day.  But I <br/>\ndidn&#39;t have to fit anything in. I simply let the day flow. I talked <br/>\nwith the girls and answered their questions. I kept our pace slow to <br/>\nallow for observation. I acted silly and posed some thought provoking <br/>\nquestions. I did what any parent would do with two bright, <br/>\nthoughtful, eager learners. <br/>\n<br/>\nIf you have never attempted that convoluted language of the schools <br/>\nyou might like to try it sometime. You will undoubtedly impress <br/>\nyourself with how much of what the schools work so hard to accomplish <br/>\ncan be handled by two little girls in just one afternoon of play.  <br/>\nYour syllabus will of course be different than theirs. That is the <br/>\nbeauty of self-directed learning, it suits the learner not the <br/>\nteacher. But the learning will be there.  It will be surrounded by <br/>\njoy, excitement and laughter. Because in the words of author James <br/>\nBarrie &quot;The most wasted day of all is that in which we have not <br/>\nlaughed.&quot;<br/>\n<br/>\n-------------------------------------------------------------------</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] typical days (was An unschooled lesson in balance)","postDate":"1051985530","msgId":67557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0YS4xZWUxYjgyNC4yYmU1NjA3YUBhb2wuY29tPg=="},"prevInTopic":67544,"nextInTopic":67582,"prevInTime":67556,"nextInTime":67558,"topicId":67544,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/3/03 11:48:43 AM, jmcseals@msn.com writes:  The","messageBody":"<div id=\"ygrps-yiv-615790126\">In a message dated 5/3/03 11:48:43 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jmcseals@...\">jmcseals@...</a> writes:<br/>\n<br/>\n&lt;&lt; It was <br/>\ndifficult for me to *see* the lessons my children were actually learning.  &gt;&gt;<br/>\n<br/>\nThe only problem I foresee is that some people might lock onto that idea too <br/>\nhard, and want to &quot;see a lesson&quot; in everything, and only see school-style <br/>\n&quot;lessons&quot; as legitimate goals.  <br/>\n<br/>\nMost people get over that naturally, but others might see it as the target to <br/>\nhit and stick to.<br/>\n<br/>\nOther than that it seems like a great project and isn&#39;t the same <br/>\n(unfortunately for my project &lt;g&gt;) as listing typical days.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":40256956,"authorName":"jmcseals SEALS","from":"&quot;jmcseals SEALS&quot; &lt;jmcseals@...&gt;","profile":"sevenhavei","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] typical days (was An unschooled lesson in balance)","postDate":"1051981260","msgId":67544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTQtRjM1Y2o2RTBFZk9MOGowMDAxODA1NkBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":67557,"prevInTime":67543,"nextInTime":67545,"topicId":67544,"numMessagesInTopic":0,"msgSnippet":"Hi Sandra, I was thinking more along the lines of specific things that happen to show that children learn educational concepts without being *taught*.  Like","messageBody":"<div id=\"ygrps-yiv-1882610232\">Hi Sandra,<br/>\n<br/>\nI was thinking more along the lines of specific things that happen to show <br/>\nthat children learn &#39;educational concepts&#39; without being *taught*.  Like the <br/>\nbalance example with the see-saw.  Personally, I went through very long <br/>\nmoments of doubt, before I joined this list...thanks everyone!!!  It was <br/>\ndifficult for me to *see* the lessons my children were actually learning.  I <br/>\nknow I&#39;ve seen several people on this list ask about documentation, etc., <br/>\nand find it hard to explain exactly *what* their kids are learning in more <br/>\nspecific terms.  It&#39;s hard for a some people, myself included a lot of <br/>\ntimes!, to make the connection and turn see-sawing into a balance lesson, <br/>\nwithout actually *teaching*.<br/>\n<br/>\nI also hear a lot of skeptics and nervous moms state that they aren&#39;t <br/>\n*creative enough* to turn everday situations into learning opportunities.  <br/>\nIt seems like if there were a place to read how others use those little <br/>\nmoments to spring off of, it might help them to realize that learning does, <br/>\nin fact, happen all the time.  And for those that need documentation (we <br/>\ndon&#39;t in Texas) it would be a great asset when trying to translate natural, <br/>\ndaily activity into educationese.<br/>\n<br/>\nAny thoughts?  I&#39;m not exactly sure if this was what you were looking for or <br/>\nnot for your page.<br/>\n<br/>\nJennifer<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nAdd photos to your e-mail with MSN 8. Get 2 months FREE*.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/featuredemail\">http://join.msn.com/?page=features/featuredemail</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":67188,"nextTopicId":67622}}