{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"not about anything current","postDate":"1055221733","msgId":14996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRhLjFkZWNlOTdkLjJjMTZjMWU1QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":14995,"nextInTime":14997,"topicId":14996,"numMessagesInTopic":0,"msgSnippet":"A nine year old letter and progress report (from then). Not important.  Some snapshot moments. 8116 Princess Jeanne NE Albuquerque NM  87110 March 23, 1994 [to","messageBody":"<div id=\"ygrps-yiv-461564170\">A nine year old letter and progress report (from then).<br/>\nNot important.  Some snapshot moments.<br/>\n<br/>\n<br/>\n8116 Princess Jeanne NE<br/>\nAlbuquerque NM  87110<br/>\nMarch 23, 1994<br/>\n<br/>\n[to some friend of mine long ago &lt;g&gt;]<br/>\n<br/>\nI’m about to become the editor of a small, established homeschoolers’ <br/>\nnewsletter.  It was started by people who were on Prodigy having a great time <br/>\nwrestling ideas, insulting each other, and making up.    Prodigy raised their rates <br/>\na huge amount (mine would’ve gone from $18 to $250 a month, for instance) by <br/>\ncharging hourly for what had been an open bulletin board, so we all bailed at <br/>\nonce.  The woman who took the newsletter isn’t enjoying it, and basically <br/>\nproducing a sad little dud, so I’ve been called in to jazz it up and save it.  One <br/>\nproblem is its name.  It’s called:<br/>\nHome Educators’ Computer Companion (HECC)<br/>\nThe Prodigious Backyard Fence.<br/>\n<br/>\nI’m going to switch it around and emphasize “Backyard Fence” and eventually <br/>\ndump all but that.  People can’t cheer for a team they can’t pronounce, and <br/>\nthe “computer” bit discourages non-geeks from subscribing.  There are several <br/>\nChristian fundamentalists involved, but they’ll either develop some tolerance <br/>\nand humor or they’ll wander off and the heathen intellectuals will have won <br/>\none small piece of the homeschooling battle.  I’m going to try to get them to <br/>\nthink and interract without running them off.  It will be an exercise in <br/>\ndiplomacy and integrity, which is about the only kind of exercise I’ve been getting <br/>\nlately.<br/>\n<br/>\nOn my third attempt (third occasional attempt, over a nine-month period) I <br/>\nfinally got the New Mexico state department of education to send me something <br/>\none of their hot-shots bragged we could get for nothing.  I was supposed to ask <br/>\nfor “Essential Competencies.”  What I have received is “New Mexico Competency <br/>\nFrameworks.”  It’s the state’s plan (derived after much expense--committee <br/>\nmeetings all around the state, advice of experts, etc.) to take another route <br/>\nfrom the essential competencies, which I don’t mind.  They claim frameworks are <br/>\nbetter than competencies!  I guess I believe it!  Competencies produce 70% <br/>\nmastery, while frameworks are 100% successful!  Competencies produce losers and <br/>\nwinners, while frameworks produce only winners!  Competencies produce <br/>\nsuccessful programs, while frameworks produce successful students!  If I could find my <br/>\ndiploma I would kiss the “English” part and laud myself for not having <br/>\nmajored in Education.  They took 18 pages (I subtracted title pages and credits) to <br/>\nsay things like “thinking is necessary for communication, and communication <br/>\nimproves your thinking.”  (I clarified that from a half page of “Reading, <br/>\nwriting, speaking and listening are social, interactive processes intertwined with <br/>\nthinking.  Reading writing, speaking and listening are the fundamental skills <br/>\nof communication…” and so forth.   But it’s not all text!  They have charts! <br/>\n They have graphs!  They have Visual Representations of Performance-Based <br/>\nAssessment Models!  What a waste of paper and energy and postage.<br/>\n<br/>\nI meant to ask if you were planning more children, but I figure if you have <br/>\nanother baby I’ll get an announcement like I did the last…<br/>\nHEY!<br/>\n<br/>\nI have three kids who are potty trained and who all talk.  No more infants, <br/>\never, I hope.  (At least not out of me.)  The hair report is like this:  <br/>\nHolly’s is a cross between Peggy Fleming and Joan of Arc.  Marty has a barber cut <br/>\nwhich he made shorter with scissors for practice.  Kirby has a ratty Beatle <br/>\nfront and the whole back end is nearly to his waist.  I still have the <br/>\nstraight-to-the-waist, occasionally braided hippy-do.  Keith just lately went from hair <br/>\npast his shoulders to a style cut (cousin of Bill Clinton’s) at my nagging <br/>\nrequest, because I don’t want Honeywell to fire him for a pony tail.  (Oh!  I <br/>\nforgot!  They can’t fire people for pony tails…)  We are a very unmatched set.<br/>\n<br/>\n-------------<br/>\nEND OF HISTORICAL STROLL...<br/>\n--------------<br/>\n<br/>\nI&#39;m so glad people don&#39;t have to wait for paper homeschooling newsletters <br/>\nanymore!  <br/>\n(some do, but most don&#39;t have to)<br/>\n<br/>\nI enjoyed the mini-rant on the competencies framework.  I had forgotten all <br/>\nabout that.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":14966,"nextTopicId":14997}}