{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: How do I handle pressure to control - thanks","postDate":"1033533440","msgId":45049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFuZHQ2MCtpMGQ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTQwMWMyNjljMSQ2MmEyMTgzMCQzZTg2MzNjYkBoYWxsYW0+"},"prevInTopic":45043,"nextInTopic":0,"prevInTime":45048,"nextInTime":45050,"topicId":44917,"numMessagesInTopic":0,"msgSnippet":"What about writing out a daily log of educational activities?  Make the unschooling look like school.  Make lists of subjects covered. Legos are math","messageBody":"<div id=\"ygrps-yiv-1455146592\">What about writing out a daily log of educational activities?  Make <br/>\nthe unschooling look like school.  Make lists of subjects covered.  <br/>\nLegos are math manipulatives.  Drawing pictures is art. Making mud <br/>\npies in the back yard is science.  If they ask you why people brush <br/>\ntheir teeth, that&#39;s health.  Run errands around town, that&#39;s social <br/>\nstudies.  If you read a story together, that&#39;s language arts <br/>\n(reading) as well as whatever subjects the book covers. AAnd don&#39;t <br/>\nforget to write down the educational content of the tv programs they <br/>\nwatch!  <br/>\n<br/>\nTell your dh that you will cover all of the academic subjects and <br/>\nthen take a half our each night to write down what your children did <br/>\nin each subject.  Be creative and open minded about what fits under <br/>\neach &quot;subject&quot;.  Make it sound like school.  <br/>\n<br/>\nJust an idea...<br/>\nSheila<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sheree suggested an umbrella programme - this has also been <br/>\n </span></blockquote>suggested by<br/>\n<blockquote><span title=\"ireply\"> &gt; a different friend to placate my dh&#39;s conservatism.  I&#39;ve tried <br/>\n </span></blockquote>several<br/>\n<blockquote><span title=\"ireply\"> &gt; times (gently) to initiate structured activities but the oldest just<br/>\n&gt; doesn&#39;t like them and I am extremely uncomfortable attempting to <br/>\n </span></blockquote>insist.<br/>\n<blockquote><span title=\"ireply\"> &gt; The youngest is only 4 and hasn&#39;t shown any interest in bookwork.  <br/>\n </span></blockquote>My<br/>\n<blockquote><span title=\"ireply\"> &gt; philosophy is that the boys learn best from their chosen <br/>\n </span></blockquote>activities -<br/>\n<blockquote><span title=\"ireply\"> &gt; from engaging in their world and finding answers to their own <br/>\n </span></blockquote>questions<br/>\n<blockquote><span title=\"ireply\"> &gt; (which doesn&#39;t stop them also learning from me and others who tell <br/>\n </span></blockquote>them<br/>\n<blockquote><span title=\"ireply\"> &gt; things as they become relevant and include them in our <br/>\n </span></blockquote>activities).  I<br/>\n<blockquote><span title=\"ireply\"> &gt; can&#39;t see that philosophy meshing with setting a program before the <br/>\n </span></blockquote>boys<br/>\n<blockquote><span title=\"ireply\"> &gt; and urging them to complete this or that because someone out there<br/>\n&gt; thinks it is good for them to know, with the threat hanging over us <br/>\n </span></blockquote>that<br/>\n<blockquote><span title=\"ireply\"> &gt; if they don&#39;t complete the work then we&#39;re failing at homeschooling.<br/>\n&gt; <br/>\n&gt; Thanks Betsy, I&#39;ve reserved some Marcia Williams books from the <br/>\n </span></blockquote>library.<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Mica<br/>\n&gt; ghal9720@b...<br/>\n&gt; Stawell, Victoria, Australia </span></blockquote></div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"hsmominoz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: How do I handle pressure to control - thanks","postDate":"1033531257","msgId":45043,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Zi4xNGRkYTI1ZC4yYWNiYzk3OUBhb2wuY29tPg=="},"prevInTopic":45038,"nextInTopic":45049,"prevInTime":45042,"nextInTime":45044,"topicId":44917,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/1/02 10:13:02 PM Central Daylight Time, ... What about asking your husband if he would be more willing to see more *concrete* proof of","messageBody":"<div id=\"ygrps-yiv-1019939072\">In a message dated 10/1/02 10:13:02 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ghal9720@...\">ghal9720@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sheree suggested an umbrella programme - this has also been suggested by<br/>\n&gt; a different friend to placate my dh&#39;s conservatism.  I&#39;ve tried several<br/>\n&gt; times (gently) to initiate structured activities but the oldest just<br/>\n&gt; doesn&#39;t like them and I am extremely uncomfortable attempting to insist.<br/>\n&gt; The youngest is only 4 and hasn&#39;t shown any interest in bookwork.  My<br/>\n&gt; philosophy is that the boys learn best from their chosen activities -<br/>\n&gt; from engaging in their world and finding answers to their own questions<br/>\n&gt; (which doesn&#39;t stop them also learning from me and others who tell them<br/>\n&gt; things as they become relevant and include them in our activities).  I<br/>\n&gt; can&#39;t see that philosophy meshing with setting a program before the boys<br/>\n&gt; and urging them to complete this or that because someone out there<br/>\n&gt; thinks it is good for them to know, with the threat hanging over us that<br/>\n&gt; if they don&#39;t complete the work then we&#39;re failing at homeschooling.<br/>\n<br/>\n </span></blockquote>What about asking your husband if he would be more willing to see more <br/>\n*concrete* proof of the results of your unschooling? I assume your dh is away <br/>\nat work most of the time? What if you kept a scrapbook of things, ticket <br/>\nstubs, photos of places and things you do and see, copies of your children&#39;s <br/>\nwriting... I know you are in Australia, but some of the states here require a <br/>\nportfolio of some sort as documentation. How would you feel about giving your <br/>\ndh that documentation in scrapbook form?<br/>\n <br/>\nTalk to your kids about maybe making an effort to put out more *stuff* Ask <br/>\nthem to draw more pictures of what they are doing so you can put these up <br/>\naround the house. Ask them if they would be interested in writing down some <br/>\nof their adventures. I am not talking about making them or asking them to do <br/>\nmore schoolish type work or book work, just more of an effort to show what <br/>\ngoes on during the day. Does your dh see the proof of your days? Maybe he <br/>\nneeds to see that to feel more comfortable. <br/>\n<br/>\nAlso, is the word unschooling getting in the way? (it does tend to have a <br/>\nnegative connotation to those who don&#39;t understand what it means) Maybe, stop <br/>\nusing the word unschooling with your husband? Just call it homeschooling. You <br/>\nwill still know what you mean, he thinks better of it.<br/>\n~Nancy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":123062302,"authorName":"Mica","from":"&quot;Mica&quot; &lt;ghal9720@...&gt;","profile":"micaherself","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Re: How do I handle pressure to control - thanks","postDate":"1033528277","msgId":45038,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTQwMWMyNjljMSQ2MmEyMTgzMCQzZTg2MzNjYkBoYWxsYW0+","inReplyToHeader":"PGFuYmpzaCtsZXQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":44917,"nextInTopic":45043,"prevInTime":45037,"nextInTime":45039,"topicId":44917,"numMessagesInTopic":0,"msgSnippet":"Thankyou Marji, Sheree, Nancy, Rachel Ann, Myranda, Sandra, Todd, Betsy, Deborah & Mary (and any others I haven t seen) It was great to get all of your ideas.","messageBody":"<div id=\"ygrps-yiv-1785156872\">Thankyou Marji, Sheree, Nancy, Rachel Ann, Myranda, Sandra, Todd, Betsy,<br/>\nDeborah & Mary (and any others I haven&#39;t seen)<br/>\n<br/>\nIt was great to get all of your ideas. Yes Todd it did/does feel a lot<br/>\nbetter knowing I have you all to write to.<br/>\n<br/>\nA few of you pointed out how important it is that husband and counsellor<br/>\nlearn a lot more about unschooling before we can discuss it seriously.<br/>\nI agree absolutely and I tried to make the point in the session but it<br/>\nwas dismissed. I like the way you have all said it and I&#39;m printing out<br/>\nyour words so I can practice the phrases to myself so I can say them<br/>\ncalmly and rationally.<br/>\n<br/>\nI don&#39;t think the counsellor is interested in reading about unschooling<br/>\nbecause if I understood her correctly she wants to avoid the details of<br/>\nour decisions - just wants to stick with the interpersonal relationship<br/>\nof dh & I.  I think the reason she asked me how I would feel about<br/>\ncompromise instead of first asking dh whether he would compromise about<br/>\nlearning more about unschooling, was possibly just for balance (putting<br/>\nideas to each of us equally) or possibly because we are keen to not get<br/>\ninto a situation of appearing to ask dh to change because that was his<br/>\nproblem with earlier counselling.  It was unfortunate that the<br/>\ncounsellor insisted on sticking with the question as she first put it<br/>\ninstead of taking a different angle or moving on to another issue, or<br/>\ngoing back to helping us learn strategies to deal with issues with each<br/>\nother.<br/>\n<br/>\nAfter months (years really) of asking my dh to read some of the articles<br/>\nI&#39;ve collected over the years so that we can actually discuss the issue<br/>\nproperly - I really don&#39;t think he is going to read anything.  However,<br/>\nit would probably only be fair to prepare a list of the most relevant<br/>\nreading items to give to them.  I&#39;ll have to look at them all again - it<br/>\nisn&#39;t easy because I have five folders&#39; worth, and whenever I start to<br/>\nconsider I begin to think that it would be easier if I could identify<br/>\nthe particular issues that bother the other person (which are not<br/>\nnecessarily the same as my own objectives).  If I do put the list<br/>\ntogether I might try to find a website to place the list for others&#39; to<br/>\nuse if it is needed.<br/>\n<br/>\nSandra you wrote &quot;I&#39;m guessing the counsellor was really trying to get<br/>\nto what they dynamics are between the husband and wife about the issue<br/>\nof the kids.&quot;  I think there may be something in this.  If that was her<br/>\nobjective she wasn&#39;t going about it very well because her insistence on<br/>\nrepeating the same question that I had already stated could not be<br/>\nanswered without being clarified and/or changed led to me feeling<br/>\nattacked and defensive - feelings which she identified but misapplied to<br/>\nbeing related to our parental dynamic instead of the counsellor/client<br/>\ndynamic.  In fact dh mentioned later that he had been surprised because<br/>\nthe angle being taken did appear to be ganging up, but that he could<br/>\nguess what she was really trying to get to.  <br/>\n<br/>\nIt will be interesting to see what direction we take on Friday. Nancy,<br/>\nwe see the counsellor together.  I am not averse to finding a new<br/>\ncounsellor if necessary (having been prepared to look hard to find<br/>\nsomeone that dh would be comfortable with) but the expense has me<br/>\nthinking that dh will be reluctant to try any others.<br/>\n<br/>\nSheree suggested an umbrella programme - this has also been suggested by<br/>\na different friend to placate my dh&#39;s conservatism.  I&#39;ve tried several<br/>\ntimes (gently) to initiate structured activities but the oldest just<br/>\ndoesn&#39;t like them and I am extremely uncomfortable attempting to insist.<br/>\nThe youngest is only 4 and hasn&#39;t shown any interest in bookwork.  My<br/>\nphilosophy is that the boys learn best from their chosen activities -<br/>\nfrom engaging in their world and finding answers to their own questions<br/>\n(which doesn&#39;t stop them also learning from me and others who tell them<br/>\nthings as they become relevant and include them in our activities).  I<br/>\ncan&#39;t see that philosophy meshing with setting a program before the boys<br/>\nand urging them to complete this or that because someone out there<br/>\nthinks it is good for them to know, with the threat hanging over us that<br/>\nif they don&#39;t complete the work then we&#39;re failing at homeschooling.<br/>\n<br/>\nThanks Betsy, I&#39;ve reserved some Marcia Williams books from the library.<br/>\n<br/>\nMica<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ghal9720@...\">ghal9720@...</a><br/>\nStawell, Victoria, Australia</div>","specialLinks":[]},{"userId":113204981,"authorName":"Sheree Harrell","from":"&quot;Sheree Harrell&quot; &lt;mortgagemoma@...&gt;","profile":"mortgagemoma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: How do I handle pressure to control","postDate":"1033458385","msgId":44917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFuYmpzaCtsZXQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45038,"prevInTime":44916,"nextInTime":44918,"topicId":44917,"numMessagesInTopic":0,"msgSnippet":"Mica, Are you familiar with the number one Contemporary Christian recording artist from Austrailia (sp?), Rebecca St. James?  She was homeschooled.  Her music","messageBody":"<div id=\"ygrps-yiv-248716506\">Mica,<br/>\n<br/>\nAre you familiar with the number one Contemporary Christian recording <br/>\nartist from Austrailia (sp?), Rebecca St. James?  She was <br/>\nhomeschooled.  Her music is very good cross over from Christian to <br/>\npop or country (contemporary).  <br/>\n<br/>\nAlso, get John Holt&#39;s &quot;How Children Learn.&quot;  And Alphie <br/>\nCohn&#39;s &quot;Punished By Rewards.&quot;  These books can be shared with your <br/>\nhusband and therapist.  <br/>\n<br/>\nSometimes, the best thing to do with others outside of your group(s) <br/>\nis to not discuss the unschooling style.  People simply don&#39;t <br/>\nunderstand it.  Even other homeschoolers. Their comments may only <br/>\nserve to hurt you and you may never &#39;enlighten&#39; them; besides that is <br/>\nnot your job anyway.  You have kids to raise and educate so how aunt <br/>\ngladys feels about your homeschooling style is not a priority (unless <br/>\nshe tries to cause you harm by calling social services).  In this <br/>\ncase, the least told to her, the better.  Not that you are hiding <br/>\nanything; you simply have other things better to do.  And in some <br/>\nlocales, social services simply discriminates against homeschoolers, <br/>\nespecially unschoolers.<br/>\n <br/>\nA simple statement such as, &quot;My children are gifted and to meet their <br/>\nintellectual and emotional needs appropriately, we are enrolling them <br/>\ninto a private school for gifted kids.&quot;  Then enroll them in a cover <br/>\nschool via the internet.  There are several available with different <br/>\nstyles and philosophies.  My cover school is Progressive Network <br/>\nAcademy and this school was created for my daughter and other kids <br/>\nwho deserve a better, more efficient education.  It may not be right <br/>\nfor you, especially if your husband is conservative philosophically.<br/>\nSee it at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.orgsites.com/nc/progressivenetworkacademy\">http://www.orgsites.com/nc/progressivenetworkacademy</a> <br/>\nThere are many other cover schools and they all have their own <br/>\nphilosophies.  So, researching several would be best and it would <br/>\nenable you to find what best suits your family.  <br/>\n<br/>\nI hope this helps..<br/>\n<br/>\nPlease make sure your therapist reads the Holt book just in case she <br/>\nis talking to social services.  Especially if your children have been <br/>\nlabeled with any sort of disablilty even if unrelated to the school <br/>\nissue as these cases tend to send more intervention by the social <br/>\nservices agencies (in my own research and experience).<br/>\n<br/>\nYou are doing the right thing.  Your boys are blessed to have a <br/>\ncompassionate mother-advocate like yourself.  You do understand their <br/>\ntrue nature as young learners; keep it up and be persistant.  Do not <br/>\nback down, but tread gently and safely with support from your groups. <br/>\n<br/>\nAnd groups like this are a Godsend!<br/>\n<br/>\nLove, <br/>\nSheree</div>","specialLinks":[]}],"prevTopicId":45035,"nextTopicId":44990}}