{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":57,"messages":[{"userId":0,"authorName":"SandraDodd@xxx.xxx","from":"SandraDodd@...","replyTo":"LIST","senderId":"bqOb5iRU2aVShXT0JCk7og6qRWu0oCn_6l5tWCCo7fRSuBQR9w9QHQ7JDQ-IBGfweJYzOLAW4XIp","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929202275","msgId":1000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43Ny4xMDAwLjk1OTI2OTc0MEBlR3JvdXBzLmNvbT4="},"prevInTopic":999,"nextInTopic":1002,"prevInTime":999,"nextInTime":1001,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/1999 9:02:01 PM, careermom@mindspring.com wrote: ","messageBody":"<div id=\"ygrps-yiv-261466390\">In a message dated 6/11/1999 9:02:01 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:careermom@...\">careermom@...</a> wrote:<br/>\n<br/>\n&lt;&lt; Sometimes I think that unschooling looks easy on the outside, but is<br/>\nreally more work than traditional homeschooling, and wonder if I have the <br/>\nenergy<br/>\nto do it!&gt;&gt;<br/>\n<br/>\nIt&#39;s not more work, but it&#39;s more mental work to get started.  For <br/>\ntraditional, you can write a check, look at the calendar and say &quot;DO THIS.&quot;  <br/>\n<br/>\nOnce you get established in unschooling, it becomes effortless.<br/>\n<br/>\nI know martial arts teachers say all the time &quot;this will become effortless&quot; <br/>\nbut that&#39;s after ten years of sweating your butt off!    This is not NEARLY <br/>\nin that range of difficulty.  Honest.<br/>\n<br/>\nThis list, if it is kept to topic, will be a perfect dojo for learning <br/>\nunschooling.  There are some very experienced unschoolers here who write well <br/>\nand who are willing to commit a goodly amount of time and energy to helping <br/>\nthe newcomers here.  When I asked that the list be kept to topic, it was out <br/>\nof a well-founded fear that some of the best unschoolers here would drop off <br/>\nthe list if it remained chatty about curriculum.  IF it turns out that people <br/>\ncame here directly without awareness of what unschooling really is, the best <br/>\nthing would be for them to read more and post less until they decide if they <br/>\nreally want to be on an unschooling list.<br/>\n<br/>\nSome have said that&#39;s wrong of me to ask.  <br/>\nMore have said it&#39;s good.  <br/>\n<br/>\nIf you went into a karate school and started boxing or break dancing they&#39;d <br/>\nthrow you out.   If you go to a brass band practice with a violin, they&#39;re <br/>\nnot going to let you play with them no matter HOW good you are.  You can&#39;t go <br/>\nto a bow shoot with a rifle.  <br/>\n<br/>\nThis is a very worthy topic I hope many here will pursue:<br/>\n&lt;&lt;&lt;&lt; Sometimes I think that unschooling looks easy on the outside, but is<br/>\nreally more work than traditional homeschooling, and wonder if I have the <br/>\nenergy<br/>\nto do it!&gt;&gt;&gt;&gt;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@xxx.xxx","from":"SandraDodd@...","replyTo":"LIST","senderId":"KfWeT090qhGAmZXAAJ3y7An4pXbXj3oBn9BsjpjSOUwa8e1ZqdU39rTrN3Bq4Dzn0nNo9kqmAsQy","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929201372","msgId":999,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43Ny45OTkuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":998,"nextInTopic":1000,"prevInTime":998,"nextInTime":1000,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/1999 7:52:27 PM, you wrote: ","messageBody":"<div id=\"ygrps-yiv-861212155\">In a message dated 6/11/1999 7:52:27 PM, you wrote:<br/>\n<br/>\n&lt;&lt;As far as Algebra and Higher Math... We use these in real life... so what <br/>\nif <br/>\nwe don&#39;t know the theorems (sp?) and &quot;rules&quot;?  When trying to figure out how <br/>\nmuch paint we need to cover a 2000 sf house, we use algebra.  When trying to <br/>\ndecide how big a tarp we need to cover our cords of wood, we use algebra...  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>My kids wouldn&#39;t know how to write out the equation at all (when they want to <br/>\nsomeday, it will take about ten minutes to explain all the symbols and <br/>\npositioning) but they can in their heads figure out with marty&#39;s allowance or <br/>\nKirby&#39;s (different rates) how many weeks it will take to buy a certain thing <br/>\nnew or used (two different factors).  And they can figure the tax in their <br/>\nheads while they&#39;re at it.  ALL that is algebra.  Most of the kids in school <br/>\ngetting A&#39;s in algebra wouldn&#39;t know what it was actually applicable to in <br/>\ntheir own real lives, they&#39;re just solving &quot;problems&quot; already set up on <br/>\npaper.  They&#39;re doing calculations.<br/>\n<br/>\nI&#39;ve told this story before, so sorry for the repetition.<br/>\n<br/>\nI was complaining to my husband one night that I HATED math in school, all <br/>\nexcept the word problems.  I loved those, but there would only be two per <br/>\nexercise, and 38 of the stupid number problems.   <br/>\n<br/>\nHe said &quot;Those are the only problems there.  The others are answers.  All <br/>\nthat&#39;s left is the calculation.&quot;<br/>\n<br/>\nOH!  So I DID like mathematics, I just didn&#39;t like the <br/>\nnumbers-without-words-or-purpose &quot;exercise&quot; parts.<br/>\n<br/>\nLast night a friend was telling me that he was baffled by trigonometry in <br/>\ncollege.  Nobody could tell him what it was good for.  Then he took an <br/>\nelectrical engineering class, and the DC part was all linear algebra, and <br/>\nwhen they got to AC it was TRIGONOMETRY and he was thrilled and THEN he got <br/>\ntrigonometry, because he had an application for it.<br/>\n<br/>\nI&#39;ve studied literature, history, folklore, anthropology, I do music as <br/>\nhobby--recorder, guitar, singing.   I sew.   I play with philosophy.  I have <br/>\nnever one time in my life needed trigonometry.<br/>\n<br/>\nIf I did, I&#39;d know how to learn it, though!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@xxx.xxx","from":"SandraDodd@...","replyTo":"LIST","senderId":"8yA2rVMs2LFtpF8wgi7eCAMJ9nkcjY1CJ7yC8D0rJOnX9N9TgeGtj1OmK1iFZp35QvosPwxnj0wV","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929200525","msgId":998,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43Ny45OTguOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":997,"nextInTopic":999,"prevInTime":997,"nextInTime":999,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/1999 6:15:44 PM, katejw@ionet.net wrote: ","messageBody":"<div id=\"ygrps-yiv-447531659\">In a message dated 6/11/1999 6:15:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katejw@...\">katejw@...</a> wrote:<br/>\n<br/>\n&lt;&lt; I&#39;m seeing this is quite a debate of semantics more than anything else. &gt;&gt;<br/>\n<br/>\nTerminology and semantics are what thinking and analysis are about.<br/>\nIf we&#39;re not clarifying terms, we can&#39;t really have a discussion about <br/>\nbeliefs.<br/>\nWithout clear beliefs, what basis will we have for what we&#39;re doing?<br/>\n<br/>\nIf people want to just follow a pre-set pattern without understanding fully <br/>\nwhy and what and how, that&#39;s not unschooling.  Each unschooling parent (or at <br/>\nleast one in each family) NEEDS to understand the difference between teaching <br/>\nand learning.  They NEED to think hard and long and carefully about what they <br/>\nbelieve about what is &quot;necessary.&quot;  It doesn&#39;t have to be done in advance of <br/>\nbeginning to unschool.  It&#39;s part of the whole process.  But deciding in <br/>\nadvance that such things are unimportant is, I believe, part of a recipe for <br/>\neventual failure.   How can we defend what we don&#39;t understand?  <br/>\n<br/>\nUnschooling is all about how learning works.  It seems to me that what books <br/>\nyou have in the house, or how often you go to a museum, or whether you allow <br/>\nunlimited computer games isn&#39;t nearly as important as whether you believe <br/>\nthat people learn unceasingly for fun when their desire isn&#39;t destroyed <br/>\nsomehow.<br/>\n<br/>\nI don&#39;t think it&#39;s just semantics at all.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@xxx.xxx","from":"SandraDodd@...","replyTo":"LIST","senderId":"mP0KQcVjSSs1F2176QRHtZMEn1qNPLK8j90oIRRMfmNPdNH4atgpCVAYToySNcaXcFriPsEJCs1p","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929199443","msgId":997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43Ny45OTcuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":993,"nextInTopic":998,"prevInTime":996,"nextInTime":998,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/1999 6:15:44 PM, katejw@ionet.net wrote: ","messageBody":"<div id=\"ygrps-yiv-1260660743\">In a message dated 6/11/1999 6:15:44 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katejw@...\">katejw@...</a> wrote:<br/>\n<br/>\n&lt;&lt;You caught me on the newness of the list!  I had forgotten we got it from a<br/>\nlink from another homeschool list and that it was  a NEW list! &gt;&gt;<br/>\n<br/>\nSo does that mean there are people here who have come on the list without <br/>\nhaving gone to www.unschooling.com and read there first?<br/>\n<br/>\nThat would explain a lot, if so!! &lt;g&gt;<br/>\n<br/>\nI assumed that everyone here had been to that site, understood the underlying <br/>\nphilosophy, and had signed on to this list because they had read everything <br/>\nat the main site and just needed MORE.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"Linda Wyatt","from":"Linda Wyatt &lt;hilinda@...","replyTo":"LIST","senderId":"_ooEn7UpCSSlhQdzlBhBocHgnLYa4i3YzgZyUPzIZBMW-FbYhzVyaRBy5SohA1d8lX13lMyFWQlxofs_vmpBdzTnpljaLn5ncXw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929188884","msgId":993,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43Ny45OTMuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":991,"nextInTopic":997,"prevInTime":992,"nextInTime":994,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... And I ll still say no, someone would not have to be taught.  They very well could be taught, if that s the route they want to go, but it is not an absolute","messageBody":"<div id=\"ygrps-yiv-1256006525\"><blockquote><span title=\"ireply\">&gt; From: &quot;Dale & Karen Jones-Waddell&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katejw@...\">katejw@...</a>&gt;<br/>\n<br/>\n&gt; My husband&#39;s comment was in reference to needing some textbooks and teaching<br/>\n&gt; for higher math--not that required to paint a house, but that required for<br/>\n&gt; jobs such as engineering of all types.  NO, I was not saying cram it down<br/>\n&gt; every kid&#39;s throat.  I WAS saying if a child wanted to do that, then<br/>\n&gt; wouldn&#39;t one have to be taught.<br/>\n<br/>\n </span></blockquote>And I&#39;ll still say no, someone would not have to be taught.  They very well<br/>\ncould be taught, if that&#39;s the route they want to go, but it is not an<br/>\nabsolute necessity.  I&#39;m not saying that being taught is a terrible thing-<br/>\nonly that it is not the necessity that many people think it is.  It is not<br/>\nthe only way.<br/>\n<br/>\nI learned calculus on my own. I was in a foreign country and my math needs<br/>\ndid not match up with the schedule in the school I attended, so I had<br/>\nindependent study all year.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Do you really think unschooling is so hot,<br/>\n<br/>\n </span></blockquote>Where is this coming from?<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; that you can teach (oh excuse me, learn) engineering in 18 months, when it<br/>\n&gt; takes 5 years in college.<br/>\n<br/>\n </span></blockquote>When what takes 5 years?<br/>\n<br/>\n&quot;Engineering&quot; is a might broad vague term.  What exactly do you mean by it?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You think those kids sit around and party all the<br/>\n&gt; time?<br/>\n<br/>\n </span></blockquote>Some of them do.  Trust me.<br/>\n<br/>\nGrowing up and living in the same town as a major University with a well<br/>\nrespected Engineering school, I don&#39;t have quite the awe of it that many<br/>\npeople have.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  You think their teachers have their heads in the wrong place?<br/>\n<br/>\n </span></blockquote>No.  I just think that teachers are only one of many ways for someone to<br/>\nlearn something.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So<br/>\n&gt; it seems its okay to brag about being a real unschooler until they are old<br/>\n&gt; enough to choose engineering, then hey, they chose it, now they can go to<br/>\n&gt; college and teachers are good guys because the kid chose them.  Huh?<br/>\n<br/>\n </span></blockquote>I haven&#39;t said that, has anyone?<br/>\n<br/>\nFWIW, my husband is a software engineer, and he is self taught.  He did not<br/>\nlearn his skills in college.  I expect that my two boys may go the same<br/>\nway, and not choose college.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; BRAHAHAHAHA.  Argue on.  Scapegoat on.  Paint me in a box until I scream<br/>\n&gt; &quot;Uncle!&quot;  But your barking up the wrong tree.<br/>\n<br/>\n </span></blockquote>You seem to be taking things way too personally.  No one is making you a<br/>\nscapegoat, they&#39;re responding to the issues in your posts.  If you don&#39;t<br/>\nwant responses to your posts, perhaps you shouldn&#39;t post them?<br/>\n<br/>\n<br/>\nLinda<br/>\n<br/>\n--<br/>\nLinda Wyatt<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hilinda@...\">hilinda@...</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lightlink.com/hilinda\">http://www.lightlink.com/hilinda</a><br/>\nLearning everywhere, all the time.<br/>\nAlgebra before breakfast<br/>\n&quot;A lie, you see, no matter how often or how vociferously repeated, may be<br/>\nmistaken for the truth, but it does not become the truth.&quot; - Adam Crown</div>","specialLinks":[]},{"userId":0,"authorName":"Linda Wyatt","from":"Linda Wyatt &lt;hilinda@...","replyTo":"LIST","senderId":"GcyvKWCcrhBo-f7O0A8HWxBwcU01iL5C8umAWi55nU7wTUqI_zfe-yITel3s5e6Aa-VeSlpITSUzt5yKb5hB-sFau2wHo3ub_Aw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929187835","msgId":991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43Ny45OTEuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":985,"nextInTopic":993,"prevInTime":990,"nextInTime":992,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... It helps because one of the most important things is being comfortable, really comfortable, with numbers and how they relate to each other.  Basic ","messageBody":"<div id=\"ygrps-yiv-666571306\"><blockquote><span title=\"ireply\">&gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Hsmotgo@...\">Hsmotgo@...</a><br/>\n&gt;<br/>\n&gt; No one gives specific examples, just &quot;play with numbers&quot;<br/>\n&gt; how does that help?<br/>\n<br/>\n </span></blockquote>It helps because one of the most important things is being comfortable,<br/>\nreally comfortable, with numbers and how they relate to each other.  Basic<br/>\narithmetic needs to be something that not only can you do, it&#39;s part of how<br/>\nyou think.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I never played with numbers so don&#39;t understand.<br/>\n<br/>\n<br/>\n </span></blockquote>Play games.  Play with dice.  Add numbers in your head.  Factor numbers in<br/>\nyour head.  Play with things like dividing something, then multiplying it<br/>\nto get back where you started.  This sounds simplistic, but it really<br/>\nmatters.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  &quot; lots of music stuff,&quot; my kids play three instruments, how does this<br/>\n&gt; help with  higher math?<br/>\n<br/>\n </span></blockquote>Music and math share the concepts of recognizing and creating patterns.<br/>\nReally.  Music theory is math in a different form.<br/>\n<br/>\nLook at improvisational music- how is that done?  The player has to know<br/>\nwhat key he is in, and what that means, and how to stay within that<br/>\nframework- or if he wants, where to go outside of it and still have it<br/>\nsound good.  The listener has a part in this, too, because part of what<br/>\nmakes music beautiful and meaningful is an intrinsic understanding of music<br/>\ntheory on a basic level- what sounds in tune, what sounds discordant, where<br/>\nthings sound like they should be going.  You can hear a chord resolve in<br/>\nyour head, even if it doesn&#39;t actually resolve in the music, because you<br/>\nexpect it to be that way.  Good musicians play with your expectations, and<br/>\nsurprise you some of the time.  Your experience of the music involves what<br/>\nyou&#39;ve just heard, keeping it in your head, and adding to it the new sounds<br/>\nhappening, and making them relate in your mind.<br/>\n<br/>\nDid you think I was going to fall back on the time signature as the math in<br/>\nmusic?  Sure, that&#39;s part of it, the rhythms, but it&#39;s the notes and chords<br/>\nand their relationships to each other that is part of higher math.<br/>\n<br/>\nListen to counterpoint, baroque music, minimalist music.  Listen to music<br/>\nin different tonal systems (like Gamelan or different Eastern music forms).<br/>\nSing arpeggios.  Play duets, or rounds.  Try having two people play the<br/>\nsame piece, but one play it twice through, twice the speed- how do they<br/>\nsound together that way?  Why?<br/>\n<br/>\nGo look up the Pythagorean Scale, see where it came from, how it changed<br/>\nand why.  Then listen to early Bach.  Listen to my favorite Bach- The Well<br/>\nTempered Clavier (where did the name come from, and what does it mean?  Why<br/>\nis that important?)  Try to find a performance on pre-Pythagorean<br/>\ninstruments.<br/>\n<br/>\nI really am beginning to believe that part of this culture&#39;s problem with<br/>\nmath fear and deficiency is that the educational system largely ignores<br/>\nmusic and art.  Back during the time of the most famous mathematicians,<br/>\nmusic was considered one of the most important academic subjects.  I think<br/>\nlistening to and interpreting music, lots of different styles, is part of<br/>\nwhat helps our brains learn and practice making the connections they use in<br/>\nmath.  Trying to teach math without that background is almost like<br/>\nexpecting a child to speak who has bever been spoken to.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am not being contrary, I am SERIOUS here.  I want to let my<br/>\n&gt; children have a happy learning experience, and if I am the culprit of them<br/>\n&gt; not having that, then I want to do something about it.<br/>\n<br/>\n </span></blockquote>You are not the culprit- more likely, what was done to you as a child is<br/>\nthe culprit.<br/>\n<br/>\nYou can undo it, just like your children can if they have had negative math<br/>\nexperiences.<br/>\n<br/>\nThe book &quot;Family Math&quot; is a good starting place.  (I hear they have a<br/>\ncouple of new versions out, one for younger kids, and one for older, but I<br/>\nhaven&#39;t seen those)  It&#39;s full of games.  Try some.   Start with easy ones,<br/>\nprogress through whichever catch your interest.  The important thing is to<br/>\nhave fun with them.  Once you&#39;re having fun, think about what you&#39;re doing,<br/>\nreally think- why do things work that way?  What is easier or harder for<br/>\nyou?  Why?  Where are your personal math blocks?<br/>\n<br/>\nYou may want to doodle while you think, or draw or sing or talk with<br/>\nsomeone or whatever helps stuff to stick in your head.<br/>\n<br/>\nOne of my favorite things to do, and to tell people to do, is to play with<br/>\nconverting numbers into different forms.  Go from decimal to fraction to<br/>\npercentage to ratio and back again.  Get comfortable with numbers in their<br/>\ndifferent forms, so that you can take advantage of which form most easily<br/>\nlends itself to a certain situation.  (Decimals are good for money, for<br/>\nexample)  Be as comfortable manipulating fractions as anything else.<br/>\n<br/>\nSee math as a game, not a chore.  A playground.  A tool, if you have to, or<br/>\nif you like tools.<br/>\n<br/>\nGo look at stuff like fractals and complex geometric shapes, see the<br/>\nintricacy and beauty of math.<br/>\n<br/>\n<br/>\n<br/>\n--<br/>\nLinda Wyatt<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hilinda@...\">hilinda@...</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lightlink.com/hilinda\">http://www.lightlink.com/hilinda</a><br/>\nLearning everywhere, all the time.<br/>\nAlgebra before breakfast<br/>\n&quot;A lie, you see, no matter how often or how vociferously repeated, may be<br/>\nmistaken for the truth, but it does not become the truth.&quot; - Adam Crown</div>","specialLinks":[]},{"userId":0,"authorName":"Brown","from":"Brown &lt;mjcmbrwn@...","replyTo":"LIST","senderId":"JG3MCf00FKhjHnfZse2beeSD1miGpUxvXVBIP-9M-4ixmSsMT72dnwCvRMBMLzRTlRxUnU7OfEJ6W9U39xH0JzFS","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Musings from the shower","postDate":"929174071","msgId":985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43Ni45ODUuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":983,"nextInTopic":991,"prevInTime":984,"nextInTime":986,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"Karen and all ... One of the many special things about New Zealand :-) is the Playcenter movement which started back during WW2 to support mothers with young","messageBody":"<div id=\"ygrps-yiv-1277334398\">Karen and all<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am curious what ages your children were when most of you started<br/>\n&gt; &quot;unschooling&quot;, however each of you may define it.<br/>\n<br/>\n </span></blockquote>One of the many special things about New Zealand :-) is the Playcenter movement<br/>\nwhich started back during WW2 to support mothers with young children whose<br/>\nhusbands were away fighting. Playcentre is a preschool coop which believes in<br/>\nchild - led learning (there&#39;s that phrase again) and I started going with my<br/>\noldest son when he was 2. Unfortunately, I was a slow learner, so poor Greg had<br/>\nto suffer a more structured preschool, and 7 weeks at school before I gave in to<br/>\nthe inevitable. (That was 13 years ago.)<br/>\n<br/>\nI have to admit that I&#39;m not always true to unschooling - I do panic every now<br/>\nand then and start pushing - but the kids are used to this and wait till I calm<br/>\ndown a bit and then tell me where to get off!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Just by virtue<br/>\n&gt; of the fact you have chosen to homeschool and unschool, you have dictated<br/>\n&gt; *to a certain extent* how your child will view and interact with the world.<br/>\n&gt; Parents make choices every day, even prenatal choices that affect the child.<br/>\n&gt; It can&#39;t be helped!  It&#39;s called the environment.  No one can escape it<br/>\n&gt; completely.  Give yourselves a break!<br/>\n<br/>\n </span></blockquote>You&#39;re so right. But rather than tell your kids what to learn, broaden their<br/>\nenvironment, expose them to the things you think they should learn, and if they<br/>\nare interested, they&#39;ll take it from there. If they aren&#39;t interested now,<br/>\nthey&#39;ll remember that exposure later when / if they actually do need it.<br/>\n<br/>\nCarol</div>","specialLinks":[]},{"userId":0,"authorName":"Brown","from":"Brown &lt;mjcmbrwn@...","replyTo":"LIST","senderId":"1-5YykLRIhBt40nLxNTSBF0l9uZBBrRbQBILJVJxxFc-XH-ULBXh06PB11MsJAMYPl7MueUiIrC_XFKl2yiHT_yo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929173659","msgId":983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43Ni45ODMuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":982,"nextInTopic":985,"prevInTime":982,"nextInTime":984,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"Linda What a shame we feel we have to define ourselves at all, other than living and being . I loved what you had to say. Carol","messageBody":"<div id=\"ygrps-yiv-1319695414\">Linda<br/>\n<br/>\nWhat a shame we feel we have to define ourselves at all, other than &#39;living and<br/>\nbeing&#39;. I loved what you had to say.<br/>\n<br/>\nCarol<br/>\n<br/>\nLinda Wyatt wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; From: Linda Wyatt &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hilinda@...\">hilinda@...</a>&gt;<br/>\n&gt;<br/>\n&gt; &gt; From: &quot;Dale & Karen Jones-Waddell&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katejw@...\">katejw@...</a>&gt;<br/>\n&gt;<br/>\n&gt; &gt;  I was doing the leading, she the following.<br/>\n&gt;<br/>\n&gt; This is only one mention of leading and following that led to some thoughts<br/>\n&gt; I&#39;ve been having today.<br/>\n&gt;<br/>\n&gt; I don&#39;t like the term &quot;child led learning&quot;.  I don&#39;t like &quot;natural<br/>\n&gt; learning&quot; either, for a different reason.<br/>\n&gt;<br/>\n&gt; Anyway.<br/>\n&gt;<br/>\n&gt; Around here, no one is leading, and no one is following, most of the time.<br/>\n&gt; We do what we do.  Sometimes we are all doing different things, sometimes<br/>\n&gt; we are doing the same things separately, sometimes together.<br/>\n&gt;<br/>\n&gt; It&#39;s not like the kids say they are interested in something, and I&#39;m<br/>\n&gt; following them around, listening for that comment or question, at which<br/>\n&gt; time I jump in with resources.  I think people sometimes get that<br/>\n&gt; impression of unschooling.<br/>\n&gt;<br/>\n&gt; Usually, it&#39;s more like this:<br/>\n&gt;<br/>\n&gt; My oldest has a computer across the room from where mine is.  Since we are<br/>\n&gt; both in there at the same time some of the time, we might talk while we<br/>\n&gt; work.  Or he might be talking to a sibling while he does something, and I<br/>\n&gt; can hear them.  Or he might come upstairs later and mention what he was<br/>\n&gt; doing, or suggest something he might like to do.<br/>\n&gt;<br/>\n&gt; Days later, maybe I&#39;ll be at a book store, and come across a book that<br/>\n&gt; reminds me of something he said.  I might get it, if it sounds interesting.<br/>\n&gt; Or maybe I won&#39;t get it, but I&#39;ll tell him later that I saw it, and see<br/>\n&gt; what he thinks.<br/>\n&gt;<br/>\n&gt; He might come across something online that he knows I&#39;m interested in and<br/>\n&gt; tell me.<br/>\n&gt;<br/>\n&gt; Recently, he looked at a webpage I coded, thought something was cool, and<br/>\n&gt; downloaded the sourcecode to use on his own page.  I was glad to see it,<br/>\n&gt; since he has been so much help to me when I&#39;ve needed to find code for<br/>\n&gt; something.<br/>\n&gt;<br/>\n&gt; Meanwhile, I&#39;ve read a dozen books to the youngest, who has decided she<br/>\n&gt; wants more books with the moon in them, so in the back of my head, that<br/>\n&gt; thought is there, and if I come across any moon books, I&#39;m likely to<br/>\n&gt; notice.  We&#39;ve been planning to go outside at the next full moon, and I may<br/>\n&gt; try to find that book- Walk When The Moon is Full and read that before we<br/>\n&gt; go, or maybe not.  We might get out the telescope, or not.  Maybe we&#39;ll<br/>\n&gt; sleep outside.<br/>\n&gt;<br/>\n&gt; The roses have just started blooming so we&#39;ll be taking pictures of them<br/>\n&gt; later for a friend who is interested in them- and that reminds me, we need<br/>\n&gt; to plant the flowers we want to grow for drying.  We also need to get the<br/>\n&gt; outdoor water fixed so we don&#39;t have to carry water to everything in this<br/>\n&gt; dry weather.<br/>\n&gt;<br/>\n&gt; And so it goes, our lives, from one thing to another, flowing without much<br/>\n&gt; effort.  My life, my kids&#39; lives, my husband&#39;s life.  Sometimes on our own,<br/>\n&gt; sometimes as a group.  No one is really leading, we&#39;re all meandering.<br/>\n&gt;<br/>\n&gt; Maybe I&#39;ll start using the phrase &quot;interest-flow learning&quot;.<br/>\n&gt;<br/>\n&gt; Linda<br/>\n&gt;<br/>\n&gt; --<br/>\n&gt; Linda Wyatt<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hilinda@...\">hilinda@...</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lightlink.com/hilinda\">http://www.lightlink.com/hilinda</a><br/>\n&gt; Learning everywhere, all the time.<br/>\n&gt; Algebra before breakfast<br/>\n&gt; &quot;A lie, you see, no matter how often or how vociferously repeated, may be<br/>\n&gt; mistaken for the truth, but it does not become the truth.&quot; - Adam Crown </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"FreeSchool@xxx.xxx","from":"FreeSchool@...","replyTo":"LIST","senderId":"uHK3ORrPs3xH4M3svtu16QojxChsKjbipKorA-qxTcRW6bIXpCxZOJoGG65OVrxBkSPxAXZvOw3G","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929173045","msgId":982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45ODIuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":979,"nextInTopic":983,"prevInTime":981,"nextInTime":983,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/99 11:53:23 PM Central Daylight Time, lhoover@erie.net writes: ","messageBody":"<div id=\"ygrps-yiv-1423012830\">In a message dated 6/11/99 11:53:23 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lhoover@...\">lhoover@...</a> writes:<br/>\n<br/>\n&lt;&lt;  He looked<br/>\n at us and said &quot;my ice falls whenever I get to a 30 degree angle with the<br/>\n bottle&quot;.  This from a child who to the best of my knowlege never learned<br/>\n anything about geometry. Guess you can play and learn.   &gt;&gt;<br/>\n<br/>\nLois,<br/>\n    These are the things I love hearing about.  I just hope that we can <br/>\nremember all the neat things our kids said, after they have grown up and <br/>\nmoved on.  Maybe we should start writing them in a journal!?  Anway, that was <br/>\nreally cool!<br/>\nTami</div>","specialLinks":[]},{"userId":0,"authorName":"Brown","from":"Brown &lt;mjcmbrwn@...","replyTo":"LIST","senderId":"G6hBIlfi8BcGu8JH461p90TgHoIMT20ua1FuJypaga9BthwUeuUqUn9qhrIfMbxeAVxUMBSDe87Cq9x5ZNDwc53P","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929171033","msgId":979,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NzkuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":975,"nextInTopic":982,"prevInTime":978,"nextInTime":980,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"Karen and all ... You re right - there is no general concensus on what unschooling is - my apologies. However, I do believe that there is pretty wide agreement","messageBody":"<div id=\"ygrps-yiv-1295148655\">Karen and all<br/>\n<br/>\n Karen wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am curious, where it is written what the &quot;general consensus&quot; on<br/>\n&gt; &quot;unschooling&quot; is?  And where is the list of right words, and wrong words to<br/>\n&gt; use regarding such?  This thread has led me to believe it is always in<br/>\n&gt; process and quite diverse--and that&#39;s just fine with me!<br/>\n<br/>\n </span></blockquote>You&#39;re right - there is no general concensus on what unschooling is - my<br/>\napologies. However, I do believe that there is pretty wide agreement on what it<br/>\nisn&#39;t. And that includes not using curriculum imposed by someone other than the<br/>\nlearner. But then again, maybe there are different interpretations of that word<br/>\n&#39;curriculum&#39; too! Someone else mentioned a difference between curriculum and<br/>\ntextbooks and I&#39;d agree with that. We use textbooks sometimes, but never in a<br/>\n&#39;start at the beginning and go on until the end, doing everything&#39; way.<br/>\n<br/>\nMy children and I have all, at times, attended classes when we wanted to learn<br/>\nsomething specific and a class seemed the best available way to achieve that end<br/>\n- and in those cases we accept the parameters of that situation. Usually.<br/>\nSometimes we drop out. In that case we tell the teacher why. The important thing<br/>\nis that as learners we retain free choice.<br/>\n<br/>\nCarol</div>","specialLinks":[]},{"userId":0,"authorName":"Dale & Karen Jones-Waddell","from":"&quot;Dale & Karen Jones-Waddell&quot; &lt;katejw@...","replyTo":"LIST","senderId":"lhKHpj_VY1akuegUNcQD6lMcWU67PrUtsGWtfA9joh-e4gtXpyzo91xmaxdPliM4MrhI5jhDP12mHe1OICsrXLt4NSDdF3n46RDwL8ToF7gGbWc0ZAI","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929167475","msgId":975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NzUuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":974,"nextInTopic":979,"prevInTime":974,"nextInTime":976,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"I never said everyone should know and learn linear algebra and calculus. I never said learning math cannot involve play and must be drudgery. I never said I","messageBody":"<div id=\"ygrps-yiv-1739733886\">I never said everyone should know and learn linear algebra and calculus.<br/>\nI never said learning math cannot involve play and must be drudgery.<br/>\nI never said I forced my child to learn a foreign language against her will.<br/>\nI never said you sit back and wait for your kids to ask you questions before<br/>\ndoing anything.....<br/>\n<br/>\nI was responding to a discussion that talked about the word &quot;teaching&quot;<br/>\nnegatively.<br/>\nMy husband&#39;s comment was in reference to needing some textbooks and teaching<br/>\nfor higher math--not that required to paint a house, but that required for<br/>\njobs such as engineering of all types.  NO, I was not saying cram it down<br/>\nevery kid&#39;s throat.  I WAS saying if a child wanted to do that, then<br/>\nwouldn&#39;t one have to be taught.  Do you really think unschooling is so hot,<br/>\nthat you can teach (oh excuse me, learn) engineering in 18 months, when it<br/>\ntakes 5 years in college.  You think those kids sit around and party all the<br/>\ntime?  You think their teachers have their heads in the wrong place?  I<br/>\ndon&#39;t think so.  I think it&#39;s just kind of difficult.  It just might not fit<br/>\ninto some of the pristine theories being so easily spouted around here. So<br/>\nit seems its okay to brag about being a real unschooler until they are old<br/>\nenough to choose engineering, then hey, they chose it, now they can go to<br/>\ncollege and teachers are good guys because the kid chose them.  Huh?<br/>\n<br/>\nBRAHAHAHAHA.  Argue on.  Scapegoat on.  Paint me in a box until I scream<br/>\n&quot;Uncle!&quot;  But your barking up the wrong tree.  I didn&#39;t join this list to<br/>\ntell you to give tests and teach in 30 minute time blocks and slap your kid<br/>\naround and tell them what to do, or better yet, just neglect them.  It&#39;s<br/>\namazing what gets misconstrued on these lists.<br/>\n<br/>\nI don&#39;t have time for it anymore.  I&#39;ve got to go teach my child.  Ya<br/>\nhahahahahahaha.<br/>\nKaren JW</div>","specialLinks":[]},{"userId":0,"authorName":"LammiesX6@xxx.xxx","from":"LammiesX6@...","replyTo":"LIST","senderId":"u14w0Y_dZVCrzNZMgZh0EnrEYxpc-1zH46gmTbMt5v2ieC-UdiuTdNNPzQWTTgHLqsFySRjhcmo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929167055","msgId":974,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NzQuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":970,"nextInTopic":975,"prevInTime":973,"nextInTime":975,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/99 4:15:50 PM PST, katejw@ionet.net writes: ","messageBody":"<div id=\"ygrps-yiv-1380862267\">In a message dated 6/11/99 4:15:50 PM PST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katejw@...\">katejw@...</a> writes:<br/>\n<br/>\n&lt;&lt; You obviously don&#39;t have fair skin (or red hair<br/>\n like Kate!! :).  Nor have you had peers develop melanoma.  The contents of<br/>\n bug juice are really not what I like to be slathering myself with, much less<br/>\n Kate, though I would if it appeared to me a worthwhile outdoor event (I<br/>\n suppose that would be my parental judgment, eh? not my unschooler choice).<br/>\n <br/>\n Karen<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>Ok - try Avon Skin SO SOft Sunscreen.  It is a bug repellant (Including Deer <br/>\nticks, which carry Lyme Disease) as well as a sunscreen.  Around here it is <br/>\nthe most recommended for our Search and Rescue Volunteers, who will be out <br/>\ntromping through the woods looking for lost hikers.  You DO have to apply it <br/>\nseveral times throughout the day, but no biggie...<br/>\n<br/>\nAs for the taking classes thing.  If the class is not FORCED on the child, if <br/>\nthe child (whatever age) decides to take a class to learn something - why <br/>\nnot?  For me, it is FORCED learning that is a real problem...  <br/>\n<br/>\nMary</div>","specialLinks":[]},{"userId":0,"authorName":"Lois Hoover","from":"Lois Hoover &lt;lhoover@...","replyTo":"LIST","senderId":"qYLVshHqAUJdVqmclLYTfbdED_8rQ1X2fI-ySTlmIvxlpqy2y3o4NK7I77YrUqqu1peIn_vrmoPTyIOmN8_yQw0_S2Mo","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929163226","msgId":970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NzAuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":968,"nextInTopic":974,"prevInTime":969,"nextInTime":971,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... Last comment, stolen from my husband s lips.  You can t teach linear algebra or Calculus from cooking.  You re going to need some semblance of a curriculum","messageBody":"<div id=\"ygrps-yiv-518729997\"><blockquote><span title=\"ireply\">&gt;Dale & Karen Jones-Waddell wrote:<br/>\n&gt;<br/>\n </span></blockquote> Last comment, stolen from my husband&#39;s lips.  You can&#39;t teach linear<br/>\nalgebra or Calculus from cooking.  You&#39;re going to need some semblance of a<br/>\ncurriculum for such things.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; <br/>\n </span></blockquote>Karen,<br/>\nI know the subject here was Algebra and Calculus. But had to share with you<br/>\nsomething my youngest just did. In the current heat wave, we&#39;ve resorted to<br/>\nfreezing water in 20 oz pop bottles. His had melted quite a bit, but had a<br/>\npretty good sized chunk still swimming in the bottle. He began playing with<br/>\nthe ice (driving us all nuts as we listened to the click click of the ice<br/>\nhitting the bottom, then the top of the botte. Finally, in desperation to<br/>\nquit hearing this we asked what he was doing (trying to avoid asking him to<br/>\ngive us a break as the heat brings out the worst in all of us).  He looked<br/>\nat us and said &quot;my ice falls whenever I get to a 30 degree angle with the<br/>\nbottle&quot;.  This from a child who to the best of my knowlege never learned<br/>\nanything about geometry. Guess you can play and learn.  <br/>\n<br/>\nAs for algebra, I mentioned that same son saw an algebra scale in a<br/>\ncatalog. He asked for it, and began to play with the pans. It didn&#39;t take<br/>\nlong before he had mastered the idea of the equations/negative numbers. I<br/>\nwouldn&#39;t dream of using a book with him as he gets really frustrated with<br/>\ntextbooks, but he really likes playing to figure things out, so while I<br/>\nlearned algebra at school the old fashioned way (books) I&#39;m going to learn<br/>\nby watching him to see how this can work without the books.<br/>\n<br/>\nLois<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"sandy keane","from":"sandy keane &lt;skeane@...","replyTo":"LIST","senderId":"fkTilpdXaQ7Lwoji0i5pddQ9P-nTEUkuX3-VkDKq8M9aPeArgmT1P9IgXwoqWBGurhLWOmcy17jLKR8KoQTHmu4VrIzz","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929161412","msgId":967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NjcuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":966,"nextInTopic":968,"prevInTime":966,"nextInTime":968,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... HA! Consensus on this one? BWAHAHAHAHA! Not yet.  I can t count how many unschooling, radical unschooling, unschooling circles, etc. etc. etc. .....lists","messageBody":"<div id=\"ygrps-yiv-1112206409\">Dale & Karen Jones-Waddell wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I am curious, where it is written what the &quot;general consensus&quot; on<br/>\n&gt; &quot;unschooling&quot; is?  And where is the list of right words, and wrong words to<br/>\n&gt; use regarding such?  This thread has led me to believe it is always in<br/>\n&gt; process and quite diverse--and that&#39;s just fine with me!<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>HA! Consensus on this one? BWAHAHAHAHA! Not yet.  I can&#39;t count<br/>\nhow many unschooling, radical unschooling, unschooling circles,<br/>\netc. etc. etc. .....lists I&#39;ve been on and without fail there is<br/>\nalways an exchange, ranging in temperature from somewhat heated<br/>\nto blazing flames over definitions and who can call themselves<br/>\nwhat and so on.  It seems to be part of the life-cycle on all the<br/>\nhomeschool lists, not just the unschooling ones.  I have my<br/>\ndefinition which works for me, and frankly, I couldn&#39;t care less<br/>\nabout anybody else&#39;s.  If a child is making her own learning<br/>\nexperience, I don&#39;t care if she uses curriculum or not, though I<br/>\nhave yet to meet an elementary age child who would choose<br/>\ncurriculum if given the choice.  I have however, met several <br/>\nunschooled from birth young people who, for reasons of their own,<br/>\nhave chosen to do all or parts of correspondence courses with<br/>\nassignments, grades and the whole ten yards.  I still consider<br/>\nthese folks unschoolers, as the decision about how, what, where<br/>\nand with whom to learn was entirely theirs, as is the decision to<br/>\nremain with this path or return to more intrinsic learning<br/>\nstyles.  <br/>\n<br/>\nAs the mother of two learned but untaught boys, I wonder<br/>\nsometimes if we haven&#39;t gone overboard with the autodidact<br/>\nideal.  My eldest, at fourteen, seems to have an attitude that if<br/>\nhe doesn&#39;t figure something out entirely on his own, it doesn&#39;t<br/>\ncount.  This is all very well, and certainly an effective way to<br/>\nlearn things in most cases, but it also means that he spends (I<br/>\nwanted to say &quot;wastes&quot; but I&#39;m sure there is something of value<br/>\nhere somewhere) inordinate amounts of time reinventing wheels, so<br/>\nto speak.  I keep mentioning that &quot;it&#39;s okay to look at the<br/>\nmanual, you know, I won&#39;t tell anybody - it&#39;s not cheating&quot; ....<br/>\nbut, well.<br/>\nI think it&#39;s important to know that asking someone who already<br/>\nknows what you want to learn is one of several possible effective<br/>\nmethods of aquiring skills or information.  I&#39;m sure he&#39;ll get<br/>\nthere eventually, but gosh, its hard to keep my mouth shut and<br/>\njust let him keep shooting himself in the foot.<br/>\n.   <br/>\n<blockquote><span title=\"ireply\"> &gt; Last comment, stolen from my husband&#39;s lips.  You can&#39;t teach linear algebra<br/>\n&gt; or Calculus from cooking.  You&#39;re going to need some semblance of a<br/>\n&gt; curriculum for such things.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Well, maybe not, but maybe you can learn a lot of algebraic<br/>\nconcepts by cooking, or playing with lego or constructing models<br/>\nto scale.... before you actually get down to the linear equation<br/>\nexpression of those concepts on paper.  If and when the child<br/>\ndecides that they need to know algebra they may find that they<br/>\nunderstand a good deal already.  They just haven&#39;t been calling<br/>\nit algebra.  I can&#39;t comment about calculus, having reached the<br/>\nage of 50 without ever having learned it or needed it for<br/>\nanything.<br/>\n<br/>\nDoes your husband believe that everyone needs to know algebra and<br/>\ncalculus, and if so, why?   I&#39;ve learned to ask myself these<br/>\nquestions whenever I go through my periods of worrying about what<br/>\nthe kids haven&#39;t hit on yet.  Sometimes I find that when I really<br/>\nthink about it, it&#39;s my schooling experience which is causing my<br/>\npanic -  Not my children&#39;s learning.<br/>\n <br/>\nSandy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:skeane@...\">skeane@...</a>&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://mypage.direct.ca/s/skeane/\">http://mypage.direct.ca/s/skeane/</a><br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~</div>","specialLinks":[]},{"userId":0,"authorName":"B & T Simpson","from":"&quot;B & T Simpson&quot; &lt;michigan@...","replyTo":"LIST","senderId":"MGqCxR8OjkK2qJbznZ-RAIpy_NlM8A7QJo9y5aUUNLlT5Q0L_4CsossnK3aZ7JbMB9NHOOkEUQhdpOtlwGK4KK6enUvNhhUCxlLGBw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929159748","msgId":966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NjYuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":964,"nextInTopic":967,"prevInTime":965,"nextInTime":967,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... children ... many ... because ... numbers ... lots ... Well said Teresa, I feel the same way, and my daughter was just pulled from ps in Feb, thus far she","messageBody":"<div id=\"ygrps-yiv-1764152368\"><blockquote><span title=\"ireply\">&gt;This is such a common response when someone new asks about how their<br/>\n </span></blockquote>children<br/>\n<blockquote><span title=\"ireply\"> &gt;will learn about higher math.  First of all I don&#39;t think there are that<br/>\n </span></blockquote>many<br/>\n<blockquote><span title=\"ireply\"> &gt;of us out there who don&#39;t have a math phobia.  Therefore there are a LOT of<br/>\n&gt;us out there who are clueless, and when we ask, we get almost condescending<br/>\n&gt;answers and generalities.  Blaming the parent for what they can&#39;t do<br/>\n </span></blockquote>because<br/>\n<blockquote><span title=\"ireply\"> &gt;they don&#39;t know how. No one gives specific examples, just &quot;play with<br/>\n </span></blockquote>numbers&quot;<br/>\n<blockquote><span title=\"ireply\"> &gt;how does that help? I never played with numbers so don&#39;t understand.  &quot;<br/>\n </span></blockquote>lots<br/>\n<blockquote><span title=\"ireply\"> &gt;of music stuff,&quot; my kids play three instruments, how does this help with<br/>\n&gt;higher math?  I am not being contrary, I am SERIOUS here.  I want to let my<br/>\n&gt;children have a happy learning experience, and if I am the culprit of them<br/>\n&gt;not having that, then I want to do something about it.  We do not all have<br/>\n&gt;the benefit of &quot;always being unschoolers, so it is a lifestyle.  Some of us<br/>\n&gt;are not happy with the way we started out and want to change, but we need<br/>\n&gt;help.<br/>\n&gt;Teresa&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Well said Teresa, I feel the same way, and my daughter was just pulled from<br/>\nps in Feb, thus far she loves Algebra (what they have started anyway) I do<br/>\nwant to encourage her<br/>\nbut the only way I know how to do this is by providing her with workbooks<br/>\nand textbooks to figure out on her own, as I just have no clue where to<br/>\nbegin to assist her if she had a question!<br/>\nTanya Ohio<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;Having difficulty getting &quot;in synch&quot; with list members?<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com\">http://www.onelist.com</a><br/>\n&gt;Try ONElist&#39;s Shared Calendar to organize events, meetings and more!<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;Check it out!<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Karen","from":"Karen &lt;careermom@...","replyTo":"LIST","senderId":"D7TfRmpTVOlpPNFE2kR69KYWhNMq7T73hysldP9PHCSUKczeWnZzig0T1SffLgSknB0VgXQngP4UsrxZEmmjOlM59aM-WkA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929156399","msgId":964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NjQuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":963,"nextInTopic":966,"prevInTime":963,"nextInTime":965,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... Thanks, Teresa... I am glad to hear someone else voice this. I somehow got the impression that I was bad at math while in public school (by comparing my","messageBody":"<div id=\"ygrps-yiv-858847635\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Hsmotgo@...\">Hsmotgo@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This is such a common response when someone new asks about how their children<br/>\n&gt; will learn about higher math.  First of all I don&#39;t think there are that many<br/>\n&gt; of us out there who don&#39;t have a math phobia.  Therefore there are a LOT of us<br/>\n&gt; out there who are clueless, and when we ask, we get almost condescending<br/>\n&gt; answers and generalities.  Blaming the parent for what they can&#39;t do because<br/>\n&gt; they don&#39;t know how. No one gives specific examples, just &quot;play with numbers&quot;<br/>\n&gt; how does that help? I never played with numbers so don&#39;t understand.<br/>\n<br/>\n </span></blockquote>Thanks, Teresa... I am glad to hear someone else voice this. I somehow got the<br/>\nimpression that I was &quot;bad&quot; at math while in public school (by comparing my math<br/>\nscores on standardized test to everything else... math was always in the 75-85th<br/>\npercentile and everything else 95-99th %tile).  Even though I know now it isn&#39;t<br/>\ntrue, it is hard for me to attempt higher math!  The 2 algebra courses I had to<br/>\ntake in college in order to meet the math requirement for graduation were pure<br/>\ntorture for me.  I don&#39;t want this for my children!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  We do not all have<br/>\n&gt; the benefit of &quot;always being unschoolers, so it is a lifestyle.  Some of us<br/>\n&gt; are not happy with the way we started out and want to change, but we need<br/>\n&gt; help.<br/>\n<br/>\n </span></blockquote>Yes, yes, yes...  I am reading &quot;The Unschooling Handbook&quot; right now and it makes<br/>\nme want to just ditch the small amount of structure we have right now.  But it is<br/>\na frightening step for me...<br/>\n<br/>\nI&#39;m afraid I have done something rather rude and replied to a thread before<br/>\nintroducing myself, so I&#39;d best do it now.  I am Karen, full-time mom to 3<br/>\nwonderful kids: Emily, 7 1/2; Noah, 3 1/2, and Halle, 8 months.  My husband is an<br/>\nAir Force nurse anesthesia resident and we are in Dayton, OH.  I just joined the<br/>\nlist yesterday and have been trying to get a feel for it.  As I mentioned above,<br/>\nI am feeling torn between unschooling and relaxed homeschooling w/ some<br/>\nstructure.   Sometimes I think that unschooling looks easy on the outside, but is<br/>\nreally more work than traditional homeschooling, and wonder if I have the energy<br/>\nto do it!<br/>\n<br/>\nI&#39;m looking forward to learning from all of you..<br/>\n<br/>\nKaren<br/>\n<br/>\nMama to Emily (12/30/91), Noah (12/30/95), and Halle (10/12/98)<br/>\nLife partner to Brian since 1986<br/>\nWright-Patterson AFB, OH (Dayton)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/heartland/2358\">http://www.geocities.com/heartland/2358</a><br/>\n****** mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:careermom@...\">careermom@...</a> ******</div>","specialLinks":[]},{"userId":0,"authorName":"Hsmotgo@xxx.xxx","from":"Hsmotgo@...","replyTo":"LIST","senderId":"5Vmwh2tnp7T_26VGHSzo4MJtieCGUGxusQJkiB7g1bLC-bPmzjnnTcvFqAG3kulPLlpSNqQt","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929153583","msgId":963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NjMuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":962,"nextInTopic":964,"prevInTime":962,"nextInTime":964,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/99 7:03:37 PM EST, hilinda@lightlink.com writes: ","messageBody":"<div id=\"ygrps-yiv-949471291\">In a message dated 6/11/99 7:03:37 PM EST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hilinda@...\">hilinda@...</a> writes:<br/>\n<br/>\n&lt;&lt; Maybe I&#39;ll start using the phrase &quot;interest-flow learning&quot;. &gt;&gt;<br/>\nLinda,<br/>\nThat is a very interesting term!  really conveys a lot!<br/>\nTeresa</div>","specialLinks":[]},{"userId":0,"authorName":"Lois Hoover","from":"Lois Hoover &lt;lhoover@...","replyTo":"LIST","senderId":"u5Tt-3hfaGp0TNcH9MCKW-X1TtINZYYciFyT2DFs5spTg5yqgYtQ8FlFcb1uk_hV7LwDgdu3-nh0nC3l7zBSc9cPALfk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929153394","msgId":968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NjguOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":967,"nextInTopic":970,"prevInTime":967,"nextInTime":969,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... My sons also learned sign language from me. But it was their choice. Actually how it came about was that a woman approached me who was deaf in a store. I","messageBody":"<div id=\"ygrps-yiv-1785497750\"><blockquote><span title=\"ireply\">&gt;From: &quot;Dale & Karen Jones-Waddell&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katejw@...\">katejw@...</a>&gt;<br/>\n&gt;<br/>\n&gt;Okay gang,<br/>\n&gt;<br/>\n&gt;I totally agree with modeling, and I think surrounding your child with<br/>\n&gt;people who speak foreign language, and inviting them to learn with you is<br/>\n&gt;great.  In fact, we have done so with learning sign language with our 33<br/>\n&gt;month old. <br/>\n<br/>\n </span></blockquote>My sons also learned sign language from me. But it was their choice.<br/>\nActually how it came about was that a woman approached me who was deaf in a<br/>\nstore. I was able to communicate with her because I learned it (I believe<br/>\nstrongly that we should be able to communicate with all who live around us<br/>\nsince some could be deaf I learned signing). My children felt that they<br/>\nwanted to learn it also so we learned a little at a time as they asked for<br/>\ncertain words or phrases.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;Regarding linear algebra and calculus....my husband is a mathmetician as<br/>\n&gt;well and I&#39;ll let him respond.  He wasn&#39;t sure if a textbook would be viewed<br/>\n&gt;as &quot;CURRICULUM&quot;!  My question, is I didn&#39;t realize college was okay for some<br/>\n&gt;of you, as I misconstrued that you would be &quot;taught&quot; in such a class.  I<br/>\n&gt;didn&#39;t realize unschooling stopped post highschool age.  I thought it went<br/>\n&gt;on FOREVER.<br/>\n&gt;<br/>\n </span></blockquote>for some it does. But depending on what the child/now adult chooses for<br/>\ntheir profession sometimes you need to attend college or some school to get<br/>\nthat piece of paper and be taken seriously in the job market. My oldest son<br/>\nwelds and is very good. He&#39;s now 14, but needing to be certified he will<br/>\nhave to attend a trade school before he can work in the field. My youngest<br/>\nwould like to work on computers. He already can build a computer from<br/>\nscratch and has boxes of hardware parts filling his room.  He may not have<br/>\nto attend a college, but then again he may. It will be his choice. For now,<br/>\nboth boys prefer to unschool and at least my oldest is dismayed looking<br/>\nforward to having to attend the tech school.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Several of you distinguished &quot;parenting&quot; issues, from &quot;schooling&quot; issues.<br/>\n&gt;Another argument of semantics.  I thought unschooling permeated all aspects<br/>\n&gt;of life, hence the reason I used those examples. <br/>\n<br/>\n </span></blockquote>Unschooling to me is how we learn, but I do personally separate parenting<br/>\nfrom learning.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  The contents of<br/>\n&gt;bug juice are really not what I like to be slathering myself with, much less<br/>\n&gt;Kate, though I would if it appeared to me a worthwhile outdoor event (I<br/>\n&gt;suppose that would be my parental judgment, eh? not my unschooler choice).<br/>\n&gt;<br/>\n </span></blockquote>I agree with you on most of the bug items out there, but we do use Avon&#39;s<br/>\nskin so soft for mosquitos and if we are going to be in wooded areas we use<br/>\nthe Skin so soft for sunblock, ticks, and mosquitos. It does work pretty well.<br/>\n<br/>\nLois</div>","specialLinks":[]},{"userId":0,"authorName":"LammiesX6@xxx.xxx","from":"LammiesX6@...","replyTo":"LIST","senderId":"jm0KeB3iTJ1rSRRu2UC_TTP5zaiakk0T0A1ms1OFOhFErF470WSDOqDb8L1-E4srmbQDzWIR908","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929153314","msgId":962,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NjIuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":960,"nextInTopic":963,"prevInTime":961,"nextInTime":963,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/99 1:37:04 PM PST, SandraDodd@AOL.COM writes: ","messageBody":"<div id=\"ygrps-yiv-1140637996\">In a message dated 6/11/99 1:37:04 PM PST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\n &lt;&lt; This has been an interesting discussion.  I have a 33 month old and am new<br/>\n to homeschooling, and we&#39;ve been subscribed to this unschooling list for<br/>\n several months.  This is the first thread I have followed.&gt;&gt;<br/>\n <br/>\n I thought this list was new just a couple of weeks ago.<br/>\n Are you confusing it with another unschooling list or was I just not invited <br/>\n to be a charter member!?  :-0<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n </span></blockquote>It is correct that this list is pretty new.  Charter member?  Well - I should <br/>\nhave given you a &quot;heads up&quot; I guess - but I kept HOPING you would find us <br/>\n&lt;g&gt;.  I think I figured you were here.... somewhere....  <br/>\n<br/>\nSure glad you joined us!!!<br/>\n<br/>\nMary</div>","specialLinks":[]},{"userId":0,"authorName":"Hsmotgo@xxx.xxx","from":"Hsmotgo@...","replyTo":"LIST","senderId":"CYdMJ09yFC2vsVhcwVlYS9Gdk_vx6z3icx1EcibiUEDisua8NY6Xi2YiM9hjtqfsTW_Hs8od","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929152952","msgId":960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NjAuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":958,"nextInTopic":962,"prevInTime":959,"nextInTime":961,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/99 3:34:12 PM EST, hilinda@lightlink.com writes: ","messageBody":"<div id=\"ygrps-yiv-2081232696\">In a message dated 6/11/99 3:34:12 PM EST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hilinda@...\">hilinda@...</a> writes:<br/>\n<br/>\n&lt;&lt; A curriculum might be helpful for folks who don&#39;t have a clue where to<br/>\n start playing, if they&#39;ve had that playing with numbers instinct removed<br/>\n somehow.  But people without math phobias will naturally play around with<br/>\n stuff enough to find it very cool and interesting and fascinating (unless,<br/>\n of course, they simply aren&#39;t inclined that way, in which case, they aren&#39;t<br/>\n likely to end up needing to know anyway).  We do huge amounts of thinking<br/>\n and talking and playing and exploring around here that involve things that<br/>\n could be called algebra or calculus, but we have no need to call them that,<br/>\n or call them anything, or categorize them, we just use them.  Lots of<br/>\n physics stuff and music stuff and art stuff.  Cooking is often mentioned as<br/>\n a way to play with math, but it is by far not the only one. &gt;&gt;<br/>\nLinda,<br/>\nThis is such a common response when someone new asks about how their children <br/>\nwill learn about higher math.  First of all I don&#39;t think there are that many <br/>\nof us out there who don&#39;t have a math phobia.  Therefore there are a LOT of <br/>\nus out there who are clueless, and when we ask, we get almost condescending <br/>\nanswers and generalities.  Blaming the parent for what they can&#39;t do because <br/>\nthey don&#39;t know how. No one gives specific examples, just &quot;play with numbers&quot; <br/>\nhow does that help? I never played with numbers so don&#39;t understand.  &quot; lots <br/>\nof music stuff,&quot; my kids play three instruments, how does this help with <br/>\nhigher math?  I am not being contrary, I am SERIOUS here.  I want to let my <br/>\nchildren have a happy learning experience, and if I am the culprit of them <br/>\nnot having that, then I want to do something about it.  We do not all have <br/>\nthe benefit of &quot;always being unschoolers, so it is a lifestyle.  Some of us <br/>\nare not happy with the way we started out and want to change, but we need <br/>\nhelp.<br/>\nTeresa</div>","specialLinks":[]},{"userId":0,"authorName":"LammiesX6@aol.com","from":"LammiesX6@...","replyTo":"LIST","senderId":"mcwkJ5gxx41atEii-Rqj_p5Y6g7Y92JdUnWWTFImQabxV0X7dvTsEkpzmPmuUPP5Pm2gEx4-sEc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929152297","msgId":958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NS45NTguOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":957,"nextInTopic":960,"prevInTime":957,"nextInTime":959,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/99 11:52:56 AM PST, katejw@ionet.net writes: ","messageBody":"<div id=\"ygrps-yiv-238319657\">In a message dated 6/11/99 11:52:56 AM PST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katejw@...\">katejw@...</a> writes:<br/>\n<br/>\n&lt;&lt; <br/>\n I am curious, where it is written what the &quot;general consensus&quot; on<br/>\n &quot;unschooling&quot; is?  And where is the list of right words, and wrong words to<br/>\n use regarding such?  This thread has led me to believe it is always in<br/>\n process and quite diverse--and that&#39;s just fine with me!<br/>\n <br/>\n Last comment, stolen from my husband&#39;s lips.  You can&#39;t teach linear algebra<br/>\n or Calculus from cooking.  You&#39;re going to need some semblance of a<br/>\n curriculum for such things.<br/>\n <br/>\n Cheers,<br/>\n Kare &gt;&gt;<br/>\n<br/>\nFirst - Child-led learning does NOT mean that you sit around staring at your <br/>\nkids waiting for them to ask about something.  It doesn&#39;t.  Child led <br/>\nlearning means that you KNOW your children, you understand how their brains <br/>\nwork, how they learn best and you facilitate their interests in ways that <br/>\nwill help them figure things out.  SO - If I want to learn Spanish (which I <br/>\ndo, and I am) I find a way that I like - I share the language I am learning <br/>\nwith whoever is interested.  At this time, 4 of my dd&#39;s are interested.  We <br/>\ndecided to find someone who could help us learn.  For US this has been the <br/>\nbest method.  My ds didn&#39;t WANT to learn SPanish - he wants German.  He is <br/>\nway into WWII stuff and has become fascinated with the language.  A teacher <br/>\nfor him is NOT the best way to learn.  We have purchased tapes and books and <br/>\nother things for him to learn the language.  Occasionally he gets an <br/>\nopportunity to speak with his Uncle, who learned in school.  These are BOTH <br/>\nchild-led things.  The first happened because I became interested and shared <br/>\nmy interest with the kids...some chose to follow/participate, some didn&#39;t.<br/>\n<br/>\nAs far as Algebra and Higher Math... We use these in real life... so what if <br/>\nwe don&#39;t know the theorems (sp?) and &quot;rules&quot;?  When trying to figure out how <br/>\nmuch paint we need to cover a 2000 sf house, we use algebra.  When trying to <br/>\ndecide how big a tarp we need to cover our cords of wood, we use algebra...  <br/>\nThe kids naturally participate in the measuring and multiplying and such... <br/>\nthey are learning the principles.  If they ever NEED to know the theorems <br/>\n(why does that look wrong???) they know how to find information on that too.  <br/>\nThere is &quot;higher math&quot; in every day life - most people just don&#39;t recognize <br/>\nit as such.<br/>\n<br/>\nMary</div>","specialLinks":[]},{"userId":0,"authorName":"Cindy Ferguson","from":"Cindy Ferguson &lt;crma@...","replyTo":"LIST","senderId":"RREc5eQUpH2sS157UPSZ69TxSLvbwsK_HvKdgfcfGWRRsey60GyHEywbOubl-IMyC7A-XHMlL7sNf8WVdQkn-c1G_Nvbp-LxZv4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929147138","msgId":957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NC45NTcuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":956,"nextInTopic":958,"prevInTime":956,"nextInTime":958,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... I m a mathematician too.  I view textbooks as resources.  If a person (adult or child) wants to learn about a subject using a textbook, that s cool!  I","messageBody":"<div id=\"ygrps-yiv-550633221\">Dale & Karen Jones-Waddell wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Regarding linear algebra and calculus....my husband is a mathmetician as<br/>\n&gt; well and I&#39;ll let him respond.  He wasn&#39;t sure if a textbook would be viewed<br/>\n&gt; as &quot;CURRICULUM&quot;!  My question, is I didn&#39;t realize college was okay for some<br/>\n&gt; of you, as I misconstrued that you would be &quot;taught&quot; in such a class.  I<br/>\n&gt; didn&#39;t realize unschooling stopped post highschool age.  I thought it went<br/>\n&gt; on FOREVER.<br/>\n&gt; <br/>\n </span></blockquote>I&#39;m a mathematician too.  I view textbooks as resources.  If a person<br/>\n(adult or child) wants to learn about a subject using a textbook,<br/>\nthat&#39;s cool!  I have my old History of England text around and I<br/>\nlook up things in that occasionally.  I also have most of my math, <br/>\nphysics, and computer science books around for reference too.<br/>\n<br/>\nI don&#39;t think that taking classes someplace is anathema to unschooling.<br/>\nIt&#39;s the motivation for the person taking the class that matters.<br/>\nIf I coerce another person into taking a class, I&#39;m not unschooling!<br/>\n<br/>\nI see what I personally am doing now as a combination of unschooling<br/>\nand deschooling.  I am unschooling myself in that I am learning new<br/>\nthings.  I am deschooling in that I am attempting to frame learning/<br/>\neducation/teaching in new terms.<br/>\n<br/>\nI also believe that unschooling continues thru life, even if one<br/>\nattends college and graduates.<br/>\n<br/>\n-- <br/>\n<br/>\nCindy Ferguson<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crma@...\">crma@...</a></div>","specialLinks":[]},{"userId":0,"authorName":"Dale & Karen Jones-Waddell","from":"&quot;Dale & Karen Jones-Waddell&quot; &lt;katejw@...","replyTo":"LIST","senderId":"trcB6dBZDE__vQ4wqY7H2jqmKswE8l4ERAaiqXJ2f37NqGc3mNbeOPumSAViKz6oerUUVfY3MVg4Q0nJHGuR5tK4yDIRQsG0lKiA2OJiRQ9F7Y06pfc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929146702","msgId":956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NC45NTYuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":955,"nextInTopic":957,"prevInTime":955,"nextInTime":957,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"Okay gang, You caught me on the newness of the list!  I had forgotten we got it from a link from another homeschool list and that it was  a NEW list!  I guess","messageBody":"<div id=\"ygrps-yiv-100670178\">Okay gang,<br/>\n<br/>\nYou caught me on the newness of the list!  I had forgotten we got it from a<br/>\nlink from another homeschool list and that it was  a NEW list!  I guess the<br/>\nsheer volume of posts led me to believe it had been around for a while &lt;g&gt;,<br/>\nor perhaps it was several people mentioning something to the effect that it<br/>\nused to be so fun and friendly before this came along.  Used to be?  I<br/>\nthought that suggested &gt; 2 weeks.  My mistake.<br/>\n<br/>\nI totally agree with modeling, and I think surrounding your child with<br/>\npeople who speak foreign language, and inviting them to learn with you is<br/>\ngreat.  In fact, we have done so with learning sign language with our 33<br/>\nmonth old.  I used this as an example, because I thought some members would<br/>\nview this as &quot;TEACHING&quot;.  I&#39;m seeing this is quite a debate of semantics<br/>\nmore than anything else.  Also, I said the best time is PRIOR to 6 years<br/>\nold, like 2 to 6.<br/>\n<br/>\nRegarding linear algebra and calculus....my husband is a mathmetician as<br/>\nwell and I&#39;ll let him respond.  He wasn&#39;t sure if a textbook would be viewed<br/>\nas &quot;CURRICULUM&quot;!  My question, is I didn&#39;t realize college was okay for some<br/>\nof you, as I misconstrued that you would be &quot;taught&quot; in such a class.  I<br/>\ndidn&#39;t realize unschooling stopped post highschool age.  I thought it went<br/>\non FOREVER.<br/>\n<br/>\nSeveral of you distinguished &quot;parenting&quot; issues, from &quot;schooling&quot; issues.<br/>\nAnother argument of semantics.  I thought unschooling permeated all aspects<br/>\nof life, hence the reason I used those examples.  And BTW, I do attempt to<br/>\nexplain to Kate about mosquitoes and getting sunburned, but alas, sometimes<br/>\nthe fun she is having is more understandable.  And whoever said why don&#39;t<br/>\nyou use sunscreen and bug juice.....sunscreen works for a certain amount of<br/>\ntime (even sunblock 45).  You obviously don&#39;t have fair skin (or red hair<br/>\nlike Kate!! :).  Nor have you had peers develop melanoma.  The contents of<br/>\nbug juice are really not what I like to be slathering myself with, much less<br/>\nKate, though I would if it appeared to me a worthwhile outdoor event (I<br/>\nsuppose that would be my parental judgment, eh? not my unschooler choice).<br/>\n<br/>\nKaren</div>","specialLinks":[]},{"userId":0,"authorName":"Linda Wyatt","from":"Linda Wyatt &lt;hilinda@...","replyTo":"LIST","senderId":"7UEd_VbHnsypbjuyWTHcTc_-Y1M-IDhwGxTJeuld-lnUDx29uFnhQ2Sb3zO6thbtxSSuqBf6q3hZiDsJMqVn7ziMOis6FStKvR8","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929145541","msgId":955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NC45NTUuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":953,"nextInTopic":956,"prevInTime":954,"nextInTime":956,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... This is only one mention of leading and following that led to some thoughts I ve been having today. I don t like the term child led learning .  I don t","messageBody":"<div id=\"ygrps-yiv-142378008\"><blockquote><span title=\"ireply\">&gt; From: &quot;Dale & Karen Jones-Waddell&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katejw@...\">katejw@...</a>&gt;<br/>\n<br/>\n<br/>\n&gt;  I was doing the leading, she the following.<br/>\n<br/>\n </span></blockquote>This is only one mention of leading and following that led to some thoughts<br/>\nI&#39;ve been having today.<br/>\n<br/>\nI don&#39;t like the term &quot;child led learning&quot;.  I don&#39;t like &quot;natural<br/>\nlearning&quot; either, for a different reason.<br/>\n<br/>\nAnyway.<br/>\n<br/>\nAround here, no one is leading, and no one is following, most of the time.<br/>\nWe do what we do.  Sometimes we are all doing different things, sometimes<br/>\nwe are doing the same things separately, sometimes together.<br/>\n<br/>\nIt&#39;s not like the kids say they are interested in something, and I&#39;m<br/>\nfollowing them around, listening for that comment or question, at which<br/>\ntime I jump in with resources.  I think people sometimes get that<br/>\nimpression of unschooling.<br/>\n<br/>\nUsually, it&#39;s more like this:<br/>\n<br/>\nMy oldest has a computer across the room from where mine is.  Since we are<br/>\nboth in there at the same time some of the time, we might talk while we<br/>\nwork.  Or he might be talking to a sibling while he does something, and I<br/>\ncan hear them.  Or he might come upstairs later and mention what he was<br/>\ndoing, or suggest something he might like to do.<br/>\n<br/>\nDays later, maybe I&#39;ll be at a book store, and come across a book that<br/>\nreminds me of something he said.  I might get it, if it sounds interesting.<br/>\nOr maybe I won&#39;t get it, but I&#39;ll tell him later that I saw it, and see<br/>\nwhat he thinks.<br/>\n<br/>\nHe might come across something online that he knows I&#39;m interested in and<br/>\ntell me.<br/>\n<br/>\nRecently, he looked at a webpage I coded, thought something was cool, and<br/>\ndownloaded the sourcecode to use on his own page.  I was glad to see it,<br/>\nsince he has been so much help to me when I&#39;ve needed to find code for<br/>\nsomething.<br/>\n<br/>\nMeanwhile, I&#39;ve read a dozen books to the youngest, who has decided she<br/>\nwants more books with the moon in them, so in the back of my head, that<br/>\nthought is there, and if I come across any moon books, I&#39;m likely to<br/>\nnotice.  We&#39;ve been planning to go outside at the next full moon, and I may<br/>\ntry to find that book- Walk When The Moon is Full and read that before we<br/>\ngo, or maybe not.  We might get out the telescope, or not.  Maybe we&#39;ll<br/>\nsleep outside.<br/>\n<br/>\nThe roses have just started blooming so we&#39;ll be taking pictures of them<br/>\nlater for a friend who is interested in them- and that reminds me, we need<br/>\nto plant the flowers we want to grow for drying.  We also need to get the<br/>\noutdoor water fixed so we don&#39;t have to carry water to everything in this<br/>\ndry weather.<br/>\n<br/>\n<br/>\nAnd so it goes, our lives, from one thing to another, flowing without much<br/>\neffort.  My life, my kids&#39; lives, my husband&#39;s life.  Sometimes on our own,<br/>\nsometimes as a group.  No one is really leading, we&#39;re all meandering.<br/>\n<br/>\nMaybe I&#39;ll start using the phrase &quot;interest-flow learning&quot;.<br/>\n<br/>\nLinda<br/>\n<br/>\n--<br/>\nLinda Wyatt<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hilinda@...\">hilinda@...</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lightlink.com/hilinda\">http://www.lightlink.com/hilinda</a><br/>\nLearning everywhere, all the time.<br/>\nAlgebra before breakfast<br/>\n&quot;A lie, you see, no matter how often or how vociferously repeated, may be<br/>\nmistaken for the truth, but it does not become the truth.&quot; - Adam Crown</div>","specialLinks":[]},{"userId":0,"authorName":"Evalsquid@xxx.xxx","from":"Evalsquid@...","replyTo":"LIST","senderId":"oKXpb-NZwGr11Yx5VaOOrCKImqKSOiuq7HlLj3TPtPrHxVNcHtxJ44ZRttCfFU9dxZFuerGxKfs","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929142687","msgId":953,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NC45NTMuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":952,"nextInTopic":955,"prevInTime":952,"nextInTime":954,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"Ok, I said I d mostly be lurking for awhile, but this posting caught my eye. I freely admit that my responses are based only on what I ve read, seen other ","messageBody":"<div id=\"ygrps-yiv-1100763871\">Ok, I said I&#39;d mostly be lurking for awhile, but this posting caught my eye.  <br/>\nI freely admit that my responses are based only on what I&#39;ve read, seen other <br/>\nparents do, and my experiences with my 3-year-old neice.  (Unless you also <br/>\nwant to count my dog and horse experience. I&#39;ll leave that up to you.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;m referring to the comments about zilcho curriculum,  no teaching allowed,<br/>\n&gt;exclusive child led learning, etc. <br/>\n<br/>\n </span></blockquote>Maybe some do, but I&#39;ve never viewed unschooling as a no teaching allowed <br/>\nthing.  Maybe a no forced teaching allowed.  Or perhaps some prefer the <br/>\nterminology of setting up a learning enviroment rather than teaching.   Also, <br/>\nbe careful not to confuse child led learning with child led living.  As far <br/>\nas I&#39;m concerned, unschooling is not about giving into a child&#39;s every desire <br/>\nor centering the parents&#39; entire lives around the child.  It is about <br/>\nremembering that a child is a person (just like an adult is) and deserves the <br/>\nrespect and consideration that adults are accorded.  I don&#39;t want anyone <br/>\nsaying to me, &quot;OK, every day from 8:00 til 9:00 you&#39;re going to work in this <br/>\nmath book, then I&#39;ll drill you on some vocabulary, etc.&quot;  So I don&#39;t want to <br/>\ndo that to my children either.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;1) Foreign languages are most easily learned and absorbed when we are quite<br/>\n </span></blockquote>young (under 6 years).  If I waited for my child to ask me about that, well,<br/>\nshe really doesn&#39;t have enough information to think of that question, not to<br/>\nmention difficulty just formulating a sentence.  I think she would have<br/>\nmissed out on that opportunity.&lt;&lt;<br/>\n<br/>\nSomething that unschooling most definitely does seem to be, to me, is the <br/>\nopportunity to discover things about the world.  Rather than being locked in <br/>\na building for half the day with very limited options, I hope for my children <br/>\nto have a lot of exposure to the world and people around them.  If I had <br/>\nchildren now, they would have adults in their lives who speak Spanish, <br/>\nFrench, and German.  We rent Italian and Swedish movies frequently.  I know a <br/>\ndabbling of Welsh.  By the time I have children I may know even more <br/>\nbilingual people.  Even if I don&#39;t actually know someone in an area of <br/>\ninterest, I would still try to expose my child to it in some way.  <br/>\nUnschooling is not about cloistering or about waiting for the child to come <br/>\nup with ideas.  It&#39;s about showing the world to your child and seeing what <br/>\ns/he wants to do with it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;2)  My daughter wanted to stay and play in one of the toy cabinets today<br/>\n </span></blockquote>when I had a need to get the dog to the veterinarian for her shots.  I was<br/>\npulling her away from her cabinet and her desires to learn and play at that<br/>\ninstant.  I was doing the leading, she the following.<br/>\n<br/>\n3)  Occasionally my daughter wants to keep doing what she&#39;s doing, when<br/>\nwe&#39;re outside say, in the sunshine, or in the mosquito prime time.  Should I<br/>\nfollow her lead and let her get sunburned or eaten alive by mosquitoes, or<br/>\ndeal with her crying and dissapointment because I have deemed it is in her<br/>\nbest interest.&lt;&lt;<br/>\n<br/>\n In the first case, your child needed to give up something she wanted because <br/>\nsomeone else (in this case either you or the dog or both depending on how you <br/>\nwant to look at it) needed something more important.  This is something <br/>\neveryone has to do.  In the second it&#39;s a question of health or at least <br/>\ncomfort.  However, I would assert that saying, &quot;I need you to help me take <br/>\nthe dog to the vet&quot; or &quot;The sun is very hot now and we&#39;ll get burned.&quot; is <br/>\ndifferent than saying &quot;Stop playing, I need to go now or I&#39;ll be late&quot; or &quot;We <br/>\nhave to leave now.&quot;  I think it really does help to explain, to include the <br/>\nchild in the discussion.  I think it&#39;s even more effective (in my experience) <br/>\nif the child is actually active and helping in some way (as in the first <br/>\nexample). My neice is very strong-headed (some people would say &quot;willful&quot;) <br/>\nbut when I explain what I need her to do she&#39;s fine.  I don&#39;t for a minute <br/>\nclaim that this will work all the time or equally well with all children, but <br/>\nI think it&#39;s an attitude.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Just by virtue<br/>\n </span></blockquote>of the fact you have chosen to homeschool and unschool, you have dictated<br/>\n*to a certain extent* how your child will view and interact with the world.<br/>\nParents make choices every day, even prenatal choices that affect the child.<br/>\nIt can&#39;t be helped!  It&#39;s called the environment. &lt;<br/>\n<br/>\nOf course.  Though, as I said in my first post, how I will approach my <br/>\nunschooling/homeschooling will depend on the personalities of my children.  <br/>\nIf it really seemed better for one of my children, I would even consider a <br/>\nprivate school.  I have no desire to somehow eliminate &quot;environment&quot; for my <br/>\nchildren or even to subdue my own personality.  I just want to provide the <br/>\nbest environment possible for them.  And, IMHO, that means giving them a <br/>\nplace where they feel safe to learn, question, create, explore, and be <br/>\nwhoever it is that they will be.  It&#39;s also a place where they feel like <br/>\nthey&#39;re making a contribution.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Last comment, stolen from my husband&#39;s lips.  You can&#39;t teach linear algebra<br/>\n </span></blockquote>or Calculus from cooking.  You&#39;re going to need some semblance of a<br/>\ncurriculum for such things.&lt;<br/>\n<br/>\nObviously, your husband has never tried to cook a Martha Stewart recipe.  ;-)<br/>\n<br/>\nSeriously, what is it with the calculus thing?  How many students in public <br/>\nor even private high school take calculus?  How many adults ever use or <br/>\nremember their calculus?  <br/>\n<br/>\nBasically, there seems to be three reasons to learn something like this: 1.  <br/>\nYou enjoy it 2.  You need it to progress in something you enjoy  3.  You need <br/>\nit for something else that is otherwise unrelated.<br/>\n<br/>\nSo, I might have a child who just loves math for its own sake.  If that child <br/>\nwants to work his/her way through a calculus book or take a college class or <br/>\nmake a private arrangement with a math teacher, I&#39;m certainly not going to <br/>\nmind.  (When I was in school I actually LOVED working through math books, <br/>\nespecially story problems.  Twisted, I know.  ;-) )  Or possibly their math <br/>\nintelligence will be strong enough that they won&#39;t need these things.  If I <br/>\nhave a child who loves physics, s/he will have to decide whether they love it <br/>\nenough to deal with the mathematical part.  If so, again, there are choices <br/>\nfor learning.  But it will be the child&#39;s choice, not mine.  Finally, if I <br/>\nhave a child who&#39;s brilliant at words but so-so at math but s/he wants to go <br/>\nto college, I&#39;ll be sure s/he knows what level of math is necessary for the <br/>\nSATs to impress the admissions offices at college.  Then, again, it&#39;s the <br/>\nchild&#39;s choice.  <br/>\n<br/>\nElizabeth</div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@xxx.xxx","from":"SandraDodd@...","replyTo":"LIST","senderId":"iuf5rq0jWLDbUNlAlg_EbZQvozTpw1Mw5noXld8THibKupultYxjqOSSjOEINtaG9oQF4Wkkw-NG","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929142611","msgId":952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NC45NTIuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":949,"nextInTopic":953,"prevInTime":951,"nextInTime":953,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/1999 4:10:22 PM, crma@ix.netcom.com wrote: ","messageBody":"<div id=\"ygrps-yiv-489592896\">In a message dated 6/11/1999 4:10:22 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crma@...\">crma@...</a> wrote:<br/>\n<br/>\n&lt;&lt;Ask 10 unschoolers what unschooling is and you&#39;ll probably<br/>\nget 10 different answers -- yet all will have some underlying <br/>\nsimilarities.&gt;&gt;<br/>\n<br/>\nI believe this is less true than people like to believe.  In my experience, <br/>\nthe longer people unschool the closer their answers become, because there are <br/>\nunderlying principles about how learning happens IF it is left to happen <br/>\nnaturally.   Until people let go and let it happen, they make assumptions <br/>\nabout natural learning, and those assumptions differ more widely than the <br/>\ndescriptions of experienced &quot;radical unschoolers&quot; do.  <br/>\n<br/>\nThe other day I said (here or somewhere) that I had been unschooling for <br/>\nseven years.  It&#39;s eight.  I was counting Kirby as though he would have just <br/>\nfinished sixth grade, but it was pointed out to me that he would have just <br/>\nfinished seventh.  See?  I don&#39;t even keep track of what grade he would be <br/>\nin.  <br/>\n<br/>\nBecause kindergarten is required here, I count unschooling from the time he <br/>\nwould have gone to kindergarten.  I don&#39;t count before then because although <br/>\nI wasn&#39;t using a curriculum and my children were home and learning, I wasn&#39;t <br/>\ndoing anything I wouldn&#39;t have been doing if they had been going to public <br/>\nschool at the age of five.   When someone&#39;s absolutely planning to put their <br/>\nkids in school, I don&#39;t consider them to be homeschooling before that point.  <br/>\nThey&#39;re just living with pre-schoolers.  It may look just exactly the same as <br/>\nthose who intend NOT to send their kids to school, but I just can&#39;t bring <br/>\nmyself to say I&#39;ve been unschooling for twelve years just because Kirby&#39;s <br/>\nnearly thirteen.<br/>\n<br/>\nNow with Holly, perhaps it&#39;s different.  She had two older brothers and one <br/>\nwas definitely NOT in school, and soon neither was in school, although we had <br/>\nfigured Marty might want to go (he didn&#39;t when the time came).  So Holly was <br/>\nbig in the midst of an unschooling family and to consider her an unschooler <br/>\nfrom the beginning makes more sense.<br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"Cindy Ferguson","from":"Cindy Ferguson &lt;crma@...","replyTo":"LIST","senderId":"sxQfsKAMtjgzBV2urcTvlaIDRU2mTiFyPy8AsrCY3kIeMb474wAYEEl9gii_zLYONlU2l4AwO3KKek3XuLjFvB21lO8qiKSCXvU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929138774","msgId":949,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NC45NDkuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":947,"nextInTopic":952,"prevInTime":948,"nextInTime":950,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... My children are Megan age 4 and Alex (a boy) age 1.83333. My children were newborn when I started unschooling them.  I didn t know then it was called","messageBody":"<div id=\"ygrps-yiv-1281509759\">Dale & Karen Jones-Waddell wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I am curious what ages your children were when most of you started<br/>\n&gt; &quot;unschooling&quot;, however each of you may define it.  Some of the comments I&#39;ve<br/>\n&gt; read lately tend to be what I guess are the &quot;purist&quot; unschooler&#39;s thoughts.<br/>\n&gt; I&#39;m referring to the comments about zilcho curriculum,  no teaching allowed,<br/>\n&gt; exclusive child led learning, etc.  I have difficulty seeing how these could<br/>\n&gt; be so zealotously (a word?) applied to young children, and even a certain<br/>\n&gt; extent, to teenagers. <br/>\n<br/>\n </span></blockquote>My children are Megan age 4 and Alex (a boy) age 1.83333.<br/>\nMy children were newborn when I started unschooling them.  I didn&#39;t<br/>\nknow then it was called unschooling though.  I did &quot;nothing&quot; except<br/>\nprovide a rich and varied and safe environment for them.  They learned<br/>\nto walk and talk in their own time and on their own schedule.  I<br/>\ndid fret some -- Megan was a late walker (16 mos) and Alex is a late<br/>\ntalker.  My fretting consisted of talking to their father about it<br/>\nand both of us concluding that they were fine, just a bit later<br/>\nthan &#39;average&#39;.  Megan learned to use a toilet when she was a little<br/>\nover 3; Alex isn&#39;t interested now -- he showed some interest<br/>\nat 18 mos. but then decided he had other things to do!!<br/>\n<br/>\nI do not ever envision using a curriculum.  To me a curriculum is<br/>\na prescribed course of study outlined by someone other than the<br/>\nparty(parties) involved.  If Megan came to me and told me she<br/>\nwanted to be a rocket scientist, then we probably would sit down<br/>\nand discuss the important disciplines needed to succeed in that<br/>\nfield.  To me that isn&#39;t a curriculum; we probably would use<br/>\ntextbooks as reference material.<br/>\n<br/>\nI don&#39;t understand your confusion at all on applying unschooling<br/>\nto a younger child.  It seems quite natural to me.  I didn&#39;t &#39;teach&#39;<br/>\nthem to walk, I didn&#39;t drill them, I didn&#39;t give them exercises to<br/>\ndo.  I did create a safe space so when they desired they could attempt<br/>\nit; I did give them praise and encouragement when they succeeded and<br/>\nI consoled them when they fell down! For me unschooling is maintaining<br/>\nthat type of environment for all kinds of learning.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For example:<br/>\n&gt; <br/>\n&gt; 1) Foreign languages are most easily learned and absorbed when we are quite<br/>\n&gt; young (under 6 years).  If I waited for my child to ask me about that, well,<br/>\n&gt; she really doesn&#39;t have enough information to think of that question, not to<br/>\n&gt; mention difficulty just formulating a sentence.  I think she would have<br/>\n&gt; missed out on that opportunity.<br/>\n </span></blockquote>I do think modeling this is the most important aspect.  I don&#39;t know<br/>\nwhere you live but could you use another language in your day to day<br/>\nliving?  When I lived in Switzerland in the 80s, I knew several <br/>\nfamilies where Mom spoke one language to the children, Dad another<br/>\none.  But in Switzerland one could get TV channels in 3 languages<br/>\nand many people were multilingual.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; 2)  My daughter wanted to stay and play in one of the toy cabinets today<br/>\n&gt; when I had a need to get the dog to the veterinarian for her shots.  I was<br/>\n&gt; pulling her away from her cabinet and her desires to learn and play at that<br/>\n&gt; instant.  I was doing the leading, she the following.<br/>\n&gt; <br/>\n&gt; 3)  Occasionally my daughter wants to keep doing what she&#39;s doing, when<br/>\n&gt; we&#39;re outside say, in the sunshine, or in the mosquito prime time.  Should I<br/>\n&gt; follow her lead and let her get sunburned or eaten alive by mosquitoes, or<br/>\n&gt; deal with her crying and dissapointment because I have deemed it is in her<br/>\n&gt; best interest.<br/>\n&gt; <br/>\n </span></blockquote>These are more general parenting concerns that specifically unschooling.<br/>\nFor me with young children, one of my biggest responsibilities is to<br/>\nprovide a safe environment.  They don&#39;t understand that a fall from a<br/>\nchair could hurt or that playing in the street could really hurt them.<br/>\nSometimes they may get upset the activity can&#39;t continue and I try<br/>\nto explain to them why it can&#39;t and I empathize with their anguish.<br/>\nBut they still can&#39;t play in the street!!!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I am curious, where it is written what the &quot;general consensus&quot; on<br/>\n&gt; &quot;unschooling&quot; is?  And where is the list of right words, and wrong words to<br/>\n&gt; use regarding such?  This thread has led me to believe it is always in<br/>\n&gt; process and quite diverse--and that&#39;s just fine with me!<br/>\n&gt;<br/>\n </span></blockquote>I don&#39;t know where it is written!  Maybe John Holt&#39;s work is one<br/>\nplace.  Ask 10 unschoolers what unschooling is and you&#39;ll probably<br/>\nget 10 different answers -- yet all will have some underlying <br/>\nsimilarities.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Last comment, stolen from my husband&#39;s lips.  You can&#39;t teach linear algebra<br/>\n&gt; or Calculus from cooking.  You&#39;re going to need some semblance of a<br/>\n&gt; curriculum for such things.<br/>\n </span></blockquote>If you substitute textbook for curriculum, I would agree a bit more.<br/>\nLinear algebra and calculus would be hard to learn from cooking but<br/>\nnot from other life experiences.  Please recall my definition of<br/>\ncurriculum from above.  I also don&#39;t plan on teaching (we may<br/>\nhave different definitions of that word) those subjects to my<br/>\nchildren.  If they want to learn them, fine and I will provide<br/>\nresources -- including my own textbooks and recollections of the<br/>\nsubjects; if not, that&#39;s fine too.<br/>\n<br/>\nBTW I readily recognize that I am at the radical end of the<br/>\nunschooling spectrum.<br/>\n<br/>\n-- <br/>\n<br/>\nCindy Ferguson<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:crma@...\">crma@...</a></div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@xxx.xxx","from":"SandraDodd@...","replyTo":"LIST","senderId":"LgSof_9qdDMCGlKvJFZQuxD6ckKqxN9bqs76eNB2Cd405j2_RGqe_N4_yaJIhDPjr9tSJsnqSYye","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929136848","msgId":947,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NC45NDcuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":944,"nextInTopic":949,"prevInTime":946,"nextInTime":948,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/11/1999 1:52:42 PM, you wrote: ","messageBody":"<div id=\"ygrps-yiv-1257381272\">In a message dated 6/11/1999 1:52:42 PM, you wrote:<br/>\n<br/>\n&lt;&lt; This has been an interesting discussion.  I have a 33 month old and am new<br/>\nto homeschooling, and we&#39;ve been subscribed to this unschooling list for<br/>\nseveral months.  This is the first thread I have followed.&gt;&gt;<br/>\n<br/>\nI thought this list was new just a couple of weeks ago.<br/>\nAre you confusing it with another unschooling list or was I just not invited <br/>\nto be a charter member!?  :-0<br/>\n<br/>\n&lt;&lt;&lt;&lt;I would<br/>\njust add, that a child is a child, and requires supervision, teaching,<br/>\nmentoring--whatever word you want to choose. &gt;&gt;<br/>\n<br/>\nA child is a person.  There are adults I mentor too.  I advise them on their <br/>\nbehavior and moods.  I have to put sunscreen on my husband.  I talk my sister <br/>\nthrough social situatons sometimes.  <br/>\n<br/>\nChildren need more basic advice sometimes, but when you can explain to them <br/>\nwhy it&#39;s time to go or why they need to wait until after mosquito-hour, <br/>\nthey&#39;re in on the decision too and you haven&#39;t made it for them.  If I can <br/>\nconvince a friend of mine to do something really useful for someone that she <br/>\nmight not have thought of on her own, I didn&#39;t MAKE her do it, although I <br/>\nmight have suggested it or inspired her to do it.  <br/>\n<br/>\n&lt;&lt;Just by virtue<br/>\nof the fact you have chosen to homeschool and unschool, you have dictated<br/>\n*to a certain extent* how your child will view and interact with the world.&gt;&gt;&gt;<br/>\n<br/>\nI wouldn&#39;t homeschool my children against their will.  It wasn&#39;t dictated to <br/>\nthem.  If one of them really wanted a formal curriculum, I&#39;d buy one.  I <br/>\nwould not myself direct that use of that, but I&#39;d certainly explain what they <br/>\ndidn&#39;t understand and answer questions.  I wouldn&#39;t be the one saying &quot;It&#39;s <br/>\n8:00, do math&quot; or &quot;It&#39;s test day.&quot;<br/>\n<br/>\n&lt;&lt;Last comment, stolen from my husband&#39;s lips.  You can&#39;t teach linear algebra<br/>\nor Calculus from cooking.  You&#39;re going to need some semblance of a<br/>\ncurriculum for such things.&gt;&gt;<br/>\n<br/>\nMy husband&#39;s a math guy.  <br/>\nSo where in life to linear algebra and calculus live?  That is where they <br/>\nwill be found.   <br/>\nAnd why would a person want to learn them?  That is when they will be learned <br/>\neasily--when the learner has the need or desire because of goals or plans.  <br/>\n<br/>\nMany things are taught too early in school, because schools want to compete <br/>\nwith one another and dazzle people and impress parents and school boards.  It <br/>\nhas been said that all of 13 years of school could be learned in 18 months by <br/>\na teenager.  No way does it take 13 years.  Much of the purpose of school is <br/>\nbabysitting--isolating children away from working adults and those who <br/>\nchildless folk who just want six hours of quiet every day while kids are <br/>\nincarcerated elsewhere.<br/>\n<br/>\nAnd when in public school is calculus taught?  Usually not until college.  <br/>\nAnd if you have a young teen interested in higher math, college courses will <br/>\nbe available to him and you won&#39;t have to learn to teach differential <br/>\nequations.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"Linda Wyatt","from":"Linda Wyatt &lt;hilinda@...","replyTo":"LIST","senderId":"_yGPmop9xgc6jeYeZAy6TkKN2SUKnU48Lr4eYlp4dW5n7Jb03DFC8UJK2cOfC0EOv3GNsG-o2GRHg0NvvRWRnEZn7btTCpPHgVQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929132965","msgId":944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NC45NDQuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":943,"nextInTopic":947,"prevInTime":943,"nextInTime":945,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"... We started unschooling before we had kids.  Unschooling with kids is simply an extension of our lives before they were here. ... It isn t that teaching","messageBody":"<div id=\"ygrps-yiv-646876167\"><blockquote><span title=\"ireply\">&gt; From: &quot;Dale & Karen Jones-Waddell&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katejw@...\">katejw@...</a>&gt;<br/>\n<br/>\n&gt; I am curious what ages your children were when most of you started<br/>\n&gt; &quot;unschooling&quot;, however each of you may define it.<br/>\n<br/>\n </span></blockquote>We started unschooling before we had kids.  Unschooling with kids is simply<br/>\nan extension of our lives before they were here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Some of the comments I&#39;ve<br/>\n&gt; read lately tend to be what I guess are the &quot;purist&quot; unschooler&#39;s thoughts.<br/>\n&gt; I&#39;m referring to the comments about zilcho curriculum,  no teaching allowed,<br/>\n<br/>\n </span></blockquote>It isn&#39;t that teaching &quot;isn&#39;t allowed&quot;, it&#39;s that it simply doesn&#39;t happen<br/>\nthat way.  There isn&#39;t a need for me to present information in a teaching<br/>\nway.    There aren&#39;t things that I feel I need to be the authority on,<br/>\nthere isn&#39;t information that I&#39;m the only source of, and in general, I have<br/>\nno stake in whether information I share is absorbed at that time or not.<br/>\nIf they asked me to teach them something, I might try to do that, but that<br/>\nisn&#39;t what they ask.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 1) Foreign languages are most easily learned and absorbed when we are quite<br/>\n&gt; young (under 6 years).  If I waited for my child to ask me about that, well,<br/>\n&gt; she really doesn&#39;t have enough information to think of that question, not to<br/>\n&gt; mention difficulty just formulating a sentence.  I think she would have<br/>\n&gt; missed out on that opportunity.<br/>\n<br/>\n </span></blockquote>You don&#39;t have to wait for your child to ask, and sit there doing nothing<br/>\nuntil that time.  I truly do not understand where people get that from.<br/>\nModeling is possibly the most important ting about unschooling- doing<br/>\ninteresting and fun things yourself so that your children naturally see<br/>\nlfie as fun and interesting stuff to learn about.<br/>\n<br/>\nYou could learn the language yourself, and practice with family members.<br/>\nYou might listen to tapes, watch videos, take lessons, invite a native<br/>\nspeaker to your house, use a book, watch movies in that language, read<br/>\nchildren&#39;s books in that language, go somewhere that language is spoken,<br/>\netc.  If *you* are interested in learning a language and are happily doing<br/>\nthese things, your child may get interested.  If they don&#39;t get interested,<br/>\nthey at least know that the possibility exists- isn&#39;t that what you were<br/>\nconerned about, that they wouldn&#39;t know to ask about it?<br/>\n<br/>\nIf you aren&#39;t interested in learning a lanugage, I don&#39;t see why it would<br/>\nbe so important to you that your child do so.  If you are interested, then<br/>\nyour learning will be plenty to bring it to your child&#39;s attention.<br/>\n<br/>\nI think it would be very odd for a child living in a learning environment<br/>\nto reach the age of six not knowing of the existence of different<br/>\nlanguages, and therefore having the opportunity to express an interest.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 2)  My daughter wanted to stay and play in one of the toy cabinets today<br/>\n&gt; when I had a need to get the dog to the veterinarian for her shots.  I was<br/>\n&gt; pulling her away from her cabinet and her desires to learn and play at that<br/>\n&gt; instant.  I was doing the leading, she the following.<br/>\n<br/>\n </span></blockquote>This gets more into parenting issues than unschooling issues.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; 3)  Occasionally my daughter wants to keep doing what she&#39;s doing, when<br/>\n&gt; we&#39;re outside say, in the sunshine, or in the mosquito prime time.  Should I<br/>\n&gt; follow her lead and let her get sunburned or eaten alive by mosquitoes, or<br/>\n&gt; deal with her crying and dissapointment because I have deemed it is in her<br/>\n&gt; best interest.<br/>\n<br/>\n </span></blockquote>Again, this is more parenting than unschooling.  But couldn&#39;t you use<br/>\nsunscreen and bug stuff?<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am curious, where it is written what the &quot;general consensus&quot; on<br/>\n&gt; &quot;unschooling&quot; is?<br/>\n<br/>\n </span></blockquote>It isn&#39;t, unless you consider John Holt&#39;s writings to be the generally<br/>\naccepted definition, since he coined the word.  His definition changed as<br/>\nhe educated himself, so be aware that he uses the word differently at<br/>\ndifferent times, and it has further evolved since then.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Last comment, stolen from my husband&#39;s lips.  You can&#39;t teach linear algebra<br/>\n&gt; or Calculus from cooking.  You&#39;re going to need some semblance of a<br/>\n&gt; curriculum for such things.<br/>\n<br/>\n </span></blockquote>Oh, my very favorite argument!!!  Why do people always pick algebra and<br/>\ncalculus for this &quot;but you need a curriculum for these&quot; aregument?  It<br/>\nnever fails. :-)<br/>\n<br/>\n<br/>\nYou *DO NOT NEED* a curriculum to learn algebra.  Algebra is the most fun<br/>\nthing in the world, if people are left to enjoy it rather than become<br/>\naggravated by an attempt to box and drill and kill it.<br/>\n<br/>\nThere are many, many ways to learn about math and mathematical concepts<br/>\nwithout someone else&#39;s curriculum.  Where did algebra and calculus come<br/>\nfrom in the first place?  From people who were interested in how things<br/>\nwork, who took the time to play with stuff and discover patterns and ways<br/>\nto understand it.<br/>\n<br/>\nThe cool thing about algebra is that what it is is two things:<br/>\nfiguring out what you know, what you want to know, and how to use the first<br/>\nto figure out the second. And, most fun and more importantly, it&#39;s *playing<br/>\nwith numbers* and their relationships with each other.  You can play<br/>\nhowever you like, move them around, change them, do all sorts of things,<br/>\nand if you do that with an understanding of their relationships and how<br/>\nthey work, things will maintain their relationships, and you can use all<br/>\nthat playing around to fiddle stuff into whatever form makes you the most<br/>\nhappy, and therefore, is easiest for you to work with.<br/>\n<br/>\nThat&#39;s all it is.  Not memorizing formulas.  Not frustrating.  Fun.  Using<br/>\nyour understanding of numbers and number theory and relationships to make<br/>\nthings the way you want them, so you can use them to get real, useful<br/>\ninformation.<br/>\n<br/>\nA curriculum might be helpful for folks who don&#39;t have a clue where to<br/>\nstart playing, if they&#39;ve had that playing with numbers instinct removed<br/>\nsomehow.  But people without math phobias will naturally play around with<br/>\nstuff enough to find it very cool and interesting and fascinating (unless,<br/>\nof course, they simply aren&#39;t inclined that way, in which case, they aren&#39;t<br/>\nlikely to end up needing to know anyway).  We do huge amounts of thinking<br/>\nand talking and playing and exploring around here that involve things that<br/>\ncould be called algebra or calculus, but we have no need to call them that,<br/>\nor call them anything, or categorize them, we just use them.  Lots of<br/>\nphysics stuff and music stuff and art stuff.  Cooking is often mentioned as<br/>\na way to play with math, but it is by far not the only one.<br/>\n<br/>\n<br/>\n<br/>\nLinda<br/>\n<br/>\n--<br/>\nLinda Wyatt<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hilinda@...\">hilinda@...</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.lightlink.com/hilinda\">http://www.lightlink.com/hilinda</a><br/>\nLearning everywhere, all the time.<br/>\nAlgebra before breakfast<br/>\n&quot;A lie, you see, no matter how often or how vociferously repeated, may be<br/>\nmistaken for the truth, but it does not become the truth.&quot; - Adam Crown</div>","specialLinks":[]},{"userId":0,"authorName":"Dale & Karen Jones-Waddell","from":"&quot;Dale & Karen Jones-Waddell&quot; &lt;katejw@...","replyTo":"LIST","senderId":"Ix68fE8aQyi5rmKcB2vQhnbYwzCgbURIrpqxeCA5GPZ7dXJAycjuT09ol1vRUsp_H8gkqVyHR-rNES6WhTXep-TboWJTgPD2g9YZ17-oU_j_pDb7gxA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Musings from the shower","postDate":"929130883","msgId":943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy43NC45NDMuOTU5MjY5NzQwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":944,"prevInTime":942,"nextInTime":944,"topicId":943,"numMessagesInTopic":0,"msgSnippet":"This has been an interesting discussion.  I have a 33 month old and am new to homeschooling, and we ve been subscribed to this unschooling list for several","messageBody":"<div id=\"ygrps-yiv-1628930347\">This has been an interesting discussion.  I have a 33 month old and am new<br/>\nto homeschooling, and we&#39;ve been subscribed to this unschooling list for<br/>\nseveral months.  This is the first thread I have followed.<br/>\n<br/>\nI am curious what ages your children were when most of you started<br/>\n&quot;unschooling&quot;, however each of you may define it.  Some of the comments I&#39;ve<br/>\nread lately tend to be what I guess are the &quot;purist&quot; unschooler&#39;s thoughts.<br/>\nI&#39;m referring to the comments about zilcho curriculum,  no teaching allowed,<br/>\nexclusive child led learning, etc.  I have difficulty seeing how these could<br/>\nbe so zealotously (a word?) applied to young children, and even a certain<br/>\nextent, to teenagers.  For example:<br/>\n<br/>\n1) Foreign languages are most easily learned and absorbed when we are quite<br/>\nyoung (under 6 years).  If I waited for my child to ask me about that, well,<br/>\nshe really doesn&#39;t have enough information to think of that question, not to<br/>\nmention difficulty just formulating a sentence.  I think she would have<br/>\nmissed out on that opportunity.<br/>\n<br/>\n2)  My daughter wanted to stay and play in one of the toy cabinets today<br/>\nwhen I had a need to get the dog to the veterinarian for her shots.  I was<br/>\npulling her away from her cabinet and her desires to learn and play at that<br/>\ninstant.  I was doing the leading, she the following.<br/>\n<br/>\n3)  Occasionally my daughter wants to keep doing what she&#39;s doing, when<br/>\nwe&#39;re outside say, in the sunshine, or in the mosquito prime time.  Should I<br/>\nfollow her lead and let her get sunburned or eaten alive by mosquitoes, or<br/>\ndeal with her crying and dissapointment because I have deemed it is in her<br/>\nbest interest.<br/>\n<br/>\nI think I understand how such a thread has arisen, and I imagine many are<br/>\nreacting against our society&#39;s tendency to *not* respect the child.  I would<br/>\njust add, that a child is a child, and requires supervision, teaching,<br/>\nmentoring--whatever word you want to choose.  (I have no &quot;negative&quot; reaction<br/>\nto the word &quot;teaching.&quot;  I have had a number of teachers from the past that<br/>\nI remember postively and am grateful they were in my life.) Just by virtue<br/>\nof the fact you have chosen to homeschool and unschool, you have dictated<br/>\n*to a certain extent* how your child will view and interact with the world.<br/>\nParents make choices every day, even prenatal choices that affect the child.<br/>\nIt can&#39;t be helped!  It&#39;s called the environment.  No one can escape it<br/>\ncompletely.  Give yourselves a break!<br/>\n<br/>\nI am curious, where it is written what the &quot;general consensus&quot; on<br/>\n&quot;unschooling&quot; is?  And where is the list of right words, and wrong words to<br/>\nuse regarding such?  This thread has led me to believe it is always in<br/>\nprocess and quite diverse--and that&#39;s just fine with me!<br/>\n<br/>\nLast comment, stolen from my husband&#39;s lips.  You can&#39;t teach linear algebra<br/>\nor Calculus from cooking.  You&#39;re going to need some semblance of a<br/>\ncurriculum for such things.<br/>\n<br/>\nCheers,<br/>\nKaren JW<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s a really fuzzy line at times, but I think what we are trying to say<br/>\n </span></blockquote>is<br/>\n<blockquote><span title=\"ireply\"> &gt; that once you shift your focus from not worrying about what you use to<br/>\n </span></blockquote>teach,<br/>\n<blockquote><span title=\"ireply\"> &gt; the next item is to shift from is the idea you need to teach.  Which<br/>\n </span></blockquote>becomes<br/>\n<blockquote><span title=\"ireply\"> &gt; even more fuzzy when you think, &quot;but I have to answer their questions!&quot;<br/>\n </span></blockquote>Of<br/>\n<blockquote><span title=\"ireply\"> &gt; course we do. I have one child that is a champion question asker. &lt;g&gt;<br/>\n&gt;<br/>\n&gt; If you work very hard at changing the language you use, it&#39;s much easier<br/>\n </span></blockquote>to<br/>\n<blockquote><span title=\"qreply\"> &gt; see unschooling clearly. </span></blockquote></div>","specialLinks":[]}],"prevTopicId":995,"nextTopicId":1079}}