{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...-net.ne.jp&gt;","replyTo":"LIST","senderId":"TfcYjBIjRE9VeBRs1GAP9_Gu_H3nQVPvChtptns0MdtZ9ox9YZ315rLOZYf_xYnTATwPIxuSNEAiS-awh3Ogf-wRVPROaZc","spamInfo":{"isSpam":false,"reason":"0"},"subject":"KnoK NEWS (1) for 6 May 2000","postDate":"957608374","msgId":8443,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNTA2MTAxMS5UQUEwNTAyNkBtYWlsLndhMi5zby1uZXQubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":8442,"nextInTime":8444,"topicId":8443,"numMessagesInTopic":0,"msgSnippet":"* * * *  KnoK NEWS  * * * * -- Views from the world of learning in Japan -- Welcome to the 6 May 2000 edition of KnoK (pronounced knock ) NEWS, an informal","messageBody":"<div id=\"ygrps-yiv-415018885\">* * * *  KnoK NEWS  * * * *<br/>\n       -- Views from the world of learning in Japan --<br/>\n<br/>\n<br/>\nWelcome to the 6 May 2000 edition of KnoK (pronounced &quot;knock&quot;) NEWS, an <br/>\ninformal and periodic bulletin concerning issues of learning in Japan. It <br/>\nis brought to you by the Covert family -- Kazumi, Kenya and Brian -- a <br/>\nmulticultural, homelearning family in Osaka, Japan.<br/>\n<br/>\nKnoK stands for *Kodomo no Kokoro*, meaning &quot;Heart of a Child&quot; in <br/>\nJapanese. It is our belief that the heart of any child is indeed at the <br/>\ncenter of true learning, wherever and however such learning may take <br/>\nplace. <br/>\n<br/>\n<br/>\n             &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nEDITOR&#39;S WELCOME:  Greetings again, everyone! We&#39;re already a month into <br/>\nthe new school year here in Japan -- the first school year of the new <br/>\nmillenium -- and along with it, no doubt, a slew of more news stories to <br/>\nappear in the media about how schools appear to be failing Japanese <br/>\nchildren.<br/>\n<br/>\nBut for us homelearners in Japan, there is a bit of good news of a <br/>\ndifferent kind: One year ago this very day, a family in the global <br/>\nhomelearning community was featured in a prominent news story on <br/>\nchildraising that was published in a major daily newspaper in Japan&#39;s <br/>\ncapital city. And guess what: The story even turned out to be respectful <br/>\nof, and open to, homelearning as an alternative to school.<br/>\n<br/>\nIt was on 6 May 1999 that the Tokyo Shimbun newspaper ran a lengthy, <br/>\nfour-segment story on how families in the United States, China, Germany <br/>\nand Hong Kong are coping with raising children. Interviewed for the <br/>\nlead-in segment was Kathleen Iuzzolino, a homelearning parent based in <br/>\nNew Jersey.<br/>\n<br/>\nEver looking for chances to celebrate homelearning in and out of Japan, <br/>\nKnoK NEWS is delighted to share with readers our English translation of <br/>\nthat original Tokyo Shimbun article, as well as Kathleen&#39;s own revealing <br/>\ninsights of the interview session with the Japanese reporters.<br/>\n<br/>\nNot to be outdone by the mainstream media, KnoK NEWS also takes that <br/>\nTokyo Shimbun story one step further and looks briefly at where the <br/>\nhomelearners mentioned in the Japanese article are today -- one year later.<br/>\n<br/>\nThis edition of KnoK NEWS has turned out to be a double feature, so our <br/>\nreport this time is being sent in two separate sections: In the first, we <br/>\nlook at the Tokyo Shimbun coverage. In the second, we wrap up our <br/>\ntwo-part &quot;Q & A on Homeschooling in Japan&quot; by a respected Japanese <br/>\nhomelearning advocate and parent.<br/>\n<br/>\nSo, enough of the introduction and into the action. With great pleasure, <br/>\nwe take you back one year ago today to a story that hit the newsstands of <br/>\nTokyo just around evening rush hour....<br/>\n<br/>\n                          *     *     *     *<br/>\n<br/>\n[Tokyo Shimbun, evening edition, page 5; Thursday, 6 May 1999] <br/>\n<br/>\nNEW WORLD AFFAIRS<br/>\n<br/>\nRaising questions about childraising:<br/>\nMoms and dads searching for answers<br/>\n<br/>\nThe decreasing number of children per family in Japan has brought about <br/>\nincreasing concerns over the care of children. The appearance of Japanese <br/>\ngovernment promotional posters featuring popular idol singer Namie <br/>\nAmuro&#39;s husband, Sam, holding their child caused a sensation, and stirred <br/>\npublic discussion about fathers participating in the raising of children.<br/>\n<br/>\nOn the other hand, the case of the youth in Kobe who wounded and killed <br/>\nother children over a period of time has attracted much attention, as <br/>\nhave other brutal acts by youths. Methods of childraising and educating <br/>\nare being questioned as a result.<br/>\n<br/>\nHere, we introduce circumstances around the world where such questioning <br/>\nis taking place.<br/>\n<br/>\n--UNITED STATES:<br/>\n<br/>\nKitchen becomes a classroom,<br/>\nas distrust of educational system<br/>\nfuels decision not to attend school<br/>\n<br/>\n&quot;Is this right?&quot; ask Elizabeth, 12, and Alex, 11, notebooks in hand. &quot;Let <br/>\nme see...&quot; responds Kathleen Iuzzolino, 39, running her pen over the pages.<br/>\n<br/>\nThis would be a typical scene at school, yet it is actually an average, <br/>\neveryday household kitchen. And these two children would be in sixth and <br/>\nfifth grades of primary school, if they were attending school -- but they <br/>\nare not.<br/>\n<br/>\n&quot;Homeschooling,&quot; where children are taught in the home rather than being <br/>\nsent to school, started spreading throughout the United States more than <br/>\n10 years ago. Iuzzolino, who lives in a rural town in central New Jersey, <br/>\nbegan teaching her three boys at home nine years ago. By linking up, she <br/>\nand other parents are able to take charge of and share their fortes in <br/>\nvarious subjects.<br/>\n<br/>\nIuzzolino is taking charge of chemistry and physics. Counting [one of] <br/>\nher three boys, Elizabeth and the other children in her support group, <br/>\nIuzzolino teaches eight children in all, weaving her way through the <br/>\ngroup as she walks around checking their studies.<br/>\n<br/>\nAccording to the U.S. Department of Education, at least 500,000 children <br/>\nare learning through such kind of homeschooling. That figure was a mere <br/>\n10,000 in 1970. All 50 states now allow homeschooling, and more than a <br/>\nfew are like New Jersey, where, Iuzzolino says, &quot;There are no legal <br/>\nrestrictions as to what is taught.&quot;<br/>\n<br/>\nIt is against this backdrop that a distrust of school education has <br/>\ndeveloped in the U.S., amid incidents of violence on school grounds and <br/>\nfalling educational standards. But, as Iuzzolino boasts, &quot;Homeschooling <br/>\nprovides a detailed education that fits a child&#39;s own level, and this <br/>\ngets good results.&quot;<br/>\n<br/>\nA 10-year-old in Iuzzolino&#39;s group is learning about chemistry formulas <br/>\nat a comparatively early age; middle school-age youths are also <br/>\nproceeding well in high-school level studies. Thanks to this kind of <br/>\nlearning environment, Iuzzolino&#39;s eldest son, at 15 years old, is allowed <br/>\nto attend courses at the local college.<br/>\n<br/>\nTrust in education in the U.S. has been greatly eroded over the past year <br/>\nin the wake of shootings by children, such as the random shooting at the <br/>\nhigh school in a Denver, Colorado suburb.<br/>\n<br/>\n&quot;The ones who know children best are their own parents,&quot; says Iuzzolino. <br/>\n&quot;It&#39;s that simple.&quot;<br/>\n<br/>\n   --Story and photo by Masami Nagai, in New Jersey, USA  <br/>\n  <br/>\n                      *     *     *     *<br/>\n<br/>\nThe U.S. segment on homelearning ends there, but the original Japanese <br/>\narticle goes on to present coverage from:<br/>\n<br/>\n--China, where the &quot;4-2-1 Syndrome&quot; (four grandparents, two parents, one <br/>\nchild) that has emerged under the country&#39;s population regulations is <br/>\nleading to greater academic expectations on the only child in Chinese <br/>\nfamilies by parents and grandparents. A more active role by grandparents <br/>\nin the lives of grandchildren has also come about as a result of this <br/>\nsocial phenomenon, according to the story. <br/>\n<br/>\n--Germany, where the good news is that fathers are taking a more active <br/>\nrole in their children&#39;s upbringing. The bad news is that crimes <br/>\ncommitted by youths in Germany are on the rise, due in part, the article <br/>\nsays, to the lagging economic conditions there. <br/>\n<br/>\n--and Hong Kong, where children are reportedly facing greater social <br/>\npressures than ever, especially from parents, to get into the best <br/>\nprimary and middle schools. Hong Kong working mothers usually have the <br/>\nweekends off, and try to spend that time in &quot;skinship&quot; (physical <br/>\nnurturing) with their children, the story says.<br/>\n<br/>\nLOOKING BACK:<br/>\n<br/>\nKathleen Iuzzolino recalls the interview session a year ago in New Jersey <br/>\nwith the Japanese reporters that led to the story getting such prominent <br/>\nplacement in the Tokyo Shimbun....<br/>\n<br/>\n&quot;The reporters were out of their New York office and wanted to <br/>\nspecifically interview American homeschoolers. When I mentioned to them <br/>\nthat there were Japanese homeschoolers [in Japan], they seemed a bit <br/>\nsurprised.<br/>\n<br/>\n&quot;The reporters were by far among the most receptive interviewers that <br/>\nI&#39;ve run across,&quot; Kathleen says, &quot;and I got *quite* an earful of their <br/>\nopinions on what is wrong with Japanese schools.&quot;<br/>\n<br/>\nDespite the prevailing Western stereotypes of schoolchildren in Japan as <br/>\nbeing rocket-scientist material, what the Japanese reporters saw at the <br/>\nIuzzolinos&#39; home that day seemed to have left them with positive <br/>\nimpressions of homelearning as a viable form of education for Japan.<br/>\n<br/>\n&quot;They came here during one of my chemistry classes and took pictures and <br/>\ntalked with the kids,&quot; she remembers. &quot;They examined the chemistry text <br/>\nthat I used and exclaimed over and over again that they didn&#39;t know this <br/>\nlevel of chemistry, that it had never been taught to them (which I found <br/>\nsurprising, considering all the stereotypes).&quot;<br/>\n<br/>\nThe reporters&#39; interest in homelearning extended well beyond the day&#39;s <br/>\nlessons.<br/>\n<br/>\n&quot;I must have talked to them for two hours after class,&quot; Kathleen recalls. <br/>\n&quot;There was one American reporter with them and she just gushed for the <br/>\ntwo full hours. The Japanese reporters, including the newspaper&#39;s New <br/>\nYork editor, were very complimentary and receptive to homeschooling as a <br/>\nwhole.&quot;<br/>\n<br/>\nWhat appeared to be a professional interest in homelearning on the part <br/>\nof the Japanese reporters soon revealed itself as something a little bit <br/>\ncloser to home.<br/>\n<br/>\n&quot;At first I thought they were happy that U.S. education had sunk so low <br/>\nas to necessitate us do-it-yourselfers,&quot; Kathleen says. &quot;Then I figured <br/>\nout that they were happy that they were finding alternatives for <br/>\n*themselves*. <br/>\n<br/>\n&quot;That surprised me the most.&quot;<br/>\n<br/>\nWHERE ARE THEY NOW?<br/>\n<br/>\nWhere the Tokyo Shimbun left off, KnoK NEWS picks up. Here&#39;s what the <br/>\nhomelearners who were mentioned in the Japanese newspaper story are doing <br/>\none year later:<br/>\n<br/>\n--Elizabeth has moved along well over the past year, and is finishing <br/>\nstudies at seventh-grade level. &quot;[She] has become much more of a leader <br/>\nthis year than a follower as in the past,&quot; according to Kathleen. <br/>\n&quot;Science has helped Elizabeth to become more organized in her thinking.&quot;<br/>\n<br/>\n--Alexandra (&quot;Alex&quot;) is at sixth-grade level this year and is a <br/>\nballerina: &quot;Too sweet for words,&quot; notes Kathleen. &quot;Alex tackled <br/>\nhigh-school level chemistry, physics AND biology this year.&quot;<br/>\n<br/>\n--The three Iuzzolino boys: Kathleen&#39;s youngest son, Raphael, now age <br/>\nsix, &quot;started piano lessons this year and blew on through three levels <br/>\nsince [last] September. He has a remarkable ability to read music -- even <br/>\nthough he can&#39;t read English yet. He plays, likes to cook with me, and <br/>\ngets to ride all over the countryside as we take his brothers here, <br/>\nthere, and everywhere....&quot;<br/>\n<br/>\nBrandon, 13, is now studying Spanish, art, art history, biology, <br/>\nreligion, chemistry, physics and piano. He has a black belt in tae kwon <br/>\ndo and is in training to become a certified assistant teacher. &quot;Right now <br/>\nhe is an apprentice instructor. He loves teaching kids and adults. He <br/>\nspends about three hours a day at his academy. He is also an altar boy <br/>\nand a Boy Scout....&quot;<br/>\n<br/>\nMichael, 15, continued taking classes part-time at the local college this <br/>\npast year -- &quot;had a marvelous time, loved working with the professors, <br/>\nreceived too many credits and now has to matriculate because of them,&quot; <br/>\nsays Kathleen. Michael recently gave his first college recital as a <br/>\nclassical pianist, to a warm reception. He has a 4.0 grade point average, <br/>\nas of this writing, and looks forward to entering college full-time in <br/>\nthe fall. He has been working part-time at his job, pays for his own <br/>\nexpenses and travel excursions, and is in line for a job promotion at <br/>\nwork when he turns 16. He too participates in Boy Scout and church <br/>\nactivities. Adds Kathleen: &quot;He doesn&#39;t consider himself to be <br/>\n&#39;homeschooled&#39; any longer.&quot;<br/>\n<br/>\n--Kathleen Iuzzolino continues to be a homelearning parent, however. In <br/>\naddition to working full time (she and her husband, Mark, are court <br/>\nreporters), Kathleen is also teaching chemistry, physics and religion to <br/>\nher own and other children. She also teaches an advanced chemistry class <br/>\nwith her eldest son and other older teens; she has been teaching this <br/>\nclass for four years. This year will be the last, she says, since several <br/>\nof the teens in the group plan to attend college in the fall:  <br/>\n<br/>\n&quot;The activities of that older teens class are amazing. Last summer, one <br/>\ngirl went to Croatia to do missionary work; one went as a U.S. ambassador <br/>\nto the Hague Appeal for Peace [May 1999] in the Netherlands, but had to <br/>\ngive a speech before thousands in Washingon, DC; one went alone to <br/>\nAustria; one went alone to Germany; one toured Kenya with his family; and <br/>\none went to Iowa to do church-building missionary work (she&#39;s in Italy <br/>\nright now). These kids have amazing lives. Their ages are 14 to 17.&quot;<br/>\n<br/>\nAlthough Kathleen speaks with obvious pride of what all these children <br/>\nhave been accomplishing, she is also quick to dismiss her own <br/>\nhomeschooled sons as any kind of child &quot;prodigies.&quot;<br/>\n<br/>\n&quot;They all have their strengths and their weaknesses,&quot; she says. &quot;Both of <br/>\nthe older boys have learning difficulties, my oldest with dyslexia and my <br/>\nmiddle with writing difficulties. We have spent their lives concentrating <br/>\non their strengths and letting their weaknesses catch up at their own <br/>\ndevelopmental rates.<br/>\n<br/>\n&quot;People always assume that these homeschooling &#39;success&#39; stories are just <br/>\nexceptional children and their own children would never be able to <br/>\naccomplish such goals,&quot; she said. &quot;I like to point out that homeschooling <br/>\nallows *all* children to be &#39;exceptional&#39; children!&quot;<br/>\n<br/>\nAs the Japanese newspaper quotes Kathleen Iuzzolino as saying a year ago <br/>\ntoday: &quot;The ones who know children best are their own parents. It&#39;s that <br/>\nsimple.&quot;<br/>\n<br/>\nIndeed.<br/>\n<br/>\n                         *     *     *     *<br/>\n<br/>\n<br/>\n             Continued in second section of KnoK NEWS:<br/>\n<br/>\n             Q & A ON HOMESCHOOLING IN JAPAN -- Part 2</div>","specialLinks":[]}],"prevTopicId":8398,"nextTopicId":8444}}