{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":81986835,"authorName":"Diana E","from":"Diana E &lt;dianasheart@...&gt;","profile":"dianasheart","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: dawnasoo","postDate":"1007835664","msgId":29670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDExMjA4MTgyMTA0LjIxMDcxLnFtYWlsQHdlYjEyNTAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMDc3ODk2NjAuMTQzMC4yMzE0OS5tOUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":29669,"nextInTime":29671,"topicId":29670,"numMessagesInTopic":0,"msgSnippet":"My girls are twelve and twenty-two.  Carrie never attended school until after testing for her GED and ACT.  Then she attended community college, and did quite","messageBody":"<div id=\"ygrps-yiv-759195202\">My girls are twelve and twenty-two.  Carrie never<br/>\nattended school until after testing for her GED and<br/>\nACT.  Then she attended community college, and did<br/>\nquite well.  Phoenix spent three days in third grade. <br/>\n  I work full-time.  I take Phoenix to local<br/>\nactivities like park hikes guided by naturalists and a<br/>\nsign language class, things which are mostly free. <br/>\nThis year she started art classes at a nearby<br/>\nfoundation, which are not free.  We watch movies and<br/>\nnews together, discussing whatever comes up in the way<br/>\nof social issues, geography, history, use of language,<br/>\nand this often leads to research at the library, on<br/>\nthe internet, or in our own private library.  She is<br/>\naccustomed to accompanying me everywhere I go, and so<br/>\nshe has first-hand exposure to practical math as it<br/>\nrelates to shopping, banking, etc.  I habitually<br/>\nexplain everything I do, and prepare her for new<br/>\nsituations by explaining as much as I know can be<br/>\nexpected.  And I answer all questions.  While I&#39;m at<br/>\nwork Phoenix stays with her sister, who works third<br/>\nshift.  They go out shopping or siteseeing together,<br/>\nor watch movies, or use the computers.  Phoenix reads<br/>\na lot, and I often suggest books I have found<br/>\ninteresting or important.  Sometimes she snubs my<br/>\nsuggestions, but often rethinks later and asks for the<br/>\ntitle/author so she can locate the books.  She likes<br/>\nto bake, sew, crochet, and is learning to play chess. <br/>\nEach time a new interest sparks, I gather whatever<br/>\nmaterials she needs.  I don&#39;t care if she continues<br/>\nmore than a day with any particular hobby or subject,<br/>\nbecause she is learning something and experiencing<br/>\nsomething that will stay with her and lead her in new<br/>\ndirections.  When Carrie was fourteen I bought her a<br/>\nGED manual, which is about the size of a Sears<br/>\ncatalog.  I told her that if she wanted to be able to<br/>\ntake her GED test in a few years and attend college or<br/>\njust be able to show her diploma for job-search<br/>\npurposes, she would need to study that manual. Mostly<br/>\nshe watched tv, read, wrote to penpals (we didn&#39;t have<br/>\na computer then).  At sixteen she wanted to earn<br/>\nmoney, so I helped her find  work and learn her new<br/>\njobs (she telephoned during her breaks).  I taped the<br/>\nGED programs on public television.  She watched those<br/>\nand studied the manual, along with additional<br/>\nmaterials suggested.  For one year the three of us<br/>\nattended city council meetings,  where we learned a<br/>\nbit about the law, met local people, learned more<br/>\nabout the city and county, got to know local police<br/>\nand firefighters, and were even invited to attend the<br/>\ncity government&#39;s Christmas party.  We took a first<br/>\naid class with the firefighters.  I believe I am<br/>\nobligated to protect my children, and for me that<br/>\nincludes not sending them out into the world on their<br/>\nown.  Since I&#39;m not allowed to sit alongside them in<br/>\npublic school, then they don&#39;t need to attend.  Even<br/>\nworking next door to the school, I was not called when<br/>\nPhoenix was injured.  And the school would not allow a<br/>\nparent to forbid paddling.  Learning is a natural<br/>\nlifelong activity.  I see no reason to make it painful.<br/>\n<br/>\n=====<br/>\nDiana<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nSend your FREE holiday greetings online!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://greetings.yahoo.com\">http://greetings.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":29515,"nextTopicId":29636}}