{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"braunville@aol.com","from":"braunville@...","replyTo":"LIST","senderId":"uXzMvLqGjm1LOomrZ35EqvAcME0_pNWNh1qhD5xbxb4duZ_jUugW6vnU5oS35Urllf1lWpHPa6cT","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: only kids","postDate":"964283403","msgId":11469,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZiLjc1NjUxMDQuMjZhYjI2MGJAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":11468,"nextInTime":11470,"topicId":11469,"numMessagesInTopic":0,"msgSnippet":"Sorry...that last one sent without my asking it to!  This one has a response...scroll on down... In a message dated 7/22/2000 6:59:41 AM Pacific Daylight Time,","messageBody":"<div id=\"ygrps-yiv-696703601\">Sorry...that last one sent without my asking it to!  This one has a <br/>\nresponse...scroll on down...<br/>\n<br/>\nIn a message dated 7/22/2000 6:59:41 AM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:liv2learn@...\">liv2learn@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  (he spends a lot of time alone those days), and<br/>\n&gt;  days when other kids are just not available to play (harder when<br/>\n&gt;  homeschooling because I have to actively search for potential playmates and<br/>\n&gt;  arrange playdates around the schedules of others). I have found that,<br/>\n&gt;  because I have only one, people assume that I will be able to arrange<br/>\n&gt;  events and make accommodations because I &quot;have so much free time&quot; (not<br/>\n&gt;  necessarily true!). Although I have spent a lot of time being his main<br/>\n&gt;  playmate in the past, as he has gotten older, I am not as much fun for him<br/>\n&gt;  as kids his age it seems. Now he really asks for other kids to play with<br/>\n&gt;  and this is a challenge for me to find them.<br/>\n<br/>\n </span></blockquote>We have two onlies.   Honest!  10 years between kids leaves them each pretty <br/>\nmuch an only.  Sure it was a bit harder to encourage them to learn to play on <br/>\ntheir own and find activities to keep them busy.  OTOH, we learned how much <br/>\nfun it is to play with our child.  I love that part of it.  He has helped me <br/>\nremember it&#39;s not all work, work, work.  Life should include some play and <br/>\nfun!  (especially important to me as my health will not allow me to expend <br/>\nmuch energy on anything right now...it&#39;s nice to be able to &#39;legitimately&#39; <br/>\nplay with my boy.  heheheh)<br/>\n<br/>\nAs for helping find friends.  I just got out of the way and he finds his own! <br/>\n This little scamp brought home a playmate from the post office!  Actually, <br/>\nwe didn&#39;t either of us go to the other&#39;s home at first...you know how things <br/>\nare in big cities these days.  But, the boys would not leave each other until <br/>\nwe had made a play date.  Exchanged phone numbers while still at the post <br/>\noffice and met at a park a couple times before visiting each other at home.  <br/>\nTurned out to be just one example of a pretty good friendship.<br/>\n<br/>\nAlso, look outside the box!  For instance, assuming your kid is as nice as <br/>\nmine &lt;insertful prideful grin for which I&#39;ll probably burn forever (if I <br/>\nbelieved such things)&gt; nursing homes would probably LOVE visits.  It seems a <br/>\nlittle strange to do at first, but it makes such a difference in these <br/>\npeople&#39;s lives.  Especially if he&#39;s willing to take a game with him and offer <br/>\nto play checkers or something with someone there.  Don&#39;t know anyone at a <br/>\nnursing home?  Show up and ask them at the front desk or nursing station if <br/>\nthere is someone that needs a friend or tell them you&#39;d like to adopt a g&#39;ma <br/>\nor g&#39;pa.<br/>\n<br/>\nI sure agree about the assumption you have more time to make arrangements!  <br/>\nWe run into that, too.   Plus, my illnes is not so readily obvious to the <br/>\ncasual observer.  I don&#39;t like to inflict my pain on others, so most people <br/>\nthat meet and visit with me don&#39;t know that I&#39;m in almost constant pain and <br/>\nhave major fatigue.  Sometimes there is disappointment when I can&#39;t jump in <br/>\nand do more.  It looks like a matter of won&#39;t rather than can&#39;t.  Plus, I <br/>\ncan&#39;t even know for sure ahead of time that I can make any appointment I <br/>\nmight make...so no sense arranging something there&#39;s a good chance I can&#39;t <br/>\nattend when the time comes.  But, I suppose that&#39;s another story, too.  sorry <br/>\nfor rambling.<br/>\n<br/>\nOf course, savvy parent that you are, this is probably all old hat and I&#39;m <br/>\nrambling.  But &#39;only&#39;s can be such fun!  (of course, it&#39;s some jealousy <br/>\nenters in here...I would so much like to have had more kids or the <br/>\nopportunity to adopt.  But that&#39;s another story and I don&#39;t like sour grapes! <br/>\n So, when I decide we don&#39;t have enough kidlets around here, I borrow someone <br/>\nelses!  They are happy to come visit and mom gets a little break.)<br/>\n<br/>\nHave a good day,<br/>\nEiraul</div>","specialLinks":[]}],"prevTopicId":11462,"nextTopicId":11372}}