{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] telling, explaining, correcting (I am confused)","postDate":"1109029714","msgId":103855,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDIwMDUwMjIwMTE0MDQwLjg3MTkzLnFtYWlsQHdlYjUwMDAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":103769,"nextInTopic":0,"prevInTime":103854,"nextInTime":103856,"topicId":103758,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-3091325\">&lt;&lt;&lt;&lt;&lt;  I wouldn&#39;t of course ever say to my son &quot;-WRONG-,&quot; but is it better<br/>\nto let him persist with his own ideas about things, knowing he will<br/>\neventually get them straight?  Or should I help him when I see him having<br/>\nthe wrong ideas about things? &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThis is one of those &quot;it depends&quot; questions. I&#39;m glad you went on to give a<br/>\ncouple of examples. I have a lot of faith that Jayn will come to correct<br/>\nunderstanding about what we might call &quot;facts&quot; in her own time - through the<br/>\ndual processes of asking questions (needs my larger knowledge or ability to<br/>\nlook stuff up) and doing experiments (usually self generated and does *not*<br/>\nwant my help). My experience with her is that when I try to give some answer<br/>\nthat she has *not* requested the results are angry and forceful rejection of<br/>\nmy input or suggestions.<br/>\n <br/>\n&lt;&lt;&lt;&lt;  I need to give some concrete examples here.  I see him these days<br/>\nworking on concepts such as measurements and monetary values.  He is<br/>\nmeasuring all sorts of things w his measuring tape and a ruler that he<br/>\nsnaked from my sewing box.  I saw him measure a raisin and say &quot;It is 50<br/>\nmiles.&quot;  ETC.  I haven&#39;t corrected him on these measurements. &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nThis is the kind of instance where I would also refrain from impinging on<br/>\nJayn with my desire to assist her. This is almost like overhearing a private<br/>\nthought process. He is learning in his own way about the process of<br/>\nmeasuring. Jayn does very similar things.<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;   BUT I did teach a &quot;lesson&quot; on milage the other day.  He sits right<br/>\nin the middle back seat and is forever asking me what various lights, knobs,<br/>\nbuttons, gauges are in the car.  So when we got in the car I said &quot;Can you<br/>\nsee this little button right here?&quot; and showed him the trip odometer.  I<br/>\nasked if he wanted to see how far a mile from our driveway was.  And then we<br/>\nmeasured the milage to the library.   And then when he saw something on tv<br/>\nwhere someone said something was 5 feet and he said &quot;5 feet?  What has 5<br/>\nfeet?&quot;  I told him it was a measurement and got his ruler and -yes- told him<br/>\nthere are 12 inches in a foot, and then we measured out 5 feet.  Everytime I<br/>\ndo something like this I am so conscious of the fact that I am giving a<br/>\nlesson and feeling guilty like it isn&#39;t unschooling. (?)&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nIt only become an imposed &quot;lesson&quot; if his eyes have glazed over, or he is<br/>\nlooking out the window, or he has started to fidget and wiggle, or he starts<br/>\nsaying, &quot;don&#39;t TELL me!!&quot; or some similar rejecting phrase, and then you<br/>\npersist. <br/>\n<br/>\nIt sounds like he is very interested in real numbers and measurements. It<br/>\nsounds like you were ready to help him in exactly the way he wanted help at<br/>\nthe exact moment he was ready to receive the information, linked to his real<br/>\nlife (as against some hypothetical math book problem). Thank goodness for<br/>\nUnschooling that allows these special moments of magical timing to occur!<br/>\nAnd they keep on occurring. Wonderful.<br/>\n<br/>\n&lt;&lt;&lt;&lt;   One more example; I hope I am not making too long a post:  Like I<br/>\nsaid, he is definitely trying to figure out monetary values.  I know because<br/>\nhe is always asking me how much things cost.  He is upset that we cannot buy<br/>\na boat right now (I AM working on it) and keeps offering me the money in his<br/>\nbank (you know, what, $9) to buy one.  (In the meantime we are making boats<br/>\nto float in the river and like I said I am working HARD on acquiring one for<br/>\nus, but it isn&#39;t like cookies where I can just run right out and get him<br/>\none, but I digress from my point).  So the other night we were in the<br/>\ngrocery store and he was eating a doughnut.  He looked at me and said &quot;This<br/>\ncosts $100.&quot;  Should I have said &quot;You think so?&quot; or &quot;ummhmmm?&quot; ???  I<br/>\ndidn&#39;t; I gave a lesson.  I said &quot;No, baby, $100 will buy all the food in<br/>\nour cart.  Doughnuts are .50, which means you can get 2 doughnuts for one<br/>\ndollar.&quot;  <br/>\n  So the question, again, is, should I NOT correct him and let him figure it<br/>\nall out on his own?  Do I need to shut up and continue deschooling, or are<br/>\nthese types of &quot;lessons&quot; okay? &gt;&gt;&gt;&gt;<br/>\n<br/>\nI don&#39;t think he was really making a statement with the donut cost - it<br/>\nsounds more like a question disguised - one of the experiments - offering up<br/>\na theory about the dollar value of donuts and then getting a better picture.<br/>\nBTW what I do with Jayn, to help her see the relative costs of things is<br/>\nrelate prices to familiar objects - eg &quot;this would cost the same as 10<br/>\nBarbies&quot;. <br/>\n<br/>\nOnly &quot;shut up&quot; if it is clear that he has stopped listening by whatever cues<br/>\nhe gives. But certainly continue deschooling.<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.300 / Virus Database: 266.2.0 - Release Date: 2/21/2005</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] telling, explaining, correcting (I am confused)","postDate":"1108922391","msgId":103769,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMy41YjgwYmRjZS4yZjRhMmExN0Bhb2wuY29tPg=="},"prevInTopic":103766,"nextInTopic":103855,"prevInTime":103768,"nextInTime":103770,"topicId":103758,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/20/05 10:02:23 AM, b229d655@cs.com writes: ","messageBody":"<div id=\"ygrps-yiv-740085829\">In a message dated 2/20/05 10:02:23 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:b229d655@...\">b229d655@...</a> writes:<br/>\n<br/>\n&lt;&lt; My son wanted to count all of his piggy bank money just yesterday and we <br/>\nopened it up and he started picking out what he knew, we went over a few <br/>\nbasics, <br/>\nlike 100 pennies in every dollar.  He started to get a little &quot;far away&quot; and <br/>\nI <br/>\nasked him if I was making it boring and he said, &quot;I just don&#39;t get it all <br/>\nyet.&quot;  So we stopped, I am still very schoolie, he isn&#39;t.  He counted what he <br/>\nknew, I counted the rest and he was happy.  &gt;&gt;<br/>\n<br/>\nWhen my kids were at that point, we went with &quot;ten pennies make a dime&quot; and I <br/>\nwould buy their piles of pennies with dimes.  Or the other way around, if the <br/>\nkid was into quantity. &lt;g&gt;  It&#39;s not so esoteric or theoretical when you&#39;re <br/>\nexchanging the coins instead of just naming numbers like &quot;60 cents.&quot;<br/>\n<br/>\n-=-That&#39;s what a personal assistant does-if they need something, you get it <br/>\nor help <br/>\nthem find it.-=-<br/>\n<br/>\nRight!  And if they&#39;re mispronouncing the client&#39;s name, the personal <br/>\nassistant might point that out, and if they think a donut costs $100 the personal <br/>\nassistant might gently say, &quot;No, two for a dollar, remember?&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] telling, explaining, correcting (I am confused)","postDate":"1108921553","msgId":103766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdkLjYzNmE1NWI2LjJmNGEyNmQxQGFvbC5jb20+"},"prevInTopic":103760,"nextInTopic":103769,"prevInTime":103765,"nextInTime":103767,"topicId":103758,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/20/05 9:40:12 AM, willsmamamillie@yahoo.com writes: ","messageBody":"<div id=\"ygrps-yiv-2072649400\">In a message dated 2/20/05 9:40:12 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:willsmamamillie@...\">willsmamamillie@...</a> writes:<br/>\n<br/>\n&lt;&lt;  I have seen some folks (RU folks online) say some things that have made <br/>\nme think it is uncool to correct kids&#39; fallacious ideologies or thinking...am I <br/>\nunderstanding correctly...is that true?  &gt;&gt;<br/>\n<br/>\nWould you correct a grown friend, or your husband?<br/>\nAnd if so, in what tone of voice?<br/>\n<br/>\nThat&#39;s one tool to use to help you decide.  <br/>\n<br/>\nIf it&#39;s something harmless they they&#39;ll easily figure out later, or that <br/>\nwon&#39;t hurt anything, I&#39;d let it go.  Do dead pets go to heaven?  If they think so <br/>\nand you don&#39;t, why argue at that point?   Will dressing up in a Superman <br/>\noutfit (or at least pinning a towel on with a diaper pin) enable one to jump off <br/>\nthe roof and fly?  That one I would discuss RIGHT AWAY, and not leave to <br/>\ndiscovery.  Maybe they could try it off a coffee table onto some pillows, and maybe <br/>\nyou could gently suggest that if it DID work, towels would be way more <br/>\nexpensive than they are, and lots of people would be flying around the neighborhood.<br/>\n<br/>\n-=- I also don&#39;t like the terms facilitator or guide....I see my role as <br/>\ncloser to personal assistant.  BUT I am finding myself giving &quot;lessons.&quot;-=-<br/>\n<br/>\nTalking about things and showing a kid how a tape measure works isn&#39;t &quot;a <br/>\nlesson.&quot;<br/>\n<br/>\n-=- I saw him measure a raisin and say &quot;It is 50 miles.&quot;  ETC.  I haven&#39;t <br/>\ncorrected him on these measurements.  -=-<br/>\n<br/>\nHe&#39;s playing around with words.  If it really mattered about the raisin, or <br/>\nabout a mile, then he would really care, but he doesn&#39;t yet.<br/>\n<br/>\n-=- I told him it was a measurement and got his ruler and -yes- told him <br/>\nthere are 12 inches in a foot, and then we measured out 5 feet.  Everytime I do <br/>\nsomething like this I am so conscious of the fact that I am giving a lesson and <br/>\nfeeling guilty like it isn&#39;t unschooling. -=-<br/>\n<br/>\nYou were answering his question when he asked.  That&#39;s not &quot;a lesson.&quot;  A <br/>\nlesson&#39;s when you initiate a session in measurement because of his age or the <br/>\ntime of year or because  of some arbitrary reason.  <br/>\n<br/>\nIf you went to another country and asked for a review of how the money <br/>\nworked, if someone pulled all the change and bills out of their pocket and started <br/>\nshowing you, would you think you were getting a lesson, or gathering important <br/>\ninformation from a knowledgeable source?   When we were in England we not only <br/>\nneeded to know what the real names for the money was, but what the slang <br/>\nwords were.  Same for people coming here.  They need to know which one&#39;s five <br/>\ncents, and ten, but they also need to know which one&#39;s &quot;a dime.&quot;<br/>\n<br/>\n-=- So the question, again, is, should I NOT correct him and let him figure <br/>\nit all out on his own? -=-<br/>\n<br/>\nIt depends.<br/>\n<br/>\nThere&#39;s no one-size-fits-all-situations answer on that.<br/>\n<br/>\nThe principle is to help him without embarrassing him or frustrating him, so <br/>\ntake each situation on its own merits and realities and don&#39;t make a rule to <br/>\nfollow.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":172750465,"authorName":"b229d655@cs.com","from":"b229d655@...","profile":"robeyboyz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] telling, explaining, correcting (I am confused)","postDate":"1108918848","msgId":103760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5ZS4yZTcyZjY1Zi4yZjRhMWM0MEBjcy5jb20+"},"prevInTopic":103758,"nextInTopic":103766,"prevInTime":103759,"nextInTime":103761,"topicId":103758,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/20/2005 11:39:28 AM Eastern Standard Time, ... Is he ok with these lessons , is his attention held?  If so, then you are giving him what","messageBody":"<div id=\"ygrps-yiv-2078265636\">In a message dated 2/20/2005 11:39:28 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:willsmamamillie@...\">willsmamamillie@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; And then when he saw something on tv where someone said something was 5 <br/>\n&gt; feet and he said &quot;5 feet?  What has 5 feet?&quot;  I told him it was a measurement <br/>\n&gt; and got his ruler and -yes- told him there are 12 inches in a foot, and then we <br/>\n&gt; measured out 5 feet.  Everytime I do something like this I am so conscious <br/>\n&gt; of the fact that I am giving a lesson and feeling guilty like it isn&#39;t <br/>\n&gt; unschooling. (?)<br/>\n<br/>\n </span></blockquote>Is he ok with these &quot;lessons&quot;, is his attention held?  If so, then you are <br/>\ngiving him what he wants.  If not, you may be taking it farther than he needs at <br/>\nthat point.<br/>\n<br/>\nHe asked a question.  You gave him an answer.  Not really a &quot;lesson&quot;.  Unless <br/>\nyou sat him down and said, &quot;ok, I guess you are ready to learn about <br/>\nmeasuring and we will have a lesson and drag it out in endless streams of info.&quot;  Or <br/>\nsomething like that.  You are providing him answers to his questions, that&#39;s <br/>\nall.  If you don&#39;t, who will?  If you feel like you are &quot;teaching&quot; too much, <br/>\nthen give him access to a computer or whatever and let him find what he needs to <br/>\nknow.  <br/>\n<br/>\nMy son wanted to count all of his piggy bank money just yesterday and we <br/>\nopened it up and he started picking out what he knew, we went over a few basics, <br/>\nlike 100 pennies in every dollar.  He started to get a little &quot;far away&quot; and I <br/>\nasked him if I was making it boring and he said, &quot;I just don&#39;t get it all <br/>\nyet.&quot;  So we stopped, I am still very schoolie, he isn&#39;t.  He counted what he <br/>\nknew, I counted the rest and he was happy. <br/>\n<br/>\nFrom your post, I don&#39;t see you being overly teacher-like.  But you are <br/>\nprobably his main source for info., so when questions, ideas, or interests come up <br/>\nyou may feel like your teaching but you are exposing him to the answers or <br/>\nplaces/resources to get the info. he needs.  If you never did any of that, how <br/>\nwould he learn at all?  They are natural learners but they need help too.  <br/>\nThat&#39;s what a personal assistant does-if they need something, you get it or help <br/>\nthem find it.<br/>\n<br/>\nPamela<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":184426691,"authorName":"Millie Rosa","from":"Millie Rosa &lt;willsmamamillie@...&gt;","profile":"willsmamamillie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"telling, explaining, correcting (I am confused)","postDate":"1108899640","msgId":103758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMjIwMTE0MDQwLjg3MTkzLnFtYWlsQHdlYjUwMDAzLm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":103760,"prevInTime":103757,"nextInTime":103759,"topicId":103758,"numMessagesInTopic":0,"msgSnippet":"(Sorry about the blank post before) Okay, please help my understanding.  I have seen some folks (RU folks online) say some things that have made me think it is","messageBody":"<div id=\"ygrps-yiv-2111032630\">(Sorry about the blank post before)<br/>\n <br/>\n   Okay, please help my understanding.  I have seen some folks (RU folks online) say some things that have made me think it is uncool to correct kids&#39; fallacious ideologies or thinking...am I understanding correctly...is that true? <br/>\n  I wouldn&#39;t of course ever say to my son &quot;-WRONG-,&quot; but is it better to let him persist with his own ideas about things, knowing he will eventually get them straight?  Or should I help him when I see him having the wrong ideas about things?  <br/>\n   I know I am not his teacher.  I also don&#39;t like the terms facilitator or guide....I see my role as closer to personal assistant.  BUT I am finding myself giving &quot;lessons.&quot;<br/>\n  I need to give some concrete examples here.  I see him these days working on concepts such as measurements and monetary values.  He is measuring all sorts of things w his measuring tape and a ruler that he snaked from my sewing box.  I saw him measure a raisin and say &quot;It is 50 miles.&quot;  ETC.  I haven&#39;t corrected him on these measurements.  He asks me what I am doing when he comes to my table, though, and I always tell him &quot;I am measuring this fabric into 4 inch strips (or 5 inch squares, etc).  <br/>\n   BUT I did teach a &quot;lesson&quot; on milage the other day.  He sits right in the middle back seat and is forever asking me what various lights, knobs, buttons, gauges are in the car.  So when we got in the car I said &quot;Can you see this little button right here?&quot; and showed him the trip odometer.  I asked if he wanted to see how far a mile from our driveway was.  And then we measured the milage to the library.   And then when he saw something on tv where someone said something was 5 feet and he said &quot;5 feet?  What has 5 feet?&quot;  I told him it was a measurement and got his ruler and -yes- told him there are 12 inches in a foot, and then we measured out 5 feet.  Everytime I do something like this I am so conscious of the fact that I am giving a lesson and feeling guilty like it isn&#39;t unschooling. (?)<br/>\n   One more example; I hope I am not making too long a post:  Like I said, he is definitely trying to figure out monetary values.  I know because he is always asking me how much things cost.  He is upset that we cannot buy a boat right now (I AM working on it) and keeps offering me the money in his bank (you know, what, $9) to buy one.  (In the meantime we are making boats to float in the river and like I said I am working HARD on acquiring one for us, but it isn&#39;t like cookies where I can just run right out and get him one, but I digress from my point).  So the other night we were in the grocery store and he was eating a doughnut.  He looked at me and said &quot;This costs $100.&quot;  Should I have said &quot;You think so?&quot; or &quot;ummhmmm?&quot; ???  I didn&#39;t; I gave a lesson.  I said &quot;No, baby, $100 will buy all the food in our cart.  Doughnuts are .50, which means you can get 2 doughnuts for one dollar.&quot;  <br/>\n  So the question, again, is, should I NOT correct him and let him figure it all out on his own?  Do I need to shut up and continue deschooling, or are these types of &quot;lessons&quot; okay?  <br/>\n <br/>\nThanks for the help,<br/>\nMillie<br/>\nby the riverside<br/>\n <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Yahoo! Search presents - Jib Jab&#39;s &#39;Second Term&#39;<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":103852,"nextTopicId":103867}}