{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Sonia Ulan","from":"Sonia Ulan &lt;sulan@...&gt;","replyTo":"LIST","senderId":"XuZhKeZVIxFUjPx8AlqNshQVZiy_SuRezDVRmscts9-MSEymtvcFOlqbrN_3yfIrJV9Z8Cd4jPipoXz8nErKWWO0","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] alternatives to punishment, time-out,  principles of aware parenting (quite long)","postDate":"967928372","msgId":12462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5QjE2QTM0LkFCMDg5MUU0QGhvbWUuY29tPg==","referencesHeader":"PDAwMWMwMWMwMTRkYiQ4ZGJjNWZlMCQwYjc3OWE4ZUBmbWFubnM+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":12461,"nextInTime":12463,"topicId":12462,"numMessagesInTopic":0,"msgSnippet":"Well said Nicoletta!!!  And thanks for the reminder/tips on alternatives to spanking. Sonia","messageBody":"<div id=\"ygrps-yiv-706985771\">Well said Nicoletta!!!  And thanks for the reminder/tips on alternatives<br/>\nto spanking.<br/>\n<br/>\n<br/>\nSonia<br/>\n<br/>\n<br/>\n<br/>\nShannon Nicoletta Manns wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; <br/>\n&gt; Corallyn and all,<br/>\n&gt; <br/>\n&gt; Please, please, please read Aletha Solter&#39;s work of &#39;Aware Parenting&#39;.  Her<br/>\n&gt; web site is www.awareparenting.com.<br/>\n&gt; Personally I cringe every time someone talks about how they think there is a<br/>\n&gt; place for spanking.<br/>\n&gt; <br/>\n&gt; Following are some samples of Aletha&#39;s work. I am sorry, if this is too long<br/>\n&gt; for some of you, but I feel so passionate about this. I just can&#39;t help<br/>\n&gt; myself; I have to get this information out there.<br/>\n&gt; <br/>\n&gt; Please don&#39;t hit children! I may be overstepping some boundaries here, but I<br/>\n&gt; happen to believe that all children are all adults&#39; responsibility, not just<br/>\n&gt; the parents&#39;; now more so than ever, because since the decline of villages<br/>\n&gt; and the extended family, couples are pretty much raising children in<br/>\n&gt; isolation, even if they have some sort of &quot;village&quot; around them. I believe<br/>\n&gt; one of the purposes for having a village for raising a child is to prevent<br/>\n&gt; abuse, such as spanking, by giving parents the option for taking a break<br/>\n&gt; when things get too intense and overwhelming.<br/>\n&gt; <br/>\n&gt; That&#39;s just me and my personal opinion. Take it or leave it.<br/>\n&gt; Nicoletta<br/>\n&gt; <br/>\n&gt; TWENTY ALTERNATIVES TO PUNISHMENT<br/>\n&gt; <br/>\n&gt; 1. LOOK FOR UNDERLYING NEEDS. ex: Give your child something to play with<br/>\n&gt; while waiting in line.<br/>\n&gt; <br/>\n&gt; 2. GIVE INFORMATION & REASONS. ex: If your child colours on the wall,<br/>\n&gt; explain why we colour on paper only.<br/>\n&gt; <br/>\n&gt; 3. LOOK FOR UNDERLYING FEELINGS. Acknowledge, accept & listen to feelings.<br/>\n&gt; ex: If your child hits his baby sister, encourage him to express his anger<br/>\n&gt; and jealousy in harmless ways.<br/>\n&gt; <br/>\n&gt; 4. CHANGE THE ENVIRONMENT. This is sometimes easier than trying to change<br/>\n&gt; the child. ex: If your child repeatedly takes things out of the kitchen<br/>\n&gt; cupboards, put a childproof lock on them.<br/>\n&gt; <br/>\n&gt; 5. FIND ACCEPTABLE ALTERNATIVES, and redirect your child&#39;s behaviour. ex: If<br/>\n&gt; you do not want your child to build a fort in the dining room, don&#39;t just<br/>\n&gt; say no. Tell her where she can build one.<br/>\n&gt; <br/>\n&gt; 6. DEMONSTRATE HOW YOU WANT YOUR CHILD TO BEHAVE. ex. If your child pulls a<br/>\n&gt; cat&#39;s tail, show her how to pet a cat. Do not rely on words alone.<br/>\n&gt; <br/>\n&gt; 7. GIVE CHOICES RATHER THAN COMMANDS. Decision-making empowers children;<br/>\n&gt; commands invite a power struggle. ex: &#39;Would you like to brush your teeth<br/>\n&gt; before or after putting your pyjamas on?&quot;<br/>\n&gt; <br/>\n&gt; 8. MAKE SMALL CONCESSIONS. ex: &quot;I&#39;ll let you skip brushing your teeth<br/>\n&gt; tonight because you are so tired.&#39;<br/>\n&gt; <br/>\n&gt; 9. PROVIDE FOR A PERIOD OF PREPARATION. ex: If you are counting on company<br/>\n&gt; for dinner, tell your child how you expect him to behave. Be specific.<br/>\n&gt; Role-playing can help prepare children for potentially difficult situations.<br/>\n&gt; <br/>\n&gt; 10. LET NATURAL CONSEQUENCES OCCUR (when appropriate). Don&#39;t rescue too<br/>\n&gt; much. ex: A child who does not hang up her bathing suit and towel may find<br/>\n&gt; them still wet the next day.<br/>\n&gt; <br/>\n&gt; 11. USE ACTIONS WHEN NECESSARY. If your child insists on running across<br/>\n&gt; streets on your walks together, hold his hand tightly (while explaining the<br/>\n&gt; dangers).<br/>\n&gt; <br/>\n&gt; 12. GIVE &#39;I-MESSAGES&#39;. ex: &quot;I get so tired of cleaning up crumbs in the<br/>\n&gt; living room.&#39;<br/>\n&gt; <br/>\n&gt; 13. HOLD YOUR CHILD. This expression of love enables children who are acting<br/>\n&gt; aggressively or obnoxiously to channel their pent-up feelings into healing<br/>\n&gt; tears.<br/>\n&gt; <br/>\n&gt; 14. REMOVE YOUR CHILD FROM THE SITUATION, AND STAY WITH HER until she is<br/>\n&gt; ready to act appropriately. Use the time for listening, sharing feelings,<br/>\n&gt; and moving toward conflict- resolution.<br/>\n&gt; <br/>\n&gt; 15. BE PLAYFUL. Turn the situation into a game. ex: &#39;Let&#39;s pretend we&#39;re the<br/>\n&gt; seven dwarfs while we clean up.&#39;<br/>\n&gt; <br/>\n&gt; 16. DO IT TOGETHER. ex: If your child refuses to take a bath, offer to take<br/>\n&gt; one with her.<br/>\n&gt; <br/>\n&gt; 17. MAKE A DEAL, NEGOTIATE. ex: If you&#39;re ready to leave the playground and<br/>\n&gt; your child is having fun, reach an agreement on the number of times she may<br/>\n&gt; go down the slide before leaving.<br/>\n&gt; <br/>\n&gt; 18. DEFUSE THE SITUATION WITH LAUGHTER. ex: If your child is mad at you,<br/>\n&gt; invite him to express his anger in a playful pillow fight with you. Play<br/>\n&gt; your part by surrendering dramatically. Laughter helps resolve anger and<br/>\n&gt; feelings of powerlessness.<br/>\n&gt; <br/>\n&gt; 19. REVISE YOUR EXPECTATIONS. Young children are naturally loud, curious,<br/>\n&gt; messy, wilful, impatient, demanding, forgetful, fearful, self-centred, and<br/>\n&gt; full of energy. Try to accept them as they are.<br/>\n&gt; <br/>\n&gt; 20. TAKE A PARENTAL TIME-OUT. Leave the room, and do whatever is needed to<br/>\n&gt; regain your sense of composure and good judgement (ex: cry, call a friend,<br/>\n&gt; meditate, take a shower, ad a poem).<br/>\n&gt; <br/>\n&gt; 1992 by Aletha Solter. Reprinted with permission from Modum* magazine, Vol.<br/>\n&gt; 65, 1992 (with minor changes)<br/>\n&gt; <br/>\n&gt; The Disadvantages of Time-Out<br/>\n&gt; by<br/>\n&gt; Aletha Solter, Ph.D.<br/>\n&gt; For more information about alternatives to time-out, please see Aletha<br/>\n&gt; Solter&#39;s books:The Aware Baby, Helping Young Children Flourish, and Tears<br/>\n&gt; and Tantrums<br/>\n&gt; Copyright © 1992, 2000 by Aletha Solter. No part of this article may be<br/>\n&gt; reproduced, electronically or mechanically, without written permission from<br/>\n&gt; the author. This article was originally published in Mothering magazine in<br/>\n&gt; the Fall issue of 1992. It was revised and updated in 2000.<br/>\n&gt; As concerned parents and educators have become aware of the dangers of<br/>\n&gt; physical punishment, time-out has emerged as a popular disciplinary tool.<br/>\n&gt; Misbehaving children are told to sit quietly on a chair or go to their rooms<br/>\n&gt; to calm down and think about what they did. After a period of time, they are<br/>\n&gt; allowed to come back to the group or join the family, provided that they act<br/>\n&gt; &quot;appropriately.&quot; The designated period of time is usually one minute per<br/>\n&gt; year of age, and children who leave the chair or room before their time is<br/>\n&gt; up are told to return for the full allotment once again. Some books<br/>\n&gt; recommend an added rule of silence, and suggest that the timing be repeated<br/>\n&gt; if the silence is broken. In either case, parents who use this method are<br/>\n&gt; promised quick and easy results.<br/>\n&gt; Time-out stems from the behaviorist movement based on the work of<br/>\n&gt; psychologist B.F. Skinner. His theory of operant conditioning asserts that<br/>\n&gt; children will behave in certain ways if they receive rewards for doing so<br/>\n&gt; (&quot;positive reinforcement&quot;), and that undesirable behavior can be diminished<br/>\n&gt; by withholding the rewards or by invoking pain (both of which are termed<br/>\n&gt; &quot;punishment&quot;). Skinner himself believed that all forms of punishment were<br/>\n&gt; unsuitable means of controlling children&#39;s behavior [1]. Even so, while<br/>\n&gt; spanking is on the wane in the United States, the withholding of love and<br/>\n&gt; attention has persisted as an acceptable means of control.<br/>\n&gt; Beneath the Surface<br/>\n&gt; Using time-out appears less injurious than hitting, spanking, or yelling,<br/>\n&gt; because it does not involve physical or verbal abuse. It is therefore<br/>\n&gt; thought to represent some degree of progress in our continual striving to<br/>\n&gt; make this world a better place for children. According to many educators and<br/>\n&gt; psychologists, however, time-out is not as innocent as it seems and is,<br/>\n&gt; moreover, an emotionally harmful way to discipline children. In fact, the<br/>\n&gt; National Association for the Education of Young Children includes the use of<br/>\n&gt; time-out in a list of harmful disciplinary measures, along with physical<br/>\n&gt; punishment, criticizing, blaming, and shaming [2].<br/>\n&gt; Beneath the surface, time-out is an authoritarian approach and, as such, can<br/>\n&gt; work only among children trained to comply with the power and authority of<br/>\n&gt; adults. Children trained to conform to such measures know that the<br/>\n&gt; consequences of disobeying are worse than adhering to the injunctions.<br/>\n&gt; Children who have not been brought up in an authoritarian environment will<br/>\n&gt; most likely refuse to go to another room or sit in a chair.<br/>\n&gt; How does a child learn about the consequences of disobedience? Proponents of<br/>\n&gt; time-out advise parents to remove all privileges such as TV, toys, music,<br/>\n&gt; and so forth until compliance has been achieved. Always there is the threat<br/>\n&gt; of deprivation or further penalty. In some families there may even be an<br/>\n&gt; unspoken threat of violence. Although the method seems innocent enough, it<br/>\n&gt; requires a past history of punitive authoritarianism to produce children<br/>\n&gt; docile enough to obey.<br/>\n&gt; Proponents claim that time-out is not a form of punishment. They use terms<br/>\n&gt; such as &quot;consequence,&quot; &quot;renewal time,&quot; or &quot;down time&quot; to make the approach<br/>\n&gt; sound benign. The term &quot;time-out&quot; itself has pleasant connotations of a<br/>\n&gt; sports team taking a well-deserved break. Regrettably, this non-threatening<br/>\n&gt; terminology has deluded parents into thinking that the approach is harmless.<br/>\n&gt; &gt;From a child&#39;s point of view, time-out is definitely experienced as<br/>\n&gt; punishment. Who wants to be isolated from the group and totally ignored? It<br/>\n&gt; is quite likely that children view this form of isolation as abandonment and<br/>\n&gt; loss of love. And while parents are often careful to provide reassurances of<br/>\n&gt; their love and to distinguish between the child and the unruly behavior (&quot;I<br/>\n&gt; love you, but you need to go to your room for five minutes because what you<br/>\n&gt; did is not acceptable&quot;), their actions speak much louder than their words.<br/>\n&gt; Children under the age of seven simply do not have the capability to process<br/>\n&gt; words in the same way that adults do [3]. Concrete experience and<br/>\n&gt; perceptions of reality impact more strongly than language. Being isolated<br/>\n&gt; and ignored is interpreted as &quot;Nobody wants to be with me right now.<br/>\n&gt; Therefore I must be bad and unlovable,&quot; and no loving words, however well<br/>\n&gt; intended, can override this feeling of rejection.<br/>\n&gt; Nothing is more frightening for a child than the withdrawal of love. Along<br/>\n&gt; with the fear come insecurity, anxiety, confusion, anger, resentment, and<br/>\n&gt; low self-esteem. Time-out can also cause embarrassment and humiliation,<br/>\n&gt; especially when used in the presence of other children. In the child&#39;s realm<br/>\n&gt; of experience, time-out is nothing short of punitive.<br/>\n&gt; Painful feelings are one consideration; the information conveyed about human<br/>\n&gt; relationships is another. What message are we giving our children in<br/>\n&gt; demonstrating that love and attention are commodities to be doled out or<br/>\n&gt; withheld for purposes of controlling others? Is this a conflict-resolution<br/>\n&gt; skill that will be useful to them? How will it influence their ability to<br/>\n&gt; interact with friends, and some day with a spouse and coworkers? Wouldn&#39;t it<br/>\n&gt; be better to teach children useful conflict-resolution skills right from the<br/>\n&gt; start, rather than convey the message that the only way to solve conflicts<br/>\n&gt; is to cut off communication?<br/>\n&gt; Although the trouble with time-out is in large part invisible, one aspect is<br/>\n&gt; glaringly obvious: at some point it stops working. Proponents of the<br/>\n&gt; approach admit that it is effective only up until the age of about nine. Can<br/>\n&gt; you imagine telling your teenager, who may be taller than you, to sit in a<br/>\n&gt; chair while you ignore him? Teens who have any sense of their own self-worth<br/>\n&gt; will laugh at such a command. The adolescent version of time-out is the<br/>\n&gt; practice of &quot;grounding&quot; teenagers by not allowing them to go out on the<br/>\n&gt; weekends or in the evenings. But this method only leads to resentment,<br/>\n&gt; resistance, and sometimes even lying.<br/>\n&gt; Indeed, any method based on power and authoritarianism must eventually be<br/>\n&gt; abandoned, simply because parents run out of power [4]. Parents of teens<br/>\n&gt; face an entirely new set of difficulties when their tried-and-true methods<br/>\n&gt; of control prove utterly ineffective. Parents who adopt non-authoritarian<br/>\n&gt; methods right from the start, on the other hand, are able to prevent the<br/>\n&gt; power struggles, as well as the discipline problems, that so often come with<br/>\n&gt; adolescence.<br/>\n&gt; Hidden Consequences<br/>\n&gt; The use of time-out leads to a host of hidden problems. For one, when we<br/>\n&gt; enforce a time-out for children who are crying or raging, they get the<br/>\n&gt; message that we do not want to be around them when they are upset. Certain<br/>\n&gt; that we will not listen, they may soon stop bringing their problems to us.<br/>\n&gt; Furthermore, such children may learn to suppress their feelings, especially<br/>\n&gt; if we insist on time-out in silence. Have we forgotten that crying and<br/>\n&gt; raging are healthy tension-release mechanisms that help relieve sadness and<br/>\n&gt; frustration? [5,6,7] Have we ignored the research showing that stress<br/>\n&gt; hormones are excreted through tears, thereby possibly reducing the effects<br/>\n&gt; of stress and restoring the body&#39;s chemical balance? [8]. In teaching our<br/>\n&gt; children to suppress their tears, we may actually be increasing their<br/>\n&gt; susceptibility to a variety of emotional and physical imbalances. Swiss<br/>\n&gt; psychotherapist Dr. Alice Miller states that one of the most devastating<br/>\n&gt; things we do to children is deny them the freedom to express their anger and<br/>\n&gt; suffering [9].<br/>\n&gt; An additional problem is that the use of time-out does not address the<br/>\n&gt; underlying cause of the &quot;inappropriate behavior.&quot; Children act in specific<br/>\n&gt; ways for good reasons, even though the youngsters themselves may not be<br/>\n&gt; aware of them. Most undesirable behavior can be explained by one of three<br/>\n&gt; factors: the child is attempting to fulfill a legitimate need, the child<br/>\n&gt; lacks information or is too young to understand, or the child is feeling<br/>\n&gt; upset (frustrated, sad, scared, confused, jealous, or insecure) [10]. When<br/>\n&gt; we try to change a behavior without addressing these feelings and needs, we<br/>\n&gt; do not help our children very much at all. Why? Because the underlying<br/>\n&gt; problem will still be there. Teaching children to conform to our wishes does<br/>\n&gt; not resolve the deeper issues.<br/>\n&gt; For example, siblings who are repeatedly separated and sent to their rooms<br/>\n&gt; when they fight may eventually learn to stop fighting in front of their<br/>\n&gt; parents. Their unresolved feelings of jealousy and hatred, however, may come<br/>\n&gt; to expression in more devious ways, or they may carry their resentments into<br/>\n&gt; adulthood. Curtailing the symptoms of a problem does not solve the problem.<br/>\n&gt; Parents have been led to believe that children will use time-out to think<br/>\n&gt; about what they did and regain some modicum of self-control. In reality,<br/>\n&gt; when children act in inappropriate, aggressive, or obnoxious ways, they are<br/>\n&gt; often harboring such strong pent-up feelings that they are unable to think<br/>\n&gt; clearly about their actions. Far more helpful than isolation is an attentive<br/>\n&gt; listener who can encourage the expression of honest feelings. The healthy<br/>\n&gt; release provided by talking, crying, or raging may even prevent the<br/>\n&gt; recurrence of unwanted behavior.<br/>\n&gt; Holding children who hit or bite is much more effective than isolating them.<br/>\n&gt; Firm but loving holding creates safety and warmth while protecting other<br/>\n&gt; children from getting hurt. It also invites the expression of genuine<br/>\n&gt; feelings (through crying and raging) while reassuring the child of the<br/>\n&gt; indestructible parent-child bond. [10]. It is paradoxical, yet true:<br/>\n&gt; children are most in need of loving attention when they act least deserving<br/>\n&gt; of it. Telling a violent child to sit quietly rarely accomplishes anything<br/>\n&gt; constructive and only further contributes to the child&#39;s pent-up anger and<br/>\n&gt; feelings of alienation.<br/>\n&gt; It is not necessary to isolate children and withdraw our love to teach them<br/>\n&gt; how to &quot;behave&quot;. In fact, it is entirely possible to help children learn to<br/>\n&gt; be cooperative and decent members of society without ever issuing<br/>\n&gt; punishments, rewards, or artificial consequences of any kind. No quick and<br/>\n&gt; easy method will solve every conflict. Instead, we need to treat each<br/>\n&gt; situation as the unique challenge that it is, and try to be flexible and<br/>\n&gt; creative, all the while giving our children the love and respect they<br/>\n&gt; deserve.<br/>\n&gt; Notes<br/>\n&gt; 1. Robert D. Nye, &quot;B.F. Skinner and Radical Behaviorism,&quot; Three Views of Man<br/>\n&gt; (Belmont, CA: Wadsworth Publishing Company, Inc., 1975), p. 51<br/>\n&gt; 2. &quot;Avoiding &#39;Me Against You&#39; Discipline,&quot; Young Children, Vol. 44, No. 1.<br/>\n&gt; (Washington DC: National Association for the Education of Young Children,<br/>\n&gt; November 1988), p. 27.<br/>\n&gt; 3. Jerome S. Bruner, &quot;The Course of Cognitive Growth,&quot; American Psychologist<br/>\n&gt; 19 (1964), pp. 1-15.<br/>\n&gt; 4. Thomas Gordon, Parent Effectiveness Training (New American Library,<br/>\n&gt; 1975), pp. 170-171.<br/>\n&gt; 5. Aletha J. Solter, The Aware Baby (Goleta, CA: Shining Star Press, 1984),<br/>\n&gt; pp. 40-41.<br/>\n&gt; 6. Aletha J. Solter, Helping Young Children Flourish (Goleta, CA: Shining<br/>\n&gt; Star Press, 1989), pp. 5-9.<br/>\n&gt; 7. Aletha J. Solter, Tears and Tantrums (Goleta, CA: Shining Star Press,<br/>\n&gt; 1998), pp. 13-32.<br/>\n&gt; 8. William H. Frey II, & Muriel Langseth, Crying: the Mystery of Tears<br/>\n&gt; (Minneapolis: Winston Press, 1985), pp. 45-58.<br/>\n&gt; 9. Alice Miller, For Your Own Good: Hidden Cruelty in Child-Rearing and the<br/>\n&gt; Roots of Violence, (New York: Farrar, Straus, Giroux), pp. 106, 259.<br/>\n&gt; 10. Martha G. Welch, Holding Time (New York: Simon & Schuster, Inc., 1988),<br/>\n&gt; pp. 42-43<br/>\n&gt; <br/>\n&gt; PRINCIPLES OF AWARE PARENTING<br/>\n&gt; by Aletha Solter, Ph.D.<br/>\n&gt; <br/>\n&gt; 1. Aware parents fill their children&#39;s needs for physical contact (holding,<br/>\n&gt; cuddling, etc.). They do not worry about &quot;spoiling&#39; their children.<br/>\n&gt; <br/>\n&gt; 2. Aware parents accept the entire range of emotions and listen<br/>\n&gt; non-judgmentally to children&#39;s expressions of feelings. They realize that<br/>\n&gt; they cannot prevent all sadness, anger, or frustration, and they do not<br/>\n&gt; attempt to stop children from releasing painful feelings through crying or<br/>\n&gt; raging.<br/>\n&gt; <br/>\n&gt; 3. Aware parents offer age-appropriate stimulation, and trust children to<br/>\n&gt; learn at their own rate and in their own way. They do not try to hurry<br/>\n&gt; children on to new stages of development.<br/>\n&gt; <br/>\n&gt; 4. Aware parents offer encouragement for learning new skills, but do not<br/>\n&gt; judge children&#39;s performance with either criticism or evaluative praise.<br/>\n&gt; <br/>\n&gt; 5. Aware parents spend time each day giving full attention to their<br/>\n&gt; children. During this special, quality time, they observe, listen, respond,<br/>\n&gt; and join in their children&#39;s play (if invited to do so), but they do not<br/>\n&gt; direct the children&#39;s activities.<br/>\n&gt; <br/>\n&gt; 6. Aware parents protect children from danger, but they do not attempt to<br/>\n&gt; prevent all of their children&#39;s mistakes, problems, or conflicts.<br/>\n&gt; <br/>\n&gt; 7. Aware parents encourage children to be autonomous problem-solvers and<br/>\n&gt; help only when needed. They do not solve their children&#39;s problems for them.<br/>\n&gt; <br/>\n&gt; 8. Aware parents set reasonable boundaries and limits, gently guide children<br/>\n&gt; towards acceptable behavior, and consider everyone&#39;s needs when solving<br/>\n&gt; conflicts. They do not control children with bribes, rewards, threats, or<br/>\n&gt; punishments of any kind.<br/>\n&gt; <br/>\n&gt; 9. Aware parents take care of themselves and are honest about their own<br/>\n&gt; needs and feelings. They do not sacrifice themselves to the point of<br/>\n&gt; becoming resentful.<br/>\n&gt; <br/>\n&gt; 10. Aware parents strive to be aware of the ways in which their own<br/>\n&gt; childhood pain interferes with their ability to be good parents, and they<br/>\n&gt; make conscious efforts to avoid passing on their own hurts to their<br/>\n&gt; children.<br/>\n&gt; <br/>\n&gt; This philosophy is further developed in Aletha Solter&#39;s books, The Aware<br/>\n&gt; Baby, Helping Young Children Flourish, and Tears and Tantrums (available<br/>\n&gt; from Shining Star Press, P.O. Box 206, Goleta, CA 93116, U.S.A.). Copyright<br/>\n&gt; 0 1994 by Aletha Solter<br/>\n&gt; <br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; <br/>\n&gt; Addresses:<br/>\n&gt; Post message: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@egroups.com\">Unschooling-dotcom@egroups.com</a><br/>\n&gt; Unsubscribe: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@egroups.com\">Unschooling-dotcom-unsubscribe@egroups.com</a><br/>\n&gt; List owner: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-owner@egroups.com\">Unschooling-dotcom-owner@egroups.com</a><br/>\n&gt; List settings page: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a> </span></blockquote></div>","specialLinks":[]}],"prevTopicId":12460,"nextTopicId":12465}}