{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Carol Burke","from":"Carol Burke &lt;Burkfamily9@...&gt;","replyTo":"LIST","senderId":"duglepSIK2wZDAXCR-YgAz1u3J8_vwSIdsq2l4sMHMmspdH-pFtOQZzuLTzwKkajHH69L71mMPFZhTTMS3NC-z81720j8olaS54","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: (Fwd) Re: [Unschooling-dotcom] Need advice on parenting","postDate":"973918721","msgId":14097,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMTExMDQ1ODQxLjcyNzg0LnFtYWlsQHdlYjkwMDYubWFpbC55YWhvby5jb20+"},"prevInTopic":14091,"nextInTopic":0,"prevInTime":14096,"nextInTime":14098,"topicId":14091,"numMessagesInTopic":0,"msgSnippet":"Tracy- Thanks.  I printed the post you forwarded and I will keep it and read it.  I want to read that book, also, because I felt much the same way about","messageBody":"<div id=\"ygrps-yiv-1519745929\">Tracy-<br/>\n<br/>\nThanks.  I printed the post you forwarded and I will<br/>\nkeep it and read it.  I want to read that book, also,<br/>\nbecause I felt much the same way about Mazlish and<br/>\nFaber.  <br/>\nI just wish I could figure a way out to give so much<br/>\nattention to seven at the same time.  Don&#39;t get me<br/>\nwrong-I love having a big family-but sometimes it&#39;s<br/>\njust so darned hard to even focus!<br/>\n<br/>\nTake care and thanks again-<br/>\nCarol B.</div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;tracy.oldfield@...&gt;","replyTo":"LIST","senderId":"co3T2cv_Yqet8E4tM7nylId7SLabh2aKFPji1xljU0Q7YYYXdTubj15pexpwC7o9sorJf7N4KAbt2W2yAm7gaxqA45QtzYmRDen9gLAJjiIf6Kc8nQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"(Fwd) Re: [Unschooling-dotcom] Need advice on parenting","postDate":"973885904","msgId":14091,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBMEM1MUQwLjE4NzMuMTI5Q0IzMUBsb2NhbGhvc3Q+"},"prevInTopic":0,"nextInTopic":14097,"prevInTime":14090,"nextInTime":14092,"topicId":14091,"numMessagesInTopic":0,"msgSnippet":"Hi Carol I wanted to answer your post, because this is something that I struggle with, though I was raised in a very relaxed way (too relaxed IMO) I ve seen","messageBody":"<div id=\"ygrps-yiv-210590417\">Hi Carol<br/>\n<br/>\nI wanted to answer your post, because this is something that I <br/>\nstruggle with, though I was raised in a very relaxed way (too <br/>\nrelaxed IMO) I&#39;ve seen what &#39;laissez-faire&#39; parenting can do on the<br/>\nreceiving end.  So I try to be more &#39;pro-active&#39; with my children,<br/>\nwhich sometimes means that I&#39;m harder than I need or want to be.  <br/>\n I find it hard to strike the balance, since even though I feel over-<br/>\nauthoritarian, a lot of the time, I&#39;m still more empathetic and less<br/>\njudgemental, less patronising than most other people I see around <br/>\nme. <br/>\nI don&#39;t ask my children to behave like performing dogs for the in-<br/>\nlaws<br/>\nfor example!  (this really gets my goat, and I know that&#39;s<br/>\njudgemental!)  It&#39;s very hard to find role-models to learn from, in<br/>\nthe flesh, which is the best way to learn such things, I think.  So I<br/>\nmake do with the support I get from this list and others.   On one<br/>\nsuch list, there was a debate about smacking and discipline and<br/>\npunishment, which was quite educational *grin*  One of the posts <br/>\nwas<br/>\nvery useful to me, it said everything that I&#39;d wanted to say, and what<br/>\nI needed to hear, too, along with adding more information than I&#39;d <br/>\nhad<br/>\nbefore.  I&#39;ve yet to read the book finally recommended myself, <br/>\nthough<br/>\nI can recognise the process, since I&#39;ve read the Faber and Mazlish<br/>\nbooks, and while they&#39;re a good &#39;kicking-off-point,&#39; acknowledging <br/>\nthe<br/>\nfact that children generally behave as well as they feel, so giving<br/>\nthem respect and empathising with their feelings will help things,<br/>\nthey&#39;re still about promoting certain behaviours, as oppose to<br/>\nrespecting the whole child for their own sake.   So I&#39;ve included it<br/>\nhere, cos I think it&#39;s a great piece of writing, and says what I want<br/>\nto say, but with the benefit of greater experience than mine.  And I<br/>\njust want to second the person who said that you are a GREAT <br/>\nparent<br/>\nfor recognising the need and capacity for change, for questioning <br/>\nthe<br/>\nstatus-quo, for sticking to your guns, school won&#39;t change any of <br/>\nthe<br/>\nproblems you have, and from the sounds of things would just make <br/>\nit<br/>\nharder, more competitive, even less time for the fun things.  The <br/>\nvery<br/>\nbest to you<br/>\n<br/>\nTracy<br/>\n<br/>\n<br/>\n<br/>\nForwarded message...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I suppose I would say wilful disobedience of a clearly given<br/>\n&gt; parental instruction, given in a normal voice, accompanied by the<br/>\n&gt; moral/pragmatic reason why (&quot;eg, I should like you to pick up <br/>\n </span></blockquote>your<br/>\n<blockquote><span title=\"ireply\"> &gt; coat that you left on the floor since it is getting in the way&quot;<br/>\n<br/>\n </span></blockquote>Yes, that was how I used to see it too.  But gradually I learned a <br/>\nfew<br/>\nextra things:<br/>\n<br/>\n1)  To some types of people a politely requested, but direct<br/>\ninstruction like that, actually appears as rude and complaining.  I<br/>\nfind this hard to comprehend, but my husband assures me it is true <br/>\n-<br/>\nalthough he in his turn tries to see beyond what he perceives as<br/>\nrudeness in such requests.  My YS understands things like I do, <br/>\nand my<br/>\nOS understands as my husband does.  To YS, a request such as <br/>\nyours<br/>\nwould be greeted with something like, &#39;Oh yes, I forgot, sorry&#39; and<br/>\nimmediate - and fairly cheerful - picking up of the coat.  To OS,<br/>\nthere would be an instant, &#39;Why do you always complain at me so<br/>\nmuch??&#39;<br/>\n<br/>\nIf your child is of this personality type, then you might simply need<br/>\nto phrase your requests differently.  &#39;Oh dear, the coat is on the<br/>\nfloor again and I&#39;m worried I&#39;m going to trip over it,&#39; would be the<br/>\nway I would make such a request to my husband or OS for them to <br/>\nfind<br/>\nit reasonable and polite, and to respond by picking it up.<br/>\n<br/>\n2)  It&#39;s important to distinguish between what is someone else&#39;s<br/>\nproblem and what is your problem.  In this case (and I realise it&#39;s<br/>\njust one specific minor example, but this can be extrapolated to<br/>\nalmost anything else) the problem is yours.  Your child doesn&#39;t <br/>\nmind<br/>\nthe coat being on the floor - but you do.  Obviously you could just<br/>\npick it up yourself each time, but that wouldn&#39;t help the child learn<br/>\nresponsibility, and could lead to repressed anger and irritation all<br/>\nround as the child might not know where the coat was after it was <br/>\nhung<br/>\nup, and you would feel manipulated, as if you were being treated <br/>\nlike<br/>\na servant.<br/>\n<br/>\nBut having acknowledged that it&#39;s your problem, yet wanting the<br/>\nchild to do something about it, you can have a discussion - <br/>\npreferably not<br/>\nat a tense time - where you explain, using I-messages only, that it<br/>\nbothers you when coats are left lying around.  Give as many <br/>\nreasons as<br/>\nyou can - the coat was expensive and you&#39;re worried it might get <br/>\ntorn<br/>\nif someone treads on it.  It will get dirty quickly and it&#39;s a<br/>\nnuisance to keep washing it.  It&#39;s in an awkward place and someone<br/>\nmight trip over it.<br/>\n Things might fall out of the pockets... etc etc.<br/>\n<br/>\nThen listen to the child&#39;s point of view.  We did this - actually with<br/>\nthe same thing - for ours at one point, and the children explained<br/>\nthat it was difficult to reach the hooks, and the coats kept falling<br/>\noff.  But they didn&#39;t want to have to take them to their bedrooms all<br/>\nthe time as it meant running upstairs when they might be tired, and<br/>\nthen it was a nuisance when we went out and they had to go back <br/>\nup to<br/>\nfetch them.  So we fitted some new - and bigger - coat hooks in the<br/>\nhallway, for children only, at half the height of adult ones. Problem<br/>\nsolved.<br/>\n<br/>\nSometimes a child will come up with what seems like an <br/>\nunacceptable<br/>\nsolution - if they actually *want* their coat on the floor, for<br/>\ninstance!  In that case you might need to come up with some place<br/>\nwhere the coat can be left on the floor, but it&#39;s unlikely that anyone<br/>\nwill trip over it or step on it.  Perhaps a low stool would be a good<br/>\ncompromise, or a chair cushion that&#39;s only for the child&#39;s coat,<br/>\nsomewhere out of the way.  The child might offer to wash the coat <br/>\nwhen<br/>\nit gets dirty... in which case, accept the offer and teach them how <br/>\nto<br/>\nwash the coat and hang it out to dry.  Seeing what is involved is<br/>\noften enough to help the child see the adult&#39;s point of view.<br/>\n<br/>\n3)  We tend to think we are being reasonable (&#39;obviously&#39; it&#39;s not a<br/>\ngood idea to have coats lying around....) and therefore have the right<br/>\nto tell our children what to do, until they see reason for ourselves. <br/>\nI do agree with this from a safety point of view (road crossing is my<br/>\nchief example) but I&#39;d rather help my children understand than just<br/>\nget them to do something because I say so.  Just like HE (yes, <br/>\nthis is<br/>\non-topic! &lt;g&gt;) - we help them understand concepts, answer <br/>\nquestions,<br/>\nand encourage them to research things for themselves and come <br/>\nup with<br/>\ntheir own solutions to problems.  We don&#39;t do what sometimes <br/>\nhappens<br/>\nin schools - giving out busywork and drill, coercing them to do it,<br/>\nand hoping that sooner or later something will catch on.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; the punishment would be given for refusal to pick up the coat, not<br/>\n&gt; for (absent-midedly?) leaving it there in the first place).<br/>\n<br/>\n </span></blockquote>Yes, I did believe this when my children were much younger.  I think<br/>\nit&#39;s the James Dobson approach.  But when I thought more deeply <br/>\nabout<br/>\nit, I realised that &#39;wilful disobedience&#39; is a bit of a strange<br/>\nconcept, really.  Children want to please their parents on the whole <br/>\n-<br/>\nthey *need* to be loved and cared for.  So any apparent <br/>\ndisobedience<br/>\nis due to lack of understanding, or being in a bad mood for some<br/>\nunrelated reason, or exhaustion.... all the kinds of things that also<br/>\nmake adults sometimes irritable or stroppy.  But small children<br/>\nhaven&#39;t learned to explain this, or to hide it, and indeed shouldn&#39;t<br/>\nhave to hide their feelings in front of their parents.<br/>\n<br/>\nWhen they are trying to express their independence by saying &#39;no&#39;,<br/>\nthey&#39;re only trying to grow up and act more like adults do!  And as<br/>\nparents frequently say &#39;no&#39; to their children&#39;s requests, it&#39;s pretty<br/>\nunreasonable for the children not to be allowed to say &#39;no&#39; back.<br/>\n<br/>\nOf course I speak in retrospect - my children are now much older<br/>\nand I don&#39;t really see &#39;punishment&#39; as applying at all to pre-teens<br/>\nand teenagers, because we get along together (on the whole) and<br/>\ndiscuss things together.  They don&#39;t want their clothes to get torn<br/>\nand dirty any more than I do.  It&#39;s much more difficult when you&#39;re<br/>\nconfronted with a stroppy four-year-old crying &#39;I won&#39;t!!&#39; to what you<br/>\nperceived as an entirely reasonable request.  If you say, &#39;OK, I&#39;ll<br/>\npick it up&#39; then it paves the way for the child to expect you to do<br/>\nthat kind of thing every time.  If you leave it on the floor, then the<br/>\ncoat may well get torn, or someone might trip over it.  If you enforce<br/>\nsome kind of punishment (or even shout and threaten until the child<br/>\ndoes what you ask) then you&#39;ve been controlling, and the child is<br/>\nlikely to be resentful because of feeling powerless.  If you keep<br/>\narguing, then the child feels caught in a corner too.<br/>\n<br/>\nBut if you sit down with the child, and say, &#39;OK. you don&#39;t feel like<br/>\nhanging up your coat.  But I&#39;m worried that someone might fall over<br/>\nit. What do you think we should do about it?&#39; then you&#39;ve done three<br/>\nthings: firstly acknowledged the child&#39;s feelings; secondly pointed<br/>\nout your own worries without being accusatory, thirdly turned the<br/>\nproblem over to the child and asked for suggestions - which leaves <br/>\nthe<br/>\nchild free to come up with an original idea, or even back down and<br/>\nacknowledge your point of view without feeling humiliated.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And as I posted earlier, I suspect that in loving families with open<br/>\n&gt; communction disobedience in these sort of situations this rarely<br/>\n&gt; happens.<br/>\n<br/>\n </span></blockquote>I think a lot depends on the child, and on the parental response. <br/>\nSome<br/>\nchildren just seem determined to be stroppy, and most of them go<br/>\nthrough stages of being extra-assertive or apparently doing the<br/>\nopposite of what they&#39;re asked.  Sometimes this is a kind of<br/>\nsubconscious test of the parents&#39; love - will we *really* keep loving<br/>\nthem and accepting them even if they&#39;re obnoxious?  It&#39;s how they<br/>\nlearn about unconditional love.<br/>\n<br/>\nI threw out my James Dobson books when I&#39;d read other parenting<br/>\nbooks - firstly Kevin Leman&#39;s &#39;How to make your children mind<br/>\nwithout losing yours&#39;, which showed me the importance of teaching<br/>\nabout consequences (rather than arbitrary punishments).  Yet in <br/>\nsome<br/>\nways he&#39;s still advocating control, although of a less authoritarian<br/>\nmanner.  Then I read &#39;How to talk so your kids will listen and listen<br/>\nso your kids will talk&#39;, which gives lots of examples of dealing with<br/>\n&#39;I-messages&#39;, and determining whose problem you are dealing with, <br/>\nand<br/>\nother techniques.  It&#39;s an excellent book and I&#39;d highly recommend <br/>\nit,<br/>\nbut *still* there&#39;s an element of control in it - the idea of making<br/>\nour children do things to make our life easier/more pleasant.<br/>\n<br/>\nThen I read Ross Campbell&#39;s book &#39;How to really love your child&#39;, <br/>\nand<br/>\nit revolutionised the way I think about things.  He really didn&#39;t talk<br/>\nabout discipline much at all, but looked from the point of view of a<br/>\nchild longing to be loved and understood, with an immature <br/>\n&#39;emotional<br/>\ntank&#39; that needed constant filling.  Campbell&#39;s theory is that<br/>\nwhenever a child is behaving in ways that antagonise parents, <br/>\nthey&#39;re<br/>\ncrying out for attention.  Some need more than others, some are <br/>\nhurt<br/>\nin ways we can&#39;t begin to understand.  But we can respond *first* <br/>\nby<br/>\ngiving lots of hugs, eye contact, time doing what the child chooses,<br/>\nlistening to all they say and acknowledging their feelings as valid,<br/>\nand so on.  99% of the time problems are resolved when the child is<br/>\nfeeling truly loved and knows that the parents want to understand.<br/>\n<br/>\nWell that&#39;s quite enough philosophising from me...</div>","specialLinks":[]}],"prevTopicId":14093,"nextTopicId":14101}}