{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Billy or Nancy","from":"&quot;Billy or Nancy&quot; &lt;FUNLists@...&gt;","replyTo":"LIST","senderId":"y3RfAR-GW7TngeeOY2b72LyHWI0PTg5Gc3fyLxj4CBJoHsb-Dj3epYMMG4UWSaa1LiT39wdZx0um-aWlfbzqNmZf-h6VWi2QVPFub2A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"FUN-Books.com and unschooling.org web sites attacked","postDate":"1001508918","msgId":26257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMxNDY4YSQ3ZjI1ODEwMCQ2NTAxYThjMEBiaWxseT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":26256,"nextInTime":26258,"topicId":26257,"numMessagesInTopic":0,"msgSnippet":"Just an update. The web sites listed in the subject line do not present any danger of infection. Although the server was partially infected by the W32-Nimda","messageBody":"<div id=\"ygrps-yiv-1374628913\">Just an update. The web sites listed in the subject line do not present any<br/>\ndanger of infection. Although the server was partially infected by the<br/>\nW32-Nimda worm, only the script that is supposed to deliver the payload was<br/>\nactive. The file that causes the damage (readme.exe or an outlook e-mail<br/>\nfile containing it) was not present.<br/>\n<br/>\nIf you visit the sites, you may notice a minimized second browser window<br/>\nthat opens with a &quot;file not found error.&quot; If the worm had been fully<br/>\nfunctional, that browser window would have linked to the virus file and you<br/>\nwould have had a message asking you if you wanted to download and run a file<br/>\nname readme.exe or *.eml.<br/>\n<br/>\nIf you have up-to-date anti-virus software running, it will detect the<br/>\nscript and give you a virus warning, but since the infectious file is not<br/>\npresent, there is no danger. If you do not have any anti-virus protection,<br/>\nyou may notice the minimized second browser window, but again there is no<br/>\ndanger of infection. On a PC, the browser window can be closed by right<br/>\nclicking on the icon in the task bar and choosing &quot;Close.&quot;<br/>\n<br/>\nYou should never download and run a file from any web site you visit unless<br/>\nyou know exactly what it is.<br/>\n<br/>\nI am pleased to say that there is currently no danger of infection from<br/>\nvisiting our web sites and we hope to have all traces of the worm removed<br/>\nsoon.<br/>\n<br/>\nBilly Greer<br/>\nwww.FUN-Books.com<br/>\nwww.unschooling.org<br/>\n<br/>\n==== previous message =======<br/>\nOne of the servers I lease space on fell victim to the W32-Nimda worm. The<br/>\nabove sites were knocked off-line on Tuesday and came back on-line today<br/>\ninfected with the W32-Nimda worm. All major anti-virus software companies<br/>\nhave updates to avoid infection and you can go to http://www.sarc.com for<br/>\nmore information or to run a free check on your system.<br/>\n<br/>\nIf you visit the above sites you may be prompted to download an eml file. Do<br/>\nnot download the file! If you download the file, then open it, you can<br/>\nbecome infected. Just visiting the web site should not infect your computer.<br/>\nYour anti-virus software may detect the virus script and give you a warning.<br/>\nJust do not download and open any eml (OutLook format email file) and you<br/>\nshould be fine.<br/>\n<br/>\nThis worm normally is spread by e-mail and the email form has the nasty<br/>\ncapability to infect you using a MIME exploit that allows the virus to be<br/>\nexecuted just by reading or previewing the file. Information and a patch for<br/>\nthis exploit can be found at<br/>\n&lt;http://www.microsoft.com/technet/security/bulletin/MS01-020.asp&gt;<br/>\n<br/>\nIf you have visited any site that prompted you to download and open an eml<br/>\nfile, and you did so, you may be infected. Please visit the SARC site<br/>\n(http://www.sarc.com)  and check your system. I apologize for any<br/>\ninconvenience you may have experienced from visiting one of our sites.<br/>\nTechnicians are working to eliminate the virus and restore the server to<br/>\nnormal operation.<br/>\n<br/>\nBilly Greer<br/>\nwww.FUN-Books.com<br/>\nwww.unschooling.org</div>","specialLinks":[]}],"prevTopicId":26161,"nextTopicId":26259}}