{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":135609248,"authorName":"julie w","from":"julie w &lt;jjjwoolfolk@...&gt;","profile":"juliewinar","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] unschooling w limited income","postDate":"1110643268","msgId":104420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMzMxMjQ0LjcwODA4MDRAc2JjZ2xvYmFsLm5ldD4=","inReplyToHeader":"PDIwMDUwMzEyMDczOTE4LjQxMDIucW1haWxAd2ViNTAwMDYubWFpbC55YWhvby5jb20+","referencesHeader":"PDIwMDUwMzEyMDczOTE4LjQxMDIucW1haWxAd2ViNTAwMDYubWFpbC55YWhvby5jb20+"},"prevInTopic":104411,"nextInTopic":0,"prevInTime":104419,"nextInTime":104421,"topicId":104411,"numMessagesInTopic":0,"msgSnippet":"... This has got to be the number one, most wonderful thing about libraries. Especially if you have a small one which is not willing to spend money on what","messageBody":"<div id=\"ygrps-yiv-1819879184\">Millie Rosa wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Also, I have recently discovered that a lot of people don&#39;t know about <br/>\n&gt; interlibrary loan.  Your library can get any book you want!  Ours has <br/>\n&gt; been quick about it to boot.    DS likes to see where the books come <br/>\n&gt; from, as we get them from all over the country; usually he wants me to <br/>\n&gt; show him on the map.  I don&#39;t know whether you can use interlibrary <br/>\n&gt; loan for tapes, but we aim to find out tommorrow.<br/>\n&gt;<br/>\n </span></blockquote>This has got to be the number one, most wonderful thing about libraries. <br/>\nEspecially if you have a small one which is not willing to spend money <br/>\non what some folks would deem obscene/violent trade paperback comics, or <br/>\nauthors most folks don&#39;t know about or out of print books. If you have <br/>\nthe ISBN number, more then likely your library can get it. Now some of <br/>\nthe libraries that are lending to your library may charge for the <br/>\nprivilege and your library may pass that on (mine does not) so its <br/>\nalways a good idea to check. It also helps to get to know the librarian <br/>\nwho does inter-loan, its easy for me since she&#39;s my mom, but it could be <br/>\nfor a good, repeat patron she&#39;d go out of his way to help.<br/>\nThere is something else about your &quot;reference&quot; librarian. They can do <br/>\nbetter searches then you can. They have Gale-Net and other cool search <br/>\nengines that we cannot access. FYI.<br/>\nAlso if you live in an area with a good library there are lots of talks <br/>\nand programs going on that are free that you can attend with your kids. <br/>\nOur library also has kid&#39;s advisory boards (yes made up of just children <br/>\nand their respective librarian) for the children&#39;s and young adult <br/>\nsections that meet to discuss activities and books to buy.<br/>\n<br/>\nJulie W<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://jwoolfolk.typepad.com/theothermother/\">http://jwoolfolk.typepad.com/theothermother/</a><br/>\n<br/>\n<br/>\n<br/>\n  ----------<br/>\n<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.308 / Virus Database: 266.7.1 - Release Date: 3/9/2005<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":184426691,"authorName":"Millie Rosa","from":"Millie Rosa &lt;willsmamamillie@...&gt;","profile":"willsmamamillie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] unschooling w limited income","postDate":"1110613158","msgId":104411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMzEyMDczOTE4LjQxMDIucW1haWxAd2ViNTAwMDYubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDExMTAzODg0MjUuMzQ1OC4yMTQ2OS5tMjRAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":104420,"prevInTime":104410,"nextInTime":104412,"topicId":104411,"numMessagesInTopic":0,"msgSnippet":"I would like to reply to this: -=-i was wondering if anyone could give me some ideas on how to get my kids out of the house more often on a limited budget.-=- ","messageBody":"<div id=\"ygrps-yiv-1269370894\">I would like to reply to this:<br/>\n-=-i was wondering if anyone could give<br/>\nme some ideas on how to get my kids out of the house<br/>\nmore often on a limited budget.-=-<br/>\nand then also the more general idea of unschooling on a limited budget which is being discussed.<br/>\n  As far as getting out of the house is concerned, here are some of the things we do for free:<br/>\n-The &quot;Discovery Center;&quot; we have a membership and so can go any day we want to whether we have money or not.  This year, I requested renewal of our membership as a christmas gift, so it didn&#39;t cost us anything.  Also, aquariums and zoos.<br/>\n-Playgrounds- we go out of our way to find and visit new playgrounds regularly.<br/>\n-Auto parts store   This a favorite w my ds.  He LOVES to look at the &quot;car- fixing tools,&quot; and we have found if they are slow the workers are eager to answer his questions and show him stuff.<br/>\n-Home Depot (my son spends hours looking at stuff in there)<br/>\n-The Free Nature Center<br/>\n-The Harley store, boat lots, the John Deere dealership (these salesmen aren&#39;t usually as inclined to answer questions, though!)<br/>\n-The Agricultural Extension Service has some exhibits and experimental gardens<br/>\n-all kinds of community ball games and other sporting events<br/>\n-different kinds of farms; just call and they will give you a tour; at one the farmer even let ds climb on the tractor<br/>\n-forts<br/>\n- we stop and watch construction crews, road builders, street cleaners, etc. <br/>\n-just wander in the car!  DS loves to say &quot;where does that road go?&quot; and we find out<br/>\n-check your paper regularly, there are all kinds of free or nominally priced exhibitions and etc.  We have been to Native American Pow-wows, pioneer days, free concerts, etc  There are also SGA events, Ren Faires, Civil War reenactments...<br/>\n-&quot;field trips&quot; we have made in response to various interests include a trip to the Dodge dealership to look under a hood and find out exactly what a &quot;hemi&quot; is and to the landfill to find out &quot;where garbage goes.&quot;<br/>\n <br/>\nMore generally, I have found a wealth of free materials available.  My ds devours any printed material, and all sorts of agencies have free materials available to &quot;educators&quot; (including NASA, btw)  I have had no trouble having them sent here.   Sometimes they just send &quot;lesson plans&quot; but there is always at least some good info and we like to color and then cut and paste w the inevitable worksheets.  Recently I was in touch w our state&#39;s head paleontologist who  sent us a bulging packet of dinosaur materials...two posters, booklets, photos, a coloring book, etc...all for free, and he has invited us to come to his office and see his collection.  Our states DEQ (dept of environmental quality) rents videos by mail on a variety of subjects; the tapes we have seen so far have been enormously entertaining. <br/>\n I have been excited to find out that folks who study a subject for their living are eager to share their knowledge w my son.  Whenever he has exhibited in depth curiosity in a subject, we have been able to find an expert who has been happy to answer all his questions and show him stuff.<br/>\n <br/>\nAlso, I have recently discovered that a lot of people don&#39;t know about interlibrary loan.  Your library can get any book you want!  Ours has been quick about it to boot.    DS likes to see where the books come from, as we get them from all over the country; usually he wants me to show him on the map.  I don&#39;t know whether you can use interlibrary loan for tapes, but we aim to find out tommorrow.<br/>\n <br/>\nOne other resource we have found is a discount teacher supply store a few towns away.  They have great deals on things like powdered tempera, wooden puzzles and the best selection of stickers we have seen.  We have found really neat stuff such as a weather station for our yard, Raffi and Ella Jenkins records, some cool wooden people he uses w blocks, software and games, and wooden toys.  They also have an enormous selection of posters on all subjects for 25 cents, 40 cents, and a dollar.  He always brings home several when we go there.<br/>\n <br/>\nAlso, if you don&#39;t mind buying &quot;made in China,&quot; Dollar Tree is full of fun stuff for strewing.<br/>\n<br/>\nHTH someone!<br/>\n <br/>\nMillie<br/>\nby the riverside<br/>\n <br/>\n<br/>\n\t\t<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\n Yahoo! Small Business - Try our new resources site! <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":104406,"nextTopicId":104221}}