{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Helen Hegener","from":"Helen Hegener &lt;HEM-Editor@...&gt;","replyTo":"LIST","senderId":"ouxkebSxJJJ4T7YG930PijThqpJZotXkq1lmgGItSybYrBVjQTn-nqAwRzjwTBokQa4k-SaT6GXCvfj0dsU6GTK8LapAFZACbhI6uXpovMgoG6yOVKA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"List Archives, Dead Domains, etc.","postDate":"989093742","msgId":20599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkwM2I3MWEwOTRkZTdlNkBbMjA4LjI2LjIzNS44MF0+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":20598,"nextInTime":20600,"topicId":20599,"numMessagesInTopic":0,"msgSnippet":"Okay, one of the other things I ve been working on this morning is changing the settings for the list archives so they re only available to listmembers. I ve","messageBody":"<div id=\"ygrps-yiv-159993706\">Okay, one of the other things I&#39;ve been working on this morning is <br/>\nchanging the settings for the list archives so they&#39;re only available <br/>\nto listmembers. I&#39;ve usually run lists as open to viewing by anyone, <br/>\nwhether they were on the list or not, figuring that people could read <br/>\nthe archives of a list to see if it was one they might want to join <br/>\nor not, or people could refer others offlist to specific posts by <br/>\nsending them the URL to the post, or just because it seemed <br/>\nfriendlier than keeping closed, member-only list archives.<br/>\n<br/>\nBut a number of things came together recently (interesting how that <br/>\nhappens, isn&#39;t it?) to cause me to change my mind on this policy.<br/>\n<br/>\nFirst off, there&#39;s been an interesting discussion on one of the <br/>\npolitically oriented lists I belong to about whether or not it&#39;s <br/>\nappropriate to forward a person&#39;s posts offlist without their <br/>\npermission. FWIW, I said I didn&#39;t think so, but another person made <br/>\ngood point that they relied on that particular list to keep their <br/>\nstate list informed and needed to be able to share information, <br/>\nperceptions, perspectives, etc., etc. Anyway, I&#39;ve suggested on that <br/>\nlist that we need to rely on common sense and courtesy for these <br/>\nkinds of decisions...<br/>\n<br/>\nThen someone wrote to us about one of our lists, expressing dismay <br/>\nthat it had open archives, because she&#39;d done an internet search for <br/>\nher own name and found that the list&#39;s messages came up in the <br/>\nsearch! I wasn&#39;t even aware one could do that. Her concern was that <br/>\nunfriendly relatives might gain access to what she&#39;d written on that <br/>\nlist - which seemed like a valid concern to me.<br/>\n<br/>\nNow of course it&#39;s easy to just join a list and gain access, and <br/>\nwe&#39;re all aware of the &quot;don&#39;t post it unless you want it bounced all <br/>\nover the Internet&quot; syndrome. Still, it seems as though if we&#39;re to <br/>\nerr on the side of caution it would be wiser to make the list <br/>\narchives closed instead of leaving them open to anyone doing an <br/>\ninternet search.<br/>\n<br/>\nSo this list now has closed archives, available to list members only.<br/>\n<br/>\nDead domains. I&#39;ll bet you wondered when I&#39;d get to that, huh? &lt;g&gt;<br/>\n<br/>\nActually, it&#39;s no laughing matter. We learned a hard lesson this <br/>\nmorning when a good friend sent us a note advising us to check <br/>\nsomething out, and when we checked, we were flabbergasted.<br/>\n<br/>\nWe thought we were all paid up to keep our old home-ed-press domain <br/>\nname (our first URL, from when we published books), and we had it <br/>\nmirrored to our home-ed-magazine site because so many people still <br/>\nhad it linked through their sites (I think we found about 15,000+ <br/>\nlinks to that URL). But somehow the registration on that domain name <br/>\nexpired (we&#39;re still trying to figure out how it expired without our <br/>\nknowing it), and it was bought by a wholesale company, which leased <br/>\nor rented it just two days ago to an overseas outfit that turned it <br/>\ninto a porno site.<br/>\n<br/>\nWARNING - please DON&#39;T check out that old home-ed-press site out of <br/>\nidle curiosity, because it&#39;s one of those &quot;virulent&quot; porn sites that <br/>\nwill keep opening windows until you crash your browser or your whole <br/>\nmachine. Save everything before trying it if you&#39;re really *that* <br/>\ncurious to see what&#39;s there.<br/>\n<br/>\nAnd PLEASE - If you have a link to the old home-ed-press domain name <br/>\non your website (or your support group&#39;s site?) please change it to <br/>\nhome-ed-magazine.com as soon as possible. Thanks in advance for <br/>\nhelping us straighten out this serious problem.<br/>\n<br/>\nHelen<br/>\n* * * *<br/>\nHelen Hegener, Managing Editor<br/>\nHome Education Magazine<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:HEM-Editor@...\">HEM-Editor@...</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a></div>","specialLinks":[]}],"prevTopicId":20596,"nextTopicId":20579}}