{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling Support List","postDate":"1265645918","msgId":50554,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3RjM5QjE3LUExNEEtNDEyQy1BMzUyLTYzRkZFMjJFNkYyQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDI2MjU5QkI1RTNBMTQyQ0Q5MkRBQjgwNDA0NzkwM0YwQGJpZ3N1cnByaXNlPg==","referencesHeader":"PDRCQkYyQTNDNDVDMzQ3MUZBQzRCMEY1QkU0OUYyMzIxQGJpZ3N1cnByaXNlPiA8Njg1MTg1LjQ3MDUwLnFtQHdlYjU3MjAxLm1haWwucmUzLnlhaG9vLmNvbT4gPDI2MjU5QkI1RTNBMTQyQ0Q5MkRBQjgwNDA0NzkwM0YwQGJpZ3N1cnByaXNlPg=="},"prevInTopic":50550,"nextInTopic":0,"prevInTime":50553,"nextInTime":50555,"topicId":50514,"numMessagesInTopic":0,"msgSnippet":"-=-***writing a family mission statement,*** Deb wrote:  -=-Organizations write mission statements to clarify their goals for those they will be associating","messageBody":"<div id=\"ygrps-yiv-208554431\">-=-***writing a family mission statement,***<br/>\n<br/>\nDeb wrote:  -=-Organizations write mission statements to clarify their  <br/>\ngoals for those they will be associating with. Churches do that so  <br/>\nthose who work in and with the church and those who attend the church  <br/>\nknow what&#39;s expected of them and what they can expect. If someone  <br/>\nignores the stated purposed they can be ousted.-=-<br/>\n<br/>\nThe Always Learning list has a careful description (and though it was  <br/>\nchanged once, it has a link to the original and the reasons for the  <br/>\nchange) because if people violate &quot;the mission&quot; I can drop them off  <br/>\nthe list unceremoniously.  It&#39;s happened.  It&#39;s rare.  This week has  <br/>\nbeen a good reason to oil the trapdoor, but nobody&#39;s been dropped this  <br/>\nweek, either (yet).<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/\">http://groups.yahoo.com/group/AlwaysLearning/</a><br/>\nEither this link is at the bottom of your e-mail right now, or it&#39;s at  <br/>\nthe right of where you&#39;re reading, if you&#39;re on the yahoogroups webpage.<br/>\n<br/>\nI don&#39;t &quot;set goals&quot; outside of house repairs, thawing out dinner in  <br/>\nenough time to cook it, making sure doctors appointments are kept, and  <br/>\nthe pets are fed.  My goal is to be mindful and responsible.<br/>\n<br/>\nMy children&#39;s &quot;goals&quot; are not about olympic gold medals or European  <br/>\nsports cars.  They live busy lives with real people around them, and  <br/>\nthey are responsible and kind.  They&#39;re building relationships all the  <br/>\ntime, and when they say they&#39;ll be somewhere, they&#39;re there.<br/>\n<br/>\nToo specific a goal creates failure.<br/>\nA general goal based on principles can be success immediately, not  <br/>\njust maybe later.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling Support List","postDate":"1265639535","msgId":50550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI2MjU5QkI1RTNBMTQyQ0Q5MkRBQjgwNDA0NzkwM0YwQGJpZ3N1cnByaXNlPg==","referencesHeader":"PDRCQkYyQTNDNDVDMzQ3MUZBQzRCMEY1QkU0OUYyMzIxQGJpZ3N1cnByaXNlPiA8Njg1MTg1LjQ3MDUwLnFtQHdlYjU3MjAxLm1haWwucmUzLnlhaG9vLmNvbT4="},"prevInTopic":50543,"nextInTopic":50554,"prevInTime":50549,"nextInTime":50551,"topicId":50514,"numMessagesInTopic":0,"msgSnippet":"***How did you (anyone) decide what you want? *** I decided what I wanted our family life to be like by considering my principles.  A peaceful home is better","messageBody":"<div id=\"ygrps-yiv-407414451\">***How did you (anyone) decide what you want? ***<br/>\n<br/>\nI decided what I wanted our family life to be like by considering my principles.  A peaceful home is better than a home where parents and kids fight.  A happy home is better than a home where kids are depressed and oppressed.   Being respectful of family members is a better way to live with people. (it&#39;s a big part of peace and happiness)   Since I believe people learn naturally unschooling is better than school.   And since those are the ideas I live by they seem important enough I should  do them well.  <br/>\n<br/>\nDid you mean in general?  How do I decide if I want to grow a garden?   I think about what I enjoy what&#39;s involved in growing a garden.   How do I decide if I want to change jobs?  I think about the reason I&#39;m working and whether a different job would better suit my reasons. <br/>\n<br/>\n***I&#39;ve been reading about setting goals, ***<br/>\n<br/>\nYou can set goals for yourself if you know what you want to do but setting goals for someone else is not possible.   One of my goals might be a happy home but I can&#39;t make anyone happy.  I can be the kind of person my husband and son are happy to be around.   If I was critical and cranky and huffy I wouldn&#39;t be moving toward my goal of a happy home life.   I can do things for them that please them and make their lives better.   I can keep our home comfortable and be positive and try to create a place where others can live happily. <br/>\n<br/>\nIf my goal is a peaceful relationship with my family then I need to be peaceful. <br/>\nIf my goal is a respectful relationship then I need to respect the feelings and wishes of my family. <br/>\nIf my goal is to help my kid learn about life and the world then I need to make life interesting here and provide access to the rest of the world as much as I&#39;m able.  <br/>\n<br/>\n***writing a family mission statement,***<br/>\n<br/>\nOrganizations write mission statements to clarify their goals for those they will be associating with.   Churches do that so those who work in and with the church and those who attend the church know what&#39;s expected of them and what they can expect.   If someone ignores the stated purposed they can be ousted.   If it works for organizations it works because the people agreeing to the statements are adults who share the same beliefs and goals.  They participate freely or they&#39;re free to move on if they don&#39;t agree.   <br/>\n<br/>\n Unschooling families don&#39;t need a mission statement.  Kids don&#39;t join families.  They don&#39;t get to pick the parents whose mission statement they agree with.  They do learn by living and if they live with good and thoughtful people who are cheerful and respectful and kind they will learn the value of those qualities.   Parents really can&#39;t set goals for children.  That kind of control over others is an illusion  If there are things you personally value then live them - share them with your children and if they really are useful your children will see the value for themselves.  <br/>\n<br/>\nOne of the reasons unschooling is valuable is because it provides kids with the time and freedom to determine their own goals. <br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n  <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276701487,"authorName":"Michele K","from":"Michele K &lt;mom2rci@...&gt;","profile":"mom2rci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling Support List","postDate":"1265609118","msgId":50543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4NTE4NS40NzA1MC5xbUB3ZWI1NzIwMS5tYWlsLnJlMy55YWhvby5jb20+","inReplyToHeader":"PDRCQkYyQTNDNDVDMzQ3MUZBQzRCMEY1QkU0OUYyMzIxQGJpZ3N1cnByaXNlPg==","referencesHeader":"PDRCQkYyQTNDNDVDMzQ3MUZBQzRCMEY1QkU0OUYyMzIxQGJpZ3N1cnByaXNlPg=="},"prevInTopic":50526,"nextInTopic":50550,"prevInTime":50542,"nextInTime":50544,"topicId":50514,"numMessagesInTopic":0,"msgSnippet":"How did you (anyone) decide what you want?  I ve been reading about setting goals, writing a family mission statement, those kinds of things, but haven t yet","messageBody":"<div id=\"ygrps-yiv-2099468378\">How did you (anyone) decide what you want?  I&#39;ve been reading about setting goals, writing a family mission statement, those kinds of things, but haven&#39;t yet done it.  But sometimes I wonder if the going-with-the-flow way I&#39;m living right now, without clear goals, means we&#39;re missing out and/or not achieving as much as we could.<br/>\n<br/>\nI know this is a personal question, but it may help me to know how others figured this out.  I am schooled, used to be given goals rather than making up my own.<br/>\n<br/>\n Michele, mom of Rhiannon 8, Caroline 6, and Ian 3<br/>\nLearning, Laughing, Snuggling, Scrapping<br/>\nMy Digital Scrapbook Pages<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nBut before any of that, you need to know what it is you want.  And when you know what you want you should move toward it in the most direct and effective way because your kids are getting older every minute.  There isn&#39;t all the time in the world to get better. <br/>\n<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling Support List","postDate":"1265538338","msgId":50526,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2NDkyMC45NzcyMy5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDRCQkYyQTNDNDVDMzQ3MUZBQzRCMEY1QkU0OUYyMzIxQGJpZ3N1cnByaXNlPg==","referencesHeader":"PDRCQkYyQTNDNDVDMzQ3MUZBQzRCMEY1QkU0OUYyMzIxQGJpZ3N1cnByaXNlPg=="},"prevInTopic":50514,"nextInTopic":50543,"prevInTime":50525,"nextInTime":50527,"topicId":50514,"numMessagesInTopic":0,"msgSnippet":"***I don t want to unschool well. I want to unschool better. *** I was thinking about unschooling better last night. I realized that when I came to","messageBody":"<div id=\"ygrps-yiv-883826234\">***I don&#39;t want to unschool well. I want to unschool better. ***<br/>\n<br/>\nI was thinking about &quot;unschooling better&quot; last night. I realized that when I came to unschooling, unschooling wasn&#39;t the goal: parenting was; the relationship with my children was; the enrichment of their lives and their education was. Unschooling was a tool. It still is. It&#39;s a fulcrum and a lever and a place to stand and with those things I can move the earth to meet their needs and their goals and their dreams, or help them to see other ways of approaching the earth to meet their needs and their goals and their dreams (apparently the lever would have to be 6.5 billion light years long to move the earth). Unschooling is the philosophy that I use to make all those things happen. And it works a treat. I am so impressed with unschooling that I work to help others to implement in their lives. But parenting and education, those are my main aims. And I want to be a good parent and I want to get better at it all the time. If I were using other tools than<br/>\n unschooling that would still be my goal. Fortunately, unschooling cuts to the heart of those things so cleanly and so quickly and I found it, because of amazing lists like this and sites like sandradodd.com (Joyce&#39;s wasn&#39;t around when I started), that I didn&#39;t have to keep looking once I got to unschooling. <br/>\n<br/>\nSo, unschooling better isn&#39;t my goal, my goal is to sit and giggle with my kids while we chat and play, learning and living all the while. Unschooling better just makes it all so much easier. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279647515,"authorName":"Deb Lewis","from":"&quot;Deb Lewis&quot; &lt;d.lewis@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Deschooling Support List","postDate":"1265496286","msgId":50514,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQkYyQTNDNDVDMzQ3MUZBQzRCMEY1QkU0OUYyMzIxQGJpZ3N1cnByaXNlPg=="},"prevInTopic":0,"nextInTopic":50526,"prevInTime":50513,"nextInTime":50515,"topicId":50514,"numMessagesInTopic":0,"msgSnippet":"***I don t want to unschool well. I want to unschool better. *** Better will lead you someplace though, won t it?  Isn t that your hope?    If you get better","messageBody":"<div id=\"ygrps-yiv-1386355728\">***I don&#39;t want to unschool well. I want to unschool better. ***<br/>\n<br/>\nBetter will lead you someplace though, won&#39;t it?  Isn&#39;t that your hope?    If you get better every day or every moment do you expect to be unschooling poorly or unschooling in a mediocre way?    I don&#39;t understand your statement.  <br/>\n<br/>\nI wanted to parent well.  I wanted to be a really good mom to Dylan.  I wanted Dylan&#39;s life to be interesting and fun and so I wanted to make unschooling wonderful.      And &quot;better&quot; than what?   Better than the worst unschooling parents?   Better than your own parents?   Better than most people?   How will a lack of effort or vision on your part be good enough for your kids?   <br/>\n<br/>\n***I think I might be able to unschool better if I have a support group that I can go to when I am feeling a bit insecure.***<br/>\n<br/>\nThere was a study that found that fat friends might be part of the reason a person stays fat, because they&#39;re the ones who sympathize  and eat with you and never tell you when you&#39;re feeling bad about being fat not to eat twelve donuts before you go to bed.    <br/>\n<br/>\nSo it is with support lists for unschooling.  You&#39;ll get a lot of sympathy and lots of people who have the same worries you have but few if any who will tell you the reason something isn&#39;t going well is because of what you yourself are doing and that you must change if you want to move forward.  <br/>\n<br/>\nBut before any of that, you need to know what it is you want.  And when you know what you want you should move toward it in the most direct and effective way because your kids are getting older every minute.  There isn&#39;t all the time in the world to get better.    <br/>\n<br/>\n<br/>\nDeb Lewis<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":50475,"nextTopicId":50567}}