{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"zwHIxagMCufJUPkZEUCebOn71JZYGcCxwh7cM29MuQ1Xcwz-V5GIVtGjF_o3npzzEAWVm-sBcGnC","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re:  [Unschooling-dotcom] Re: Buy Nothing Day","postDate":"975522262","msgId":14289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwLmNiNzg2YTcuMjc1NmEzZDZAYW9sLmNvbT4="},"prevInTopic":14287,"nextInTopic":0,"prevInTime":14288,"nextInTime":14290,"topicId":14265,"numMessagesInTopic":0,"msgSnippet":"-=-we draw numbers and starting with #1 each person selects and opens a gift.  #2 can choose a new gift or steal #1 s.  Then #1 would get to choose again.","messageBody":"<div id=\"ygrps-yiv-723773602\">-=-we draw numbers and starting with #1 each person selects<br/>\nand opens a gift.  #2 can choose a new gift or &quot;steal&quot; #1&#39;s.  Then #1<br/>\nwould get to choose again.  It is a blast and fulfills the need to<br/>\nselect, wrap, and open gifts.  The best part is that we all enjoy each<br/>\nother&#39;s company for a day with a big potluck meal to boot.  We usually do<br/>\nthis a week or two before Christmas.  (In spite of this, they still buy<br/>\nmore for the children.)-=-<br/>\n<br/>\nThat is so cool.  I want to do that with my friends.  And it doesn&#39;t matter <br/>\nin such a situation about the relative value or size of the gifts or anything.<br/>\n<br/>\nIn the SCA we have tournaments sometimes (medievalish combat &lt;g&gt;) and each <br/>\nperson brings a prize and they&#39;re all laid out (visible).  When the <br/>\ntournament&#39;s over, the person who scored highest picks first.  Prized <br/>\ntypically range from a helm or a pair of gauntlets on down to a roll of duct <br/>\ntape (which they use to wrap the rattan swords) or a beer, but it doesn&#39;t <br/>\nmatter.  A guy who makes gauntlets (or who donated those! &lt;g&gt;) won&#39;t want <br/>\nthat prize, and the guy who comes in last takes what&#39;s left.    It&#39;s a way to <br/>\nget  some good prizes at no expense to the sponsoring group, and to <br/>\nfacilitate an exchange of artistry for those things which were handmade <br/>\n(hoods, the beer, the dagger maybe) and people can still furnish a prize even <br/>\nif he goes and buys a dozen candles.  No problem.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"megates@juno.com","from":"megates@...","replyTo":"LIST","senderId":"WZqBbClVjC2sVNPaYM0TZr5bGXowWjLoEUxsd3glccchvW37amh7RaTUqSufPWoyB20Um99Xyw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Buy Nothing Day","postDate":"975516498","msgId":14287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMTI5LjA4NDgzMC4tNDAzNTYzLjUubWVnYXRlc0BqdW5vLmNvbT4="},"prevInTopic":14285,"nextInTopic":14289,"prevInTime":14286,"nextInTime":14288,"topicId":14265,"numMessagesInTopic":0,"msgSnippet":"Christmas is for the Children !!!! Oh, Kathy, you hit that nail on the head!  I struggle with wanting to fulfill my children s wishes and use Christmas as an","messageBody":"<div id=\"ygrps-yiv-252284679\">&quot;Christmas is for the Children&quot;!!!!<br/>\n<br/>\nOh, Kathy, you hit that nail on the head!  I struggle with wanting to<br/>\nfulfill my children&#39;s wishes and use Christmas as an excuse to buy them<br/>\nthings (the way I was raised) - and keeping the whole gift thing very low<br/>\nscale so that is not &quot;what the holiday means to them&quot; - and dealing with<br/>\nrelatives who agree on no adult gift exchanges but let&#39;s all still buy<br/>\nfor the kids because Christmas is for the Children!  So even if I only<br/>\ngot one gift for each of my kids they would still end up with a lot of<br/>\nstuff (not necessarily stuff that we even need or want).  And I am stuck<br/>\nwith feeling guilty if I don&#39;t buy for nieces and nephews since their<br/>\nfolks are buying for mine.<br/>\n<br/>\nWith dh&#39;s siblings and some cousins, we have an annual white elephant<br/>\nparty.  Each person brings one gift and leaves with one gift.  There are<br/>\nvariations, but we draw numbers and starting with #1 each person selects<br/>\nand opens a gift.  #2 can choose a new gift or &quot;steal&quot; #1&#39;s.  Then #1<br/>\nwould get to choose again.  It is a blast and fulfills the need to<br/>\nselect, wrap, and open gifts.  The best part is that we all enjoy each<br/>\nother&#39;s company for a day with a big potluck meal to boot.  We usually do<br/>\nthis a week or two before Christmas.  (In spite of this, they still buy<br/>\nmore for the children.)<br/>\n<br/>\nI think gifts that are edible are amongst the best, too!<br/>\n<br/>\nMary Ellen<br/>\nNobody had a watch, so they ate lunch when they got hungry.<br/>\n<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/tagj.\">http://dl.www.juno.com/get/tagj.</a></div>","specialLinks":[]},{"userId":0,"authorName":"Olivia","from":"Olivia &lt;liv2learn@...&gt;","replyTo":"LIST","senderId":"BHA6mXqUZ5JF4d_JMXZg1Sjk9UsF66KdLN3_UavyUhS5VGzw3llhiCx6rEAlBVsx-pNNsb6rbQCt_2ym9AdRSPe2wg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Buy Nothing Day","postDate":"975515102","msgId":14285,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4wLjI1LjIuMjAwMDExMjkwOTM4MjMuMDBhODhhZTBAcG9wLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDk3NTQxMzQwNC41ODk1N0BlZ3JvdXBzLmNvbT4="},"prevInTopic":14282,"nextInTopic":14287,"prevInTime":14284,"nextInTime":14286,"topicId":14265,"numMessagesInTopic":0,"msgSnippet":"Deirdre, I am applauding your passionate speech! Having said that, I have to admit that I have not been as mindful as I could have been in the past about","messageBody":"<div id=\"ygrps-yiv-358036122\">Deirdre, I am applauding your passionate speech!<br/>\n<br/>\nHaving said that, I have to admit that I have not been as mindful as I <br/>\ncould have been in the past about consumer issues. (I was raised as a <br/>\nshopaholic, bargain hunter.)  I have been trying to change that in the last <br/>\nyear and a half, but it is sometimes so very confusing and <br/>\ndifficult...especially ridding oneself of plastic stuff. It&#39;s everywhere! <br/>\nMaking changes in one&#39;s lifestyle requires a lot of research and <br/>\ndecision-making and I often feel overwhelmed with the information I have <br/>\ngathered; the choices are often not clear. Sometimes I think I&#39;m making the <br/>\n&quot;best&quot; choice but it turns out later that I was misinformed. Plus our <br/>\nshopping choices are sometimes limited by selection (big stores are taking <br/>\nover), or by what we can afford. You can&#39;t always find your size or fit in <br/>\na second-hand clothing store. My son needs new underwear every year; I <br/>\nwould love to buy organic cotton but that Hanes is on sale 2   3-packs for <br/>\n$5.00. Do I take my organic vegetables home from the store in a plastic <br/>\nbag? What can I substitute for polyester fleece (made from petrochemicals), <br/>\nwhich is so warm, if I&#39;m allergic to wool and so much cotton is full of <br/>\npesticides?  I ordered a really good-quality pair of pants from a <br/>\nmail-order place, thinking I will spend a little more to get a pair that <br/>\nwill fit right and last a long time so I only need to buy once, only to <br/>\nfind out that they are making most of their clothes overseas. You get the <br/>\nidea... As an average person, bombarded with advertisements and inducements <br/>\nto want more (as you said, even harder for kids who are assaulted with toy <br/>\nads and Happy Meals), trying to make ends meet, and trying to sort out <br/>\ninformation that changes daily, I can see why a lot of people give up <br/>\ntrying to make a change. Of course, public confusion aids those big <br/>\ncompanies trying to make the biggest profit.<br/>\n<br/>\nIt seems like my one action isn&#39;t even a drop in the bucket. BUT I am still <br/>\ngoing to try! It&#39;s just that it will take lots of little steps forward, <br/>\nwith the occasional slip backwards. Buy Nothing Day and similar campaigns, <br/>\nto me, ask people to think twice about what they really need before making <br/>\na purchase, which lots of people on this list already do, but so many <br/>\npeople in America don&#39;t. I would always like to learn more. Is there a <br/>\ndiscussion group on this topic that you could recommend?<br/>\n<br/>\nOlivia<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;    Date: Mon, 27 Nov 2000 21:47:26 -0500<br/>\n&gt;    From: &quot;Deirdre Malfatto&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yafael@...\">yafael@...</a>&gt;<br/>\n&gt;Subject: RE: buy nothing day<br/>\n&gt;<br/>\n&gt;Did you know that the majority of the clothes made by Nike, The<br/>\n&gt;Gap (which includes Old Navy and Banana Republic), Guess, and<br/>\n&gt;Oshkosh are made in overseas sweatshops that treat, often<br/>\n&gt;underaged, workers miserably?  When we buy clothes, toys,<br/>\n&gt;housewares, gadgets, etc. that are made in China, Malaysia,<br/>\n&gt;Vietnam, etc., etc., we are very often buying items made by workers<br/>\n&gt;who are payed less in a month than we pay for a single Gap t-shirt<br/>\n&gt;here?  Workers are made to work incredibly long hours, often<br/>\n&gt;seven days a week, in terrible conditions, and then can afford only<br/>\n&gt;to go home to their rat-infested shantytown without running water or<br/>\n&gt;electricity? The Gap, for one, says they are doing something about<br/>\n&gt;this, but a little research (try Coop America&#39;s site for a start --<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.coopamerica.org/)\">http://www.coopamerica.org/)</a> shows that what they are saying is<br/>\n&gt;mostly doublespeak.  Often even items that say they are made in<br/>\n&gt;USA (and the Gap is a prime offender here) are made in Saipan,<br/>\n&gt;which is under US rule, but still is home to many sweatshops.<br/>\n&gt;<br/>\n&gt;And what happens to all the things we buy &quot;cheap&quot; in order to save<br/>\n&gt;money? What happens to all the cheap plastic toys that break or<br/>\n&gt;clothes that fall apart are too grungy after the kids have outgrown<br/>\n&gt;them to pass on?  What happens to all the plastic shopping bags<br/>\n&gt;that we bring things home in and all the plastic that pretty new things<br/>\n&gt;are wrapped in?  We toss it all, and it adds to landfill and pollution.<br/>\n&gt;<br/>\n&gt;And where does all this plastic come from?  And where does the<br/>\n&gt;energy come from to run the factories these things are made in?<br/>\n&gt;Most often from our waning petroleum stores.  And what about<br/>\n&gt;wood toys and paper bags? Only a small percentage of that is<br/>\n&gt;being taken from sustainably managed forests.  The rest comes<br/>\n&gt;from old forests that are being chopped down so that we can have<br/>\n&gt;things cheap.<br/>\n&gt;<br/>\n&gt;And why do we need all this stuff to begin with?  Often because we<br/>\n&gt;are told we need it.  Commercials, advertisements, prominent<br/>\n&gt;logos, peer pressure, etc. etc. all make us feel there is something<br/>\n&gt;lacking in our lives if we don&#39;t have the latest this or enough that.<br/>\n&gt;Our children are hit especially hard by this, and it wreaks havoc on<br/>\n&gt;their self-esteem.<br/>\n&gt;<br/>\n&gt;When we make do without or buy things used or buy products<br/>\n&gt;made with sustainably managed materials and support companies<br/>\n&gt;that treat their workers well, we are doing our part to support human<br/>\n&gt;rights and a clean environment and a better world (a world at all) for<br/>\n&gt;our children and our grandchildren to grow up in.<br/>\n&gt;<br/>\n&gt;Buy Nothing Day reminds us of these things. If enough people<br/>\n&gt;refuse to be coerced into buying new things on that day, it can send<br/>\n&gt;a message to the big corporations that we don&#39;t want sweatshops<br/>\n&gt;or child labor or so much waste and that we don&#39;t want them to<br/>\n&gt;coopt our children.  But even if only one person participates in Buy<br/>\n&gt;Nothing Day, it can remind that person that there are things we can<br/>\n&gt;do on a personal level to remove ourselves from the cruelties being<br/>\n&gt;inflicted on other human beings and our planet.<br/>\n&gt;<br/>\n&gt;Stepping off my soapbox :-)<br/>\n&gt;<br/>\n&gt;Deirdre in NYC </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valeries@...&gt;","replyTo":"LIST","senderId":"_ak5AhjRn8w5Gl0OF7A91HN2LTC5_Z17AkbD09hdCuYEpF3x3qk-InkW6sR39LMrgkTIBHa28OTsfgFXkhdCv4DgDOe3Vg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] Re: Buy Nothing Day","postDate":"975509434","msgId":14282,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWMwNWExMyRiYTJkOGUwMCQyNDhmM2VhNkB3dnVzLm9yZz4=","inReplyToHeader":"PDIwMDAxMTI0LjA5MTY0OS40NTU5LjAua2JjYXVsZXlAanVuby5jb20+"},"prevInTopic":14274,"nextInTopic":14285,"prevInTime":14281,"nextInTime":14283,"topicId":14265,"numMessagesInTopic":0,"msgSnippet":"So, this year I suggested we let the children exchange names because they always get entirely tooooooooo much stuff! And people are actually counting gifts and","messageBody":"<div id=\"ygrps-yiv-303750225\">So, this year I suggested we let the children exchange names because they<br/>\nalways get entirely tooooooooo much stuff! And people are actually<br/>\ncounting gifts and paying attention to spend the same amount of $ on each<br/>\nperson. It&#39;s ridiculous! But, I got horrible looks and &quot;but it&#39;s for the<br/>\nchildren.&quot;  Now really, Is it for the children? Because I would hope that<br/>\nmy children would not learn this holiday habit.<br/>\n<br/>\nKathy, we draw names for the adults and the kids on one side of the family,<br/>\nbecause there&#39;s so many of us (16 adults and 21 children). It&#39;s the only way<br/>\nto go in a large family, IMO. We set a $$ limit on the gifts, also. The kids<br/>\nstill get a haul.<br/>\n<br/>\n--Valerie in Tacoma</div>","specialLinks":[]},{"userId":0,"authorName":"Kathryn B Cauley","from":"Kathryn B Cauley &lt;kbcauley@...&gt;","replyTo":"LIST","senderId":"xPZyNGh7smR_XyqC8TbDPRvEBBVFEtlaHtnMvoKR1D0q0rvhb5wbEISieYuFMhnkFewYrxW6Fl7xMqA-OZ_f8poYpY4eCnISoAqU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Buy Nothing Day","postDate":"975464963","msgId":14274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMTI0LjA5MTY0OS40NTU5LjAua2JjYXVsZXlAanVuby5jb20+","referencesHeader":"PDIwMDAxMTI4LjA5Mzc0Ny4tNDYxNDIzLjQubWVnYXRlc0BqdW5vLmNvbT4="},"prevInTopic":14266,"nextInTopic":14282,"prevInTime":14273,"nextInTime":14275,"topicId":14265,"numMessagesInTopic":0,"msgSnippet":"Re:Mary Ellen, Who is trying to change herself for the better.... We have lots of the same issues over here. we celebrate christmas with the whole family (so","messageBody":"<div id=\"ygrps-yiv-81146124\">Re:Mary Ellen, Who is trying to change herself for the better....<br/>\n<br/>\nWe have lots of the same issues over here.<br/>\nwe celebrate christmas with the whole family (so far 7 grandchildren) and<br/>\nthe other <br/>\nfamily (already up to two great -grandchildren). Every year it is<br/>\ncompletely insane!<br/>\nIn both families we have decided to exchange names for getting gifts for<br/>\nthe adults which isn&#39;t so bad because you get to really think about what<br/>\nthat person would want.<br/>\nI have decided on things that can be used (pottery, candles, towels,<br/>\nclothes,etc..) or consumables. You usually can not go wrong with<br/>\nfood...especially something they can freeze for later. Also, I started<br/>\ntwo years ago making family calendars. I collect pictures throughout the<br/>\nyear and in december I make them into a calendar with a different picture<br/>\nfor every month. This is a big hit, esp. with the grandparents. This has<br/>\nbecome a family tradition on both sides. It has even brought my family<br/>\ntogether more and encouraged group photos at Thanksgiving. I don&#39;t like<br/>\nto shop. I like to make things (and I hope to instill this in my children<br/>\nas well).<br/>\n<br/>\nSo, this year I suggested we let the children exchange names because they<br/>\nalways get entirely tooooooooo much stuff! And people are actually<br/>\ncounting gifts and paying attention to spend the same amount of $ on each<br/>\nperson. It&#39;s ridiculous! But, I got horrible looks and &quot;but it&#39;s for the<br/>\nchildren.&quot;  Now really, Is it for the children? Because I would hope that<br/>\nmy children would not learn this holiday habit.<br/>\n<br/>\nAnyway, we&#39;re lost, my husband and I feel like the only one&#39;s in our<br/>\nfamily that get it!<br/>\nWe are truly happy with not having so much stuff. My garage is out of<br/>\ncontrol and that&#39;s how I feel too.   <br/>\n<br/>\nSoory to ramble but the need was there<br/>\nKathy in Houston, but moving soon!<br/>\n<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/tagj.\">http://dl.www.juno.com/get/tagj.</a></div>","specialLinks":[]},{"userId":0,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","replyTo":"LIST","senderId":"UTuxtbZ0vHk3dSwIpalmJqhsStK4EBZ0hcvsGJs4Npcr-GfSRkWUrdKlseRfixngj20hjzjk5WPC","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Re: Buy Nothing Day","postDate":"975438467","msgId":14266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRkLjQxMGI5YzMuMjc1NTVjODNAYW9sLmNvbT4="},"prevInTopic":14265,"nextInTopic":14274,"prevInTime":14265,"nextInTime":14267,"topicId":14265,"numMessagesInTopic":0,"msgSnippet":"In a message dated 00-11-28 12:55:25 EST, megates@juno.com writes: ","messageBody":"<div id=\"ygrps-yiv-789358086\">In a message dated 00-11-28 12:55:25 EST, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:megates@...\">megates@...</a> writes:<br/>\n<br/>\n&lt;&lt; Although I appreciate those who are motivated to hand-make or find the<br/>\n right gift at a thrift shop, I would prefer to just plain NOT RECEIVE<br/>\n more stuff that I don&#39;t need.  &gt;&gt;<br/>\n<br/>\nThe older I get the more I appreciate consummable gifts--candy, cookies, <br/>\nhomemade cheese, candles, homemade soap...<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":0,"authorName":"megates@juno.com","from":"megates@...","replyTo":"LIST","senderId":"Oygy25KFwviHwsu0MnynWySd5WVX80Y98ERIsJO0EVrP7hqg0g3LKSspPVM5mVi-9zqEZ3Crcg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Buy Nothing Day","postDate":"975433062","msgId":14265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMTI4LjA5Mzc0Ny4tNDYxNDIzLjQubWVnYXRlc0BqdW5vLmNvbT4="},"prevInTopic":0,"nextInTopic":14266,"prevInTime":14264,"nextInTime":14266,"topicId":14265,"numMessagesInTopic":0,"msgSnippet":"I enjoy John s essays too.  Thank you for sharing them!  I can appreciate the sentiment behind Buy Nothing Day and also agree that overall consumption really","messageBody":"<div id=\"ygrps-yiv-380039103\">I enjoy John&#39;s essays too.  Thank you for sharing them!  I can appreciate<br/>\nthe sentiment behind Buy Nothing Day and also agree that overall<br/>\nconsumption really is the main issue.  In the long run it doesn&#39;t make<br/>\nany difference WHEN you buy stuff, if you continue to buy more than you<br/>\nneed!<br/>\n<br/>\nI&#39;ve been doing a lot of soul-searching in the past year on simplifying<br/>\nand one of my major issues continues to be STUFF!  Although I and my<br/>\nchildren have received many wonderful, thoughtful gifts from family and<br/>\nfriends, we have also received a lot of stuff that we never would have<br/>\nchosen to bring into our house.  Dh and I are both genetically pack rats.<br/>\n It&#39;s very hard for us to get rid of something that someone special gave<br/>\nto us (or to the kids).  We have boxes in the garage that dh actually<br/>\nsaid &quot;we are saving so our kids can store it in their garages&quot;.  Our<br/>\ndecorating style is &quot;that used to be mom&#39;s and we will find somewhere to<br/>\nstick it&quot;!<br/>\n<br/>\nAlthough I appreciate those who are motivated to hand-make or find the<br/>\nright gift at a thrift shop, I would prefer to just plain NOT RECEIVE<br/>\nmore stuff that I don&#39;t need.  (Hope I don&#39;t sound too Grinchy.  It&#39;s not<br/>\nthe giving of gifts itself that bothers me.  It&#39;s the *mandatory* gift<br/>\ngiving that comes with this holiday season.)<br/>\n<br/>\nSpeaking of thrift shops, I found a pair of brand new GAP jeans, my size,<br/>\nfor $3.  Someone raised a good point about not buying things that support<br/>\npoor labor practices.  Well, we can each only work on so many cause at a<br/>\ntime, but the whole &quot;gotta have the name brand issue&quot; is sure food for<br/>\nthought.<br/>\n<br/>\nMary Ellen<br/>\nWho is trying to change herself for the better, but still has a loooong<br/>\nway to go!<br/>\n<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/tagj.\">http://dl.www.juno.com/get/tagj.</a></div>","specialLinks":[]}],"prevTopicId":14275,"nextTopicId":14290}}