{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Spanking Mean Girls - Daughter Follows Up With Letter","postDate":"1085404123","msgId":94595,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI2LjJjN2FkNzRmLjJkZTM0ZGRiQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":94594,"nextInTime":94596,"topicId":94595,"numMessagesInTopic":0,"msgSnippet":"I told DD s story here last week, about how she thought a group of girls sounded mean when they defended spanking as the way to bring up a good child. And we","messageBody":"<div id=\"ygrps-yiv-1877210947\">I told DD&#39;s story here last week, about how she thought a group of <br/>\ngirls sounded mean when they defended spanking as the way to bring up a good <br/>\nchild. And we  talked before here about the movie Mean Girls, which DD really <br/>\nloved both as comedy and social Power of Story. <br/>\n<br/>\n       Then she read a newspaper column about movies like Mean Girls being <br/>\nthe cause of bad girl behavior, by glorifying it. So now she&#39;s developed her own <br/>\ntheory about Mean Girls and spanking. It moved her to fire off a letter to <br/>\nthe editor. <br/>\n<br/>\n       This was totally her own motivation, ideas, and words, even her own <br/>\ntransmission to the paper by email. I never saw it, although as she worked on it <br/>\nshe read bits of it out loud while I was playing Scrabble with DS.  Anyway, <br/>\nit appears in today&#39;s newspaper, as follows:<br/>\n<br/>\nDon&#39;t Blame Movies for Girls&#39; Cruelty<br/>\n<br/>\nRe: &quot;Girl-on-girl cruelty isn&#39;t entertaining&quot; column, May 8.<br/>\n<br/>\n       The truth is, girls talk about other girls behind their backs and they <br/>\nsay mean things. Isn&#39;t it just as likely that these girls are the way they <br/>\nare because their parents spank or hit them, not because what they see in a <br/>\nmovie looks cool?<br/>\n<br/>\n       When a movie like &quot;Mean Girls&quot; comes along, girls don&#39;t like it <br/>\nbecause they want to emulate it or because it is cool, but because it is an exaggerat<br/>\ned version of what happens to them every day.<br/>\n<br/>\n       Outreach programs such as the ones the author mentioned are an <br/>\nexcellent idea, as is parent involvement, But to understand and curb this behavior, <br/>\nit is necessary to step back and consider that perhaps life is not imitating <br/>\nart (tv and movies) but art is imitating life.<br/>\n<br/>\n       And perhaps we should do something about THAT.<br/>\n<br/>\n       Signed, (DD)  Age 14<br/>\n<br/>\n<br/>\nNote: the newspaper&#39;s website isn&#39;t loading at the moment so I typed this in <br/>\nfrom the morning paper, but the uploaded version should be linked at <br/>\nwww.tallahassee.com in the Letters/editorial section if anyone wants to see it.  We&#39;ve  <br/>\nhad a couple of chuckling phone calls this morning from family friends, but <br/>\nDD herself is still asleep - these unschooled teens! &lt;grin&gt;   JJ<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":1193,"nextTopicId":94581}}