{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":464212763,"authorName":"Miliana","from":"Miliana &lt;milianajohnson@...&gt;","profile":"milianajohnson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Deschooling myself AND my child....","postDate":"1333645153","msgId":66558,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRDJGRUMwLTNBN0ItNEQ2Mi1CMDY3LUIxODM3OUMyNTRCMEB5YWhvby5jb20+"},"prevInTopic":66552,"nextInTopic":0,"prevInTime":66557,"nextInTime":66559,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"Hi Chris, I like your idea of lounge time. I will do something similar with my girls. They are very (happily) nonstop and, while they usually are fine with","messageBody":"<div id=\"ygrps-yiv-1859249489\">Hi Chris,<br/>\n<br/>\nI like your idea of &quot;lounge time.&quot; I will do something similar with my girls. They are very (happily) nonstop and, while they usually are fine with having quiet time after lunch - they go in their room and read books to themselves - they sometimes resist even tho&#39; they&#39;re tired. Maybe if we all snuggle in my bed and read we could all get some rest and have another chance to just be together. I suppose I&#39;m rather like them, there&#39;s so much to do I don&#39;t tend to give myself a break. <br/>\n<br/>\nAloha,<br/>\nMiliana<br/>\n<br/>\nSent from my iPhone; please excuse typos and auto corrections.</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling myself AND my child....","postDate":"1333554073","msgId":66552,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWR2QVhHPU1YM0NDczkzNFcyQ2UrcE1fdFNIRjdUenNFc3pvVVV0T3VTPXBud0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGpsZ3V0bis2c3AzQGVHcm91cHMuY29tPg==","referencesHeader":"PDc2ODVCMkFDLTg3OEEtNDVCRi1CNzRGLUZGMkVFODMwQTI0OEBTYW5kcmFkb2RkLmNvbT4JPGpsZ3V0bis2c3AzQGVHcm91cHMuY29tPg=="},"prevInTopic":66551,"nextInTopic":66558,"prevInTime":66551,"nextInTime":66553,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"You have mentioned that they seem tired several times.  I don t recall their exact ages, but I seem to remember that they are still fairly young. Have you","messageBody":"<div id=\"ygrps-yiv-1068941403\">You have mentioned that they seem tired several times.  I don&#39;t recall<br/>\ntheir exact ages, but I seem to remember that they are still fairly young.<br/>\nHave you thought about encouraging naps or a chill out time.<br/>\n<br/>\nWhen my kids were young enough that they got tired in the middle of the<br/>\nday, but too old to really nap, I would take us all up to my bedroom and<br/>\nput in a favorite video that was mellow.  By mellow, I mean not a lot of<br/>\nupbeat music, not a lot of exciting voices, and a fairly quiet story.<br/>\nThomas the tank engine was good.  After that we would watch some music<br/>\nvideos by Animusic.  Sometimes the kids would doze and sometimes not, but<br/>\nwe all got a recharge out of it and it was a very special quiet cuddle time<br/>\nfor all of us.  We probably did this until my youngest was about 8 or 9,<br/>\nmaybe even 10.<br/>\n<br/>\nWe have never had bedtimes, but sometimes they would wake up early and be<br/>\nready to eat about their own weight worth of food.  Well, they would often<br/>\nnap during our quiet time those days.<br/>\n<br/>\nI want to stress that this wasn&#39;t an enforced rule, it was me saying that I<br/>\nwould love if we could go up and lounge in bed and watch the TV.  We didn&#39;t<br/>\ninterrupt other things to do this.  I would suggest it by stating that I<br/>\nreally would enjoy a little lounge time.  My children always loved the idea<br/>\nand seemed to enjoy the experience.  I don&#39;t think that they would of<br/>\nthought of this themselves and a nap time where I sent them off by<br/>\nthemselves would never have been good, but the communal nature of the quiet<br/>\ntime made it a together activity.  Not to mention it was good for me, I was<br/>\nnever a nap person and wasn&#39;t always good at judging my own sleep needs, so<br/>\nI learned to tune into my own energy levels.  The kids learned by watching<br/>\nme take time to take care of my need to rest.<br/>\n<br/>\nChris<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling myself AND my child....","postDate":"1333534560","msgId":66551,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEODc4QzYyLUM5NTgtNDIxRi1BODI5LTUzNThDQ0Y3QjM2N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpsZ3V0bis2c3AzQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsZ3V0bis2c3AzQGVHcm91cHMuY29tPg=="},"prevInTopic":66550,"nextInTopic":66552,"prevInTime":66550,"nextInTime":66552,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"-=-Okay. I feel pretty comfortable with simply saying, I m happy to get that for you. Could you practice asking in another tone of voice? -=- Why not just","messageBody":"<div id=\"ygrps-yiv-1495052765\">-=-Okay. I feel pretty comfortable with simply saying, &quot;I&#39;m happy to get that for you. Could you practice asking in another tone of voice?&quot; -=-<br/>\n<br/>\nWhy not just get the thing for her?<br/>\n<br/>\nIf your husband asked you for a tissue or a glass of water, would you say &quot;I&#39;m happy to get that for you&quot;?<br/>\n<br/>\nIf the whining is in response to your own action or inaction or over-wordiness, changing your own behavior might undo a lot of the whining.  So will time.  They&#39;re very young.<br/>\n<br/>\nAnd this is too much, too:   &quot;Could you practice asking in another tone of voice?&quot;  <br/>\nDon&#39;t ask another person to practice being.  Ask them to be (IF you can&#39;t figure out a way to change the environment and your own responses).<br/>\n<br/>\nDon&#39;t practice being a better, more present mom.  BE.  Each time you speak, or wait, or smile, or touch, you&#39;re actually doing it.  You&#39;re not practicing doing it.<br/>\n<br/>\n-=**Too many words, and too much about you.**<br/>\n<br/>\n-=-Yes. Can you suggest an alternative?-=-<br/>\n<br/>\nI think I did.  I think others did.  But it&#39;s not &quot;an alternative.&quot;  It&#39;s all of unschooling.<br/>\nThe alternative to &quot;too many words&quot; is fewer words.<br/>\nThe alternative to &quot;too much about you&quot; is to make it more about them.<br/>\n<br/>\nThis page is about how to be more present and more peaceful:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\nIn the sound file at the bottom, which toggles between part one and part two (the &quot;next&quot; button changes tracks).  If you don&#39;t want to listen to the whole thing, listen to the part about making choices, between 33:13 and around 36:00.  Some of it refers back to other stories, but it&#39;s about how to make incrementally better choices.<br/>\n<br/>\nAnd this:<br/>\n&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":464212763,"authorName":"Miliana Johnson","from":"&quot;Miliana Johnson&quot; &lt;milianajohnson@...&gt;","profile":"milianajohnson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Deschooling myself AND my child....","postDate":"1333526263","msgId":66550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsZ3V0bis2c3AzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc2ODVCMkFDLTg3OEEtNDVCRi1CNzRGLUZGMkVFODMwQTI0OEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66548,"nextInTopic":66551,"prevInTime":66549,"nextInTime":66551,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"-=-My own daughters seem a little more whiny now that they re out of school. I m trying to ignore it and just focus on loving them and being kind.-=- **Did","messageBody":"<div id=\"ygrps-yiv-1605170820\">-=-My own daughters seem a little more whiny now that they&#39;re out of school. I&#39;m trying to ignore it and just focus on loving them and being kind.-=-<br/>\n<br/>\n**Did they want to leave school?<br/>\nWhen a child is taken out of school who would have preferred to have stayed, that can be a problem for a long time.  Forever.<br/>\n <br/>\nIgnoring &quot;it&quot; is ignoring them, potentially. <br/>\n<br/>\nWhen one of my kids would whine (it was usually Marty), depending on what mood he was in I might joke or I might just ask, or I might ignore it (if I knew he wouldn&#39;t be in the mood for  having it pointed out.  So it depends.  But sometimes I would whine back, and say &quot;I can&#39;t understaYannd you when you WHyeeene.&quot;  Never in a mean way, in a mirroring-the-song-of-it way.  And he would laugh, and it only happened a couple of times, because it was effective.  Or I would ask if he could say it a different way, and he would.  But sometimes a person is too tired or frustrated to communicate in another way.  <br/>\n<br/>\nI think it would be as bad to NEVER mention it, and it would be to ALWAYS mention it.**<br/>\n<br/>\nBefore I took them out of school I asked if they were ready to stay home from school because it seemed to me they were.  They said yes, they were.  Though they expressed regret about not seeing their school friends every day.<br/>\n<br/>\nSince we have begun our new lifestyle they have not expressed any regret but have mentioned they&#39;d like to have play dates with their friends.<br/>\n<br/>\nI have been sympathetic and very attentive, looking for signs of wishing to be at school.  I haven&#39;t seen any. Today I asked if they missed school.  Both girls said they missed their friends but not school itself.  Calling parents about play dates is on tomorrow&#39;s to-do list.<br/>\n<br/>\nBy &quot;ignoring&quot; the whininess I mean I don&#39;t react, positively or negatively, to how they&#39;ve couched their requests but respond directly to what they&#39;re asking for.  I do, however, think about why they might be whiny - new schedule, which may be too open-ended for them just yet, too tired (they rarely whine in the morning but seem emotionally fragile many evenings), etc.  When they are home with me all day they are less whiny in the evening, perhaps because we have a half hour of quiet time after lunch.  When they go out to Grannie&#39;s or to the farm with their father they whine more and are more likely to break down in tears, perhaps because they are playing nonstop.<br/>\n<br/>\n<br/>\n-=-When I do get frustrated with whiny demands I usually say, &quot;I want to help you get what you want and I will get you [xyz] but I don&#39;t appreciate being spoken to like that.&quot;-=-<br/>\n<br/>\n**Too many words, and too much about you.**<br/>\n<br/>\nYes.  Can you suggest an alternative?<br/>\n<br/>\nWhen I think about an alternative I see myself getting [xyz] and giving it to them with a hug.  I would love to be that selfless.  But, as I said, it&#39;s when I&#39;m frustrated that I resort to too many words and too much about me.  I find it difficult to just be quiet and kind when I am frustrated.<br/>\n<br/>\n-=-Curious to know if radical homeschooling recommends I keep my mouth shut when frustrated.-=-<br/>\n<br/>\nThat is worded in an interesting way, and a revealing way.<br/>\n<br/>\n&quot;Radical unschooling&quot; doesn&#39;t recommend anything.  Different individuals who have incorporated radical unschooling into their lives might make different recommendations.  You will need to incorporate radical unschooling into your own life.  The way that happens is to read some, try some of the ideas, wait to see how it goes, and try some more, or some different things if it&#39;s not working for you.  You can&#39;t ask a question that gets an answer that you can use once and for all.  It&#39;s a process of learning, for the parent.  And of the creation of new patterns and habits.  That takes a while.<br/>\n<br/>\nI don&#39;t think &quot;keep your mouth shut when frustrated&quot; is going to be anyone&#39;s blanket recommendation.<br/>\n<br/>\nAn equally bad idea is &quot;every time you&#39;re frustrated, express that completely.&quot;<br/>\n<br/>\nSo &quot;the answer&quot; is to be conscious and thoughtful, considerate, aware.  Don&#39;t say or do anything without thinking first.  And make the better choice.  &quot;Better&quot; is going to depend on a lot of things around you.  But each time you act without thinking, you will have acted (literally and plainly) thoughtlessly. **<br/>\n<br/>\nOkay.<br/>\n <br/>\n-=-It does seem to heighten the drama, not cool it.-=-<br/>\n<br/>\n**Try not to think of their best attempts to express themselves as &quot;drama.&quot;<br/>\nTry not to see their communication with you as &quot;drama.&quot;<br/>\nAnd if you DO see it that way, certainly try not to add more &quot;drama.&quot;**<br/>\n<br/>\nMost of the time it&#39;s not drama to me.  Most of the time I&#39;m fully aware that they are very serious about what&#39;s important to them and am able to keep in mind that their ability to verbalize that decreases when they are tired.  I think of it as drama when I am surprised by the direction their emotions take them, as if they&#39;re not ready to be calm and latch their emotions onto something I didn&#39;t even know about until right then, and find myself in the middle of very loud crying where nothing I do or say has any positive effect.<br/>\n<br/>\nThese events are relatively rare, by the way, but have happened slightly more often since I took them out of school.  It may be less about the transition than about being more tired at the end of a busier day.<br/>\n<br/>\n-=-Also curious to know if radical homeschooling recommends talking about it - or mentioning it and dropping the subject if they&#39;re not interested - at a time when they are happy and open to discussion. -=-<br/>\n<br/>\n**Don&#39;t put the downer on happiness by discussing your unhappiness at that time.  Try to increase peace and joy.  That takes practice.**<br/>\n<br/>\nOkay.  I feel pretty comfortable with simply saying, &quot;I&#39;m happy to get that for you.  Could you practice asking in another tone of voice?&quot;  Most of the time that keeps the mood light.  I think I need to work on recognizing when the mood isn&#39;t light enough to handle that and the kids just need what they need before they go to bed.<br/>\n<br/>\n**How long have they been home, how old are they and did they come home voluntarily?<br/>\n(Even if you&#39;ve already answered elsewhere, please review it again, as there have been 18 new members in the past week.)<br/>\n<br/>\nSandra**<br/>\n<br/>\nElla is 6, Jane is 4.  They were attending a small Montessori school 4 days a week.  Last Monday was the beginning of the end of school.  They did come home voluntarily though I believe Jane would happily go back most days.<br/>\n<br/>\nElla is mightily independent and did not appreciate being taught.  She wants to be an explorer when she grows up and all I was seeing from her school experience (which was different than Jane&#39;s, as the teacher considered Ella in 1st grade and was beginning to give her lessons and homework) was a lessening of that intense curiosity and the beginning of &quot;I&#39;m not good at this.&quot;  It was breaking my heart.<br/>\n<br/>\nI had intended to keep them in school until the end of the school year but decided to take them out earlier when the teacher (admittedly at a very tired moment, speaking of being tired) told me she was at her wit&#39;s end with Ella, couldn&#39;t control her, had been having a hard time with her for years, etc.  No matter how good-hearted this teacher is (and she really is) it seemed like keeping Ella there would be detrimental to everyone.  It means a steeper learning curve for me, perhaps, or maybe just more fun, sooner.<br/>\n<br/>\nAloha,<br/>\nMiliana</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Deschooling myself AND my child....","postDate":"1333497265","msgId":66548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsZzJqaCtkZzVtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE3RTk0Mzc1LUNGNUMtNEU5Qy1CODVELTYxNjdFNjc4REI3RUB5YWhvby5jb20+"},"prevInTopic":66547,"nextInTopic":66550,"prevInTime":66547,"nextInTime":66549,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"... *************** It can help to step back from radical unschooling and think about your principles and goals. Do you Want to heighten the drama? But it","messageBody":"<div id=\"ygrps-yiv-1785016302\">Miliana &lt;milianajohnson@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Curious to know if radical homeschooling recommends I keep my mouth shut when frustrated. It does seem to heighten the drama, not cool it.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt can help to step back from &quot;radical unschooling&quot; and think about your principles and goals. Do you Want to heighten the drama? But it can also help you to think about why he&#39;s whining - are you hearing what he says the first time? Are you saying &quot;just a minute&quot; a lot? It could help to be more responsive so he&#39;s not in the position of pushing you harder. Remember, to a little kid, &quot;a minute&quot; can feel like an eternity... especially those grown-up minutes which are more like ten!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Also curious to know if radical homeschooling recommends talking about it - or mentioning it and dropping the subject if they&#39;re not interested - at a time when they are happy and open to discussion. <br/>\n </span></blockquote>**************<br/>\n<br/>\nIf you change your behavior and the problem goes away, there&#39;s nothing to talk about ;) Beyond that, it&#39;s helpful to consider how your child responds to those kinds of conversations. Is she likely to be offended? to shut down? to get mad at you? Any of those would suggest a direct approach may not be helpful. If you&#39;re not sure, you can give it a try - you&#39;re not committed to have a &quot;meaningful conversation&quot; about every topic forever more just for trying it now and then to see if that kind of communication works between you and your child. <br/>\n<br/>\nAnother option is to talk about yourself rather than your child&#39;s behavior directly. Are there times when you whine or snap when that hasn&#39;t worked for you? What do you do when you feel like whining but don&#39;t want to hurt someone&#39;s feelings? But a young child whining usually means &quot;hey! mom! you aren&#39;t listening!&quot; from the child&#39;s perspective - so start with that part. One of the good things about having an only child is you&#39;ve only got One of those voices!<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":86348316,"authorName":"brightman73","from":"&quot;brightman73&quot; &lt;brightman73@...&gt;","profile":"brightman73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Deschooling myself AND my child....","postDate":"1333484137","msgId":66547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsZmxwOSthaDBkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFBNEE2OUE1LTg3QzEtNEVFMi04MkIyLUMzQkJCOTAzREIwMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66543,"nextInTopic":66548,"prevInTime":66546,"nextInTime":66548,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"... new perspective. Become his partner in exploration. You can t possibly have seen things through his eyes when you were in college. HI Sandra, I didn t take","messageBody":"<div id=\"ygrps-yiv-1977481729\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I wasn&#39;t suggesting you get a babysitter and tour your town.<br/>\n&gt; Take your child to see things. HE should be your new meaning and your<br/>\n </span></blockquote>new perspective. Become his partner in exploration. You can&#39;t possibly<br/>\nhave seen things through his eyes when you were in college.<br/>\n<br/>\n<br/>\nHI Sandra, I didn&#39;t take the suggestion that way at all.  I don&#39;t want<br/>\nto get a sitter and explore alone- I want to explore his interests<br/>\n*with* him.  I want to found out his highest values, where he shines and<br/>\nthat means, for me, reexploring my world.  I love it!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; -=-For at<br/>\n&gt; least ten years now I have stopped doing so, thinking I saw it all in<br/>\n&gt; college. As a result, my life has become very small. I am tired of<br/>\n&gt; thinking I have seen everything, because I haven&#39;t. -=-<br/>\n&gt;<br/>\n&gt; This sounds like the &quot;seen it, done that, it&#39;s stupid&quot; cynicism many<br/>\n </span></blockquote>people pick up to impress friends or to fend off the world, in college,<br/>\nor sooner<br/>\n<br/>\nYes, it is a horrible cynicism and I  am so glad I snapped out of it. <br/>\nSome don&#39;t.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Your story of going to the zoo was quite positive and hopeful. When<br/>\n </span></blockquote>you make little decisions, remember positive things like that, and with<br/>\nthat image in mind you can make the choices that will move toward<br/>\nsimilar outcomes and feelings.<br/>\n<br/>\nThank you.  Off to check out your links.<br/>\n<br/>\nThe zoo gave me something to compare.  For example, today at the art<br/>\nmuseum our experience was less joyful.  I&#39;m not sure that was a good fit<br/>\nfor him at this point.  His much more of an outdoor/swing/slide/zoo kid<br/>\nat this point.  However, it was worth going because I am learning to see<br/>\nwhere is happiest.<br/>\n<br/>\nStephanie<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; These might help:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a><br/>\n&gt;<br/>\n&gt; Sandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling myself AND my child....","postDate":"1333454641","msgId":66543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFBNEE2OUE1LTg3QzEtNEVFMi04MkIyLUMzQkJCOTAzREIwMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpsZWNmdCszNTkwQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsZWNmdCszNTkwQGVHcm91cHMuY29tPg=="},"prevInTopic":66542,"nextInTopic":66547,"prevInTime":66542,"nextInTime":66544,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"-=- I am tired of thinking I have seen everything, because I haven t.  I also know that my perspective has changed so things will have new meaning for me. -=- ","messageBody":"<div id=\"ygrps-yiv-50232439\">-=- I am tired of<br/>\nthinking I have seen everything, because I haven&#39;t.  I also know that my<br/>\nperspective has changed so things will have new meaning for me. -=-<br/>\n<br/>\nI wasn&#39;t suggesting you get a babysitter and tour your town.<br/>\nTake your child to see things.  HE should be your new meaning and your new perspective.  Become his partner in exploration.  You can&#39;t possibly have seen things through his eyes when you were in college.<br/>\n<br/>\n-=-For at<br/>\nleast ten years now I have stopped doing so, thinking I saw it all in<br/>\ncollege. As a result, my life has become very small. I am tired of<br/>\nthinking I have seen everything, because I haven&#39;t. -=-<br/>\n<br/>\nThis sounds like the &quot;seen it, done that, it&#39;s stupid&quot; cynicism many people pick up to impress friends or to fend off the world, in college, or sooner.  It can be another part of the barnacles and rust that gather in school-world.  But as with many things, some families bring it home and pass it to their unschooled children, so part of your own deschooling should be cleansing yourself of some of that &quot;knowledge&quot; and negativity so that you can create the sort of environment that can keep your son from living with that.<br/>\n<br/>\nYour story of going to the zoo was quite positive and hopeful.  When you make little decisions, remember positive things like that, and with that image in mind you can make the choices that will move toward similar outcomes and feelings.<br/>\n<br/>\nThese might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/negativity\">http://sandradodd.com/negativity</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners/child\">http://sandradodd.com/partners/child</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":86348316,"authorName":"brightman73","from":"&quot;brightman73&quot; &lt;brightman73@...&gt;","profile":"brightman73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Deschooling myself AND my child....","postDate":"1333441853","msgId":66542,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsZWNmdCszNTkwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMzODg3QjY3LUNFMkUtNDQ2OC04NDAzLUVBMTBEMkI3RDEwMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":66534,"nextInTopic":66543,"prevInTime":66541,"nextInTime":66543,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"... person to another person. ... compulsory school age yet. Make your days happy. Get out of the house and go cool places and do things as though you were","messageBody":"<div id=\"ygrps-yiv-499427013\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I just really noticed the subject/title.<br/>\n&gt; You don&#39;t deschool a child. Deschooling happens. It is not done by one<br/>\n </span></blockquote>person to another person.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; This isn&#39;t going to be very difficult deschooling, as he&#39;s not<br/>\n </span></blockquote>compulsory school age yet. Make your days happy. Get out of the house<br/>\nand go cool places and do things as though you were tourists in your own<br/>\ntown.<br/>\n<br/>\n*****************<br/>\n<br/>\nThank you Sandra!  I was happy to see your suggestions.  I subscribed to<br/>\nour local paper so I could start exploring my community again.  For at<br/>\nleast ten years now I have stopped doing so, thinking I saw it all in<br/>\ncollege.  As a result, my life has become very small.  I am tired of<br/>\nthinking I have seen everything, because I haven&#39;t.  I also know that my<br/>\nperspective has changed so things will have new meaning for me.  Today<br/>\nwe are going to Toddler Tuesdays at the art museum, something I have<br/>\nwanted to do with him since he was born, but never got around to it.<br/>\n<br/>\nI am glad to know *his* deschooling process will not take long.  You are<br/>\nright, it is not something I do to him.  Thank you for that clarity.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling myself AND my child....","postDate":"1333411707","msgId":66534,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0QzE1Nzc0LTFDM0YtNDcyRi05NjAyLUZGNjE2REE0MjJCN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMzM0MDA4NTQuODMzNzkuWWFob29NYWlsTmVvQHdlYjExNDQxMS5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PGpsY3RqOSthNWxsQGVHcm91cHMuY29tPiA8ODE0NkM2RUEtNjRFMy00NTZELTk1MDYtNzgwMzJDNjg3QjMyQFNhbmRyYWRvZGQuY29tPiA8MTMzMzQwMDg1NC44MzM3OS5ZYWhvb01haWxOZW9Ad2ViMTE0NDExLm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":66533,"nextInTopic":66542,"prevInTime":66533,"nextInTime":66535,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"-=-I ask for a little patience if I use phrasing that others find incorrect. I am newer to unschooling and can only offer tips or suggestions from experiences","messageBody":"<div id=\"ygrps-yiv-1382555\">-=-I ask for a little patience if I use phrasing that others find incorrect. I am newer to unschooling and can only offer tips or suggestions from experiences I have had. -=-<br/>\n<br/>\nIt will be better for the readers of the discussion if you don&#39;t offer tips or suggestions regarding experiences that happened before you were unschooling.  At first, for a while, read and try things out with your own children.  When your experiences start to be unschooling experiences, and when you&#39;re at the point that you can tell which phrasing would be from your older thoughts, and which really has to do with unschooling, then it might be time to post.<br/>\n<br/>\nIf the idea that this list should only contain suggestions from unschoolers seems too restrictive, you might try the Unschooling Basics list (you could stay on both, certainly).  I suspect they will have a similar attitude, but it&#39;s intended more for those newer to unschooling.  You&#39;re welcome to stay, but let&#39;s try to keep the discussion centered on radical unschooling.  Thanks.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling myself AND my child....","postDate":"1333409504","msgId":66533,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCMEFCMDY4LTM0QzUtNDc5Qy1CQTYzLUYyQjUwNzg2NDEyQkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDEzMzM0MDA4NTQuODMzNzkuWWFob29NYWlsTmVvQHdlYjExNDQxMS5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PGpsY3RqOSthNWxsQGVHcm91cHMuY29tPiA8ODE0NkM2RUEtNjRFMy00NTZELTk1MDYtNzgwMzJDNjg3QjMyQFNhbmRyYWRvZGQuY29tPiA8MTMzMzQwMDg1NC44MzM3OS5ZYWhvb01haWxOZW9Ad2ViMTE0NDExLm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":66532,"nextInTopic":66534,"prevInTime":66532,"nextInTime":66534,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"... This was in the original post: -=- Try not to make a big deal of it, but see if maybe they can tell you what is upsetting them. If they cannot or will not","messageBody":"<div id=\"ygrps-yiv-720177670\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; &quot;&quot;Drop it&quot; is a harsh thing to think about a child&#39;s concerns. &quot;<br/>\n&gt;<br/>\n&gt; Perhaps I used the wrong wording, however if the child does not want  <br/>\n&gt; to talk about it, pushing them may create a whole new issue.<br/>\n<br/>\n </span></blockquote>This was in the original post:<br/>\n<br/>\n-=- Try not to make a big deal of it, but see if maybe they can tell  <br/>\nyou what is upsetting them. If they cannot or will not drop it and try  <br/>\ncalling someone who is willing to listen while you take a few moments  <br/>\nto vent (out of earshot, it&#39;s what I have to do some days.) -=-<br/>\n<br/>\nThat didn&#39;t sound like you meant the *parent* should drop it, but that  <br/>\nthe child &quot;cannot or will not drop it&quot;.<br/>\n<br/>\nI think what you meant to say was &quot;If they cannot or will not (comma)  <br/>\ndrop it and try calling someone....&quot;<br/>\n<br/>\nPunctuation is important for clarity (says the copyeditor)!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I should have said to wait until they seem ready or able to discuss  <br/>\n&gt; it instead of drop it.<br/>\n<br/>\n </span></blockquote>That might have been clearer, yes.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I ask for a little patience if I use phrasing that others find  <br/>\n&gt; incorrect. I am newer to unschooling and can only offer tips or  <br/>\n&gt; suggestions from experiences I have had.<br/>\n<br/>\n </span></blockquote>I don&#39;t think being new to unschooling has much to do with clarity of  <br/>\nthought and writing, although being on this list will will definitely  <br/>\nhelp with that :-)<br/>\n<br/>\nTips and suggestions that don&#39;t come from an unschooling point of  <br/>\nview, though, are less likely to help those moving more fully towards  <br/>\nunschooling. That&#39;s not to say that someone new doesn&#39;t understand or  <br/>\nembrace a radical unschooling point of view, but it usually takes time  <br/>\nand experience to be able to offer helpful suggestions.<br/>\n<br/>\n<br/>\nI know Sandra says this every so often, but I&#39;ll say it since there  <br/>\nare 18 new members. Please read here for a few weeks before posting to  <br/>\nunderstand the tone and purpose of this list; read the links offered  <br/>\nin the welcome message. Ask some questions, even!<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":448281092,"authorName":"Kim C","from":"Kim C &lt;momrex36@...&gt;","profile":"momrex36","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling myself AND my child....","postDate":"1333400854","msgId":66532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzM0MDA4NTQuODMzNzkuWWFob29NYWlsTmVvQHdlYjExNDQxMS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDgxNDZDNkVBLTY0RTMtNDU2RC05NTA2LTc4MDMyQzY4N0IzMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGpsY3RqOSthNWxsQGVHcm91cHMuY29tPiA8ODE0NkM2RUEtNjRFMy00NTZELTk1MDYtNzgwMzJDNjg3QjMyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":66531,"nextInTopic":66533,"prevInTime":66531,"nextInTime":66533,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"Sandra, Sometimes analogies are good, but in a case where a child has gone from a school to home, thinking of home as another school creates a muddle.  ","messageBody":"<div id=\"ygrps-yiv-822856561\">Sandra,<br/>\n<br/>\n&quot;Sometimes analogies are good, but in a case where a child has gone from a school to home, thinking of home as another school creates a muddle. &quot;<br/>\n<br/>\n<br/>\nWhich is my point. The child may be viewing it as such, hence the child may have the same anxieties as moving to a different school. Or they may not be viewing it as a place to learn (ie, they have the way public schools do things ingrained into their heads) and are confused and do not know how to express this. I was not trying to say that the home is a new school but it has changed the child&#39;s learning environment from the brick and mortar school house back to a more organic setting. It was a thought that I tossed out there because I have heard other parents who have removed children from public schools have this issue.<br/>\n<br/>\n&quot;&quot;Drop it&quot; is a harsh thing to think about a child&#39;s concerns. &quot;<br/>\n<br/>\n<br/>\nPerhaps I used the wrong wording, however if the child does not want to talk about it, pushing them may create a whole new issue. I know I may not always be willing to discuss something upsetting me while I am upset. When my partner pushes instead of giving me a few minutes to compose my thoughts or feelings it leads instead to hurt feelings. He&#39;s a very in the moment sort of person. When he waits then we have open dialog.and I feel more open to talking. I should have said to wait until they seem ready or able to discuss it instead of drop it. I meant it to refer more to that moment than completely.<br/>\n<br/>\nI ask for a little patience if I use phrasing that others find incorrect. I am newer to unschooling and can only offer tips or suggestions from experiences I have had. I have never placed labels on what my children and I do within our home because I felt no need for them. When I ask for advice or try to aid someone else with experiences I have had or ideas I am often at a loss for using any words except those I am more used to.<br/>\n<br/>\nThanks for the website suggestion!<br/>\n<br/>\nKimberly<br/>\n<br/>\n________________________________<br/>\n From: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Monday, April 2, 2012 2:59 PM<br/>\nSubject: Re: [AlwaysLearning] Re: Deschooling myself AND my child....<br/>\n <br/>\n<br/>\n  <br/>\n-=-Think of it like this with your daughters, you have moved them &quot;schools&quot; (I use the term schools loosely, but I feel it fits). They do not yet know how this &quot;new school&quot; works. -=-<br/>\n<br/>\nSometimes analogies are good, but in a case where a child has gone from a school to home, thinking of home as another school creates a muddle.<br/>\n<br/>\n-=-Try not to make a big deal of it, but see if maybe they can tell you what is upsetting them. If they cannot or will not drop it and try calling someone who is willing to listen while you take a few moments to vent -=-<br/>\n<br/>\n&quot;Drop it&quot; is a harsh thing to think about a child&#39;s concerns.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\nThose ideas have been collected from experienced unschoolers for many years. <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Deschooling myself AND my child....","postDate":"1333396904","msgId":66531,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMzODg3QjY3LUNFMkUtNDQ2OC04NDAzLUVBMTBEMkI3RDEwMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpsYWNucit0Y205QGVHcm91cHMuY29tPg==","referencesHeader":"PGpsYWNucit0Y205QGVHcm91cHMuY29tPg=="},"prevInTopic":66530,"nextInTopic":66532,"prevInTime":66530,"nextInTime":66532,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"-=-\tSubject: \t[AlwaysLearning] Deschooling myself AND my child....-=- I just really noticed the subject/title. You don t deschool a child.  Deschooling","messageBody":"<div id=\"ygrps-yiv-1235143625\">-=-\tSubject: \t[AlwaysLearning] Deschooling myself AND my child....-=-<br/>\n<br/>\nI just really noticed the subject/title.<br/>\nYou don&#39;t deschool a child.  Deschooling happens.  It is not done by one person to another person.<br/>\n<br/>\n-=-I can see my son, 3 1/2, has really been affected by his little school. -=-<br/>\n<br/>\nThis isn&#39;t going to be very difficult deschooling, as he&#39;s not compulsory school age yet.  Make your days happy. Get out of the house and go cool places and do things as though you were tourists in your own town.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling myself AND my child....","postDate":"1333396773","msgId":66530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxNDZDNkVBLTY0RTMtNDU2RC05NTA2LTc4MDMyQzY4N0IzMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpsY3RqOSthNWxsQGVHcm91cHMuY29tPg==","referencesHeader":"PGpsY3RqOSthNWxsQGVHcm91cHMuY29tPg=="},"prevInTopic":66529,"nextInTopic":66531,"prevInTime":66529,"nextInTime":66531,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"-=-Think of it like this with your daughters, you have moved them schools (I use the term schools loosely, but I feel it fits). They do not yet know how this","messageBody":"<div id=\"ygrps-yiv-1394158195\">-=-Think of it like this with your daughters, you have moved them &quot;schools&quot; (I use the term schools loosely, but I feel it fits). They do not yet know how this &quot;new school&quot; works. -=-<br/>\n<br/>\nSometimes analogies are good, but in a case where a child has gone from a school to home, thinking of home as another school creates a muddle.<br/>\n<br/>\n-=-Try not to make a big deal of it, but see if maybe they can tell you what is upsetting them. If they cannot or will not drop it and try calling someone who is willing to listen while you take a few moments to vent -=-<br/>\n<br/>\n&quot;Drop it&quot; is a harsh thing to think about a child&#39;s concerns.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\nThose ideas have been collected from experienced unschoolers for many years. <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling myself AND my child....","postDate":"1333396227","msgId":66528,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyRUU4MzlGLUFGMEEtNEQ1Ni05QkRCLUUyMDdFQjMyN0RDN0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGpsY3VjYys4MmM5QGVHcm91cHMuY29tPg==","referencesHeader":"PGpsY3VjYys4MmM5QGVHcm91cHMuY29tPg=="},"prevInTopic":66527,"nextInTopic":66529,"prevInTime":66527,"nextInTime":66529,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"... I d be quieter about unschooling right now because you re still learning. Going about your life without proselytizing will make it easier on you both! ","messageBody":"<div id=\"ygrps-yiv-1194513850\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I guess I am on the unschooling train - superexcited and want to  <br/>\n&gt; share it!  Then get looked at as if I had three heads and I realize  <br/>\n&gt; that others don&#39;t share my views, even other home schoolers.  I  <br/>\n&gt; think it really is about me to be respectful and make sure I am not  <br/>\n&gt; criticizing another parent&#39;s choice.<br/>\n<br/>\n </span></blockquote>I&#39;d be quieter about unschooling right now because you&#39;re still  <br/>\nlearning. Going about your life without proselytizing will make it  <br/>\neasier on you both!<br/>\n<br/>\n&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n<br/>\nIf people ask, then you can share. You can even give them a couple of  <br/>\nwebsites (Sandra&#39;s for instance) if they want to know more.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":86348316,"authorName":"brightman73","from":"&quot;brightman73&quot; &lt;brightman73@...&gt;","profile":"brightman73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Deschooling myself AND my child....","postDate":"1333394636","msgId":66527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsY3VjYys4MmM5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhPZXN4MHExaTVnZ3EteFZ1XzVpOFQtazVZZ0trQyt2N0pVdThVQVVaU1ZmQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":66525,"nextInTopic":66528,"prevInTime":66526,"nextInTime":66528,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"Thanks for the thoughtful responses everyone! I guess I am on the unschooling train - superexcited and want to share it!  Then get looked at as if I had three","messageBody":"<div id=\"ygrps-yiv-862953015\">Thanks for the thoughtful responses everyone!<br/>\n<br/>\nI guess I am on the unschooling train - superexcited and want to share it!  Then get looked at as if I had three heads and I realize that others don&#39;t share my views, even other home schoolers.  I think it really is about me to be respectful and make sure I am not criticizing another parent&#39;s choice.<br/>\n<br/>\nThere has been no whining today!  The five days, since I have brought him home, I have made a point to let him know he will get a YES from me unless there is a reason involving safety.  He has been so affectionate - asking for hugs!  He is much happier now and I think he is starting to trust when i do say no, it is not just to be mean or controlling - which had been the case before.<br/>\n<br/>\nI gave him a &quot;snack shelf&quot; today.  He was so excited that he wanted to leave the containers on the table.  I think he was afraid it would get taken away.  Trust is building.  I am only so relieved I saw what I (and the school) were doing to his psyche in regards to how he viewed the world, his parents, and himself.</div>","specialLinks":[]},{"userId":448281092,"authorName":"momrex36","from":"&quot;momrex36&quot; &lt;momrex36@...&gt;","profile":"momrex36","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Deschooling myself AND my child....","postDate":"1333393833","msgId":66529,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsY3RqOSthNWxsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE3RTk0Mzc1LUNGNUMtNEU5Qy1CODVELTYxNjdFNjc4REI3RUB5YWhvby5jb20+"},"prevInTopic":66528,"nextInTopic":66530,"prevInTime":66528,"nextInTime":66530,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"Miliana, I do not know if my story of a whiny child will aid or not, but perhaps it will let you know you are not alone in dealing with one. My family and I","messageBody":"<div id=\"ygrps-yiv-1162959674\">Miliana,<br/>\n<br/>\n     I do not know if my story of a whiny child will aid or not, but perhaps it will let you know you are not alone in dealing with one. My family and I recently moved and before the move and for a time after the move my middle child became extremely whiny. I was at my wits end with him when I decided to call a child therapist. She told me that change to a child can be as stressful, if not more stressful than an adult.Plus they have less experience in how to express this stress, hence the whining. The first thing I did the next time he was whiny was to ask him if he was sad. In the course of the conversation he told me he was sad about moving. I took some time and explained why we were moving and where we were moving and the like. After the move it took about a month for him to fully settle down, it was a slow process for us. However, one thing that helped was keeping as much as the same schedule and activities as possible. He realized that a new home did not mean he missed out on his favorite things and he even found some new activities. <br/>\n<br/>\nThink of it like this with your daughters, you have moved them &quot;schools&quot; (I use the term schools loosely, but I feel it fits). They do not yet know how this &quot;new school&quot; works. It could be that they are worried, as any new student would be, will I still have friends, will the teacher be mean (I know that is you but they may worry about your expectations of them), what if  the school work is too hard. Or they could be worried that they will miss out on things they enjoyed at school. Plus I would image that shifting from a strict school environment to an unschooling one may be a little jarring and my add to their stress. Try asking them one day when they are whiny if they are sad or frustrated. Then follow the course of the conversation. Try not to make a big deal of it, but see if maybe they can tell you what is upsetting them. If they cannot or will not drop it and try calling someone who is willing to listen while you take a few moments to vent (out of earshot, it&#39;s what I have to do some days.) Also you could try to have some of their friends over, or plan an activity such as the zoo or museum that may not have been possible to easily fit in on a weekday before.<br/>\n<br/>\nJust hang in there and know that it can get better, it just might take a little time and ingenuity. <br/>\n<br/>\nKimberly<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Miliana &lt;milianajohnson@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My own daughters seem a little more whiny now that they&#39;re out of school. I&#39;m trying to ignore it and just focus on loving them and being kind. There are a lot of reasons we would all be more emotional right now and I have found it very easy, most of the time, to just give extra hugs and kisses and listen to them.<br/>\n&gt; <br/>\n&gt; When I do get frustrated with whiny demands I usually say, &quot;I want to help you get what you want and I will get you [xyz] but I don&#39;t appreciate being spoken to like that.&quot;<br/>\n&gt; <br/>\n&gt; Curious to know if radical homeschooling recommends I keep my mouth shut when frustrated. It does seem to heighten the drama, not cool it. Also curious to know if radical homeschooling recommends talking about it - or mentioning it and dropping the subject if they&#39;re not interested - at a time when they are happy and open to discussion. <br/>\n&gt; <br/>\n&gt; Aloha,<br/>\n&gt; Miliana<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Sent from my iPhone; please excuse typos and auto corrections.<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling myself AND my child....","postDate":"1333389880","msgId":66525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhPZXN4MHExaTVnZ3EteFZ1XzVpOFQtazVZZ0trQyt2N0pVdThVQVVaU1ZmQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDE3RTk0Mzc1LUNGNUMtNEU5Qy1CODVELTYxNjdFNjc4REI3RUB5YWhvby5jb20+","referencesHeader":"PDE3RTk0Mzc1LUNGNUMtNEU5Qy1CODVELTYxNjdFNjc4REI3RUB5YWhvby5jb20+"},"prevInTopic":66524,"nextInTopic":66527,"prevInTime":66524,"nextInTime":66526,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"You have to think for yourself about what is helpful and what isn t. Some kids would respond well to a comment about it - I can t imagine a kid responding well","messageBody":"<div id=\"ygrps-yiv-646476988\">You have to think for yourself about what is helpful and what isn&#39;t. Some<br/>\nkids would respond well to a comment about it - I can&#39;t imagine a kid<br/>\nresponding well to much of a conversation about it. The principle is - be<br/>\nhelpful to them. So - when thinking about how to respond, ask yourself if<br/>\nit will be helpful. With my own kids, a quick question like &quot;Why are you<br/>\nwhining?&quot; would be enough that they would switch out of that and explain<br/>\nwhat they were feeling. Sometimes even a raised eyebrow or often just allow<br/>\na silence that let the sound of their own whine hang in the air - they&#39;d be<br/>\naware of how they sounded and they&#39;d make a mid-course correction and talk<br/>\nabout what they wanted/needed.<br/>\n<br/>\nI do think it can be a habit to use a whiny voice and we should let them<br/>\nknow that it is irritating, but first and far more important is to make<br/>\nsure they don&#39;t have good reason - make sure you are responsive and<br/>\nattentive. Most whining that I&#39;ve seen has been associated with kids not<br/>\nfeeling they are getting enough direct attention. Make sure you&#39;re making<br/>\neye contact, touching in loving ways a lot, and having direct interaction<br/>\nwith each child individually a lot.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Apr 2, 2012 at 10:22 AM, Miliana &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:milianajohnson@...\">milianajohnson@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt; Curious to know if radical homeschooling recommends I keep my mouth shut<br/>\n&gt; when frustrated. It does seem to heighten the drama, not cool it. Also<br/>\n&gt; curious to know if radical homeschooling recommends talking about it - or<br/>\n&gt; mentioning it and dropping the subject if they&#39;re not interested - at a<br/>\n&gt; time when they are happy and open to discussion.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Deschooling myself AND my child....","postDate":"1333388975","msgId":66524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc2ODVCMkFDLTg3OEEtNDVCRi1CNzRGLUZGMkVFODMwQTI0OEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE3RTk0Mzc1LUNGNUMtNEU5Qy1CODVELTYxNjdFNjc4REI3RUB5YWhvby5jb20+","referencesHeader":"PDE3RTk0Mzc1LUNGNUMtNEU5Qy1CODVELTYxNjdFNjc4REI3RUB5YWhvby5jb20+"},"prevInTopic":66523,"nextInTopic":66525,"prevInTime":66523,"nextInTime":66525,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"-=-My own daughters seem a little more whiny now that they re out of school. I m trying to ignore it and just focus on loving them and being kind.-=- Did they","messageBody":"<div id=\"ygrps-yiv-1583704342\">-=-My own daughters seem a little more whiny now that they&#39;re out of school. I&#39;m trying to ignore it and just focus on loving them and being kind.-=-<br/>\n<br/>\nDid they want to leave school?<br/>\nWhen a child is taken out of school who would have preferred to have stayed, that can be a problem for a long time.  Forever.<br/>\n<br/>\nIgnoring &quot;it&quot; is ignoring them, potentially. <br/>\n<br/>\nWhen one of my kids would whine (it was usually Marty), depending on what mood he was in I might joke or I might just ask, or I might ignore it (if I knew he wouldn&#39;t be in the mood for  having it pointed out.  So it depends.  But sometimes I would whine back, and say &quot;I can&#39;t understaYannd you when you WHyeeene.&quot;  Never in a mean way, in a mirroring-the-song-of-it way.  And he would laugh, and it only happened a couple of times, because it was effective.  Or I would ask if he could say it a different way, and he would.  But sometimes a person is too tired or frustrated to communicate in another way.  <br/>\n<br/>\nI think it would be as bad to NEVER mention it, and it would be to ALWAYS mention it.<br/>\n<br/>\n-=-When I do get frustrated with whiny demands I usually say, &quot;I want to help you get what you want and I will get you [xyz] but I don&#39;t appreciate being spoken to like that.&quot;-=-<br/>\n<br/>\nToo many words, and too much about you.<br/>\n<br/>\n-=-Curious to know if radical homeschooling recommends I keep my mouth shut when frustrated.-=-<br/>\n<br/>\nThat is worded in an interesting way, and a revealing way.<br/>\n&quot;Radical unschooling&quot; doesn&#39;t recommend anything.  Different individuals who have incorporated radical unschooling into their lives might make different recommendations.  You will need to incorporate radical unschooling into your own life.  The way that happens is to read some, try some of the ideas, wait to see how it goes, and try some more, or some different things if it&#39;s not working for you.  You can&#39;t ask a question that gets an answer that you can use once and for all.  It&#39;s a process of learning, for the parent.  And of the creation of new patterns and habits.  That takes a while.<br/>\n<br/>\nI don&#39;t think &quot;keep your mouth shut when frustrated&quot; is going to be anyone&#39;s blanket recommendation.<br/>\nAn equally bad idea is &quot;every time you&#39;re frustrated, express that completely.&quot;<br/>\n<br/>\nSo &quot;the answer&quot; is to be conscious and thoughtful, considerate, aware.  Don&#39;t say or do anything without thinking first.  And make the better choice.  &quot;Better&quot; is going to depend on a lot of things around you.  But each time you act without thinking, you will have acted (literally and plainly) thoughtlessly.  <br/>\n<br/>\n-=-It does seem to heighten the drama, not cool it.-=-<br/>\n<br/>\nTry not to think of their best attempts to express themselves as &quot;drama.&quot;<br/>\nTry not to see their communication with you as &quot;drama.&quot;<br/>\nAnd if you DO see it that way, certainly try not to add more &quot;drama.&quot;  <br/>\n<br/>\n-=-Also curious to know if radical homeschooling recommends talking about it - or mentioning it and dropping the subject if they&#39;re not interested - at a time when they are happy and open to discussion. -=-<br/>\n<br/>\nDon&#39;t put the downer on happiness by discussing your unhappiness at that time.  Try to increase peace and joy.  That takes practice.<br/>\n<br/>\nHow long have they been home, how old are they and did they come home voluntarily?<br/>\n(Even if you&#39;ve already answered elsewhere, please review it again, as there have been 18 new members in the past week.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n Also curious to know if radical homeschooling recommends talking about it - or mentioning it and dropping the subject if they&#39;re not interested - at a time when they are happy and open to discussion. -=-<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Deschooling myself AND my child....","postDate":"1333388533","msgId":66523,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsY29kbCtudW1nQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE3RTk0Mzc1LUNGNUMtNEU5Qy1CODVELTYxNjdFNjc4REI3RUB5YWhvby5jb20+"},"prevInTopic":66522,"nextInTopic":66524,"prevInTime":66522,"nextInTime":66524,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"... ","messageBody":"<div id=\"ygrps-yiv-1323319568\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt; Curious to know if radical homeschooling recommends I keep my mouth shut when frustrated. It does seem to heighten the drama, not cool it. Also curious to know if radical homeschooling recommends talking about it - or mentioning it and dropping the subject if they&#39;re not interested - at a time when they are happy and open to discussion. <br/>\n </span></blockquote>&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\nIt rarely helped me to ask my son, Ethan, to not whine.  It seemed to make it worse.  I did mention one time that some animals in the wild are aggravated, if not angered, by high pitched animal sounds.  I told him I, too, felt irritated when I heard them.  But, the biggest light that went off for me was when one time I *was* asking Ethan not to whine and I heard my own voice whining!!  I said to him, &quot;Did you just see what I did?  I asked you not to whine in a whiney voice!&quot;  He stopped and looked at me.  Then he said, &quot;Yeah.  You did.&quot;  We laughed a bit about it.  Gradually, I stopped whining.  He has too.  Now we are *both* less likely to anger the bears in the wild :)</div>","specialLinks":[]},{"userId":464212763,"authorName":"Miliana","from":"Miliana &lt;milianajohnson@...&gt;","profile":"milianajohnson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Deschooling myself AND my child....","postDate":"1333387372","msgId":66522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3RTk0Mzc1LUNGNUMtNEU5Qy1CODVELTYxNjdFNjc4REI3RUB5YWhvby5jb20+"},"prevInTopic":66521,"nextInTopic":66523,"prevInTime":66521,"nextInTime":66523,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"My own daughters seem a little more whiny now that they re out of school. I m trying to ignore it and just focus on loving them and being kind. There are a lot","messageBody":"<div id=\"ygrps-yiv-61016810\">My own daughters seem a little more whiny now that they&#39;re out of school. I&#39;m trying to ignore it and just focus on loving them and being kind. There are a lot of reasons we would all be more emotional right now and I have found it very easy, most of the time, to just give extra hugs and kisses and listen to them.<br/>\n<br/>\nWhen I do get frustrated with whiny demands I usually say, &quot;I want to help you get what you want and I will get you [xyz] but I don&#39;t appreciate being spoken to like that.&quot;<br/>\n<br/>\nCurious to know if radical homeschooling recommends I keep my mouth shut when frustrated. It does seem to heighten the drama, not cool it. Also curious to know if radical homeschooling recommends talking about it - or mentioning it and dropping the subject if they&#39;re not interested - at a time when they are happy and open to discussion. <br/>\n<br/>\nAloha,<br/>\nMiliana<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPhone; please excuse typos and auto corrections.</div>","specialLinks":[]},{"userId":336246301,"authorName":"CarenKH","from":"&quot;CarenKH&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Deschooling myself AND my child....","postDate":"1333379814","msgId":66521,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsY2Z0NitrbHM2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpsYWNucit0Y205QGVHcm91cHMuY29tPg=="},"prevInTopic":66520,"nextInTopic":66522,"prevInTime":66520,"nextInTime":66522,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"-=-It doesn t help that I ve already gotten a few inappropriate questions about him being an only child.  My response is that why is it okay for multiple","messageBody":"<div id=\"ygrps-yiv-1544082506\">-=-It doesn&#39;t help that I&#39;ve already gotten a few inappropriate questions about him being an only child.  My response is that why is it okay for multiple children to have all their parents love & support whereas because he is an only child, must be somehow punished and thrown into the system?  I don&#39;t get that argument AT ALL.=-=<br/>\n<br/>\nDo you mean, people are asking how you can homeschool if he&#39;s an only child?<br/>\n<br/>\nI&#39;m not clear what you mean by inappropriate questions.<br/>\n<br/>\nKeep in mind that most parents don&#39;t see school and/or &quot;the system&quot; as punishment. They fully love and support their kids, and believe that school is the best way for their kids to have a good life. <br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":86348316,"authorName":"brightman73","from":"&quot;brightman73&quot; &lt;brightman73@...&gt;","profile":"brightman73","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Deschooling myself AND my child....","postDate":"1333311035","msgId":66520,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpsYWNucit0Y205QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":66521,"prevInTime":66519,"nextInTime":66521,"topicId":66520,"numMessagesInTopic":0,"msgSnippet":"Oh my these waters of control run deep. I can see my son, 3 1/2, has really been affected by his little school. Now that I ve had him home I have been saying","messageBody":"<div id=\"ygrps-yiv-624987009\">Oh my these waters of control run deep.<br/>\n<br/>\nI can see my son, 3 1/2, has really been affected by his little school. <br/>\nNow that I&#39;ve had him home I have been saying &quot;yes&quot; to him and yet he is<br/>\noften times quite whiny and frustrated.<br/>\n<br/>\nThe &quot;old&quot; me doesn&#39;t want to give in to his requests for juice, not<br/>\nmilk; or wanting to eat this not that, etc.  But I am doing it.  Inside<br/>\nme I know these things are simply his preferences as a human being and<br/>\nnot something I am needed to control.  In fact, my husband and decided<br/>\nto put all his foods to a shelf where he can have access to them<br/>\nwhenever he wants instead of going to the big old Mommy & Daddy to dole<br/>\nout a portion.<br/>\n<br/>\nI&#39;m starting to see that my son&#39;s whining, frustration, and clingyness,<br/>\nhas NOTHING to do with being spoiled!  It has everything to do with<br/>\nbeing afraid to express what he needs without getting the 3rd degree.<br/>\n<br/>\nThis is a major school/parent detox for me.   I know it will take us<br/>\nboth some time to get used to the new paradigm.<br/>\n<br/>\nIt doesn&#39;t help that I&#39;ve already gotten a few inappropriate questions<br/>\nabout him being an only child.  My response is that why is it okay for<br/>\nmultiple children to have all their parents love & support whereas<br/>\nbecause he is an only child, must be somehow punished and thrown into<br/>\nthe system?  I don&#39;t get that argument AT ALL.<br/>\n<br/>\nThank you and I&#39;m open to any comments/suggestions.<br/>\n<br/>\nStephanie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":66544,"nextTopicId":66538}}