{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":495438666,"authorName":"Sarah Thompson","from":"Sarah Thompson &lt;thompsonisland@...&gt;","profile":"wallacesmum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Positive body image","postDate":"1498044383","msgId":78095,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBUHYrY1l5cnRFUWdZV0pUWVRVM0FWWHRaTVhPczBLaG1ZbXBxQ0MwSmtWTi03NTQ0Z0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PERCNlAxODlNQjA1MjA2NkM4Rjc0NDY1MzE5OUZGNUM5OUI3REEwQERCNlAxODlNQjA1MjAuRVVSUDE4OS5QUk9ELk9VVExPT0suQ09NPg==","referencesHeader":"PENBQldTM3J0dFpDa1pQZDVfSF9nQVhCbjMwcWFHVVEyZlpPeHI1RENtcW9ONExfOHJPUUBtYWlsLmdtYWlsLmNvbT4gPERCNlAxODlNQjA1MjA2NkM4Rjc0NDY1MzE5OUZGNUM5OUI3REEwQERCNlAxODlNQjA1MjAuRVVSUDE4OS5QUk9ELk9VVExPT0suQ09NPg=="},"prevInTopic":78094,"nextInTopic":0,"prevInTime":78094,"nextInTime":78096,"topicId":78092,"numMessagesInTopic":0,"msgSnippet":"My kids have been involved in an amazing martial arts program for a couple of years, and I just joined the adult program. It is an approach to training that","messageBody":"<div id=\"ygrps-yiv-1949238483\"><div>My kids have been involved in an amazing martial arts program for a couple of years, and I just joined the adult program. It is an approach to training that combines a number of styles to address the whole picture of physical and mental fitness in a way that is gentle and challenging and supportive. Each person is always working towards their own best, not competing or comparing. I cannot overemphasize how wonderful it has been to watch Wallace go from saying, &quot;I&#39;m not an athlete and I&#39;m the worst player on the team&quot; to being invited to train for the demonstration team in less than two years. </div><div><br></div><div>If she wants to get exercise because it sounds appealing, a program like this could be a great fit. Not because it will change her body, but because it will build up her strength and self-confidence and allow her to find what is fitness for *her*. I train with people of all ages, body types, and fitness levels, and we all feel valued and respected. I know this because we talk about it:)</div><div><br></div><div>Sarah</div></div>","specialLinks":[]},{"userId":403767111,"authorName":"Jo Isaac","from":"Jo Isaac &lt;joanneisaac@...&gt;","profile":"joanne.isaac","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Positive body image","postDate":"1498006113","msgId":78094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCNlAxODlNQjA1MjA2NkM4Rjc0NDY1MzE5OUZGNUM5OUI3REEwQERCNlAxODlNQjA1MjAuRVVSUDE4OS5QUk9ELk9VVExPT0suQ09NPg==","inReplyToHeader":"PENBQldTM3J0dFpDa1pQZDVfSF9nQVhCbjMwcWFHVVEyZlpPeHI1RENtcW9ONExfOHJPUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQldTM3J0dFpDa1pQZDVfSF9nQVhCbjMwcWFHVVEyZlpPeHI1RENtcW9ONExfOHJPUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":78093,"nextInTopic":78095,"prevInTime":78093,"nextInTime":78095,"topicId":78092,"numMessagesInTopic":0,"msgSnippet":"==I don t know for sure where this is coming from== I don t think it matters - ALL kids will get exposed to judgements and discussions about body size and","messageBody":"<div id=\"ygrps-yiv-234863107\"><html>\n<head>\n \n<style type=\"text/css\"><!--#ygrps-yiv-234863107 P {margin-top:0;margin-bottom:0;}--></style>\n</head>\n \n<div id=\"ygrps-yiv-234863107divtagdefaultwrapper\" style=\"font-size:12pt;color:#000000;font-family:Calibri, Helvetica, sans-serif;\" dir=\"ltr\">\n<p></p>\n<div dir=\"ltr\" style=\"color:rgb(33, 33, 33);font-family:Georgia, serif, EmojiFont;font-size:15px;\">\n<br>\n==I don&#39;t know for sure where this is coming from==<br>\n<br>\nI don&#39;t think it matters - ALL kids will get exposed to judgements and discussions about body size and image at some point. All kids will compare their bodies to the bodies of others and hope/wish something about it was different.&nbsp;<br>\n<br>\n== I think I had hoped that she&#39;d have a different relationship with her body than the one I had/have with my own body==<br>\n<br>\nDon&#39;t think that this is her relationship now, forever, with her body. It&#39;s likely just a quick phase - don&#39;t get stuck in it :)&nbsp;<br>\n<br>\n</div>\n<div dir=\"ltr\" style=\"color:rgb(33, 33, 33);font-family:Georgia, serif, EmojiFont;font-size:15px;\">\n<div dir=\"ltr\">==So maybe she&#39;ll be satisfied if we do a little bit of exercise, for instance (and that is what she has mentioned).==<br>\n&nbsp;<br>\n&nbsp;When Kai has expressed a wish to do more exercise to lose weight (yes - it happens to boys too!), I have suggested if he wants to do that, he does it to get stronger and fitter, if he wants to, and asserted that he doesn&#39;t need to lose weight, and that his\n body is going to grow and change a LOT before he&#39;s an adult.&nbsp;<br>\n<br>\n&nbsp;I told him he can join me on walks if he wants - and left it up to him. &nbsp;<br>\n<br>\nFor the record - his musings on &#39;weight&#39; usually pass very quickly as long as I don&#39;t help him dwell on them.<br>\n<br>\n<br>\n==Although maybe I should warn her that it might not work as fast as she thinks it will?==<br>\n&nbsp;<br>\n&nbsp;You don&#39;t know if it might &#39;work&#39; or even what &#39;work&#39; really means to her. I wouldn&#39;t say anything at all. If she wants to walk more, or whatever type of exercise, do it with her and see it as a time to connect - Kai and I have big talks on our walks :)</div>\n<div dir=\"ltr\"><br>\n</div>\n<div>==I think I&#39;m looking for ideas on how to help her have a positive body image==<br>\n<br>\nDon&#39;t project your fears on to her. Work hard on your own&nbsp;body image, so she has a good model. Don&#39;t get stuck in this one phase and think that it means she&#39;ll have a poor body image for ever - it is natural for kids her age to start thinking about their body,\n comparing it to others and comparing it to bodies they see on TV and in shows.<br>\n</div>\n</div>\n<br>\n<p></p>\n<p><br>\n</p>\n<div id=\"ygrps-yiv-234863107Signature\"><b>Jo</b></div>\n<br>\n<div style=\"color:rgb(0, 0, 0);\">\n<hr tabindex=\"-1\" style=\"display:inline-block;width:98%;\">\n<div id=\"ygrps-yiv-234863107divRplyFwdMsg\" dir=\"ltr\"><font face=\"Calibri, sans-serif\" color=\"#000000\" style=\"font-size:11pt;\"><b><font><font>From:</font></font></b><font><font> AlwaysLearning@yahoogroups.com &lt;AlwaysLearning@yahoogroups.com&gt; on behalf of Marta Venturini martaborgespires@...\n [AlwaysLearning] &lt;AlwaysLearning@yahoogroups.com&gt;</font></font><br>\n<b><font><font>Sent:</font></font></b><font><font> 21 June 2017 00:45</font></font><br>\n<b><font><font>To:</font></font></b><font><font> AlwaysLearning@yahoogroups.com</font></font><br>\n<b><font><font>Subject:</font></font></b><font><font> [AlwaysLearning] Positive body image</font></font></font>\n<div>&nbsp;</div>\n</div>\n<div><span style=\"display:none;\">&nbsp;</span>\n<div id=\"ygrps-yiv-234863107ygrp-mlmsg\" style=\"\">\n<div id=\"ygrps-yiv-234863107ygrp-msg\" style=\"\">\n<div id=\"ygrps-yiv-234863107ygrp-text\">\n<p></p>\n<div dir=\"ltr\">\n<div>\n<div dir=\"ltr\">\n<div>\n<div dir=\"ltr\"><font><font>My daughter (8 years old) has been talking about not feeling ok about her body lately, in particular her belly, and she&#39;s been asking me what she can do to make it (the belly) go away.&nbsp; I don&#39;t know for sure where this is coming from,\n but I want to help her the best I can.&nbsp; I&#39;m not sure if it&#39;s something she&#39;s picking up on YouTube videos (she told me the other day that one of her favorite YouTubers has a video where she talks about exercising and lifting weights), or if she remembers stuff\n my mom and aunt have said to her in the past (and that I swiftly and politely asked them not to do anymore).&nbsp; I think I had hoped that she&#39;d have a different relationship with her body than the one I had/have with my own body, which hasn&#39;t exactly been a healthy\n one, of acceptance and self-love -- as I write this, I can see that this is a topic that I tend to get nervous about and not see things clearly, which means I might be seeing too much into this (colored by own experiences and my desire for her to have a different\n relationship with her body) and it might go away eventually, if I answer her actual request.</font></font></div>\n<div dir=\"ltr\">\n<div dir=\"ltr\"><br>\n</div>\n<div dir=\"ltr\"><font><font>She loves to eat and it&#39;s been amazing to watch her grow and start to like and ask for more and more foods (I have this discussion group and the moms that share their experiences here to thank for -- for helping me relax and letting\n her gradually develop her own relationship with food).&nbsp; Luckily she doesn&#39;t connect eating with body fat, yet, in the sense that she hasn&#39;t said she wants to eat less or something along those lines, to lose her belly.&nbsp; She&#39;ll eat what she likes and feels like\n eating at the moment (and is available). She eats when she&#39;s hungry and I think she never over eats.&nbsp; She knows when her body is saying stop, unlike myself in the past.&nbsp;&nbsp;</font></font></div>\n<div dir=\"ltr\"><br>\n</div>\n<div dir=\"ltr\"><font><font>So maybe she&#39;ll be satisfied if we do a little bit of exercise, for instance (and that is what she has mentioned).&nbsp; Although maybe I should warn her that it might not work as fast as she thinks it will?&nbsp; I&#39;m not even sure what she&#39;s\n expecting.&nbsp; Like I said, I&#39;m not sure if she&#39;s heard stuff on YouTube and it&#39;s just another something she wants to try out.&nbsp; I&#39;m not at all sure that she&#39;s not liking herself like I&#39;m imagining it.&nbsp; On the other hand, I don&#39;t want to take this lightly and\n I want to be prepared if other conversations come up.</font></font></div>\n<div dir=\"ltr\"><br>\n</div>\n<div><font><font>I&#39;ve told her in a calm and matter-of-fact way that our bodies are all different.&nbsp; I&#39;ve also told her that it isn&#39;t uncommon for some kids her age to have a little belly and then they&#39;ll grow and it&#39;ll shrink a bit.&nbsp; My body was exactly like\n hers, when I was her age, and I grew up to have what one would consider a healthy weight (I weighed 53 kg/119 pounds for many years and I&#39;m 1,56m/511 feet tall), although I thought of myself as fat for a very long time.&nbsp; I feel like this has changed for the\n better in the past few years, as I&#39;ve been learning more and more about radical unschooling and applying these life principles to myself. ;)</font></font></div>\n<div><br>\n</div>\n<div><font><font>I think I&#39;m looking for ideas on how to help her have a positive body image, even if not for now (because it seems to me that she might be looking for something simpler than what I&#39;m fantasizing about), but in the long run. I also want to know\n if any of my thoughts, which will come through given my choice of words to write this email, that need to be analyzed and changed.</font></font></div>\n<div><br>\n</div>\n<div><font><font>Thanks in advance</font></font></div>\n<div><font><font>Marta</font></font></div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p></p>\n</div>\n<div style=\"color:#fff;height:0;\"><font><font></font></font></div>\n</div>\n</div>\n</div>\n \n</div></div></html></div>","specialLinks":[]},{"userId":522719163,"authorName":"","from":"sukaynalabboun@...","profile":"sukaynalabboun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Positive body image","postDate":"1498005116","msgId":78093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGQTE1QTUxLTlBQTYtNDYyNC1BRUU4LUU4Q0U4MDhFNzZDQkB5YWhvby5jb20+","inReplyToHeader":"PENBQldTM3J0dFpDa1pQZDVfSF9nQVhCbjMwcWFHVVEyZlpPeHI1RENtcW9ONExfOHJPUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQldTM3J0dFpDa1pQZDVfSF9nQVhCbjMwcWFHVVEyZlpPeHI1RENtcW9ONExfOHJPUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":78092,"nextInTopic":78094,"prevInTime":78092,"nextInTime":78094,"topicId":78092,"numMessagesInTopic":0,"msgSnippet":"... Maybe you could gently ask her what she means by not liking her belly? At about 11 one of my daughters decided she wanted to eat less chocolate and chips,","messageBody":"<div id=\"ygrps-yiv-281759519\"><html><head></head><div></div><blockquote><span title=\"qreply\"><blockquote type=\"cite\"><font color=\"#000000\">It might be helpful to keep in mind that many girls get chubbier at this age, before they begin menstruation, and then they thin out regardless of diet and exercise.</font></blockquote><br><style type=\"text/css\">\n<!--\n#ygrps-yiv-281759519 #ygrps-yiv-281759519ygrp-mkp {\nborder:1px solid #d8d8d8;font-family:Arial;margin:10px 0;padding:0 10px;}\n\n#ygrps-yiv-281759519 #ygrps-yiv-281759519ygrp-mkp hr {\nborder:1px solid #d8d8d8;}\n\n#ygrps-yiv-281759519 #ygrps-yiv-281759519ygrp-mkp #ygrps-yiv-281759519hd {\ncolor:#628c2a;font-size:85%;font-weight:700;line-height:122%;margin:10px 0;}\n\n#ygrps-yiv-281759519 #ygrps-yiv-281759519ygrp-mkp #ygrps-yiv-281759519ads {\nmargin-bottom:10px;}\n\n#ygrps-yiv-281759519 #ygrps-yiv-281759519ygrp-mkp .ygrps-yiv-281759519ad {\npadding:0 0;}\n\n#ygrps-yiv-281759519 #ygrps-yiv-281759519ygrp-mkp .ygrps-yiv-281759519ad p {\nmargin:0;}\n\n#ygrps-yiv-281759519 #ygrps-yiv-281759519ygrp-mkp .ygrps-yiv-281759519ad a {\ncolor:#0000ff;text-decoration:none;}\n-->\n</style><div>Maybe you could gently ask her what she means by not liking her belly?</div><div><br></div><div>At about 11 one of my daughters decided she wanted to eat less chocolate and chips, and decided &nbsp;not to. On her own, just like that- and asked for lots of fruit, dried fruit, nuts etc to be kept on hand for snacks. She has both a healthy appetite and a great body image. &nbsp;When I asked her why she felt that way, and changed, she said she felt it was better for her to just eat things that looked more like they did when they grew. She also became vegetarian not long after, so it might have been just deciding for herself what felt right, or good.&nbsp;</div><div><br></div><div>I could have easily misinterpreted things back then, though, with my baggage. I am glad I trusted her- she also enjoys getting an hour or more outdoor exercise each day. She figured out what makes her feel good.&nbsp;</div></span></blockquote></html></div>","specialLinks":[]},{"userId":467797497,"authorName":"Marta Venturini","from":"Marta Venturini &lt;martaborgespires@...&gt;","profile":"maluborgespires","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Positive body image","postDate":"1498002323","msgId":78092,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQldTM3J0dFpDa1pQZDVfSF9nQVhCbjMwcWFHVVEyZlpPeHI1RENtcW9ONExfOHJPUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":78093,"prevInTime":78091,"nextInTime":78093,"topicId":78092,"numMessagesInTopic":0,"msgSnippet":"My daughter (8 years old) has been talking about not feeling ok about her body lately, in particular her belly, and she s been asking me what she can do to","messageBody":"<div id=\"ygrps-yiv-811390549\"><div dir=\"ltr\"><div><div dir=\"ltr\"><div><div dir=\"ltr\">My daughter (8 years old) has been talking about not feeling ok about her body lately, in particular her belly, and she&#39;s been asking me what she can do to make it (the belly) go away.  I don&#39;t know for sure where this is coming from, but I want to help her the best I can.  I&#39;m not sure if it&#39;s something she&#39;s picking up on YouTube videos (she told me the other day that one of her favorite YouTubers has a video where she talks about exercising and lifting weights), or if she remembers stuff my mom and aunt have said to her in the past (and that I swiftly and politely asked them not to do anymore).  I think I had hoped that she&#39;d have a different relationship with her body than the one I had/have with my own body, which hasn&#39;t exactly been a healthy one, of acceptance and self-love -- as I write this, I can see that this is a topic that I tend to get nervous about and not see things clearly, which means I might be seeing too much into this (colored by own experiences and my desire for her to have a different relationship with her body) and it might go away eventually, if I answer her actual request.</div><div dir=\"ltr\"><div dir=\"ltr\"><br></div><div dir=\"ltr\">She loves to eat and it&#39;s been amazing to watch her grow and start to like and ask for more and more foods (I have this discussion group and the moms that share their experiences here to thank for -- for helping me relax and letting her gradually develop her own relationship with food).  Luckily she doesn&#39;t connect eating with body fat, yet, in the sense that she hasn&#39;t said she wants to eat less or something along those lines, to lose her belly.  She&#39;ll eat what she likes and feels like eating at the moment (and is available). She eats when she&#39;s hungry and I think she never over eats.  She knows when her body is saying stop, unlike myself in the past.  </div><div dir=\"ltr\"><br></div><div dir=\"ltr\">So maybe she&#39;ll be satisfied if we do a little bit of exercise, for instance (and that is what she has mentioned).  Although maybe I should warn her that it might not work as fast as she thinks it will?  I&#39;m not even sure what she&#39;s expecting.  Like I said, I&#39;m not sure if she&#39;s heard stuff on YouTube and it&#39;s just another something she wants to try out.  I&#39;m not at all sure that she&#39;s not liking herself like I&#39;m imagining it.  On the other hand, I don&#39;t want to take this lightly and I want to be prepared if other conversations come up.</div><div dir=\"ltr\"><br></div><div>I&#39;ve told her in a calm and matter-of-fact way that our bodies are all different.  I&#39;ve also told her that it isn&#39;t uncommon for some kids her age to have a little belly and then they&#39;ll grow and it&#39;ll shrink a bit.  My body was exactly like hers, when I was her age, and I grew up to have what one would consider a healthy weight (I weighed 53 kg/119 pounds for many years and I&#39;m 1,56m/511 feet tall), although I thought of myself as fat for a very long time.  I feel like this has changed for the better in the past few years, as I&#39;ve been learning more and more about radical unschooling and applying these life principles to myself. ;)</div><div><br></div><div>I think I&#39;m looking for ideas on how to help her have a positive body image, even if not for now (because it seems to me that she might be looking for something simpler than what I&#39;m fantasizing about), but in the long run. I also want to know if any of my thoughts, which will come through given my choice of words to write this email, that need to be analyzed and changed.</div><div><br></div><div>Thanks in advance</div><div>Marta</div></div></div>\n</div></div>\n</div></div>","specialLinks":[]}],"prevTopicId":78078,"nextTopicId":78096}}