{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Explaining","postDate":"1264973786","msgId":50307,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1N0I2Q0NCLTkzNjAtNEFDMi05NTE3LUJGMkExRjk2RDFCREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDkwODExLjU0Njc4LnFtQHdlYjExMDQxMC5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PGhrNGVtditqajhwQGVHcm91cHMuY29tPiA8OTA4MTEuNTQ2NzgucW1Ad2ViMTEwNDEwLm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":50306,"nextInTopic":0,"prevInTime":50306,"nextInTime":50308,"topicId":50301,"numMessagesInTopic":0,"msgSnippet":"-=-She learned how to read, on her own, in her own way. It gave her the knowledge that if she could do that, then she could learn ANYthing. I never said that","messageBody":"<div id=\"ygrps-yiv-1622284961\">-=-She learned how to read, on her own, in her own way. It gave her  <br/>\nthe knowledge that if she could do that, then she could learn  <br/>\nANYthing. I never said that to her though, she told me recently that  <br/>\nthat is what happened. I knew, at the time, that it had happened  <br/>\nbecause I could see it.-=-<br/>\n<br/>\nI saw that in my kids, and wrote this, and it&#39;s hard to tell people  <br/>\n&quot;stop trying to teach your child to read,&quot; because the parents see it  <br/>\nas me being mean, rather than me trying to show them the easiest path  <br/>\nto climb a mountain they&#39;ve never seen.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/deeper\">http://sandradodd.com/r/deeper</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Explaining","postDate":"1264973608","msgId":50306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MjczLjc3OTI0LnFtQHdlYjExMDQxNS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDNBQjI2ODZCLTc0N0ItNDU5QS1BN0NBLUY4MEE5RDY5RDA4N0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhrNGVtditqajhwQGVHcm91cHMuY29tPiA8M0FCMjY4NkItNzQ3Qi00NTlBLUE3Q0EtRjgwQTlENjlEMDg3QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":50305,"nextInTopic":50307,"prevInTime":50305,"nextInTime":50307,"topicId":50301,"numMessagesInTopic":0,"msgSnippet":"***One is a nurse and is nursing; one is a teacher and is teaching. The girls are using their girly degrees. (Tacky statement, but I ll leave it for now.)*** I","messageBody":"<div id=\"ygrps-yiv-31727000\">***One is a nurse and is <br/>\nnursing; one is a teacher and is teaching. The girls are using their <br/>\ngirly degrees. (Tacky statement, but I&#39;ll leave it for now.)***<br/>\n<br/>\nI have a friend that calls them &quot;pink collar&quot; degrees and jobs.  Maybe a little less tacky, but with the same general idea!<br/>\n<br/>\n***I was absolutely positive that if Marty went <br/>\nto school he would make good grades, but that I didn&#39;t want him to <br/>\nhave to put up with the meanness and problems of school, if he didn&#39;t <br/>\nhave to, and I knew if he stayed home he would be fine.***<br/>\n<br/>\nThis is very much what Margaux believes to be true, and very much a reason why she opts to stay home.  She knows the neighbor kids, she knows they go to the school that she&#39;d be going to.  She doesn&#39;t even like playing with them or being around them here in our own little cul-de-sac.  The thought of being forced to be around them without and out, is like a terrible nightmare for her!  The possibility that there might be someone nice at school isn&#39;t enough of a draw!<br/>\n<br/>\nChamille seemed really good at drawing the good out of people.  She would&#39;ve played with the neighbor kids and found ways to enjoy them.  Different personalities for sure!  She&#39;s far less tolerant these days, she is unwilling to accept just anybody that shows up to hang out.  Like Holly, she doesn&#39;t like lying, and LOTS of kids lie.  It&#39;s a deal breaker for her.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Explaining","postDate":"1264972778","msgId":50305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwODExLjU0Njc4LnFtQHdlYjExMDQxMC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGhrNGVtditqajhwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhrNGVtditqajhwQGVHcm91cHMuY29tPg=="},"prevInTopic":50302,"nextInTopic":50306,"prevInTime":50304,"nextInTime":50306,"topicId":50301,"numMessagesInTopic":0,"msgSnippet":"***I also reminded him of all the things that we do and experience that kids in school do not have the option of doing. Like visiting museums and science","messageBody":"<div id=\"ygrps-yiv-13302811\">***I also reminded him of all the things that we do and experience that kids in school do not have the option of doing. Like visiting museums and science centers and movie theaters when everyone else is in school. Taking trips in the middle of the week during the winter time. ***<br/>\n<br/>\n<br/>\nThat argument never worked with Chamille, she could see first hand that the museums and science centers and movies theaters got lots of action, not during school hours, but still, one could do those things even IF they went to school.  <br/>\n<br/>\n***He has younger cousins in public school and a neighbor friend who is schooled at home and he sees what they are doing in school and realizes that he doesn&#39;t understand a lot of it. He compares himself and thinks that because he is older than his cousins, he should know more and it bothers him that they can do things he struggles with or doesn&#39;t understand.***<br/>\n<br/>\nThis is very common at that age of 9 or 10.  There is a very marked veering of paths from traditional schooling and unschooling.  From this point onward, what an unschooling kid does looks VERY different than what a schooled kid does.  It will not look like school at all.  What I&#39;ve seen with my own daughter that&#39;s gone through this, and hearing stories of others that have gone through this, is that focusing on what a child DOES do well and IS good at, helps enormously.<br/>\n<br/>\nIf a kid is concerned that they don&#39;t know how to do multiplication tables, that is one of those trigger points at the age of 9 or 10, what CAN they do instead, or where CAN they see that they will use multiplication.  When Chamille went through those self doubts, we&#39;d point to all the wonderful things she was doing and did know and how she learned those things outside of school.  When she was finally able to pick up a book and read it at the age of 11, almost all of that doubt went away.  She learned how to read, on her own, in her own way.  It gave her the knowledge that if she could do that, then she could learn ANYthing.  I never said that to her though, she told me recently that that is what happened.  I knew, at the time, that it had happened because I could see it.<br/>\n<br/>\nI tried very hard not to compare her to school kids because the comparisons were what was causing the anxiety in the first place.  What my daughter needed was to see herself in a different light, with a different perspective, one that didn&#39;t mimic school, so that is what I tried very hard to give her and show her.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Explaining","postDate":"1264961964","msgId":50302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBQjI2ODZCLTc0N0ItNDU5QS1BN0NBLUY4MEE5RDY5RDA4N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhrNGVtditqajhwQGVHcm91cHMuY29tPg==","referencesHeader":"PGhrNGVtditqajhwQGVHcm91cHMuY29tPg=="},"prevInTopic":50301,"nextInTopic":50305,"prevInTime":50301,"nextInTime":50303,"topicId":50301,"numMessagesInTopic":0,"msgSnippet":"-=-He compares himself and thinks that because he is older than his cousins, he should know more and it bothers him that they can do things he struggles with","messageBody":"<div id=\"ygrps-yiv-1045099483\">-=-He compares himself and thinks that because he is older than his  <br/>\ncousins, he should know more and it bothers him that they can do  <br/>\nthings he struggles with or doesn&#39;t understand. -=-<br/>\n<br/>\nTalk about situations where others don&#39;t know something, rather than  <br/>\nmaking it about him, maybe.<br/>\n<br/>\nOne thing I told Marty, when the neighbor told him that he must be  <br/>\nkept home because he&#39;s not smart enough for school, that maybe he was  <br/>\nretarded.  (Didn&#39;t use that word, or Marty didn&#39;t remember that word,  <br/>\nbut that was the gist of what Marty asked me.)  I felt really bad that  <br/>\nMarty had spent even the time of the walk from two houses over across  <br/>\nthe street back to ours thinking he was mentally incompetent. I told  <br/>\nhim no, not at all, that I was absolutely positive that if Marty went  <br/>\nto school he would make good grades, but that I didn&#39;t want him to  <br/>\nhave to put up with the meanness and problems of school, if he didn&#39;t  <br/>\nhave to, and I knew if he stayed home he would be fine.<br/>\n<br/>\nMarty, now, is unhappy with his handwriting. He&#39;s a lefty.  He can  <br/>\ncommunicate like crazy with a cellphone or computer, but he wishes he  <br/>\nhad fluent, fluid handwriting.  Other than that, I don&#39;t think he&#39;s  <br/>\nfeeling &quot;behind.&quot;  He has several friends with college degrees who are  <br/>\nworking at restaurants and shoe stores.  One is a nurse and is  <br/>\nnursing; one is a teacher and is teaching.  The girls are using their  <br/>\ngirly degrees.  (Tacky statement, but I&#39;ll leave it for now.)   The  <br/>\nguys are flailing, but they have student loans.  Two of the guys, from  <br/>\na wealthy family with an elevator in their house, twins, good looking,  <br/>\nintelligent, did not go to college.  They still work in the same comic  <br/>\nbook store they worked in as teens.  They&#39;re in their early-late 20&#39;s.<br/>\n<br/>\nMarty knows that college isn&#39;t a magic key.  He sees that education  <br/>\ncan make people bitter and screwed up, resentful that they played that  <br/>\ngame, earned those points, and can&#39;t always cash them in.<br/>\n<br/>\nWhen Marty was six, though, seven, he didn&#39;t know that.   Hanging  <br/>\naround with other kids, though, helped him see more about the natural  <br/>\ndifferences in other children&#39;s knowledge, abilities, courtesy,  <br/>\nhonesty, etc., and he came to value reliably, kind friends over know- <br/>\nit-all school-braggy kids.  And some of the reliable friends were  <br/>\nhomeschoolers, and some went to school.  And some of the braggy  <br/>\nfriends were homeschoolers, and some went to school.<br/>\n<br/>\nIt takes kids a while.  It&#39;s easier when they&#39;re in school to just say  <br/>\n&quot;that&#39;s how school is&quot; without even going to see how school is.  Or  <br/>\nmore likely people say &quot;That&#39;s how life is,&quot; because most people have  <br/>\nnever considered that school is not a natural part of biological life.<br/>\n<br/>\nI think smile and touch your son gently and say &quot;Some of the kids in  <br/>\nschool can&#39;t read, either, and they get bad grades and then their  <br/>\nparents punish them.  Let&#39;s don&#39;t worry about that.  You&#39;ll read  <br/>\nsomeday, without any bad grades or punishment,&quot; or something longterm  <br/>\nand sweet.<br/>\n<br/>\nThird grade is fleeting, except for those poor boys (almost always  <br/>\nboys) who are held back for TWO years in third grade.   Then they can  <br/>\nnever be held back in that grade again, and only fail once more  <br/>\naltogether, probably (by the secret policies in our state, anyway; two  <br/>\nfailures is the limit).<br/>\n<br/>\nUnschooled children never need to fail.  If they&#39;re frustrated or  <br/>\nunhappy in a moment, turn the moment to something happier.  There are  <br/>\na million more moments ahead.  Or there aren&#39;t.   With Holly, I used  <br/>\nto think either she&#39;ll live a long time and will have time to learn  <br/>\nthis later, or she might die soon, in which case she didn&#39;t need to  <br/>\nknow it at all.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":20623128,"authorName":"Sarah","from":"&quot;Sarah&quot; &lt;wee_wah@...&gt;","profile":"bluishbear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Explaining","postDate":"1264959007","msgId":50301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrNGVtditqajhwQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":50302,"prevInTime":50300,"nextInTime":50302,"topicId":50301,"numMessagesInTopic":0,"msgSnippet":"Sandra said  With Marty, he asked a couple of times because of things other kids had said to him, so I explained just a little, and he was fine again. ","messageBody":"<div id=\"ygrps-yiv-2001183702\">Sandra said  &quot;With Marty, he asked a couple of times <br/>\nbecause of things other kids had said to him, so I explained just a <br/>\nlittle, and he was fine again.&#39;<br/>\n<br/>\n<br/>\n<br/>\n**Sandra, I&#39;d love to hear more of what you told Marty when he had these kinds of interactions with other kids.  <br/>\n<br/>\nI have a 10yo son (unschooled since age 7) who is very sensitive to what other kids say and are doing.  He has younger cousins in public school and a neighbor friend who is schooled at home and he sees what they are doing in school and realizes that he doesn&#39;t understand a lot of it.  He compares himself and thinks that because he is older than his cousins, he should know more and it bothers him that they can do things he struggles with or doesn&#39;t understand.  He doesn&#39;t talk about this often but sometimes when he is trying to go to sleep, all these doubts and worries overwhelm him and he gets upset.  In these moments he has talked of maybe trying to go back to school (he did grade K but doesn&#39;t remember much about it) but he worries that he will not know what all the other kids know.   <br/>\n<br/>\nIn these moments I have told him that if he wants to go to school, he can.  It has always been an option.  I told him that learning the basics in say, Math does NOT take 5 years to learn.  Handwriting gets easier if you use it every day.   Reading gets more fluent the more you read.  I&#39;ve also told him that he is kind, and generous and thoughtful and fair and that these are way more important attributes than being able to do long division problems.  Long division (and everything else) can be mastered easily when one is willing and interested.  The world needs more people who are kind and decent.  I also reminded him of all the things that we do and experience that kids in school do not have the option of doing.  Like visiting museums and science centers and movie theaters when everyone else is in school.  Taking trips in the  middle of the week during the winter time.  <br/>\n<br/>\n<br/>\n<br/>\nIs there something more or better I can say to him in these moments?<br/>\n<br/>\n<br/>\n<br/>\nSarah</div>","specialLinks":[]}],"prevTopicId":50299,"nextTopicId":50313}}