{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":6121707,"authorName":"Jana","from":"Jana &lt;jana@...&gt;","profile":"jana_eagle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"artists and homeschooling","postDate":"1052389933","msgId":68083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2M2NqcG4yejYuZnNmQGh1Z28uRklHPg==","inReplyToHeader":"PDFjZi45MWQ1OTcxLjJiZTlmOTBiQGFvbC5jb20+"},"prevInTopic":67886,"nextInTopic":0,"prevInTime":68082,"nextInTime":68084,"topicId":67886,"numMessagesInTopic":0,"msgSnippet":"any artists who work at home in a studio while they unschool their kids? i have some challenges right now related to discovering how to pursue my art.  sorry,","messageBody":"<div id=\"ygrps-yiv-135094356\">any artists who work at home in a studio while they unschool their kids?<br/>\n<br/>\ni have some challenges right now related to discovering how to pursue<br/>\nmy art.  sorry, this post is just about myself and my deschooling and<br/>\nis not related directly to my daughter&#39;s learning except in how it<br/>\nwill help me get out of the way of her learning.  i just sent a post<br/>\nto the list about how i found it so hard to read for pleasure after<br/>\nattending university English literature classes.  well, i have a<br/>\nsimilar thing going on with learning art.<br/>\n<br/>\ni want to do art for a career; i was lucky to meet a mentor who really<br/>\nturned me on to my ability to express myself in painting-- this is<br/>\nwhen i was 16.  he showed me to own my own learning process and not<br/>\njump through other peoples&#39; hoops-- i think this is where i first<br/>\ndiscovered the spirit of unschooling, though i didn&#39;t call it that at<br/>\nthe time, and it didn&#39;t spill over into other areas of my life until<br/>\nlater.<br/>\n<br/>\ni knew at that age that there was no chance in hell i would ever<br/>\nattend an institution to study art.  i saw art schools as highly<br/>\ncompetitive, arbitrary, and insular.  i cared so much about it because<br/>\ni cared so much about what it meant for me to paint.  anyway, i am<br/>\nleft in the position now of never having attended an art institution<br/>\nbut being at the point where i need the skills, community, and backing<br/>\nthat getting a degree provides.  at least, i think i do.  i would like<br/>\nto be able to attend school to learn what i need to learn, but i don&#39;t<br/>\nwant to get &quot;swallowed up&quot; by the idiocy of it.  so i am just<br/>\nwondering if anyone has any experience related to this?  is there a<br/>\nway to build artistic community and learn specific skills and<br/>\ntechniques without university?<br/>\n<br/>\ni have taken an art class when my daughter was old enough to be okay<br/>\nwith me leaving, and i hated it and loved it at the same time.  i find<br/>\nmyself coming home from university and writing reams of discourse in<br/>\nmy journals about all the things i would change if i ruled the world.<br/>\n&lt;g&gt; there is another part of me who feels all i need to do is learn<br/>\nhow to do art for the pleasure of it and the meaning of it and that&#39;s<br/>\nall, but then i see that i have probably spent the last 10 years<br/>\ntrying to do it on my own, and i don&#39;t see a lot of &quot;results&quot; (meaning<br/>\nworks produced) by this method.  i also feel i am living way below my<br/>\npotential.  hope i made sense.  thanks, jana</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Sorry, Tammy (was Re: Learning styles and homeschooling methods (long)/Sandra","postDate":"1052286731","msgId":67886,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjZi45MWQ1OTcxLjJiZTlmOTBiQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":68083,"prevInTime":67885,"nextInTime":67887,"topicId":67886,"numMessagesInTopic":0,"msgSnippet":"-=-You know, I think you took what I said all wrong. I don t believe in whatever. We can never really have all the knowledge we need. We learn new things","messageBody":"<div id=\"ygrps-yiv-466839352\">-=-You know, I think you took what I said all wrong. I don&#39;t believe in <br/>\n<br/>\nwhatever. We can never really have all the knowledge we need. We <br/>\n<br/>\nlearn new things everyday. Maybe this list isn&#39;t for me then, if I <br/>\n<br/>\ncan&#39;t express my opinion and thoughts. I thought it was very well <br/>\n<br/>\nwritten. -=-<br/>\n<br/>\nTammy, you could be right about me taking it wrong.  I&#39;m sorry.  I saw yours <br/>\nand responded before i saw the original question.   Everyone learns new <br/>\nthings every  day, but they don&#39;t need to be TAUGHT new things in most cases. <br/>\n Too much teaching can cause people to expect and to need more teaching.<br/>\n<br/>\nSo I think this is what you responded to: <br/>\n<br/>\n<br/>\n-=- Do we choose unschooling <br/>\n<br/>\n because of our learning style or our child&#39;s learning style or <br/>\n<br/>\n because it&#39;s &quot;right&quot;?  If you had a child who loves to read and do <br/>\n<br/>\nworkbooks, would you school at home instead?-=-<br/>\n<br/>\nIf not, please feel free to clarify.  You hadn&#39;t quoted anything before you <br/>\n&quot;shared,&quot; and looking back I see that the whole post was appended at the <br/>\nbottom.  I didn&#39;t read past your signature and for a new member to the group, <br/>\nwhat you wrote seemed not to show much regard to unschooling as an ideal.<br/>\n<br/>\nI&#39;m sorry if I misunderstood.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":68054,"nextTopicId":68084}}