{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"NumoAstro@aol.com","from":"NumoAstro@...","replyTo":"LIST","senderId":"C-KTsWVX1_HS3Ux6nKp8mtzidXhPfgHFhzBQDNLhKG9dAC8RkST7TWa75UaSiOAErg1DAQ9Fu88","spamInfo":{"isSpam":false,"reason":"0"},"subject":"A note from our local homeschooling chapter","postDate":"967750555","msgId":12352,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQzLjk1NWE4ZmMuMjZlMDBkOWJAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":12351,"nextInTime":12353,"topicId":12352,"numMessagesInTopic":0,"msgSnippet":"One of the women in my homeschooling group sent us this e-mail and I thought you guys might like to read it ... interesting information about all the","messageBody":"<div id=\"ygrps-yiv-70471943\">One of the women in my homeschooling group sent us this e-mail and I thought <br/>\nyou guys might like to read it<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I just bought this U.S. Presidents Fact Pack from Wal-Mart.  It has some<br/>\n </span></blockquote>interesting information about all the Presidents (including Clinton, though<br/>\nhis card isn&#39;t quite up to date.  It only covers up to his re-election.)<br/>\nWhat I found most interesting was the way that most of the Presidents were<br/>\neducated up through Truman.  Here is some of what the cards say...<br/>\n<br/>\nHarry S Truman - could not afford college.  He got his education the hard<br/>\nway, in the army.<br/>\nWarren Harding - worked at many different jobs as a boy, one of which was a<br/>\nprinter&#39;s apprentice.  At 14 he entered Ohio Central College...<br/>\nTheodore Roosevelt - was tutored at home until he went to Harvard where he<br/>\nwas a Phi Beta Kappa honor student.<br/>\nBenjamin Harrison - attended school in a log cabin his father had built.  He<br/>\ngraduated from Miami University (Ohio).... fourth in his class.<br/>\nJames A. Garfield - attended school only three months of the year, but he<br/>\nloved learning and read a lot.<br/>\nRutherford B. Hayes - went to private school and received some of his<br/>\neducation at home.<br/>\nUlysses S. Grant - worked in his father&#39;s tannery and on the family farm...<br/>\nIn 1839 (age 17) he went to West Point and excelled in mathematics.<br/>\nAndrew Johnson - was apprenticed to a tailor at 14.... he had learned to<br/>\nread a little, and his wife taught him to write.<br/>\nAbraham Lincoln - received no more than a year of schooling, but read every<br/>\nbook he could borrow and became a master of the English language.<br/>\nJames Buchanan - loved to learn and worked hard in his father&#39;s store.  He<br/>\nwent to Dickinson College in Carlisle, PA, and eventually graduated with<br/>\nhonors.<br/>\nMillard Fillmore - spent his early youth working with his father....  He<br/>\neducated himself and attended New Hope Academy for six months.<br/>\nZachary Taylor - had little or no formal education, except for a small<br/>\nschool in Louisville, Kentucky.<br/>\nWilliam Henry Harrison - was first educated at home, attended Hampden-Sidney<br/>\nCollege in Virginia, and studied medicine but gave it up to join the army.<br/>\nJohn Quincy Adams - was educated in a village school, then under the<br/>\nguidance of his mother.<br/>\nJohn Adams - grew up on a farm and was very athletic.  At 16 he went to<br/>\nHarvard....<br/>\nGeorge Washington - had no formal schooling.<br/>\n<br/>\nAll those not listed here went to either private or public schools.  Each<br/>\ncard specifies the school or &quot;a school,&quot; etc. except the ones listed above.<br/>\n<br/>\nDid you know that only 1/4 of the U.S. Presidents went to public schools?<br/>\nThe rest went to college only (no early education), private schools, no<br/>\nschool at all, or were educated at home!  Yet, the &quot;powers that be&quot; say that<br/>\nyou can&#39;t get a good education unless you go to &quot;school&quot; for 12 years.  And<br/>\nmost of the time, they mean public school!<br/>\n<br/>\nPublic schools these days (and even many private schools that accept<br/>\nstate/federal $$) are not about education, they are about indoctrination ~<br/>\nthe &quot;it takes a village&quot; mentality.&lt;&lt;</div>","specialLinks":[]}],"prevTopicId":12274,"nextTopicId":12326}}