{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":205425680,"authorName":"robinstempo@aol.com","from":"robinstempo@...","profile":"happyhomeschooler","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unschooling through crisis-","postDate":"1142806544","msgId":24757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0My4yMWMyODkuMzE0ZjMyMTBAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":24756,"nextInTime":24758,"topicId":24757,"numMessagesInTopic":0,"msgSnippet":"... your unschooled children, what would you do?","messageBody":"<div id=\"ygrps-yiv-2134903627\"><blockquote><span title=\"ireply\">&gt;&gt;If, due to financial or medical necessity, you became less available to <br/>\n </span></blockquote>your unschooled children, what would you do?&lt;&lt;<br/>\nI posted this message about unschooling through crisis after crisis, almost a <br/>\nweek ago.  This is the first chance I&#39;ve had more than five minutes to sit <br/>\nback at the computer to read and respond.  I&#39;ve been working long hours and <br/>\ngoing for medical tests and counseling, looking for an affordable place to rent <br/>\nthat also allows pets, and trying to sell our belongings to come up with enough <br/>\nmoney to do so.  The life of a single mom.  Against my advice, my son went to <br/>\nstay with his disabled dad for a few weeks.  I worry about his safety there.  <br/>\nMy daughter has been home alone, packing boxes, marking the want ads and <br/>\nsearching online for rentals.  With the time approaching, we have still found <br/>\nnothing.  Perhaps REALLY Carschooling?<br/>\n<br/>\nWhen analyzing our situation, I do not leave my kids out of the process to <br/>\nfinding our next step.  Neither of them really wants to attend a school.  At <br/>\nleast not any of the schools we have visited. In our search for a new place to <br/>\nlive, we are taking schools, especially Sudbury types, into consideration. They <br/>\nhave come up with very divergent, and not very immediate, solutions.  My son <br/>\nwants to get the best computer imaginable so that he can practice the most <br/>\ncomplicated games, enter tournaments, and learn how to design and maintain games <br/>\nand websites.  Then he will  support us with his brilliance:-)  That is pretty <br/>\nmuch his answer to everything.  We just have to get a really good computer.  <br/>\nMy daughter wants to move to a cabin in the forest where she can live as a <br/>\nrecluse, and rescue animals. Of course, it must have cable or satellite TV, so she <br/>\ncan watch her favorite anime shows, of which she does beautiful drawings. She <br/>\nwants to be a veterinarian and film maker, if anything.  I just want to age <br/>\ngracefully/heathfully while helping their dreams come true.<br/>\n  <br/>\nI realize that my problems are all ordinary occurrences for many people, and <br/>\nthat my kids are naturally learning some of life&#39;s harsh realities.  We are <br/>\nliving out the consequences of the plans and choices we made or didn&#39;t make, and <br/>\nof the responses we took to these various situations (earthquake, fire, <br/>\nburglary, two auto accidents, terminal illnesses, death, bankruptcy, divorce).  I <br/>\nassumed that each crisis would be over soon.  Instead, one crisis has followed <br/>\nanother, the years have flown by, and now, due to diminishing health, time, <br/>\nenergy and finances, we have become increasingly isolated.  At last, I am <br/>\nwilling to admit that I am less available to my children than I ever intended to be. <br/>\nI would like to guide my children safely, but my confidence is shaken.  I <br/>\nbelieve that love, listening, and sharing will cushion our journey. None of these <br/>\nchallenges really have anything to do with unschooling I guess, but as an <br/>\nunschooling parent, I just feel as though I might be missing some key element, or <br/>\nsource of support, that other veterans of the attachment parenting, <br/>\nunschooling lifestyle are aware of.<br/>\nThanks for listening,<br/>\nBird</div>","specialLinks":[]}],"prevTopicId":24754,"nextTopicId":24761}}