{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":18,"messages":[{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"And yet another wonderful update on Lexie 3-14-05","postDate":"1110863270","msgId":104519,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMzY2REE2LjQwNTAxMDFAY2hhcnRlci5uZXQ+","inReplyToHeader":"PDQyMkQyRjkzLjQwNjAxMDVAY2hhcnRlci5uZXQ+","referencesHeader":"PGNyZGR2NitjbGI0QGVHcm91cHMuY29tPiA8NDFEQ0Y3RjAuMjA2MDIwOEBjaGFydGVyLm5ldD4JPDQxREY5NjA2LjgwMTA5MDlAY2hhcnRlci5uZXQ+IDw0MUVBRUNGMC43MDgwODA3QGNoYXJ0ZXIubmV0PiA8NDFGNUVBNUQuNjAzMDgwN0BjaGFydGVyLm5ldD4gPDQyMTE3MkJDLjIwMTA5MDFAY2hhcnRlci5uZXQ+IDw0MjJEMkY5My40MDYwMTA1QGNoYXJ0ZXIubmV0Pg=="},"prevInTopic":104263,"nextInTopic":0,"prevInTime":104518,"nextInTime":104520,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"Hello everyone Lexie went to the doctor today and had an xray.  The good news is... the bone continues to heal well.  There seems to be no problem with the ","messageBody":"<div id=\"ygrps-yiv-1199937748\">Hello everyone<br/>\n<br/>\nLexie went to the doctor today and had an xray.  The good news is... the <br/>\nbone continues to heal well.  There seems to be no problem with the <br/>\nbone, it does not appear to be dying.  There is still a chance this <br/>\nmight happen, but with each week it doesn&#39;t happen, the chance gets <br/>\nslimmer and slimmer.  The fact there is still good obvious blood flow to <br/>\nthe bone and that there is no white on the xray (indicating calcium <br/>\nbuild up) and that the bone definition is solid (ie, it&#39;s a clear curve <br/>\naround the top, and around where the break occured) gives us great <br/>\nhope.  The doctor said that he couldn&#39;t even find the break line, it has <br/>\nhealed so well.  Two xrays were taken and we both looked, but couldn&#39;t <br/>\nfind the line, which indicates that the bone is healing very well.  The <br/>\npins are HUGE , though.  They will come out in about a year.  Lexie has <br/>\npermission to begin putting a bit of weight on the leg.  We had <br/>\ndiscussed weeks ago they&#39;d begin really slowly, but it seems that she <br/>\nhas healed so well, we are moving a bit faster.  She can put about 50% <br/>\nof her weight on her leg for about two weeks, using the walker.  After <br/>\nthat, she can move to walking slowly, without the walker.  She is not <br/>\nallowed to run, jump, skip, or move any faster than a slow walk without <br/>\nthe walker until he sees her in a month and does another xray.  We have <br/>\nan order for water therapy, but now we have to find a place and get <br/>\nKaiser to pay for it. <br/>\n<br/>\nTen years ago today I was in labor with Lexie.  In retrospect, I handled <br/>\nher birth wrong, and after two and a half days of labor, Lexie was born <br/>\nby c-section.  I don&#39;t think I will ever have the chance to have a <br/>\nvaginal birth, or another child, and I do and will always miss not being <br/>\nable to give birth vaginally, but now, ten years later, I don&#39;t care.  I <br/>\nhave a beautiful and wonderful child who is growing into a wonderful <br/>\nyoung lady.  She stuck with DI throughout the last ten weeks, when she <br/>\nvery well could have quit and no one would have thought badly of that <br/>\nchoice.  But she never even considered quitting.  She participated in a <br/>\nDI creativity day while she was in a body cast, and then returned four <br/>\nweeks later to participate in the tournament in a wheel chair, unable to <br/>\neven put that foot on the floor.  Her team was just as wonderful, no one <br/>\nsuggested they go on without Lexie, but instead they personified what <br/>\nDestination Imagination stands for and remained a team through what was <br/>\nnot an easy time for any of of them.  Even though they did not win an <br/>\naward, they are all winners, and I am trying to figure out how to <br/>\nrecognize them as such.  They not only accepted Lexie in a wheel chair <br/>\nbut they used the wheel chair as a side trip to their challenge!  Lexie <br/>\nis very lucky to be a part of a true team, The Tiny Tigers. <br/>\n<br/>\nLexie has also done so well in her recovery.  Yes, there has been low <br/>\nmoments, and low days.  She has cried, and become angry with her <br/>\nsituation.  But for the most  part she has been a remarkable young lady <br/>\nwho has taken a difficult time and done the best with it.  She has <br/>\nalways done her excersizes to the best of her ability, and the result is <br/>\ngood healing and now the ability to begin walking again.  She has <br/>\nfollowed the rules of no weight on one leg to the point of almost <br/>\nobsessiveness, knowing that following those rules was the best way to <br/>\nget an optomal outcome.  Now she is stepping carefully into the next <br/>\npart of her recovery, with both feet and both legs.  I have never been <br/>\nprouder of my daughter.<br/>\n<br/>\nI know this is about Lexie but I have to take a minute and talk about <br/>\nJanene.  She has also been pretty amazing.  She has helped her sister, <br/>\nalmost always when asked just once, as well as she could.  This six year <br/>\nold even learned to help Lexie use the bathroom using a bedpan, so that <br/>\nI could stay in the bath a few minutes longer (this was without my <br/>\nknowledge, I only figured it out when Janene came into the bathroom to <br/>\nempty the bedpan!)  She has been encouraging and only once or twice <br/>\nhijacked her sister&#39;s walker or wheelchair or hospital bed for her own <br/>\nuse.  She has brought Lexie water and liquid, books, computer, played <br/>\ngames with her sister, and handled the last few months, when our family <br/>\nhas been in so much stress, amazingly well.  I am proud and lucky she is <br/>\nmy daughter. <br/>\n<br/>\nWe have also learned how &quot;handicapped accessable&quot; means pretty much <br/>\nnothing in many cases.  I will never look at a handicap stall in the <br/>\nsame way again, nor will I do any small thing, from shopping to using <br/>\nthe restroom in a public place, without looking upon a person in a <br/>\nwheelchair with new respect. <br/>\n<br/>\nAs a family of three, without Mark, we have formed a bond with each <br/>\nother, and have learned how strong we can be.   I am very sorry that we <br/>\nhave had to go through all of this, from Lexie&#39;s accident, to Mark&#39;s <br/>\nleaving, to Addy (our dog&#39;s) tragic and horrible death, but we have come <br/>\nthrough stronger in so many ways.<br/>\n<br/>\nOne of the most important ways is the confirmation of our friends and <br/>\nfamily. It was an amazing process to see just how many friends we have.  <br/>\nThank you all for all of your help.  This journey toward Lexie&#39;s <br/>\ncomplete recovery is not over yet, but the worst is over, and it is <br/>\nthanks to all of you that we made it through that worst.  I don&#39;t think <br/>\nI could have made it without your support and help.  I wish I could <br/>\nwrite individual, personalized notes to each and every one of you, and <br/>\nmaybe one day I will be able to do that, but for now please know I thank <br/>\nyou in my heart each night.  Every bit of the support was appreciated, <br/>\nfrom the physical support of meals and help with errands and help with <br/>\nJanene, to the emotional support of private conversations and public <br/>\nemails, to the private support of precious prayers and healing and <br/>\ncalming thoughts and candles lit in our names.  All of it has been <br/>\nnoticed and appreciated.  Thank you. <br/>\n<br/>\nAnd I do know now that Lexie will completely recover.  That is a <br/>\ncertainty in my head as much as I am certain the sun will rise tomorrow <br/>\nand that my little girl will be ten on Wednesday at 12:25 pm.  Ten years <br/>\nold, two numbers, an entire decade.  Amazing, I look at her and am <br/>\namazed that I created this life inside my body and now I have such <br/>\nlittle control over it, as she grows to womanhood, that is as it should <br/>\nbe.  Lexie will be an amazing woman--look out world, here she comes!<br/>\n<br/>\nI am crying now, and so I will say thank you again.  I&#39;ll send another <br/>\nupdate next month, when we hope to get further good news, and maybe the <br/>\nposibility of a bit more activity. <br/>\n<br/>\nThank you<br/>\n Joylyn<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Update on Lexie--maybe last one?","postDate":"1110257555","msgId":104263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMkQyRjkzLjQwNjAxMDVAY2hhcnRlci5uZXQ+","inReplyToHeader":"PDQyMTE3MkJDLjIwMTA5MDFAY2hhcnRlci5uZXQ+","referencesHeader":"PGNyZGR2NitjbGI0QGVHcm91cHMuY29tPiA8NDFEQ0Y3RjAuMjA2MDIwOEBjaGFydGVyLm5ldD4JPDQxREY5NjA2LjgwMTA5MDlAY2hhcnRlci5uZXQ+IDw0MUVBRUNGMC43MDgwODA3QGNoYXJ0ZXIubmV0PiA8NDFGNUVBNUQuNjAzMDgwN0BjaGFydGVyLm5ldD4gPDQyMTE3MkJDLjIwMTA5MDFAY2hhcnRlci5uZXQ+"},"prevInTopic":103535,"nextInTopic":104519,"prevInTime":104262,"nextInTime":104264,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"A couple people have asked me for an update, so here is one... Lexie is doing fairly well.  Her cast has been off for over three weeks, and she s getting","messageBody":"<div id=\"ygrps-yiv-2074962527\">A couple people have asked me for an update, so here is one...<br/>\n<br/>\nLexie is doing fairly well.  Her cast has been off for over three weeks, <br/>\nand she&#39;s getting around pretty good on one leg.  She will not use the <br/>\ncrutches at all, will only use the walker and wheel chair.  However, <br/>\nshe&#39;s pretty good at those things.  She is back in charge of her own <br/>\npersonal bodily needs, which is a big deal to all of us.  She is eating <br/>\nbetter, as she is moving around more.  She is very good at doing her <br/>\nexercises for PT, and her range of motion is really improving.  She can <br/>\nget up and down steps, her PT person said it was a bit unorthodox and <br/>\nsorta weird, but very safe and if the method made Lexie comfortable then <br/>\nit was OK.  She basically sits down and goes down the steps until she is <br/>\nnear the bottom then stands up and uses her walker.  I liked the <br/>\nunorthodox and weird comment, because basically that is Lexie in a <br/>\nnutshell--weird and unorthodox.  She is back to doing chores, which she <br/>\nenjoyed the first day or two but then didn&#39;t like it.  She can make her <br/>\nown pancakes, do the dishes, and help clean up a bit.  She complains <br/>\nthat sometimes that I treat her too much like she can walk and run, but <br/>\nI like that complaint better than the one that I treat her like she can <br/>\ndo nothing.  The other day she made me pancakes and using the wheel <br/>\nchair delivered me another one (I was lying in her bed so she delivered <br/>\nme breakfast in bed) on the spatula.  I thought it was pretty good that <br/>\nshe could steer the wheel chair with a pancake on a spatula through the <br/>\nkitchen into the livingroom.  :-) <br/>\n<br/>\nNext week we will get another xray, and will know more about the bone.  <br/>\nWe will also know if she can put weight on the leg.  At first it will be <br/>\nonly a small amount of weight, but the PT person feels she&#39;ll be running <br/>\naround playing soccer in September.  <br/>\n<br/>\nI think one of the most amazing things about this whole thing is the <br/>\neducation that has come as a result of it all, not just for us, for <br/>\nLexie, Janene and myself, but for everyone who has come in contact with <br/>\nLexie.  The other night she had a sleep over with three friends, and I <br/>\ncame out to find one girl in bed with Lexie (better to see the <br/>\ncomputer), the other one standing over them from behind the bed, and the <br/>\nthird in the wheelchair next to the bed looking on.  I&#39;ve watched her <br/>\nfriends help her get in and out of bed, use the restroom, get up and <br/>\ndown the stairs.  Her neighborhood friend was very worried at first, but <br/>\nnow is an old pro with Lexie.  Lexie goes over to Dana&#39;s house with Dana <br/>\nhelping, carrying the walker.  Dana can help get Lexie into her own <br/>\nhouse as well as Lexie&#39;s house. Lexie has cared for babies in her wheel <br/>\nchair and in her hospital bed.  It&#39;s been an amazing thing to witness, <br/>\nand I know I&#39;m not giving the situation justice with my words.<br/>\n<br/>\nWell, that&#39;s it for tonight, I must get ready for school tomorrow.<br/>\n<br/>\nThank you again, everyone, for all you do.<br/>\n<br/>\nJoylyn</div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Update on Lexie 2/14/05","postDate":"1108608497","msgId":103535,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMTQwNUYxLjMwMDA0MDRAY2hhcnRlci5uZXQ+","inReplyToHeader":"PGN1dnM1NitkOXNqQGVHcm91cHMuY29tPg==","referencesHeader":"PGN1dnM1NitkOXNqQGVHcm91cHMuY29tPg=="},"prevInTopic":103478,"nextInTopic":104263,"prevInTime":103534,"nextInTime":103536,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"wow... I m so glad to hear she is fine now. Thanks for sharing, I ll share this with Lexie.  We found out today about another child who stepped off a truck","messageBody":"<div id=\"ygrps-yiv-1030818321\">wow... I&#39;m so glad to hear she is fine now. <br/>\n<br/>\nThanks for sharing, I&#39;ll share this with Lexie.  We found out today <br/>\nabout another child who stepped off a truck back and broke BOTH hips, <br/>\nsame location as Lexie.  She is 20something now and is doing grand!  She <br/>\nhad some issues with mobility but she never let it bother her.   It&#39;s <br/>\ngood to hear these stories.<br/>\n<br/>\nJoylyn<br/>\n<br/>\ncslkll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; She was born with a dislocated hip that was not discovered<br/>\n&gt; until she was 3mths old.  We went through infant traction<br/>\n&gt; and a whole lotta other stuff.  She is fine now, can run<br/>\n&gt; and play without a problem.  Your post hit me with memories<br/>\n&gt; though, even of my dd having a look of fear for a while when<br/>\n&gt; I went to hold her close.  I just wanted you to know that someone<br/>\n&gt; else has been there, and for us when we saw in the xrays that<br/>\n&gt; the bones were starting to calcify instead of die...we were able<br/>\n&gt; to breathe a little easier.  Bodies are amazing healing machines,<br/>\n&gt; and it was cool to see a malformed bone grow into something &quot;normal&quot;.<br/>\n&gt; healing thoughts to your daughter and you, krista<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, MomtoLJ &lt;joylyn1@c...&gt;<br/>\n&gt; wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; Why did your daughter have hip surgery?  How is she now?<br/>\n&gt; &gt;<br/>\n&gt; &gt; Joylyn<br/>\n&gt; &gt;<br/>\n&gt; &gt; cslkll wrote:<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; I just wanted to say that I can relate to what you<br/>\n&gt; &gt; &gt; are going through.  My 7yo dd was in a full body cast<br/>\n&gt; &gt; &gt; from age 4mth to 7mth after having hip surgery.  Your<br/>\n&gt; &gt; &gt; posts brought back a flood of memories, including being<br/>\n&gt; &gt; &gt; worried about necrosis!  Hope your daughter continues to<br/>\n&gt; &gt; &gt; heal well.krista<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, MomtoLJ<br/>\n&gt; &lt;joylyn1@c...&gt;<br/>\n&gt; &gt; &gt; wrote:<br/>\n&gt; &gt; &gt; &gt; Hey everyone<br/>\n&gt; &gt; &gt; &gt;  &gt;<br/>\n&gt; &gt; &gt; &gt; The good news, at least tentatively, is that the bone in her<br/>\n&gt; hip<br/>\n&gt; &gt; &gt; doesn&#39;t<br/>\n&gt; &gt; &gt; &gt; appear to be dying.  We will still need to wait another six<br/>\n&gt; weeks,<br/>\n&gt; &gt; &gt; to<br/>\n&gt; &gt; &gt; &gt; make sure this is the case, but the preliminary report looks<br/>\n&gt; &gt; &gt; good.  The<br/>\n&gt; &gt; &gt; &gt; bone is also obviously healing.<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; Thank you everyone for your prayers and healing light.  We are<br/>\n&gt; &gt; &gt; getting<br/>\n&gt; &gt; &gt; &gt; through this, thanks to friends and family like all of you.<br/>\n&gt; &gt; &gt; &gt; Joylyn<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards: <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Sponsor<br/>\n&gt; ADVERTISEMENT<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;     * To visit your group on the web, go to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n&gt;        <br/>\n&gt;     * To unsubscribe from this group, send an email to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;       &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;<br/>\n&gt;        <br/>\n&gt;     * Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\n&gt;       Service &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt;No virus found in this incoming message.<br/>\n&gt;Checked by AVG Anti-Virus.<br/>\n&gt;Version: 7.0.300 / Virus Database: 265.8.8 - Release Date: 2/14/2005<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>  ----------<br/>\n<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.300 / Virus Database: 265.8.8 - Release Date: 2/14/2005<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":33526432,"authorName":"cslkll","from":"&quot;cslkll&quot; &lt;cslkll@...&gt;","profile":"cslkll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Update on Lexie 2/14/05","postDate":"1108571110","msgId":103478,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN1dnM1NitkOXNqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQyMTJBODQ0LjYwODA1MDJAY2hhcnRlci5uZXQ+"},"prevInTopic":103460,"nextInTopic":103535,"prevInTime":103477,"nextInTime":103479,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"She was born with a dislocated hip that was not discovered until she was 3mths old.  We went through infant traction and a whole lotta other stuff.  She is","messageBody":"<div id=\"ygrps-yiv-1460195653\">She was born with a dislocated hip that was not discovered<br/>\nuntil she was 3mths old.  We went through infant traction<br/>\nand a whole lotta other stuff.  She is fine now, can run<br/>\nand play without a problem.  Your post hit me with memories<br/>\nthough, even of my dd having a look of fear for a while when<br/>\nI went to hold her close.  I just wanted you to know that someone<br/>\nelse has been there, and for us when we saw in the xrays that<br/>\nthe bones were starting to calcify instead of die...we were able<br/>\nto breathe a little easier.  Bodies are amazing healing machines, <br/>\nand it was cool to see a malformed bone grow into something &quot;normal&quot;.<br/>\nhealing thoughts to your daughter and you, krista<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, MomtoLJ &lt;joylyn1@c...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Why did your daughter have hip surgery?  How is she now?<br/>\n&gt; <br/>\n&gt; Joylyn<br/>\n&gt; <br/>\n&gt; cslkll wrote:<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt; I just wanted to say that I can relate to what you<br/>\n&gt; &gt; are going through.  My 7yo dd was in a full body cast<br/>\n&gt; &gt; from age 4mth to 7mth after having hip surgery.  Your<br/>\n&gt; &gt; posts brought back a flood of memories, including being<br/>\n&gt; &gt; worried about necrosis!  Hope your daughter continues to<br/>\n&gt; &gt; heal well.krista<br/>\n&gt; &gt;<br/>\n&gt; &gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, MomtoLJ <br/>\n </span></blockquote>&lt;joylyn1@c...&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; wrote:<br/>\n&gt; &gt; &gt; Hey everyone<br/>\n&gt; &gt; &gt;  &gt;<br/>\n&gt; &gt; &gt; The good news, at least tentatively, is that the bone in her <br/>\n </span></blockquote>hip<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; doesn&#39;t<br/>\n&gt; &gt; &gt; appear to be dying.  We will still need to wait another six <br/>\n </span></blockquote>weeks,<br/>\n<blockquote><span title=\"qreply\"> &gt; &gt; to<br/>\n&gt; &gt; &gt; make sure this is the case, but the preliminary report looks<br/>\n&gt; &gt; good.  The<br/>\n&gt; &gt; &gt; bone is also obviously healing.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Thank you everyone for your prayers and healing light.  We are<br/>\n&gt; &gt; getting<br/>\n&gt; &gt; &gt; through this, thanks to friends and family like all of you.<br/>\n&gt; &gt; &gt; Joylyn<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Update on Lexie 2/14/05","postDate":"1108518980","msgId":103460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMTJBODQ0LjYwODA1MDJAY2hhcnRlci5uZXQ+","inReplyToHeader":"PGN1dDcwbCtjMnUwQGVHcm91cHMuY29tPg==","referencesHeader":"PGN1dDcwbCtjMnUwQGVHcm91cHMuY29tPg=="},"prevInTopic":103456,"nextInTopic":103478,"prevInTime":103459,"nextInTime":103461,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"Why did your daughter have hip surgery?  How is she now? Joylyn ... [Non-text portions of this message have been removed]","messageBody":"<div id=\"ygrps-yiv-1760489240\">Why did your daughter have hip surgery?  How is she now?<br/>\n<br/>\nJoylyn<br/>\n<br/>\ncslkll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I just wanted to say that I can relate to what you<br/>\n&gt; are going through.  My 7yo dd was in a full body cast<br/>\n&gt; from age 4mth to 7mth after having hip surgery.  Your<br/>\n&gt; posts brought back a flood of memories, including being<br/>\n&gt; worried about necrosis!  Hope your daughter continues to<br/>\n&gt; heal well.krista<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, MomtoLJ &lt;joylyn1@c...&gt;<br/>\n&gt; wrote:<br/>\n&gt; &gt; Hey everyone<br/>\n&gt; &gt;  &gt;<br/>\n&gt; &gt; The good news, at least tentatively, is that the bone in her hip<br/>\n&gt; doesn&#39;t<br/>\n&gt; &gt; appear to be dying.  We will still need to wait another six weeks,<br/>\n&gt; to<br/>\n&gt; &gt; make sure this is the case, but the preliminary report looks<br/>\n&gt; good.  The<br/>\n&gt; &gt; bone is also obviously healing.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Thank you everyone for your prayers and healing light.  We are<br/>\n&gt; getting<br/>\n&gt; &gt; through this, thanks to friends and family like all of you.<br/>\n&gt; &gt; Joylyn<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; --<br/>\n&gt; &gt; No virus found in this outgoing message.<br/>\n&gt; &gt; Checked by AVG Anti-Virus.<br/>\n&gt; &gt; Version: 7.0.300 / Virus Database: 265.8.8 - Release Date:<br/>\n&gt; 2/14/2005<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards: <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Sponsor<br/>\n&gt; ADVERTISEMENT<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;     * To visit your group on the web, go to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n&gt;        <br/>\n&gt;     * To unsubscribe from this group, send an email to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;       &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;<br/>\n&gt;        <br/>\n&gt;     * Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\n&gt;       Service &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt;No virus found in this incoming message.<br/>\n&gt;Checked by AVG Anti-Virus.<br/>\n&gt;Version: 7.0.300 / Virus Database: 265.8.8 - Release Date: 2/14/2005<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":145571280,"authorName":"Amy and Cory Nelson","from":"Amy and Cory Nelson &lt;acnelson@...&gt;","profile":"amcanelson","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Update on Lexie 2/14/05","postDate":"1108495024","msgId":103456,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJFMzdBNkQwLjI2OTY0JWFjbmVsc29uQGl3Lm5ldD4=","inReplyToHeader":"PGN1dDcwbCtjMnUwQGVHcm91cHMuY29tPg=="},"prevInTopic":103444,"nextInTopic":103460,"prevInTime":103455,"nextInTime":103457,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"Joylynn, That s great news that the hip bone seems to be healing well! My son broke his leg last year and was in a cast for about a month, but his healing ","messageBody":"<div id=\"ygrps-yiv-1960176386\">Joylynn,<br/>\n<br/>\nThat&#39;s great news that the hip bone seems to be healing well! My son broke<br/>\nhis leg last year and was in a cast for about a month, but his healing<br/>\nprocess wasn&#39;t as long as your daughter&#39;s. I remember, though, after his<br/>\ncast was off and how wary we both were about using the leg again and<br/>\nworrying about injuring it again. It made me a little nervous when he<br/>\ncontinued walking around as if he had a cast on, but he did adjust quickly<br/>\nto being cast-less.<br/>\n<br/>\nHopefully everything continues to go well! It sounds as if you&#39;ve been quite<br/>\ncreative in helping her continue to adjust.<br/>\n<br/>\n <br/>\n-- <br/>\nAmy<br/>\nMama to Accalia (6/14/99) and Cole (9/03/02)<br/>\n&quot;What we must decide is perhaps how we are valuable rather than how valuable<br/>\nwe are.&quot; --Edgar Z. Friedenberg<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thissideofsomewhere.com/\">http://thissideofsomewhere.com/</a></div>","specialLinks":[]},{"userId":33526432,"authorName":"cslkll","from":"&quot;cslkll&quot; &lt;cslkll@...&gt;","profile":"cslkll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Update on Lexie 2/14/05","postDate":"1108483925","msgId":103444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN1dDcwbCtjMnUwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQyMTE3MkJDLjIwMTA5MDFAY2hhcnRlci5uZXQ+"},"prevInTopic":103431,"nextInTopic":103456,"prevInTime":103443,"nextInTime":103445,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"I just wanted to say that I can relate to what you are going through.  My 7yo dd was in a full body cast from age 4mth to 7mth after having hip surgery.  Your ","messageBody":"<div id=\"ygrps-yiv-1420759242\">I just wanted to say that I can relate to what you <br/>\nare going through.  My 7yo dd was in a full body cast<br/>\nfrom age 4mth to 7mth after having hip surgery.  Your<br/>\nposts brought back a flood of memories, including being<br/>\nworried about necrosis!  Hope your daughter continues to<br/>\nheal well.krista<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, MomtoLJ &lt;joylyn1@c...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Hey everyone<br/>\n&gt;  &gt; <br/>\n&gt; The good news, at least tentatively, is that the bone in her hip <br/>\n </span></blockquote>doesn&#39;t <br/>\n<blockquote><span title=\"ireply\"> &gt; appear to be dying.  We will still need to wait another six weeks, <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; make sure this is the case, but the preliminary report looks <br/>\n </span></blockquote>good.  The <br/>\n<blockquote><span title=\"ireply\"> &gt; bone is also obviously healing. <br/>\n&gt; <br/>\n <br/>\n&gt; <br/>\n&gt; Thank you everyone for your prayers and healing light.  We are <br/>\n </span></blockquote>getting <br/>\n<blockquote><span title=\"ireply\"> &gt; through this, thanks to friends and family like all of you. <br/>\n&gt; Joylyn<br/>\n&gt; <br/>\n&gt; &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; -- <br/>\n&gt; No virus found in this outgoing message.<br/>\n&gt; Checked by AVG Anti-Virus.<br/>\n&gt; Version: 7.0.300 / Virus Database: 265.8.8 - Release Date: <br/>\n </span></blockquote>2/14/2005</div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Update on Lexie 2/14/05","postDate":"1108439740","msgId":103431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMTE3MkJDLjIwMTA5MDFAY2hhcnRlci5uZXQ+","inReplyToHeader":"PDQxRjVFQTVELjYwMzA4MDdAY2hhcnRlci5uZXQ+","referencesHeader":"PGNyZGR2NitjbGI0QGVHcm91cHMuY29tPiA8NDFEQ0Y3RjAuMjA2MDIwOEBjaGFydGVyLm5ldD4JPDQxREY5NjA2LjgwMTA5MDlAY2hhcnRlci5uZXQ+IDw0MUVBRUNGMC43MDgwODA3QGNoYXJ0ZXIubmV0PiA8NDFGNUVBNUQuNjAzMDgwN0BjaGFydGVyLm5ldD4="},"prevInTopic":102777,"nextInTopic":103444,"prevInTime":103430,"nextInTime":103432,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"Hey everyone A few people have asked me to post a general update, so... Lexie got her cast off today.  I have been warning her that she would not go from a","messageBody":"<div id=\"ygrps-yiv-141175087\">Hey everyone<br/>\n<br/>\nA few people have asked me to post a general update, so...<br/>\n<br/>\nLexie got her cast off today.  I have been warning her that she would <br/>\nnot go from a cast to playing soccer, and she understood that at some <br/>\nlevel but I don&#39;t think she really did understand it.  (I don&#39;t think I <br/>\ndid either.)  She was scared and moving the hip for the first time <br/>\nhurt.  Using crutches was hard, but by this afternoon, when she took her <br/>\nbath, it was easier.  I think within a week she&#39;ll be more confident.  <br/>\nHer right knee is actually more painful at this point, because it&#39;s been <br/>\nin one position as well.  I can massage that, and that will help.  Her <br/>\nskin is terribly dry. <br/>\n<br/>\nThe doctor said no weight on that one leg (right) for a month and then <br/>\nmaybe, depending upon xrays at that point, we&#39;ll let her start walking <br/>\nwith a walker.  She is getting a different wheel chair, her size, not <br/>\nthe adult wide one she has now, which was necessary to fit her cast.  <br/>\nShe can sit up straight, and I can get her into the van without help, so <br/>\ntransportation will be easier.  She can now use the crutches to get into <br/>\nthe bathroom and take a bath (she soaked for at least 20 minutes today <br/>\nand would have stayed longer except she was extremely tired) and use the <br/>\nbathroom.  She should also be getting a walker, which the doctor says <br/>\nshe might find easier than crutches, especially for helping her get up <br/>\nand sit down.  I took the shower doors off the bathtub and that helped <br/>\nget her out (I took them off while she was IN the tub, not something I <br/>\nrecommend but we didn&#39;t think about the need to take them off until we <br/>\nsaw her get in, and realized how much easier it would be for her to get <br/>\nin and out if they were off). <br/>\n<br/>\nThe good news, at least tentatively, is that the bone in her hip doesn&#39;t <br/>\nappear to be dying.  We will still need to wait another six weeks, to <br/>\nmake sure this is the case, but the preliminary report looks good.  The <br/>\nbone is also obviously healing. <br/>\n<br/>\nAfter getting her cast off, we went out to eat and then Lexie went to <br/>\nbarnes and noble to spend a gift card.  She was able to buy four items <br/>\nwith the card, including a book on chocolate! <br/>\n<br/>\nThank you everyone for your prayers and healing light.  We are getting <br/>\nthrough this, thanks to friends and family like all of you. <br/>\nJoylyn<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.300 / Virus Database: 265.8.8 - Release Date: 2/14/2005</div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Lexie now has email!","postDate":"1106711524","msgId":102777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRjcxM0U0LjMwMDAxMDdAY2hhcnRlci5uZXQ+","inReplyToHeader":"PDQxRjVFQTVELjYwMzA4MDdAY2hhcnRlci5uZXQ+","referencesHeader":"PGNyZGR2NitjbGI0QGVHcm91cHMuY29tPiA8NDFEQ0Y3RjAuMjA2MDIwOEBjaGFydGVyLm5ldD4JPDQxREY5NjA2LjgwMTA5MDlAY2hhcnRlci5uZXQ+IDw0MUVBRUNGMC43MDgwODA3QGNoYXJ0ZXIubmV0PiA8NDFGNUVBNUQuNjAzMDgwN0BjaGFydGVyLm5ldD4="},"prevInTopic":102775,"nextInTopic":103431,"prevInTime":102776,"nextInTime":102778,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"Hey everyone Lexie now has email.  Well, she had it before but it is now working on her laptop!  We have a long ethernet cable temporarily, we ll figure out ","messageBody":"<div id=\"ygrps-yiv-732919978\">Hey everyone<br/>\n<br/>\nLexie now has email.  Well, she had it before but it is now working on <br/>\nher laptop!  We have a long ethernet cable temporarily, we&#39;ll figure out <br/>\nthe wireless thing later.  So, send Lexie an email, I &#39;m sure she&#39;ll <br/>\nemail you back!  She has NO address on her laptop, so she&#39;ll need help <br/>\nbuffing up her address book. :-)<br/>\n<br/>\nLexie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:flowerpowergirl@...\">flowerpowergirl@...</a>&gt;<br/>\n<br/>\nJoylyn<br/>\n<br/>\nMomtoLJ wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi everyone!<br/>\n&gt;<br/>\n&gt; Another week gone.  Lexie has been in the cast for three weeks, and <br/>\n&gt; has three  more weeks to go.  I spoke with her doctor today and she&#39;s <br/>\n&gt; scheduled to go in on the 14th to have the cast removed. They will do <br/>\n&gt; it in the office, and he reminded me to bring her clothing.  I&#39;m <br/>\n&gt; pretty glad he reminded me, because I may have forgotten... she will <br/>\n&gt; have gone 6 weeks without wearing undies, clean or otherwise... Gotta <br/>\n&gt; find the humor.  Lexie has her day planned out.  She wants a bath, (a <br/>\n&gt; real one, these sponge baths  just don&#39;t cut it!), and to go out to <br/>\n&gt; eat. The situation has made  her appreciate the small things in life <br/>\n&gt; and that can only be good.  She&#39;s happy that the appt will be on <br/>\n&gt; valentine&#39;s day, and I&#39;m happy too, as it&#39;s President&#39;s day or some <br/>\n&gt; such thing, which means I&#39;ll have the day off.  Our appt is for 10:00 am!<br/>\n&gt; She will still be wheelchair bound, or on crutches, for six more <br/>\n&gt; weeks.  The wheel chair will be switched out, so she&#39;ll have a normal <br/>\n&gt; sized child&#39;s wheel chair or small adults, instead of this giant chair <br/>\n&gt; we have now!  I am thinking the hospital bed will still be wise, just <br/>\n&gt; because the waterbed will likely not be a good idea, and the other bed <br/>\n&gt; is on the floor, without a frame.<br/>\n&gt; Lexie continues to be mostly in good spirits.  I am amazed at her <br/>\n&gt; positive attitude, and willingness to do whatever it takes!  She can <br/>\n&gt; get herself out of her wheel chair alone, with the help of her <br/>\n&gt; trapieze bar.  She does many things alone, including taking care of a <br/>\n&gt; lot of her personal needs (as she can, she still needs some help.)  <br/>\n&gt; She loves visitors, and they give her energy (she&#39;s my extrovert!) so <br/>\n&gt; keep the visits coming!  She loves to go for walks and is competent <br/>\n&gt; with the wheel chair for a short time period, and confident enough <br/>\n&gt; that I have let her go for walks down the street with a friend.  Girl <br/>\n&gt; Scouts and DI are coming to her, so that&#39;s helpful.<br/>\n&gt; She is selling girl scout cookies and we are thinking she might have a <br/>\n&gt; good year (another bit of humor).  She went out last night to <br/>\n&gt; neighbors and she and Janene sold about 50 boxes.<br/>\n&gt; The hamster issue seems to have been solved too, as Catherine took <br/>\n&gt; them to a fund raising sale, and sold all of them...to be picked up <br/>\n&gt; Friday or Sunday!  Did you all know that hamsters still nurse when <br/>\n&gt; they are three weeks old, this is in excess of their gestational <br/>\n&gt; time.  It&#39;s amazing what we are learning about hamsters.  I actually <br/>\n&gt; have a waiting list if someone renigs on a hamster.<br/>\n&gt; The dinners are still so appreciated, as are the visits.  Today I was <br/>\n&gt; just so tired, when I came home.  Lexie had a few boxes from friends <br/>\n&gt; to open (knitting stuff from Wendy, thanks! love the needles, arts and <br/>\n&gt; crafts and other things from Fran, and the whopper, a laptop computer <br/>\n&gt; from a bunch of wonderful friends from around the country and as far <br/>\n&gt; away as Australia!  The computer is just amazing, and I&#39;m still crying <br/>\n&gt; over this tremendous gift!) and I couldn&#39;t even think of eating when <br/>\n&gt; Lyla shows up with salad, just what I was craving, and protein filled <br/>\n&gt; chili casserole.  The list of things to do are endless, so that was a <br/>\n&gt; big one (feeding my children, what could be bigger) crossed off--I <br/>\n&gt; could concentrate on the rest, and sit down and relax for a few <br/>\n&gt; moments.  I have vowed strongly that I will make meals and take them <br/>\n&gt; to anyone in need always, forever.  And even if I don&#39;t cook, I will <br/>\n&gt; bring meals because even the &quot;bought&quot; meals have come in handy (I ate <br/>\n&gt; Pollo Loco at work!).  I don&#39;t know what happens to the evening, but <br/>\n&gt; it&#39;s already 10:30 and I&#39;ve accomplished half of what I wanted/needed <br/>\n&gt; to do, and yet I know I haven&#39;t sat down or relaxed at all except for <br/>\n&gt; the 20 minute bath I took an hour ago.  So the meals are so helpful.  <br/>\n&gt; If they could continue, at least every other day, I would very much <br/>\n&gt; appreciate it.<br/>\n&gt; The transportation issue has been solved, as well as possible, with <br/>\n&gt; furniture ties and my van.  Basically two seats have been removed, and <br/>\n&gt; Lexie goes in the van, and the ties serve as extra seatbelts, attached <br/>\n&gt; to the bars where the extra seats go.  She also wears the regular <br/>\n&gt; seatbelt.  It&#39;s better than nothing and with this she will be able to <br/>\n&gt; participate in the DI instant challenge day on Saturday, and go to <br/>\n&gt; park day, etc.  It&#39;s very difficult to get her UP into the van (down <br/>\n&gt; is easier, I just push her out ;-)) it takes two strong bodies (my <br/>\n&gt; parents cannot help with this) but I figure everything will work out....<br/>\n&gt;<br/>\n&gt; The care issue is still an issue.   I am still continuing to look for <br/>\n&gt; people/organizations who can help with this need.  Three more <br/>\n&gt; weeks.... In a few months we&#39;ll look back on this and wonder why we <br/>\n&gt; were worried.  As most of you know, I&#39;m not hugely religious, but I am <br/>\n&gt; feeling as though it will all work out as it needs to work out, <br/>\n&gt; trusting that things will happen as they need to happen.  So far that <br/>\n&gt; has happened.  I work it on my end, calling and thinking and trying to <br/>\n&gt; find a solution and it will happen, the solution will come and all <br/>\n&gt; will be fine.<br/>\n&gt; My parents are doing a wonderful job, but it&#39;s tiring for them, and <br/>\n&gt; difficult.  I&#39;m not sure how much longer they can stay, but I <br/>\n&gt; appreciative of every minute, every day.<br/>\n&gt; I continue to be overwhelmed with the friends we have who have <br/>\n&gt; supported us through this time.  We are indeed very rich people, in <br/>\n&gt; the best meaning of that word.  Thank you everyone.  I can never repay <br/>\n&gt; or say thank you enough, so I will simply vow to pass it on.<br/>\n&gt;<br/>\n&gt; Joylyn<br/>\n&gt;<br/>\n&gt; MomtoLJ wrote:<br/>\n&gt;<br/>\n&gt;&gt; I think today is the 16th...<br/>\n&gt;&gt;<br/>\n&gt;&gt; Lexie is outside in her wheelchair, in clothing.  This is a big deal. <br/>\n&gt;&gt; No clothes fit over her cast, and a friend made her some wrap around<br/>\n&gt;&gt; shorts that cover her as needed and are darn cute too!  She has that and<br/>\n&gt;&gt; her DI tshirt on, and is not in her hospital bed with a sheet over<br/>\n&gt;&gt; her--what this must be doing to her mentality, just to be out of bed<br/>\n&gt;&gt; outside with her friend playing.<br/>\n&gt;&gt;<br/>\n&gt;&gt; She has good spirits, loves to talk on the phone with folks that call,<br/>\n&gt;&gt; and loves visitors, is eating better, especially at night, although we<br/>\n&gt;&gt; are having issues with getting her vitamins down, she just doesn&#39;t like<br/>\n&gt;&gt; the flavor so we will try smooshing them again today and mixing them<br/>\n&gt;&gt; with maybe yogurt or pudding.  She is pretty much pain free, except at<br/>\n&gt;&gt; night a bit, and is getting really good at moving herself around,<br/>\n&gt;&gt; getting to things on her table, and handling her personal needs (with<br/>\n&gt;&gt; assistance, of course).  Lexie is going to get through this because she<br/>\n&gt;&gt; is so strong and brave.<br/>\n&gt;&gt;<br/>\n&gt;&gt; I told her that in the hospital and she forbid me to say it again.  She<br/>\n&gt;&gt; said &quot;when you tell me I&#39;m strong and brave I think this is some huge<br/>\n&gt;&gt; and horrible situation I have to deal with and that it will be hard, but<br/>\n&gt;&gt; if you just tell me you love me then I know it&#39;s just a normal situation<br/>\n&gt;&gt; I can handle.&quot;  Wisdom from my 9 year old.  So I will just tell you all<br/>\n&gt;&gt; that she&#39;s strong and brave and I will just tell her I love her.  I did<br/>\n&gt;&gt; find a way to crawl into bed with her to cuddle, something we have<br/>\n&gt;&gt; missed dreadfully, and that has helped us both.<br/>\n&gt;&gt;<br/>\n&gt;&gt; I have a cold as does Janene, but I&#39;m not surprised, between being<br/>\n&gt;&gt; exposed to hospital germs and lack of sleep... I am catching up this<br/>\n&gt;&gt; weekend.<br/>\n&gt;&gt;<br/>\n&gt;&gt; The things to over come still seem to be transportation and help with<br/>\n&gt;&gt; home health care.  My mom isn&#39;t going to be able to do this for another<br/>\n&gt;&gt; four weeks, or longer (I will talk to the doctor on Monday about what<br/>\n&gt;&gt; the situation is when her cast is removed, will she be able to sit up<br/>\n&gt;&gt; and be in a regular car seat?  I&#39;m pretty sure she&#39;ll need to be pretty<br/>\n&gt;&gt; much immobile for a while longer... If it&#39;s just a wheel chair and she&#39;s<br/>\n&gt;&gt; sitting up then we may be able to return to our previous child care<br/>\n&gt;&gt; situation before the injury...)  I am calling agency after agency, each<br/>\n&gt;&gt; of whom just tells me to call another agency... Most of those calls are<br/>\n&gt;&gt; stopped for the long weekend, but I will resume on Tuesday.  Kaiser is<br/>\n&gt;&gt; open on Monday and I put a call in Friday night demanding that they help<br/>\n&gt;&gt; with at least the transportation to the doctor and back as that is<br/>\n&gt;&gt; medical necessary.  I told them that if I put her unsafely in my car<br/>\n&gt;&gt; after THEY told me it was unsafe, and there was an accident, I&#39;m sure<br/>\n&gt;&gt; that my car insurance would be quite interested in how a medical team<br/>\n&gt;&gt; could allow a child to be transported unsafely... They tried to say the<br/>\n&gt;&gt; trip home from the hospital (2nd hospital stay, I think some of you<br/>\n&gt;&gt; don&#39;t know she had to go in again last week, Sunday-Tuesday--she got a<br/>\n&gt;&gt; new hot pink cast out of it!)  wasn&#39;t covered and I told them that about<br/>\n&gt;&gt; my insurance and within an hour they had agreed to transport her home by<br/>\n&gt;&gt; ambulance --the precedence has been set.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Well, I need to go out to help her go on a walk... the wheel chair is<br/>\n&gt;&gt; off center a bit because of her size, but it&#39;s the only one that will<br/>\n&gt;&gt; fit her cast, so her friend can&#39;t take her without me there to help in<br/>\n&gt;&gt; case there is a problem.  Thanks again for all your healing thoughts and<br/>\n&gt;&gt; prayers and help with meals (the meals are an incredible help, I never<br/>\n&gt;&gt; understood that before, but I do now!) and all the other help people are<br/>\n&gt;&gt; giving.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Joylyn<br/>\n&gt;&gt;<br/>\n&gt;&gt; &gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;   ----------<br/>\n&gt;&gt;<br/>\n&gt;&gt; No virus found in this outgoing message.<br/>\n&gt;&gt; Checked by AVG Anti-Virus.<br/>\n&gt;&gt; Version: 7.0.300 / Virus Database: 265.6.13 - Release Date: 1/16/2005<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; ------------------------------------------------------------------------<br/>\n&gt;&gt; Yahoo! Groups Links<br/>\n&gt;&gt;<br/>\n&gt;&gt;     * To visit your group on the web, go to:<br/>\n&gt;&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/soc-hs/\">http://groups.yahoo.com/group/soc-hs/</a><br/>\n&gt;&gt;            * To unsubscribe from this group, send an email to:<br/>\n&gt;&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:soc-hs-unsubscribe@yahoogroups.com\">soc-hs-unsubscribe@yahoogroups.com</a><br/>\n&gt;&gt;       &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:soc-hs-unsubscribe@yahoogroups.com\">soc-hs-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;<br/>\n&gt;&gt;            * Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\n&gt;&gt;       Service &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; ------------------------------------------------------------------------<br/>\n&gt;&gt;<br/>\n&gt;&gt; No virus found in this incoming message.<br/>\n&gt;&gt; Checked by AVG Anti-Virus.<br/>\n&gt;&gt; Version: 7.0.300 / Virus Database: 265.6.13 - Release Date: 1/16/2005<br/>\n&gt;&gt;  <br/>\n&gt;&gt;<br/>\n&gt; To make changes to your subscription scroll to the bottom of <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://lists.kjsl.com/mailman/listinfo/great-big-kids\">http://lists.kjsl.com/mailman/listinfo/great-big-kids</a><br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.300 / Virus Database: 265.7.2 - Release Date: 1/21/2005</div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Update on Lexie 1/24/05","postDate":"1106705639","msgId":102775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRjZGQ0U3LjcwMjA1MDlAY2hhcnRlci5uZXQ+","inReplyToHeader":"PGNkLjIwNmJlODQyLjJmMjdlMzllQGFvbC5jb20+","referencesHeader":"PGNkLjIwNmJlODQyLjJmMjdlMzllQGFvbC5jb20+"},"prevInTopic":102767,"nextInTopic":102777,"prevInTime":102774,"nextInTime":102776,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"I think according to Kathy D s research, larger mammals nurse at least 2 1/2 times the length of gestation while smaller mammals nurse less... It just is funny","messageBody":"<div id=\"ygrps-yiv-1880000458\">I think according to Kathy D&#39;s research, larger mammals nurse at least 2 <br/>\n1/2 times the length of gestation while smaller mammals nurse less... It <br/>\njust is funny to see these HUGE hamster babies nursing, and so many of them!<br/>\n<br/>\nJoylyn<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; In a message dated 1/25/05 9:25:20 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joylyn1@...\">joylyn1@...</a> writes:<br/>\n&gt;<br/>\n&gt; &lt;&lt; Did you all know that hamsters still nurse when they are three<br/>\n&gt; weeks old, this is in excess of their gestational time.  &gt;&gt;<br/>\n&gt;<br/>\n&gt; ===<br/>\n&gt;<br/>\n&gt; Humans nurse in excess of gestational time.<br/>\n&gt; Dogs do, don&#39;t they?<br/>\n&gt;<br/>\n&gt; I wonder if elephants do!!<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards: <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;     * To visit your group on the web, go to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n&gt;        <br/>\n&gt;     * To unsubscribe from this group, send an email to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;       &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;<br/>\n&gt;        <br/>\n&gt;     * Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\n&gt;       Service &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt;No virus found in this incoming message.<br/>\n&gt;Checked by AVG Anti-Virus.<br/>\n&gt;Version: 7.0.300 / Virus Database: 265.7.2 - Release Date: 1/21/2005<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Update on Lexie 1/24/05","postDate":"1106676126","msgId":102767,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNkLjIwNmJlODQyLjJmMjdlMzllQGFvbC5jb20+"},"prevInTopic":102761,"nextInTopic":102775,"prevInTime":102766,"nextInTime":102768,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/25/05 9:25:20 AM, joylyn1@charter.net writes: ","messageBody":"<div id=\"ygrps-yiv-1592400383\">In a message dated 1/25/05 9:25:20 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joylyn1@...\">joylyn1@...</a> writes:<br/>\n<br/>\n&lt;&lt; Did you all know that hamsters still nurse when they are three <br/>\nweeks old, this is in excess of their gestational time.  &gt;&gt;<br/>\n<br/>\n===<br/>\n<br/>\nHumans nurse in excess of gestational time.<br/>\nDogs do, don&#39;t they?<br/>\n<br/>\nI wonder if elephants do!!</div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Update on Lexie 1/24/05","postDate":"1106635357","msgId":102761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRjVFQTVELjYwMzA4MDdAY2hhcnRlci5uZXQ+","inReplyToHeader":"PDQxRUFFQ0YwLjcwODA4MDdAY2hhcnRlci5uZXQ+","referencesHeader":"PGNyZGR2NitjbGI0QGVHcm91cHMuY29tPiA8NDFEQ0Y3RjAuMjA2MDIwOEBjaGFydGVyLm5ldD4gPDQxREY5NjA2LjgwMTA5MDlAY2hhcnRlci5uZXQ+IDw0MUVBRUNGMC43MDgwODA3QGNoYXJ0ZXIubmV0Pg=="},"prevInTopic":102663,"nextInTopic":102767,"prevInTime":102760,"nextInTime":102762,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"Hi everyone! Another week gone.  Lexie has been in the cast for three weeks, and has three  more weeks to go.  I spoke with her doctor today and she s ","messageBody":"<div id=\"ygrps-yiv-435704551\">Hi everyone!<br/>\n<br/>\nAnother week gone.  Lexie has been in the cast for three weeks, and has <br/>\nthree  more weeks to go.  I spoke with her doctor today and she&#39;s <br/>\nscheduled to go in on the 14th to have the cast removed. They will do it <br/>\nin the office, and he reminded me to bring her clothing.  I&#39;m pretty <br/>\nglad he reminded me, because I may have forgotten... she will have gone <br/>\n6 weeks without wearing undies, clean or otherwise... Gotta find the <br/>\nhumor.  Lexie has her day planned out.  She wants a bath, (a real one, <br/>\nthese sponge baths  just don&#39;t cut it!), and to go out to eat. The <br/>\nsituation has made  her appreciate the small things in life and that can <br/>\nonly be good.  She&#39;s happy that the appt will be on valentine&#39;s day, and <br/>\nI&#39;m happy too, as it&#39;s President&#39;s day or some such thing, which means <br/>\nI&#39;ll have the day off.  Our appt is for 10:00 am! <br/>\n<br/>\nShe will still be wheelchair bound, or on crutches, for six more weeks.  <br/>\nThe wheel chair will be switched out, so she&#39;ll have a normal sized <br/>\nchild&#39;s wheel chair or small adults, instead of this giant chair we have <br/>\nnow!  I am thinking the hospital bed will still be wise, just because <br/>\nthe waterbed will likely not be a good idea, and the other bed is on the <br/>\nfloor, without a frame. <br/>\n<br/>\nLexie continues to be mostly in good spirits.  I am amazed at her <br/>\npositive attitude, and willingness to do whatever it takes!  She can get <br/>\nherself out of her wheel chair alone, with the help of her trapieze <br/>\nbar.  She does many things alone, including taking care of a lot of her <br/>\npersonal needs (as she can, she still needs some help.)  She loves <br/>\nvisitors, and they give her energy (she&#39;s my extrovert!) so keep the <br/>\nvisits coming!  She loves to go for walks and is competent with the <br/>\nwheel chair for a short time period, and confident enough that I have <br/>\nlet her go for walks down the street with a friend.  Girl Scouts and DI <br/>\nare coming to her, so that&#39;s helpful. <br/>\n<br/>\nShe is selling girl scout cookies and we are thinking she might have a <br/>\ngood year (another bit of humor).  She went out last night to neighbors <br/>\nand she and Janene sold about 50 boxes. <br/>\n<br/>\nThe hamster issue seems to have been solved too, as Catherine took them <br/>\nto a fund raising sale, and sold all of them...to be picked up Friday or <br/>\nSunday!  Did you all know that hamsters still nurse when they are three <br/>\nweeks old, this is in excess of their gestational time.  It&#39;s amazing <br/>\nwhat we are learning about hamsters.  I actually have a waiting list if <br/>\nsomeone renigs on a hamster. <br/>\n<br/>\nThe dinners are still so appreciated, as are the visits.  Today I was <br/>\njust so tired, when I came home.  Lexie had a few boxes from friends to <br/>\nopen (knitting stuff from Wendy, thanks! love the needles, arts and <br/>\ncrafts and other things from Fran, and the whopper, a laptop computer <br/>\nfrom a bunch of wonderful friends from around the country and as far <br/>\naway as Australia!  The computer is just amazing, and I&#39;m still crying <br/>\nover this tremendous gift!) and I couldn&#39;t even think of eating when <br/>\nLyla shows up with salad, just what I was craving, and protein filled <br/>\nchili casserole.  The list of things to do are endless, so that was a <br/>\nbig one (feeding my children, what could be bigger) crossed off--I could <br/>\nconcentrate on the rest, and sit down and relax for a few moments.  I <br/>\nhave vowed strongly that I will make meals and take them to anyone in <br/>\nneed always, forever.  And even if I don&#39;t cook, I will bring meals <br/>\nbecause even the &quot;bought&quot; meals have come in handy (I ate Pollo Loco at <br/>\nwork!).  I don&#39;t know what happens to the evening, but it&#39;s already <br/>\n10:30 and I&#39;ve accomplished half of what I wanted/needed to do, and yet <br/>\nI know I haven&#39;t sat down or relaxed at all except for the 20 minute <br/>\nbath I took an hour ago.  So the meals are so helpful.  If they could <br/>\ncontinue, at least every other day, I would very much appreciate it. <br/>\n<br/>\nThe transportation issue has been solved, as well as possible, with <br/>\nfurniture ties and my van.  Basically two seats have been removed, and <br/>\nLexie goes in the van, and the ties serve as extra seatbelts, attached <br/>\nto the bars where the extra seats go.  She also wears the regular <br/>\nseatbelt.  It&#39;s better than nothing and with this she will be able to <br/>\nparticipate in the DI instant challenge day on Saturday, and go to park <br/>\nday, etc.  It&#39;s very difficult to get her UP into the van (down is <br/>\neasier, I just push her out ;-)) it takes two strong bodies (my parents <br/>\ncannot help with this) but I figure everything will work out....<br/>\n<br/>\nThe care issue is still an issue.   I am still continuing to look for <br/>\npeople/organizations who can help with this need.  Three more weeks.... <br/>\nIn a few months we&#39;ll look back on this and wonder why we were worried.  <br/>\nAs most of you know, I&#39;m not hugely religious, but I am feeling as <br/>\nthough it will all work out as it needs to work out, trusting that <br/>\nthings will happen as they need to happen.  So far that has happened.  I <br/>\nwork it on my end, calling and thinking and trying to find a solution <br/>\nand it will happen, the solution will come and all will be fine. <br/>\n<br/>\nMy parents are doing a wonderful job, but it&#39;s tiring for them, and <br/>\ndifficult.  I&#39;m not sure how much longer they can stay, but I <br/>\nappreciative of every minute, every day. <br/>\n<br/>\nI continue to be overwhelmed with the friends we have who have supported <br/>\nus through this time.  We are indeed very rich people, in the best <br/>\nmeaning of that word.  Thank you everyone.  I can never repay or say <br/>\nthank you enough, so I will simply vow to pass it on.<br/>\n<br/>\nJoylyn<br/>\n<br/>\nMomtoLJ wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think today is the 16th...<br/>\n&gt;<br/>\n&gt; Lexie is outside in her wheelchair, in clothing.  This is a big deal. <br/>\n&gt; No clothes fit over her cast, and a friend made her some wrap around<br/>\n&gt; shorts that cover her as needed and are darn cute too!  She has that and<br/>\n&gt; her DI tshirt on, and is not in her hospital bed with a sheet over<br/>\n&gt; her--what this must be doing to her mentality, just to be out of bed<br/>\n&gt; outside with her friend playing.<br/>\n&gt;<br/>\n&gt; She has good spirits, loves to talk on the phone with folks that call,<br/>\n&gt; and loves visitors, is eating better, especially at night, although we<br/>\n&gt; are having issues with getting her vitamins down, she just doesn&#39;t like<br/>\n&gt; the flavor so we will try smooshing them again today and mixing them<br/>\n&gt; with maybe yogurt or pudding.  She is pretty much pain free, except at<br/>\n&gt; night a bit, and is getting really good at moving herself around,<br/>\n&gt; getting to things on her table, and handling her personal needs (with<br/>\n&gt; assistance, of course).  Lexie is going to get through this because she<br/>\n&gt; is so strong and brave.<br/>\n&gt;<br/>\n&gt; I told her that in the hospital and she forbid me to say it again.  She<br/>\n&gt; said &quot;when you tell me I&#39;m strong and brave I think this is some huge<br/>\n&gt; and horrible situation I have to deal with and that it will be hard, but<br/>\n&gt; if you just tell me you love me then I know it&#39;s just a normal situation<br/>\n&gt; I can handle.&quot;  Wisdom from my 9 year old.  So I will just tell you all<br/>\n&gt; that she&#39;s strong and brave and I will just tell her I love her.  I did<br/>\n&gt; find a way to crawl into bed with her to cuddle, something we have<br/>\n&gt; missed dreadfully, and that has helped us both.<br/>\n&gt;<br/>\n&gt; I have a cold as does Janene, but I&#39;m not surprised, between being<br/>\n&gt; exposed to hospital germs and lack of sleep... I am catching up this<br/>\n&gt; weekend.<br/>\n&gt;<br/>\n&gt; The things to over come still seem to be transportation and help with<br/>\n&gt; home health care.  My mom isn&#39;t going to be able to do this for another<br/>\n&gt; four weeks, or longer (I will talk to the doctor on Monday about what<br/>\n&gt; the situation is when her cast is removed, will she be able to sit up<br/>\n&gt; and be in a regular car seat?  I&#39;m pretty sure she&#39;ll need to be pretty<br/>\n&gt; much immobile for a while longer... If it&#39;s just a wheel chair and she&#39;s<br/>\n&gt; sitting up then we may be able to return to our previous child care<br/>\n&gt; situation before the injury...)  I am calling agency after agency, each<br/>\n&gt; of whom just tells me to call another agency... Most of those calls are<br/>\n&gt; stopped for the long weekend, but I will resume on Tuesday.  Kaiser is<br/>\n&gt; open on Monday and I put a call in Friday night demanding that they help<br/>\n&gt; with at least the transportation to the doctor and back as that is<br/>\n&gt; medical necessary.  I told them that if I put her unsafely in my car<br/>\n&gt; after THEY told me it was unsafe, and there was an accident, I&#39;m sure<br/>\n&gt; that my car insurance would be quite interested in how a medical team<br/>\n&gt; could allow a child to be transported unsafely... They tried to say the<br/>\n&gt; trip home from the hospital (2nd hospital stay, I think some of you<br/>\n&gt; don&#39;t know she had to go in again last week, Sunday-Tuesday--she got a<br/>\n&gt; new hot pink cast out of it!)  wasn&#39;t covered and I told them that about<br/>\n&gt; my insurance and within an hour they had agreed to transport her home by<br/>\n&gt; ambulance --the precedence has been set.<br/>\n&gt;<br/>\n&gt; Well, I need to go out to help her go on a walk... the wheel chair is<br/>\n&gt; off center a bit because of her size, but it&#39;s the only one that will<br/>\n&gt; fit her cast, so her friend can&#39;t take her without me there to help in<br/>\n&gt; case there is a problem.  Thanks again for all your healing thoughts and<br/>\n&gt; prayers and help with meals (the meals are an incredible help, I never<br/>\n&gt; understood that before, but I do now!) and all the other help people are<br/>\n&gt; giving.<br/>\n&gt;<br/>\n&gt; Joylyn<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;   ----------<br/>\n&gt;<br/>\n&gt; No virus found in this outgoing message.<br/>\n&gt; Checked by AVG Anti-Virus.<br/>\n&gt; Version: 7.0.300 / Virus Database: 265.6.13 - Release Date: 1/16/2005<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;     * To visit your group on the web, go to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/soc-hs/\">http://groups.yahoo.com/group/soc-hs/</a><br/>\n&gt;        <br/>\n&gt;     * To unsubscribe from this group, send an email to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:soc-hs-unsubscribe@yahoogroups.com\">soc-hs-unsubscribe@yahoogroups.com</a><br/>\n&gt;       &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:soc-hs-unsubscribe@yahoogroups.com\">soc-hs-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;<br/>\n&gt;        <br/>\n&gt;     * Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\n&gt;       Service &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;------------------------------------------------------------------------<br/>\n&gt;<br/>\n&gt;No virus found in this incoming message.<br/>\n&gt;Checked by AVG Anti-Virus.<br/>\n&gt;Version: 7.0.300 / Virus Database: 265.6.13 - Release Date: 1/16/2005<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":109856460,"authorName":"nellebelle","from":"&quot;nellebelle&quot; &lt;nellebelle@...&gt;","profile":"lamaribelle","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Update on Lexie 1/16","postDate":"1105996385","msgId":102663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDMwMWM0ZmNkOSRhMDdiM2I3MCQ2NDAxYThjMEBob21lPg==","referencesHeader":"PGNyZGR2NitjbGI0QGVHcm91cHMuY29tPiA8NDFEQ0Y3RjAuMjA2MDIwOEBjaGFydGVyLm5ldD4gPDQxREY5NjA2LjgwMTA5MDlAY2hhcnRlci5uZXQ+IDw0MUVBRUNGMC43MDgwODA3QGNoYXJ0ZXIubmV0Pg=="},"prevInTopic":102657,"nextInTopic":102761,"prevInTime":102662,"nextInTime":102664,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"... That s interesting.  I wonder if some people would like hearing that they are strong and brave? I m glad to hear that Lexie is coming along and that you","messageBody":"<div id=\"ygrps-yiv-1905414216\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;I told her that in the hospital and she forbid me to say it again.  She said &quot;when you tell me I&#39;m strong and brave I think this is some huge and horrible situation I have to deal with and that it will be hard, but if you just tell me you love me then I know it&#39;s just a normal situation I can handle.&quot;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>That&#39;s interesting.  I wonder if some people would like hearing that they are strong and brave?<br/>\n<br/>\nI&#39;m glad to hear that Lexie is coming along and that you have lots of support.  It can be a gift to let our friends help us, I think.<br/>\n<br/>\nI mentioned awhile back that I would be having chemotherapy for breast cancer, but I&#39;ve decided not to do the chemotherapy at this time. ** (note below in case anyone wonders about that.  I gave little thought to breast cancer until it happened to me.)<br/>\n<br/>\nOne of my friends has told me several times that I&#39;m so brave.  While it didn&#39;t highly annoy me, I didn&#39;t find it very helpful either.  I mean, this thing has happened and I have to deal with it.  Is that bravery?  A few times I&#39;ve found myself comforting other people who act so upset by my diagnosis.  Weird.  OTH, it is difficult to know what to say to people when bad things happen.<br/>\n<br/>\nMary Ellen<br/>\n<br/>\n**note about breast cancer follows.  Delete now if not interested.<br/>\n<br/>\nMy husband found the lump.  I&#39;ve since heard that a majority of breast cancers are found by the person&#39;s partner.  Mine was a &quot;typical&quot; cancer, being ER+ (Estrogen receptor positive).<br/>\n<br/>\nDefinition of a small breast tumor is debatable.  It used to be 2 cm, but some docs think over 1.  Over 2 centimeters (usually chemo) and under 1 centimeter (chemo rarely recommended) are easier to recommend treatment.  Mine was 1.3 cm.  I saw two oncologists who both said it is a tough call whether to choose chemotherapy.  It is believed that half of the women who receive chemo for breast cancer do not need it, but there are no definitive tests YET available to accurately predict which ones should.  Chemotherapy treatment is much lower risk than it used to be, but certainly not something anybody would choose without good reason.<br/>\n<br/>\nI had a sentinel lymph node biopsy done.  That was negative (no cancer detected in lymph nodes.)  That test is about 97% reliable.  I had a blood test called CA28/29.  It tests for a protein in the blood that is secreted by tumors.  Normal is 0-40 and mine was 4.  The test has limited use though.  If it were reliable and useful for detecting cancer, it would probably be on the list of standard screening tests.  It does give the doctor some info and maybe its use now will result in better info down the road.  I had a chest x-ray that appeared normal.  When breast cancer spreads, it most often spreads first to bones and/or lungs.  I had quite a lesson on why they can&#39;t just do a complete bone scan to look for spread.  Apparently most middle-aged or older people have all kinds of scars or other oddities in their skeletons and doctors see a lot of things that look strange, but most of them aren&#39;t cancer.  So then it begs the question of what they do when they see something odd.  More surgery?  When most of what they find is benign?  Surgery carries plenty of risks that rule out using it without good cause.<br/>\n<br/>\nThere are new results on a test that checks the DNA of the tumor.  Early results show it highly reliable at predicting which cancers will metastasize, but the test is not available for general use yet.<br/>\n<br/>\nI will be having radiation to the breast area.  This would be recommended even if I had chemo.  For some unknown reason, chemo doesn&#39;t prevent local recurrence.  Studies have found that lumpectomy (removing the lump) followed by radiation has the same long-term outcome as mastectomy (removing the entire breast)  When the radiation is done in early March, I am scheduled to take tamoxifen, a hormone receptor blocker.  That has potential risks too, but has been found to make a large difference in recurrence rates.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Update on Lexie 1/16","postDate":"1105915120","msgId":102657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRUFFQ0YwLjcwODA4MDdAY2hhcnRlci5uZXQ+","inReplyToHeader":"PDQxREY5NjA2LjgwMTA5MDlAY2hhcnRlci5uZXQ+","referencesHeader":"PGNyZGR2NitjbGI0QGVHcm91cHMuY29tPiA8NDFEQ0Y3RjAuMjA2MDIwOEBjaGFydGVyLm5ldD4gPDQxREY5NjA2LjgwMTA5MDlAY2hhcnRlci5uZXQ+"},"prevInTopic":102440,"nextInTopic":102663,"prevInTime":102656,"nextInTime":102658,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"I think today is the 16th... Lexie is outside in her wheelchair, in clothing.  This is a big deal. No clothes fit over her cast, and a friend made her some","messageBody":"<div id=\"ygrps-yiv-144797025\">I think today is the 16th...<br/>\n<br/>\nLexie is outside in her wheelchair, in clothing.  This is a big deal.  <br/>\nNo clothes fit over her cast, and a friend made her some wrap around <br/>\nshorts that cover her as needed and are darn cute too!  She has that and <br/>\nher DI tshirt on, and is not in her hospital bed with a sheet over <br/>\nher--what this must be doing to her mentality, just to be out of bed <br/>\noutside with her friend playing. <br/>\n<br/>\nShe has good spirits, loves to talk on the phone with folks that call, <br/>\nand loves visitors, is eating better, especially at night, although we <br/>\nare having issues with getting her vitamins down, she just doesn&#39;t like <br/>\nthe flavor so we will try smooshing them again today and mixing them <br/>\nwith maybe yogurt or pudding.  She is pretty much pain free, except at <br/>\nnight a bit, and is getting really good at moving herself around, <br/>\ngetting to things on her table, and handling her personal needs (with <br/>\nassistance, of course).  Lexie is going to get through this because she <br/>\nis so strong and brave. <br/>\n<br/>\nI told her that in the hospital and she forbid me to say it again.  She <br/>\nsaid &quot;when you tell me I&#39;m strong and brave I think this is some huge <br/>\nand horrible situation I have to deal with and that it will be hard, but <br/>\nif you just tell me you love me then I know it&#39;s just a normal situation <br/>\nI can handle.&quot;  Wisdom from my 9 year old.  So I will just tell you all <br/>\nthat she&#39;s strong and brave and I will just tell her I love her.  I did <br/>\nfind a way to crawl into bed with her to cuddle, something we have <br/>\nmissed dreadfully, and that has helped us both. <br/>\n<br/>\nI have a cold as does Janene, but I&#39;m not surprised, between being <br/>\nexposed to hospital germs and lack of sleep... I am catching up this <br/>\nweekend.<br/>\n<br/>\nThe things to over come still seem to be transportation and help with <br/>\nhome health care.  My mom isn&#39;t going to be able to do this for another <br/>\nfour weeks, or longer (I will talk to the doctor on Monday about what <br/>\nthe situation is when her cast is removed, will she be able to sit up <br/>\nand be in a regular car seat?  I&#39;m pretty sure she&#39;ll need to be pretty <br/>\nmuch immobile for a while longer... If it&#39;s just a wheel chair and she&#39;s <br/>\nsitting up then we may be able to return to our previous child care <br/>\nsituation before the injury...)  I am calling agency after agency, each <br/>\nof whom just tells me to call another agency... Most of those calls are <br/>\nstopped for the long weekend, but I will resume on Tuesday.  Kaiser is <br/>\nopen on Monday and I put a call in Friday night demanding that they help <br/>\nwith at least the transportation to the doctor and back as that is <br/>\nmedical necessary.  I told them that if I put her unsafely in my car <br/>\nafter THEY told me it was unsafe, and there was an accident, I&#39;m sure <br/>\nthat my car insurance would be quite interested in how a medical team <br/>\ncould allow a child to be transported unsafely... They tried to say the <br/>\ntrip home from the hospital (2nd hospital stay, I think some of you <br/>\ndon&#39;t know she had to go in again last week, Sunday-Tuesday--she got a <br/>\nnew hot pink cast out of it!)  wasn&#39;t covered and I told them that about <br/>\nmy insurance and within an hour they had agreed to transport her home by <br/>\nambulance --the precedence has been set. <br/>\n<br/>\nWell, I need to go out to help her go on a walk... the wheel chair is <br/>\noff center a bit because of her size, but it&#39;s the only one that will <br/>\nfit her cast, so her friend can&#39;t take her without me there to help in <br/>\ncase there is a problem.  Thanks again for all your healing thoughts and <br/>\nprayers and help with meals (the meals are an incredible help, I never <br/>\nunderstood that before, but I do now!) and all the other help people are <br/>\ngiving. <br/>\n<br/>\nJoylyn<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>  ----------<br/>\n<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.300 / Virus Database: 265.6.13 - Release Date: 1/16/2005<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Update on Lexie 1/7","postDate":"1105207059","msgId":102440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRTAxRjEzLjEwMDAxMDJAY2hhcnRlci5uZXQ+","inReplyToHeader":"PDFlMi4zMmExZDdiMC4yZjExNGU5ZEBhb2wuY29tPg==","referencesHeader":"PDFlMi4zMmExZDdiMC4yZjExNGU5ZEBhb2wuY29tPg=="},"prevInTopic":102435,"nextInTopic":102657,"prevInTime":102439,"nextInTime":102441,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"... I will check into a charity, but the bus situation is similar to suntran but yes, because of the county thing... here is what I wrote to another list. They","messageBody":"<div id=\"ygrps-yiv-590736969\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Maye there&#39;s something there like Suntran (the city bus line) has in <br/>\n&gt; Albuquerque, a van you can make an appointment to have pick you up.    <br/>\n&gt; People use it<br/>\n&gt; for that, I know--getting to the doctor when they can&#39;t get to the  <br/>\n&gt; bus stop<br/>\n&gt; or get into the bus.  Because it&#39;sin another county that might be  a <br/>\n&gt; problem,<br/>\n&gt; but there might be something there like that, or a charity that  <br/>\n&gt; provides such<br/>\n&gt; services.<br/>\n<br/>\n </span></blockquote>I will check into a charity, but the bus situation is similar to suntran <br/>\nbut yes, because of the county thing... here is what I wrote to another <br/>\nlist.<br/>\n<br/>\n<br/>\nThey do... here&#39;s the scoop.  Lexie&#39;s doc is in Orange County, we are <br/>\njust over the county line in another county, the services are a real <br/>\npain if you cross county l ines, you have to go to the hub and be taken <br/>\noff the one van/bus and then put on another, when they get there.  I was <br/>\ntold this can take hours. Also, there is a 3 week processing time which <br/>\nincludes them coming out to assess the patient, and another visit that <br/>\ntakes the patient to their offices for another assessment.  So, by the <br/>\ntime we did this, we wouldn&#39;t need the service...<br/>\n<br/>\nJoylyn<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards: <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;     * To visit your group on the web, go to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n&gt;        <br/>\n&gt;     * To unsubscribe from this group, send an email to:<br/>\n&gt;       <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n&gt;       &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt;<br/>\n&gt;        <br/>\n&gt;     * Your use of Yahoo! Groups is subject to the Yahoo! Terms of<br/>\n&gt;       Service &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;.<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Update on Lexie 1/7","postDate":"1105196189","msgId":102435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMi4zMmExZDdiMC4yZjExNGU5ZEBhb2wuY29tPg=="},"prevInTopic":102433,"nextInTopic":102440,"prevInTime":102434,"nextInTime":102436,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/8/2005 1:13:35 A.M. Mountain Standard Time, joylyn1@charter.net writes: One  issue we are working on is how to get her to her doctor ","messageBody":"<div id=\"ygrps-yiv-2117211038\">In a message dated 1/8/2005 1:13:35 A.M. Mountain Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:joylyn1@...\">joylyn1@...</a> writes:<br/>\n<br/>\nOne  issue we are working on is how to get her to her doctor <br/>\nappointment.   We really need a wheelchair assessable van.  Anyone have <br/>\nany ideas on  that?<br/>\n<br/>\n<br/>\n<br/>\n=================<br/>\n <br/>\nMaye there&#39;s something there like Suntran (the city bus line) has in  <br/>\nAlbuquerque, a van you can make an appointment to have pick you up.    People use it <br/>\nfor that, I know--getting to the doctor when they can&#39;t get to the  bus stop <br/>\nor get into the bus.  Because it&#39;sin another county that might be  a problem, <br/>\nbut there might be something there like that, or a charity that  provides such <br/>\nservices.<br/>\n <br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Update on Lexie 1/7","postDate":"1105171974","msgId":102433,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxREY5NjA2LjgwMTA5MDlAY2hhcnRlci5uZXQ+","inReplyToHeader":"PDQxRENGN0YwLjIwNjAyMDhAY2hhcnRlci5uZXQ+","referencesHeader":"PGNyZGR2NitjbGI0QGVHcm91cHMuY29tPiA8NDFEQ0Y3RjAuMjA2MDIwOEBjaGFydGVyLm5ldD4="},"prevInTopic":102383,"nextInTopic":102435,"prevInTime":102432,"nextInTime":102434,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"Hi everyone Sorry for the mass email, but many people have asked for an update, so I am going to send one. Lexie is doing very well.  She is doing well","messageBody":"<div id=\"ygrps-yiv-1266079295\">Hi everyone<br/>\n<br/>\nSorry for the mass email, but many people have asked for an update, so I <br/>\nam going to send one. <br/>\n<br/>\nLexie is doing very well.  She is doing well medically, and <br/>\nemotionally.  She has good spirits, is learning to really control what <br/>\nshe can control.  She has a bedside table now and that&#39;s helping.  She <br/>\nhas learned to use the trapeze, to pull herself up and to move around <br/>\nand exercise a bit.  We now have the proper size wheel chair, which will <br/>\nhelp.  I plan to help her into it tomorrow and maybe get her to the <br/>\nporch, if it&#39;s not raining.  She has enjoyed the visitors, she is <br/>\ndefinitely an extrovert and needs the social contact.<br/>\n<br/>\nI am just stunned with the help we&#39;ve received.  People are bringing <br/>\nmeals (Ticia, LOVED the rice and potstickers, is that how you spell it?  <br/>\nyummy!  The African mac and cheese type dish was great too!), things I <br/>\nneed from the store, and helping a lot with other things.  Lexie was <br/>\ncold the first night and an electrical blanket helped with that.  I am <br/>\njust so fortunate to have such great friends.  I can&#39;t even begin to <br/>\nmake a list of the help that I&#39;ve had, and that has been promised for <br/>\nthe next weeks.  The meals are just incredible, I will never again NOT <br/>\nmake a meal for a family in need, I never before realized how such a <br/>\nsimple thing could be so big.  Just to not have to think about what I&#39;m <br/>\ngoing to eat, but to have someone bring me food, to feed to all of us. <br/>\n<br/>\nThe CT scan didn&#39;t show any abnormalities, so we really don&#39;t know why <br/>\nthis happened.  There was no evidence of brittle bone disease or a cyst <br/>\nor tumor or any other explanation.  At this point we are thinking it was <br/>\njust an accident.  We are trying to remain positive about the outcome of <br/>\nall of this.  I did find out her surgeon is one of the top four in the <br/>\ncountry, with this specialty (pediatric orthopedic trauma).  I love, so <br/>\nfar, all of the people in his office.  They are just friendly and nice <br/>\nand wonderful.  Even though her surgeon is in Orange County and we are <br/>\nnow in LA county and farther away, we will figure out how to get to him, <br/>\nfor continuity of care as well as just simply because he is a nice man <br/>\nthat treats my daughter with dignity and respect. <br/>\n<br/>\nJanene is doing OK but it&#39;s pretty hard one her.  She just told me she <br/>\nwants to get chickenpox so she can be sick and have everyone wait on her <br/>\nand treat her like a queen. <br/>\n<br/>\nOne issue we are working on is how to get her to her doctor <br/>\nappointment.  We really need a wheelchair assessable van.  Anyone have <br/>\nany ideas on that?<br/>\n<br/>\nWell, Lexie is calling and Janene needs a story...<br/>\n<br/>\nThank you everyone for your thoughts and prayers.  They are much <br/>\nappreciated.   Again, if you have sent this to other lists I am no <br/>\nlonger on, please feel free to forward.  And, again, sorry for the mass <br/>\nemail.  I have a bunch of emails that I have not answered and I&#39;m going <br/>\nto try to do so soon...<br/>\n<br/>\nThanks again<br/>\n<br/>\nJoylyn<br/>\n<br/>\nMomtoLJ wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi everyone<br/>\n&gt;<br/>\n&gt; I just wanted to send an update on Lexie. If you forwarded the other <br/>\n&gt; notes regarding Lexie, please please forward this one as well, I have <br/>\n&gt; a large number of private notes from people and I will attempt to <br/>\n&gt; answer them tomorrow... I&#39;m sorry if this note is somewhat repetitive...<br/>\n&gt;<br/>\n&gt;  We are home.  Lexie is wide awake in the living room on her very own <br/>\n&gt; (ok, for a while) hospital bed watching TV, as she took a good nap <br/>\n&gt; this afternoon.  She has a trapeze thingie to pull herself up, and we <br/>\n&gt; have a slid board and a wheel chair, but I doubt if the wheel chair <br/>\n&gt; will work, as it is too narrow.  Her cast is such that he knees are <br/>\n&gt; pointing outward slightly and bent, so she doesn&#39;t fit in a car <br/>\n&gt; set...we took an ambulance home!  Lexie was thrilled, and her pain <br/>\n&gt; meds kept the old bouncing vehicle from hurting too much.  She already <br/>\n&gt; has lots of signatures on her cast, but it&#39;s pretty big and there is <br/>\n&gt; still room for more... I need to sign before all the good space is taken.<br/>\n&gt;<br/>\n&gt; I&#39;m not sure what was said, so I&#39;ll repeat this too. Lexie fell rather <br/>\n&gt; hard on tile and broke her femur at the neck.  This is, sadly, a very <br/>\n&gt; bad break, and her break in particular was one of the worst the <br/>\n&gt; pediatric trauma orthopedic surgeon (specializing in fractures) had <br/>\n&gt; ever seen.  We did get her into surgery within the 6 hour time frame <br/>\n&gt; crucial to help ensure healing, but because of the position of the <br/>\n&gt; break and the severity of it, there is a 60% chance of the femur head <br/>\n&gt; dying which would lead to long term issues, likely more surgery, <br/>\n&gt; arthritis, growth problems, etc. (Lexie is unaware of these issues). <br/>\n&gt; As it is we are looking at long term recovery, with about 4-6 weeks <br/>\n&gt; immobility in a body cast, and long term PT.  The surgeon put in 3 <br/>\n&gt; pins and is hopeful that Lexie will recover.  He was very impressed <br/>\n&gt; with her spirit and intelligence and her assertiveness with the care <br/>\n&gt; providers at the hospital, and we all commented on how her positive <br/>\n&gt; spirit and attitude will help with her healing.  She had been expected <br/>\n&gt; to stay in the hospital until Thursday or Friday, but we came home <br/>\n&gt; today, so that was a good sign of at least her recovery from the <br/>\n&gt; surgery and trauma of the situation. <br/>\n&gt;<br/>\n&gt; Janene is very upset, this has been very difficult for her.  Janene <br/>\n&gt; stayed the last two nights at friend&#39;s houses (thank you Keri and <br/>\n&gt; Lyla!), and is now in bed in front of me (and I&#39;ll be joining her to <br/>\n&gt; cuddle with her in a few moments).   My parents are trying to arrange <br/>\n&gt; to come out, as I don&#39;t have any sick days left (after this week) and <br/>\n&gt; will need to return to work.  I am also looking into respite care for <br/>\n&gt; children, our insurance doesn&#39;t cover that but I am going to see if <br/>\n&gt; there is another organization that will cover that sort of thing.<br/>\n&gt;<br/>\n&gt; Two other friends came out today to meet the delivery truck and while <br/>\n&gt; they waited, they took down 98% of my christmas decorations including <br/>\n&gt; the tree, and finished cleaning up after a very rowdy girl scout New <br/>\n&gt; Year&#39;s Slumber Party we hosted for my girl scout troop.  I came home <br/>\n&gt; and broke down in tears at this gift, it was overwhelming.  Everyone <br/>\n&gt; has been so supportive and I&#39;m so thankful, and I know that I&#39;m going <br/>\n&gt; to need more help in the next month or so... :-/.<br/>\n&gt;<br/>\n&gt; We had dinner delivered (along with Janene, thanks Lyla!) and my <br/>\n&gt; sister brought my dog, so we are all here...<br/>\n&gt;<br/>\n&gt; The surgeon did come out before putting the body cast on and ask me if <br/>\n&gt; I thought Lexie was a child who would be still and 100% compliant with <br/>\n&gt; staying still and off her leg... after a discussion we decided a body <br/>\n&gt; cast was best, it will be a hard few months but ultimately this gives <br/>\n&gt; her the best chance of a full recovery.  We won&#39;t know for 2-3 months <br/>\n&gt; if Lexie won the lottery on this (ie, bone did not die) or if she <br/>\n&gt; didn&#39;t beat the odds.  Keep up the good thoughts, please. <br/>\n&gt;<br/>\n&gt; Well, Lexie is ready for more meds, and then sleep...<br/>\n&gt;<br/>\n&gt; Thank you everyone for your support.  Good night<br/>\n&gt;<br/>\n&gt; Joylyn<br/>\n&gt;<br/>\n&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":198239998,"authorName":"MomtoLJ","from":"MomtoLJ &lt;joylyn1@...&gt;","profile":"joylynrsf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Update on Lexie","postDate":"1105000432","msgId":102383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxRENGN0YwLjIwNjAyMDhAY2hhcnRlci5uZXQ+","inReplyToHeader":"PGNyZGR2NitjbGI0QGVHcm91cHMuY29tPg==","referencesHeader":"PGNyZGR2NitjbGI0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":102433,"prevInTime":102382,"nextInTime":102384,"topicId":102383,"numMessagesInTopic":0,"msgSnippet":"Hi everyone I just wanted to send an update on Lexie. If you forwarded the other notes regarding Lexie, please please forward this one as well, I have a large","messageBody":"<div id=\"ygrps-yiv-1695103661\">Hi everyone<br/>\n<br/>\nI just wanted to send an update on Lexie. If you forwarded the other <br/>\nnotes regarding Lexie, please please forward this one as well, I have a <br/>\nlarge number of private notes from people and I will attempt to answer <br/>\nthem tomorrow... I&#39;m sorry if this note is somewhat repetitive...<br/>\n<br/>\n We are home.  Lexie is wide awake in the living room on her very own <br/>\n(ok, for a while) hospital bed watching TV, as she took a good nap this <br/>\nafternoon.  She has a trapeze thingie to pull herself up, and we have a <br/>\nslid board and a wheel chair, but I doubt if the wheel chair will work, <br/>\nas it is too narrow.  Her cast is such that he knees are pointing <br/>\noutward slightly and bent, so she doesn&#39;t fit in a car set...we took an <br/>\nambulance home!  Lexie was thrilled, and her pain meds kept the old <br/>\nbouncing vehicle from hurting too much.  She already has lots of <br/>\nsignatures on her cast, but it&#39;s pretty big and there is still room for <br/>\nmore... I need to sign before all the good space is taken.<br/>\n<br/>\nI&#39;m not sure what was said, so I&#39;ll repeat this too. Lexie fell rather <br/>\nhard on tile and broke her femur at the neck.  This is, sadly, a very <br/>\nbad break, and her break in particular was one of the worst the <br/>\npediatric trauma orthopedic surgeon (specializing in fractures) had ever <br/>\nseen.  We did get her into surgery within the 6 hour time frame crucial <br/>\nto help ensure healing, but because of the position of the break and the <br/>\nseverity of it, there is a 60% chance of the femur head dying which <br/>\nwould lead to long term issues, likely more surgery, arthritis, growth <br/>\nproblems, etc. (Lexie is unaware of these issues). As it is we are <br/>\nlooking at long term recovery, with about 4-6 weeks immobility in a body <br/>\ncast, and long term PT.  The surgeon put in 3 pins and is hopeful that <br/>\nLexie will recover.  He was very impressed with her spirit and <br/>\nintelligence and her assertiveness with the care providers at the <br/>\nhospital, and we all commented on how her positive spirit and attitude <br/>\nwill help with her healing.  She had been expected to stay in the <br/>\nhospital until Thursday or Friday, but we came home today, so that was a <br/>\ngood sign of at least her recovery from the surgery and trauma of the <br/>\nsituation. <br/>\n<br/>\nJanene is very upset, this has been very difficult for her.  Janene <br/>\nstayed the last two nights at friend&#39;s houses (thank you Keri and <br/>\nLyla!), and is now in bed in front of me (and I&#39;ll be joining her to <br/>\ncuddle with her in a few moments).   My parents are trying to arrange to <br/>\ncome out, as I don&#39;t have any sick days left (after this week) and will <br/>\nneed to return to work.  I am also looking into respite care for <br/>\nchildren, our insurance doesn&#39;t cover that but I am going to see if <br/>\nthere is another organization that will cover that sort of thing.<br/>\n<br/>\nTwo other friends came out today to meet the delivery truck and while <br/>\nthey waited, they took down 98% of my christmas decorations including <br/>\nthe tree, and finished cleaning up after a very rowdy girl scout New <br/>\nYear&#39;s Slumber Party we hosted for my girl scout troop.  I came home and <br/>\nbroke down in tears at this gift, it was overwhelming.  Everyone has <br/>\nbeen so supportive and I&#39;m so thankful, and I know that I&#39;m going to <br/>\nneed more help in the next month or so... :-/.<br/>\n<br/>\nWe had dinner delivered (along with Janene, thanks Lyla!) and my sister <br/>\nbrought my dog, so we are all here...<br/>\n<br/>\nThe surgeon did come out before putting the body cast on and ask me if I <br/>\nthought Lexie was a child who would be still and 100% compliant with <br/>\nstaying still and off her leg... after a discussion we decided a body <br/>\ncast was best, it will be a hard few months but ultimately this gives <br/>\nher the best chance of a full recovery.  We won&#39;t know for 2-3 months if <br/>\nLexie won the lottery on this (ie, bone did not die) or if she didn&#39;t <br/>\nbeat the odds.  Keep up the good thoughts, please. <br/>\n<br/>\nWell, Lexie is ready for more meds, and then sleep...<br/>\n<br/>\nThank you everyone for your support.  Good night<br/>\n<br/>\nJoylyn<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>  ----------<br/>\n<br/>\nNo virus found in this outgoing message.<br/>\nChecked by AVG Anti-Virus.<br/>\nVersion: 7.0.300 / Virus Database: 265.6.8 - Release Date: 1/3/2005<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":104508,"nextTopicId":104154}}