{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":40,"messages":[{"userId":443923164,"authorName":"CASS KOTRBA","from":"&quot;CASS KOTRBA&quot; &lt;caskot@...&gt;","profile":"cass.kotrba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"dealing with family baggage was: untidy bedrooms","postDate":"1375366581","msgId":71847,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTE3My1EUzExQ0I5REU3M0U1QzAyODk2QUMyOEFDNDUwMEBwaHguZ2JsPg==","inReplyToHeader":"PGt0YmlmMStyNXRsQGVHcm91cHMuY29tPg==","referencesHeader":"PGt0YmlmMStyNXRsQGVHcm91cHMuY29tPg=="},"prevInTopic":71846,"nextInTopic":71848,"prevInTime":71846,"nextInTime":71848,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"-=- My parents, brother & his wife are all neat freaks. They are all going to be here in about 2 weeks. I can already feel my stress level starting to rise. I","messageBody":"<div id=\"ygrps-yiv-1265857962\">-=- My parents, brother & his wife are all neat freaks. They are all going to be here in about 2 weeks. I can already feel my stress level starting to rise. I know I will feel obligated to get the house really clean & it makes me feel resentful that I will feel the need to take several days away from what my kids & I want to be doing in order to organize & deep clean. I wish I could say that I am thinking of it as a nice gift that I am giving my extended family but I&#39;m not there yet. I know they all judge me as a &quot;poor housekeeper&quot; and they don&#39;t laugh or joke about it in a way that indicates acceptance, they treat it as the elephant in the room that everybody is trying not to notice. That&#39;s how it feels to me, anyway. For example, last year when they came my mom was talking about somebody (or more like taking her inventory, I guess) and she mentioned that this person was a &quot;grubby housekeeper&quot;. Then she got this very embarrassed look on her face and said &quot;I&#39;m sorry Cass, I didn&#39;t mean anything by that.&quot; I was so ready for them to leave last year and am not feeling ready for another visit. I look forward to it being over. -=-<br/>\n<br/>\nI wrote this and have been thinking about it and your responses.  I have noticed for years that cleaning isn&#39;t just something I don&#39;t enjoy, it makes me angry.  I figured it had something to do with my mother but could not put my finger on it.  It has finally become clear to me.  When I was young my parents rarely played with us, paid attention to us or gave us opportunities to have fun.  We took care of ourselves after school and all summer from the time I was in first grade as my parents both worked full time jobs.  My brother is 3 years older than me.  We were pretty poor and the attitude was &quot;we have to work hard and there is not enough money for fun&quot;.  Maybe there was a fee for laughter back then that I&#39;m not aware of because it was scarce in our house.  The message was &quot;there is no time for fun until all the work and cleaning are done.  PS - it will never be done.&quot;  The fact that she prioritized cleaning the top of the cabinets and behind the fridge over noticing me makes me mad.  I will not make that same choice.  I did inherit the &quot;work hard&quot; disease and I have to consciously stop myself from being tied up in projects all the time and be present and available to my kids.  That is something I&#39;m still striving to improve on.  So when it comes to spending time on cleaning it makes me mad because I&#39;m thinking &quot;this is time I could be playing with those kids&quot;.  This is good progress.  I will continue working on this.<br/>\n<br/>\nSue asked    -=- How about an honest conversation with them?-=-  <br/>\n<br/>\nIf I had an open, unschooling type relationship with my family this would be a great solution but, sadly, that is not the type of relationship we are talking about here.  It&#39;s a &quot;who can be the biggest martyr&quot; family dynamic.  The belief is that it is always better to do/be what someone else wants you to do/be than it is to follow your own desires.  Having needs or feelings that fall into the &quot;unpleasant&quot; zone is shameful and is not to be allowed.  This will require you to stuff your feelings down as far as possible.  The resulting pit of black rage is to be hidden.  If it starts to well up you must &quot;control your emotions&quot; and shove it back down.  Inevitably there will be explosions and these are to be seen as personality flaws.<br/>\n<br/>\nI did try talking to them about the cleaning thing years ago but it was very  embarrassing & uncomfortable and has magnified the &quot;elephant in the room&quot; situation.  This is generally my experience when trying to talk to them about anything that might be bothering me.<br/>\n<br/>\nJoyce said -=-  You could put up signs in your house like these :-)  <a rel=\"nofollow\" target=\"_blank\" href=\"http://goo.gl/94QaJI&lt;http://goo.gl/94QaJI\">http://goo.gl/94QaJI&lt;http://goo.gl/94QaJI</a>&gt;     <a rel=\"nofollow\" target=\"_blank\" href=\"http://goo.gl/TjLfdk&lt;http://goo.gl/TjLfdk\">http://goo.gl/TjLfdk&lt;http://goo.gl/TjLfdk</a>&gt;-=-<br/>\n<br/>\nI love this idea!  I will get something printed out and taped to the fridge before they come.   I will out the elephant and laugh at it, encouraging them to laugh and accept it, too.  So I&#39;m making good headway on the cleaning issue.  Thank you.<br/>\n<br/>\n-=- Can you meet on neutral territory? Can you bow out of hosting next year? -=-<br/>\n<br/>\nI&#39;m still kind of stuck here.  Let me give you a little background.  I will try to be brief but this might get a little wordy.  <br/>\n<br/>\nWhen our kids were born we lived in the Denver Metro area.  My parents, brother & his wife & in laws all lived nearby.  My husband & I felt engulfed in a sea of confusing emotions and both were starting to feel like we were drowning.  It became clear to us that we were not going to be able to get clarity and have the family we wanted if we stayed in that environment.  7 years ago we packed up & moved 1 1/2 hours west, high up into the Colorado Rocky Mountains.  Everyone warned us &quot;you&#39;re not going to like it, you&#39;ll never make it, you&#39;ll be back.&quot;  They were wrong.  We moved to a quaint, quiet mountain resort town & we LOVE living here.  We have all thrived.  We have found ourselves, our path and our joy.  We were still close enough for visits to & from family but nothing too intense.   The relationship with my husband&#39;s family is intensely screwed up (to the point where we actually feel there is danger) and we have gotten to a point where we have an arms length type relationship with them.  We see them briefly, once in awhile and that&#39;s working pretty well.  <br/>\n<br/>\nAfter we moved here I became interested in whole foods which lead to my getting involved with milking goats.  I fell in love with goats & the idea of having a small hobby farm.  1 1/2 years ago we managed to sell our house and buy our dream property.   We found a place near town on 11 acres with a big barn & amazing views.  The house has some issues but that&#39;s something we know how to fix and we&#39;ve been plugging away at it as time allows.  My parents gave us $10,000 to help make this dream a reality which we really appreciated.  Early last spring I started bringing in animals & my husband has helped me build a big garden.  We love it here and I feel like I&#39;m creating our own little piece of paradise.  I have felt parts of me reawaken that I&#39;m not sure were ever awake before.  It&#39;s peaceful and beautiful and we are happy.<br/>\n<br/>\nLast year my parents retired.  They bought a small but cute trailer in Arizona where they have established themselves for the winter.  They decided to sell their house in the Denver area and asked if it would be ok if they bought a small trailer and put it on our property to serve as their home base during the summer.  They promised to help us with things around the homestead & babysit the animals once in awhile so that we can go camping.  That sounded pretty good & we liked the idea that they would be able to maintain a relationship with our kids.  In the late spring of last year they started the process of settling in and it was anything but helpful.  We spent a fair amount of time helping them which was frustrating as we had just moved in ourselves.  It wouldn&#39;t have been so bad except that they also had company 3 times, including my brother for 3 weeks.  There is no room for company in our house but we had our camper popped up so everybody just helped themselves to it.  We are at 8700&#39; altitude  & we live in a ski town so our winter and mud seasons last about 9 months.  We get maybe 3 months of summer and it is a glorious time.  The kids had always gone to school so summer for us lasted exactly 10 weeks, not a day more.  My parents and their guests sucked up most of that time & there was very little time to do the things we wanted.  We felt like we missed the whole summer and I was really mad.  I told my parents that they were welcome to come back but we did not appreciate all the company and explained why.  I told them &quot;if people want to visit you, please let them know that they will have to do it while you are in Arizona.&quot;  They felt bad & nervously agreed but I knew what they were thinking &quot;what will we tell people?&quot;.  They would never say &quot;no&quot; to someone outside the family (they&#39;ve never had a problem saying it to me) so all they really have to say is &quot;Cass doesn&#39;t want us to have company&quot;.  They said &quot;not even your brother&quot;?  I said &quot;fine, he can come but 3 weeks is way too long.  And your twin sister and her family can come, too.  I don&#39;t know how we could say no to them&quot;.<br/>\n<br/>\nMy brother & his wife are both in academia and currently live in Japan.  They have no children.  My brother hated and avoided my parents for years but after he got a little older and was married the 4 of them started doing a lot together.  I am glad for all of them that they have that relationship.  Whenever they are in transition or have a vacation they stay with my parents.  Now my parents are staying here during the summer.  Early this spring the email came: &quot;We would like to spend our summer break in the US.  We had such a wonderful time at Cass&#39; last year that we were hoping to come again.  Here are the dates for the 3 weeks we&#39;d like to come.  Will that be ok?&quot;  I waited 3 days and my parents didn&#39;t say anything.  I didn&#39;t know what else to do so finally I said &quot;sure&quot;.  I wrote to my parents separately and said &quot;if anyone else asks to visit please tell them that we are open to visitors during that 3 week period but we hope to do some camping before and after so we can&#39;t really host anyone else before or after.&quot;  Silence.  A new elephant in the room.  Fortunately no one else asked to visit.  This is a situation that is not going to go away & I really don&#39;t know how to handle it.<br/>\n<br/>\nThings with my folks have been going much better this year.  We respect each other&#39;s space and privacy and I can live with that arrangement, am even enjoying it.  There have been times when my husband will come to me, laughing about something my dad has done & say &quot;I feel like I understand you so much better now.&quot;  That&#39;s pretty cool & I feel like I&#39;m understanding myself better.  <br/>\n<br/>\nThe biggest problem with my brother&#39;s visit last year was that I had not spent an extended period of time with my family since I was in my teens and I was not prepared for how emotionally challenging it would be.  It was like rewinding the clock 20 years but not in a good way.  I remembered how we all have our roles to play.  I&#39;m the light hearted silly one who tries to break the tension.  I remembered how they made me feel small, invisible and unimportant.  There were times last summer where we&#39;d all be sitting at the table and something small would be said (or ignored) that triggered a flood of sadness to come washing through me.  I would escape to the barn where I would let the love to & from my animals wash through me which did help.  I would wrap my arms around my big, fluffy Great Pyrenees, bury my face in her fur and just sob.  One good thing this year is that we&#39;re remodeling our kitchen and there is no table for us all to sit around.  I plan to use this to my advantage & have already promised hubby and kids that we will not all sit for formal meals twice a day like last year.<br/>\n<br/>\n-=-Can you meet on neutral territory? Can you bow out of hosting next year?-=-<br/>\n<br/>\nAt least I feel safe here and I have a support system.  Maybe I will be stronger and more healed this summer and it won&#39;t be so bad.  The experience has definitely given me lots food for thought and insight into my own damaged psyche.  A lot of progress and goodness has come from it.  But my fear is that this is shaping up to be an annual thing and I don&#39;t know that I want to go through this emotional washing machine EVERY summer!  So how would I bow out next year?  And what about the other people who will inevitably want to come and visit?  My parents are really enjoying their time here and who could blame them?  It&#39;s really neat around here, especially in the summer.  They blab about how wonderful it is to the rest of the extended family.  I&#39;m 99% sure my mom&#39;s twin sister and family will want to come next summer.  Great - more opportunity for growth!  My parents do not know how to say &quot;no&quot; so it&#39;s going to fall to me to either find a way to say no or decide to sacrifice what I want in favor of what other&#39;s want.  Or to find a way to be happy with the situation but I&#39;m not seeing a path to that currently.  I&#39;m feeling frustrated and resentful that I have gone to great length and effort to create our own little paradise, which they did not support, and now that it&#39;s turned out really neat everyone wants to come and get a piece of it.  I might not mind the visitors if I felt like I had control over it.  But as it is I feel victimized.  Thoughts, ideas, suggestions?<br/>\n<br/>\nThanks so much,<br/>\nCass<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":552990255,"authorName":"snazzierella","from":"&quot;snazzierella&quot; &lt;snazzierella@...&gt;","profile":"snazzierella","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Untidy bedrooms","postDate":"1375342651","msgId":71846,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0ZDM3citjdXNzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0M2cyYSt0djRuQGVHcm91cHMuY29tPg=="},"prevInTopic":71833,"nextInTopic":71847,"prevInTime":71845,"nextInTime":71847,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"... I remember being 12 with a messy room, moldy food, and my very own family of ants living on my computer desk. I wasn t big on cleaning, and it was often a","messageBody":"<div id=\"ygrps-yiv-42761899\"><blockquote><span title=\"ireply\">&gt;we are getting a bit concerned about the amount of rotten apple cores and orange peels and mouldy cups that my daughter especially, leaves in her room for weeks.  Her room is starting to smell. But, our daughter doesn&#39;t like anyone being in her room or tidying it up<br/>\n&gt; When I see her becoming overwhelmed I always offer to help tidy up her room but as she is getting older she doesn&#39;t want me to help.<br/>\n<br/>\n </span></blockquote>I remember being 12 with a messy room, moldy food, and my very own family of ants living on my computer desk. I wasn&#39;t big on cleaning, and it was often a cause for arguments between me and my mom. The mess was very overwhelming, but I wouldn&#39;t let her help me. At that age, I really valued my privacy and didn&#39;t want her poking around in my things. I was sort of worried she&#39;d find something I&#39;d get in trouble for, so I always wanted to do it myself but cleaning my whole room was a process that took at least a week. I was also worried I&#39;d be in trouble over the moldy food. I dropped at bag of blackberries by the side of my bed once, and managed to leave them there for at least 6 months, I remember being pretty worried she&#39;d find them and yell at me over it, but I also wasn&#39;t sure how to clean it up because the blackberry juice left a big stain on the white carpet. What I&#39;m trying to say here, is that kids have their reasons for not wanting to let you help them. Mine were being worried about getting in trouble, and not wanting my mom looking through my stuff. I wouldn&#39;t recommend going into her room while she&#39;s not there either. She&#39;ll notice and it&#39;ll feel like a big invasion of privacy, especially if you didn&#39;t ask her about it first. My mom did that&#39; to me once.<br/>\n<br/>\nThe other thing about cleaning my room that I didn&#39;t like was that when my room was messy, I could still remember where my things were. After I cleaned, I had no idea where most of my stuff was (especially if mom helped). She&#39;s losing stuff anyway, so that&#39;s probably not really her problem, but just something I remember. <br/>\n<br/>\nI&#39;m 19, almost 20 now, and my house isn&#39;t spotless, but it&#39;s not messy either, and there is certainly no moldy food around. I never did really clean my room just because I was told to, but when I moved out I knew I had to clean here because it&#39;s my house and I&#39;m responsible for it. When I lived in a room at my parent&#39;s, I was like &quot;Why should I clean this now and get it all messy again and again when I could just clean it all at once when I move out someday?&quot; And that is exactly what I ended up doing. Kids who don&#39;t like cleaning their rooms won&#39;t necessarily grow up into adults who won&#39;t clean their houses. I liked living in my messy room, because my things were where I liked them and I could find my stuff and I could do what I wanted to without having to stop all the time to clean up. It gave me more time to draw pictures and read Harry Potter and watch TV and collect rocks and write stories and visit my neighbors and ride my bike and play with the dogs and the sheep, and I wouldn&#39;t trade any of those things for a cleaner room back then. The icky food remains weren&#39;t really that bad, so unless it&#39;s becoming a health hazard I wouldn&#39;t worry too much. I also really liked having ants live on my desk, the crawled around and minded their own business and I could sit there and watch them and it was fun. They were very small and didn&#39;t bother anything. They really liked my empty pop cans. <br/>\n<br/>\nI&#39;d say try earning her trust by asking if you can go in and clean up only the moldy things, or ask her if she can go grab them for you. Just the rotten food, don&#39;t expect her to tidy the whole room while she&#39;s at it. If she lets you in, don&#39;t poke around anywhere she doesn&#39;t want you, and don&#39;t try to clean more than you&#39;ve said you wanted to. Don&#39;t make her feel bad about the moldy things either, she might start trying to hide it like I did (remember the blackberries that stayed in my room for 6 months?). Also, if the moldy things start smelling badly enough, she&#39;ll clean them up on her own because she doesn&#39;t like it (or vacate the room?). <br/>\n<br/>\n-Jade</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Untidy bedrooms","postDate":"1375292705","msgId":71833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0YmlmMStyNXRsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg4NEM3Mzg4LThFMTAtNDJCOC1CNjFFLTk4QjJBQUU4MkU5NUB5YWhvby5jb20+"},"prevInTopic":71832,"nextInTopic":71846,"prevInTime":71832,"nextInTime":71834,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"... ************ Even if you had, it might not have the effect you think. As a kid I had to keep my room clean. I also had other household chores - my mom","messageBody":"<div id=\"ygrps-yiv-1799069284\">Amy Lapain &lt;amylapain@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I DO wish I knew HOW to organize better-- i wish i had learned some habits as a kid.  I am not sure I would have LISTENED to anyone teaching me <br/>\n </span></blockquote>************<br/>\n<br/>\nEven if you had, it might not have the effect you think. As a kid I had to keep my room clean. I also had other household chores - my mom wanted me to have all the &quot;necessary&quot; domestic skills by the time I was in high school and I did. So did my brother. We kept the house neat, did the laundry, and cooked. But I did not &quot;learn habits&quot; which carried over into my own life. I learned to dislike and resent housework and regular cooking. I still struggle with that sometimes. The real habits I learned were emotional and negative.<br/>\n<br/>\nHere&#39;s an interesting thing. Ironing used to be one of my chores - and I didn&#39;t even own an iron for years after I moved out of my parents&#39; house. Until I started quilting and discovered the Power of Steam. I started pressing fabric and quilt blocks and started liking it. To the point that now I don&#39;t hesitate to fire up the iron when I&#39;m sewing at home or at my job. The iron is my friend because re-learning to iron was something I did to support a passion of mine.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Untidy bedrooms","postDate":"1375281910","msgId":71832,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBFMkYxRkM3LUEyODMtNDdENS1CMDYzLTAxRkM5QjFDRkEwQUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDg4NEM3Mzg4LThFMTAtNDJCOC1CNjFFLTk4QjJBQUU4MkU5NUB5YWhvby5jb20+","referencesHeader":"PGt0OGw5OCtra3NoQGVHcm91cHMuY29tPiA8ODg0QzczODgtOEUxMC00MkI4LUI2MUUtOThCMkFBRTgyRTk1QHlhaG9vLmNvbT4="},"prevInTopic":71831,"nextInTopic":71833,"prevInTime":71831,"nextInTime":71833,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"... What would learning a habit have involved, though? There are several skills I wish I had, like playing the organ, guitar or speaking another language. My","messageBody":"<div id=\"ygrps-yiv-765164209\">On Jul 30, 2013, at 3:49 PM, Amy Lapain wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  i wish i had learned some habits as a kid.<br/>\n<br/>\n </span></blockquote>What would learning a habit have involved, though?<br/>\n<br/>\nThere are several skills I wish I had, like playing the organ, guitar or speaking another language. My younger self had the opportunities to learn those. But I chose not to keep going because learning them wasn&#39;t as interesting as other things I was doing.<br/>\n<br/>\nContinuing would have meant being pressured to practice and go to lessons. The number of adults who are  happy their parents made them continue with lessons is tiny compared to the number who are resentful, feel like failures, or have an aversion to anything connected with what they were being made to do. And those adults were also robbed of knowing what they could have achieved on their own.<br/>\n<br/>\nIt may not be a fair to place the burden of that wish on your younger self. And it won&#39;t help with unschooling. One of the core ideas of unschooling is: You can learn now, when it&#39;s meaningful to you. :-)<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Untidy bedrooms","postDate":"1375280847","msgId":71831,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzOEVENDkyLUQ0MDYtNDdCQy05MDYyLUQ5RUMxQTI4MUVCNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBQjgxNzhXQWhMVj0wNDk4MDRjWDBrQytOek1Udnl3WVJTYzJwR1VtT2hVdG84eEx3Z0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQjgxNzhXQWhMVj0wNDk4MDRjWDBrQytOek1Udnl3WVJTYzJwR1VtT2hVdG84eEx3Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71830,"nextInTopic":71832,"prevInTime":71830,"nextInTime":71832,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"-=-I feel like my mum has given us the gift of a clean emotional slate when it comes to lots of things she s still triggered by herself.-=- My husband said he","messageBody":"<div id=\"ygrps-yiv-1727156948\">-=-I feel like my mum has given us the gift of<br/>\na clean emotional slate when it comes to lots of things she&#39;s still<br/>\ntriggered by herself.-=-<br/>\n<br/>\nMy husband said he wanted our children to grow up undamaged.<br/>\nThat&#39;s the sort of things he was thinking about.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":283841567,"authorName":"Brynna Rafferty-Brown","from":"Brynna Rafferty-Brown &lt;braff16@...&gt;","profile":"brynraff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Untidy bedrooms","postDate":"1375256376","msgId":71830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQjgxNzhXQWhMVj0wNDk4MDRjWDBrQytOek1Udnl3WVJTYzJwR1VtT2hVdG84eEx3Z0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71822,"nextInTopic":71831,"prevInTime":71829,"nextInTime":71831,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"My grandmother was always (and still is) super tidy. When my mum was younger she was told she had to tidy and clean on a regular basis. As a result, my mum has","messageBody":"<div id=\"ygrps-yiv-231267872\">My grandmother was always (and still is) super tidy. When my mum was<br/>\nyounger she was told she had to tidy and clean on a regular basis. As a<br/>\nresult, my mum has never liked cleaning (and wasn&#39;t a big fan of cooking<br/>\nuntil us kids were all older). She rebelled by keeping things messy. Once<br/>\nshe moved past rebelling, she still didn&#39;t like cleaning... Her gift to<br/>\nherself (now that she can afford it) is to have someone come in to clean<br/>\nthe house once a fortnight. She likes keeping it tidy now, but still avoids<br/>\ncleaning if she can.<br/>\n<br/>\nPart of the way my mum chose to parent differently was to be very adamant<br/>\nabout respecting our rooms as our own space... she might have helped us<br/>\ntidy them when we were younger, I don&#39;t remember. But I do remember my<br/>\nbrother and I having very messy rooms when we were teenagers (and beyond in<br/>\nthe case of my brother!). The idea of her telling us she was going to come<br/>\nin and clean our rooms would have sounded as strange to me as her telling<br/>\nme she was going to put a toothbrush in my mouth to clean my teeth! (i.e.<br/>\nan invasion of my personal space)<br/>\n<br/>\nWe&#39;re now all in our late-20s or early 30s... my sister loves keeping her<br/>\nplace clean and tidy... it&#39;s always spotless! My brother often takes on the<br/>\nrole of being the main cleaner in the share-houses he&#39;s lived in, his room<br/>\ngoes through stages, but he always does a big clean when it starts to<br/>\nbother him. I&#39;ve generally been the messiest of the lot :-) But now that we<br/>\nhave a little one (almost 2 years old) I&#39;ve discovered that I love tidying,<br/>\ncooking and cleaning with her... we wander around the house together...<br/>\nsometimes she helps me, sometimes she plays nearby, other times she loves<br/>\nsitting in a sling watching everything I&#39;m doing. At this stage she seems<br/>\nto have more enthusiasm for cleaning than any of us did as kids!<br/>\n<br/>\nTo me, the most important difference between us and our mum is that none of<br/>\nus have inherited her dislike of cleaning. We all clean differently, but<br/>\neven at my messiest, I never disliked cleaning, it just wasn&#39;t a priority<br/>\n:-) Probably because of my mum&#39;s respect for my space I&#39;ve also never felt<br/>\nguilty about being messy... It does frustrate me sometimes, but then I<br/>\nusually make a point of finding the time to tidy up. By parenting<br/>\ndifferently to her own mother, I feel like my mum has given us the gift of<br/>\na clean emotional slate when it comes to lots of things she&#39;s still<br/>\ntriggered by herself.<br/>\n<br/>\n-- <br/>\nLombok Kids    www.iced.org.au/lombok-kids<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"sandralynndodd","from":"&quot;sandralynndodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Untidy bedrooms","postDate":"1375220258","msgId":71822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0OWJuMit1NDQ4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg4NEM3Mzg4LThFMTAtNDJCOC1CNjFFLTk4QjJBQUU4MkU5NUB5YWhvby5jb20+"},"prevInTopic":71821,"nextInTopic":71830,"prevInTime":71821,"nextInTime":71823,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"-=- But as for kids untidy bedroomsà.  i think asking if they would like some tips from an expert .. or show them this email from someone who has been there","messageBody":"<div id=\"ygrps-yiv-547279458\">-=- But as for kids&#39; untidy bedrooms.  i think asking if they would like some tips from an &#39;expert&#39;.. or show them this email from someone who has been there and still is.  perhaps they would LIKE to build habits at a younger age.  -=-<br/>\n<br/>\nMaybe, and they can figure those things out themselves, if parents pay attention and are willing to offer them containers, chests of drawers, shelves.<br/>\n<br/>\nAnd there is a genetic component.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/genetic\">http://sandradodd.com/chores/genetic</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":209144100,"authorName":"Amy Lapain","from":"Amy Lapain &lt;amylapain@...&gt;","profile":"amylapain","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Untidy bedrooms","postDate":"1375213747","msgId":71821,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4NEM3Mzg4LThFMTAtNDJCOC1CNjFFLTk4QjJBQUU4MkU5NUB5YWhvby5jb20+","inReplyToHeader":"PGt0OGw5OCtra3NoQGVHcm91cHMuY29tPg==","referencesHeader":"PGt0OGw5OCtra3NoQGVHcm91cHMuY29tPg=="},"prevInTopic":71818,"nextInTopic":71822,"prevInTime":71820,"nextInTime":71822,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"I am new to the group and have been meandering this thread because 1) my room was HORRIBLE when I was a kid.  And i am not the neatest pin in the drawer now.","messageBody":"<div id=\"ygrps-yiv-261795492\">I am new to the group and have been meandering this thread because 1) my room was HORRIBLE when I was a kid.  And i am not the neatest pin in the drawer now.  Thankfully husband doesn&#39;t get mad, he just does the tidying part for me.  and 2) I just &#39;tidied&#39; my desk and NOW I CAN&quot;T FIND ANYTHING!!!!!  LOL!!!  My aunt finally told my mom when I was a kid to shut the door.  My folks said they were always amazed that I&#39;d come out looking all put together from a pile of rumpled clothes on the floor.  <br/>\n<br/>\nOn the flip side I had a roommate in college that left open food on the floor.  Not cool.  And I DO wish I knew HOW to organize better-- i wish i had learned some habits as a kid.  I am not sure I would have LISTENED to anyone teaching me� It is the little things I don&#39;t do.  We were cat sitting and I noticed I left a door open to the kitty litter- ONLY because every other door was closed.  As I turn my head to look in the kitchen I have two cupboard doors open.  It is just not a habit.  I am trying to get the kitchen table cleared of our stuff at the end of the day (thus the desk cleaning I did today that apparently did not go well b/c i am loosing things�)  I also DO have a cleaning lady that comes every other week- so thankful and blessed for her.  She does not judge ;)  and I have to &#39;pick up&#39; so she can clean.    <br/>\n<br/>\nBut as for kids&#39; untidy bedrooms�.  i think asking if they would like some tips from an &#39;expert&#39;.. or show them this email from someone who has been there and still is�.  perhaps they would LIKE to build habits at a younger age.  <br/>\n<br/>\nAmy<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Untidy bedrooms","postDate":"1375206885","msgId":71818,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENFOTY1N0NFLTk0NjAtNEM3RC1BNUFCLTlCNUFFRDJBMTNGMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGt0OGw5OCtra3NoQGVHcm91cHMuY29tPg==","referencesHeader":"PGt0OGw5OCtra3NoQGVHcm91cHMuY29tPg=="},"prevInTopic":71815,"nextInTopic":71821,"prevInTime":71817,"nextInTime":71819,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"This is very important.  Thank you, Laurie: I am not sure, but I wonder whether you are sincerely worried whether she will really be able to care about herself","messageBody":"<div id=\"ygrps-yiv-252266123\">This is very important.  Thank you, Laurie:<br/>\n<br/>\n<br/>\nI am not sure, but I wonder whether you are sincerely worried whether she will really be able to care about herself at some future time, or whether you are using that as justification to try to get her to &quot;take on some responsibility&quot; by keeping her room more tidy now. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Untidy bedrooms","postDate":"1375206190","msgId":71815,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0OHR2ZSs1ajZwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJMVTE3My1EUzEzMTMzRTM4RTBCQTg4RTc0NjMzMTJDNDU1MEBwaHguZ2JsPg=="},"prevInTopic":71813,"nextInTopic":71818,"prevInTime":71814,"nextInTime":71816,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"... *************** The trouble with thinking in terms of teaching, though, is that learning doesn t depend on teaching - it depends on individual","messageBody":"<div id=\"ygrps-yiv-1055125706\">&quot;CASS KOTRBA&quot; &lt;caskot@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Those ants were disgusting & made us miserable.  It is a memory that lingers in my subconscious & is silently triggered when I see dirty dishes lying about.  Actions have there own natural consequences and these lessons are learned instantly & permanently.  No amount of nagging can ever teach a lesson the way natural consequences can.<br/>\n </span></blockquote>***************<br/>\n<br/>\nThe trouble with thinking in terms of teaching, though, is that learning doesn&#39;t depend on teaching - it depends on individual perspectives, and those can vary a lot. You might have learned from that experience, for instance, that parents get to be mean to their kids. Or that you loved ants and wanted to be an entomologist ;) Or that when you were and adult, you&#39;d pay someone else to clean. Or you&#39;d hire a good exterminator and have the house sprayed every week. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Untidy bedrooms","postDate":"1375197288","msgId":71813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0OGw5OCtra3NoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0M2cyYSt0djRuQGVHcm91cHMuY29tPg=="},"prevInTopic":71812,"nextInTopic":71815,"prevInTime":71812,"nextInTime":71814,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":" Untidy to one person may not be untidy to another, and untidy itself isn t","messageBody":"<div id=\"ygrps-yiv-745394020\">&lt; Both our 12 yr old daughter and our 5yr old son have untidy bedrooms. &gt;<br/>\n<br/>\nUntidy to one person may not be untidy to another, and untidy itself isn&#39;t necessarily a bad thing. My 15 yr old daughter&#39;s room might seem messy to me or my husband.  However, my daughter has said that she can find what she is looking for more easily if I leave things where she left them and not clean up.  She is satisfied with how her room is kept.  Bedroom doors can usually be closed if the sight it too much for your eyes (I know of a person who did not have a bedroom door...hence the word usually).  <br/>\n<br/>\nMy son prefers a neat room with less stuff in it.  He sleeps in the family bedroom still, so it only has a little furniture and some legos and toys around the perimeter.  He shares this space with his younger brother and usually prefers it if I tidy his room.<br/>\n<br/>\nTo help keep pests out of the sleeping areas (as ants can be a problem in the warmer months and mice can be a problem in the cooler months), my husband and I have asked that food be eaten downstairs.  There have been times when one of us has eaten upstairs, but it has been more on the rare side.  <br/>\n<br/>\nMy daughter does often bring tea or seltzer bottles and cups to her room (she sleeps in her own bedroom).  They may sit around for a long while.  Eventually one of us brings them back to the kitchen or to the recycle pile.   <br/>\n<br/>\n&lt; ....we are getting a bit concerned about the amount of rotten apple cores and orange peels and mouldy cups... (snip) Her room is starting to smell. &gt;<br/>\n<br/>\nCan one or both of you be proactive and find the food before it sits around, rots, and smells? Maybe look around the room a couple times a day once or twice a day for any food that you can take out before it gets a chance to sit and rot or get things sticky or smelly?<br/>\n<br/>\nIt might seem easy to pick up after younger kids because people generally don&#39;t have as many expectations about them being &quot;responsible&quot; yet.  But when kids get a bit older, a parent might feel pressure to &quot;make&quot; kids do chores or tidy up, etc.  This might come partly from convenience, how one was raised, cultural expectations, fear of the future, feeling overwhelmed, etc.  But responsibility comes more from having the opportunity to respond to what we think is important, not necessarily by doing what is important to another person.  <br/>\n<br/>\n&lt;...our daughter doesn&#39;t like anyone being in her room or tidying it up and yet, she gets so angry because she loses things all the time. &gt;<br/>\n<br/>\nI lose my keys or my cell phone if I don&#39;t hang them up or put them in certain usual places.  Maybe there is something you can think of that you can help her do to keep track of certain things she commonly loses?  Maybe suggest that she keep her hairbrush on her dresser or in a drawer?  Try to be okay with it if she doesn&#39;t like your suggestion.  And if she doesn&#39;t want to hear any, kindly stop suggesting.   <br/>\n<br/>\n&lt;She loses her hair brush everyday and then shouts at everyone in the house saying we must have put it somewhere, of course no one has.&gt;<br/>\n<br/>\nIt can be frustrating to lose things, especially if it happens a lot.  <br/>\n<br/>\nAnd it can be frustrating to be blamed for losing something when you had nothing to do with it.<br/>\n<br/>\nWhy do you think she feels so angry and yells at others?  <br/>\n<br/>\nWhat do you do when this happens?  Do you offer to help look for the hairbrush and tell her you are sorry it was lost?  Offering to help her find it may help her to know you care.  If she is sharp with you, maybe you can explain to her gently that you have not touched nor seen it, and it is a shame it is lost, and that you will help her try to find it.  <br/>\n<br/>\nLike someone else wrote, maybe buy a few of them if they get lost a lot.    <br/>\n<br/>\nIf you keep one for your very own (the same kind that she uses) and if you always know where it is, you can offer it to her if she can&#39;t find her own.  <br/>\n<br/>\n&lt; When I see her becoming overwhelmed I always offer to help tidy up her room but as she is getting older she doesn&#39;t want me to help. &gt; <br/>\n<br/>\nMaybe she wants to feel independent right now.  Whatever it is, go with it because it matters to your daughter.  If it is important to her that you don&#39;t help, then don&#39;t help.  <br/>\n<br/>\n&lt; Does respecting my children&#39;s right to choose mean We have to clean up all the mouldy food, when We can find it, or have to leave it to fester because I&#39;ll not allowed in the room?&gt;<br/>\n<br/>\nI don&#39;t feel comfortable letting things get moldy.  If I noticed this happening, I would explain my concerns to my daughter and talk about how we can avoid food laying around so long that it gets moldy.  <br/>\n<br/>\n&quot;Prefers&quot; me to stay out of her room vs &quot;not allowed&quot; in her room made me think differently about how you might be feeling inside. The way you wrote about not being allowed in her room made me wonder if you feel a little unwanted (like moldy food! ;)) or like she is rejecting you.  But if it is your house, you are allowed to be in any room, though you might let her decide who can and can&#39;t come in her room and you might stay out of your daughter&#39;s room if you care that this is important to her. <br/>\n<br/>\nThe wording you used might be something to look at because it might be a window to show how you are feeling and that might be part of why you feel things around this to be more difficult than they might otherwise be.   <br/>\n<br/>\n&lt; At what age do we start telling our children they need to take responsibility for their own things and bedrooms,  5 yrs old is to young but surely by 12?  I&#39;m starting to wonder if we have done our daughter a disservice by not encouraging her to take more resoniblity in the home as she has chosen never to help out, now she doesn&#39;t seem to know how to take care of herself or her things!  I&#39;m really stuck with this one, what if she leaves home not being able to do anything for herself, I met adults like this when I was in university.  They didn&#39;t even know how to boil an egg because their parents did everything for them until they left home.   It was sad to see them struggle. &gt;<br/>\n<br/>\nIt sounds like you are worried and possibly frustrated because you wish her to clean up and be more organized.  But she is not.  She&#39;s only 12.  She has years to develop, think, change and grow before she is off on her own.  And some people care more about being tidy than others even when they are grown.  <br/>\n<br/>\nI am not sure, but I wonder whether you are sincerely worried whether she will really be able to care about herself at some future time, or whether you are using that as justification to try to get her to &quot;take on some responsibility&quot; by keeping her room more tidy now.  <br/>\n<br/>\n<br/>\nLaurie</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Untidy bedrooms","postDate":"1375193363","msgId":71812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdEODcxQzczLTVDMTktNEU0RC05QzgzLUQwOUIyMkM4RjMzMEB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEJMVTQwMy1FQVM1MkRCNUQ5ODhGNzNFMjkxMzI4MzQ3QkQ1NTBAcGh4LmdibD4=","referencesHeader":"PGt0NWsxdis3NzdoQGVHcm91cHMuY29tPiA8QkxVMTczLURTMjFDOUM5RTE0NUE2OEEwQTYyQzgzRUM0NTUwQHBoeC5nYmw+IDxCTFU0MDMtRUFTNTJEQjVEOTg4RjczRTI5MTMyODM0N0JENTUwQHBoeC5nYmw+"},"prevInTopic":71800,"nextInTopic":71813,"prevInTime":71811,"nextInTime":71813,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"... I ve always used visits as motivation to clean. But I think that works because wanted to clean, not because anyone would shame me. So it probably feels","messageBody":"<div id=\"ygrps-yiv-1724178980\">On Jul 29, 2013, at 1:28 PM, Sue K wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I know I will feel obligated to get the house really clean<br/>\n<br/>\n </span></blockquote>I&#39;ve always used visits as motivation to clean. But I think that works because wanted to clean, not because anyone would shame me. So it probably feels like they&#39;re making you. Choice is huge.<br/>\n<br/>\nCan you meet on neutral territory? Can you bow out of hosting next year? <br/>\n<br/>\nYou could put up signs in your house like these :-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://goo.gl/94QaJI\">http://goo.gl/94QaJI</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://goo.gl/TjLfdk\">http://goo.gl/TjLfdk</a><br/>\n<br/>\nI&#39;ve seen one that I can&#39;t find with Google that said something like:<br/>\n<br/>\nIf you&#39;ve come to visit me, come on in!<br/>\nIf you&#39;ve come to visit my house, make an appointment.<br/>\n<br/>\n;-)<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Untidy bedrooms","postDate":"1375129836","msgId":71791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBFMzBERkYzLTEyNEUtNDNCMi05MDQwLTJCOEUwQ0NFMzU1QkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGt0NDBnMSsyaXRyQGVHcm91cHMuY29tPg==","referencesHeader":"PGt0NDBnMSsyaXRyQGVHcm91cHMuY29tPg=="},"prevInTopic":71790,"nextInTopic":71797,"prevInTime":71790,"nextInTime":71792,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"... If you weren t taking care of your car to the standards your husband thought were appropriate, would that sound like a good assumption and tack for him to","messageBody":"<div id=\"ygrps-yiv-1360274572\">On Jul 28, 2013, at 4:55 PM, HA wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My guess is that her confidence is shot when it comes to cleaning.<br/>\n&gt; I would go in and ask for her help in doing something.<br/>\n<br/>\n </span></blockquote>If you weren&#39;t taking care of your car to the standards your husband thought were appropriate, would that sound like a good assumption and tack for him to take in order to fix what was wrong with you?<br/>\n<br/>\nWhat if he did it for you because he didn&#39;t mind but knew it wasn&#39;t your thing? Wouldn&#39;t that feel like a gift of love? What if he invited you to keep him company while he worked? What if he asked you to do simple things, never pressuring you, never criticizing you. What if he recognized and appreciated that you *could* be doing something else that you loved, but that you chose to spend time with him? What if you knew that he wasn&#39;t expecting you to do the work yourself one day? That there was no ulterior motive to him asking you to join him?<br/>\n<br/>\nWith kids its generally safe to assume that even if they appreciate a tidy room that right now that developmentally the effort it takes is more than the end result is worth. When my daughter was young, I would ask her to do what I thought was a simple task like matching socks. But her brain just saw it as a big overwhelming tangle. When she hit puberty, there was brain growth and suddenly many tasks that were overwhelming for her became easy.<br/>\n<br/>\nWhat works better in the long run is to do it for them, sweetly and happily because you want to give them that gift. If you do it resentfully, they&#39;ll flee and wrap negative emotions around cleaning (and you).<br/>\n<br/>\nDo it with their permission. It&#39;s their space. There may be an order to it that you can&#39;t see.<br/>\n<br/>\nInvite them to help. Invite them to be the supervisor :-) Listen! If they object to something, listen. They&#39;re telling you something that&#39;s important.          <br/>\n<br/>\nKids -- people -- *do* want to be more competent in the world. But it will happen in their own time. In the mean time you can make the atmosphere peaceful and inviting.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":443923164,"authorName":"CASS KOTRBA","from":"&quot;CASS KOTRBA&quot; &lt;caskot@...&gt;","profile":"cass.kotrba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Untidy bedrooms","postDate":"1375121251","msgId":71800,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTE3My1EUzEzMTMzRTM4RTBCQTg4RTc0NjMzMTJDNDU1MEBwaHguZ2JsPg==","inReplyToHeader":"PGt0NWsxdis3NzdoQGVHcm91cHMuY29tPiA8QkxVMTczLURTMjFDOUM5RTE0NUE2OEEwQTYyQzgzRUM0NTUwQHBoeC5nYmw+","referencesHeader":"PGt0NWsxdis3NzdoQGVHcm91cHMuY29tPiA8QkxVMTczLURTMjFDOUM5RTE0NUE2OEEwQTYyQzgzRUM0NTUwQHBoeC5nYmw+"},"prevInTopic":71799,"nextInTopic":71812,"prevInTime":71799,"nextInTime":71801,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"-=-I know what ants are & nobody has to remind me that I don t want them in my home. I have no negative emotions around picking up that kind of stuff.-=- I was","messageBody":"<div id=\"ygrps-yiv-1844679364\">-=-I know what ants are & nobody has to remind me that I don&#39;t want them in my home. I have no negative emotions around picking up that kind of stuff.-=-<br/>\n<br/>\nI was thinking about this statement that I made.  I realized that when I see dirty dishes lying around I have a quick flashback in my mind that I&#39;m not even consciously aware of.  In this flashback I&#39;m about 12 years old and sitting in my childhood basement on a very 1980&#39;s looking couch.  I can see the pattern of the couch and feel the scratchiness of the fabric.  My brother is there.  It is summer.  We are watching TV and eating.  There are dirty dishes all around that have been accumulating over the summer.  And ants... everywhere.  My mother had warned us this would happen but we didn&#39;t listen.  Those ants were disgusting & made us miserable.  It is a memory that lingers in my subconscious & is silently triggered when I see dirty dishes lying about.  Actions have there own natural consequences and these lessons are learned instantly & permanently.  No amount of nagging can ever teach a lesson the way natural consequences can.  Nagging just makes one tune out the nagger.<br/>\n-Cass<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Untidy bedrooms","postDate":"1375120495","msgId":71790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0NmE5ZitsaXAxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBQllld3Y4dW5YRk55aVBNZ3JYYzBqb281NT1yVmdYUEVYdVVlSm9TaFN1U1JCYldRd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71789,"nextInTopic":71791,"prevInTime":71789,"nextInTime":71791,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"... When my daughter was little she loved to use scissors. We had at least six pairs, maybe more. Now and then I still find an old pair. If I hunted and","messageBody":"<div id=\"ygrps-yiv-1935189270\">Three Mommies &lt;3mommies@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Why not just buy her a few hairbrushes? Maybe she could have one in her<br/>\n&gt; room, one in the bathroom, and one somewhere else as a spare?<br/>\n<br/>\n </span></blockquote>When my daughter was little she loved to use scissors. We had at least six pairs, maybe more. Now and then I still find an old pair. If I hunted and couldn&#39;t find one, I&#39;d go out and buy another. <br/>\n<br/>\nI&#39;m not the best housekeeper in the world and my daughter actually likes things to be messy. She doesn&#39;t like me to clean up her things. Now and then I&#39;ll talk her into letting me do it if we seem to be running out of something... socks, comic books, red 2x2 legos, money, but she&#39;s not thrilled and will reclutter things quickly. Most of the time, looking for things is part of how Mo thinks - it&#39;s part of her creative process - so she doesn&#39;t Want &quot;a place for everything and everything in it&#39;s place&quot;. She wants a treasure hunt. But at times she also wants something in particular - like those scissors - and then it helps to have more options on hand then cleaning up. It has been more helpful in the long run to find ways to work with her preference rather than wish she&#39;d change it. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":357839907,"authorName":"Sue K","from":"Sue K &lt;peacefortheplanet@...&gt;","profile":"bringpeacetotheplanet","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Untidy bedrooms","postDate":"1375118887","msgId":71799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTQwMy1FQVM1MkRCNUQ5ODhGNzNFMjkxMzI4MzQ3QkQ1NTBAcGh4LmdibD4=","inReplyToHeader":"PEJMVTE3My1EUzIxQzlDOUUxNDVBNjhBMEE2MkM4M0VDNDU1MEBwaHguZ2JsPg==","referencesHeader":"PGt0NWsxdis3NzdoQGVHcm91cHMuY29tPiA8QkxVMTczLURTMjFDOUM5RTE0NUE2OEEwQTYyQzgzRUM0NTUwQHBoeC5nYmw+"},"prevInTopic":71798,"nextInTopic":71800,"prevInTime":71798,"nextInTime":71800,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"How about an honest conversation with them? That you feel uncomfortable and anxious about their visit because you feel their judgement about the way you keep","messageBody":"<div id=\"ygrps-yiv-803714695\">How about an honest conversation with them? That you feel uncomfortable and anxious about their visit because you feel their judgement about the way you keep your house. I would consider suggesting that they don&#39;t come for a visit and that you visit their house instead. If they are unable to accept you for the way you are, and are going to sit in judgement over your &quot;stuff&quot; then it seems that they are the ones with the issue and need to get over it and genuinely enjoy your company and if they cannot relax in your environment, then you go to theirs.\r<br/>\n\r<br/>\nSent from my iPhone\r<br/>\n\r<br/>\n<blockquote><span title=\"qreply\"> On 2013-07-29, at 1:17 PM, &quot;CASS KOTRBA&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:caskot@...\">caskot@...</a>&gt; wrote:\r<br/>\n\r<br/>\n&gt; I am a &quot;poor housekeeper&quot;. There - I said it. It has taken me years to get to the point that I&#39;m okay with that & can say it mostly with a laugh and just a tinge of shame. No one would ever call me lazy and I&#39;ve got about 20 other neat & exciting things on my mind at any given moment that seem more important/rewarding to me than making my house all tidy & spotless. I keep things clean enough to be sanitary & so that we can function - no moldy food or anything like that as I instinctively know that that is not cool. I know what ants are & nobody has to remind me that I don&#39;t want them in my home. I have no negative emotions around picking up that kind of stuff. But if you walked into my house you would no doubt judge me. I used to try to live up to other people&#39;s expectations of me but found that it made me feel really resentful & angry. It was not good for my relationships with my husband and kids. To have &quot;a place for everything and everything in it&#39;s place&quot; is a confining, claustrophobic feeling to me so I no longer aspire to that goal. I have finally discovered that I LIKE to have a certain amount of mess and disorder. I guess it&#39;s my way of marking my territory or rebelling against the feeling of being forced into a dull, old box. \r<br/>\n&gt; \r<br/>\n&gt; My parents, brother & his wife are all neat freaks. They are all going to be here in about 2 weeks. I can already feel my stress level starting to rise. I know I will feel obligated to get the house really clean & it makes me feel resentful that I will feel the need to take several days away from what my kids & I want to be doing in order to organize & deep clean. I wish I could say that I am thinking of it as a nice gift that I am giving my extended family but I&#39;m not there yet. I know they all judge me as a &quot;poor housekeeper&quot; and they don&#39;t laugh or joke about it in a way that indicates acceptance, they treat it as the elephant in the room that everybody is trying not to notice. That&#39;s how it feels to me, anyway. For example, last year when they came my mom was talking about somebody (or more like taking her inventory, I guess) and she mentioned that this person was a &quot;grubby housekeeper&quot;. Then she got this very embarrassed look on her face and said &quot;I&#39;m sorry Cass, I didn&#39;t mean anything by that.&quot; I was so ready for them to leave last year and am not feeling ready for another visit. I look forward to it being over. Is that how you want your daughters to feel? Secretly feeling shamed that they do not measure up to your expectations and wishing you would leave.\r<br/>\n&gt; \r<br/>\n&gt; -Cass\r<br/>\n&gt; \r<br/>\n&gt; _\r<br/>\n&gt; \r<br/>\n&gt; [Non-text portions of this message have been removed]\r<br/>\n&gt; \r<br/>\n&gt; \r<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":443923164,"authorName":"CASS KOTRBA","from":"&quot;CASS KOTRBA&quot; &lt;caskot@...&gt;","profile":"cass.kotrba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Untidy bedrooms","postDate":"1375117852","msgId":71789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTE3My1EUzIxQzlDOUUxNDVBNjhBMEE2MkM4M0VDNDU1MEBwaHguZ2JsPg==","inReplyToHeader":"PGt0NWsxdis3NzdoQGVHcm91cHMuY29tPg==","referencesHeader":"PGt0NWsxdis3NzdoQGVHcm91cHMuY29tPg=="},"prevInTopic":71788,"nextInTopic":71790,"prevInTime":71788,"nextInTime":71790,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"I am a poor housekeeper .  There - I said it.  It has taken me years to get to the point that I m okay with that & can say it mostly with a laugh and just a","messageBody":"<div id=\"ygrps-yiv-202413780\">I am a &quot;poor housekeeper&quot;.  There - I said it.  It has taken me years to get to the point that I&#39;m okay with that & can say it mostly with a laugh and just a tinge of shame.  No one would ever call me lazy and I&#39;ve got about 20 other neat & exciting things on my mind at any given moment that seem more important/rewarding to me than making my house all tidy & spotless.  I keep things clean enough to be sanitary & so that we can function - no moldy food or anything like that as I instinctively know that that is not cool.  I know what ants are & nobody has to remind me that I don&#39;t want them in my home.  I have no negative emotions around picking up that kind of stuff.  But if you walked into my house you would no doubt judge me.  I used to try to live up to other people&#39;s expectations of me but found that it made me feel really resentful & angry.  It was not good for my relationships with my husband and kids. To have &quot;a place for everything and everything in it&#39;s place&quot; is a confining, claustrophobic feeling to me so I no longer aspire to that goal.  I have finally discovered that I LIKE to have a certain amount of mess and disorder.  I guess it&#39;s my way of marking my territory or rebelling against the feeling of being forced into a dull, old box. <br/>\n<br/>\nMy parents, brother & his wife are all neat freaks.  They are all going to be here in about 2 weeks.  I can already feel my stress level starting to rise.  I know I will feel obligated to get the house really clean & it makes me feel resentful that I will feel the need to take several days away from what my kids & I want to be doing in order to organize & deep clean.  I wish I could say that I am thinking of it as a nice gift that I am giving my extended family but I&#39;m not there yet.  I know they all judge me as a &quot;poor housekeeper&quot; and they don&#39;t laugh or joke about it in a way that indicates acceptance, they treat it as the elephant in the room that everybody is trying not to notice.  That&#39;s how it feels to me, anyway.  For example, last year when they came my mom was talking about somebody (or more like taking her inventory, I guess) and she mentioned that this person was a &quot;grubby housekeeper&quot;.  Then she got this very embarrassed look on her face and said &quot;I&#39;m sorry Cass, I didn&#39;t mean anything by that.&quot;  I was so ready for them to leave last year and am not feeling ready for another visit.  I look forward to it being over.  Is that how you want your daughters to feel?  Secretly feeling shamed that they do not measure up to your expectations and wishing you would leave.<br/>\n<br/>\n-Cass<br/>\n<br/>\n<br/>\n   <br/>\n  _<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":50712129,"authorName":"JenniferW","from":"&quot;JenniferW&quot; &lt;jennweed1@...&gt;","profile":"jennweed11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Untidy bedrooms","postDate":"1375109712","msgId":71798,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0NXZvZytvZ21yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBQllld3Y4dW5YRk55aVBNZ3JYYzBqb281NT1yVmdYUEVYdVVlSm9TaFN1U1JCYldRd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71797,"nextInTopic":71799,"prevInTime":71797,"nextInTime":71799,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"... With 3 girls with long hair in our house, hairbrushes always seem in short supply.  The dollar store has some decent ones so I bought several, and now","messageBody":"<div id=\"ygrps-yiv-1621576708\"><blockquote><span title=\"ireply\">&gt; Why not just buy her a few hairbrushes? Maybe she could have one in her<br/>\n&gt; room, one in the bathroom, and one somewhere else as a spare?<br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>With 3 girls with long hair in our house, hairbrushes always seem in short supply.  The dollar store has some decent ones so I bought several, and now there&#39;s an abundance.  There&#39;s 1 for the bathroom, the kitchen junk drawer (that&#39;s often where we are when we realize we need one before we head out), each of their rooms, purses... Sometimes they get left in the cars and I frequently just leave them there, because that&#39;s ANOTHER place we often are when we remember we need one.  :)  It&#39;s nice to not have to go far to track one down, especially if we&#39;re trying to get somewhere on time.  And now that you mention it, my 10 year old likes my mini purse brush best and will take it out to use, but frequently not put it back.  I think I&#39;ll get a couple more of those for her.<br/>\n<br/>\nJenn</div>","specialLinks":[]},{"userId":374014398,"authorName":"Melissa Yatzeck","from":"&quot;Melissa Yatzeck&quot; &lt;myatzeck@...&gt;","profile":"melissamariemichael","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Untidy bedrooms","postDate":"1375099099","msgId":71786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0NWxjcitqY2M0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0M2cyYSt0djRuQGVHcm91cHMuY29tPg=="},"prevInTopic":71785,"nextInTopic":71788,"prevInTime":71785,"nextInTime":71787,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"... Do they have a trash bin in their rooms?  It would be easier for them to have a place to put trash in their rooms than to have to walk to another room to","messageBody":"<div id=\"ygrps-yiv-1117708186\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;luminaraking&quot; &lt;luminara.king@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Both our 12 yr old daughter and our 5yr old son have untidy bedrooms. We don&#39;t insist on them tidying up but, I have to say we are getting a bit concerned about the amount of rotten apple cores and orange peels and mouldy cups that my daughter especially, leaves in her room for weeks.  Her room is starting to smell. <br/>\n<br/>\n </span></blockquote>Do they have a trash bin in their rooms?  It would be easier for them to have a place to put trash in their rooms than to have to walk to another room to find a trash bin.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote>She loses her hair brush everyday and then shouts at everyone in the house saying we must have put it somewhere, of course no one has.  <br/>\n<br/>\n<br/>\nI had this problem with my lip balm.  So I bought four of them and spread them about the house in places where I&#39;d like to find them.  Why not visit a dollar store and let your daughter pick out several hair brushes?  It is good to have a feeling of abundance, and frustrating to not be able to find something.  It would be a small investment in the peace and joy of your household.  <br/>\n<br/>\nMelissa Yatzeck</div>","specialLinks":[]},{"userId":415285291,"authorName":"jonathan.ford61","from":"&quot;jonathan.ford61&quot; &lt;jonathan.ford61@...&gt;","profile":"jonathan.ford61","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Untidy bedrooms","postDate":"1375097727","msgId":71788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0NWsxdis3NzdoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFFQzk2RkY0LURFRDktNDk5OS04NkVCLTg2QkExQUVFNUIxNEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71786,"nextInTopic":71789,"prevInTime":71787,"nextInTime":71789,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"For some perspective, I m now 52 years old and my mother used to harp on me about the state of my room when I was a pre-teen and teen.  Rather than help me","messageBody":"<div id=\"ygrps-yiv-1257345982\">For some perspective, I&#39;m now 52 years old and my mother used to harp on me about the state of my room when I was a pre-teen and teen.  Rather than help me clean it up, she used to empty my closet AND drawers And strip my bed, making an even bigger mess in my room, then on a Saturday when I wanted to be out playing in the neighborhood, she&#39;d tell me I couldn&#39;t go anywhere until I cleaned my room.  All the while telling me that I was a slob and nobody would ever want to come visit me when I was an adult with a disgusting messy house.<br/>\n<br/>\nYet miraculously, once I got my first apartment and beyond, everything is neat and clean and orderly and certainly not because she *taught* me to clean my room.<br/>\n<br/>\nShe came to visit recently and was commenting on the state of my almost 15-year-old son&#39;s room, which is messy.  For reasons I don&#39;t understand, he prefers to have his mattress and box spring on the floor (perfectly good bed he stuck in the attic).  His drawers are full of childhood toys so he keeps his clothes in laundry baskets.  And yes there are wrappers and dishes etc in there.  I do clean the trash out when he is visiting my ex, but he prefers me to leave everything else.  He does bring the dishes and food down now when I&#39;m about to run the dishwasher. <br/>\n<br/>\nWe&#39;ve discussed boxing the toys he no longer uses and putting those in the attic, but he doesn&#39;t want to do that at this time.  Anyway, my mother was telling me how he was going to grow up a slob and have a messy house and no girl would date him or marry him.  I had to remind her that messy rooms can be pretty normal for kids/teens and has no bearing on whether they grow up to have messy/dirty houses.  And I pointed to myself, and my clean house.  :)  She didn&#39;t mention it again for the duration of her visit.  When the kids were younger, I would clean their rooms for them, or help them if they wanted me to.  Otherwise it was no big deal.  If it bothered me, I close the door.<br/>\n<br/>\n<br/>\nJon<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; -=-When I see her becoming overwhelmed I always offer to help tidy up her room but<br/>\n&gt; as she is getting older she doesn&#39;t want me to help.<br/>\n&gt; Does respecting my children&#39;s right to choose mean We have to clean up all the<br/>\n&gt; mouldy food, when We can find it, or have to leave it to fester because I&#39;ll not<br/>\n&gt; allowed in the room?-=-<br/>\n&gt; <br/>\n&gt; I would tell one of my children, if that situation was happening, that if they didn&#39;t get the food out, I was going to go in and do it.  &quot;If you can&#39;t keep food out of there, don&#39;t take it in.&quot;  <br/>\n&gt; <br/>\n&gt; Or if I saw one come out without the plate or cup, I&#39;d ask them to get it.<br/>\n&gt; <br/>\n&gt; But I have also gone in to empty trashcans and pick up dishes. </span></blockquote></div>","specialLinks":[]},{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Untidy bedrooms","postDate":"1375063292","msgId":71797,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNzUwNjMyOTIuNDk2NjAuWWFob29NYWlsTmVvQHdlYjE2MjEwNi5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PDEzNzUwNjE5MjIuMjg4NTYuWWFob29NYWlsTmVvQHdlYjE2MjEwNi5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PGt0NDVwMytjOWJ2QGVHcm91cHMuY29tPiA8QUVDOTZGRjQtREVEOS00OTk5LTg2RUItODZCQTFBRUU1QjE0QFNhbmRyYWRvZGQuY29tPiA8MTM3NTA2MTkyMi4yODg1Ni5ZYWhvb01haWxOZW9Ad2ViMTYyMTA2Lm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":71791,"nextInTopic":71798,"prevInTime":71796,"nextInTime":71798,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"To clarify, I wasn t meaning to imply the original poster is making her daughter feel judged. I was just speaking from personal experience of well meaning","messageBody":"<div id=\"ygrps-yiv-786225127\">To clarify, I wasn&#39;t meaning to imply the original poster is making her daughter feel judged. I was just speaking from personal experience of well meaning family members trying to goad you into change. I&#39;ve heard &quot;you have trouble with organization&quot; and  &quot;well if you put things back after you used them...&quot; and &quot;you don&#39;t like to change and grow&quot;. It isn&#39;t helpful. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: K Pennell &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mrsringsabre@...\">mrsringsabre@...</a>&gt;<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt; <br/>\nSent: Sunday, July 28, 2013 9:38 PM<br/>\nSubject: Re: [AlwaysLearning] Re: Untidy bedrooms<br/>\n <br/>\n<br/>\nOne discussion I&#39;ve had with my older kids is that bugs are a big issue, especially in the summer months here. I&#39;ve talked about how bugs might be attracted to syrupy plates, crumbs, or fruit. Since they don&#39;t want bugs, that type of stuff tends to make it out of their rooms fairly quickly. If that didn&#39;t work, I might say &quot;let&#39;s go clean the food debris out of your room. It&#39;s starting to smell&quot; and do it together. <br/>\n<br/>\nIn terms of the hairbrush, I often can&#39;t find mine either. I&#39;d encourage my child not to yell at everyone (no one likes to be yelled at), but offer to help her find it. I love help finding things when I&#39;m stressed and in a rush, as long as people don&#39;t make me feel judged for losing it in the first place. If someone makes me feel judged, I don&#39;t want their help at all, because I&#39;m feeling bad enough already. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Sunday, July 28, 2013 7:38 PM<br/>\nSubject: Re: [AlwaysLearning] Re: Untidy bedrooms<br/>\n<br/>\n<br/>\n-=-At what age do we start telling our children they need to take responsibility for their own things and bedrooms, 5 yrs old is to young but surely by 12? I&#39;m starting to wonder if we have done our daughter a disservice by not encouraging her to take more resoniblity in the home as she has chosen never to help out, now she doesn&#39;t seem to know how to take care of herself or her things!-=-<br/>\n<br/>\n-=--=-At what age do we ...-=-<br/>\n<br/>\nDo you mean all unschoolers?<br/>\nHypothetical people?<br/>\nYou and your husband?<br/>\n<br/>\nDon&#39;t do anything you don&#39;t understand.<br/>\nRead here, maybe try a little.<br/>\nOr don&#39;t read there, and don&#39;t try a little.<br/>\n<br/>\nIf traditional parenting works fine for you, then do that.  Do it and don&#39;t even tell us.  It&#39;s none of our business.<br/>\n<br/>\nIf you want to understand radical unschooling, it will take time, and during that time it will help you to read a little, try a little, wait a while, and watch.  <br/>\n<br/>\nWhen you were a teen and knew people who couldn&#39;t boil an egg, there was no youtube. :-)<br/>\nNow if someone wants to figure out how to sort laundry or cook, they can get help in about ten seconds, from eager, friendly strangers.  <br/>\n<br/>\nSo don&#39;t project out into the future.<br/>\n<br/>\n-=-When I see her becoming overwhelmed I always offer to help tidy up her room but<br/>\nas she is getting older she doesn&#39;t want me to help.<br/>\nDoes respecting my children&#39;s right to choose mean We have to clean up all the<br/>\nmouldy food, when We can find it, or have to leave it to fester because I&#39;ll not<br/>\nallowed in the room?-=-<br/>\n<br/>\nI would tell one of my children, if that situation was happening, that if they didn&#39;t get the food out, I was going to go in and do it.  &quot;If you can&#39;t keep food out of there, don&#39;t take it in.&quot;  <br/>\n<br/>\nOr if I saw one come out without the plate or cup, I&#39;d ask them to get it.<br/>\n<br/>\nBut I have also gone in to empty trashcans and pick up dishes.<br/>\n<br/>\nMy kids didn&#39;t go through a change from school or rules to unschooling and making choices, so I don&#39;t know how much of what&#39;s going on at your house might be reaction to change, or how the relationships are.  <br/>\n<br/>\nYou could ask her (IF you can do it nicely, as you would with an adult friend) for ideas for keeping food and dishes up and out. She might have ideas.<br/>\n<br/>\nA plastic dish pan near the door might be a compromise.<br/>\n<br/>\n-=-Does respecting my children&#39;s right to choose mean We have to clean up all the<br/>\nmouldy food, when We can find it-=-<br/>\n<br/>\nAre you capitalizing &quot;we&quot; for emphasis?  Save that for God and Kings.  <br/>\nI don&#39;t think you&#39;re &quot;respecting your child&#39;s right to choose.&quot;  It&#39;s not a good phrase to be using here.  Someone has done you a disservice by introducing that phrase to you.  <br/>\n<br/>\nAnd nothing means you &quot;have to&quot; do anything.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nEach word, each motion, each left or right, can be a decision. <br/>\nYOU make your best decisions. <br/>\n<br/>\nIt sounds like you&#39;re resentful and she&#39;s wrong, and you resent her and you resent us.  <br/>\n<br/>\nBack way up and take another tack.<br/>\n<br/>\nBe her partner, not her adversary.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Untidy bedrooms","postDate":"1375061922","msgId":71785,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNzUwNjE5MjIuMjg4NTYuWWFob29NYWlsTmVvQHdlYjE2MjEwNi5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PEFFQzk2RkY0LURFRDktNDk5OS04NkVCLTg2QkExQUVFNUIxNEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGt0NDVwMytjOWJ2QGVHcm91cHMuY29tPiA8QUVDOTZGRjQtREVEOS00OTk5LTg2RUItODZCQTFBRUU1QjE0QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":71784,"nextInTopic":71786,"prevInTime":71784,"nextInTime":71786,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"One discussion I ve had with my older kids is that bugs are a big issue, especially in the summer months here. I ve talked about how bugs might be attracted to","messageBody":"<div id=\"ygrps-yiv-485617203\">One discussion I&#39;ve had with my older kids is that bugs are a big issue, especially in the summer months here. I&#39;ve talked about how bugs might be attracted to syrupy plates, crumbs, or fruit. Since they don&#39;t want bugs, that type of stuff tends to make it out of their rooms fairly quickly. If that didn&#39;t work, I might say &quot;let&#39;s go clean the food debris out of your room. It&#39;s starting to smell&quot; and do it together. <br/>\n<br/>\nIn terms of the hairbrush, I often can&#39;t find mine either. I&#39;d encourage my child not to yell at everyone (no one likes to be yelled at), but offer to help her find it. I love help finding things when I&#39;m stressed and in a rush, as long as people don&#39;t make me feel judged for losing it in the first place. If someone makes me feel judged, I don&#39;t want their help at all, because I&#39;m feeling bad enough already. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Sunday, July 28, 2013 7:38 PM<br/>\nSubject: Re: [AlwaysLearning] Re: Untidy bedrooms<br/>\n <br/>\n<br/>\n-=-At what age do we start telling our children they need to take responsibility for their own things and bedrooms, 5 yrs old is to young but surely by 12? I&#39;m starting to wonder if we have done our daughter a disservice by not encouraging her to take more resoniblity in the home as she has chosen never to help out, now she doesn&#39;t seem to know how to take care of herself or her things!-=-<br/>\n<br/>\n-=--=-At what age do we ...-=-<br/>\n<br/>\nDo you mean all unschoolers?<br/>\nHypothetical people?<br/>\nYou and your husband?<br/>\n<br/>\nDon&#39;t do anything you don&#39;t understand.<br/>\nRead here, maybe try a little.<br/>\nOr don&#39;t read there, and don&#39;t try a little.<br/>\n<br/>\nIf traditional parenting works fine for you, then do that.  Do it and don&#39;t even tell us.  It&#39;s none of our business.<br/>\n<br/>\nIf you want to understand radical unschooling, it will take time, and during that time it will help you to read a little, try a little, wait a while, and watch.  <br/>\n<br/>\nWhen you were a teen and knew people who couldn&#39;t boil an egg, there was no youtube. :-)<br/>\nNow if someone wants to figure out how to sort laundry or cook, they can get help in about ten seconds, from eager, friendly strangers.  <br/>\n<br/>\nSo don&#39;t project out into the future.<br/>\n<br/>\n-=-When I see her becoming overwhelmed I always offer to help tidy up her room but<br/>\nas she is getting older she doesn&#39;t want me to help.<br/>\nDoes respecting my children&#39;s right to choose mean We have to clean up all the<br/>\nmouldy food, when We can find it, or have to leave it to fester because I&#39;ll not<br/>\nallowed in the room?-=-<br/>\n<br/>\nI would tell one of my children, if that situation was happening, that if they didn&#39;t get the food out, I was going to go in and do it.  &quot;If you can&#39;t keep food out of there, don&#39;t take it in.&quot;  <br/>\n<br/>\nOr if I saw one come out without the plate or cup, I&#39;d ask them to get it.<br/>\n<br/>\nBut I have also gone in to empty trashcans and pick up dishes.<br/>\n<br/>\nMy kids didn&#39;t go through a change from school or rules to unschooling and making choices, so I don&#39;t know how much of what&#39;s going on at your house might be reaction to change, or how the relationships are.  <br/>\n<br/>\nYou could ask her (IF you can do it nicely, as you would with an adult friend) for ideas for keeping food and dishes up and out. She might have ideas.<br/>\n<br/>\nA plastic dish pan near the door might be a compromise.<br/>\n<br/>\n-=-Does respecting my children&#39;s right to choose mean We have to clean up all the<br/>\nmouldy food, when We can find it-=-<br/>\n<br/>\nAre you capitalizing &quot;we&quot; for emphasis?  Save that for God and Kings.  <br/>\nI don&#39;t think you&#39;re &quot;respecting your child&#39;s right to choose.&quot;  It&#39;s not a good phrase to be using here.  Someone has done you a disservice by introducing that phrase to you.  <br/>\n<br/>\nAnd nothing means you &quot;have to&quot; do anything.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nEach word, each motion, each left or right, can be a decision. <br/>\nYOU make your best decisions. <br/>\n<br/>\nIt sounds like you&#39;re resentful and she&#39;s wrong, and you resent her and you resent us.  <br/>\n<br/>\nBack way up and take another tack.<br/>\n<br/>\nBe her partner, not her adversary.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":327581399,"authorName":"Three Mommies","from":"Three Mommies &lt;3mommies@...&gt;","profile":"three.moms","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Untidy bedrooms","postDate":"1375056493","msgId":71784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQllld3Y4dW5YRk55aVBNZ3JYYzBqb281NT1yVmdYUEVYdVVlSm9TaFN1U1JCYldRd0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71783,"nextInTopic":71785,"prevInTime":71783,"nextInTime":71785,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"Hi Luminara :) *Both our 12 yr old daughter and our 5yr old son have untidy bedrooms. * We have 3 boys (13, 10, and 15 months), but only the 13-year-old sleeps","messageBody":"<div id=\"ygrps-yiv-201163652\">Hi Luminara :)<br/>\n<br/>\n*Both our 12 yr old daughter and our 5yr old son have untidy bedrooms.<br/>\n*<br/>\nWe have 3 boys (13, 10, and 15 months), but only the 13-year-old sleeps in<br/>\nhis own room. The 10-year-old just wants/has a space in the living room for<br/>\nhis desk and computer. Neither of them keep their areas tidy.<br/>\n<br/>\n*We don&#39;t insist on them tidying up but, I have to say we are getting a bit<br/>\nconcerned about the amount of rotten apple cores and orange peels and<br/>\nmouldy cups that my daughter especially, leaves in her room for weeks*.<br/>\n<br/>\nOur guys leave food laying around as well. Since I&#39;m the one it bothers, I<br/>\njust pick it up for them. The 13-year-old just started bringing<br/>\nplates/cups/etc out of his room recently. I always jsut assumed that when<br/>\nit became an issue for them, the guys would pick up after themselves.<br/>\n<br/>\n*Her room is starting to smell. If we spot something like this in our 5 yr<br/>\nolds room we remove it ourselves or hand it to him to put in the bin when<br/>\nwe help him get dressed in the mornings.*<br/>\n<br/>\nThat&#39;s cool. He might continue doing that. He might stop helping with it,<br/>\nbut he&#39;s only a little guy ;)<br/>\n*<br/>\nBut, our daughter doesn&#39;t like anyone being in her room or tidying it up<br/>\nand yet, *<br/>\n<br/>\nPersonally, I try not to use the word &quot;yet&quot; about my kids. I find that it<br/>\nsets up this expectation in my mind that someday they &quot;will&quot; and they might<br/>\nor they might not.<br/>\n<br/>\n*she gets so angry because she loses things all the time. *<br/>\n<br/>\nIt&#39;s hard not to be able to find something, especially when you think you<br/>\nknow exactly where you left it.<br/>\n<br/>\n*Recently, she lost the money her grandfather gave her and is now having to<br/>\nlend it from us until it turns up hopefully!*<br/>\n<br/>\nOh bummer! It was great that you were able to spot the cash.<br/>\n*<br/>\nA year ago, when she got some new cupboards I helped her organised her<br/>\nroom, we found a place for everything but she finds it impossible to put<br/>\nthings back in the same place. *<br/>\n<br/>\nMaybe because you helped organise the system isn&#39;t one that works for her.<br/>\nMy guys loved it when I organised their Legos for them, but the<br/>\norganisation never lasted for long because they got so busy enjoying their<br/>\nLegos that they weren&#39;t thinking about putting them away in an organised<br/>\nfashion. When they started asking me to help them ot find certain pieces, I<br/>\nwould help them and then, when they weren&#39;t using the Legos, I would<br/>\norganise them and they guys happily unorganised them again :)<br/>\n<br/>\n*She loses her hair brush everyday and then shouts at everyone in the house<br/>\nsaying we must have put it somewhere, of course no one has. *<br/>\n<br/>\nWhy not just buy her a few hairbrushes? Maybe she could have one in her<br/>\nroom, one in the bathroom, and one somewhere else as a spare?<br/>\n<br/>\n*When I see her becoming overwhelmed I always offer to help tidy up her<br/>\nroom but as she is getting older she doesn&#39;t want me to help*.<br/>\n<br/>\nWe recently cleaned and rearranged our 13-year-old&#39;s room. At first he said<br/>\nhe didn&#39;t want us to help, but when we talked about why, it was because he<br/>\nfelt guilty having us clean it without him helping. We told him it was our<br/>\ngift to him and that it made us happy to create a space he could enjoy and<br/>\nuse. Once he understood that, he sat happily at the computer skying and<br/>\nplaying with his friend while we cleaned around him. He is so happy with<br/>\nthe new look his room has and with the fact that we hung all hte posters he<br/>\nwanted hung up in the room. Maybe asking your daughter why she doesn&#39;t want<br/>\nyour help could be useful.<br/>\n<br/>\n*Does respecting my children&#39;s right to choose mean We have to clean up all<br/>\nthe mouldy food, when We can find it, or have to leave it to fester because<br/>\nI&#39;ll not allowed in the room?*<br/>\n<br/>\nHave you talked to your daughter about not wanting moldy food in the room?<br/>\nMaybe explaining that it&#39;s your issue and that you would personally like to<br/>\nbe able to take the food away would be helpful.<br/>\n<br/>\n*At what age do we start telling our children they need to take<br/>\nresponsibility for their own things and bedrooms, 5 yrs old is to young but<br/>\nsurely by 12? *<br/>\n<br/>\nI don&#39;t tell my guys to clean anything. I don&#39;t think there is a magical<br/>\nage at which children are ready to assume any given chore/responsibility.<br/>\n<br/>\n* I&#39;m starting to wonder if we have done our daughter a disservice by not<br/>\nencouraging her to take more resoniblity in the home as she has chosen<br/>\nnever to help out, now she doesn&#39;t seem to know how to take care of herself<br/>\nor her things!<br/>\n<br/>\n*<br/>\nMaybe she doesn&#39;t have the same criteria for what taking care of things<br/>\nmeans. I came home one day only to find my guys in the yard smashing one of<br/>\ntheir toys and tossing it up into a tree. I got totally squicked. I would<br/>\nnever treat my thing so carelessly. One of my partners went out and talked<br/>\nwith them. They were so happy! They had a whole story about the toy and<br/>\nwhat was happening and why. They laughed and smiled and thought it was<br/>\ngreat fun. I thought about it for a while and decided that I had no<br/>\nbusiness telling how to care for or enjoy their objects. My issue was my<br/>\nissue and I&#39;m glad I let someone else talk with them and didn&#39;t force my<br/>\nissue on them. I can&#39;t say I&#39;m happy about it, but I can say I am happy<br/>\nthat they are happy. If they choose not to take care of things in the way I<br/>\nwould, then that&#39;s what they choose. I can&#39;t promised to replace things if<br/>\nthey get broken, accidentally or purposefully, but I can promise to let<br/>\nthem make their own decisions about their own things.<br/>\n*<br/>\n I&#39;m really stuck with this one, what if she leaves home not being able to<br/>\ndo anything for herself, I met adults like this when I was in university.<br/>\nThey didn&#39;t even know how to boil an egg because their parents did<br/>\neverything for them until they left home. It was sad to see them struggle. *<br/>\n<br/>\nEveryone has met people who can&#39;t boil water or wash a sock. No one can<br/>\npromise you that your kids will be able to do either, but if they can&#39;t,<br/>\nisn&#39;t a good thing that know they can always come to you for help? Someone<br/>\nonce told me &quot;You never find cat bones in a tree.&quot; If your kids need to<br/>\ncook something, wash something, or do any life task, and they want to do<br/>\nit, they will teach themselves how or ask for help.<br/>\n<br/>\nPeace,<br/>\nJean Elizabeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Untidy bedrooms","postDate":"1375054730","msgId":71781,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFQzk2RkY0LURFRDktNDk5OS04NkVCLTg2QkExQUVFNUIxNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGt0NDVwMytjOWJ2QGVHcm91cHMuY29tPg==","referencesHeader":"PGt0NDVwMytjOWJ2QGVHcm91cHMuY29tPg=="},"prevInTopic":71780,"nextInTopic":71783,"prevInTime":71780,"nextInTime":71782,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"-=-At what age do we start telling our children they need to take responsibility for their own things and bedrooms, 5 yrs old is to young but surely by 12? I m","messageBody":"<div id=\"ygrps-yiv-1705949847\">-=-At what age do we start telling our children they need to take responsibility for their own things and bedrooms, 5 yrs old is to young but surely by 12? I&#39;m starting to wonder if we have done our daughter a disservice by not encouraging her to take more resoniblity in the home as she has chosen never to help out, now she doesn&#39;t seem to know how to take care of herself or her things!-=-<br/>\n<br/>\n-=--=-At what age do we ...-=-<br/>\n<br/>\nDo you mean all unschoolers?<br/>\nHypothetical people?<br/>\nYou and your husband?<br/>\n<br/>\nDon&#39;t do anything you don&#39;t understand.<br/>\nRead here, maybe try a little.<br/>\nOr don&#39;t read there, and don&#39;t try a little.<br/>\n<br/>\nIf traditional parenting works fine for you, then do that.  Do it and don&#39;t even tell us.  It&#39;s none of our business.<br/>\n<br/>\nIf you want to understand radical unschooling, it will take time, and during that time it will help you to read a little, try a little, wait a while, and watch.  <br/>\n<br/>\nWhen you were a teen and knew people who couldn&#39;t boil an egg, there was no youtube. :-)<br/>\nNow if someone wants to figure out how to sort laundry or cook, they can get help in about ten seconds, from eager, friendly strangers.  <br/>\n<br/>\nSo don&#39;t project out into the future.<br/>\n<br/>\n-=-When I see her becoming overwhelmed I always offer to help tidy up her room but<br/>\nas she is getting older she doesn&#39;t want me to help.<br/>\nDoes respecting my children&#39;s right to choose mean We have to clean up all the<br/>\nmouldy food, when We can find it, or have to leave it to fester because I&#39;ll not<br/>\nallowed in the room?-=-<br/>\n<br/>\nI would tell one of my children, if that situation was happening, that if they didn&#39;t get the food out, I was going to go in and do it.  &quot;If you can&#39;t keep food out of there, don&#39;t take it in.&quot;  <br/>\n<br/>\nOr if I saw one come out without the plate or cup, I&#39;d ask them to get it.<br/>\n<br/>\nBut I have also gone in to empty trashcans and pick up dishes.<br/>\n<br/>\nMy kids didn&#39;t go through a change from school or rules to unschooling and making choices, so I don&#39;t know how much of what&#39;s going on at your house might be reaction to change, or how the relationships are.  <br/>\n<br/>\nYou could ask her (IF you can do it nicely, as you would with an adult friend) for ideas for keeping food and dishes up and out. She might have ideas.<br/>\n<br/>\nA plastic dish pan near the door might be a compromise.<br/>\n<br/>\n-=-Does respecting my children&#39;s right to choose mean We have to clean up all the<br/>\nmouldy food, when We can find it-=-<br/>\n<br/>\nAre you capitalizing &quot;we&quot; for emphasis?  Save that for God and Kings.  <br/>\nI don&#39;t think you&#39;re &quot;respecting your child&#39;s right to choose.&quot;  It&#39;s not a good phrase to be using here.  Someone has done you a disservice by introducing that phrase to you.   <br/>\n<br/>\nAnd nothing means you &quot;have to&quot; do anything.  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nEach word, each motion, each left or right, can be a decision. <br/>\nYOU make your best decisions. <br/>\n<br/>\nIt sounds like you&#39;re resentful and she&#39;s wrong, and you resent her and you resent us.  <br/>\n<br/>\nBack way up and take another tack.<br/>\n<br/>\nBe her partner, not her adversary.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":284087656,"authorName":"Karen","from":"&quot;Karen&quot; &lt;semajrak@...&gt;","profile":"semajrak","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Untidy bedrooms","postDate":"1375050339","msgId":71780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0NDVwMytjOWJ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0M2cyYSt0djRuQGVHcm91cHMuY29tPg=="},"prevInTopic":71778,"nextInTopic":71781,"prevInTime":71779,"nextInTime":71781,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"... I don t like people tidying my stuff either, but I certainly appreciate it if someone helps me take a glass to the sink, or throw away some trash.  Maybe","messageBody":"<div id=\"ygrps-yiv-1452329636\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;But, our daughter doesn&#39;t like anyone being in her room or tidying it up and yet, she gets so angry because she loses things all the time.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I don&#39;t like people tidying my stuff either, but I certainly appreciate it if someone helps me take a glass to the sink, or throw away some trash.  Maybe put a garbage container in her room, and replace the bag regularly.  Put it close to where she eats.  My son has one beside his computer in his room.  Sometimes he misses it, and wrappers land on the floor.  I pick them up and toss them in for him without saying anything.  Many times he has seen me do this and has said, &quot;Thanks!&quot;  I have seen him change the bag too, before I&#39;ve had a chance to do so.  He&#39;s seen me do it.  He knows what to do.  It&#39;s not a big deal because I haven&#39;t made it one.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;She loses her hair brush everyday and then shouts at everyone in the house saying we must have put it somewhere, of course no one has.&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>Sounds like she is feeling stressed about not knowing where her brush is.  I&#39;m absent-minded like this.  Here&#39;s a funny story.  My son talked around the age of two.  He hadn&#39;t said a single word until he decided to talk.  His first two words were hot and cold, referring to the faucet in the tub.  Very shortly after, he strung a few words together in his first sentence.  Guess what that sentence was?  &quot;Now, where&#39;s my wallet?&quot;  He was mimicking me as we were leaving the house!  It was so funny.  The wonderful thing about my family is that they have a sense of humour about my absentmindedness.  I&#39;m sure it must be exasperating for them at times, but they rarely show it.  They laugh and help me find my stuff...almost every day.  If they weren&#39;t so kind, I might be more stressed about my missing items.  I might even be angry and/or defensive.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;At what age do we start telling our children they need to take responsibility for their own things and bedrooms,  5 yrs old is to young but surely by 12?  I&#39;m starting to wonder if we have done our daughter a disservice by not encouraging her to take more resoniblity in the home as she has chosen never to help out, now she doesn&#39;t seem to know how to take care of herself or her things!&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>We came home from a week long trip recently, and the first thing my son did after visiting his computer for a half an hour was clean the bathroom sink.  He was excited to try a concoction he had thought up and made from the kitchen ingredients.  I&#39;ve never assigned chores, but I do invite him to help me tidy or clean from time to time.  He thinks cleaning is fun because I&#39;ve not made it a burden.  I like doing things for my husband and son around the home.  There have even been times when he and Doug have been playing on the Wii or some such thing, and I have decided to do a sweep around them, and Ethan has turned and said to me, &quot;Thanks for everything you do.&quot;  He&#39;s very sincere.  The first time I heard him say it I felt a bit embarrassed.  I wondered if he thought I was expecting to hear that.  But I think he sees it as a gift, and that&#39;s really very sweet.</div>","specialLinks":[]},{"userId":274801552,"authorName":"HA","from":"&quot;HA&quot; &lt;verbiosa@...&gt;","profile":"verbiosa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Untidy bedrooms","postDate":"1375044929","msgId":71778,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0NDBnMSsyaXRyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0M2cyYSt0djRuQGVHcm91cHMuY29tPg=="},"prevInTopic":71775,"nextInTopic":71780,"prevInTime":71777,"nextInTime":71779,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"My guess is that her confidence is shot when it comes to cleaning. I would go in and ask for her help in doing something. Give her enough details for it to get","messageBody":"<div id=\"ygrps-yiv-746725173\">My guess is that her confidence is shot when it comes to cleaning. I would go in and ask for her help in doing something. Give her enough details for it to get done in a way that is sufficient, which may mean dropping your standards a bit at first. Don&#39;t redo it or try to improve upon it. Just say thank you and be happy you got some help. <br/>\n<br/>\nIf you do that every once in awhile, I think she&#39;ll start doing things herself as she gets older. Especially if you ask her to do something and then say, &quot;Do you want to see an easy way to do it?&quot; That gives you the chance to show her how without her feeling bad.<br/>\n<br/>\nFor now, don&#39;t expect her to anticipate when things need to be done, or to do them very well. As she gets older, those things will be more important. The thing to focus on now is making her feel CAPABLE and PROUD of what she does contribute. <br/>\n<br/>\nGood luck-<br/>\nHilary Ferrand</div>","specialLinks":[]},{"userId":338201201,"authorName":"Kimberly Sims","from":"Kimberly Sims &lt;dkjsv05@...&gt;","profile":"dkjsv05@att.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Untidy bedrooms","postDate":"1375036939","msgId":71783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNzUwMzY5MzkuMTU5MzcuWWFob29NYWlsTmVvQHdlYjE4NDMwNi5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PDEzNzUwMzMxODYuOTg0MjcuWWFob29NYWlsTmVvQHdlYjE4MjIwNC5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PGt0M2cyYSt0djRuQGVHcm91cHMuY29tPiA8MTM3NTAzMzE4Ni45ODQyNy5ZYWhvb01haWxOZW9Ad2ViMTgyMjA0Lm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":71781,"nextInTopic":71784,"prevInTime":71782,"nextInTime":71784,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"~ now she doesn t seem to know how to take care of herself or her things! ~   Why not? I am not asking that you answer here but ask yourself, why doesn t she","messageBody":"<div id=\"ygrps-yiv-672949925\">~&quot;now she doesn&#39;t seem to know how to take care of herself or her things!&quot;~<br/>\n <br/>\nWhy not? I am not asking that you answer here but ask yourself, why doesn&#39;t she know how to take care of herself or her things? When you partner with your children you do not set them up for failure.<br/>\n <br/>\nYou daughter in some ways sounds a lot like my 12 year old daughter. She does not like to keep a tidy room (to my standards anyway) and misplaces her things a lot, a quality I happen to recognize in myself. <br/>\n <br/>\nI myself need to write down everything, when a bill is due, when we might be meeting with friends to birthdays. I know this about myself and make sure we have a place by the door for my keys, I even have a board on the refrigerator to help remind me of leftovers. <br/>\n <br/>\nAs my daughter&#39;s partner I help her find ways to remember things too. For instance if my daughter was given a big sum of money as a gift, and I knew there was a pretty good chance she would loose it, I would have asked then, or away from others if at a party, if she would like me or her dad to hold on to it<br/>\nfor her. At home we would put it in a place that was safe keeping and show her where it is. <br/>\n <br/>\nEven though I am able to see some of myself in my daughter I respect she is not me. My daughter&#39;s room is her room and she does have her own organization thing going on even if I think it looks untidy (she *loves* to draw and has notebooks and art supplies everywhere) . I know she would not like me going in and cleaning because I would mess up *her* memory system. I do however give her a few days notice that I will be tiding up soon and most times she will get a trash bag and pick up herself because she doesn&#39;t like for me to move her stuff. The rest of the times she is okay with me picking up because I do ask before throwing stuff away and she trusts me.<br/>\n <br/>\nI could be wrong but to me it sounds like you are afraid your children will never be &quot;responsible&quot;. I remember hearing that myself growing up, how because my room was dirty I was going to live in a pigsty and yet I manage our home, finances, 3 children, and homeschool them and I didn&#39;t have very good partners for parents (I ran away 500 miles at 18). <br/>\n <br/>\nI did manage to eventually find my own system that works, though it could have been a lot nicer if instead of my parents telling me all that I was doing wrong be my partner and help come up with a few solutions together.<br/>\n <br/>\nKim<br/>\n <br/>\n <br/>\n <br/>\n <br/>\n         <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187853867,"authorName":"Andrea Q","from":"&quot;Andrea Q&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Untidy bedrooms","postDate":"1375033770","msgId":71775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0M2xqYSs4bnAzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGt0M2cyYSt0djRuQGVHcm91cHMuY29tPg=="},"prevInTopic":71774,"nextInTopic":71778,"prevInTime":71774,"nextInTime":71776,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"===Does respecting my children s right to choose mean We have to clean up all the mouldy food, when We can find it, or have to leave it to fester because I ll","messageBody":"<div id=\"ygrps-yiv-1609518022\">===Does respecting my children&#39;s right to choose mean We have to clean up all the mouldy food, when We can find it, or have to leave it to fester because I&#39;ll not allowed in the room?===<br/>\n<br/>\nIt doesn&#39;t have to be so black and white. You could sweetly offer to pick up just the food without commenting on any of the other messes. You could put a trash bin in the hallway next to her door and gently ask her to put food waste in it. You could encourage them to not eat in their rooms by inviting them to join you in the kitchen for a monkey platter or meal (make it fun), or eat in the living room while watching a movie together.<br/>\n<br/>\n===At what age do we start telling our children they need to take responsibility for their own things and bedrooms===<br/>\n<br/>\nIdeally, there is no one age. It&#39;s part of the relationship that starts at birth. You partner with them when they are very young, briefly explain what you&#39;re doing (some of the time, anyway) and keep building on that.<br/>\n<br/>\nHonestly, past the baby days, I don&#39;t think that there is any age that is too young to learn to pick up food waste. When my middle three children were toddlers, we made it fun to put things in the trash and it became a habit. Often, I would pick up and say something about throwing away the nasty stuff. They learned that food refuse should be picked up quickly to avoid getting smells and insects (we lived where there were a lot of cockroaches). They were concerned about the thought of bugs in their bedrooms, so that motivated them to pick up.<br/>\n<br/>\nWhen the middle three were younger and wanted a bedtime snack, I would offer a few things that weren&#39;t messy. (To this day, they call sharp cheddar &quot;bedtime cheese&quot;.) I would bring the food to them in bed and they would eat while I sang or told a story. If there were any bits of food left, I picked it up before leaving the room. That was another way of quietly showing them not to leave food in their rooms.<br/>\n<br/>\nI&#39;m not sure how I would approach this with an independent 12 year old, but your son might be willing to start helping if you share your concerns with him.<br/>\n<br/>\nAndrea Q<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;luminaraking&quot; &lt;luminara.king@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Both our 12 yr old daughter and our 5yr old son have untidy bedrooms. We don&#39;t insist on them tidying up but, I have to say we are getting a bit concerned about the amount of rotten apple cores and orange peels and mouldy cups that my daughter especially, leaves in her room for weeks.  Her room is starting to smell.  If we spot something like this in our 5 yr olds room we remove it ourselves or hand it to him to put in the bin when we help him get dressed in the mornings.  But, our daughter doesn&#39;t like anyone being in her room or tidying it up and yet, she gets so angry because she loses things all the time. Recently, she lost the money her grandfather gave her and is now having to lend it from us until it turns up hopefully!  A year ago, when she got some new cupboards I helped her organised her room, we found a place for everything but she finds it impossible to put things back in the same place.   She loses her hair brush everyday and then shouts at everyone in the house saying we must have put it somewhere, of course no one has.  <br/>\n&gt; When I see her becoming overwhelmed I always offer to help tidy up her room but as she is getting older she doesn&#39;t want me to help.  <br/>\n&gt; Does respecting my children&#39;s right to choose mean We have to clean up all the mouldy food, when We can find it, or have to leave it to fester because I&#39;ll not allowed in the room?<br/>\n&gt;  At what age do we start telling our children they need to take responsibility for their own things and bedrooms,  5 yrs old is to young but surely by 12?  I&#39;m starting to wonder if we have done our daughter a disservice by not encouraging her to take more resoniblity in the home as she has chosen never to help out, now she doesn&#39;t seem to know how to take care of herself or her things!  I&#39;m really stuck with this one, what if she leaves home not being able to do anything for herself, I met adults like this when I was in university.  They didn&#39;t even know how to boil an egg because their parents did everything for them until they left home.   It was sad to see them struggle. <br/>\n&gt; <br/>\n&gt; Luminara<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Untidy bedrooms","postDate":"1375033186","msgId":71774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNzUwMzMxODYuOTg0MjcuWWFob29NYWlsTmVvQHdlYjE4MjIwNC5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGt0M2cyYSt0djRuQGVHcm91cHMuY29tPg==","referencesHeader":"PGt0M2cyYSt0djRuQGVHcm91cHMuY29tPg=="},"prevInTopic":71773,"nextInTopic":71775,"prevInTime":71773,"nextInTime":71775,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"  ","messageBody":"<div id=\"ygrps-yiv-784835180\">  <br/>\n&lt;&lt;&lt;Both our 12 yr old daughter and our 5yr old son have untidy bedrooms. We don&#39;t insist on them tidying up but, I have to say we are getting a bit concerned about the amount of rotten apple cores and orange peels and mouldy cups that my daughter especially, leaves in her room for weeks.  Her room is starting to smell. &gt;&gt;&gt;<br/>\n<br/>\nWhy not go in and pick them up? I do that everyday for my 11 year old son and my 7 year old daughter. They really appreciate. I go in when they are not in the room, as to not disturb them and simply pick up the trash and give a quick clean up. <br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;If we spot something like this in our 5 yr olds room we remove it ourselves or hand it to him to put in the bin when we help him get dressed in the mornings.  But, our daughter doesn&#39;t like anyone being in her room or tidying it up and yet, she gets so angry because she loses things all the time.&gt;&gt;&gt;&gt;<br/>\nMy son does not like me to be there  cleaning up when he is there. I do it when he is not there. I have asked him if that is OK and he is OK with it.<br/>\nHe appreciated it when his room is clean. I don;t badger him or nag him about it. Sometimes he helps. He will do it himself sometimes to help me too.  <br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt; Recently, she lost the money her grandfather gave her and is now having to lend it from us until it turns up hopefully!  A year ago, when she got some new cupboards I helped her organised her room, we found a place for everything but she finds it impossible to put things back in the same place.   She loses her hair brush everyday and then shouts at everyone in the house saying we must have put it somewhere, of course no one has. &gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nAnd some people just do not remember where they put their things. She may always be like that.  Do you never misplace things? Are you expecting too much? <br/>\n<br/>\n<br/>\n&lt;&lt;&lt;When I see her becoming overwhelmed I always offer to help tidy up her room but as she is getting older she doesn&#39;t want me to help. &gt;&gt;&gt;<br/>\n<br/>\nYou can do it for her out of  love. Give it to her as a gift. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/gift\">http://sandradodd.com/chores/gift</a><br/>\n<br/>\n<br/>\n<br/>\n&lt;&lt;&lt;Does respecting my children&#39;s right to choose mean We have to clean up all the mouldy food, when We can find it, or have to leave it to fester because I&#39;ll not allowed in the room?&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nIf you have nagged them and badgered them about cleaning their room and they just do not want you there. If you insist in coming in and pointing out how dirty they are and how tired you are of cleaning their mess  that may explain why they rather  not have you in there. My kids are happy for me to come clean their rooms. Gigi just asked me yesterday to clean the toy room she plays in. She gets overwhelmed at 7. At the same time she will work hard all day with her dad out in the farm.  She is not lazy  in cleaning her room or the toy room. It is just too much for her.  Heck sometimes for me! I did not really get good at cleaning until my late teens. Anything before that was  overwhelming or it just did not really matter for me as my mind was into other things. <br/>\n&lt;&lt;&lt;&lt;&lt;&lt;At what age do we start telling our children they need to take responsibility for their own things and bedrooms,  5 yrs old is to young but surely by 12?  &gt;&gt;&gt;&gt;<br/>\n<br/>\nWhat if she grows up and is always someone who is messy and does not care to clean. There are many adults like that. Making them be responsible ( nagging and threatening them) to clean their room  will not &quot;teach&quot; them to do it or to become responsible. If cleaning their rooms is so negative and  such a pain to do then that is how they will perceive it.  There are some great things here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/\">http://sandradodd.com/chores/</a><br/>\n<br/>\n<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;I&#39;m starting to wonder if we have done our daughter a disservice by not encouraging her to take more resoniblity in the home as she has chosen never to help out, now she doesn&#39;t seem to know how to take care of herself or her things!  I&#39;m really stuck with this one, what if she leaves home not being able to do anything for herself, I met adults like this when I was in university.  They didn&#39;t even know how to boil an egg because their parents did everything for them until they left home.   It was sad to see them struggle. &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\nWhat if? <br/>\nWere those kids unschooled?<br/>\nDid their parents really do everything for them?<br/>\nWhen my brother left home he could not boil an egg either. He then became a chef not many years later, in his 20&#39;s  and worked at some really nice restaurants. He is the one in his family who keeps the house clean now as his wife , who was forced to do chores, does not really enjoy it that much. My mom did everything for him and we had maids growing up.   My sister was always into cleaning and organizing her things even growing up when we had maids and such.<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":549443766,"authorName":"luminaraking","from":"&quot;luminaraking&quot; &lt;luminara.king@...&gt;","profile":"luminaraking","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Untidy bedrooms","postDate":"1375028106","msgId":71773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGt0M2cyYSt0djRuQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":71774,"prevInTime":71772,"nextInTime":71774,"topicId":71773,"numMessagesInTopic":0,"msgSnippet":"Both our 12 yr old daughter and our 5yr old son have untidy bedrooms. We don t insist on them tidying up but, I have to say we are getting a bit concerned","messageBody":"<div id=\"ygrps-yiv-1406010810\">Both our 12 yr old daughter and our 5yr old son have untidy bedrooms. We don&#39;t insist on them tidying up but, I have to say we are getting a bit concerned about the amount of rotten apple cores and orange peels and mouldy cups that my daughter especially, leaves in her room for weeks.  Her room is starting to smell.  If we spot something like this in our 5 yr olds room we remove it ourselves or hand it to him to put in the bin when we help him get dressed in the mornings.  But, our daughter doesn&#39;t like anyone being in her room or tidying it up and yet, she gets so angry because she loses things all the time. Recently, she lost the money her grandfather gave her and is now having to lend it from us until it turns up hopefully!  A year ago, when she got some new cupboards I helped her organised her room, we found a place for everything but she finds it impossible to put things back in the same place.   She loses her hair brush everyday and then shouts at everyone in the house saying we must have put it somewhere, of course no one has.  <br/>\nWhen I see her becoming overwhelmed I always offer to help tidy up her room but as she is getting older she doesn&#39;t want me to help.  <br/>\nDoes respecting my children&#39;s right to choose mean We have to clean up all the mouldy food, when We can find it, or have to leave it to fester because I&#39;ll not allowed in the room?<br/>\n At what age do we start telling our children they need to take responsibility for their own things and bedrooms,  5 yrs old is to young but surely by 12?  I&#39;m starting to wonder if we have done our daughter a disservice by not encouraging her to take more resoniblity in the home as she has chosen never to help out, now she doesn&#39;t seem to know how to take care of herself or her things!  I&#39;m really stuck with this one, what if she leaves home not being able to do anything for herself, I met adults like this when I was in university.  They didn&#39;t even know how to boil an egg because their parents did everything for them until they left home.   It was sad to see them struggle. <br/>\n<br/>\nLuminara</div>","specialLinks":[]}],"prevTopicId":71887,"nextTopicId":71901}}