{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Soccer: was Classes?","postDate":"1013393200","msgId":4604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjEwLjE5MDY1Mi4tMzExNzU3LjEuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":4577,"nextInTopic":0,"prevInTime":4603,"nextInTime":4605,"topicId":4436,"numMessagesInTopic":0,"msgSnippet":"On Sun, 10 Feb 2002 08:37:52 -0800 Tia Leschke  ... asking ... I think Cacie s coach is wonderful, and I think she s been lucky in ","messageBody":"<div id=\"ygrps-yiv-266251400\">On Sun, 10 Feb 2002 08:37:52 -0800 Tia Leschke &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a>&gt;<br/>\nwrites:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &gt;It was a frustrating game,<br/>\n&gt; &gt;apparently the other team was elbowing our girls and pulling on  their<br/>\n&gt; &gt;sleeves, and the refs didn&#39;t call any of it. Cacie could see why the<br/>\n&gt; &gt;other girl would say this, it made some sense to level the field.<br/>\n&gt; <br/>\n&gt; A good coach would be politely asking the ref why they weren&#39;t <br/>\n&gt; calling  those penalties.  When refs let that stuff go, they&#39;re just<br/>\n </span></blockquote>asking <br/>\n<blockquote><span title=\"ireply\"> &gt; for a rougher game.  <br/>\n<br/>\n </span></blockquote>I think Cacie&#39;s coach is wonderful, and I think she&#39;s been lucky in<br/>\nsoccer to have two very gentle, nurturing head coaches (and both<br/>\nassistant coaches have been good guys too, the one this year is a college<br/>\nsoccer player). Generally, in both of the leagues we&#39;ve played it, it&#39;s<br/>\nconsidered very bad form to contradict a referee&#39;s call or tell a ref<br/>\nwhat calls to make, and I agree with that policy. It&#39;s a hard job, and<br/>\nsome of the refs are only 9 or 10 years old. They don&#39;t need someone<br/>\nsecond-guessing their calls, even in a nice way. They can&#39;t see<br/>\neverything. I know this coach has very respectfully spoken to the field<br/>\nref a couple of times after a game, about some calls, but I don&#39;t think<br/>\nit&#39;s appropriate during a game. <br/>\n<br/>\nThe refs also seem to get better as the kids get older... Cacie plays on<br/>\na U9 and a U10 team, so the kids are  pretty young, and they tend to be<br/>\nmore thoughtless than vicious.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But you can tell Cacie that the refs almost always  see the <br/>\n&gt; retaliation, and will usually call the penalty on the person who <br/>\n&gt; retaliated.  So that strategy would end up hurting her team.<br/>\n<br/>\n </span></blockquote>I don&#39;t think they meant to retaliate, just to use the same tactics,<br/>\nlike, &quot;If someone from the other team is racing you for the ball, elbow<br/>\nher out of the way, since that&#39;s what they alwsys do to us.&quot; Things like<br/>\nthat. The girl who had the idea is probably the most competitive kid on<br/>\nthe team, she and Cacie have argued before. Actually, this girl has<br/>\nargued with a good number of the other girls. I had gone to my car so I<br/>\nwasn&#39;t there when she and Cacie first got into it, but when I arrived<br/>\nCacie was in tears and there were three or four girls at her side<br/>\nsupporting her and telling her that G. has &quot;yelled at&quot; them, too. The<br/>\ncoach also hadled that nicely...<br/>\n<br/>\nThe game today was a very fairly-played 1-1 tie....<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Tia, the sports-hating sports mum <br/>\n <br/>\n </span></blockquote>:-) I like sports. I&#39;ve been looking for a very recreational  soccer<br/>\nleague for thirty-something women who haven&#39;t played in years...<br/>\n<br/>\nDar<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/web/.\">http://dl.www.juno.com/get/web/.</a></div>","specialLinks":[]},{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Soccer: was Classes?","postDate":"1013359072","msgId":4577,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAyMDIxMDA4MzQyOC4wMjg3N2IzMEBsb2NhbGhvc3Q+","inReplyToHeader":"PDIwMDIwMjA5LjE4NDgyMC4tMzE4OTEzLjE4LmZyZWVmb3JtQGp1bm8uY29tPg=="},"prevInTopic":4559,"nextInTopic":4604,"prevInTime":4576,"nextInTime":4578,"topicId":4436,"numMessagesInTopic":0,"msgSnippet":"... A good coach would be politely asking the ref why they weren t calling those penalties.  When refs let that stuff go, they re just asking for a rougher","messageBody":"<div id=\"ygrps-yiv-1158796140\"><blockquote><span title=\"ireply\">&gt;She told me today that some of the girls on her soccer team<br/>\n&gt;were saying that if the other team pushes you, it&#39;s okay to push them<br/>\n&gt;back. This felt wrong to her, clearly, but she didn&#39;t want to contradict<br/>\n&gt;the girl and be labeled a goody-goody. It was a frustrating game,<br/>\n&gt;apparently the other team was elbowing our girls and pulling on their<br/>\n&gt;sleeves, and the refs didn&#39;t call any of it. Cacie could see why the<br/>\n&gt;other girl would say this, it made some sense to level the field.<br/>\n<br/>\n </span></blockquote>A good coach would be politely asking the ref why they weren&#39;t calling <br/>\nthose penalties.  When refs let that stuff go, they&#39;re just asking for a <br/>\nrougher game.  But you can tell Cacie that the refs almost always see the <br/>\nretaliation, and will usually call the penalty on the person who <br/>\nretaliated.  So that stragegy would end up hurting her team.<br/>\nTia, the sports-hating sports mum<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Classes?","postDate":"1013305691","msgId":4559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjA5LjE4NDgyMC4tMzE4OTEzLjE4LmZyZWVmb3JtQGp1bm8uY29tPg=="},"prevInTopic":4500,"nextInTopic":4577,"prevInTime":4558,"nextInTime":4560,"topicId":4436,"numMessagesInTopic":0,"msgSnippet":"On Fri, 8 Feb 2002 19:10:15 -0700 Dawn Falbe  ... to be ... about ... people? I ve been thinking about this. I think that if I had a","messageBody":"<div id=\"ygrps-yiv-2071878536\">On Fri, 8 Feb 2002 19:10:15 -0700 &quot;Dawn Falbe&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a>&gt;<br/>\nwrites:<br/>\n<blockquote><span title=\"ireply\"> &gt; The only thing I would have to disagree with is that six is too  young<br/>\n </span></blockquote>to be<br/>\n<blockquote><span title=\"ireply\"> &gt; expected to deal with an adult directly.  I guess because I&#39;m  confused<br/>\n </span></blockquote>about<br/>\n<blockquote><span title=\"ireply\"> &gt; what&#39;s the difference between when we are talking about the ages of <br/>\n </span></blockquote>people?<br/>\n<br/>\nI&#39;ve been thinking about this. I think that if I had a 6 yr old who<br/>\nreally wanted to do this him or herself, I&#39;d be fine with it. However,<br/>\nmany 6 year olds I know get a bit intimidated about confronting adults,<br/>\nespecially &quot;authority figures&quot;. If nothing else, there&#39;s a physical size<br/>\ndiscrepancy, but I think it&#39;s more than that.  There is a power<br/>\ndiscrepancy, and I think the kids sense it. In a situation where she is<br/>\nis labeled &quot;teacher&quot; and Zac is labled &quot;student&quot;, she clearly has more<br/>\npower. Adults also tend to have better reasoning skills and verbal skills<br/>\n- Cacie at 6 might have been to tell someone that she didn&#39;t like<br/>\nsomething, and how it made her feel, but she couldn&#39;t have explained that<br/>\nthe task was developmentally inappropriate and required skills that kids<br/>\nusually don&#39;t develop until 8 or 9.<br/>\n<br/>\nCacie will sometimes deal with something like this herself now, and<br/>\nsometimes ask me to do it. Either way is okay. If it&#39;s someone she&#39;s<br/>\ngenerally comfortable with but needs to confront or question  for some<br/>\nreason, she&#39;s usually okay, and maybe we&#39;ll talk about it beforehand.  If<br/>\nit&#39;s someone she doesn&#39;t really know or trust, she often wants me to do<br/>\nit. I think she trusts me to be able to say what she means in a way that<br/>\nthe other person will &quot;get&quot;, and she knows that sometimes she can&#39;t do<br/>\nthat as well. She told me today that some of the girls on her soccer team<br/>\nwere saying that if the other team pushes you, it&#39;s okay to push them<br/>\nback. This felt wrong to her, clearly, but she didn&#39;t want to contradict<br/>\nthe girl and be labeled a goody-goody. It was a frustrating game,<br/>\napparently the other team was elbowing our girls and pulling on their<br/>\nsleeves, and the refs didn&#39;t call any of it. Cacie could see why the<br/>\nother girl would say this, it made some sense to level the field. We<br/>\ntalked a bit, and I suggested that I could mention it to the coach, who<br/>\nis wonderful. She liked the idea, as long as I did it in private and<br/>\ndidn&#39;t mention the girl&#39;s name. I agreed, and I will. We expect that the<br/>\ncoach will talk to all of the girls about it, and reinforce their<br/>\nfeelings that it&#39;s not fair while reiterating that fair play is<br/>\nimportant, even if the other team is playing dirty.<br/>\n<br/>\nI do think it&#39;s important for kids to know that they can ask for whhat<br/>\nthey need, I just think it&#39;s important that they feel safe and ready to<br/>\ndo so, and that we help them until they do. <br/>\n<br/>\nAnd Dawn, I didn&#39;t forget your other email, I was doing  a quick bit of<br/>\nresearch but I&#39;ll send you info tomorrow..<br/>\n<br/>\nDar<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/web/.\">http://dl.www.juno.com/get/web/.</a></div>","specialLinks":[]},{"userId":49413852,"authorName":"Dawn Falbe","from":"&quot;Dawn Falbe&quot; &lt;dawn@...&gt;","profile":"astrologerdawn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Classes?","postDate":"1013220615","msgId":4500,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2QwMWMxYjEwZSRlYTNlNjI2MCRkMThlZGQxOEBhei5zcHJpbnRiYmQubmV0Pg=="},"prevInTopic":4441,"nextInTopic":4559,"prevInTime":4499,"nextInTime":4501,"topicId":4436,"numMessagesInTopic":0,"msgSnippet":"Thank you both Sandra and Pat you both have some valid points.  I guess as it was a class for homeschoolers I didn t think I needed to say that he s ","messageBody":"<div id=\"ygrps-yiv-973307013\">Thank you both Sandra and Pat you both have some valid points.  I guess as<br/>\nit was a class for homeschoolers I didn&#39;t think I needed to say that he&#39;s<br/>\nhomeschooled although I can see that I do and that is a great learning<br/>\nlesson.  I&#39;ve had other people ask me what grade he&#39;s in when I say we&#39;ve<br/>\nhomeschooling and instead of continuing to same &quot;we homeschool&quot; in answer to<br/>\nthat question I usually say &quot;I have no idea what grades are.. Luckily I grew<br/>\nup in England where we go by years rather than grades and I never bothered<br/>\nto learn the system here&quot;... I think it&#39;s simpler if we say &quot;we homeschool&quot;<br/>\nLOL.....<br/>\n<br/>\nSandra I like the way you put the question to the teacher about acommodating<br/>\nher... I would never have thought of that...  I just asked her why she was<br/>\ndoing it rather than forgetting about why she&#39;s doing it and focusing on<br/>\nwhat my son needs... Great point...<br/>\n<br/>\nThe only thing I would have to disagree with is that six is too young to be<br/>\nexpected to deal with an adult directly.  I guess because I&#39;m confused about<br/>\nwhat&#39;s the difference between when we are talking about the ages of people?<br/>\nWhy would my son be more intimidated to say something to her or say<br/>\nsomething to a man of 21 (Dr. Soul is probably about 45)?  I was there with<br/>\nhim and we had rehearsed in the car what he was going to say and let him<br/>\ndecide whether he wanted to stay at the class after she had answered his<br/>\nquestions.  For me, and I can only speak for myself, I believe it&#39;s<br/>\nimportant that I teach my children very strong boundaries right from the<br/>\nbeginning and that there is no one they cannot ask a question of if they<br/>\ndon&#39;t understand something.  Zak questions rules all the time and I thought<br/>\nthis was another opportunity to question rules from a person who he&#39;d not<br/>\nhad the opportunity to ask why from?<br/>\n<br/>\nDawn<br/>\n<br/>\n<br/>\n<br/>\n&lt;My first thought was to have said to her &quot;He&#39;s NOT in first grade, he&#39;s<br/>\nhomeschooled.&quot;I would have talked to her myself, too, and said Holly&#39;s<br/>\ninterested in the material, but it&#39;s bothering her to be told exactly where<br/>\nto sit. She needs to move around more. Can you accommodate that?&quot;Six is too<br/>\nyoung to be expected to deal with an adult directly. That&#39;s another<br/>\nschool-thought thing, to say &quot;You&#39;re out there, you deal with your own<br/>\nproblems directly.&quot; If one child complains or questions, it&#39;s easy for an<br/>\nadult (especially a childless one who love control and order) to dismiss<br/>\nthat question as an aberration, not as a pointer to a truth.If one other<br/>\nadult explains something in terms of child development or the difference<br/>\nbetween homeschoolers and schooled kids, it will make more difference.<br/>\nSANDRA<br/>\n<br/>\nDawn, I thought you handled everything great. Why are you questioning<br/>\nyourself? Talking to Dr. Soul was valuable because she could have changed<br/>\nher mind. Zak *trying* to accept Dr. Soul&#39;s rules was fine. When what he go<br/>\nout of class did not out weigh his discomfort for the rules, he decided not<br/>\nto go anymore. Great.<br/>\n<br/>\nWe all make decisions like this regularly. Teaching our children to question<br/>\nrules is very beneficial. Understanding that there are stupid rules that<br/>\nsometime we will go along with to get something we want is life in America.<br/>\nPAT<br/>\n<br/>\n<br/>\n<br/>\n********************<br/>\nDawn  Falbe<br/>\nAstrologer Coach<br/>\n(520) 312-5300<br/>\n********************<br/>\nwww.astrologerdawn.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a><br/>\nEnlightening you on how to discover and live your Soul Purpose<br/>\n<br/>\n&quot;The people who get on in this world are people who get up and look for the<br/>\ncircumstances they want, and, if they can&#39;t find them, make them.&quot; - George<br/>\nBernard Shaw<br/>\n<br/>\n&quot;The only time my education was interrupted was when I was in school&quot; -<br/>\nGeorge Bernard Shaw<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":84135975,"authorName":"Pat Cald...","from":"&quot;Pat Cald...&quot; &lt;homeschoolmd@...&gt;","profile":"homeschoolmd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Classes?","postDate":"1013180988","msgId":4441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxY2EwMWMxYjBiMiRhNzI4N2JjMCQ2NDAxYThjMEBvZmZpY2U+","referencesHeader":"PDAwMTAwMWMxYjBhYiQ2ZDliYWU2MCRkMThlZGQxOEBhei5zcHJpbnRiYmQubmV0Pg=="},"prevInTopic":4440,"nextInTopic":4500,"prevInTime":4440,"nextInTime":4442,"topicId":4436,"numMessagesInTopic":0,"msgSnippet":"Dawn, I thought you handled everything great.  Why are you questioning yourself?  Talking to Dr. Soul was valuable because she could have changed her mind.","messageBody":"<div id=\"ygrps-yiv-1297641388\">Dawn, I thought you handled everything great.  Why are you questioning yourself?  Talking to Dr. Soul was valuable because she could have changed her mind.  Zak *trying* to accept Dr. Soul&#39;s rules was fine.  When what he go out of class did not out weigh his discomfort for the rules, he decided not to go anymore.  Great.  <br/>\n<br/>\nWe all make decisions like this regularly.  Teaching our children to question rules is very beneficial.  Understanding that there are stupid rules that sometime we will go along with to get something we want is life in America.<br/>\n<br/>\nPat<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: Dawn Falbe <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Alwayslearning@yahoogroups.com\">Alwayslearning@yahoogroups.com</a> <br/>\nSent: Friday, February 08, 2002 9:18 AM<br/>\nSubject: [AlwaysLearning] Classes?<br/>\n<br/>\n<br/>\nKatrina&#39;s e-mail got me thinking.  I had signed Zak up for a science class.<br/>\nIt was specifically for homeschoolers taught by a professor who (a) doesn&#39;t<br/>\nhave any kids and obviously never homeschooled.  Zak went to the first set<br/>\nof them no problem, although he didn&#39;t talk about them when he came home.<br/>\nThey were for 3 hours on a Thursday morning.  Then I signed him up for the<br/>\n2nd set and he went to the first 2 classes (there are 4 in a session) and he<br/>\ntold me he didn&#39;t want to go anymore.  When I asked him why he said &quot;Dr.<br/>\nSoul makes me sit in the same place all the time and I like to move<br/>\naround&quot;... I said that we need to ask Dr. Soul why she does that.  So we<br/>\nwent to the next class and all the time in the car we were practising what<br/>\nhe was going to say to her.  Also we talked about what would be an<br/>\nacceptable explanation and what wouldn&#39;t.  He said he wanted to wait until<br/>\nhe was 100 weeks older to talk to her as he was frightened.  So I went in<br/>\nwith him and he asked her &quot;Dr. Soul why do you make me sit in the same place<br/>\nall the time when I don&#39;t want too&quot;... She said &quot;because you move around a<br/>\nlot Zak and hang over other people&#39;s work.  Also because this is a mixed<br/>\nclass (8 of them) you and Q are in 1st grade and I have you separated by<br/>\ngrade).  I said that was an acceptable answer and Zak agreed with me<br/>\n(although I didn&#39;t really feel that inside).  Zak seemed ok with that answer<br/>\nand stayed for the class.  But the next week he didn&#39;t want to go again and<br/>\nit was because of the same thing.  He wanted to be able to sit where he<br/>\nwanted in the classroom and move around when he wanted.  I didn&#39;t send him<br/>\nbecause I realized that his reason IS valid whether I think it is or not.  I<br/>\nwent to a &quot;regular&quot; school and was used to having to sit in the same place<br/>\nand do as you were told (even though I didn&#39;t do as I was told and hated<br/>\nschool, all those rules and regulations that didn&#39;t make sense)... So this<br/>\nweek I asked him if he wanted to go to the last class and he said &quot;No I<br/>\ndon&#39;t want to have to sit in the same place that Dr. Soul tells me too, I<br/>\nwant to stay home and play&quot;... So that&#39;s what happened.<br/>\n<br/>\nI think that deschooling myself about &quot;classes&quot; is going to take a while.<br/>\nZak has more of a sense of what he wants to do than I do, so I&#39;m going to<br/>\nhave to trust him more and more and let go... Sometimes it feels so hard to<br/>\nfind the balance between unschooling and parenting.<br/>\n<br/>\nDawn<br/>\n<br/>\n<br/>\n********************<br/>\nDawn  Falbe<br/>\nAstrologer Coach<br/>\n(520) 312-5300<br/>\n********************<br/>\nwww.astrologerdawn.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a><br/>\nEnlightening you on how to discover and live your Soul Purpose<br/>\n<br/>\n&quot;The people who get on in this world are people who get up and look for the<br/>\ncircumstances they want, and, if they can&#39;t find them, make them.&quot; - George<br/>\nBernard Shaw<br/>\n<br/>\n&quot;The only time my education was interrupted was when I was in school&quot; -<br/>\nGeorge Bernard Shaw<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n      Yahoo! Groups Sponsor <br/>\n            ADVERTISEMENT<br/>\n           <br/>\n     <br/>\n     <br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Classes?","postDate":"1013180831","msgId":4440,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxLjE3ZTUxMTQyLjI5OTU0MzlmQGFvbC5jb20+"},"prevInTopic":4436,"nextInTopic":4441,"prevInTime":4439,"nextInTime":4441,"topicId":4436,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/8/02 7:15:20 AM, dawn@astrologerdawn.com writes: ","messageBody":"<div id=\"ygrps-yiv-690517565\">In a message dated 2/8/02 7:15:20 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a> writes:<br/>\n<br/>\n&lt;&lt; I think that deschooling myself about &quot;classes&quot; is going to take a while. <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>My first thought was to have said to her &quot;He&#39;s NOT in first grade, he&#39;s <br/>\nhomeschooled.&quot;<br/>\n<br/>\nI would have talked to her myself, too, and said &quot;Holly&#39;s interested in the <br/>\nmaterial, but it&#39;s bothering her to be told exactly where to sit.  She needs <br/>\nto move around more.  Can you accommodate that?&quot;<br/>\n<br/>\nSix is too young to be expected to deal with an adult directly.  That&#39;s <br/>\nanother school-thought thing, to say &quot;You&#39;re out there, you deal with your <br/>\nown problems directly.&quot;  <br/>\n<br/>\nIf one child complains or questions, it&#39;s easy for an adult (especially a <br/>\nchildless one who love control and order) to dismiss that question as an <br/>\naberration, not as a pointer to a truth.<br/>\n<br/>\nIf one other adult explains something in terms of child development or the <br/>\ndifference between homeschoolers and schooled kids, it will make more <br/>\ndifference.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":49413852,"authorName":"Dawn Falbe","from":"&quot;Dawn Falbe&quot; &lt;dawn@...&gt;","profile":"astrologerdawn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Classes?","postDate":"1013177885","msgId":4436,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTAwMWMxYjBhYiQ2ZDliYWU2MCRkMThlZGQxOEBhei5zcHJpbnRiYmQubmV0Pg=="},"prevInTopic":0,"nextInTopic":4440,"prevInTime":4435,"nextInTime":4437,"topicId":4436,"numMessagesInTopic":0,"msgSnippet":"Katrina s e-mail got me thinking.  I had signed Zak up for a science class. It was specifically for homeschoolers taught by a professor who (a) doesn t have","messageBody":"<div id=\"ygrps-yiv-614748879\">Katrina&#39;s e-mail got me thinking.  I had signed Zak up for a science class.<br/>\nIt was specifically for homeschoolers taught by a professor who (a) doesn&#39;t<br/>\nhave any kids and obviously never homeschooled.  Zak went to the first set<br/>\nof them no problem, although he didn&#39;t talk about them when he came home.<br/>\nThey were for 3 hours on a Thursday morning.  Then I signed him up for the<br/>\n2nd set and he went to the first 2 classes (there are 4 in a session) and he<br/>\ntold me he didn&#39;t want to go anymore.  When I asked him why he said &quot;Dr.<br/>\nSoul makes me sit in the same place all the time and I like to move<br/>\naround&quot;... I said that we need to ask Dr. Soul why she does that.  So we<br/>\nwent to the next class and all the time in the car we were practising what<br/>\nhe was going to say to her.  Also we talked about what would be an<br/>\nacceptable explanation and what wouldn&#39;t.  He said he wanted to wait until<br/>\nhe was 100 weeks older to talk to her as he was frightened.  So I went in<br/>\nwith him and he asked her &quot;Dr. Soul why do you make me sit in the same place<br/>\nall the time when I don&#39;t want too&quot;... She said &quot;because you move around a<br/>\nlot Zak and hang over other people&#39;s work.  Also because this is a mixed<br/>\nclass (8 of them) you and Q are in 1st grade and I have you separated by<br/>\ngrade).  I said that was an acceptable answer and Zak agreed with me<br/>\n(although I didn&#39;t really feel that inside).  Zak seemed ok with that answer<br/>\nand stayed for the class.  But the next week he didn&#39;t want to go again and<br/>\nit was because of the same thing.  He wanted to be able to sit where he<br/>\nwanted in the classroom and move around when he wanted.  I didn&#39;t send him<br/>\nbecause I realized that his reason IS valid whether I think it is or not.  I<br/>\nwent to a &quot;regular&quot; school and was used to having to sit in the same place<br/>\nand do as you were told (even though I didn&#39;t do as I was told and hated<br/>\nschool, all those rules and regulations that didn&#39;t make sense)... So this<br/>\nweek I asked him if he wanted to go to the last class and he said &quot;No I<br/>\ndon&#39;t want to have to sit in the same place that Dr. Soul tells me too, I<br/>\nwant to stay home and play&quot;... So that&#39;s what happened.<br/>\n<br/>\nI think that deschooling myself about &quot;classes&quot; is going to take a while.<br/>\nZak has more of a sense of what he wants to do than I do, so I&#39;m going to<br/>\nhave to trust him more and more and let go... Sometimes it feels so hard to<br/>\nfind the balance between unschooling and parenting.<br/>\n<br/>\nDawn<br/>\n<br/>\n<br/>\n********************<br/>\nDawn  Falbe<br/>\nAstrologer Coach<br/>\n(520) 312-5300<br/>\n********************<br/>\nwww.astrologerdawn.com<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dawn@...\">dawn@...</a><br/>\nEnlightening you on how to discover and live your Soul Purpose<br/>\n<br/>\n&quot;The people who get on in this world are people who get up and look for the<br/>\ncircumstances they want, and, if they can&#39;t find them, make them.&quot; - George<br/>\nBernard Shaw<br/>\n<br/>\n&quot;The only time my education was interrupted was when I was in school&quot; -<br/>\nGeorge Bernard Shaw<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":4603,"nextTopicId":4602}}