{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":101672438,"authorName":"Bill and Diane","from":"Bill and Diane &lt;cen46624@...&gt;","profile":"thegreatdiane","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: So many things--wills","postDate":"1051580821","msgId":13938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFQUREOTk1LjkwMTAxMDFAdm9sLmNvbT4=","referencesHeader":"PGI4a2drMit2Nzc5QGVHcm91cHMuY29tPg=="},"prevInTopic":13937,"nextInTopic":0,"prevInTime":13937,"nextInTime":13939,"topicId":13881,"numMessagesInTopic":0,"msgSnippet":"I ve been thinking about our options quite a bit. My MIL is sick and couldn t take the kids. My parents shouldn t have them, but they re both retired","messageBody":"<div id=\"ygrps-yiv-503938368\">I&#39;ve been thinking about our options quite a bit.<br/>\n<br/>\nMy MIL is sick and couldn&#39;t take the kids.<br/>\n<br/>\nMy parents shouldn&#39;t have them, but they&#39;re both retired schoolteachers <br/>\nwho don&#39;t understand or support what we&#39;re doing.<br/>\n<br/>\nMy older sis is childless by choice, and she and her dh are both sick.<br/>\n<br/>\nMy older bro is VERY religious and has two pre-teen girls who aren&#39;t <br/>\nallowed to read Harry Potter. He&#39;d probably get the kids :-(  <br/>\n<br/>\nI can&#39;t stand my younger brother, and while he&#39;s probably closer to us <br/>\n(philosophically) than anyone else in the family, they&#39;re planning to <br/>\nsend their toddler to daycare &quot;for socialization.&quot; Which says a lot. <br/>\nBesides, I&#39;d come haunt the whole family if he got my wonderful little ones.<br/>\n<br/>\nWe&#39;ve been here only a year and don&#39;t have any prospects for alternate <br/>\nparents here in Kentucky.<br/>\n<br/>\nBrian&#39;s godparents are in Louisiana, and are more alternative than <br/>\nanyone else in the running, and they both work and have their baby in <br/>\nchildcare.<br/>\n<br/>\nI find the prospect of planning for the unspeakable to be unthinkable.<br/>\n<br/>\n:-) Diane<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;Does anyone else not have a will because they don&#39;t know who they <br/>\n&gt;would want to leave their kids to? <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: So many things--wills","postDate":"1051575746","msgId":13937,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4a2drMit2Nzc5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIwMDMwNDI0MTA0NTA1LjcwMDk3LnFtYWlsQHdlYjQxMjA1Lm1haWwueWFob28uY29tPg=="},"prevInTopic":13892,"nextInTopic":13938,"prevInTime":13936,"nextInTime":13938,"topicId":13881,"numMessagesInTopic":0,"msgSnippet":"... Does anyone else not have a will because they don t know who they would want to leave their kids to? Neither set of parents would unschool.  Dh s parents","messageBody":"<div id=\"ygrps-yiv-1792498525\"><blockquote><span title=\"ireply\">&gt; To Heidi:  My DH and I have four children (one from<br/>\n&gt; DH&#39;s previous marriage) and when we moved overseas we<br/>\n&gt; wrote our will. <br/>\n<br/>\n </span></blockquote>Does anyone else not have a will because they don&#39;t know who they <br/>\nwould want to leave their kids to?  <br/>\n<br/>\nNeither set of parents would unschool.  Dh&#39;s parents would send them <br/>\nto school.  My parents might attempt homeschooling, in order to <br/>\nrespect our wishes, but I&#39;m sure they would use some type of <br/>\ncurriculum.  Maybe not super-structured, but I know they would have a <br/>\nneed to at least teach math traditionally!  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] So many things","postDate":"1051194162","msgId":13892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlYy43NDI3OGY0LjJiZDk0ZDMyQGFvbC5jb20+"},"prevInTopic":13881,"nextInTopic":13937,"prevInTime":13891,"nextInTime":13893,"topicId":13881,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/24/03 6:48:04 AM Eastern Daylight Time, ... Giving him the opportunity to have a voice is all I can muster right now. LOL.  I HATE GETTING","messageBody":"<div id=\"ygrps-yiv-401251371\">In a message dated 4/24/03 6:48:04 AM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamajens2000@...\">mamajens2000@...</a> writes:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; To Pam:  What a wonderful opportunity you have this<br/>\n&gt; week to touch the mind of that 7 year old!  Can you<br/>\n&gt; bring him shopping with you?  Barring that, get him to<br/>\n&gt; help unpack the groceries and write up next week&#39;s<br/>\n&gt; list, explaining why you do what you do.  Maybe he<br/>\n&gt; eats Lunchables and drinks Gatorade because that&#39;s<br/>\n&gt; what his parents provide and he would never dream of<br/>\n&gt; questioning them.  Who knows?<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Giving him the opportunity to have a voice is all I can muster right now. <br/>\nLOL.  I HATE GETTING UP EARLY.  LOL.  He does have freedoms around here but <br/>\nhas never had them at home so goes totally crazy.  I really have to keep an <br/>\neye on things and redirect him.  LOL.  And, not sure if it is because he is a <br/>\npublic school child as mine were never in school, but he is so aggressive.  I <br/>\nhave to watch and when he tries things I say that isn&#39;t how we do things <br/>\naround here, we need to talk about it and work on it until we have a solution <br/>\nthat works for everyone.  He is large for his age and I think he is used to <br/>\nbullying (is that a word) his way around.  Pushing, shoving, yanking, biting. <br/>\n Very aggressive.  And he will try to play with my oldest and leave the <br/>\nyoungest out of things.  He is in between my boys.  I try to play with them <br/>\nso that we all can play.  That sort of mentality.  <br/>\n<br/>\nThe boys were playing in the family room yesterday, adjacent to the laundry <br/>\nroom.  He started taking all the clean clothes and throwing them everywhere.  <br/>\nThey were neatly stacked up.  Not sure what that was about.  He has not been <br/>\nshown how to talk about things at all. So when you ask anything he shrugs his <br/>\nshoulders and runs off.  I had to step in and refold the clothes.  My boys <br/>\nhelped some but they love this kid and really wanted to play, so I told them <br/>\nto go on.  I never make my boys help me but they could see how frustrated I <br/>\nwas.  Anyway, this has been a trying week.  But we are making it work.  I <br/>\nhave decided the best idea is to take them somewhere.  We have been going to <br/>\nparks and museums etc.  LOL I keep telling myself that all this is new for <br/>\nhim.  He has never had a say in anything.  His parents use punishment a lot <br/>\n(spanking, taking things away etc).  <br/>\n<br/>\nIt is making me grateful that we are who we are.  That our family has found a <br/>\npeaceful way to live and this child is really not having a negative effect on <br/>\nmy boys.  They are still sweet, nice children.  <br/>\n<br/>\nWhen we were at play group he was trying to tell the boys (all of them) to <br/>\nchase the girls and not to play with the girls and my boys stepped in and <br/>\nintroduced him and said that they wanted to all play together and they found <br/>\nsomething that all of them could do.  <br/>\n<br/>\nCan&#39;t change the world in a week but at least he sees that things can be <br/>\ndifferent.  He always wants to come over to play I have just never had him <br/>\nfor more than a day at a time before.  Oh well I am rambling again.  I seem <br/>\nto be doing a lot of that.  Gotta run.  Going to the science center then to <br/>\nyet another park.<br/>\n<br/>\nPam G.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":134799326,"authorName":"Lisa Freese","from":"Lisa Freese &lt;mamajens2000@...&gt;","profile":"mamajens2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"So many things","postDate":"1051181105","msgId":13881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMwNDI0MTA0NTA1LjcwMDk3LnFtYWlsQHdlYjQxMjA1Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNTExMzEzODcuMTc2Mi42ODM2NC5tOUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":13892,"prevInTime":13880,"nextInTime":13882,"topicId":13881,"numMessagesInTopic":0,"msgSnippet":"I have just joined this group recently and have been lurking for a couple of weeks but some of the recent threads are so interesting I had to weigh in. To Dee:","messageBody":"<div id=\"ygrps-yiv-2010558484\">I have just joined this group recently and have been<br/>\nlurking for a couple of weeks but some of the recent<br/>\nthreads are so interesting I had to weigh in.<br/>\n<br/>\nTo Dee:  Once more, and less adequately than has<br/>\nalready been said, you are on the right path--bonding<br/>\nand growing; that&#39;s what it&#39;s all about.  My DH can&#39;t<br/>\nspell to save his life, nor does he write cursive<br/>\n(except his signature), nor does he do many of the<br/>\nthings he &quot;should.&quot;  And he is the one home with our<br/>\nchildren all day.  Why?  Because he is their father,<br/>\nand except for me, loves our kids more than anyone<br/>\nelse on this planet.  What other qualifications does<br/>\nhe need?  Go for it!<br/>\n<br/>\nTo Pam:  What a wonderful opportunity you have this<br/>\nweek to touch the mind of that 7 year old!  Can you<br/>\nbring him shopping with you?  Barring that, get him to<br/>\nhelp unpack the groceries and write up next week&#39;s<br/>\nlist, explaining why you do what you do.  Maybe he<br/>\neats Lunchables and drinks Gatorade because that&#39;s<br/>\nwhat his parents provide and he would never dream of<br/>\nquestioning them.  Who knows?<br/>\n<br/>\nTo Heidi:  My DH and I have four children (one from<br/>\nDH&#39;s previous marriage) and when we moved overseas we<br/>\nwrote our will.  At the time, the best choice for<br/>\nguardian was my SIL and her partner, but two years<br/>\nlater we have decided to change to my sister, with<br/>\nanother sister and her husband as our second choice. <br/>\nThey know how we feel about unschooling and they all<br/>\nhave said they will try to respect our wishes, but<br/>\nrealistically I can&#39;t expect they will be able to<br/>\nunschool &quot;the way we would.&quot;  We are, however, leaving<br/>\na list of suggestions for them should they need to put<br/>\nthe children in school, such as searching for a<br/>\nWaldorf or other alternative type of school, and<br/>\nbarring all else, to send them to Catholic school (if<br/>\nnothing else, they&#39;ll get a foundation in their<br/>\nfaith--no snickering pls &lt;g&gt;).  I don&#39;t necessarily<br/>\nagree that family is the only or best way to go, but<br/>\nbecause we are a Foreign Service family and tend to<br/>\nmove a lot, it is difficult to make the kinds of<br/>\nlifelong friends we would make if we stayed in one<br/>\nplace.  So family it is.  My mother and MIL both<br/>\nloudly and consistently object to our decision to<br/>\nhomeschool (we haven&#39;t quite let them in on the fact<br/>\nthat we actually unschool; I sent them some JT Gatto<br/>\nmaterial and pretty much blew their minds), so I am<br/>\nnot willing to leave the kids with them.  That said, I<br/>\ndo want our children to know their grandparents and<br/>\naunts and uncles, and to have that family circle if<br/>\nfor some reason something should happen to DH and me. <br/>\nAs for my stepson, he is in PS in Denver with his<br/>\nmother and will be 18 in just over 2 years.  He is not<br/>\nreally our worry; his mother can take care of him if<br/>\nsomething happens to my DH, and if something happens<br/>\nto her, he likely would go with her parents since they<br/>\nlive in Denver as well (our family is in Chicago).<br/>\n<br/>\nSo many choices.  Sorry for the length of this post.<br/>\n<br/>\nLisaF.<br/>\n<br/>\n=====<br/>\nLisa Freese<br/>\n<br/>\n&quot;If we all did the things we are capable of doing, we would literally astound ourselves.&quot; --Thomas Edison<br/>\n<br/>\n__________________________________________________<br/>\nDo you Yahoo!?<br/>\nThe New Yahoo! Search - Faster. Easier. Bingo<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://search.yahoo.com\">http://search.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":13933,"nextTopicId":13949}}