{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Bridget E Coffman","from":"Bridget E Coffman &lt;rumpleteasermom@...&gt;","replyTo":"LIST","senderId":"GBRY9msi020QNj6nBB3iV1SGplf3IOwEelLOKJjvkdPO7vyld7VM9bm-phmt0fs5JJyFaJw_aFgN21cKPCWkpftz82ZZS8Y2cUQwtuP63rv0lgY","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Bridget :-) Long","postDate":"1000394378","msgId":25557,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwOTEzLjExNDA0NS4tNjc0NjAxLjEwLnJ1bXBsZXRlYXNlcm1vbUBqdW5vLmNvbT4="},"prevInTopic":25543,"nextInTopic":0,"prevInTime":25556,"nextInTime":25558,"topicId":25543,"numMessagesInTopic":0,"msgSnippet":"... treating ... hypocritical ... sorry. ... Brenda, Thank you for your post and your story.  I do understand what you are trying to say and in fact I ve","messageBody":"<div id=\"ygrps-yiv-279839452\">On Thu, 13 Sep 2001 02:14:01 EDT <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:brendaclaspell@...\">brendaclaspell@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; Ok, I&#39;ve been thinking a lot about the child as messiah thing and <br/>\n </span></blockquote>treating <br/>\n<blockquote><span title=\"ireply\"> &gt; everyone as such, which I really believe in, so I feel pretty <br/>\n </span></blockquote>hypocritical <br/>\n<blockquote><span title=\"ireply\"> &gt; for some of the feelings I&#39;ve had about you and my brash tones. I&#39;m <br/>\n </span></blockquote>sorry.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Brenda,<br/>\nThank you for your post and your story.  I do understand what you are<br/>\ntrying to say and in fact I&#39;ve already done most of what you advocate.  I<br/>\nhad let go of a lot of the &#39;control&#39;  I had been trying to hold on to<br/>\nabout a year ago.  But that does not mean I will allow him to injure<br/>\nhimself.   Picking his arm open may be a form of coping but I can&#39;t let<br/>\nit continue unchecked because it is destructive.  Scratching his head and<br/>\nsniffing his fingers is not destructive so I don&#39;t try to stop that<br/>\nbehavior.  TV is a sticky area though.  The damage done is a little less<br/>\nimmediate and a little more important.  I am NOT talking about damage to<br/>\nhis mind or his mental state.  I am talking about damage to his health. <br/>\nThat sedentary lifestyle when it continues for years is not good.  He is<br/>\nalready overweight and out of shape.  He NEEDS to get away from the TV<br/>\nand get exercise.  He knows it and he feels better when he does and he is<br/>\nhappier when he gets away.  But, he is not ready to take sole<br/>\nresponsibility of turning it off himself.  Until he is in a position to<br/>\ncontrol his own compulsion, it is my job as parent to help him learn how.<br/>\nIf you truly have dealt with addiction and OCD you will understand the<br/>\ndifference between an addiction to an injested substance and a compulsion<br/>\nto behave a certain way.  They are not the same and I should not have<br/>\nused the words interchangeable but I have found that many people do think<br/>\nof them as interchangeable.  <br/>\n<br/>\nBridget<br/>\n<br/>\n~~~~~~~~~~~~   F u cn rd ths u cnt spl wrth a dm! ~~~~~~~~~~~~~~~~<br/>\n<br/>\nIf electricity comes from electrons . . .<br/>\n . . . does that mean that morality comes from morons?</div>","specialLinks":[]},{"userId":0,"authorName":"brendaclaspell@aol.com","from":"brendaclaspell@...","replyTo":"LIST","senderId":"McGWi2l4piwG-P67OC3DAqHe3EUFqDswvBxT-qJ_wUVTQd6PlVUEh3W6t5fFkox_6_4_VacMEpwaYX7hnA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Bridget :-) Long","postDate":"1000361641","msgId":25543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1Ny5lMTcxNDIuMjhkMWE4YTlAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":25557,"prevInTime":25542,"nextInTime":25544,"topicId":25543,"numMessagesInTopic":0,"msgSnippet":"Ok, I ve been thinking a lot about the child as messiah thing and treating everyone as such, which I really believe in, so I feel pretty hypocritical for some","messageBody":"<div id=\"ygrps-yiv-1743690304\">Ok, I&#39;ve been thinking a lot about the child as messiah thing and treating <br/>\neveryone as such, which I really believe in, so I feel pretty hypocritical <br/>\nfor some of the feelings I&#39;ve had about you and my brash tones. I&#39;m sorry.<br/>\n<br/>\nYou have said many things that have really hit home with me, as a person <br/>\nstill learning and growing and as a parent. If I had no concern for you or <br/>\nyour struggles, I would have deleted all of your messages by now, but so many <br/>\nthings you say ring out to me, I want to share with you the knowledge I have. <br/>\nBut as someone rightly pointed out, you can&#39;t give that to someone who <br/>\ndoesn&#39;t want it or ask for it, and it&#39;s not very unschooly. <br/>\n<br/>\nSo rather than *tell* you what is going on in your house let me share my life <br/>\nwith you.<br/>\n<br/>\nAddiction and codependency have been a huge part of my life. And as a child I <br/>\ntoo watched tv a lot and picked at myself. In hindsight, I didn&#39;t need more <br/>\nstructure, control, spankings, punishment, rules, etc. I needed to feel free, <br/>\nloved unconditionally, accepted, noticed, listened to, respected, etc. I&#39;m <br/>\nnot at all implying these things are lacking in your home, only stating that <br/>\nthey were in mine.<br/>\n<br/>\nRecently my son was watching tv a lot, and I really got scared. I was worried <br/>\nabout the effect of tv, but I was also petrified of the thought of him lost <br/>\nin addiction like me or his father.  My first thought was to control his <br/>\naddiction or obsession. And I did. I went so far as to unplug the tv and tell <br/>\nhim it was broken. Thinking it&#39;s ok to lie and control if it&#39;s in his best <br/>\ninterest. But with all the debates on here, I changed my mind. And I had to <br/>\nlook back on my own childhood, and think of what I could give him rather than <br/>\ntake from him. This has also been a wonderful opportunity for me to not only <br/>\nhelp my son and open a door for him I nearly closed, but a chance for me to <br/>\nreconnect with another lost part of myself. To realize some more stuff from <br/>\nmy childhood that shaped who I am today. And your posts have inspired that <br/>\ntoo, so for that I thank you.<br/>\n<br/>\nLike you, I also had a period of injury where he watched a lot of tv. But he <br/>\nalso has had lots of other emotional stuff happen, stuff that I thought he <br/>\nshould be over by now. I think now that with everything he&#39;s been thru in his <br/>\nshort life, he has been &#39;hiding out&#39; in the tv until he knows it&#39;s safe to <br/>\ncome out. It&#39;s a safe, comfortable, controlled, predictable environment. He <br/>\nalso needs to know that life is safe, that he is loved, that someone is <br/>\nalways available to him and will love him no matter what. If I were in my <br/>\nson&#39;s shoes, I&#39;d be a bit cautious venturing out too. Sometimes he&#39;ll let it <br/>\ngo for awhile, then come back to it. I truly think he is using it as a safe <br/>\nspot. And as someone said on the chat boards, it&#39;s something he can control, <br/>\nthat is turn on and off at will, unlike life. <br/>\n<br/>\nMight I offer a possibility that you can dispose of at will. You said that <br/>\nyou had a time where you were down and your son watched a lot of tv. Maybe it <br/>\nreally scared him that you might die, or stay sick forever and he never <br/>\nverbalized it or even consciously knew it. Maybe sometimes he needs to &#39;hide <br/>\nout&#39; in the tv until he feels confident that his own environment is stable, <br/>\ni.e. you&#39;re not going to be hurt again or die and leave him. And maybe, when <br/>\nhe reaches his comfort point with the outside world, he will no longer *need* <br/>\nthe tv and will only use it as an education and entertaining tool.<br/>\n<br/>\nBrenda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":24462,"nextTopicId":25558}}