{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Kids and Stealing","postDate":"1272808925","msgId":53703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxNjVGODU5MjhBMDQ3Rjg5NjVEM0MxRDdEOUE2QTk3QEVkUEM+","inReplyToHeader":"PEIzMDg5RDk3LUY0RjktNDEwNC04NjMwLUJGNkI0MUUyQjFFM0B2ZXJpem9uLm5ldD4=","referencesHeader":"PGhyaWgyZCthdWNoQGVHcm91cHMuY29tPiA8QjMwODlEOTctRjRGOS00MTA0LTg2MzAtQkY2QjQxRTJCMUUzQHZlcml6b24ubmV0Pg=="},"prevInTopic":53701,"nextInTopic":0,"prevInTime":53702,"nextInTime":53704,"topicId":53694,"numMessagesInTopic":0,"msgSnippet":"I forgot how old your child is but another idea would be to make a scrap book wish book. He could find pictures of the things he d like and collect pictures","messageBody":"<div id=\"ygrps-yiv-930970374\">I forgot how old your child is but another idea would be to make a scrap book wish book. He could find pictures of the things he&#39;d like and collect pictures and mount in a scrap book.  Just a plain notebook with paper would work - you could take unlined paper (copy paper) 3 hole punch it and insert into a 3 rind binder too to make the scrap book - that way pages could be removed and inserted as he wishes.<br/>\n<br/>\nI remember looking at catalogs when I was a child - I&#39;m old enough that the Sears and Montgomery Wards Catalogs were treasure troves for me - I looked through those wish books over and over.  I grew up out in the country and the closest stores were the &quot;dime stores&quot; There wasn&#39;t even a Wal-Mart back then. ;)<br/>\n<br/>\nAnyway - maybe if he has a tangible way of collecting his wishes it might help - He could arrange the pages in priority and change them around as those priorities change.<br/>\n<br/>\nHe could have a small savings jar to collect change in or a dollar here or there to save towards the item of priority.  If he saves then when he has enough for any one item he might decide that is his priority item ;)<br/>\n<br/>\nI think you mentioned Lego&#39;s - they have a free catalog / magazine they send to my son.  He is 15 almost 16 and still enjoys looking at it.<br/>\n<br/>\nMy son has spent hours looking at Legos on Ebay - even when he knew we were not looking to buy anything at that moment - He knew how to put things in watched items which gave him some independence - He could go back and look at all his chosen favorites and he could also show us all his treasures and what if&#39;s.<br/>\n<br/>\nWe had a lot of fun and still do with exploring what we could do if we had such and such.  For example, we have been verbally &quot;building&quot; a house that looks like a Japanese castle in the Rocky Mountains of Colorado ;) for the past few weeks.<br/>\n<br/>\nLisa W.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Kids and Stealing","postDate":"1272802059","msgId":53701,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzMDg5RDk3LUY0RjktNDEwNC04NjMwLUJGNkI0MUUyQjFFM0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGhyaWgyZCthdWNoQGVHcm91cHMuY29tPg==","referencesHeader":"PGhyaWgyZCthdWNoQGVHcm91cHMuY29tPg=="},"prevInTopic":53694,"nextInTopic":53703,"prevInTime":53700,"nextInTime":53702,"topicId":53694,"numMessagesInTopic":0,"msgSnippet":"There was a good thread on stealing a bit ago: http://groups.yahoo.com/group/AlwaysLearning/message/49141 You might try bringing the kids more into the","messageBody":"<div id=\"ygrps-yiv-1857268166\">There was a good thread on stealing a bit ago:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/message/49141\">http://groups.yahoo.com/group/AlwaysLearning/message/49141</a><br/>\n<br/>\nYou might try bringing the kids more into the finances in a small way.  <br/>\nThey&#39;re probably hearing &quot;We really can not afford that right now,&quot;  <br/>\nmore than they ever have and it makes them feel powerless. They don&#39;t  <br/>\nknow when it will change back. If ever. They don&#39;t have control over  <br/>\nwhen you say yes and when you say no. Their only power is asking and  <br/>\nthat&#39;s not much power at all!<br/>\n<br/>\nRather than presenting it as a scary limitation, present it as a need  <br/>\nto be way more clever with money to get what people need. Search for  <br/>\nthings on Craig&#39;s List and Freecycle. eBay. Put up a Wish List for  <br/>\nkids to add what they want on. And discuss ways of working towards that.<br/>\n<br/>\nI don&#39;t know if that will solve the problem, but it might help.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I am wondering if unschooling is going to be possible for us  <br/>\n&gt; financially.<br/>\n<br/>\n </span></blockquote>School isn&#39;t free. There are loads of hidden costs besides clothes and  <br/>\nsupplies. Lots of schools ask for supplies for the classroom. There  <br/>\nare field trip fees. Fees for sports. And so on.<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":361639019,"authorName":"joanne.lopers","from":"&quot;joanne.lopers&quot; &lt;wilmalv@...&gt;","profile":"joanne.lopers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Kids and Stealing","postDate":"1272760205","msgId":53694,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhyaWgyZCthdWNoQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":53701,"prevInTime":53693,"nextInTime":53695,"topicId":53694,"numMessagesInTopic":0,"msgSnippet":"I am wondering how unschoolers have approached situations where there child has stolen something.   Twice he has taken small items from friends or neighbours","messageBody":"<div id=\"ygrps-yiv-471873322\">I am wondering how unschoolers have approached situations where there child has stolen something.   Twice he has taken small items from friends or neighbours which we return and apologize for.  Another time, from a store, again we went back and returned it.  Recently, instead of returning money to a friend of mine he hide some of it from her and when she questioned him he went away and produced the rest of the money for her.  They are usually very small items and he will produce them from a pocket infront of me with a surprised look and a &quot;How did that get there.&quot;  I am thinking that some of the responses are going to have to do with him maybe not getting enough of what he needs.  Should I be buying the things that he is stealing?  Unfortunately right now, we are in huge financial debt, in the midst of possibly loosing our house, my husband makes half of what he used to and I am wondering if unschooling is going to be possible for us financially. I try to keep the energy of not having enough money away from my kids but sometimes I don&#39;t know how to respond to repeated requests for $100.00 lego sets other than, &quot;We really can not afford that right now.&quot;   He can also be very cohersive with his brother when he gets money for his birthday or from the tooth fairy.  He badgers him into trying to let him have some.  I feel like I am not getting to the underlying root of this problem and he doesn&#39;t like to talk too much about it when I bring it up.  Any back door recommendations?  <br/>\nI got some great responses when I posted about my other sons exposive anger so I am hoping to have some insight shed on this.<br/>\nThanks, Joanne</div>","specialLinks":[]}],"prevTopicId":53693,"nextTopicId":53486}}