{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":88752706,"authorName":"Carol Koessel","from":"&quot;Carol Koessel&quot; &lt;carolkoessel@...&gt;","profile":"carosel95542","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2057","postDate":"1022032877","msgId":37223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE9FMjRCY043RGFKSEZ6ckswcFcwMDAwMTQzOUBob3RtYWlsLmNvbT4=","referencesHeader":"PDEwMjIwMTk4MTQuMTgyOC44MTI1OC5tMTBAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":37222,"nextInTime":37224,"topicId":37223,"numMessagesInTopic":0,"msgSnippet":"I am doing the Digest thing so I won t get into individual stuff, but I love this site. You are all so bright and positive. Thank you. Someone had mentioned","messageBody":"<div id=\"ygrps-yiv-1299871029\">I am doing the Digest thing so I won&#39;t get into individual stuff, but I love<br/>\nthis site. You are all so bright and positive. Thank you. Someone had<br/>\nmentioned the first born being the &quot;perfectionist&quot; and that was my<br/>\nexperience too, but I must say my third (of four) is the same. Though I do<br/>\nnot believe in astrology, they were born 9 years and 2 days apart. Hmm. At<br/>\nany rate, it is diffiucult to soothe and reassure a child who is determined<br/>\nto &quot;judge&quot; himself and his own work. I kept trying to see how I might have<br/>\ninfluenced my children to believe that they had to be perfect and<br/>\nknowledgebale the first time doing something new. I just am not that kind of<br/>\nperson, the point is they were. I worried so much when David was young about<br/>\nwhere this came from. He is now 18 and is still very driven. It has, however<br/>\nserved him. I don&#39;t like to say that I like a competitive, perfectionistic<br/>\nson, but it seems to do him well. I would love for him to try (and fail and<br/>\nbe ok with it) new things but that is just not who he was born to be. I<br/>\nguess my point is, we do our best to influence our kids and keep the<br/>\npressure off of them to perform, but it seems to be the nature of some<br/>\nchildren and it doesn&#39;t matter what we say or do. That is who they are.<br/>\n<br/>\nWhen David was little, I remember him drawing or writing and scribbling all<br/>\nover the paper and tearing it up if it wasn&#39;t the way he had intended. The<br/>\nsheer force and anger and disapointment in him upset me. It didn&#39;t seem as<br/>\nimportant to him. He threw his fit and started over. It was me who it<br/>\nbothered, not him. Maybe I am nuts, and am in deep need of therapy, but he<br/>\nseemed to be ok with his &quot;tanturms of perfection.&quot; I think until it no<br/>\nlonger sereves him, he will continue to do it his perfect way. I think I<br/>\njust had to let go at some point and realize he has his lessons to learn,<br/>\nand they were not my lessons, nor my experience. I had to let him do his own<br/>\nlife and learn for himself. I had nothing to offer on the subject of self<br/>\nimposed perfectionism. It is interesting how our children become their own<br/>\npeople, and often they have such different ways of expressing themselves.<br/>\nCarol</div>","specialLinks":[]}],"prevTopicId":37218,"nextTopicId":37169}}