{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] excluding Kids","postDate":"1039456044","msgId":11195,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4xLjUuMC4yMDAyMTIwOTA5MzY0My4wMGEwYTAyMEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PFNwcmluZ21haWwuMDk5NC4xMDM5Mjg1MDA0LjAuNDk1OTYwMDBAd2VibWFpbC5wYXMuZWFydGhsaW4gay5uZXQ+"},"prevInTopic":11172,"nextInTopic":0,"prevInTime":11194,"nextInTime":11196,"topicId":11170,"numMessagesInTopic":0,"msgSnippet":"... families.","messageBody":"<div id=\"ygrps-yiv-1273642958\"><blockquote><span title=\"ireply\">&gt;&gt;Parties at are house have always been friends and their<br/>\n </span></blockquote>families.&lt;&lt;<br/>\n<br/>\nParties at our house are sometimes friends and families and sometimes <br/>\nexclusively a small group of specially invited people - sometimes it <br/>\ndepends on finances and sometimes it depends on how much hoopla I feel like <br/>\ndealing with.<br/>\n<br/>\nMary - I don&#39;t know your kids, so there is NO insult intended here, but it <br/>\nsounds strange that they&#39;d so purposely exclude ONLY your son, when it is <br/>\napparent that there are enough people (adults and kids) who are already <br/>\nattending that one extra kid wouldn&#39;t matter.<br/>\n<br/>\nI&#39;d wonder why they are doing that.<br/>\n<br/>\nSurely they don&#39;t turn into jerks just this one time every year - so, if <br/>\nthey&#39;re generally jerks and not nice to kids, then I&#39;d consider backing off <br/>\nfrom having my OTHER kid there, either.<br/>\n<br/>\nIf they are NOT generally jerks, then I&#39;d consider whether there is a <br/>\nreason they don&#39;t want your son there. Maybe he did something at their <br/>\nhouse once and they&#39;re holding it against him. Maybe they have him over <br/>\nonly when someone has time to watch over him. Maybe you&#39;re seeing all the <br/>\nkids playing together but maybe, in fact, their kid has a big problem with <br/>\nyour son that you&#39;re not aware of.<br/>\n<br/>\nI mean - from what you&#39;re telling us - something isn&#39;t computing.<br/>\n<br/>\nA party for all girls - yeah - well - that stinks but people do get stuck <br/>\nin ruts and do that.<br/>\n<br/>\nI think you started out telling us that they were excluding him because <br/>\nhe&#39;s younger and that this was a party for only a certain age of kids. <br/>\nAgain, stinks but not uncommon - it is a way to limit the number of kids in <br/>\norder to limit the amount of hoopla (stress, space, hassle, money, etc) and <br/>\nalso because sometimes people want to do activities aimed at older kids and <br/>\ndon&#39;t want to have to make the accomodations to younger ones (watching over <br/>\nhow they use a hot glue gun, for example).<br/>\n<br/>\nA party for lots and lots and lots of friends and family of all ages where <br/>\none of five playmates gets very very specifically excluded? That is <br/>\npurposeful and there is a reason of some kind.<br/>\n<br/>\nPam Sorooshian<br/>\nNational Home Education Network<br/>\nwww.NHEN.org<br/>\nChanging the Way the World Sees Homeschooling<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2294225,"authorName":"freeform@juno.com","from":"freeform@...","profile":"freeform_ca","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] excluding Kids","postDate":"1039292563","msgId":11172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMjA3LjEyMzMzOS4tMzUyNTczLjAuZnJlZWZvcm1AanVuby5jb20+"},"prevInTopic":11170,"nextInTopic":11195,"prevInTime":11171,"nextInTime":11173,"topicId":11170,"numMessagesInTopic":0,"msgSnippet":"... left ... Well, FWIW, I m with you. And so is Rain. Two years ago, when she turned 8, she wanted to have a horseback-riding party. It was lovely, a trail","messageBody":"<div id=\"ygrps-yiv-183197458\">On Sat, 07 Dec 2002 10:16:44 -0800 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:maryfhickman@...\">maryfhickman@...</a>&gt; writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; It is  so<br/>\n&gt; terribly sad to see 1 kid of the gang of 5 who hang out together get <br/>\n </span></blockquote>left<br/>\n<blockquote><span title=\"ireply\"> &gt; behind. Kindness is something we continuely practice. <br/>\n<br/>\n </span></blockquote>Well, FWIW, I&#39;m with you. And so is Rain.<br/>\n<br/>\nTwo years ago, when she turned 8, she wanted to have a horseback-riding<br/>\nparty. It was lovely, a trail ride at Sunol Regional park for any bay<br/>\narea folks. They only had 10 horses available, though, so when we were<br/>\nplanning I was very clear with her that we couldn&#39;t invite all the little<br/>\nbrothers and sisters like we usually do. So we started making the list ,<br/>\nbut was adding two 4 year old little brothers. I reminded her that this<br/>\nparty had to just be for actual friends, and she puffed up and pointed<br/>\nout that &quot;Joe is not a Little Brother, Joe is a Friend, Too.&quot; And he is -<br/>\nthey play together, either with his older sister or just the two of them<br/>\nwhen she and Rain have a tiff. She&#39;s known him since he was 6 months old.<br/>\nAnd he&#39;ll be invited to her party next month...<br/>\n<br/>\nI agree that you can&#39;t control other people, which makes it hard. And it<br/>\nseems to me that most school-kid parties we&#39;ve been to run this way,<br/>\nwhile most homeschooler parties that we attend are for families. But<br/>\nsince Riley is a Friend Too, it does seem really rude.<br/>\n<br/>\nI guess I would talk to Ashley about how I thought it was rude, and offer<br/>\na special family event for your family at the same time as the party, and<br/>\nthen let her chose. And agree with Riley and Tessa that it sucks, and<br/>\nisn&#39;t nice. I just hate shit like this...<br/>\n<br/>\nDar</div>","specialLinks":[]},{"userId":117956499,"authorName":"maryfhickman@jps.net","from":"&lt;maryfhickman@...&gt;","profile":"mfhickman95616","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"excluding Kids","postDate":"1039285004","msgId":11170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNwcmluZ21haWwuMDk5NC4xMDM5Mjg1MDA0LjAuNDk1OTYwMDBAd2VibWFpbC5wYXMuZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":11172,"prevInTime":11169,"nextInTime":11171,"topicId":11170,"numMessagesInTopic":0,"msgSnippet":"Hi, Thanks for the comments. Tim, dh, feels very much the same as Sandra and Heidi. Riley gets to throw a fit each year and we get over it. It is so terribly","messageBody":"<div id=\"ygrps-yiv-2098917283\">Hi,<br/>\n<br/>\nThanks for the comments. Tim, dh, feels very much the same as Sandra and<br/>\nHeidi. Riley gets to throw a fit each year and we get over it. It is so<br/>\nterribly sad to see 1 kid of the gang of 5 who hang out together get left<br/>\nbehind. Kindness is something we continuely practice. The past three years the<br/>\nmom has had a clear cut, girls only. We respected this, let her know how sad<br/>\nRiley is to not be able to share in the festivities, and then helped him find<br/>\nanother activity. It&#39;s difficult. The party is going on right across the<br/>\nstreet. Boys, including Riley&#39;s buddies, are being invited. I need to help my<br/>\nolder child get ready for it, buy presents, etc. It is in our face for days.<br/>\nAll the other kids we play with are talking about it. Riley is the only one<br/>\nthe block not included. It sucks and he&#39;s passionate. He is learning to hate<br/>\npeople. When a mom is having 15 kids over 1 more or less really does not make<br/>\na difference. They want to make him feel better by giving him candy, when what<br/>\nhe truly wants is to be included. This year I did ask if the whole family was<br/>\ninvited or just Ashley. There will be more adults at this party than kids as<br/>\nthe family is large with active grand parents. It is a family party for those<br/>\nwho are blood family. I just do not get why the rest of our family does not<br/>\nget invited? It hurts, we will be sad, Riley will throw fits, now Tessa is<br/>\nthrowing them to. What words would you give these little ones to tell them,<br/>\nyes it&#39;s sad.People suck, but we still need to respect them. My kids do not<br/>\nrespect being left out. I&#39;m sorry. Truly no other activity will be equally<br/>\nexciting. What ever we do tonight from 5pm-9pm will be second for my son. He<br/>\nis learning discrimination, first by gender now by age.<br/>\n<br/>\nTo answer Heidi&#39;s question about other families calling to ask if their kids<br/>\ncould come too. Parties at are house have always been friends and their<br/>\nfamilies. I will always say yes if a brother or sister wants to join us. Moms<br/>\nand dads bring their kids over, they too usually stay and all ages have a<br/>\nblast together. We usually say sibs included on the invite. This type of drop<br/>\nyour kid off party is perpetuated from the schools where even in Kindergarden,<br/>\nlittle kids who hate being left without parents get dropped off at parties. <br/>\n<br/>\nWish us well as conjure up some exciting situation to keep our other 2 kids<br/>\nhappy. And tomorrow, I&#39;ll let you all know the outcome.<br/>\n<br/>\nMary H.</div>","specialLinks":[]}],"prevTopicId":11182,"nextTopicId":11185}}