{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":250343173,"authorName":"Tam","from":"&quot;Tam&quot; &lt;wifejuliefish@...&gt;","profile":"wifejuliefish","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Swearing/sexual content in gaming videos","postDate":"1367429287","msgId":71350,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtscmpiNyt0MjhyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPg=="},"prevInTopic":71344,"nextInTopic":0,"prevInTime":71349,"nextInTime":71351,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"I just wanted to thank people for helping me see this more clearly. After I posted the other night and the children were playing with my husband, I watched a","messageBody":"<div id=\"ygrps-yiv-544351927\">I just wanted to thank people for helping me see this more clearly. After I posted the other night and the children were playing with my husband, I watched a load of the videos that Virginia recommended, and realised that he is actually really funny and engaging. Finn came over to me when he finished what he was doing with Ben, and was so excited to see I was watching Pewdiepie that he actually squealed :) He asked if he could come and watch with me, and we watched and laughed together for the rest of the evening. It was like a barrier came down between us that I hadn&#39;t even realised that I&#39;d put there.<br/>\n<br/>\nWhile we were at the skate park this afternoon, Finn said to me, &quot;Do you know why I like watching Pewdiepie? I&#39;m making his life better just by watching. I watch and he makes me laugh, and he says that every view that he gets on his videos makes him happy. So when I watch lots of his videos, that makes him happy too so it gives him a better life.&quot; I thought what a sweet thought that was to have, and I think he probably wouldn&#39;t have shared that with me a couple of days before.<br/>\n<br/>\nWe&#39;ve got some wireless headphones on order (the last ones broke because the wire got tangled round his computer chair because he&#39;s rarely still while he watches and plays!) so that he can watch it in the evening while still being kind to Ben.<br/>\n<br/>\nTam</div>","specialLinks":[]},{"userId":342163414,"authorName":"Chris Sanders","from":"Chris Sanders &lt;iowaunschoolers@...&gt;","profile":"iaunschoolers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Swearing/sexual content in gaming videos","postDate":"1367332440","msgId":71344,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3MDUzNTUyLUJDNzgtNDMwQy1CN0NELTA1N0JGNjgyNDIxOUBnbWFpbC5jb20+","inReplyToHeader":"PEI4MkRFQUVFLUU1QTctNDM4Ni05M0MzLTBDMDVGQTJFMTkxOUBjb21jYXN0Lm5ldD4=","referencesHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPiA8Q0FMQmYzRVlPWT1KZU4xZkZwcUh3YWFoeGJjM29QWmZ0VStaeUVPLXpWdnJ1Qm9GK2ZRQG1haWwuZ21haWwuY29tPiA8QjgyREVBRUUtRTVBNy00Mzg2LTkzQzMtMEMwNUZBMkUxOTE5QGNvbWNhc3QubmV0Pg=="},"prevInTopic":71343,"nextInTopic":71350,"prevInTime":71343,"nextInTime":71345,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"We ve done this for our daughter, as well.  My first go-to movie guide website is www.kidsinmind.com, and if they don t have the movie I m looking for I check","messageBody":"<div id=\"ygrps-yiv-1874308479\">We&#39;ve done this for our daughter, as well.  My first go-to movie guide website is www.kidsinmind.com, and if they don&#39;t have the movie I&#39;m looking for I check IMDB.  Kidsinmind.com has very objective descriptions of the scenes with violence/gore, sexuality, profanity, and mature themes -- not sure those are the names of the categories.  The first couple of times I read at kidsinmind.com I was looking up Disney animated movies.  Reading objective descriptions of scenes that are written in a way so as to avoid too many spoilers can be a bit deceiving.  The scenes sound way worse than they actually are.  A scene that may take 30 seconds to read about may fly by on the screen in two seconds!  Keep that in mind.<br/>\n<br/>\nChris in IA<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 30, 2013, at 8:50 AM, Colleen wrote:<br/>\n<br/>\n&gt; ***this part I step in and say he can&#39;t watch those kinds and he will have the choice when he is old enough (PG-13) or for anything when he is on his own***<br/>\n&gt; <br/>\n&gt; A couple days ago, my husband wanted to watch The King&#39;s Speech.  When my 10 year old heard that it was based on a true story about a king in England he said he wanted to watch it too.  I looked it up and saw that it was rated &quot;R&quot; so I asked my son if he wanted to check out the IMDB website with me to read through the Parents Guide/Content Advisory information.  He&#39;s not a fan of bloody violence or &quot;that disgusting kissing stuff &quot; :-) so he was happy to see that this particular R-rating was entirely for language (lots of use of the &quot;F-word&quot;). </span></blockquote></div>","specialLinks":[]},{"userId":439465581,"authorName":"Colleen","from":"Colleen &lt;3potatoes@...&gt;","profile":"trespotatoes","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Swearing/sexual content in gaming videos","postDate":"1367329847","msgId":71343,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI4MkRFQUVFLUU1QTctNDM4Ni05M0MzLTBDMDVGQTJFMTkxOUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PENBTEJmM0VZT1k9SmVOMWZGcHFId2FhaHhiYzNvUFpmdFUrWnlFTy16VnZydUJvRitmUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPiA8Q0FMQmYzRVlPWT1KZU4xZkZwcUh3YWFoeGJjM29QWmZ0VStaeUVPLXpWdnJ1Qm9GK2ZRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":71338,"nextInTopic":71344,"prevInTime":71342,"nextInTime":71344,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"***this part I step in and say he can t watch those kinds and he will have the choice when he is old enough (PG-13) or for anything when he is on his own*** A","messageBody":"<div id=\"ygrps-yiv-259684450\">***this part I step in and say he can&#39;t watch those kinds and he will have the choice when he is old enough (PG-13) or for anything when he is on his own***<br/>\n<br/>\nA couple days ago, my husband wanted to watch The King&#39;s Speech.  When my 10 year old heard that it was based on a true story about a king in England he said he wanted to watch it too.  I looked it up and saw that it was rated &quot;R&quot; so I asked my son if he wanted to check out the IMDB website with me to read through the Parents Guide/Content Advisory information.  He&#39;s not a fan of bloody violence or &quot;that disgusting kissing stuff &quot; :-) so he was happy to see that this particular R-rating was entirely for language (lots of use of the &quot;F-word&quot;).  We all watched the movie together, pausing it once because he wanted to confirm that it really was based on a true story and he wanted to know how Queen Victoria was related to the king in the movie, and when it was over he said it was &quot;a good movie but it could have used more action.&quot;  :-)<br/>\n<br/>\nMy husband would also like to watch Die Hard again sometime soon - and it too is rated R.  Just as we did with The King&#39;s Speech, my son and I read through the Content Advisory together - and this time he decided he doesn&#39;t want to watch the movie, as it has too much violence and gore for his taste.  Mine too - if my husband watches it late one night after our son&#39;s asleep, I&#39;ll probably read a book or play Pocket Frogs instead of watching it with him :-)<br/>\n<br/>\nIf my husband and I decided *for* our son which movies he should watch, based on ratings that are issued by folks who don&#39;t know him and don&#39;t know what might bother him and what wouldn&#39;t, he would be missing out on the great experience of evaluating information and making decisions for himself based on who he is and what he likes (and doesn&#39;t like).  And having an arbitrary &quot;G or PG only&quot; Rule in our house would mean he&#39;d have missed out on First Knight, A Knight&#39;s Tale, The King&#39;s Speech, Star Wars: Revenge of the Sith… and so very many more movies that he&#39;s loved and that have led to lots of learning, connections, and fun :-)<br/>\n<br/>\nColleen</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Swearing/sexual content in gaming videos","postDate":"1367268162","msgId":71334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGQjQ5MTA0LTc5MkEtNDI0Ny1CQTVFLUM5QzYzRjkwODk3N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDAyQTdCN0M0LUVGRkUtNEE1MS1BNzEzLUQ5MTcxRUFDREU2OUB2ZXJpem9uLm5ldD4=","referencesHeader":"PENBTEJmM0VZT1k9SmVOMWZGcHFId2FhaHhiYzNvUFpmdFUrWnlFTy16VnZydUJvRitmUUBtYWlsLmdtYWlsLmNvbT4gPGtsbWcwdCtjaDFzQGVHcm91cHMuY29tPiA8MTM2NzI2MzQyMi43NzUyLllhaG9vTWFpbE5lb0B3ZWIxNzIxMDMubWFpbC5pcjIueWFob28uY29tPiA8MDJBN0I3QzQtRUZGRS00QTUxLUE3MTMtRDkxNzFFQUNERTY5QHZlcml6b24ubmV0Pg=="},"prevInTopic":71333,"nextInTopic":71336,"prevInTime":71333,"nextInTime":71335,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"... Better way of phrasing that: What is he doing that you re trying to help him see in a way that will help him be kinder or make more thoughtful choices? In","messageBody":"<div id=\"ygrps-yiv-905389489\">On Apr 29, 2013, at 4:27 PM, Joyce Fetteroll wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What is he doing that you&#39;re trying to help him change?<br/>\n<br/>\n </span></blockquote>Better way of phrasing that:<br/>\n<br/>\nWhat is he doing that you&#39;re trying to help him see in a way that will help him be kinder or make more thoughtful choices?<br/>\n<br/>\nIn this instance, there isn&#39;t anything. He&#39;s not hurting anyone. He&#39;s just waiting out a video. It *is* a kindness not to watch it when his dad&#39;s home since it&#39;s mom who is the driving force behind the unschooling. If he was curious why, you could explain, but understanding shouldn&#39;t be a prerequisite for being kind. Often we don&#39;t know why something bothers someone. If we want to be kind, knowing it&#39;s bothersome should be enough.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Swearing/sexual content in gaming videos","postDate":"1367267273","msgId":71333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyQTdCN0M0LUVGRkUtNEE1MS1BNzEzLUQ5MTcxRUFDREU2OUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDEzNjcyNjM0MjIuNzc1Mi5ZYWhvb01haWxOZW9Ad2ViMTcyMTAzLm1haWwuaXIyLnlhaG9vLmNvbT4=","referencesHeader":"PENBTEJmM0VZT1k9SmVOMWZGcHFId2FhaHhiYzNvUFpmdFUrWnlFTy16VnZydUJvRitmUUBtYWlsLmdtYWlsLmNvbT4gPGtsbWcwdCtjaDFzQGVHcm91cHMuY29tPiA8MTM2NzI2MzQyMi43NzUyLllhaG9vTWFpbE5lb0B3ZWIxNzIxMDMubWFpbC5pcjIueWFob28uY29tPg=="},"prevInTopic":71332,"nextInTopic":71334,"prevInTime":71332,"nextInTime":71334,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"... Explaining is better than rules, but what s the purpose of the explanation? What is he doing that you re trying to help him change? It s tempting to get","messageBody":"<div id=\"ygrps-yiv-1921846605\"><blockquote><span title=\"ireply\">&gt; ==Explaining *why* something is offensive to you (triggers your boundaries),<br/>\n&gt; or might likely be offensive to others, is much more helpful than any kind of<br/>\n&gt; blanket rule, or age related permission. ==<br/>\n<br/>\n </span></blockquote>Explaining is better than rules, but what&#39;s the purpose of the explanation? What is he doing that you&#39;re trying to help him change?<br/>\n<br/>\nIt&#39;s tempting to get &quot;this is disrespectful&quot; information into him, but at 7 what&#39;s he&#39;s doing isn&#39;t disrespecting anyone. He&#39;s probably tuning the jokes out, waiting for the stuff he thinks is funny.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":250343173,"authorName":"Tam","from":"Tam &lt;wifejuliefish@...&gt;","profile":"wifejuliefish","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Swearing/sexual content in gaming videos","postDate":"1367263422","msgId":71332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjcyNjM0MjIuNzc1Mi5ZYWhvb01haWxOZW9Ad2ViMTcyMTAzLm1haWwuaXIyLnlhaG9vLmNvbT4=","inReplyToHeader":"PGtsbWcwdCtjaDFzQGVHcm91cHMuY29tPg==","referencesHeader":"PENBTEJmM0VZT1k9SmVOMWZGcHFId2FhaHhiYzNvUFpmdFUrWnlFTy16VnZydUJvRitmUUBtYWlsLmdtYWlsLmNvbT4gPGtsbWcwdCtjaDFzQGVHcm91cHMuY29tPg=="},"prevInTopic":71331,"nextInTopic":71333,"prevInTime":71331,"nextInTime":71333,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"==Explaining *why* something is offensive to you (triggers your boundaries), or might likely be offensive to others, is much more helpful than any kind of","messageBody":"<div id=\"ygrps-yiv-104727784\">==Explaining *why* something is offensive to you (triggers your boundaries), or might likely be offensive to others, is much more helpful than any kind of blanket rule, or age related permission. ==<br/>\n<br/>\n<br/>\nAh yes. Although we don&#39;t do blanket rules or age-related permission for anything, I also hadn&#39;t done the first. I&#39;d held back from doing so because when it&#39;s something of his, I didn&#39;t want it to come over as denigrating something that was important to him, as though I&#39;d be diminishing it&#39;s worth. When I said to him I didn&#39;t like the bit of the video, even then I worried I&#39;d be doing that. I do explain, when relevant, why things might be offensive to others.<br/>\nNormally with anything that they are interested in, I&#39;m really interested and enjoy it too because they do. This is the first time I&#39;ve felt more like, I can see it&#39;s important to you so I&#39;ll support it, but I really don&#39;t like it. I&#39;m going to hunt out those videos Virginia mentioned in a minute and see if I can see what he&#39;s seeing :)<br/>\n<br/>\nTam<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Swearing/sexual content in gaming videos","postDate":"1367262045","msgId":71328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtsbWcwdCtjaDFzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBTEJmM0VZT1k9SmVOMWZGcHFId2FhaHhiYzNvUFpmdFUrWnlFTy16VnZydUJvRitmUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71327,"nextInTopic":71329,"prevInTime":71327,"nextInTime":71329,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"... Have a discuss with him and explain that as a parent, it is your responsibility to set boundaries but he has open choices in this and that but not the","messageBody":"<div id=\"ygrps-yiv-126831532\">====BUT - this part I step in and say he can&#39;t watch those kinds and he will have the choice when he is old enough (PG-13) or for anything when he is &quot;on his own.&quot;  .......  Swearing and whatnots, he is like a sponge so almost anything he takes in - he brings out intentionally or not.  Know your kids and it is ok to set boundaries with certain things.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>Have a discuss with him and explain that as a parent, it is your<br/>\nresponsibility to set boundaries but he has &quot;open&quot; choices in this and that but not the other things.  Again, rules are needed for some things but not with others for certain kids.  Violence, would not allow that for some kids I know but swearing is ok with others who know how to keep it separate.<br/>\n<br/>\nAnd keep an eye to make sure there are no &quot;hidden&quot; harm going on.  My son is actually the one who set boundaries with Cartoon Network and tells me when someone I don&#39;t allow is on and explain why channels are changed.<br/>\n======= <br/>\n<br/>\nHmm. Well I don&#39;t think this advice is very helpful for moving towards unschooling, even if it does seem to be working for an individual mom in her home. In this case I guess &quot;working&quot; means, Mom feels comfortable and secure. Not that feeling that way is a bad thing, but moving towards unschooling generally means self-questioning and often means a period of inner discomfort, the squirminess of change as it happens. <br/>\n<br/>\nOne of the fundamental practices in unschooling is living a life that is founded on principles rather than bringing rules, especially arbitrary ones, into the home. The last thing we have ever cared about over here is whether something is rated PG-13.<br/>\n<br/>\nThat doesn&#39;t mean that we aren&#39;t aware of the rules and laws that exist in the world - but telling a child that there are rules that he has to follow in the home, that you are defining and choosing, is a step away from unschooling.<br/>\n<br/>\nBoundaries are around yourself, your own comfort, not walls to put around someone else. Rather than lay down rules, combined with critical remarks that could be felt as put downs, it is better to help the kids understand where your boundaries are, and how to work with those.<br/>\n<br/>\nFor example, giving the child information about the principle of Courtesy - that repeating some of these words and phrases in company could offend or alarm people is helpful.<br/>\n<br/>\nI agree with the headphones idea - Jayn uses them, but it is mostly because she wants a sense of privacy. However the advantage for me is that I don&#39;t have to hear what is actually very repetitive stuff.<br/>\n<br/>\nJayn and I used to watch a lot more Family Guy than we do now. In fact I think we have seen almost all episodes. There is generally something to offend someone in every one. Much of it is kinky-sexual, especially in reference to the character Quagmire. Before Jayn understood the mechanisms of sex and intercourse (a conversation she initiated when she was ready) a lot of it went right by her. Sometimes she would ask what something meant, and I would say &quot;that&#39;s a sexual reference&quot; and she would just say &quot;OK&quot; and not want any more information.<br/>\n<br/>\nAt the end of that big talk, she said in a kind of light dawning way, &quot;Is that what Quagmire is always going on about?&quot;<br/>\n<br/>\nExplaining *why* something is offensive to you (triggers your boundaries), or might likely be offensive to others, is much more helpful than any kind of blanket rule, or age related permission. <br/>\n<br/>\nIt is also a lot more difficult, requires a lot more self-examination in preparation for that conversation, and a lot more emotional vulnerability. <br/>\n<br/>\nTalking about PG-13 could set up a situation where the child can hardly wait to be 13 to go hog wild and explore all this forbidden fruit. <br/>\n<br/>\nAs a general rule ;) elucidating the problem, and asking the child for ideas of their solution, is far more likely to generate solutions everyone can live with happily, than any kind of top-down dictate.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.robyncoburn.blogspot.com</div>","specialLinks":[]},{"userId":547671143,"authorName":"supermomblues","from":"&quot;supermomblues&quot; &lt;supermom2jakeandemmy@...&gt;","profile":"supermomblues","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Swearing/sexual content in gaming videos","postDate":"1367261993","msgId":71331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtsbWZ2OSthZDh2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPg=="},"prevInTopic":71329,"nextInTopic":71332,"prevInTime":71330,"nextInTime":71332,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"My son (5) watches a lot of Minecraft videos on youTube. Our favorite is Paul Soares Jr. (If you haven t seen his yet, I highly recommend him!) He is very","messageBody":"<div id=\"ygrps-yiv-1736858522\">My son (5) watches a lot of Minecraft videos on youTube. Our favorite is Paul Soares Jr. (If you haven&#39;t seen his yet, I highly recommend him!) He is very family friendly and even has some videos of him playing with his wife and kids. There are some people that he plays on a server (Minecrack) with that Jake wanted to watch videos from too. They used a lot of cursing on their own videos. Jake will ask me &quot;Momma, what does ______ mean?&quot; and I always explain it. I&#39;ve told him that other people use that language, but his father and I chose not to for ourselves (never actually telling him he can&#39;t). He watches them and learns a LOT from them (especially GenericB who does a lot of redstone work on his videos). <br/>\n<br/>\nSo, my point is this: the less of a deal it is to us, the less of a deal it is to them. The more emphasis we put on it, the more they will. In our house, words are just words. Some we chose to use, some we don&#39;t. But I always make sure that he knows the meaning of them, because if he DOES chose to say it, I at least want him to use it correctly!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Tam&quot; &lt;wifejuliefish@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hi, <br/>\n&gt; <br/>\n&gt; I&#39;m hoping for some perspective on how to handle a situation with some videos my seven year old is watching.<br/>\n&gt; <br/>\n&gt; He&#39;s been into YouTube videos of gamers and walkthroughs since he got into minecraft a good while ago. He tends to have a favourite youtuber who he&#39;ll watch almost exclusively for a couple of months and then move on. Some have more swearing in than others but that hasn&#39;t really been an issue as he&#39;s aware that swearing is offensive to most people especially from a child. More adult references have tended to just pass him by, or sometimes he&#39;s asked me what they mean and I&#39;ve explained.<br/>\n&gt; <br/>\n&gt; At the moment he&#39;s mostly watching a guy called Pewdiepie whose swearing is a lot more frequent and extreme, and there&#39;s also a fair bit of sexual reference and violence. There was some gameplay the other day where the guy was shouting, &quot;I&#39;m hitting her in the vagina!&quot; and then, &quot;I&#39;m f----- her up the a----&quot;. I commented that I thought this was really horrible and could we put something else on, he said to me it&#39;s ok that bit&#39;s gone now.<br/>\n&gt; <br/>\n&gt; We watch with him and/or are in the same room when he watches, and he&#39;s always been active in turning something off or coming to us if he&#39;s uncomfortable with it (usually if there&#39;s something he finds too scary like Amnesia), but this doesn&#39;t seem to bother him. He says he watches Pewdiepie because he finds him funny and he likes him because he found out how to &#39;favourite&#39; videos from one of his videos. My overriding feeling is that he just ignores/isn&#39;t really aware of the elements that I&#39;m uncomfortable with.  My husband doesn&#39;t like watching Finn watching this guy at all. We talked about it last night and were thinking that we&#39;d rather Finn continued to be comfortable making that kind of choice with us there, than feeling that a) we were disregarding his interest and b)  that the only way to watch was behind our backs somehow. I&#39;ve chatted with Finn this morning and explained to him that when Ben gets home from work he&#39;s finding it stressful for Finn to have Pewdiepie on, and Finn&#39;s said he&#39;ll watch in the day and watch/do other things in the evening so Ben&#39;s happier.<br/>\n&gt; <br/>\n&gt; I&#39;m a bit stuck and can&#39;t quite think through this. I obviously want to support him watching something that he&#39;s finding interesting and enjoyable, but the extremity of the things the guy says has thrown me a bit.<br/>\n&gt; <br/>\n&gt; Tam<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":250343173,"authorName":"Tam","from":"Tam &lt;wifejuliefish@...&gt;","profile":"wifejuliefish","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Swearing/sexual content in gaming videos","postDate":"1367258829","msgId":71329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjcyNTg4MjkuNDYxOTIuWWFob29NYWlsTmVvQHdlYjE3MjEwMy5tYWlsLmlyMi55YWhvby5jb20+","inReplyToHeader":"PENBS1g5OGZoT3BVcGJrcjF6cE5GVDRuWU5pcjl3aTRWeEw1TWdubUZtZWg1Z1BfXzJ3QUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPgk8MTM2NzI0MDM3My44OTMzNy5ZYWhvb01haWxOZW9Ad2ViMTgyMjAyLm1haWwuYmYxLnlhaG9vLmNvbT4JPEFGN0U0OTY4LTlCQjgtNEJDMy1CM0EyLUUwQkY1QjYwRUUwOUB5YWhvby5jby51az4gPENBS1g5OGZoT3BVcGJrcjF6cE5GVDRuWU5pcjl3aTRWeEw1TWdubUZtZWg1Z1BfXzJ3QUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":71328,"nextInTopic":71331,"prevInTime":71328,"nextInTime":71330,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"==We love Pewdiepie! He s actually a really sweet person. Try watching one or two of his Fridays with Pewdiepie , or his Draw My Life, and you might see him ","messageBody":"<div id=\"ygrps-yiv-1788391018\">==We love Pewdiepie!<br/>\nHe&#39;s actually a really sweet person. Try watching one or two of his<br/>\n&quot;Fridays with Pewdiepie&quot;, or his Draw My Life, and you might see him<br/>\ndifferently.==<br/>\n<br/>\nI will; I&#39;ve watched quite a lot with Finn but I do wonder whether I&#39;m missing something as I&#39;m not seeing what he&#39;s seeing.  <br/>\n<br/>\n==About explaining jokes with sexual content: I&#39;ve noticed that frequently<br/>\n&quot;It&#39;s a sex thing&quot; is all the explanation my kids require. They&#39;re asking<br/>\nbecause they want to know why the joke didn&#39;t make any sense to them, not<br/>\nbecause they&#39;re especially interested in sex.==<br/>\n<br/>\nAh ok, hadn&#39;t thought of that, feel a bit daft that I hadn&#39;t!<br/>\n<br/>\n<br/>\n==My kids are 6 and 8. They have been watching Pewdiepie for years. They do<br/>\nnot swear at people. They will swear at each other when they are playing<br/>\nfighting games, but that&#39;s them experimenting with &quot;talking shit&quot;.==<br/>\n<br/>\nYeah Finn&#39;s pretty good with that too, he has watched lots of videos with swearing in for the last couple of years, he swears a bit when he&#39;s playing games but not out and about (unless the odd word slips out which has occasionally!). Rather than being worried about him swearing more from these videos, I think I was worried that the context of it was going to somehow disturb him. <br/>\n<br/>\n==Kids are really, really good at distinguishing fantasy from reality. Much<br/>\nbetter, on average, than adults, I think.==<br/>\n<br/>\nYes. That&#39;s what I was forgetting I think.<br/>\nThanks.<br/>\n<br/>\nTam<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":254796796,"authorName":"Virginia Warren","from":"Virginia Warren &lt;vafnord@...&gt;","profile":"vafnord","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Swearing/sexual content in gaming videos","postDate":"1367253115","msgId":71327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBS1g5OGZoT3BVcGJrcjF6cE5GVDRuWU5pcjl3aTRWeEw1TWdubUZtZWg1Z1BfXzJ3QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFGN0U0OTY4LTlCQjgtNEJDMy1CM0EyLUUwQkY1QjYwRUUwOUB5YWhvby5jby51az4=","referencesHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPgk8MTM2NzI0MDM3My44OTMzNy5ZYWhvb01haWxOZW9Ad2ViMTgyMjAyLm1haWwuYmYxLnlhaG9vLmNvbT4JPEFGN0U0OTY4LTlCQjgtNEJDMy1CM0EyLUUwQkY1QjYwRUUwOUB5YWhvby5jby51az4="},"prevInTopic":71326,"nextInTopic":71328,"prevInTime":71326,"nextInTime":71328,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"We love Pewdiepie! He s actually a really sweet person. Try watching one or two of his Fridays with Pewdiepie , or his Draw My Life, and you might see him ","messageBody":"<div id=\"ygrps-yiv-1365996900\">We love Pewdiepie!<br/>\n<br/>\nHe&#39;s actually a really sweet person. Try watching one or two of his<br/>\n&quot;Fridays with Pewdiepie&quot;, or his Draw My Life, and you might see him<br/>\ndifferently.<br/>\n<br/>\nAbout explaining jokes with sexual content: I&#39;ve noticed that frequently<br/>\n&quot;It&#39;s a sex thing&quot; is all the explanation my kids require. They&#39;re asking<br/>\nbecause they want to know why the joke didn&#39;t make any sense to them, not<br/>\nbecause they&#39;re especially interested in sex.<br/>\n<br/>\nMy kids are 6 and 8. They have been watching Pewdiepie for years. They do<br/>\nnot swear at people. They will swear at each other when they are playing<br/>\nfighting games, but that&#39;s them experimenting with &quot;talking shit&quot;.<br/>\n<br/>\nKids are really, really good at distinguishing fantasy from reality. Much<br/>\nbetter, on average, than adults, I think.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":310848040,"authorName":"Ali Zeljo","from":"Ali Zeljo &lt;azeljo@...&gt;","profile":"azeljo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Swearing/sexual content in gaming videos","postDate":"1367243710","msgId":71338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBMjlEMzAxLTg2RDgtNEVBNC1BNzMzLTFDMEU3MkY5OTAzREBnbWFpbC5jb20+","inReplyToHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPg==","referencesHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPg=="},"prevInTopic":71337,"nextInTopic":71343,"prevInTime":71337,"nextInTime":71339,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"Thank you for posting this!  I am very interested in responses.  I have the exact same thing in my house.  Except it sounds like your son doesn t swear","messageBody":"<div id=\"ygrps-yiv-2123140695\">Thank you for posting this!  I am very interested in responses.  I have the exact same thing in my house.  Except it sounds like your son doesn&#39;t swear himself.   I have four kids and all four love to watch YouTube minecraft videos, even my two year old!  <br/>\n<br/>\nSwearing is a very interesting topic for me.  My children have gone through phases where they are fascinated with swear words.  This is a hard one for me because I tend to not give those words power to offend me, though I know that many adults in society do.  I have explained this to all my children so that they understand that if they use swear words, there is a good chance it will upset other parents and even other children.  They all understand it at different levels.  But they all LOVE to use these words at home, and often with friends.  The words DO feel powerful, and certain words are SO offensive to people, especially when used as insults- so I think it feels powerful to mimic phrases they are learning from MC videos.<br/>\n<br/>\nBefore YouTube minecraft videos, the kids mainly used &quot;damn!&quot; or &quot;shit&quot; which they picked up from me I think.  The occasional F-word or A-word.  But since Minecraft videos, the language now includes every swear word on earth.  Minecrafters often use the vulgar words for vagina.<br/>\n<br/>\nMy four year old responds similarly to your son.  My husband is also extremely uncomfortable with him watching the videos with swearing.  He (my husband) has asked him to please change the video because the swearing is upsetting him, and G says, Dad, I&#39;ll turn down the volume when he swears, I really need to see this mod, or I can&#39;t turn it off, he&#39;s about to explain how to do something!  Can you go in a different room?   He seems to be unaffected by the swearing, as he is focusing on the content.  Yet he is definitely learning the swear words and how to use them because when he is playing multiplayer, he has sworn at the screen, calling a player a &quot;dick&quot; for being a f****ing hacker, terminology that comes directly from videos.  I do explain to him that when people hear those words coming from a young child they are likely to get very upset.  I have given him a list of okay words to use publicly when expressing shock or frustration, etc.  We love the words used by Captain Haddock in Tintin comic books- billions of blue barnacles!  He often chooses to say oh Fudge!  But he still sometimes does choose to swear.  And it doesn&#39;t bother me because I am just not offended by it.  I do wish he didn&#39;t know the more vulgar words like pus*y because the depth of offensiveness could be worse.  I see my job as to keep him aware when he uses the words and suggest alternatives.  Swearing can become an embarrassing habit.  <br/>\n<br/>\nMy older two kids (13,9) actually find the swearing of interest in the videos.  They sometimes laugh out loud at the extreme swearing or creative swearing.  They both understand that using those words offends people.  But they love to use the words among themselves and within certain groups of friends.  I feel an unease about it, and I talk to them about my concerns.  A main concern is that using these words a lot becomes habitual and even though they aim to be private about it, they are sometimes overheard.  Then they need to deal with the consequences- which are that they have offended someone, or that they are creating an image of themselves as &quot;kids who swear&quot; in the neighborhood.  Some children are not allowed to play with certain kids we know who use F-words at the park a lot.  My kids love to gather neighborhood kids for kickball games.  Do they want parents to see them as offensive swearing kids when they come to ask to play ball?  <br/>\n<br/>\nI suppose the main issue with young children hearing older Minecrafters swearing is that it comes out so naturally and starts to seem normal.  Young kids with limited life experience may not have heard enough to even notice that it is different from &quot;acceptable&quot; conversation.  Some kids may be ignoring audio and just soaking in the visual, but if your kid, like mine, is soaking in and mimicking the audio as well- then it is an opportunity for learning about language and choice of words, and being mindful about the words you choose and mindful of your audience.  It has been a big learning experience for my four year old.  He knows which Youtubers swear and which do not.  He also knows that swearing is often against the rules on many servers, including our own server.  He recognizes the spelling of many swear words and moderates others&#39; use by kicking or banning.  He also sometimes types swear words into chats and gets kicked or banned himself.   <br/>\n<br/>\nIt isn&#39;t what I envisioned when choosing to unschool- that we would spend months on end focused on swear words.  But it is language, playing with language, learning the power of words and power of choice.  A very important and useful topic!<br/>\n<br/>\nWarmly,<br/>\nAli</div>","specialLinks":[]},{"userId":250343173,"authorName":"Tam","from":"Tam &lt;wifejuliefish@...&gt;","profile":"wifejuliefish","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Swearing/sexual content in gaming videos","postDate":"1367241765","msgId":71326,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFGN0U0OTY4LTlCQjgtNEJDMy1CM0EyLUUwQkY1QjYwRUUwOUB5YWhvby5jby51az4=","inReplyToHeader":"PDEzNjcyNDAzNzMuODkzMzcuWWFob29NYWlsTmVvQHdlYjE4MjIwMi5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPiA8MTM2NzI0MDM3My44OTMzNy5ZYWhvb01haWxOZW9Ad2ViMTgyMjAyLm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":71325,"nextInTopic":71327,"prevInTime":71325,"nextInTime":71327,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"Ah yes he does normally have headphones but they broke, I d forgotten actually, I ll get him some more. Yes he likes yogscast and they were his favourite","messageBody":"<div id=\"ygrps-yiv-1959365471\">Ah yes he does normally have headphones but they broke, I&#39;d forgotten actually, I&#39;ll get him some more.<br/>\n<br/>\nYes he likes yogscast and they were his favourite before Pewdiepie, then nerd cubed before that and chimney swift before that. I&#39;ve sent him a couple I thought he might find funny and he did but still prefers Pewdiepie at the moment.<br/>\n<br/>\nHe&#39;s 7, mostly it does go over his head unless he asks me to explain a phrase. <br/>\n<br/>\nI think I was ascribing more power to the things on the videos than they actually have. He&#39;s always been fine with deciding his own comfort level with other things (zombies, horror, swearing, etc) I&#39;m not sure why I felt this could be any different, I don&#39;t think it is. Oh actually now I think about it I wonder if it&#39;s because it&#39;s phrases that butt up against my own comfort barrier (for me) whereas the things we&#39;ve come across before aren&#39;t. <br/>\n<br/>\nTam<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 29 Apr 2013, at 13:59, BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a>&gt; wrote:<br/>\n<br/>\n&gt; Can he used headphones if it bother you and his dad?<br/>\n&gt; Pewdiepie is funny.<br/>\n&gt; I personally like Simon and Lewis ( Yogscast). They swear too  but no real sexual talk and they are very funny. I just like them.<br/>\n&gt; I do not know how old Finn is but I have a ten year old and he pretty gets the sexual stuff and has come to me when he was disturbed by something. His sister is 7 and for her  it goes right over her head still.<br/>\n&gt; <br/>\n&gt; There are so many funny Minecraft videos on YouTube. Maybe find some other funny ones to share with him. He may like those better than Pewdiepie!<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; Alex Polikowsky<br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt;  <br/>\n&gt; .uk&gt;<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Swearing/sexual content in gaming videos","postDate":"1367241717","msgId":71325,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjcyNDE3MTcuNjYxMzguWWFob29NYWlsTmVvQHdlYjE4MjIwNS5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PENBTEJmM0VZT1k9SmVOMWZGcHFId2FhaHhiYzNvUFpmdFUrWnlFTy16VnZydUJvRitmUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPiA8Q0FMQmYzRVlPWT1KZU4xZkZwcUh3YWFoeGJjM29QWmZ0VStaeUVPLXpWdnJ1Qm9GK2ZRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":71324,"nextInTopic":71326,"prevInTime":71324,"nextInTime":71326,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"  Alex Polikowsky     When I was a kid, it waseasier but nowadays more people turn those into reality or make them appear to so I prefer him not to","messageBody":"<div id=\"ygrps-yiv-192606689\"> <br/>\nAlex Polikowsky<br/>\n <br/>\n&quot;  When I was a kid, it waseasier but nowadays more people turn those into reality or make them appear<br/>\nto so I prefer him not to seeing. So many kids out there take those stuff<br/>\nas a joke.&quot;<br/>\n<br/>\n<br/>\n Turn Minecraft videos into reality? Make them appear reality?<br/>\nSure there are some real good stuff like:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=8uyxVmdaJ-w\">http://www.youtube.com/watch?v=8uyxVmdaJ-w</a><br/>\n<br/>\n<br/>\nPretty awesome stuff!<br/>\n<br/>\nJoke? Yes many are a joke. It is Minecraft! kids know it is not real.<br/>\n<br/>\nTelling your child that some kids can handle something but they cannot seems cruel to me. <br/>\nWhy not explain to him that swearing is appropriate in some instances and not others and help him with that?<br/>\nI have done that with my children and they are pretty good at it ( some funny minor slip here or there).<br/>\n<br/>\nDo you think children cannot differentiate  blood in games/videos ( pixels really) from real blood?<br/>\nMy daughter has been playing:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=MIem6vS6u3g\">http://www.youtube.com/watch?v=MIem6vS6u3g</a><br/>\n<br/>\n<br/>\nSince she was 5! The blood bothers me but it does not bother her. Now yesterday she saw a lot of blood while my husband was treating a cow and that did bother her because it was real blood and she could not even look at it.<br/>\nGuess what? kids know the difference!<br/>\n<br/>\nIf a child really wants to see something that parent has prohibited that child will sneak. If that bothers the child then she will not be able to come to the parent for answers/help. If something bothers the child they will not want to see it. You can help the child avoid it!<br/>\n<br/>\nI have told my kids something on a movie will probably bother them and they would not like it and they have trusted me and everytime so far they have not wanted to watch it. I am sure they will push their limits when they feel ready and I can help them because they know I am there to help and not to tell them they are not capable and prohibit them.<br/>\n<br/>\n Mostly that is with movies that look way more real then any gaming ( Specially Minecraft) video on YouTube!!<br/>\n<br/>\nHere is something Deb Lewis wrote on Violence and TV and you can use it for video games and watching YouTube:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/violence\">http://sandradodd.com/t/violence</a><br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/8uyxVmdaJ-w?wmode=opaque","type":"VIDEO"},{"url":"http://www.youtube.com/embed/MIem6vS6u3g?wmode=opaque","type":"VIDEO"}]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Swearing/sexual content in gaming videos","postDate":"1367240373","msgId":71324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjcyNDAzNzMuODkzMzcuWWFob29NYWlsTmVvQHdlYjE4MjIwMi5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPg==","referencesHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPg=="},"prevInTopic":71321,"nextInTopic":71325,"prevInTime":71321,"nextInTime":71325,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"Can he used headphones if it bother you and his dad? Pewdiepie is funny. I personally like Simon and Lewis ( Yogscast). They swear too  but no real sexual","messageBody":"<div id=\"ygrps-yiv-1982549715\">Can he used headphones if it bother you and his dad?<br/>\nPewdiepie is funny.<br/>\nI personally like Simon and Lewis ( Yogscast). They swear too  but no real sexual talk and they are very funny. I just like them.<br/>\nI do not know how old Finn is but I have a ten year old and he pretty gets the sexual stuff and has come to me when he was disturbed by something. His sister is 7 and for her  it goes right over her head still.<br/>\n<br/>\nThere are so many funny Minecraft videos on YouTube. Maybe find some other funny ones to share with him. He may like those better than Pewdiepie!<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n.uk&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Swearing/sexual content in gaming videos","postDate":"1367234801","msgId":71337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5REYzOEUxLUI4NEEtNDU0Ny1CNzAxLTBFRTVBNzE4OUVGN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBTEJmM0VZT1k9SmVOMWZGcHFId2FhaHhiYzNvUFpmdFUrWnlFTy16VnZydUJvRitmUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPiA8Q0FMQmYzRVlPWT1KZU4xZkZwcUh3YWFoeGJjM29QWmZ0VStaeUVPLXpWdnJ1Qm9GK2ZRQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":71336,"nextInTopic":71338,"prevInTime":71336,"nextInTime":71338,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"-=- So many kids out there take those stuff as a joke.-=- If it s not deadly serious and if it s not aimed at an individual in a threatening way, then it","messageBody":"<div id=\"ygrps-yiv-1874977179\">-=- So many kids out there take those stuff<br/>\nas a joke.-=-<br/>\n<br/>\nIf it&#39;s not deadly serious and if it&#39;s not aimed at an individual in a threatening way, then it probably IS a joke.<br/>\n<br/>\n-=- On the other hand, violence like on Skylanders (no blood or anything) or through some comics, I allow him to. -=-<br/>\n<br/>\nThere is not real violence in video games or comics.<br/>\nThere is no blood.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/violence\">http://sandradodd.com/violence</a><br/>\n<br/>\n-=-Again, rules are needed for some things but not<br/>\nwith others for certain kids. Violence, would not allow that for some kids<br/>\nI know but swearing is ok with others who know how to keep it separate.-=-<br/>\n<br/>\nYou didn&#39;t say how old the child is for whom you&#39;re making rules.   It is possible to consider WHY you&#39;re concerned, and to express that concern to your child in a persuasive way without having a rule.  <br/>\n<br/>\nIt&#39;s not a good unschooling principle that &quot;rules are needed.&quot;  <br/>\n<br/>\n-=-And keep an eye to make sure there are no &quot;hidden&quot; harm going on.-=-<br/>\n<br/>\nThere is hidden harm in arbitrary limitations and unexamined fears.  There is hidden harm in rules.<br/>\n<br/>\n-=-My son<br/>\nis actually the one who set boundaries with Cartoon Network and tells me<br/>\nwhen someone I don&#39;t allow is on and explain why channels are changed.-=-<br/>\n<br/>\nIf there are people/characters you don&#39;t allow, then your son is not setting boundaries.  He is following your rules.  <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Swearing/sexual content in gaming videos","postDate":"1367233778","msgId":71336,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4MEY4NEMyLTA0MjEtNDg0My04N0MzLTExRjFGM0NCNUY2MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPg==","referencesHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPg=="},"prevInTopic":71334,"nextInTopic":71337,"prevInTime":71335,"nextInTime":71337,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"-=-I m a bit stuck and can t quite think through this. I obviously want to support him watching something that he s finding interesting and enjoyable, but the","messageBody":"<div id=\"ygrps-yiv-1253437834\">-=-I&#39;m a bit stuck and can&#39;t quite think through this. I obviously want to support him watching something that he&#39;s finding interesting and enjoyable, but the extremity of the things the guy says has thrown me a bit.-=-<br/>\n<br/>\nWhen things like that happened with my boys, I told them that sometimes schoolkids use bad language whenever they can, because they get in trouble for it at home or at school and so they go crazy with it to impress other kids their age.     I would cringe or show in some natural way that it seemed nastier or ruder than I was comfortable with, but they knew that it was rude for rude&#39;s sake.  <br/>\n<br/>\nHolly hangs out with punk rock musucians, and lots of them write comically rude songs.  Really rude, and kind of stupid.  It&#39;s an art unto itself, but none of those guys are the least bit tacky or rude when they&#39;re over for a games night at our house, or when they&#39;re in public places and not performing.  <br/>\n<br/>\nI think asking him to use headphones, or not to watch it when his dad&#39;s around, isn&#39;t at all a bad thing.  You&#39;re not asking him to be sneaky.  You&#39;re asking him to be courteous.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":250343173,"authorName":"Tam","from":"&quot;Tam&quot; &lt;wifejuliefish@...&gt;","profile":"wifejuliefish","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Swearing/sexual content in gaming videos","postDate":"1367222423","msgId":71321,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtsbDlhbitoa3NkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":71324,"prevInTime":71320,"nextInTime":71324,"topicId":71321,"numMessagesInTopic":0,"msgSnippet":"Hi, I m hoping for some perspective on how to handle a situation with some videos my seven year old is watching. He s been into YouTube videos of gamers and","messageBody":"<div id=\"ygrps-yiv-550703908\">Hi, <br/>\n<br/>\nI&#39;m hoping for some perspective on how to handle a situation with some videos my seven year old is watching.<br/>\n<br/>\nHe&#39;s been into YouTube videos of gamers and walkthroughs since he got into minecraft a good while ago. He tends to have a favourite youtuber who he&#39;ll watch almost exclusively for a couple of months and then move on. Some have more swearing in than others but that hasn&#39;t really been an issue as he&#39;s aware that swearing is offensive to most people especially from a child. More adult references have tended to just pass him by, or sometimes he&#39;s asked me what they mean and I&#39;ve explained.<br/>\n<br/>\nAt the moment he&#39;s mostly watching a guy called Pewdiepie whose swearing is a lot more frequent and extreme, and there&#39;s also a fair bit of sexual reference and violence. There was some gameplay the other day where the guy was shouting, &quot;I&#39;m hitting her in the vagina!&quot; and then, &quot;I&#39;m f----- her up the a----&quot;. I commented that I thought this was really horrible and could we put something else on, he said to me it&#39;s ok that bit&#39;s gone now.<br/>\n<br/>\nWe watch with him and/or are in the same room when he watches, and he&#39;s always been active in turning something off or coming to us if he&#39;s uncomfortable with it (usually if there&#39;s something he finds too scary like Amnesia), but this doesn&#39;t seem to bother him. He says he watches Pewdiepie because he finds him funny and he likes him because he found out how to &#39;favourite&#39; videos from one of his videos. My overriding feeling is that he just ignores/isn&#39;t really aware of the elements that I&#39;m uncomfortable with.  My husband doesn&#39;t like watching Finn watching this guy at all. We talked about it last night and were thinking that we&#39;d rather Finn continued to be comfortable making that kind of choice with us there, than feeling that a) we were disregarding his interest and b)  that the only way to watch was behind our backs somehow. I&#39;ve chatted with Finn this morning and explained to him that when Ben gets home from work he&#39;s finding it stressful for Finn to have Pewdiepie on, and Finn&#39;s said he&#39;ll watch in the day and watch/do other things in the evening so Ben&#39;s happier.<br/>\n<br/>\nI&#39;m a bit stuck and can&#39;t quite think through this. I obviously want to support him watching something that he&#39;s finding interesting and enjoyable, but the extremity of the things the guy says has thrown me a bit.<br/>\n<br/>\nTam</div>","specialLinks":[]}],"prevTopicId":71317,"nextTopicId":71345}}