{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Re : [AlwaysLearning] Re: interesting issue; please advise","postDate":"1260290046","msgId":49042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFODE0RERCLUI5RjctNDM2My05OTI5LUY2NTI3QzNCQjc4QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhmbHU0ZStvM245QGVHcm91cHMuY29tPg==","referencesHeader":"PGhmbHU0ZStvM245QGVHcm91cHMuY29tPg=="},"prevInTopic":49040,"nextInTopic":0,"prevInTime":49041,"nextInTime":49043,"topicId":48901,"numMessagesInTopic":0,"msgSnippet":"-=- My husband, who is German, went to university (ecole de commerce, actually, for those who understand the system) in France and was appalled that there was","messageBody":"<div id=\"ygrps-yiv-1622897231\">-=- My husband, who is German, went to university (ecole de commerce,  <br/>\nactually, for those who understand the system) in France and was  <br/>\nappalled that there was no dialog in class, the French students never  <br/>\nquestioned what the prof said. I think that might be why French  <br/>\nparents feel like they need to do exactly what a book says must be  <br/>\ndone, without thinking much about how and where it applies to their  <br/>\nreal life and children.-=-<br/>\n<br/>\nThe whole purpose of a discussion list like this is to really examine  <br/>\nideas from all angles, and to tweak and improve them when we can, and  <br/>\nto find the exceptions.<br/>\n<br/>\nIn a discussion like these on AlwaysLearning, each person who&#39;s  <br/>\ninterested in any thread can learn things to connect to what he or she  <br/>\nis already thinking or knowing, or can look at it as &quot;Good.  Knew  <br/>\nthat.&quot;  or &quot;Confirms what I thought,&quot; and that&#39;s learning too; it&#39;s  <br/>\nreinforcement of belief, maybe.<br/>\n<br/>\nI didn&#39;t write a &quot;how to&quot; about unschooling because there isn&#39;t a how  <br/>\nto that doesn&#39;t involve the reader/unschooler and what she knows,  <br/>\nlikes and does.  We can&#39;t tell anyone how to unschool, we can only  <br/>\nhelp them become the kind of people who can be unschooling parents.<br/>\n<br/>\nIf ANY other club, method or belief system has given an individual  <br/>\nparent tools she or he can use to be a better unschooling parent,  <br/>\nthat&#39;s great.  Some people remember one particular teacher who was  <br/>\npatient and enthusiastic and sometimes they try to be that way with  <br/>\ntheir kids.  Some people remember a great summer where they learned a  <br/>\nlot about nature, and they try to work some of those opportunities  <br/>\nin.   That&#39;s why people say &quot;unschooling is different in every  <br/>\nfamily.&quot;  Or that&#39;s why they should say it. &lt;bwg&gt;  Sometimes they say  <br/>\nit to justify lazy, lame parenting.<br/>\n<br/>\nSo where was I?  Sorry.<br/>\n<br/>\nIf Bea&#39;s right and there is a tradition in France of choosing a  <br/>\nprofessor/teacher/leader and then following his advice to the letter,  <br/>\nthen I can see why they would villify some books and glorify others.    <br/>\nAnd if a group has moved from one extreme to another, the desire to  <br/>\njettison the name of the old group, their meeting place, all their  <br/>\nbooks and their team colors might be natural, but it might not be  <br/>\nhealthy.<br/>\n<br/>\nIf I&#39;m playing American football (anyone who knows me knows I&#39;m not,  <br/>\nand haven&#39;t since we were little kids playing flag football in the  <br/>\nyard at with the neighbors)... if I&#39;m playing football and I abruptly  <br/>\nchange sports and decide to play rugby, a lot of things will be  <br/>\ndifferent.  But if I am in a reactionary mode and say EVERYthing is  <br/>\ndifferent now, and I say &quot;football players drink water between plays,  <br/>\nand I&#39;m not a football player, so I&#39;m not going to drink water,&quot; or  <br/>\n&quot;football players do this particular stretch before they play, and I&#39;m  <br/>\nplaying a different sport now, so I will never do that stretch again,&quot;  <br/>\nthat&#39;s being reactionary rather than rational.  That&#39;s being emotional  <br/>\nrather than logical.<br/>\n<br/>\nI&#39;ve seen unschoolers declare with feeling that their kids will NEVER  <br/>\nhave to learn/do/be this or that that the parents associated with  <br/>\nschool.  Standing in line, or taking a test, or being with kids they  <br/>\ndon&#39;t like.  But the parents have gone too far sometimes.   One mother  <br/>\nsaid that critical thinking was something they taught in school, and  <br/>\nshe was really angry that she had been asked to think critically about  <br/>\nthings in a homeschooling forum.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":130027733,"authorName":"Bea","from":"&quot;Bea&quot; &lt;bmantovani@...&gt;","profile":"bmantovani","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re : [AlwaysLearning] Re: interesting issue; please advise","postDate":"1260288974","msgId":49040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhmbHU0ZStvM245QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzODUyOC4yMjUwNy5xbUB3ZWIyNjUwMi5tYWlsLnVrbC55YWhvby5jb20+"},"prevInTopic":49034,"nextInTopic":49042,"prevInTime":49039,"nextInTime":49041,"topicId":48901,"numMessagesInTopic":0,"msgSnippet":"... A lot of people do not realize their lives are complicated, not peaceful, etc.  Also, a lot of people s lives would be even worse without those books ;-) ","messageBody":"<div id=\"ygrps-yiv-1186838550\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Valentine &lt;matsacha33@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; If somebody thinks NVC or another book helpedï¿½having a better relationships with their children, good for them. But why defend these books if you don&#39;t like that much your life with your kids, if your kids do not look very happy, if they&#39;re not peaceful, if many aspects of your life are complicated...? It&#39;s mysteryï¿½to me. <br/>\n&gt; ï¿½<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>A lot of people do not realize their lives are complicated, not peaceful, etc.  Also, a lot of people&#39;s lives would be even worse without those books ;-)<br/>\n<br/>\nBeing French myself, I think there is even more of a need for deschooling in France than there is in the US.  Schools in France are even more about rote memorization and &quot;do as you are told&quot; than in the English speaking world.  My husband, who is German, went to university (ecole de commerce, actually, for those who understand the system) in France and was appalled that there was no dialog in class, the French students never questioned what the prof said.  I think that might be why French parents feel like they need to do exactly what a book says must be done, without thinking much about how and where it applies to their real life and children.<br/>\n<br/>\nBea</div>","specialLinks":[]},{"userId":242590232,"authorName":"Valentine","from":"Valentine &lt;matsacha33@...&gt;","profile":"matsacha33","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re : [AlwaysLearning] Re: interesting issue; please advise","postDate":"1260280684","msgId":49034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzODUyOC4yMjUwNy5xbUB3ZWIyNjUwMi5tYWlsLnVrbC55YWhvby5jb20+"},"prevInTopic":48933,"nextInTopic":49040,"prevInTime":49033,"nextInTime":49035,"topicId":48901,"numMessagesInTopic":0,"msgSnippet":"It s not that I don t want to discuss it, it s that there s no ...   It was my post sandra was talking about! Sorry for that.   In French, this passage","messageBody":"<div id=\"ygrps-yiv-1869879644\">It&#39;s not that I don&#39;t want to discuss it, it&#39;s that there&#39;s no <br/>\n<blockquote><span title=\"ireply\"> &gt; advantage to someone bringing a quote from a book that&#39;s never <br/>\n&gt; recommended for unschoolers and asking us what we think. I neither <br/>\n&gt; want to critique nor defend passages from books.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n </span></blockquote> <br/>\nIt was my post sandra was talking about! Sorry for that.<br/>\n <br/>\nIn French, this passage sounds terrible (to me at least!) and after the talk about faber and mazlich, i was just wondering if it could be a problem of translation.<br/>\nAlso, in our local parenting group which became a homeschooling group, rosenberg, gordon, and faber and mazlich were of great influence. <br/>\nAt first, this influence seemed really positive but now i can say it&#39;s been more negative than anything else.<br/>\nIt would be very long to describe but it&#39;s like it complicated everything. It was really disempowering as it gave the impression we needed a method to do better. It was also recommended to follow workshops.<br/>\nI know it&#39;s what we made of the books and it does not necessarily mean the books are awful.<br/>\nBut it&#39;s weird that people can spend a lot of energy defending these books even though their family life is far from peaceful. And they say &quot;well, it&#39;s just that I can&#39;t apply properly what the authors say but NVC is still a great thing&quot;, or they don&#39;t even realize things can be simpler, more peaceful. <br/>\nReading Rue Kream, John Holt, and Sandra Dodd has really been great for me so I tell friends about it and lend them the books (and I wish your books were translated into French Sandra). But if they don&#39;t like it, no big deal, I&#39;m not going to argue and try to convince them. I just know how it helped me and how life is so much better right now. It&#39;s all that counts.<br/>\nIf somebody thinks NVC or another book helped having a better relationships with their children, good for them. But why defend these books if you don&#39;t like that much your life with your kids, if your kids do not look very happy, if they&#39;re not peaceful, if many aspects of your life are complicated...? It&#39;s mystery to me. <br/>\n <br/>\nAnd it does not affect my life right now but it did affect it because people kept using these books, promoting it without saying (or not realizing?) it had done no real good in their lifes. I found out that later when I got to know them better. <br/>\nI was lucky enough to be told about Sandra&#39;s website quite early, and lucky to read English too. Unfortunately, a lot of parents I know can&#39;t read English.<br/>\n <br/>\nI realized things could be simple, not always easy but so much simpler. I enjoyed more and more my life with my kids, and (re)discovered it could be fun to learn. I&#39;ll always remember one of the first advice that went right through my heart and started it all, it was something called &quot;it only takes a second to Do better&quot; on the parenting peacefully page. Waouh, so simple, so true. I turned off the computer and went to play with my son and from this point never (almost!) said &quot;hold on&quot; when he wanted to show me something and I was on the computer (hold on! i&#39;m talking about being respectful to you and having a great life together on the computer! It&#39;s more important than going to see the great tower you&#39;ve just built and you want to show me!!!!!!!!!!)<br/>\n <br/>\n Sorry for this very long  and confused message, it will be my last one for a while because it takes me too much time to write in English and my kids are still very young and need me A LOT. But I will keep reading you (and your books, and your blogs and websites) at night when they are asleep. I enjoy it so much.<br/>\n <br/>\nValentine<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Re : [AlwaysLearning] Re: interesting issue; please advise","postDate":"1260102313","msgId":48933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBCODcwNDZBLThBQzQtNEQ5RS1BNjE4LUIyMkJGNTNGOTRGQ0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PFNOVDEwOC1XMTYyRjc2NjE1RDdGNTZEQTVEMDIxNEU0OTIwQHBoeC5nYmw+","referencesHeader":"PDg0ODQ5MS41OTQzOC5xbUB3ZWIyNjUwNS5tYWlsLnVrbC55YWhvby5jb20+LCA8N0RGNUZFMzUtQjJBNS00NDRCLUFCQjAtQzlGNjY4RDZDMjA5QHZlcml6b24ubmV0PiA8U05UMTA4LVcxNjJGNzY2MTVEN0Y1NkRBNUQwMjE0RTQ5MjBAcGh4LmdibD4="},"prevInTopic":48920,"nextInTopic":49034,"prevInTime":48932,"nextInTime":48934,"topicId":48901,"numMessagesInTopic":0,"msgSnippet":"... If someone is looking for new rules, just about any book has the potential to be toxic. And that s what makes helping people understand unschooling ","messageBody":"<div id=\"ygrps-yiv-569196033\">On Dec 5, 2009, at 1:51 PM, Anne Mills wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It messed a lot with my head as I though &#39;&#39;jee, talking naturally  <br/>\n&gt; to my child is not the way to go&#39;&#39; and &#39;&#39;this doctotr in psychology  <br/>\n&gt; wants me to say to my child &#39;&#39;it is ok to be angry ...&#39;&#39; and I  <br/>\n&gt; could not get why suddenly my child was being FURIOUS;i STOPPED  <br/>\n&gt; communicating and trusting him - my child- and started burry in the  <br/>\n&gt; book to find a way to shut my bubbly child and have him LISTEN  <br/>\n&gt; INSTEAD.<br/>\n<br/>\n </span></blockquote>If someone is looking for new rules, just about any book has the  <br/>\npotential to be toxic.<br/>\n<br/>\nAnd that&#39;s what makes helping people understand unschooling  <br/>\ndifficult. Many people come asking for what to do. The want new  <br/>\n&quot;unschooling&quot; actions to replace old actions. But unschooling doesn&#39;t  <br/>\nwork like that. It&#39;s about listening to and trusting your kids, not  <br/>\nother people. But to unlearn how to override kids, you need to listen  <br/>\nto other people ;-) Unfortunately schools are good at impressing on  <br/>\nkids that they need to sit down, shut up and listen to learn. So  <br/>\npeople bring lots of baggage with them to learning about unschooling  <br/>\nand the transition can be rough.<br/>\n<br/>\nSorry you went through that.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Re : [AlwaysLearning] Re: interesting issue; please advise","postDate":"1260040038","msgId":48920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwRDM1OUJELTNENEUtNEY1Ri1BQjE2LTAyOEM0Q0RBRTAwOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFNOVDEwOC1XMTYyRjc2NjE1RDdGNTZEQTVEMDIxNEU0OTIwQHBoeC5nYmw+","referencesHeader":"PDg0ODQ5MS41OTQzOC5xbUB3ZWIyNjUwNS5tYWlsLnVrbC55YWhvby5jb20+LDw3REY1RkUzNS1CMkE1LTQ0NEItQUJCMC1DOUY2NjhENkMyMDlAdmVyaXpvbi5uZXQ+IDxTTlQxMDgtVzE2MkY3NjYxNUQ3RjU2REE1RDAyMTRFNDkyMEBwaHguZ2JsPg=="},"prevInTopic":48919,"nextInTopic":48933,"prevInTime":48919,"nextInTime":48921,"topicId":48901,"numMessagesInTopic":0,"msgSnippet":"-=-But *is* there anyone reading here who felt How to Talk got them totally off base and they wish they hadn t read it?-=- I ve never spoken in scripts to my","messageBody":"<div id=\"ygrps-yiv-1971004619\">-=-But *is* there anyone reading here who felt &quot;How to Talk&quot; got them  <br/>\ntotally off base and they wish they hadn&#39;t read it?-=-<br/>\n<br/>\nI&#39;ve never spoken in scripts to my child.  If a book suggested saying  <br/>\n&quot;It&#39;s okay to be frustrated&quot; or &quot;I know younger siblings can be a  <br/>\npain,&quot; I said it in my own voice, in my own way, not in a parrot  <br/>\nvoice, not in a poodle voice.<br/>\n<br/>\nI have heard parents absolutely BOTCH the entire communicative  <br/>\nprocess, both in coldhearted mean ways and in mincingly irritating  <br/>\nfalsely sweet and clueless ways.<br/>\n<br/>\nI can&#39;t see how anything on that page is suggesting anything at all  <br/>\nlike that.  Is someone on another list (apparently in France?)  <br/>\nsuggesting that I think that is a book to live by or what?<br/>\n<br/>\nLook:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/siblings\">http://sandradodd.com/siblings</a><br/>\n<br/>\nAfter EIGHT links to unschooling information by and for unschoolers  <br/>\n(each of which leads to other pages), at the very bottom of the page  <br/>\nit says this:<br/>\n<br/>\n From outside the unschooling realm, consider this: Siblings Without  <br/>\nRivalry, by Adele Faber and Elaine Mazlish.<br/>\n<br/>\n--------------------<br/>\n<br/>\nIF a person wants something above and beyond those eight links, then  <br/>\nthat book might give them another perspective and the perspective of  <br/>\npeople who aren&#39;t unschoolers.<br/>\n<br/>\nNothing has ever gotten me totally off base because I&#39;ve always read  <br/>\nand thought and looked at my kids and thought some more, and read  <br/>\nother things, talked to people, discussed things... how could one  <br/>\nsingle source get a person totally off base unless that was the  <br/>\nperson&#39;s starting place and the person thought one book could be *it*?<br/>\n<br/>\nI love Whole Child, Whole Parent, but when she said TV was evil, I  <br/>\ndidn&#39;t repeat mindless-zombie-style &quot;TV is Evil.&quot;   I figured she  <br/>\nmeant if you&#39;re maintaining a designer-spiritual-pastel baby house,  <br/>\nthen TV won&#39;t go with the other decor.  The friends who will be  <br/>\nimpressed with your hand-carved toys won&#39;t be impressed with Mr.  <br/>\nRoger&#39;s Neighborhood.   By the time I read that book, though, I had  <br/>\nfriends who were impressed with music, art, research, history and my  <br/>\nown ability to reason, and so whether or not I had a TV wasn&#39;t going  <br/>\nto make me any friends nor lose me any friends.  Anyone who wants to  <br/>\nshun me or my kids because we watch TV sometimes can get the hell out  <br/>\nof my house.   I don&#39;t care.<br/>\n<br/>\nJohn Holt disparaged TV, though it&#39;s kinda hypocritical since the  <br/>\ninspiration for the term &quot;unschooling&quot; came from a TV commercial. &lt;g&gt;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/theterm\">http://sandradodd.com/unschool/theterm</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337736493,"authorName":"Anne Mills","from":"Anne Mills &lt;anne-mills@...&gt;","profile":"aberruyermills","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: Re : [AlwaysLearning] Re: interesting issue; please advise","postDate":"1260039081","msgId":48919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEwOC1XMTYyRjc2NjE1RDdGNTZEQTVEMDIxNEU0OTIwQHBoeC5nYmw+","inReplyToHeader":"PDdERjVGRTM1LUIyQTUtNDQ0Qi1BQkIwLUM5RjY2OEQ2QzIwOUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDg0ODQ5MS41OTQzOC5xbUB3ZWIyNjUwNS5tYWlsLnVrbC55YWhvby5jb20+LDw3REY1RkUzNS1CMkE1LTQ0NEItQUJCMC1DOUY2NjhENkMyMDlAdmVyaXpvbi5uZXQ+"},"prevInTopic":48916,"nextInTopic":48920,"prevInTime":48918,"nextInTime":48920,"topicId":48901,"numMessagesInTopic":0,"msgSnippet":"But *is* there anyone reading here who felt How to Talk got them totally off base and they wish they hadn t read it? ... This book is toxic in my humble","messageBody":"<div id=\"ygrps-yiv-534526149\">But *is* there anyone reading here who felt &quot;How to Talk&quot; got them totally off base and they wish they hadn&#39;t read it?<br/>\n------Me !It messed a lot with my head as I though &#39;&#39;jee, talking naturally to my child is not the way to go&#39;&#39; and &#39;&#39;this doctotr in psychology wants me to say to my child &#39;&#39;it is ok to be angry ...&#39;&#39; and I could not get why suddenly my child was being FURIOUS;i STOPPED communicating and trusting him - my child- and started burry in the book to find a way to shut my bubbly child and have him LISTEN INSTEAD.<br/>\nThis book is toxic in my humble opinion.<br/>\n <br/>\n<br/>\nAnne  <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a><br/>\nDate: Sat, 5 Dec 2009 06:04:07 -0500<br/>\nSubject: Re: Re : [AlwaysLearning] Re: interesting issue; please advise<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n    <br/>\n      <br/>\n      <br/>\n      <br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 4, 2009, at 6:54 PM, Valentine wrote:<br/>\n<br/>\n<br/>\n<br/>\n&gt; The problem i&#39;ve noticed around me (our local attachment parenting  <br/>\n<br/>\n&gt; was really fond of these books) is that parents believe they&#39;re  <br/>\n<br/>\n&gt; being very respectful and they don&#39;t understand why their kids are  <br/>\n<br/>\n&gt; still reluctant to do those things, have a lot of crisis... and  <br/>\n<br/>\n&gt; they kind of blame the kids.<br/>\n<br/>\n<br/>\n<br/>\nOh, so you&#39;re not referring to new unschoolers who are using &quot;How to  <br/>\n<br/>\nTalk&quot; *and* unschooling advice. You referring to people who are  <br/>\n<br/>\ntrying to build their own understanding of respect from &quot;How to Talk&quot;  <br/>\n<br/>\nand attachment parenting.<br/>\n<br/>\n<br/>\n<br/>\nI&#39;ve read so many stories of people who started out with attachment  <br/>\n<br/>\nparenting who go onto controlling their kids. While attachment  <br/>\n<br/>\nparenting is great for babies, it&#39;s also in many ways appealing to  <br/>\n<br/>\nparents who want to be the one creating the world their children live  <br/>\n<br/>\nin. A parent who will want their child to only have healthy food and  <br/>\n<br/>\nhealthy activities (no TV or video games or pretend guns) is also  <br/>\n<br/>\nlikely to be drawn to wearing their child. The parent building a wall  <br/>\n<br/>\naround their home to keep out the stuff the parent doesn&#39;t want and  <br/>\n<br/>\nlet in only the stuff the parent does want is just creating a bigger  <br/>\n<br/>\nSnuggly.<br/>\n<br/>\n<br/>\n<br/>\nNo one in the 14 years I&#39;ve been reading unschooling posts has anyone  <br/>\n<br/>\never said &quot;But in &#39;How to Talk&#39; they suggested x and now you say  <br/>\n<br/>\nthat&#39;s disrespectful ...&quot; I suspect because it&#39;s totally obvious that  <br/>\n<br/>\nthe book isn&#39;t about unschooling. The kids in it are going to school!  <br/>\n<br/>\nSo it&#39;s obvious from the first page that some of it needs ignored. I  <br/>\n<br/>\ntrust -- and there&#39;s no evidence to the contrary from people telling  <br/>\n<br/>\nus they were confused -- that people will be drawn to the advice that  <br/>\n<br/>\nmeshes with what&#39;s said here and will reject the advice that sounds  <br/>\n<br/>\nlike what they&#39;re trying to get rid of.<br/>\n<br/>\n<br/>\n<br/>\nThere&#39;s lots of speculation and guessing going on in this thread  <br/>\n<br/>\nabout whether the book interferes or not with those who are already  <br/>\n<br/>\nsucking in information about unschooling. As a still undecided  <br/>\n<br/>\nunschooler 14 years ago, it helped me. A couple of others said it  <br/>\n<br/>\nhelped them.<br/>\n<br/>\n<br/>\n<br/>\nBut *is* there anyone reading here who felt &quot;How to Talk&quot; got them  <br/>\n<br/>\ntotally off base and they wish they hadn&#39;t read it?<br/>\n<br/>\n<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n    <br/>\n     <br/>\n<br/>\n    <br/>\n    <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n   \t\t \t   \t\t  <br/>\n_________________________________________________________________<br/>\nTchattez en direct en en vid�o avec vos amis !  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.windowslive.fr/messenger/\">http://www.windowslive.fr/messenger/</a><br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Re : [AlwaysLearning] Re: interesting issue; please advise","postDate":"1260021597","msgId":48916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0ODNBRUQ5LTU3MkMtNDI2MS05NTNELUFBQjg2RTk1NkIyM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDdERjVGRTM1LUIyQTUtNDQ0Qi1BQkIwLUM5RjY2OEQ2QzIwOUB2ZXJpem9uLm5ldD4=","referencesHeader":"PDg0ODQ5MS41OTQzOC5xbUB3ZWIyNjUwNS5tYWlsLnVrbC55YWhvby5jb20+IDw3REY1RkUzNS1CMkE1LTQ0NEItQUJCMC1DOUY2NjhENkMyMDlAdmVyaXpvbi5uZXQ+"},"prevInTopic":48911,"nextInTopic":48919,"prevInTime":48915,"nextInTime":48917,"topicId":48901,"numMessagesInTopic":0,"msgSnippet":"-=-I ve read so many stories of people who started out with attachment parenting who go onto controlling their kids. While attachment parenting is great for","messageBody":"<div id=\"ygrps-yiv-1833651800\">-=-I&#39;ve read so many stories of people who started out with attachment<br/>\nparenting who go onto controlling their kids. While attachment<br/>\nparenting is great for babies, it&#39;s also in many ways appealing to<br/>\nparents who want to be the one creating the world their children live<br/>\nin.-=-<br/>\n<br/>\nI have many sad stories I just never tell about the families we knew  <br/>\nwhen La Leche League was our main social world and source of  <br/>\ninspiration.  Some of the greatest parents of infants seem, in  <br/>\nretrospect, to have treated those days as an innoculation against any  <br/>\nfuture problems.  It doesn&#39;t work that way.  It&#39;s probably better to  <br/>\nhave been parented gently and generously, but if those sweet parents  <br/>\nthen send a child to school and show surprise that the child isn&#39;t  <br/>\nbetter than other kids forever because of the enriched first few  <br/>\nyears, it can make those children particularly frustrated.  If a  <br/>\nmother shows that she knows, for sure, how to be attentive and then as  <br/>\nthough an alarm went off and her mother days are at a close she sends  <br/>\nthem off, it does send mixed messages.<br/>\n<br/>\nOf those families I knew in those days, a dozen to twenty families,  <br/>\nthree are still intact.  I was never a leader.  I&#39;m still married.   <br/>\nLori Odhner is still married, and is running marriage enrichment  <br/>\nworkshops or retreats in Pennsylvania.  Dorothy Kerwin is still  <br/>\nmarried.   She wasn&#39;t a leader either. (Lori was.)<br/>\n<br/>\nSomewhere in there, those other families came apart.  One was a  <br/>\nhomeschooling (unschooling, mostly) family, but the others ended up  <br/>\nhaving kids in school, and parents separated for various reasons.   <br/>\nAlcoholic airline pilot husband.  Alcohol.  Frustration and violence.   <br/>\nMeanness and negativity.  Promiscuity combined with sarcasm that  <br/>\ncrushed the souls of mates first and children after.<br/>\n<br/>\nThere&#39;s no one book that advises on all those topics.  People do need  <br/>\nto find the information they need, whether from other people, movies,  <br/>\nwebsites, books, organizations, therapists, counsellors...   No one  <br/>\ncan provide a single book or website that will cover all of those  <br/>\naspects, though I&#39;ve kinda tried to. &lt;g&gt;<br/>\n<br/>\nHere&#39;s a reminder of something about my website, Joyce&#39;s, anyone  <br/>\nelse&#39;s, and everyone&#39;s:  Each person who comes there reads different  <br/>\nthings, in different orders, with her own eyes and her own mind and  <br/>\nher own experiences to color the way it&#39;s perceived.  Some are coming  <br/>\nto relax into learning.  Some are coming to reassure themselves that  <br/>\nunschooling is stupid.  Some are distraught and can hardly take in any  <br/>\nideas at all.  Some misread.   No one will read it all. No two will  <br/>\nread it the same way.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Re : [AlwaysLearning] Re: interesting issue; please advise","postDate":"1260011047","msgId":48911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdERjVGRTM1LUIyQTUtNDQ0Qi1BQkIwLUM5RjY2OEQ2QzIwOUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDg0ODQ5MS41OTQzOC5xbUB3ZWIyNjUwNS5tYWlsLnVrbC55YWhvby5jb20+","referencesHeader":"PDg0ODQ5MS41OTQzOC5xbUB3ZWIyNjUwNS5tYWlsLnVrbC55YWhvby5jb20+"},"prevInTopic":48903,"nextInTopic":48916,"prevInTime":48910,"nextInTime":48912,"topicId":48901,"numMessagesInTopic":0,"msgSnippet":"... Oh, so you re not referring to new unschoolers who are using How to Talk *and* unschooling advice. You referring to people who are trying to build their","messageBody":"<div id=\"ygrps-yiv-1386480168\">On Dec 4, 2009, at 6:54 PM, Valentine wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The problem i&#39;ve noticed around me (our local attachment parenting  <br/>\n&gt; was really fond of these books) is that parents believe they&#39;re  <br/>\n&gt; being very respectful and they don&#39;t understand why their kids are  <br/>\n&gt; still reluctant to do those things, have a lot of crisis... and  <br/>\n&gt; they kind of blame the kids.<br/>\n<br/>\n </span></blockquote>Oh, so you&#39;re not referring to new unschoolers who are using &quot;How to  <br/>\nTalk&quot; *and* unschooling advice. You referring to people who are  <br/>\ntrying to build their own understanding of respect from &quot;How to Talk&quot;  <br/>\nand attachment parenting.<br/>\n<br/>\nI&#39;ve read so many stories of people who started out with attachment  <br/>\nparenting who go onto controlling their kids. While attachment  <br/>\nparenting is great for babies, it&#39;s also in many ways appealing to  <br/>\nparents who want to be the one creating the world their children live  <br/>\nin. A parent who will want their child to only have healthy food and  <br/>\nhealthy activities (no TV or video games or pretend guns) is also  <br/>\nlikely to be drawn to wearing their child. The parent building a wall  <br/>\naround their home to keep out the stuff the parent doesn&#39;t want and  <br/>\nlet in only the stuff the parent does want is just creating a bigger  <br/>\nSnuggly.<br/>\n<br/>\nNo one in the 14 years I&#39;ve been reading unschooling posts has anyone  <br/>\never said &quot;But in &#39;How to Talk&#39; they suggested x and now you say  <br/>\nthat&#39;s disrespectful ...&quot; I suspect because it&#39;s totally obvious that  <br/>\nthe book isn&#39;t about unschooling. The kids in it are going to school!  <br/>\nSo it&#39;s obvious from the first page that some of it needs ignored. I  <br/>\ntrust -- and there&#39;s no evidence to the contrary from people telling  <br/>\nus they were confused -- that people will be drawn to the advice that  <br/>\nmeshes with what&#39;s said here and will reject the advice that sounds  <br/>\nlike what they&#39;re trying to get rid of.<br/>\n<br/>\nThere&#39;s lots of speculation and guessing going on in this thread  <br/>\nabout whether the book interferes or not with those who are already  <br/>\nsucking in information about unschooling. As a still undecided  <br/>\nunschooler 14 years ago, it helped me. A couple of others said it  <br/>\nhelped them.<br/>\n<br/>\nBut *is* there anyone reading here who felt &quot;How to Talk&quot; got them  <br/>\ntotally off base and they wish they hadn&#39;t read it?<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Re : [AlwaysLearning] Re: interesting issue; please advise","postDate":"1259973537","msgId":48903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwODVBRkUwLUE1MzAtNDAxMC04NzMyLUQ3QkVEMDE5RjVGNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDg0ODQ5MS41OTQzOC5xbUB3ZWIyNjUwNS5tYWlsLnVrbC55YWhvby5jb20+","referencesHeader":"PDg0ODQ5MS41OTQzOC5xbUB3ZWIyNjUwNS5tYWlsLnVrbC55YWhvby5jb20+"},"prevInTopic":48901,"nextInTopic":48911,"prevInTime":48902,"nextInTime":48904,"topicId":48901,"numMessagesInTopic":0,"msgSnippet":"-=-Also, at some point, they give some advice to make things easier at the supermarket, and if it does not work and the kid still does not behave (they don t","messageBody":"<div id=\"ygrps-yiv-1939820965\">-=-Also, at some point, they give some advice to make things easier at  <br/>\nthe supermarket, and if it does not work and the kid still does not  <br/>\n&quot;behave&quot; (they don&#39;t use this term I guess), then he&#39;s not allowed to  <br/>\ncome along the next time.  =-<br/>\n<br/>\nI&#39;m not defending the book, I&#39;m questioning the point.<br/>\n<br/>\nWould you take a child to a store regardless of how he behaved in a  <br/>\nstore?  If so, are there no natural consequences?<br/>\n<br/>\nI&#39;m not talking about created punishments.  I&#39;m suggesting that there  <br/>\nis a purpose to going to the store.  Sometimes there&#39;s time and mood  <br/>\nand energy to make the store a great museum of exploration.  Sometimes  <br/>\nthere&#39;s only time for the mom to sing and talk and entertain the child  <br/>\nto get through quickly.  Sometimes someone needs medicine or  <br/>\ningredients for a meal or a baking project or something and there&#39;s no  <br/>\ntime at all for entertainment and learning.  There can&#39;t be one set of  <br/>\nrules that apply to every visit to every store without any other  <br/>\nfactors.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":242590232,"authorName":"Valentine","from":"Valentine &lt;matsacha33@...&gt;","profile":"matsacha33","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re : [AlwaysLearning] Re: interesting issue; please advise","postDate":"1259970865","msgId":48901,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0ODQ5MS41OTQzOC5xbUB3ZWIyNjUwNS5tYWlsLnVrbC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":48903,"prevInTime":48900,"nextInTime":48902,"topicId":48901,"numMessagesInTopic":0,"msgSnippet":"I dont have this book anymore but i really disliked what they said about natural consequences, which for me were not natural at all. Also, at some point,","messageBody":"<div id=\"ygrps-yiv-515078110\">I dont&#39; have this book anymore but i really disliked what they said about natural consequences, which for me were not natural at all.<br/>\nAlso, at some point, they give some advice to make things easier at the supermarket, and if it does not work and the kid still does not &quot;behave&quot; (they don&#39;t use this term I guess), then he&#39;s not allowed to come along the next time.  <br/>\n <br/>\nI wish i still had the book to be more precise. Someone remembers that?<br/>\n <br/>\nIt really is not about choices for me.  <br/>\n <br/>\nAsking a kid who does not want to go outside whether she wants to wear the red or blue jacket is not giving her real choices as we&#39;ve decided to go anyway. <br/>\nAnd it&#39;s not the same as saying &quot;well, i&#39;m sorry honey but i don&#39;t want to cancel this appointment (or whatever) and we&#39;re going anyway but look i have your great spiderman jacket, and you can take your nintendo and still be playing in the car, or but i&#39;ve got a new book you&#39;re going to love waiting for you in the car or whatever.<br/>\nAnd it&#39;s not the same as getting used to giving more and more choices to your kid. <br/>\n <br/>\nParents are not encouraged to rethink their &quot;have tos&quot; and to be honest and authentic with their kids. Maybe, it&#39;s no big deal, maybe it&#39;s still better than what they were doing before reading the book. <br/>\nThe problem i&#39;ve noticed around me (our local attachment parenting was really fond of these books) is that parents believe they&#39;re being very respectful and they don&#39;t understand why their kids are still reluctant to do those things, have a lot of crisis... and they kind of blame the kids. <br/>\n <br/>\nI believe it can be as harmful as nvc but maybe i&#39;m wrong. I read it a long time ago.  <br/>\n <br/>\nValentine<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":49008,"nextTopicId":49045}}