{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":136234893,"authorName":"Shauna","from":"&quot;Shauna&quot; &lt;shaunareisewitz@...&gt;","profile":"shaunareisewitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Business idea for older mama","postDate":"1355394510","msgId":69791,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGthY2FrZSt2a3VvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBT09UYVhNUURrYTJTUU1mU0xwYnB3UjBLPVh0OWRGY1dFVGJ2dTVjQ1lKS1A4QmpQQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69784,"nextInTopic":0,"prevInTime":69790,"nextInTime":69792,"topicId":69782,"numMessagesInTopic":0,"msgSnippet":"Thank you Pam, Maybe we should plan a date! I do think that s what s missing in our culture in general-- the multigenerational support.... I ve been pretty","messageBody":"<div id=\"ygrps-yiv-206176714\">Thank you Pam, <br/>\nMaybe we should plan a date! <br/>\n<br/>\n I do think that&#39;s what&#39;s missing in our culture in general-- the multigenerational support.... I&#39;ve been pretty fortunate to come from a rich community and looks like I&#39;m beginning to find myself in another one : ).<br/>\n<br/>\nIn Ghana (where my husband is from), traditionally when everyone lives in the same village, the women live with their sisters and mothers and brothers and only cook for and sleep with their husbands. Imagine the support in raising children-- in the same house with all your sisters! The kids ended up being much closer to their maternal uncles than their own fathers. But of course that&#39;s all changing as they are becoming more westernized and nuclear family-centric.<br/>\n<br/>\nThe problem is is that in current western nuclear family centric societies the mamas that are attachment parenting and unschooling are relatively few and far between (though this is changing), and their ONLY community (but thank goodness for this at least ) is on-line. We do for the most part do what we do in a sea of &quot;normality.&quot; And thank goodness there are park days and such, but I know that some people feel alone. Even in California, when I am out and about, I feel fairly odd that my children are the ones hanging from the banisters, walking on every curb they find, etc..  while it seems other children conveniently and quickly march along with their parents... : )  This isn&#39;t a problem, though it is sometimes exhausting, but it has been nice to ask older mom friends, when I&#39;ve had the opportunity-- did your kids do x,y, z?- how did you handle the x, y, z??  And I think some moms, especially while their children are young- really need this kind of help and support.  In the old societies- they had it. And from an anthropological/ evolutionary point of view that kind of help is quite necessary. How sad that now, I&#39;m suggesting that it could be a business opportunity! <br/>\n<br/>\nSo it&#39;s only because I have my mind in a place of thinking of business and marketing type ideas that it occurs to me that this could be a business opportunity for a mom, who has already been there, or even an unschooled young adult (maybe even better!)<br/>\nThis kind of support is an unmet need in our society, sadly enough...<br/>\n<br/>\nAnd I&#39;d love to share some of what I am learning about on line marketing with someone who wanted to pursue it. <br/>\n<br/>\nThis reminds me of a very interesting movie I recently watched called Schooling the World. a fascinating look at what school has done to one particular traditional culture- and what it does in general to rich traditional cultures. Schooling the World. www.schoolingtheworld.org<br/>\n<br/>\nShauna</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Business idea for older mama","postDate":"1355350264","msgId":69784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhNUURrYTJTUU1mU0xwYnB3UjBLPVh0OWRGY1dFVGJ2dTVjQ1lKS1A4QmpQQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDEzNTUzNDE5ODcuNzM2NDkuWWFob29NYWlsTmVvQHdlYjEyMTUwMS5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDEzNTUzNDE5ODcuNzM2NDkuWWFob29NYWlsTmVvQHdlYjEyMTUwMS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":69783,"nextInTopic":69791,"prevInTime":69783,"nextInTime":69785,"topicId":69782,"numMessagesInTopic":0,"msgSnippet":"Not liking the nanny or supernanny terminology - that makes me cringe. But an Auntie for Rent service? I d do that, maybe. That sounds sweet. I just","messageBody":"<div id=\"ygrps-yiv-1873468083\">Not liking the &quot;nanny&quot; or &quot;supernanny&quot; terminology - that makes me cringe.<br/>\nBut an &quot;Auntie for Rent&quot; service? I&#39;d do that, maybe. That sounds sweet. I<br/>\njust would find it really awkward to charge for doing that kind of thing -<br/>\nmy inclination to want to be supportive to moms of younger children is<br/>\nreally strong and it feels very very natural to me that many of us with<br/>\ngrown kids would want to hang out with younger families - mutually<br/>\nbeneficial. But - how to make that happen? Maybe a business is the answer.<br/>\n<br/>\nI go to regular park days and I feel just a little sad that more &quot;former&quot;<br/>\nhomeschooling parents don&#39;t keep on going to them. My park day group was my<br/>\nsubstitute for a small town community or large extended family. It seems<br/>\nweird to me that people would sort of drop out of their community/family<br/>\nlike they do when their kids grow up. I&#39;m the age where I enjoy seeing the<br/>\nmoms with their young kids and I really really like those kids (and their<br/>\nmoms, too, of course) - I can&#39;t imagine life without the opportunity to be<br/>\naround a bunch of little kids regularly. It seems natural to me. It seems<br/>\nlike how life &quot;should&quot; be. I realize not everybody loves to be around<br/>\nchildren like I do, but still it seems odd not to have ALL ages, including<br/>\ngrandma types, as part of these park day communities.<br/>\n<br/>\nSo - with all that said - that&#39;s what seems to be missing in the lives of<br/>\nyoung mothers a lot of the time. That extra help from the previous<br/>\ngeneration - the moms whose kids are older or even from those grown kids,<br/>\nthemselves.<br/>\n<br/>\nI&#39;d have FUN going to Target with Shauna&#39;s kids - we could wander and look<br/>\nat stuff and talk while she did her shopping. Or she could take one of her<br/>\nkids off to buy a new coat while I took the other next door to the pet<br/>\nstore to look at the fish or something.<br/>\n<br/>\nMy husband grew up in a very small town in Iran - no electricity, paved<br/>\nroads, indoor plumbing, running water. Cooked and heated water over<br/>\ncharcoal and did laundry at the river. Seemed like a hard life, to me until<br/>\nhis sister came here to the United States to visit and later told me how<br/>\nshe felt so sorry for American women. Huh? She said we are so isolated and<br/>\nwe do all our chores all alone. They cooked communally every single night<br/>\nand several families would eat their evening meal together. They went to<br/>\nthe public baths one day a week - all the women and children at one time<br/>\nand all the older boys and men another. They did their laundry at the river<br/>\nall on the same day, together. They lived in their own homes and had their<br/>\nown orchards, but the harvesting was communal, too.<br/>\n<br/>\nShe thought the washing machine and dryer in our own house was sad. The<br/>\ndining room table just big enough for our own immediate family - sad.<br/>\n`<br/>\n-pam<br/>\n<br/>\nOn Wed, Dec 12, 2012 at 11:53 AM, Shauna Reisewitz &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shaunareisewitz@...\">shaunareisewitz@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m serious, I think there is a need. I&#39;m currently trying to start a<br/>\n&gt; different kind of business and am taking an on line marketing class to<br/>\n&gt; start my own idea.. If you are interested in doing a &quot;supernanny&quot; for<br/>\n&gt; unschoolers business  -- I&#39;d love to chat with you and support you-- tell<br/>\n&gt; you what I&#39;m learning from this class I&#39;m taking. I&#39;m not trying to sell<br/>\n&gt; anything here- honest! I just have often wished for that kind of support<br/>\n&gt; with  my young children, and know that i am not alone in that regard!<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Business idea for older mama","postDate":"1355349714","msgId":69783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQxQ0I0QjVDLTM3NUQtNDgwQi1BNTMyLTcyN0YwMkUyMzA1RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzNTUzNDE5ODcuNzM2NDkuWWFob29NYWlsTmVvQHdlYjEyMTUwMS5tYWlsLm5lMS55YWhvby5jb20+","referencesHeader":"PDEzNTUzNDE5ODcuNzM2NDkuWWFob29NYWlsTmVvQHdlYjEyMTUwMS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":69782,"nextInTopic":69784,"prevInTime":69782,"nextInTime":69784,"topicId":69782,"numMessagesInTopic":0,"msgSnippet":"Are you talking about moms whose children are already grown?  Or young-adult unschoolers? There s a place to advertise to provide or request such situations,","messageBody":"<div id=\"ygrps-yiv-682372456\">Are you talking about moms whose children are already grown?  Or young-adult unschoolers?  <br/>\nThere&#39;s a place to advertise to provide or request such situations, on Blake Bole&#39;s site.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.blakeboles.com/the-grown-unschooler-opportunity-network/\">http://www.blakeboles.com/the-grown-unschooler-opportunity-network/</a></div>","specialLinks":[]},{"userId":136234893,"authorName":"Shauna Reisewitz","from":"Shauna Reisewitz &lt;shaunareisewitz@...&gt;","profile":"shaunareisewitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Business idea for older mama","postDate":"1355341987","msgId":69782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNTUzNDE5ODcuNzM2NDkuWWFob29NYWlsTmVvQHdlYjEyMTUwMS5tYWlsLm5lMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":69783,"prevInTime":69781,"nextInTime":69783,"topicId":69782,"numMessagesInTopic":0,"msgSnippet":"Hi, I ve been thinking of posting this idea to Always Learning for a while, then saw the most recent thread of the tired mama with her 4 year old son. and I","messageBody":"<div id=\"ygrps-yiv-591154569\">Hi, <br/>\n<br/>\nI&#39;ve been thinking of posting this idea to Always Learning for a while, then saw the most recent thread of the tired mama with her 4 year old son. and I thought.. I have to post this idea...<br/>\nI think there is room ( if i had the money I would hire!) a &quot;supernanny&quot; for attachment parents and unschoolers...Offer a service where you go and hang out with a family trying to AP/unschool and who needs support and advice about how you do things...(I would love to walk through Target with my children with such a person)<br/>\n<br/>\nI&#39;m nowhere near being able to do this, as my children are young- and at times I wonder--am I the only one who it takes 2 hours to do the simplest task? Is everyone who parent&#39;s this way&#39;s house this much of a mess? , etc....<br/>\n<br/>\nI&#39;m serious, I think there is a need. I&#39;m currently trying to start a different kind of business and am taking an on line marketing class to start my own idea.. If you are interested in doing a &quot;supernanny&quot; for unschoolers business  -- I&#39;d love to chat with you and support you-- tell you what I&#39;m learning from this class I&#39;m taking. I&#39;m not trying to sell anything here- honest! I just have often wished for that kind of support with  my young children, and know that i am not alone in that regard!<br/>\nShauna<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":69786,"nextTopicId":69736}}