{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":164454035,"authorName":"Erica Chase-Salerno","from":"Erica Chase-Salerno &lt;erica@...&gt;","profile":"echasal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Mt. Laurel Day at Sam&#39;s Point","postDate":"1181461520","msgId":29237,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY2ZDhlMGU5OWE5OTk4MDRkZTI3ODQ1MDZmOTAzMDA1QGNoYXNhbC5uZXQ+","inReplyToHeader":"PDczMTQzMS43MzY4NC5xbUB3ZWI1ODgwNC5tYWlsLnJlMS55YWhvby5jb20+","referencesHeader":"PDczMTQzMS43MzY4NC5xbUB3ZWI1ODgwNC5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":29235,"nextInTopic":0,"prevInTime":29236,"nextInTime":29238,"topicId":29235,"numMessagesInTopic":0,"msgSnippet":"I m disappointed to miss out on this since we already have some commitments that day, but it sounds wonderful!  Thanks for the information! ~ Erica (New Paltz)","messageBody":"<div id=\"ygrps-yiv-1783426210\">I&#39;m disappointed to miss out on this since we already have some <br/>\ncommitments that day, but it sounds wonderful!  Thanks for the <br/>\ninformation!<br/>\n<br/>\n~ Erica (New Paltz)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Jun 10, 2007, at 3:28 AM, Annie wrote:<br/>\n<br/>\n&gt; Hi All homeschoolers (especially teens),<br/>\n&gt;<br/>\n&gt;  I&#39;m trying to find out if any of you are interested in meeting at <br/>\n&gt; Sam&#39;s Point in Craigsmoor, NY for the first Mt. Laurel Day ever on <br/>\n&gt; Sat. June 23rd.<br/>\n&gt;<br/>\n&gt;  I have emailed to these 2 groups in the past re. my hope to have my <br/>\n&gt; newly un/homeschooled daughter meet up with local kids her age. It has <br/>\n&gt; been hard, since at this age they tend to break away from the groups <br/>\n&gt; or simply don&#39;t want to do the things that they would do at a younger <br/>\n&gt; age, and most especially with the much younger kids and parents!- <br/>\n&gt; which makes a lot of sense.<br/>\n&gt;<br/>\n&gt;  If anyone wants to email me directly I will be glad to give more <br/>\n&gt; details. I recently read about and visited Sam&#39;s Point after reading <br/>\n&gt; an article in The Times Herald Record titled &quot;15 Places to VIsit <br/>\n&gt; Before You Die&quot;. It&#39;s not far from Pine Bush. We went as a family on a <br/>\n&gt; Sunday and did not have enough time to hike to Ice Caves. Sam&#39;s Point <br/>\n&gt; Preserve is a 46,000-acre tract that contains one of the best examples <br/>\n&gt; of a ridgetop dwarf pine barren in the world. Some of you may remember <br/>\n&gt; going there as a child. My husband did, but years ago you were able to <br/>\n&gt; drive up closer to the cave than you can now. The cave had ice in it <br/>\n&gt; last week, which totally amazed me. It is part of the 90,000-acre <br/>\n&gt; Northern Shawangunk Mountains. It&#39;s home to nearly 40 rare plants and <br/>\n&gt; animal species and three rare natural communities. There are several <br/>\n&gt; trails to hike, some very short. There are some interesting activities <br/>\n&gt; scheduled of interest for children and adults on Mt. Laurel Day: <br/>\n&gt; guided<br/>\n&gt;  hikes, jewelry making, photography, tee shirt making. It starts at <br/>\n&gt; 10AM and only costs $7 for parking. I called and spoke to them about <br/>\n&gt; getting a homeschooled group together and they were very happy to hear <br/>\n&gt; about this. They are just starting to reach out to the schools and <br/>\n&gt; were delighted to hear that I was interested in spreading the word <br/>\n&gt; about Mt. Laurel Day. They have a great, but small gift shop also! <br/>\n&gt; There will be food on sale for lunch from a local restaurant and are <br/>\n&gt; fine with bringing food in also.<br/>\n&gt;<br/>\n&gt;  Please feel free to contact me directly:)...<br/>\n&gt;  Looking forward to meeting up with ya,<br/>\n&gt;  Ann<br/>\n&gt;<br/>\n&gt;  ---------------------------------<br/>\n&gt;  Be a better Globetrotter. Get better travel answers from someone who <br/>\n&gt; knows.<br/>\n&gt;  Yahoo! Answers - Check it out.<br/>\n&gt;<br/>\n&gt;  [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;   <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":295274109,"authorName":"Annie","from":"Annie &lt;amgreejoyjoyblue@...&gt;","profile":"amgreejoyjoyblue","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Mt. Laurel Day at Sam&#39;s Point","postDate":"1181460491","msgId":29235,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczMTQzMS43MzY4NC5xbUB3ZWI1ODgwNC5tYWlsLnJlMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":29237,"prevInTime":29234,"nextInTime":29236,"topicId":29235,"numMessagesInTopic":0,"msgSnippet":"Hi All homeschoolers (especially  teens), I m trying to find out if any of you are interested in meeting at Sam s Point in Craigsmoor, NY for the first Mt.","messageBody":"<div id=\"ygrps-yiv-2129473164\">Hi All homeschoolers (especially  teens),<br/>\n   <br/>\n  I&#39;m trying to find out if any of you are interested in meeting at Sam&#39;s Point in Craigsmoor, NY for the first Mt. Laurel Day ever on Sat. June 23rd. <br/>\n   <br/>\n  I have emailed to these 2 groups in the past re. my hope to have my newly un/homeschooled daughter meet up with local kids her age.  It has been hard, since at this age they tend to break away from the groups or  simply don&#39;t want to do the things that they would do at a younger age, and most especially with the much younger kids and parents!- which makes a lot of sense.<br/>\n   <br/>\n  If anyone wants to email me directly I will be glad to give more details.  I recently read about and visited Sam&#39;s Point after  reading an article in The Times Herald Record titled &quot;15 Places to VIsit Before You Die&quot;.  It&#39;s not far from Pine Bush.  We went as a family on a Sunday and did not have enough time to hike to Ice Caves. Sam&#39;s Point Preserve is a 46,000-acre tract that contains one of the best examples of a ridgetop dwarf pine barren in the world. Some of you may remember going there as a child.  My husband did, but years ago you were able to drive up closer to the  cave than you can now.  The cave had ice in it last week, which totally amazed me.  It is part of the 90,000-acre Northern Shawangunk Mountains.  It&#39;s home to nearly 40 rare plants  and animal species and three rare natural communities. There are several trails to hike, some very short. There are some  interesting activities scheduled  of interest for children and adults on Mt. Laurel Day: guided<br/>\n hikes, jewelry making, photography, tee shirt making.  It starts at 10AM and only costs $7 for parking.  I called and spoke to them about getting a  homeschooled group together and they were very happy to hear about this.  They are just starting to reach out to the schools and were delighted to hear that I was interested in spreading the word about Mt. Laurel Day.  They have a great, but small gift shop also!  There will be food on sale for lunch from a local restaurant and are fine with bringing food in also.<br/>\n   <br/>\n  Please feel free to contact me directly:)...<br/>\n  Looking forward to meeting up with ya,<br/>\n  Ann <br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBe a better Globetrotter. Get better travel answers from someone who knows.<br/>\nYahoo! Answers - Check it out.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":29195,"nextTopicId":29120}}