{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":22,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228270114","msgId":40734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoNHBuMis2bTU5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUxNzlFOUFDLTYyNEQtNEJDOC05NEY5LUU2RDlEODIyNUI3N0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40730,"nextInTopic":0,"prevInTime":40733,"nextInTime":40735,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"... Chamille had a pretty decent babysitting gig, or so we thought.  She got $6 an hour for watching 2 boys about 7 and 9 at their house, while they went to","messageBody":"<div id=\"ygrps-yiv-836871807\"><blockquote><span title=\"ireply\">&gt; I&#39;m always stunned when someone wants to hire a babysitter for rock-<br/>\n&gt; bottom nothing, and then tell them exactly what they can and can&#39;t do<br/>\n&gt; in their own home.<br/>\n<br/>\n </span></blockquote>Chamille had a pretty decent babysitting gig, or so we thought.  She got<br/>\n$6 an hour for watching 2 boys about 7 and 9 at their house, while they<br/>\nwent to doctors appts.  It lasted a while, until she couldn&#39;t handle the<br/>\ncomplete disregard they had for their parents rules and each other and<br/>\nshe didn&#39;t know how to enforce anything.  The babysitter is supposed to<br/>\nbe fun and play games and be nice.<br/>\n<br/>\nThat&#39;s what Chamille tried doing, but she couldn&#39;t get the kids to stop<br/>\nfighting with each other and one of them kept trying to run away from<br/>\nhome, so Chamille would have to chase him down the street while the<br/>\nother was left by himself in the house.  The parents told her to put<br/>\nthem in time-out in their seperate bedrooms and leave them there for the<br/>\nwhole time if necessary.  Chamille couldn&#39;t and wouldn&#39;t do that because<br/>\nshe thought it was mean, so she quit, or rather I called them and told<br/>\nthem to find another sitter and thanks for the opportunity, but that<br/>\nshe&#39;d changed her mind.  The kids were really sad about it because they<br/>\nsaid that Chamille was their favorite babysitter ever!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228249509","msgId":40730,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxNzlFOUFDLTYyNEQtNEJDOC05NEY5LUU2RDlEODIyNUI3N0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdoNDRmOSs4aGc1QGVHcm91cHMuY29tPg==","referencesHeader":"PGdoNDRmOSs4aGc1QGVHcm91cHMuY29tPg=="},"prevInTopic":40728,"nextInTopic":40734,"prevInTime":40729,"nextInTime":40731,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"-=-It s a fine line of following ones own principles and allowing the rules and weirdness of another parent enter into your home. Over the years, I ve come to","messageBody":"<div id=\"ygrps-yiv-1449406291\">-=-It&#39;s a fine line of following ones own principles and allowing the  <br/>\nrules<br/>\nand weirdness of another parent enter into your home. Over the years,<br/>\nI&#39;ve come to places where I just won&#39;t go or do in the name of keeping<br/>\nthe peace for the kids&#39; sake.-=-<br/>\n<br/>\nI&#39;m always stunned when someone wants to hire a babysitter for rock- <br/>\nbottom nothing, and then tell them exactly what they can and can&#39;t do  <br/>\nin their own home.  In the past I kept other people&#39;s kids a few  <br/>\ntimes for money, and I figure they&#39;ve chosen to leave a child at MY  <br/>\nhouse, where I&#39;ve already been living, with my kids, for a long time.<br/>\n<br/>\nI&#39;ve heard people defend their &quot;rules&quot; for their kids, too, about  <br/>\nwhat they can see and hear and eat.<br/>\n<br/>\nFor $4 or $5 an hour, they should take what they get.  If they want  <br/>\nto say exactly what gets done, I&#39;d want at least $15 or $20 an hour.   <br/>\nI was thinking as I was typing this what I would take to be harsh and  <br/>\nuse time-outs or spankings.  Maybe for $100 an hour I&#39;d slip the kid  <br/>\n$20 to claim I was really mean, but not actually be mean.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228248361","msgId":40728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoNDRmOSs4aGc1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM4OTI1NzI1LTQ2REEtNDlFQi1CMDk3LURBMURDNTgxMTdBOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40723,"nextInTopic":40730,"prevInTime":40727,"nextInTime":40729,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"... I actually agree with this!  I was thinking about the particular scenario of having someone s child for 3 hrs and having the phone interrupt our activities","messageBody":"<div id=\"ygrps-yiv-675292067\"><blockquote><span title=\"ireply\">&gt; I wouldn&#39;t want my children with someone who was willing to lie to<br/>\n&gt; me. And if my child is away from me, I&#39;d like to be able to call.<br/>\n&gt; Then again, I didn&#39;t abuse it, but still... to have someone else&#39;s<br/>\n&gt; child and make oneself unavailable is bad. And to leave a child with<br/>\n&gt; me and make oneself unavailable for very long is bad too.<br/>\n<br/>\n </span></blockquote>I actually agree with this!  I was thinking about the particular<br/>\nscenario of having someone&#39;s child for 3 hrs and having the phone<br/>\ninterrupt our activities repeatedly for non-emergency stuff, just to<br/>\ncheck in on the child&#39;s eating.  If I were to turn off a phone to<br/>\neliminate disruptions, I would totally check it and messages to make<br/>\nsure there were no emergencies.<br/>\n<br/>\nThe child in question has her own phone though.  It&#39;s interesting to me<br/>\nthat the child potentially has a cell phone for the mom to control more.<br/>\nI got Chamille a cell phone so that she could have more freedom, not<br/>\nless, but then, my goal isn&#39;t to micro manage my kids!<br/>\n<br/>\nChamille&#39;s friend has a cell phone because the mom got tired of always<br/>\ngoing through the dad to talk to her kids, so she put them on her phone<br/>\nservice and purchased phones for them.  Now the dad, uses the phones as<br/>\na form of control and punishment to penalize both his kids and their<br/>\nmother.  He takes away the phone as a form of punishment, checks all the<br/>\ntexts and numbers and does formal interrogations about all of them. <br/>\nThis poor kid has to make sure that everything gets erased right after<br/>\nshe uses her phone each and everytime, just in case.  When she is over<br/>\nand using her phone, I sometimes remind her to delete her stuff on the<br/>\nway back home.  I know and she knows that he will check and ground her<br/>\nfrom Chamille for anything remotely suspicious.<br/>\n<br/>\nSometimes I feel that by doing that I cross the line, but then the<br/>\nconsequences are so severe and affect both her and my daughter, I offer<br/>\nreminders.  I don&#39;t control her or Chamille, that&#39;s not how I operate. <br/>\nI figure that&#39;s his job, since that&#39;s what he does.<br/>\n<br/>\nIt&#39;s a fine line of following ones own principles and allowing the rules<br/>\nand weirdness of another parent enter into your home.  Over the years,<br/>\nI&#39;ve come to places where I just won&#39;t go or do in the name of keeping<br/>\nthe peace for the kids&#39; sake.  I used to jump through a lot of hoops for<br/>\nkeeping the peace and the other parent took advantage repeatedly because<br/>\nhe knew I&#39;d agree to it, so that our kids could hang out.<br/>\n<br/>\nNow, instead of Chamille being desperate to hang out with her friend,<br/>\nthe friend is desperate to hang out with her.  Not something I<br/>\nanticipated by laying down boundaries with this parent.  I don&#39;t think<br/>\nanyone wants to be controlled and manipulated.  People who control and<br/>\nmanipulate will do it to get what they want until they can&#39;t control and<br/>\nmanipulate that person anymore.  By allowing him to do so, I was also<br/>\nallowing him to control and manipulate Chamille by extension.  Things<br/>\nhave been a lot better since I stopped letting him do that to us.  His<br/>\ndaughter suffers more because of it and Chamille and I both feel<br/>\nterrible for her, but our lives are better, and that can have the<br/>\npotential to make her friend&#39;s life better.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228246398","msgId":40723,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMUE1MzlCLUQ0QUQtNEFCNS05RkRFLUMzMzI5QjQ4MTMyRkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdoM3YzdStnMTFkQGVHcm91cHMuY29tPg==","referencesHeader":"PGdoM3YzdStnMTFkQGVHcm91cHMuY29tPg=="},"prevInTopic":40719,"nextInTopic":40728,"prevInTime":40722,"nextInTime":40724,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"-=-When Chamille says she doesn t want to do something, she has a pretty good reason for it, her friend really doesn t understand that. In her world, clearly","messageBody":"<div id=\"ygrps-yiv-1839355427\">-=-When Chamille says she doesn&#39;t want to do something, she has a pretty<br/>\ngood reason for it, her friend really doesn&#39;t understand that. In her<br/>\nworld, clearly all kids want to run around doing obnoxious attention<br/>\nseeking rebellious things for fun. While Chamille finds some of it fun,<br/>\nshe knows there are boundaries that shouldn&#39;t be crossed and her friend<br/>\ndoesn&#39;t see them at all. The ONLY boundaries she sees are the ones that<br/>\nwill get her in trouble with dad.-=-<br/>\n<br/>\n<br/>\n<br/>\nOnce when Holly told some kids she never got spankings, one said  <br/>\nexcitedly &quot;Then you could lie all the time!&quot;<br/>\n<br/>\nThat girl felt like a winner when she lied and didn&#39;t get caught.<br/>\n<br/>\nHolly had no reason to lie.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228242878","msgId":40719,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoM3YzdStnMTFkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdoMmJmbCtjcmtiQGVHcm91cHMuY29tPg=="},"prevInTopic":40711,"nextInTopic":40723,"prevInTime":40718,"nextInTime":40720,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"... A lot of the way that my daughter s friend has learned to behave is reactionary.  She doesn t think clearly and logically about why she s feeling a certain","messageBody":"<div id=\"ygrps-yiv-1246156795\"><blockquote><span title=\"ireply\">&gt; &gt;Now that she&#39;s been able to hang out a bit<br/>\n&gt; &gt; more with that friend, she sees how all that control has deeply<br/>\n&gt; &gt;impacted this friend, to such an extent that it has an impact on<br/>\n&gt; their relationship and how they deal with each other.<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; I&#39;d like to know what you mean by the last part. Can you give an<br/>\n&gt; example as to how they deal with each other? My dd feels she can&#39;t<br/>\n&gt; talk to A about the food and control stuff (maybe they are still too<br/>\n&gt; young to identify/verbalize stuff like that?). I see A starting a<br/>\n&gt; lot of attention-seeking behaviors and worry about her future. A has<br/>\n&gt; not made any close friends besides my dd.<br/>\n<br/>\n </span></blockquote>A lot of the way that my daughter&#39;s friend has learned to behave is<br/>\nreactionary.  She doesn&#39;t think clearly and logically about why she&#39;s<br/>\nfeeling a certain way and how that affects her behavior.  I wouldn&#39;t<br/>\nexpect a kid that has grown up in dysfuntion to be able to figure that<br/>\nout.  One day she might, after she goes through some bad relationships,<br/>\nor a death or some other trauma.<br/>\n<br/>\nWhen Chamille says she doesn&#39;t want to do something, she has a pretty<br/>\ngood reason for it, her friend really doesn&#39;t understand that.  In her<br/>\nworld, clearly all kids want to run around doing obnoxious attention<br/>\nseeking rebellious things for fun.  While Chamille finds some of it fun,<br/>\nshe knows there are boundaries that shouldn&#39;t be crossed and her friend<br/>\ndoesn&#39;t see them at all.  The ONLY boundaries she sees are the ones that<br/>\nwill get her in trouble with dad.  She knows her dad&#39;s triggers and if<br/>\nhe&#39;ll find out about things, or if there is a potential for finding out.<br/>\nEverything else is ok to do, even though it really isn&#39;t for a lot of<br/>\nreasons.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve considered Sandra&#39;s suggestion to get the girls out doing things<br/>\n&gt; not at home, however, the Mom is reluctant to allow this. That is,<br/>\n&gt; she&#39;s fine taking my dd places, but doesn&#39;t like me taking her dd<br/>\n&gt; anywhere.<br/>\n<br/>\n </span></blockquote>Well you are the wild card in the deck.  The mom is uncomfortable with<br/>\nher daughter being in a situation that she has no control over.<br/>\n<br/>\nThe reason A doesn&#39;t spend the night with us anymore is<br/>\n<blockquote><span title=\"ireply\"> &gt; because of her &quot;allergies.&quot; I&#39;m not sure if that&#39;s real or something<br/>\n&gt; her Mom made up. My dd really misses A because she&#39;s so unavailable<br/>\n&gt; with school and homework.<br/>\n<br/>\n </span></blockquote>They are excuses.  You know, the mom knows it, but you can&#39;t change it<br/>\nor call her on it.  We&#39;ve heard them all too, well, not the allergy one.<br/>\nThat does make sense given the food control issues though.  Allergies<br/>\ncan be used as a way to control food, I&#39;ve seen it done, heck, it was<br/>\ndone to me as a kid.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Thanks, I need the reminder. I&#39;m doing okay ... mostly I struggle<br/>\n&gt; with the damage the mom is doing to her dd.<br/>\n<br/>\n </span></blockquote>When Chamille was in tears over her friend, a lot of those tears were on<br/>\nher friend&#39;s behalf more than her own unhappiness.  She really cares<br/>\ndeeply for her friend and doesn&#39;t like to see her hurt.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;m glad you shared this ... it&#39;s interesting what kids choose over<br/>\n&gt; time. I suspect A will want to get away from her parents more and<br/>\n&gt; more and if she spends more time with us, it will work to the girls<br/>\n&gt; advantage. I&#39;ll try to find ways to make that more attractive to<br/>\n&gt; everyone. :)<br/>\n<br/>\n </span></blockquote>If the other mom is willing anyway!  One thing that we did sometimes,<br/>\nwas to invite the sister along.  If we invited both girls, dad could<br/>\nhave uninterrupted video game playing time, and he wouldn&#39;t have to cook<br/>\ndinner or make his kids do it.  Sweeten the deal.  You know more about<br/>\nwhat will work with this person, and your daughter may have some good<br/>\nideas too.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228233536","msgId":40711,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBOEQxMzRGLTVFRDQtNEYwRS1CMEEwLThGMjJCNjI4NjQxOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDI3RTRFOEM5OUJFRTQ3Nzc4OTE4Rjc2MUVDMkY5QTQ0QFJvYnluUEM+","referencesHeader":"PGdndWd2citlZTY2QGVHcm91cHMuY29tPiA8OWY3MmQ3NjIwODEyMDExNjM1bDRkMWJkZTA5cWI4MDc5ZmY4NGMyZWIyZThAbWFpbC5nbWFpbC5jb20+IDwyN0U0RThDOTlCRUU0Nzc3ODkxOEY3NjFFQzJGOUE0NEBSb2J5blBDPg=="},"prevInTopic":40710,"nextInTopic":40719,"prevInTime":40710,"nextInTime":40712,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"-=-It is amazing to me that adults are trying to control the food intake of a 12 year old who is out and about in the world.-=- Keith s mother still tries, and","messageBody":"<div id=\"ygrps-yiv-358094705\">-=-It is amazing to me that adults are trying to<br/>\ncontrol the food intake of a 12 year old who is out and about in the  <br/>\nworld.-=-<br/>\n<br/>\nKeith&#39;s mother still tries, and he&#39;s 52.   She used to critique our  <br/>\nfridge, and she nearly always says something when we&#39;re at a  <br/>\nrestaurant or eating at her house.<br/>\n<br/>\n-=-James and Jayn have a special place they<br/>\ngo to, a taco joint near us, that has been a good way to dispel hunger<br/>\ninduced grumpiness.-=-<br/>\n<br/>\nOver the years, and as the kids have gotten older so I&#39;m not so  <br/>\nfrazzled, I have less need for &quot;OH MY GOSH I HAVEN&#39;T EATEN!&quot; food,  <br/>\nbut there&#39;s a burger king near where Kirby used to work.  All my  <br/>\nrelatives and several of my friends knew the medicinal value of a  <br/>\nquick fish sandwich when I was starting to look or sound volatile.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228233215","msgId":40710,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3RTRFOEM5OUJFRTQ3Nzc4OTE4Rjc2MUVDMkY5QTQ0QFJvYnluUEM+","inReplyToHeader":"PDlmNzJkNzYyMDgxMjAxMTYzNWw0ZDFiZGUwOXFiODA3OWZmODRjMmViMmU4QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGdndWd2citlZTY2QGVHcm91cHMuY29tPiA8OWY3MmQ3NjIwODEyMDExNjM1bDRkMWJkZTA5cWI4MDc5ZmY4NGMyZWIyZThAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":40689,"nextInTopic":40711,"prevInTime":40709,"nextInTime":40711,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"We have visitors who have food restrictions and often seem to be hungry when they arrive, although I know they have lots of good food at their meals. If the","messageBody":"<div id=\"ygrps-yiv-178447522\">We have visitors who have food restrictions and often seem to be hungry when <br/>\nthey arrive, although I know they have lots of good food at their meals. If <br/>\nthe kids start asking for foods that seem iffy, I am lucky enough that <br/>\ngenerally I can ask them to check in with their mother across the courtyard <br/>\nwhether it is ok. Again I have been lucky because usually it has been fine, <br/>\nand I think it gives the other mom reassurance - especially since her son <br/>\nhas said in the past that he isn&#39;t supposed to eat some sweet thing or other <br/>\nbut intended to sneak it at our house and lie about it at home. I told him I <br/>\nwasn&#39;t comfortable with that, and that I wanted his mom to be comfortable <br/>\ntoo. On the other hand Jayn has her basket of candy and chocolates from <br/>\nHalloween and seems to be frequently distributing them to the kids, and I <br/>\nhave a feeling that the mom might disapprove if she saw the volume - but it <br/>\nis kinda under my radar and in passing, while not being a covert operation.<br/>\n<br/>\nThere have been times when I have called a mom to check about a range of <br/>\nfoods just to be sure, but that was mostly when both Jayn and her friends <br/>\nwere younger. The older they all get, the more I adopt the policy of asking <br/>\nvisitors what they would like. It is amazing to me that adults are trying to <br/>\ncontrol the food intake of a 12 year old who is out and about in the world. <br/>\nWhat a way to make exercise despised by the kid!<br/>\n<br/>\nThe other idea I had if the cache of protein bars practice ends up failing <br/>\nmight be to discuss the food issue for your own daughter from the point of <br/>\nview of low blood sugar as a medical condition. I don&#39;t know if your own <br/>\ndoctor has made any recommendations about the frequency or caloric level for <br/>\nyour daughter that you could then pass on with the authority of medical <br/>\nexperts behind it. Or perhaps slightly vaguer &quot;We&#39;ve learnt that it&#39;s very <br/>\nimportant for dd to avoid hypoglycemia so I&#39;m sending her over with a snack <br/>\nbag of approved foods for her to eat when she feels her blood sugar level <br/>\nslipping.&quot; You don&#39;t necessarily need to say that you have learned it from <br/>\nobservation or that you are the food approver.<br/>\n<br/>\nJayn comes home with stories of the practices in other homes that she <br/>\nclearly thinks are head shakingly odd. For example one mom only puts about <br/>\nan inch of liquid in her kid&#39;s glasses and according to Jayn they can&#39;t ask <br/>\nfor more. I think it is because the kids are clumsy (I know this from <br/>\nobservation at our house) and she is trying to avoid endless spillage clean <br/>\nup. But to Jayn it has translated into not being allowed to ask for more <br/>\n(shades of Oliver). To me the whole thing could be avoided by using a lidded <br/>\ncup with a straw, which is what I do.<br/>\n<br/>\nWith the help of people here I am learning to trust that Jayn will be ok <br/>\neven if she occasionally goes into a poor environment, and from my own <br/>\nexperience I know I absolutely can&#39;t control another mom and it is futile to <br/>\ntry, regardless of how much sense I might be making. If Jayn is willing to <br/>\nput up with nonsense for the sake of spending time with friends, then she <br/>\nwill be alright, and perhaps eventually she will decide that it&#39;s too much <br/>\ntrouble to be worth it. I know that it is hard when crankiness and bad mood <br/>\nand unpleasant stress releasing behaviors are then brought home, but I like <br/>\nthe suggestion of having food in the car. Perhaps you could even make a <br/>\nspecial time of going out to eat together right away or go for a walk (too <br/>\nold for the park??) after a snack. James and Jayn have a special place they <br/>\ngo to, a taco joint near us, that has been a good way to dispel hunger <br/>\ninduced grumpiness.<br/>\n<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228199454","msgId":40689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFCMDhBRkQ3LUI4N0YtNEIzRS1BOEE4LTk0NzdCNDYzNjZCRkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdoMmRtYiszcGxmQGVHcm91cHMuY29tPg==","referencesHeader":"PGdoMmRtYiszcGxmQGVHcm91cHMuY29tPg=="},"prevInTopic":40686,"nextInTopic":40710,"prevInTime":40688,"nextInTime":40690,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"-=-The whole idea of asking A s mom what I m allowed to feed her in my home is distasteful to me. I need to think on this some more ... whether I d be","messageBody":"<div id=\"ygrps-yiv-1022465220\">-=-The whole idea of asking A&#39;s mom what I&#39;m &quot;allowed&quot; to feed her in my<br/>\nhome is distasteful to me. I need to think on this some more ...<br/>\nwhether I&#39;d be willing to do this to make it easier for A to be here.-=-<br/>\n<br/>\nYou&#39;re putting negotations and rules ahead of principles.  You  <br/>\nalready know what the other mom wants.  You can do it or not do it,  <br/>\nbut all the fretting and writing and worrying about what you should  <br/>\nthink about asking about what you&#39;re allowed....   It&#39;s spinning your  <br/>\nwheels.<br/>\n<br/>\nIf your daughter wants to play, do the things you know will make that  <br/>\nsmoother and easier without trying to manipulate and dodge and stress.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228196209","msgId":40686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY3RDk5NDE3LUEwRjktNDFBMy04MkZELTMzQTRBMUMxOEM3REBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdoMmJmbCtjcmtiQGVHcm91cHMuY29tPg==","referencesHeader":"PGdoMmJmbCtjcmtiQGVHcm91cHMuY29tPg=="},"prevInTopic":40684,"nextInTopic":40689,"prevInTime":40685,"nextInTime":40687,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"-=-The reason A doesn t spend the night with us anymore is because of her allergies. I m not sure if that s real or something her Mom made up. My dd really","messageBody":"<div id=\"ygrps-yiv-2118844612\">-=-The reason A doesn&#39;t spend the night with us anymore is<br/>\nbecause of her &quot;allergies.&quot; I&#39;m not sure if that&#39;s real or something<br/>\nher Mom made up. My dd really misses A because she&#39;s so unavailable<br/>\nwith school and homework.-=-<br/>\n<br/>\nRather than clinging to that relationship, or encouraging your  <br/>\ndaughter to cling to it or have great hopes, maybe focus time and  <br/>\nenergy in other directions.  During winter break maybe the girls can  <br/>\nvisit.  Then Easter.  Then summer.  But with homework and school  <br/>\nbeing factors, this will get worse before it gets better.<br/>\n<br/>\n From your accounts, it sounds like it would be a huge problem even  <br/>\nif they were both homeschooled or if they were both in school.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":316703924,"authorName":"Keti Carazo","from":"&quot;Keti Carazo&quot; &lt;keti@...&gt;","profile":"eicnsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228192267","msgId":40684,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoMmRtYiszcGxmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlmNzJkNzYyMDgxMjAxMTYzNWw0ZDFiZGUwOXFiODA3OWZmODRjMmViMmU4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":40683,"nextInTopic":40686,"prevInTime":40683,"nextInTime":40685,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"... their ... I ve always had generally healthy food and comfort food readily available, but not huge amounts of junk food.  My kids usually ask me to make","messageBody":"<div id=\"ygrps-yiv-2094431969\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Margaret &lt;margaretz@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; From what you described, I think that having limited food for the<br/>\n&gt; girls (limited to what is generally considered healthy) at YOUR <br/>\n&gt;house<br/>\n&gt; would be preferable to the full on crazy controls and limits at <br/>\n </span></blockquote>their<br/>\n<blockquote><span title=\"ireply\"> &gt; house.   If you agree only to feed certain types of food, would her<br/>\n&gt; mom be OK with visits to your house again? <br/>\n<br/>\n </span></blockquote>I&#39;ve always had generally healthy food and comfort food readily <br/>\navailable, but not huge amounts of junk food.  My kids usually ask me <br/>\nto make them stuff. It&#39;s funny because I buy mostly organic and whole <br/>\nfoods and do a fair amount of cooking, but nothing especially fancy <br/>\nor rich. I make simple stuff without many processed ingredients. I <br/>\ndon&#39;t believe artificial sweetners and low fat/no fat stuff are <br/>\nhealthy, so I don&#39;t buy it. They don&#39;t seem to feed their dd all day <br/>\nand then have a &quot;normal&quot; dinner.  They have never asked me to not <br/>\nfeed their dd, but they always interrogate her as to what she ate and <br/>\nhow much (by phone) at regualr intervals.  There have been several <br/>\nnotable incidents where the Mom tried to control what dd would eat - <br/>\nonce at a party I had at my home. She brought juice for A to drink <br/>\ndespite the fact that I had juice on hand. The goal, I concluded, was <br/>\nto prevent her from drinking soda, something A loves. Didn&#39;t work. <br/>\nAnd almost escalated into a scene. Another incident involved A eating <br/>\na few pieces of hard candy at my house and the Mom freaked out (yes, <br/>\nyelling and screaming and out of control) in my home in front of me <br/>\nand the girls. At the time, I was too shocked to respond. And after, <br/>\nI had no clue what to say. That was the last straw for me and the <br/>\npoint where I started distancing myself from her. That was about <br/>\neight months ago.<br/>\n<br/>\nThe whole idea of asking A&#39;s mom what I&#39;m &quot;allowed&quot; to feed her in my <br/>\nhome is distasteful to me. I need to think on this some more ... <br/>\nwhether I&#39;d be willing to do this to make it easier for A to be here.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I<br/>\n&gt; think I would just try to find a way to support their friendship and<br/>\n&gt; your daughter as well as you can in less than ideal circumstances.<br/>\n&gt; Limiting food at home during visits might be the best way to do<br/>\n&gt; that... and at least then they are with you, not the controlling <br/>\n </span></blockquote>mom.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>What happens when A asks for something not on the &quot;approved&quot; list? <br/>\nThis creates a whole new set of moral and ethical questions. Yes, I <br/>\ncould just stick to the mom&#39;s wishes and tell her that, but how would <br/>\nshe feel?  I would feel horrible. I&#39;m having trouble seeing a this as <br/>\na solution. TV would definitely be easier!! <br/>\n<br/>\nKeti</div>","specialLinks":[]},{"userId":316703924,"authorName":"Keti Carazo","from":"&quot;Keti Carazo&quot; &lt;keti@...&gt;","profile":"eicnsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228190005","msgId":40683,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoMmJmbCtjcmtiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdoMWo1aStkaWplQGVHcm91cHMuY29tPg=="},"prevInTopic":40682,"nextInTopic":40684,"prevInTime":40682,"nextInTime":40684,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"... with the best friend family.  We did all of the things you are talking about here.  None of it worked really, but the act of helping, helped.  So, don t","messageBody":"<div id=\"ygrps-yiv-499401614\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Jenny C&quot; &lt;jenstarc4@...&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; We went through this exact same scenario, only different controls <br/>\n </span></blockquote>with the best friend family.  We did all of the things you are <br/>\ntalking about here.  None of it worked really, but the act of <br/>\nhelping, helped.  So, don&#39;t stop trying to find other things to do <br/>\nand other people to meet in the meantime.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Jenny, thanks for sharing your experience. The encouragement is <br/>\ncomforting! I liked they way you said that - &quot;the act of helping, <br/>\nhelped.&quot; I&#39;m trying hard to expand my dd&#39;s opportinities for social <br/>\nconnections through her interests and I think, down the road, it will <br/>\nhelp her feel more independent of this best friend.<br/>\n<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I wouldn&#39;t.  I was forced into a situation that I couldn&#39;t avoid <br/>\n </span></blockquote>with the parent of the best friend of my daughter, otherwise, I <br/>\nwould&#39;ve let it go. <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;<br/>\n<br/>\n </span></blockquote>I agree with you and Sandra that nothing positive would be <br/>\naccomplished by a confrontation with the mom - it would just create <br/>\nbad feelings and complicate an already difficult situation. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Now that she&#39;s been able to hang out a bit<br/>\n&gt; more with that friend, she sees how all that control has deeply <br/>\n&gt;impacted this friend, to such an extent that it has an impact on <br/>\n </span></blockquote>their relationship and how they deal with each other.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>I&#39;d like to know what you mean by the last part. Can you give an <br/>\nexample as to how they deal with each other? My dd feels she can&#39;t <br/>\ntalk to A about the food and control stuff (maybe they are still too <br/>\nyoung to identify/verbalize stuff like that?).  I see A starting a <br/>\nlot of attention-seeking behaviors and worry about her future. A has <br/>\nnot made any close friends besides my dd.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Your daughter is right, don&#39;t say anything more to this mom.  Your<br/>\n&gt; daughter is 12 and I assume her friend is too.  That is an age,<br/>\n&gt; especially if they are in school, where they change friends a lot <br/>\n&gt;and find social niches that are comfortable.  They may grow apart <br/>\n&gt;simply because of that aspect alone.  It may not seem as if they <br/>\n&gt;will, but in a year, at that age, kids change a lot and really fast.<br/>\n<br/>\n </span></blockquote>My daughter usually is right! Yes, they are both 12 and will turn 13 <br/>\nin March/May next year.  I&#39;ll try to remind myself of this when I get <br/>\nbogged down in the Mom&#39;s controlling behaviours.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; When I was trying to find answers for us, people suggested doing <br/>\n&gt;things, getting out, changing the focus.  The focus was really <br/>\n&gt;wanting to be with that friend and nothing else would do, so it was <br/>\n&gt;hard and my daughter was uncooperative about it, pining for her <br/>\n&gt;friend.<br/>\n<br/>\n </span></blockquote>I&#39;ve considered Sandra&#39;s suggestion to get the girls out doing things <br/>\nnot at home, however, the Mom is reluctant to allow this.  That is, <br/>\nshe&#39;s fine taking my dd places, but doesn&#39;t like me taking her dd <br/>\nanywhere. My dd likes to be at their house because they have lots of <br/>\ncool stuff.  The reason A doesn&#39;t spend the night with us anymore is <br/>\nbecause of her &quot;allergies.&quot; I&#39;m not sure if that&#39;s real or something <br/>\nher Mom made up. My dd really misses A because she&#39;s so unavailable <br/>\nwith school and homework.<br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Hindsight, though, I really believe that getting out with a little <br/>\n&gt;force helped a lot.  It was hard to push her, but it can be done in <br/>\n&gt;little ways and lots of encouragement. <br/>\n<br/>\n </span></blockquote>Dd is enjoying our unschooling group and the co-op, which hasn&#39;t <br/>\nproduced any new best friends, but does give her lots of social <br/>\ninteraction and things to talk about. It&#39;s helping. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It will pass.  Be patient and gentle and kind to your daughter and <br/>\n&gt;your daughter&#39;s friend.  You do have the advantage that you guys can <br/>\n&gt;still see this friend, don&#39;t do anything to change that.  If you <br/>\n&gt;lose contact,all of you guys lose, especially the other girl who <br/>\n&gt;won&#39;t have anywhere to escape from the yucky controlling existence <br/>\n&gt;at her own home.  <br/>\n<br/>\n </span></blockquote>Thanks, I need the reminder. I&#39;m doing okay ... mostly I struggle <br/>\nwith the damage the mom is doing to her dd.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Chamille also decided that she wasn&#39;t ok with going over to her <br/>\n&gt;friend&#39;s house.  For a while she put up with the yucky atmosphere to <br/>\n&gt;be with her friend.  It got to the point where she couldn&#39;t and <br/>\n&gt;wouldn&#39;t tolerate being around a complete jerk, even if it was to <br/>\n&gt;see her friend.  That worked in her favor too.  It also helps that <br/>\n&gt;I&#39;m willing to do ALL the driving and pay for things, it took away <br/>\n&gt;the first front of excuses for saying &quot;no&quot; to invites. <br/>\n<br/>\n </span></blockquote>I&#39;m glad you shared this ... it&#39;s interesting what kids choose over <br/>\ntime.  I suspect A will want to get away from her parents more and <br/>\nmore and if she spends more time with us, it will work to the girls <br/>\nadvantage. I&#39;ll try to find ways to make that more attractive to <br/>\neveryone. :)<br/>\n<br/>\nKeti</div>","specialLinks":[]},{"userId":316703924,"authorName":"Keti Carazo","from":"&quot;Keti Carazo&quot; &lt;keti@...&gt;","profile":"eicnsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228186981","msgId":40682,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoMjhoNStydnJ2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM4OTI1NzI1LTQ2REEtNDlFQi1CMDk3LURBMURDNTgxMTdBOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40681,"nextInTopic":40683,"prevInTime":40681,"nextInTime":40683,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"... withme and make oneself unavailable for very long is bad too.  I ve been on both sides of that (not someone purposely not answering a phone, but from","messageBody":"<div id=\"ygrps-yiv-310730780\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt; I wouldn&#39;t want my children with someone who was willing to lie to <br/>\n&gt; me.  And if my child is away from me, I&#39;d like to be able to all.   <br/>\n&gt; Then again, I didn&#39;t abuse it, but still... to have someone else&#39;s  <br/>\n&gt; child and make oneself unavailable is bad.  And to leave a child <br/>\n </span></blockquote>withme and make oneself unavailable for very long is bad too.  I&#39;ve <br/>\nbeen on both sides of that (not someone purposely not answering a <br/>\nphone, but from disorganization or forgetting to turn a phone one) <br/>\nand I don&#39;t think it&#39;s a good idea.<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; <br/>\n<br/>\n </span></blockquote>I&#39;m sorry I was not clear in my origial post about the intrusive <br/>\nphone calls ... the Mom was calling her dd on her cell phone and not <br/>\ncalling my cell phone. So, we were all sitting at dinner when the mom <br/>\ncalled A and asked her what she was eating.  I felt disturbed, but <br/>\ndidn&#39;t make any comment and acted like it didn&#39;t happen for the sake <br/>\nof everyone at the table. If the mom couldn&#39;t reach her dd (no signal <br/>\nor some other reason), I&#39;m certain she would call me and I would <br/>\nanswer the call for the reasons you stated. I DO want the mom to <br/>\ntrust me and allow her dd to do things with us and at our home.  I <br/>\nfeel like we are A&#39;s only safe haven.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And another point is not to idealize the relationship and project <br/>\n </span></blockquote>it  <br/>\n<blockquote><span title=\"ireply\"> &gt; into the future.  Jenny C made the point that 12 year olds change  <br/>\n&gt; friends even under all kinds of circumstances, so if this blows to  <br/>\n&gt; the point that the girls can&#39;t visit for a while, and if it turns  <br/>\n&gt; into forever, don&#39;t blame her parents so hard that it will seem to  <br/>\n&gt; her that they ruined a perfect lifelong friendship.<br/>\n<br/>\n </span></blockquote>Yes, this is a comforting thought, knowing both girls will change a <br/>\nlot over the next couple of years and to just be patient. My daughter <br/>\nis already outgrowing A on some levels, which is what&#39;s kept me from <br/>\nwanting to intervene or do anything that would disrupt with natural <br/>\nprogression.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I was enriched from knowing their families and I saw flaws in their <br/>\n&gt;parents&#39; relationship that were different from my own parents, and I <br/>\n&gt;saw how the rules and discipline in their families were different <br/>\n&gt;from mine (one more gentle and creative, one just secretive and <br/>\n&gt;mean), and that made me a better daughter and eventually a better <br/>\n </span></blockquote>mom.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Ah, this is a really insightful point!  Since my dd and I talk openly <br/>\nabout A&#39;s circumstances and issues, how and why we are different, I <br/>\nagree there is a lot my daughter is learning from this experience.<br/>\n<br/>\nThanks again for all the repsonses!<br/>\nKeti</div>","specialLinks":[]},{"userId":316703924,"authorName":"Keti Carazo","from":"&quot;Keti Carazo&quot; &lt;keti@...&gt;","profile":"eicnsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228185665","msgId":40681,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoMjc4MStrdmw3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdoMTluNCtqaWJmQGVHcm91cHMuY29tPg=="},"prevInTopic":40680,"nextInTopic":40682,"prevInTime":40680,"nextInTime":40682,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"... Like a bag lunch? ... Generally, if I know my dd will be at their house for more than two hours, I send her with an energy bar and some fruit - something","messageBody":"<div id=\"ygrps-yiv-1296011630\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Jenny C&quot; &lt;jenstarc4@...&gt; <br/>\nwrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; Could you pack meals and snacks for your daughter when she goes? <br/>\n </span></blockquote>Like a bag lunch?<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>Generally, if I know my dd will be at their house for more than two <br/>\nhours, I send her with an energy bar and some fruit - something she <br/>\ncan eat in a bedroom or playroom without the mom noticing. I hadn&#39;t <br/>\nconsidered sending a whole bag lunch, but it&#39;s an interesting idea.  <br/>\nI&#39;ve never asked my dd when and where she eats the snacks I provide, <br/>\nbut I will. She does eat them, and sometimes A does, too. I may try <br/>\nthe bag lunch idea the next time I know she&#39;ll spend an afternoon <br/>\nthere.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I wouldn&#39;t even tell the mom about the extra food. If the food is <br/>\n </span></blockquote>found out and the mom gets mad about it, you can tell her straight up <br/>\nthat you wanted to make sure that your daughter had enough food, <br/>\nsince she tends to come home hungry and cranky from lack of food. <br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>I&#39;d have no problem doing this ... in fact, I have on occasion called <br/>\ntheir home and asked if my dd was feeling okay and had enough to <br/>\neat.  The mom knows my dd gets low blood sugar and needs food - we <br/>\nhave discussed her food needs several times.<br/>\n<br/>\nThanks to all who have responded!!  I&#39;m feeling better just listening <br/>\nto your input.<br/>\n<br/>\nKeti</div>","specialLinks":[]},{"userId":211613982,"authorName":"Margaret","from":"Margaret &lt;margaretz@...&gt;","profile":"margaretzat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228178140","msgId":40680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlmNzJkNzYyMDgxMjAxMTYzNWw0ZDFiZGUwOXFiODA3OWZmODRjMmViMmU4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdndWd2citlZTY2QGVHcm91cHMuY29tPg==","referencesHeader":"PGdndWd2citlZTY2QGVHcm91cHMuY29tPg=="},"prevInTopic":40679,"nextInTopic":40681,"prevInTime":40679,"nextInTime":40681,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"I don t think you can change their limits and if you try, you may end up making it hard for the girls to spend time together.  It sounds like that is not what","messageBody":"<div id=\"ygrps-yiv-2116129195\">I don&#39;t think you can change their limits and if you try, you may end<br/>\nup making it hard for the girls to spend time together.  It sounds<br/>\nlike that is not what your daughter wants at all so I would stay away<br/>\nfrom that completely.  Your protein bar solution seems to be working<br/>\npretty well for visits over there and I would probably leave it at<br/>\nthat.  Send even more food, if your daughter needs it.<br/>\n<br/>\nFrom what you described, I think that having limited food for the<br/>\ngirls (limited to what is generally considered healthy) at YOUR house<br/>\nwould be preferable to the full on crazy controls and limits at their<br/>\nhouse.   If you agree only to feed certain types of food, would her<br/>\nmom be OK with visits to your house again?     I am not  saying you<br/>\nshould force your daughter to do this... more that you would get her<br/>\non board with the idea that if your family jumps through some hoops,<br/>\nher friend can visit you again and that would be more pleasant over<br/>\nall.<br/>\n<br/>\nI like the idea of taking the kids out too, but I think that food will<br/>\ncome up there too.  You go to the mall and the girls want something to<br/>\neat... but the food for sale there will probably be even less<br/>\nacceptable to them than the food you have at home.  You take them to a<br/>\nmovie and your daughter wants popcorn and a soda.  If they are<br/>\nanywhere together longer than an hour or two, food will come up.  I<br/>\nthink I would just try to find a way to support their friendship and<br/>\nyour daughter as well as you can in less than ideal circumstances.<br/>\nLimiting food at home during visits might be the best way to do<br/>\nthat... and at least then they are with you, not the controlling mom.<br/>\n<br/>\nWe had something sort of like this come up with a friend of my<br/>\ndaughter&#39;s who has very limited TV access and it just seems to work<br/>\nbest to stay within her mom&#39;s limits.  My daughter would rather have<br/>\nher friend over with the TV off most of the time than not see her<br/>\nfriend.<br/>\n<br/>\nMargaret<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Nov 30, 2008 at 9:02 AM, Keti Carazo &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:keti@...\">keti@...</a>&gt; wrote:<br/>\n&gt; Hi, my name is Keti and I&#39;ve been reading on this list for several<br/>\n&gt; months now at the suggestion of a good friend who has unschooled for<br/>\n&gt; many years. I enjoy reading and learning and hearing the multiple<br/>\n&gt; perspectives shared here. I have two kids: ds is 17 and dd is 12.<br/>\n&gt; We have attended two L&L conferences. The kids have been home for<br/>\n&gt; three plus years and we have been walking the path of unschooling for<br/>\n&gt; about a year and a half, enjoying life and watching everyone thrive.<br/>\n&gt;<br/>\n&gt; I really need some perspective on a difficult long-standing<br/>\n&gt; situation. It relates to my dd&#39;s best friend, A, a girl she met in<br/>\n&gt; third grade. A is a cool kid and dd enjoys the relationship. She&#39;s<br/>\n&gt; in school and her family is very entrenched in the &quot;culture of<br/>\n&gt; school&quot; to the point where they view it as the one and ONLY way. The<br/>\n&gt; mom has never overtly said she disapproves of how my kids are getting<br/>\n&gt; an education, nor has she ever asked what we do, however, there is a<br/>\n&gt; clear feeling of judgment and disapproval coming from her.<br/>\n&gt; Consequently, we have distanced ourselves from the family socially<br/>\n&gt; while allowing my dd and A to continue their friendship. A is<br/>\n&gt; completely controlled by her Mom. She&#39;s overweight and they control<br/>\n&gt; her food and drink. Couple of years ago the Mom and I had a<br/>\n&gt; conversation around the &quot;weight problem&quot; and she acknowledged that<br/>\n&gt; she herself has major food issues. I suggested then that perhaps<br/>\n&gt; some counseling for the Mom would be an option. She seemed open to<br/>\n&gt; that idea, said she had already considered it, etc. But, then the<br/>\n&gt; wall of denial came up and nothing ever happened  the simply<br/>\n&gt; continued controlling A. Time passed. I could see that they were<br/>\n&gt; not committed to doing anything different and began to distance<br/>\n&gt; myself from them. A has a lot of health problems  earlier this year<br/>\n&gt; they thought it was asthma, but instead it seems to have been anxiety<br/>\n&gt; attacks at  school. No surprise there. All that said, here&#39;s my<br/>\n&gt; problem.<br/>\n&gt;<br/>\n&gt; When A spends time at our house, we let her eat and drink what she<br/>\n&gt; wants. Consequently, they don&#39;t want A to be at our house. So, the<br/>\n&gt; only way my daughter can spend time with A is at their house. I&#39;m<br/>\n&gt; uncomfortable with the arrangement  they require the kids to jump on<br/>\n&gt; the trampoline after eating and other ridiculous things. They also<br/>\n&gt; don&#39;t feed my daughter enough food (and apple or a cereal bar is<br/>\n&gt; considered lunch). She comes home with low blood sugar and extremely<br/>\n&gt; irritated. My daughter doesn&#39;t mind the forced &quot;exercise&quot; but she<br/>\n&gt; doesn&#39;t like what they are willing to feed her. If she sleeps over,<br/>\n&gt; I usually give her a few protein bars so she has SOMETHING to eat,<br/>\n&gt; which helps. As an inside joke, my dd and I call their<br/>\n&gt; home &quot;starvation house.&quot; She&#39;s willing to tolerate this behavior so<br/>\n&gt; she can see her friend. It&#39;s so incredibly sad and heartbreaking.<br/>\n&gt; In the past, I&#39;ve discussed with the mom that my daughter is a<br/>\n&gt; growing girl and she eats a LOT of food and needs it while her body<br/>\n&gt; is developing and that she&#39;s been hungry at their house. Still,<br/>\n&gt; nothing changes. Sometimes they &quot;forget&quot; to feed the girls. The<br/>\n&gt; girls get together much less frequently and the sleepovers are even<br/>\n&gt; more rare, namely because A always has homework to do.<br/>\n&gt;<br/>\n&gt; I have been actively seeking outlets for my daughter to meet new<br/>\n&gt; friends for the last two years. I started a local unschooling group<br/>\n&gt; and we joined a local co-op. Both of these are new ventures and<br/>\n&gt; she&#39;s not met any girls around her age. We talk about the situation<br/>\n&gt; quite a bit and my daughter struggles with A and her limitations. We<br/>\n&gt; both very much want for her to develop friends with other unschooled<br/>\n&gt; or relaxed homeschooled kids. Just hasn&#39;t happened yet. My dd has<br/>\n&gt; talked about getting back into dance classes and I&#39;m optimistic that<br/>\n&gt; will give her some exposure to new girls to befriend. We&#39;ll probably<br/>\n&gt; start this in January.<br/>\n&gt;<br/>\n&gt; Given this background, is it worth it for me to, either verbally or<br/>\n&gt; in writing, broach the subject of controls again (e.g., where is<br/>\n&gt; affects me and my daughter, like the trampoline or going hungry) with<br/>\n&gt; the Mom?<br/>\n&gt;<br/>\n&gt; I&#39;d like to tell her how disrespectful it is to constantly call A<br/>\n&gt; when she&#39;s out with us and ask her what she ate, where she is, what<br/>\n&gt; she&#39;s doing, etc. This happened twice last night in a three hour<br/>\n&gt; period  it was a very rare occasion when A came to dinner with us.<br/>\n&gt; I think the girls are good enough friends that they won&#39;t grow apart<br/>\n&gt; anytime soon, so these situations will continue to come up. I&#39;m very<br/>\n&gt; tired of saying or doing nothing  it&#39;s a constant source of<br/>\n&gt; frustration and bad feelings for both me and my daughter. My<br/>\n&gt; daughter is afraid that if I say something, the mom won&#39;t be able to<br/>\n&gt; handle it and will not allow A to spend time with her at all. I<br/>\n&gt; seriously need suggestions on either how to speak up to the mom (and<br/>\n&gt; not care about the outcome) and/or how to deal with my overwhelming<br/>\n&gt; feelings and find workarounds to specific situations.<br/>\n&gt;<br/>\n&gt; Kindly,<br/>\n&gt; Keti<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228173675","msgId":40679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4OTI1NzI1LTQ2REEtNDlFQi1CMDk3LURBMURDNTgxMTdBOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdoMWo1aStkaWplQGVHcm91cHMuY29tPg==","referencesHeader":"PGdoMWo1aStkaWplQGVHcm91cHMuY29tPg=="},"prevInTopic":40678,"nextInTopic":40680,"prevInTime":40678,"nextInTime":40680,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"-=-I wouldn t answer the phone. In general social ettiquette, it s rude to answer the phone during a meal anyway. Unless the daughter has a cell phone, you are","messageBody":"<div id=\"ygrps-yiv-1160314334\">-=-I wouldn&#39;t answer the phone. In general social ettiquette, it&#39;s  <br/>\nrude to<br/>\nanswer the phone during a meal anyway. Unless the daughter has a cell<br/>\nphone, you are under no obligation to answer your phone to this mom.<br/>\nYou can listen to her voicemail and call her back a bit later. Tell her<br/>\nyou guys were busy and didn&#39;t hear the phone, then put your phone on<br/>\nvibrate, if it&#39;s a cell, and turn the ringer off if it&#39;s a landline.-=-<br/>\n<br/>\nI wouldn&#39;t want my children with someone who was willing to lie to  <br/>\nme.  And if my child is away from me, I&#39;d like to be able to call.   <br/>\nThen again, I didn&#39;t abuse it, but still... to have someone else&#39;s  <br/>\nchild and make oneself unavailable is bad.  And to leave a child with  <br/>\nme and make oneself unavailable for very long is bad too.  I&#39;ve been  <br/>\non both sides of that (not someone purposely not answering a phone,  <br/>\nbut from disorganization or forgetting to turn a phone one) and I  <br/>\ndon&#39;t think it&#39;s a good idea.<br/>\n<br/>\n-=-When we were finally able to circumvent that by getting in contact  <br/>\nwith the mom who has visits on the weekends, things changed a little  <br/>\nbecause the dad realized he couldn&#39;t control everything. -=-<br/>\n<br/>\n From the other side too, give up the idea of controlling or changing  <br/>\nthe other family.  Look to helping your own child have the contact  <br/>\nshe wants to have, knowing it won&#39;t be ideal.<br/>\n<br/>\nAnd another point is not to idealize the relationship and project it  <br/>\ninto the future.  Jenny C made the point that 12 year olds change  <br/>\nfriends even under all kinds of circumstances, so if this blows to  <br/>\nthe point that the girls can&#39;t visit for a while, and if it turns  <br/>\ninto forever, don&#39;t blame her parents so hard that it will seem to  <br/>\nher that they ruined a perfect lifelong friendship.   I had two VERY,  <br/>\nvery close friends when I was 9-12, and 14-17.  I&#39;m still slightly in  <br/>\ncontact with them (funerals and that) but our adult lives are very  <br/>\ndifferent.  The relationships were rich and full and good when we  <br/>\nwere girls.  I was enriched from knowing their families and I saw  <br/>\nflaws in their parents&#39; relationship that were different from my own  <br/>\nparents, and I saw how the rules and discipline in their families  <br/>\nwere different from mine (one more gentle and creative, one just  <br/>\nsecretive and mean), and that made me a better daughter and  <br/>\neventually a better mom.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228165106","msgId":40678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoMWo1aStkaWplQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdndWd2citlZTY2QGVHcm91cHMuY29tPg=="},"prevInTopic":40676,"nextInTopic":40679,"prevInTime":40677,"nextInTime":40679,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"... We went through this exact same scenario, only different controls with the best friend family.  We did all of the things you are talking about here.  None","messageBody":"<div id=\"ygrps-yiv-1256246123\"><blockquote><span title=\"ireply\">&gt; I have been actively seeking outlets for my daughter to meet new<br/>\n&gt; friends for the last two years. I started a local unschooling group<br/>\n&gt; and we joined a local co-op. Both of these are new ventures and<br/>\n&gt; she&#39;s not met any girls around her age. We talk about the situation<br/>\n&gt; quite a bit and my daughter struggles with A and her limitations. We<br/>\n&gt; both very much want for her to develop friends with other unschooled<br/>\n&gt; or relaxed homeschooled kids. Just hasn&#39;t happened yet. My dd has<br/>\n&gt; talked about getting back into dance classes and I&#39;m optimistic that<br/>\n&gt; will give her some exposure to new girls to befriend. We&#39;ll probably<br/>\n&gt; start this in January.<br/>\n<br/>\n </span></blockquote>We went through this exact same scenario, only different controls with<br/>\nthe best friend family.  We did all of the things you are talking about<br/>\nhere.  None of it worked really, but the act of helping, helped.  So,<br/>\ndon&#39;t stop trying to find other things to do and other people to meet in<br/>\nthe meantime.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Given this background, is it worth it for me to, either verbally or<br/>\n&gt; in writing, broach the subject of controls again (e.g., where is<br/>\n&gt; affects me and my daughter, like the trampoline or going hungry) with<br/>\n&gt; the Mom?<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t.  I was forced into a situation that I couldn&#39;t avoid with<br/>\nthe parent of the best friend of my daughter, otherwise, I would&#39;ve let<br/>\nit go.  The dad called to discuss an &quot;issue&quot; in regards to our<br/>\ndaughters, and wanted to discuss it among the parents first.  He was<br/>\nconfrontational, and I figured right then and there, we would lose,<br/>\nbecause he wasn&#39;t trying to find a workable solution, so, since I knew I<br/>\nhad nothing to lose anyway, I spoke my mind.  It gave him the excuse he<br/>\nneeded to do what he wanted to do, but I made it clear to both the girls<br/>\nthat none of it was coming from me, and since they are smart kids, they<br/>\nalready knew that.<br/>\n<br/>\nThat was about a year and a half ago.  That friend hates her father. <br/>\nHer daily life is hell.  Chamille knows her life is better and while she<br/>\nstill loves that friend a great deal, she&#39;s not desperate anymore<br/>\nbecause her life IS good.  Now that she&#39;s been able to hang out a bit<br/>\nmore with that friend, she sees how all that control has deeply impacted<br/>\nthis friend, to such an extent that it has an impact on their<br/>\nrelationship and how they deal with each other.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d like to tell her how disrespectful it is to constantly call A<br/>\n&gt; when she&#39;s out with us and ask her what she ate, where she is, what<br/>\n&gt; she&#39;s doing, etc. This happened twice last night in a three hour<br/>\n&gt; period  it was a very rare occasion when A came to dinner with<br/>\n </span></blockquote>us.<br/>\n<br/>\nI wouldn&#39;t answer the phone.  In general social ettiquette, it&#39;s rude to<br/>\nanswer the phone during a meal anyway.  Unless the daughter has a cell<br/>\nphone, you are under no obligation to answer your phone to this mom. <br/>\nYou can listen to her voicemail and call her back a bit later.  Tell her<br/>\nyou guys were busy and didn&#39;t hear the phone, then put your phone on<br/>\nvibrate, if it&#39;s a cell, and turn the ringer off if it&#39;s a landline.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think the girls are good enough friends that they won&#39;t grow apart<br/>\n&gt; anytime soon, so these situations will continue to come up. I&#39;m very<br/>\n&gt; tired of saying or doing nothing  it&#39;s a constant source of<br/>\n&gt; frustration and bad feelings for both me and my daughter. My<br/>\n&gt; daughter is afraid that if I say something, the mom won&#39;t be able to<br/>\n&gt; handle it and will not allow A to spend time with her at all.<br/>\n<br/>\n </span></blockquote>Your daughter is right, don&#39;t say anything more to this mom.  Your<br/>\ndaughter is 12 and I assume her friend is too.  That is an age,<br/>\nespecially if they are in school, where they change friends a lot and<br/>\nfind social niches that are comfortable.  They may grow apart simply<br/>\nbecause of that aspect alone.  It may not seem as if they will, but in a<br/>\nyear, at that age, kids change a lot and really fast.<br/>\n<br/>\nI know exactly how you are feeling.  I took a while to respond to this<br/>\nemail, simply because I really can feel your pain, we&#39;ve been there! <br/>\nWhen I was trying to find answers for us, people suggested doing things,<br/>\ngetting out, changing the focus.  The focus was really wanting to be<br/>\nwith that friend and nothing else would do, so it was hard and my<br/>\ndaughter was uncooperative about it, pining for her friend.<br/>\n<br/>\nHindsight, though, I really believe that getting out with a little force<br/>\nhelped a lot.  It was hard to push her, but it can be done in little<br/>\nways and lots of encouragement.  Letting my daughter react how she<br/>\nwanted, be who she wanted to be, encouraging her other intersts, all<br/>\nhelped in small ways.<br/>\n<br/>\nIt will pass.  Be patient and gentle and kind to your daughter and your<br/>\ndaughter&#39;s friend.  You do have the advantage that you guys can still<br/>\nsee this friend, don&#39;t do anything to change that.  If you lose contact,<br/>\nall of you guys lose, especially the other girl who won&#39;t have anywhere<br/>\nto escape from the yucky controlling existence at her own home.  That<br/>\nwas the worst part for us, the dad routinely grounded his daughter from<br/>\nmy daughter, still does, but the initial really bad grounding lasted<br/>\nmonths.  When we were finally able to circumvent that by getting in<br/>\ncontact with the mom who has visits on the weekends, things changed a<br/>\nlittle because the dad realized he couldn&#39;t control everything.  He<br/>\ncouldn&#39;t keep his daughter from seeing her friend, and the grounding<br/>\ndidn&#39;t count as much or last as long.<br/>\n<br/>\nChamille also decided that she wasn&#39;t ok with going over to her friend&#39;s<br/>\nhouse.  For a while she put up with the yucky atmosphere to be with her<br/>\nfriend.  It got to the point where she couldn&#39;t and wouldn&#39;t tolerate<br/>\nbeing around a complete jerk, even if it was to see her friend.  That<br/>\nworked in her favor too.  It also helps that I&#39;m willing to do ALL the<br/>\ndriving and pay for things, it took away the first front of excuses for<br/>\nsaying &quot;no&quot; to invites.  And, last, but not least, since the dad and I<br/>\naren&#39;t on speaking terms, my husband will call and negotiate for the<br/>\ngirls.  Since my husband wasn&#39;t involved in the confrontation, and he&#39;s<br/>\na man, he carries more weight in that dynamic. (yes on top of all of<br/>\nthis, the guy is a sexist and bigotted person)</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228155428","msgId":40676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdoMTluNCtqaWJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdndnNtciszdnRrQGVHcm91cHMuY29tPg=="},"prevInTopic":40665,"nextInTopic":40678,"prevInTime":40675,"nextInTime":40677,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"... a bag lunch? ... those, while sending (more ... understandable for you to say, ... sugar levels, so I m ... as much of this as ... I was going to suggest","messageBody":"<div id=\"ygrps-yiv-987016708\"><blockquote><span title=\"ireply\">&gt; Could you pack meals and snacks for your daughter when she goes? Like<br/>\n </span></blockquote>a bag lunch?<br/>\n<blockquote><span title=\"ireply\"> &gt; And, if they have rules like &#39;no candy&#39; etc, maybe try to respect<br/>\n </span></blockquote>those, while sending (more<br/>\n<blockquote><span title=\"ireply\"> &gt; than) enough food for your dd? I think it would be totally<br/>\n </span></blockquote>understandable for you to say,<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;My dd needs to eat a certain amount of food to maintain her blood<br/>\n </span></blockquote>sugar levels, so I&#39;m<br/>\n<blockquote><span title=\"ireply\"> &gt; sending meals along with her to be sure she eats enough. She can eat<br/>\n </span></blockquote>as much of this as<br/>\n<blockquote><span title=\"ireply\"> &gt; she wants in addition to any food you provide for her.&quot;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I was going to suggest sending a bag of food along, however if it were<br/>\nmy daughter, going over to a food control house, I might tell her to<br/>\nkeep her food in her bag and eat it privately in the bedroom away from<br/>\nprying eyes, or after parents go to bed.  I wouldn&#39;t even tell the mom<br/>\nabout the extra food.<br/>\n<br/>\nIf the food is found out and the mom gets mad about it, you can tell her<br/>\nstraight up that you wanted to make sure that your daughter had enough<br/>\nfood, since she tends to come home hungry and cranky from lack of food. <br/>\nThen, the other mom can either provide more food for your daughter on<br/>\nthe next visit, or encounter uncrolled food entering her house.<br/>\n<br/>\nI don&#39;t know if that is the right thing to do or not, just what I would<br/>\ndo in the same scenario.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228114655","msgId":40665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCRTQ3QUY2LUQ5ODktNEE1MS1BODJELUFCODExRjU1Q0Q0OUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENDOTc1RkMxLTczNEYtNDY5MC1BMTU2LUNGRTkyRjJGNUYwNUBtYWMuY29tPg==","referencesHeader":"PGdndnNtciszdnRrQGVHcm91cHMuY29tPiA8Q0M5NzVGQzEtNzM0Ri00NjkwLUExNTYtQ0ZFOTJGMkY1RjA1QG1hYy5jb20+"},"prevInTopic":40664,"nextInTopic":40676,"prevInTime":40664,"nextInTime":40666,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"-=-Or maybe label it with a permission slip - My daughter, ___________, has permission to eat as little or as much of this food as she desires at any time","messageBody":"<div id=\"ygrps-yiv-167396843\">-=-Or maybe label it with a &quot;permission slip&quot; - &quot;My daughter,<br/>\n___________, has permission to eat as little or as much of this food<br/>\nas she desires at any time she chooses.&quot;-=-<br/>\n<br/>\nThat might be a good way to break up the situation, though.  The mom  <br/>\nwill take it as an affront, and it will be the source of contention.   <br/>\nShe would probably see it as a social slap at her daughter&#39;s weight,  <br/>\nand not at her parenting.  Like the visiting girl &quot;can eat all she  <br/>\nwants&quot; but her daughter &quot;can&#39;t.&quot;<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228114368","msgId":40664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENDOTc1RkMxLTczNEYtNDY5MC1BMTU2LUNGRTkyRjJGNUYwNUBtYWMuY29tPg==","inReplyToHeader":"PGdndnNtciszdnRrQGVHcm91cHMuY29tPg==","referencesHeader":"PGdndnNtciszdnRrQGVHcm91cHMuY29tPg=="},"prevInTopic":40663,"nextInTopic":40665,"prevInTime":40663,"nextInTime":40665,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"Or maybe label it with a permission slip - My daughter, ___________, has permission to eat as little or as much of this food as she desires at any time she","messageBody":"<div id=\"ygrps-yiv-1462208829\">Or maybe label it with a &quot;permission slip&quot; - &quot;My daughter,  <br/>\n___________, has permission to eat as little or as much of this food  <br/>\nas she desires at any time she chooses.&quot;<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Nov 30, 2008, at 9:28 PM, Lauren wrote:<br/>\n<br/>\n&gt; With the strong controls in the home, I might even label the meals/ <br/>\n&gt; snacks (ie: lunch,<br/>\n&gt; afternoon snack, dinner, etc.) so that they don&#39;t withhold anything  <br/>\n&gt; from your dd until a<br/>\n&gt; later time if they think it&#39;s too much food... </span></blockquote></div>","specialLinks":[]},{"userId":246499406,"authorName":"Lauren","from":"&quot;Lauren&quot; &lt;yis4yoga@...&gt;","profile":"yis4yoga","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228109339","msgId":40663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdndnNtciszdnRrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdndWd2citlZTY2QGVHcm91cHMuY29tPg=="},"prevInTopic":40651,"nextInTopic":40664,"prevInTime":40662,"nextInTime":40664,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"... Could you pack meals and snacks for your daughter when she goes?  Like a bag lunch? And, if they have rules like no candy etc, maybe try to respect","messageBody":"<div id=\"ygrps-yiv-868427056\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Keti Carazo&quot; &lt;keti@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; They also <br/>\n&gt; don&#39;t feed my daughter enough food (and apple or a cereal bar is <br/>\n&gt; considered lunch).  She comes home with low blood sugar and extremely <br/>\n&gt; irritated. My daughter doesn&#39;t mind the forced &quot;exercise&quot; but she <br/>\n&gt; doesn&#39;t like what they are willing to feed her.  <br/>\n<br/>\n </span></blockquote>Could you pack meals and snacks for your daughter when she goes?  Like a bag lunch?  <br/>\nAnd, if they have rules like &#39;no candy&#39; etc, maybe try to respect those, while sending (more <br/>\nthan) enough food for your dd?  I think it would be totally understandable for you to say, <br/>\n&quot;My dd needs to eat a certain amount of food to maintain her blood sugar levels, so I&#39;m <br/>\nsending meals along with her to be sure she eats enough.  She can eat as much of this as <br/>\nshe wants in addition to any food you provide for her.&quot;  <br/>\n<br/>\nWith the strong controls in the home, I might even label the meals/snacks (ie: lunch, <br/>\nafternoon snack, dinner, etc.) so that they don&#39;t withhold anything from your dd until a <br/>\nlater time if they think it&#39;s too much food...<br/>\n<br/>\nHTH!<br/>\n<br/>\nLauren :)</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228073695","msgId":40651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBQ0FBNEE2LUJCRjEtNEM2RS1CMUYwLTkxNkY0RDQxRjIwQkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdndWd2citlZTY2QGVHcm91cHMuY29tPg==","referencesHeader":"PGdndWd2citlZTY2QGVHcm91cHMuY29tPg=="},"prevInTopic":40648,"nextInTopic":40663,"prevInTime":40650,"nextInTime":40652,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"-=-Given this background, is it worth it for me to, either verbally or in writing, broach the subject of controls again (e.g., where is affects me and my","messageBody":"<div id=\"ygrps-yiv-505019248\">-=-Given this background, is it worth it for me to, either verbally or<br/>\nin writing, broach the subject of controls again (e.g., where is<br/>\naffects me and my daughter, like the trampoline or going hungry) with<br/>\nthe Mom?-=-<br/>\n<br/>\nI wouldn&#39;t.<br/>\n<br/>\nMaybe you could call after a couple of hours and say &quot;Did you  <br/>\nremember to feed the girls?  I heard you forgot once...&quot;   :-)<br/>\n<br/>\nOr just make sure your daughter eats before she goes, and have some  <br/>\nfood available when she gets back, or take some with you when you go  <br/>\nto pick her up or something.<br/>\n<br/>\n-=-I&#39;d like to tell her how disrespectful it is to constantly call A  <br/>\nwhen she&#39;s out with us and ask her what she ate, where she is, what  <br/>\nshe&#39;s doing, etc.-=-<br/>\n<br/>\nCould you be gone?  What about making the next few visits something  <br/>\nlike museums or parks or something active (walking at least)?  It  <br/>\ncould involve a little food but not involve your whole house full of  <br/>\nfood.<br/>\n<br/>\n-=-I&#39;m very tired of saying or doing nothing  it&#39;s a constant source  <br/>\nof frustration and bad feelings for both me and my daughter. -=-<br/>\n<br/>\nYou can&#39;t change the mom, but you can change the circumstances.  Her  <br/>\nhouse and yours are both problematical.  Find other places.  Hike the  <br/>\nmall.  Go to the movies.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":316703924,"authorName":"Keti Carazo","from":"&quot;Keti Carazo&quot; &lt;keti@...&gt;","profile":"eicnsmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Intro & dealing with controlling mom of dd&#39;s friend","postDate":"1228064571","msgId":40648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdndWd2citlZTY2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":40651,"prevInTime":40647,"nextInTime":40649,"topicId":40648,"numMessagesInTopic":0,"msgSnippet":"Hi, my name is Keti and I ve been reading on this list for several months now at the suggestion of a good friend who has unschooled for many years.  I enjoy","messageBody":"<div id=\"ygrps-yiv-2135581896\">Hi, my name is Keti and I&#39;ve been reading on this list for several <br/>\nmonths now at the suggestion of a good friend who has unschooled for <br/>\nmany years.  I enjoy reading and learning and hearing the multiple <br/>\nperspectives shared here.  I have two kids: ds is 17 and dd is 12.  <br/>\nWe have attended two L&L conferences. The kids have been home for <br/>\nthree plus years and we have been walking the path of unschooling for <br/>\nabout a year and a half, enjoying life and watching everyone thrive. <br/>\n<br/>\nI really need some perspective on a difficult long-standing <br/>\nsituation.  It relates to my dd&#39;s best friend, A, a girl she met in <br/>\nthird grade.  A is a cool kid and dd enjoys the relationship.  She&#39;s <br/>\nin school and her family is very entrenched in the &quot;culture of <br/>\nschool&quot; to the point where they view it as the one and ONLY way.  The <br/>\nmom has never overtly said she disapproves of how my kids are getting <br/>\nan education, nor has she ever asked what we do, however, there is a <br/>\nclear feeling of judgment and  disapproval coming from her. <br/>\nConsequently, we have distanced ourselves from the family socially <br/>\nwhile allowing my dd and A to continue their friendship.  A is <br/>\ncompletely controlled by her Mom.  She&#39;s overweight and they control <br/>\nher food and drink. Couple of years ago the Mom and I had a <br/>\nconversation around the &quot;weight problem&quot; and she acknowledged that <br/>\nshe herself has major food issues.  I suggested then that perhaps <br/>\nsome counseling for the Mom would be an option.  She seemed open to <br/>\nthat idea, said she had already considered it, etc.  But, then the <br/>\nwall of denial came up and nothing ever happened  the simply <br/>\ncontinued controlling A.  Time passed.  I could see that they were <br/>\nnot committed to doing anything different and began to distance <br/>\nmyself from them.  A has a lot of health problems  earlier this year <br/>\nthey thought it was asthma, but instead it seems to have been anxiety <br/>\nattacks at  school.  No surprise there.  All that said, here&#39;s my <br/>\nproblem. <br/>\n<br/>\nWhen A spends time at our house, we let her eat and drink what she <br/>\nwants.  Consequently, they don&#39;t want A to be at our house.  So,  the <br/>\nonly way my daughter can spend time with A is at their house.  I&#39;m  <br/>\nuncomfortable with the arrangement  they require the kids to jump on <br/>\nthe trampoline after eating and other ridiculous things.  They also <br/>\ndon&#39;t feed my daughter enough food (and apple or a cereal bar is <br/>\nconsidered lunch).  She comes home with low blood sugar and extremely <br/>\nirritated. My daughter doesn&#39;t mind the forced &quot;exercise&quot; but she <br/>\ndoesn&#39;t like what they are willing to feed her.  If she sleeps over, <br/>\nI usually give her a few protein bars so she has SOMETHING to eat, <br/>\nwhich helps. As an inside joke, my dd and I call their <br/>\nhome &quot;starvation house.&quot;  She&#39;s willing to tolerate this behavior so <br/>\nshe can see her friend.  It&#39;s so incredibly sad and heartbreaking.  <br/>\nIn the past, I&#39;ve discussed with the mom that my daughter is a <br/>\ngrowing girl and she eats a LOT of food and needs it while her body <br/>\nis developing and that she&#39;s been hungry at their house.  Still, <br/>\nnothing changes.  Sometimes they &quot;forget&quot; to feed the girls.  The <br/>\ngirls get together much less frequently and the sleepovers are even <br/>\nmore rare, namely because A always has homework to do.<br/>\n<br/>\nI have been actively seeking outlets for my daughter to meet new <br/>\nfriends for the last two years.  I started a local unschooling group <br/>\nand we joined a local co-op.  Both of these are new ventures and <br/>\nshe&#39;s not met any girls around her age.  We talk about the situation <br/>\nquite a bit and my daughter struggles with A and her limitations. We <br/>\nboth very much want for her to develop friends with other unschooled <br/>\nor relaxed homeschooled kids.  Just hasn&#39;t happened yet.  My dd has <br/>\ntalked about getting back into dance classes and I&#39;m optimistic that <br/>\nwill give her some exposure to new girls to befriend.  We&#39;ll probably <br/>\nstart this in January.<br/>\n<br/>\nGiven this background, is it worth it for me to, either verbally or <br/>\nin writing, broach the subject of controls again (e.g., where is <br/>\naffects me and my daughter, like the trampoline or going hungry) with <br/>\nthe Mom?<br/>\n<br/>\nI&#39;d like to tell her how disrespectful it is to constantly call A <br/>\nwhen she&#39;s out with us and ask her what she ate, where she is, what <br/>\nshe&#39;s doing, etc.  This happened twice last night in a three hour <br/>\nperiod  it was a very rare occasion when A came to dinner with us.  <br/>\nI think the girls are good enough friends that they won&#39;t grow apart <br/>\nanytime soon, so these situations will continue to come up.  I&#39;m very <br/>\ntired of saying or doing nothing  it&#39;s a constant source of <br/>\nfrustration and bad feelings for both me and my daughter.  My <br/>\ndaughter is afraid that if I say something, the mom won&#39;t be able to <br/>\nhandle it and will not allow A to spend time with her at all.  I <br/>\nseriously need suggestions on either how to speak up to the mom (and <br/>\nnot care about the outcome) and/or how to deal with my overwhelming <br/>\nfeelings and  find workarounds to specific situations.   <br/>\n<br/>\nKindly,<br/>\nKeti</div>","specialLinks":[]}],"prevTopicId":40666,"nextTopicId":40726}}