{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":263488403,"authorName":"hmbpie","from":"&quot;hmbpie&quot; &lt;heatherpie@...&gt;","profile":"hmbpie","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: death of a pet","postDate":"1326727641","msgId":65084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpmMWZrcCthdTRwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpldjM2aCtuZ3V0QGVHcm91cHMuY29tPg=="},"prevInTopic":65055,"nextInTopic":0,"prevInTime":65083,"nextInTime":65085,"topicId":65039,"numMessagesInTopic":0,"msgSnippet":"Our dog Debbie died suddenly on New Year s Day about three years ago.  We think she had a seizure.  None of us were prepared for her to leave our lives","messageBody":"<div id=\"ygrps-yiv-1703576999\">Our dog Debbie died suddenly on New Year&#39;s Day about three years ago.  We think she had a seizure.  None of us were prepared for her to leave our lives forever.  She was the best dog we had ever had and fit our family so perfectly.<br/>\n<br/>\nThat night we were trying to think of a way to honor her and have some sort of a ceremony, but were just so stunned and greif stricken that we were having a hard time thinking or even expressing our feelings.  I got some pretty pens, paper and ribbon and we all sat down at the table and wrote letters and drew pictures for Debbie.  When we were done we tied them to the branches of the tree we found her under in hopes that by the time the letters were worn and had blown away the pain would be gone.  We lit a candle and let it burn all night for her.  We lit another candle last New Years for her also in rememberance.  <br/>\n<br/>\nThe last letter fell this summer.  It wasn&#39;t until I read your post that it occured to me that we didn&#39;t light a candle for her this year. We didn&#39;t even think about her on New Year&#39;s Day.  We were driving home from Always Learnng Live and were filled up with happiness.:)<br/>\n<br/>\n<br/>\nSometimes when our hearts are full of so much pain and grief it is hard to speak, even to the people we love.  Writing down all the things we can&#39;t say can break up the anguish and help it move out.</div>","specialLinks":[]},{"userId":331885657,"authorName":"Jennifer Schuelein","from":"&quot;Jennifer Schuelein&quot; &lt;fairiedust66@...&gt;","profile":"jenfromtx6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: death of a pet","postDate":"1326663163","msgId":65055,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpldmdscit2azk2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpldjM2aCtuZ3V0QGVHcm91cHMuY29tPg=="},"prevInTopic":65050,"nextInTopic":65084,"prevInTime":65054,"nextInTime":65056,"topicId":65039,"numMessagesInTopic":0,"msgSnippet":"We have had 1 dog and 1 cat pass away as well as several hamsters. My son cried for days over both of them. He took the cat s passing especially hard. After","messageBody":"<div id=\"ygrps-yiv-1088723062\">We have had 1 dog and 1 cat pass away as well as several hamsters. My son cried for days over both of them. He took the cat&#39;s passing especially hard. After the initial shock subsided, he decided that he wanted to frame a few pictures of the kitty so he could remember her. We have both a baby picture and an adult picture framed in his room. <br/>\n<br/>\nHonestly, the very best thing is to be available, but not pushy. It takes time. Be gentle and kind. Do what your daughter wants you to do. She&#39;s old enough to have a good active communication about how she&#39;s feeling and what she wants. Offer to do her favorite things, go on a walk, or take her to a spot she&#39;s been wanting to visit. <br/>\n<br/>\nAnother thing...when our dog passed, we took her collar, sweater and a picture and put them together in shadow box. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;michelle_m29&quot; &lt;mmarr@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I hope it&#39;s okay to post this to the list. We&#39;re more ecclectic homeschoolers than real unschoolers, but I&#39;d really like some advice on dealing with this situation and I think this is probably the best place to ask. <br/>\n&gt; <br/>\n&gt; My almost fifteen year old daughter&#39;s pet cockatiel died late Thursday afternoon. This wasn&#39;t a &quot;find the bird lying at the bottom of the cage&quot; thing.  She came home and noticed Luna was acting oddly (this bird spent a big chunk of every day on her shoulder or the back of her chair and she knew Luna&#39;s every mood and twitch) then over the next two or three hours it got steadily worse until Luna died in her hands. <br/>\n&gt; <br/>\n&gt; We&#39;ve had pets die before -- a cat who was hit by a car, an old cat who vanished and turned up in pieces more than a year later (we&#39;ve got acreage and apparently something found where she had died and dragged her back up near the house), geese and chickens that we&#39;ve lost to accidents and predators.  Nothing has upset my daughter like the loss of this bird. <br/>\n&gt; <br/>\n&gt; My daughter doesn&#39;t get really upset all that often. <br/>\n&gt; <br/>\n&gt; Now I&#39;m questioning everything I&#39;m doing. <br/>\n&gt; <br/>\n&gt; I cut off a big hunk of quilting fabric for her to wrap Luna in. That seemed better than a ratty old towel. Do I get rid of the rest of that fabric? Stash it up in my sewing room in case she decides she wants to do something with it later? Just cut it up and use it in scrap quilts like I&#39;d originally planned?<br/>\n&gt; <br/>\n&gt; What about the box I gave her to put the bird in that we didn&#39;t use because it was the wrong size?  It was a nice box that I&#39;d planned to use for something else...but now it&#39;s &quot;the box the dead bird didn&#39;t fit in.&quot; I think I&#39;ll wind up tossing it just because it bugs me.<br/>\n&gt; <br/>\n&gt; My husband (her dad) helped her bury Luna under one of our big oak trees and took her out the next day to buy some flower bulbs to plant.<br/>\n&gt; Later, my daughter asked if he&#39;d really liked the bird more than she thought he did because he was making such a big deal out of things.<br/>\n&gt; <br/>\n&gt; I wasn&#39;t sure what to do about the cage. It&#39;s going out into the barn because eventually someone&#39;s gonna want a cage for something, but I didn&#39;t want to rush it out of her room. Yesterday, she asked if she could put it out in the shop because every time she walked into her room it rattled a bit. I&#39;d noticed the same thing -- the effect was  really creepy. I think the table we brought into her room for the cage is still there. Do I offer to take it out into the barn, or wait to see what she decides to do on her own -- if she wants to repurpose it for something else or move it out of her room? <br/>\n&gt; <br/>\n&gt; I guess what I&#39;m struggling with most is what do I do now? I don&#39;t want to ignore it if she&#39;s hurting, but it doesn&#39;t seem right to keep asking if she&#39;s okay. <br/>\n&gt; <br/>\n&gt; And I&#39;m not sure if I handled it well with the other kids. We waited two days to tell the youngest two (6 and 7) because we wanted to give our daughter some time to greive without them bugging her. Honestly, I don&#39;t think they get it at all beyond the fact that the bird&#39;s gone. And I&#39;m not even sure they noticed that. <br/>\n&gt; <br/>\n&gt; My eleven year old son&#39;s reaction was a horrified and repeated &quot;Are you sure?&quot; I&#39;m afraid he thought we might&#39;ve buried the bird alive.  Either that, or he just didn&#39;t want to believe it was true.  <br/>\n&gt; <br/>\n&gt; Sorry if I included way too much backstory here, but I thought this needed more than &quot;My daughter&#39;s bird died -- what do I do now?&quot; <br/>\n&gt; <br/>\n&gt; Michelle<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: death of a pet","postDate":"1326660599","msgId":65050,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGNTYxRDlBLTg1NzMtNEYzNS1CMzgzLURDMTQ5MzRFQUUwMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpldjU5Zys3Y2hxQGVHcm91cHMuY29tPg==","referencesHeader":"PGpldjU5Zys3Y2hxQGVHcm91cHMuY29tPg=="},"prevInTopic":65049,"nextInTopic":65055,"prevInTime":65049,"nextInTime":65051,"topicId":65039,"numMessagesInTopic":0,"msgSnippet":"-=-Your home is likely full of reminders of the bird. Clothes, furniture, spots on the rug, random feathers in the corners. Earrings the bird disassembled may","messageBody":"<div id=\"ygrps-yiv-1225369987\">-=-Your home is likely full of reminders of the bird. Clothes, furniture, spots on the rug, random feathers in the corners. Earrings the bird disassembled may have enormous sentimental value even if something like the cage is just a thing, an empty birdcage. -=-<br/>\n<br/>\nAfter Marty&#39;s dog was put down, I came home and cleaned every place the dog had left a smudge--nose prints on the window she looked out of, tail-wag marks on the corner of the wall where she liked to lie, I cleaned the flaps on the dog doors, I vacuumed extra well where there was dog hair.  When I came across her variously-stashed balls or chewed up frisbees, I threw them away in such a way that Marty wouldn&#39;t see them in the trash if he took it out.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] death of a pet","postDate":"1326660242","msgId":65049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFMTVDNUI0LTFCNjctNEVFOC04NzBBLTFDMEYxMzBFNEU2NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpldjM2aCtuZ3V0QGVHcm91cHMuY29tPg==","referencesHeader":"PGpldjM2aCtuZ3V0QGVHcm91cHMuY29tPg=="},"prevInTopic":65044,"nextInTopic":65050,"prevInTime":65048,"nextInTime":65050,"topicId":65039,"numMessagesInTopic":0,"msgSnippet":"I would put the cage away (wrapped in cloth or black plastic) for a while, months, a year. Don t talk about it.  If she asks, tell her where it is.  If she","messageBody":"<div id=\"ygrps-yiv-1173016131\">I would put the cage away (wrapped in cloth or black plastic) for a while, months, a year. Don&#39;t talk about it.  If she asks, tell her where it is.  If she gets another bird you could ask whether she would rather get a new cage or use the old one.<br/>\n<br/>\nGrief doesn&#39;t last forever.    Your questions seemed to me to be based on that idea--that extreme grief would be a constant state.<br/>\n<br/>\nI think it was a mistake not to tell the other kids when they could have seen the bird dead.  You would have avoided this:  &quot;My eleven year old son&#39;s reaction was a horrified and repeated &quot;Are you sure?&quot; I&#39;m afraid he thought we might&#39;ve buried the bird alive. Either that, or he just didn&#39;t want to believe it was true.&quot;<br/>\n<br/>\nFears about death often include the fear of it happening and one not being notified or missing the funeral.  <br/>\n<br/>\n-=-I guess what I&#39;m struggling with most is what do I do now? I don&#39;t want to ignore it if she&#39;s hurting, but it doesn&#39;t seem right to keep asking if she&#39;s okay. -=-<br/>\n<br/>\nMake her favorite foods.  Take her a drink sometime. Maybe offer to take her to a movie--not a sad movie, and not Rio.<br/>\n<br/>\nI liked reading this part:  <br/>\n-=-My husband (her dad) helped her bury Luna under one of our big oak trees and took her out the next day to buy some flower bulbs to plant.  Later, my daughter asked if he&#39;d really liked the bird more than she thought he did because he was making such a big deal out of things.-=-<br/>\n<br/>\nI hope she realizes that it might be because he likes her more than she thought he did.  It sounds very thoughtful, but it might have been nice to have included the other children, too.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: death of a pet","postDate":"1326651504","msgId":65044,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpldjU5Zys3Y2hxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpldjM2aCtuZ3V0QGVHcm91cHMuY29tPg=="},"prevInTopic":65042,"nextInTopic":65049,"prevInTime":65043,"nextInTime":65045,"topicId":65039,"numMessagesInTopic":0,"msgSnippet":"... -- what do I do now? ************** What does your daughter want you to do? I don t just mean ask her I mean look at her and think about her preferences","messageBody":"<div id=\"ygrps-yiv-416942491\">&quot;michelle_m29&quot; &lt;mmarr@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My almost fifteen year old daughter&#39;s pet cockatiel died late Thursday afternoon.<br/>\n </span></blockquote>-- what do I do now?<br/>\n**************<br/>\n<br/>\nWhat does your daughter want you to do? I don&#39;t just mean &quot;ask her&quot; I mean look at her and think about her preferences in general. If she&#39;s the sort who likes to talk when she&#39;s upset, be ready to talk. If she tends to retreat into herself, give her space. Be gentle and thoughtful.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What about the box I gave her to put the bird in that we didn&#39;t use because it was the wrong size?  It was a nice box that I&#39;d planned to use for something else...but now it&#39;s &quot;the box the dead bird didn&#39;t fit in.&quot; I think I&#39;ll wind up tossing it just because it bugs me.<br/>\n </span></blockquote>**************<br/>\n<br/>\nIf it bugs you so much you won&#39;t ever use it for anything, it makes sense to get rid of it. You could ask your daughter if she wants it, if she&#39;s the kind of person who likes to keep things. Does she like to keep things? Do Things have sentimental value to her? If you&#39;re not sure, you could ask in a general way, first, but its just a box. It&#39;s not like it&#39;s the bird&#39;s favorite toy. <br/>\n<br/>\nYou seem to be focusing on minutia rather than your daughter&#39;s feelings though. Stuff gets muddled in times of tragedy, and you really can&#39;t know right away what sorts of things will be meaningful and important later. When my mom died, for weeks everywhere I went I found pennies. You know how you&#39;ll find a penny or other coin on the sidewalk? I&#39;d find a dozen pennies at a go. It was weird. So now when I find a penny on the ground I think of my mom. But I don&#39;t think of her when I use her cookbooks - go figure. <br/>\n<br/>\nYour home is likely full of reminders of the bird. Clothes, furniture, spots on the rug, random feathers in the corners. Earrings the bird disassembled may have enormous sentimental value even if something like the cage is just a thing, an empty birdcage. You can&#39;t know - your daughter won&#39;t even know right away. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] death of a pet","postDate":"1326650601","msgId":65042,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMDFGM0YxNEY0QjRENEZCQTM5QkQ4RTVFMzIwQUNEQEVkUEM+","inReplyToHeader":"PGpldjM2aCtuZ3V0QGVHcm91cHMuY29tPg==","referencesHeader":"PGpldjM2aCtuZ3V0QGVHcm91cHMuY29tPg=="},"prevInTopic":65039,"nextInTopic":65044,"prevInTime":65041,"nextInTime":65043,"topicId":65039,"numMessagesInTopic":0,"msgSnippet":"I guess what I m struggling with most is what do I do now? I don t want to ignore it if she s hurting, but it doesn t seem right to keep asking if she s okay. ","messageBody":"<div id=\"ygrps-yiv-1786593461\">I guess what I&#39;m struggling with most is what do I do now? I don&#39;t want to ignore it if she&#39;s hurting, but it doesn&#39;t seem right to keep asking if she&#39;s okay. <br/>\n<br/>\n<br/>\nI&#39;d be extra sweet to her.  Bring her a drink, offer to make her a sandwich type of thing - go beyond what you&#39;d normally do, a soft touch on the should as you go by, go do something with just her (like a movie or lunch out?)  A special gift given in an unusual way that might make her laugh or smile?  If she likes crafts - some crafty items?<br/>\n<br/>\nDo you have a picture of her with the bird on her shoulder?  If so, how about a special frame for it?<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247112349,"authorName":"michelle_m29","from":"&quot;michelle_m29&quot; &lt;mmarr@...&gt;","profile":"michelle_m29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"death of a pet","postDate":"1326649361","msgId":65039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpldjM2aCtuZ3V0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":65042,"prevInTime":65038,"nextInTime":65040,"topicId":65039,"numMessagesInTopic":0,"msgSnippet":"I hope it s okay to post this to the list. We re more ecclectic homeschoolers than real unschoolers, but I d really like some advice on dealing with this","messageBody":"<div id=\"ygrps-yiv-755778998\">I hope it&#39;s okay to post this to the list. We&#39;re more ecclectic homeschoolers than real unschoolers, but I&#39;d really like some advice on dealing with this situation and I think this is probably the best place to ask. <br/>\n<br/>\nMy almost fifteen year old daughter&#39;s pet cockatiel died late Thursday afternoon. This wasn&#39;t a &quot;find the bird lying at the bottom of the cage&quot; thing.  She came home and noticed Luna was acting oddly (this bird spent a big chunk of every day on her shoulder or the back of her chair and she knew Luna&#39;s every mood and twitch) then over the next two or three hours it got steadily worse until Luna died in her hands. <br/>\n<br/>\nWe&#39;ve had pets die before -- a cat who was hit by a car, an old cat who vanished and turned up in pieces more than a year later (we&#39;ve got acreage and apparently something found where she had died and dragged her back up near the house), geese and chickens that we&#39;ve lost to accidents and predators.  Nothing has upset my daughter like the loss of this bird. <br/>\n<br/>\nMy daughter doesn&#39;t get really upset all that often. <br/>\n<br/>\nNow I&#39;m questioning everything I&#39;m doing. <br/>\n<br/>\nI cut off a big hunk of quilting fabric for her to wrap Luna in. That seemed better than a ratty old towel. Do I get rid of the rest of that fabric? Stash it up in my sewing room in case she decides she wants to do something with it later? Just cut it up and use it in scrap quilts like I&#39;d originally planned?<br/>\n<br/>\nWhat about the box I gave her to put the bird in that we didn&#39;t use because it was the wrong size?  It was a nice box that I&#39;d planned to use for something else...but now it&#39;s &quot;the box the dead bird didn&#39;t fit in.&quot; I think I&#39;ll wind up tossing it just because it bugs me.<br/>\n<br/>\nMy husband (her dad) helped her bury Luna under one of our big oak trees and took her out the next day to buy some flower bulbs to plant.<br/>\nLater, my daughter asked if he&#39;d really liked the bird more than she thought he did because he was making such a big deal out of things.<br/>\n<br/>\nI wasn&#39;t sure what to do about the cage. It&#39;s going out into the barn because eventually someone&#39;s gonna want a cage for something, but I didn&#39;t want to rush it out of her room. Yesterday, she asked if she could put it out in the shop because every time she walked into her room it rattled a bit. I&#39;d noticed the same thing -- the effect was  really creepy. I think the table we brought into her room for the cage is still there. Do I offer to take it out into the barn, or wait to see what she decides to do on her own -- if she wants to repurpose it for something else or move it out of her room? <br/>\n<br/>\nI guess what I&#39;m struggling with most is what do I do now? I don&#39;t want to ignore it if she&#39;s hurting, but it doesn&#39;t seem right to keep asking if she&#39;s okay. <br/>\n<br/>\nAnd I&#39;m not sure if I handled it well with the other kids. We waited two days to tell the youngest two (6 and 7) because we wanted to give our daughter some time to greive without them bugging her. Honestly, I don&#39;t think they get it at all beyond the fact that the bird&#39;s gone. And I&#39;m not even sure they noticed that. <br/>\n<br/>\nMy eleven year old son&#39;s reaction was a horrified and repeated &quot;Are you sure?&quot; I&#39;m afraid he thought we might&#39;ve buried the bird alive.  Either that, or he just didn&#39;t want to believe it was true.  <br/>\n<br/>\nSorry if I included way too much backstory here, but I thought this needed more than &quot;My daughter&#39;s bird died -- what do I do now?&quot; <br/>\n<br/>\nMichelle</div>","specialLinks":[]}],"prevTopicId":65053,"nextTopicId":65079}}