{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"dads coming around; blaming culture","postDate":"1123780120","msgId":107740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJlLjJlYWQxZjdiLjMwMmNlMDE4QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":107739,"nextInTime":107741,"topicId":107740,"numMessagesInTopic":0,"msgSnippet":"Note after I finished writing:   I just kind of veer around in a loop that doesn t come back where it started.   Three topics meandering.    In a message","messageBody":"<div id=\"ygrps-yiv-2068718759\">Note after I finished writing:   I just kind of veer around in a loop that <br/>\ndoesn&#39;t come back where it started.   Three topics meandering.   &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\nIn a message dated 8/11/05 10:31:57 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:gwendolin00@...\">gwendolin00@...</a> writes:<br/>\n<br/>\nMost of that describes how it was with us when Kirby was little and my <br/>\nhusband was way slower to catch on to what was up. &lt;g&gt;    It was one step forward, <br/>\ntwo steps back, and then eventually he passed me.   Shocked me, when he started <br/>\npointing out to me when I was being inflexible and unreasonable, but it was <br/>\npretty cool.     (Would&#39;ve been good for him to be here earlier when I asked <br/>\nKirby to try to treat me more like a person and less like furniture.    I wish I <br/>\nhadn&#39;t said that.   Maybe it will help and maybe it will hurt, but it was me <br/>\nbeing whiney/pissy and not me being my best most mature self.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So pointing this cultural<br/>\n&gt; difference out has been fruitful, up until the other day when dh sort<br/>\n&gt; of half-heartedly tried to justify his  behavior by saying it was<br/>\n&gt; culturally relative.<br/>\n&gt; <br/>\n </span></blockquote>Unrelated to your husband or mine, I&#39;m jumping off from this to something <br/>\nelse.   Twice over the years this list has had someone com on (I think it was <br/>\nthis list) and then back out because of the anti-spanking tone of it.    In both <br/>\ncases the mom was Black.   In both cases spanking was held up as a cultural <br/>\ntradition, and not negotiable but necessary.   Culturally necessary.   One mom <br/>\nwas from the Caribbean and one staying with her dad in New Orleans for a while. <br/>\n The first time lots of moms argued and the mom (in Trinidad, I think) got <br/>\nangry.   The second time, nobody touched it and I felt bad for the mom, but it&#39;s <br/>\na cheap copout to say &quot;I can&#39;t be nice to my child, it&#39;s not native to my <br/>\nculture.&quot;   <br/>\n<br/>\nA lot of things are native to a lot of people&#39;s cultures, including mine.   <br/>\nWhipping kids, turning them out entirely in a case of pregnancy, taking their <br/>\nmoney away from them if they work, throwing them out at 18 (or sooner).    <br/>\nPushing them into military service.   I saw that one lately, and heard of another <br/>\ncase (first family did school; second is homeschoolers).   In the first, the <br/>\nmom told her son (who was very attached, and hugged her evertime he woke up and <br/>\neverytime he left or returned) that when he turned 18 he could either go to <br/>\ncollege and pay for it all himself, or he could join the military.    I guess <br/>\nit didn&#39;t occur to him to say &quot;When I&#39;m 18 you don&#39;t get to limit my choices <br/>\nanymore&quot; so he joined the service.<br/>\n<br/>\nIn another family there are three, like mine but younger by a few years (15, <br/>\n13, 11 I think) and the dad who has a very good job has not saved nor is he <br/>\nplanning to pay for college at all.   He told them (just learned) that if they <br/>\nwant to go to college they need to join ROTC.    <br/>\n<br/>\nThe oldest is a girl, and an artist, and not a ROTC type of person.   She <br/>\nwants to go to an art college out of state.   She could go now.   Her dad makes <br/>\nher do online classes to get a high school diploma.   <br/>\n<br/>\nIt&#39;s not the best thing he could be doing.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":107737,"nextTopicId":107729}}