{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":190427088,"authorName":"hawkhillacres@tds.net","from":"&lt;hawkhillacres@...&gt;","profile":"woemomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: Foster parents/adoption","postDate":"1139234901","msgId":111766,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjQwMWM2MmIyNiRjZTM4ZmEzMCQwNDAxYThjMEBNQUlOVU5JVD4=","inReplyToHeader":"PDExMzkyMDA2OTUuMTI5My40ODI2My5tMzFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":111765,"nextInTime":111767,"topicId":111766,"numMessagesInTopic":0,"msgSnippet":"... I felt the same way when we went into foster care with plans to adopt. I knew that I didn t want a child with a life-threatening illness, because I had","messageBody":"<div id=\"ygrps-yiv-2006803749\">&lt;&lt;&lt;&lt;&lt;&lt;&lt;(i think i can handle just<br/>\n<blockquote><span title=\"ireply\"> &gt; about anything, but there are certain issues i dont *want* to deal<br/>\n&gt; with, and so wish to avoid them.)&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I felt the same way when we went into foster care with plans to adopt. I<br/>\nknew that I didn&#39;t want a child with a life-threatening illness, because I<br/>\nhad lost my only biological child to illness. That was my only caveat. My dh<br/>\nknew that he didn&#39;t want to have a child with limited intelligence,<br/>\nespecially one who would never be able to live an independent life. To make<br/>\na very long story as short as possible, that&#39;s not what happened. Our second<br/>\nson has chronic, sometimes severe asthma and almost died from a lung abcess<br/>\nwhen he was three. He and I spent many months in the hospital, here and in<br/>\nBoston, which was a hardship for my husband and oldest son, physically and<br/>\nemotionally. As he grew older, it became evident that he had many more<br/>\nissues than just asthma. He has Tourette Disorder, horrible mood swings with<br/>\ncrying jags that last for hours, hypothyroidism, an IQ of 82, is very<br/>\nanxious and sometimes suicidal. He&#39;s very prone to pneumonia and needs<br/>\nnebulizer treatments every three to four hours most of the time. It&#39;s<br/>\nunlikely that he&#39;ll ever be able to live independently and my dh and I are<br/>\n59 and 54, so we won&#39;t be able to take care of him forever. OTOH, he&#39;s a<br/>\nwarm, loving, social boy, who is very proud of his accomplishments, which<br/>\nare many, and as stable and comfortable as he can be within our family and<br/>\nin our small community. He also has a wonderful Black Lab, who is untrained,<br/>\nbut a therapy dog nonetheless. Anyhow, we wouldn&#39;t have chosen to be Mike&#39;s<br/>\nparents, because there&#39;s a real possibility that he won&#39;t live a long life.<br/>\nHowever, shortly after we got him, he had bonded to us and we had bonded to<br/>\nhim and moving him to another foster home would have devastated him and us.<br/>\nSo, knowing what you can handle, telling social workers that, and trusting<br/>\nthem to find a child who isn&#39;t out of your comfort zone, is a gamble. Of<br/>\ncourse, having birth children is a gamble too, but that wasn&#39;t an option for<br/>\nus. Just my 2 cents and, of course, I can only speak for myself.<br/>\nLil<br/>\n&quot;It&#39;s the ones who&#39;ve cracked that the light shines through.&quot; Jeffrey Lewis</div>","specialLinks":[]}],"prevTopicId":111757,"nextTopicId":111770}}