{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Weight gain","postDate":"1259011587","msgId":48776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxQjlCREFFLTIzQUYtNEUwQy1CMTU0LTlEQUNBN0VFMjNCREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDgyMzE5NC41NDE0OS5xbUB3ZWIxMTA0MDIubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PGhlZTJiMStnYnRtQGVHcm91cHMuY29tPiA8NzQ4QzYyRjYtNzlGQS00ODJGLUE2MEUtNDQzRkVGNUJEM0Y0QFNhbmRyYWRvZGQuY29tPiA8ODIzMTk0LjU0MTQ5LnFtQHdlYjExMDQwMi5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":48775,"nextInTopic":0,"prevInTime":48775,"nextInTime":48777,"topicId":48760,"numMessagesInTopic":0,"msgSnippet":"-=- In this way, kids don t have complete and sudden meltdowns from lack of food, since they are grazing as they get hungry, and the platters are easy and","messageBody":"<div id=\"ygrps-yiv-1676190557\">-=- In this way, kids don&#39;t have complete and sudden meltdowns from  <br/>\nlack of food, since they are grazing as they get hungry, and the  <br/>\nplatters are easy and enticing without having to stop the action.-=-<br/>\n<br/>\nThat&#39;s how I see it too.  It&#39;s to keep kids from getting hungry, not  <br/>\nto provide constant food all hours of the day regardless of activities  <br/>\nor need.  If I&#39;m around to make lunch and they&#39;re in the mood to come  <br/>\nto the table, I&#39;ll make sandwiches or pasta or whatever.  Monkey  <br/>\nplatters are other kinds of meals, or party food for when they have  <br/>\ncompany.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Weight gain","postDate":"1259011281","msgId":48775,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyMzE5NC41NDE0OS5xbUB3ZWIxMTA0MDIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDc0OEM2MkY2LTc5RkEtNDgyRi1BNjBFLTQ0M0ZFRjVCRDNGNEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhlZTJiMStnYnRtQGVHcm91cHMuY29tPiA8NzQ4QzYyRjYtNzlGQS00ODJGLUE2MEUtNDQzRkVGNUJEM0Y0QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":48773,"nextInTopic":48776,"prevInTime":48774,"nextInTime":48776,"topicId":48760,"numMessagesInTopic":0,"msgSnippet":"***I can t speak to all the other things and their quantities, but it sounds like a LOT of food for someone who s had a big breakfast and will have a big","messageBody":"<div id=\"ygrps-yiv-1595970579\">***I can&#39;t speak to all the other things and their quantities, but it sounds like a LOT of food for someone who&#39;s had a big breakfast and will have a big lunch.***<br/>\n <br/>\nMy take on monkey platters, is that it is a way to feed kids without having to do a formal meal, like lunch or breakfast.  It would BE the lunch or breakfast, or dinner.  Perhaps I&#39;ve misunderstood the concept here, or perhaps others are.  Kids need to eat.  If they are engaged in an activity and don&#39;t want to break away from that, a parent should put out food to graze on that can be easily eaten and easily put away, to be easily taken out later if needed.  The monkey platters are a fun way to provide food for kids that might otherwise ignore their hunger for other more exciting things.  In this way, kids don&#39;t have complete and sudden meltdowns from lack of food, since they are grazing as they get hungry, and the platters are easy and enticing without having to stop the action.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Weight gain","postDate":"1258994802","msgId":48773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0OEM2MkY2LTc5RkEtNDgyRi1BNjBFLTQ0M0ZFRjVCRDNGNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhlZTJiMStnYnRtQGVHcm91cHMuY29tPg==","referencesHeader":"PGhlZTJiMStnYnRtQGVHcm91cHMuY29tPg=="},"prevInTopic":48772,"nextInTopic":48775,"prevInTime":48772,"nextInTime":48774,"topicId":48760,"numMessagesInTopic":0,"msgSnippet":"-=-Our platters almost always consist of simple things like, crackers, cheese, capsicum, olives, sliced ham, cold chicken, celery, tomato, etc, with a","messageBody":"<div id=\"ygrps-yiv-1566859550\">-=-Our platters almost always consist of simple things like, crackers,  <br/>\ncheese, capsicum, olives, sliced ham, cold chicken, celery, tomato,  <br/>\netc, with a home-made dip in the centre. Usually avacado with garlic  <br/>\nand tuna, natural yogurt with chives, tomato relishes and the like. I  <br/>\nfind that with the dips alongside, they are more inclined to eat the  <br/>\nraw veg-=-<br/>\n<br/>\nAvocado is what people eat who want to pack on pounds.  I can&#39;t speak  <br/>\nto all the other things and their quantities, but it sounds like a LOT  <br/>\nof food for someone who&#39;s had a big breakfast and will have a big lunch.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141243160,"authorName":"Kathryn","from":"&quot;Kathryn&quot; &lt;kathryndubay@...&gt;","profile":"observeandlearn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Weight gain","postDate":"1258982561","msgId":48772,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlZTJiMStnYnRtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUwNEFCMzQ0LTk4MDctNDE5OS1CNTFFLUJBRENBMTgwMUVFOUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":48768,"nextInTopic":48773,"prevInTime":48771,"nextInTime":48773,"topicId":48760,"numMessagesInTopic":0,"msgSnippet":"... If you re doing full meals with monkey platters between meals, it sounds a bit like force-feeding to me. Our platters almost always consist of simple","messageBody":"<div id=\"ygrps-yiv-1350005114\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n&quot;If you&#39;re doing full meals with monkey platters between meals, it  <br/>\nsounds a bit like force-feeding to me.&quot;<br/>\n<br/>\nOur platters almost always consist of simple things like, crackers, cheese, capsicum, olives, sliced ham, cold chicken, celery, tomato, etc, with a home-made dip in the centre.  Usually avacado with garlic and tuna, natural yogurt with chives, tomato relishes and the like.  I find that with the dips alongside, they are more inclined to eat the raw veg.  We work together to come up with new and tasty blends.  Breakfast is never on rising here; usually about an hour after.  Their appetite is decent and they (presently) eat omlettes with ham, cheese and onion.  Often, I put a platter out around mid-morning.  It seems to sustain them over the midday period, and then usually something more substantial, like roast potatoes and salad for a mid-afternoon lunch.  The main thing the kids seem to Really indulge on is the flavoured crackers.  In the past, we only bought plain; there are So many flavours on the market, and I still don&#39;t think they have tried them all!  Corn chips, potato chips, rice crackers, wheat crackers -- we go through them like nothing else.  <br/>\n<br/>\n&quot;If you once said no, or told her to clean her plate, and then you keep a plate in front of her all the time, it might be that.  If you said &quot;You don&#39;t ever have to ask anymore, you can eat anything you want to,&quot; it might be that.<br/>\n<br/>\nAlthough not as direct, the latter is more the case here.  She&#39;s never had to clean her plate; which tells me that a growth spurt is at play here too.  <br/>\n<br/>\n&quot;If anyone is on a list or forum where anyone is irresponsibly  <br/>\nrecommending to just tell the kids to go suddenly wild, please put  <br/>\nthat link out whenever the advice comes along.&quot;<br/>\n<br/>\nI know this is where I messed up with the transition.  In my own excitement in my newfound knowledge that food restrictions would probably prove detrimental, I went the extreme (on my own accord!) and bought Packets of lollies, put them in a Huge bowl (next to the fruit bowl) and in a celebratory tone, pretty much said &quot;go nuts!  You guys can eat lollies When Ever You Want!&quot;  This bowl Had to be full, always.  It has taken a few months, but the status of the lolly bowl is now equal to other foods.  I wish I&#39;d have just said &quot;yes&quot; more often, instead of giving lollies a Welcome Ceremony.  <br/>\n<br/>\n&quot;There&#39;s a world of difference between &quot;Yes, sure, you can have another&quot; and &quot;I don&#39;t care what you eat--don&#39;t even ask me, just eat.&quot;<br/>\n<br/>\nGood point.  My response is usually along the lines of, &quot;If that&#39;s what you feel like eating, enjoy!&quot;  I&#39;ve long since dropped my coercive words and tones; I really mean it:-)  But how my message is received, could be the latter.  <br/>\n<br/>\nAppreciate this discussion.<br/>\n<br/>\nKathrynD </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Weight gain","postDate":"1258929426","msgId":48768,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3ODUwNy43Mjk1OC5xbUB3ZWIxMTA0MTAubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhlYjQ4YytmOW10QGVHcm91cHMuY29tPg==","referencesHeader":"PGhlYjQ4YytmOW10QGVHcm91cHMuY29tPg=="},"prevInTopic":48763,"nextInTopic":48772,"prevInTime":48767,"nextInTime":48769,"topicId":48760,"numMessagesInTopic":0,"msgSnippet":"***Since lifting food restrictions my 7 y/o dd s weight gain has increased significantly. Her clothing has jumped 4 sizes since May this year. She enjoys her","messageBody":"<div id=\"ygrps-yiv-1699086839\">***Since lifting food restrictions my 7 y/o dd&#39;s weight gain has increased significantly. Her clothing has jumped 4 sizes since May this year. She enjoys her food immensely, and is not afraid to try new things. More often than not, she will have more than one serving of a meal, and grazes continually between meals (platters).***<br/>\n <br/>\nIt&#39;s possible that her interest in eating more is coinciding with a growth spurt.  Both of my kids have always grown wide before tall.<br/>\n <br/>\n***I appreciate that she is exploring all foods which were once unavailable to her. It seems to me her desire to try/taste new foods is overriding her feeling of &#39;I&#39;m full&#39;.***<br/>\n <br/>\nIs she eating to combat boredom?  I&#39;ve known kids to do that.  Food and taste and texture provide stimulating input.  I&#39;d look at that aspect a bit.  If she&#39;s busy doing other things that are equally stimulating, she may not even think about food.<br/>\n <br/>\n*** I do worry about her weight gain, and whether it will start to plateau out. I suppose I&#39;m looking for similar stories, and others&#39; thoughts and experiences on this matter.***<br/>\n <br/>\nMy oldest daughter gained weight starting when she was about 8ish and it kept going until she was about 13.  She was getting rounder and rounder.  I&#39;m from a family of skinny people.  I&#39;m really tiny like my grandmother, and all the other women are taller, yet very skinny.  My dad came from a family of poverty and fat people.  He found a way to counteract that.  He realized the connection between lack and overeating and worked very hard to break that cycle for himself.  He still has a hard time seeing food being thrown away.<br/>\n <br/>\nChamille didn&#39;t seem bothered by her weight gain at all, until the day she was happily taking swimming lessons and another little girl told her she was fat.  She suddenly started looking at herself differently.  That happened when she was 10/11.  She refused to take anymore swimming lessons, and in fact stopped going swimming almost entirely for a long long time.  It is rare these days even.<br/>\n <br/>\nShe became a bit obsessed with her weight.  This was a very internal thing for her.  She wasn&#39;t hearing this stuff at our house.  Her dad&#39;s side of the family, which she is very much alike genetically, consists of larger around women.  She saw that and it scared her.  She started doing really weird stuff with eating, being hugely selective about what and when and how much she ate.  That scared me a little, but I let it go and continued to offer good food to her that she was free to decline.<br/>\n <br/>\nFrom about the age of 12-14, she ate very little food, and the things she ate were mostly fruits and grains with a bit of protein thrown in.  She decided that she wasn&#39;t going to eat meat either, so I happily made her other things.  What could have turned into a food war became her own self selective diet of foods.  During this time is when she found that eggs made her really sick.  She became keenly aware of how various foods entered her body and how each thing made her feel.  Fast forward to almost 15, when she met her boyfriend, the eating machine, whom she converted to a vegetarian diet.<br/>\n <br/>\nSince meeting him, she&#39;s gained a whole new appreciation for foods and different flavors.  He loves almost all food that is lovingly made from scratch, something that Chamille had always taken for granted a bit.  She started appreciating more and more foods.  She started eating more variety and more in general.  She also started doing more, getting out more.  <br/>\n <br/>\nCurrently she&#39;s the same size as I am, very tiny.  Now, I don&#39;t know if the extreme dieting caused her to become slender, or if she would&#39;ve done that anyway in her natural course of reaching puberty.  It doesn&#39;t really matter though.  What she did, she did for her own reasons and she learned a huge amount about the value of food and what is good for her and what isn&#39;t.  She also did a lot of research online about foods and shares that information with others.<br/>\n <br/>\nThe point is, that if a kid likes food and is comfortable with their body then I&#39;d let it go.  If they become uncomfortable with their body, they&#39;ll find a way to change that, especially, and I&#39;d even say, ONLY, if they are allowed to make these choices for themselves.  I could&#39;ve done a lot of damage to my daughter if I&#39;d tried to make her do something other than what she was doing.  I trusted that she wanted to be healthy and happy and that she&#39;d continue on that path.<br/>\n <br/>\nWith a 7 yr old, I&#39;d let it go.  I&#39;d give her other things to occupy her time, things that don&#39;t involve food, and trust that she&#39;ll figure out for herself what&#39;s best for her body and what isn&#39;t.  This is where my 8 yr old is at too.  She&#39;s had 2 different friends in the last 6 mos, call her fat.  Before that, she didn&#39;t consider herself that way at all.  She&#39;s not fat either, she has a round tummy, which makes her really cuddly and wonderful.  I don&#39;t know why people insist on calling others fat and being oddly judgemental that way.  It bothers me on a deep level because I&#39;ve seen the damage it can do to people and their image of themselves.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Weight gain","postDate":"1258911855","msgId":48763,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBGRUY0RTM1LTlBMjYtNDI0NC05NkY2LTdEQzg2QzhFQ0Q0QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEVFOTJGNjFEQTU1MjRFRUU4OEIxQTMxQ0U4Qzk2MDM4QFJvYnluUEM+","referencesHeader":"PGhlYjQ4YytmOW10QGVHcm91cHMuY29tPiA8NTA0QUIzNDQtOTgwNy00MTk5LUI1MUUtQkFEQ0ExODAxRUU5QFNhbmRyYWRvZGQuY29tPiA8RUU5MkY2MURBNTUyNEVFRTg4QjFBMzFDRThDOTYwMzhAUm9ieW5QQz4="},"prevInTopic":48762,"nextInTopic":48768,"prevInTime":48762,"nextInTime":48764,"topicId":48760,"numMessagesInTopic":0,"msgSnippet":"-=- -=-I m concerned now that if this Mom, with her particular history, starts saying could you wait? the girl will","messageBody":"<div id=\"ygrps-yiv-1102380813\">-=-&lt;&lt;&lt;&lt; you could say &quot;Could you wait?&quot; &gt;&gt;&gt;&gt;<br/>\n<br/>\n-=-I&#39;m concerned now that if this Mom, with her particular history,  <br/>\nstarts<br/>\nsaying &quot;could you wait?&quot; the girl will hear it as a return to  <br/>\nrestrictions<br/>\nand blah blah blah lectures and it will have the opposite effect, and  <br/>\nshe<br/>\ncould start hoarding. Maybe some distraction would be better.-=-<br/>\n<br/>\nGood point.  My kids never transitioned from controls to choices; we  <br/>\nlet them eat or not eat from the time they were nursing babies.<br/>\n<br/>\nIf I were to say to my kids &quot;Could you wait?&quot; or &quot;No, that&#39;s saved&quot; or  <br/>\n&quot;You just ate,&quot; they wouldn&#39;t see it as limits or criticism.  It would  <br/>\nbe no more than conversational or information about thoughts I was  <br/>\nhaving.  If I said &quot;You just ate,&quot; one of them might say &quot;I didn&#39;t  <br/>\nhave breakfast,&quot; or that they&#39;re going a long time without food for  <br/>\nsome reason of work or driving or whatever.  They&#39;d at least think  <br/>\nabout why I was wondering why they were extra hungry. Maybe they&#39;ve  <br/>\nbeen sick and just recovered.<br/>\n<br/>\nSo the difference between casual and honest questions and discussion  <br/>\nand the kind of judgment-laden manipulative parenting stuff my mom did  <br/>\nis something that comes naturally to me, finally.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Weight gain","postDate":"1258910045","msgId":48762,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFOTJGNjFEQTU1MjRFRUU4OEIxQTMxQ0U4Qzk2MDM4QFJvYnluUEM+","inReplyToHeader":"PDUwNEFCMzQ0LTk4MDctNDE5OS1CNTFFLUJBRENBMTgwMUVFOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhlYjQ4YytmOW10QGVHcm91cHMuY29tPiA8NTA0QUIzNDQtOTgwNy00MTk5LUI1MUUtQkFEQ0ExODAxRUU5QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":48761,"nextInTopic":48763,"prevInTime":48761,"nextInTime":48763,"topicId":48760,"numMessagesInTopic":0,"msgSnippet":" I m concerned now that if this Mom, with her particular history, starts saying could you wait? the girl will hear","messageBody":"<div id=\"ygrps-yiv-891673904\">&lt;&lt;&lt;&lt; you  could say &quot;Could you wait?&quot; &gt;&gt;&gt;&gt;<br/>\n<br/>\nI&#39;m concerned now that if this Mom, with her particular history, starts <br/>\nsaying &quot;could you wait?&quot; the girl will hear it as a return to restrictions <br/>\nand blah blah blah lectures and it will have the opposite effect, and she <br/>\ncould start hoarding. Maybe some distraction would be better.<br/>\n<br/>\nIs &quot;gaining weight&quot; the same as being significantly &quot;over weight&quot;?<br/>\n<br/>\nIs it co-inciding with a natural pre-puberty growth spurt? Jayn grew much <br/>\nbigger around proportionally from about 7.5 to 9 and I&#39;m only now at 10 <br/>\nseeing the beginning of body shape changes including gradual slimming, along <br/>\nwith a few other tell tales of pre-puberty. She continued to dance, swim and <br/>\nrun - plus we go on fitness walks (they&#39;re for me really).<br/>\n<br/>\nI agree with more activity. Sometimes that is harder in winter. Our local <br/>\nYMCA has two lovely indoor heated pools and a terrific gym. Our membership <br/>\nis on hiatus right now, but with winter coming on even in Southern <br/>\nCalifornia it might be time to restore it.<br/>\n<br/>\nThe idea of the clean plate is worth considering. People eat smaller amounts <br/>\nwhen their plate is smaller. Maybe smaller plates, smaller snack trays would <br/>\nbe useful.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Weight gain","postDate":"1258901337","msgId":48761,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwNEFCMzQ0LTk4MDctNDE5OS1CNTFFLUJBRENBMTgwMUVFOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhlYjQ4YytmOW10QGVHcm91cHMuY29tPg==","referencesHeader":"PGhlYjQ4YytmOW10QGVHcm91cHMuY29tPg=="},"prevInTopic":48760,"nextInTopic":48762,"prevInTime":48760,"nextInTime":48762,"topicId":48760,"numMessagesInTopic":0,"msgSnippet":"-=- She is slowly taking control of her Own food intake; she rarely asks for my permission for servings of (say) icecream these days.-=- My kids still ask","messageBody":"<div id=\"ygrps-yiv-1435082083\">-=- She is slowly taking control of her Own food intake; she rarely  <br/>\nasks for my permission for servings of (say) icecream these days.-=-<br/>\n<br/>\nMy kids still ask sometimes, and they&#39;re grown.  If you hadn&#39;t said  <br/>\n&quot;eat all you want all the time&quot; (or whatever you might have said) you  <br/>\ncould advise each time, you could say &quot;yes!&quot; tons of times, and you  <br/>\ncould say &quot;Could you wait?&quot; or &quot;Maybe after dinner if you still want  <br/>\nit&quot; sometimes.<br/>\n<br/>\nI never did put out a monkey platter right after a meal.  I&#39;d put  <br/>\nthemout if we had company or if the kids had been on a game for a long  <br/>\ntime and I thought they might be hungry.<br/>\n<br/>\nWithout knowing more details, I&#39;d say interact with her more and get  <br/>\nout of the house more.  If you&#39;re putting monkey platters out, don&#39;t  <br/>\nput fattening things on them.   I probably should rearrange my monkey  <br/>\nplatter page, honestly, because when I did a photo contest it was for  <br/>\nbeauty and not for nutritional value.  So there are photos of things  <br/>\nwith sauces and marshmallows, which I&#39;ve never done when I&#39;ve put  <br/>\nplatters out for my own kids.  I was going for finger food or things  <br/>\nto be eaten with toothpicks so the kids didn&#39;t have anything to mess  <br/>\nup their board games or video games, or so they didn&#39;t need to look  <br/>\naway much from the movie they were watching, or whatever.<br/>\n<br/>\nMy idea with platters was to keep from calling them away from  <br/>\nsomething interesting to feed them.<br/>\n<br/>\nIf you&#39;re doing full meals with monkey platters between meals, it  <br/>\nsounds a bit like force-feeding to me.  If you once said no, or told  <br/>\nher to clean her plate, and then you keep a plate in front of her all  <br/>\nthe time, it might be that.  If you said &quot;You don&#39;t ever have to ask  <br/>\nanymore, you can eat anything you want to,&quot; it might be that.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/gradualchange\">http://sandradodd.com/gradualchange</a><br/>\n<br/>\nIf anyone is on a list or forum where anyone is irresponsibly  <br/>\nrecommending to just tell the kids to go suddenly wild, please put  <br/>\nthat link out whenever the advice comes along.   There&#39;s a world of  <br/>\ndifference between &quot;Yes, sure, you can have another&quot; and &quot;I don&#39;t care  <br/>\nwhat you eat--don&#39;t even ask me, just eat.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141243160,"authorName":"Kathryn","from":"&quot;Kathryn&quot; &lt;kathryndubay@...&gt;","profile":"observeandlearn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Weight gain","postDate":"1258886220","msgId":48760,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhlYjQ4YytmOW10QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48761,"prevInTime":48759,"nextInTime":48761,"topicId":48760,"numMessagesInTopic":0,"msgSnippet":"Hello all, Since lifting food restrictions my 7 y/o dd s weight gain has increased significantly.  Her clothing has jumped 4 sizes since May this year.  She","messageBody":"<div id=\"ygrps-yiv-749026833\">Hello all,<br/>\n<br/>\nSince lifting food restrictions my 7 y/o dd&#39;s weight gain has increased significantly.  Her clothing has jumped 4 sizes since May this year.  She enjoys her food immensely, and is not afraid to try new things.  More often than not, she will have more than one serving of a meal,   and grazes continually between meals (platters).  I appreciate that she is exploring all foods which were once unavailable to her.  It seems to me her desire to try/taste new foods is overriding her feeling of &#39;I&#39;m full&#39;.  I do worry about her weight gain, and whether it will start to plateau out.  I suppose I&#39;m looking for similar stories, and others&#39; thoughts and experiences on this matter.  Prior to coming to unschooling, I was very much a &#39;preacher&#39; of right/wrong foods, restaurant chains, etc, etc.  It appears this has all left a fairly solidly carved imprint . . . poor kid!  I realise now the error of my ways!!  She is slowly taking control of her Own food intake; she rarely asks for my permission for servings of (say) icecream these days.  I have posted in the recent past to &#39;unschooling basics&#39; about this very same issue . . . apologies to those who read my woes for the second time.  BTW, I got fantastic advice -- just need More:)<br/>\n<br/>\nThanks in advance,<br/>\n<br/>\nKathrynD<br/>\nx</div>","specialLinks":[]}],"prevTopicId":48606,"nextTopicId":48777}}