{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":87286598,"authorName":"carelia","from":"carelia &lt;carelia@...&gt;","profile":"nortoncr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"intro, food issues and a few questions (longish)","postDate":"1092944556","msgId":98458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCRDM3N0NGLUYyMTctMTFEOC05Rjg1LTAwMEE5NUMzQzMzQUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":98457,"nextInTime":98459,"topicId":98458,"numMessagesInTopic":0,"msgSnippet":"I ve been lurking for a few weeks (well, ok, since May, LOL) and I am enjoying all of the discussions. I have three children. Katherine is 16, recently took","messageBody":"<div id=\"ygrps-yiv-1744507898\">I&#39;ve been lurking for a few weeks (well, ok, since May, LOL) and I am <br/>\nenjoying all of the discussions.<br/>\n<br/>\nI have three children. Katherine is 16, recently took her HS <br/>\nequivalency test and is starting community college full-time next week. <br/>\nShe is studying Japanese, has bought herself 2 GameCubes (one for the <br/>\nfamily, one for her room), has a part time pet sitting gig going, and <br/>\npeople mistake us for twins (ego-boost to this almost 40 yr old mom, I <br/>\ncan tell ya!)! Christopher is 13, ADHD, profoundly gifted and 13 (LOL). <br/>\nHe loves demolition and is taking trombone lessons. Aaron is 5, he <br/>\nloves his Whirly Wheels, games, snuggling with Mom, Futurama and <br/>\nSpongeBob. All three love Nintendo and the computer (and I could tell <br/>\n100 stories of things they&#39;ve learned from them!). We&#39;re also active in <br/>\nthe SCA. We&#39;re homeschooled for about 5 years, sort of a flexible <br/>\neclectic bordering on unschooling, all along, we just didn&#39;t know <br/>\nunschooling had a name (we just thought we were weird, as we started <br/>\nHS&#39;ing in Colorado, where everyone we met that HS&#39;d did it for <br/>\nreligious reasons or was into extreme AP)!<br/>\n<br/>\nThe food thread has really caught my attention. My brother and his wife <br/>\ndo the control thing with their kids, and not just with food, tho the <br/>\nfood is the most obvious aspect. They will tell their children when <br/>\nthey are hungry, fill their plates for them (close to adult-sized <br/>\nportions), refuse to let them get up until the plate is empty (the <br/>\nchildren have cried, vomited from forced eating, etc., and are scolded <br/>\nfor it), and then if they DO finish their meal, are allowed 3 chips or <br/>\na small piece of cornbread as a dessert. My brother and Mom actually <br/>\ngot into an argument once over corn chips (*siiiiigh*). Two of the four <br/>\nchildren have medical digestive issues (big shock there ;). They would <br/>\ndo the sugar-hoarding bit, but they are never let out of my SIL&#39;s sight <br/>\nunless they are at a home with similar eating philosophies (they aren&#39;t <br/>\nallowed to be in my house without one of their parents, I am way too <br/>\nradical for them). They have extreme ideas on a lot of things, not just <br/>\nfood, and we don&#39;t get long well (my children can&#39;t stand their <br/>\ncousins, sad, but what can we do). Fortunately, they live in a <br/>\ndifferent state and we have recently managed to have other plans when <br/>\nthey visit ... ;).<br/>\n<br/>\nNow my question. I don&#39;t have the playdate problem, but I do run into <br/>\nissues with other children. I am the children&#39;s officer for our local <br/>\nSCA branch (Barony of Gyldenholt, in the Kingdom of Caid, for those who <br/>\nknow the SCA). Most (probably all) of the children are in public school <br/>\nor daycare. I run my activities much like unschooling - the stuff is <br/>\nthere, sometimes with game rules, or a sample craft, but except for <br/>\nsafety reasons, I don&#39;t care what the kids do. If they use the chessmen <br/>\nas people on a block tower, good for them! The craft stuff is there to <br/>\nbe used, but not in any particular manner, tho sometimes we&#39;ll have a <br/>\nclass in weaving or something (which is, of course, not compulsory). My <br/>\nonly rules (principles?) are we don&#39;t hurt other people, and we don&#39;t <br/>\ndestroy things that belongs to someone else (without their consent ;). <br/>\nOne problem I have is that some children take advantage of this and <br/>\nhoard - materials, prizes, whatever. We&#39;ll have a game where all <br/>\nparticipants get a token and they&#39;ll pretend they lost it to get <br/>\nanother. On one hand, I don&#39;t mind this (if they really need a second <br/>\nplastic ring, it&#39;s just not that huge of a deal), but on the other, I <br/>\ndon&#39;t have unlimited supplies to just give away. Plus the other (public <br/>\nschooled) children protest, they ALL want a second one, etc. Any <br/>\nthoughts here? My other problem is that they have the public school <br/>\nmentality, as far as creativity, being given directions, etc. As an <br/>\nexample, one time we made rag dolls from fabric scraps and yarn. Now, <br/>\nmy way to teach this sort of thing is to sit on the ground, and have a <br/>\nsample, and help the kids when they ask, or maybe just pick up the <br/>\nsupplies and make one myself, and wait for the kids to come see it and <br/>\nask about it. Sometimes I just put the stuff out and if they find the <br/>\nsample and want to copy it, ok. I will demonstrate how to make it, or <br/>\nhelp tie a knot or whatever, depending on the child, what they want, <br/>\netc. The younger kids (6 and under) are SO fun, they are so creative <br/>\nand have no set idea of how things must be. The older kids, tho ... <br/>\nwill compare supplies, he got a better color, her yarn is longer, etc. <br/>\nWait until told exactly what to do (you may start now ... ). Have to be <br/>\nshown how to draw a face. Will only draw it EXACTLY the way I show them <br/>\n(or like the sample). Make rude comments to a 3 yr old who happily <br/>\ndraws 14 eyes and 2 noses and no mouth (to which, I usually go <br/>\noverboard praising the unusual and creative doll ... any other ways to <br/>\nhandle this?). Someone had a piñata once - not my idea - and the older <br/>\nkids bashed it before the small kids had a chance (the knights all <br/>\nlaughed, which just encouraged the kids more ... ), and then they were <br/>\nlike wild dogs scrounging for the candy (my boys, OTOH, watched from a <br/>\ndistance, walked up and took the 3-4 pieces they really wanted, then <br/>\nleft, LOL - and I ended up tossing out even that, I think they ate one <br/>\npiece each). Any ideas on either how to get these kids to loosen up a <br/>\nbit, or for me to stop worrying about it? :) It&#39;s starting to be a <br/>\nproblem since it is mostly the same few children that exhibit this <br/>\nbehavior, and I see them a lot. It&#39;s not like a playdate where I can <br/>\nrefuse to allow them in my house. I don&#39;t feel like quitting the job is <br/>\nthe answer, since there are SOME people who LOVE what I do, I mostly <br/>\nenjoy it, and my replacement could be more school-y and then my own <br/>\nkids wouldn&#39;t want to participate. And don&#39;t get me started on 7 yr <br/>\nolds who already rhino-hide, grr, we&#39;re working on that too (Sandra? <br/>\nHelp! :).<br/>\n<br/>\nThanks in advance for any insights on this.<br/>\n<br/>\ncarelia<br/>\nCheryl Norton (but I prefer to use carelia)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:carelia@...\">carelia@...</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://home.earthlink.net/~carelia/cheryl.html\">http://home.earthlink.net/~carelia/cheryl.html</a></div>","specialLinks":[]}],"prevTopicId":98457,"nextTopicId":98194}}