{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Specific and current advice for Christian homeschoolers. Today.","postDate":"1050037195","msgId":64098,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyYy4yN2JhYTMzZS4yYmM3YTVjYkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":64097,"nextInTime":64099,"topicId":64098,"numMessagesInTopic":0,"msgSnippet":"Someone went and read at the Christian/ADD thing which was sent to me because I am a homeschooler.  I m guessing lots of you received it, too.  This is current","messageBody":"<div id=\"ygrps-yiv-2147344891\">Someone went and read at the Christian/ADD thing which was sent to me because <br/>\nI am a homeschooler.  I&#39;m guessing lots of you received it, too.  This is <br/>\ncurrent as of today, folks.   And why did I receive it?  Because someone <br/>\nthinks that because I&#39;m a homeschooler, I&#39;m interested in &quot;Biblical <br/>\ntreatment&quot; of ADD, Tourettes, facial tics, other sin-based problems.<br/>\n<br/>\n<br/>\n From here down isn&#39;t me writing.  It&#39;s either the reviewer or quotes from <br/>\nthe site. <br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n--------<br/>\n<br/>\nI went to the link for the online book in your garbage box.<br/>\n<br/>\nFrom the title I expected &quot;how to&quot;   but took looking at LOTS  of chapters<br/>\n<br/>\nto find the book&#39;s promise.   Pages on pages of general blathering and<br/>\n<br/>\ngeneralizations about society and &quot;history&quot;.<br/>\n<br/>\n<br/>\nFinally got the &quot;how to&quot;  in Chapter 20...Questions and Answers.<br/>\n<br/>\nLook especially for the &quot;proper way to administer a spanking&quot; BLECH  as well<br/>\n<br/>\nas how a respondent beat the tics out her child lest he develop Tourettes<br/>\n<br/>\nSyndrome.<br/>\n<br/>\nIn case you don&#39;t want to subject yourself I could not restrain myself from<br/>\n<br/>\ndistilling a couple of the things I finally managed to pull up amidst all<br/>\n<br/>\nthe &quot;psychology is stupid&quot;  wordiness.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;It was six months after the eye blinking first started that I decided to<br/>\n<br/>\n </span></blockquote>give it one last try - by correcting his purposeless behavior with the rod.<br/>\n<br/>\nI would feel extremely guilty if it did not work, because it would have<br/>\n<br/>\nmeant that I had spanked my child for something that he could not help. On<br/>\n<br/>\nthe other hand, I would feel much worse if I were to discover one day that I<br/>\n<br/>\ncould have done something about it and did not. Weighing the two options, I<br/>\n<br/>\ndecided that the former was preferable. I discussed it with my husband, who<br/>\n<br/>\nagreed.<br/>\n<br/>\n<br/>\nTo our surprise the first spanking stopped the eye blinking completely for<br/>\n<br/>\nthree hours. The second round stopped it for four months and the third<br/>\n<br/>\nforever.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;It was only then that I realized that my son was on his way towards<br/>\n<br/>\n </span></blockquote>developing true TS. Indeed, during the years to follow Gustav would on and<br/>\n<br/>\noff have tics, about six different ones in all: sniffing, tongue clicking,<br/>\n<br/>\nhead jerking, nose twitching, etc. He got a hiding for each and every one.<br/>\n<br/>\nSometimes it took one hiding to rid him of a new tic, sometimes two or<br/>\n<br/>\nthree. The most difficult one to rid him of was eye rolling. He would roll<br/>\n<br/>\nhis eyes so that one could only see the white. He has been without any tics<br/>\n<br/>\nsince December 2001, and hopefully it will continue in this way.<br/>\n<br/>\n<br/>\nThe explanation I gave to my son is that all sins have consequences. &gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;The purpose, it must be repeated, is not to punish, but to drive a little<br/>\n<br/>\n </span></blockquote>of the sinfulness from the heart of the child. So, if the hiding succeeded<br/>\n<br/>\nin doing this, it was effective, if it did not, it was ineffective. Giving a<br/>\n<br/>\nchild an ineffective hiding is like hitting a child for no purpose, and that<br/>\n<br/>\nis child abuse. It is therefore very important that the parent must make<br/>\n<br/>\nsure that the hiding is indeed effective.<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;The parent should then make a mental note how many lashes had been hit,<br/>\n<br/>\n </span></blockquote>and must then, at the next visit to the bathroom, hit more and hit harder.<br/>\n<br/>\nIn this way the severity of the hiding must be stepped up until the child<br/>\n<br/>\nresponds to the parent&#39;s embrace.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;Every parent can decide for himself or herself how long he or she wants<br/>\n<br/>\n </span></blockquote>the hiding to last. If you want it to last for two weeks, then hit hard<br/>\n<br/>\nenough and long enough to make it last for two weeks. If you want the hiding<br/>\n<br/>\nto last for two months, then you simply have to hit harder and longer to<br/>\n<br/>\nmake the hiding last longer<br/>\n<br/>\nDiscipline. A parent who really loves his or her child, will never repeat<br/>\n<br/>\nany instruction verbally, but will always repeat it in one way only and that<br/>\n<br/>\nis with a belt or a stick in the bathroom.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Obedience should be prompt, complete and unquestioned. Children should<br/>\n<br/>\n </span></blockquote>learn that their parents mean what they say, and parents should expect their<br/>\n<br/>\nchildren to obey the first time they speak.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Unquestionable obedience means that the authority of the parent may not<br/>\n<br/>\n </span></blockquote>be questioned. If you have to reason and argue with your child in order to<br/>\n<br/>\nget obedience, you will soon find yourself frustrated and outwitted.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;And if a child is commanded to do something and he does so unwillingly,<br/>\n<br/>\n </span></blockquote>fussing or whining, his attitude needs correction too.&quot;&quot;<br/>\n<br/>\n<br/>\nAnd must NOT overlook the &quot;commercial&quot;  for the author&#39;s product and how any<br/>\n<br/>\ndecreased success is the fault of the consumer :-) OR that allowing failure<br/>\n<br/>\nat the task will lead to unemployable adults!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The turning point for Heidi came in September 1997, after seeing a program<br/>\n<br/>\n </span></blockquote>on TV about Dr. Jan Strydom&#39;s work. She made an appointment to see Dr.<br/>\n<br/>\nStrydom in October 1997.<br/>\n<br/>\n<br/>\n&quot;The consultation, which lasted two hours, changed our lives forever,&quot; says<br/>\n<br/>\nHeidi. &quot;Dr. Strydom taught us how to correct Hermann&#39;s behavior problems,<br/>\n<br/>\nand also recommended that we embark on the Audiblox program in order to<br/>\n<br/>\nimprove Hermann&#39;s cognitive abilities.&quot;&gt;&gt;  (This is from following a link<br/>\n<br/>\nabout &quot;another&quot;  child with Tourettes and his cure)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;An improvement was also noted in Hermann&#39;s IQ score. As stated, he scored<br/>\n<br/>\n </span></blockquote>70 on 7 March 1997. When his IQ was re-assessed in November 1998, it was 84.<br/>\n<br/>\nOn 13 June 1999, it was found to be 96.<br/>\n<br/>\n<br/>\n&quot;Best of all,&quot; says Heidi, &quot;after following Dr. Strydom&#39;s advice, our<br/>\n<br/>\naggressive and destructive child was turned into a loving child. He is still<br/>\n<br/>\nvery active and a real chatterbox, but can now sit still and be dead quiet<br/>\n<br/>\nin situations where it is required of him. He can also be trusted to behave<br/>\n<br/>\nwhen left on his own. He goes to bed at normal hours, after watching one or<br/>\n<br/>\ntwo programs on TV - something he never did. He was simply too active. The<br/>\n<br/>\nobsessive-compulsive behavior, the continual swearing and stealing, the<br/>\n<br/>\nsuicidal thoughts and bedwetting are long forgotten.&quot;<br/>\n<br/>\n<br/>\n<br/>\nIf your child has problems similar to those of Hermann,<br/>\n<br/>\ncontact us for help at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:info@...\">info@...</a><br/>\n<br/>\n<br/>\n<br/>\n&quot;&quot;Since 1979 I have been involved in helping children overcome learning<br/>\n<br/>\nproblems, using a program called Audiblox. Audiblox is a system of cognitive<br/>\n<br/>\nexercises, aimed at the development of foundational skills. Of course the<br/>\n<br/>\nchild&#39;s attitude does not change when he does Audiblox. If a child has a<br/>\n<br/>\nwrong attitude toward work, he will only achieve limited success on the<br/>\n<br/>\nprogram. It therefore often happens that parents contact me to ask, for<br/>\n<br/>\nexample, whether they can cut down on the time they have to spend on<br/>\n<br/>\nAudiblox. They say that after some time on the program the child gets bored<br/>\n<br/>\nwith it, because of the repetitive nature of the exercises. It is important<br/>\n<br/>\nto note that the level of difficulty of Audiblox can be increased<br/>\n<br/>\nindefinitely. The boredom is not related to lack of complexity but to<br/>\n<br/>\nroutine, and is therefore merely a sign of a wrong attitude toward work.<br/>\n<br/>\nUnless the child is given the opportunity to learn how to deal with routine,<br/>\n<br/>\nit will make life impossible for him when later he has to enter the labor<br/>\n<br/>\nmarket. Just like he was bored by the Audiblox exercises, routine tasks at<br/>\n<br/>\nwork will also bore him. The nurse, for example, will become bored to have<br/>\n<br/>\nto check the blood pressure of the same patient every day, and the teacher<br/>\n<br/>\nwill be bored with having to follow the same syllabus year after year.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;The child, who wants a break every now and then during the course of an<br/>\n<br/>\n </span></blockquote>Audiblox lesson - purportedly to stretch his legs, or to fetch a cold drink<br/>\n<br/>\nfrom the fridge - will be the worker one day who will want to interrupt a<br/>\n<br/>\nmeeting for a smoke break after every five minutes. The child who becomes<br/>\n<br/>\nstubborn and refuses to continue with the program, will become the rolling<br/>\n<br/>\nstone, moving from one job to the next as soon as he gets bored with a<br/>\n<br/>\ncurrent job. One mother wrote, &quot;We have had a hard time with our son. He<br/>\n<br/>\ndoes not want to do his Audiblox and he gets very defiant in doing it.. He<br/>\n<br/>\ngets very stubborn and does not want to do it.&quot; This mother does not realize<br/>\n<br/>\nthat she has the opportunity - and the duty - to save her son from having a<br/>\n<br/>\nvery unhappy and unproductive work life later as an adult.&gt;&gt;<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Sometimes parents report that the child&#39;s performance on Audiblox has<br/>\n<br/>\n </span></blockquote>deteriorated; for example, whereas he succeeded in doing Sequencing exercise<br/>\n<br/>\n3 with eleven blocks at the start, he can now only manage seven. Such a<br/>\n<br/>\nchild will probably later fritter away his time in the work place.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;Several parents have asked what to do if their child complains that his<br/>\n<br/>\n </span></blockquote>&quot;arms get tired&quot; from doing the Arrows exercise. It is interesting to note<br/>\n<br/>\nin how many cases this complaint came from children who are obviously very<br/>\n<br/>\nable on the sports field! Such a child will most probably later be the<br/>\n<br/>\nworker who sleeps on the job, only to have his energy return when the<br/>\n<br/>\nworkday is over&gt;&gt;&gt;</div>","specialLinks":[]}],"prevTopicId":63892,"nextTopicId":64108}}