{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Another story about poor school officials -  Backlash over cell phone sting (long)","postDate":"1084296990","msgId":93862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNTExLjExMzYzMC4xNTk2LjUuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":93861,"nextInTime":93863,"topicId":93862,"numMessagesInTopic":0,"msgSnippet":"http://www.mcall.com/news/local/all-a1_3privacymay02,0,6643381.story?coll =al From The Morning Call Backlash over cell phone sting Parents allege rights","messageBody":"<div id=\"ygrps-yiv-1128904411\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mcall.com/news/local/all-a1_3privacymay02,0,6643381.story?coll\">http://www.mcall.com/news/local/all-a1_3privacymay02,0,6643381.story?coll</a><br/>\n=al <br/>\n<br/>\nFrom The Morning Call <br/>\n<br/>\n<br/>\nBacklash over cell phone sting<br/>\nParents allege rights violation by Nazareth teacher and a principal.<br/>\n <br/>\n   <br/>\nBy Nancy Averett<br/>\nOf The Morning Call<br/>\n<br/>\nMay 2, 2004<br/>\n<br/>\nLegal and education experts say a Nazareth Area High School student has a<br/>\nstrong case that his right to privacy was violated last month when an<br/>\nassistant principal confiscated his cell phone and used it to check and<br/>\nsend messages.<br/>\n<br/>\nAnd, they say, if the student and the district take their arguments to<br/>\nthe courtroom  legal motions may be filed in state and federal court<br/>\nthis week  it could be the first lawsuit of its kind in the nation.<br/>\n<br/>\n&#39;&#39;It&#39;s the kind of case that could go all the way to the U.S. Supreme<br/>\nCourt,&#39;&#39; said Robert DeKoven, a professor at California Western Law<br/>\nSchool who studies student privacy issues and tracks such lawsuits.<br/>\n<br/>\nAt issue is an incident March 17 when Nazareth technology teacher Shawn<br/>\nKimberly Kocher and Assistant Vice Principal Marge Grube confiscated<br/>\n17-year-old Christopher Klump&#39;s cell phone.<br/>\n<br/>\nGrube, with Kocher&#39;s help, searched his text messages and voice mail.<br/>\nPretending to be Christopher, Grube also used his phone list to call<br/>\nother students and sent a text message to Christopher&#39;s 10-year-old<br/>\nbrother.<br/>\n<br/>\nChristopher&#39;s parents, Toby and Leigh Klump, went before the school board<br/>\nlast month, asking for a public accounting of whether the staff members<br/>\nwould be disciplined. Board Chairman Donald Keller said the Personnel<br/>\nCommittee was discussing the matter but would say nothing more. School<br/>\nlaw and union rules prohibit districts from disclosing staff discipline.<br/>\n<br/>\nGrube and Kocher declined to comment, but district officials do not deny<br/>\nthat the actions took place. They have offered to reimburse phone calls<br/>\n&#39;&#39;to anyone who incurred costs because of the incident&#39;&#39; and send written<br/>\napologies to the parents of any student called.<br/>\n<br/>\nBut they stopped short of saying Grube&#39;s and Kocher&#39;s actions were wrong.<br/>\nDistrict Superintendent Victor Lesky said Grube had reason to believe,<br/>\nbased on a text message on Christopher&#39;s phone, that the teenager might<br/>\nhave been using his phone to deal drugs, and so their search was<br/>\njustified.<br/>\n<br/>\n&#39;&#39;Anytime our administrators are facing a situation that&#39;s maybe drug-<br/>\nand alcohol-related, they&#39;re going to do what they can, within the law,<br/>\nto make sure our kids are safe,&#39;&#39; Lesky said.<br/>\n<br/>\nThe text message came from Christopher&#39;s girlfriend, a college student,<br/>\nand was sent while she was driving in her car to pick up Christopher<br/>\nafter school let out. It read: &#39;&#39;I need a tampon!&#39;&#39;<br/>\n<br/>\nSchool officials say it is common knowledge that tampon is slang for a<br/>\nlarge marijuana cigarette.<br/>\n<br/>\nBut Toby and Leigh Klump say that even if Grube and Kocher had the right<br/>\nto search their son&#39;s cell phone, and they don&#39;t believe they did, there<br/>\nwas no message that indicated Christopher was dealing drugs. The Klumps<br/>\nsaid the request was innocent, and Christopher did indeed find a tampon<br/>\nfor his girlfriend from another girl at school.<br/>\n<br/>\nThey also say Christopher never has been caught at school or anywhere<br/>\nelse using or selling drugs.<br/>\n<br/>\nSchool policy forbids cell phones on school grounds during school hours.<br/>\nBut Nazareth and other districts in the Lehigh Valley area allow students<br/>\nto have phones as long as they remain off and out of sight during the<br/>\nschool day. Lesky said this unwritten rule came about after the Columbine<br/>\nHigh School shootings in Colorado and the Sept. 11, 2001, terrorist<br/>\nattacks so students have a way to contact someone in case of an<br/>\nemergency.<br/>\n<br/>\nBecause of the written policy, the Klumps say, the district had a right<br/>\nto take their son&#39;s phone but nothing more.<br/>\n<br/>\nJamin Raskin, an American University law professor and author of &#39;&#39;We the<br/>\nStudents: Supreme Court Cases for and About Students,&#39;&#39; agrees.<br/>\n<br/>\n&#39;&#39;If there was independent evidence that there was reasonable suspicion<br/>\nof drug dealing going on, perhaps the violation of the student&#39;s strong<br/>\nprivacy interests in his phone could be justified,&#39;&#39; Raskin said in an<br/>\ne-mail. &#39;&#39;But this seems like a real stretch.&#39;&#39;<br/>\n<br/>\nSteve Edwards, a former principal in Hartford, Conn., now vice president<br/>\nof the National Crime Prevention Council, had a similar feeling on the<br/>\nissue.<br/>\n<br/>\n&#39;&#39;I would think that would be crossing the line,&#39;&#39; he said. &#39;&#39;If there&#39;s<br/>\nreasonable cause, you can search a locker, but that&#39;s school property. On<br/>\noccasion as a principal, I would ask a student to empty their pockets or<br/>\npurse. But to take someone&#39;s cell phone and start looking at messages? I<br/>\ndon&#39;t know. Where does it stop?&#39;&#39;<br/>\n<br/>\nCell phone sting or drug sting?<br/>\n<br/>\nMarch 17 was not the first time that Christopher Klump&#39;s cell phone ended<br/>\nup in Marge Grube&#39;s office.<br/>\n<br/>\nLeigh and Toby Klump say their son had his cell phone taken away six or<br/>\nseven times previously. The Klumps, who live in Bushkill Township, said<br/>\nthey told their son to keep it in his car, but he did not always listen.<br/>\n<br/>\nSo when Christopher initially complained that Kocher had spied the phone<br/>\nresting on his knee in class and taken it, the Klumps said they hoped it<br/>\nwould teach him a lesson. But their son had a new twist on the story this<br/>\ntime. He ran into a friend in the hallway outside Grube&#39;s office. The<br/>\nfriend grumbled that Grube had used Christopher&#39;s phone to call him. When<br/>\nhe answered, the friend said, Grube told him to come to her office and<br/>\nturn in his phone.<br/>\n<br/>\nWhen the Klumps first spoke to Grube, they say, she acknowledged that she<br/>\nconducted a cell phone sting of sorts, calling nine students whose<br/>\nnumbers Christopher stored in his phone. Later that night, though, when<br/>\nLeigh Klump looked at the online records for her son&#39;s cell phone<br/>\naccount, she learned Grube had done much more.<br/>\n<br/>\nThe records showed the calls Grube made. They also showed Grube tapped<br/>\ninto Christopher&#39;s voice mail and text messages  and had even sent a<br/>\nmessage, pretending to be Christopher, to their younger son.<br/>\n<br/>\nThe Klumps later confronted Grube and the following is their version of<br/>\nwhat she said: Grube now said that it was not a cell phone sting but a<br/>\ndrug sting that she had conducted with Christopher&#39;s cell phone. She said<br/>\nwhen Kocher took Christopher&#39;s phone away, he told her, &#39;&#39;I was not text<br/>\nmessaging.&#39;&#39;<br/>\n<br/>\nBased on that statement, Grube said she felt justified to check his<br/>\nmessages to see if he had been. While doing so, she said, she discovered<br/>\nthe tampon message that she felt it indicated Christopher might be<br/>\ndealing drugs.<br/>\n<br/>\n&#39;&#39;I can&#39;t remember when a girlfriend ever called me for a tampon,&#39;&#39;<br/>\nSuperintendent Lesky said.<br/>\n<br/>\nThought she was helping<br/>\n<br/>\nSchool officials also said Grube and the Klumps had earlier conversations<br/>\nabout Christopher, and it was these discussions that motivated Grube.<br/>\n<br/>\n&#39;&#39;She actually thought she was taking actions to help them,&#39;&#39; wrote<br/>\ndistrict solicitor Preston Moritz in a letter to Timothy Prendergast, the<br/>\nKlumps&#39; attorney.<br/>\n<br/>\nThe Klumps said they told Grube earlier in the year that they were<br/>\nconcerned because Christopher&#39;s grades were dropping and he skipped<br/>\nschool a few times. They also mentioned that they were concerned about<br/>\nsome of the friends he was hanging out with and that they periodically<br/>\ntest Christopher for drug use. Christopher has never tested positive, and<br/>\nthe Klumps do not believe he uses drugs, but they said they want to be as<br/>\nproactive as they can to keep him from doing so.<br/>\n<br/>\nFinally, Leigh Klump said Grube probably also was aware that they once<br/>\nasked a high school counselor to do a drug and alcohol evaluation of<br/>\nChristopher.<br/>\n<br/>\n&#39;&#39;The counselor said, &#39;You&#39;re crazy. He&#39;s perfectly normal,&#39;&#39;&#39; Leigh<br/>\nKlump recalled with a laugh.<br/>\n<br/>\nWhile the school district may argue that this background information<br/>\njustified Grube&#39;s search of the cell phone, the Klumps don&#39;t see it that<br/>\nway.<br/>\n<br/>\n&#39;&#39;If she had seen my kid in the hallway in some secret exchange that<br/>\nwould be one thing,&#39;&#39; Leigh Klump said. &#39;&#39;But the circumstances just<br/>\ndidn&#39;t warrant the search.&#39;&#39;<br/>\n<br/>\nShe and her husband also said the logical step if Grube suspected<br/>\nChristopher was selling drugs would have been to alert them and the<br/>\npolice.<br/>\n<br/>\nFurthermore, they said, there is another problem with Grube&#39;s claim that<br/>\nthe tampon message justified her search. The Klumps said Grube claimed<br/>\nthe message came in while she was in possession of the phone. The phone<br/>\nrecords, however, told a different story: The message was sent the day<br/>\nbefore the phone was taken.<br/>\n<br/>\n&#39;&#39;Their story has shifted so much,&#39;&#39; said Prendergast. First &#39;&#39;it was the<br/>\ncell phone sting, then it was the whole thing about the tampon. They<br/>\nscrambled to find a reason for why they did what they did.&#39;&#39;<br/>\n<br/>\nCourts strict on privacy issues<br/>\n<br/>\nPrendergast plans to file motions in state and federal court this week,<br/>\nclaiming that his client&#39;s right to privacy under the state and federal<br/>\nconstitutions was violated.<br/>\n<br/>\nPennsylvania is the only state with a constitution that protects privacy<br/>\nrights. DeKoven, the law school professor in California, said that should<br/>\nbe a key factor.<br/>\n<br/>\nThe federal Constitution protects privacy rights, but the U.S. Supreme<br/>\nCourt ruled in 1985 that school administrators can search students if<br/>\nthey have reasonable evidence to suggest the student might have violated<br/>\nschool policy or broken the law. The court said administrators have to be<br/>\nable to protect students from other students.<br/>\n<br/>\nPennsylvania courts, however, have given administrators less leeway.<br/>\n<br/>\n&#39;&#39;Normally, school districts just have to say, &#39;We&#39;re concerned about<br/>\ndrugs and alcohol,&#39;&#39;&#39; DeKoven said. &#39;&#39;In Pennsylvania, the courts have<br/>\nsaid, &#39;You&#39;ve got to actually show the reason why you&#39;re doing this.&#39;<br/>\nIt&#39;s a much higher standard.&#39;&#39;<br/>\n<br/>\nPrendergast said state case law indicates that the courts will consider<br/>\nseveral factors when it comes to determining whether a student&#39;s privacy<br/>\nhas been violated, including whether the district provided notice that it<br/>\nmight conduct searches of cell phone voice and text messages.<br/>\n<br/>\n&#39;&#39;Our position is simple,&#39;&#39; Prendergast wrote in a letter to Moritz, the<br/>\ndistrict solicitor. &#39;&#39;There is no notice provided because these actions<br/>\nwere not anticipated by the authors of the student conduct code and have<br/>\nfar exceeded any authority of the administration to carry out their<br/>\nmandate to protect the health and welfare of the student population.&#39;&#39;<br/>\n<br/>\nDistrict officials said they plan to revise their cell phone policy in<br/>\nlight of this incident.<br/>\n<br/>\nA tough job<br/>\n<br/>\nCell phones, laptops and other technology present a real challenge to<br/>\nschools, experts said.<br/>\n<br/>\nAdministrators have caught students using text messages to cheat on tests<br/>\nand camera phones to send revealing photos of unsuspecting peers.<br/>\nStudents who bring their personal laptops to schools have also been<br/>\ncaught surfing pornography sites.<br/>\n<br/>\nHaving to police this technology, which is getting smaller and thus<br/>\neasier to conceal, can be frustrating to administrators, said Michael<br/>\nCarr, spokesman for the National Association of Secondary School<br/>\nPrincipals.<br/>\n<br/>\nEdwards, the former principal, agreed.<br/>\n<br/>\n&#39;&#39;It&#39;s one of the toughest jobs in America,&#39;&#39; he said of being a<br/>\nprincipal. &#39;&#39;Think of the things these people have constantly placed upon<br/>\nthem: Keeping schools violence- and drug-free, keeping test scores up.&#39;&#39;<br/>\n<br/>\nLittle wonder then, he said, that he has some administrators snap, such<br/>\nas performing a strip search.<br/>\n<br/>\nSeveral years ago, a high school principal in San Diego was demoted after<br/>\nshe made female students show their underwear before heading into a<br/>\nschool dance. The administrator said she was looking to see if the girls<br/>\nwere wearing thong underwear, which was against school policy.<br/>\n<br/>\nLocally, there have been several incidents where school officials<br/>\nappeared to infringe upon student privacy rights. In 2001, a former<br/>\nEmmaus High School swimming coach settled a lawsuit after a student<br/>\nclaimed he violated her privacy when he tried to force her to take a<br/>\npregnancy test.<br/>\n<br/>\nTwo years earlier, Catasauqua cheerleaders complained that their privacy<br/>\nrights were trampled when two administrators searched their luggage<br/>\nbefore they left on a road trip to a competition. In that case, one of<br/>\nthe administrators said he did not have a &#39;&#39;specific&#39;&#39; suspicion about<br/>\nthe cheerleaders.<br/>\n<br/>\nApology sought<br/>\n<br/>\nThe Klumps&#39; attorney, Prendergast, said the couple decided to file the<br/>\nlawsuits because district officials haven&#39;t apologized for Grube&#39;s and<br/>\nKocher&#39;s actions and have not, to their knowledge, disciplined them.<br/>\n<br/>\n&#39;&#39;We hold students to a certain standard,&#39;&#39; Prendergast said. &#39;&#39;It is<br/>\nhypocritical for us not to hold educators to the same standard.If<br/>\nChristopher or any other student had broken the law and school policy,<br/>\nthey would have been disciplined.&#39;&#39;<br/>\n<br/>\nSchool officials said school code and union policy forbids public<br/>\ndiscussion of staff discipline.<br/>\n<br/>\nStill, in a letter to Prendergast, Moritz wrote that the request for<br/>\npunishment would &#39;&#39;be taken under advisement and at the very least,<br/>\nrequired attendance at a student rights workshop will be forthcoming.&#39;&#39;<br/>\n<br/>\nThe district also promised that the Klumps&#39; younger son will not be<br/>\nassigned to Grube when he goes to the high school.<br/>\n<br/>\nIt seems unlikely that the Klumps will be satisfied with those actions.<br/>\n<br/>\n&#39;&#39;Their argument from the start was, &#39;We have the right to do this,&#39;&#39;&#39;<br/>\nLeigh Klump said. &#39;&#39;Well, they don&#39;t. I want a new policy that says, &#39;You<br/>\nguys have to step back here and give these kids room to breathe.&#39;&#39;&#39;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nancy.averett@...\">nancy.averett@...</a><br/>\n<br/>\n610-559-2147 <br/>\nCopyright © 2004, The Morning Call</div>","specialLinks":[]}],"prevTopicId":93826,"nextTopicId":93869}}