{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":86585859,"authorName":"moonmeghan","from":"&quot;moonmeghan&quot; &lt;moonmeghan@...&gt;","profile":"moonmeghan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Digest Number 324","postDate":"1019967787","msgId":6423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFhZnRmYittcXA0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMi5jYjBmYWQxLjI5ZjYyMGQ4QGFvbC5jb20+"},"prevInTopic":6384,"nextInTopic":0,"prevInTime":6422,"nextInTime":6424,"topicId":6375,"numMessagesInTopic":0,"msgSnippet":"... Oh yes!  I do some of my best work at the last minute.  When I want to learn about something, I m like a sponge.  I can absorb fast if I want, or need","messageBody":"<div id=\"ygrps-yiv-1770966092\">&lt;&lt;&lt;&lt;--- In AlwaysLearning@y..., SandraDodd@a... wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; In a message dated 4/22/02 4:20:17 PM, kbcdlovejo@a... <br/>\n </span></blockquote>writes:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &lt;&lt;  But to think that a child will wait until the last <br/>\n&gt; minute to pursue a real dream is ridiculous! &gt;&gt;<br/>\n&gt; <br/>\n&gt; I think it could happen.<br/>\n&gt; I also think it could be pulled off!!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Sandra, who specializes in last-minute&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Oh yes!  I do some of my best &#39;work&#39; at the last minute.  When I <br/>\nwant to learn about something, I&#39;m like a sponge.  I can absorb <br/>\nfast if I want, or need to.  I&#39;m sure there are a lot of &#39;last minute&#39; <br/>\nlearners out there.<br/>\n<br/>\nMeghan</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Digest Number 324","postDate":"1019528920","msgId":6384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMi5jYjBmYWQxLjI5ZjYyMGQ4QGFvbC5jb20+"},"prevInTopic":6382,"nextInTopic":6423,"prevInTime":6383,"nextInTime":6385,"topicId":6375,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/22/02 4:20:17 PM, kbcdlovejo@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-2022093027\">In a message dated 4/22/02 4:20:17 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kbcdlovejo@...\">kbcdlovejo@...</a> writes:<br/>\n<br/>\n&lt;&lt;  But to think that a child will wait until the last <br/>\nminute to pursue a real dream is ridiculous! &gt;&gt;<br/>\n<br/>\nI think it could happen.<br/>\nI also think it could be pulled off!!<br/>\n<br/>\n<br/>\nSandra, who specializes in last-minute</div>","specialLinks":[]},{"userId":59432230,"authorName":"joanna514","from":"&quot;joanna514&quot; &lt;Wilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Digest Number 324","postDate":"1019516084","msgId":6382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFhMjRiays3ZWo5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMWQwMWMxZWExYiRlOGNmNDk4MCQwMTAwYThjMEBtc2hvbWUubmV0Pg=="},"prevInTopic":6380,"nextInTopic":6384,"prevInTime":6381,"nextInTime":6383,"topicId":6375,"numMessagesInTopic":0,"msgSnippet":"... parental input. For example, Dan studied the violin for years and Katherine, my girl, the cello. Both wanted to quit at times, both needed to be encouraged","messageBody":"<div id=\"ygrps-yiv-1769993391\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; My concerns are about the pursuit of concentrated knowledge and <br/>\n </span></blockquote>parental input. For example, Dan studied the violin for years and <br/>\nKatherine, my girl, the cello. Both wanted to quit at times, both <br/>\nneeded to be encouraged to practice. If I had only considered their <br/>\nfeelings, they would never have undergone all the effort, sweat and <br/>\npainful muscle development necessary to play their instruments well. <br/>\nWe changed instructors at times and added or subtracted from their <br/>\ncommitment levels as well, but they would not be able to play now for <br/>\ntheir own enjoyment or for performance if I hadn&#39;t pushed a little.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Are you sure about that?<br/>\nComing from and family of musicians and being married to one, I would <br/>\nhave to disagree.<br/>\nMy brother was never pushed.  He was given complete freedom and now <br/>\nplays music for a living.  It is his life passion. He gives lessons <br/>\nand writes music and performs with my dh as an acoustic duo and in 2 <br/>\nfull bands.  My dh learned to play the guitar at 18.  Never had a <br/>\nmusic lesson in his life and was discouraged many times along the <br/>\nway, but kept at it.  He eventually moved on to the bass and <br/>\nharmonica and is considered  very talented by his peers.  Infact, all <br/>\nof the musicians I know, have become who they are out of passion.  <br/>\nMany are extremely versatile, learning all kinds of instuments for <br/>\nenjoyment and necessity.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I feel this experience translates to other areas as well, but <br/>\n </span></blockquote>perhaps I&#39;m still tied to a school mentality.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Maybe.<br/>\nI push and encourage.  I&#39;m not disparaging that.  I just don&#39;t know <br/>\nif it is a necessity.  Passions guide.  Do we as parents need to?  Do <br/>\nwe decide what someone should be passionate about and pursue?<br/>\nDo we push a little so they won&#39;t miss out?<br/>\nWhile we&#39;re pushing in one direction are they missing out on a better <br/>\none?  One that is truely from them?<br/>\n Questions i have absolutely no idea of the answers.<br/>\nWould i be a better person if my parents had pushed more?  Would I be <br/>\nscrewed up?  I don&#39;t know!!!<br/>\nI like thinking about it though.<br/>\nJoanna</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Digest Number 324","postDate":"1019513272","msgId":6380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2LjI1NjgxMTljLjI5ZjVlM2I4QGFvbC5jb20+"},"prevInTopic":6375,"nextInTopic":6382,"prevInTime":6379,"nextInTime":6381,"topicId":6375,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/22/2002 1:01:27 PM Eastern Daylight Time, ... Well, I figure you ll get a whole bunch of responses to this post but I ll start with this","messageBody":"<div id=\"ygrps-yiv-371891670\">In a message dated 4/22/2002 1:01:27 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lovehome@...\">lovehome@...</a> writes:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt; but my daughter has huge dreams(making her own films, publishing her <br/>\n&gt; books, owning a horse ranch/ history learning center/retirement home <br/>\n&gt; /nature preserve, and continuing to play her cello and pursuing her art <br/>\n&gt; interests of painting and drawing) and will need college courses and <br/>\n&gt; probably a degree to realize many of them. <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Well, I figure you&#39;ll get a whole bunch of responses to this post but I&#39;ll <br/>\nstart with this quote. From the list above, I can&#39;t find a ONE that REQUIRES <br/>\na college course, much less a diploma! Making films? Publishing books? Owning <br/>\na horse ranch? Owning a history learning center? Owning a nature preserve? <br/>\nOwning a retirement home? Playing the cello? Pursuing art/painting/drawing?<br/>\n<br/>\nShe&#39;s not looking to be a doctor, lawyer, vet (because of the previous <br/>\ndiscussion), or CEO of a major corporation---which all require college. If <br/>\nshe knows college is her goal, she&#39;ll naturally seek out the necessary <br/>\nrequirements---and maybe put together a knockout portfolio, take the SAT, and <br/>\nblow them away in the interview. Many schooled kids wait until they&#39;re 16 or <br/>\n17 to start putting ANY effort into making good grades to get into a &quot;good <br/>\ncollege&quot;----and THOUSANDS go to college &quot;just because&quot; with no goal in sight <br/>\nexcept to graduate and get a diploma. <br/>\n<br/>\nBut if her goals are more in line with unschooling---to be her own boss and <br/>\npursue her own interests (horses, art, nature, history, writing, music, <br/>\ngeriatrics, and film making), she certainly doesn&#39;t need college for ANY of <br/>\nthat! And if she decides that she will, she&#39;ll do it in her own time if given <br/>\nsupport and encouragement  (and maybe even withOUT it!&lt;g&gt;).<br/>\n<br/>\nBoth wanted to quit at times, both needed to be encouraged to practice. If I <br/>\nhad only considered their feelings, they would never have undergone all the <br/>\neffort, sweat and painful muscle development necessary to play their <br/>\ninstruments well. We changed instructors at times and added or subtracted <br/>\nfrom their commitment levels as well, but they would not be able to play now <br/>\nfor their own enjoyment or for performance if I hadn&#39;t pushed a little.<br/>\n<br/>\nOr maybe they would have---you&#39;ll never know! Your kids certainly may not <br/>\nhave become such great musicians had you not pushed them; on the other hand, <br/>\nthey MAY have become INCREDIBLE musicians or QUIT if left to their own <br/>\ndevices. <br/>\nBut they didn&#39;t get to decide.<br/>\n<br/>\nBen and Dan, graduated and survivors of ps, both in college pursuing their <br/>\nown interests, at last. AT LAST they&#39;re pursuing their own interests? See, <br/>\nthat&#39;s sad.<br/>\n<br/>\nAssuming that your kids will suddenly discover and teach themselves all they <br/>\nneed to know at 16 to be successful in college is risky IMO. That&#39;s the age <br/>\nwhen MANY kids first start &quot;buckling down&quot; and preparing for college. <br/>\nUnschooled kids may have been doing this all along if that&#39;s where their <br/>\ninterests lie.<br/>\n<br/>\nBig dreams require some planning. Being highly skilled demands discipline. <br/>\nSuccess in college or having any job requires the ability to schedule your <br/>\ntime and being able to show up to do work even when you don&#39;t feel like it. <br/>\nSounds like the perfect unschooling home---it just depends on WHOSE dream it <br/>\nis! A child with a dream WILL plan, and develop discipline (that&#39;s <br/>\nSELF-inflicted, not parent-induced/demanded), and schedule his time, and show <br/>\nup for work. <br/>\n<br/>\nSome of our kids, I&#39;m convinced,  won&#39;t need college or any advanced planning <br/>\nand can make a great life living in the moment always. Some will want law <br/>\nschool or to be ballerinas.  Those potential lawyers and ballerinas will work <br/>\nhard toward those goals because THEY want them!<br/>\n<br/>\n<br/>\nPlease help me to understand your viewpoints about this. I don&#39;t see any way <br/>\naround the planning and preparation stages for lots of lifestyle, career <br/>\nchoices. Neither do I. But to think that a child will wait until the last <br/>\nminute to pursue a real dream is ridiculous! I have a hard time holding <br/>\nmyself and my kids BACK! My husband is constantly having to rein me in <br/>\nbecause I want to do so much YESTERDAY! Both my boys are eager to pursue <br/>\ntheir dreams (although the 6 year old wants to be a superhero! &lt;G&gt;). I think <br/>\nthat&#39;s if it&#39;s something she really wants, she&#39;ll plan it all out---although <br/>\nshe may need your assistance and experience. They&#39;ll CHOSE to plan and <br/>\nprepare for something important! And that dream may fall by the wayside one <br/>\nday, and that&#39;s OK too.<br/>\n<br/>\nkellyinsc<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":65014266,"authorName":"Lovehome","from":"&quot;Lovehome&quot; &lt;lovehome@...&gt;","profile":"lovehome_us","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Digest Number 324","postDate":"1019493412","msgId":6375,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWQwMWMxZWExYiRlOGNmNDk4MCQwMTAwYThjMEBtc2hvbWUubmV0Pg=="},"prevInTopic":0,"nextInTopic":6380,"prevInTime":6374,"nextInTime":6376,"topicId":6375,"numMessagesInTopic":0,"msgSnippet":"Hi all! I m a quiet reader always learning from Illinois. Hi Deborah, where are you? Hi Sandra, we did a little e-mail chat a while back. I feel like I need","messageBody":"<div id=\"ygrps-yiv-1046681084\">Hi all! I&#39;m a quiet reader &#39;always learning&#39; from Illinois. Hi Deborah, where are you?<br/>\n<br/>\nHi Sandra, we did a little e-mail chat a while back. I feel like I need to add my two cents worth finally. Okay, more than two cents, please to forgive.  All of you usually manage to articulate my feelings quite well, so I have avoided being redundant. Lately, the concept of &#39;after unschooling&#39; has been coming up, I think more answers are needed. <br/>\n<br/>\nI&#39;d like to throw out some ideas and reactions to current threads for discussion.<br/>\n<br/>\nI have 2 dss: Ben and Dan, graduated and survivors of ps, both in college pursuing their own interests, at last. <br/>\n<br/>\nI have been homeschooling my dd for three years. She is now 16. I have observed an evolution in my understanding of always learning/unschooling. I wish I had found this educational philosophy when all my kids were young. I could have saved us all a lot of anguish and 6:00 mornings.<br/>\n<br/>\nI, like Pat and others, started with &#39;school at home&#39; and gradually gave up my preconceived notions of how that was going to happen over the years, and have come around to a life of shared learning with my daughter.<br/>\n<br/>\nMy concerns are about the pursuit of concentrated knowledge and parental input. For example, Dan studied the violin for years and Katherine, my girl, the cello. Both wanted to quit at times, both needed to be encouraged to practice. If I had only considered their feelings, they would never have undergone all the effort, sweat and painful muscle development necessary to play their instruments well. We changed instructors at times and added or subtracted from their commitment levels as well, but they would not be able to play now for their own enjoyment or for performance if I hadn&#39;t pushed a little.<br/>\n<br/>\nI feel this experience translates to other areas as well, but perhaps I&#39;m still tied to a school mentality.<br/>\n<br/>\nI think Pat deserves to be congratulated for sticking in there. She wanted to throw in the towel a while back and has kept with it. IMO Pat, you&#39;re doing fine. Yes, you need to follow your own pursuits and become more comfortable w/ clutter and try to understand the inherent value in all that your children do. But IMO, you are donating time and interest and learning effort to adapt your life to your children&#39;s needs, and conversely, they need to also contribute to meeting your needs: relief from chaos and adding to a variety of experience for the family as a whole.<br/>\n<br/>\nQuestions to ask:<br/>\n<br/>\nWhat are the kids gaining from prolonged exposure to computer games?<br/>\n<br/>\nMy oldest ds, Ben, is building a whole career around his interests in the advance of computer graphics engines, driven by incessant game playing and awe at the advances in the technology involved. He&#39;s studying art and animation and now teaching himself computer programming languages, and creating a whole new game for the market.<br/>\n<br/>\nDo your kids have long term plans and goals? <br/>\n<br/>\nSpontaneous learning and living in the present are the norm at our house, but my daughter has huge dreams(making her own films, publishing her books, owning a horse ranch/ history learning center/retirement home /nature preserve, and continuing to play her cello and pursuing her art interests of painting and drawing) and will need college courses and probably a degree to realize many of them. We spent years discovering the best ways for her to learn, healing the wounds of public school, and filling in the gaps in her understanding. Letting your kids deschool is vital, but so is helping them prepare for course work needed to successfully attain their ideal life.<br/>\n<br/>\nWhat skills do your kids need to improve on to make their dreams a reality?<br/>\n<br/>\nAssuming that your kids will suddenly discover and teach themselves all they need to know at 16 to be successful in college is risky IMO. Big dreams require some planning. Being highly skilled demands discipline. Success in college or having any job requires the ability to schedule your time and being able to show up to do work even when you don&#39;t feel like it.<br/>\n<br/>\nSome of our kids will be the veterinarians of tomorrow. They will love making sick animals well--they will need lots of science courses. The computer gamer of today may want to be the engineer of tomorrow. He will need to know long division. Environmentally healthy housing designers will probably need an architectural degree to become employed to build the houses, to get paid and have a life and their own family to unschool. Some of our kids, I&#39;m convinced,  won&#39;t need college or any advanced planning and can make a great life living in the moment always. Some will want law school or to be ballerinas.<br/>\n<br/>\nHow can you help?<br/>\n<br/>\nI am not advocating ps or curriculum plans for your kid&#39;s days, but looking at their future needs of knowing and explaining what their dreams will entail to be realized, may guide them in their daily endeavors somewhat. The methods of learning the needed knowledge are limited only by the imagination of parents and children. These suggestions are strictly for the older set: 13 and up. <br/>\n<br/>\nPlease help me to understand your viewpoints about this. I don&#39;t see any way around the planning and preparation stages for lots of lifestyle, career choices. <br/>\n<br/>\nThere are no days in life so memorable as those which vibrated to some stroke of the imagination. -- Ralph Waldo Emerson<br/>\n<br/>\nCausing trouble and throwing wrenches into the mix. <br/>\n<br/>\nCollette<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":6418,"nextTopicId":6401}}