{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":0,"authorName":"FreeSchool@xxx.xxx","from":"FreeSchool@...","replyTo":"LIST","senderId":"O9cWZ6w4VfIHcExy8oy2YvA6ykUDHrG4NDxPp0l4aVn85o7lF0sVUxVuglPxROj0Pl2grRiZgGLk","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introducing Myself (long)","postDate":"928520690","msgId":451,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40OS40NTEuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":429,"nextInTopic":0,"prevInTime":450,"nextInTime":452,"topicId":289,"numMessagesInTopic":0,"msgSnippet":"In a message dated 6/3/99 11:06:24 AM Central Daylight Time, jalecroy@InfoAve.Net writes: ","messageBody":"<div id=\"ygrps-yiv-1849490820\">In a message dated 6/3/99 11:06:24 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jalecroy@...\">jalecroy@...</a> writes:<br/>\n<br/>\n&lt;&lt; Regarding &quot;are our kids learning?&quot; I think the biggest weapon Satan<br/>\n uses in this world, and especially in the church because I see it<br/>\n everyday, is comparison. So many moms and dads are so obsessed with<br/>\n comparing their children to another&#39;s children. It&#39;s destructive. My<br/>\n kids are my kids and designed uniquely from any others. Just let your<br/>\n kids be who they are and let them develop at their own pace. Comparison<br/>\n breeds dissatisfaction and jealousy and envy. Not good things. Our kids<br/>\n will learn when they are ready. I know I did. &gt;&gt;<br/>\n<br/>\n<br/>\nDenise,<br/>\n     Your letter was Awesome!  Don&#39;t apologize for it being long, I loved it. <br/>\n It brings up alot of my own public school memories (I got good grades, but <br/>\nschool was hell for me) as well as my own childrens.  I think that alot of <br/>\npeople (especially me) need to be reminded about how bad the public school <br/>\nsystem is and how it is failing our children.  That itself will help give up <br/>\nthe courage to go on with what we are doing, and the encouragement to know <br/>\nthat it is the right thing to do.  Thank you!<br/>\nTami IN</div>","specialLinks":[]},{"userId":0,"authorName":"A.Y.","from":"&quot;A.Y.&quot; &lt;hooperck@...","replyTo":"LIST","senderId":"TcS_5Uhau_BKQ95N4BEcB_SYrRLu_smY3N1e34l3j5riNFUluO4Kz-pt1TQl-Xo_kel6mbMrI8O7NmSlqPaCaaHPebMu","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introducing Myself (long)","postDate":"928511844","msgId":429,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40OS40MjkuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":421,"nextInTopic":451,"prevInTime":428,"nextInTime":430,"topicId":289,"numMessagesInTopic":0,"msgSnippet":"Priss!  Hi! Your so close to us!! We love Saluda, and were just there yesterday playing with our very best and favorite friends. You should come visit us some","messageBody":"<div id=\"ygrps-yiv-599254725\">Priss!  Hi!<br/>\nYour so close to us!!<br/>\nWe love Saluda, and were just there yesterday playing with our very best and<br/>\nfavorite friends.<br/>\nYou should come visit us some time.<br/>\nAnn<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Priss1000@...\">Priss1000@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Priss1000@...\">Priss1000@...</a><br/>\n&gt;<br/>\n&gt; &gt;&gt;  I know live about 4 hours from you, near Tryon, NC&lt;&lt;<br/>\n&gt;<br/>\n&gt; I haven&#39;t been able to catch up entirely on all the digests of the last day,<br/>\n&gt; but I wanted to do a quick intro and tell Ann in NC that I&#39;m near Greenville,<br/>\n&gt; SC, not far away. Also we&#39;re looking hard and heavy into moving up your way.<br/>\n&gt; We want to move to Saluda which is right down the road from you. We have real<br/>\n&gt; estate guides from up there coming out of our ears right now! It&#39;s probably a<br/>\n&gt; pipe dream until our 18 year old gets out of college though :( Maybe we can<br/>\n&gt; meet sometime?<br/>\n&gt;<br/>\n&gt; I&#39;ve been homeschooling my 8 year old son for a year now. I&#39;m didn&#39;t unschool<br/>\n&gt; this year but I&#39;m so intrigued by it. My husband is supportive of<br/>\n&gt; homeschooling but not of unschooling. He is an engineer so he insists that we<br/>\n&gt; cover math every day. I love math myself and want my son to enjoy it so I<br/>\n&gt; like working with him on it. Other than that we were pretty loose, but I<br/>\n&gt; cannot claim the unschooling tag. We are taking a little summer break from<br/>\n&gt; even the math right now and my son has delighted us by immediately wanting to<br/>\n&gt; learn about Native Americans and ancient Egypt. If the summer continues like<br/>\n&gt; this, perhaps my husband will look more favorably upon unschooling.<br/>\n&gt;<br/>\n&gt; I also have two older children, daughters 18 and nearly 22. They weren&#39;t<br/>\n&gt; homeschooled but now that they see how much fun their brother has, they wish<br/>\n&gt; they had been. I never considered it when they were young since I thought<br/>\n&gt; homeschooling could only be very structured and very religious, neither of<br/>\n&gt; which we were. There are many many homeschoolers in Greenville but they are<br/>\n&gt; nearly all fit that profile. (Greenville is the home of Bob Jones University,<br/>\n&gt; known for very structured homeschooling materials) Since we don&#39;t want to<br/>\n&gt; join a statement of faith homeschool group, we don&#39;t have too many homeschool<br/>\n&gt; families to hang out with. I have met a few though and I&#39;d love to meet more.<br/>\n&gt;<br/>\n&gt; That&#39;s about it for us. I&#39;m enjoying this list but I don&#39;t know when I&#39;ll<br/>\n&gt; ever catch up with all the mail!!<br/>\n&gt;<br/>\n&gt; Priss in SC<br/>\n&gt;<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Looking to expand your world?<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onelist.com\">http://www.onelist.com</a><br/>\n&gt; ONElist has nearly 160,000 e-mail communities from which to chose!<br/>\n&gt; ------------------------------------------------------------------------<br/>\n&gt; Check it out!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"Andi Kaufman","from":"Andi Kaufman &lt;tl2b@...","replyTo":"LIST","senderId":"yXjKC0HSS2sqEmOvAVQtk5tWO_7zR9Vx9CESNNHDcJVSXQB4ZfKKxC3FkI90jsmg_RKLoBwKaEU5VfxEIEFdpVF8TCmlyyodHA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introducing Myself (long)","postDate":"928507265","msgId":421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40OC40MjEuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":301,"nextInTopic":429,"prevInTime":420,"nextInTime":422,"topicId":289,"numMessagesInTopic":0,"msgSnippet":"welcome priss. my partner is not too keen on unschooling either which is why we do some workbook stuff but i dont push it very hard. Andi...domestic goddess","messageBody":"<div id=\"ygrps-yiv-950709286\">welcome priss. my partner is not too keen on unschooling either which is<br/>\nwhy we do some workbook stuff but i dont push it very hard.<br/>\n<br/>\nAndi...domestic goddess and active volunteer<br/>\n\t  mom to Isaac<br/>\n\t  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tl2b@...\">tl2b@...</a><br/>\n<br/>\nNever Underestimate the Power of This Woman!</div>","specialLinks":[]},{"userId":0,"authorName":"A.Y.","from":"&quot;A.Y.&quot; &lt;hooperck@...","replyTo":"LIST","senderId":"CkK_Qiyf5YtzpFjhrIEcZGLMya6d691RGuB8YNEPDkwE-M7_LGqULildBZ3WGwQCr7JMFl2l5RcGBr7sc4I_y_5lQWye","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introducing Myself (long)","postDate":"928430947","msgId":301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40My4zMDEuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":289,"nextInTopic":421,"prevInTime":300,"nextInTime":302,"topicId":289,"numMessagesInTopic":0,"msgSnippet":"Hi Denise, I grew up in Lake Forest.  I know live about 4 hours from you, near Tryon NC. Small world huh?? Ann","messageBody":"<div id=\"ygrps-yiv-274724185\">Hi Denise,<br/>\nI grew up in Lake Forest.  I know live about 4 hours from you, near Tryon<br/>\nNC.<br/>\nSmall world huh??<br/>\nAnn</div>","specialLinks":[]},{"userId":0,"authorName":"Tea Lover Denise","from":"Tea Lover Denise &lt;jalecroy@...","replyTo":"LIST","senderId":"E7sUDEPjTjFq0dZTV8fXaX_imOyl7t-6rx-j8yowZRzCVqTInyqKKcYfsVzX_U3eUOZBH86sRuDTDh5E5AMAUz1PN00DKb3C21kEALGi","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Introducing Myself (long)","postDate":"928426465","msgId":289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40My4yODkuOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":301,"prevInTime":288,"nextInTime":290,"topicId":289,"numMessagesInTopic":0,"msgSnippet":"Good Morning! I just joined the list and have checked out the website. Very impressive. I am involved in a couple of other homeschool/unschool email loops, but","messageBody":"<div id=\"ygrps-yiv-634732830\">Good Morning!<br/>\n<br/>\nI just joined the list and have checked out the website. Very<br/>\nimpressive. I am involved in a couple of other homeschool/unschool email<br/>\nloops, but this one is by far the most active! I honestly don&#39;t know if<br/>\nI&#39;ll be able to keep up with it, even in digest form. I&#39;ll try....<br/>\n<br/>\nI am 44 yrs old and live outside of Charleston, SC; I was raised in<br/>\nIllinois, about 40 miles west of Chicago. Nice small town, cornfield in<br/>\nthe backyard, went to ps in a great school system (Geneva, IL). I did<br/>\nnot go to college, which has always been my regret. I was not a good<br/>\nstudent. It wasn&#39;t until probably my early 30&#39;s that I really found an<br/>\ninterest in certain things and most of what I have learned (and I&#39;m<br/>\nstill learning and loving it) has been since then. For the past seven<br/>\nyears, I&#39;ve worked at my church, first as bookkeeper and then as<br/>\nMinisterial Assistant to the Pastor. I quit my job in January, but am<br/>\nstill the Women&#39;s Ministry Director.<br/>\n<br/>\nWe have 3 children: <br/>\n<br/>\nMy oldest daughter is married and just bore our first grandchild in<br/>\nFebruary. She and her husband live here in our town, although I fully<br/>\nexpect them to move one of these days. She is 9 hours shy of receiving<br/>\nher BS in Math from Winthrop University. Jennifer was a model student in<br/>\nschool ... always studied, loved learning and was &quot;teacher pleaser,&quot;<br/>\nnever got in trouble, took advance classes, and had a wonderful public<br/>\nschool experience. She always had a motivation to go to college, and it<br/>\nhappened. She is 22 yrs old now.<br/>\n<br/>\nOur middle child, a son, had a TERRIBLE high school experience. While we<br/>\nalways worked hard never to compare the two, he just wasn&#39;t turned on to<br/>\nwhat they were teaching in school. He&#39;s a *very* social person, and<br/>\nschool was great FUN for him in that respect. However, early on, the<br/>\nadministration marked him because of some stupid (though not serious)<br/>\npranks JB was involved, and for five years (yes, 5) it was like a prison<br/>\nfor him. He was *always* either being suspended or receiving detention<br/>\nfor having his shirt untucked, being tardy, etc., etc. You know the<br/>\ntune. His high school years were h*** for him and us, and it really took<br/>\na toll on our marriage as well. My husband was adament that he graduate<br/>\n(he was a hs drop-out who earned a GED) and he was *constantly* on JB&#39;s<br/>\ncase about homework, etc. Looking back on it now, I realize what a waste<br/>\nof energy that was. Finally, when JB had earned enough credits to<br/>\ngraduate, turned out he was failing one course (CP Chemistry) by TWO<br/>\nPOINTS. Failing the class would mean he&#39;d have to go to summer school<br/>\nand graduate with a summer school ceremony ~ after FIVE YEARS in high<br/>\nschool. My husband and I met with the principal and the chemistry<br/>\nteacher. We asked him to double-check his gradebook, which he did; still<br/>\ntwo points shy of passing. We asked if JB could do some extra work to<br/>\nmake up the two points so he could &quot;walk&quot; with his class and get out of<br/>\nthere. The answer was no. No extra work, no giving him the two points.<br/>\nThat was it. THEN we find out, after asking the guidance counselor to do<br/>\na double-check on his credits, that he was actually only ONE HALF CREDIT<br/>\nshy of the required 20 credits, but guess what? They still made him take<br/>\na summer course (correspondence, because he SWORE he&#39;d never set foot in<br/>\nthat school again) and he finally did graduate. He was 18 then; he&#39;s 20<br/>\nnow.<br/>\n<br/>\nOur youngest daughter just finished her sophomore year. Meg has always<br/>\nbeen a &quot;marginal&quot; student (their term) and showed no motivation or<br/>\ninterest in school at all. Very much like her brother, only not so much<br/>\ninto the &quot;social&quot; thing at school. She struggled with her studies and<br/>\ncould never focus or concentrate. She will be 17 yrs old this fall.<br/>\n<br/>\nFor the most part, I&#39;ve always been a working mom. We always said I<br/>\n&quot;had&quot; to work. But then late last year, some things in my life started<br/>\nto change ~ me! I don&#39;t know if it was a mid-life crisis or what, but I<br/>\nreally started taking stock of my life and what time was left in my<br/>\nlife. My husband and I talked about it and I decided (with him in<br/>\nagreement) that in my heart I really wanted to be home, and always had.<br/>\nI love being home. I think maybe the experience with JB, and the things<br/>\nwe were going through with Meg in high school now, taught us something.<br/>\nAnyway, I decided to quit my job and stay at home for a couple of<br/>\nreasons:<br/>\n<br/>\n1) To offer to babysit my new grandson during the day (my daughter and<br/>\nsil both work full-time). I want to be present in this child&#39;s life<br/>\nduring the time that I can ... my kids unfortunately never had this in<br/>\ntheir lives. <br/>\n<br/>\n2) To get to know Meg. At the time I quit, I had not even DREAMED of<br/>\nhomeschooling. I only knew that, being a &quot;low-maintenance&quot; child, she<br/>\nhad virtually raised herself, and that I needed to get to know her and<br/>\nconnect with her.<br/>\n<br/>\n3) I felt like my time working at the church was good, but I was really<br/>\nspinning my wheels doing a little bit of a lot of things; I wanted to<br/>\nconcentrate on making a positive contribution to this world on a more<br/>\npersonal level. How, I don&#39;t know; am still on that journey.<br/>\n<br/>\nSo, I prayed for God to show me just how I was to do this thing with<br/>\nMeg. And that&#39;s where the homeschooling thing happened. I felt like God<br/>\ntold me to pull her out of ps and homeschool her. This was something I<br/>\nNEVER would have imagined! I knew a little bit about it because some<br/>\nfamilies in our church homeschool their little ones (no teens), but my<br/>\ninterpretation of homeschooling was &quot;school in a box&quot; and I KNEW that<br/>\nthat would never work for my kids and I really had a kind of negative<br/>\nview about homeschooling. Most people in my church use A Beka and I just<br/>\ncouldn&#39;t fathom setting Meg in front of a VCR all day with a workbook.<br/>\nEr go, my negative opinion of homeschooling. <br/>\n<br/>\nI decided to go on the quest by myself. I started reading everything I<br/>\ncould about homeschooling; I did lots of internet research; joined some<br/>\nhomeschool email groups; networked with anyone I could find who was<br/>\nhomeschooling, asking questions, etc. And then, while flipping through<br/>\nThe Elijah Company catalog, I came upon the concept of unschooling.<br/>\nBingo. I knew that was the way to go, both for me and for Meg.<br/>\nUnschooling is exactly what I think I&#39;ve been doing to myself all these<br/>\nyears, and knowing Meg the way I do, I believe it&#39;s right for her.<br/>\n<br/>\nShe was very open to it ~ high school was becoming a burden for her. She<br/>\nwas getting terrible headaches; teachers would bring up her brother&#39;s<br/>\nname and be sarcastic to her about him; and then it got to where she<br/>\nwasn&#39;t wanting to go at all. <br/>\n<br/>\nWhen we finally made the decision to JUST DO IT, I must admit, it was<br/>\ndifficult. As someone said, unschooling isn&#39;t a method, it&#39;s a different<br/>\nway of thinking and, I would say, of living, as well. And since NO ONE<br/>\naround us unschools, it was pretty scary. But we knew she couldn&#39;t ride<br/>\nit out until the end of the school year, so about a month ago we joined<br/>\na homeschool association (to make it legal) and I called them up and<br/>\ntold them she was never coming back.<br/>\n<br/>\nResistance? Yes, some of her teachers have had very sarcastic things to<br/>\nsay to her; when she went back to the school one day to turn in a<br/>\ntextbook, the principal (a Ph.D.) ~ who knew why she had pulled out of<br/>\npublic school ~ smiled and said to her, &quot;So, you quitting school?&quot;<br/>\nTHings like that REALLY REALLY REALLY make me mad, but after all the<br/>\nreading I&#39;ve done, I understand their FEAR.<br/>\n<br/>\nSo.....we begin. The timing is good for deschooling since it&#39;s summer.<br/>\nIt&#39;s been amazing to see the change in Meg, and so quickly. She&#39;s become<br/>\nfascinated with the baby and I think is learning so much just by being<br/>\naround him here every day; the other night she went to the store for me<br/>\nto pick up some things and she came back with a cage and a NEWT! She<br/>\nsaid, &quot;Mom... it&#39;s educational!&quot; I thought to myself, &quot;Go for it!&quot; (BTW,<br/>\nhis name is Duke.) And for the past few days,I&#39;ve &quot;caught&quot; her playing<br/>\nthe &quot;Where in the US is Carmen San Diego&quot; on the computer ...<br/>\n(geography), on her own. It&#39;s so cool. We&#39;re very excited as we look<br/>\nforward to the fall and the things we want to do ... museums, concerts,<br/>\nreading, etc. She still has a long way to go, don&#39;t get me wrong. She<br/>\nmisses her friends a lot, and the &quot;unstructure&quot; is something so new to<br/>\nher, after being herded from stall to stall all day long in school. But<br/>\nI really believe this is the right thing to do, and something that<br/>\nhonors God and my family, as well as my heart.<br/>\n<br/>\nLet me say this about our son, too. He&#39;s been out of school for a couple<br/>\nof years now. He just finished taking 3 classes at a tech college, which<br/>\nhe failed. He started out going to class, but then quit. He&#39;s just not<br/>\ninterested. But now, that&#39;s okay with me and with his Dad. (Well, with<br/>\nme anyway; his Dad is trying to understand.) We&#39;ve come to terms with<br/>\nthe fact that JB will find his niche when it&#39;s his time. Right now, he&#39;s<br/>\nworking as a waiter and LOVES it because he&#39;s such a people-person. I<br/>\ndoubt he&#39;ll want to be a waiter for the rest of his life, but he&#39;s still<br/>\non the road to self-discovery, and it&#39;s neat to sit back and watch. He&#39;s<br/>\nturned in to a very &quot;responsible, productive citizen.&quot; And that happened<br/>\nAFTER he was out of school.<br/>\n<br/>\nI wish I had homeschooled JB when he as in high school, but for whatever<br/>\nreason, I wasn&#39;t led to do it at that time. <br/>\n<br/>\nTwo more comments, and then I&#39;ll close:<br/>\n<br/>\n1) I want to say that the book that gave me the confidence to make my<br/>\nunschooling decision was Grace Llewellyn&#39;s &quot;The Teenage Liberation<br/>\nHandbook ~ How To Quit School And Get A Real Life and Education.&quot; It is<br/>\nfabulous! I think everyone who is homeschooling or thinking of<br/>\nhomeschooling a teenager should read it. Also, John Gatto&#39;s, &quot;Dumbing Us<br/>\nDown,&quot; helped me get a grip on, as he puts it, &quot;the hidden curriculum of<br/>\ncompulsory schooling.&quot;  <br/>\n<br/>\n2) Regarding &quot;are our kids learning?&quot; I think the biggest weapon Satan<br/>\nuses in this world, and especially in the church because I see it<br/>\neveryday, is comparison. So many moms and dads are so obsessed with<br/>\ncomparing their children to another&#39;s children. It&#39;s destructive. My<br/>\nkids are my kids and designed uniquely from any others. Just let your<br/>\nkids be who they are and let them develop at their own pace. Comparison<br/>\nbreeds dissatisfaction and jealousy and envy. Not good things. Our kids<br/>\nwill learn when they are ready. I know I did.<br/>\n<br/>\nSorry this is so long, but I am just so excited about unschooling and<br/>\nabout finally &quot;taking charge&quot; of my life, it&#39;s exhilerating! <br/>\n<br/>\nAs for comments people make to me about unschooling, I just ignore them.<br/>\nI think that the women who say negative things to me about my decision<br/>\nare secretly feeling that they wish they had the courage to do what I<br/>\ndid for the sake of my daughter. (Most women stay at home when the kids<br/>\nare little, not when they are teens.) When I challenge them to do the<br/>\nsame, they say, &quot;Well, we can&#39;t financially...&quot; blah blah blah I used to<br/>\nsay that, too. But it&#39;s working out so far. Where there&#39;s a will,<br/>\nthere&#39;s a way, for sure!<br/>\n<br/>\nLooking forward to learning even more...<br/>\n<br/>\nDenise, a Tea Lover<br/>\nSouth Carolina <br/>\nVisit my homepage at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.angelfire.com/sc/tealover\">http://www.angelfire.com/sc/tealover</a></div>","specialLinks":[]}],"prevTopicId":445,"nextTopicId":453}}