{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Afraid to grow up","postDate":"1500218824","msgId":78144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJFRDFBOTAxLTU0OUUtNDBDOS05QTg1LUQ1NjM4MzgyN0Y3MUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE4OEE1NzY0LTdBNEItNDM0RS04NDQ5LUJDRDAxNzRBRTBCN0BzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBRkxLeTMydlZvLUFZPUVkeWNpUW9HSlA1WjB5aFJucnY2QTU1VS03cFMtS1pCMkRlUUBtYWlsLmdtYWlsLmNvbT4gPEMxNjZCNDE3LTQ2MDUtNDJGMy1CQjU2LTFCMTk5NDQ0OEJDOUBzYW5kcmFkb2RkLmNvbT4gPDE4OEE1NzY0LTdBNEItNDM0RS04NDQ5LUJDRDAxNzRBRTBCN0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78132,"nextInTopic":0,"prevInTime":78143,"nextInTime":78145,"topicId":78120,"numMessagesInTopic":0,"msgSnippet":"CBS Sunday Morning, a news magazine always shows something about every day of the upcoming week. Comic Con was listed, and the body-painting event in New York.","messageBody":"<div id=\"ygrps-yiv-1088325261\">CBS Sunday Morning, a news magazine always shows something about every day of the upcoming week. <br/>\n<br/>\nComic Con was listed, and the body-painting event in New York.   Things like that would not have been happening in the 1940’s or 1950’s.  <br/>\n<br/>\nIn times and places of peace and plenty, and I suppose partly because of baby boomers and Peter Pan, there are very many fun things for adults to do in continuingly childlike ways.<br/>\n<br/>\nMaybe share this with children who worry about growing up, too:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wonder\">http://sandradodd.com/wonder</a><br/>\n<br/>\nIf they continue to prize their curiosity and joy, other apsects can still be joyful.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Afraid to grow up","postDate":"1499875000","msgId":78132,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE4OEE1NzY0LTdBNEItNDM0RS04NDQ5LUJDRDAxNzRBRTBCN0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEMxNjZCNDE3LTQ2MDUtNDJGMy1CQjU2LTFCMTk5NDQ0OEJDOUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBRkxLeTMydlZvLUFZPUVkeWNpUW9HSlA1WjB5aFJucnY2QTU1VS03cFMtS1pCMkRlUUBtYWlsLmdtYWlsLmNvbT4gPEMxNjZCNDE3LTQ2MDUtNDJGMy1CQjU2LTFCMTk5NDQ0OEJDOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78131,"nextInTopic":78144,"prevInTime":78131,"nextInTime":78133,"topicId":78120,"numMessagesInTopic":0,"msgSnippet":"I thought of another thing that might be a comfort to some kids. In times of hardship (and in places that are still…)—famine, war—childhood is cut short","messageBody":"<div id=\"ygrps-yiv-1031719287\">I thought of another thing that might be a comfort to some kids.<br/>\n<br/>\nIn times of hardship (and in places that are still…)—famine, war—childhood is cut short and people are in survival mode and life is harsh.  <br/>\nDon’t tell the kids that, I just want to make the point before someone writes and says so as if I were not aware of that.  Yes.  Some people have a murderous father and a drug-addiced mother.  Let’s set that aside for now and assume that most people reading here are in calmer surroundings.<br/>\n<br/>\nThere are many more things for adults now that involve playing.  Trampoline parks, ninja warrior obstacle courses, escape rooms, online games, conferences that involve costumes and contests.  Becoming an adult (at least in the U.S., Canada, parts of Europe) might not be the end-of-playing that some people imagine.  <br/>\n<br/>\nWhen Kirby has his 31st birthday party, it will be board games and karaoke (at his house)—his wife has the same birthday (different year, same date).  There will be people of a large range of ages.<br/>\n<br/>\nBecause I don’t know what the particular child mentioned is worried about, I’m brainstorming in the dark, but there are probably ideas or stories in here that will help some readers somehow.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Afraid to grow up","postDate":"1499867553","msgId":78131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4RjlGOUUwLUU5REEtNDgxMi04NTFCLTBDM0E5RkY0ODJGNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEMxNjZCNDE3LTQ2MDUtNDJGMy1CQjU2LTFCMTk5NDQ0OEJDOUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBRkxLeTMydlZvLUFZPUVkeWNpUW9HSlA1WjB5aFJucnY2QTU1VS03cFMtS1pCMkRlUUBtYWlsLmdtYWlsLmNvbT4gPEMxNjZCNDE3LTQ2MDUtNDJGMy1CQjU2LTFCMTk5NDQ0OEJDOUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78130,"nextInTopic":78132,"prevInTime":78130,"nextInTime":78132,"topicId":78120,"numMessagesInTopic":0,"msgSnippet":"Marty (my mid-kid) says that 30 is the new 21.  Things that people in the 20th century might have expected to have or do in their early 20s don’t happen now","messageBody":"<div id=\"ygrps-yiv-548669713\">Marty (my mid-kid) says that 30 is the new 21.  Things that people in the 20th century might have expected to have or do in their early 20s don’t happen now until 30s (regarding jobs, cars, houses).  I don’t have a link to “proof,” but he did seem to know what he was talking about when he was telling me.<br/>\n<br/>\nHere’s what my own kids are doing lately, which might be of interest for one reason or another:<br/>\n<br/>\nKirby took just three classes at the community college, but he has worked since he was 14, and has trained and supervised others most of that time.  He will be 31 later this month.  He’s  married to someone with an eight-year-old girl.  Kirby has been her dad, effectively, since she was four/nearly five.  He will adopt her this winter, if things stay to plan.<br/>\n<br/>\nMarty is 28 and has one more year of a degree in economics, minor in geography.  He also just got a paid internship with the Rio Grande Water Authority, which might turn into a profession, or might just be a ton of learning about water management in the desert, and how cities get water in and back out.  He has been married three years and his wife is pregnant.<br/>\n<br/>\nHolly is 25, living at home again (she’s been in and out now for eight years) and is in another exploratory phase, recovering from some weirdnesses she experienced living in my hometown for a while.  I’m sympathetic.  I’m glad we didn’t move out of our big house when the kids grew up.  Marty was home until he was 24.  Kirby was home until nearly 21, when his job moved him to Austin, suddenly.  When he left Austin, he and his family-to-be moved in with us for half a year.  When Holly came back, she had a bunch of furniture and housewares.  <br/>\n<br/>\nSo parents!  If you can manage it, plan on the possibility of being an extended runway, a re-launching pad, a haven for who knows what in the future.  <br/>\n<br/>\nA trivia story….<br/>\n<br/>\nMarty still drives the same Jeep Wrangler he started buying when he was seventeen. We had bought the jeep, and set up payments for Marty to pay us back.  He was working at a grocery store. When Kirby and Holly inherited vehicles from relatives who died (an uncle, a grandfather), we forgave the rest of Marty’s jeep loan, for parity among the kids.<br/>\n<br/>\nWhen I was a young adult, my parents couldn’t help me much financially.  My dad kept me in running VW bugs for a while, until I could buy my own car.   Keith’s parents helped him financially, but there was always a guilt-invoking speech from his mom that went with it.  So when we can help our kids it’s WAY sweeter and more generous than his parents were with us.  If they need something and can’t afford it, we lend them money or give it to them.  And they’ve never abused this, just as they didn’t when they were little.  They WANT to do things on their own with their own money, and we want to be their back-up.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Afraid to grow up","postDate":"1499864689","msgId":78130,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxNjZCNDE3LTQ2MDUtNDJGMy1CQjU2LTFCMTk5NDQ0OEJDOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRkxLeTMydlZvLUFZPUVkeWNpUW9HSlA1WjB5aFJucnY2QTU1VS03cFMtS1pCMkRlUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRkxLeTMydlZvLUFZPUVkeWNpUW9HSlA1WjB5aFJucnY2QTU1VS03cFMtS1pCMkRlUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":78128,"nextInTopic":78131,"prevInTime":78129,"nextInTime":78131,"topicId":78120,"numMessagesInTopic":0,"msgSnippet":"Tress, about growing up, what you said seems good. -=-My daughter, unschooled since age 6 and soon to be 15, told me that she googled I m afraid to grow up,","messageBody":"<div id=\"ygrps-yiv-1905841061\">Tress, about growing up, what you said seems good.<br/>\n<br/>\n-=-My daughter, unschooled since age 6 and soon to be 15, told me that she googled &quot;I&#39;m afraid to grow up,&quot; hoping to find something comforting.  Everything she found on the subject referenced school, school friends or college. She said that none of it was helpful for her since she doesn&#39;t go to school and she doesn&#39;t want to go to college.-=-<br/>\n<br/>\nMaybe for fun look up “adulting.”  There have been some helpful and amusing things written in a light way.  Sometimes it’s about school not preparing kids for “the real world,” but unschoolers are already in the real world.  Sometimes it’s things that parents can’t help much with, either, because the world now is so different.  I can’t advise on bank transfers or bitcoins, but I COULD show my kids how to balance a checkbook.  Only they don’t really use checkbooks.  If they write a check, they just look at their balance on the computer to see that the check went through.  <br/>\n<br/>\nThere are lots of examples you could think of, I’m sure, of things your grandparents or parents thought you would really need to know that, it turns out, you don’t.  And some other things (like how to get wifi or which smart phone to get, and how to keep track of chargers) that they couldn’t have imagined you would need to know.<br/>\n<br/>\n-=-I searched sandradodd.com for the same topic and didn&#39;t come up with anything.  Are there writings on the website that I missed?  Can you suggest other versions of the wording that might produce something helpful?-=-<br/>\n<br/>\nI can’t think of anything that’s already there.<br/>\n<br/>\nHolly had a period of saying she liked the age she was and didn’t want to grow up.<br/>\nI remember feeling that way when I was 9, and 13.  Very content—happy with my thoughts, and not interested in moving into the unknown future.<br/>\n<br/>\nIt might be too morbid for her, but there is the “alternative is death” take on getting older, which is sometimes also a humorous take, but sometimes not so funny.  Maybe using old people as an example you could say that few people WANT to be 80, but when they get to their 70s, it’s the only place to go, really, and starts to look better.<br/>\n<br/>\nMy friend Charles didn’t make it past 14.  I have a photo of his gravestone on my website.  My dad died in his 50’s.  <br/>\nI don’t guess those are the stories she’s going to want to hear, though.<br/>\n<br/>\nSo what I really think you could say is some of these things, if it comes up, and if she’s not more sure of what it is she’s fearing:<br/>\nIt’s kinda scary, not knowing.<br/>\nLots of people feel that way.<br/>\nI remember that feeling.<br/>\nSometimes people are in a hurry to get older, and then they don’t have as much fun as they thought they would.<br/>\nIt’s better to live happily where you are, even though you know you can’t stay there.<br/>\n<br/>\nPocahontas… that song about not stepping in the same river twice.<br/>\nHere: <a rel=\"nofollow\" target=\"_blank\" href=\"https://www.youtube.com/watch?v=shTNJhjumhY\">https://www.youtube.com/watch?v=shTNJhjumhY</a><br/>\n<br/>\nAre there other easily-accessible philosophical (or humorous) things about growing up?  If there are enough, I could make a page for it.<br/>\n<br/>\nSandra</div>","specialLinks":[{"url":"http://www.youtube.com/embed/shTNJhjumhY?wmode=opaque","type":"VIDEO"}]},{"userId":205686259,"authorName":"Jennifer Wells","from":"Jennifer Wells &lt;juniper1270@...&gt;","profile":"juniper1270","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Afraid to grow up","postDate":"1499838334","msgId":78128,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0Njg2NDk2Ni4zNjMzODk1LjE0OTk4MzgzMzQ3NTRAbWFpbC55YWhvby5jb20+","referencesHeader":"PDg0Njg2NDk2Ni4zNjMzODk1LjE0OTk4MzgzMzQ3NTQucmVmQG1haWwueWFob28uY29tPg=="},"prevInTopic":78125,"nextInTopic":78130,"prevInTime":78127,"nextInTime":78129,"topicId":78120,"numMessagesInTopic":0,"msgSnippet":"My husband and children are Spanish, and in Spain it is common for children to live with parents until well into their 20s and generally, unless your family","messageBody":"<div id=\"ygrps-yiv-322303356\"><html><head><!--[if gte mso 9]><xml><o:OfficeDocumentSettings><o:AllowPNG/><o:PixelsPerInch>96</o:PixelsPerInch></o:OfficeDocumentSettings></xml><![endif]--></head><div style=\"color:#000;background-color:#fff;font-family:Helvetica Neue, Helvetica, Arial, Lucida Grande, sans-serif;font-size:13px;\"><div id=\"ygrps-yiv-322303356yui_3_16_0_ym19_1_1499806293932_16898\">My husband and children are Spanish, and in Spain it is common for children to live with parents until well into their 20s and generally, unless your family lives in a rural area, it is unheard of to leave home while studying at university. Furthermore, it most families continue to live in the same area (I know several who live on the same block or even the same apartment building) and see each other quite regularly. We have recently moved to the United States and the differences in the degree of contact and communication between families is one of the things that feels like a big area of culture shock. In fact, after thinking about this post a bit, it might explain why personally, I have been having some difficulty with my own mum; after 20 years in Spain, I think my understanding of how families work together has changed a lot, and perhaps are no longer culturally appropriate for the US.&nbsp;</div><div id=\"ygrps-yiv-322303356yui_3_16_0_ym19_1_1499806293932_16898\"><br></div><div id=\"ygrps-yiv-322303356yui_3_16_0_ym19_1_1499806293932_16898\" dir=\"ltr\">Out of curiosity, I searched for common ages children leave home and came across a study of 15 primarily European countries. It&#39;s interesting to note that even the earliest age is almost 20 years old, but the study also seems to confirm my personal experience in Spain, that in general, families who live together for more years remain closer and support each other in more ways throughout life. I don&#39;t know if it would help your daughter to know that there is a lot of variety in the world about when and how far children move from their family home and that there are positive benefits to those who stay home longer? Here is the link to a blog entry about the study:&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://blogs.psychcentral.com/single-at-heart/2012/06/leaving-home-in-15-countries-how-old-are-the-grown-children-when-they-leave-and-how-far-do-they-go/\" class=\"ygrps-yiv-322303356enhancr2_17c12ecf-2cf3-5081-aa45-788cd942e655\" id=\"ygrps-yiv-322303356yui_3_16_0_ym19_1_1499806293932_20585\">Leaving Home in 15 Countries: How Old Are the Grown Children When They Leave and How Far Do They Go?</a></div><div id=\"ygrps-yiv-322303356yui_3_16_0_ym19_1_1499806293932_20591\"><br></div><div id=\"ygrps-yiv-322303356yui_3_16_0_ym19_1_1499806293932_20591\">While I&#39;m writing, I just want to say thank you to everyone who writes regularly on this list. I can&#39;t really imagine what relationships in my family would be like if I hadn&#39;t been reading here over the last 6 years-- certainly less kind and loving! This group is one of the things I rely on to help me aim for and stay at my true north.</div><div id=\"ygrps-yiv-322303356yui_3_16_0_ym19_1_1499806293932_20591\"><br></div><div id=\"ygrps-yiv-322303356yui_3_16_0_ym19_1_1499806293932_20591\">Warmly,</div><div id=\"ygrps-yiv-322303356yui_3_16_0_ym19_1_1499806293932_20591\">Jenny</div></div></html></div>","specialLinks":[]},{"userId":459359078,"authorName":"D. Harper","from":"&quot;D. Harper&quot; &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Afraid to grow up","postDate":"1499752416","msgId":78125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFNkQwQTc5LTMxOEItNEY1OC04OUMyLTU1NDg1RURBOEZGREBiaWdwb25kLmNvbT4=","inReplyToHeader":"PENBRkxLeTMydlZvLUFZPUVkeWNpUW9HSlA1WjB5aFJucnY2QTU1VS03cFMtS1pCMkRlUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRkxLeTMydlZvLUFZPUVkeWNpUW9HSlA1WjB5aFJucnY2QTU1VS03cFMtS1pCMkRlUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":78120,"nextInTopic":78128,"prevInTime":78124,"nextInTime":78126,"topicId":78120,"numMessagesInTopic":0,"msgSnippet":"... Listen to and be open to her - take care to really hear where she’s at.  When you understand her better, you’re in a position to respond better. ","messageBody":"<div id=\"ygrps-yiv-618614212\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; My daughter, unschooled since age 6 and soon to be 15, told me that she googled &quot;I&#39;m afraid to grow up,&quot; hoping to find something comforting.  Everything she found on the subject referenced school, school friends or college. She said that none of it was helpful for her since she doesn&#39;t go to school and she doesn&#39;t want to go to college.   I searched sandradodd.com for the same topic and didn&#39;t come up with anything.  Are there writings on the website that I missed?  Can you suggest other versions of the wording that might produce something helpful?<br/>\n&gt; <br/>\n&gt; I assured her that she could live with me as long as she wishes.  I told her that the closer she gets to 18, the more she will hear about children wanting to leave home or being told they must leave home.    I feel that age 18 is an arbitrary age when it comes to leaving home and it&#39;s not necessary for her to have set plans for when she turns 18.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Listen to and be open to her - take care to really hear where she’s at.  When you understand her better, you’re in a position to respond better.  <br/>\nFeeling better understood will help her to feel more secure too.  But take care not to quiz her.  Be receptive.<br/>\n<br/>\nBe aware of options that might appeal to her, so she can know they’re there too.   <br/>\n<br/>\nOffer more now - feeling more fulfilled now, may help her feel less concerned about the future.<br/>\n<br/>\nThe more solid you are, will help her too.  You might find this page helps you:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being/\">http://sandradodd.com/being/</a><br/>\n<br/>\nDebbie  :)</div>","specialLinks":[]},{"userId":327852347,"authorName":"Tress Miles","from":"Tress Miles &lt;milesdt@...&gt;","profile":"abacaxi7476","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Afraid to grow up","postDate":"1499653663","msgId":78120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRkxLeTMydlZvLUFZPUVkeWNpUW9HSlA1WjB5aFJucnY2QTU1VS03cFMtS1pCMkRlUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":78125,"prevInTime":78119,"nextInTime":78121,"topicId":78120,"numMessagesInTopic":0,"msgSnippet":"My daughter, unschooled since age 6 and soon to be 15, told me that she googled I m afraid to grow up, hoping to find something comforting. Everything she","messageBody":"<div id=\"ygrps-yiv-998223894\"><div dir=\"ltr\">My daughter, unschooled since age 6 and soon to be 15, told me that she googled &quot;I&#39;m afraid to grow up,&quot; hoping to find something comforting.  Everything she found on the subject referenced school, school friends or college. She said that none of it was helpful for her since she doesn&#39;t go to school and she doesn&#39;t want to go to college.   I searched <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com\">sandradodd.com</a> for the same topic and didn&#39;t come up with anything.  Are there writings on the website that I missed?  Can you suggest other versions of the wording that might produce something helpful?<div><br></div><div>I assured her that she could live with me as long as she wishes.  I told her that the closer she gets to 18, the more she will hear about children wanting to leave home or being told they must leave home.    I feel that age 18 is an arbitrary age when it comes to leaving home and it&#39;s not necessary for her to have set plans for when she turns 18.</div><div><br></div><div>Tress</div></div></div>","specialLinks":[]}],"prevTopicId":4958,"nextTopicId":78149}}