{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"2003 conference tapes","postDate":"1076142763","msgId":90432,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2LjJjNjYyZTIuMmQ1NWZjYWJAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":90431,"nextInTime":90433,"topicId":90432,"numMessagesInTopic":0,"msgSnippet":"2003 Live & Learn Unschooling Conference tapes are in and available! http://www.schoolsoutsupport.org/resources.html 2003 Conference Program (contains all","messageBody":"<div id=\"ygrps-yiv-984045488\">2003 Live & Learn Unschooling Conference tapes are in and available!<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.schoolsoutsupport.org/resources.html\">http://www.schoolsoutsupport.org/resources.html</a><br/>\n<br/>\n2003 Conference Program (contains all speakers notes) $4<br/>\n2003 Conference Cassette Tapes Available $7<br/>\nSandra Dodd&#39;s tapes will be available soon. If you would like to order them <br/>\nwe will put them on backorder and ship them as soon as they come in<br/>\nHard Thinking Made Easy - Sandra Dodd (Backorder)<br/>\nSometimes people fear to think. Have you had many unauthorized thoughts? <br/>\nWould you like to have many more? Think where no thoughts have gone before. <br/>\nChanging the World- Sandra Dodd (Backorder)<br/>\nNow what? Look where you are and look what you&#39;re doing! Changing the world. <br/>\nEyewitness to Unschooling - Sandra Dodd and Pam Sorooshian<br/>\nIt can seem that your own family&#39;s unschooling might be a lucky fluke, until <br/>\nyou see it working in another family. Pam and Sandra have known each other <br/>\n(and kids and husbands) since 1996. Each will tell tales of the other&#39;s kids at <br/>\nvarious stages and ages from five to eighteen years old, having seen them in <br/>\nmany different places and situations over the years. <br/>\nThe Journey of a Lifetime - Mary Gold<br/>\nUnschooling is as much about us as it is about our children. In choosing the <br/>\nunschooling path we have the opportunity to join in our children&#39;s journey of <br/>\ndiscovery; and in doing so, to let go of our preconceived notions of learning. <br/>\nJoin Mary as she shares the experience of her family&#39;s trek from schooling to <br/>\nunschooling and discusses how they learned to embrace this journey of a <br/>\nlifetime.<br/>\nMaking Connections - Anne Ohman<br/>\nMaking conscious connections is vital in our unschooling lives, for our <br/>\nchildren and for ourselves. Join Anne as she discusses the importance of making <br/>\nconnections with the world around us, with each other in our relationships, and <br/>\nwith our true Selves. She&#39;ll explore the many ways our children learn through <br/>\nmaking connections, and offer practical suggestions for facilitating their <br/>\nunschooling.<br/>\nJoy of Math - Pam Sorooshian <br/>\nRelax! It is human nature to observe, organize, categorize, sort, compare, <br/>\ncontrast, combine, separate, and otherwise play around with math. Learning is <br/>\nintrinsically joyful and learning math is no exception. You don&#39;t need to <br/>\n&quot;unschool everything but math!&quot; Even if you, yourself, suffer from math anxiety, you <br/>\ncan avoid passing that on to your kids and you can have a good time <br/>\nsupporting them as they gain competency and confidence in mathematics. What do they <br/>\nneed to learn? How will they learn it? What about algebra? Get your questions <br/>\nanswered and be inspired!<br/>\nRules vs Principles - Ben Lovejoy<br/>\nBen Lovejoy explores the definition differences between &quot;rules&quot; and <br/>\n&quot;principles&quot; and bridges that to a discussion of family rules vs. family principles. He <br/>\nwill list some family rules and facilitate an exercise to turn these rules <br/>\ninto principles. Finally, he will state his family&#39;s own guiding <br/>\nprinciples.<br/>\nUnschooling the Highly Sensitive / Out of Sync Child - Anne Ohman and Mary <br/>\nGold<br/>\nJoin Anne and Mary as they discuss the traits of highly sensitive / out of <br/>\nsync children and the blessings they bring into the world, as well as the <br/>\nchallenges that accompany them. They&#39;ll talk about their journey with their own <br/>\nchildren and how unschooling has freed their spirit, minimized the challenges, and <br/>\nallowed their true Selves to shine.<br/>\nUnschooling to Harvard - Maureen Carey <br/>\nMaureen Carey will share the experience of the final phase of sixteen years <br/>\nof unschooling, supporting her daughter Aidin through the process of applying <br/>\nto college. And how they survived the only crisis of confidence in all those <br/>\nyears, waiting for &quot;the big envelope or the small envelope,&quot; that indicates <br/>\nadmission or rejection. She will explain what the Harvard Dean of Admissions told <br/>\nher was the reason Aidin was admitted and given a scholarship that will pay <br/>\nfor all of her tuition and fees.<br/>\n2002 Conference Program (contains all speakers notes) $4<br/>\n2002 Conference Cassette Tapes Available $6 <br/>\nLearning, Yes. Schooling, No Thank You - Luz Shosie and Ned Vare <br/>\nWe&#39;ll talk about how we unlearned years of schooling and trusted our son to <br/>\ndirect his own education. And we&#39;ll answer your questions about how unschooling <br/>\nreally works.<br/>\nMy Parents Trusted me - Fiona Hutchison<br/>\nMy parents trusted me to live on my own in New York City as young as 13 years <br/>\nold. My &quot;schooling&quot; was extremely limited and relatively ignored (my father <br/>\nused to say, &quot;F is for fantastic, my dear!&quot;), but my &quot;education&quot; was rich and <br/>\ncolorful and intense. I will give a brief account of my unschooling life and <br/>\nthen be happy to answer any questions you may have about a teen on her own. I <br/>\ncertainly don&#39;t have all the answers to how unschooling works, but I can tell <br/>\nyou what worked for me when I was given the freedom to pursue my dreams<br/>\n<br/>\nUnschooling as Mindful Living - Anne Ohman<br/>\nAs an educational choice, unschooling has infinite benefits. Yet unschooling <br/>\ncan also bring so much more into our family&#39;s lives when we allow it to be <br/>\nused on a greater scale - as a path to more mindful living. Come explore Mindful <br/>\nUnschooling with Anne Ohman, and we&#39;ll discuss how to not only free and <br/>\nempower your children through unschooling, but also bless your own life in rewarding <br/>\nand enlightening ways. <br/>\n<br/>\nUnschooling Changes - Lisa Bugg<br/>\nThe old adage, &quot;nothing remains constant but change&quot;, should be the maxim for <br/>\nall unschoolers. Unschooling demands that we challenge our long held beliefs <br/>\nabout children and education. The changes we move through, while welcome, are <br/>\nat times very stressful. And then, just when we think we have our educational <br/>\nphilosophy pinned down, the children change! Many adolescents have sent their <br/>\nunschooling parents scurrying for support when they come in and demand A PLAN. <br/>\nYour budding 8 year old, who still wants to be a firefighter, turns around; <br/>\nand you discover a 17 year old who wants to work in the matter-antimatter lab <br/>\nover at NASA. Let&#39;s talk about how unschooling changes us, as we move through <br/>\nour ever-changing lives.<br/>\nOut of Sync Child - Lisa Bugg and Anne Ohman&#39;s <br/>\nIn this open discussion/funshop, we&#39;re going to talk about how unschooling is <br/>\nso perfect for your *out of sync* child. Together, we&#39;ll share our <br/>\nexperiences with our children, and we&#39;ll do our best to answer each other&#39;s questions, <br/>\ntoo. <br/>\nWhy You Can&#39;t Let Go - Joyce Fetteroll<br/>\nDo you secretly lust after the perfect math program? Do you dog ear all the <br/>\npages in homeschooling catalogs and end up feeling guilty for not doing enough? <br/>\nDo you sometimes envy the school at homers because they have it all planned <br/>\nout for them? Let&#39;s talk about why packaged learning is so appealing and <br/>\nexplore some ways that may help you let go. <br/>\nReluctant Husbands/Reluctant Fathers - Ben Lovejoy<br/>\nBen Lovejoy, recently an unschooling father and husband, facilitates a <br/>\nroundtable discussion about the unique opportunities and challenges which face <br/>\nfathers and husbands in an unschooling home. Topics intended for discussion <br/>\ninclude: 1) Why unschooling?, 2) &quot;You&#39;re doing WHAT?&quot; and numerous other questions <br/>\nfrom family and friends, 3) What about sports, college, and other &quot;organized&quot; <br/>\nrites of passage into adulthood? 4) What do I have to offer when their mom does <br/>\nall the fun things with the kids? and 5) Whose life is it anyway? This <br/>\ndiscussion isn&#39;t just for fathers, husbands, or males; nor is it intended to anwer <br/>\nall of our questions. It&#39;s merely a discussion to help us all along our <br/>\nunschooling journey.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":90429,"nextTopicId":90329}}