{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Learning, and value (second part)","postDate":"1444911183","msgId":76232,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMEZGRUU5LTU3NzYtNEU5RC1BRTc0LTgzMDc1NzM1NUUzREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG12bm9rYStqNWtxN3FAWWFob29Hcm91cHMuY29tPg==","referencesHeader":"PDE0NDQ4Nzc2MTUuODE2NTA0MDM5QGYyMy5teS5jb20+IDxtdm5va2ErajVrcTdxQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":76231,"nextInTopic":0,"prevInTime":76231,"nextInTime":76233,"topicId":76222,"numMessagesInTopic":0,"msgSnippet":"-=-So this is something evolving for us as well as we try very hard not to be judgemental in all sorts of ways. We used to value my daughters horse riding over","messageBody":"<div id=\"ygrps-yiv-960320389\">-=-So this is something evolving for us as well as we try very hard not to be judgemental in all sorts of ways. We used to value my daughters horse riding over my son&#39;s computer gaming because the former was learning a skill, and it was exercise, and it got her out and socialising. Gaming seemed a lot less valuable. Then we went to this gaming expo last weekend and it was clear a huge number of people make a living from the gaming culture in all sorts of ways.-=-<br/>\n<br/>\nWhile it’s great that you went to a gaming expo and will have lots of new images, thoughts, and angles, don’t look at those people and their income instead of looking at your son and his joy and the skills and ideas he’s gathering and processing.  There will be connections made to what he is doing and learning now for the rest of his life.<br/>\n<br/>\n<br/>\n-=-We used to value my daughters horse riding over my son&#39;s computer gaming-=-<br/>\n<br/>\nMore people have computers than horses.  Horseback riding is not the future.  It’s already historical. :-)  Where is it real and necessary, in the 21st century?  <br/>\n<br/>\nEven if kids are “just” using computers for gaming, they learn lots about the computers, they become fast with keyboards and other forms of communication with computers (tablets, phones, game controllers).  <br/>\n<br/>\nKirby is no longer working for Blizzard Entertainment.  He left that very good job to move his new family to New Mexico.  His girlfriend and her six year old daughter were more important to him than job security in a cool industry.  <br/>\n<br/>\nHe’s working a computer help-desk contract for a major corporation. He helps people with their computers, by phone and e-mail.  He’s never studied any hardware or software, but he has learned.  And because of his own particular intelligences (one of which is that nature intelligence I mentioned in another post this morning), and his natural ability to read and understand the rules of games (from years of doing that, and working in a store that sold collectible card games, board games, table games, and taught games, and ran tournaments), he read users guides like a lawyer reads contracts.  Gradually, over years of using computers, he can now build them, replace elements, expand, discuss.  And he’s now working explaining things to others who don’t have those abilities.   He’s worked in the current job since May, and last week was offered a promotion.   BUT….. But…. <br/>\n<br/>\nIf Kirby had never made any money related to gaming, the gaming would still have made his life better.<br/>\nIf Kirby had never made any money related to computers, his own life would still be better because of what he has learned and can do.<br/>\n<br/>\nSo though it’s hard and unnatural, try to see value in what does NOT make money.  Quality of life.  Improvement of thought and awareness.  Factoids and skills that will connect to other things for life, creating a fuller, richer access to other ideas and information.<br/>\n<br/>\nMore about that model building:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/addlightandstir\">http://sandradodd.com/addlightandstir</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Learning, and value (first part)","postDate":"1444910387","msgId":76231,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0RjU1NTU3LUFDOTItNDYwRi1CRENELTg1QzNBRkMwNTQwNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE0NDQ4Nzc2MTUuODE2NTA0MDM5QGYyMy5teS5jb20+","referencesHeader":"PDE0NDQ4Nzc2MTUuODE2NTA0MDM5QGYyMy5teS5jb20+"},"prevInTopic":76230,"nextInTopic":76232,"prevInTime":76230,"nextInTime":76232,"topicId":76222,"numMessagesInTopic":0,"msgSnippet":"Quoting, first: _______________ I have the same concern, Sabine. We also had a policy of paying for anything educational but realised its difficult if not","messageBody":"<div id=\"ygrps-yiv-1896596044\">Quoting, first:<br/>\n_______________<br/>\n<br/>\nI have the same concern, Sabine. We also had a policy of paying for anything educational but realised its difficult if not impossible to accurately determine what is educational. My kids have both learned to read fluently, and both left school long before they could (early in grades 2 and 3). How did they learn to read so well then? We don&#39;t know and that&#39;s the point I guess. Reading is a skill the educated have, and &quot;something&quot; educated them in the skill of reading but its difficult to say what. Probably computer activity and gaming but who knows? And we definitely did not consider most computer games as educational when we started out.<br/>\n<br/>\nSo this is something evolving for us as well as we try very hard not to be judgemental in all sorts of ways. We used to value my daughters horse riding over my son&#39;s computer gaming because the former was learning a skill, and it was exercise, and it got her out and socialising. Gaming seemed a lot less valuable. Then we went to this gaming expo last weekend and it was clear a huge number of people make a living from the gaming culture in all sorts of ways.<br/>\n___________________<br/>\n<br/>\nIt is normal and natural for parents, especially dads, to loook for what can help a future adult earn a living.  I’ve done it.  I’ve bragged that Kirby had a good job at Blizzard because we gave him the time and support to be in and around gaming his whole life.   All of our kids have made money in ways that could retrospectively be tied in with childhood interests and hobbies.  So have most other people, whether they went to school or not, if you look back and see the paths and connect the dots.<br/>\n<br/>\nBut hobbies have value even without moneymaking.  <br/>\n<br/>\nI’m going to step to the side and address this jarring commentary:<br/>\n<br/>\n-=-My kids have both learned to read fluently, and both left school long before they could (early in grades 2 and 3). How did they learn to read so well then? We don&#39;t know and that&#39;s the point I guess. Reading is a skill the educated have, and &quot;something&quot; educated them in the skill of reading but its difficult to say what.-=-<br/>\n<br/>\nLearned to read it good!  Twice, “learn” was used.<br/>\n<br/>\nThen a terrible turn:  -=-a skill the educated have, and &quot;something&quot; educated them in the skill of reading-=-<br/>\nWrong way, wrong way!!!!<br/>\n<br/>\nNothing “educated” them.  Reading is a skill that can be picked up in a print-rich environment, without instruction, without “education.”  <br/>\nMANY formally educated people do NOT have reading skills.  They can find answers in a text and they can write well enough to pass tests in school to get certificates and diplomas, but reading in life-changing ways isn’t something they have ever once considered.   They might read for fun, or for profit, but there is a kind of reading that is useful in this discussion that many “educated” people have a very difficult time with.<br/>\n<br/>\nDon’t think of something teaching your children or educating your children.  They’re not passive, they’re not targets.  Go back to seeing how easily and effortlessly they can learn something as wonderful as reading.<br/>\n<br/>\nThis is too much to read all at once and to process, but maybe come back to these gradually over a couple of weeks.  It will make a difference to anyone who will read a little, try a little, wait a while and watch.<br/>\n<br/>\nHere, about teaching/learning:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teaching/\">http://sandradodd.com/teaching/</a><br/>\n<br/>\nAbout education:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/education\">http://sandradodd.com/education</a><br/>\n<br/>\nAnd about reading in a non-schoolish, in a natural and real and deep way:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/speed\">http://sandradodd.com/r/speed</a><br/>\n<br/>\nI’ll take another tangent in another message.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] &quot;Educational Expenses&quot;","postDate":"1444909534","msgId":76230,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBFNjMyRTgzLUFFMTYtNEZCOC1BMkJCLThBRDA2MDFEQzRGREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG12bm9rYStqNWtxN3FAWWFob29Hcm91cHMuY29tPg==","referencesHeader":"PDE0NDQ4Nzc2MTUuODE2NTA0MDM5QGYyMy5teS5jb20+IDxtdm5va2ErajVrcTdxQFlhaG9vR3JvdXBzLmNvbT4="},"prevInTopic":76227,"nextInTopic":76231,"prevInTime":76229,"nextInTime":76231,"topicId":76222,"numMessagesInTopic":0,"msgSnippet":"Sabine quoted me: _______________ Because unschooling turned out the way it did, though, most purchases seemed justified in educational terms. If they","messageBody":"<div id=\"ygrps-yiv-1078001582\">Sabine quoted me:<br/>\n_______________<br/>\n<br/>\n<br/>\n&quot;Because unschooling turned out the way it did, though, most purchases seemed justified &quot;in educational terms.&quot; If they wanted something they saw in a museum gift shop, it was either clothes (usually clothes AND education in such cases, like the t-shirt Marty has covered with daVinci notebook parts), or a game (math, logic, topic-of-game) or a kit or a toy that had something to do with optics or magnetism or balance or flight. Those were school supplies. They didn&#39;t have to spend their money on those.”<br/>\n______________<br/>\n<br/>\nShe replied, and then Richard did, too, but before that, I want to quote the paragraph that followed, in my writing:<br/>\n_________<br/>\n<br/>\n&quot;If they wanted something that would improve their quality of life, especially if it could be shared with others in the family, it was easy to justify helping them out on that with matching funds or an advance on allowance. We might just buy it for them outright, or for a birthday or Christmas.”    <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/money\">http://sandradodd.com/money</a><br/>\n________________<br/>\n<br/>\nBefore commenting on the responses, I want to point out that my intent in making the distinction was to remind parents (not these two, but anyone reading when I first wrote that, and anyone who might read it later) that unschooling is not, should not be considered by the parents, to be “free.”  Not even “cheap.” :-)   TOO OFTEN, parents think that because they didn’t need to buy an expensive curriculum, and that if kids learn from everything, that the parents don’t need to spend money on unschooling—that there are no unschooling expenses past paying the utility bills and buying groceries.<br/>\n<br/>\nYes, if a family can’t afford much, they CAN find ways to learn without spending money.  But if they have money, and are expecting children to provide for themselves out of their allowance, learning will not flow, and relationships will not soften.<br/>\n<br/>\nSabine wrote:<br/>\n<br/>\n+++++++++++++++++<br/>\n<br/>\nI do the same - &quot;educational&quot; items I will pay instead of him spending his allowance. But then I&#39;m sometimes wondering if that is problematic since it applies my validation of &quot;educational versus not educational&quot; on these items. Who is to say that the book from the museum store is more educationally valuable than the Hot Wheel fire truck which frankly looks to me pretty much the same as the other 10 we own.<br/>\n<br/>\nObviously in the case of the fire truck it is a pretty small amount of money and therefor not a real problem but I&#39;m sure there could be situations of greater financial impact. I&#39;m just wondering what labeling purchases as educational (or not) communicates to my son. <br/>\n<br/>\nI wonder if his wish to have more of his own money stems from the feeling of randomness of my decision (random from his perspective) to pay or not pay for something he would like to have. <br/>\n<br/>\n+++++++++++++++++<br/>\n<br/>\nIs it “random”?  Is it arbitrary?<br/>\nYou could say “I really like this firetruck” (or game, or t-shirt, or puzzle or book or video or…) – &quot;I think you’ll really enjoy it.”<br/>\nDon’t LABEL a purchase as educational.  Don’t communicate that to your child.  Just buy the thing sweetly, enthusiastically, and YOU take care of it and YOU play with it, with him, and be glad you bought it.  See its value, don’t label its value.<br/>\n<br/>\n-=-Who is to say that the book from the museum store is more educationally valuable than the Hot Wheel fire truck which frankly looks to me pretty much the same as the other 10 we own.-=-<br/>\n<br/>\nDon’t look at the book and the fire truck in isolation.  They only have value in relationship to your child’s habits and interests and loves and curiosities.  Will the book be used?  Is it something he spotted, or you did?  You could buy the book for yourself, for the house, for the family.  <br/>\n<br/>\nThis though, jumps out at me:  &quot;which frankly looks to me pretty much the same as the other 10 we own”<br/>\n<br/>\nIf he has several fire trucks and wants another one, don’t you think they look VERY different to him?  If they look the same to you, you’re probably missing a lot.<br/>\nCollections, collectors, seeing similarities and differences… don’t discount that in children.  In Howard Gardner’s intelligences, that’s nature intelligence.  It doesn’t need to be “nature” like leaves.  It is the nature of things, patterns, like/unlike.   It applies to heraldry, embroidery, archeology, Pokemon and My Little Ponies (which might all look alike at a distance, but have variations galore).<br/>\n<br/>\nFocus, Hobbies, Obsessions:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/focus\">http://sandradodd.com/focus</a><br/>\n<br/>\nRichard wrote:<br/>\n<br/>\n##########################<br/>\n<br/>\nWe also had a policy of paying for anything educational but realised its difficult if not impossible to accurately determine what is educational….<br/>\nSo this is something evolving for us as well as we try very hard not to be judgemental in all sorts of ways. …<br/>\n<br/>\n##########################<br/>\n<br/>\nInstead of “educational” (the idea itself is a problem), think of learning, newness, joy, connection (to what they know, to ideas, to others, to you/siblings/friends).<br/>\n<br/>\n-=-its difficult if not impossible to accurately determine what is educational-=-<br/>\n<br/>\nThat is another time-buying dodge.  Why “determine”?  Why does the determination need to be accurate?<br/>\nThat’s too much mental noise and avoidance of simple, gentle, generosity.<br/>\n<br/>\nYes, people’s ideas evolve and expand about what should be considered useful learning materials.  And because of that, the first changes in decisionmaking might be about what is more educational.  And as the parents are better at unschooling because they see their children blossoming and growing, they should, ideally, be willing to spend more money with less angst, on a wider range of things.<br/>\n<br/>\nDon’t let an allowance become a test or a hardship or a punishment. Let it feel like a joy and an opportunity to your children, not a burden.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":546509970,"authorName":"","from":"skyjeep@...","profile":"richardhowes10","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re[2]: [AlwaysLearning] Earning money","postDate":"1444899206","msgId":76227,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG12bm9rYStqNWtxN3FAWWFob29Hcm91cHMuY29tPg==","inReplyToHeader":"PDE0NDQ4Nzc2MTUuODE2NTA0MDM5QGYyMy5teS5jb20+","referencesHeader":"PDE0NDQ4Nzc2MTUuODE2NTA0MDM5QGYyMy5teS5jb20+"},"prevInTopic":76222,"nextInTopic":76230,"prevInTime":76226,"nextInTime":76228,"topicId":76222,"numMessagesInTopic":0,"msgSnippet":"... Thank you everyone for much food for thought ! ... I do the same - educational items I will pay instead of him spending his allowance. But then I m","messageBody":"<div id=\"ygrps-yiv-1041665954\"><div class=\"ygrps-yiv-1041665954ygroups-quoted\">---In AlwaysLearning@yahoogroups.com, &lt;mellingersa@...&gt; wrote :<br><br><div id=\"ygrps-yiv-1041665954ygrps-yiv-2094122416\"><div id=\"ygrps-yiv-1041665954ygrps-yiv-2094122416composeWebView_editable_content\" style=\"text-align:left;\">Thank you everyone for much food for thought !<div><br><div>...</div><div><br></div><div>I do the same - &quot;educational&quot; items I will pay instead of him spending his allowance. But then I&#39;m sometimes wondering if that is problematic since it applies my validation of &quot;educational versus not educational&quot; on these items. Who is to say that the book from the museum store is more educationally valuable than the Hot Wheel fire truck which frankly looks to me pretty much the same as the other 10 we own.</div><div>Obviously in the case of the fire truck it is a pretty small amount of money and therefor not a real problem but I&#39;m sure there could be situations of greater financial impact. I&#39;m just wondering what labeling purchases as educational (or not) communicates to my son.&nbsp;</div><div>I wonder if his wish to have more of his own money stems from the feeling of randomness of my decision (random from his perspective) to pay or not pay for something he would like to have. ---</div><div><br></div><div>I have the same concern, Sabine. We also had a policy of paying for anything educational&nbsp;but realised its difficult if not impossible to accurately determine what is educational. My kids have both learned to read fluently, and both left school long before they could (early in grades 2 and 3). How did they learn to read so well then? We don&#39;t know and that&#39;s the point I guess. Reading is a skill the educated have, and &quot;something&quot; educated them in the skill of reading but its difficult to say what. Probably computer activity and gaming but who knows? And we definitely did not consider most computer games as educational when we started out.<br></div><div><br></div><div>So this is something evolving for us as well as we try very hard not to be judgemental in all sorts of ways. We used to value my daughters horse riding over my son&#39;s computer gaming because the former was learning a skill, and it was exercise, and it got her out and socialising. Gaming seemed a lot less valuable. Then we went to this gaming expo last weekend and it was clear a huge number of people make a living from the gaming culture in all sorts of ways.</div><div><br></div><div>Interesting conversation!&nbsp;</div><div><div><div id=\"ygrps-yiv-1041665954ygrps-yiv-2094122416composeWebView_previouse_content\"><blockquote><span title=\"qreply\"> <blockquote><span class=\"ygrps-yiv-1041665954\"><blockquote style=\"border-left:1px solid #fc2c38;margin:10px 10px 10px 5px;padding:0 0 0 10px;\"><div><div><div><div><div><div style=\"color:#fff;height:0;\"></div></div></div></div></div></div></blockquote></span></blockquote></span></blockquote></div></div></div></div></div></div></div></div>","specialLinks":[]},{"userId":430722916,"authorName":"","from":"mellingersa@...","profile":"mellingersa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re[2]: [AlwaysLearning] Earning money","postDate":"1444877615","msgId":76222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NDQ4Nzc2MTUuODE2NTA0MDM5QGYyMy5teS5jb20+"},"prevInTopic":0,"nextInTopic":76227,"prevInTime":76221,"nextInTime":76223,"topicId":76222,"numMessagesInTopic":0,"msgSnippet":"Thank you everyone for much food for thought ! I read through the links and realized I had read most of them already a long time ago but at that time my son","messageBody":"<div id=\"ygrps-yiv-2099192076\"><html><div id=\"ygrps-yiv-2099192076composeWebView_editable_content\" style=\"text-align:left;\">Thank you everyone for much food for thought !<div><br><div>I read through the links and realized I had read most of them already a long time ago but at that time my son was so young that most of it didn&#39;t really apply .... case in point - one learns and remembers best when the learnt applies to their current life :))</div><div><br></div><div>While reading, one paragraph stood out to me:</div><div><br></div><div><span style=\"\">&quot;Because unschooling turned out the way it did, though, most purchases seemed justified &quot;in educational terms.&quot; If they wanted something they saw in a museum gift shop, it was either clothes (usually clothes AND education in such cases, like the t-shirt Marty has covered with daVinci notebook parts), or a game (math, logic, topic-of-game) or a kit or a toy that had something to do with optics or magnetism or balance or flight. Those were school supplies. They didn&#39;t have to spend their money on those.&quot;</span></div><div><br></div><div>I do the same - &quot;educational&quot; items I will pay instead of him spending his allowance. But then I&#39;m sometimes wondering if that is problematic since it applies my validation of &quot;educational versus not educational&quot; on these items. Who is to say that the book from the museum store is more educationally valuable than the Hot Wheel fire truck which frankly looks to me pretty much the same as the other 10 we own.</div><div>Obviously in the case of the fire truck it is a pretty small amount of money and therefor not a real problem but I&#39;m sure there could be situations of greater financial impact. I&#39;m just wondering what labeling purchases as educational (or not) communicates to my son.&nbsp;</div><div>I wonder if his wish to have more of his own money stems from the feeling of randomness of my decision (random from his perspective) to pay or not pay for something he would like to have.&nbsp;</div><div><br></div><div>Sabine</div><div><br></div><div><div><br>Sent from myMail for iOS<br><br><br><div id=\"ygrps-yiv-2099192076composeWebView_previouse_content\"><blockquote><span title=\"qreply\"> <blockquote style=\"border-left:1px solid #fc2c38;margin:10px 10px 10px 5px;padding:0 0 0 10px;\"><div><div><div><div><div><div><p>\n<br>\n</p>\n\n    </div>\n     \n\n    \n    <div style=\"color:#fff;height:0;\"></div>\n\n\n\n\n\n\n  \n\n\n\n\n\n\n</div>\n\t\t\t\n\t\t\n\t\t\n\t</div>\n\n\t\n</div></div></div></blockquote></span></blockquote></div></div></div></div></div></html> \n</div>","specialLinks":[]}],"prevTopicId":76205,"nextTopicId":76212}}