{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Speech Therapy, Apraxia and the Unschooled Child","postDate":"1464138179","msgId":77105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxOERBOTM2LTlCM0QtNDc3NC04MEFCLTYxRTgzNkZFNUZDRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDg2OTg2OTYxOS45MzE0Ni4xNDY0MTMwOTM0NjI2LkphdmFNYWlsLnlhaG9vQG1haWwueWFob28uY29tPg==","referencesHeader":"PDg2OTg2OTYxOS45MzE0Ni4xNDY0MTMwOTM0NjI2LkphdmFNYWlsLnlhaG9vLnJlZkBtYWlsLnlhaG9vLmNvbT4gPDg2OTg2OTYxOS45MzE0Ni4xNDY0MTMwOTM0NjI2LkphdmFNYWlsLnlhaG9vQG1haWwueWFob28uY29tPg=="},"prevInTopic":77103,"nextInTopic":0,"prevInTime":77104,"nextInTime":77106,"topicId":77088,"numMessagesInTopic":0,"msgSnippet":"There is an unschooling mom who does speech therapy by skype.  She helped with a girl Holly used to take care of 40 hours a week—I was in on a conversation","messageBody":"<div id=\"ygrps-yiv-277559435\">There is an unschooling mom who does speech therapy by skype.  She helped with a girl Holly used to take care of 40 hours a week—I was in on a conversation where she diagnosed from clues and gave Holly some really great ideas to use, in easly playful ways.<br/>\n<br/>\nHolly wanted speech therapy when she was 7 or 8 (I think),  and we knew three speech therapists.  I didn’t want her to go into formal therapy, because I didn’t think she needed it and sure enough, a couple of them gave her solid, practical ideas and suggestions, and within a few months she was better.  She still remembers practicing “Roger Rabbit’s buried treasure.”  (“R” was her problem then—she wasn’t hearing them, and she wasn’t reading yet so she couldn’t see them.)<br/>\n<br/>\nHere are my notes from <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/issues/therapy\">http://sandradodd.com/issues/therapy</a><br/>\n<br/>\nPushpa Ramachandran<br/>\nPushpa Ramachandran does speech therapy by Skype, part time. She is an unschooling mother and a respected speech pathologist.  e-mail Pushpa or see her site (with a great deal of info!) here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.onlinespeechtherapyhelp.com\">http://www.onlinespeechtherapyhelp.com</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":50712510,"authorName":"Michelle Marr","from":"Michelle Marr &lt;michelle_m29@...&gt;","profile":"michelle_m29","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Speech Therapy, Apraxia and the Unschooled Child","postDate":"1464130934","msgId":77103,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg2OTg2OTYxOS45MzE0Ni4xNDY0MTMwOTM0NjI2LkphdmFNYWlsLnlhaG9vQG1haWwueWFob28uY29tPg==","referencesHeader":"PDg2OTg2OTYxOS45MzE0Ni4xNDY0MTMwOTM0NjI2LkphdmFNYWlsLnlhaG9vLnJlZkBtYWlsLnlhaG9vLmNvbT4="},"prevInTopic":77089,"nextInTopic":77105,"prevInTime":77102,"nextInTime":77104,"topicId":77088,"numMessagesInTopic":0,"msgSnippet":"My son Quinn, now 11 years old, has/had severe apraxia of speech and is on his seventh speech therapist. Based on my speech therapy experiences as a child","messageBody":"<div id=\"ygrps-yiv-709502671\">My son Quinn, now 11 years old, has/had severe apraxia of speech and is on his seventh speech therapist. <br/>\n<br/>\nBased on my speech therapy experiences as a child myself (years of therapy for a minor lisp my parents had never even noticed until the school brought it to their attention and that never improved -- each of my son&#39;s new therapists re-diagnoses me at the first appointment) and with Quinn over the past seven or eight years, I wouldn&#39;t do speech therapy without a very compelling reason.  Apraxia, unfortunately, was a reason. When he first started (at 3 or 4), he could only pronounce vowel sounds. I think one of the documents rated his intelligibility at under five percent. I may have the wrong terms, but it was bad. When the first therapist evaluated him, she gave up and just wrote down the four or five sounds he could make properly. <br/>\n<br/>\nQuinn&#39;s speech therapy has not been as unschoolish as I would have liked. His father was very fearful that Quinn would never be able to make himself understood and that it would cause problems for him as an adult (I know he&#39;s worked with guys who have been teased about their speech impediments.)  We wound up compromising and using a private facility instead of the free services offered through the public schools. If I was the one calling all of the shots, I&#39;d do things differently, but an hour a week of speech therapy is a lot less harmful in my mind than years of full time public school. <br/>\n<br/>\nI had that &quot;what motivates him?&quot; conversation way too many times. The ideas they had for motivating Quinn were way off base (playing a video game isn&#39;t a big reward if you&#39;ve got unlimited game time at home) so I told them that I&#39;d take care of the rewards after class. What that really means is that the kids and I will go do something fun that has almost no relationship to how hard he&#39;s worked in his appointment. It&#39;s our reward for surviving that one hour a week. <br/>\n<br/>\nI also had problems with some of the activities like &quot;make the sound ten times and then color in a section of the picture.&quot; He was making the sounds and coloring the picture....but he was making every piece green and the speech therapist decided to force him to use lifelike colors.  It&#39;s been an ongoing struggle to keep his speech therapy limited to the actual speech part and not get side-tracked by a therapist&#39;s pet peeves. We&#39;re there for the speech therapy. Nothing else. I&#39;ll listen to other concerns, and consider them, but we&#39;re there for the speech. And hopefully soon won&#39;t be there at all. I&#39;m looking forward to that. <br/>\n<br/>\nOne thing  that no none of the professionals ever told me is that children with apraxia are prone to tantrums. That would have been hugely helpful to know when my son was having one in the middle of their office floor. <br/>\n<br/>\nWe almost never sat down and did the homework. I&#39;d make the sound of the week a few times during the day. Sometimes he&#39;d repeat it and sometimes he wouldn&#39;t. The next week, we&#39;d tell them we&#39;d practiced. <br/>\n<br/>\nThese days, Quinn  pronounces almost everything properly. He&#39;ll substitute a &quot;d&quot; for a &quot;t&quot; or &quot;v&quot; for &quot;th&quot;, but it&#39;s rare. Based on where he was when we started out, I don&#39;t think he could have done that on his own. There were some tricks they used to help him get his lips and teeth and tongue into the right position to make a sound. For that, we needed the speech therapist. For a lot of the rest, we could have done it on our own. <br/>\n<br/>\nIf I was calling the shots and not cooperating with my husband, I&#39;d have had an appointment every month or so to check up on Quinn&#39;s progress and then helped him at home as much as I could without it being an unwanted chore for him. For the first few years of therapy, most if it was sucking thick stuff through straws and blowing balloons and feathers. We didn&#39;t need a trained professional for that part. Or, I think, for most of the other parts. I needed someone to show me how to make the sounds and what the difference between right and wrong looked like. <br/>\n<br/>\nMichelle</div>","specialLinks":[]},{"userId":298084477,"authorName":"","from":"salsflying@...","profile":"salsflying","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Speech Therapy, Apraxia and the Unschooled Child","postDate":"1464119638","msgId":77089,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG5pMmJnbSsxdWUxcW9pQFlhaG9vR3JvdXBzLmNvbT4=","inReplyToHeader":"PENBQk5SZUZzdVFGTXkydGkwcnpPM0tLRmVBRG9LTkdXcnNVZ05BWWJpUjlFSjk3bURWZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBQk5SZUZzdVFGTXkydGkwcnpPM0tLRmVBRG9LTkdXcnNVZ05BWWJpUjlFSjk3bURWZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":77088,"nextInTopic":77103,"prevInTime":77088,"nextInTime":77090,"topicId":77088,"numMessagesInTopic":0,"msgSnippet":"My (now almost 20yo) dd began speech therapy at 26mo as we thought she d never speak well if we didn t intervene (having heard for many years early","messageBody":"<div id=\"ygrps-yiv-1824424700\">My (now almost 20yo) dd began speech therapy at 26mo as we thought she&#39;d never speak well if we didn&#39;t intervene (having heard for many years &quot;early intervention is best, the earlier the better!&quot;). She was diagnosed with apraxia, dysgraphia, dyslexia, ADHD, etc. and I followed along with them just like a sheep trying to &quot;get enough therapy to make her normal&quot;, HA!<br/>\nWe began homeschooling & clearly she was a &quot;different learner&quot; and would need something very different to succeed. I didn&#39;t agree with the unschooling method bc I thought it was for lazy parents, but once I discovered how wrong I was jumped in headlong. Never looked back either. <br/>\nHer interests led us in many different directions over the years. She&#39;s an impressive gluten free baker, an educational tutor for learning challenged kids like she was, a student at our local college (gasp!), pursuing a degree in neuropsychology to understand more about the brain, and she speaks clearly!<br/>\nI an honestly not sure how much the various therapies we went through helped her, but we know we spent close to $100k out of pocket and at different times at least 15 hours per week including travel to receive the therapies. In retrospect I would have made different choices with our money/time since I have perfect vision now. <br/>\nI have a 13yo son who has almost all of her same diagnoses but he is completely unschooled and thriving chasing after his own education, and schedules his day on his own. He&#39;s currently in a light saber &quot;fight&quot; with his two younger brothers and little sister in the living room and the laughter is almost unbearably boisterous for writing/concentrating. <br/>\nMy encouragement to you is to follow your heart- it&#39;s speaking to you since you&#39;re asking questions...<br/>\nSal!</div>","specialLinks":[]},{"userId":564662503,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;sj.rocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Speech Therapy, Apraxia and the Unschooled Child","postDate":"1464109693","msgId":77088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBQk5SZUZzdVFGTXkydGkwcnpPM0tLRmVBRG9LTkdXcnNVZ05BWWJpUjlFSjk3bURWZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":77089,"prevInTime":77087,"nextInTime":77089,"topicId":77088,"numMessagesInTopic":0,"msgSnippet":"Hello, Its been quite a while since I wrote to this group, but I read occasionally these days.  We ve been unschooling for many years now.  We have a 10 year ","messageBody":"<div id=\"ygrps-yiv-1721184303\"><div dir=\"ltr\">Hello,<div><br></div><div>Its been quite a while since I wrote to this group, but I read occasionally these days.  We&#39;ve been unschooling for many years now.  We have a 10 year old, 7, 4 and 3 month old.  Our 4 year old has severe apraxia of speech (his mind has trouble directing his mouth to form the sounds - similar to after a patient who can&#39;t speak after a stroke).   He&#39;s been seeing speech therapists for about 2 years, and mostly its just been fun play time. </div><div><br></div><div>Until now, he&#39;s been internally motivated, and so there hasn&#39;t been any issue. As an unschooled kid, he has no reference for the model of &#39;we&#39;ll reward you if you do this, punish you if you don&#39;t, and you can&#39;t choose not to do it at all.&#39;   In the past, he&#39;s really enjoyed getting the sticker at the end, and I think that&#39;s because he was internally motivated and having fun, and the sticker was just a cherry on top of it all.  Now his motivation has waned, and his therapist is at a loss, and I haven&#39;t been able to help her so far in getting him interested again.  His therapist comes from a school point-of-view, believing in incentives/motivators in a punitive sort of way.  For example, if you do the word repetitions (which are part of fun games) you can get a sticker, but if you don&#39;t, you won&#39;t get the sticker, although in the kindest way)    He just hasn&#39;t lived in that framework.  So she&#39;s doesn&#39;t get it when he just walks away and won&#39;t participate despite incentives galore.  She asks me, &#39;what motivates him?&#39; and I honestly don&#39;t have an answer, because I don&#39;t generally have to motivate my kids much, and its so occasional that it holds weight.  Using external motivators multiple times a week would decrease the value of the motivators, not to mention what I&#39;ve been reading about how external motivators actually decrease intrinsic motivation.</div><div><br></div><div>She&#39;s a great therapist and he likes her, and all his previous therapists.  I haven&#39;t been able to explain to her thus far how his mind works; how the way we&#39;ve raised him and his siblings has sort of made this methodology of carrot/stick not motivating. </div><div><br></div><div>** I guess, until now, the fun part has outweighed the inconvenience of repeating a word.  Now, the fun isn&#39;t worth the words anymore.   ** </div><div><br></div><div>The research says frequent short sessions of practice (speech therapist, and then homework in between) are what works for apraxia.  The general route to that seems to be a way that doesn&#39;t work for him.  <br></div><div><br></div><div>So... is there another way to follow that same route (frequent repetition with corrections) that will work with him?  </div><div><br></div><div>Or... would he be better off not following this route at all, and just jumping into our regular homeschool lifestyle surrounded by language and speech opportunities (where he will continue to form the sounds wrong, potentially reinforcing his current ways instead of learning and practicing new muscle coordinations)?</div><div><br></div><div>Or... am I not seeing things clearly?  </div><div><br></div><div>And... I would appreciate reading stories from anyone who&#39;s child had specifically apraxia/dyspraxia, who went through or didn&#39;t go through speech therapy, what their lives looked like, and how their speech improved or didn&#39;t over time.  Because, the treatment research is surely based on schooled kids, and I&#39;m also not sure if perhaps he would improve on his own, maybe later, by his own motivation, without all this therapy.   And then also, there is the whole school option that has been suggested by his pediatrician - that being among people who don&#39;t understand him would force him to speak more and improve faster - but my gut says this won&#39;t have the same affect for apraxia as it might for other speech delays. </div><div><br></div><div>Thanks for your time,</div><div><div><div class=\"ygrps-yiv-1721184303gmail_signature\"><div dir=\"ltr\"><div><div dir=\"ltr\"><div><div dir=\"ltr\"><div><div dir=\"ltr\"><div dir=\"ltr\"><div dir=\"ltr\"><div style=\"font-size:12.8000001907349px;\">Shira Rocklin</div><div style=\"font-size:12.8000001907349px;\">Hypnobabies Childbirth Hypnosis Instructor</div><div style=\"font-size:12.8000001907349px;\"><br></div><div style=\"font-size:12.8000001907349px;\"><a rel=\"nofollow\" target=\"_blank\" href=\"http://www.radiantbirth.ca/\" style=\"font-size:12.8000001907349px;\">www.RadiantBirth.ca</a><br></div><div style=\"font-size:12.8000001907349px;\"><span style=\"font-size:12.8000001907349px;\">Hypnobabies Classes in the GTA! </span><br></div><div style=\"font-size:12.8000001907349px;\">Like my Facebook page <a rel=\"nofollow\" target=\"_blank\" href=\"https://www.facebook.com/pages/Radiant-Birth-Hypnobabies/352684934933157\">Radiant Birth Hypnobabies</a>!</div><div style=\"font-size:12.8000001907349px;\">Follow me on Twitter <a rel=\"nofollow\" target=\"_blank\" href=\"https://twitter.com/BirthRadiant\">@BirthRadiant</a>!</div><div style=\"font-size:12.8000001907349px;\">Can&#39;t wait to take my class?  Try the <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.hypnobabies-store.com/link.cgi?affiliateID=242\">Home-Study Course</a>!</div></div></div></div></div></div></div></div></div></div></div></div>\n</div></div></div>","specialLinks":[]}],"prevTopicId":77094,"nextTopicId":77118}}