{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":41,"messages":[{"userId":339346350,"authorName":"yelenakaplan","from":"&quot;yelenakaplan&quot; &lt;kaplanyel@...&gt;","profile":"yelenakaplan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226463757","msgId":40159,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmZGxtZCtrdHU0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlCRDE3RURGLTkxQzgtNDVBNC1CNjA2LTEyOTVDQTg5MUI2QUBtYWMuY29tPg=="},"prevInTopic":40155,"nextInTopic":40162,"prevInTime":40158,"nextInTime":40160,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2132900593\">&lt;&lt; I&#39;m surprised that you still have other families who want to hang out<br/>\nwith her. Or at least you and her, together. I know my kids wouldn&#39;t<br/>\nwant to keep hanging out with another child who lashed out physically<br/>\nmore than a time or two.&gt;&gt;<br/>\n<br/>\nThey keep hanging out with us because the kids have fun together and I get along with <br/>\ntheir moms and because it doesn&#39;t happen more than a time or two with any particular <br/>\nfamily.  And it doesn&#39;t happen with most everyone we know.  Once I know what triggers it <br/>\nin a particular dynamic I can prevent it and/or not go over their house if it&#39;s an <br/>\nincompatibility issue.   What I haven&#39;t been able to do is predict the trigger in new <br/>\nsituations with new kids.  <br/>\n<br/>\n&lt;&lt;You seem to be aware of what leads up to her lashing out. Do you not  <br/>\nnotice the stress building up in time to intervene before the lashing out takes place? Are <br/>\nyou helping her recognize the signs, in advance,  so that she can have more self-<br/>\nawareness.&gt;&gt;<br/>\n<br/>\nMost of the time I am, but sometimes I don&#39;t know why she does it -- she can&#39;t tell me <br/>\nanything other than that her friend likes it.  She is embarrassed to talk about it, looks down <br/>\nand can&#39;t explain what makes her do it.  I haven&#39;t talked to her about being aware of the <br/>\nstress ahead of time and coming up with other alternatives to handling it -- I honestly <br/>\nhaven&#39;t even though that she might know that it&#39;s happening.  I viewed it as typical <br/>\nimpulsive toddler behavior and thought that she would grow out of it.  She&#39;s been hit and <br/>\nyelled at by other toddlers when I wasn&#39;t near her and that&#39;s when her lashing out started <br/>\n(not as a direct retaliation, but at a later date)  I haven&#39;t seen much evidence that we&#39;re <br/>\ngoing through something out of the ordinary and I suspect she thinks that&#39;s how things <br/>\nroll?   I hate it, I wish she never experienced it, it bothers me to no end that I haven&#39;t been <br/>\nable to stop it from happening again and that&#39;s why I posted it here.  How can I explain to <br/>\nher that other kids hit but that she shouldn&#39;t?<br/>\n<br/>\nI&#39;ve been operating under the wrong assumption that if a kid is angry, they need to get <br/>\nthat out -- don&#39;t hit your friend, hit a pillow instead (I think it&#39;s in How To Talk So Kids <br/>\nWill Listen).  I&#39;m happy to see that there are other alternatives, honestly I wouldn&#39;t have <br/>\ncome up with those on my own right now because the only thought that&#39;s running through <br/>\nmy head is &quot;why?&quot;  Why does she feel threatened enough to hit?  What did I do as her mom <br/>\nto make her feel that scared to be out in the world?  I thought I did good last night (yes, it <br/>\nwas the other kiddo&#39;s Dora I&#39;m sorry to say... we didn&#39;t bring any toys with us) but I guess <br/>\nI&#39;ve still got a lot to work on.  <br/>\n<br/>\n&lt;&lt; I&#39;m confused about why she&#39;s doing this only when you&#39;re present. Are  <br/>\n<blockquote><span title=\"ireply\"> &gt; you sure about that? Have you asked her why that is?&gt;&gt;<br/>\n<br/>\n </span></blockquote>I don&#39;t know why for sure.  Sometimes I think it&#39;s because she feels that I&#39;ll bring her out <br/>\nof harm&#39;s way if the other kid was to hit her.  I do know that she&#39;s been in a situations (3 <br/>\nor 4) where other kids literally ripped things out of her hands while I wasn&#39;t within <br/>\nintervention distance and she didn&#39;t do anything to retaliate, she just tries to reason with <br/>\nthem and then cries because they don&#39;t listen.  I also know that it takes her about a month <br/>\nafter being in a situation where she got hit/pushed/disrespected by a kid to come back to <br/>\nnormal, not &#39;on high alert&#39; self.  Would it make sense to keep her out of social situations <br/>\nafter such an encounter for a while? <br/>\n<br/>\n If I&#39;m out of sight (like in the next room or hallway) she&#39;ll do everything in her power to <br/>\nuse her words and tells the other kids that they can take turns, she&#39;s not done yet, they <br/>\ncan have something else, etc... She can play for an hour or more if I&#39;m just around the <br/>\ncorner and not in the room.  I notice that if I&#39;m hovering over her because I&#39;m afraid she&#39;ll <br/>\ndo something by accident and or on purpose, she does something on purpose almost for <br/>\nsure.  That&#39;s what happened last night -- I was afraid she&#39;d pull her friend&#39;s hair while <br/>\nbrushing it and I kept telling her to be careful.  I think she got mad at me and whacked her <br/>\nfriend.   I guess instead of hovering I should have taken her to another room -- she was <br/>\nvery tired and I should have known better.<br/>\n<br/>\nAnyhoo, off to cry myself to sleep on my huge pillah...<br/>\n<br/>\nWill do more soul searching/reading tomorrow.<br/>\n<br/>\nThank you :)<br/>\n<br/>\nYelena</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226453730","msgId":40155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY2NDkzQzcxLTQ1NkUtNDY2QS04RjUxLUIyMzM4MzYyQzM0OEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDlmNzJkNzYyMDgxMTExMTYxMWo3ODEzMTI1Mm05ZDkwMzkxZDVkOTM3ZGY5QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDk4QzAxNkZBLTNGNEItNDFDRC05NkFCLTE1ODg2QkMyRTgyRUBzYW5kcmFkb2RkLmNvbT4gPGdmY2J2aSszZGh2QGVHcm91cHMuY29tPiA8OWY3MmQ3NjIwODExMTExNjExajc4MTMxMjUybTlkOTAzOTFkNWQ5MzdkZjlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":40152,"nextInTopic":40159,"prevInTime":40154,"nextInTime":40156,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-I have not encouraged them to beat up dolls or toys. Honestly, I think it is very threatening. If an adult got really mad at me and starting hitting the","messageBody":"<div id=\"ygrps-yiv-52463184\">-=-I have not encouraged them to beat up dolls or toys. Honestly, I<br/>\nthink it is very threatening. If an adult got really mad at me and<br/>\nstarting hitting the wall, a toy, etc.-=-<br/>\n<br/>\nThat happened at a party my kids were at at another friend&#39;s house.   <br/>\nSomeone who was primarily my friend, 30ish, was at this party.  He  <br/>\nwas probably the oldest one there.  Many were mid-20&#39;s.  At some  <br/>\npoint he started to feel frustrated about having misunderstood a  <br/>\nsocial situation (wanting to protect Holly from something she didn&#39;t  <br/>\nneed to be protected from) and he started hitting the front door,  <br/>\nwith his fists, from the inside.  They had been playing a drinking  <br/>\ngame and he had &quot;won.&quot;  (Not a good plan, overall.)   So Marty called  <br/>\nme and asked me to go and pick him up, and I did.<br/>\n<br/>\nHitting the door was better than hitting a person, and better than  <br/>\nstumbling out into the dark and trying to walk somewhere.  But  <br/>\nhitting the door was not good.  It wasn&#39;t his door.  Doors are  <br/>\nimportant and shouldn&#39;t be broken.  And any male of any species  <br/>\nperforming repeated shows of strength is probably going to be  <br/>\nperceived as a danger or a threat.  (Not just male, I guess.)<br/>\n<br/>\n-=-We started talking about &quot;space&quot; before he was two and he was  <br/>\nusing it regularly by then. I figured that with two of them, conflict  <br/>\nwas going to happen and I wanted to make sure they had some tools to  <br/>\ndeal with things in a better way than hitting and screaming  <br/>\n(screaming, right?). &quot;Space&quot; worked very well for us. The other ones  <br/>\nare starting to help too.-=-<br/>\n<br/>\nOne of Kirby&#39;s irritating things, when he was young, wasn&#39;t hitting,  <br/>\nbut it was being more talkative and attention-getting than other  <br/>\nkids.  He could steal the spotlight without meaning to, and at  <br/>\nsomething like a birthday party that&#39;s *very* rude. The term I used  <br/>\nwith him was &quot;Don&#39;t breathe more than your share of the air.&quot;  And as  <br/>\nhe got older, sometimes I would ask him to make sure that the guest  <br/>\nof  honor, or someone there from out of town, or someone who had  <br/>\nrecently had a disappointment of some sort, would be comfortable and  <br/>\nget attention.  So he would use some of the attention-getting power  <br/>\nhe had and redirect it toward someone else.  It wasn&#39;t like he had  <br/>\nthe responsibility to make someone else happy, but it was a way for  <br/>\nhim to remember, when the irresistable urge came to say or do  <br/>\nsomething notable, that he wasn&#39;t the guest of honor.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211613982,"authorName":"Margaret","from":"Margaret &lt;margaretz@...&gt;","profile":"margaretzat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226448688","msgId":40152,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlmNzJkNzYyMDgxMTExMTYxMWo3ODEzMTI1Mm05ZDkwMzkxZDVkOTM3ZGY5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdmY2J2aSszZGh2QGVHcm91cHMuY29tPg==","referencesHeader":"PDk4QzAxNkZBLTNGNEItNDFDRC05NkFCLTE1ODg2QkMyRTgyRUBzYW5kcmFkb2RkLmNvbT4JIDxnZmNidmkrM2RodkBlR3JvdXBzLmNvbT4="},"prevInTopic":40146,"nextInTopic":40155,"prevInTime":40151,"nextInTime":40153,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"One thing I really try to do with my kids is help them with tools to deal with situations like that.    The ones we have talked about most are verbal (asking","messageBody":"<div id=\"ygrps-yiv-1369244756\">One thing I really try to do with my kids is help them with tools to<br/>\ndeal with situations like that.    The ones we have talked about most<br/>\nare verbal (asking for space and *me* keeping a sharp ear out for it -<br/>\nHUGE part of it) and breathing deeply.  Breathing deeply has mostly<br/>\nbeen from me talking about how I&#39;m frustrated and need to calm down<br/>\nand *me* doing it.  My daughter (5) has started using it too.  We&#39;ve<br/>\nalso started talking about drinking a glass of water to calm down -<br/>\nsomething that works well for me.  The idea came from my grandmother<br/>\nwho found it helpful with her children.  I also like to be by myself<br/>\nfor a couple minutes if I am frustrated.  I talk about it with them.<br/>\n<br/>\nI have not encouraged them to beat up dolls or toys.  Honestly, I<br/>\nthink it is very threatening.  If an adult got really mad at me and<br/>\nstarting hitting the wall, a toy, etc. I would find it frightening and<br/>\nthreatening.    Asking for space, saying no (nicely, if possible),<br/>\nbreathing... I think those are good peaceful tools.  Beating the crap<br/>\nout of a doll doesn&#39;t seem like a great tool, although it is better<br/>\nthan hitting the friend.  I think that focusing on different tools<br/>\nwould be even better.<br/>\n<br/>\nfwiw - my daughter is a little older, but my son is about your<br/>\ndaughter&#39;s age.  We started talking about &quot;space&quot; before he was two<br/>\nand he was using it regularly by then.  I figured that with two of<br/>\nthem,  conflict was going to happen and I wanted to make sure they had<br/>\nsome tools to deal with things in a better way than hitting and<br/>\nscraming.  &quot;Space&quot; worked very well for us.   The other ones are<br/>\nstarting to help too.<br/>\n<br/>\nMargaret<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, Nov 11, 2008 at 8:30 AM, yelenakaplan &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:kaplanyel@...\">kaplanyel@...</a>&gt; wrote:<br/>\n&gt; &lt;&lt;The kid knew it hurt. Doing something when you know it will hurt<br/>\n&gt; isn&#39;t nice. It&#39;s beyond the hurt to intention and motivation. It<br/>\n&gt; wasn&#39;t an accident.&gt;&gt;<br/>\n&gt;<br/>\n&gt; Just want to chime in again -- been busy traveling and unpacking and<br/>\n&gt; so have had no time to respond to all the ideas here. We&#39;re back<br/>\n&gt; from the family visit and working our way back to balance. My<br/>\n&gt; husband actually said to me that he can tell I&#39;ve been around my<br/>\n&gt; family from the way I&#39;m dealing with Stella right now.<br/>\n&gt;<br/>\n&gt; Anyhoo, the kid *does* know that it hurts and she plays little puppet<br/>\n&gt; games where one puppet hits the other one, the other one cries and<br/>\n&gt; she does the same &#39;i have to hit you&#39; and then makes them feel better<br/>\n&gt; bit every time. It had never occured to me to *ask her* what else<br/>\n&gt; she can do in the situation. I always *told* her that she can hit<br/>\n&gt; other things, but the telling turned her off the idea. Yesterday we<br/>\n&gt; played at our friend&#39;s house and I told her before we got there that<br/>\n&gt; even though she may *need* to hit and scream at her friend when we<br/>\n&gt; get there (it&#39;s happened before and like I said she gets stuck in<br/>\n&gt; some interactions, I wasn&#39;t just being pessimistic) we&#39;ve got to find<br/>\n&gt; another way to deal with it. Her friend did get whacked with a brush<br/>\n&gt; (hairdresser was having a tough moment :) but then I reminded Stella<br/>\n&gt; that she can choose to do something else. *She* suggested hitting<br/>\n&gt; and pushing a Dora doll and we did that for a good 15 minutes before<br/>\n&gt; everything calmed down to the point where the kids could play<br/>\n&gt; together again without fighting. I still have to get physically<br/>\n&gt; involved, but hopefully after employing these ideas it will become<br/>\n&gt; less frequent.<br/>\n&gt;<br/>\n&gt; Also, not that I have to reiterate, but these episodes are not the<br/>\n&gt; norm for us, only in stressful/tired states does she lash out, and<br/>\n&gt; usually only when I&#39;m around her. She&#39;s very polite in public and<br/>\n&gt; almost eerily (if we&#39;re talking about kids being developmentally at a<br/>\n&gt; certain point) capable of holding a conversation with an adult. If<br/>\n&gt; I&#39;m not in the room, she uses her communication/social &#39;fitting in&#39;<br/>\n&gt; skills more efficiently then when I&#39;m with her. She knows that if<br/>\n&gt; I&#39;m not there to help her figure things out it&#39;s better to take the<br/>\n&gt; safe route. The problem really is my rebellious vibes I think :)<br/>\n&gt;<br/>\n&gt; The good news is I&#39;m missing little pieces and that&#39;s what I&#39;m here<br/>\n&gt; for -- to fill in the gaps in my understanding of how to deal with<br/>\n&gt; people, little and big.<br/>\n&gt;<br/>\n&gt; Thanks again for your insights!<br/>\n&gt;<br/>\n&gt; Yelena<br/>\n&gt;<br/>\n&gt; --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;&gt;<br/>\n&gt;&gt; -=-i don&#39;t know if that is necessarily true - after the fact<br/>\n&gt;&gt; explainations of what happened are different than using impulse<br/>\n&gt;&gt; control and predictive skills before.... -=-<br/>\n&gt;&gt;<br/>\n&gt;&gt; Yes. But they&#39;re BEFORE the next time. Waiting until it happens<br/>\n&gt;&gt; each time and then deciding not to discuss it because the child is<br/>\n&gt;&gt; too young isn&#39;t as good as discussing how to begin to decide how<br/>\n&gt; to<br/>\n&gt;&gt; act. Some kids aren&#39;t able to think about such things. The child<br/>\n&gt; in<br/>\n&gt;&gt; this scenario seems to be discussing it pretty clearly.<br/>\n&gt;&gt;<br/>\n&gt;&gt; -=-yeah, i wasn&#39;t suggesting pretending it was nice, i was just<br/>\n&gt;&gt; throwing around the idea that saying &quot;that hurts&quot; is a more<br/>\n&gt; accurate<br/>\n&gt;&gt; assessment of WHY it isn&#39;t nice, and not judging a child for their<br/>\n&gt;&gt; lack of brain development..... -=-<br/>\n&gt;&gt;<br/>\n&gt;&gt; The kid knew it hurt. Doing something when you know it will hurt<br/>\n&gt;&gt; isn&#39;t nice. It&#39;s beyond the hurt to intention and motivation. It<br/>\n&gt;&gt; wasn&#39;t an accident.<br/>\n&gt;&gt;<br/>\n&gt;&gt; -=-then perhaps a vote of confidence that they WILL eventually be<br/>\n&gt;&gt; able to control themselves is life serving, along the same lines,<br/>\n&gt; and<br/>\n&gt;&gt; doesn&#39;t suggest taht they had a choice but made the &quot;wrong&quot; one,<br/>\n&gt; even<br/>\n&gt;&gt; if they didn&#39;t have a real choice? -=-<br/>\n&gt;&gt;<br/>\n&gt;&gt; Why wait for someday and eventually when the child has another<br/>\n&gt; chance<br/>\n&gt;&gt; to do better days or hours or moments later?<br/>\n&gt;&gt;<br/>\n&gt;&gt; -=-but if a child is *developmentally* incapable of impulse<br/>\n&gt; control,<br/>\n&gt;&gt; due to the limitations of their brain and its development - they<br/>\n&gt;&gt; *won&#39;t* have tools whether mother is dead or alive. -=-<br/>\n&gt;&gt;<br/>\n&gt;&gt; Yes. Let&#39;s not treat all children like a point on a curve,<br/>\n&gt; assuming<br/>\n&gt;&gt; that they don&#39;t understand us so we might as well not try to<br/>\n&gt;&gt; communicate.<br/>\n&gt;&gt;<br/>\n&gt;&gt; Some children will NEVER understand language, and that&#39;s very<br/>\n&gt;&gt; unfortunate. Some might understand it and never have the<br/>\n&gt; physical<br/>\n&gt;&gt; or mental ability to use it in return.<br/>\n&gt;&gt; We&#39;ve been talking about a young child who is very verbal. How<br/>\n&gt; did<br/>\n&gt;&gt; she get verbal? Probably her parents were talking to her even<br/>\n&gt;&gt; before she could understand the words. We don&#39;t wait until<br/>\n&gt; children<br/>\n&gt;&gt; are old enough to speak to talk to them. We don&#39;t need to wait<br/>\n&gt; until<br/>\n&gt;&gt; they&#39;re old enough to be analytical about emotions to talk about<br/>\n&gt;&gt; emotions to them. We don&#39;t need to wait until they have reached<br/>\n&gt;&gt; anyone&#39;s definition of the age of accountability to talk to them<br/>\n&gt;&gt; about accountability (not in those terms, but in simple terms).<br/>\n&gt;&gt;<br/>\n&gt;&gt; Sandra<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt;&gt; [Non-text portions of this message have been removed]<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226424677","msgId":40146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlCRDE3RURGLTkxQzgtNDVBNC1CNjA2LTEyOTVDQTg5MUI2QUBtYWMuY29tPg==","inReplyToHeader":"PGdmY2J2aSszZGh2QGVHcm91cHMuY29tPg==","referencesHeader":"PGdmY2J2aSszZGh2QGVHcm91cHMuY29tPg=="},"prevInTopic":40145,"nextInTopic":40152,"prevInTime":40145,"nextInTime":40147,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"... I m surprised that you still have other families who want to hang out with her. Or at least you and her, together. I know my kids wouldn t want to keep","messageBody":"<div id=\"ygrps-yiv-625929821\">On Nov 11, 2008, at 8:30 AM, yelenakaplan wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, not that I have to reiterate, but these episodes are not the<br/>\n&gt; norm for us, only in stressful/tired states does she lash out, and<br/>\n&gt; usually only when I&#39;m around her.<br/>\n<br/>\n </span></blockquote>I&#39;m surprised that you still have other families who want to hang out  <br/>\nwith her. Or at least you and her, together. I know my kids wouldn&#39;t  <br/>\nwant to keep hanging out with another child who lashed out physically  <br/>\nmore than a time or two.<br/>\n<br/>\nYou seem to be aware of what leads up to her lashing out. Do you not  <br/>\nnotice the stress building up in time to intervene before the lashing  <br/>\nout takes place? Are you helping her recognize the signs, in advance,  <br/>\nso that she can have more self-awareness. When she is aware that her  <br/>\nown stress level is building up, there are lots of things she can do  <br/>\n(and I&#39;m talking about things other than beating on some alternative  <br/>\nto the other child, which, yeah, is better than beating on her friend,  <br/>\nbut still means she&#39;s gotten to a very extreme point). Why don&#39;t you  <br/>\nand she together talk about how she&#39;s feeling BEFORE she explodes -  <br/>\nand then come up with some things to do when she&#39;s starting to have  <br/>\nthose feelings - breathe deeply, go to the bathroom, go get a drink of  <br/>\nwater, calmly express the feelings verbally, get help with whatever is  <br/>\nfrustrating her - ask an adult for help or even her friend.<br/>\n<br/>\nI&#39;m confused about why she&#39;s doing this only when you&#39;re present. Are  <br/>\nyou sure about that? Have you asked her why that is?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":339346350,"authorName":"yelenakaplan","from":"&quot;yelenakaplan&quot; &lt;kaplanyel@...&gt;","profile":"yelenakaplan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226422271","msgId":40145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmY2Q1ditzdWd0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdmY2J2aSszZGh2QGVHcm91cHMuY29tPg=="},"prevInTopic":40144,"nextInTopic":40146,"prevInTime":40144,"nextInTime":40146,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"Rephrase at the end of sentense: ","messageBody":"<div id=\"ygrps-yiv-547709622\">Rephrase at the end of sentense:<br/>\n<br/>\n&lt;&lt;Also, not that I have to reiterate, but these episodes are not the<br/>\nnorm for us, only in stressful/tired states does she lash out, and it&#39;s<br/>\nusually only when I&#39;m around her and *we&#39;re with other people in their <br/>\nhomes*&gt;&gt;</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226422150","msgId":40144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1MUExNTA1LTRFNDctNEFGMy1BQTBDLUI2RkE0NTEwNkZDQkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmY2J2aSszZGh2QGVHcm91cHMuY29tPg==","referencesHeader":"PGdmY2J2aSszZGh2QGVHcm91cHMuY29tPg=="},"prevInTopic":40143,"nextInTopic":40145,"prevInTime":40143,"nextInTime":40145,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-Her friend did get whacked with a brush (hairdresser was having a tough moment :) -=- The smiley disturbs me, if it was a smiley and not just the end of ","messageBody":"<div id=\"ygrps-yiv-1022261934\">-=-Her friend did get whacked with a brush<br/>\n(hairdresser was having a tough moment :) -=-<br/>\n<br/>\nThe smiley disturbs me, if it was a smiley and not just the end of  <br/>\nparentheses.<br/>\n<br/>\nI wouldn&#39;t want my kids to be whacked with a brush by ANYone.<br/>\n<br/>\n<br/>\n<br/>\n-=-Her friend did get whacked with a brush (hairdresser was having a  <br/>\ntough moment :) but then I reminded Stella that she can choose to do  <br/>\nsomething else. -=-<br/>\n<br/>\nIf you worded that way, it sounds like it was okay for her to choose  <br/>\nto whack.<br/>\n<br/>\nIf a teen or adult whacked me or my kids with a brush, I could call  <br/>\nthe police.<br/>\n<br/>\n-=-*She* suggested hitting and pushing a Dora doll and we did that  <br/>\nfor a good 15 minutes before everything calmed down to the point  <br/>\nwhere the kids could play together again without fighting.-=-<br/>\n<br/>\nI hope the Dora doll belonged to her and not to the friend.<br/>\n<br/>\nShe was still hitting.  If her choices are between hitting a human  <br/>\nand the effigy of a human, she&#39;s still a person who hits.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":339346350,"authorName":"yelenakaplan","from":"&quot;yelenakaplan&quot; &lt;kaplanyel@...&gt;","profile":"yelenakaplan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226421042","msgId":40143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmY2J2aSszZGh2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk4QzAxNkZBLTNGNEItNDFDRC05NkFCLTE1ODg2QkMyRTgyRUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40119,"nextInTopic":40144,"prevInTime":40142,"nextInTime":40144,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2067717692\">&lt;&lt;The kid knew it hurt. Doing something when you know it will hurt<br/>\nisn&#39;t nice. It&#39;s beyond the hurt to intention and motivation. It<br/>\nwasn&#39;t an accident.&gt;&gt;<br/>\n<br/>\nJust want to chime in again -- been busy traveling and unpacking and <br/>\nso have had no time to respond to all the ideas here.  We&#39;re back <br/>\nfrom the family visit and working our way back to balance.  My <br/>\nhusband actually said to me that he can tell I&#39;ve been around my <br/>\nfamily from the way I&#39;m dealing with Stella right now. <br/>\n<br/>\nAnyhoo, the kid *does* know that it hurts and she plays little puppet <br/>\ngames where one puppet hits the other one, the other one cries and <br/>\nshe does the same &#39;i have to hit you&#39; and then makes them feel better <br/>\nbit every time.  It had never occured to me to *ask her* what else <br/>\nshe can do in the situation.  I always *told* her that she can hit <br/>\nother things, but the telling turned her off the idea.  Yesterday we <br/>\nplayed at our friend&#39;s house and I told her before we got there that <br/>\neven though she may *need* to hit and scream at her friend when we <br/>\nget there (it&#39;s happened before and like I said she gets stuck in <br/>\nsome interactions, I wasn&#39;t just being pessimistic) we&#39;ve got to find <br/>\nanother way to deal with it.  Her friend did get whacked with a brush <br/>\n(hairdresser was having a tough moment :) but then I reminded Stella <br/>\nthat she can choose to do something else.  *She* suggested hitting <br/>\nand pushing a Dora doll and we did that for a good 15 minutes before <br/>\neverything calmed down to the point where the kids could play <br/>\ntogether again without fighting. I still have to get physically <br/>\ninvolved, but hopefully after employing these ideas it will become <br/>\nless frequent.  <br/>\n<br/>\nAlso, not that I have to reiterate, but these episodes are not the <br/>\nnorm for us, only in stressful/tired states does she lash out, and <br/>\nusually only when I&#39;m around her.  She&#39;s very polite in public and <br/>\nalmost eerily (if we&#39;re talking about kids being developmentally at a <br/>\ncertain point) capable of holding a conversation with an adult. If <br/>\nI&#39;m not in the room, she uses her communication/social &#39;fitting in&#39; <br/>\nskills more efficiently then when I&#39;m with her.  She knows that if <br/>\nI&#39;m not there to help her figure things out it&#39;s better to take the <br/>\nsafe route.  The problem really is my rebellious vibes I think :)<br/>\n<br/>\nThe good news is I&#39;m missing little pieces and that&#39;s what I&#39;m here <br/>\nfor -- to fill in the gaps in my understanding of how to deal with <br/>\npeople, little and big.<br/>\n<br/>\nThanks again for your insights!<br/>\n<br/>\nYelena<br/>\n<br/>\n <br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-i don&#39;t know if that is necessarily true - after the fact  <br/>\n&gt; explainations of what happened are different than using impulse  <br/>\n&gt; control and predictive skills before.... -=-<br/>\n&gt; <br/>\n&gt; Yes.  But they&#39;re BEFORE the next time.  Waiting until it happens  <br/>\n&gt; each time and then deciding not to discuss it because the child is  <br/>\n&gt; too young isn&#39;t as good as discussing how to begin to decide how <br/>\nto  <br/>\n&gt; act.  Some kids aren&#39;t able to think about such things.  The child <br/>\nin  <br/>\n&gt; this scenario seems to be discussing it pretty clearly.<br/>\n&gt; <br/>\n&gt; -=-yeah, i wasn&#39;t suggesting pretending it was nice, i was just  <br/>\n&gt; throwing around the idea that saying &quot;that hurts&quot; is a more <br/>\naccurate  <br/>\n&gt; assessment of WHY it isn&#39;t nice, and not judging a child for their  <br/>\n&gt; lack of brain development..... -=-<br/>\n&gt; <br/>\n&gt; The kid knew it hurt.  Doing something when you know it will hurt  <br/>\n&gt; isn&#39;t nice.  It&#39;s beyond the hurt to intention and motivation.  It  <br/>\n&gt; wasn&#39;t an accident.<br/>\n&gt; <br/>\n&gt; -=-then perhaps a vote of confidence that they WILL eventually be  <br/>\n&gt; able to control themselves is life serving, along the same lines, <br/>\nand  <br/>\n&gt; doesn&#39;t suggest taht they had a choice but made the &quot;wrong&quot; one, <br/>\neven  <br/>\n&gt; if they didn&#39;t have a real choice? -=-<br/>\n&gt; <br/>\n&gt; Why wait for someday and eventually when the child has another <br/>\nchance  <br/>\n&gt; to do better days or hours or moments later?<br/>\n&gt; <br/>\n&gt; -=-but if a child is *developmentally* incapable of impulse <br/>\ncontrol,  <br/>\n&gt; due to the limitations of their brain and its development - they  <br/>\n&gt; *won&#39;t* have tools whether mother is dead or alive. -=-<br/>\n&gt; <br/>\n&gt; Yes.  Let&#39;s not treat all children like a point on a curve, <br/>\nassuming  <br/>\n&gt; that they don&#39;t understand us so we might as well not try to  <br/>\n&gt; communicate.<br/>\n&gt; <br/>\n&gt; Some children will NEVER understand language, and that&#39;s very  <br/>\n&gt; unfortunate.   Some might understand it and never have the <br/>\nphysical  <br/>\n&gt; or mental ability to use it in return.<br/>\n&gt; We&#39;ve been talking about a young child who is very verbal.  How <br/>\ndid  <br/>\n&gt; she get verbal?  Probably her parents  were talking to her even  <br/>\n&gt; before she could understand the words.  We don&#39;t wait until <br/>\nchildren  <br/>\n&gt; are old enough to speak to talk to them.  We don&#39;t need to wait <br/>\nuntil  <br/>\n&gt; they&#39;re old enough to be analytical about emotions to talk about  <br/>\n&gt; emotions to them.  We don&#39;t need to wait until they have reached  <br/>\n&gt; anyone&#39;s definition of the age of accountability to talk to them  <br/>\n&gt; about accountability (not in those terms, but in simple terms).<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":356893003,"authorName":"prism7513","from":"&quot;prism7513&quot; &lt;penley75@...&gt;","profile":"prism7513","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226379478","msgId":40119,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmYjNjbStrbzIzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDIyREI0NEEyLUNFMzktNEQzNC05MDZDLTI5RUJCNkI3OEY2QUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40093,"nextInTopic":40143,"prevInTime":40118,"nextInTime":40120,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"... Hmmm. That gives me hope - this is my 31st year that I m living in currently :) The more I read here, the more I get discouraged for falling short, then","messageBody":"<div id=\"ygrps-yiv-967478658\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; I don&#39;t doubt the 31 years thing.  I have had adult students for  <br/>\n&gt; years, learning in one-on-one and small-group ways how to be virtuous  <br/>\n&gt; and honorable adults, and many times the breakthrough comes at the  <br/>\n&gt; age of 30.  I announced about ten years ago that I would never take  <br/>\n&gt; another student under the age of 30, and one 25 year old made some  <br/>\n&gt; noise about it, and when she was 30 came back and apologized.<br/>\n<br/>\n </span></blockquote>Hmmm. That gives me hope - this is my 31st year that I&#39;m living in<br/>\ncurrently :) The more I read here, the more I get discouraged for<br/>\nfalling short, then encouraged for &quot;getting it&quot; a little more, then<br/>\nback and forth again. I keep trying to stay positive that eventually<br/>\nsomething will click, or little by little more is sinking in. That<br/>\nlittle voice tells me &quot;each little step in the right direction is<br/>\nprogress&quot; but it&#39;s still hard to see the mistakes I make, too.<br/>\n<br/>\nDeb</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226350861","msgId":40093,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwMjAyNUU2LTkxNzEtNDhENi1BOTdFLTRFNjM5M0I2Q0M4MUBtYWMuY29tPg==","inReplyToHeader":"PGdmN2JmbytxdTlrQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmN2JmbytxdTlrQGVHcm91cHMuY29tPg=="},"prevInTopic":40084,"nextInTopic":40119,"prevInTime":40092,"nextInTime":40094,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"... What stimulates the development of those executive function skills. Why are they highly developed by 14 in some people and seemingly never developed in","messageBody":"<div id=\"ygrps-yiv-1163962\">On Nov 9, 2008, at 10:51 AM, Lyla Wolfenstein wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  recent research has revealed that the frontal<br/>\n&gt; lobe, which is responsible for &quot;executive function&quot;, impulse control,<br/>\n&gt; predictive skills, etc., does not reach maturity until sometime<br/>\n&gt; between the ages of 14 and 31 YEARS of age.  a young child, under this<br/>\n&gt; model, possesses only a fraction of future capacity in these areas.<br/>\n<br/>\n </span></blockquote>What stimulates the development of those &quot;executive function&quot; skills.  <br/>\nWhy are they highly developed by 14 in some people and seemingly never  <br/>\ndeveloped in others?<br/>\n<br/>\nTo say a child has only a fraction of their future capacity isn&#39;t to  <br/>\nsay that they have no capacity and it certainly isn&#39;t to say that they  <br/>\nhave no capacity to learn.<br/>\n<br/>\nI have a daughter who will turn 24 in a couple of weeks. I&#39;ve watched  <br/>\nher develop a LOT of  impulse control over just the past year. But  <br/>\nthat doesn&#39;t mean she had NO ability to develop impulse control 20  <br/>\nyears ago, when she was only 4 years old.<br/>\n<br/>\nKnowing that these executive functions are still developing is  <br/>\nencouraging to parents, I think, since it means the kids are &quot;still  <br/>\nlearning&quot; - that&#39;s nice to know when your kid makes lousy decisions.  <br/>\nAnd it is good to have reasonable expectations about our children&#39;s  <br/>\nabilities, of course. I mean, those who swat little babies because  <br/>\nkicking and squirming during diaper changes shows they are being  <br/>\nrebellious could benefit by knowing that those babies aren&#39;t even  <br/>\ncognitively capable of that kind of thinking. &quot;Ages and stages&quot;  <br/>\nliterature is available and useful for parents who aren&#39;t sure what is  <br/>\nreasonable to expect.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226342749","msgId":40084,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmOXZndCt0cmk1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk4QzAxNkZBLTNGNEItNDFDRC05NkFCLTE1ODg2QkMyRTgyRUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40039,"nextInTopic":40093,"prevInTime":40083,"nextInTime":40085,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"We don t wait until children ... Right--for me this is an important point.  This stuff on brain development, while valuable for its information about the","messageBody":"<div id=\"ygrps-yiv-211819594\">We don&#39;t wait until children  <br/>\n<blockquote><span title=\"ireply\"> &gt; are old enough to speak to talk to them.  We don&#39;t need to wait until  <br/>\n&gt; they&#39;re old enough to be analytical about emotions to talk about  <br/>\n&gt; emotions to them.  We don&#39;t need to wait until they have reached  <br/>\n&gt; anyone&#39;s definition of the age of accountability to talk to them  <br/>\n&gt; about accountability (not in those terms, but in simple terms).<br/>\n<br/>\n </span></blockquote>Right--for me this is an important point.  This stuff on brain development, while valuable <br/>\nfor its information about the generalities of development, can mistakenly (IMHO) imply <br/>\nthat there is some magic point where the ability is there and then that&#39;s when a person is <br/>\naccountable.  That just doesn&#39;t match my own experience of how people learn and <br/>\ndevelop.  <br/>\n<br/>\nA child doesn&#39;t wait to walk until they can--they go through all the steps, spending a long <br/>\ntime on some steps, flying through others, skipping others entirely, until the day that they <br/>\ntake their first step.  Growth is happening, learning is happening.  Brain, body, emotions, <br/>\nabilities are all changing and expanding every day, and connected parents are responding <br/>\nto what is going on right now--not in a hypothetical world.<br/>\n<br/>\nJust because an area of the brain isn&#39;t the primary area being used doesn&#39;t mean it is dead <br/>\nuntil the switch goes on.  I&#39;m imagining that connections would be forming, systems <br/>\nwould be in a state of flux as input comes in, and that there would be processes whereby <br/>\na person would be testing which response gets which reaction, and those responses are <br/>\ncoming from different places--for example, if I hit, which feels easy, natural and <br/>\ninstinctive I get this reaction.  If I walk away, then this happens.  If I say, &quot;No,&quot; then <br/>\nsomething else happens.  If I ask, &quot;Please,&quot; which may be more difficult to pull off at first, <br/>\nthen something different happens.  We have a range available even before one set course <br/>\nof action is consistently chosen.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226267563","msgId":40039,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4QzAxNkZBLTNGNEItNDFDRC05NkFCLTE1ODg2QkMyRTgyRUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEwMTkxODk3MjkuNDY3OTQxMjI2MjU5OTc2NjI4LkphdmFNYWlsLnJvb3RAc3owMDk0YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+","referencesHeader":"PDEwMTkxODk3MjkuNDY3OTQxMjI2MjU5OTc2NjI4LkphdmFNYWlsLnJvb3RAc3owMDk0YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+"},"prevInTopic":40034,"nextInTopic":40084,"prevInTime":40038,"nextInTime":40040,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-i don t know if that is necessarily true - after the fact explainations of what happened are different than using impulse control and predictive skills","messageBody":"<div id=\"ygrps-yiv-2125268036\">-=-i don&#39;t know if that is necessarily true - after the fact  <br/>\nexplainations of what happened are different than using impulse  <br/>\ncontrol and predictive skills before.... -=-<br/>\n<br/>\nYes.  But they&#39;re BEFORE the next time.  Waiting until it happens  <br/>\neach time and then deciding not to discuss it because the child is  <br/>\ntoo young isn&#39;t as good as discussing how to begin to decide how to  <br/>\nact.  Some kids aren&#39;t able to think about such things.  The child in  <br/>\nthis scenario seems to be discussing it pretty clearly.<br/>\n<br/>\n-=-yeah, i wasn&#39;t suggesting pretending it was nice, i was just  <br/>\nthrowing around the idea that saying &quot;that hurts&quot; is a more accurate  <br/>\nassessment of WHY it isn&#39;t nice, and not judging a child for their  <br/>\nlack of brain development..... -=-<br/>\n<br/>\nThe kid knew it hurt.  Doing something when you know it will hurt  <br/>\nisn&#39;t nice.  It&#39;s beyond the hurt to intention and motivation.  It  <br/>\nwasn&#39;t an accident.<br/>\n<br/>\n-=-then perhaps a vote of confidence that they WILL eventually be  <br/>\nable to control themselves is life serving, along the same lines, and  <br/>\ndoesn&#39;t suggest taht they had a choice but made the &quot;wrong&quot; one, even  <br/>\nif they didn&#39;t have a real choice? -=-<br/>\n<br/>\nWhy wait for someday and eventually when the child has another chance  <br/>\nto do better days or hours or moments later?<br/>\n<br/>\n-=-but if a child is *developmentally* incapable of impulse control,  <br/>\ndue to the limitations of their brain and its development - they  <br/>\n*won&#39;t* have tools whether mother is dead or alive. -=-<br/>\n<br/>\nYes.  Let&#39;s not treat all children like a point on a curve, assuming  <br/>\nthat they don&#39;t understand us so we might as well not try to  <br/>\ncommunicate.<br/>\n<br/>\nSome children will NEVER understand language, and that&#39;s very  <br/>\nunfortunate.   Some might understand it and never have the physical  <br/>\nor mental ability to use it in return.<br/>\nWe&#39;ve been talking about a young child who is very verbal.  How did  <br/>\nshe get verbal?  Probably her parents  were talking to her even  <br/>\nbefore she could understand the words.  We don&#39;t wait until children  <br/>\nare old enough to speak to talk to them.  We don&#39;t need to wait until  <br/>\nthey&#39;re old enough to be analytical about emotions to talk about  <br/>\nemotions to them.  We don&#39;t need to wait until they have reached  <br/>\nanyone&#39;s definition of the age of accountability to talk to them  <br/>\nabout accountability (not in those terms, but in simple terms).<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw@comcast.net","from":"lylaw@...","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226259976","msgId":40034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwMTkxODk3MjkuNDY3OTQxMjI2MjU5OTc2NjI4LkphdmFNYWlsLnJvb3RAc3owMDk0YS5lbWVyeXZpbGxlLmNhLm1haWwuY29tY2FzdC5uZXQ+","inReplyToHeader":"PDIyREI0NEEyLUNFMzktNEQzNC05MDZDLTI5RUJCNkI3OEY2QUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40032,"nextInTopic":40039,"prevInTime":40033,"nextInTime":40035,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"... understand making a decision not to. i don t know if that is necessarily true - after the fact explainations of what happened are different than using","messageBody":"<div id=\"ygrps-yiv-869473006\"><blockquote><span title=\"ireply\">&gt;&gt;No, if a child is able to say she &quot;did have to hit him&quot; she can <br/>\n </span></blockquote>understand making a decision not to. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\ni don&#39;t know if that is necessarily true - after the fact explainations of what happened are different than using impulse control and predictive skills before.... <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It&#39;s not nice to pinch a cat or scratch a baby. It&#39;s not nice for a <br/>\n </span></blockquote>parent to pretend it IS nice (or acceptable behavior). <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nyeah, i wasn&#39;t suggesting pretending it was nice, i was just throwing around the idea that saying &quot;that hurts&quot; is a more accurate assessment of WHY it isn&#39;t nice, and not judging a child for their lack of brain development..... <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; &quot;Not nice&quot; isn&#39;t shaming. It&#39;s &quot;You had a choice and might make a <br/>\n </span></blockquote>better one next time.&quot; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nwell - yes, if you believe they really had a choice. if one believes that they didn&#39;t have the impulse control, (which you say above you don&#39;t - but let&#39;s say at SOME age they don&#39;t - let&#39;s a say a kid who doesn&#39;t say &quot;i had to&quot; but jus dose it and then runs off) then perhaps a vote of confidence that they WILL eventually be able to control themselves is life serving, along the same lines, and doesn&#39;t suggest taht they had a choice but made the &quot;wrong&quot; one, even if they didn&#39;t have a real choice? <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n-=-i have actually seen wonderful responses from the adult APOLOGZING <br/>\nto the child for not getting there in time - to prevent the hit, to <br/>\nuse OUR frontal lobe capacity while the child&#39;s was <br/>\nundeveloped....because it doesn&#39;t feel GOOD to a child to &quot;lose <br/>\ncontrol.&quot;-=- <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It doesn&#39;t feel good for a young child who IS pretty swift in inter- <br/>\n </span></blockquote>and intra-personal intelligences to see a mother falling over herself <br/>\napologizing to a child for not being physically there to prevent her <br/>\nfrom needing to learn to think, either. It says to a child &quot;Nothing <br/>\nis your fault,&quot; and that&#39;s a very bad message to send. That mother <br/>\ncould die today, and what tools will the child have to behave <br/>\nthoughtfully?&gt; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nbut if a child is *developmentally* incapable of impulse control, due to the limitations of their brain and its development - they *won&#39;t* have tools whether mother is dead or alive. that&#39;s like saying, in my opinion, that we shouldn&#39;t co-sleep with a child because what if mom died - how woudl they ever get to bed by themselves? i have heard many people say that actually... <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\ni don&#39;t think it necesarily has to say nothing is your fault, nor do we have to say &quot;that is your responsibility/fault&quot; - it seems to me like yet another opportunity, which unschooling is so full of - to partner with our kids - to KNOW wht they are and arent capable of - and to *trust* that they will get there... <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nLyla <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226259047","msgId":40032,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUxOTY5N0I0LTlCMEUtNDZGNi1CRDMxLTUxREVCRkYzNDQ1MEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmN2RoZCtja3VkQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmN2RoZCtja3VkQGVHcm91cHMuY29tPg=="},"prevInTopic":40031,"nextInTopic":40034,"prevInTime":40031,"nextInTime":40033,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-Maybe it s not good to agree on ideas that will limit your life, and consequently limit your daughter s life.-=- Good point. We don t think of it as","messageBody":"<div id=\"ygrps-yiv-693205325\">-=-Maybe it&#39;s not good to agree on ideas that will limit your life,  <br/>\nand consequently limit your<br/>\ndaughter&#39;s life.-=-<br/>\n<br/>\n<br/>\n<br/>\nGood point.<br/>\n<br/>\nWe don&#39;t think of it as &quot;compromise&quot; here, but as consideration and  <br/>\ngenerosity.  When the priorities are known (at our house, happiness  <br/>\nand learning) then when there&#39;s a conflict, the thing that leads more  <br/>\ntoward learning or fulfilling obligations (kids being at work on  <br/>\ntime, getting purchases to the post office) or things that lead to  <br/>\nmore peace will get the first car keys and money.  Other things can  <br/>\nwait.<br/>\n<br/>\nWhen the kids were babies, we tried to  make them comfortable.  In no  <br/>\ntime at all, we started seeing them trying to make other people  <br/>\ncomfortable, too.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Toddler Stuff","postDate":"1226258797","msgId":40031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmN2RoZCtja3VkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdmNXQ3aSs3cWhxQGVHcm91cHMuY29tPg=="},"prevInTopic":40030,"nextInTopic":40032,"prevInTime":40030,"nextInTime":40032,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"... It seems like your daughter is reflecting this belief.  The useful, take-away message that I got from Non-Violent Communication is that if you believe that","messageBody":"<div id=\"ygrps-yiv-1687779115\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;yelenakaplan&quot; &lt;kaplanyel@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &lt;&lt;If that&#39;s true, then maybe your daughter is not getting the message of<br/>\n&gt; compromise and care for others, and isn&#39;t being supported in how to act so that others<br/>\n&gt; can interact with her positively&gt;&gt;<br/>\n&gt; <br/>\n&gt; And only cuz I&#39;ve never seen it first hand so it&#39;s VERY difficult to model, support etc...  My <br/>\n&gt; husband and I have agreed that compromise is just when nobody gets what they want -<br/>\n<br/>\n </span></blockquote>It seems like your daughter is reflecting this belief.  The useful, take-away message that I got <br/>\nfrom Non-Violent Communication is that if you believe that all of our needs matter then you <br/>\ncan problem solve in such a way as to get everyone&#39;s needs met--which is different than <br/>\ncompromise.  But the initial belief sets the stage for how you act.  For example, if you believe <br/>\nthat compromise means that you will not ever get what you want, then you aren&#39;t very likely <br/>\nto help your daughter engage in compromise.<br/>\n<br/>\nMaybe it&#39;s not good to agree on ideas that will limit your life, and consequently limit your <br/>\ndaughter&#39;s life.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226258575","msgId":40030,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyREI0NEEyLUNFMzktNEQzNC05MDZDLTI5RUJCNkI3OEY2QUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmN2JmbytxdTlrQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmN2JmbytxdTlrQGVHcm91cHMuY29tPg=="},"prevInTopic":40027,"nextInTopic":40031,"prevInTime":40029,"nextInTime":40031,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-if this is true, then it seems to me that even saying that wasn t nice is futile at best, and harmful at worst - futile because as much as the child may","messageBody":"<div id=\"ygrps-yiv-1918979534\">-=-if this is true, then it seems to me that even saying &quot;that wasn&#39;t<br/>\nnice&quot; is futile at best, and harmful at worst - futile because as much<br/>\nas the child may learn and know that, they are neurologically<br/>\nincapable, much of the time, of holding that in the &quot;forefront&quot; of<br/>\ntheir mind and using it to make a decision - and harmful at worst<br/>\nbecause if they really &quot;did have to hit him&quot; that might be their way<br/>\nof saying that they had NO impulse control....and &quot;that wasn&#39;t nice&quot;<br/>\nsuddenly becomes, from the child&#39;s perspective &quot;you aren&#39;t nice&quot; --=-<br/>\n<br/>\nNo, if a child is able to say she &quot;did have to hit him&quot; she can  <br/>\nunderstand making a decision not to.<br/>\n<br/>\nIt&#39;s not nice to pinch a cat or scratch a baby.  It&#39;s not nice for a  <br/>\nparent to pretend it IS nice (or acceptable behavior).<br/>\n<br/>\n-=-i would think we need to *prevent*, redirect, and avoid areas of  <br/>\nconflict and impulse that would be destructive, and if WE fail to  <br/>\npredict our child&#39;s actions (our frontal lobe at work!) then shaming  <br/>\nthe child is useless and just that - shaming.-=-<br/>\n<br/>\n&quot;Not nice&quot; isn&#39;t shaming.  It&#39;s &quot;You had a choice and might make a  <br/>\nbetter one next time.&quot;<br/>\n<br/>\n-=-i have actually seen wonderful responses from the adult APOLOGZING  <br/>\nto the child for not getting there in time - to prevent the hit, to  <br/>\nuse OUR frontal lobe capacity while the child&#39;s was  <br/>\nundeveloped....because it doesn&#39;t feel GOOD to a child to &quot;lose  <br/>\ncontrol.&quot;-=-<br/>\n<br/>\nIt doesn&#39;t feel good for a young child who IS pretty swift in inter-  <br/>\nand intra-personal intelligences to see a mother falling over herself  <br/>\napologizing to a child for not being physically there to prevent her  <br/>\nfrom needing to learn to think, either. It says to a child &quot;Nothing  <br/>\nis your fault,&quot; and that&#39;s a very bad message to send.  That mother  <br/>\ncould die today, and what tools will the child have to behave  <br/>\nthoughtfully?<br/>\n<br/>\n<br/>\n<br/>\n-=-my understanding is that recent research has revealed that the  <br/>\nfrontal lobe, which is responsible for &quot;executive function&quot;, impulse  <br/>\ncontrol, predictive skills, etc., does not reach maturity until  <br/>\nsometime between the ages of 14 and 31 YEARS of age.-=-<br/>\n<br/>\nI don&#39;t doubt the 31 years thing.  I have had adult students for  <br/>\nyears, learning in one-on-one and small-group ways how to be virtuous  <br/>\nand honorable adults, and many times the breakthrough comes at the  <br/>\nage of 30.  I announced about ten years ago that I would never take  <br/>\nanother student under the age of 30, and one 25 year old made some  <br/>\nnoise about it, and when she was 30 came back and apologized.<br/>\n<br/>\nI never said I wouldn&#39;t bother to discuss better and worse choices  <br/>\nwith my children before they were 30.  There are teens in prison as  <br/>\nadults.  My kids are so far not even nearly among them, and there are  <br/>\nreasons for that.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226256696","msgId":40027,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmN2JmbytxdTlrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFEMUI4Qjk5LTRGQjMtNDg0Mi04NDI0LTgxRTk4MTIxNDQyM0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40026,"nextInTopic":40030,"prevInTime":40026,"nextInTime":40028,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"... If your daughter is verbal and analytical enough to know what that means, then she already knows about hurt feelings. You could say That wasn t nice. You","messageBody":"<div id=\"ygrps-yiv-315610142\"><blockquote><span title=\"ireply\">&gt;&gt;<br/>\n </span></blockquote>If your daughter is verbal and analytical enough to know what that <br/>\nmeans, then she already knows about hurt feelings. You could say <br/>\n&quot;That wasn&#39;t nice.&quot; You could say &quot;There were other things you could <br/>\nhave done.&quot;&gt;&gt;<br/>\n<br/>\nI have been meaning to respond to this thread, and also the thread on<br/>\nlogical thinking and when that develops - and i have a question.  my<br/>\nunderstanding is that recent research has revealed that the frontal<br/>\nlobe, which is responsible for &quot;executive function&quot;, impulse control,<br/>\npredictive skills, etc., does not reach maturity until sometime<br/>\nbetween the ages of 14 and 31 YEARS of age.  a young child, under this<br/>\nmodel, possesses only a fraction of future capacity in these areas. <br/>\n<br/>\n if this is true, then it seems to me that even saying &quot;that wasn&#39;t<br/>\nnice&quot; is futile at best, and harmful at worst - futile because as much<br/>\nas the child may learn and know that, they are neurologically<br/>\nincapable, much of the time, of holding that in the &quot;forefront&quot; of<br/>\ntheir mind and using it to make a decision - and harmful at worst<br/>\nbecause if they really &quot;did have to hit him&quot; that might be their way<br/>\nof saying that they had NO impulse control....and &quot;that wasn&#39;t nice&quot;<br/>\nsuddenly becomes, from the child&#39;s perspective &quot;you aren&#39;t nice&quot; -<br/>\ndoes that make any sense to anyone else?  it seems shaming and harsh<br/>\nin light of assuming that they truly couldn&#39;t help it.  so - if this<br/>\nway of viewing a child&#39;s brain is correct, i would think that we, as<br/>\nparents, need to be their &quot;surrogate frontal lobe&quot; - just as ross<br/>\ngreene talks about in &quot;the explosive child&quot; - except for kids who<br/>\naren&#39;t &quot;explosive&quot; but just developmentally unready for consistently<br/>\nutilizing frontal lobe functions. <br/>\n<br/>\ni would think we need to *prevent*, redirect, and avoid areas of<br/>\nconflict and impulse that would be destructive, and if WE fail to<br/>\npredict our child&#39;s actions (our frontal lobe at work!) then shaming<br/>\nthe child is useless and just that - shaming.  i have actually seen<br/>\nwonderful responses from the adult APOLOGZING to the child for not<br/>\ngetting there in time - to prevent the hit, to use OUR frontal lobe<br/>\ncapacity while the child&#39;s was undeveloped....because it doesn&#39;t feel<br/>\nGOOD to a child to &quot;lose control.&quot;<br/>\n<br/>\nand if we are unable to do so -get there in time - or if we misguess<br/>\nour child&#39;s reactions, it seems incumbent upon us to take<br/>\nresponsibility for that...<br/>\n<br/>\nwould others interpret this research/line of thinking differently? <br/>\nhere are  a few articles that discuss it:<br/>\nl.<br/>\n <br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.turnthepage.com/upload/397.pdf\">http://www.turnthepage.com/upload/397.pdf</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nimh.nih.gov/health/publications/teenage-brain-a-work-in-progress.shtml\">http://www.nimh.nih.gov/health/publications/teenage-brain-a-work-in-progress.shtml</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.informaworld.com/smpp/content~content=a783682797~db=all\">http://www.informaworld.com/smpp/content~content=a783682797~db=all</a><br/>\n <br/>\nlooking forward to thoughts on this!  <br/>\n <br/>\nwarmly, Lyla</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226254177","msgId":40026,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFENkE4RjYxLTNEQ0YtNDg1MC05MDc1LTY1QjRFNjQ2QjRFOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmNzhqaytnYmRuQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmNzhqaytnYmRuQGVHcm91cHMuY29tPg=="},"prevInTopic":40024,"nextInTopic":40027,"prevInTime":40025,"nextInTime":40027,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-, or like we were having a joke at their expense, which, in a way, we were. -=- Sarcasm is always humor at someone s expense.  It s always mean.   I used to","messageBody":"<div id=\"ygrps-yiv-406970714\">-=-, or like we were having a joke at their expense, which, in a way,  <br/>\nwe were. -=-<br/>\n<br/>\n<br/>\nSarcasm is always humor at someone&#39;s expense.  It&#39;s always mean.   I  <br/>\nused to have friends whose relationships with me were almost all  <br/>\nbanter--we insulted each other often and well, but it gets old, and  <br/>\nit becomes nearly impossible to talk about anything of consequence.<br/>\n<br/>\nI don&#39;t mind the idea of teasing and &quot;smack talk&quot; when the person  <br/>\nknows when to stop.  It&#39;s like playing very roughly (slugging,  <br/>\nwrestling, bopping the backs of heads, poking, slapping), and  <br/>\nsometimes people can enjoy that in small doses too.  But it needs to  <br/>\nbe mutual and it can go from fun to NOT fun in half a second.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Toddler Stuff","postDate":"1226253748","msgId":40024,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNzhqaytnYmRuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJENUU3MTM2LURGMzgtNDQ4Qi04REUwLUMyMUMzQjM2MjcwNUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40020,"nextInTopic":40026,"prevInTime":40023,"nextInTime":40025,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"... ROFLMAO!  I think you re right! ... When my husband and I transitioned into a more kid friendly world we had to drop about 90% of it.  Our kids--one of","messageBody":"<div id=\"ygrps-yiv-770949877\"><blockquote><span title=\"ireply\">&gt; Maybe that&#39;s the bad message that&#39;s getting out elsewhere in the  <br/>\n&gt; unschooling world.  Maybe some people are interpretting &quot;be your  <br/>\n&gt; child&#39;s partner&quot; to mean &quot;get down there and be mean and selfish  <br/>\n&gt; together!&quot;<br/>\n<br/>\n </span></blockquote>ROFLMAO!  I think you&#39;re right!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Sarcasm is funny sometimes.  Some people get stuck there, and then  <br/>\n&gt; they&#39;re not fun to be around.  It&#39;s cynicism and negativity turned to  <br/>\n&gt; humor, but it&#39;s still cynical and negative. Sarcasm isn&#39;t kindness.   <br/>\n&gt; It&#39;s not peace.  It&#39;s not respect.<br/>\n&gt; <br/>\n </span></blockquote>When my husband and I transitioned into a more kid friendly world we had to drop about <br/>\n90% of it.  Our kids--one of whom has always had a very sophisticated sense of humor--DID <br/>\nNOT like it at all--they didn&#39;t have the more adult context of the world to &quot;get it&quot; and they <br/>\nfelt like we&#39;d left them behind, or like we were having a joke at their expense, which, in a <br/>\nway, we were.  <br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226247710","msgId":40020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJENUU3MTM2LURGMzgtNDQ4Qi04REUwLUMyMUMzQjM2MjcwNUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmNXQ3aSs3cWhxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmNXQ3aSs3cWhxQGVHcm91cHMuY29tPg=="},"prevInTopic":40019,"nextInTopic":40024,"prevInTime":40019,"nextInTime":40021,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-Sometimes I feel like I need a script but my drafts aren t cutting it. I say Sammy doesn t like it when you hurt her feelings Stella says but she does","messageBody":"<div id=\"ygrps-yiv-814560972\">-=-Sometimes I feel like I need a script but my drafts aren&#39;t cutting  <br/>\nit. I say &quot;Sammy doesn&#39;t<br/>\nlike it when you hurt her feelings&quot; Stella says &quot;but she does like  <br/>\nit&quot; (she is half kidding but<br/>\nhalf not). I say &quot;Don&#39;t hit the baby (not mine, I&#39;d go nuts with  <br/>\ntwo :)) and she says &quot;but I<br/>\nhave to hit the baby&quot;. So I just make sure she doesn&#39;t get close  <br/>\nenough to hit the baby<br/>\nand that&#39;s about where it stalls out...-=-<br/>\n<br/>\nWould you like for someone to say to you &quot;Sammy doesn&#39;t like it when  <br/>\nyou hurt her feelings&quot;?<br/>\n<br/>\nIf your daughter is verbal and analytical enough to know what that  <br/>\nmeans, then she already knows about hurt feelings.  You could say  <br/>\n&quot;That wasn&#39;t nice.&quot;  You could say &quot;There were other things you could  <br/>\nhave done.&quot;<br/>\n<br/>\nWhat she does reflects on you.  I think when she&#39;s old enough to  <br/>\nunderstand that, you could tell her so.  What she does reflects on  <br/>\nher dad.  If you&#39;re going to be part of her team, she should know  <br/>\nthere&#39;s a team, not that she  has a team of minders who make sure she  <br/>\nhas the freedom to do whatever she damned well pleased no matter  <br/>\nwhere she is.<br/>\n<br/>\n<br/>\n<br/>\nMaybe that&#39;s the bad message that&#39;s getting out elsewhere in the  <br/>\nunschooling world.  Maybe some people are interpretting &quot;be your  <br/>\nchild&#39;s partner&quot; to mean &quot;get down there and be mean and selfish  <br/>\ntogether!&quot;<br/>\n<br/>\n-=-Also she&#39;s very little and we&#39;re very sarcastic -=-<br/>\n<br/>\nThe alarms went off at that one.<br/>\n<br/>\nSarcasm is funny sometimes.  Some people get stuck there, and then  <br/>\nthey&#39;re not fun to be around.  It&#39;s cynicism and negativity turned to  <br/>\nhumor, but it&#39;s still cynical and negative. Sarcasm isn&#39;t kindness.   <br/>\nIt&#39;s not peace.  It&#39;s not respect.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226245533","msgId":40019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5MTRFNDUwLUYzOUQtNDBFOS04Q0M1LTlFRERGNTA4OTI3QkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmNXJqaSszNGJkQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmNXJqaSszNGJkQGVHcm91cHMuY29tPg=="},"prevInTopic":40015,"nextInTopic":40020,"prevInTime":40018,"nextInTime":40020,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-I ll buy Stella some M&M s and myself an organic version and we ll binge together!-=- Why binge? Eat one.  Eat it slowly.  You might or might not want","messageBody":"<div id=\"ygrps-yiv-1106184110\">-=-I&#39;ll buy<br/>\nStella some M&M&#39;s and myself an organic version and we&#39;ll binge  <br/>\ntogether!-=-<br/>\n<br/>\n<br/>\n<br/>\nWhy binge?<br/>\n<br/>\nEat one.  Eat it slowly.  You might or might not want another one.   <br/>\nYou could spit that first one out.  Make every decision a real one.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226242455","msgId":40015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFEMUI4Qjk5LTRGQjMtNDg0Mi04NDI0LTgxRTk4MTIxNDQyM0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmNXJvNStiYmRpQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmNXJvNStiYmRpQGVHcm91cHMuY29tPg=="},"prevInTopic":40012,"nextInTopic":40019,"prevInTime":40014,"nextInTime":40016,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-I think there is a middle ground.-=- Joanna wrote that and it reminds me of this article on balance which might help: http://sandradodd.com/balance -=-Dead","messageBody":"<div id=\"ygrps-yiv-2025019219\">-=-I think there is a middle ground.-=-<br/>\nJoanna wrote that and it reminds me of this article on balance which  <br/>\nmight help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<br/>\n-=-Dead on :) You&#39;re the winner of the Gemini Cricket contest!!! -=-<br/>\n<br/>\nYelena liked what Joanna wrote too, but this is tie-in trivia.  It&#39;s  <br/>\nJiminy Cricket.  He&#39;s not a two-faced Greek-based cricket, he&#39;s J.C.  <br/>\nBefore the Disney Pinocchio movie ever came out, &quot;Jiminy Cricket&quot; was  <br/>\na euphemism for &quot;Jesus Christ.&quot;  It was NOT okay for kids to say  <br/>\n&quot;Jesus CHRIST!&quot; but it was okay to say &quot;Jiminy Cricket.&quot;<br/>\n<br/>\nIn the story, Jiminy Cricket is conscience and integrity.    Gemini  <br/>\nand Janus and other dualism symbols are in a whole &#39;nother realm.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":339346350,"authorName":"yelenakaplan","from":"&quot;yelenakaplan&quot; &lt;kaplanyel@...&gt;","profile":"yelenakaplan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226209330","msgId":40012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNXQ3aSs3cWhxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdmNXJvNStiYmRpQGVHcm91cHMuY29tPg=="},"prevInTopic":40010,"nextInTopic":40015,"prevInTime":40011,"nextInTime":40013,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-827229397\">&lt;&lt;If that&#39;s true, then maybe your daughter is not getting the message of<br/>\ncompromise and care for others, and isn&#39;t being supported in how to act so that others<br/>\ncan interact with her positively&gt;&gt;<br/>\n<br/>\nAnd only cuz I&#39;ve never seen it first hand so it&#39;s VERY difficult to model, support etc...  My <br/>\nhusband and I have agreed that compromise is just when nobody gets what they want -- <br/>\nit&#39;s a running joke at our house cuz neither one of us has the actual concept down.  <br/>\nSometimes I feel like I need a script but my drafts aren&#39;t cutting it.  I say &quot;Sammy doesn&#39;t <br/>\nlike it when you hurt her feelings&quot;  Stella says &quot;but she does like it&quot; (she is half kidding but <br/>\nhalf not).  I say &quot;Don&#39;t hit the baby (not mine, I&#39;d go nuts with two :)) and she says &quot;but I <br/>\nhave to hit the baby&quot;.  So I just make sure she doesn&#39;t get close enough to hit the baby <br/>\nand that&#39;s about where it stalls out...<br/>\n<br/>\nAlso she&#39;s very little and we&#39;re very sarcastic and have a weird sense of humor at our <br/>\nhouse.  We kid around a lot and that doesn&#39;t translate into the outside world at all.  I know <br/>\nshe&#39;s confused when something we laugh about at home is taken in a different way when <br/>\nwe&#39;re out.<br/>\n<br/>\nKeep analyzing please :)<br/>\n<br/>\nYelena</div>","specialLinks":[]},{"userId":339346350,"authorName":"yelenakaplan","from":"&quot;yelenakaplan&quot; &lt;kaplanyel@...&gt;","profile":"yelenakaplan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226208322","msgId":40010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNXM4MitpcmV2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdmNXJvNStiYmRpQGVHcm91cHMuY29tPg=="},"prevInTopic":40009,"nextInTopic":40012,"prevInTime":40009,"nextInTime":40011,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"Dead on :)  You re the winner of the Gemini Cricket contest!!! LOL Thanks! Yelena ... gone ... hard ... she ... relevant ... some ... extremes ... you- ... ","messageBody":"<div id=\"ygrps-yiv-627768458\">Dead on :)  You&#39;re the winner of the Gemini Cricket contest!!! LOL<br/>\n<br/>\nThanks!<br/>\n<br/>\nYelena<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Joanna Murphy&quot; &lt;ridingmom@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; &gt; I meant the things she does to warrant being called spoiled are things that aren&#39;t <br/>\n&gt; hurting <br/>\n&gt; &gt; anyone or her. <br/>\n&gt; <br/>\n&gt; As I read through your posts I find myself thinking that perhaps in your effort to allow <br/>\n&gt; your daughter to fully express who she is without compromise or judgement, you&#39;ve <br/>\ngone <br/>\n&gt; to an extreme.  Maybe you were raised on the other end of the extreme, where it was <br/>\nhard <br/>\n&gt; for you to express who you are, and you don&#39;t want your daughter to be stifled in the <br/>\n&gt; same way?  If that&#39;s true, then maybe your daughter is not getting the message of <br/>\n&gt; compromise and care for others, and isn&#39;t being supported in how to act so that others <br/>\n&gt; can interact with her positively.<br/>\n&gt; <br/>\n&gt; I&#39;ve realized that my daughter has such an extremely strong sense of herself that what <br/>\nshe <br/>\n&gt; needs more support with is how to compromise and empathize with others.  There is no <br/>\n&gt; fear that she will be weak and accommodating--it&#39;s just not in her makeup or her <br/>\n&gt; upbringing!  I used to be more concerned with making sure that she didn&#39;t have to <br/>\n&gt; compromise &quot;too much&quot; but have realized that that thinking isn&#39;t really current or <br/>\nrelevant <br/>\n&gt; to who SHE is--it&#39;s more relevant to me!  My MIL jokes about how it&#39;s o.k.--we can stop <br/>\n&gt; her Assertiveness Training now.  LOL<br/>\n&gt; <br/>\n&gt; It seems like maybe there is some balance missing in the relationhip.  If your family is <br/>\n&gt; expressing that they think she is &quot;spoiled,&quot; then they are observing something, and you <br/>\n&gt; can either discount it (which may be warranted, I don&#39;t know) but may also serve as <br/>\nsome <br/>\n&gt; information you can use (if they are seeing something worth paying attention to) to help <br/>\n&gt; you re-establish balance.<br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; Do I just work on not feeling uncomfortable with their judging me for &#39;letting her get <br/>\n&gt; away <br/>\n&gt; &gt; with stuff&#39; or do I try and get her to eat desert after dinner and hold her hand up the <br/>\n&gt; &gt; stairs, and talk her into cleaning up?  Is there a middle ground?  I still think in <br/>\nextremes <br/>\n&gt; &gt; sometimes (any links you can think of on the websites?)<br/>\n&gt; <br/>\n&gt; I think there is a middle ground.  It could be that your daughter is picking up on your <br/>\n&gt; resistance to your family and that&#39;s why it takes her so long to get out of her bad mood, <br/>\n&gt; and why she seems (from what you&#39;ve said about not letting Grandma touch her) to be <br/>\n&gt; fairly resistant to them.  She is taking her cues about interacting with the family from <br/>\nyou-<br/>\n&gt; -you provide the context for her.  So rather than focusing on who is going to &quot;win&quot; <br/>\nabout <br/>\n&gt; her behavior, you could focus on whether you are still feeling like the &quot;little girl.&quot;  It <br/>\nseems <br/>\n&gt; like there might be a power struggle going on and your daughter is getting caught in <br/>\nthe <br/>\n&gt; middle, and is therefore not able to come to the situation with an open heart.  If it&#39;s a <br/>\n&gt; choice, she&#39;s siding with Mom--hands down.<br/>\n&gt; <br/>\n&gt; I may be off-base--they were just some impressions that I got.<br/>\n&gt; <br/>\n&gt; Joanna<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226207813","msgId":40001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNXJvNStiYmRpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdmNWJqMSt1ZjI0QGVHcm91cHMuY29tPg=="},"prevInTopic":39992,"nextInTopic":40009,"prevInTime":40000,"nextInTime":40002,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"... hurting ... As I read through your posts I find myself thinking that perhaps in your effort to allow your daughter to fully express who she is without","messageBody":"<div id=\"ygrps-yiv-988419717\"><blockquote><span title=\"ireply\">&gt; I meant the things she does to warrant being called spoiled are things that aren&#39;t <br/>\n </span></blockquote>hurting <br/>\n<blockquote><span title=\"ireply\"> &gt; anyone or her. <br/>\n<br/>\n </span></blockquote>As I read through your posts I find myself thinking that perhaps in your effort to allow <br/>\nyour daughter to fully express who she is without compromise or judgement, you&#39;ve gone <br/>\nto an extreme.  Maybe you were raised on the other end of the extreme, where it was hard <br/>\nfor you to express who you are, and you don&#39;t want your daughter to be stifled in the <br/>\nsame way?  If that&#39;s true, then maybe your daughter is not getting the message of <br/>\ncompromise and care for others, and isn&#39;t being supported in how to act so that others <br/>\ncan interact with her positively.<br/>\n<br/>\nI&#39;ve realized that my daughter has such an extremely strong sense of herself that what she <br/>\nneeds more support with is how to compromise and empathize with others.  There is no <br/>\nfear that she will be weak and accommodating--it&#39;s just not in her makeup or her <br/>\nupbringing!  I used to be more concerned with making sure that she didn&#39;t have to <br/>\ncompromise &quot;too much&quot; but have realized that that thinking isn&#39;t really current or relevant <br/>\nto who SHE is--it&#39;s more relevant to me!  My MIL jokes about how it&#39;s o.k.--we can stop <br/>\nher Assertiveness Training now.  LOL<br/>\n<br/>\nIt seems like maybe there is some balance missing in the relationhip.  If your family is <br/>\nexpressing that they think she is &quot;spoiled,&quot; then they are observing something, and you <br/>\ncan either discount it (which may be warranted, I don&#39;t know) but may also serve as some <br/>\ninformation you can use (if they are seeing something worth paying attention to) to help <br/>\nyou re-establish balance.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Do I just work on not feeling uncomfortable with their judging me for &#39;letting her get <br/>\n </span></blockquote>away <br/>\n<blockquote><span title=\"ireply\"> &gt; with stuff&#39; or do I try and get her to eat desert after dinner and hold her hand up the <br/>\n&gt; stairs, and talk her into cleaning up?  Is there a middle ground?  I still think in extremes <br/>\n&gt; sometimes (any links you can think of on the websites?)<br/>\n<br/>\n </span></blockquote>I think there is a middle ground.  It could be that your daughter is picking up on your <br/>\nresistance to your family and that&#39;s why it takes her so long to get out of her bad mood, <br/>\nand why she seems (from what you&#39;ve said about not letting Grandma touch her) to be <br/>\nfairly resistant to them.  She is taking her cues about interacting with the family from you-<br/>\n-you provide the context for her.  So rather than focusing on who is going to &quot;win&quot; about <br/>\nher behavior, you could focus on whether you are still feeling like the &quot;little girl.&quot;  It seems <br/>\nlike there might be a power struggle going on and your daughter is getting caught in the <br/>\nmiddle, and is therefore not able to come to the situation with an open heart.  If it&#39;s a <br/>\nchoice, she&#39;s siding with Mom--hands down.<br/>\n<br/>\nI may be off-base--they were just some impressions that I got.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":339346350,"authorName":"yelenakaplan","from":"&quot;yelenakaplan&quot; &lt;kaplanyel@...&gt;","profile":"yelenakaplan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Toddler Stuff","postDate":"1226207666","msgId":40009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNXJqaSszNGJkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEMwQTJDODJELTc5NTctNDJDRS1CMEUwLTM0RENDRTFDMjUzM0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":40001,"nextInTopic":40010,"prevInTime":40008,"nextInTime":40010,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"Thanks for clarifying all that, makes a lot of sense actually.  Off to *not* walk all over my in laws and parents and elderly grandma :)  Leaving tomorrow and","messageBody":"<div id=\"ygrps-yiv-172166241\">Thanks for clarifying all that, makes a lot of sense actually.  Off to *not* walk all over my <br/>\nin laws and parents and elderly grandma :)  Leaving tomorrow and what a relief!  I&#39;ll buy <br/>\nStella some M&M&#39;s and myself an organic version and we&#39;ll binge together!<br/>\n<br/>\n&lt;&lt;Then you&#39;re walking all over them.  You can&#39;t go to someone else&#39;s  <br/>\n<blockquote><span title=\"ireply\"> &gt; house and call all the shots. You can go and negotiate, or explain  <br/>\n&gt; what you&#39;re doing and why, or you could give her a snack.&gt;&gt;<br/>\n<br/>\n </span></blockquote>See?  I wouldn&#39;t have though of it that way, but that&#39;s exactly how they see it I bet.  I <br/>\nthought my kid, my call... I&#39;ll stick to going with the flow -- I&#39;ve got my hands full with my <br/>\ndeschooling, the kiddo, and keeping track of sanity.  Explaining parenting my methods to <br/>\nRussian grandparents (think &#39;cry it out&#39; in a 4 week old) is going to have to come at a later <br/>\ndate :)  They are actually a bit more enlightened than that now (Nikitin family lived off the <br/>\ngrid and my mom read about them when I was little) but the  mentality is still there.<br/>\n<br/>\nAnd while driving around today it dawned on me that while I thought I let go of all my <br/>\nfood issues -- obviously I&#39;m not buying M&M&#39;s and cookies and if I did she wouldn&#39;t binge <br/>\non them at grandma&#39;s!  Doi! (Stella&#39;s word)  Reading your response was no surprise then :)  <br/>\nI thought -- she can have whatever she wants wherever she sees it, she hasn&#39;t asked me <br/>\nto buy them -- but now I realize that she associates grandma&#39;s house with chinese food <br/>\n(aka M&M&#39;s) and gets all bingy.  <br/>\n<br/>\n&lt;&lt;And if she&#39;s been eating M&Ms and ice cream all day, why are you<br/>\ndefending dessert before dinner anyway?&gt;&gt;<br/>\n<br/>\nDifferent houses -- my parents no candy, no stairs, yelling at grandma...  Inlaws -- when <br/>\nit&#39;s dinner time they say &#39;you can have desert after dinner&#39;,  before that it&#39;s a free for all!  <br/>\nOnce dinner starts cooking it&#39;s off limits till dinner is done.  It&#39;s the craziest thing I&#39;ve ever <br/>\nseen!  I know, my issues, but I&#39;m not surprised Stella&#39;s confused.    She knows about desert <br/>\nfrom going out to dinner with us and grandma asking her all excited like if she&#39;d like some <br/>\n-- she really thinks it&#39;s something special (grandma and by extension Stella).<br/>\n<br/>\nAnyway, I know why I&#39;m stressed now -- all the doing what feels yicky at other people&#39;s <br/>\nhouses, going against the flow.  If it feels yicky, don&#39;t do it... and have some stuff to mull <br/>\nover for next time (Feb).  <br/>\n<br/>\nWhile I&#39;m at it though... A respect others&#39; house question -- I bring my own food to my in <br/>\nlaws&#39; house because otherwise I&#39;d eat pizza pockets and miracle whip sandwiches -- is <br/>\nthat disrespectful? LOL :S  Seriously -- I know my mil feels weird about it, she <br/>\nunderstands that I grew up eating differently but still...  We spend like 4 hours at a time <br/>\nthere and I get GRUMPY if I don&#39;t eat.  and my milk supply kinda dwindles... <br/>\n<br/>\nThanks again, not crying anymore :)  Mental fog has lifted for now.<br/>\n<br/>\nYelena<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-please let me know if these issues are not unschooling issues and  <br/>\n&gt; I&#39;ll try to post on<br/>\n&gt; other groups -- so far this one has been the only no bs one where I  <br/>\n&gt; can read clear, on<br/>\n&gt; point answers and that&#39;s why I&#39;m posting here first :)-=-<br/>\n&gt; <br/>\n&gt; I don&#39;t mind, because if we&#39;re looking for the principles in what&#39;s  <br/>\n&gt; going on, it will help others who are reading too.<br/>\n&gt; <br/>\n&gt; -=-Can I tell her &#39;not right now&#39; on the sweets without stifling her?-=-<br/>\n&gt; <br/>\n&gt; I brought this up above the rest of the paragraph.<br/>\n&gt; <br/>\n&gt; I think the answer is &quot;no.&quot;  You could ask the grandma not to put  <br/>\n&gt; that all out, but I wouldn&#39;t. Let it be fun and exciting.  Try to go  <br/>\n&gt; with the flow.<br/>\n&gt; <br/>\n&gt; -=-Same goes for food -- I bring her the things she usually likes to  <br/>\n&gt; eat at home, but the M&M&#39;s and cookies and ice cream at grandma&#39;s  <br/>\n&gt; call her name much louder than any protein or veggies or fruit or  <br/>\n&gt; chocolate from home. Then she&#39;s overtired and hyper. -=-<br/>\n&gt; <br/>\n&gt; Try not to blame sugar for &quot;hyper.&quot;  It&#39;s a bad, cheap trick.  Anyone  <br/>\n&gt; can be on edge in a different place.  And what&#39;s &quot;overtired&quot; got to  <br/>\n&gt; do with food?  If she doesn&#39;t like to sleep in other places, that  <br/>\n&gt; would make her tired.  If she&#39;s seeing things she&#39;s not used to, her  <br/>\n&gt; mind is running fast.  That would make her tired.  My kids were  <br/>\n&gt; always WAY  more exhausted from mental exercise than physical.   <br/>\n&gt; Running and playing might not get them exhausted, but a day of  <br/>\n&gt; learning and seeing and meeting and thinking would zonk them out for  <br/>\n&gt; HOURS.<br/>\n&gt; <br/>\n&gt; -=-My husband has the same issue at MIL&#39;s house and I remind them  <br/>\n&gt; both that they&#39;ll feel like crap afterwards but that doesn&#39;t stop  <br/>\n&gt; either one of binging on the stuff. -=-<br/>\n&gt; <br/>\n&gt; Maybe telling them they&#39;ll feel like crap feels worse than the  <br/>\n&gt; aftereffects of eating M&Ms.  And honestly, why would they binge?  If  <br/>\n&gt; you had those things available at home, they wouldn&#39;t be a big draw  <br/>\n&gt; at the grandma&#39;s house.<br/>\n&gt; <br/>\n&gt; -=-My dad gets mad at the kiddo for telling my grandma no. Stella&#39;s  <br/>\n&gt; trying to protect her space, my dad&#39;s trying to protect my grandma&#39;s  <br/>\n&gt; feelings and to me both are valid. -=-<br/>\n&gt; <br/>\n&gt; You and Stella can protect her space without your accepting her  <br/>\n&gt; yelling no at old women.<br/>\n&gt; <br/>\n&gt; -=-I could spend a visit in a room by myself with her (short bursts  <br/>\n&gt; only help for a little while<br/>\n&gt; <br/>\n&gt; and they work so we don&#39;t spend the *whole* day with them), but if we  <br/>\n&gt; visit family that&#39;s<br/>\n&gt; not an acceptable solution is it? Or is it? I&#39;m really confused  <br/>\n&gt; now... (I am still with said<br/>\n&gt; family as we speak and a bit emotional about all this). -=-<br/>\n&gt; <br/>\n&gt; Not all day, no.  But breaks once in a while to lie down and nurse?   <br/>\n&gt; Sure.  A walk around the block?  Maybe EVERYone could get out of the  <br/>\n&gt; house a couple of times a day to a place where your daughter could  <br/>\n&gt; run around.  A food place with a playground.  A park.  Then she could  <br/>\n&gt; run and be cute in neutral territory.<br/>\n&gt; <br/>\n&gt; -=-What if they are not comfortable with her for walking up and down  <br/>\n&gt; the stairs by herself and she does it all the time at home? They get  <br/>\n&gt; nervous and tell her not to or tell her to be careful in an alarming  <br/>\n&gt; voice, I tell them she does it all the time -=-<br/>\n&gt; <br/>\n&gt; She doesn&#39;t &quot;do it all the time.&quot;  Those aren&#39;t your stairs.  At my  <br/>\n&gt; house, I get to say who goes up and down my stairs.  If you want her  <br/>\n&gt; on the stairs, be right there holding her hand, if they&#39;re nervous,  <br/>\n&gt; because it&#39;s their house and their stairs.<br/>\n&gt; <br/>\n&gt; -=-What if they are not comfortable with her eating desert before  <br/>\n&gt; she&#39;s had her dinner and I think it&#39;s fine and they think she&#39;s  <br/>\n&gt; walking all over me?-=-<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; And if she&#39;s been eating M&Ms and ice cream all day, why are you  <br/>\n&gt; defending dessert before dinner anyway?<br/>\n&gt; <br/>\n&gt; -=-What if they tell her *she* should pick up a mess but I think it&#39;s  <br/>\n&gt; fine to do it for her and they think she&#39;s walking all over me?-=-<br/>\n&gt; <br/>\n&gt; If it&#39;s really that bad, don&#39;t visit, or don&#39;t visit in their home.  <br/>\n&gt; Public places.  You could help her clean the mess up.  You can&#39;t  <br/>\n&gt; change them altogether.  You could explain your thoughts when there&#39;s  <br/>\n&gt; not even a mess down, but you can&#39;t commandeer their whole  house.<br/>\n&gt; <br/>\n&gt; -=-and she is feeling hurt that her freedom is being taken away.<br/>\n&gt; <br/>\n&gt; That&#39;s when she gets whiny and angry most -- the after effects of  <br/>\n&gt; feeling this way last for<br/>\n&gt; a while too, like I said she gets stuck in a dynamic for a while.-=-<br/>\n&gt; <br/>\n&gt; Why does she even SEE &quot;dessert&quot;?   Do you &quot;do dessert&quot; at your  <br/>\n&gt; house?  Why?  We just don&#39;t.  There are meals. And at the end of the  <br/>\n&gt; meal, that&#39;s the end of the meal.  And somewhere in the house  <br/>\n&gt; there&#39;s  undoubtedly cake or ice cream or something, but that&#39;s a  <br/>\n&gt; whole separate thing from meals.  At the end of meals, kids aren&#39;t  <br/>\n&gt; expecting to get sweets, nor looking forward to sweets.  That&#39;s a  <br/>\n&gt; conditioning thing, and a tradition of reward.  I&#39;d just avoid it  <br/>\n&gt; (but then I never started with it).<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Toddler Stuff","postDate":"1226193477","msgId":39992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwQTJDODJELTc5NTctNDJDRS1CMEUwLTM0RENDRTFDMjUzM0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmNWJqMSt1ZjI0QGVHcm91cHMuY29tPg==","referencesHeader":"PGdmNWJqMSt1ZjI0QGVHcm91cHMuY29tPg=="},"prevInTopic":39987,"nextInTopic":40001,"prevInTime":39991,"nextInTime":39993,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-please let me know if these issues are not unschooling issues and I ll try to post on other groups -- so far this one has been the only no bs one where I ","messageBody":"<div id=\"ygrps-yiv-718721188\">-=-please let me know if these issues are not unschooling issues and  <br/>\nI&#39;ll try to post on<br/>\nother groups -- so far this one has been the only no bs one where I  <br/>\ncan read clear, on<br/>\npoint answers and that&#39;s why I&#39;m posting here first :)-=-<br/>\n<br/>\nI don&#39;t mind, because if we&#39;re looking for the principles in what&#39;s  <br/>\ngoing on, it will help others who are reading too.<br/>\n<br/>\n-=-Can I tell her &#39;not right now&#39; on the sweets without stifling her?-=-<br/>\n<br/>\nI brought this up above the rest of the paragraph.<br/>\n<br/>\nI think the answer is &quot;no.&quot;  You could ask the grandma not to put  <br/>\nthat all out, but I wouldn&#39;t. Let it be fun and exciting.  Try to go  <br/>\nwith the flow.<br/>\n<br/>\n-=-Same goes for food -- I bring her the things she usually likes to  <br/>\neat at home, but the M&M&#39;s and cookies and ice cream at grandma&#39;s  <br/>\ncall her name much louder than any protein or veggies or fruit or  <br/>\nchocolate from home. Then she&#39;s overtired and hyper. -=-<br/>\n<br/>\nTry not to blame sugar for &quot;hyper.&quot;  It&#39;s a bad, cheap trick.  Anyone  <br/>\ncan be on edge in a different place.  And what&#39;s &quot;overtired&quot; got to  <br/>\ndo with food?  If she doesn&#39;t like to sleep in other places, that  <br/>\nwould make her tired.  If she&#39;s seeing things she&#39;s not used to, her  <br/>\nmind is running fast.  That would make her tired.  My kids were  <br/>\nalways WAY  more exhausted from mental exercise than physical.   <br/>\nRunning and playing might not get them exhausted, but a day of  <br/>\nlearning and seeing and meeting and thinking would zonk them out for  <br/>\nHOURS.<br/>\n<br/>\n-=-My husband has the same issue at MIL&#39;s house and I remind them  <br/>\nboth that they&#39;ll feel like crap afterwards but that doesn&#39;t stop  <br/>\neither one of binging on the stuff. -=-<br/>\n<br/>\nMaybe telling them they&#39;ll feel like crap feels worse than the  <br/>\naftereffects of eating M&Ms.  And honestly, why would they binge?  If  <br/>\nyou had those things available at home, they wouldn&#39;t be a big draw  <br/>\nat the grandma&#39;s house.<br/>\n<br/>\n-=-My dad gets mad at the kiddo for telling my grandma no. Stella&#39;s  <br/>\ntrying to protect her space, my dad&#39;s trying to protect my grandma&#39;s  <br/>\nfeelings and to me both are valid. -=-<br/>\n<br/>\nYou and Stella can protect her space without your accepting her  <br/>\nyelling no at old women.<br/>\n<br/>\n-=-I could spend a visit in a room by myself with her (short bursts  <br/>\nonly help for a little while<br/>\n<br/>\nand they work so we don&#39;t spend the *whole* day with them), but if we  <br/>\nvisit family that&#39;s<br/>\nnot an acceptable solution is it? Or is it? I&#39;m really confused  <br/>\nnow... (I am still with said<br/>\nfamily as we speak and a bit emotional about all this). -=-<br/>\n<br/>\nNot all day, no.  But breaks once in a while to lie down and nurse?   <br/>\nSure.  A walk around the block?  Maybe EVERYone could get out of the  <br/>\nhouse a couple of times a day to a place where your daughter could  <br/>\nrun around.  A food place with a playground.  A park.  Then she could  <br/>\nrun and be cute in neutral territory.<br/>\n<br/>\n-=-What if they are not comfortable with her for walking up and down  <br/>\nthe stairs by herself and she does it all the time at home? They get  <br/>\nnervous and tell her not to or tell her to be careful in an alarming  <br/>\nvoice, I tell them she does it all the time -=-<br/>\n<br/>\nShe doesn&#39;t &quot;do it all the time.&quot;  Those aren&#39;t your stairs.  At my  <br/>\nhouse, I get to say who goes up and down my stairs.  If you want her  <br/>\non the stairs, be right there holding her hand, if they&#39;re nervous,  <br/>\nbecause it&#39;s their house and their stairs.<br/>\n<br/>\n-=-What if they are not comfortable with her eating desert before  <br/>\nshe&#39;s had her dinner and I think it&#39;s fine and they think she&#39;s  <br/>\nwalking all over me?-=-<br/>\n<br/>\nThen you&#39;re walking all over them.  You can&#39;t go to someone else&#39;s  <br/>\nhouse and call all the shots. You can go and negotiate, or explain  <br/>\nwhat you&#39;re doing and why, or you could give her a snack.<br/>\n<br/>\nAnd if she&#39;s been eating M&Ms and ice cream all day, why are you  <br/>\ndefending dessert before dinner anyway?<br/>\n<br/>\n-=-What if they tell her *she* should pick up a mess but I think it&#39;s  <br/>\nfine to do it for her and they think she&#39;s walking all over me?-=-<br/>\n<br/>\nIf it&#39;s really that bad, don&#39;t visit, or don&#39;t visit in their home.  <br/>\nPublic places.  You could help her clean the mess up.  You can&#39;t  <br/>\nchange them altogether.  You could explain your thoughts when there&#39;s  <br/>\nnot even a mess down, but you can&#39;t commandeer their whole  house.<br/>\n<br/>\n-=-and she is feeling hurt that her freedom is being taken away.<br/>\n<br/>\nThat&#39;s when she gets whiny and angry most -- the after effects of  <br/>\nfeeling this way last for<br/>\na while too, like I said she gets stuck in a dynamic for a while.-=-<br/>\n<br/>\nWhy does she even SEE &quot;dessert&quot;?   Do you &quot;do dessert&quot; at your  <br/>\nhouse?  Why?  We just don&#39;t.  There are meals. And at the end of the  <br/>\nmeal, that&#39;s the end of the meal.  And somewhere in the house  <br/>\nthere&#39;s  undoubtedly cake or ice cream or something, but that&#39;s a  <br/>\nwhole separate thing from meals.  At the end of meals, kids aren&#39;t  <br/>\nexpecting to get sweets, nor looking forward to sweets.  That&#39;s a  <br/>\nconditioning thing, and a tradition of reward.  I&#39;d just avoid it  <br/>\n(but then I never started with it).<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":339346350,"authorName":"yelenakaplan","from":"&quot;yelenakaplan&quot; &lt;kaplanyel@...&gt;","profile":"yelenakaplan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226191265","msgId":39987,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNWJqMSt1ZjI0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDZBOUY1MjI1LTQwREEtNDNGRS04NUU0LTFGNUY0NjBBREFCRkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":39971,"nextInTopic":39992,"prevInTime":39986,"nextInTime":39988,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"Disclosure:  Russian is my first language so some Russian grammar and syntax still creep into my writing on a regular basis.  Think of the phrase:  you think","messageBody":"<div id=\"ygrps-yiv-365954980\">Disclosure:  Russian is my first language so some Russian grammar and syntax still creep <br/>\ninto my writing on a regular basis.  Think of the phrase:  &quot;you think I should what?!&quot; and <br/>\nyou&#39;ll understand the run on sentences and overuse of pronouns.  Hopefully I&#39;m being <br/>\nclearer this time...<br/>\n<br/>\n<br/>\nRephrase: -=-... tries to keep negotiating, sometimes while screaming, sometimes while <br/>\nwhining.-=-<br/>\n<br/>\nWhat I should have said was:  She still makes rational and logical arguments while <br/>\nscreaming and whining.  She is attempting to explain her position while losing her cool at <br/>\nthe same time -- and I usually take her in the other room when she&#39;s obviously trying to <br/>\ntell me something and it&#39;s not coming out quite as composed as others are used to.   I do <br/>\nsee this as a good thing because she&#39;s *really* trying to get her point across.  <br/>\n<br/>\n&lt;&lt;If I say &quot;screaming and whining mean she&#39;s unhappy,&quot; then I worry  <br/>\n that people reading might think I mean &quot;do anything to stop the  <br/>\n screaming and whining,&quot; but what I mean is figure out at home, in  <br/>\n peaceful moments, why the communications aren&#39;t going better, and  <br/>\n improve that. &gt;&gt;.<br/>\n<br/>\nI do a lot &#39;do anything to stop the screaming and whining&#39;, and am trying to break away <br/>\nfrom that pattern.  I also know why communications aren&#39;t going better in the case of <br/>\nbeing around our family, I just haven&#39;t been able to come up with alternatives that <br/>\n*always* -- she can&#39;t sleep around unfamiliar surroundings unless she&#39;s exhausted, she <br/>\ngets overtired and the only way to calm her down is to leave the place we&#39;re at or go to a <br/>\nprivate room and play there.  She can&#39;t fall asleep even in the car most of the time unless <br/>\nshe&#39;s dead tired (evening time usually).  Same goes for food -- I bring her the things she <br/>\nusually likes to eat at home, but the M&M&#39;s and cookies and ice cream at grandma&#39;s call <br/>\nher name much louder than any protein or veggies or fruit or chocolate from home.  Then <br/>\nshe&#39;s overtired and hyper.   Can I tell her &#39;not right now&#39; on the sweets without stifling her?  <br/>\nMy husband has the same issue at MIL&#39;s house and I remind them both that they&#39;ll feel like <br/>\ncrap afterwards but that doesn&#39;t stop either one of binging on the stuff.  <br/>\n<br/>\nAnother thing is that she gets &#39;stuck&#39; on a certain interaction.  My grandma speaks only <br/>\nRussian and Stella doesn&#39;t understand a word of what she says most of the time.  My <br/>\ngrandma also asks a lot of questions.  Questions + Stella usually = &#39;NO&#39; so she&#39;s made <br/>\nsome association with my grandma and the word &#39;NO&#39; even if a question is a harmless one <br/>\nor there is no question at all.  Whenever my grandma comes near her or tries to touch her <br/>\nStella yells &quot;NO&quot;.   I&#39;ve asked my grandma politely to respect Stella&#39;s requests for space but <br/>\nshe has a short term memory issue and forgets.  My dad gets mad at the kiddo for telling <br/>\nmy grandma no.  Stella&#39;s trying to protect her space, my dad&#39;s trying to protect my <br/>\ngrandma&#39;s feelings and to me both are valid.  Stella asks for me to take her to a quiet spot <br/>\nto nurse which I do...<br/>\n<br/>\nI could spend a visit in a room by myself with her (short bursts only help for a little while <br/>\nand they work so we don&#39;t spend the *whole* day with them), but if we visit family that&#39;s <br/>\nnot an acceptable solution is it?  Or is it?  I&#39;m really confused now...  (I am still with said <br/>\nfamily as we speak and a bit emotional about all this).    <br/>\n<br/>\n&lt;&lt; Practice at home figuring out how to communicate  <br/>\n before the whining and screaming start--how to know they  might be  <br/>\n coming and avoid them, or to help the child (even a young child)  <br/>\n express herself differently.&gt;&gt;<br/>\n<br/>\nWill do...  Like I said at home things are easier and I can focus on prevention techniques, <br/>\nmaybe a play about grandma&#39;s house or something... (any other practical creative <br/>\nsuggestions?) We&#39;re obsessed with puppets over here :)<br/>\n<br/>\n&lt;&lt;Why do you think it&#39;s not hurting anyone else for her to scream and whine?<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Why do you think it&#39;s not hurting her for other people to decide they  <br/>\n&gt; don&#39;t want to be around screaming and whining?&gt;&gt;<br/>\n<br/>\n </span></blockquote>I meant the things she does to warrant being called spoiled are things that aren&#39;t hurting <br/>\nanyone or her.  I think I cut and pasted the post a couple of times and that sentence ended <br/>\nup in the wrong part of the paragraph.<br/>\n<br/>\nWhat if they are not comfortable with her for walking up and down the stairs by herself <br/>\nand she does it all the time at home?  They get nervous and tell her not to or tell her to be <br/>\ncareful in an alarming voice, I tell them she does it all the time and they think I&#39;m letting <br/>\nher walk all over me?   What if they are not comfortable with her eating desert before she&#39;s <br/>\nhad her dinner and I think it&#39;s fine and they think she&#39;s walking all over me?  What if they <br/>\ntell her *she* should pick up a mess but I think it&#39;s fine to do it for her and they think <br/>\nshe&#39;s walking all over me?  That&#39;s the situation where I &#39;get in trouble&#39; as in I don&#39;t know <br/>\nwhat to do -- I start telling her no it&#39;s not ok to eat desert here first, no it makes grandma <br/>\nnervous that she&#39;s walking up the stairs by herself, grandpa &#39;needs&#39; her to pick up the <br/>\nmess herself.  (These are just examples, but very typical of the things I&#39;m talking about)  <br/>\nStella knows what she&#39;s capable of, she knows she has a sweet tooth and desert is more <br/>\nappealing at the moment, and she is feeling hurt that her freedom is being taken away.  <br/>\nThat&#39;s when she gets whiny and angry most -- the after effects of feeling this way last for <br/>\na while too, like I said she gets stuck in a dynamic for a while.<br/>\n<br/>\nDo I just work on not feeling uncomfortable with their judging me for &#39;letting her get away <br/>\nwith stuff&#39; or do I try and get her to eat desert after dinner and hold her hand up the <br/>\nstairs, and talk her into cleaning up?  Is there a middle ground?  I still think in extremes <br/>\nsometimes (any links you can think of on the websites?)<br/>\n<br/>\n<br/>\nThanks again :)<br/>\n<br/>\nYelena<br/>\n<br/>\np.s.  please let me know if these issues are not unschooling issues and I&#39;ll try to post on <br/>\nother groups -- so far this one has been the only no bs one where I can read clear, on <br/>\npoint answers and that&#39;s why I&#39;m posting here first :)</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Toddler Stuff","postDate":"1226178229","msgId":39971,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmNHVybCsxMGhiNUBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PGdmMzV0citxcDh1QGVHcm91cHMuY29tPg=="},"prevInTopic":39964,"nextInTopic":39987,"prevInTime":39970,"nextInTime":39972,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"... conventional friends ... extended periods of time ... the kid s running a ... My best suggestion is to continue getting along when you in other places.","messageBody":"<div id=\"ygrps-yiv-320142503\"><blockquote><span title=\"ireply\">&gt;Stella and I get along famously most of the time<br/>\n&gt; except when we&#39;re around my and my husband&#39;s family, and some<br/>\n </span></blockquote>conventional friends<br/>\n<blockquote><span title=\"ireply\"> &gt; (those I can avoid though :). I find that being at their houses for<br/>\n </span></blockquote>extended periods of time<br/>\n<blockquote><span title=\"ireply\"> &gt; gets very stressful for her because there&#39;s a veiled undercurrent of<br/>\n </span></blockquote>&quot;the kid&#39;s running a<br/>\n<blockquote><span title=\"ireply\"> &gt; muck and we (parents) aren&#39;t doing anything about it.<br/>\n<br/>\n </span></blockquote>My best suggestion is to continue getting along when you in other<br/>\nplaces.  The dynamics change in certain places, where the focus is on<br/>\nadult interaction, but you don&#39;t have to let that happen.  You can keep<br/>\nthe focus on your interaction with you child and poriferally interact<br/>\nwith the other adults.  It  could be as simple as sitting on the floor<br/>\nwith toys in front of you, rather than on the couch.<br/>\n<br/>\nTake breaks from even being in the same room as all the adults, go for<br/>\nquick walk abouts outside or to the kitchen to get drinks or snacks, or<br/>\nto the bathroom and check out soap and lotion.  Your parenting goal is<br/>\nto NOT have a seen and not heard child, so don&#39;t fall into that scenario<br/>\nthat creates that.  You can&#39;t have it both ways, you can&#39;t expect to<br/>\nhave a seen and not heard child and an active and ever present<br/>\ninteractiveness with your child.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My parents have mentioned<br/>\n&gt; that they think she&#39;s spoiled, whiny, etc. She&#39;s super funny, smart,<br/>\n </span></blockquote>can negotiate her<br/>\n<blockquote><span title=\"ireply\"> &gt; needs and mine, sometimes while screaming, sometimes while whining.<br/>\n<br/>\n </span></blockquote>Don&#39;t get to a point where there is screaming and whining.  I do<br/>\nunderstand that little ones get tired and overstimulated, especially in<br/>\nlarge family gatherings, so expect to be on gaurd the WHOLE time,<br/>\ncreating breaks and down time in quiet rooms.  If you are removing your<br/>\nchild from the room, other people won&#39;t see or hear her being whiney and<br/>\nscreaming.  If you are in an enclosed quiet room, they won&#39;t know how<br/>\nyou are treating your child and there won&#39;t be any issues for them to<br/>\npick apart.  What they&#39;ll see and know is that you are handling the<br/>\nsituation and that there isn&#39;t screaming and whining.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Toddler Stuff","postDate":"1226171752","msgId":39964,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBOUY1MjI1LTQwREEtNDNGRS04NUU0LTFGNUY0NjBBREFCRkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmMzV0citxcDh1QGVHcm91cHMuY29tPg==","referencesHeader":"PGdmMzV0citxcDh1QGVHcm91cHMuY29tPg=="},"prevInTopic":39957,"nextInTopic":39971,"prevInTime":39963,"nextInTime":39965,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"-=-She s super funny, smart, can negotiate her needs and mine, sometimes while screaming, sometimes while whining.-=- I don t understand what negotiate her","messageBody":"<div id=\"ygrps-yiv-1238758112\">-=-She&#39;s super funny, smart, can negotiate her<br/>\nneeds and mine, sometimes while screaming, sometimes while whining.-=-<br/>\n<br/>\nI don&#39;t understand what &quot;negotiate her needs and mine&quot; means and  <br/>\nwhether you think screaming and whining is a good thing.<br/>\n<br/>\nIf I say &quot;screaming and whining mean she&#39;s unhappy,&quot; then I worry  <br/>\nthat people reading might think I mean &quot;do anything to stop the  <br/>\nscreaming and whining,&quot; but what I mean is figure out at home, in  <br/>\npeaceful moments, why the communications aren&#39;t going better, and  <br/>\nimprove that.  Practice at home figuring out how to communicate  <br/>\nbefore the whining and screaming start--how to know they  might be  <br/>\ncoming and avoid them, or to help the child (even a young child)  <br/>\nexpress herself differently.<br/>\n<br/>\nIt won&#39;t always work, but if it *sometimes* works you&#39;re closer to  <br/>\npeace and social acceptability than if you don&#39;t even attempt it.<br/>\n<br/>\n-=-Sometimes she just wants things her way just time to leave a store/ <br/>\neat (for me)/drive for a commitment and then we get in trouble. -=-<br/>\n<br/>\nDid you leave a word out?<br/>\n<br/>\n-=-I start finding myself telling her &#39;no this is not ok here, try  <br/>\nsomething else&quot;, and come up with ideas on how to involve her in  <br/>\nsomething else. -=-<br/>\n<br/>\nWhy is that &quot;in trouble&quot;?<br/>\n<br/>\n-=-Any suggestions are appreciated here -- how do you navigate the  <br/>\n&#39;outside&#39; world?! I&#39;m not trying to train her, I&#39;m not trying make  <br/>\nher behave a certain way.-=-<br/>\n<br/>\nBe living in the outside world.  Don&#39;t have one way of being for home  <br/>\nand another whole set of problems &quot;outside.&quot;   You don&#39;t have to  <br/>\ntrying to make her behave in a certain way to be helping her  <br/>\nunderstand what ways are more acceptable to other people.  I know  <br/>\nthere are some unschoolers seeming to say say that children should  <br/>\nexpress themselves in whatever ways they want to while mother stand  <br/>\nby like serene cattle, but I think they&#39;re as wrong as can be.  Being  <br/>\na child&#39;s partner means helping them know what to do and how to be.<br/>\n<br/>\n-=-she&#39;s obviously not hurting anyone or herself, but I AM missing  <br/>\nsomething here and I can&#39;t put my finger on it...-=-<br/>\n<br/>\nWy do you think it&#39;s not hurting anyone else for her to scream and  <br/>\nwhine?<br/>\n<br/>\nWhy do you think it&#39;s not hurting her for other people to decide they  <br/>\ndon&#39;t want to be around screaming and whining?<br/>\n<br/>\nMaybe sometimes when people hear that a child shouldn&#39;t be punished  <br/>\nfor screaming and whining, they jump to the opposite of that, and  <br/>\nthink that children should be rewarded for screaming and whining (or  <br/>\nat least not discouraged from screaming and whining).<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":339346350,"authorName":"yelenakaplan","from":"&quot;yelenakaplan&quot; &lt;kaplanyel@...&gt;","profile":"yelenakaplan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Toddler Stuff","postDate":"1226119931","msgId":39957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmMzV0citxcDh1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":39964,"prevInTime":39956,"nextInTime":39958,"topicId":39957,"numMessagesInTopic":0,"msgSnippet":"Hi :) My name is Yelena and I m new to the list and not unschooling yet (two year old kiddo) but am weeding my way through the archives and need some","messageBody":"<div id=\"ygrps-yiv-258162288\">Hi :)<br/>\n<br/>\nMy name is Yelena and I&#39;m new to the list and not unschooling yet (two year old kiddo) but <br/>\nam weeding my way through the archives and need some directions (think toddler in <br/>\nunfamiliar environment type links?).  Stella and I get along famously most of the time <br/>\nexcept when we&#39;re around my and my husband&#39;s family, and some conventional friends <br/>\n(those I can avoid though :).  I find that being at their houses for extended periods of time <br/>\ngets very stressful for her because there&#39;s a veiled undercurrent of &quot;the kid&#39;s running a <br/>\nmuck and we (parents) aren&#39;t doing anything about it.  We live on opposite coasts and  <br/>\n(typed a &#39;have to&#39; here but deleted it ;)) spend chunks of time at their houses.   Now since <br/>\nit&#39;s grandparents we&#39;re talking about, they never just say &#39;no, I&#39;d like her not to do that at <br/>\nmy house&#39;, they just say yes to whatever she requests and then give looks and sighs so I <br/>\nknow that it&#39;s not a good idea.  It&#39;s as though they yes her just to see how demanding she <br/>\ncan get and then expect me to step in and tell her to cool it.  My parents have mentioned <br/>\nthat they think she&#39;s spoiled, whiny, etc.  She&#39;s super funny, smart, can negotiate her <br/>\nneeds and mine, sometimes while screaming, sometimes while whining.  Sometimes she <br/>\njust wants things her way just time to leave a store/eat (for me)/drive for a commitment <br/>\nand then we get in trouble.  I start finding myself telling her &#39;no this is not ok here, try <br/>\nsomething else&quot;, and come up with ideas on how to involve her in something else.  <br/>\n<br/>\nMy problem is that I end up playing catch up -- she senses that I&#39;m trying to get her to <br/>\nchange direction and starts NOing ideas while I desperately try to come up with ways to <br/>\nmake her happy.  Even in moments that we&#39;re not in the family members&#39; presence we&#39;re <br/>\nhaving disagreements about most mundane things, just because the precedent for <br/>\nadversarial interaction has been set.  Any suggestions are appreciated here -- how do you <br/>\nnavigate the &#39;outside&#39; world?!  I&#39;m not trying to train her, I&#39;m not trying make her behave a <br/>\ncertain way.  I really am just looking for a way we can stay on (or close to) the happy <br/>\nwavelength that we&#39;re on around unschoolers, all the while being around family.   <br/>\n<br/>\nSandra, I read the thread about gravel and mulch and how throwing it is not ok cuz it <br/>\nbelongs to someone else -- so to me this is sort of a similar situation (other people&#39;s <br/>\nhomes, belongings, food, etc.)  I just don&#39;t know how to approach this and what the <br/>\nprincipal behind it is -- she&#39;s obviously not hurting anyone or herself, but I AM missing <br/>\nsomething here and I can&#39;t put my finger on it...<br/>\n<br/>\n<br/>\nThanks!<br/>\nYelena</div>","specialLinks":[]}],"prevTopicId":40208,"nextTopicId":40196}}