{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":4261131,"authorName":"Anne Ohman","from":"&quot;Anne Ohman&quot; &lt;ohman@...&gt;","profile":"anneounschooler","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Unschooling works ESPECIALLY for special needs kids","postDate":"1045050089","msgId":58530,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNEEzMkU5LjAwMDAwMy43MzIzMUA1MTFpZj4=","referencesHeader":"PDAwMDkwMWMyZDFlZSQ0ZTZhNWJkMCQxNjAyYThjMEBTMDAyNjI5MjkyMD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":58529,"nextInTime":58531,"topicId":58530,"numMessagesInTopic":0,"msgSnippet":"It is an incorrect assumption to make a blanket statement saying that\nhigh-maintenance kids do need external structure.  My son is 12 and has\nnever been","messageBody":"<div id=\"ygrps-yiv-949173119\">It is an incorrect assumption to make a blanket statement saying that<br/>\nhigh-maintenance kids do need external structure.  My son is 12 and has<br/>\nnever been *schooled* a day in his life.  \r<br/>\n\r<br/>\nI don&#39;t want to say that he&#39;s high functioning autism because I don&#39;t see<br/>\nhim as that...but he would probably have that label if he were in school..<br/>\nor even if I were to force schoolwork on him at home.  \r<br/>\n\r<br/>\nBut he isn&#39;t and I don&#39;t.\r<br/>\n\r<br/>\nHe&#39;s free.\r<br/>\n\r<br/>\nHe&#39;s free to be completely Who He Is.  He&#39;s celebrated for his Spirit.  His<br/>\ngifts are our focus, not his limitations.\r<br/>\n\r<br/>\nBecause he&#39;s free, he is able to SHINE the way he is meant to shine.  He is<br/>\nable to learn real-life math concepts through real life.  \r<br/>\n\r<br/>\nYou can&#39;t unschool except for math...unschooling is not just what you&#39;re<br/>\nDOING...it&#39;s what you&#39;re NOT doing.  With unschooling, you&#39;re NOT damaging<br/>\nyour child&#39;s definition of learning.  It&#39;s a joyful, natural, wonderful part<br/>\nof life.  It&#39;s not something to be forced.  It&#39;s something to be discovered,<br/>\nthrough following your passions.\r<br/>\n \r<br/>\n*** Where Raymond is able to count how many toothpicks fell on the floor,<br/>\nbut a candy bar is, &quot;About a hundred dollars.&quot; That&#39;s my son. 8 means the<br/>\nsame to him as 800. \r<br/>\n\r<br/>\nNow, if he has 800 Lego blocks in front of him, and another pile with 8 Lego<br/>\nblocks, he can grasp the concept that it&#39;s bigger than the other and by how<br/>\nmuch.\r<br/>\n\r<br/>\nSo I do use Math-U-See with him.***\r<br/>\n\r<br/>\nWhy not continue to use REAL life, instead of Math-U-See.  Use<br/>\nMath-Is-Everywhere...called LIFE!!  My son has a wonderful grasp of numbers<br/>\nbecause he&#39;s never seen them as something that should be intimidated.  He<br/>\nnever saw them as something he would be quizzed about.  He finds answers to<br/>\nhis questions because he has a need and a desire to do so.\r<br/>\n\r<br/>\nPerhaps he doesn&#39;t CARE how much a candy bar costs right now.  But he will<br/>\ncare how much something costs when he&#39;s saving his money for it.  Let real<br/>\nlife teach what the children want/need to learn.\r<br/>\n\r<br/>\n***Some of us are raising various sorts of high-maintenance kids, and \r<br/>\nthey sometimes do need external structure because they aren&#39;t always \r<br/>\n(and some of them never!) able to provide it for themselves.***\r<br/>\n\r<br/>\nWhy do they need to provide structure for themselves?  What they need to do<br/>\nis to learn how to listen to their own internal structure, their own heart. <br/>\nThey don&#39;t learn what to do with someone constantly telling them.  They<br/>\nlearn from KNOWING what to do because they&#39;ve been given the opportunity of<br/>\nlistening to their own rhythm, their own heart, and following that to live<br/>\ntheir life.  \r<br/>\n\r<br/>\nWhat a gift.\r<br/>\n\r<br/>\n ***Some \r<br/>\nkids need to be held and redirected in order to read an entire book \r<br/>\n(or page).***\r<br/>\n\r<br/>\nWhy does the child NEED to read an entire book (or page)?  What is the child<br/>\nbeing made to read that he doesn&#39;t WANT to read it?\r<br/>\n\r<br/>\nMy son has a corner of our living room filled with his books.  He can be<br/>\nfound with his nose in them throughout most of the day.  Why does he love to<br/>\nread?  Because he gets to read about that which he LOVES.  He&#39;s never been<br/>\ntold he HAS to read anything.  He&#39;s been told to trust himself, trust what<br/>\nhis heart is telling him, and go with that. \r<br/>\n\r<br/>\nHe is currently reading two novels, a reference book on mythological<br/>\nmonsters, a book on working with wildlife, a bird atlas, Garfield comic<br/>\nbooks, and a book on ancient Egypt.  \r<br/>\n\r<br/>\nAll his choice.  All because he is free to follow his own heart.\r<br/>\n\r<br/>\n\r<br/>\n ***Some kids need lists of things to do to keep them from \r<br/>\nobsessing on a single topic from waking to sleep.***\r<br/>\n\r<br/>\nBelieve me...I know of what you speak!  But take that obsession and USE it. <br/>\nFollow it.  It&#39;s what they LOVE.  \r<br/>\n\r<br/>\nMonsters are my child&#39;s *thing.*  If I tried to distract him AWAY from that,<br/>\nI can&#39;t imagine what his world would be like.\r<br/>\n\r<br/>\nInstead, I trusted that he knows what&#39;s in his heart...he knows what he<br/>\nLOVES.  So we talk about the monsters (neopets characters, pokemon, his own<br/>\nmonster characters that he draws).  He draws them.  he writes stories about<br/>\nthem.  \r<br/>\n\r<br/>\nAnd because he&#39;s allowed to get his fill of his obsession, he&#39;s also able to<br/>\nLET IT GO.  He&#39;s able to expand his world and move onto other things BECAUSE<br/>\nhe&#39;s been *allowed* to obsess...not only allowed, but encouraged and<br/>\ncelebrated for his visions.\r<br/>\n\r<br/>\n\r<br/>\n ***Some kids need to \r<br/>\nbe taught, step by step, year after year, how to make the simplest \r<br/>\ndecisions.***\r<br/>\n\r<br/>\nTaught?  How?\r<br/>\n\r<br/>\nEvery time I get out of the car with my son, I know I have to tell him to be<br/>\naware of the cars coming.  I know his mind is on other things.  It&#39;s just<br/>\nsomething I do.  I don&#39;t shame him, I don&#39;t tell him over and over that this<br/>\nis something that HE needs to learn.  It&#39;s something that I have to do..<br/>\nbecause I am his mother, his protector at this point in his life.  \r<br/>\n\r<br/>\nBecause he is not shamed nor made to feel that he has SO much to learn about<br/>\nthe real world, he is learning.  Joyfully.  Happily.  Confidently.  He is<br/>\nproud of Who He Is.  He&#39;s never known any other way to be.  \r<br/>\n\r<br/>\n***Anyone with an autistic child, for example, knows that radical \r<br/>\nunschooling isn&#39;t an option.***\r<br/>\n\r<br/>\nThis is wrong to say and it is just not true.\r<br/>\n\r<br/>\nRadical unschooling is the ONLY option to save these children&#39;s lives.\r<br/>\n\r<br/>\nIf you don&#39;t think so, then you don&#39;t really know what radical unschooling<br/>\nis about.  It&#39;s not about leaving them alone...it&#39;s hard work to unschool my<br/>\nspecial needs child.\r<br/>\n\r<br/>\n***Sure, \r<br/>\nunschooling is a goal. But fact is, folks, that not all of us are \r<br/>\ngonna get there.***\r<br/>\n\r<br/>\nWhy not?  You could get there right now...today.  Go read the message boards<br/>\nat www.unschooling.com ~ read the special needs folders.  \r<br/>\n\r<br/>\n***Unschooling mail lists give me the willies. I&#39;ve got them set \r<br/>\nfor &quot;nomail&quot;, so I don&#39;t accidentially open some letter of \r<br/>\ncondemnation, where somebody gets trounced, politely or otherwise, \r<br/>\nfor not doing it &quot;the right way&quot;. I&#39;m sure I miss a lot of tips and \r<br/>\nideas that I might be able to incorporate into my family&#39;s ways of \r<br/>\nliving and learning. But some days I&#39;m just too stressed to have any \r<br/>\ntolerance toward the fanatical preachers of the Absolute Revealed \r<br/>\nTruth of unschooling.***\r<br/>\n\r<br/>\nSo why are you striving for unschooling then?  If you don&#39;t want to read<br/>\nabout how it WORKS??  Because it works...but only if you don&#39;t damage your<br/>\nchild&#39;s definition of LEARNING.  Any damage done needs to be un-done...\r<br/>\n\r<br/>\nUnschooling works ESPECIALLY for special needs kids.\r<br/>\n\r<br/>\nIf anyone wants a copy of my article that Ren referred to, please e-mail me<br/>\nand I&#39;ll send it to you.\r<br/>\n\r<br/>\nBe Well ~\r<br/>\nAnne Ohman<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":58522,"nextTopicId":58536}}