{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":73,"messages":[{"userId":248194505,"authorName":"Rod Thomas","from":"&quot;Rod Thomas&quot; &lt;rodneykathy@...&gt;","profile":"flyerkat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: putting my feet in the water","postDate":"1144944755","msgId":25172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGYwMWM2NWYxNSQxM2QyMDI0MCQ2MTAxYThjMEBTUEFNPg==","inReplyToHeader":"PGUxaGtmdSt0bTBlQGVHcm91cHMuY29tPg=="},"prevInTopic":25170,"nextInTopic":25173,"prevInTime":25171,"nextInTime":25173,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... with my kids and i just like to throw their mistakes up in their faces. No, i wouldn t hope they got cold. That s ridiculous to assume. Not wanting them to","messageBody":"<div id=\"ygrps-yiv-597716575\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;You are still making it out as though you assume i don&#39;t spend time<br/>\n </span></blockquote>with my kids and i just like to throw their mistakes up in their<br/>\nfaces. No, i wouldn&#39;t hope they got cold. That&#39;s ridiculous to assume.<br/>\nNot wanting them to be cold would be my reasoning for not wanting them<br/>\nin the pool in the first place. I just really don&#39;t appreciate that<br/>\ntype of response. I have been staying home since my first son was<br/>\nborn, and i have been an attentive parent. A window can get broken<br/>\nwhen you are in the room. And my point about being pregnant had<br/>\nnothing to do with cooking, it was an example of a way that i&#39;m<br/>\nlimited right now in what i can do with my children. My doctor would<br/>\ntell me not to lift them, that is a limitation. I don&#39;t think letting<br/>\nmyself get hit in the stomache with a baseball or bat by accident<br/>\nwould be a good idea either. I really wish you could just keep harsh<br/>\nassumptions to yourself. I want my children to learn and grow, and<br/>\neverything about my parenting does not revolve around my ego as you<br/>\nseem to assume it does. I didn&#39;t ask those questions sarcastically<br/>\njust to test the responses i would get. I asked about things that were<br/>\nreal concerns of mine yesterday when i started trying to do<br/>\nthis.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n <br/>\nI agree that Sandra and some others can be harsh, assuming, and<br/>\naccusing.  <br/>\nI try not to post very much and just read, because I get too personally<br/>\noffended.<br/>\nFlyerkat, ducking for cover<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":248194505,"authorName":"Rod Thomas","from":"&quot;Rod Thomas&quot; &lt;rodneykathy@...&gt;","profile":"flyerkat","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] putting my feet in the water","postDate":"1144941982","msgId":25170,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM2NWYwZSQ5ZjVkOThkMCQ2MTAxYThjMEBTUEFNPg==","inReplyToHeader":"PDQ0M0MxM0UxLjEwMDAyMDZAYnRvcGVud29ybGQuY29tPg=="},"prevInTopic":25161,"nextInTopic":25172,"prevInTime":25169,"nextInTime":25171,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"I don t want this to sound sarcastic because its not, but I don t see how ya ll have so much time to write these long posts and still spend most? of your","messageBody":"<div id=\"ygrps-yiv-1439564799\">I don&#39;t want this to sound sarcastic because its not, but I don&#39;t see<br/>\nhow ya&#39;ll have so much time to write these long posts and still spend<br/>\n&quot;most?&quot; of your time with your kids and know what they are up to every<br/>\nminute, in the next room.  Maybe yours are all older.  I also am very<br/>\nfrustrated trying to fit everything in and still be a &quot;mindful&quot; parent,<br/>\nbut I am trying.  I don&#39;t even have enough time to read the posts, let<br/>\nalone respond to them.<br/>\nFlyerkat, who thinks she should try an anti-anxiety drug<br/>\n <br/>\n <br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>] On Behalf Of s.waynforth<br/>\nSent: Tuesday, April 11, 2006 3:39 PM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: Re: [AlwaysLearning] putting my feet in the water<br/>\n <br/>\n<br/>\nI started going through this and responding to each point, but I <br/>\nrealized that there was an overall feel to your post, your need, your <br/>\nexhaustion that I wanted to respond to. You sound so tired. You write of<br/>\n<br/>\nbeing afraid of what will happen if you step away from timeouts and <br/>\ncountdowns to spankings. You write THEIRS in shouting capitals and write<br/>\n<br/>\ni in lower case tiny letters.<br/>\n<br/>\nYou sound so tired and so angry. When I was pregnant with Linnaea, my <br/>\nsecond child, I was tired. I was grouchy. I didn&#39;t have a lot of <br/>\npatience. I was working part time when I was pregnant which felt like <br/>\nthe only time when I got a break. And I felt horribly guilty for <br/>\nenjoying the break. For enjoying being able to go over to the cafeteria <br/>\non the Fridays when I went into the VA and get a coke and just sit at my<br/>\n<br/>\ncomputer and work without any distractions. It was lovely to be all on <br/>\nmy own. I&#39;ve never really felt that way at any other time. I&#39;ve enjoyed <br/>\nthe luxury of walking quickly to the shops or of not having to be <br/>\nslightly vigilantly aware of where everyone is when going somewhere <br/>\nelse, but I enjoyed the &quot;just me time&quot; when I was pregnant with Linnaea <br/>\nmore than I ever have before or since. I&#39;m not suggesting that you need <br/>\n&quot;me time&quot; with your pregnancy in the same way that I did, but maybe you <br/>\nare tired. Maybe, as this parasitic growth inside you gets closer and <br/>\ncloser to birth, and is taking more and more from you to support her <br/>\nlife, you have less to give to your other dependents. Maybe you need to <br/>\nschedule in your day pick me ups, little energy boosts of a banana <br/>\nmilkshake or an energy bar or 10 minutes of you and a cup of tea and <br/>\nsome cookies. Maybe you need to think about what really needs to get <br/>\ndone in a day. Maybe you could fix a bunch of freezable meals when your <br/>\nhusband is around that you could just pop in the oven or microwave for <br/>\nthe days when he isn&#39;t around, so that you don&#39;t have to choose between <br/>\nbeing with your children and standing at the stove. Maybe you could get <br/>\na crock pot and cook dinner all day and not have to spend a particular <br/>\ntime stuck to the stove. Maybe if you have to cook you could set up <br/>\nsomething for the boys to do while you are cooking, a video or a game or<br/>\n<br/>\ntime on the computer or something that would keep them entertained so <br/>\nthat you don&#39;t have to feel pulled in to many directions. Maybe you <br/>\ncould order pizza on the nights when you just can&#39;t cope anymore. Or buy<br/>\n<br/>\na few frozen ones to have as back up for when baseball was too <br/>\ndistracting to keep you standing at the stove.<br/>\n<br/>\nI don&#39;t know what you &quot;have&quot; to do. I don&#39;t know what things in your <br/>\nhouse are piling up from one day to the next. If I don&#39;t get done what I<br/>\n<br/>\nwant to on one day it doesn&#39;t feel that bad to address it the next. Are <br/>\nthere ways that you can make your required labor less intense. Buy some <br/>\nboxes on wheels to toss toys into when you need to clean up the living <br/>\nroom. Soak dishes overnight and do the dishes in the morning. Try and <br/>\nminimize how much you feel you need to do.<br/>\n<br/>\nIt isn&#39;t good that they are breaking windows or that they are breaking <br/>\nthings that are yours. Maybe if you give them something they can play <br/>\nwith in the house when they are trying to use something that will break <br/>\nor will break other things they won&#39;t respond so angrily. Simon just got<br/>\n<br/>\nan indoor frisbee &quot;called a Superang&quot; for his birthday. Pillows are <br/>\nusually pretty good, oh, Simon discovered a while ago that a tam, little<br/>\n<br/>\nround knitted hat that lies flat when it isn&#39;t worn, makes a great <br/>\nindoor frisbee. You could talk to them about why it isn&#39;t okay to play <br/>\nwith certain things in the house. Simon got this cool electronic circuit<br/>\n<br/>\nbuilding set for Christmas that has, among other things, a spinning disc<br/>\n<br/>\nthat you build a launcher for. One of the paintings in our house got <br/>\nchipped by the disc, and so it isn&#39;t something that we use in the living<br/>\n<br/>\nroom unless I&#39;ve draped a blanket over the painting.  If something is <br/>\nimportant to you that it not be broken you might want to make sure that <br/>\nit isn&#39;t accessible. If they want to go in the pool when you think it is<br/>\n<br/>\ntoo cold, get lots of towels and be prepared to warm them up, make some <br/>\nhot chocolate or give them a nice warm bath or shower when they are <br/>\ndone. Maybe you could take them to a heated indoor pool. A friend <br/>\nmentioned that a Holiday Inn near us (in Newcastle, so I don&#39;t know if <br/>\nyou can do this in the U.S.) lets you use their pool and jacuzzi for 5 <br/>\npounds a person, or something, maybe you could go there. Or maybe you <br/>\ncould book a night at a local hotel and stay over, watching new <br/>\ntelevision and swimming in the pool and enjoying the continental<br/>\nbreakfast.<br/>\n<br/>\nJuice boxes, buy more. Buy more when you go shopping so that they have <br/>\nlots and lots to drink. If you can&#39;t afford to buy more, than make that <br/>\nsomething that you talk about. Have them help you figure out what to buy<br/>\n<br/>\nat the grocery store. If they choose to splurge on the exciting new <br/>\nfoods you just got from the grocery store, that is pretty normal. All <br/>\nthe good fruit goes really quickly around here. And fresh bread is <br/>\nalways more appealing than day old bread. And when it is gone you can <br/>\nwrite it on the list for the next grocery run. At some point the thing <br/>\nthat was an exciting splurge will change. Chips last far longer than <br/>\nstrawberries around here. Chips are common, strawberries, good spring <br/>\nstrawberries, are rare, and so get eaten very, very quickly. Artichokes <br/>\nand edamame and good apple juice and soy milk at the moment are things <br/>\nthat disappear, but we have a box filled with tic tacs (cinnamon which <br/>\nI&#39;ve only found in one place here, so we bought the store out) and <br/>\nstarbursts and hohos (cadbury mini rolls really) and gum and coke bottle<br/>\n<br/>\ncandy and wine gums and a bunch of other stuff that has been there for <br/>\nat least a month and that I&#39;ll have to go through soon to throw out what<br/>\n<br/>\nis stale or melted or gross. Phish food ice cream goes pretty quickly, <br/>\nbut the Fossil Fuel just hasn&#39;t moved. But it takes a while to trust <br/>\nthat what you like will be there when you want it. And if you have <br/>\nequated being good with getting a certain treat, like juice boxes or a <br/>\ncandy bar, than those things taste of more than just a candy bar or a <br/>\njuice box. And it may take a while for that unintentional raise in value<br/>\n<br/>\nto dissipate, for food to taste like food instead of like praise or <br/>\npunishment. Linnaea is right now, this very minute, playing with her <br/>\nfriend for whom chocolate is the most amazing food. She isn&#39;t allowed <br/>\nfree access to chocolate. So when she comes over we stock up, and <br/>\nLinnaea, for whom right now, this very minute, fitting in is very <br/>\nimportant, will try and mirror her consumption of chocolate. But she <br/>\ncan&#39;t. She just doesn&#39;t need it in the same way as her friend needs it. <br/>\nSo, she eats what she can and then gets to share what she couldn&#39;t and <br/>\ndidn&#39;t want to begin with.<br/>\n<br/>\nI think, though, the first thing I would look at if I were in your shoes<br/>\n<br/>\nis how much being pregnant has made you weary. I would think about how <br/>\nbig and how heavy I felt and how feeling that way might be coloring my <br/>\nvision of the rest of the world. Being pregnant is hard work, and its <br/>\nconstant and it doesn&#39;t help you to sleep at night. Try and give <br/>\nyourself permission to let go of housework and other things right now. <br/>\nTry and take the time to breathe and relax and not feel everything <br/>\nmounting around you in some sort of Sarah Sylvia Cynthia Stout who would<br/>\n<br/>\nnot take the garbage out kind of way <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mste.uiuc.edu/courses/ci407su01/students/north/kristy/Projec\">http://www.mste.uiuc.edu/courses/ci407su01/students/north/kristy/Projec</a><br/>\nt/K-Poem-Net.html). <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n<br/>\n </span></blockquote>SPONSORED LINKS <br/>\n<br/>\nUnschooling<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=Unschooling&w1=Unschooling&w2=Attac\">http://groups.yahoo.com/gads?t=ms&k=Unschooling&w1=Unschooling&w2=Attac</a><br/>\nhment+parenting&w3=John+holt&w4=Parenting+magazine&w5=Single+parenting&c<br/>\n=5&s=104&.sig=O82AQhD_DXKdsA55u0IORA&gt;  <br/>\nAttachment<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=Attachment+parenting&w1=Unschooling\">http://groups.yahoo.com/gads?t=ms&k=Attachment+parenting&w1=Unschooling</a><br/>\n&w2=Attachment+parenting&w3=John+holt&w4=Parenting+magazine&w5=Single+pa<br/>\nrenting&c=5&s=104&.sig=mWlG37faHBsTH26WLfJbUw&gt;  parenting <br/>\nJohn<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=John+holt&w1=Unschooling&w2=Attachm\">http://groups.yahoo.com/gads?t=ms&k=John+holt&w1=Unschooling&w2=Attachm</a><br/>\nent+parenting&w3=John+holt&w4=Parenting+magazine&w5=Single+parenting&c=5<br/>\n&s=104&.sig=aXLviSaeQBQ0Koa1fFBC0w&gt;  holt <br/>\n<br/>\nParenting<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=Parenting+magazine&w1=Unschooling&w\">http://groups.yahoo.com/gads?t=ms&k=Parenting+magazine&w1=Unschooling&w</a><br/>\n2=Attachment+parenting&w3=John+holt&w4=Parenting+magazine&w5=Single+pare<br/>\nnting&c=5&s=104&.sig=1vVhu6yG9zKP6tD21Ys9qw&gt;  magazine <br/>\nSingle<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/gads?t=ms&k=Single+parenting&w1=Unschooling&w2=\">http://groups.yahoo.com/gads?t=ms&k=Single+parenting&w1=Unschooling&w2=</a><br/>\nAttachment+parenting&w3=John+holt&w4=Parenting+magazine&w5=Single+parent<br/>\ning&c=5&s=104&.sig=86a8STGJlXAgNag9XEqGWA&gt;  parenting <br/>\n <br/>\n <br/>\n  _____  <br/>\n<br/>\nYAHOO! GROUPS LINKS <br/>\n <br/>\n*          Visit your group &quot;AlwaysLearning<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning\">http://groups.yahoo.com/group/AlwaysLearning</a>&gt; &quot; on the web.<br/>\n  <br/>\n*          To unsubscribe from this group, send an email to:<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a>?subject=Unsubscribe&gt; <br/>\n  <br/>\n*          Your use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n <br/>\n  _____  <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Fear (was:  putting my feet in the water)","postDate":"1144887170","msgId":25161,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyQjNDNTJFLUI4M0MtNENGOS05QjAyLTU1MkMxRUFDRkM1MkBjb3gubmV0Pg==","inReplyToHeader":"PGUxajlzcyt0MzkxQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxajlzcyt0MzkxQGVHcm91cHMuY29tPg=="},"prevInTopic":25146,"nextInTopic":25170,"prevInTime":25160,"nextInTime":25162,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"Hi. i m going to go ahead and do a list on my blog, my SIL s and I have been talking about that anyway (we ve all got big families, we have seven, SIL1 has","messageBody":"<div id=\"ygrps-yiv-492103899\">Hi.<br/>\ni&#39;m going to go ahead and do a list on my blog, my SIL&#39;s and I have  <br/>\nbeen talking about that anyway (we&#39;ve all got big families, we have  <br/>\nseven, SIL1 has five, SIL2 has seven, SIL3 has six, and our CIL has  <br/>\neight) So give me a day, and check out the one below, the 360.yahoo  <br/>\nplace.<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 12, 2006, at 11:29 AM, lilith_pouia wrote:<br/>\n&gt;<br/>\n&gt; I would love any tips you have to share, whether emailed or posted. It<br/>\n&gt; doesn&#39;t really matter to me. I think a big part of my problem is that<br/>\n&gt; it&#39;s very hard for me to stay mentally organized when my environment<br/>\n&gt; isn&#39;t. I end up feeling like my mind is going to pieces when the house<br/>\n&gt; goes. I, as a person, definately need more structure in my life than<br/>\n&gt; my kids do for me to feel that everything is okay. </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Fear (was:  putting my feet in the water)","postDate":"1144862616","msgId":25146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMDk3MEFGLTEwRjAtNEVDRS04NDgwLTQzMzdDNTQ3NTNFNUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJEM0M5Q0I1LTY3RjAtNEE1Qi1CQzc4LUY3M0YyREFERUY3RkBjb3gubmV0Pg==","referencesHeader":"PGUxajIydSs5ZW1hQGVHcm91cHMuY29tPiA8QkQzQzlDQjUtNjdGMC00QTVCLUJDNzgtRjczRjJEQURFRjdGQGNveC5uZXQ+"},"prevInTopic":25145,"nextInTopic":25161,"prevInTime":25145,"nextInTime":25147,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... Go ahead and do it here if you re willing. Thanks! Sandra","messageBody":"<div id=\"ygrps-yiv-857085389\">On Apr 12, 2006, at 9:53 AM, Melissa wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; f you really want suggestions, or should we take up space<br/>\n&gt; on the board with it? maybe it would make a good set of posts for<br/>\n&gt; reference (Sandra, you&#39;re the list owner, what do you think?)<br/>\n<br/>\n<br/>\n </span></blockquote>Go ahead and do it here if you&#39;re willing.<br/>\n<br/>\nThanks!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":244242275,"authorName":"Joanna Wilkinson","from":"&quot;Joanna Wilkinson&quot; &lt;jbwilkinson6@...&gt;","profile":"joanna514","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Fear (was:  putting my feet in the water)","postDate":"1144860250","msgId":25145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxamFvcStpM2dmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEUxRlRobEstMDAwN0R0LTAwQHBvcC1zYXJ1cy5hdGwuc2EuZWFydGhsaW5rLm5ldD4="},"prevInTopic":25144,"nextInTopic":25146,"prevInTime":25144,"nextInTime":25146,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... felt in ... Wonderful post Janet. I really related to everything you said. It was a great way to introduce yourself! Joanna","messageBody":"<div id=\"ygrps-yiv-2114951116\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Janet&quot; &lt;jrenk@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I wanted to add my thoughts on this since you sound a lot like I&#39;ve <br/>\n </span></blockquote>felt in<br/>\n<blockquote><span title=\"ireply\"> &gt; the past.  I haven&#39;t sent an intro but will do that soon.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Wonderful post Janet.<br/>\nI really related to everything you said.<br/>\nIt was a great way to introduce yourself!<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":211613748,"authorName":"lilith_pouia","from":"&quot;lilith_pouia&quot; &lt;lilith_pouia@...&gt;","profile":"lilith_pouia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Fear (was:  putting my feet in the water)","postDate":"1144859356","msgId":25144,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxajlzcyt0MzkxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJEM0M5Q0I1LTY3RjAtNEE1Qi1CQzc4LUY3M0YyREFERUY3RkBjb3gubmV0Pg=="},"prevInTopic":25143,"nextInTopic":25145,"prevInTime":25143,"nextInTime":25145,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... I would love any tips you have to share, whether emailed or posted. It doesn t really matter to me. I think a big part of my problem is that it s very hard","messageBody":"<div id=\"ygrps-yiv-659366537\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Melissa &lt;autismhelp@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; That would be me...LOL! I appreciate the descriptive, but amazing  <br/>\n&gt; probably isn&#39;t the way it really is. Last night we ate dinner at 9pm.  <br/>\n&gt; The kids were fine, they were happy because I had spent the day with  <br/>\n&gt; them, and they had snacks to help them wait. I have a ton of  <br/>\n&gt; solutions for how to cook for a large family on a different type of  <br/>\n&gt; schedule, cleaning, etc, if you&#39;re truly interested. I can email you  <br/>\n&gt; privately if you really want suggestions, or should we take up space  <br/>\n&gt; on the board with it? maybe it would make a good set of posts for  <br/>\n&gt; reference (Sandra, you&#39;re the list owner, what do you think?)<br/>\n&gt; And I can honestly say that we have never had an instance where all  <br/>\n&gt; seven kids want something different. On days when it&#39;s heading  <br/>\n&gt; towards that, we have buffet night, with bowls and platters of  <br/>\n&gt; leftovers or taco makings or burger and hotdog stuff. My toughest  <br/>\n&gt; thing has been changing our meals to deal with a wheat allergy and a  <br/>\n&gt; corn allergy.<br/>\n&gt; Melissa<br/>\n&gt; Mom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n&gt; (2), and Avari Rose<br/>\n&gt; <br/>\n&gt; share our lives at<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On Apr 12, 2006, at 9:15 AM, lilith_pouia wrote:<br/>\n&gt; &gt; For instance, how does a woman manage to turn<br/>\n&gt; &gt; off the cooking and go play when she has seven kids that may all want<br/>\n&gt; &gt; something differnt for dinner? Not that i have seven children myself,<br/>\n&gt; &gt; but i do have two and dh to make dinner for at night, and i can see<br/>\n&gt; &gt; how solutions like pop some frozen dinners in the oven is a workable<br/>\n&gt; &gt; solution for me, for certain times, but what if everyone is crying at<br/>\n&gt; &gt; you that they all want something different, they are hungry now, and<br/>\n&gt; &gt; they don&#39;t want to let you alone long enough to make it. I can&#39;t<br/>\n&gt; &gt; imagine how an amazing lady with seven kids manages. It&#39;s not that i<br/>\n&gt; &gt; just don&#39;t want to accept the answers, it&#39;s just that i am confused,<br/>\n&gt; &gt; and afraid of how it will actually work out in practice.<br/>\n&gt;<br/>\n </span></blockquote>I would love any tips you have to share, whether emailed or posted. It<br/>\ndoesn&#39;t really matter to me. I think a big part of my problem is that<br/>\nit&#39;s very hard for me to stay mentally organized when my environment<br/>\nisn&#39;t. I end up feeling like my mind is going to pieces when the house<br/>\ngoes. I, as a person, definately need more structure in my life than<br/>\nmy kids do for me to feel that everything is okay. I&#39;ve always wanted<br/>\nto be able to get past that though. DH is a very spontaneous person,<br/>\nand he and i clash on a lot of issues because i&#39;m not. I think, plan,<br/>\nand organize, sometimes too much, and have realized through my<br/>\nmarriage that it can be quite a limitation.</div>","specialLinks":[]},{"userId":211613748,"authorName":"lilith_pouia","from":"&quot;lilith_pouia&quot; &lt;lilith_pouia@...&gt;","profile":"lilith_pouia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Fear (was:  putting my feet in the water)","postDate":"1144858833","msgId":25143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxajljaCs4MDA3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEUxRlRobEstMDAwN0R0LTAwQHBvcC1zYXJ1cy5hdGwuc2EuZWFydGhsaW5rLm5ldD4="},"prevInTopic":25142,"nextInTopic":25144,"prevInTime":25142,"nextInTime":25144,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... felt in ... assume. ... them ... you can ... you wrote. ... full-time ... We were ... liked to ... were lots ... Power ... - they ... on me to ... them. ","messageBody":"<div id=\"ygrps-yiv-69678608\">--- In AlwaysLearning@yahoogroups.com, &quot;Janet&quot; &lt;jrenk@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I wanted to add my thoughts on this since you sound a lot like I&#39;ve<br/>\n </span></blockquote>felt in<br/>\n<blockquote><span title=\"ireply\"> &gt; the past.  I haven&#39;t sent an intro but will do that soon.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; At 21:17 4/11/2006, Lilith wrote:<br/>\n&gt; &gt; &gt;You are still making it out as though you assume i don&#39;t spend time<br/>\n&gt; &gt; &gt;with my kids and i just like to throw their mistakes up in their<br/>\n&gt; &gt; &gt;faces. No, i wouldn&#39;t hope they got cold. That&#39;s ridiculous to<br/>\n </span></blockquote>assume.<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; &gt;Not wanting them to be cold would be my reasoning for not wanting<br/>\n </span></blockquote>them<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; &gt;in the pool in the first place. &gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I&#39;m not talking about you here - this is what I went through.  Maybe<br/>\n </span></blockquote>you can<br/>\n<blockquote><span title=\"ireply\"> &gt; see some of yourself here - maybe not.  I saw a lot of me in what<br/>\n </span></blockquote>you wrote.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I quit working when my oldest was 6 and her sister was 4 to be a<br/>\n </span></blockquote>full-time<br/>\n<blockquote><span title=\"ireply\"> &gt; mom.  I was home all day with them - 24/7.  They slept in our bed. <br/>\n </span></blockquote>We were<br/>\n<blockquote><span title=\"ireply\"> &gt; always together.  I did things with them - mostly always things I<br/>\n </span></blockquote>liked to<br/>\n<blockquote><span title=\"ireply\"> &gt; do.  I love books so I read to them.  I liked coloring so I colored with<br/>\n&gt; them.  I drew pictures with them.  (A lot of I&#39;s there)  But there<br/>\n </span></blockquote>were lots<br/>\n<blockquote><span title=\"ireply\"> &gt; of things they liked to do that weren&#39;t &#39;my cup of tea&#39;.  They loved<br/>\n </span></blockquote>Power<br/>\n<blockquote><span title=\"ireply\"> &gt; Rangers - I didn&#39;t.  They loved digging up bugs - I didn&#39;t.  They loved<br/>\n&gt; playing make believe games - I didn&#39;t.  But I thought that way okay<br/>\n </span></blockquote>- they<br/>\n<blockquote><span title=\"ireply\"> &gt; needed to learn to play on their own - they couldn&#39;t always depend<br/>\n </span></blockquote>on me to<br/>\n<blockquote><span title=\"ireply\"> &gt; provide entertainment.  Plus, I had a house to run, and keeping the<br/>\n&gt; household running smoothly and clean was fundamental to us being a happy<br/>\n&gt; family  But, still, I was with them all day and I did do things with<br/>\n </span></blockquote>them.<br/>\n<blockquote><span title=\"ireply\"> &gt; I was always within earshot.  But what I wasn&#39;t doing was really, truly<br/>\n&gt; engaging with them.  Even when I was reading to them or coloring<br/>\n </span></blockquote>with them,<br/>\n<blockquote><span title=\"ireply\"> &gt; my mind was on what &#39;needed to be done&#39;.  Did I take meat out of the<br/>\n&gt; freezer?  The laundry needed folded.  Dishwasher unloaded.  There wasn&#39;t<br/>\n&gt; enough hours in the day, and I was tired.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; I was there physically but not mentally.  I was pre-occupied with<br/>\n </span></blockquote>everything<br/>\n<blockquote><span title=\"ireply\"> &gt; I thought was so important, so necessary.  And you know what, kids know<br/>\n&gt; that.  I think they figured out that the housework, etc. was more<br/>\n </span></blockquote>important<br/>\n<blockquote><span title=\"ireply\"> &gt; than they were.  Of course, if asked, I would have said my kids were way<br/>\n&gt; more important than housework or whatever, but that wasn&#39;t what I was<br/>\n&gt; showing them.  I couldn&#39;t understand why they were so loud,<br/>\n </span></blockquote>rambunctious,<br/>\n<blockquote><span title=\"ireply\"> &gt; unruly, destructive.  I was there.  I was home.  I was doing the right<br/>\n&gt; thing.  I made the big sacrifice to quit a good job and stay home.  But<br/>\n&gt; being with them physically in the same house, even playing with them<br/>\n </span></blockquote>if your<br/>\n<blockquote><span title=\"ireply\"> &gt; mind is on what isn&#39;t getting done,  isn&#39;t the same as being mindfully,<br/>\n&gt; wholly present with them, truly engaging with them.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; What is fundamental to a happy, healthy family is making sure their<br/>\n </span></blockquote>needs<br/>\n<blockquote><span title=\"ireply\"> &gt; are being met.  Yes, they need fed, and clean clothes and sheets and the<br/>\n&gt; floor not so dirty you stick to it when you walk across it.  But,<br/>\n </span></blockquote>you know<br/>\n<blockquote><span title=\"ireply\"> &gt; what I found out?  Once I started putting their emotional needs, their<br/>\n&gt; feelings first - really being there for them when they need me - dinner<br/>\n&gt; still got on the table, the laundry still gets done, the floor isn&#39;t any<br/>\n&gt; dirtier than before.  It gets done.  Now if my twins (5 yrs old) need me<br/>\n&gt; while I&#39;m cooking, I put it on simmer or I put them up on the kitchen<br/>\n&gt; counter so we can talk while I finish up.  I cover the meat with foil to<br/>\n&gt; keep it warm and go see what they want to show me - those worms she<br/>\n&gt; collected right now might not be important tomorrow - they&#39;re important<br/>\n&gt; today.  Most of the work (understanding that if you&#39;re deep frying<br/>\n&gt; something, that is immediate) will wait.  But children don&#39;t.  There are<br/>\n&gt; only so many hours in a day, and we never get them back.  I&#39;m sorry for<br/>\n&gt; every hour I missed with my older ones.  I&#39;m sorry for the things<br/>\n </span></blockquote>that they<br/>\n<blockquote><span title=\"ireply\"> &gt; could have taught me, but I was too busy worrying about everything<br/>\n </span></blockquote>else that<br/>\n<blockquote><span title=\"ireply\"> &gt; could go wrong.  I&#39;m so sorry for the times I snuggled with them but<br/>\n </span></blockquote>I was<br/>\n<blockquote><span title=\"ireply\"> &gt; thinking about that damn laundry.  We&#39;re okay now.  Not perfect but<br/>\n </span></blockquote>getting<br/>\n<blockquote><span title=\"ireply\"> &gt; better all the time.  Even when they&#39;re 16 and 14 when they need<br/>\n </span></blockquote>you, they<br/>\n<blockquote><span title=\"ireply\"> &gt; need you then - not tomorrow - at that moment.  Sometimes that&#39;s at<br/>\n </span></blockquote>midnight<br/>\n<blockquote><span title=\"ireply\"> &gt; with a cup of tea and some pie crust cookies.  I just sleep later<br/>\n </span></blockquote>the next<br/>\n<blockquote><span title=\"ireply\"> &gt; morning.  (My babies are 5 now so I don&#39;t have to get up as early.)  It<br/>\n&gt; passes so fast.  What a joy it is to be able to be their partner, to<br/>\n </span></blockquote>help<br/>\n<blockquote><span title=\"ireply\"> &gt; them get where they want to go, to see the excitement on their face<br/>\n </span></blockquote>when the<br/>\n<blockquote><span title=\"ireply\"> &gt; climb the big willow tree and I&#39;m there to keep them safe so they<br/>\n </span></blockquote>can do it.<br/>\n<blockquote><span title=\"ireply\"> &gt; Such a privilege.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Anyway, this is where I&#39;ve been.  If it helps, good.  If not, please<br/>\n </span></blockquote>don&#39;t<br/>\n<blockquote><span title=\"ireply\"> &gt; be offended.  Just my ideas.<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; Janet<br/>\n&gt; <br/>\n&gt; http://xanga<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n </span></blockquote>Thank you. Your reply makes lots of sense. It seems that i get so<br/>\nmentally exhausted and worn down just trying to keep my household<br/>\nfunctioning, but i&#39;m trying to take you guys&#39; word for it that if i<br/>\nchoose to be here now with them in their world things will become<br/>\nbetter than they are right now. I am really quite a bit the way you<br/>\nare talking that you used to be. I might be reading books or playing<br/>\nwith flash cards, but i am thinking about the laundry and the dishes.<br/>\nSharing of personal experiences like this really helps.</div>","specialLinks":[]},{"userId":125460203,"authorName":"Janet","from":"&quot;Janet&quot; &lt;jrenk@...&gt;","profile":"mimmyof5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Fear (was:  putting my feet in the water)","postDate":"1144857608","msgId":25142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUxRlRobEstMDAwN0R0LTAwQHBvcC1zYXJ1cy5hdGwuc2EuZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGUxajIydSs5ZW1hQGVHcm91cHMuY29tPg=="},"prevInTopic":25141,"nextInTopic":25143,"prevInTime":25141,"nextInTime":25143,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"I wanted to add my thoughts on this since you sound a lot like I ve felt in the past.  I haven t sent an intro but will do that soon. ... I m not talking about","messageBody":"<div id=\"ygrps-yiv-1557737238\">I wanted to add my thoughts on this since you sound a lot like I&#39;ve felt in<br/>\nthe past.  I haven&#39;t sent an intro but will do that soon.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; At 21:17 4/11/2006, Lilith wrote:<br/>\n&gt; &gt;You are still making it out as though you assume i don&#39;t spend time<br/>\n&gt; &gt;with my kids and i just like to throw their mistakes up in their<br/>\n&gt; &gt;faces. No, i wouldn&#39;t hope they got cold. That&#39;s ridiculous to assume.<br/>\n&gt; &gt;Not wanting them to be cold would be my reasoning for not wanting them<br/>\n&gt; &gt;in the pool in the first place. &gt; <br/>\n<br/>\n <br/>\n<br/>\n </span></blockquote>I&#39;m not talking about you here - this is what I went through.  Maybe you can<br/>\nsee some of yourself here - maybe not.  I saw a lot of me in what you wrote.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\nI quit working when my oldest was 6 and her sister was 4 to be a full-time<br/>\nmom.  I was home all day with them - 24/7.  They slept in our bed.  We were<br/>\nalways together.  I did things with them - mostly always things I liked to<br/>\ndo.  I love books so I read to them.  I liked coloring so I colored with<br/>\nthem.  I drew pictures with them.  (A lot of I&#39;s there)  But there were lots<br/>\nof things they liked to do that weren&#39;t &#39;my cup of tea&#39;.  They loved Power<br/>\nRangers - I didn&#39;t.  They loved digging up bugs - I didn&#39;t.  They loved<br/>\nplaying make believe games - I didn&#39;t.  But I thought that way okay - they<br/>\nneeded to learn to play on their own - they couldn&#39;t always depend on me to<br/>\nprovide entertainment.  Plus, I had a house to run, and keeping the<br/>\nhousehold running smoothly and clean was fundamental to us being a happy<br/>\nfamily  But, still, I was with them all day and I did do things with them.<br/>\nI was always within earshot.  But what I wasn&#39;t doing was really, truly<br/>\nengaging with them.  Even when I was reading to them or coloring with them,<br/>\nmy mind was on what &#39;needed to be done&#39;.  Did I take meat out of the<br/>\nfreezer?  The laundry needed folded.  Dishwasher unloaded.  There wasn&#39;t<br/>\nenough hours in the day, and I was tired.<br/>\n<br/>\n <br/>\n<br/>\nI was there physically but not mentally.  I was pre-occupied with everything<br/>\nI thought was so important, so necessary.  And you know what, kids know<br/>\nthat.  I think they figured out that the housework, etc. was more important<br/>\nthan they were.  Of course, if asked, I would have said my kids were way<br/>\nmore important than housework or whatever, but that wasn&#39;t what I was<br/>\nshowing them.  I couldn&#39;t understand why they were so loud, rambunctious,<br/>\nunruly, destructive.  I was there.  I was home.  I was doing the right<br/>\nthing.  I made the big sacrifice to quit a good job and stay home.  But<br/>\nbeing with them physically in the same house, even playing with them if your<br/>\nmind is on what isn&#39;t getting done,  isn&#39;t the same as being mindfully,<br/>\nwholly present with them, truly engaging with them.<br/>\n<br/>\n <br/>\n<br/>\nWhat is fundamental to a happy, healthy family is making sure their needs<br/>\nare being met.  Yes, they need fed, and clean clothes and sheets and the<br/>\nfloor not so dirty you stick to it when you walk across it.  But, you know<br/>\nwhat I found out?  Once I started putting their emotional needs, their<br/>\nfeelings first - really being there for them when they need me - dinner<br/>\nstill got on the table, the laundry still gets done, the floor isn&#39;t any<br/>\ndirtier than before.  It gets done.  Now if my twins (5 yrs old) need me<br/>\nwhile I&#39;m cooking, I put it on simmer or I put them up on the kitchen<br/>\ncounter so we can talk while I finish up.  I cover the meat with foil to<br/>\nkeep it warm and go see what they want to show me - those worms she<br/>\ncollected right now might not be important tomorrow - they&#39;re important<br/>\ntoday.  Most of the work (understanding that if you&#39;re deep frying<br/>\nsomething, that is immediate) will wait.  But children don&#39;t.  There are<br/>\nonly so many hours in a day, and we never get them back.  I&#39;m sorry for<br/>\nevery hour I missed with my older ones.  I&#39;m sorry for the things that they<br/>\ncould have taught me, but I was too busy worrying about everything else that<br/>\ncould go wrong.  I&#39;m so sorry for the times I snuggled with them but I was<br/>\nthinking about that damn laundry.  We&#39;re okay now.  Not perfect but getting<br/>\nbetter all the time.  Even when they&#39;re 16 and 14 when they need you, they<br/>\nneed you then - not tomorrow - at that moment.  Sometimes that&#39;s at midnight<br/>\nwith a cup of tea and some pie crust cookies.  I just sleep later the next<br/>\nmorning.  (My babies are 5 now so I don&#39;t have to get up as early.)  It<br/>\npasses so fast.  What a joy it is to be able to be their partner, to help<br/>\nthem get where they want to go, to see the excitement on their face when the<br/>\nclimb the big willow tree and I&#39;m there to keep them safe so they can do it.<br/>\nSuch a privilege.<br/>\n<br/>\n <br/>\n<br/>\nAnyway, this is where I&#39;ve been.  If it helps, good.  If not, please don&#39;t<br/>\nbe offended.  Just my ideas.<br/>\n<br/>\n <br/>\n<br/>\nJanet<br/>\n<br/>\nhttp://xanga<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Fear (was:  putting my feet in the water)","postDate":"1144857230","msgId":25141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJEM0M5Q0I1LTY3RjAtNEE1Qi1CQzc4LUY3M0YyREFERUY3RkBjb3gubmV0Pg==","inReplyToHeader":"PGUxajIydSs5ZW1hQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxajIydSs5ZW1hQGVHcm91cHMuY29tPg=="},"prevInTopic":25139,"nextInTopic":25142,"prevInTime":25140,"nextInTime":25142,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"That would be me...LOL! I appreciate the descriptive, but amazing probably isn t the way it really is. Last night we ate dinner at 9pm. The kids were fine,","messageBody":"<div id=\"ygrps-yiv-1616356513\">That would be me...LOL! I appreciate the descriptive, but amazing  <br/>\nprobably isn&#39;t the way it really is. Last night we ate dinner at 9pm.  <br/>\nThe kids were fine, they were happy because I had spent the day with  <br/>\nthem, and they had snacks to help them wait. I have a ton of  <br/>\nsolutions for how to cook for a large family on a different type of  <br/>\nschedule, cleaning, etc, if you&#39;re truly interested. I can email you  <br/>\nprivately if you really want suggestions, or should we take up space  <br/>\non the board with it? maybe it would make a good set of posts for  <br/>\nreference (Sandra, you&#39;re the list owner, what do you think?)<br/>\nAnd I can honestly say that we have never had an instance where all  <br/>\nseven kids want something different. On days when it&#39;s heading  <br/>\ntowards that, we have buffet night, with bowls and platters of  <br/>\nleftovers or taco makings or burger and hotdog stuff. My toughest  <br/>\nthing has been changing our meals to deal with a wheat allergy and a  <br/>\ncorn allergy.<br/>\nMelissa<br/>\nMom to Josh (11), Breanna (8), Emily (7), Rachel (6), Sam (4), Dan  <br/>\n(2), and Avari Rose<br/>\n<br/>\nshare our lives at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://360.yahoo.com/multimomma\">http://360.yahoo.com/multimomma</a><br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 12, 2006, at 9:15 AM, lilith_pouia wrote:<br/>\n&gt; For instance, how does a woman manage to turn<br/>\n&gt; off the cooking and go play when she has seven kids that may all want<br/>\n&gt; something differnt for dinner? Not that i have seven children myself,<br/>\n&gt; but i do have two and dh to make dinner for at night, and i can see<br/>\n&gt; how solutions like pop some frozen dinners in the oven is a workable<br/>\n&gt; solution for me, for certain times, but what if everyone is crying at<br/>\n&gt; you that they all want something different, they are hungry now, and<br/>\n&gt; they don&#39;t want to let you alone long enough to make it. I can&#39;t<br/>\n&gt; imagine how an amazing lady with seven kids manages. It&#39;s not that i<br/>\n&gt; just don&#39;t want to accept the answers, it&#39;s just that i am confused,<br/>\n&gt; and afraid of how it will actually work out in practice. </span></blockquote></div>","specialLinks":[]},{"userId":211613748,"authorName":"lilith_pouia","from":"&quot;lilith_pouia&quot; &lt;lilith_pouia@...&gt;","profile":"lilith_pouia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Fear (was:  putting my feet in the water)","postDate":"1144853893","msgId":25139,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxajRpNSt0aGdlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEQ5OUQ4RDY5LTY2QTItNEQ2OS1BODY2LTY0NTZCMjYyODczN0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":25138,"nextInTopic":25141,"prevInTime":25138,"nextInTime":25140,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... Thank you.","messageBody":"<div id=\"ygrps-yiv-1496842868\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Apr 12, 2006, at 8:15 AM, lilith_pouia wrote:<br/>\n&gt; <br/>\n&gt; &gt; . I feel that<br/>\n&gt; &gt; sometimes Sandra cuts down my questioning, and lack of understanding<br/>\n&gt; &gt; as though the answer is so straightforward and simple.<br/>\n&gt; <br/>\n&gt; Shhhh....<br/>\n&gt; Don&#39;t make it about me.  Let&#39;s talk about the simple answer.<br/>\n&gt; <br/>\n&gt; The simple answer is to set your priorities so that your children  <br/>\n&gt; come first.  Not their future or imagined safety, but them NOW.   <br/>\n&gt; Feelings and communications NOW.  What do they want or need NOW?<br/>\n&gt; <br/>\n&gt; If you&#39;re living in a flurry if imagined disaster and woe, you&#39;re not  <br/>\n&gt; even here now.<br/>\n&gt; <br/>\n&gt; Simply stop the other things and be with your child directly, eyes to  <br/>\n&gt; eyes, without a thousand thoughts in your head about what else you  <br/>\n&gt; could/should/might be doing.<br/>\n&gt; <br/>\n&gt; -=-But sometimes the answers seem to<br/>\n&gt; contradict each other. For instance, how does a woman manage to turn<br/>\n&gt; off the cooking and go play when she has seven kids that may all want<br/>\n&gt; something differnt for dinner?-=-<br/>\n&gt; <br/>\n&gt; How does a circus manager turn off cooking when an elephant is loose  <br/>\n&gt; and the train is coming and the bill collector is at the door?<br/>\n&gt; <br/>\n&gt; Making up a hypothetical worse story might seem to make your own  <br/>\n&gt; situation simpler and more justifiable, but it&#39;s a way for you to do  <br/>\n&gt; something besides be with your child, directly and calmly and simply  <br/>\n&gt; attentive in the moment.<br/>\n&gt; <br/>\n&gt; -=-ut what if everyone is crying at<br/>\n&gt; you that they all want something different, they are hungry now, and<br/>\n&gt; they don&#39;t want to let you alone long enough to make it. I-=-<br/>\n&gt; <br/>\n&gt; Are they doing that?  You&#39;ve slipped into another stressful &quot;what if&quot;  <br/>\n&gt; scenario.<br/>\n&gt; <br/>\n&gt; If someone has had direct and personal attention, he won&#39;t be hungry  <br/>\n&gt; and wanting something different at the same time everyone else, the  <br/>\n&gt; imaginary seven kids, the elephant and the bill collector all want  <br/>\n&gt; something else at the same time.<br/>\n&gt; <br/>\n&gt; -=-it&#39;s just that i am confused, and afraid -=-<br/>\n&gt; <br/>\n&gt; I cut out the extra words there, which weren&#39;t about your children.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n&gt; <br/>\n&gt; There are the typical days many unschooling moms sent in.  Lots of  <br/>\n&gt; them wrote about little kids.  I don&#39;t think many of the days  <br/>\n&gt; involved automobile travel.<br/>\n&gt; <br/>\n&gt; Those are examples of how it works out in practice.<br/>\n&gt; <br/>\n&gt; -=-i feel that i benefit more from others sharing<br/>\n&gt; how they manage to do it than being told my children need me more-=-<br/>\n&gt; <br/>\n&gt; Very often people come here thinking they know what they need or what  <br/>\n&gt; will help them, only to find in retrospect that if they had stopped  <br/>\n&gt; writing so much and taken some of the earliest advice they received,  <br/>\n&gt; they would have started making progress days or weeks or months  <br/>\n&gt; earlier.  It happens frequently.<br/>\n&gt; <br/>\n&gt; -=-I already realize i need to change, that&#39;s not the part i need  <br/>\n&gt; help with.-=-<br/>\n&gt; <br/>\n&gt; That is exactly the part you need help with.<br/>\n&gt; <br/>\n&gt; -=-I need to get past my fears and<br/>\n&gt; not project them onto my children and other people.-=-<br/>\n&gt; <br/>\n&gt; That is the change you need to make.   But before you work on getting  <br/>\n&gt; past your fears, and as a part of that work, be with your children.   <br/>\n&gt;  From what you see working with them, and from the changes you see in  <br/>\n&gt; them, your fears will start to dissolve.<br/>\n&gt; <br/>\n&gt; Here are two things on how people &quot;got it,&quot; got unschooling and the  <br/>\n&gt; things they were reading but not understanding.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/gettingit\">http://sandradodd.com/unschool/gettingit</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n&gt; <br/>\n&gt; Put your children first even right now, as you&#39;re angry with me for  <br/>\n&gt; what you somehow see as keeping you from getting what you need.    <br/>\n&gt; This is about your kids, not about you, or me.  Your children need  <br/>\n&gt; you to be a gentle, peaceful, attentive, mindful way.  You can do it,  <br/>\n&gt; but not while you&#39;re arguing about whether you can do it.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt;<br/>\n </span></blockquote>Thank you.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Fear (was:  putting my feet in the water)","postDate":"1144853133","msgId":25138,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ5OUQ4RDY5LTY2QTItNEQ2OS1BODY2LTY0NTZCMjYyODczN0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGUxajIydSs5ZW1hQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxajIydSs5ZW1hQGVHcm91cHMuY29tPg=="},"prevInTopic":25136,"nextInTopic":25139,"prevInTime":25137,"nextInTime":25139,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... Shhhh.... Don t make it about me.  Let s talk about the simple answer. The simple answer is to set your priorities so that your children come first.  Not","messageBody":"<div id=\"ygrps-yiv-892290192\">On Apr 12, 2006, at 8:15 AM, lilith_pouia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; . I feel that<br/>\n&gt; sometimes Sandra cuts down my questioning, and lack of understanding<br/>\n&gt; as though the answer is so straightforward and simple.<br/>\n<br/>\n </span></blockquote>Shhhh....<br/>\nDon&#39;t make it about me.  Let&#39;s talk about the simple answer.<br/>\n<br/>\nThe simple answer is to set your priorities so that your children  <br/>\ncome first.  Not their future or imagined safety, but them NOW.   <br/>\nFeelings and communications NOW.  What do they want or need NOW?<br/>\n<br/>\nIf you&#39;re living in a flurry if imagined disaster and woe, you&#39;re not  <br/>\neven here now.<br/>\n<br/>\nSimply stop the other things and be with your child directly, eyes to  <br/>\neyes, without a thousand thoughts in your head about what else you  <br/>\ncould/should/might be doing.<br/>\n<br/>\n-=-But sometimes the answers seem to<br/>\ncontradict each other. For instance, how does a woman manage to turn<br/>\noff the cooking and go play when she has seven kids that may all want<br/>\nsomething differnt for dinner?-=-<br/>\n<br/>\nHow does a circus manager turn off cooking when an elephant is loose  <br/>\nand the train is coming and the bill collector is at the door?<br/>\n<br/>\nMaking up a hypothetical worse story might seem to make your own  <br/>\nsituation simpler and more justifiable, but it&#39;s a way for you to do  <br/>\nsomething besides be with your child, directly and calmly and simply  <br/>\nattentive in the moment.<br/>\n<br/>\n-=-ut what if everyone is crying at<br/>\nyou that they all want something different, they are hungry now, and<br/>\nthey don&#39;t want to let you alone long enough to make it. I-=-<br/>\n<br/>\nAre they doing that?  You&#39;ve slipped into another stressful &quot;what if&quot;  <br/>\nscenario.<br/>\n<br/>\nIf someone has had direct and personal attention, he won&#39;t be hungry  <br/>\nand wanting something different at the same time everyone else, the  <br/>\nimaginary seven kids, the elephant and the bill collector all want  <br/>\nsomething else at the same time.<br/>\n<br/>\n-=-it&#39;s just that i am confused, and afraid -=-<br/>\n<br/>\nI cut out the extra words there, which weren&#39;t about your children.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<br/>\nThere are the typical days many unschooling moms sent in.  Lots of  <br/>\nthem wrote about little kids.  I don&#39;t think many of the days  <br/>\ninvolved automobile travel.<br/>\n<br/>\nThose are examples of how it works out in practice.<br/>\n<br/>\n-=-i feel that i benefit more from others sharing<br/>\nhow they manage to do it than being told my children need me more-=-<br/>\n<br/>\nVery often people come here thinking they know what they need or what  <br/>\nwill help them, only to find in retrospect that if they had stopped  <br/>\nwriting so much and taken some of the earliest advice they received,  <br/>\nthey would have started making progress days or weeks or months  <br/>\nearlier.  It happens frequently.<br/>\n<br/>\n-=-I already realize i need to change, that&#39;s not the part i need  <br/>\nhelp with.-=-<br/>\n<br/>\nThat is exactly the part you need help with.<br/>\n<br/>\n-=-I need to get past my fears and<br/>\nnot project them onto my children and other people.-=-<br/>\n<br/>\nThat is the change you need to make.   But before you work on getting  <br/>\npast your fears, and as a part of that work, be with your children.   <br/>\n From what you see working with them, and from the changes you see in  <br/>\nthem, your fears will start to dissolve.<br/>\n<br/>\nHere are two things on how people &quot;got it,&quot; got unschooling and the  <br/>\nthings they were reading but not understanding.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschool/gettingit\">http://sandradodd.com/unschool/gettingit</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<br/>\nPut your children first even right now, as you&#39;re angry with me for  <br/>\nwhat you somehow see as keeping you from getting what you need.    <br/>\nThis is about your kids, not about you, or me.  Your children need  <br/>\nyou to be a gentle, peaceful, attentive, mindful way.  You can do it,  <br/>\nbut not while you&#39;re arguing about whether you can do it.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":211613748,"authorName":"lilith_pouia","from":"&quot;lilith_pouia&quot; &lt;lilith_pouia@...&gt;","profile":"lilith_pouia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Fear (was:  putting my feet in the water)","postDate":"1144851358","msgId":25136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxajIydSs5ZW1hQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcuMC4xLjAuMC4yMDA2MDQxMjA3MTUzMS4wMWI3ZGE1OEBnYWlhd29sZi5vcmc+"},"prevInTopic":25131,"nextInTopic":25138,"prevInTime":25135,"nextInTime":25137,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... You re absolutely right. I have a lot of fears, a lot of insecurities, and i m very sensitive right now. I am afraid my child will be cold in he gets in","messageBody":"<div id=\"ygrps-yiv-552736906\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, marji &lt;marji@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; At 21:17 4/11/2006, Lilith wrote:<br/>\n&gt; &gt;You are still making it out as though you assume i don&#39;t spend time<br/>\n&gt; &gt;with my kids and i just like to throw their mistakes up in their<br/>\n&gt; &gt;faces. No, i wouldn&#39;t hope they got cold. That&#39;s ridiculous to assume.<br/>\n&gt; &gt;Not wanting them to be cold would be my reasoning for not wanting them<br/>\n&gt; &gt;in the pool in the first place. I just really don&#39;t appreciate that<br/>\n&gt; &gt;type of response.<br/>\n&gt; <br/>\n&gt; This has really touched a nerve in you.  I find for me that the <br/>\n&gt; things that send me over the edge defensively are the things that <br/>\n&gt; have some truth to them.  Is it possible that you could get quiet and <br/>\n&gt; see where the truth lies.  It doesn&#39;t have to be all one way or all <br/>\n&gt; the other; it could be the speck of truth that&#39;s irritating you.  Can <br/>\n&gt; you see that?<br/>\n&gt; <br/>\n&gt; &gt;And my point about being pregnant had<br/>\n&gt; &gt;nothing to do with cooking, it was an example of a way that i&#39;m<br/>\n&gt; &gt;limited right now in what i can do with my children. My doctor would<br/>\n&gt; &gt;tell me not to lift them, that is a limitation. I don&#39;t think letting<br/>\n&gt; &gt;myself get hit in the stomache with a baseball or bat by accident<br/>\n&gt; &gt;would be a good idea either.<br/>\n&gt; <br/>\n&gt;  From this response I&#39;m getting that you&#39;ve got a lot of fear.  I <br/>\n&gt; wouldn&#39;t like to get hit with a baseball accidentally, pregnant or <br/>\n&gt; not, but I&#39;m not going to sequester myself from my son&#39;s activities <br/>\n&gt; just in case.  What kind of life would that be?!  For that matter, I <br/>\n&gt; should give up driving the car in case I get into an accident, stop <br/>\n&gt; walking up and down the stairs in case I fall, stop cooking in case I <br/>\n&gt; burn myself, stop ... well, you get the idea.  I refuse to live my <br/>\n&gt; life based on fear of what *could* happen.  Or, based on lack and <br/>\n&gt; limitation.  I don&#39;t want my son to, either.<br/>\n&gt; <br/>\n&gt; I&#39;m not trying to be facetious (I *am* facetious!). :-)  I&#39;m really <br/>\n&gt; trying to help you see how you may be operating from a place of fear <br/>\n&gt; rather than a place of joy.  Joy is way better than fear.<br/>\n&gt; <br/>\n&gt; But, you have to be willing to look at yourself and see where your <br/>\n&gt; fear is.  And then, push through it.<br/>\n&gt; <br/>\n&gt; For my whole life before my son was born I had a morbid, intense fear <br/>\n&gt; of spiders.  (In fact, as a little kid I was afraid of nearly <br/>\n&gt; everything:  dogs, cats, birds, butterflies, bees, and even feathers <br/>\n&gt; for a while.  All those fears gradually fell away as I got older, but <br/>\n&gt; the spider fear hung on.  **I guess the fear served me well.**)   It <br/>\n&gt; was intense, and even into my 30s, if I saw a little spider on the <br/>\n&gt; wall way across the room, I would freak out and I would need to have <br/>\n&gt; someone &quot;get rid of it&quot; for me (it was like I was taking a contract <br/>\n&gt; out on the poor guy, whose only crime was looking like a spider.  I <br/>\n&gt; had lots of guilt around that!).  Then, our son was born, and we <br/>\n&gt; moved into a little cottage in the woods.  Lots of spiders.  Big, big <br/>\n&gt; ones.  I began to see that fear as a luxury I couldn&#39;t afford.  I <br/>\n&gt; thought that if I was irrationally afraid of spiders, Liam could <br/>\n&gt; catch my fear like a virus!  So, I stopped.  Each time I saw a spider <br/>\n&gt; I made the conscious choice to allow my fear to move through me and <br/>\n&gt; leave.  Whenever we saw spiders or anything (I really was not that <br/>\n&gt; afraid of anything else, just spiders), like snakes or bees or some <br/>\n&gt; other creepy-crawly, we would both quietly observe it.  And, I got to <br/>\n&gt; the point where I could trap a big spider (without fear) and just <br/>\n&gt; escort the guy out of the house and into the woods.  Liam does have <br/>\n&gt; some small trepidation about spiders and bees, but nothing like what <br/>\n&gt; I had as a kid.  And, because we&#39;re together a lot, I have to <br/>\n&gt; opportunity to help him calm himself about it.<br/>\n&gt; <br/>\n&gt; I just wanted to be sure that he could see an adult living a life <br/>\n&gt; that was not based on fear.  But, I also really wanted to be a person <br/>\n&gt; who does not operate out of fear.<br/>\n&gt; <br/>\n&gt; Be well,<br/>\n&gt; Marji<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n </span></blockquote>You&#39;re absolutely right. I have a lot of fears, a lot of insecurities,<br/>\nand i&#39;m very sensitive right now. I am afraid my child will be cold in<br/>\nhe gets in the pool, afraid he will get cut if he climbs on the fence,<br/>\nand afraid of not making the right choices as a parent. You guys<br/>\nsharing your personal experiences and suggestions with me is<br/>\nbenefiting me greatly in learning to let go of fears and think<br/>\ndifferntly. For instance, i saw that they choose not to get in the<br/>\npool and played with water balloons instead stopping to come get<br/>\nwrapped in a towel when they were cold. I saw that my four year old<br/>\nclimbed on the fence over and over and didn&#39;t cut himself. And<br/>\nalthough he had three juice boxes in a row the first day he only asked<br/>\nfor one yesterday. I had a talk with dh last night about it. My son is<br/>\nno more likely to cut himself on the fence than to cut himself or<br/>\nbreak an arm for that matter, falling out of a tree, off his bike, or<br/>\noff of a tramoline. But i don&#39;t tell him not to climb trees or ride<br/>\nhis bike. My worries about his safety are still the same, but i cope<br/>\nwith them internally and watch him do what he has fun doing. I need to<br/>\nlearn to handle the things that have been less excepted in my mind the<br/>\nsame way. It&#39;s just hard to see at first that things you previously<br/>\nthought were good parenting techniques in fact are not. From my<br/>\nprevious point of view i would be being a neglectful mother to let my<br/>\nchildren do things i thought i knew better about. This is because i<br/>\ndon&#39;t want my children to suffer. It&#39;s taking time to see that they<br/>\nmay be suffering more because of the limitations i put on their lives<br/>\nto help me cope with my own fears. There are still just a lot of<br/>\nthings about this that seem confusing to me, and i feel it doesn&#39;t<br/>\nhelp when one person will just post over and over again that my kids<br/>\nneed me more. I realize they need me more. What i need help with is<br/>\nunderstanding how to do that and make it workable in life. I feel that<br/>\nsometimes Sandra cuts down my questioning, and lack of understanding<br/>\nas though the answer is so straightforward and simple. Okay, they need<br/>\nme more, i get that point. But sometimes the answers seem to<br/>\ncontradict each other. For instance, how does a woman manage to turn<br/>\noff the cooking and go play when she has seven kids that may all want<br/>\nsomething differnt for dinner? Not that i have seven children myself,<br/>\nbut i do have two and dh to make dinner for at night, and i can see<br/>\nhow solutions like pop some frozen dinners in the oven is a workable<br/>\nsolution for me, for certain times, but what if everyone is crying at<br/>\nyou that they all want something different, they are hungry now, and<br/>\nthey don&#39;t want to let you alone long enough to make it. I can&#39;t<br/>\nimagine how an amazing lady with seven kids manages. It&#39;s not that i<br/>\njust don&#39;t want to accept the answers, it&#39;s just that i am confused,<br/>\nand afraid of how it will actually work out in practice. This is new<br/>\nand strange to me and i feel that i benefit more from others sharing<br/>\nhow they manage to do it than being told my children need me more. I&#39;m<br/>\nalready trying to be here for them more and in new ways. I do greatly<br/>\naprreciate ALL of the suggestions EVERYONE has made so far that relate<br/>\nto helping me figure out how to change. I already realize i need to<br/>\nchange, that&#39;s not the part i need help with. I do think you&#39;ve put a<br/>\nfinger on a large part of it for me. I need to get past my fears and<br/>\nnot project them onto my children and other people.</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Fear (was:  putting my feet in the water)","postDate":"1144845655","msgId":25131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDQxMjA3MTUzMS4wMWI3ZGE1OEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PGUxaGtmdSt0bTBlQGVHcm91cHMuY29tPg==","referencesHeader":"PDFFQTAwNkY4LTc4REQtNDhDNS04NkFFLTNEMEE3QzMwNDRENEBzYW5kcmFkb2RkLmNvbT4gPGUxaGtmdSt0bTBlQGVHcm91cHMuY29tPg=="},"prevInTopic":25130,"nextInTopic":25136,"prevInTime":25130,"nextInTime":25132,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... This has really touched a nerve in you.  I find for me that the things that send me over the edge defensively are the things that have some truth to them.","messageBody":"<div id=\"ygrps-yiv-361983061\">At 21:17 4/11/2006, Lilith wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;You are still making it out as though you assume i don&#39;t spend time<br/>\n&gt;with my kids and i just like to throw their mistakes up in their<br/>\n&gt;faces. No, i wouldn&#39;t hope they got cold. That&#39;s ridiculous to assume.<br/>\n&gt;Not wanting them to be cold would be my reasoning for not wanting them<br/>\n&gt;in the pool in the first place. I just really don&#39;t appreciate that<br/>\n&gt;type of response.<br/>\n<br/>\n </span></blockquote>This has really touched a nerve in you.  I find for me that the <br/>\nthings that send me over the edge defensively are the things that <br/>\nhave some truth to them.  Is it possible that you could get quiet and <br/>\nsee where the truth lies.  It doesn&#39;t have to be all one way or all <br/>\nthe other; it could be the speck of truth that&#39;s irritating you.  Can <br/>\nyou see that?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And my point about being pregnant had<br/>\n&gt;nothing to do with cooking, it was an example of a way that i&#39;m<br/>\n&gt;limited right now in what i can do with my children. My doctor would<br/>\n&gt;tell me not to lift them, that is a limitation. I don&#39;t think letting<br/>\n&gt;myself get hit in the stomache with a baseball or bat by accident<br/>\n&gt;would be a good idea either.<br/>\n<br/>\n </span></blockquote> From this response I&#39;m getting that you&#39;ve got a lot of fear.  I <br/>\nwouldn&#39;t like to get hit with a baseball accidentally, pregnant or <br/>\nnot, but I&#39;m not going to sequester myself from my son&#39;s activities <br/>\njust in case.  What kind of life would that be?!  For that matter, I <br/>\nshould give up driving the car in case I get into an accident, stop <br/>\nwalking up and down the stairs in case I fall, stop cooking in case I <br/>\nburn myself, stop ... well, you get the idea.  I refuse to live my <br/>\nlife based on fear of what *could* happen.  Or, based on lack and <br/>\nlimitation.  I don&#39;t want my son to, either.<br/>\n<br/>\nI&#39;m not trying to be facetious (I *am* facetious!). :-)  I&#39;m really <br/>\ntrying to help you see how you may be operating from a place of fear <br/>\nrather than a place of joy.  Joy is way better than fear.<br/>\n<br/>\nBut, you have to be willing to look at yourself and see where your <br/>\nfear is.  And then, push through it.<br/>\n<br/>\nFor my whole life before my son was born I had a morbid, intense fear <br/>\nof spiders.  (In fact, as a little kid I was afraid of nearly <br/>\neverything:  dogs, cats, birds, butterflies, bees, and even feathers <br/>\nfor a while.  All those fears gradually fell away as I got older, but <br/>\nthe spider fear hung on.  **I guess the fear served me well.**)   It <br/>\nwas intense, and even into my 30s, if I saw a little spider on the <br/>\nwall way across the room, I would freak out and I would need to have <br/>\nsomeone &quot;get rid of it&quot; for me (it was like I was taking a contract <br/>\nout on the poor guy, whose only crime was looking like a spider.  I <br/>\nhad lots of guilt around that!).  Then, our son was born, and we <br/>\nmoved into a little cottage in the woods.  Lots of spiders.  Big, big <br/>\nones.  I began to see that fear as a luxury I couldn&#39;t afford.  I <br/>\nthought that if I was irrationally afraid of spiders, Liam could <br/>\ncatch my fear like a virus!  So, I stopped.  Each time I saw a spider <br/>\nI made the conscious choice to allow my fear to move through me and <br/>\nleave.  Whenever we saw spiders or anything (I really was not that <br/>\nafraid of anything else, just spiders), like snakes or bees or some <br/>\nother creepy-crawly, we would both quietly observe it.  And, I got to <br/>\nthe point where I could trap a big spider (without fear) and just <br/>\nescort the guy out of the house and into the woods.  Liam does have <br/>\nsome small trepidation about spiders and bees, but nothing like what <br/>\nI had as a kid.  And, because we&#39;re together a lot, I have to <br/>\nopportunity to help him calm himself about it.<br/>\n<br/>\nI just wanted to be sure that he could see an adult living a life <br/>\nthat was not based on fear.  But, I also really wanted to be a person <br/>\nwho does not operate out of fear.<br/>\n<br/>\nBe well,<br/>\nMarji<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: putting my feet in the water","postDate":"1144845065","msgId":25130,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNBNDdBMTMzLUY4MzItNDFFOC1BNTlFLUFDMEI4Q0M0RUZEQ0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGUxaHBwaCs3MXJ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGUxaHBwaCs3MXJ0QGVHcm91cHMuY29tPg=="},"prevInTopic":25129,"nextInTopic":25131,"prevInTime":25129,"nextInTime":25131,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... I don t feel insulted. I was speaking from the point of view of your children, who feel insulted. If it hurts your feelings to hear that your children need","messageBody":"<div id=\"ygrps-yiv-1067092771\">On Apr 11, 2006, at 8:48 PM, lilith_pouia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And as far as being insulting goes, i feel you are being insulting to<br/>\n&gt; me. So we both feel insulted by each other, and that isn&#39;t a matter of<br/>\n&gt; being right or wrong. Feelings are irrational processes and rational<br/>\n&gt; thought like concepts of right and wrong don&#39;t invalidate them. We are<br/>\n&gt; both valid in feeling insulted. I don&#39;t care about trying to prove<br/>\n&gt; who&#39;s right or wrong. What i would like is to talk to you about these<br/>\n&gt; issues without us insulting each other over misconceptions. I would<br/>\n&gt; like for you to understand the things i say. That&#39;s my goal, not just<br/>\n&gt; to make you feel like i&#39;m right about something and you are not.<br/>\n<br/>\n </span></blockquote>I don&#39;t feel insulted.<br/>\nI was speaking from the point of view of your children, who feel  <br/>\ninsulted.<br/>\n<br/>\nIf it hurts your feelings to hear that your children need you more,  <br/>\nthat&#39;s not a bad thing.<br/>\n<br/>\nFeelings are not irrational processes.  There are reasons that  <br/>\nchildren feel their parents are being mean or are spending more time  <br/>\ntalking at them than listening to them, or more time being mad at  <br/>\nthem than just BEING with them.<br/>\n<br/>\n-=- I don&#39;t care about trying to prove who&#39;s right or wrong.-=-<br/>\n<br/>\nI don&#39;t either.  I only care that you came to my list to ask for ways  <br/>\nto make your homelife better and that you shouldn&#39;t leave here  <br/>\nwithout lots of ideas and feedback.   What&#39;s right and true is that  <br/>\nmy kids are living peacefully.  If you want to use some of what we&#39;re  <br/>\ndoing, you&#39;re absolutely welcome to it.   It won&#39;t hurt my kids any  <br/>\nfor you to be angry and deny what&#39;s going on at your house.  It might  <br/>\nhurt your kids some, but not mine.<br/>\n<br/>\n-=- I would like for you to understand the things i say. That&#39;s my  <br/>\ngoal-=-<br/>\n<br/>\nI don&#39;t need to understand the things you say.<br/>\nYou do.<br/>\n<br/>\nA better goal might be for you to understand the things experienced  <br/>\nunschoolers on this list say, for the benefit of your family.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2523747,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: putting my feet in the water","postDate":"1144839901","msgId":25129,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0RTY5OTY3LUJFMzAtNEI5Qi1CQzZBLUMzODIyNzk3MEI5MkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGUxaHBwaCs3MXJ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGUxaHBwaCs3MXJ0QGVHcm91cHMuY29tPg=="},"prevInTopic":25126,"nextInTopic":25130,"prevInTime":25128,"nextInTime":25130,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... It will help you help yourself if step back away from the situations and not take the responses personally. No one s reading what you ve written and","messageBody":"<div id=\"ygrps-yiv-662095521\">On Apr 11, 2006, at 10:48 PM, lilith_pouia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You are reading alot into this statement that isn&#39;t there.<br/>\n<br/>\n </span></blockquote>It will help you help yourself if step back away from the situations  <br/>\nand not take the responses personally.<br/>\n<br/>\nNo one&#39;s reading what you&#39;ve written and thinking &quot;bad mommy&quot;. We&#39;re  <br/>\nlooking at situations and offering ways of responding to similar  <br/>\nsituations that will help you and your kids live more peaceful lives.<br/>\n<br/>\nPersonally I look at each post as a problem to solve. They&#39;re like  <br/>\nmath word problems to me. I&#39;m not thinking about the author, just the  <br/>\nsituation.<br/>\n<br/>\nYou will help yourself get more helpful answers if you *don&#39;t* see  <br/>\nyour goal as making a good impression but to express a problem your  <br/>\nhaving as clearly as you can so you can get responses that will help  <br/>\nwith that problem. Because that&#39;s all that anyone on this type of  <br/>\nlist really cares about: helping people find more peaceful solutions.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194790463,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: putting my feet in the water","postDate":"1144813698","msgId":25126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0M0M3ODgyLjEwMjA4MDhAc2lvLm1pZGNvLm5ldD4=","inReplyToHeader":"PGUxZ3M0OSt2MW9zQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxZ3M0OSt2MW9zQGVHcm91cHMuY29tPg=="},"prevInTopic":25125,"nextInTopic":25129,"prevInTime":25125,"nextInTime":25127,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... That realization is critical to an unschooling commitment, the figuring it out comes out of that commitment... you re in the right place to hear the things","messageBody":"<div id=\"ygrps-yiv-1995701912\">lilith_pouia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;needs to be nutured<br/>\n&gt;correctly as an individual, i&#39;m just still having trouble figuring out<br/>\n&gt;how to do that. <br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>That realization is critical to an unschooling commitment, the figuring <br/>\nit out comes out of that commitment... you&#39;re in the right place to hear <br/>\nthe things that will show you the path, you need to be brave enough to <br/>\nwalk it.  It&#39;s hard, but not impossible; worth the effort! <br/>\n~diana<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194790463,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] putting my feet in the water","postDate":"1144813390","msgId":25125,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0M0M3NzRFLjMwNjA2MDJAc2lvLm1pZGNvLm5ldD4=","inReplyToHeader":"PDNhYTBjYmI0NGFmYmY2YWI4OTFlY2ZhMGVhNzg0NzQyQGNveC5uZXQ+","referencesHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPiA8MmI0MTY2YzI5M2NlNDMzMDJmMzU1YjYyZGYxZmNhNmVAY294Lm5ldD4gPDQ0M0JFQzM2LjYwODAzMDlAc2lvLm1pZGNvLm5ldD4gPDNhYTBjYmI0NGFmYmY2YWI4OTFlY2ZhMGVhNzg0NzQyQGNveC5uZXQ+"},"prevInTopic":25124,"nextInTopic":25126,"prevInTime":25124,"nextInTime":25126,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... Actually, there may indeed be a link between toxins and behavior, I just doubt it could be at a DSM III-R level in a full, rich, unschooling environment","messageBody":"<div id=\"ygrps-yiv-2028749262\">Nancy Wooton wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It&#39;s really easy to dismiss any possibility that <br/>\n&gt;unschooled kids could have behavioral problems related to physical <br/>\n&gt;conditions because studies are always done using the far-more numerous <br/>\n&gt;school kids.  <br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>Actually, there may indeed be a link between toxins and behavior, I just <br/>\ndoubt it could be at a DSM III-R level in a full, rich, unschooling <br/>\nenvironment with a mindful parent present. <br/>\nI found allergens that affected Hayden&#39;s behavior, we discussed them.  <br/>\nWhen he&#39;s offered, he either knowingly exposes himself and we deal with <br/>\nit (yellow food coloring makes him susceptible to symptoms from <br/>\nheadaches [which lead to/mask as crabbiness if mom&#39;s not alert/aware] to <br/>\nbedwetting) or he turns it down. <br/>\nThis isn&#39;t the original topic/toxin, but it is another example of where <br/>\nparenting styles really do make a difference in behavioral studies and <br/>\nespecially with boys between those ages (7-12) -- I&#39;ve seen lots of boys <br/>\nbetween those ages and, indeed, there are HUGE differences between <br/>\nschooled & unschooled.  Not a judgment, an observation. <br/>\n<br/>\n~diana<br/>\n[the same observation is available to you this September at the Live & <br/>\nLearn Conference!]<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211613748,"authorName":"lilith_pouia","from":"&quot;lilith_pouia&quot; &lt;lilith_pouia@...&gt;","profile":"lilith_pouia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: putting my feet in the water","postDate":"1144810097","msgId":25124,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxaHBwaCs3MXJ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDBEMEQzODMwLUZGMkEtNEQ2RC04RTc2LUUxNzQ2QTQwM0I1OUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":25121,"nextInTopic":25125,"prevInTime":25123,"nextInTime":25125,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... Here is an example of you making an incorrect assumption: You want to discover TWO WEEKS after something is broken that it s lying in your own yard in","messageBody":"<div id=\"ygrps-yiv-2059879478\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Apr 11, 2006, at 7:17 PM, lilith_pouia wrote:<br/>\n&gt; <br/>\n&gt; &gt; You are still making it out as though you assume i don&#39;t spend time<br/>\n&gt; &gt; with my kids and i just like to throw their mistakes up in their<br/>\n&gt; &gt; faces. No, i wouldn&#39;t hope they got cold. That&#39;s ridiculous to assume.<br/>\n&gt; <br/>\n&gt; It&#39;s not ridiculous.<br/>\n&gt; <br/>\n<br/>\n&gt; I&#39;m asking you questions so that you can really examine why you&#39;ve  <br/>\n&gt; chosen to write what you&#39;ve written.<br/>\n&gt; <br/>\n&gt; You have chosen your own words.  You picked the stories to tell, the<br/>\n &gt; words to use, the tone, the punctuation, and you decided to hit &quot;send.&quot;<br/>\n&gt; <br/>\n&gt; Now stop insulting people who read what you wrote and interpret it  <br/>\n&gt; through the lens of their more gentle lives.  Telling me I&#39;m wrong  <br/>\n&gt; doesn&#39;t make me wrong.  Telling me I&#39;m wrong doesn&#39;t make you right.   <br/>\n&gt; You need to BE right, not just throw more words at it.<br/>\n&gt; <br/>\n&gt; I am not &quot;making it out as though&quot; you don&#39;t spend enough time with  <br/>\n&gt; your kids.  I have two boys, two and a half years apart in age.  I  <br/>\n&gt; know how long it takes to break a heater or a fan, and I know it  <br/>\n&gt; doesn&#39;t happen when the mom is in the room.  You want to be cooking  <br/>\n&gt; in one room while your kids are doing something peaceful and quiet  <br/>\n&gt; and safe in another room.  That&#39;s not happening.  I&#39;m not assuming  <br/>\n&gt; it&#39;s not happening, you&#39;re assuring us that it&#39;s not happening.  You  <br/>\n&gt; want to discover TWO WEEKS after something is broken that it&#39;s lying  <br/>\n&gt; in your own yard in pieces, and then get mad at your child.  You  <br/>\n&gt; didn&#39;t spend much time in your yard during two weeks, or am I making  <br/>\n&gt; a ridiculous assumption about that too?<br/>\n&gt; <br/>\n&gt; -=-A window can get broken<br/>\n&gt; when you are in the room. -=-<br/>\n&gt; <br/>\n&gt; Yes it can.  Were you in the room when any of those windows got  <br/>\n&gt; broken?  (You don&#39;t need to tell us, you need to consider whether  <br/>\n&gt; your statement &quot;A window can get broken when you are in the room&quot; has  <br/>\n&gt; anything to do with YOUR windows getting broken.<br/>\n&gt; <br/>\n&gt; -=-And my point about being pregnant had nothing to do with cooking-=-<br/>\n&gt; <br/>\n&gt; It was in the same sentence.   Like &quot;cold&quot; and &quot;pool&quot; were in the  <br/>\n&gt; same sentence.<br/>\n&gt; <br/>\n&gt; -=-I really wish you could just keep harsh assumptions to yourself.-=-<br/>\n&gt; <br/>\n&gt; For how long?  Until your kids are grown?  Until you forget that you  <br/>\n&gt; asked for help?<br/>\n&gt; <br/>\n&gt; -=-I didn&#39;t ask those questions sarcastically<br/>\n&gt; just to test the responses i would get. -=-<br/>\n&gt; <br/>\n&gt; I assumed (not ridiculously) that you asked the questions because you  <br/>\n&gt; wanted honest answers from people who might be willing to volunteer  <br/>\n&gt; to read what you wrote and freely offer you suggestions to change  <br/>\n&gt; directions.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Here is an example of you making an incorrect assumption:<br/>\n<br/>\n &quot;You want to discover TWO WEEKS after something is broken that it&#39;s<br/>\nlying in your own yard in pieces, and then get mad at your child. You  <br/>\ndidn&#39;t spend much time in your yard during two weeks, or am I making  <br/>\na ridiculous assumption about that too?&quot;<br/>\n<br/>\nIf&#39;ll you&#39;ll look back at my previous post what i said was:<br/>\n<br/>\n &quot;I bought my kids big plastic magnifying glasses and a bug house, so<br/>\nthey could observe bugs. A couple weeks later i found one of the<br/>\nmagnifying glasses destroyed in the backyard.&quot;<br/>\n<br/>\nYou are reading alot into this statement that isn&#39;t there. I never<br/>\nsaid it was broken for two weeks before i found it. I said i found it<br/>\nbroken two weeks later. For all i know it happened that day. I had<br/>\nseen the glasses in use between the time i bought them and the time i<br/>\nfound one broken. I never said i didn&#39;t. I had seen it just laying out<br/>\nthere on the table before it was broken too. One day i walked out and<br/>\nsaw it smashed all over the ground. That day was about two weeks after<br/>\ni had bought them. <br/>\n<br/>\nJust because a person doesn&#39;t state every detail of a situation<br/>\ndoesn&#39;t make it correct to imply details that aren&#39;t there.<br/>\nIt just seems to me that you do this with almost every statement i<br/>\nmake. Implying details that aren&#39;t there doesn&#39;t tell you anything<br/>\nmore truthful about me or my situation that what i have actually said<br/>\nwhether you feel there is a lack of detail or not.<br/>\n<br/>\nIf i had meant that it had been broken for two weeks and then i found<br/>\nit i would have stated it that way. But that isn&#39;t what i meant.<br/>\nThat&#39;s what you incorrectly assumed i meant.  <br/>\n<br/>\nAnd as far as being insulting goes, i feel you are being insulting to<br/>\nme. So we both feel insulted by each other, and that isn&#39;t a matter of<br/>\nbeing right or wrong. Feelings are irrational processes and rational<br/>\nthought like concepts of right and wrong don&#39;t invalidate them. We are<br/>\nboth valid in feeling insulted. I don&#39;t care about trying to prove<br/>\nwho&#39;s right or wrong. What i would like is to talk to you about these<br/>\nissues without us insulting each other over misconceptions. I would<br/>\nlike for you to understand the things i say. That&#39;s my goal, not just<br/>\nto make you feel like i&#39;m right about something and you are not.<br/>\n<br/>\nAnd to clarify, when i say you incorrectly assumed, what i mean by<br/>\nthat is that your assumption is not the truth of the way the situation<br/>\nactually happened.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: putting my feet in the water","postDate":"1144806027","msgId":25121,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBEMEQzODMwLUZGMkEtNEQ2RC04RTc2LUUxNzQ2QTQwM0I1OUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGUxaGtmdSt0bTBlQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxaGtmdSt0bTBlQGVHcm91cHMuY29tPg=="},"prevInTopic":25120,"nextInTopic":25124,"prevInTime":25120,"nextInTime":25122,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... It s not ridiculous. I m asking you questions so that you can really examine why you ve chosen to write what you ve written. You have chosen your own","messageBody":"<div id=\"ygrps-yiv-1793403295\">On Apr 11, 2006, at 7:17 PM, lilith_pouia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You are still making it out as though you assume i don&#39;t spend time<br/>\n&gt; with my kids and i just like to throw their mistakes up in their<br/>\n&gt; faces. No, i wouldn&#39;t hope they got cold. That&#39;s ridiculous to assume.<br/>\n<br/>\n </span></blockquote>It&#39;s not ridiculous.<br/>\n<br/>\nI&#39;m asking you questions so that you can really examine why you&#39;ve  <br/>\nchosen to write what you&#39;ve written.<br/>\n<br/>\nYou have chosen your own words.  You picked the stories to tell, the  <br/>\nwords to use, the tone, the punctuation, and you decided to hit &quot;send.&quot;<br/>\n<br/>\nNow stop insulting people who read what you wrote and interpret it  <br/>\nthrough the lens of their more gentle lives.  Telling me I&#39;m wrong  <br/>\ndoesn&#39;t make me wrong.  Telling me I&#39;m wrong doesn&#39;t make you right.   <br/>\nYou need to BE right, not just throw more words at it.<br/>\n<br/>\nI am not &quot;making it out as though&quot; you don&#39;t spend enough time with  <br/>\nyour kids.  I have two boys, two and a half years apart in age.  I  <br/>\nknow how long it takes to break a heater or a fan, and I know it  <br/>\ndoesn&#39;t happen when the mom is in the room.  You want to be cooking  <br/>\nin one room while your kids are doing something peaceful and quiet  <br/>\nand safe in another room.  That&#39;s not happening.  I&#39;m not assuming  <br/>\nit&#39;s not happening, you&#39;re assuring us that it&#39;s not happening.  You  <br/>\nwant to discover TWO WEEKS after something is broken that it&#39;s lying  <br/>\nin your own yard in pieces, and then get mad at your child.  You  <br/>\ndidn&#39;t spend much time in your yard during two weeks, or am I making  <br/>\na ridiculous assumption about that too?<br/>\n<br/>\n-=-A window can get broken<br/>\nwhen you are in the room. -=-<br/>\n<br/>\nYes it can.  Were you in the room when any of those windows got  <br/>\nbroken?  (You don&#39;t need to tell us, you need to consider whether  <br/>\nyour statement &quot;A window can get broken when you are in the room&quot; has  <br/>\nanything to do with YOUR windows getting broken.<br/>\n<br/>\n-=-And my point about being pregnant had nothing to do with cooking-=-<br/>\n<br/>\nIt was in the same sentence.   Like &quot;cold&quot; and &quot;pool&quot; were in the  <br/>\nsame sentence.<br/>\n<br/>\n-=-I really wish you could just keep harsh assumptions to yourself.-=-<br/>\n<br/>\nFor how long?  Until your kids are grown?  Until you forget that you  <br/>\nasked for help?<br/>\n<br/>\n-=-I didn&#39;t ask those questions sarcastically<br/>\njust to test the responses i would get. -=-<br/>\n<br/>\nI assumed (not ridiculously) that you asked the questions because you  <br/>\nwanted honest answers from people who might be willing to volunteer  <br/>\nto read what you wrote and freely offer you suggestions to change  <br/>\ndirections.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":211613748,"authorName":"lilith_pouia","from":"&quot;lilith_pouia&quot; &lt;lilith_pouia@...&gt;","profile":"lilith_pouia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: putting my feet in the water","postDate":"1144804670","msgId":25120,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxaGtmdSt0bTBlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFFQTAwNkY4LTc4REQtNDhDNS04NkFFLTNEMEE3QzMwNDRENEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":25117,"nextInTopic":25121,"prevInTime":25119,"nextInTime":25121,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... You are still making it out as though you assume i don t spend time with my kids and i just like to throw their mistakes up in their faces. No, i wouldn t","messageBody":"<div id=\"ygrps-yiv-1864413864\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Apr 11, 2006, at 8:04 AM, lilith_pouia wrote:<br/>\n&gt; <br/>\n&gt; &gt; And maybe i should find things to<br/>\n&gt; &gt; give them just so they can break them if that&#39;s what they like to do.<br/>\n&gt; <br/>\n&gt; We used to go to thrift stores and get toys that didn&#39;t really work,  <br/>\n&gt; or from garage sales, so Marty could take them apart.  Sometimes he  <br/>\n&gt; could fix them.  Sometimes he just saw what it was that didn&#39;t work,  <br/>\n&gt; and that was cool too.  Sometimes it all went in the trash.   <br/>\n&gt; Sometimes the parts were interesting, or the case of it was still  <br/>\n&gt; cute without lighting up or dinging or whatever it originally did.<br/>\n&gt; <br/>\n&gt; Try to live in the middle with how you characterize your kids and  <br/>\n&gt; think of them.  &quot;And maybe i should find things to give them just so  <br/>\n&gt; they can break them if that&#39;s what they like to do&quot; sounds like there  <br/>\n&gt; is one thing they like to do and once you&#39;ve found it you know, but  <br/>\n&gt; they will like to do 800 things.  You need to find a few every day.   <br/>\n&gt; And if they are interested in opening up an old wind-up alarm clock,  <br/>\n&gt; cool!  That doesn&#39;t mean they like to break all clocks.   You can  <br/>\n&gt; help satisfy their curiosities and keep them provided with  <br/>\n&gt; interesting things to make, touch, explore without labelling them as  <br/>\n&gt; kids who like to break things.<br/>\n&gt; <br/>\n&gt; Maybe they don&#39;t like to break things at all, except when they&#39;re  <br/>\n&gt; frustrated and angry.<br/>\n&gt; <br/>\n&gt; -=-But sometimes they just refuse my suggestions and continue being  <br/>\n&gt; high strung<br/>\n&gt; indoors. -=-<br/>\n&gt; <br/>\n&gt; &quot;High strung&quot;?<br/>\n&gt; Would that be bored and needing to move.<br/>\n&gt; Healthy, normal kids NEED to move.  They&#39;re not just being difficult  <br/>\n&gt; when they express their real need to jump and climb and run.  They&#39;re  <br/>\n&gt; not being &quot;high strung.&quot;  Think about what that really means, please,  <br/>\n&gt; if you&#39;re going to say it about your children.<br/>\n&gt; <br/>\n&gt; -=-So i have had a rule that if they won&#39;t calm down inside i<br/>\n&gt; make them go out back. They respond to this like a punishment.<br/>\n&gt; -=-<br/>\n&gt; <br/>\n&gt; It is a punishment.  It will help you sort through your feelings if  <br/>\n&gt; you will really look at what you&#39;ve been doing and what you&#39;ve been  <br/>\n&gt; calling it to make yourself feel better about all your rules.  If you  <br/>\n&gt; have a rule that says if you won&#39;t do X, you cannot have Y, that IS a  <br/>\n&gt; punishment.  Your kids are right and you&#39;re fooling yourself (and  <br/>\n&gt; trying to fool us, because you&#39;re writing things down that you  <br/>\n&gt; haven&#39;t really looked at clearly yourself).<br/>\n&gt; <br/>\n&gt; -=-It&#39;s easy to say &quot;Well why don&#39;t you go play baseball with them?&quot; I<br/>\n&gt; suppose that&#39;s possible some of the time, but solutions like that<br/>\n&gt; aren&#39;t workable in reality 100% of the time.-=-<br/>\n&gt; <br/>\n&gt; Somewhere between 0% and 100% is where you need to be, and if you&#39;re  <br/>\n&gt; not going to be with them at all, maybe send them to school where  <br/>\n&gt; they can find people to run and be with.  Seriously.  If you&#39;re going  <br/>\n&gt; to unschool you will HAVE to dedicate time and energy to it.  It&#39;s  <br/>\n&gt; not just having kids at home and ignoring them until they piss you  <br/>\n&gt; off enough to yell at them, as some people seem to believe.<br/>\n&gt; <br/>\n&gt; -=-I&#39;m currently nine months<br/>\n&gt; pregnant, and can&#39;t leave food on the stove cooking, for instance, to<br/>\n&gt; go play baseball.(My kids like to run and yell in the house when they<br/>\n&gt; know i&#39;m busy with something hard to walk away from like cooking or an<br/>\n&gt; important phone call.) -=-<br/>\n&gt; <br/>\n&gt; First, being pregnant doesn&#39;t make food cook differently.<br/>\n&gt; Maybe playing with your boys should come first and THEN cooking  <br/>\n&gt; next.  If they boys always come last, they will remain needy.<br/>\n&gt; <br/>\n&gt; -=-My kids like to run and yell in the house when they<br/>\n&gt; know i&#39;m busy with something hard to walk away from like cooking or an<br/>\n&gt; important phone call.-=-<br/>\n&gt; <br/>\n&gt; When you&#39;re ignoring them, they find ways to occupy themselves.  You  <br/>\n&gt; don&#39;t like the things they choose, so you get angry.  That wouldn&#39;t  <br/>\n&gt; have happened, though, if you hadn&#39;t ignored them in the first place.<br/>\n&gt; <br/>\n&gt; Maybe your boys should come first and THEN phone calls.<br/>\n&gt; <br/>\n&gt; -=-What do you do when your four year old wants to climb on the fence  <br/>\n&gt; and<br/>\n&gt; it is sharp at the top?-=-<br/>\n&gt; <br/>\n&gt; Find him something safe to climb on or stay right there and let him  <br/>\n&gt; climb up 2/3 of the way, not to the sharp part.<br/>\n&gt; <br/>\n&gt; -=-What do you do when your four year old wants to climb on the fence  <br/>\n&gt; and<br/>\n&gt; it is sharp at the top? I felt i NEEDED to tell him not to do it.-=-<br/>\n&gt; <br/>\n&gt; Your need was to help him do what he wanted to do and help him not  <br/>\n&gt; get hurt.  It felt like you needed to tell him no, but what you  <br/>\n&gt; needed was to keep him safe.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n&gt; <br/>\n&gt; -=-Or what if they want to drink the whole container of juice boxes in<br/>\n&gt; one day and you know they will cry for the rest of the week that there<br/>\n&gt; aren&#39;t anymore?-=-<br/>\n&gt; <br/>\n&gt; You don&#39;t &quot;know they will cry.&quot;  To set up a scenario like that and  <br/>\n&gt; then respond to it is neither being aware of your children in the  <br/>\n&gt; moment nor living now.  It&#39;s seeing the world as a mass or horrible  <br/>\n&gt; outcomes that can only be prevented by controlling the children.<br/>\n&gt; <br/>\n&gt; Somewhere between &quot;one juice box a day&quot; and &quot;Drink them all right  <br/>\n&gt; now&quot; is a nicer way to be.<br/>\n&gt; <br/>\n&gt; -=-Or what if they want to eat the things i buy<br/>\n&gt; specically for my husband&#39;s lunches at work?-=-<br/>\n&gt; <br/>\n&gt; Put those aside, put them in a brown paper bag or something, tape  <br/>\n&gt; them up, don&#39;t even let them know they&#39;re there.  Or buy enough of it  <br/>\n&gt; that they can have some and there&#39;s still enough for the work lunches.<br/>\n&gt; <br/>\n&gt; -=-If they want to play in the pool, but you know it&#39;s not warm<br/>\n&gt; enough outside should you just let them do it anyway, and hope they<br/>\n&gt; learn from it when they are cold?-=-<br/>\n&gt; <br/>\n&gt; The way you asked it sounds harsh, like you hope they&#39;re cold, and  <br/>\n&gt; you hope they learn their lesson.  What if they&#39;re not that cold?   <br/>\n&gt; What if they don&#39;t mind?<br/>\n&gt; <br/>\n&gt; My mom would be really angry when she made a dire prediction and it  <br/>\n&gt; didn&#39;t come true.  If she said &quot;You&#39;ll get sick&quot; and I didn&#39;t, she  <br/>\n&gt; was pretty grumpy.  She WANTED me to suffer.  She wanted to be right,  <br/>\n&gt; but her assertions and theories were extreme and wrong and mean.<br/>\n&gt; <br/>\n&gt; Guys swim in ice-cold water in some parts of the world.  In some  <br/>\n&gt; places they go between natural hot springs, or saunas, and ice-cold  <br/>\n&gt; water.  It&#39;s not so crazy to just want to play in a pool that would  <br/>\n&gt; be too cold for you.  Maybe they&#39;ll just want to get in a little bit  <br/>\n&gt; and get right back out.  Would you feel the need to talk to them  <br/>\n&gt; about it  if they did, and say &quot;I told you so?&quot;  If you could say  <br/>\n&gt; &quot;Okay,&quot; and then &quot;Was it fun?&quot; when they get back, that would be  <br/>\n&gt; nice.  Kids play in the snow, and then they come in to sit by a fire  <br/>\n&gt; and drink hot chocolate.  If you think it will be too cold for them,  <br/>\n&gt; maybe you could have towels to wrap up in and a nice DVD to watch  <br/>\n&gt; while they get warm.  That wouldn&#39;t be too much work, but might seem  <br/>\n&gt; like a party to them.<br/>\n&gt; <br/>\n&gt; -=-Also what do you do about them respecting YOUR things? They<br/>\n&gt; play with my stuff, and jump on my bed, climb on the car, and get into<br/>\n&gt; my husband&#39;s tools. -=-<br/>\n&gt; <br/>\n&gt; What I did was respect my children and their things from before they  <br/>\n&gt; could remember, so they&#39;ve been pretty good about my things.  You  <br/>\n&gt; can&#39;t expect kids to know what you know.  Years ago, Kirby broke the  <br/>\n&gt; hardwood pointer that was my souvenir of being a teacher. I used it  <br/>\n&gt; as a prop the first time I ever spoke at a conference.   He didn&#39;t  <br/>\n&gt; know it was any more important than any old dowel or stick around the  <br/>\n&gt; house.  I cried and he felt bad.  I didn&#39;t punish him.  It wouldn&#39;t  <br/>\n&gt; have brought the stick back, and it wouldn&#39;t have made him care more  <br/>\n&gt; about me or my things.<br/>\n&gt; <br/>\n&gt; -=-My children have broken three or four windows within<br/>\n&gt; the past year, and a ceiling fan, a floor fan and a light fixture.-=-<br/>\n&gt; <br/>\n&gt; I think you&#39;re leaving them to take care of each other too much.   <br/>\n&gt; Unschooling will work well if you do things with them, lots, or with  <br/>\n&gt; one of them, or with all of your kids.  And fewer things will get  <br/>\n&gt; broken if you&#39;re there and they have something better to do.<br/>\n&gt; <br/>\n&gt; -=-That&#39;s aside from the books, toys and videos i throw away every  <br/>\n&gt; time i<br/>\n&gt; clean their room.-=-<br/>\n&gt; <br/>\n&gt; Do you throw away things that aren&#39;t broken?  Maybe they don&#39;t  <br/>\n&gt; respect your things because you don&#39;t respect their things.<br/>\n&gt; <br/>\n&gt; -=-We have had a rule that if it&#39;s not yours don&#39;t play with it. I  <br/>\n&gt; don&#39;t know what to<br/>\n&gt; do about that.-=-<br/>\n&gt; <br/>\n&gt; Too many rules.  There&#39;s a link up above that looks like it&#39;s about  <br/>\n&gt; rules but it&#39;s about principles.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt;<br/>\n </span></blockquote>You are still making it out as though you assume i don&#39;t spend time<br/>\nwith my kids and i just like to throw their mistakes up in their<br/>\nfaces. No, i wouldn&#39;t hope they got cold. That&#39;s ridiculous to assume.<br/>\nNot wanting them to be cold would be my reasoning for not wanting them<br/>\nin the pool in the first place. I just really don&#39;t appreciate that<br/>\ntype of response. I have been staying home since my first son was<br/>\nborn, and i have been an attentive parent. A window can get broken<br/>\nwhen you are in the room. And my point about being pregnant had<br/>\nnothing to do with cooking, it was an example of a way that i&#39;m<br/>\nlimited right now in what i can do with my children. My doctor would<br/>\ntell me not to lift them, that is a limitation. I don&#39;t think letting<br/>\nmyself get hit in the stomache with a baseball or bat by accident<br/>\nwould be a good idea either. I really wish you could just keep harsh<br/>\nassumptions to yourself. I want my children to learn and grow, and<br/>\neverything about my parenting does not revolve around my ego as you<br/>\nseem to assume it does. I didn&#39;t ask those questions sarcastically<br/>\njust to test the responses i would get. I asked about things that were<br/>\nreal concerns of mine yesterday when i started trying to do this.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] putting my feet in the water","postDate":"1144800062","msgId":25117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFRjgwMDc1LTNEMzQtNDAxNi1CMTZCLTM0MENBNzg5MDRGREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDJiNDE2NmMyOTNjZTQzMzAyZjM1NWI2MmRmMWZjYTZlQGNveC5uZXQ+","referencesHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPiA8MmI0MTY2YzI5M2NlNDMzMDJmMzU1YjYyZGYxZmNhNmVAY294Lm5ldD4="},"prevInTopic":25115,"nextInTopic":25120,"prevInTime":25116,"nextInTime":25118,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... Yeah, well... Their group didn t include people who wouldn t otherwise smoke but who smoked during pregnancy anyway. And by that I mean their WHOLE group","messageBody":"<div id=\"ygrps-yiv-1720031538\">On Apr 11, 2006, at 11:36 AM, Nancy Wooton wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Method: Subjects were 177 clinic-referred boys, ages 7 to 12 years at<br/>\n&gt; the time of the first assessment, who underwent longitudinal  <br/>\n&gt; assessment<br/>\n&gt; for 6 years using annual structured diagnostic interviews. Correlates<br/>\n&gt; of maternal smoking during pregnancy and previously identified<br/>\n&gt; demographic, parental, perinatal, and family risk factors for the<br/>\n&gt; disruptive behavior disorders were controlled in logistic regression<br/>\n&gt; analyses.<br/>\n<br/>\n </span></blockquote>Yeah, well...<br/>\nTheir group didn&#39;t include people who wouldn&#39;t otherwise smoke but  <br/>\nwho smoked during pregnancy anyway.<br/>\n<br/>\nAnd by that I mean their WHOLE group was people who chose to smoke  <br/>\neven though they knew smoking was bad for them, pregnant or not.  And  <br/>\nthey chose to smoke during pregnancy.<br/>\n<br/>\nMaybe even if tobacco had never existed, parents who make choices  <br/>\nlike that will have children who make choices like that.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] putting my feet in the water","postDate":"1144799718","msgId":25115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFFQTAwNkY4LTc4REQtNDhDNS04NkFFLTNEMEE3QzMwNDRENEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg=="},"prevInTopic":25113,"nextInTopic":25117,"prevInTime":25114,"nextInTime":25116,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... We used to go to thrift stores and get toys that didn t really work, or from garage sales, so Marty could take them apart.  Sometimes he could fix them.","messageBody":"<div id=\"ygrps-yiv-1253816301\">On Apr 11, 2006, at 8:04 AM, lilith_pouia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And maybe i should find things to<br/>\n&gt; give them just so they can break them if that&#39;s what they like to do.<br/>\n<br/>\n </span></blockquote>We used to go to thrift stores and get toys that didn&#39;t really work,  <br/>\nor from garage sales, so Marty could take them apart.  Sometimes he  <br/>\ncould fix them.  Sometimes he just saw what it was that didn&#39;t work,  <br/>\nand that was cool too.  Sometimes it all went in the trash.   <br/>\nSometimes the parts were interesting, or the case of it was still  <br/>\ncute without lighting up or dinging or whatever it originally did.<br/>\n<br/>\nTry to live in the middle with how you characterize your kids and  <br/>\nthink of them.  &quot;And maybe i should find things to give them just so  <br/>\nthey can break them if that&#39;s what they like to do&quot; sounds like there  <br/>\nis one thing they like to do and once you&#39;ve found it you know, but  <br/>\nthey will like to do 800 things.  You need to find a few every day.   <br/>\nAnd if they are interested in opening up an old wind-up alarm clock,  <br/>\ncool!  That doesn&#39;t mean they like to break all clocks.   You can  <br/>\nhelp satisfy their curiosities and keep them provided with  <br/>\ninteresting things to make, touch, explore without labelling them as  <br/>\nkids who like to break things.<br/>\n<br/>\nMaybe they don&#39;t like to break things at all, except when they&#39;re  <br/>\nfrustrated and angry.<br/>\n<br/>\n-=-But sometimes they just refuse my suggestions and continue being  <br/>\nhigh strung<br/>\nindoors. -=-<br/>\n<br/>\n&quot;High strung&quot;?<br/>\nWould that be bored and needing to move.<br/>\nHealthy, normal kids NEED to move.  They&#39;re not just being difficult  <br/>\nwhen they express their real need to jump and climb and run.  They&#39;re  <br/>\nnot being &quot;high strung.&quot;  Think about what that really means, please,  <br/>\nif you&#39;re going to say it about your children.<br/>\n<br/>\n-=-So i have had a rule that if they won&#39;t calm down inside i<br/>\nmake them go out back. They respond to this like a punishment.<br/>\n-=-<br/>\n<br/>\nIt is a punishment.  It will help you sort through your feelings if  <br/>\nyou will really look at what you&#39;ve been doing and what you&#39;ve been  <br/>\ncalling it to make yourself feel better about all your rules.  If you  <br/>\nhave a rule that says if you won&#39;t do X, you cannot have Y, that IS a  <br/>\npunishment.  Your kids are right and you&#39;re fooling yourself (and  <br/>\ntrying to fool us, because you&#39;re writing things down that you  <br/>\nhaven&#39;t really looked at clearly yourself).<br/>\n<br/>\n-=-It&#39;s easy to say &quot;Well why don&#39;t you go play baseball with them?&quot; I<br/>\nsuppose that&#39;s possible some of the time, but solutions like that<br/>\naren&#39;t workable in reality 100% of the time.-=-<br/>\n<br/>\nSomewhere between 0% and 100% is where you need to be, and if you&#39;re  <br/>\nnot going to be with them at all, maybe send them to school where  <br/>\nthey can find people to run and be with.  Seriously.  If you&#39;re going  <br/>\nto unschool you will HAVE to dedicate time and energy to it.  It&#39;s  <br/>\nnot just having kids at home and ignoring them until they piss you  <br/>\noff enough to yell at them, as some people seem to believe.<br/>\n<br/>\n-=-I&#39;m currently nine months<br/>\npregnant, and can&#39;t leave food on the stove cooking, for instance, to<br/>\ngo play baseball.(My kids like to run and yell in the house when they<br/>\nknow i&#39;m busy with something hard to walk away from like cooking or an<br/>\nimportant phone call.) -=-<br/>\n<br/>\nFirst, being pregnant doesn&#39;t make food cook differently.<br/>\nMaybe playing with your boys should come first and THEN cooking  <br/>\nnext.  If they boys always come last, they will remain needy.<br/>\n<br/>\n-=-My kids like to run and yell in the house when they<br/>\nknow i&#39;m busy with something hard to walk away from like cooking or an<br/>\nimportant phone call.-=-<br/>\n<br/>\nWhen you&#39;re ignoring them, they find ways to occupy themselves.  You  <br/>\ndon&#39;t like the things they choose, so you get angry.  That wouldn&#39;t  <br/>\nhave happened, though, if you hadn&#39;t ignored them in the first place.<br/>\n<br/>\nMaybe your boys should come first and THEN phone calls.<br/>\n<br/>\n-=-What do you do when your four year old wants to climb on the fence  <br/>\nand<br/>\nit is sharp at the top?-=-<br/>\n<br/>\nFind him something safe to climb on or stay right there and let him  <br/>\nclimb up 2/3 of the way, not to the sharp part.<br/>\n<br/>\n-=-What do you do when your four year old wants to climb on the fence  <br/>\nand<br/>\nit is sharp at the top? I felt i NEEDED to tell him not to do it.-=-<br/>\n<br/>\nYour need was to help him do what he wanted to do and help him not  <br/>\nget hurt.  It felt like you needed to tell him no, but what you  <br/>\nneeded was to keep him safe.  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\n-=-Or what if they want to drink the whole container of juice boxes in<br/>\none day and you know they will cry for the rest of the week that there<br/>\naren&#39;t anymore?-=-<br/>\n<br/>\nYou don&#39;t &quot;know they will cry.&quot;  To set up a scenario like that and  <br/>\nthen respond to it is neither being aware of your children in the  <br/>\nmoment nor living now.  It&#39;s seeing the world as a mass or horrible  <br/>\noutcomes that can only be prevented by controlling the children.<br/>\n<br/>\nSomewhere between &quot;one juice box a day&quot; and &quot;Drink them all right  <br/>\nnow&quot; is a nicer way to be.<br/>\n<br/>\n-=-Or what if they want to eat the things i buy<br/>\nspecically for my husband&#39;s lunches at work?-=-<br/>\n<br/>\nPut those aside, put them in a brown paper bag or something, tape  <br/>\nthem up, don&#39;t even let them know they&#39;re there.  Or buy enough of it  <br/>\nthat they can have some and there&#39;s still enough for the work lunches.<br/>\n<br/>\n-=-If they want to play in the pool, but you know it&#39;s not warm<br/>\nenough outside should you just let them do it anyway, and hope they<br/>\nlearn from it when they are cold?-=-<br/>\n<br/>\nThe way you asked it sounds harsh, like you hope they&#39;re cold, and  <br/>\nyou hope they learn their lesson.  What if they&#39;re not that cold?   <br/>\nWhat if they don&#39;t mind?<br/>\n<br/>\nMy mom would be really angry when she made a dire prediction and it  <br/>\ndidn&#39;t come true.  If she said &quot;You&#39;ll get sick&quot; and I didn&#39;t, she  <br/>\nwas pretty grumpy.  She WANTED me to suffer.  She wanted to be right,  <br/>\nbut her assertions and theories were extreme and wrong and mean.<br/>\n<br/>\nGuys swim in ice-cold water in some parts of the world.  In some  <br/>\nplaces they go between natural hot springs, or saunas, and ice-cold  <br/>\nwater.  It&#39;s not so crazy to just want to play in a pool that would  <br/>\nbe too cold for you.  Maybe they&#39;ll just want to get in a little bit  <br/>\nand get right back out.  Would you feel the need to talk to them  <br/>\nabout it  if they did, and say &quot;I told you so?&quot;  If you could say  <br/>\n&quot;Okay,&quot; and then &quot;Was it fun?&quot; when they get back, that would be  <br/>\nnice.  Kids play in the snow, and then they come in to sit by a fire  <br/>\nand drink hot chocolate.  If you think it will be too cold for them,  <br/>\nmaybe you could have towels to wrap up in and a nice DVD to watch  <br/>\nwhile they get warm.  That wouldn&#39;t be too much work, but might seem  <br/>\nlike a party to them.<br/>\n<br/>\n-=-Also what do you do about them respecting YOUR things? They<br/>\nplay with my stuff, and jump on my bed, climb on the car, and get into<br/>\nmy husband&#39;s tools. -=-<br/>\n<br/>\nWhat I did was respect my children and their things from before they  <br/>\ncould remember, so they&#39;ve been pretty good about my things.  You  <br/>\ncan&#39;t expect kids to know what you know.  Years ago, Kirby broke the  <br/>\nhardwood pointer that was my souvenir of being a teacher. I used it  <br/>\nas a prop the first time I ever spoke at a conference.   He didn&#39;t  <br/>\nknow it was any more important than any old dowel or stick around the  <br/>\nhouse.  I cried and he felt bad.  I didn&#39;t punish him.  It wouldn&#39;t  <br/>\nhave brought the stick back, and it wouldn&#39;t have made him care more  <br/>\nabout me or my things.<br/>\n<br/>\n-=-My children have broken three or four windows within<br/>\nthe past year, and a ceiling fan, a floor fan and a light fixture.-=-<br/>\n<br/>\nI think you&#39;re leaving them to take care of each other too much.   <br/>\nUnschooling will work well if you do things with them, lots, or with  <br/>\none of them, or with all of your kids.  And fewer things will get  <br/>\nbroken if you&#39;re there and they have something better to do.<br/>\n<br/>\n-=-That&#39;s aside from the books, toys and videos i throw away every  <br/>\ntime i<br/>\nclean their room.-=-<br/>\n<br/>\nDo you throw away things that aren&#39;t broken?  Maybe they don&#39;t  <br/>\nrespect your things because you don&#39;t respect their things.<br/>\n<br/>\n-=-We have had a rule that if it&#39;s not yours don&#39;t play with it. I  <br/>\ndon&#39;t know what to<br/>\ndo about that.-=-<br/>\n<br/>\nToo many rules.  There&#39;s a link up above that looks like it&#39;s about  <br/>\nrules but it&#39;s about principles.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":136871563,"authorName":"s.waynforth","from":"&quot;s.waynforth&quot; &lt;s.waynforth@...&gt;","profile":"schuyler_waynforth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] putting my feet in the water","postDate":"1144787937","msgId":25113,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0M0MxM0UxLjEwMDAyMDZAYnRvcGVud29ybGQuY29tPg==","inReplyToHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg=="},"prevInTopic":25112,"nextInTopic":25115,"prevInTime":25112,"nextInTime":25114,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"I started going through this and responding to each point, but I realized that there was an overall feel to your post, your need, your exhaustion that I wanted","messageBody":"<div id=\"ygrps-yiv-927587698\">I started going through this and responding to each point, but I <br/>\nrealized that there was an overall feel to your post, your need, your <br/>\nexhaustion that I wanted to respond to. You sound so tired. You write of <br/>\nbeing afraid of what will happen if you step away from timeouts and <br/>\ncountdowns to spankings. You write THEIRS in shouting capitals and write <br/>\ni in lower case tiny letters.<br/>\n<br/>\nYou sound so tired and so angry. When I was pregnant with Linnaea, my <br/>\nsecond child, I was tired. I was grouchy. I didn&#39;t have a lot of <br/>\npatience. I was working part time when I was pregnant which felt like <br/>\nthe only time when I got a break. And I felt horribly guilty for <br/>\nenjoying the break. For enjoying being able to go over to the cafeteria <br/>\non the Fridays when I went into the VA and get a coke and just sit at my <br/>\ncomputer and work without any distractions. It was lovely to be all on <br/>\nmy own. I&#39;ve never really felt that way at any other time. I&#39;ve enjoyed <br/>\nthe luxury of walking quickly to the shops or of not having to be <br/>\nslightly vigilantly aware of where everyone is when going somewhere <br/>\nelse, but I enjoyed the &quot;just me time&quot; when I was pregnant with Linnaea <br/>\nmore than I ever have before or since. I&#39;m not suggesting that you need <br/>\n&quot;me time&quot; with your pregnancy in the same way that I did, but maybe you <br/>\nare tired. Maybe, as this parasitic growth inside you gets closer and <br/>\ncloser to birth, and is taking more and more from you to support her <br/>\nlife, you have less to give to your other dependents. Maybe you need to <br/>\nschedule in your day pick me ups, little energy boosts of a banana <br/>\nmilkshake or an energy bar or 10 minutes of you and a cup of tea and <br/>\nsome cookies. Maybe you need to think about what really needs to get <br/>\ndone in a day. Maybe you could fix a bunch of freezable meals when your <br/>\nhusband is around that you could just pop in the oven or microwave for <br/>\nthe days when he isn&#39;t around, so that you don&#39;t have to choose between <br/>\nbeing with your children and standing at the stove. Maybe you could get <br/>\na crock pot and cook dinner all day and not have to spend a particular <br/>\ntime stuck to the stove. Maybe if you have to cook you could set up <br/>\nsomething for the boys to do while you are cooking, a video or a game or <br/>\ntime on the computer or something that would keep them entertained so <br/>\nthat you don&#39;t have to feel pulled in to many directions. Maybe you <br/>\ncould order pizza on the nights when you just can&#39;t cope anymore. Or buy <br/>\na few frozen ones to have as back up for when baseball was too <br/>\ndistracting to keep you standing at the stove.<br/>\n<br/>\nI don&#39;t know what you &quot;have&quot; to do. I don&#39;t know what things in your <br/>\nhouse are piling up from one day to the next. If I don&#39;t get done what I <br/>\nwant to on one day it doesn&#39;t feel that bad to address it the next. Are <br/>\nthere ways that you can make your required labor less intense. Buy some <br/>\nboxes on wheels to toss toys into when you need to clean up the living <br/>\nroom. Soak dishes overnight and do the dishes in the morning. Try and <br/>\nminimize how much you feel you need to do.<br/>\n<br/>\nIt isn&#39;t good that they are breaking windows or that they are breaking <br/>\nthings that are yours. Maybe if you give them something they can play <br/>\nwith in the house when they are trying to use something that will break <br/>\nor will break other things they won&#39;t respond so angrily. Simon just got <br/>\nan indoor frisbee &quot;called a Superang&quot; for his birthday. Pillows are <br/>\nusually pretty good, oh, Simon discovered a while ago that a tam, little <br/>\nround knitted hat that lies flat when it isn&#39;t worn, makes a great <br/>\nindoor frisbee. You could talk to them about why it isn&#39;t okay to play <br/>\nwith certain things in the house. Simon got this cool electronic circuit <br/>\nbuilding set for Christmas that has, among other things, a spinning disc <br/>\nthat you build a launcher for. One of the paintings in our house got <br/>\nchipped by the disc, and so it isn&#39;t something that we use in the living <br/>\nroom unless I&#39;ve draped a blanket over the painting.  If something is <br/>\nimportant to you that it not be broken you might want to make sure that <br/>\nit isn&#39;t accessible. If they want to go in the pool when you think it is <br/>\ntoo cold, get lots of towels and be prepared to warm them up, make some <br/>\nhot chocolate or give them a nice warm bath or shower when they are <br/>\ndone. Maybe you could take them to a heated indoor pool. A friend <br/>\nmentioned that a Holiday Inn near us (in Newcastle, so I don&#39;t know if <br/>\nyou can do this in the U.S.) lets you use their pool and jacuzzi for 5 <br/>\npounds a person, or something, maybe you could go there. Or maybe you <br/>\ncould book a night at a local hotel and stay over, watching new <br/>\ntelevision and swimming in the pool and enjoying the continental breakfast.<br/>\n<br/>\nJuice boxes, buy more. Buy more when you go shopping so that they have <br/>\nlots and lots to drink. If you can&#39;t afford to buy more, than make that <br/>\nsomething that you talk about. Have them help you figure out what to buy <br/>\nat the grocery store. If they choose to splurge on the exciting new <br/>\nfoods you just got from the grocery store, that is pretty normal. All <br/>\nthe good fruit goes really quickly around here. And fresh bread is <br/>\nalways more appealing than day old bread. And when it is gone you can <br/>\nwrite it on the list for the next grocery run. At some point the thing <br/>\nthat was an exciting splurge will change. Chips last far longer than <br/>\nstrawberries around here. Chips are common, strawberries, good spring <br/>\nstrawberries, are rare, and so get eaten very, very quickly. Artichokes <br/>\nand edamame and good apple juice and soy milk at the moment are things <br/>\nthat disappear, but we have a box filled with tic tacs (cinnamon which <br/>\nI&#39;ve only found in one place here, so we bought the store out) and <br/>\nstarbursts and hohos (cadbury mini rolls really) and gum and coke bottle <br/>\ncandy and wine gums and a bunch of other stuff that has been there for <br/>\nat least a month and that I&#39;ll have to go through soon to throw out what <br/>\nis stale or melted or gross. Phish food ice cream goes pretty quickly, <br/>\nbut the Fossil Fuel just hasn&#39;t moved. But it takes a while to trust <br/>\nthat what you like will be there when you want it. And if you have <br/>\nequated being good with getting a certain treat, like juice boxes or a <br/>\ncandy bar, than those things taste of more than just a candy bar or a <br/>\njuice box. And it may take a while for that unintentional raise in value <br/>\nto dissipate, for food to taste like food instead of like praise or <br/>\npunishment. Linnaea is right now, this very minute, playing with her <br/>\nfriend for whom chocolate is the most amazing food. She isn&#39;t allowed <br/>\nfree access to chocolate. So when she comes over we stock up, and <br/>\nLinnaea, for whom right now, this very minute, fitting in is very <br/>\nimportant, will try and mirror her consumption of chocolate. But she <br/>\ncan&#39;t. She just doesn&#39;t need it in the same way as her friend needs it. <br/>\nSo, she eats what she can and then gets to share what she couldn&#39;t and <br/>\ndidn&#39;t want to begin with.<br/>\n<br/>\nI think, though, the first thing I would look at if I were in your shoes <br/>\nis how much being pregnant has made you weary. I would think about how <br/>\nbig and how heavy I felt and how feeling that way might be coloring my <br/>\nvision of the rest of the world. Being pregnant is hard work, and its <br/>\nconstant and it doesn&#39;t help you to sleep at night. Try and give <br/>\nyourself permission to let go of housework and other things right now. <br/>\nTry and take the time to breathe and relax and not feel everything <br/>\nmounting around you in some sort of Sarah Sylvia Cynthia Stout who would <br/>\nnot take the garbage out kind of way <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mste.uiuc.edu/courses/ci407su01/students/north/kristy/Project/K-Poem-Net.html)\">http://www.mste.uiuc.edu/courses/ci407su01/students/north/kristy/Project/K-Poem-Net.html)</a>. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] putting my feet in the water","postDate":"1144782938","msgId":25112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcuMC4xLjAuMC4yMDA2MDQxMTE0NDIyMS4wMWMwMjZkOEBnYWlhd29sZi5vcmc+","inReplyToHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg=="},"prevInTopic":25109,"nextInTopic":25113,"prevInTime":25111,"nextInTime":25113,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... Just go slowly and reasonably; otherwise, it could be destabilizing for your kids. ... http://sandradodd.com/rules This is a really helpful page in getting","messageBody":"<div id=\"ygrps-yiv-225040095\">At 10:04 4/11/2006, Lilith wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;We have decided to try the no<br/>\n&gt;more punishment thing. I am scared though, of what might happen if it<br/>\n&gt;doesn&#39;t work or i break down and can&#39;t handle it. I&#39;m afraid of not<br/>\n&gt;being consistent with my children and them resenting me more for it.<br/>\n<br/>\n </span></blockquote>Just go slowly and reasonably; otherwise, it could be destabilizing <br/>\nfor your kids.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The not throwing and runing in the house thing will be hard because i<br/>\n&gt;offer my kids alternatives like playing in the backyard and they<br/>\n&gt;always act as though they are being punished if i say &quot;Go outside if<br/>\n&gt;you want to wrestle, or rough house, run, throw, etc.&quot; Or i might say<br/>\n&gt;&quot;Why don&#39;t you guys go play baseball or hide and seek?&quot; But sometimes<br/>\n&gt;they just refuse my suggestions and continue being high strung<br/>\n&gt;indoors. So i have had a rule that if they won&#39;t calm down inside i<br/>\n&gt;make them go out back.<br/>\n<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/rules\">http://sandradodd.com/rules</a><br/>\n<br/>\nThis is a really helpful page in getting past having rules.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;They respond to this like a punishment.<br/>\n<br/>\n </span></blockquote>It sounds to me like a punishment. It might sound more like a helpful <br/>\nsuggestion to them if you included yourself in the mix.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;It&#39;s easy to say &quot;Well why don&#39;t you go play baseball with them?&quot; I<br/>\n&gt;suppose that&#39;s possible some of the time, but solutions like that<br/>\n&gt;aren&#39;t workable in reality 100% of the time. I&#39;m currently nine months<br/>\n&gt;pregnant, and can&#39;t leave food on the stove cooking, for instance, to<br/>\n&gt;go play baseball.<br/>\n<br/>\n </span></blockquote>True, but you can turn off the stove and go outside with them if they <br/>\nreally need you.  Baseball playing is probably not the thing for you <br/>\nto do right now, but since it&#39;s apparent that they really want you to <br/>\nbe with them, all you have to do is be there.  With them.  Talking <br/>\nand listening and laughing and being your wonderful self who they really love!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;(My kids like to run and yell in the house when they<br/>\n&gt;know i&#39;m busy with something hard to walk away from like cooking or an<br/>\n&gt;important phone call.)<br/>\n<br/>\n </span></blockquote>They&#39;re trying really hard to get your attention.  Give it to <br/>\nthem.  Don&#39;t make them work so hard!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I also have so much to do preparing for the new<br/>\n&gt;baby that can be and is put off to do things with them sometimes, but<br/>\n&gt;it can&#39;t always be that way.<br/>\n<br/>\n </span></blockquote>I think this comes under the &quot;...can be too late&quot; category.  The <br/>\nstuff you have to do will always wait for you.  The people may not.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Yesterday, for instance, we played out<br/>\n&gt;back with water bombs and water guns all afternoon...<br/>\n<br/>\n </span></blockquote>Sounds like tremendous fun!!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;...instead of me doing<br/>\n&gt;the things i know i need to get done  and now i&#39;ll have a heavier load<br/>\n&gt;today.<br/>\n<br/>\n </span></blockquote>drag it out over more than one day.  How much of this stuff do you <br/>\nreally *have* to do, anyway?  Babies really only need the arms of their moms.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;But, i am willing to try.<br/>\n<br/>\n </span></blockquote>Way to go!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;What do you do when your four year old wants to climb on the fence and<br/>\n&gt;it is sharp at the top? I felt i NEEDED to tell him not to do it.<br/>\n<br/>\n </span></blockquote>Give him information (in a loving, supportive way) that he can use to <br/>\nmake a good decision about climbing the fence.  See if there&#39;s a way <br/>\nyou can help him do what he wants to do rather than just telling him <br/>\nhe can&#39;t.  If you can give him information in the right, supportive <br/>\nway, he&#39;ll reach the conclusion that works best for him.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Or what if they want to drink the whole container of juice boxes in<br/>\n&gt;one day and you know they will cry for the rest of the week that there<br/>\n&gt;aren&#39;t anymore?<br/>\n<br/>\n </span></blockquote>Again, give him the information.  And, if he decides to drink all the <br/>\njuice boxes and then is sad that they&#39;re all gone, comfort him, the <br/>\nway you would any friend who was sad.  Don&#39;t rub salt into the wound <br/>\nor say, &quot;I told you so.&quot;  He&#39;ll get it.  Or, just make sure you get <br/>\nenough juice boxes for the week and don&#39;t keep them all out where <br/>\nthey can be seen and consumed right away!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Or what if they want to eat the things i buy<br/>\n&gt;specically for my husband&#39;s lunches at work?(I do buy them their own<br/>\n&gt;treats.)<br/>\n<br/>\n </span></blockquote>Find a way to keep these things out of their sight if you don&#39;t want <br/>\nthem to eat them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;If they want to play in the pool, but you know it&#39;s not warm<br/>\n&gt;enough outside should you just let them do it anyway, and hope they<br/>\n&gt;learn from it when they are cold?<br/>\n<br/>\n </span></blockquote>I have a different perception of the temperature than my son <br/>\ndoes.  When I&#39;m cold, he&#39;s really not.  I would not make him wear a <br/>\njacket when he&#39;s not cold, and I would hope he wouldn&#39;t prevent me <br/>\nfrom wearing a jacket if I were cold.  So, if they want to play in <br/>\nthe pool and it&#39;s too cold for you, let them reach the decision based <br/>\non their comfort.  &#39;Cause if you prevent them from doing it, they&#39;ll <br/>\nwant to do it all the more regardless of their personal comfort or safety.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;This is going to be so hard for me<br/>\n&gt;to learn. Also what do you do about them respecting YOUR things? They<br/>\n&gt;play with my stuff, and jump on my bed, climb on the car, and get into<br/>\n&gt;my husband&#39;s tools.<br/>\n<br/>\n </span></blockquote>My motto is &quot;People before things.&quot;  My guitars are very important to <br/>\nme, and I don&#39;t leave &#39;em out (except one or two) where they can get <br/>\nhurt.  The one or two that I do leave out are fair game.  If there&#39;s <br/>\nstuff that you have that would make you sad if it got broken, <br/>\nconsider putting it away for a while until your kids are older and <br/>\ncan be more respectful of your things.  If you can do this in a <br/>\nloving, mindful way, you won&#39;t feel so resentful of having to do without.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;We have had a<br/>\n&gt;rule that if it&#39;s not yours don&#39;t play with it. I don&#39;t know what to<br/>\n&gt;do about that.<br/>\n<br/>\n </span></blockquote>Rules again!  What do they really mean to a little one?!  Get your <br/>\nstuff out of harm&#39;s way.  And, consider rearranging your home so that <br/>\nit&#39;s less convenient for them to run, if you don&#39;t want them running <br/>\nin the living room, say.  Replace all the breakable stuff with <br/>\nunbreakable stuff (for now), and realize that you&#39;re sharing your <br/>\nhome with little folks who need the place to be more kid-friendly <br/>\nthan it is right now.  That will relieve a lot of the tension your having.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;So if you all haven&#39;t given up on me because of my<br/>\n&gt;negativity yet please help me figure some of this out.<br/>\n<br/>\n </span></blockquote>I&#39;m so glad you&#39;re willing to hang in there.  Jude&#39;s gonna have a <br/>\ngreat world to come into!  Especially if you can kick the habit!!<br/>\n<br/>\nBe well,<br/>\nMarji <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":205483142,"authorName":"Melissa","from":"Melissa &lt;autismhelp@...&gt;","profile":"multimomma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] putting my feet in the water","postDate":"1144779989","msgId":25108,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGMzgzNTk2LTBFQUMtNEZGRC04NjYyLTMyQTYzRjQ2OTA1MkBjb3gubmV0Pg==","inReplyToHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg=="},"prevInTopic":25107,"nextInTopic":25109,"prevInTime":25107,"nextInTime":25109,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"I m going to try and take it one bit at a time...and leave the blue print in for reference. ... You should be aware that the kids will test you a LOT to see if","messageBody":"<div id=\"ygrps-yiv-998971213\">I&#39;m going to try and take it one bit at a time...and leave the blue  <br/>\nprint in for reference.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n&gt; . I am scared though, of what might happen if it<br/>\n&gt; doesn&#39;t work or i break down and can&#39;t handle it. I&#39;m afraid of not<br/>\n&gt; being consistent with my children and them resenting me more for it.<br/>\n </span></blockquote>You should be aware that the kids will test you a LOT to see if you  <br/>\nwill change your mind and start punishing again. If they are  <br/>\naccustomed to you setting limits and then reinforcing them, they are  <br/>\ngoing to go as far as they possibly can to see if you will revert. I  <br/>\njust wanted to warn you, so that you don&#39;t break in the middle and  <br/>\nmess up. If that happens, you will go even further back than you are  <br/>\nnow, because they WILL resent and not trust you.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The not throwing and runing in the house thing will be hard because i<br/>\n&gt; offer my kids alternatives like playing in the backyard and they<br/>\n&gt; always act as though they are being punished if i say &quot;Go outside if<br/>\n&gt; you want to wrestle, or rough house, run, throw, etc.&quot;<br/>\n<br/>\n </span></blockquote>It is a punishment to them, because not only are you sending them  <br/>\naway from you, but you are doing it in the spirit of frustration.  <br/>\nI&#39;ll bet if you said, &quot;Let&#39;s go outside to play&quot; and then go out with  <br/>\nthem, they would love it. I&#39;ll bet they LOVED the waterballoon fight.  <br/>\nAnd there is no reason why you shouldn&#39;t do that every day. It sounds  <br/>\nexhausting, but it is your job, and after a while, they won&#39;t need  <br/>\nyou as much because they will trust that you&#39;ll be there when they  <br/>\nneed you. And soon they will grow up and not be so intense. You don&#39;t  <br/>\nhave to play hard, but sometimes your presence to validate them is  <br/>\nall they need. Sitting in a lawn chair and saying &quot;WOw! You can run  <br/>\nreally fast&quot; or &quot;I didn&#39;t know you could throw the ball so high&quot;, or  <br/>\nplay as long as you can and say in an exaggerated manner, &quot;Sheesh!  <br/>\nYou guys have a lot of energy...mommy needs to sit down and rest the  <br/>\nbaby&quot; That&#39;s what I usually wind up doing (and I&#39;m pregnant a LOT  <br/>\nlol!) But then I&#39;m sitting there and being involved.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; It&#39;s easy to say &quot;Well why don&#39;t you go play baseball with them?&quot; I<br/>\n&gt; suppose that&#39;s possible some of the time, but solutions like that<br/>\n&gt; aren&#39;t workable in reality 100% of the time. I&#39;m currently nine months<br/>\n&gt; pregnant, and can&#39;t leave food on the stove cooking, for instance, to<br/>\n&gt; go play baseball.<br/>\n </span></blockquote>It&#39;s easy to turn the food off to play with your kids, it&#39;s easy to  <br/>\nmake foods that you don&#39;t have to attend to, you just have to make  <br/>\nthe choice to do it. I have seven kids, one of whom has a severe  <br/>\ndisability, several of whom have moderate issues, and two of whom  <br/>\nhave serious food allergies. If I can do it pregnant...so can you.  <br/>\nIt&#39;s just a matter of turning off the &#39;what if&#39;s?&#39; and choosing to  <br/>\nlive this life and be happy doing it.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; (My kids like to run and yell in the house when they<br/>\n&gt; know i&#39;m busy with something hard to walk away from like cooking or an<br/>\n&gt; important phone call.)<br/>\n<br/>\n </span></blockquote>Because they know it&#39;s the best way to get your attention!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I also have so much to do preparing for the new<br/>\n&gt; baby<br/>\n<br/>\n </span></blockquote>Babies don&#39;t need anything but mom and love. Maybe diapers, but not  <br/>\nall moms do that. They don&#39;t need a crib, they don&#39;t need toys, they  <br/>\ndon&#39;t need a fresh coat of paint. Take this time when you can&#39;t be  <br/>\ndoing everything to choose to spend time with your kids. It will make  <br/>\nall the difference. I just did this myself, and came fully to  <br/>\nunschooling when i was on three months bedrest with my last baby. It  <br/>\nwas awesome to let all that stuff go!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; that can be and is put off to do things with them sometimes, but<br/>\n&gt; it can&#39;t always be that way. Yesterday, for instance, we played out<br/>\n&gt; back with water bombs and water guns all afternoon instead of me doing<br/>\n&gt; the things i know i need to get done and now i&#39;ll have a heavier load<br/>\n&gt; today.<br/>\n </span></blockquote>What heavier load? Laundry is laundry, dishes is dishes, dust is  <br/>\ndust. It will always be there, but your kids won&#39;t!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; What do you do when your four year old wants to climb on the fence and<br/>\n&gt; it is sharp at the top?<br/>\n </span></blockquote>Let him do it. Trust that he has the brains to know when he&#39;s gone  <br/>\ntoo far and be willing to help him out without scolding or saying &#39;I  <br/>\ntold you so&#39;. Encourage him. Don&#39;t yell because it throws him off  <br/>\nbalance and the worst thing you could do is undermine his self esteem  <br/>\nby fretting.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Or what if they want to drink the whole container of juice boxes in<br/>\n&gt; one day and you know they will cry for the rest of the week that there<br/>\n&gt; aren&#39;t anymore?<br/>\n </span></blockquote>Get more. Or offer something else cool to drink. Chocolate milk.  <br/>\nHomemade lemonade. Water with ice cubes that have plastic bugs frozen  <br/>\nin them.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Or what if they want to eat the things i buy<br/>\n&gt; specically for my husband&#39;s lunches at work?<br/>\n<br/>\n </span></blockquote>Get them the same stuff you buy dh. Or pack theirs up like you pack  <br/>\nhis. Or make something new and different for lunch. edible playdough,  <br/>\npizza rolls, pigs in a blanket, sandwiches cut into shapes. Picnic  <br/>\noutside.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; )If they want to play in the pool, but you know it&#39;s not warm<br/>\n&gt; enough outside should you just let them do it anyway, and hope they<br/>\n&gt; learn from it when they are cold?<br/>\n<br/>\n </span></blockquote>Yep. They will play in it for about ten minutes. Or they might  <br/>\nsurprise you and play longer because to them it DOESN&quot;T feel that  <br/>\ncold. Or they might stand on the side and splash or get cups of water  <br/>\nto make mud. have big warm blankets to snuggle them in when they do  <br/>\nget cold. and hot cocoa is always nice ;-)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also what do you do about them respecting YOUR things? They<br/>\n&gt; play with my stuff, and jump on my bed, climb on the car, and get into<br/>\n&gt; my husband&#39;s tools.<br/>\n </span></blockquote>I ask the kids to treat my things with respect. I redirect. I ask  <br/>\nthem again. I redirect. I ask them again. I redirect. Sounds simple,  <br/>\nbut if they are jumping on the bed, it&#39;s either because they need  <br/>\nthat input or that they need my attention. They aren&#39;t jumping on it  <br/>\njust to destroy it. Now, if you made a big deal about how they will  <br/>\ndestroy it, and that&#39;s the attention they get, it might turn into  <br/>\nthat. And some kids just need longer to learn than others. My kids  <br/>\nhave their own tools. They climb on the walls outside. They jump on  <br/>\ntheir own beds, and sometimes they jump on mine. Sometimes *I* jump  <br/>\non mine. It&#39;s fun.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; By the way, i did not exaggerate about things<br/>\n&gt; getting broken. My children have broken three or four windows within<br/>\n&gt; the past year, and a ceiling fan, a floor fan and a light fixture.<br/>\n<br/>\n </span></blockquote>We&#39;ve lost a ceiling fan, a sliding glass door and two screens. It  <br/>\nwas accidental each time, they just wanted to see what happened and  <br/>\nnow they now. They didn&#39;t get a lecture about breaking things or  <br/>\ndestroying things, so that&#39;s not their focus. They&#39;ve learned that  <br/>\nthey can ask me for help. The fan was the funniest thing, because  <br/>\nthey thought they could swing around like cartoon characters do.  <br/>\nWell, they didn&#39;t ;-) I&#39;m just thankful they didn&#39;t break their necks  <br/>\nor pull the whole thing out of the ceiling on their heads.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That&#39;s aside from the books, toys and videos i throw away every time i<br/>\n&gt; clean their room. It&#39;s not that things MIGHT get broken at my house.<br/>\n&gt; Things DO get broken.<br/>\n </span></blockquote>Kids have lots of energy. They need to have lots of mommy too. Some  <br/>\nkids need more sensory input than others and they have to play as  <br/>\nhard as possible just to feel real. The alternative is to have a  <br/>\nspacey kid who is a vegetable. Meds can do that for you. We do lots  <br/>\nof heavy work, we dig holes to china. we dig tigger traps. we build  <br/>\nstuff (lots of hammering and sawing). we jump alot, we climb alot of  <br/>\ntrees.<br/>\nI know you&#39;re tired. i feel that you are uncertain of where you are  <br/>\ngoing. I was there not so long ago. I&#39;m still there sometimes. But we  <br/>\nhave a job as parents to make better choices, to know where we are  <br/>\ngoing. You CAN do this, and you took the first step by admitting you  <br/>\nneed help to get there. Make the choice now to keep going. To trust  <br/>\nin your kids and support them, the same way you did when you married  <br/>\nyour husband...<br/>\nhope this is okay</div>","specialLinks":[]},{"userId":211613748,"authorName":"lilith_pouia","from":"&quot;lilith_pouia&quot; &lt;lilith_pouia@...&gt;","profile":"lilith_pouia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: putting my feet in the water","postDate":"1144779721","msgId":25109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxZ3M0OSt2MW9zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDJiNDE2NmMyOTNjZTQzMzAyZjM1NWI2MmRmMWZjYTZlQGNveC5uZXQ+"},"prevInTopic":25108,"nextInTopic":25112,"prevInTime":25108,"nextInTime":25110,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... Actually i didn t smoke during my other pregnancies. I wouldn t doubt that some people would suggest putting my older son on Ritalin, but i don t feel that","messageBody":"<div id=\"ygrps-yiv-119006744\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Nancy Wooton &lt;nancywooton@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; On Apr 11, 2006, at 7:04 AM, lilith_pouia wrote:<br/>\n&gt; <br/>\n&gt; &gt; Okay, i have been trying to take in the advice i&#39;ve been given. I had<br/>\n&gt; &gt; a good cry the other night, and have been reading more articles, and<br/>\n&gt; &gt; had long discussions with my husband. We have decided to try the no<br/>\n&gt; &gt; more punishment thing. I am scared though, of what might happen if it<br/>\n&gt; &gt; doesn&#39;t work or i break down and can&#39;t handle it. I&#39;m afraid of not<br/>\n&gt; &gt; being consistent with my children and them resenting me more for it.<br/>\n&gt; &gt; But maybe if i can ask questions as they come up, and as i learn more<br/>\n&gt; &gt; about the way you all are with your families i might get the hang of<br/>\n&gt; &gt; it. I&#39;ve realized it&#39;s true that i don&#39;t have to let it upset me when<br/>\n&gt; &gt; my kids break THEIR things, that the things become THEIRS when i give<br/>\n&gt; &gt; them to the kids and the things have to be THEIRS for them to ever<br/>\n&gt; &gt; learn how to care for THEIR things. And maybe i should find things to<br/>\n&gt; &gt; give them just so they can break them if that&#39;s what they like to do.<br/>\n&gt; &gt; It&#39;s true also that the value I put onto books is MY value, not<br/>\n&gt; &gt; THEIRS, and shouldn&#39;t be impossed on them if i want them to learn to<br/>\n&gt; &gt; think freely. I should let them learn THEIR OWN value for things like<br/>\n&gt; &gt; books and whatever else.<br/>\n&gt; &gt; The not throwing and runing in the house thing will be hard because i<br/>\n&gt; &gt; offer my kids alternatives like playing in the backyard and they<br/>\n&gt; &gt; always act as though they are being punished if i say &quot;Go outside if<br/>\n&gt; &gt; you want to wrestle, or rough house, run, throw, etc.&quot; Or i might say<br/>\n&gt; &gt; &quot;Why don&#39;t you guys go play baseball or hide and seek?&quot; But sometimes<br/>\n&gt; &gt; they just refuse my suggestions and continue being high strung<br/>\n&gt; &gt; indoors. So i have had a rule that if they won&#39;t calm down inside i<br/>\n&gt; &gt; make them go out back. They respond to this like a punishment.<br/>\n&gt; &gt; It&#39;s easy to say &quot;Well why don&#39;t you go play baseball with them?&quot; I<br/>\n&gt; &gt; suppose that&#39;s possible some of the time, but solutions like that<br/>\n&gt; &gt; aren&#39;t workable in reality 100% of the time. I&#39;m currently nine months<br/>\n&gt; &gt; pregnant,<br/>\n&gt; <br/>\n&gt; It would have helped the discussion if you&#39;d mentioned this fact.<br/>\n&gt; <br/>\n&gt; And from your next post:<br/>\n&gt; <br/>\n&gt; &quot;This reminds me of a hurtful argument my mother and i had about me<br/>\n&gt; quitting smoking last week. She really offended me by making a remark<br/>\n&gt; about me leaving my children without a mother. I can see her point<br/>\n&gt; better now after reading this, though i feel she could have stated<br/>\n&gt; things differently and less harassingly. I have tried to quit smoking<br/>\n&gt;   several times throughout the past year, and i felt she was being<br/>\n&gt; harassing as though i don&#39;t realize how important it is to quit. But i<br/>\n&gt; just wanted to share that i noticed this philosophy can be applied to<br/>\n&gt; anything we need to do to better ourselves, not just our parenting. It<br/>\n&gt; could become &quot;too late&quot; for me to quit smoking, and i think maybe<br/>\n&gt; that&#39;s all my mother was trying to explain to me.&quot;<br/>\n&gt; <br/>\n&gt; So I&#39;m just guessing here that you smoked during your other pregnancies <br/>\n&gt; as well.  Have you considered that your two boys may have physiological <br/>\n&gt; conditions that are causing their behavior?  Upon reading the details <br/>\n&gt; you&#39;ve posted, I&#39;ve begun to suspect that your boys are behaving <br/>\n&gt; abnormally.  What does their pediatrician say about their behaviors?  <br/>\n&gt; I&#39;m not trying to be mean or hurtful or judgmental, but you came to <br/>\n&gt; this list asking for help from more experienced unschoolers, and I&#39;m <br/>\n&gt; probably not the only one who&#39;s thinking along these lines.  You may <br/>\n&gt; need medical intervention, rather than parenting advice.<br/>\n&gt; <br/>\n&gt; This was from just one try googling &quot;smoking during pregnancy&quot;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.chem-tox.com/pregnancy/smoking.htm\">http://www.chem-tox.com/pregnancy/smoking.htm</a><br/>\n&gt; <br/>\n&gt; Smoking During Pregnancy Increases Conduct Disorders<br/>\n&gt; <br/>\n&gt; SOURCE: Archives General Psychiatry, 54:670-676, July, 1997<br/>\n&gt; <br/>\n&gt; More evidence on the connection between a mother&#39;s smoking during <br/>\n&gt; pregnancy and increased risk of having a child with behavior disorders. <br/>\n&gt; Below is a direct quote of the summary of the 1997 journal article <br/>\n&gt; report in the Archives of General Psychiatry, 54:670, 1997.<br/>\n&gt; <br/>\n&gt; Background: Previous animal and human studies have indicated that <br/>\n&gt; prenatal exposure to nicotine isassociated with adverse reproductive <br/>\n&gt; outcomes, including altered neural structure and functioning,cognitive <br/>\n&gt; deficits, and behavior problems in the offspring. Our study extends <br/>\n&gt; previous research onhumans by controlling a broad range of correlates <br/>\n&gt; of maternal smoking during pregnancy todetermine if smoking is <br/>\n&gt; associated with behavior problems in the offspring severe enough to <br/>\n&gt; qualifyfor DSM-III-R diagnoses. <br/>\n&gt; <br/>\n&gt; Method: Subjects were 177 clinic-referred boys, ages 7 to 12 years at <br/>\n&gt; the time of the first assessment, who underwent longitudinal assessment <br/>\n&gt; for 6 years using annual structured diagnostic interviews. Correlates <br/>\n&gt; of maternal smoking during pregnancy and previously identified <br/>\n&gt; demographic, parental, perinatal, and family risk factors for the <br/>\n&gt; disruptive behavior disorders were controlled in logistic regression <br/>\n&gt; analyses. <br/>\n&gt; <br/>\n&gt; Results: Mothers who smoked more than half a pack of cigarettes daily <br/>\n&gt; during pregnancy were significantly more likely to have a child with <br/>\n&gt; conduct disorder (odds ratio, 4.4; P=.001) than mothers who did not <br/>\n&gt; smoke during pregnancy. This association was statistically significant <br/>\n&gt; when controlling for socioeconomic status, maternal age, parental <br/>\n&gt; antisocial personality, substance abuse during pregnancy, and <br/>\n&gt; maladaptive parenting.<br/>\n&gt; <br/>\n&gt; Conclusions: Maternal smoking during pregnancy appears to be a robust <br/>\n&gt; independent risk factor for conduct disorder in male offspring. <br/>\n&gt; Maternal smoking during pregnancy may have direct adverse effects on <br/>\n&gt; the developing fetus or be a marker for a heretofore unmeasured <br/>\n&gt; characteristic of mothers that is of etiologic significance for conduct <br/>\n&gt; disorder.<br/>\n&gt; <br/>\n&gt; Lauren S. Wakschlag PHD; Benjamin B. Lahey PHD; Rolf Loeber PHD;<br/>\n&gt; Stephanie M. GreenMS; Rachel A. Gordon MA; Bennett L. Leventhal MD<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n </span></blockquote>Actually i didn&#39;t smoke during my other pregnancies. I wouldn&#39;t doubt<br/>\nthat some people would suggest putting my older son on Ritalin, but i<br/>\ndon&#39;t feel that medicating him is a good choice. I do feel that he is<br/>\nvery smart, creative and whatnot, and just needs to be nutured<br/>\ncorrectly as an individual, i&#39;m just still having trouble figuring out<br/>\nhow to do that.</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] putting my feet in the water","postDate":"1144778532","msgId":25107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhYTBjYmI0NGFmYmY2YWI4OTFlY2ZhMGVhNzg0NzQyQGNveC5uZXQ+","inReplyToHeader":"PDQ0M0JFQzM2LjYwODAzMDlAc2lvLm1pZGNvLm5ldD4=","referencesHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPiA8MmI0MTY2YzI5M2NlNDMzMDJmMzU1YjYyZGYxZmNhNmVAY294Lm5ldD4gPDQ0M0JFQzM2LjYwODAzMDlAc2lvLm1pZGNvLm5ldD4="},"prevInTopic":25106,"nextInTopic":25108,"prevInTime":25106,"nextInTime":25108,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... Yeah, I know.  It s really easy to dismiss any possibility that unschooled kids could have behavioral problems related to physical conditions because","messageBody":"<div id=\"ygrps-yiv-111469030\">On Apr 11, 2006, at 10:49 AM, diana jenner wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Nancy Wooton wrote:<br/>\n&gt;<br/>\n&gt;&gt; Method: Subjects were 177 clinic-referred boys, ages 7 to 12 years at<br/>\n&gt;&gt; the time of the first assessment, who underwent longitudinal <br/>\n&gt;&gt; assessment<br/>\n&gt;&gt; for 6 years using annual structured diagnostic interviews.<br/>\n&gt;&gt;<br/>\n&gt;&gt;<br/>\n&gt; Interesting, but please keep in mind that of 177 subjects, it&#39;s 177<br/>\n&gt; *schooled* subjects (schools, who rely on DSM IIIR diagnoses for <br/>\n&gt; federal<br/>\n&gt; funding).<br/>\n&gt;<br/>\n&gt; ~diana<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yeah, I know.  It&#39;s really easy to dismiss any possibility that <br/>\nunschooled kids could have behavioral problems related to physical <br/>\nconditions because studies are always done using the far-more numerous <br/>\nschool kids.  Homeschooled kids aren&#39;t subject to the kind of <br/>\nevaluations schooled kids are, so I think it&#39;s possible learning <br/>\ndifficulties, hearing problems, vision problems, etc. may be missed <br/>\nunless we *parents* are aware.<br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":194790463,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] putting my feet in the water","postDate":"1144777782","msgId":25106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ0M0JFQzM2LjYwODAzMDlAc2lvLm1pZGNvLm5ldD4=","inReplyToHeader":"PDJiNDE2NmMyOTNjZTQzMzAyZjM1NWI2MmRmMWZjYTZlQGNveC5uZXQ+","referencesHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPiA8MmI0MTY2YzI5M2NlNDMzMDJmMzU1YjYyZGYxZmNhNmVAY294Lm5ldD4="},"prevInTopic":25105,"nextInTopic":25107,"prevInTime":25105,"nextInTime":25107,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... Interesting, but please keep in mind that of 177 subjects, it s 177 *schooled* subjects (schools, who rely on DSM IIIR diagnoses for federal funding). ","messageBody":"<div id=\"ygrps-yiv-320864354\">Nancy Wooton wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Method: Subjects were 177 clinic-referred boys, ages 7 to 12 years at <br/>\n&gt;the time of the first assessment, who underwent longitudinal assessment <br/>\n&gt;for 6 years using annual structured diagnostic interviews. <br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>Interesting, but please keep in mind that of 177 subjects, it&#39;s 177 <br/>\n*schooled* subjects (schools, who rely on DSM IIIR diagnoses for federal <br/>\nfunding). <br/>\n<br/>\n~diana<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] putting my feet in the water","postDate":"1144776976","msgId":25105,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJiNDE2NmMyOTNjZTQzMzAyZjM1NWI2MmRmMWZjYTZlQGNveC5uZXQ+","inReplyToHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg==","referencesHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg=="},"prevInTopic":25102,"nextInTopic":25106,"prevInTime":25104,"nextInTime":25106,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"... It would have helped the discussion if you d mentioned this fact. And from your next post: This reminds me of a hurtful argument my mother and i had about","messageBody":"<div id=\"ygrps-yiv-165659729\">On Apr 11, 2006, at 7:04 AM, lilith_pouia wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Okay, i have been trying to take in the advice i&#39;ve been given. I had<br/>\n&gt; a good cry the other night, and have been reading more articles, and<br/>\n&gt; had long discussions with my husband. We have decided to try the no<br/>\n&gt; more punishment thing. I am scared though, of what might happen if it<br/>\n&gt; doesn&#39;t work or i break down and can&#39;t handle it. I&#39;m afraid of not<br/>\n&gt; being consistent with my children and them resenting me more for it.<br/>\n&gt; But maybe if i can ask questions as they come up, and as i learn more<br/>\n&gt; about the way you all are with your families i might get the hang of<br/>\n&gt; it. I&#39;ve realized it&#39;s true that i don&#39;t have to let it upset me when<br/>\n&gt; my kids break THEIR things, that the things become THEIRS when i give<br/>\n&gt; them to the kids and the things have to be THEIRS for them to ever<br/>\n&gt; learn how to care for THEIR things. And maybe i should find things to<br/>\n&gt; give them just so they can break them if that&#39;s what they like to do.<br/>\n&gt; It&#39;s true also that the value I put onto books is MY value, not<br/>\n&gt; THEIRS, and shouldn&#39;t be impossed on them if i want them to learn to<br/>\n&gt; think freely. I should let them learn THEIR OWN value for things like<br/>\n&gt; books and whatever else.<br/>\n&gt; The not throwing and runing in the house thing will be hard because i<br/>\n&gt; offer my kids alternatives like playing in the backyard and they<br/>\n&gt; always act as though they are being punished if i say &quot;Go outside if<br/>\n&gt; you want to wrestle, or rough house, run, throw, etc.&quot; Or i might say<br/>\n&gt; &quot;Why don&#39;t you guys go play baseball or hide and seek?&quot; But sometimes<br/>\n&gt; they just refuse my suggestions and continue being high strung<br/>\n&gt; indoors. So i have had a rule that if they won&#39;t calm down inside i<br/>\n&gt; make them go out back. They respond to this like a punishment.<br/>\n&gt; It&#39;s easy to say &quot;Well why don&#39;t you go play baseball with them?&quot; I<br/>\n&gt; suppose that&#39;s possible some of the time, but solutions like that<br/>\n&gt; aren&#39;t workable in reality 100% of the time. I&#39;m currently nine months<br/>\n&gt; pregnant,<br/>\n<br/>\n </span></blockquote>It would have helped the discussion if you&#39;d mentioned this fact.<br/>\n<br/>\nAnd from your next post:<br/>\n<br/>\n&quot;This reminds me of a hurtful argument my mother and i had about me<br/>\nquitting smoking last week. She really offended me by making a remark<br/>\nabout me leaving my children without a mother. I can see her point<br/>\nbetter now after reading this, though i feel she could have stated<br/>\nthings differently and less harassingly. I have tried to quit smoking<br/>\n  several times throughout the past year, and i felt she was being<br/>\nharassing as though i don&#39;t realize how important it is to quit. But i<br/>\njust wanted to share that i noticed this philosophy can be applied to<br/>\nanything we need to do to better ourselves, not just our parenting. It<br/>\ncould become &quot;too late&quot; for me to quit smoking, and i think maybe<br/>\nthat&#39;s all my mother was trying to explain to me.&quot;<br/>\n<br/>\nSo I&#39;m just guessing here that you smoked during your other pregnancies <br/>\nas well.  Have you considered that your two boys may have physiological <br/>\nconditions that are causing their behavior?  Upon reading the details <br/>\nyou&#39;ve posted, I&#39;ve begun to suspect that your boys are behaving <br/>\nabnormally.  What does their pediatrician say about their behaviors?  <br/>\nI&#39;m not trying to be mean or hurtful or judgmental, but you came to <br/>\nthis list asking for help from more experienced unschoolers, and I&#39;m <br/>\nprobably not the only one who&#39;s thinking along these lines.  You may <br/>\nneed medical intervention, rather than parenting advice.<br/>\n<br/>\nThis was from just one try googling &quot;smoking during pregnancy&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.chem-tox.com/pregnancy/smoking.htm\">http://www.chem-tox.com/pregnancy/smoking.htm</a><br/>\n<br/>\nSmoking During Pregnancy Increases Conduct Disorders<br/>\n<br/>\nSOURCE: Archives General Psychiatry, 54:670-676, July, 1997<br/>\n<br/>\nMore evidence on the connection between a mother&#39;s smoking during <br/>\npregnancy and increased risk of having a child with behavior disorders. <br/>\nBelow is a direct quote of the summary of the 1997 journal article <br/>\nreport in the Archives of General Psychiatry, 54:670, 1997.<br/>\n<br/>\nBackground: Previous animal and human studies have indicated that <br/>\nprenatal exposure to nicotine isassociated with adverse reproductive <br/>\noutcomes, including altered neural structure and functioning,cognitive <br/>\ndeficits, and behavior problems in the offspring. Our study extends <br/>\nprevious research onhumans by controlling a broad range of correlates <br/>\nof maternal smoking during pregnancy todetermine if smoking is <br/>\nassociated with behavior problems in the offspring severe enough to <br/>\nqualifyfor DSM-III-R diagnoses.<br/>\n<br/>\nMethod: Subjects were 177 clinic-referred boys, ages 7 to 12 years at <br/>\nthe time of the first assessment, who underwent longitudinal assessment <br/>\nfor 6 years using annual structured diagnostic interviews. Correlates <br/>\nof maternal smoking during pregnancy and previously identified <br/>\ndemographic, parental, perinatal, and family risk factors for the <br/>\ndisruptive behavior disorders were controlled in logistic regression <br/>\nanalyses.<br/>\n<br/>\nResults: Mothers who smoked more than half a pack of cigarettes daily <br/>\nduring pregnancy were significantly more likely to have a child with <br/>\nconduct disorder (odds ratio, 4.4; P=.001) than mothers who did not <br/>\nsmoke during pregnancy. This association was statistically significant <br/>\nwhen controlling for socioeconomic status, maternal age, parental <br/>\nantisocial personality, substance abuse during pregnancy, and <br/>\nmaladaptive parenting.<br/>\n<br/>\nConclusions: Maternal smoking during pregnancy appears to be a robust <br/>\nindependent risk factor for conduct disorder in male offspring. <br/>\nMaternal smoking during pregnancy may have direct adverse effects on <br/>\nthe developing fetus or be a marker for a heretofore unmeasured <br/>\ncharacteristic of mothers that is of etiologic significance for conduct <br/>\ndisorder.<br/>\n<br/>\nLauren S. Wakschlag PHD; Benjamin B. Lahey PHD; Rolf Loeber PHD;<br/>\nStephanie M. GreenMS; Rachel A. Gordon MA; Bennett L. Leventhal MD<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":211613748,"authorName":"lilith_pouia","from":"&quot;lilith_pouia&quot; &lt;lilith_pouia@...&gt;","profile":"lilith_pouia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"putting my feet in the water","postDate":"1144764269","msgId":25102,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxZ2QxZCtmbTMyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":25105,"prevInTime":25101,"nextInTime":25103,"topicId":25102,"numMessagesInTopic":0,"msgSnippet":"Okay, i have been trying to take in the advice i ve been given. I had a good cry the other night, and have been reading more articles, and had long discussions","messageBody":"<div id=\"ygrps-yiv-85741636\">Okay, i have been trying to take in the advice i&#39;ve been given. I had<br/>\na good cry the other night, and have been reading more articles, and<br/>\nhad long discussions with my husband. We have decided to try the no<br/>\nmore punishment thing. I am scared though, of what might happen if it<br/>\ndoesn&#39;t work or i break down and can&#39;t handle it. I&#39;m afraid of not<br/>\nbeing consistent with my children and them resenting me more for it.<br/>\nBut maybe if i can ask questions as they come up, and as i learn more<br/>\nabout the way you all are with your families i might get the hang of<br/>\nit. I&#39;ve realized it&#39;s true that i don&#39;t have to let it upset me when<br/>\nmy kids break THEIR things, that the things become THEIRS when i give<br/>\nthem to the kids and the things have to be THEIRS for them to ever<br/>\nlearn how to care for THEIR things. And maybe i should find things to<br/>\ngive them just so they can break them if that&#39;s what they like to do.<br/>\nIt&#39;s true also that the value I put onto books is MY value, not<br/>\nTHEIRS, and shouldn&#39;t be impossed on them if i want them to learn to<br/>\nthink freely. I should let them learn THEIR OWN value for things like<br/>\nbooks and whatever else.<br/>\nThe not throwing and runing in the house thing will be hard because i<br/>\noffer my kids alternatives like playing in the backyard and they<br/>\nalways act as though they are being punished if i say &quot;Go outside if<br/>\nyou want to wrestle, or rough house, run, throw, etc.&quot; Or i might say<br/>\n&quot;Why don&#39;t you guys go play baseball or hide and seek?&quot; But sometimes<br/>\nthey just refuse my suggestions and continue being high strung<br/>\nindoors. So i have had a rule that if they won&#39;t calm down inside i<br/>\nmake them go out back. They respond to this like a punishment.<br/>\nIt&#39;s easy to say &quot;Well why don&#39;t you go play baseball with them?&quot; I<br/>\nsuppose that&#39;s possible some of the time, but solutions like that<br/>\naren&#39;t workable in reality 100% of the time. I&#39;m currently nine months<br/>\npregnant, and can&#39;t leave food on the stove cooking, for instance, to<br/>\ngo play baseball.(My kids like to run and yell in the house when they<br/>\nknow i&#39;m busy with something hard to walk away from like cooking or an<br/>\nimportant phone call.) I also have so much to do preparing for the new<br/>\nbaby that can be and is put off to do things with them sometimes, but<br/>\nit can&#39;t always be that way. Yesterday, for instance, we played out<br/>\nback with water bombs and water guns all afternoon instead of me doing<br/>\nthe things i know i need to get done and now i&#39;ll have a heavier load<br/>\ntoday. But, i am willing to try.<br/>\nYesterday was our first day trying not to tell the kids what to do<br/>\nconstantly, and with no punishments and i already have a billion<br/>\nquestions.<br/>\nWhat do you do when your four year old wants to climb on the fence and<br/>\nit is sharp at the top? I felt i NEEDED to tell him not to do it.<br/>\nOr what if they want to drink the whole container of juice boxes in<br/>\none day and you know they will cry for the rest of the week that there<br/>\naren&#39;t anymore? Or what if they want to eat the things i buy<br/>\nspecically for my husband&#39;s lunches at work?(I do buy them their own<br/>\ntreats.)If they want to play in the pool, but you know it&#39;s not warm<br/>\nenough outside should you just let them do it anyway, and hope they<br/>\nlearn from it when they are cold? This is going to be so hard for me<br/>\nto learn. Also what do you do about them respecting YOUR things? They<br/>\nplay with my stuff, and jump on my bed, climb on the car, and get into<br/>\nmy husband&#39;s tools. By the way, i did not exaggerate about things<br/>\ngetting broken. My children have broken three or four windows within<br/>\nthe past year, and a ceiling fan, a floor fan and a light fixture.<br/>\nThat&#39;s aside from the books, toys and videos i throw away every time i<br/>\nclean their room. It&#39;s not that things MIGHT get broken at my house.<br/>\nThings DO get broken. And alot of times it&#39;s MY things. We have had a<br/>\nrule that if it&#39;s not yours don&#39;t play with it. I don&#39;t know what to<br/>\ndo about that. So if you all haven&#39;t given up on me because of my<br/>\nnegativity yet please help me figure some of this out.<br/>\nThanks,<br/>\nLilith mother of Tristan Michael(7), Danikan Amadeus(4), and soon to<br/>\nbe Jude Onyx</div>","specialLinks":[]}],"prevTopicId":25280,"nextTopicId":25233}}