{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":87403280,"authorName":"Jeff & Kate Kerr","from":"Jeff & Kate Kerr &lt;windystreet@...&gt;","profile":"saffronwoman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Re: defending children in public","postDate":"1035411466","msgId":47598,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEQjcyMDAxLkExNkQ5QzFFQGVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":47597,"nextInTime":47599,"topicId":47598,"numMessagesInTopic":0,"msgSnippet":"... I ve stopped people on a few occasions from harming children, including one woman who was hitting her child yelling at him hitting it not ok! I was","messageBody":"<div id=\"ygrps-yiv-1760795017\"><blockquote><span title=\"ireply\">&gt; ****&lt;&lt;&lt;&gt; How exactly do you approach a situation like this?  I have the hardest time<br/>\n&gt; &gt; in public when I witness other parents being hurtful to their children (not<br/>\n&gt; &gt; just through spanking but through belittling, saying hurtful things, etc).<br/>\n&gt; &gt; I&#39;m always hesitant to, as you say, scold the parents because I&#39;m afraid<br/>\n&gt; &gt; the kid will just get it even more once they get home for &quot;embarassing&quot;<br/>\n&gt; &gt; their mother, or making her &quot;look bad.&quot;  Do you think that&#39;s possible?<br/>\n&gt; &gt; That the mother will feel insulted and embarrassed and take it out on her<br/>\n&gt; &gt; child even more later?  It seems I&#39;ve often heard that caution when it<br/>\n&gt; &gt; comes to defending children that way.<br/>\n&gt; &gt; Still, I want to come up with something to say.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Thanks, Patti, for asking the question I was about to. :) I feel like such a<br/>\n&gt; useless LUMP when I see this stuff going on, I wouldn&#39;t mind some advice on<br/>\n&gt; how to and when to say things, too.<br/>\n&gt;<br/>\n&gt; If the advice is, &quot;just grow a backbone and do it&quot;  I&#39;m okay with that.<br/>\n&gt;<br/>\n&gt; Pam&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; A friend and I were shopping at the local Wal-mart in the clothing isles.  We looked over, saw an (approx.) 2 y/o standing<br/>\n&gt; in the seat part of the cart.  So very unsafe.  The mother was turned the other direction, looking at a rack of something<br/>\n&gt; or other.  We rushed over and said, &quot;oh sweetie, please sit down so you don&#39;t fall!&quot;  The mother looked at us with almost<br/>\n&gt; an evil look and said, &quot;I had her standing there to hold these shirts up to her.  She is fine.&quot;  Whoa!  We thought we were<br/>\n&gt; being completely helpful.  Being an x-ray tech, I have seen too many needless fractures in children because the parents<br/>\n&gt; were inattentive.  Not to mention sometimes, just plain stupid.  We saw her again later, the child continuing to be a<br/>\n&gt; monkey on the cart, balancing precariously, surely to fall any minute.  I don&#39;t know if she ever did injure herself, but<br/>\n&gt; it made me very nervous.<br/>\n&gt;<br/>\n&gt; What to do then?  She wasn&#39;t &#39;abusing&#39; the child.  Just neglectful or maybe irresponsible.<br/>\n&gt;<br/>\n&gt; Kimber****<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I&#39;ve stopped people on a few occasions from harming children, including<br/>\none woman who was hitting her child yelling at him &quot;hitting it not ok!&quot;<br/>\nI was flabbergasted and in a split second I realized that I was probably<br/>\nnever going to see these people again (I was living in San Francisco at<br/>\nthe time - lots of people) so I screwed up my courage and asked her if<br/>\nthere was a problem and was there anything I could do to help.  It must<br/>\nhave been enough because she calmed down and stopped.<br/>\n<br/>\nI think the best thing is to be honest to yourself and &quot;grow and<br/>\nbackbone and do it.&quot;<br/>\n<br/>\nKate,<br/>\nwho spanked her youngest once and will probably never forgive herself<br/>\nfor it but has never done it again because I&#39;ve learned that being with<br/>\nher and listening to her is much more effective.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":47557,"nextTopicId":47601}}