{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Kolleen","from":"Kolleen &lt;Kolleen@...&gt;","profile":"kaydeecross","replyTo":"LIST","senderId":"DvruLMcYmpxseGV-0MbJqCHL7of7sFb2_wyw56vkOCHEPcFoR-s-hLFa7QzVwGOvztrvo3CCKOed4Do7eWWsbQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] a spirited listserv!","postDate":"1006448871","msgId":28334,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBhNjQyMDQwOTE3MTZiMU5ZQ1NNVFAzQG55Yy5yci5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":28333,"nextInTime":28335,"topicId":28334,"numMessagesInTopic":0,"msgSnippet":"Hello all, I m new to the list here and I found myself becoming a member during a very spirited time! What a great group of strongly opinionated familys... of","messageBody":"<div id=\"ygrps-yiv-1655908045\">Hello all,<br/>\n<br/>\nI&#39;m new to the list here and I found myself becoming a member during a <br/>\nvery spirited time!<br/>\n<br/>\nWhat a great group of strongly opinionated familys... of course with the <br/>\nnormal amount of misunderstandings when people with different belief <br/>\nsystems come together.<br/>\n<br/>\nAlthough I did already jump right in and respond to something, I&#39;d like <br/>\nto take the time here to respond to a few issues - in one post.<br/>\n<br/>\nOf course, that was yesturday that I read the hoards of posts and my <br/>\nmemory for detail left me YEARS ago... heregoes...<br/>\n<br/>\n__________________<br/>\n<br/>\n**Spare the rod, spoil the child: this amazes me... a book that has been <br/>\ntranslated from ancient tongues, that is full of meanings that are NOT to <br/>\nbe taken literally.. I find it interesting how people will find sources <br/>\nto back up their beleifs. I do it to when it comes to my beleifs in <br/>\nattachment parenting, family beds, extended nursing etc.<br/>\n<br/>\nI do remember reading an interpretation of this quote, and can&#39;t remember <br/>\nthe source. I&#39;ll make it a point to try and find it soon. The writer felt <br/>\nthat this too wasn&#39;t literal and explained what the word &#39;rod&#39; meant <br/>\n(knowledge). Of course I don&#39;t beleive everything I read, but it was an <br/>\ninteresting outlook on something _I_ feel is brutal.<br/>\n<br/>\nAnd yes, I do read the bible once a year, so I am familiar with it.<br/>\n<br/>\n_________________<br/>\n<br/>\n**Quantum Physics, snake oil, paradigms and truths: People get very <br/>\ndefensive when their beleif system is questioned, even when presented <br/>\nwith facts (such as thirmisol in vaccinations, pesticides in foods, etc).<br/>\n<br/>\nThis is going to be a no-win conversation since each person needs to <br/>\ndecide for themself which truth works best for them or their family.<br/>\n<br/>\nI have a sister in quantumn healing (the WHO and the CDC still consult <br/>\nher monthly) and a niece that oversees research for one of the biggest <br/>\ndrug companys. You can imagine how our holidays go! But we all walk away <br/>\nwith respect for eachother&#39;s beliefs. And the ones that are undecided, <br/>\nget to hear both sides and decide for themselves.<br/>\n<br/>\n<br/>\n_________________<br/>\n<br/>\n**Someone mentioned (again, I read a lot of posts!) something about a <br/>\n&#39;newcomer&#39; to the list speaking their opinion.<br/>\n<br/>\n_I_ feel this is an unfortunate attitude to have about listservs.<br/>\n<br/>\nI have been using the internet since the mid 80s. Before the world wide <br/>\nweb and it was only command line interface back then. There was no GUI <br/>\nand no help boxes and one had to know what they were doing to have a <br/>\ndiscussion group. We used proggies like Hermes and ARPAnet for access. <br/>\nSometimes, it was dialup across the country just to learn something new <br/>\nfrom the people writing the code. It was 99.9% men and there was still <br/>\nmutual respect for the opinions of others.<br/>\n<br/>\nAs far as I&#39;m concerned, most the world is &#39;new&#39; to listservs... and its <br/>\ngreat that now we have even more people to communicate and share ideas <br/>\nwith. Isn&#39;t technology wonderful?<br/>\n<br/>\n_________________<br/>\n<br/>\n<br/>\n**Children, chores and unparenting: I can see myself in so many of the <br/>\nposts. And I can see where a lot of the differences lie.<br/>\n<br/>\nYes, children will help as part of the household (here&#39;s the trick) when <br/>\nBOTH the parents have a respect for the house.<br/>\n<br/>\nIf you have a SUPPORTIVE partner, then unschooling will work no matter <br/>\nwhat.<br/>\n<br/>\nIf your partner isn&#39;t supportive, then you will be a frustrated person <br/>\nand unschooling might be constant unwinding from the atmosphere.<br/>\n<br/>\nIts very hard when someone who has a supportive partner to understand why <br/>\nsome people resond with anger and with frustration. They might not know, <br/>\nor it was too long ago for them to remembe, how hard it is to feel so <br/>\nisolated in your beleifs when everyone, I mean EVERYONE is pulling on <br/>\ntheir life force telling them that they&#39;re wrong.<br/>\n<br/>\nIts also hard for someone without any kind of support network (just one <br/>\nf2f erson at least!) to see how life flows easily when the support IS <br/>\nthere. This is a difficult mindset to be in, I hope we all have some sort <br/>\nof patience for the pain involved here.<br/>\n<br/>\n<br/>\n________________<br/>\n<br/>\nIf you got this far, I&#39;m quite impressed!<br/>\n<br/>\n<br/>\nWarm Regards,<br/>\nKolleen</div>","specialLinks":[]}],"prevTopicId":28331,"nextTopicId":28273}}