{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":139549710,"authorName":"Olga","from":"&quot;Olga&quot; &lt;britcontoo@...&gt;","profile":"britcontoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: How&#39;s unschooling, was cluelessness","postDate":"1053106664","msgId":69417,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJhMzdsOSt2dThwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE1ZS4xZmY2NDE0YS4yYmY2NjA3MkBhb2wuY29tPg=="},"prevInTopic":69391,"nextInTopic":0,"prevInTime":69416,"nextInTime":69418,"topicId":69391,"numMessagesInTopic":0,"msgSnippet":"We spent the whole morning at the beach.  My gf whose daughter is in preschool got to play hooky and us and our combined group of 5 kids went.  It was a","messageBody":"<div id=\"ygrps-yiv-1706992235\">We spent the whole morning at the beach.  My gf whose daughter is in <br/>\npreschool got to play hooky and us and our combined group of 5 kids <br/>\nwent.  It was a beautiful day with a calm ocean!  We talked about the <br/>\ntide and what makes the waves.  Keiran, 4 is getting more and more <br/>\ncomfortable and just laying in the waves and my 2yo let me take him <br/>\nout swimming.  I can already see such a difference between our kids.  <br/>\nKeiran is still innocent, trying to kiss her dd and she was <br/>\ngoing &quot;yuck&quot;.  It was funny, Keiran hugs and kisses everyone with <br/>\nNO &quot;romantic&quot; intent but she is already picking out boyfriends at <br/>\nschool.  She also uses terms like &quot;scaredy cat&quot;.  I took time to <br/>\nexplain that one to her!   Funny, because her mom would just say <br/>\nthats not nice, but I really wanted her to understand that comment.  <br/>\nDifferent parenting equals different kids, the real communication <br/>\nmakes such a big difference :)  <br/>\n<br/>\nI kept thinking how lucky we were that this was our life, not a day <br/>\noff, not hooky.  My gf was laughing saying her daughter got ready <br/>\nwith no arguement this morning to go have a day off.  What she <br/>\nprobably does not realize is that while her daughter still has some <br/>\nlevel of fun in school, she is already balking at going and all they <br/>\ndo is play all day.  She will most likely be in for some trouble when <br/>\nreal school starts.  Now me, I will be pleasantly collecting shells <br/>\nwith the boys :)<br/>\n<br/>\n<br/>\nOlga :)<br/>\n..who needs a pool..I have the whole ocean :)<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, ejcrewe@a... wrote:<br/>\n&gt; <br/>\n&gt; &gt; So, how&#39;s unschooling going?<br/>\n&gt; &gt; <br/>\n&gt; Just when I was starting to have doubts, after being around nieces <br/>\nand <br/>\n&gt; nephews and such, Nathan (almost 5) said to me at breakfast two <br/>\nweeks ago <br/>\n&gt; &quot;Mommy, that sign says AAAAA-LLLLL-SSSS.&quot;  (Al&#39;s Charhouse)<br/>\n&gt; <br/>\n&gt; We&#39;ve spent a lot of time in dirt and mud recently, trying to get a <br/>\ngarden <br/>\n&gt; in.  Dirt and a flotilla of trucks on the driveway.  Wheelbarrow <br/>\nrides.  Worm <br/>\n&gt; catching, seed scattering, hay strewing (and feeding to hobby <br/>\nhorses).  Two <br/>\n&gt; weeks of rain, flooded back yard, dead baby opossum on the deck. <br/>\nMUD on the <br/>\n&gt; driveway.  Rolling and luxuriating in the mud.  My daughter (almost <br/>\n4) got <br/>\n&gt; stuck in her pjs the day it started raining - she had to check to <br/>\nmake sure <br/>\n&gt; it turned into mud.  Stripped down in the rain and made it back <br/>\ninside <br/>\n&gt; without a whimper.  Slathered mud all over the steps and the <br/>\nkitchen walls <br/>\n&gt; and went back to watching Sesame Street.  The seeds are sprouting, <br/>\nmuch <br/>\n&gt; excitement.  More rain, spent time in Grandma&#39;s basement during a <br/>\ntornado <br/>\n&gt; warning, got a cold, read lots of books.<br/>\n&gt; <br/>\n&gt; We&#39;ve also been weaving a baby blanket for a friend.  We set up the <br/>\nnew to us <br/>\n&gt; loom, learned how to live with it, wound a warp, tangled up a whole <br/>\nmess of <br/>\n&gt; cotton yarn, sleyed the reed and threaded the heddles, wound <br/>\nbobbins for the <br/>\n&gt; boat shuttles, measured out the progress, made a color spreadsheet <br/>\nof the <br/>\n&gt; template and started weaving away.  The kids love being woken in <br/>\nthe morning <br/>\n&gt; to the sound of the loom, the soothing wood and metal.  They love <br/>\nshooting <br/>\n&gt; the shuttle across and beating it in.  Unfortunately, they love to <br/>\nretie the <br/>\n&gt; treadles, which can really mess up the pattern, but I&#39;ve learned to <br/>\ncheck it. <br/>\n&gt;  Nathan has asked for a big boy blanket because he&#39;s turning 5 and <br/>\nno longer <br/>\n&gt; chews on his blankie.  I need to learn to double weave.<br/>\n&gt; <br/>\n&gt; All this has brought life sciences, math, literature and great <br/>\npleasure to <br/>\n&gt; our lives.  Thanks for getting a new thread going, cluelessness is <br/>\ntiresome.<br/>\n&gt; <br/>\n&gt; Elizabeth<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":123374705,"authorName":"ejcrewe@aol.com","from":"ejcrewe@...","profile":"ejcrewe2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] How&#39;s unschooling, was cluelessness","postDate":"1053099634","msgId":69391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1ZS4xZmY2NDE0YS4yYmY2NjA3MkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":69417,"prevInTime":69390,"nextInTime":69392,"topicId":69391,"numMessagesInTopic":0,"msgSnippet":"... Just when I was starting to have doubts, after being around nieces and nephews and such, Nathan (almost 5) said to me at breakfast two weeks ago Mommy,","messageBody":"<div id=\"ygrps-yiv-1031135340\"><blockquote><span title=\"ireply\">&gt; So, how&#39;s unschooling going?<br/>\n&gt; <br/>\n </span></blockquote>Just when I was starting to have doubts, after being around nieces and <br/>\nnephews and such, Nathan (almost 5) said to me at breakfast two weeks ago <br/>\n&quot;Mommy, that sign says AAAAA-LLLLL-SSSS.&quot;  (Al&#39;s Charhouse)<br/>\n<br/>\nWe&#39;ve spent a lot of time in dirt and mud recently, trying to get a garden <br/>\nin.  Dirt and a flotilla of trucks on the driveway.  Wheelbarrow rides.  Worm <br/>\ncatching, seed scattering, hay strewing (and feeding to hobby horses).  Two <br/>\nweeks of rain, flooded back yard, dead baby opossum on the deck. MUD on the <br/>\ndriveway.  Rolling and luxuriating in the mud.  My daughter (almost 4) got <br/>\nstuck in her pjs the day it started raining - she had to check to make sure <br/>\nit turned into mud.  Stripped down in the rain and made it back inside <br/>\nwithout a whimper.  Slathered mud all over the steps and the kitchen walls <br/>\nand went back to watching Sesame Street.  The seeds are sprouting, much <br/>\nexcitement.  More rain, spent time in Grandma&#39;s basement during a tornado <br/>\nwarning, got a cold, read lots of books.<br/>\n<br/>\nWe&#39;ve also been weaving a baby blanket for a friend.  We set up the new to us <br/>\nloom, learned how to live with it, wound a warp, tangled up a whole mess of <br/>\ncotton yarn, sleyed the reed and threaded the heddles, wound bobbins for the <br/>\nboat shuttles, measured out the progress, made a color spreadsheet of the <br/>\ntemplate and started weaving away.  The kids love being woken in the morning <br/>\nto the sound of the loom, the soothing wood and metal.  They love shooting <br/>\nthe shuttle across and beating it in.  Unfortunately, they love to retie the <br/>\ntreadles, which can really mess up the pattern, but I&#39;ve learned to check it. <br/>\n Nathan has asked for a big boy blanket because he&#39;s turning 5 and no longer <br/>\nchews on his blankie.  I need to learn to double weave.<br/>\n<br/>\nAll this has brought life sciences, math, literature and great pleasure to <br/>\nour lives.  Thanks for getting a new thread going, cluelessness is tiresome.<br/>\n<br/>\nElizabeth<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":69409,"nextTopicId":69419}}