{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"gk5yk-yAcEFnW05hJQGxRyG5dc6xU73qz9JrnhfuB3QA1TKqJp6-BMCvBNMYdFJ8o6UF4I__o9SwJXMgktASysz1EgHeAQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japan news: Okinawa alternative school","postDate":"971234786","msgId":13639,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMDExMDMyNi5NQUEwMDEzMkBzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13638,"nextInTime":13640,"topicId":13639,"numMessagesInTopic":0,"msgSnippet":"Hello again all, If there has been any positive side-effect of the ongoing education crisis in Japan, it may be the willingness of the Japanese news media to","messageBody":"<div id=\"ygrps-yiv-625891411\">Hello again all,<br/>\n<br/>\nIf there has been any positive side-effect of the ongoing &quot;education <br/>\ncrisis&quot; in Japan, it may be the willingness of the Japanese news media to <br/>\nrespectfully consider educational alternatives such as homelearning, free <br/>\nschools and the like.<br/>\n<br/>\nFollowing in that same vein is a story here that was carried a few days <br/>\nago in a major Japanese daily paper. This article is about an alternative <br/>\nschool in Okinawa that, like many other such institutions, is helping to <br/>\nredefine the concept of &quot;contemporary education&quot; in Japan.<br/>\n<br/>\nEnjoy,<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nOsaka, Japan<br/>\n<br/>\n-------------------------<br/>\n<br/>\n8 October 2000<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.asahi.com/english/asahi/1008/asahi100810.html\">http://www.asahi.com/english/asahi/1008/asahi100810.html</a><br/>\n<br/>\n<br/>\nCHILD&#39;S INTEREST COMES FIRST<br/>\n<br/>\nby Kazuko Fujimoto<br/>\nSpecial to Asahi Evening News<br/>\n<br/>\n<br/>\nIs there room in Japan&#39;s rigid school system for a school that aims to <br/>\nhelp each student cultivate his or her particular talents? Not likely, <br/>\nwould be the reply of pessimists, who tend to associate this country&#39;s <br/>\nschools with such terms as &quot;standardized&quot; and &quot;control.&quot;<br/>\n<br/>\nBut an attempt to prove them wrong is being undertaken by students and <br/>\ntheir instructors at the Dream Planet International School, which opened <br/>\na year and a half ago in Okinawa Prefecture.<br/>\n<br/>\nBreaking with tradition, the school has no end-of-term exams or report <br/>\ncards, and the students are not required to attend lessons that do not <br/>\ninterest them.<br/>\n<br/>\nTo cap its unconventionality, the school was founded by a young <br/>\nvisionary, a woman who had perceived the shortcomings of Japanese schools <br/>\nas a child. &quot;Asu wo Tsukamu Gakko&quot; (&quot;&#39;Seize the Dream&#39; School,&quot; published <br/>\nby Home-sha Inc., 1,500 yen) describes the path taken by Tomoko Shirai, <br/>\nDream Planet&#39;s 27-year-old principal, as well as the budding <br/>\ninstitution&#39;s eventful first year.<br/>\n<br/>\nThe future author was 4 years old when her engineer father was <br/>\ntransferred to Sydney. Tomoko did not utter a word during her year at <br/>\nkindergarten in Australia but she remembers learning &quot;to observe my <br/>\nsurroundings and perceive what lies in and behind other people&#39;s <br/>\nexpressions and words.&quot;<br/>\n<br/>\nA lasting impression<br/>\n<br/>\nYears later, that gift was to help her immensely in dealings with her own <br/>\nstudents. Encouraged by her Australian classmates and teachers, she <br/>\neventually opened up and was impressed by a system that respected each <br/>\npupil&#39;s individuality.<br/>\n<br/>\nAt age 8 she returned to Japan and entered a public primary school where <br/>\nbullying was rampant and the teachers were caught up in union struggles.<br/>\n<br/>\nWitnessing an incompetent teacher hit pupils who had poor grades, young <br/>\nTomoko began to question the notion that grades were a good measure of <br/>\nthe child&#39;s worth. Upon graduating from a private senior high, she <br/>\nproceeded to the University of Tokyo, fully expecting to meet &quot;capable, <br/>\ninteresting people.&quot;<br/>\n<br/>\nThe prestigious school comprising &quot;elitist students who believed that <br/>\ngood grades made them better people&quot; disappointed Shirai, who began <br/>\nsearching for a vocation at an early stage.<br/>\n<br/>\nA friend to whom she confided that she wanted to be of use to people <br/>\nappalled her by replying: &quot;I don&#39;t have any particular ambition in mind <br/>\nso I might as well become a public servant.&quot; (The friend went on to join <br/>\nthe Ministry of Finance.)<br/>\n<br/>\nAfter she graduated, Shirai joined the Matsushita Institute of Government <br/>\nand Management, established by the industrialist Konosuke Matsushita to <br/>\ndevelop future leaders. She finally decided to focus on &quot;reform of <br/>\nprimary-school education&quot; and spent the next two years visiting 100 <br/>\nschools in Japan and abroad.<br/>\n<br/>\nRealizing at last that reforming the system would simply take too long, <br/>\nShirai hit upon the idea of founding her own school.<br/>\n<br/>\nHelp came in the person of Masayuki Makino, director of the Okinawa-based <br/>\nCreative Artist Academy, whose graduates include the top pop singer Namie <br/>\nAmuro.<br/>\n<br/>\nWhen they realized that they shared the same vision, Shirai and Makino <br/>\ndecided to open a 12-year international school with the motto: Only One. <br/>\nSome 1,200 inquiries poured in from around Japan despite the fact that <br/>\nthe Dream Planet diploma is not recognized within the Japanese school <br/>\nsystem.<br/>\n<br/>\nShirai had a hard time finding a school building, since more than one <br/>\nmunicipality was swayed by the groundless rumor that Dream Planet was to <br/>\nbe a &quot;school for dropouts and delinquents.&quot; Her search came to an end <br/>\nwhen the owner of a resort hotel in Onnason village offered her use of <br/>\nthe building&#39;s first floor.<br/>\n<br/>\nIn April last year the Dream Planet International School welcomed its <br/>\nfirst 125 scholars, some of whom became boarders. The 15 instructors <br/>\nShirai had selected were asked to awaken each student&#39;s interest rather <br/>\nthan to &quot;teach&quot; in conventional ways.<br/>\n<br/>\nWhen they arrived at this new school where no subject matter was <br/>\ncompulsory, many students felt daunted by the prospect of discovering <br/>\ntheir own dream. At all times they were encouraged to pursue their <br/>\nstudies, and delve into personal projects, with one basic criterion in <br/>\nmind: to follow whatever interested them.<br/>\n<br/>\nDuring the initial months, however, the school lapsed into a &quot;lawless <br/>\nstate&quot; as students mistook &quot;self-interest&quot; for &quot;freedom.&quot; Shirai and her <br/>\nstaff spent hours talking with each student in a bid to help everyone <br/>\ndiscard certain traits he or she might have picked up over the year -- be <br/>\nit unbridled egotism, opportunism, an inferiority complex or excessive <br/>\nfaith in grades.<br/>\n<br/>\nWhen one student lamented that she had no friends, Shirai advised her to <br/>\ntake her time since &quot;making friends is possible only after you have <br/>\ntrained yourself to stand on your own.&quot;<br/>\n<br/>\nNot without her critics<br/>\n<br/>\nAs the months went by, the students began to change and, by the end of <br/>\nthe first semester, writes Shirai, &quot;the sparkle was back in the <br/>\nchildren&#39;s eyes.&quot;<br/>\n<br/>\nSince its opening, Dream Planet has attracted many visitors, ranging from <br/>\naspiring students to educators and politicians. An education critic <br/>\nskeptical of the Dream Planet approach once asked Shirai how she expected <br/>\nher students to acquire &quot;basic scholastic skills&quot; taught in primary and <br/>\njunior high schools everywhere else.<br/>\n<br/>\nWhile not making light of their importance, Shirai does not believe that <br/>\nchildren need to learn the same thing at the same time or be told off for <br/>\nfailing to do so. What she does believe is that &quot;recognizing where <br/>\nchildren&#39;s talent lies, and helping bring out their personalities and <br/>\nrefine their communication skills, count more than simply teaching them <br/>\nhow to read and write or to obey the rules.&quot;<br/>\n<br/>\n--------------------------------------<br/>\nKazuko Fujimoto is a Tokyo-based free-lance writer.<br/>\n<br/>\n<br/>\nCopyright 2000 Asahi Shimbun</div>","specialLinks":[]}],"prevTopicId":13638,"nextTopicId":13642}}