{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Getting to bed (was Tools ofconvincing)","postDate":"1033643078","msgId":45172,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5QzE5Qzg2LkRCRTUlZmV0dGVyb2xsQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDNEOUJBM0YxLjU1M0UxNkU2QGNveC5uZXQ+"},"prevInTopic":45147,"nextInTopic":0,"prevInTime":45171,"nextInTime":45173,"topicId":45147,"numMessagesInTopic":0,"msgSnippet":"... It s not a rule. It s the absence of rules. It s a blank slate to use as a beginning point to find the best ways to meet each child s specific needs. In","messageBody":"<div id=\"ygrps-yiv-384625340\">on 10/2/02 9:57 PM, Lisa M. C. Bentley at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:cottrellbentley@...\">cottrellbentley@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I only say all this so that those of you who have such strict &quot;No<br/>\n&gt; Bedtime&quot; rules can see that the rigidness of that statement is just as<br/>\n&gt; unhealthy as the rigidness of an arbitrary bedtime based on what the<br/>\n&gt; clock says.<br/>\n<br/>\n </span></blockquote>It&#39;s not a rule. It&#39;s the absence of rules. It&#39;s a blank slate to use as a<br/>\nbeginning point to find the best ways to meet each child&#39;s specific needs.<br/>\nIn your daughter&#39;s case it would be helping her to recognize the signs of<br/>\ntiredness -- without telling her what she&#39;s feeling if that doesn&#39;t work ;-)<br/>\n-- by starting bedtime routines or things that were calming and relaxing for<br/>\nher when tiredness was starting to show or darkness was coming on. Good<br/>\nthings that she wanted to do. Not in a &quot;this is what you need so this is<br/>\nwhat we&#39;re going to do&quot; way.<br/>\n<br/>\nI think the identifying problems and seeking solutions part of the process<br/>\ndoesn&#39;t get enough &quot;air time&quot; because these discussions almost always take<br/>\noff after someone insists that rules are necessary or insists people are<br/>\nsuggesting hands-off parenting. So everyone&#39;s concentrating on discussing<br/>\nthe no rules part and what parents do instead of rules is said but no one<br/>\nnotices it in all the noise about no rules.<br/>\n<br/>\nEven blank slate doesn&#39;t get to the idea since it will lead a rules type to<br/>\nthe conclusion that it means rules are based on a child&#39;s needs rather than<br/>\nage, like 8PM bedtime for one child and 9PM for another child who needs less<br/>\nsleep.<br/>\n<br/>\nGetting from the idea of parents finding the proper size container for<br/>\noptimal child growth to the idea of nurturing growth in the container that<br/>\nlife provides is hard! Our society just doesn&#39;t have a ready-made model of<br/>\nthe second to describe what people mean when they say no rules. So people<br/>\ntrying to understand it put the ideas into the models they already know:<br/>\npermissiveness, hands-off parenting, letting the kids raise themselves, Lord<br/>\nof the Flies (someone mentioned recently).<br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":100122184,"authorName":"Lisa M. C. Bentley","from":"&quot;Lisa M. C. Bentley&quot; &lt;cottrellbentley@...&gt;","profile":"cottrellbentley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Getting to bed (was Tools ofconvincing)","postDate":"1033610225","msgId":45147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNEOUJBM0YxLjU1M0UxNkU2QGNveC5uZXQ+","referencesHeader":"PDUuMS4wLjE0LjAuMjAwMjEwMDIwMDM1NTQuMDBhOGUyZDBAbWFpbC5nYWlhd29sZi5vcmc+"},"prevInTopic":0,"nextInTopic":45172,"prevInTime":45146,"nextInTime":45148,"topicId":45147,"numMessagesInTopic":0,"msgSnippet":"I agree with the arbitrary bedtime thing being completely unfair to children.  My youngest (just turned 2) has no bedtime and my oldest (just turned 6) didn t","messageBody":"<div id=\"ygrps-yiv-610606253\">I agree with the arbitrary bedtime thing being completely unfair to<br/>\nchildren.  My youngest (just turned 2) has no bedtime and my oldest<br/>\n(just turned 6) didn&#39;t until very recently.  Here is why she does now: <br/>\nZoë is a child that cannot sleep in the day, even if the room is pitch<br/>\nblack.  She gave up naps when she was about 3 weeks old or so.  There is<br/>\nsomething in her physical body that makes her need nighttime hours to<br/>\nsleep.  She has been like this since the day she was born and if I<br/>\nwasn&#39;t holding her she would not sleep ever until she was a little over<br/>\n3 years (I became very capable of using the toilet whilst holding her). <br/>\nShe also has no sense of tiredness in herself.  If you ask her if she is<br/>\ntired, the answer will always be no.  If you tell her that the signs<br/>\nthat her body is showing are sleepy signs, she will argue and stay up<br/>\neven longer.<br/>\n<br/>\nMost children have the ability to go to sleep after a while from sheer<br/>\nexhaustion.  Not this child.  We&#39;ve seen her literally stay up for 3<br/>\ndays straight and only then collapse with breastfeeding (if I happened<br/>\nto not be home, she would not go to sleep).  We&#39;ve started having<br/>\nbehavioral problems that affect the entire family due to her being able<br/>\nto live (but NOT thrive) on 4 or so hours of sleep.  DH and I prefer to<br/>\ngo to bed between 12 and 2AM, and so we always had her do the same with<br/>\nus.  This DOES NOT work if the child will wake up at 6AM.  Children<br/>\nreally do need more sleep than adults.  They are growing!  The younger<br/>\nthe child, the more they need to sleep (although teenagers need quite a<br/>\nlot of sleep, too).  I need 9 hours of sleep to feel refreshed, but I<br/>\nseldom get more than 6 myself.  My daughter is not a nice person to be<br/>\naround unless she has had at least 8 (preferably 10).  She has never<br/>\nslept in a car, not even on a 24 hour straight drive that we did when<br/>\nshe was almost 3.<br/>\n<br/>\nFor her health and every one in this house&#39;s sanity, we started a<br/>\nbedtime with her.  She understands it, but doesn&#39;t always agree with<br/>\nit.  On the days that we have &quot;allowed&quot; her to stay up late (traveling,<br/>\nguests, just because, etc.), we have all (including her!)regretted it<br/>\nfor about 3-4 days<br/>\nlater.  It really takes her that long to get back into a good sleep<br/>\ncycle.  It also takes her about 1.5-2 hours to wind down BY HERSELF to<br/>\nbe able to fall asleep.  If someone checks in on her, the clock starts<br/>\nall over again and we regret it for days.  We are always gentle and kind<br/>\nin this, but she NEEDS this for her health.  I hate it, but she loves it<br/>\nand is thriving on this routine.  I, personally, hate routines and love<br/>\nto do things on the spot.  She hates that, and her needs and wants come<br/>\nbefore mine.  It took us 5.5 years of living her need for consistent<br/>\ngoing to sleep time for us to come to the conclusion that she needs a<br/>\nbedtime.  DH and I always felt that bedtimes were horrible and cruel for<br/>\nus as children, however we both could sleep anywhere as children.  This<br/>\nchild cannot and will not.  It is physically impossible for her.  <br/>\n<br/>\nI only say all this so that those of you who have such strict &quot;No<br/>\nBedtime&quot; rules can see that the rigidness of that statement is just as<br/>\nunhealthy as the rigidness of an arbitrary bedtime based on what the<br/>\nclock says.  My daughter&#39;s bedtime is based on sunset and she rises<br/>\naround sunrise, her physical choice of hours- definitely NOT mine.  This<br/>\nhas made us all live in less of a sleep deprived zombie state and it is<br/>\na wonderful live saver.  I am NOT a good mother when I haven&#39;t slept in<br/>\ndays and she is not a very nice person when she hasn&#39;t slept, either.<br/>\n<br/>\n-Lisa<br/>\n<br/>\nP.S.  We coslept with her until age 4.5.  I breastfed her daily until<br/>\nage 4ish, then periodically even still (all her choice).  She gets loads<br/>\nof physical contact, so please don&#39;t try to say that I wasn&#39;t fulfilling<br/>\nher physical contact needs as an infant.  I definitely have been doing<br/>\nthis.  What I wasn&#39;t fulfilling was her lack of physical contact needs. <br/>\nShe has proven to me that quite a few people NEED time alone.  Her<br/>\nbedtime<br/>\nactually makes me sad, since I love to be with her, it is her that<br/>\ndoesn&#39;t do well with us.  Her bedtime is completely for her and has<br/>\nnothing to do with the needs of the parents.</div>","specialLinks":[]}],"prevTopicId":44907,"nextTopicId":33212}}