{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":3899762,"authorName":"coyote&#39;s corner","from":"&quot;coyote&#39;s corner&quot; &lt;jana@...&gt;","profile":"calourojm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Fw: Rachel #764: Children&#39;s Health Declining","postDate":"1050785748","msgId":65498,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNmEwMWMzMDZiNiQwZTNlYjEzMCQ2ODAxYThjMEBBb3Blbj4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":65497,"nextInTime":65499,"topicId":65498,"numMessagesInTopic":0,"msgSnippet":"This is one of the newsletters I receive. I ll not say anything - you can come to your own conclusions. (It s so hard to keep my mouth shut!!!) coyote ... ","messageBody":"<div id=\"ygrps-yiv-671834413\">This is one of the newsletters I receive. I&#39;ll not say anything - you can<br/>\ncome to your own conclusions.<br/>\n(It&#39;s so hard to keep my mouth shut!!!)<br/>\ncoyote<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &quot;Rachel News&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:rachel-replies@...\">rachel-replies@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:RACHEL-NEWS@...\">RACHEL-NEWS@...</a>&gt;<br/>\nSent: Friday, April 18, 2003 5:12 PM<br/>\nSubject: Rachel #764: Children&#39;s Health Declining<br/>\n<br/>\n<br/>\n&gt; If you find the Rachel newsletter useful or interesting,<br/>\n&gt; please forward it to a friend suggesting that they start<br/>\n&gt; their own free E-mail subscription.<br/>\n&gt;<br/>\n&gt; To stop receiving the Rachel newsletter, send E-mail to<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:listserv@...\">listserv@...</a> with two words in the body of the<br/>\n&gt; message (not in the subject line): UNSUB RACHEL-NEWS<br/>\n&gt;<br/>\n&gt; =======================Electronic Edition================<br/>\n&gt; .                                                               .<br/>\n&gt; .            RACHEL&#39;S ENVIRONMENT & HEALTH NEWS #764            .<br/>\n&gt; .                     ---March 6, 2003---                       .<br/>\n&gt; .                 (Published April 18, 2003)                    .<br/>\n&gt; .                          HEADLINES:                           .<br/>\n&gt; .                CHILDREN&#39;S HEALTH IS DECLINING,                .<br/>\n&gt; .                SAYS AMERICAN CHEMICAL SOCIETY                 .<br/>\n&gt; .                          ==========                           .<br/>\n&gt; .           AMERICAN CHEMISTRY COUNCIL WILL SPEND $50           .<br/>\n&gt; .           MILLION TO IMPROVE ITS IMAGE AMONG WOMEN            .<br/>\n&gt; .                          ==========                           .<br/>\n&gt; .               Environmental Research Foundation               .<br/>\n&gt; .           P.O. Box 160, New Brunswick, N.J.  08903            .<br/>\n&gt; .          Fax (732) 791-4603; E-mail: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:erf@...\">erf@...</a>           .<br/>\n&gt; .                          ==========                           .<br/>\n&gt; .   All back issues are on the web at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.rachel.org\">http://www.rachel.org</a>    .<br/>\n&gt; .  in text and PDF formats.  To subscribe (free), send E-mail   .<br/>\n&gt; .          to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:listserv@...\">listserv@...</a> with the words          .<br/>\n&gt; .     SUBSCRIBE RACHEL-NEWS YOUR FULL NAME in the message.      .<br/>\n&gt; .      The Rachel newsletter is also available in Spanish;      .<br/>\n&gt; .      to learn how to subscribe in Spanish, send the word      .<br/>\n&gt; .        AYUDA in an E-mail message to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:info@...\">info@...</a>.         .<br/>\n&gt; ====================================================<br/>\n&gt;<br/>\n&gt; CHILDREN&#39;S HEALTH IS DECLINING,<br/>\n&gt; SAYS AMERICAN CHEMICAL SOCIETY<br/>\n&gt;<br/>\n&gt; by Bette Hileman*<br/>\n&gt;<br/>\n&gt; Over the past few decades, various disturbing trends have led<br/>\n&gt; researchers to believe that environmental exposures are<br/>\n&gt; contributing to children&#39;s declining health status in the U.S.<br/>\n&gt; Federal and private health programs are just beginning to<br/>\n&gt; realize the extent of the problem and to seek solutions.<br/>\n&gt;<br/>\n&gt; Scientists are concerned that environmental exposures cause a<br/>\n&gt; wide range of health threats to kids, including birth defects,<br/>\n&gt; cancer, and asthma. According to a recent study from the<br/>\n&gt; National Institute of Environmental Health Sciences (NIEHS),<br/>\n&gt; childhood cancer incidence has risen 1% a year since the early<br/>\n&gt; 1970s, the prevalence of asthma has gone up sharply, the<br/>\n&gt; incidence of attention-deficit hyperactivity disorder (ADHD)<br/>\n&gt; may be increasing, a growing percentage of boys are born with<br/>\n&gt; defects in their reproductive tracts, and the prevalence of<br/>\n&gt; autism is rising dramatically....<br/>\n&gt;<br/>\n&gt; [In late February the National Institute of Environmental<br/>\n&gt; Health Sciences sponsored a meeting to examine a number of<br/>\n&gt; specific environmental health risks to children, address ways<br/>\n&gt; to translate science into action to protect children, and to<br/>\n&gt; identify research gaps.]<br/>\n&gt;<br/>\n&gt; ...Former U.S. Public Health Service director Philip R. Lee<br/>\n&gt; gave the keynote speech at the meeting. He described the types<br/>\n&gt; of exposures likely to affect the health of the fetus and<br/>\n&gt; children and some things that can be done to mitigate these<br/>\n&gt; exposures. Lee is professor emeritus of social medicine at the<br/>\n&gt; University of California School of Medicine.<br/>\n&gt;<br/>\n&gt; Children are especially vulnerable to environmental insults,<br/>\n&gt; Lee said. &quot;At birth, their nervous, respiratory, reproductive,<br/>\n&gt; and immune systems are not yet fully developed. They are in a<br/>\n&gt; dynamic state of growth with cells multiplying and organ<br/>\n&gt; systems developing at a rapid rate,&quot; he explained. Also, pound<br/>\n&gt; for pound, children take in more air, food, and liquids than do<br/>\n&gt; adults.<br/>\n&gt;<br/>\n&gt; The impact of neurodevelopmental disorders such as ADHD on<br/>\n&gt; children and their families is immense, Lee said. Children with<br/>\n&gt; ADHD are at greater risk for dropping out of school early, drug<br/>\n&gt; abuse, and suicide. Environmental exposure to any of a number<br/>\n&gt; of known and suspected developmental neurotoxicants could<br/>\n&gt; contribute to ADHD, including lead, mercury, manganese, tobacco<br/>\n&gt; smoke, dioxins, polychlorinated biphenyls (PCBs), certain<br/>\n&gt; pesticides, and solvents, he said.<br/>\n&gt;<br/>\n&gt; One of the exposures society could easily reduce, Lee said, is<br/>\n&gt; to manganese. Its effects include inattention, impulsivity, and<br/>\n&gt; hyperaggression. Manganese -- an essential nutrient -- occurs<br/>\n&gt; at very low levels in breast milk, but it is added to infant<br/>\n&gt; formula made from cow&#39;s milk and occurs naturally at even<br/>\n&gt; higher levels in soy formula. It is dangerous for infants to<br/>\n&gt; consume more manganese than they would get from breast milk<br/>\n&gt; because infants have no capacity to excrete excess amounts<br/>\n&gt; until they are older, he said....<br/>\n&gt;<br/>\n&gt; David O. Carpenter, director of the Institute for Health & the<br/>\n&gt; Environment at the State University of New York, Albany,<br/>\n&gt; discussed the effects of exposures to lead, mercury, and PCBs.<br/>\n&gt; Children with higher lead exposures are more easily distracted,<br/>\n&gt; less organized, and apt to be hyperactive, impulsive,<br/>\n&gt; aggressive, and easily frustrated, he said. &quot;Blood lead levels<br/>\n&gt; as low as one microgram per deciliter are associated with<br/>\n&gt; harmful effects on children&#39;s learning and behavior. There may<br/>\n&gt; be no lower threshold for some of the diverse effects of lead<br/>\n&gt; in children,&quot; he observed.<br/>\n&gt;<br/>\n&gt; Low-dose prenatal exposure to mercury, Carpenter said, also<br/>\n&gt; affects a broad range of skills -- motor, attention, and<br/>\n&gt; language for instance. It decreases IQ and increases<br/>\n&gt; impulsivity. &quot;Children of women who consume large amounts of<br/>\n&gt; fish and seafood during pregnancy&quot; are at highest risk of<br/>\n&gt; problems from mercury, he said. Immigrants, Native Americans,<br/>\n&gt; and others who obtain much of their protein from subsistence<br/>\n&gt; fishing are likely to be overexposed to mercury. Blood levels<br/>\n&gt; of mercury in one-tenth of U.S. women of childbearing age<br/>\n&gt; exceed the reference dose, the safe level, he noted.<br/>\n&gt;<br/>\n&gt; Early life exposure to PCBs has similar effects, Carpenter<br/>\n&gt; said. Infants with the highest exposure, as shown in cord blood<br/>\n&gt; and breast milk, have abnormal reflexes and less developed<br/>\n&gt; attentiveness to visual and auditory stimuli. Even 3.5 years<br/>\n&gt; after birth, they have multiple behavioral problems, as well as<br/>\n&gt; impaired thyroid and immune systems. What is totally unknown,<br/>\n&gt; he explained, are the adverse effects if a child is exposed to<br/>\n&gt; two or three of these substances--lead, mercury, and PCBs.<br/>\n&gt;<br/>\n&gt; Exposure to air pollution such as ozone or nitrogen oxides is<br/>\n&gt; associated with a wide array of health problems, said Jonathan<br/>\n&gt; Samet, epidemiologist at Johns Hopkins University Bloomberg<br/>\n&gt; School of Public Health. Prenatal exposures can cause pregnancy<br/>\n&gt; loss and reduced birth weight. Postnatal exposures are<br/>\n&gt; associated with cancer, sudden infant death syndrome, and<br/>\n&gt; respiratory symptoms, he explained.<br/>\n&gt;<br/>\n&gt; It is important, Samet continued, to look at the air quality of<br/>\n&gt; the microenvironments where children spend a lot of time. For<br/>\n&gt; example, most children spend time at home, at school, on<br/>\n&gt; playgrounds, in school buses (an average of 40 minutes per day)<br/>\n&gt; and parents&#39; vehicles, and outside in neighborhoods, he said.<br/>\n&gt; Inside the home, key exposures include tobacco smoke, nitrogen<br/>\n&gt; oxides, wood smoke, radon, biological agents, volatile organic<br/>\n&gt; compounds, and particles from outdoors, he said. Outdoor<br/>\n&gt; exposures are to particles (especially from diesel smoke),<br/>\n&gt; ozone, biological agents, and hazardous air pollutants.<br/>\n&gt;<br/>\n&gt; &quot;We know that high levels of combustion-related pollution<br/>\n&gt; increase mortality and morbidity, including acute respiratory<br/>\n&gt; illness,&quot; Samet said. &quot;But increases in the incidence of asthma<br/>\n&gt; cannot be explained solely by outdoor air pollution,&quot; he<br/>\n&gt; observed.<br/>\n&gt;<br/>\n&gt; &quot;More research is needed, but we do know something,&quot; Samet<br/>\n&gt; concluded. One is that children who live within 90 meters of a<br/>\n&gt; main road have an increased risk of wheezing illness. Another<br/>\n&gt; is that children who play team sports outside in areas with<br/>\n&gt; high levels of ozone are much more likely to develop asthma<br/>\n&gt; than those who play in clean areas. This is from a cohort study<br/>\n&gt; of 3,522 children in Southern California with no history of<br/>\n&gt; asthma. Also, among asthmatic children, the number of acute<br/>\n&gt; events requiring emergency care goes down dramatically when air<br/>\n&gt; quality improves. Emergency care and hospitalizations for<br/>\n&gt; asthma declined 42% during the 1996 summer Olympic Games in<br/>\n&gt; Atlanta when driving was sharply curtailed.<br/>\n&gt;<br/>\n&gt; Peyton A. Eggleston, professor of pediatrics at Johns Hopkins<br/>\n&gt; Bloomberg School of Public Health, noted that acute asthma was<br/>\n&gt; more than twice as prevalent among black children (7.2%) as<br/>\n&gt; among white children (3.0%) and that the annual death rate from<br/>\n&gt; asthma among black children is more than twice as high (38.5<br/>\n&gt; per million) as it is for white children (15.1 per million).<br/>\n&gt;<br/>\n&gt; A study of hospitalizations for acute asthma in Baltimore from<br/>\n&gt; 1989 to 1999 shows that the number is lowest in summer and<br/>\n&gt; peaks during September and October. Ozone levels outdoors are<br/>\n&gt; highest in July and August, so this means &quot;we need to look at<br/>\n&gt; air quality indoors,&quot; as a causal factor, Eggleston said. Also,<br/>\n&gt; he noted, &quot;I think viral infections are important in causing<br/>\n&gt; asthma problems in the fall.&quot;<br/>\n&gt;<br/>\n&gt; In a National Cooperative Inner City Asthma Study, researchers<br/>\n&gt; went to the homes of 1,528 asthmatic children in eight urban<br/>\n&gt; centers, Eggleston said. They found that smoking occurs in 69%<br/>\n&gt; of these inner-city homes, elevated nitrogen dioxide in 24%,<br/>\n&gt; leaky roofs with water damage--which means mold is probably<br/>\n&gt; present--in 29%, and excess roach allergen in the dust in 77%.<br/>\n&gt; Children who were sensitized to mold, cockroaches, and dust<br/>\n&gt; mites had many more emergency visits to the hospital. As a<br/>\n&gt; group, the 1,528 children averaged 3.3 wheezing days every two<br/>\n&gt; weeks and one emergency room visit every six months.<br/>\n&gt;<br/>\n&gt; The 1% annual increase in the incidence of childhood cancer<br/>\n&gt; since 1974 is primarily due to increases in leukemia and<br/>\n&gt; central nervous system tumors, said Leslie L. Robison of the<br/>\n&gt; department of pediatrics at the University of Minnesota. With<br/>\n&gt; leukemia, however, &quot;it is less clear whether we are looking at<br/>\n&gt; an artifact or a true increase over time,&quot; he said. For central<br/>\n&gt; nervous system tumors, better diagnostic techniques may explain<br/>\n&gt; the increase, he said.<br/>\n&gt;<br/>\n&gt; In any event, Robison said, one individual in every 600 is<br/>\n&gt; diagnosed with cancer before the age of 15, about 8,500<br/>\n&gt; children are diagnosed annually with cancer, and about 2,500<br/>\n&gt; die each year. The highest incidence of cancer is in the first<br/>\n&gt; year of life. &quot;It is quite obvious these cancers are caused by<br/>\n&gt; something that happened prior to birth,&quot; he explained.<br/>\n&gt;<br/>\n&gt; A second peak of tumors occurs during the latter part of<br/>\n&gt; adolescence. The most common cancers during this period are<br/>\n&gt; Hodgkin&#39;s disease, bone and thyroid cancer, and melanoma....<br/>\n&gt;<br/>\n&gt; There are known risk factors for some cancers, but they do not<br/>\n&gt; explain the extent of the increase, Robison said. For example,<br/>\n&gt; brain tumors and acute lymphoblastic leukemia can be caused by<br/>\n&gt; ionizing radiation in utero. Acute myeloid leukemia can be<br/>\n&gt; caused by ionizing radiation in utero or by chemotherapy, he<br/>\n&gt; said. But there are no known risk factors for many childhood<br/>\n&gt; cancers, such as neuroblastoma, retinoblastoma, Wilm&#39;s tumor,<br/>\n&gt; hepatoblastoma, Ewing&#39;s sarcoma, and germ cell tumors.<br/>\n&gt;<br/>\n&gt; Some of the environmental risk factors that may play a role in<br/>\n&gt; childhood cancer include the pregnant mother&#39;s exposure to<br/>\n&gt; tobacco, alcohol, cured meats, topoisomerase II inhibitors (a<br/>\n&gt; class of cancer drugs), and improper doses of vitamins.<br/>\n&gt; Postnatal exposures to pesticides and electromagnetic fields,<br/>\n&gt; and parental occupations in agriculture, aircraft, pesticide,<br/>\n&gt; painting, and pulp and paper industries may also contribute,<br/>\n&gt; Robison said. It is likely that genes and environment are both<br/>\n&gt; important in most childhood cancers, he said. &quot;It is very<br/>\n&gt; unlikely there are any cancers driven by genetics or<br/>\n&gt; environment alone,&quot; he explained. But, he added,<br/>\n&gt; gene-environment interactions have been investigated hardly at<br/>\n&gt; all....<br/>\n&gt;<br/>\n&gt; At this point, &quot;studies should focus on what actually we can do<br/>\n&gt; to prevent childhood cancer,&quot; said Michael Thune of the<br/>\n&gt; American Cancer Society. Much progress has been made in<br/>\n&gt; treating cancer, but few advances have been made in identifying<br/>\n&gt; cancer causes, he said.<br/>\n&gt;<br/>\n&gt; Even though cancer clusters get a lot of media attention, few<br/>\n&gt; scientific discoveries have been made from studying them, said<br/>\n&gt; Tom Sinks of CDC&#39;s National Center for Environmental Health. A<br/>\n&gt; confirmed cancer cluster can be the result of chance or a<br/>\n&gt; miscalculation in the expected cancer rate.<br/>\n&gt;<br/>\n&gt; However, a cluster of leukemia in Fallon, Nev., is interesting,<br/>\n&gt; Sinks said. Fifteen cases of childhood acute lymphocytic<br/>\n&gt; leukemia were diagnosed there when less than one would be<br/>\n&gt; expected. &quot;Fallon was warned for years about high levels of<br/>\n&gt; arsenic in its drinking water,&quot; which remain very high, he<br/>\n&gt; said. High tungsten levels have also been found in Fallon. When<br/>\n&gt; compared with mean levels in CDC&#39;s latest national survey, 85%<br/>\n&gt; of the people in Fallon have elevated tungsten levels, he said.<br/>\n&gt;<br/>\n&gt; Godfrey Oakley, visiting professor of epidemiology at Rollins<br/>\n&gt; School of Public Health at Emory University, pointed out there<br/>\n&gt; is more about the environment than just contaminants that can<br/>\n&gt; affect children&#39;s health, including vitamin deficiencies,<br/>\n&gt; drugs, and maternal diseases. He said, for example, that folate<br/>\n&gt; deficiency is known to cause birth defects, especially neural<br/>\n&gt; tube defects. Folate deficiency is cheap and easy to solve by<br/>\n&gt; fortifying flour and cereal with folate and taking vitamins. In<br/>\n&gt; the U.S. since 1998, flour and some cereals have been fortified<br/>\n&gt; with folate, but they are not fortified in Europe. &quot;If you want<br/>\n&gt; to make a significant reduction in birth defects, pay attention<br/>\n&gt; to old problems,&quot; he said. Other known causes of birth defects<br/>\n&gt; are the pregnant mother&#39;s use of valproic acid, Accutane, and<br/>\n&gt; excess amounts of vitamin A; maternal diabetes; and rubella<br/>\n&gt; during pregnancy, he said.<br/>\n&gt;<br/>\n&gt; Terri Damstra of NIEHS discussed the World Health<br/>\n&gt; Organization&#39;s global assessment of endocrine-disrupting<br/>\n&gt; chemicals (EDCs)--substances that disrupt the endocrine<br/>\n&gt; system....<br/>\n&gt;<br/>\n&gt; Exposure of the fetus or the young child to EDCs may result in<br/>\n&gt; permanent changes in function, Damstra said, but exposure<br/>\n&gt; during adulthood may not result in detectable effects. Another<br/>\n&gt; feature of EDCs is that exposure to the same level during<br/>\n&gt; different life stages may produce different effects.<br/>\n&gt;<br/>\n&gt; One observed effect of EDCs is impaired neurobehavioral<br/>\n&gt; development in children caused by fetal exposure to PCBs,<br/>\n&gt; Damstra said. A weight-of-evidence approach looking at data<br/>\n&gt; from all the relevant research indicates that EDCs in the<br/>\n&gt; environment have potential for adverse outcomes on people.<br/>\n&gt; &quot;Coordinated international research strategies are urgently<br/>\n&gt; needed to address numerous data gaps and uncertainties,&quot; she<br/>\n&gt; said. &quot;Prevention of exposure is the single most effective<br/>\n&gt; means of protecting against environmental threats,&quot; she<br/>\n&gt; concluded.<br/>\n&gt;<br/>\n&gt; Environmental agents can disrupt many cellular events in the<br/>\n&gt; neurological development of the fetus, child, and early<br/>\n&gt; adolescent, according to Ted Schettler, a physician who is<br/>\n&gt; science director for the Science & Environmental Health<br/>\n&gt; Network, a think tank that is concerned with the wise<br/>\n&gt; application of science to the protection of the environment and<br/>\n&gt; public health. These include cell division, migration,<br/>\n&gt; differentiation, formation of synapses, pruning of synapses,<br/>\n&gt; myelinization, and apoptosis.<br/>\n&gt;<br/>\n&gt; For example, cell differentiation can be affected by exposure<br/>\n&gt; to ethanol, nicotine, mercury, lead, and decreased thyroid<br/>\n&gt; hormone, Schettler said. However, there are still many<br/>\n&gt; uncertainties when trying to assess the effects of toxicants on<br/>\n&gt; nervous system development. One is the &quot;long latent periods<br/>\n&gt; between relevant environmental exposures and emergence of<br/>\n&gt; evidence of impairments. Therefore, waiting for proof of harm<br/>\n&gt; before acting can result in widespread damage,&quot; he said.<br/>\n&gt;<br/>\n&gt; &quot;We are in the midst of a revolution in scientific<br/>\n&gt; understanding of links between exposures and health that<br/>\n&gt; promises to provide opportunities for new interventions to<br/>\n&gt; protect public health,&quot; said John Peterson (Pete) Myers, senior<br/>\n&gt; adviser to the United Nations Foundation. This revolution is<br/>\n&gt; driven by research funded by many governments.<br/>\n&gt;<br/>\n&gt; A result of these research efforts is a torrent of new papers<br/>\n&gt; coming out virtually every week showing that many environmental<br/>\n&gt; contaminants are biologically active. This research suggests<br/>\n&gt; that adult chronic diseases will need fresh examination,<br/>\n&gt; particularly with respect to the possibility that environmental<br/>\n&gt; contaminants are programming the fetus so that chronic disease<br/>\n&gt; develops later in life, he explained.<br/>\n&gt;<br/>\n&gt; Despite these research needs, EPA&#39;s program on children&#39;s<br/>\n&gt; environmental health may be scaled back. The agency&#39;s Office of<br/>\n&gt; Children&#39;s Health Protection has been without a director since<br/>\n&gt; April 2002, and the executive order creating the Presidential<br/>\n&gt; Task Force on Children&#39;s Environmental Health & Safety will<br/>\n&gt; expire on April 21. EPA has proposed to cut its annual funding<br/>\n&gt; for the Centers for Children&#39;s Environmental Health from $6<br/>\n&gt; million to $3 million. The centers are jointly funded by EPA<br/>\n&gt; and NIEHS. If Congress approves this funding cut, the total<br/>\n&gt; number of [children&#39;s environmental health] centers will<br/>\n&gt; decline from 12 to 10.<br/>\n&gt;<br/>\n&gt; =========<br/>\n&gt;<br/>\n&gt; * Bette Hileman is Senior Editor, Chemical & Engineering News,<br/>\n&gt; a publication of the American Chemical Society. This is<br/>\n&gt; excerpted from a longer article, &quot;Children&#39;s Health,&quot; published<br/>\n&gt; in Chemical & Engineering News April 7, 2003, pgs. 23-26.  The<br/>\n&gt; American Chemical Society is a professional association for<br/>\n&gt; chemists.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; AMERICAN CHEMISTRY COUNCIL WILL SPEND $50<br/>\n&gt; MILLION TO IMPROVE ITS IMAGE AMONG WOMEN<br/>\n&gt;<br/>\n&gt; From Plastics News March 31, 2003<br/>\n&gt;<br/>\n&gt; HOUSTON (March 28, 2003) -- The American Chemistry Council<br/>\n&gt; (ACC) may be taking a page from the American Plastics Council&#39;s<br/>\n&gt; (APC) playbook in an attempt to improve its image. The ACC will<br/>\n&gt; make a decision this spring on a communications program that<br/>\n&gt; would be &quot;similar in size and scope&quot; [$50 million] to the one<br/>\n&gt; APC launched several years ago, said Nova Chemicals Corp.<br/>\n&gt; President and Chief Executive Officer Jeff Lipton, who serves<br/>\n&gt; as an ACC board member.<br/>\n&gt;<br/>\n&gt; &quot;APC spends most of its money on TV commercials that focus on<br/>\n&gt; young, married women,&quot; Lipton said.... &quot; The commercials help<br/>\n&gt; young, married women feel that they and their families are<br/>\n&gt; safer because of plastic products.<br/>\n&gt;<br/>\n&gt; &quot;The concept has worked extremely well for plastics and it can<br/>\n&gt; work the same way for chemicals.&quot;<br/>\n&gt;<br/>\n&gt; [On April 4, 2003, Ad Age reported that the American Chemistry<br/>\n&gt; Council had selected Ogilvy & Mather, New York, and its public<br/>\n&gt; relations unit Ogilvy PR for its $50 million advertising<br/>\n&gt; campaign. The American Chemistry Council is a trade association<br/>\n&gt; for chemical corporations. --Peter Montague]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ####################################################<br/>\n&gt;                              NOTICE<br/>\n&gt; In accordance with Title 17 U.S.C. Section 107 this material is<br/>\n&gt; distributed without profit to those who have expressed a prior<br/>\n&gt; interest in receiving it for research and educational purposes.<br/>\n&gt; Some of this material may be copyrighted by others. We believe<br/>\n&gt; we are making &quot;fair use&quot; of the material under Title 17, but if<br/>\n&gt; you choose to use it for your own purposes, you will need to<br/>\n&gt; consider &quot;fair use&quot; in your own case and perhaps seek reprint<br/>\n&gt; permission from the copyright owner. Environmental Research<br/>\n&gt; Foundation provides this electronic version of RACHEL&#39;S<br/>\n&gt; ENVIRONMENT & HEALTH NEWS free of charge even though it costs<br/>\n&gt; the organization considerable time and money to produce it. We<br/>\n&gt; would like to continue to provide this service free. You could<br/>\n&gt; help by making a tax-deductible contribution (anything you can<br/>\n&gt; afford, whether $5.00 or $500.00). Please send your<br/>\n&gt; tax-deductible contribution to: Environmental Research<br/>\n&gt; Foundation, P.O. Box 160, New Brunswick, NJ 08903-0160. Please<br/>\n&gt; do not send credit card information via E-mail. For further<br/>\n&gt; information about making tax-deductible contributions to E.R.F.<br/>\n&gt; by credit card please phone us toll free at 1-888-2RACHEL, or<br/>\n&gt; at (732) 828-9995, or fax us at (732) 791-4603.<br/>\n&gt;                                         --Peter Montague, Editor<br/>\n&gt; #################################################### </span></blockquote></div>","specialLinks":[]}],"prevTopicId":65494,"nextTopicId":65461}}