{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":139549710,"authorName":"Olga","from":"&quot;Olga&quot; &lt;britcontoo@...&gt;","profile":"britcontoo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"postDate":"1055382049","msgId":73757,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJjOGxuMStsNHJrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":73756,"nextInTime":73758,"topicId":73757,"numMessagesInTopic":0,"msgSnippet":"From: Heidi  ","messageBody":"<div id=\"ygrps-yiv-1202435392\">From: &quot;Heidi&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bunsofaluminum60@...\">bunsofaluminum60@...</a>&gt;<br/>\n<br/>\n&lt;&lt;Another table rule of ours: taste everything on your plate. If<br/>\nthere&#39;s something you don&#39;t like, you don&#39;t have to eat it. But at<br/>\nleast taste it. I&#39;ve learned what&#39;s &quot;edible&quot; around here, and what<br/>\nisn&#39;t, but trying things is a good habit, IMO. If it&#39;s yucky, I have<br/>\nno problem with them saying so.&gt;&gt;<br/>\n<br/>\nI think that is a nice idea in theory.  Try to make my 4yo try <br/>\nsomething new and he would be in tears and probably hypervenitlaing <br/>\nwithin minutes..LOL!!  I struggled with him when he was a baby.  He <br/>\nloved his baby food and trying to wean him off to table food was <br/>\ntorture.  He still has a very limited number of things he will eat <br/>\n(unless it involves chocolate and then suddenly it all looks good ;) <br/>\nbut it does not bother me anymore.  He makes alot of healthy choices <br/>\nand is a healthy, strong boy.  In fact, he still gets a good bit of <br/>\nfruit from the baby food aisle..LOL!  If we happen to read a book or <br/>\nwatch a show related to picky eaters I will remind him they seem to <br/>\nbe enjoying new food.  He agrees but cannot seem to truely comprehend <br/>\nhe is one.  My dh was the same way when he was little and now tries <br/>\nmore things than me so obviously making kids try things has no huge <br/>\ninfluence over how they will be as adults.  My 2 yo will come up and <br/>\njust grab something out of your hand if the mood strikes.  I have <br/>\nrealized it just comes down to personality.  Your kids may be more <br/>\neasy going about trying things so it may not be coersive for you.  <br/>\n<br/>\nAlso, I think some parents can get so caught up in these power <br/>\nstruggles over food that they lose sight of what it important.  My <br/>\nBIL has this big issue over eating as a family and they got to the <br/>\npoint with their picky eater son where they forced him to eat what <br/>\nwas on the table or he would get nothing.  They claimed all he wanted <br/>\nwas chicken nuggets and the such which was not healthy.  Well, my <br/>\nfirst thought is who introduced him to all that *crappy* food and  <br/>\nthen does not want to let him eat it?  My poor SIL HATES dinner time <br/>\nbecause it is full of fighting.  She wants to hide in the bathroom.  <br/>\nHer dh is on her because she is below weight but he does not realize <br/>\nthat the stress of dinner just contributes to her not wanting to <br/>\neat.  Also, my BIL is the PICKIEST eater.  In fact, outside of my FIL <br/>\nI do not know anyone as picky as him.  He will not try anything new.  <br/>\nSO how the hell does he justify his son looking at food and finding <br/>\nit gross and expecting him to eat it whereas he would never want to <br/>\ntry it.  These are the really *old-fashioned* parents who are always <br/>\nin that &quot;I have all the power&quot; mindset, kind of the Wonder Years <br/>\nDad.  It is so stupid and sad really.  Here you have a chance to have <br/>\na nice dinner with your kids and you ruin it over food.  Of course, <br/>\nnow he eats different things so people like my BIL say it works and <br/>\nof course everyone should just do it that way.  Two of my BIL&#39;s have <br/>\nthat same attitude &quot;Well, if he won&#39;t eat it that way then he just <br/>\nwouldn&#39;t eat!&quot;.  It is not worth the battle or control to me, when he <br/>\nis ready he will try new things.  At this point, I could really care <br/>\nless :) and we are all happy!<br/>\n<br/>\nOlga :)</div>","specialLinks":[]}],"prevTopicId":73754,"nextTopicId":71508}}