{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Hi, Im new!","postDate":"1108837244","msgId":103684,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMTc4MzdDLjIwOTA2MDdAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PGN2NzMzZitjYzM4QGVHcm91cHMuY29tPg==","referencesHeader":"PGN2NzMzZitjYzM4QGVHcm91cHMuY29tPg=="},"prevInTopic":103676,"nextInTopic":0,"prevInTime":103683,"nextInTime":103685,"topicId":103674,"numMessagesInTopic":0,"msgSnippet":"**No she isnt doing well because she feels abused by her teacher, misunderstood and not respected.** Hi, Samantha -- That s really hard!  I m glad you were","messageBody":"<div id=\"ygrps-yiv-715138617\">**No she isnt doing well because she feels abused by her teacher, <br/>\nmisunderstood and not respected.**<br/>\n<br/>\nHi, Samantha --<br/>\n<br/>\nThat&#39;s really hard!  I&#39;m glad you were able to understand her struggle <br/>\nand look for an alternative for her.<br/>\n<br/>\nWhile you may find some of the advice on this list surprising, the good <br/>\nnews is you won&#39;t find anyone who will say and think that your daughter <br/>\nshould just &quot;suck it up&quot; and be miserable because &quot;that&#39;s what life is <br/>\nlike&quot; and learning to write book reports or multiply fractions is <br/>\nvital.  We won&#39;t say that learnining gain must come from pain.  So we <br/>\ncan really support you in removing your daughter from an awful situation.<br/>\n<br/>\n**Which I take to mean that they wont be giving him what he needs and he <br/>\nwill eventually fall into the cracks. I plan to bring him home then.**<br/>\n<br/>\nI had a friend who had a young son who was getting some preschool <br/>\ntherapies.  When she told me how helpful his teachers were, I always <br/>\nsaid &quot;Great!&quot; and was supportive.  But I tried to subtly prepare her to <br/>\nwatch out for that point when the teachers (may) stop working for the <br/>\nchild and start working against the child.  Sounds like your thoughts <br/>\nand mine are in alignment on that issue.  The therapists need to be <br/>\nattempting to serve the child&#39;s interests, not making the child serve <br/>\nthe system.<br/>\n<br/>\n**Sure enough he is too smart after all, so even though he isnt learning <br/>\nanything and at this rate he would be behind next year by 3 years...**<br/>\n<br/>\nFortunately, outside of school, a kid can learn tons of stuff without <br/>\nbeing able to read a textbook or worksheet.  My son learns a lot of <br/>\ninformation about science and history watching documentaries.  (He&#39;s <br/>\n10.  He picked up reading at about age 7, but wasn&#39;t in school competing <br/>\nwith other kids and had no sense of being &quot;late&quot;. )<br/>\n<br/>\n**To really see and know how little time we have and how much I just <br/>\nlove being with them. What we now know to be real happiness.**<br/>\n<br/>\nThis is the crucial part.  It was really great to read your post and <br/>\nfeel your passion.<br/>\n<br/>\n**In the back of mind though, I just keep hoping Im not setting them up <br/>\nto be gas station attendants. I dont seem to &quot;get&quot; how these kids are <br/>\ngoing to be ok if they never learn algebra or if they never WANT to <br/>\nlearn algebra.<br/>\n<br/>\nI don&#39;t teach my son math (and we don&#39;t bump into it accidentally very <br/>\noften), but on the treadmill this week he told me that walking at a <br/>\nspeed 3mph it would take him 5 minutes to walk one quarter of a mile.  <br/>\n(I thought this was pretty sophisticated.  He&#39;s 10.)<br/>\n<br/>\nOK, my worst case scenario response is that if I imagine my son as a 25 <br/>\nyear old gas station attendant, I know I am willing to still have him at <br/>\nhome and still feed him if he finally gets the desire to go to community <br/>\ncollege and &quot;prepare&quot; for a more rewarding job.  I have friends whose 21 <br/>\nyear old (schooled through 12th grade) son is following his passion and <br/>\ntrying to make a living as a ballet dancer.  They know that this is a <br/>\nlong shot because it is a low-paying field and few rise to the top.  In <br/>\ntheir family there is no shame if he does this for some years and then <br/>\ncomes back home, for financial support, while he transitions into <br/>\nsomething else.  (In families where parents are determined to kick kids <br/>\nout at age 18 there is more deadline pressure, but I don&#39;t have to <br/>\ncreate that in my family, I can be more flexible.)<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":172750465,"authorName":"b229d655@cs.com","from":"b229d655@...","profile":"robeyboyz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Hi, Im new!","postDate":"1108824153","msgId":103676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlZS4zNWNmMTkyMC4yZjQ4YWE1OUBjcy5jb20+"},"prevInTopic":103675,"nextInTopic":103684,"prevInTime":103675,"nextInTime":103677,"topicId":103674,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/19/2005 6:22:14 AM Eastern Standard Time, ... Congrats on your decision. That day was normal for your unschooling family.  I think","messageBody":"<div id=\"ygrps-yiv-1431832779\">In a message dated 2/19/2005 6:22:14 AM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:somedayhomefree@...\">somedayhomefree@...</a> writes: <br/>\n<blockquote><span title=\"ireply\"> &gt; So here I am now, searching for more reassurances that our day was<br/>\n&gt; normal for an unschooler, what I shouldve done better, what I didnt do<br/>\n&gt; and what else I NEED to know! Wondering how I can justify &quot;literally&quot;<br/>\n&gt; teaching them nothing. Please help me.<br/>\n<br/>\n<br/>\n </span></blockquote>Congrats on your decision.  <br/>\n<br/>\nThat day was normal for your unschooling family.  I think everyone&#39;s family <br/>\nwill be different.  There is no form fit.  That&#39;s what makes it wonderful.  <br/>\nEvery day has new experiences.  <br/>\n<br/>\nYou may be &quot;literally&quot; NOT using a curriculum and NOT teaching or talking AT <br/>\nthem.  But they will learn many, many things.  Naturally.<br/>\n<br/>\nExample:  Our 7 year old has been in Kindergarten.  He knew tons of things <br/>\nbefore and knew less when he came home.  The way he learned before was natural, <br/>\nby exposure and everyday life.  While there he learned to learn their way, <br/>\ntheir speed.  Learning to learn is absurd!  Our 3 year old, never in any school, <br/>\nseems like he knows nothing because if you ask him a color, or number, etc., <br/>\nhe plays with you an acts like he doesn&#39;t know.  But if he plays a game or does <br/>\na puzzle or whatever, you hear him saying the colors and counting.  It&#39;s <br/>\nhilarious, it&#39;s his way.  He hides what he knows, while my other one is very <br/>\nlikely to tell you everything he knows, ALL DAY LONG :o)<br/>\n<br/>\nI would say that some deschooling would be good.  Let go of all schoolie <br/>\nthings as much as possible and let them rediscover that childhood freedom.  Help <br/>\nthem follow their interests and/or find the resources they need to learn more <br/>\nabout whatever it may be.  <br/>\n<br/>\nHTH <br/>\nPamela <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177721839,"authorName":"Angela S","from":"&quot;Angela S&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Hi, Im new!","postDate":"1108818347","msgId":103675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDUwMjE5MTMwNTQ0LkJSUUk3OTc5Lm10YTEzLmFkZWxwaGlhLm5ldEBsZWlnaD4=","inReplyToHeader":"PGN2NzMzZitjYzM4QGVHcm91cHMuY29tPg=="},"prevInTopic":103674,"nextInTopic":103676,"prevInTime":103674,"nextInTime":103676,"topicId":103674,"numMessagesInTopic":0,"msgSnippet":"How did you learn about unschooling?  Did someone teach you all about it or did you have an interest and follow it, learning as you went?  Your kids will learn","messageBody":"<div id=\"ygrps-yiv-256984439\">How did you learn about unschooling?  Did someone teach you all about it or<br/>\ndid you have an interest and follow it, learning as you went?  Your kids<br/>\nwill learn in the same way, without you teaching them. However, I think<br/>\nunschooling parents have an important role to play in their children&#39;s<br/>\nlives.  They need to be connected with them and tuned in, so they can see<br/>\ntheir kids&#39; interests and help them navigate the world to feed those<br/>\ninterests.    <br/>\n<br/>\n <br/>\n<br/>\nGood for you for taking your kids out of school.  Each day will look<br/>\ndifferent and each unschooling family will have different interests.  It&#39;s<br/>\nabout helping your kids to follow *their* interests and not comparing them<br/>\nto other children of the same age.  Give yourself the gift of time.  Start<br/>\nby thinking to yourself that you are taking a couple months off and make<br/>\nsure you don&#39;t push anything on them during that time.  When that time<br/>\nperiod ends, you should feel more secure in unschooling if you&#39;ve noted in<br/>\nyour head all the things that they learned without your teaching.  Just<br/>\ndon&#39;t expect unschooling learning to look like school work.  They probably<br/>\nwon&#39;t sit down and do math worksheets, but they might play games involving<br/>\nmath or figure out how much money they need to buy something.  Real life<br/>\nmath.<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\nAngela<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a>. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":213806558,"authorName":"somedayhomefree","from":"&quot;somedayhomefree&quot; &lt;somedayhomefree@...&gt;","profile":"somedayhomefree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Hi, Im new!","postDate":"1108807599","msgId":103674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGN2NzMzZitjYzM4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":103675,"prevInTime":103673,"nextInTime":103675,"topicId":103674,"numMessagesInTopic":0,"msgSnippet":"Hi, I recently pulled my kids out of school after a very frustrating and after too many humiliating experiences for them. My oldest (9) just was completely","messageBody":"<div id=\"ygrps-yiv-408358505\">Hi, I recently pulled my kids out of school after a very frustrating<br/>\nand after too many humiliating experiences for them.<br/>\n<br/>\nMy oldest (9) just was completely frustrated. She has epilepsy and she<br/>\nwent from gifted to &quot;maybe she isnt doing well because 5th grade is<br/>\njust harder&quot; No she isnt doing well because she feels abused by her<br/>\nteacher, misunderstood and not respected. She has difficulty with<br/>\nmemory and speed in timed work and just couldnt perform well within<br/>\nguidelines that were useless. I got tired of seeing my daughter in<br/>\ntears as her happiness and self esteem plummeted.<br/>\n<br/>\nI have one child who I kept in school, he is 5 and luckily in special<br/>\ned. (ADHD, mild PDD-Nos from meningitis in infancy or maybe he just is<br/>\nbecause thats the way the Lord made him. Who knows. :) ) They plan to<br/>\nmainstream him next year with special therapies during his recess, gym<br/>\ntime etc. Which I take to mean that they wont be giving him what he<br/>\nneeds and he will eventually fall into the cracks. I plan to bring him<br/>\nhome then. Right now he needs the therapies they can provide daily.<br/>\nSpeech, occupational therapy etc.<br/>\n<br/>\nMy other son who came home is 7. He still hasnt learned to read, and<br/>\nhe doesnt seem to care to yet. I insisted in kindergarten when they<br/>\nwanted to hold him back that they absolutely would not do such a<br/>\nthing! That there were too many studies that suggested it would only<br/>\nhurt him. He was aware of the idea and it only upset him, Way more<br/>\nthan I thought he needed to care about at his age! That and being that<br/>\nis younger brother and him would end up in the same grade! So they<br/>\npromoted him to first and it was a disaster. He wasnt paying<br/>\nattention, all he wanted to do was draw, he plays well but he still<br/>\ncant tell the difference between visual letters. He hasnt learned any<br/>\nmore of the 13 alphabet sounds than he knew last year and he cried all<br/>\nthe time saying he loved his friends at school but he didnt want to<br/>\ngo. So we had him tested for special ed. Sure enough he is too smart<br/>\nafter all, so even though he isnt learning anything and at this rate<br/>\nhe would be behind next year by 3 years... He doesnt qualify yet. Then<br/>\nit finally occurred to me how ridiculous this was! I should watch my<br/>\nson fail through school, let them hold him back until they finally<br/>\npromote him for age and then after we have wasted years he will<br/>\nqualify. No thanks. My son is the brightest child I have. His<br/>\nimiagination is endless and his mind always wondering, always asking.<br/>\nHe is such an awesome little artist and his personality so sweet but I<br/>\nwas seeing it slowly but surely crushed and discouraged.<br/>\n<br/>\nThen the other 2 not yet old enough for school but will never go. I<br/>\njust cant wait to see all of their potential completely uninhibited by<br/>\nthe school system!  I brought them home after long consideration.<br/>\nMaybe a full year. I had yearned for a closer relationship with them,<br/>\none that took losing one child to fully appreciate. To really see and<br/>\nknow how little time we have and how much I just love being with them.<br/>\nWhat we now know to be real happiness. But I didnt want to make any<br/>\nrash decisions because of our grieving.  <br/>\n<br/>\nSo two years later here we are, I took them out of school a few months<br/>\nago and I did so much searching for the &quot;perfect&quot; curriculum. I<br/>\nthought I had found it with Weaver and so our journey began. This<br/>\ndidnt last long. It didnt feel right. The kids were learning more &<br/>\nmore, and I was so proud of my decision and how well I was I was<br/>\ngetting through to them! Each day though I dreaded the lessons and so<br/>\ndid they. I couldnt find a way to fit everything into a reasonable<br/>\n(home)school day and managed to take away the whole day. They werent<br/>\nliving any more than they were at school, and they were listening less<br/>\nto me each day. I saw it.<br/>\n<br/>\nI broke down and one day while my husband was sleeping (he works third<br/>\nin order to see us more) I broke down and felt like such a failure I<br/>\ncalled the school and asked what I had to do to re-enroll them. To my<br/>\nutter shock my husband who I had thought was sleeping sat up and told<br/>\nme no way, dont do it! (This is the man who took forever to convince<br/>\nand doubted everything) He said, &quot; The kids are learning so much!&quot;<br/>\n<br/>\nThats when I told him, I couldnt do it this way anymore. More & more<br/>\nthe days were becoming dreaded. We had to try something new. So I read<br/>\nmore about the Montessori method, unschooling, waldorf etc and thought<br/>\nunschooling seems so natural. Its what many days have become anyway<br/>\nwhen I couldnt bear to bore the kids today. LOL<br/>\n<br/>\nUnschooling makes so much sense to my husband. He is laid back and go<br/>\nwith the flow and very open minded. Im the control freak, the worrier.<br/>\nI want so badly to unschool, it feels right! In the back of mind<br/>\nthough, I just keep hoping Im not setting them up to be gas station<br/>\nattendants. I dont seem to &quot;get&quot; how these kids are going to be ok if<br/>\nthey never learn algebra or if they never WANT to learn algebra. Ive<br/>\nread a lot, I know theres simple answers from Sandra Dodd about these<br/>\nridiculous questions but I cant let it go.<br/>\n<br/>\nSo today I just kept reminding myself that I didnt have to teach any<br/>\nof these kids to walk & talk, they WANTED to. They want to learn and<br/>\nit doesnt have to be by societys standards, or uncomfortable shoved<br/>\ndown their throats learning. We got up, they played a few board games,<br/>\nwe went to the library and picked up tons of books on tape that my son<br/>\nloves to do and my daughter got one (on her own!) about Frank Lloyd<br/>\nWright and she asked for some picture books to read to her littlest<br/>\nbrother. (Ofcourse somewhere in there I threw in how Matthew should<br/>\nfeel free to let me know when it is that he &quot;wants&quot; me to help him<br/>\nlearn to read. They then went to gymnastics, bought a cake for their<br/>\nbrothers birthday. Threw him a surprise party and helped clean up the<br/>\nhouse. They folded and put away their own laundry which I wash. They<br/>\nhelped cook dinner. Followed by movies, (none educational) but kid<br/>\nmovies. Another attempt at a board game which was abruptly ended by<br/>\nfighting amongst them. Some internet sites, like M& M&#39;s, American Girl<br/>\netc. A few books on tape, eventually went to bed with some urging<br/>\nabout 1 am. I loved today! It was natural and wondefully peaceful. It<br/>\ntotally flowed the way living feels it should be. <br/>\n<br/>\nSo here I am now, searching for more reassurances that our day was<br/>\nnormal for an unschooler, what I shouldve done better, what I didnt do<br/>\nand what else I NEED to know! Wondering how I can justify &quot;literally&quot;<br/>\nteaching them nothing. Please help me.<br/>\n<br/>\nSamantha</div>","specialLinks":[]}],"prevTopicId":103623,"nextTopicId":103680}}