{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] embracing the lifestyle","postDate":"1242950190","msgId":45431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBMTVFQTJFLjgwNDAyMDRAbWFjLmNvbT4=","inReplyToHeader":"PGd2NGVqZStiODkxQGVHcm91cHMuY29tPg==","referencesHeader":"PGd2NGVqZStiODkxQGVHcm91cHMuY29tPg=="},"prevInTopic":45419,"nextInTopic":0,"prevInTime":45430,"nextInTime":45432,"topicId":45419,"numMessagesInTopic":0,"msgSnippet":"... I really enjoyed your description of how unschooling ideas have helped you make your family life better even while your son is still in school. Although it","messageBody":"<div id=\"ygrps-yiv-132798821\">On 5/21/2009 1:46 PM, mjphipps wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; And I thank you for being here, on this list, even if you don¡¦t know all of those that you are helping.  You are wonderful.  My Family Thanks you.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>I really enjoyed your description of how unschooling ideas have helped <br/>\nyou make your family life better even while your son is still in school. <br/>\nAlthough it isn&#39;t the purpose of this list, it IS part of the ripple <br/>\neffect of unschooling.&#92;<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":392643059,"authorName":"mjphipps","from":"&quot;mjphipps&quot; &lt;mjphipps@...&gt;","profile":"mjphipps","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"embracing the lifestyle","postDate":"1242938798","msgId":45419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGd2NGVqZStiODkxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":45431,"prevInTime":45418,"nextInTime":45420,"topicId":45419,"numMessagesInTopic":0,"msgSnippet":"To all of the Unschooling moms and dads who spend so much time helping the rest of us learn what a better life looks like- thank you- my family is headed in","messageBody":"<div id=\"ygrps-yiv-841334481\">To all of the Unschooling moms and dads who spend so much time helping the rest of us learn what a better life looks like- thank you- my family is headed in that direction.<br/>\n<br/>\nAgainst the advice of Sandra and many others, my six year old is still in kindergarten.  For five more days.  This has nothing to do with ME not listening to the advice, but with me still trying to help Keith, my husband, understand and accept the decision for us as well.  He is getting closer everyday, as am I, to understanding it.   Thank you.<br/>\n<br/>\nAt first I attempted to tell him that is what we were doing, and then forcing him to agree.  Then I read here that TELLING him what we were going and forcing him to agree is no more respectful than it would be to do it with my children, or anyone else for that matter.  So now I am working on MY OWN behavior and it seems to be rubbing off on him because its working, not just because ¡§I said so¡¨!   (Thank you)<br/>\n<br/>\nA few weeks ago, at a garage sale, I stumbled upon a wonderful ¡§monkey platter¡¨ Tupperware, and was so excited the first time I was able to use.  We attended a barbeque with a lot of little ones including my two.  I filled that platter with strawberries, cheese, pretzels, little cookies, cracker, and fruit snacks.  I got to sit back and watch how excited even the smallest of the group were when they were able to reach in and grab whatever they wanted.  I was even more excited when it was nearly empty when we took it home.  We filled it up again the next day and left it on the table for a few hours¡K.and it emptied up again!!  (Thank you.)<br/>\n<br/>\nFor a long time, Jayden¡¦s ¡§color¡¨ at school was really important to us. They ranged from RED being really bad day to PURPLE being really great day.  More often than not, he was closer to the red mark.  He always seemed to be getting in trouble for ¡¥not sitting still on the carpet¡¦, ¡¥not getting his journal done as quickly as everyone else¡¦, ¡¥touching the walls in the hallway¡¦ and other equally as trivial things.  He is NOT a fighter, not a mean child, not rude (often!) he is just high-strung.  I love this about him.  School does not.  For a long time, if I asked about his day, he would tell me his color thinking that was what I wanted to know.  Finally, Keith and I explained to him that we weren¡¦t really concerned what color he was, and now I just ask him ¡§What did you do at school today that was fun¡¨ and then we go from there.   (Thank you)<br/>\n<br/>\nNext week will be my last week of full time work.  I am going to continue to work two days a week, Monday and Friday, just as a supplemental income.  This will give me the much needed time to be a wife and mother that I need.  When I informed my boss, I just told him that ¡§I didn¡¦t have children so that someone else can raise them¡¨ and I meant that with all of my heart.  I want to be present as much as I can, so I made that decision.  And the more I look at the decisions I make, I wonder why I ever thought that my children wouldn¡¦t enjoy making their own decisions too!  (Thank you)<br/>\n<br/>\nOn that note, Jayden has spent entire days relaxing and watching movies or playing on the computer.  School is demanding enough.  Weekends have been there to ¡§deschool¡¨. (we take what we can get for now º ) He has investigated a dead snake and turtle for at least an hour each.  I know for a fact I would not have allowed this a few months ago¡Kew!  He has slept on the couch, on his floor, in his bed, on top of a cardboard box on his bed (the pictures of that one are great!) in his jammies, in his undies, and naked.  He has climbed under the truck to help dad change the oil, helped me take pictures, cooked dinner with me, built forts with giant cardboard boxes, ate popsicles before dinner (gasp) and turned many random objects into toys that not too long ago I would have told him were NOT his- not to be played with.  Boy was I a grouchy mom sometimes!  <br/>\n<br/>\nI can¡¦t list all of the things that I have changed in the last month, all of the fun things Jayden has gotten to do because I am learning a better way of parenting.  Maybe I could but then this post would be even longer than it already is!<br/>\n<br/>\nWhat I did want to do was tell you I am here.  I am ¡§lurking¡¨, and reading, and digesting, and then taking it home and playing with my family.  We are enjoying life more and more everyday.  What we want is happy children, a happy family, a happy life.  And everyday we are working on making the changes that need to be made.<br/>\n<br/>\n And when that Bell Rings &lt;g&gt; on the last day if school I, for one, will be relieved.  I know he will never go back.<br/>\n<br/>\nAnd I thank you for being here, on this list, even if you don¡¦t know all of those that you are helping.  You are wonderful.  My Family Thanks you.<br/>\n<br/>\nMolly</div>","specialLinks":[]}],"prevTopicId":45340,"nextTopicId":45308}}