{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":2304686,"authorName":"mc1mommy@aol.com","from":"mc1mommy@...","profile":"mc1mommy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"catching up","postDate":"1048787677","msgId":62208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMS41NmMyOTg1LjJiYjQ5NGRkQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":62207,"nextInTime":62209,"topicId":62208,"numMessagesInTopic":0,"msgSnippet":"Hi, I ve been happily immersed in the Harry Potter books my seventy-something mother loaned me.  They were recommended to her by my sister, who has an eight","messageBody":"<div id=\"ygrps-yiv-584596435\">Hi,<br/>\n  I&#39;ve been happily immersed in the Harry Potter books my seventy-something <br/>\nmother loaned me.  They were recommended to her by my sister, who has an <br/>\neight year old son.  We all love them.  Anyway, I came up for air after <br/>\nnumber three, and checked my email to discover several hundred messages from <br/>\nthis group.  I&#39;d like to add my two cents to some recent discussions.<br/>\n TV:  My son is six and he watches what he wants.  Even though the tv was on <br/>\nwhen he woke up yesterday, he walked right past it to ask me to take him to <br/>\nthe park.  We got dressed and spent most of the day, until the rain came, <br/>\noutside.<br/>\n POOP:  This fascinates my son.  He knows which yards in the neighborhood are <br/>\nmost likely to have dog poop, and always stops our walks to check it out.  He <br/>\nrecognizes rabbit poop, too, and it&#39;s easy to spot in the snow.  Day before <br/>\nyesterday he found some in the field on last autumn&#39;s leaves.  He&#39;s got a <br/>\ngood eye.  I googled &quot;animal poop&quot; and &quot;animal scat&quot; and got these two sites. <br/>\n Although I don&#39;t expect to step in any exotic poop anytime soon, you never <br/>\nknow.<br/>\n &lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/cambridgeshire/e_break/poo_quiz/spot_poo_quiz.shtml&quot;\">http://www.bbc.co.uk/cambridgeshire/e_break/poo_quiz/spot_poo_quiz.shtml&quot;</a>&gt;BBC - Cambridgeshire E-break - Spot the Poop Quiz - Test your animal poo <br/>\nknowledge&lt;/A&gt;  <br/>\n&lt;A HREF=&quot;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bear-tracker.com/animalscat.html&quot;\">http://www.bear-tracker.com/animalscat.html&quot;</a>&gt;Tracking and Trailing - Animal Scat&lt;/A&gt; <br/>\nOUR DAILY SCHEDULE:  We don&#39;t have one.  The weather just changed for the <br/>\nbetter, three days ago, so we&#39;ve been out a lot. Walks around the block, to <br/>\nthe field, to the playground.  Looking for bugs (he found something that <br/>\nlooked like a small copper colored worm, but had lots of legs), chasing <br/>\nrobins, observing which flowers are coming up.  Walking to the tracks to see <br/>\nif any cars are parked on the siding.  When we get lucky, a train goes by.  I <br/>\nwas saddened to see how much trash has been dumped since last year, and <br/>\ncommented on it.  Noticed the doves are back.  They made a nest last year on <br/>\nthe shelfing unit on our porch that my husband keeps his trusty rusty stuff <br/>\non.  Mother dove stares right through you, and acts like she&#39;s invisible.  I <br/>\ncan reach right out and grab her, but she totally ignores us.<br/>\n   Indoors, my son discovered that his computer games have demos on them, and <br/>\nenjoys playing around with them.  He watches tv sometimes, but mostly has a <br/>\nfew videos he watches over and over.  Mostly Thomas, Blues Clues and Sesame <br/>\nStreet.  (We also like Steve better.)    My grandson brought over a Zoobily <br/>\nZoo tape, and my son has watched that MANY times since it&#39;s been here.  He <br/>\nplays with his Thomas trains every day.  I bought Sweet Streets dollhouses so <br/>\nI could play with him when he plays trains, now he plays with the little <br/>\npeople and houses too. Visits from and to relatives.  Paint.  Lots of games, <br/>\nbut he doesn&#39;t follow the rules.  He just plays with the pieces how he wants. <br/>\n Notebooks and markers.  We read &quot;a really great book&quot;, usually several, <br/>\nbefore bed each night.  We listen to classical music to help us doze off.  I <br/>\nrecently found a book on tape of one of his favorites, Franklin.  I thought <br/>\nhe was going to pop when he heard it was read by Franklin himself.  So we <br/>\nlisten to that before the music, after the books.<br/>\n  I probably forgot half of what I wanted to comment on.<br/>\n  Night before last, we were going for one last walk, and looked up at the <br/>\nstars.  I was about to say that I&#39;d like to go to the observatory, when he <br/>\nsighed and said, &quot;I can&#39;t fly.&quot;  I said I couldn&#39;t either.  He said, &quot;Sorry, <br/>\npal.&quot;<br/>\nMary J<br/>\n(another one of those great unschooling names)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":62155,"nextTopicId":62193}}