{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"David Albert","from":"David Albert &lt;shantinik@...&gt;","replyTo":"LIST","senderId":"VNUTEmujD4aM6REw4zOaTFLWRariUG9ufhjZYr4hK5BWOkZWMpMwU1Npfy_cEz9JE-SpPuYZAGj2QbGnm1TLc3wimYwL4WyJYiBAH6k","spamInfo":{"isSpam":false,"reason":"0"},"subject":"India House Building Update","postDate":"961554374","msgId":9512,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NTAyN0M2LjIxQTQxNUY4QGVhcnRobGluay5uZXQ+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":9511,"nextInTime":9513,"topicId":9512,"numMessagesInTopic":0,"msgSnippet":"Dear friends – Please forgive this form letter, but I wanted to communicate with you as quickly as possible.  Some of the families on this list (and others","messageBody":"<div id=\"ygrps-yiv-1144068654\">Dear friends <br/>\n<br/>\nPlease forgive this form letter, but I wanted to communicate with you as<br/>\nquickly as possible.  Some of the families on this list (and others of<br/>\nyou as well) have contributed to a small fund I formed with the proceeds<br/>\nfrom my homeschooling book &quot;And the Skylark Sings with Me&quot;<br/>\n(www.skylarksings.com) to help build 10,000 cyclone-proof houses in the<br/>\ncoastal areas of southeast India.  The funds were to be used to purchase<br/>\ntwo cinder block-making machines.  These houses  which people in the<br/>\nvillages are being trained to build themselves  are replacing homes<br/>\nmade of mud and straw, with thatched roofs that rot easily, which are<br/>\nwet inside (with children sleeping on the floor) during the entire<br/>\nmonsoon season, and which are often destroyed in seasonal flooding.<br/>\n<br/>\nI am pleased to report that the machines were purchased in February and<br/>\nbuilding is now under well underway. Each house requires 600 blocks and<br/>\ncontains 352 square feet of living space (this can be a little more than<br/>\ndouble an average poor familys current living space, if you can believe<br/>\nit!), plus a veranda, with space for a kitchen garden and cattle shed at<br/>\nthe back.  These villages are made up of 11,000 families whose ancestors<br/>\nhad been landless laborers for up to 700 years, but now have regained<br/>\nland peacefully through the efforts of my Indian mothers organization,<br/>\nLand for the Tillers Freedom (LAFTI).  As a result of her work in land<br/>\nreform, she has now been formally nominated for the International Right<br/>\nLivelihood Award, which is the alternative Nobel Prize awarded by the<br/>\nSwedish Parliament, and given to individuals or groups who making a<br/>\nlasting difference in the lives of communities through dedication to<br/>\nhuman rights, social justice, community development, and environmental<br/>\nrestoration.<br/>\n<br/>\nI now have pictures of the blocks being made through a joint effort of<br/>\nmen, women, and children, and the pride in the faces of the people is<br/>\nimpossible to describe.  I will try to find a way to post the pictures<br/>\non the web sometime soon.  My mother takes special pleasure in reporting<br/>\nthat in her previous housebuilding efforts, trees (which are very scarce<br/>\nin coastal South India) had to be cut down to fuel the firing of<br/>\nbricks.  Cinder blocks, which provide excellent insulation against the<br/>\nheat, can be made from all locally-available materials and require only<br/>\nsun and water (both of which they have aplenty) for curing.<br/>\n<br/>\nMeanwhile, my fathers struggle against multinational-based prawn<br/>\ncompanies that continue to cut down mangroves and salinate the soil in<br/>\nviolation of Indian law, continues apace. In one village, when people<br/>\nwent out to protest the destruction of their livelihood (the rice<br/>\nfields), the corporation hired goon squads to sit fire to all 35 homes.<br/>\nI am grateful to announce that the people have now completely rebuilt<br/>\ntheir village  in cinder block  with your help (and that of a small<br/>\nItalian aid agency.)<br/>\n<br/>\nFor those of you who are homeschooling children who might be able to<br/>\nappreciate all of this (and how we homeschooling families have managed<br/>\nto make a difference in such a far off place), I invite you to have them<br/>\nwrite to me with any questions they might have  about India, about life<br/>\nin a village, or about how we can all make difference in working to make<br/>\nthe world a better place for all of us.  I promise to answer all<br/>\nquestions as best I can.<br/>\n<br/>\nDavid Albert<br/>\n<br/>\n<br/>\n(P.S.  For those of you who would still like to contribute  we can<br/>\nstill use funds (and its tax-deductible!), make a check out to the<br/>\nGandhian Foundation, and send it to me at:<br/>\nSkylark Sings<br/>\n1717 18th Court NE<br/>\nOlympia, WA 98506<br/>\n<br/>\nAnother way you can contribute is to purchase a copy of Skylark directly<br/>\nfrom me: $16.95 (free shipping, and Ill even sign it for you!) <br/>\naddress as above.  Thanks!<br/>\n<br/>\n<br/>\n--<br/>\n&quot;And the Skylark Sings with Me&quot; is to homeschooling what Tom Paine&#39;s<br/>\n&quot;Common Sense&quot; was to the American Revolution.&quot;--Greg Bates, Common<br/>\nCourage Press. To read a sample chapter or the foreword, and to get<br/>\ninformation about ordering a signed copy, visit www.skylarksings.com or<br/>\nsend an e-mail to <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shantinik@...\">shantinik@...</a></div>","specialLinks":[]}],"prevTopicId":9501,"nextTopicId":9516}}