{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"DiamondAir","from":"&quot;DiamondAir&quot; &lt;diamondair@...&gt;","replyTo":"LIST","senderId":"Yd4E4mQMC90sQ-h4kOeG1NJquaRhO018lVNMO2-Xy9oxUG0l2biGpLkEXJthNv-ZQ0M6HRGOffJfjNRbkt-32qLkLNtaCN1_FcgudngR","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Protecting our children","postDate":"986916427","msgId":18457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxM2UwMWMwYzFkNSQxYzg0NDg0MCQwMTAwMDA3ZkA4MzhmMzAxPg==","referencesHeader":"PDk4NjcwMDU3MC4xNjk0LjkzODI3Lmw4QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":18456,"nextInTime":18458,"topicId":18457,"numMessagesInTopic":0,"msgSnippet":"I haven t read Protecting the Gift yet, but I ve heard so many good things about it, it s on my must read list. As a child in a small semi-rural Oregon","messageBody":"<div id=\"ygrps-yiv-1808731610\">I haven&#39;t read &quot;Protecting the Gift&quot; yet, but I&#39;ve heard so many good things<br/>\nabout it, it&#39;s on my &quot;must read&quot; list. As a child in a small semi-rural<br/>\nOregon town (&lt;2000 people), we had pretty much unlimited freedom. Sometimes<br/>\nI&#39;m surprised that we didn&#39;t really get hurt - not by kidnappers or child<br/>\nmolesters but just because we were in dangerous places with no adult<br/>\nsupervision - old mine shafts, old wells, etc. were all over the places that<br/>\nwe played. One of the mine shafts that we played in collapsed (fortunately<br/>\nnot while anyone was in it). But I digress.... one of our goals for moving<br/>\nhere was to be in a community where we will eventually feel safe with our<br/>\nchildren having freedom. Living here, we often see kids walking or riding<br/>\ntheir bicycles alone or in groups, and I like seeing that. Our own<br/>\nneighborhood is very community-like and people know and watch out for<br/>\nothers.<br/>\n<br/>\nThe things we do that I think will help our children out the most to keep<br/>\nthem safe...<br/>\n<br/>\n1) We respect our own boundaries, so we teach respect. Even with my (18<br/>\nm.o.) daughter, I will politely say &quot;I don&#39;t want you to touch me there,<br/>\nthat&#39;s private, that makes me uncomfortable&quot;. Or if DH and I are argueing<br/>\nand it gets a little too heated, I will say &quot;I don&#39;t like the way you&#39;re<br/>\ntalking to me, I don&#39;t want to be around that right now&quot; and I&#39;ll walk into<br/>\nanother room. Showing our kids how to have self-respect, and politely but<br/>\nfirmly deal with others crossing our boundaries is a good first step<br/>\n<br/>\n2) We respect our children and their bodies. If they don&#39;t want to be<br/>\nhugged, kissed, tickled, rough-housed, we don&#39;t do it. We respect their &quot;no&quot;<br/>\nand we are advocates for them with others until they&#39;re old enough to do it<br/>\nthemselves. Even with our own relatives, we have had to occasionally say<br/>\n&quot;Mom, Mackenzie is saying he doesn&#39;t want to be kissed and I&#39;d like you to<br/>\nrespect that&quot;. My son is naturally very protective of his body. Even when he<br/>\nwas 2, and I was going to the YMCA, the nursery workers there got a bit<br/>\npeeved that he wouldn&#39;t let them change his diaper. I just told them<br/>\n&quot;Respect his wishes, you can call me at anytime to change him if it&#39;s<br/>\nnecessary. I don&#39;t mind at all&quot;. Personally, I&#39;m glad that even at such a<br/>\nyoung age, he was adamant about his body limits. My daughter on the other<br/>\nhand would probably walk off contentedly hand-in-hand with a stranger and<br/>\nonly miss me when it was &quot;nummy&quot; time :-).<br/>\n<br/>\n3) We always let them know that they can tell us anything, and they will not<br/>\nbe blamed, shamed, or punished. This is something a child can only learn<br/>\nafter years of consistent behavior from the parents.<br/>\n<br/>\n4) We are with them, or people we trust are with them at all times. This<br/>\nmeans that they&#39;re never left alone with even many of our close family<br/>\nmembers. They do go to the nursery at our gym, but it has glass windows and<br/>\nI can observe them anytime I wish during my workout.<br/>\n<br/>\nSo they know from example and verbalizing that they can respect their<br/>\nbodies, that we will respect their bodies, that they can tell others to<br/>\nrespect their bodies, and that we will be advocates for them to others about<br/>\ntheir own limits. As far as trusting us, we have always given them the<br/>\nmessage that they can trust us implicitly. I&#39;ve thought a lot about what<br/>\nsomeone posted this week about telling their kids to go to someone else if<br/>\nthey felt their own parents weren&#39;t treating them right. That was great food<br/>\nfor thought and discussion. I think for us, that wouldn&#39;t be the right thing<br/>\nto do (though I respect that it may be for others). We put in a lot of work<br/>\npreparing to be parents (not that you&#39;re ever fully prepared, LOL) and both<br/>\nmy husband and I feel that if didn&#39;t trust ourselves to always do the right<br/>\nthing for our kids (to the best of our knowledge) then we would not have<br/>\nmade the decision to have kids. In fact, for years I didn&#39;t want to have<br/>\nkids because I wasn&#39;t in that place in my head where I thought I would be a<br/>\ngood parent. So we came to parenthood later than some (though earlier than<br/>\nmany, esp. these days), but fully trusting in ourselves to be good and just<br/>\nparents. If we ever knew that we were hurting our kids, we would seek help<br/>\nourselves, I know this. I feel strongly that the initial parent-child<br/>\nattachment is the bond of safety from which all other good relationships<br/>\nspring. I don&#39;t want them to lose the magic of being able to totally rely on<br/>\nthat bond without question. At some point in their lives they will have to<br/>\nhave more complex and questioning relationships (with us as well as with<br/>\nothers), but the ultimate innocence, trust, and intimacy that they bring to<br/>\nthis initial one is unique, I feel I don&#39;t want to change that.<br/>\n<br/>\n Blue Skies!<br/>\n   -Robin-<br/>\nMom to Mackenzie (8/28/96) &quot;Asa is running her voice out&quot;<br/>\nand Asa (10/5/99) Who sings &quot;the alien song&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/the_clevengers\">http://www.geocities.com/the_clevengers</a>   Flying Clevenger Family</div>","specialLinks":[]}],"prevTopicId":18455,"nextTopicId":18456}}