{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":163750020,"authorName":"tuckervill2@aol.com","from":"tuckervill2@...","profile":"tuckervill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] A little off topic, but regarding choices","postDate":"1114432541","msgId":105600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzZC4xMjAzMzAwNi4yZjllM2UxZEBhb2wuY29tPg=="},"prevInTopic":105589,"nextInTopic":0,"prevInTime":105599,"nextInTime":105601,"topicId":105586,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/2005 8:20:23 PM Central Standard Time, McGeath3@aol.com writes: BUT my guilt makes me stay or my feeling of responsibility.  I d love","messageBody":"<div id=\"ygrps-yiv-178456668\">In a message dated 4/23/2005 8:20:23 PM Central Standard Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:McGeath3@...\">McGeath3@...</a> writes:<br/>\n<br/>\nBUT my guilt makes me stay or my feeling <br/>\nof responsibility.  I&#39;d love  to say that I quit because I need a <br/>\npaycheck, and not worry about what  that will do to mom and I love to <br/>\nwork somewhere else where I&#39;m not around  my brother all day BUT <br/>\nagain, I stay..........Is that my choice?  or  my guilt?  or my <br/>\nresponsibility?<br/>\n<br/>\n<br/>\n<br/>\n~~~<br/>\n <br/>\nIt must be paying off for you in some way to be a doormat.  Have you  read <br/>\nSandra&#39;s Certificate of Empowerment?<br/>\n <br/>\nAnother thing...you&#39;re taking care of your parents business, but because  <br/>\nyou&#39;re not getting paid enough, your family is suffering.  <br/>\n <br/>\nYou should feel guilty about that.  Your parents are grown up and  you&#39;re not <br/>\nresponsible for their choices.  Do you want your kids to feel  obligated to <br/>\nyou like you feel to your parents and ignore their families true  and rightful <br/>\nneeds?  No, of course not.  Don&#39;t model misplaced  martyrdom for them.<br/>\n <br/>\nKaren<br/>\n <br/>\nwww.badchair.net<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] A little off topic, but regarding choices","postDate":"1114314295","msgId":105589,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFlMy4zYTZkZWUzOS4yZjljNzAzN0Bhb2wuY29tPg=="},"prevInTopic":105586,"nextInTopic":105600,"prevInTime":105588,"nextInTime":105590,"topicId":105586,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/23/05 7:20:16 PM, McGeath3@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-829959818\">In a message dated 4/23/05 7:20:16 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:McGeath3@...\">McGeath3@...</a> writes:<br/>\n<br/>\n&lt;&lt;  if I quit (which I really would have <br/>\n<br/>\nliked to do years ago) then my mom would have to do my job and &gt;&gt;<br/>\n<br/>\nHAVE to?<br/>\nWhat if you and your mom together go to your dad and say &quot;This isn&#39;t a doable <br/>\njob.  It&#39;s killing me and it would kill mom.&quot;<br/>\n<br/>\n-=-I&#39;d love to say that I quit because I need a <br/>\n<br/>\npaycheck, and not worry about what that will do to mom and I love to <br/>\n<br/>\nwork somewhere else where I&#39;m not around my brother all day BUT <br/>\n<br/>\nagain, I stay..........Is that my choice?  or my guilt?  or my <br/>\n<br/>\nresponsibility?-=-<br/>\n<br/>\nCan your brother do the job you&#39;re doing, at least half time?<br/>\n<br/>\n-=-I&#39;d love to say that I quit because I need a <br/>\n<br/>\npaycheck,-=-<br/>\n<br/>\nYou can&#39;t get this time back.  <br/>\n<br/>\nMaybe make a list on paper with the &quot;pro&quot; column and the &quot;anti-&quot; column.  <br/>\nWhat are the advantages to your staying there?    What harm can (or is) coming of <br/>\nit?  What harm might come of your quitting?<br/>\n<br/>\nIt&#39;s not an easy question.  Try to look at it, too, from five years away.  <br/>\nRun several mental simulations, if you can, kind of like thinking ahead a few <br/>\nmoves in a game.  What are the best possible outcomes?  Some of the worst ones?  <br/>\nDon&#39;t just think of one or two.  Think of six or seven.  Take notes, or draw <br/>\npictures.   Breathe deeply and don&#39;t let the stress of all this get you stuck <br/>\nand sleepless.  <br/>\n<br/>\nThat&#39;s not a whole &quot;answer,&quot; it&#39;s just some ideas to help you back out of the <br/>\nmire and look at it in a less tangled way.   Maybe you do need to finish, but <br/>\nhow can you see it clearly enough to feel better about it?  (That&#39;s what the <br/>\nsuggestions are intended to help with, I hope.)<br/>\n<br/>\nAnother idea is to take a break from it for a week or two.  Leave town.  See <br/>\nhow it goes with your mom or brother doing it instead.  Then when you come <br/>\nback (if you come back) you can tell your dad more clearly what you see (maybe).<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":56474202,"authorName":"greencow32766","from":"&quot;greencow32766&quot; &lt;McGeath3@...&gt;","profile":"greencow32766","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"A little off topic, but regarding choices","postDate":"1114304890","msgId":105586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ0ZXJocSt1NHM4QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":105589,"prevInTime":105585,"nextInTime":105587,"topicId":105586,"numMessagesInTopic":0,"msgSnippet":"I just posted another message with this quote from an article that I think Sandra referred me to and I wanted to start another  message about it. Choice is a","messageBody":"<div id=\"ygrps-yiv-1944176769\">I just posted another message with this quote from an article that I <br/>\nthink Sandra referred me to and I wanted to start another  message <br/>\nabout it.<br/>\n<br/>\n&quot;Choice is a really important conceptnot just semantics. It&#39;s the <br/>\ndifference between anger, regret, resentment and happiness, comfort <br/>\nand joy in life.&quot;<br/>\n<br/>\nAbout 4 years ago, we lived with my husbands grandma to care for her <br/>\nafter grandpa died and she couldn&#39;t live alone any longer.  To try to <br/>\nmake a long story short, she fell, broke both arms, it was cheaper <br/>\nfor me to quit my job and take care of her than going into a nursing <br/>\nhome/rehab center so yes, I chose to care for her.  I should have <br/>\nknown better - for as long as we knew her, she was known to say mean, <br/>\nspitefull things, talk behind your back, be very demanding <br/>\netc....Well, I took care of her for about 18 months full time - alone <br/>\nbecause no one else in the family could stand to be around her.  I <br/>\nalmost fell apart - I think I must have had a nervous breakdown - I <br/>\nmade some really bad choices because I was so miserable - I turned <br/>\ninto her - I was just awful to be around but didn&#39;t feel like I had <br/>\nany choices.  Even though she was so awful to me, I couldn&#39;t stand <br/>\nthe thought of putting her in a nursing home, I was afraid that she <br/>\nwould feel so alone and out of place so I wouldn&#39;t consider it.  My <br/>\nfamily & marriage suffered terribly until she passed away.  After she <br/>\nwas gone I told myself &quot;never again&quot;.  But as I see our parents <br/>\naging, I&#39;m already telling myself I couldn&#39;t put them in a nursing <br/>\nhome - yes that&#39;s my choice I guess but it&#39;s also my responsibility?  <br/>\nor my guilt?  <br/>\n<br/>\nI&#39;m kind of in the same boat now - I&#39;m not very happy with my life <br/>\nbut I feel I have no choice and it&#39;s due to guilt.  I work for my <br/>\ndad&#39;s small business, it&#39;s going under, they just filed bankruptcy <br/>\nbut if we can someone just make it work until dad&#39;s full retirement <br/>\nkicks in in about a year, I&#39;m barely getting paid anymore, we are <br/>\nfalling behind on our bills, but if I quit (which I really would have <br/>\nliked to do years ago) then my mom would have to do my job and the <br/>\nlast time they tried working together they almost got a divorce and <br/>\nstill have marriage problems.  So I stay, also I tell myself it&#39;s a <br/>\ngood flexible situation with my daughter being homeschooled and them <br/>\nbeing her grandparents!  Then throw my 28 year old brother into the <br/>\npicture, he&#39;s back home with my mom & dad, trying to recover from <br/>\nprescription drug abuse.  He&#39;s been home 3 years and driving us all <br/>\ncrazy - we think he&#39;s bipolar, there&#39;s no money for counseling etc.. <br/>\nhis pride prevents him from going to the county for help unless one <br/>\nof us take him by the hand etc.... I learned my lesson from taking <br/>\ncare of grandma - I don&#39;t want to be around a situation like that <br/>\nagain but I kind of am now.  BUT my guilt makes me stay or my feeling <br/>\nof responsibility.  I&#39;d love to say that I quit because I need a <br/>\npaycheck, and not worry about what that will do to mom and I love to <br/>\nwork somewhere else where I&#39;m not around my brother all day BUT <br/>\nagain, I stay..........Is that my choice?  or my guilt?  or my <br/>\nresponsibility?<br/>\n<br/>\nTracie</div>","specialLinks":[]}],"prevTopicId":105283,"nextTopicId":105601}}