{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":39,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210802134","msgId":34883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1M0JDRURBLTI0RTMtNDAwRC04MEQ4LUI2MEEzNDMzRTgzREBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGcwZmxibithcmtqQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwZmxibithcmtqQGVHcm91cHMuY29tPg=="},"prevInTopic":34881,"nextInTopic":34885,"prevInTime":34882,"nextInTime":34884,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"-=-, then I went over to the other two kids, and in a voice I rarely even use with my own children told them that what they were doing was not cool and it had","messageBody":"<div id=\"ygrps-yiv-466257382\">-=-, then I went over to the other two<br/>\nkids, and in a voice I rarely even use with my own children told them<br/>\nthat what they were doing was not cool and it had to stop now, and it<br/>\nwas NOT okay to keep hitting and antagonizing my son and his friends.<br/>\nI do not like to step in for another child&#39;s parent, but I felt that I<br/>\nreally needed to let my son know that -=-<br/>\n<br/>\nHow was that &quot;stepping in for another child&#39;s parent&quot;?<br/>\n<br/>\nI was with you until you started to explain (I think) that you did it  <br/>\nso your son would see that you weren&#39;t approving of the other boys&#39;  <br/>\nbehavior.  Is that why you talked to them?<br/>\n<br/>\n(You don&#39;t have to answer.   I&#39;m asking more so you&#39;ll think about  <br/>\nit, but if you want to clarify, that&#39;s cool too.)<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":137349367,"authorName":"cathyandgarth","from":"&quot;cathyandgarth&quot; &lt;familialewis@...&gt;","profile":"cathyandgarth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210800311","msgId":34881,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwZmxibithcmtqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDVENUFGRDg0LUUwNTItNDVDQy1BMUIyLUQ1NjYyNTFBQ0UxQkBtYWMuY29tPg=="},"prevInTopic":34879,"nextInTopic":34883,"prevInTime":34880,"nextInTime":34882,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... in ... away ... This is good for me to hear right now ... about two weeks ago we were at an open gym and another couple of kids were there that my son has","messageBody":"<div id=\"ygrps-yiv-1700927786\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pamela Sorooshian <br/>\n&lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I just don&#39;t see this. If I lost my temper and was about to take a  <br/>\n&gt; swing at someone, I&#39;d be pretty darn grateful if my husband stepped <br/>\n </span></blockquote>in  <br/>\n<blockquote><span title=\"ireply\"> &gt; between us and grabbed hold of my arm and even forcibly walked me <br/>\n </span></blockquote>away  <br/>\n<blockquote><span title=\"ireply\"> &gt; from the situation. That&#39;s not adversarial; that&#39;s helpful. He KNOWS  <br/>\n&gt; me - he knows I would want to be stopped, if I was thinking clearly.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>This is good for me to hear right now ... about two weeks ago we were <br/>\nat an open gym and another couple of kids were there that my son has a <br/>\n*history* with, one in particular that has pretty consistently started <br/>\nthings with my son and then, in my opinion, played innocent so that his <br/>\nmom sided with him.  I have tried to keep an open mind and walk the <br/>\nfine line of validating my son&#39;s feelings and not being okay with <br/>\naggressive/violent actions and trying to keep the other boy&#39;s <br/>\nperspective in mind.  At this open gym event however the boy and <br/>\nanother child were really antagonizing my son and his friends, I tried <br/>\nto give my son some coaching, and I started sticking close by as it <br/>\nseemed like things were getting more heated, but the other kids just <br/>\nkept running up and randomly hitting them with these foam things until <br/>\nmy son actually got hurt when one got him in the eye.  When my son got <br/>\nhurt he flew into a rage and I had to physically hold him back as he <br/>\nflailed and screamed (I have never seen him get mad like that at <br/>\nsomeone outside of our immediate family).  If I hadn&#39;t held him back he <br/>\nwould have physically injured the other boy ... it would not have been <br/>\nhelpful to either one of them if I had stood aside and let that <br/>\nhappen.  So, yes, I used force on my child.  But after he had calmed <br/>\ndown enough, and we talked a little and he was able to walk away and go <br/>\nback to playing with his friends, then I went over to the other two <br/>\nkids, and in a voice I rarely even use with my own children told them <br/>\nthat what they were doing was not cool and it had to stop now, and it <br/>\nwas NOT okay to keep hitting and antagonizing my son and his friends.  <br/>\nI do not like to step in for another child&#39;s parent, but I felt that I <br/>\nreally needed to let my son know that even though it wasn&#39;t okay to <br/>\nphysically fight with or scream abuse at the other boy, I was still on <br/>\nhis side, I wasn&#39;t going to just sit there and keep telling him to turn <br/>\nthe other cheek, in essence saying that it was okay for the other kids <br/>\nto behave and treat him inappropriately / disrespectfully.<br/>\n<br/>\nAnyway, these threads have been so perfect for me, because I have found <br/>\nmyself over the last couple of weeks realiving the entire episode, <br/>\nwondering over and over if it happened again would I handle it the same <br/>\nway?  Of course, I can&#39;t know for sure, but reading other folks <br/>\nthoughts on these subjects has really helped me to clarify my own <br/>\nthinking and feel more okay with the force I did use on my child and <br/>\nway I talked to the other kids.  I can&#39;t imagine that I ever would just <br/>\nlet my kid beat another kid up because he *deserved* it, but I have to <br/>\nadmit that thought came to me often ... My son has a good heart though, <br/>\nI don&#39;t think that he would have been very happy with himself if I had <br/>\nlet him do that.<br/>\n<br/>\nI don&#39;t know, I guess that I am still mulling it over ... thinking <br/>\nabout how things played out, if there was anything I could have done to <br/>\nkeep it from happening, etc.  No real questions, but I get such great <br/>\ninsight from these lists, from folks who see things that I haven&#39;t <br/>\nnoticed, that I felt compelled to post.  <br/>\n<br/>\nCathy in CO</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210792692","msgId":34879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENFNzQ2MzE3LTVDMEEtNDQ2MS1BRDNCLTZFRUI4MjA5RjdDNEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGM2NDM4ODRjMDgwNTE0MTEwMnE2YWEwOWMyN3g1ODZkMTZlYjdkMDRlY2RkQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGM2NDM4ODRjMDgwNTE0MTEwMnE2YWEwOWMyN3g1ODZkMTZlYjdkMDRlY2RkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":34877,"nextInTopic":34881,"prevInTime":34878,"nextInTime":34880,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"-=-Horrendous tempers run in both my and DH s families. People who break things, throw things, get in fights, end up in jail. Clearly, not a lot of good","messageBody":"<div id=\"ygrps-yiv-209268078\">-=-Horrendous tempers run in both my and DH&#39;s families. People who break<br/>\nthings, throw things, get in fights, end up in jail. Clearly, not a  <br/>\nlot of<br/>\ngood management skills there. =)-=-<br/>\n<br/>\n<br/>\n<br/>\nI think it&#39;s that biochemisty is fast on the adrenaline surge.  I  <br/>\nknow people that way.  I&#39;m not as bad as some, but bad.  Kirby is  <br/>\ntoo.  So we helped Kirby, specifically, learn ways to feel it and  <br/>\ncounteract it.  I guess that&#39;s a self-management skill.<br/>\n<br/>\n<br/>\n<br/>\nI have some other friends that you could be poking their faces and  <br/>\ninsulting their mothers and stepping on their toes and they&#39;d still  <br/>\nbe totally rational and non-emotional.   One is an assistant district  <br/>\nattorney.  GOOD TRAIT for that job!!! Perfect.  One used to be an air  <br/>\ntraffic controller.  Now he works at the post office.  No danger of  <br/>\nhim shooting the joint up.<br/>\n<br/>\n<br/>\n<br/>\n-=-The trust about being really listened to is there, so neither of  <br/>\nus feel the need to reach for the antics of our emotionally-fraught  <br/>\nyouths.-=-<br/>\n<br/>\nWhat a beautiful phrase!<br/>\n<br/>\n-=-his tantrum was pretty spectacular. I took him into a quiet,  <br/>\ndarkened room, removed sharp objects and corners, and let him go for  <br/>\nit, while sitting quietly with him until he wound down. He threw  <br/>\nthings (I handed him stuffed animals and pillows and stuff), he  <br/>\nheadbanged into the bed, he screamed like he was being tortured. That  <br/>\ntook about 20 minutes. He eventually sobbed to a stop-=-<br/>\n<br/>\nI&#39;ve had two tantrums as an adult.  Both had witnesses.  Nobody hit  <br/>\nme, thank God, and they were both for good reasons, and everyone  <br/>\ninvolved knew it, and they stayed close and listened but let me yell  <br/>\nit out and I cried until my abdomen ached all kinds of ways, and then  <br/>\nI was all better.  It was a little like puking when you&#39;re food  <br/>\npoisoned.  It was like my biochemistry was all filled up with  <br/>\npoisonous overload and I had to get it out.<br/>\n<br/>\nOnce was before I had kids, and I drove home three miles or so and  <br/>\nthen came in screaming and crying, and Keith followed me into the  <br/>\nbedroom where I throw myself across and wailed.  I hadn&#39;t taken five  <br/>\nor six breaths deep enough to wail again when I heard the friend  who  <br/>\nhad pissed me off come to the door.  He had jumped in the car and  <br/>\nfollowed me, to apologize and to make sure I was okay.  That didn&#39;t  <br/>\nsuck.  And he had grabbed a rose from the big rosebush by his door, too.<br/>\n<br/>\nI heard Keith say &quot;I don&#39;t think she wants to talk yet,&quot; or some  <br/>\nsuch, and I heard their voices through my crying and (literally)  <br/>\nbiting the edge of the mattress because I didn&#39;t want him to hear me  <br/>\ncrying but I was still seriously furious.  Keith brought me the  <br/>\nrose.  It was white, and big.  And I&#39;m still friends with the guy to  <br/>\nthis day.<br/>\n<br/>\nThe second time was after I had kids, but they weren&#39;t home.  Two  <br/>\nfriends were with me, cooking, and a third came to tell me something  <br/>\nbecause she wanted me to know as soon as possible.  It was a social  <br/>\nthink, unrecoverable, very frustrating for me, and she knew I would  <br/>\nbe crushed.  She didn&#39;t come to crush me, she came to let me get it  <br/>\nout while I was home, before the three of us drove over to the site  <br/>\nand I found out in front of 150 people.  It was good.  The three  <br/>\npeople who saw me blow totally understood.<br/>\n<br/>\nIn both cases, had I had someone there to say &quot;breathe&quot; in the moment  <br/>\nI was processing the information before I went into &quot;kill&quot; mode (or  <br/>\nif I had thought to breathe myself) and thought to take a really long  <br/>\nslow deep-as-possible breath, I wouldn&#39;t have had the toxic  <br/>\nuncontrollable overload.<br/>\n<br/>\nSo with younger kids who don&#39;t know the world so well, whose time  <br/>\nperspective is still like a day is a year and a week is forever, who  <br/>\naren&#39;t quite sure of permanence and frequency and distance, little  <br/>\nthings can easily be overwhelming.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":217568290,"authorName":"Laureen","from":"Laureen &lt;splashing@...&gt;","profile":"elementalgrrl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210788155","msgId":34877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM2NDM4ODRjMDgwNTE0MTEwMnE2YWEwOWMyN3g1ODZkMTZlYjdkMDRlY2RkQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":34869,"nextInTopic":34879,"prevInTime":34876,"nextInTime":34878,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"Heya! ... Horrendous tempers run in both my and DH s families. People who break things, throw things, get in fights, end up in jail. Clearly, not a lot of good","messageBody":"<div id=\"ygrps-yiv-1812091828\">Heya!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, May 13, 2008 at 8:07 AM, Lyla Wolfenstein &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lylaw@...\">lylaw@...</a>&gt; wrote:<br/>\n<br/>\n&gt; i have been mulling those sentiments over for 2-3 years now!  and trying to<br/>\n&gt; be very aware of showing her my love in personal ways - unconditional in the<br/>\n&gt; sense of reaching through her anger, or other &quot;difficult&quot; emotions, when<br/>\n&gt; those occur- not rejecting the &quot;dark side&quot;  - but reaching through it - not<br/>\n&gt; around it, not ignoring it - and still trying to make sure that my love is<br/>\n&gt; expressed (and felt) as personal/connected to her as an individual, not just<br/>\n&gt; &quot;my daughter.&quot;<br/>\n<br/>\n<br/>\nHorrendous tempers run in both my and DH&#39;s families. People who break<br/>\nthings, throw things, get in fights, end up in jail. Clearly, not a lot of<br/>\ngood management skills there. =)<br/>\n<br/>\nWhen DH and I met, he was considered by our mutual social group to be<br/>\n&quot;scary&quot;. And having grown up in a very rough neighborhood, he projected<br/>\nthat, as a &quot;leave me alone&quot; thing. &quot;Fear me!&quot; was the message. And because<br/>\nof my own history, I wasn&#39;t a lot different. People were... concerned, when<br/>\nwe got together. &quot;It&#39;s like nitro dating glycerine!&quot; one friend exclaimed,<br/>\n&quot;and this can&#39;t end well!!!&quot;<br/>\n<br/>\nThe first time we had a squabble, sure enough, we both puffed like prairie<br/>\nchickens. I imagine it was pretty funny from the outside. And what we both<br/>\nrealized was that it was a test... sure, I&#39;m playing scary, but do *you*<br/>\nfear me? Am I really scary? Have I scared you? And then we realized that you<br/>\ndon&#39;t test the people you love. When you love people, you just say &quot;I feel<br/>\nscary and mean and I need reassuring&quot; and the people who love you say &quot;well<br/>\nsure you&#39;re stomping around and acting fearsome; how can I help? What do you<br/>\nreally need?&quot; and usually, it&#39;s just a matter of a clearly-stated need, and<br/>\na heartfelt response.<br/>\n<br/>\nWe&#39;ve both mellowed hugely, just because finally, we don&#39;t have to escallate<br/>\njust to be heard. The trust about being really listened to is there, so<br/>\nneither of us feel the need to reach for the antics of our<br/>\nemotionally-fraught youths.<br/>\n<br/>\nThe first time Rowan &quot;threw a tantrum&quot; (I hate that word, but I&#39;m not sure<br/>\nwhat else to call it), we hung out with him, reassured him that we were<br/>\nright there for him once he worked out the crazies, and just stayed in the<br/>\nspace. He wasn&#39;t scary, he was just having big emotions. I think he had one<br/>\nother tantrum, ever. Same deal with Kestrel... his first major tantrum (he<br/>\nwas little, probably 18-19 months or so), my MiL was visiting. Kes is a far<br/>\nmore intense kid than Rowan, and his tantrum was pretty spectacular. I took<br/>\nhim into a quiet, darkened room, removed sharp objects and corners, and let<br/>\nhim go for it, while sitting quietly with him until he wound down. He threw<br/>\nthings (I handed him stuffed animals and pillows and stuff), he headbanged<br/>\ninto the bed, he screamed like he was being tortured. That took about 20<br/>\nminutes. He eventually sobbed to a stop, crawled into my lap, and wanted to<br/>\nnurse and just be held and reassured. My MiL commented &quot;I don&#39;t know how you<br/>\ndidn&#39;t hit him.&quot; And yet... here we were, totally together, trust intact.<br/>\nShe couldn&#39;t see it. Go fig. Kes had I think two or three more of those, but<br/>\nat nearly three, seems to be pretty much done.<br/>\n<br/>\nThey&#39;re just big emotions, and everyone feels big and ugly and scary and<br/>\nmean sometimes. I think that if we, as parents and partners, can just hold<br/>\nthe attitude that &quot;you&#39;re not scary, you&#39;re just moving through the big<br/>\nstuff, and I&#39;m here for you, cause I did exactly the same thing once and<br/>\nhere I am on the other side&quot;, the whole thing loses its power.<br/>\n<br/>\n-- <br/>\n~~L!<br/>\n<br/>\n~ * ~ ~ * ~ ~ * ~ ~ * ~ ~ * ~<br/>\nWriting here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.theexcellentadventure.com/\">http://www.theexcellentadventure.com/</a><br/>\n<br/>\nEvolving here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.consciouswoman.org/\">http://www.consciouswoman.org/</a><br/>\n~ * ~ ~ * ~ ~ * ~ ~ * ~ ~ * ~<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210766518","msgId":34869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwZWtibStqbjFuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwY2liNitvNW5zQGVHcm91cHMuY29tPg=="},"prevInTopic":34865,"nextInTopic":34877,"prevInTime":34868,"nextInTime":34870,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... of or ... who ... or reject a behavior, you ... personality acting on the world. ... Oh, ok. I misunderstood what you were saying. I agree with you on ","messageBody":"<div id=\"ygrps-yiv-1840225142\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Joanna Murphy&quot; <br/>\n&lt;ridingmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt; If I follow this line of reasoning, then any time I disapprove <br/>\n </span></blockquote>of or <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; reject a behavior, I am disapproving of or rejecting the person <br/>\n </span></blockquote>who <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; exhibited the behavior. <br/>\n&gt; <br/>\n&gt; No--if you follow the line of reasoning, then if you disapprove of <br/>\n </span></blockquote>or reject a behavior, you <br/>\n<blockquote><span title=\"ireply\"> &gt; are rejecting that behavior--which is an extension of that <br/>\n </span></blockquote>personality acting on the world.  <br/>\n<blockquote><span title=\"ireply\"> &gt; It doesn&#39;t represent the whole person--just a part.  <br/>\n<br/>\n </span></blockquote>Oh, ok. I misunderstood what you were saying. I agree with you on <br/>\nthis.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My point was that you can&#39;t separate <br/>\n&gt; behavior from the person as though the behavior was just some <br/>\n </span></blockquote>random event, just as <br/>\n<blockquote><span title=\"ireply\"> &gt; likely to occur as not occur.  <br/>\n<br/>\n </span></blockquote>I&#39;m not sure I totally agree with this. I think there might be many <br/>\nbehaviors that are basic human nature that don&#39;t have anything to do <br/>\nwith the individual person or personality. One type of personality <br/>\nmay be more likely to exhibit the behavior sooner but that doesn&#39;t <br/>\nmake the behavior, itself, part of the personality. <br/>\n<br/>\nTake hitting, for example. I&#39;ve never known or heard of a child who <br/>\nnever hit anyone or anything. Hitting is basic defense mechanism. <br/>\nThe ability and feeling of need to hit is in us all. I have seen <br/>\nwith my own children that some are more quick to hit than others. <br/>\nThat&#39;s part of the child&#39;s personality, the impulsiveness about it. <br/>\nSo, I accept the child&#39;s impulsiveness. I don&#39;t reject that. I don&#39;t <br/>\ncompare him to his brother (I have all boys) and tell him he should <br/>\nbe more like the brother who&#39;s not as quick to hit. I understand <br/>\nthat he may need more of my time and attention and energy to find <br/>\nways to deal without hitting. <br/>\n<br/>\nI&#39;m just thinking out loud here so I&#39;m not sure I agree totally with <br/>\nwhat I&#39;m saying here, either. It&#39;s all very complex. I appreciate <br/>\nthe discussion of ideas.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210744022","msgId":34865,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVENUFGRDg0LUUwNTItNDVDQy1BMUIyLUQ1NjYyNTFBQ0UxQkBtYWMuY29tPg==","inReplyToHeader":"PGcwYzZoMCtuM2ZmQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwYzZoMCtuM2ZmQGVHcm91cHMuY29tPg=="},"prevInTopic":34862,"nextInTopic":34869,"prevInTime":34864,"nextInTime":34866,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... I just don t see this. If I lost my temper and was about to take a swing at someone, I d be pretty darn grateful if my husband stepped in between us and","messageBody":"<div id=\"ygrps-yiv-548993447\">On May 13, 2008, at 6:53 AM, barefootmamax4 wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  That is not<br/>\n&gt; showing force but also not giving unconitional approval.When is it<br/>\n&gt; acceptable to cross the line of free choice and move into force of<br/>\n&gt; compliance?Then you are adversaries not partners. Now you have a<br/>\n&gt; battle of wills ,a powerplay weather you wanted it or not.<br/>\n<br/>\n </span></blockquote>I just don&#39;t see this. If I lost my temper and was about to take a  <br/>\nswing at someone, I&#39;d be pretty darn grateful if my husband stepped in  <br/>\nbetween us and grabbed hold of my arm and even forcibly walked me away  <br/>\nfrom the situation. That&#39;s not adversarial; that&#39;s helpful. He KNOWS  <br/>\nme - he knows I would want to be stopped, if I was thinking clearly.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":340838541,"authorName":"Clarissa Fetrow","from":"&quot;Clarissa Fetrow&quot; &lt;clarissafetrow@...&gt;","profile":"cla1024","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210735033","msgId":34862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMxMzQ4ODI4MDgwNTEzMjAxN3FhYTQ5MzIzczYwMjUyNDQ5MzA1NzllOTZAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGcwZGtyMStvMTVhQGVHcm91cHMuY29tPg==","referencesHeader":"PDMzREYxRTEwLUI1MUUtNDQyQi04QTM5LUY3QzM5NkY3MzM5QkBzYW5kcmFkb2RkLmNvbT4JIDxnMGRrcjErbzE1YUBlR3JvdXBzLmNvbT4="},"prevInTopic":34861,"nextInTopic":34865,"prevInTime":34861,"nextInTime":34863,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"I think one of the main things my 5 year old is learning is how other families do things.  In the home of one family we know, kids are not allowed to stand up","messageBody":"<div id=\"ygrps-yiv-1544816149\">I think one of the main things my 5 year old is learning is how other<br/>\nfamilies do things.  In the home of one family we know, kids are not allowed<br/>\nto stand up on any furniture, including the couch.  In our home, she is<br/>\nbasically allowed to stand on any piece of furniture (including the dining<br/>\ntable, which I&#39;ve seen appall and offend some people), as long as it seems<br/>\nsafe.  She actually likes knowing that at their house no one stands on the<br/>\ncouch, and very carefully doesn&#39;t do it there, and then talks about how she<br/>\ndidn&#39;t.<br/>\nIn another family we know, even the littlest children drink coffee, whereas<br/>\nin our family, children don&#39;t.<br/>\n<br/>\nI think she really enjoys knowing and contrasting these differences.<br/>\n<br/>\nClarissa<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Tue, May 13, 2008 at 8:04 PM, tmissinne &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tmissinne@...\">tmissinne@...</a>&gt; wrote:<br/>\n<br/>\n&gt;   I wanted to thank you all for this thread, and for talking so openly and<br/>\n&gt; honestly about things.<br/>\n&gt; My ds&#39;s are only 3 and 2, and I&#39;ve been doing so much reading and thinking.<br/>\n&gt; On some other<br/>\n&gt; groups I&#39;ve been hearing people say that they&#39;ve lost friends because their<br/>\n&gt; children weren&#39;t<br/>\n&gt; being respectful of the other parent/child beliefs. They were clear that<br/>\n&gt; they believed it was<br/>\n&gt; the other parents fault, and this was very disturbing to me. I loved so<br/>\n&gt; much about<br/>\n&gt; unschooling, but I also really want to teach my children to be kind. I felt<br/>\n&gt; very uncomfortable<br/>\n&gt; with the idea that it would be forcing them not to &#39;be themselves&#39; if I let<br/>\n&gt; them know that how<br/>\n&gt; we talk to other people matters.<br/>\n&gt;<br/>\n&gt; This thread has clarified alot of my thinking, and given me some great<br/>\n&gt; ideas.<br/>\n&gt;<br/>\n&gt; Thank you all!<br/>\n&gt; Trisha<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":222072602,"authorName":"tmissinne","from":"&quot;tmissinne&quot; &lt;tmissinne@...&gt;","profile":"tmissinne","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210734241","msgId":34861,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwZGtyMStvMTVhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMzREYxRTEwLUI1MUUtNDQyQi04QTM5LUY3QzM5NkY3MzM5QkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":34837,"nextInTopic":34862,"prevInTime":34860,"nextInTime":34862,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"I wanted to thank you all for this thread, and for talking so openly and honestly about things. My ds s are only 3 and 2, and I ve been doing so much reading","messageBody":"<div id=\"ygrps-yiv-1422422309\">I wanted to thank you all for this thread, and for talking so openly and honestly about things. <br/>\nMy ds&#39;s are only 3 and 2, and I&#39;ve been doing so much reading and thinking. On some other <br/>\ngroups I&#39;ve been hearing people say that they&#39;ve lost friends because their children weren&#39;t <br/>\nbeing respectful of the other parent/child beliefs. They were clear that they believed it was <br/>\nthe other parents fault, and this was very disturbing to me. I loved so much about <br/>\nunschooling, but I also really want to teach my children to be kind. I felt very uncomfortable <br/>\nwith the idea that it would be forcing them not to &#39;be themselves&#39; if I let them know that how <br/>\nwe talk to other people matters.<br/>\n<br/>\nThis thread has clarified alot of my thinking, and given me some great ideas.<br/>\n<br/>\nThank you all!<br/>\nTrisha</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210698918","msgId":34837,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwY2liNitvNW5zQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwY2dkMythbHI3QGVHcm91cHMuY29tPg=="},"prevInTopic":34834,"nextInTopic":34861,"prevInTime":34836,"nextInTime":34838,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... No--if you follow the line of reasoning, then if you disapprove of or reject a behavior, you are rejecting that behavior--which is an extension of that","messageBody":"<div id=\"ygrps-yiv-240336097\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;keetry&quot; &lt;keetry@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt; &gt; Either statement <br/>\n&gt; &gt; &gt; is a rejection, to some extent, of the person.  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; If I follow this line of reasoning, then any time I disapprove of or <br/>\n&gt; reject a behavior, I am disapproving of or rejecting the person who <br/>\n&gt; exhibited the behavior. <br/>\n<br/>\n </span></blockquote>No--if you follow the line of reasoning, then if you disapprove of or reject a behavior, you <br/>\nare rejecting that behavior--which is an extension of that personality acting on the world.  <br/>\nIt doesn&#39;t represent the whole person--just a part.  My point was that you can&#39;t separate <br/>\nbehavior from the person as though the behavior was just some random event, just as <br/>\nlikely to occur as not occur.  The behavior came from thoughts and feelings and is an <br/>\nexpression of those.  Sometimes we even behave in ways that don&#39;t work on purpose in <br/>\norder to call attention to those thoughts and feelings and get help and support in letting <br/>\nthem go.  Sometimes we just can&#39;t figure out a better way.<br/>\n<br/>\nIf there is motivation in the relationship, then the person will adjust their behavior to find <br/>\nways of expressing themselves that work better in the social world in which they live.  It&#39;s <br/>\njust what we do as humans who have bonds with others and wish to maintain and <br/>\nstrenghten those bonds.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210697545","msgId":34834,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwOUM4NjE3LUVDM0QtNDNBNS05RTg0LTk4QjZEOEQ1RDQxM0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGcwY2dkMythbHI3QGVHcm91cHMuY29tPg==","referencesHeader":"PGcwY2dkMythbHI3QGVHcm91cHMuY29tPg=="},"prevInTopic":34833,"nextInTopic":34837,"prevInTime":34833,"nextInTime":34835,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... -=-If I follow this line of reasoning, then any time I disapprove of or reject a behavior, I am disapproving of or rejecting the person who exhibited the","messageBody":"<div id=\"ygrps-yiv-1976815083\"><blockquote><span title=\"ireply\">&gt; &gt; Either statement<br/>\n &gt; &gt; is a rejection, to some extent, of the person.<br/>\n<br/>\n </span></blockquote>-=-If I follow this line of reasoning, then any time I disapprove of or<br/>\nreject a behavior, I am disapproving of or rejecting the person who<br/>\nexhibited the behavior. That&#39;s just not true. -=-<br/>\n<br/>\n<br/>\n<br/>\nI agree.<br/>\n<br/>\nThere is an element of  &quot;you&#39;re getting warm&quot; and &quot;you&#39;re getting  <br/>\ncold,&quot; though.  And some parents DO have a way of rejecting a child  <br/>\noutright for small offenses.<br/>\n<br/>\n<br/>\n<br/>\nWith me and my friends, it&#39;s like warm and cold have 100 little  <br/>\nsteps.  I can be really angry that Ben stood me up, but still love  <br/>\nBen.  I know him; he forgets.  If I get really mad, it&#39;s because I  <br/>\nhad unrealistic expectations of Ben.  If Keith stood me up, I&#39;d be  <br/>\nsure he was in an accident, because I know Keith and he&#39;ll be where  <br/>\nhe says he&#39;ll be, when he said he would be.  It&#39;s one of his best  <br/>\ntraits.<br/>\n<br/>\nAnd so with our children, if we know them well, we can know what to  <br/>\nexpect, know their strengths and weaknesses.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210696931","msgId":34833,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwY2dkMythbHI3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwOHQ2dCtqczR0QGVHcm91cHMuY29tPg=="},"prevInTopic":34830,"nextInTopic":34834,"prevInTime":34832,"nextInTime":34834,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... If I follow this line of reasoning, then any time I disapprove of or reject a behavior, I am disapproving of or rejecting the person who exhibited the","messageBody":"<div id=\"ygrps-yiv-959074937\"><blockquote><span title=\"ireply\">&gt; &gt; Either statement <br/>\n&gt; &gt; is a rejection, to some extent, of the person.  <br/>\n<br/>\n<br/>\n </span></blockquote>If I follow this line of reasoning, then any time I disapprove of or <br/>\nreject a behavior, I am disapproving of or rejecting the person who <br/>\nexhibited the behavior. That&#39;s just not true. There are certain <br/>\nbehaviors, as we&#39;ve been discussing, that I just cannot allow, like <br/>\nhurting another person. So, I tell my son that I will not let him <br/>\nhit his brother, for example. If he doesn&#39;t stop hitting, I have to <br/>\nremove him from the situation because I can&#39;t allow my baby to be <br/>\nhurt like that. I am rejecting the hitting but not my son. He may <br/>\nnot understand that, though. That&#39;s when I think it&#39;s important that <br/>\nI tell and show him that I do still love him. <br/>\n<br/>\nBTW, I want to make it clear that I was not disagreeing that a child <br/>\nwho is hurting another needs to be removed from the situation. I do <br/>\nagree that unschooling does not mean that we let our children do <br/>\nwhatever they want without any regard for anyone else.  <br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210694022","msgId":34830,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzREYxRTEwLUI1MUUtNDQyQi04QTM5LUY3QzM5NkY3MzM5QkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGcwYzZoMCtuM2ZmQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwYzZoMCtuM2ZmQGVHcm91cHMuY29tPg=="},"prevInTopic":34829,"nextInTopic":34833,"prevInTime":34829,"nextInTime":34831,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"-=-If the child can see it as not a punishment you are still on the same team. If it feels like a punishment to him/her than you are still creating an ","messageBody":"<div id=\"ygrps-yiv-1914376063\">-=-If the child<br/>\ncan see it as not a punishment you are still on the same team. If it<br/>\nfeels like a punishment to him/her than you are still creating an<br/>\nadversarial relationship no matter what you intentions. -=-<br/>\n<br/>\nIf it&#39;s NOT punishment, then make it not punishment.  DO something  <br/>\nfun and real and exciting with the child.  Keep him from the other  <br/>\nchild for a while by taking him to Disneyland, if you can afford it.   <br/>\nLet some time pass.  Find opportunities to be together when the  <br/>\nsubject might naturally come up of how to be when you&#39;re afraid or  <br/>\nangry or jealous or confused.  It might come up by watching movies  <br/>\nwith kid-relationships.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210694004","msgId":34829,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1RDkzRjY4LTdFQjUtNDlBQy05REQxLUU1NUVDNDg1OEEyQ0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGcwYzZoMCtuM2ZmQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwYzZoMCtuM2ZmQGVHcm91cHMuY29tPg=="},"prevInTopic":34828,"nextInTopic":34830,"prevInTime":34828,"nextInTime":34830,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"-=-If the child can see it as not a punishment you are still on the same team. If it feels like a punishment to him/her than you are still creating an ","messageBody":"<div id=\"ygrps-yiv-699387477\">-=-If the child<br/>\ncan see it as not a punishment you are still on the same team. If it<br/>\nfeels like a punishment to him/her than you are still creating an<br/>\nadversarial relationship no matter what you intentions. -=-<br/>\n<br/>\nIf it&#39;s NOT punishment, then make it not punishment.  DO something  <br/>\nfun and real and exciting with the child.  Keep him from the other  <br/>\nchild for a while by taking him to Disneyland, if you can afford it.   <br/>\nLet some time pass.  Find opportunities to be together when the  <br/>\nsubject might naturally come up of how to be when you&#39;re afraid or  <br/>\nangry or jealous or confused.  It might come up by watching movies  <br/>\nwith kid-relationships.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Unconditional Love","postDate":"1210693184","msgId":34828,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3NEE3QzNDLURGRTMtNEFERC05ODEzLUE5M0IwOTJGNjU3RkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDJGQTA3NjI1OUVGNjRFRjVBNzlFNTdGMUM2RDE5OEMzQEx5bGFQQz4=","referencesHeader":"PGcwOWoxcit0b2ZzQGVHcm91cHMuY29tPiA8MkZBMDc2MjU5RUY2NEVGNUE3OUU1N0YxQzZEMTk4QzNATHlsYVBDPg=="},"prevInTopic":34826,"nextInTopic":34829,"prevInTime":34827,"nextInTime":34829,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"-=-i have been mulling those sentiments over for 2-3 years now! and trying to be very aware of showing her my love in personal ways - unconditional in the","messageBody":"<div id=\"ygrps-yiv-1555498575\">-=-i have been mulling those sentiments over for 2-3 years now! and  <br/>\ntrying to be very aware of showing her my love in personal ways -  <br/>\nunconditional in the sense of reaching through her anger, or other  <br/>\n&quot;difficult&quot; emotions, when those occur- not rejecting the &quot;dark side&quot;  <br/>\n- but reaching through it - not around it, not ignoring it - and  <br/>\nstill trying to make sure that my love is expressed (and felt) as  <br/>\npersonal/connected to her as an individual, not just &quot;my daughter.&quot;-=-<br/>\n<br/>\nThis is a perfect window into the problem of &quot;unconditional love,&quot;  <br/>\nexpressed as it sometimes is, discussed as it often is.<br/>\n<br/>\nThen come other reactionary things to that concept, like &quot;tough  <br/>\nlove.&quot;  When there&#39;s a theory or movement that gets a name like that,  <br/>\npeople start looking at the name instead of the feelings and responses.<br/>\n<br/>\nIt&#39;s like the problem with pointing and saying look, and people are  <br/>\nlooking at your finger.<br/>\n<br/>\nSome parents say, out loud in words, &quot;I love all my children  <br/>\nequally.&quot;   Why say something like that?  It invites challenge.<br/>\nSome parents say &quot;I loved you before you were born and I&#39;ll always  <br/>\nlove you.&quot;  Maybe that&#39;s an attempt to express the biochemical  <br/>\nchanges that come upon a pregnant woman (and they&#39;re BIGtime real,  <br/>\nwhen they work well) and that infuse a healthy relationship with a  <br/>\nchild.<br/>\n<br/>\nSometimes it gets confused with Bible ideas, like &quot;I love you as  <br/>\nChrist love the church&quot; (marriage problem sometimes).  If a couple  <br/>\nhas a fullblown Baptist wedding and then they stop being religious,  <br/>\nTHEN what is the basis of the relationship?  And DOES Christ love the  <br/>\nchurch?  (And which church? &lt;bwg&gt;)  Unconditionally?  &lt;HUGEbwg&gt;<br/>\n<br/>\nIf when a child wants reassurance of love the parent quotes the  <br/>\nBible, the condition seems to be &quot;If the Bible is true, then I love  <br/>\nyou.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210692712","msgId":34826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMUI3OTEwLUVEMTMtNDEwMy04MzZELTlBNTlGRDFDMTcxRkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGcwYzZoMCtuM2ZmQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwYzZoMCtuM2ZmQGVHcm91cHMuY29tPg=="},"prevInTopic":34822,"nextInTopic":34828,"prevInTime":34825,"nextInTime":34827,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"-=- ... advice ... of ... if ... -=-Because the understanding is what makes the difference. -=- That doesn t answer the question. If someone never told a","messageBody":"<div id=\"ygrps-yiv-953528148\">-=-&gt;<br/>\n<blockquote><span title=\"ireply\">  &gt; This is just in general to any mom involved who&#39;s questioning<br/>\n </span></blockquote>advice<br/>\n<blockquote><span title=\"ireply\">  &gt; that seems harsher than &quot;non-coercion.&quot;<br/>\n &gt;<br/>\n &gt; Did you tell your child &quot;I will never punish you&quot;?<br/>\n &gt;<br/>\n &gt; Did you tell your child &quot;I will protect you from any consequences<br/>\n </span></blockquote>of<br/>\n<blockquote><span title=\"ireply\">  &gt; your actions, no matter how harmful&quot;?<br/>\n &gt;<br/>\n &gt; If you did, you shouldn&#39;t have. If you didn&#39;t, what do you care<br/>\n </span></blockquote>if<br/>\n<blockquote><span title=\"ireply\">  &gt; it feels like a punishment?<br/>\n<br/>\n </span></blockquote>-=-Because the understanding is what makes the difference. -=-<br/>\n<br/>\nThat doesn&#39;t answer the question.<br/>\n<br/>\nIf someone never told a child he could do anything on earth he wanted  <br/>\nto, then he should have no expectation that he can.<br/>\n<br/>\nIf someone DID tell a child something like that, then she&#39;s created  <br/>\nher own terrible problem and it&#39;s going to need some repair that  <br/>\nwouldn&#39;t have been necessary if she&#39;d been her child&#39;s partner in the  <br/>\nfirst place.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210691275","msgId":34822,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJGQTA3NjI1OUVGNjRFRjVBNzlFNTdGMUM2RDE5OEMzQEx5bGFQQz4=","inReplyToHeader":"PGcwOWoxcit0b2ZzQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwOWoxcit0b2ZzQGVHcm91cHMuY29tPg=="},"prevInTopic":34820,"nextInTopic":34826,"prevInTime":34821,"nextInTime":34823,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"i am not sure what this means, and still haven t really figured out what *i* think about how i d like to translate this into action, but several years ago, my","messageBody":"<div id=\"ygrps-yiv-748417540\">i am not sure what this means, and still haven&#39;t really figured out what *i* think about how i&#39;d like to translate this into action, but several years ago, my daughter (now 13) said to me &quot;i don&#39;t WANT you to love me just because you&#39;re my mom - i want you to love me because i am ME!&quot;  <br/>\n<br/>\nshe was basically wanting to know how i saw HER - WHAT i loved about HER.  and she specifically challenged me with &quot;what if i killed someone?!&quot; (not something she would ever do, not even a guilty thought, i am sure - just that she was trying to think of the most horrendous thing she could to challenge my (perhaps misplaced, still not sure what i think about that) unconditional love....)<br/>\n<br/>\ni have been mulling those sentiments over for 2-3 years now!  and trying to be very aware of showing her my love in personal ways - unconditional in the sense of reaching through her anger, or other &quot;difficult&quot; emotions, when those occur- not rejecting the &quot;dark side&quot;  - but reaching through it - not around it, not ignoring it - and still trying to make sure that my love is expressed (and felt) as personal/connected to her as an individual, not just &quot;my daughter.&quot;<br/>\n<br/>\njust thought i&#39;d share that perspective from her when she was about 10-11 - i had never really scrutinized the concept of unconditional love before she brought it up, so insightfully...<br/>\n<br/>\nwarmly, Lyla<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":241586873,"authorName":"barefootmamax4","from":"&quot;barefootmamax4&quot; &lt;barefootmamax4@...&gt;","profile":"barefootmamax4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210686816","msgId":34820,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwYzZoMCtuM2ZmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc3MThFODJCLUU1NDYtNDE4QS1BNzRCLTk4ODRFOTcwMTA2RUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":34819,"nextInTopic":34822,"prevInTime":34819,"nextInTime":34821,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... advice ... of ... if ... Because the understanding is what makes the difference. If the child can see it as  not a punishment you are still on the same","messageBody":"<div id=\"ygrps-yiv-1387287468\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; This is just in general to any mom involved who&#39;s questioning <br/>\n </span></blockquote>advice  <br/>\n<blockquote><span title=\"ireply\"> &gt; that seems harsher than &quot;non-coercion.&quot;<br/>\n&gt; <br/>\n&gt; Did you tell your child &quot;I will never punish you&quot;?<br/>\n&gt; <br/>\n&gt; Did you tell your child &quot;I will protect you from any consequences <br/>\n </span></blockquote>of  <br/>\n<blockquote><span title=\"ireply\"> &gt; your actions, no matter how harmful&quot;?<br/>\n&gt; <br/>\n&gt; If you did, you shouldn&#39;t have.  If you didn&#39;t, what do you care <br/>\n </span></blockquote>if  <br/>\n<blockquote><span title=\"ireply\"> &gt; it feels like a punishment?<br/>\n<br/>\n </span></blockquote>Because the understanding is what makes the difference. If the child <br/>\ncan see it as  not a punishment you are still on the same team. If it <br/>\nfeels like a punishment to him/her than you are still creating an <br/>\nadversarial relationship no matter what you intentions. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; If you&#39;re indicating to him by word and deed that he&#39;s free to do <br/>\n </span></blockquote>any  <br/>\n<blockquote><span title=\"ireply\"> &gt; damned thing he can think up and you&#39;ll stand there smiling and  <br/>\n&gt; saying &quot;I love you,&quot; NOT good.<br/>\n<br/>\n </span></blockquote>What about indicating to him that you are upset with the <br/>\nbehavior,what about showing clearly thet you are angry? That is not <br/>\nshowing force but also not giving unconitional approval.When is it <br/>\nacceptable to cross the line of free choice and move into force of <br/>\ncompliance?Then you are adversaries not partners. Now you have a <br/>\nbattle of wills ,a powerplay weather you wanted it or not. <br/>\n<br/>\n<br/>\nI am starting to see that a blanket statement of :when safety of the <br/>\nchild or another person is threatened that use of force is OK? <br/>\n<br/>\nWhat about just plain old disrespect or hurtful words like &quot;shut up&quot; <br/>\nor namecalling? Does that justify force or just plain old disapproval?<br/>\n<br/>\nI see this as the same problem lawmakers have in our country. Laws <br/>\nare made to protect everyone&#39;s civil liberties, but at some point <br/>\nprotecting one person&#39;s civil liberty often means stepping on <br/>\nanother&#39;s. At what point does a racial insult become freedom of <br/>\nspeach and vice versa?  When does that become any insult against a <br/>\nperson is illegal, especially the president? At what point does a <br/>\nperson take responsibility for falling of a curb and breaking thier <br/>\nankle or should the town be held accountable? <br/>\n<br/>\nIt really seems to get down to no more than a personal judgement <br/>\ncall, and yes that does leave the book wide open to interpret it just <br/>\nabout any way you like. I know someone who believes it is an unloving <br/>\nact NOT to punish her children with a paddle because they must learn <br/>\nobiedience to their parents and to God.Is that child abuse or her <br/>\ncivil right to choose as her religon dictates, especially if she <br/>\ntruly believes not spanking them will send both them and her to hell. <br/>\n <br/>\n-Kelly</div>","specialLinks":[]},{"userId":199360242,"authorName":"graberamy","from":"&quot;graberamy&quot; &lt;graber@...&gt;","profile":"graberamy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210684857","msgId":34819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwYzRqcCtkbGliQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE0NUZFQkNBLUI1MUQtNEMyOC1BQ0UzLUE5MTBDNzVGQUQyRUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":34814,"nextInTopic":34820,"prevInTime":34818,"nextInTime":34820,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... Lydia had a girl on her cheerleading squad (who does take meds for her behavior, and yes Holly is correct she does use not taking them as an excuse for bad","messageBody":"<div id=\"ygrps-yiv-1799198174\">&lt;&lt;&lt;Holly  mentioned, unrelated to any of this, the other day that she&#39;s<br/>\n<blockquote><span title=\"ireply\"> &gt; sorry so many parents want their kids to be diagnosed with problems<br/>\n&gt; so the parents don&#39;t have to learn to be better parents, and then the<br/>\n&gt; kids will act however they want to and say &quot;Oh, I didn&#39;t take my<br/>\n&gt; meds today&quot; as an excuse.&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Lydia had a girl on her cheerleading squad (who does take meds for her<br/>\nbehavior, and yes Holly is correct she does use not taking them as an<br/>\nexcuse for bad behavior) say she was feeling &quot;crazy&quot; today because she<br/>\nate a candy bar.  Lydia said she was just awful that day, pulling the<br/>\ngirls hair, stepping on their feet, pinching, all in the name of a<br/>\n&quot;joke&quot;.   Using a candy bar as an excuse for bad behavior.  This girl is<br/>\nalmost 11.<br/>\n<br/>\nWe have had on going issues with this teammate, but it&#39;s been quite a<br/>\nlearning experience for Lydia...and myself.<br/>\n<br/>\namy g</div>","specialLinks":[]},{"userId":334634178,"authorName":"Cindy Fox","from":"&quot;Cindy Fox&quot; &lt;outreach@...&gt;","profile":"cindycindyfox","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210656016","msgId":34814,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwYjhlZysybmFtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5QzMxMUZGLTczN0MtNDFCMS1BQUM1LTRFOTJEMUYyRTE3RkBtYWMuY29tPg=="},"prevInTopic":34813,"nextInTopic":34819,"prevInTime":34813,"nextInTime":34815,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... and ... everything ... I agree.  But still, it is possible to love the person and hate the behavior. I never had doubt of my mother s love, no matter my","messageBody":"<div id=\"ygrps-yiv-1557842603\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pamela Sorooshian <br/>\n&lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;And therefore parents ought to be clear about the  <br/>\n&gt; behavior being problematic. Don&#39;t sit there and be all sweetness <br/>\n </span></blockquote>and  <br/>\n<blockquote><span title=\"ireply\"> &gt; smiles, saying, &quot;I love you no matter what you do,&quot; as if <br/>\n </span></blockquote>everything  <br/>\n<blockquote><span title=\"ireply\"> &gt; is just fine, when it is not.<br/>\n&gt; <br/>\n&gt; -pam<br/>\n<br/>\n </span></blockquote>I agree.  But still, it is possible to love the person and hate the <br/>\nbehavior.<br/>\n<br/>\nI never had doubt of my mother&#39;s love, no matter my actions or <br/>\nappearance (which can be a result of actions or non-actions). She <br/>\nabsolutely showed disapproval for inappropriate actions, but I felt <br/>\nmore that she was surprised or shocked by the action and that it was <br/>\nnot in line with how she viewed me.  That she thought better of me <br/>\nthan that and I could show her by my actions in the future.  Thus I <br/>\nfelt her disappointment, trust and belief.  Tools to learn from.<br/>\n<br/>\nOn the other hand, my father&#39;s love was definately conditional and I <br/>\nnever felt any expectations, just demands, with little expectation <br/>\nof success.  It was almost as if I had failed before I had started <br/>\nsimply because of his judgements of my behavior or appearance as all <br/>\nthat I was. <br/>\n<br/>\nI do not approve of all behavior and I express such, but I trust <br/>\nthat the person is doing their best at the time and given time and <br/>\ninformation, they will improve.  I learned this first with my father.<br/>\n<br/>\nc.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210618167","msgId":34813,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIyMTRDMzMyLTNEQTEtNDExNC1CNzlGLTA3QkRBQjg3Nzg2NEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGcwOXF1ZytnaWhmQGVHcm91cHMuY29tPg==","referencesHeader":"PGcwOXF1ZytnaWhmQGVHcm91cHMuY29tPg=="},"prevInTopic":34812,"nextInTopic":34814,"prevInTime":34812,"nextInTime":34814,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"-=-So is the label useful/helpful/needed? Would it be helpful for us in society in general? Perhaps. I really don t know. But it would probably protect the","messageBody":"<div id=\"ygrps-yiv-1190871649\">-=-So is the label useful/helpful/needed? Would it be<br/>\nhelpful for us in society in general? Perhaps. I really don&#39;t<br/>\nknow. But it would probably &quot;protect&quot; the reputation of unschooling<br/>\nfrom those who see us and assume that it&#39;s the unschooling that has<br/>\ncreated these issues. -=-<br/>\n<br/>\n<br/>\n<br/>\nDepends on the label, but I had to choose yes or no, I&#39;d say &quot;NO,&quot;  <br/>\nit&#39;s better to treat Bobby as Bobby, not Bobby who&#39;s dyslexic and ADD  <br/>\nor whatever.<br/>\n<br/>\nMore damage would be done to unschooling by the labeling, I think.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332347767,"authorName":"lspswr","from":"&quot;lspswr&quot; &lt;lspswr@...&gt;","profile":"lspswr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210609424","msgId":34810,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwOXF1ZytnaWhmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwOWxtaCtuaWtzQGVHcm91cHMuY29tPg=="},"prevInTopic":34809,"nextInTopic":34812,"prevInTime":34809,"nextInTime":34811,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... I absolutely know that if I was to throw a diagnosis word around with other people they would make allowances for ds s behavior at times -- which would","messageBody":"<div id=\"ygrps-yiv-1838311922\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;lspswr&quot; &lt;lspswr@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n </span></blockquote> I absolutely know that if I was to throw a diagnosis word around <br/>\nwith other people they would &quot;make allowances&quot; for ds&#39;s behavior at <br/>\ntimes -- which would make things more comfortable for *ME* but would <br/>\nnot be helpful to ds or his process of learning respectful <br/>\nappropriate behavior.  I really debate at times if getting a &quot;label&quot; <br/>\nwould be helpful for *him* but ultimately the goal is to be able to <br/>\ninteract with people in meaningful and appropriate ways and having <br/>\nan &quot;label&quot; wouldn&#39;t teach him anything other than that <br/>\nhe&#39;s &quot;different&quot; and therefore he isn&#39;t &quot;able&quot; to control his <br/>\nactions.  It would go a long way toward improving *MY* relationships <br/>\nwith others, and maybe if others thought he had a label they would <br/>\ntemper their interactions which might not put him in situations in <br/>\nwhich he feels his back is against the wall.  I really don&#39;t know <br/>\nwhat is the &quot;right&quot; thing to do, but I DO know that by changing my <br/>\nbehavior and embracing unschooling principles things have been MUCH <br/>\nbetter.  &lt;  <br/>\n<br/>\nI also wanted to point out that by giving you more information here <br/>\nand providing context you perhaps understand where I&#39;m coming from in <br/>\nbetter ways.  In that way, the information (label?) is more <br/>\nunderstandable and you can see the improvements instead of just the <br/>\nproblems.  So is the label useful/helpful/needed?  Would it be <br/>\nhelpful for us in society in general?  Perhaps.  I really don&#39;t <br/>\nknow.  But it would probably &quot;protect&quot; the reputation of unschooling <br/>\nfrom those who see us and assume that it&#39;s the unschooling that has <br/>\ncreated these issues.  I imagine that there are quite a few of us in <br/>\na similar situation who arrived at unschooling because of its <br/>\nbenefits, and not as an excuse for our parenting.  <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":332347767,"authorName":"lspswr","from":"&quot;lspswr&quot; &lt;lspswr@...&gt;","profile":"lspswr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210604049","msgId":34809,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwOWxtaCtuaWtzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE0NUZFQkNBLUI1MUQtNEMyOC1BQ0UzLUE5MTBDNzVGQUQyRUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":34806,"nextInTopic":34810,"prevInTime":34808,"nextInTime":34810,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... the ... This pretty much sums things up for me and our situation.  We took ds out of school because they demanded that we get a diagnosis so that they","messageBody":"<div id=\"ygrps-yiv-1996768618\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Holly  mentioned, unrelated to any of this, the other day that she&#39;s  <br/>\n&gt; sorry so many parents want their kids to be diagnosed with problems  <br/>\n&gt; so the parents don&#39;t have to learn to be better parents, and then <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; kids will act however they want to and say &quot;Oh, I didn&#39;t take my   <br/>\n&gt; meds today&quot; as an excuse.<br/>\n&gt; <br/>\n&gt; Relationships, and fostering relationships.  That&#39;s important for  <br/>\n&gt; unschooling to work.  It&#39;s important for living in the world.<br/>\n&gt; <br/>\n </span></blockquote>----------<br/>\nThis pretty much sums things up for me and our situation.  We took ds <br/>\nout of school because they demanded that we get a diagnosis so that <br/>\nthey would be ABLE to treat him the way that he needed to be treated.  <br/>\nWith a diagnosis they would be ABLE to make allowances for his needs <br/>\n(standing and moving instead of sitting quietly, thinking out-loud <br/>\ninstead of silently....).  There were other factors as well, but the <br/>\npoint was that they were unwilling/unable to allow him to learn in the <br/>\nway that best suited him; THEY needed an &quot;excuse&quot; to meet his needs and <br/>\nbe able to justify treating him differently.<br/>\n<br/>\nThis also goes toward our interactions with others.  I absolutely know <br/>\nthat if I was to throw a diagnosis word around with other people they <br/>\nwould &quot;make allowances&quot; for ds&#39;s behavior at times -- which would make <br/>\nthings more comfortable for *ME* but would not be helpful to ds or his <br/>\nprocess of learning respectful appropriate behavior.  I really debate <br/>\nat times if getting a &quot;label&quot; would be helpful for *him* but ultimately <br/>\nthe goal is to be able to interact with people in meaningful and <br/>\nappropriate ways and having an &quot;label&quot; wouldn&#39;t teach him anything <br/>\nother than that he&#39;s &quot;different&quot; and therefore he isn&#39;t &quot;able&quot; to <br/>\ncontrol his actions.  It would go a long way toward improving *MY* <br/>\nrelationships with others, and maybe if others thought he had a label <br/>\nthey would temper their interactions which might not put him in <br/>\nsituations in which he feels his back is against the wall.  I really <br/>\ndon&#39;t know what is the &quot;right&quot; thing to do, but I DO know that by <br/>\nchanging my behavior and embracing unschooling principles things have <br/>\nbeen MUCH better.  Changing the way *I* interact with him has helped to <br/>\nmodel much more respectful behavior for him which he can take into his <br/>\nown interactions and relationships.  Like I said a few days ago, it&#39;s a <br/>\nlot better but still has a long way to go.<br/>\n<br/>\nHolly is a wise woman!<br/>\nLinda</div>","specialLinks":[]},{"userId":228638122,"authorName":"hpmarker","from":"&quot;hpmarker&quot; &lt;hpmarker@...&gt;","profile":"hpmarker","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210601338","msgId":34812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwOWoxcit0b2ZzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5QzMxMUZGLTczN0MtNDFCMS1BQUM1LTRFOTJEMUYyRTE3RkBtYWMuY29tPg=="},"prevInTopic":34810,"nextInTopic":34813,"prevInTime":34811,"nextInTime":34813,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"I agree completely, Pam.  Clearly, there s a big difference between responding to a child when he is actually mean and thoughtless and conversing with a child","messageBody":"<div id=\"ygrps-yiv-842738913\">I agree completely, Pam.  Clearly, there&#39;s a big difference between <br/>\nresponding to a child when he is actually mean and thoughtless and <br/>\nconversing with a child about what would happen if her were to be mean <br/>\nand thoughtless.  In my own case, my child (6 y/o ds) is a boy who can <br/>\nspiral into extreme emotions that are distressing to him afterward if I <br/>\ndo not perceive the triggers in time, though I&#39;ve now become fairly <br/>\ngood at that (after much trial by fire!).  As far as when he poses <br/>\nhypotheticals about doing rude stuff, I will give much thought to <br/>\nSandra&#39;s opinion that these are not good conversations to have, at <br/>\nleast in the way we are having them.  The reason I&#39;ve thought these <br/>\nconversations with ds were, at worst, neutral is that they allow him to <br/>\ndiscuss thoughts that he might otherwise hide and/or feel guily about.  <br/>\nI do not require that my child share all of his thoughts, but if the <br/>\nthoughts are troubling him, and he brings them to me, I feel honored <br/>\nthat he would share them with me, in calm moments, for discussion.  We <br/>\nalso discuss the very important line between thoughts and actions.  <br/>\nI&#39;ve told him many times that we&#39;d all be in jail at one time or <br/>\nanother if we could be arrested for our thoughts.   My childhood <br/>\ncontained an over-abundance of guilt, which is baggage I do not want my <br/>\nchild to carry.  But I also do not want to overcompensate and leave my <br/>\nchild feeling adrift.<br/>\nI know the original topic in this thread concerned actual deeds as <br/>\nopposed to thoughts, but the unconditional love aspect caught my <br/>\nattention, and I&#39;m always open to fine tuning my thinking.<br/>\n<br/>\n-Hallie<br/>\n<br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Pamela Sorooshian <br/>\n&lt;pamsoroosh@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; This is really not fair to the child. It is in the child&#39;s best  <br/>\n&gt; interest to feel those bad feelings that arise when they do mean,  <br/>\n&gt; thoughtless, out-of-control things, for example. The parents don&#39;t  <br/>\n&gt; need to ADD to it by punishing the child, but they ought to help the  <br/>\n&gt; child connect with that part of themselves that feels empathy for <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"ireply\"> &gt; person they&#39;ve hurt. And therefore parents ought to be clear about <br/>\n </span></blockquote>the  <br/>\n<blockquote><span title=\"qreply\"> &gt; behavior being problematic. Don&#39;t sit there and be all sweetness and  <br/>\n&gt; smiles, saying, &quot;I love you no matter what you do,&quot; as if everything  <br/>\n&gt; is just fine, when it is not.<br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210596062","msgId":34806,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE0NUZFQkNBLUI1MUQtNEMyOC1BQ0UzLUE5MTBDNzVGQUQyRUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE5QzMxMUZGLTczN0MtNDFCMS1BQUM1LTRFOTJEMUYyRTE3RkBtYWMuY29tPg==","referencesHeader":"PGcwOHQ2dCtqczR0QGVHcm91cHMuY29tPiA8MTlDMzExRkYtNzM3Qy00MUIxLUFBQzUtNEU5MkQxRjJFMTdGQG1hYy5jb20+"},"prevInTopic":34805,"nextInTopic":34809,"prevInTime":34805,"nextInTime":34807,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"-=-The parents don t need to ADD to it by punishing the child, but they ought to help the child connect with that part of themselves that feels empathy for the","messageBody":"<div id=\"ygrps-yiv-231687879\">-=-The parents don&#39;t<br/>\nneed to ADD to it by punishing the child, but they ought to help the<br/>\nchild connect with that part of themselves that feels empathy for the<br/>\nperson they&#39;ve hurt. And therefore parents ought to be clear about the<br/>\nbehavior being problematic. Don&#39;t sit there and be all sweetness and<br/>\nsmiles, saying, &quot;I love you no matter what you do,&quot; as if everything<br/>\nis just fine, when it is not.-=-<br/>\n<br/>\n<br/>\n<br/>\nIt happens outside of homeschooling, too.  I know someone who&#39;s full- <br/>\non obnoxious, and her parents used to tell her that any problems she  <br/>\nhad were because she was smarter than the other kids and they were  <br/>\n&quot;just jealous.&quot;    I&#39;ve had the urge to smack her, seriously.  I  <br/>\nfinally ran her out of my life.  I&#39;m glad she doesn&#39;t have children  <br/>\nand I hope she never does.<br/>\n<br/>\nHer adult life would be immensely better if her parents had helped  <br/>\nher learn to be nice rather than telling her there was no reason for  <br/>\nher to even bother to try, because the rest of the people in the  <br/>\nworld were simply inferior beings.  YUCK!!<br/>\n<br/>\n<br/>\n<br/>\nHolly  mentioned, unrelated to any of this, the other day that she&#39;s  <br/>\nsorry so many parents want their kids to be diagnosed with problems  <br/>\nso the parents don&#39;t have to learn to be better parents, and then the  <br/>\nkids will act however they want to and say &quot;Oh, I didn&#39;t take my   <br/>\nmeds today&quot; as an excuse.<br/>\n<br/>\nRelationships, and fostering relationships.  That&#39;s important for  <br/>\nunschooling to work.  It&#39;s important for living in the world.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Punishments and Safety and Consequences","postDate":"1210583085","msgId":34805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5QzMxMUZGLTczN0MtNDFCMS1BQUM1LTRFOTJEMUYyRTE3RkBtYWMuY29tPg==","inReplyToHeader":"PGcwOHQ2dCtqczR0QGVHcm91cHMuY29tPg==","referencesHeader":"PGcwOHQ2dCtqczR0QGVHcm91cHMuY29tPg=="},"prevInTopic":34804,"nextInTopic":34806,"prevInTime":34804,"nextInTime":34806,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... I started to respond, but got into a big long discussion about what love even means - and final deleted my whole post, unsent, because I thought we d","messageBody":"<div id=\"ygrps-yiv-1503590787\">On May 12, 2008, at 12:56 AM, Cindy Fox wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I took the original point as a query along the lines of:<br/>\n&gt; Does loving someone unconditionally give tacit approval of their<br/>\n&gt; behavior?<br/>\n<br/>\n </span></blockquote>I started to respond, but got into a big long discussion about what  <br/>\n&quot;love&quot; even means - and final deleted my whole post, unsent, because I  <br/>\nthought we&#39;d really gone beyond what is useful. Let me just say that  <br/>\nif my child committed a horrible act - a rape, torture, murder, for  <br/>\nexample - there would still be an aspect of mother&#39;s love somewhere in  <br/>\nme, but it would be a desperate kind of wishful love - wishing my  <br/>\nchild could be a person I could truly feel good about loving. So -  <br/>\nthere ya go - i used the word multiple times in the same sentence -  <br/>\nmeaning different things - and I think most people probably &quot;get&quot; the  <br/>\ndifference, so I&#39;m going to stop now.<br/>\n<br/>\nI think the point Sandra is making is that parents sometimes think  <br/>\nunschooling means not showing any kind of disapproval of anything  <br/>\ntheir children do, and sometimes they do absolutely everything they  <br/>\ncan to keep the child from actually experiencing any kind of bad  <br/>\nfeelings as a result of their own behavior.<br/>\n<br/>\nThis is really not fair to the child. It is in the child&#39;s best  <br/>\ninterest to feel those bad feelings that arise when they do mean,  <br/>\nthoughtless, out-of-control things, for example. The parents don&#39;t  <br/>\nneed to ADD to it by punishing the child, but they ought to help the  <br/>\nchild connect with that part of themselves that feels empathy for the  <br/>\nperson they&#39;ve hurt. And therefore parents ought to be clear about the  <br/>\nbehavior being problematic. Don&#39;t sit there and be all sweetness and  <br/>\nsmiles, saying, &quot;I love you no matter what you do,&quot; as if everything  <br/>\nis just fine, when it is not.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334634178,"authorName":"Cindy Fox","from":"&quot;Cindy Fox&quot; &lt;outreach@...&gt;","profile":"cindycindyfox","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210578973","msgId":34804,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwOHQ2dCtqczR0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwNjg4NitrbW1yQGVHcm91cHMuY29tPg=="},"prevInTopic":34776,"nextInTopic":34805,"prevInTime":34803,"nextInTime":34805,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... I understand, but I disagree.  I don t think it is rejection of the person as I don t equate people as identical to their actions. Actions are fleeting and","messageBody":"<div id=\"ygrps-yiv-1832869316\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Joanna Murphy&quot; <br/>\n&lt;ridingmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Either statement <br/>\n&gt; is a rejection, to some extent, of the person.  <br/>\n<br/>\n </span></blockquote>I understand, but I disagree.  I don&#39;t think it is rejection of the <br/>\nperson as I don&#39;t equate people as identical to their actions. <br/>\n<br/>\nActions are fleeting and can not match all of a person&#39;s values and <br/>\nintentions.  Internal conflicts in conjunction with external <br/>\nsituations can cause odd or tragic actions.  <br/>\n<br/>\nWe&#39;re getting deep into hypothicals here, since the question was a <br/>\nbroad statement of one sibling killing another.  I would guess you&#39;d <br/>\nhave different feelings if a sibling hit another with a car versus <br/>\nsnuck up on them at night, but then what if they have developed a <br/>\nmental defect, such as schizophrenia, would you love them less? <br/>\n<br/>\nI took the original point as a query along the lines of:<br/>\nDoes loving someone unconditionally give tacit approval of their <br/>\nbehavior?  <br/>\n<br/>\nI don&#39;t think so. <br/>\n<br/>\nI still care for people who have hurt me very deeply.  I feel loss, <br/>\nconfusion, sadness, disappointment, anger and many other emotions, <br/>\nbut I also feel love and caring.  To me, it is a parallel system, <br/>\nrather than a sum of the feelings into one numerical type value on a <br/>\nscale of Love - Hate.  I go back and forth or hold both at once.<br/>\n<br/>\nI&#39;ve been in the situation of having my <br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;behavior not liked&quot; but been told that the person &quot;loved me,&quot; and <br/>\n </span></blockquote>I didn&#39;t actually feel <br/>\n<blockquote><span title=\"ireply\"> &gt; loved, because my behavior WAS an expression of ME.<br/>\n<br/>\n </span></blockquote>I too have had this experience, but in my experience, the tone of <br/>\nvoice was saying something different than the words and what I felt <br/>\nwas the disconnect between the words and the acutal feelings of the <br/>\nspeaker. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think the second statement is a more politically correct one, <br/>\n </span></blockquote>but the first strikes me as <br/>\n<blockquote><span title=\"ireply\"> &gt; more upfront and honest.  <br/>\n<br/>\n </span></blockquote>I hear you, but they are still two different statements to me.  <br/>\n<br/>\nc.</div>","specialLinks":[]},{"userId":58132404,"authorName":"MarSi77@aol.com","from":"MarSi77@...","profile":"m6hschch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210499385","msgId":34776,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQwMC4yZjAwYjI5Yy4zNTU4MWIzOUBhb2wuY29tPg=="},"prevInTopic":34774,"nextInTopic":34804,"prevInTime":34775,"nextInTime":34777,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/10/2008 10:11:28 P.M. Eastern Daylight Time, Sandra@SandraDodd.com writes: If you re indicating to him by word and deed that he s free to","messageBody":"<div id=\"ygrps-yiv-1628842924\">In a message dated 5/10/2008 10:11:28 P.M. Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a> writes:<br/>\n<br/>\nIf you&#39;re indicating to him by word and deed that he&#39;s free to do any  <br/>\ndamned thing he can think up and you&#39;ll stand there smiling and <br/>\nsaying  &quot;I love you,&quot; NOT good.<br/>\n<br/>\nIn the vast space between those things are many  good, thoughtful, <br/>\nmindful, rational options.<br/>\n<br/>\n<br/>\nguess it&#39;s my same old concern: Some people take a <br/>\nmisunderstanding  of something they half read or didn&#39;t consider <br/>\ncarefully enough, they move  too far too fast without understanding <br/>\nthe principles involved, and then  blame unschooling for bad results.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n****<br/>\nyes i see it too. and it&#39;s for those reasons why unschooling kids have had  a <br/>\nbad rap, of being disrepectful , rude kids. <br/>\n People *are* becomig more aware but that&#39;s the picture many people  still <br/>\nhave, and it&#39;s probably from those families that think it&#39;s ok for their  kids <br/>\nto do anything they want, total freedom no matter how it affects  others.<br/>\n <br/>\nAnd when life caves in on them they blame unschooling.<br/>\n <br/>\n <br/>\n~marcia simonds<br/>\nHarmonyWoodsFarm <br/>\n_<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xanga.com/livefreeinharmony_\">http://www.xanga.com/livefreeinharmony_</a> <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.xanga.com/livefreeinharmony)\">http://www.xanga.com/livefreeinharmony)</a> <br/>\n<br/>\n<br/>\n<br/>\n**************Wondering what&#39;s for Dinner Tonight? Get new twists on family <br/>\nfavorites at AOL Food.      <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://food.aol.com/dinner-tonight?NCID=aolfod00030000000001)\">http://food.aol.com/dinner-tonight?NCID=aolfod00030000000001)</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210491974","msgId":34774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwNjg4NitrbW1yQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGcwNjVsdit1c2cyQGVHcm91cHMuY29tPg=="},"prevInTopic":34773,"nextInTopic":34776,"prevInTime":34773,"nextInTime":34775,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"... The example wasn t talking about behavior that could be tolerated or not--she was using a more extreme example of one child killing another child.  With","messageBody":"<div id=\"ygrps-yiv-62075813\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Cindy Fox&quot; &lt;outreach@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I have really enjoyed this thread and I so totally agree with you <br/>\n&gt; that there is a world of options.  I also ABSOLUTELY believe I can <br/>\n&gt; still LOVE someone and at the same time NOT tolerate their <br/>\n&gt; behavior.  <br/>\n<br/>\n </span></blockquote>The example wasn&#39;t talking about behavior that could be &quot;tolerated&quot; or not--she was <br/>\nusing a more extreme example of one child killing another child.  With that example, I <br/>\nwould be way beyond thoughts of whether I could tolerate the behavior.<br/>\n<br/>\nIn a certain sense I think there is a semantics issue going on.  A person&#39;s behavior IS part <br/>\nof them--it&#39;s the visible manifested part of their personality acting in/on the world.  To <br/>\nseparate a person from their behavior is just as off-base as it is to assume that a person is <br/>\nonly the sum of their behavior.<br/>\n<br/>\nTo say either that you won&#39;t love a child in the same way who commits an atrocity or to <br/>\nsay you will continue to love them, but not love their behavior may, in effect, amount to <br/>\nthe same thing--both statements are a rejection of the antisocial behavior--which stems <br/>\nfrom thoughts and feelings within the person that caused the behavior.  Either statement <br/>\nis a rejection, to some extent, of the person.  I&#39;ve been in the situation of having my <br/>\n&quot;behavior not liked&quot; but been told that the person &quot;loved me,&quot; and I didn&#39;t actually feel <br/>\nloved, because my behavior WAS an expression of ME.<br/>\n<br/>\nI think the second statement is a more politically correct one, but the first strikes me as <br/>\nmore upfront and honest.  That&#39;s not to say I would verbalize that at anytime, and <br/>\nespecially in the midst of a conflict with my kids, or anyone, but when that love bond is <br/>\nweakened, the person can usually feel it anyway.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":334634178,"authorName":"Cindy Fox","from":"&quot;Cindy Fox&quot; &lt;outreach@...&gt;","profile":"cindycindyfox","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Punishments and Safety and Consequences","postDate":"1210489343","msgId":34773,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGcwNjVsdit1c2cyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc3MThFODJCLUU1NDYtNDE4QS1BNzRCLTk4ODRFOTcwMTA2RUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":34771,"nextInTopic":34774,"prevInTime":34772,"nextInTime":34774,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"I have really enjoyed this thread and I so totally agree with you that there is a world of options.  I also ABSOLUTELY believe I can still LOVE someone and at","messageBody":"<div id=\"ygrps-yiv-1841020763\">I have really enjoyed this thread and I so totally agree with you <br/>\nthat there is a world of options.  I also ABSOLUTELY believe I can <br/>\nstill LOVE someone and at the same time NOT tolerate their <br/>\nbehavior.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;Did you tell your child &quot;I will protect you from any consequences <br/>\n </span></blockquote>of your actions, no matter how harmful&quot;?<br/>\n<br/>\nThis NOT the same as &quot;I will always love you, no matter what you <br/>\ndo&quot;  which is what I felt was being discussed in the other posts.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;If you did, you shouldn&#39;t have. If you didn&#39;t, what do you care <br/>\n </span></blockquote>if it feels like a punishment?<br/>\n<br/>\nI care because communication takes two people, and my message (and <br/>\nactions) only mean what others take them to mean.  If they don&#39;t <br/>\ntake it as I intended it, it doesn&#39;t make me right and them wrong, <br/>\nbut it does mean that communication between us has failed.  I care <br/>\nhow they feel because I love them and I want them to learn, not feel <br/>\npunished. I don&#39;t think people learn from punishment or rather, they <br/>\nlearn things you didn&#39;t intend.  What they learn is important to me.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;If you&#39;re indicating to him by word and deed that he&#39;s free to do <br/>\n </span></blockquote>any damned thing he can think up and you&#39;ll stand there smiling and <br/>\nsaying &quot;I love you,&quot; NOT good.<br/>\n<br/>\nI see the question of `Will you still love me no matter what I do?&#39; <br/>\nas looking for *reassurance* of my love, not permission <br/>\nfor `misbehavior&#39;.<br/>\n<br/>\nI have no problem with standing there angry looking and saying, &quot;I <br/>\nlove you, but I am NOT happy right now!&quot;<br/>\n<br/>\nLoving someone does not equal tolerating all behaviors.<br/>\n<br/>\nc.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Punishments and Safety and Consequences","postDate":"1210471862","msgId":34771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3MThFODJCLUU1NDYtNDE4QS1BNzRCLTk4ODRFOTcwMTA2RUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":34773,"prevInTime":34770,"nextInTime":34772,"topicId":34771,"numMessagesInTopic":0,"msgSnippet":"The thread on handling disrespect respectfully is disturbing me, and I m trying to figure out why.  I want to bring the ideas away from the","messageBody":"<div id=\"ygrps-yiv-1112823928\">The thread on &quot;handling disrespect respectfully&quot; is disturbing me,  <br/>\nand I&#39;m trying to figure out why.  I want to bring the ideas away  <br/>\nfrom the particulars/individuals.<br/>\n<br/>\nI&#39;m very grateful to those who have patiently tried to explain the  <br/>\nhows and whys of what seems, to some, like limits and &quot;no&quot; and  <br/>\npunishment, but it really the compassionate assistance of one human  <br/>\nby a loving other.<br/>\n<br/>\n<br/>\n<br/>\nThis is just in general to any mom involved who&#39;s questioning advice  <br/>\nthat seems harsher than &quot;non-coercion.&quot;<br/>\n<br/>\nDid you tell your child &quot;I will never punish you&quot;?<br/>\n<br/>\nDid you tell your child &quot;I will protect you from any consequences of  <br/>\nyour actions, no matter how harmful&quot;?<br/>\n<br/>\nIf you did, you shouldn&#39;t have.  If you didn&#39;t, what do you care if  <br/>\nit feels like a punishment?<br/>\n<br/>\nIf you&#39;re not hitting him or shaming him or &quot;grounding him&quot; or  <br/>\nforcing him to eat spinach or to go to bed and stay there at 8:00 at  <br/>\nnight, good.<br/>\n<br/>\nIf you&#39;re indicating to him by word and deed that he&#39;s free to do any  <br/>\ndamned thing he can think up and you&#39;ll stand there smiling and  <br/>\nsaying &quot;I love you,&quot; NOT good.<br/>\n<br/>\nIn  the vast space between those things are many good, thoughtful,  <br/>\nmindful, rational options.<br/>\n<br/>\n<br/>\n<br/>\nI guess it&#39;s my same old concern:  Some people take a  <br/>\nmisunderstanding of something they half read or didn&#39;t consider  <br/>\ncarefully enough, they move too far too fast without understanding  <br/>\nthe principles involved, and then blame unschooling for bad results.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":34893,"nextTopicId":34707}}