{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1175077,"authorName":"primalmother","from":"&quot;primalmother&quot; &lt;Nest4Robin@...&gt;","profile":"primalmother","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[ALERT] Tell Bureaucrats to Stop Harassing Parents","postDate":"1055940953","msgId":74705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGJjcG5ncCtsMWM2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":74704,"nextInTime":74706,"topicId":74705,"numMessagesInTopic":0,"msgSnippet":"[ALERT] Tell Bureaucrats to Stop Harassing Parents This CONSERVATIVE ALERT prepared for Jack G Rickard: ISSUE: Our friend Chuck Muth (ChuckMuth.com) has just","messageBody":"<div id=\"ygrps-yiv-2034980691\">[ALERT] Tell Bureaucrats to Stop Harassing Parents This CONSERVATIVE ALERT prepared for Jack G Rickard: ISSUE: Our friend Chuck Muth (ChuckMuth.com) has just alerted us ofan INSANE situation up in Waltham, Massachusetts. This one&#39;s soridiculous, it makes our blood boil just to think of it. Take a lookat his message: Kim and George Bryant have been home-schooling their two kids, George (15) and Nyssa (13), much to the chagrin of the Waltham Public School(WPS) system. The Bryants thus far have refused to force theirchildren to take a government-mandated standardized test to assesstheir education level. The WPS empire struck back last year, obtaining a court order givingcustody of the kids to the Department of Social Services (DSS), whichever since has been threatening to take the kids away from theirparents. As the MetroWest Daily News reported on Friday, &quot;Both sides agreethat the children are in no way abused mentally, physically, sexuallyor emotionally, but legal custody of the children was taken from Kimand George Bryant in December 2001.&quot; They were ruled to be &quot;unfit&quot;for not filing educational plans with the government. Unfit. For not filing paperwork. With the government school system.Over the education of their OWN children. In fact, George Bryant was actually ARRESTED six years ago forfailing to comply with the government&#39;s dictates over thehome-schooled education of HIS children. Arrested. Thrown in jail. Like a criminal. For taking personalresponsibility for the education of HIS kids. This six-year legal battle exploded on Thursday as bureaucrats fromthe DSS showed up at the Bryants&#39; home with police escorts at 7:45a.m. and attempted to remove the children from their home and forcethem to take the mandated tests. Once again, the Bryants told the government agents to pound dirt,resulting in a seven-hour standoff. &quot;This has been a six-year battlebetween the Waltham Public Schools and our family over who is incontrol of the education of our children,&quot; said Bryant. How DARE these parents stand up to the government and defend theirright to raise their children as they see fit? Who do they think theyare? At least, that&#39;s the attitude of one outrageous government bureaucratinvolved in this brouhaha. &quot;We have the legal custody of the children and we will do with themas we see fit,&quot; DSS trooper Susan Etscovitz told the Bryants Thursdaymorning. &quot;They are minors and they do what we tell them to do.&quot; It is near impossible to describe the rage I feel inside every time Iread those chilling words. WE will do with them as WE see fit. They do what WE tell them to do. The sheer audacity of a bureaucrat to make such a statement aboutsomeone else&#39;s children who are in no way abused in any shape, formor fashion is beyond comprehension to me. Comrade Etscovitz maintained on Thursday that, &quot;No one wants thesechildren to be put in foster homes. The best course of action wouldbe for (the Bryants) to instruct the children to take the test.&quot; One can just imagine her words being delivered with a thick EastGerman accent: &quot;Oon now, all vee need ees dee kidz!&quot; This isn&#39;t about education. It&#39;s about control. It&#39;s about animperial government trying to crush a movement in its infancy whichcould one day spell the end of the public school monopoly over ourkids&#39; educations. Home-schooling means children might start learning again. REALlearning. Not &quot;whole language&quot; and &quot;self-esteem.&quot; Learning aboutradical notions such as freedom, liberty and personal responsibility.Notions such as limited government and the Constitution and thevision of our Founding Fathers. Yeah, we can&#39;t have THAT! ACTION ITEM: As it appears that DSS is getting its marching ordersfrom the Waltham Public Schools, it seems the best place to start iswith the School Superintendent there. Her name is Dr. Susan Parrella.She can be reached via email at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:parrellas@...\">parrellas@...</a> or byphone at (781) 314-5400 or fax at (781) 314-5411. Emails are great... but nothing quite ruins a bureaucrat&#39;s day likedealing with a flood of phone calls. I know. I just called. The womanwho answered the phone hung up on me when she found out what I wascalling about. They do NOT want to answer any questions about this. Oh, and by the way. I reached Ms. Etscovitz this morning. She was nota happy camper once she found out what I was calling about. Refusedto comment on her &quot;we will do with them as we see fit&quot; statement,saying only, &quot;I&#39;m terminating this conversation now,&quot; before slammingthe phone down. I think it would really bug her if a lot of people called (781)641-8500, so please, please don&#39;t rattle her cage, OK? That numbernot to call again to reach Susan Etscovitz is (781) 641-8500. That&#39;s(781) 641-8500. (You could also fax her at 781-648-6909.) -- Chuck Muth We normally set up a website with a pre-written letter to Congress,etc. However, we thought it would be much more effective for ourmembers to make contact as described above, in their own words. Ifyou get a response you&#39;d like to share, be sure to drop us a note. Asthis issue develops and is &quot;bumped up the ladder&quot; of responsibility,we&#39;ll let you know who to contact next. NOTE: The situation in Waltham has gotten WAY out of hand. Outraged Americans across the country need to contact these bureaucrats NOW toexpress their outrage and demand they do the RIGHT thing. Be sure toforward this email to everyone you know who wants to help saveparental choice in America, starting in Massachusetts. Thank you! ______________________________________________</div>","specialLinks":[]}],"prevTopicId":74474,"nextTopicId":74714}}