{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] is unshooling all about acceptance of the child where s/he is no matter what?","postDate":"1270590243","msgId":52524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkzMjE2LjY0NDYzLnFtQHdlYjExMDQxMC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PGhwYW1oZitzb3ZqQGVHcm91cHMuY29tPg==","referencesHeader":"PGhwYW1oZitzb3ZqQGVHcm91cHMuY29tPg=="},"prevInTopic":52463,"nextInTopic":0,"prevInTime":52523,"nextInTime":52525,"topicId":52460,"numMessagesInTopic":0,"msgSnippet":"***Then, it popped into my head that I could have just said you really wanted candy instead of money, didn t you? and let that be that. That I could have","messageBody":"<div id=\"ygrps-yiv-1443357861\">***Then, it popped into my head that I could have just said &quot;you really wanted candy instead of money, didn&#39;t you?&quot; and let that be that. That I could have just ACCEPTED what he was feeling in the moment and not worried about his behavior.***<br/>\n<br/>\nIn this situation I would&#39;ve pulled my child aside and let him know that ALL of the eggs had money in them and that the fun now would be to find them all and that you&#39;d go and get candy ASAP, some that he could choose himself!<br/>\n<br/>\nAs a kid, I would&#39;ve been extremely disappointed with not getting any candy for Easter.  We never had candy in our house, so candy was a big deal to get.  If that&#39;s the case for your family, I&#39;d consider having more around so that it&#39;s not such a big deal to get or not to get candy for Easter.  At our house this year, we didn&#39;t have extra money, so I took a bunch of plastic eggs and filled them with candy we already had in the house and put them in the basket.  It was the thought that counted.  <br/>\n<br/>\nMargaux would&#39;ve preferred new and interesting candy, but she was happy to have her little basket full of candy already to take with her to grandma&#39;s house.  Chamille, her older sister shared some of her candy stash to make more variety for her sister&#39;s basket.  Chamille didn&#39;t want a basket at all this year so she even let her sister use her basket, which has been a source of contention over the years, as Chamille&#39;s has always been fancier in shape.  She&#39;s letting her sister keep it forever, we use the same 2 baskets every year.  I actually like Margaux&#39;s better, but for some reason Margaux never did even though it&#39;s bigger and can fit more stuff in it!  I should have just gotten a new basket, but I always forgot until it was time to fill them!<br/>\n<br/>\nSo, now you know!  Have candy around for just in case you need some!<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: is unshooling all about acceptance of the child where s/he is no matter what?","postDate":"1270413487","msgId":52463,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzRDMzMzk0LUI4MTgtNEVEMy04QUQ5LTY5MDA3MENEMjgwQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhwYXI3ditrbDdiQGVHcm91cHMuY29tPg==","referencesHeader":"PGhwYXI3ditrbDdiQGVHcm91cHMuY29tPg=="},"prevInTopic":52462,"nextInTopic":52524,"prevInTime":52462,"nextInTime":52465,"topicId":52460,"numMessagesInTopic":0,"msgSnippet":"-=- So Sandra, when it matters to you, what do you DO? Do you take them aside and speak to them? -=- It always depends who s there, what mood they re in. Was","messageBody":"<div id=\"ygrps-yiv-1432766699\">-=-<br/>\nSo Sandra, when it matters to you, what do you DO? Do you take them  <br/>\naside and speak to them? -=-<br/>\n<br/>\nIt always depends who&#39;s there, what mood they&#39;re in. Was he hunting  <br/>\neaster eggs without having had breakfast?  Did you wake him up to hunt  <br/>\neggs?<br/>\n<br/>\nThere might have been other factors.<br/>\n<br/>\nMy kids always knew I hid the eggs.  If your child and the others  <br/>\nthere knew that too, maybe you could have said &quot;next year I&#39;m putting  <br/>\ncandy instead,&quot; or &quot;I hope some of these have candy.&quot;<br/>\n<br/>\nYou could have taken a few found ones and put candy in them and hidden  <br/>\nthem in a cool part of the yard where he wasn&#39;t looking, maybe.<br/>\n<br/>\n-=-When there is a line within your family that you think your  <br/>\nchildren have crossed, what do you DO? How do you handle it?<br/>\n-=-<br/>\n<br/>\nI want to save face for them short-term if at possible, but I want to  <br/>\nsave face for them longterm, too.  So if one situation can be covered  <br/>\nover or ignored or let slide, and I can talk to them afterwards when  <br/>\nthey&#39;re all fed, watered, rested and the situation isn&#39;t immediate,  <br/>\nthen I would talk to them later.<br/>\n<br/>\nIf it&#39;s immediate and someone else is involved than family, maybe you  <br/>\ncould say &quot;I think Carol&#39;s feelings will be hurt if you&#39;re unhappy&quot; or  <br/>\nsomething (depends if Carol was the one who hid eggs with money in  <br/>\nthem, or whatever.)<br/>\n<br/>\nDepends how old the child is.<br/>\n<br/>\nDepends how adept the child is at social situations.<br/>\n<br/>\n-=-For example, if I tell him &quot;Joe, can you please be more quiet, we  <br/>\nare in the car. It hurts my ears&quot;. Then, half an hour later he will  <br/>\ntell his friend Jaeden, &quot;Jaeden can you be quiet - you are hurting my  <br/>\nears.&quot; .. but now we are in the basement and it doesn&#39;t bother ME  <br/>\nanymore, because I think the basement is a more acceptable place to be  <br/>\nloud.-=-<br/>\n<br/>\nThat one I would have just let go.   Kids get older.  It&#39;s normal for  <br/>\nthem to try things out and to copy the way others treat them.<br/>\n<br/>\nIn the car, could you have opened the windows, or put music on that he  <br/>\ncould have sing along to or something?<br/>\n<br/>\nMaybe being more creative with your own criticisms and responses will  <br/>\ngive you and him both ideas about how to handle other situation.<br/>\n<br/>\nThis is a whole bunch of &quot;it all depends,&quot; but so is life.<br/>\nThe original question was:<br/>\n-=-So, is the acceptance the answer and never mind how they behave  <br/>\nbecause they will figure it out when they figure it out and I can&#39;t  <br/>\ncontrol or shape it? -=-<br/>\n<br/>\nMy simple answer is no.<br/>\n:-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: is unshooling all about acceptance of the child where s/he is no matter what?","postDate":"1270411327","msgId":52462,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwYXI3ditrbDdiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDA0Mjc2ODkyLUIwMUQtNEQ1OS04RkVCLTgzMDU2MEE0NjNEQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":52461,"nextInTopic":52463,"prevInTime":52461,"nextInTime":52463,"topicId":52460,"numMessagesInTopic":0,"msgSnippet":"My husband did tell him we could buy candy with the money, and he kept expressing his disappointment. ... and then I started feeling bothered. The first 6 or 7","messageBody":"<div id=\"ygrps-yiv-1403145818\">My husband did tell him we could buy candy with the money, and he kept expressing his disappointment. ... and then I started feeling bothered.  <br/>\n<br/>\nThe first 6 or 7 times he did it it didn&#39;t bother me.  The last 2 or 3 times did.<br/>\n<br/>\n-=-For me it would matter whether there were other kids there, whether<br/>\nthe eggs with money had come from a grandmother or what; there would<br/>\nbe factors, for me, that mattered. Some people go with &quot;just accept,&quot;<br/>\nand sometimes that&#39;s fine.-=-<br/>\n<br/>\nSo Sandra, when it matters to you, what do you DO?  Do you take them aside and speak to them?  <br/>\n<br/>\nWhen there is a line within your family that you think your children have crossed, what do you DO?  How do you handle it?  <br/>\n<br/>\nMy other issue with this is that I see that when I am unaccepting of something he does, and so I take him aside and have a conversation with him about it, then I find him unaccepting of that in other children, immediately.<br/>\n<br/>\nFor example, if I tell him &quot;Joe, can you please be more quiet, we are in the car.  It hurts my ears&quot;.  Then, half an hour later he will tell his friend Jaeden, &quot;Jaeden can you be quiet - you are hurting my ears.&quot; .. but now we are in the basement and it doesn&#39;t bother ME anymore, because I think the basement is a more acceptable place to be loud.<br/>\n<br/>\nNow, after this incident, I wouldn&#39;t be surprised to hear him tell one of his friends that they should be more appreciative about something he has given them.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] is unshooling all about acceptance of the child where s/he is no matter what?","postDate":"1270407874","msgId":52461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA0Mjc2ODkyLUIwMUQtNEQ1OS04RkVCLTgzMDU2MEE0NjNEQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhwYW1oZitzb3ZqQGVHcm91cHMuY29tPg==","referencesHeader":"PGhwYW1oZitzb3ZqQGVHcm91cHMuY29tPg=="},"prevInTopic":52460,"nextInTopic":52462,"prevInTime":52460,"nextInTime":52462,"topicId":52460,"numMessagesInTopic":0,"msgSnippet":"-=-Then, it popped into my head that I could have just said you really wanted candy instead of money, didn t you? and let that be that. That I could have","messageBody":"<div id=\"ygrps-yiv-1430398326\">-=-Then, it popped into my head that I could have just said &quot;you  <br/>\nreally wanted candy instead of money, didn&#39;t you?&quot; and let that be  <br/>\nthat. That I could have just ACCEPTED what he was feeling in the  <br/>\nmoment and not worried about his behavior.-=-<br/>\n<br/>\nI think I would have said &quot;we can buy candy with that money!&quot;<br/>\nYou could take him candy shopping tomorrow when the easter candy is  <br/>\nhalf price.<br/>\n<br/>\n-=I felt he wasn&#39;t being appreciative and it bothered me. I finally  <br/>\ntold him something along the lines of when someone gives you something  <br/>\nit&#39;s because they care for you and if it&#39;s not exactly what you want  <br/>\nit is still important to be appreciative and his attitude was making  <br/>\nme feel like he didn&#39;t deserve the money.-=-<br/>\n<br/>\nThat seems like a lot of words.<br/>\n<br/>\nMaybe next year, with fewer words, just ask him what kinds of easter  <br/>\nstuff he likes best.  Or when you go shopping with him for half-price  <br/>\ncandy, maybe remember what appealed to him.<br/>\n<br/>\n-=-I was thinking later that I would come to the list and ask how to  <br/>\nhandle a situation where a child was displaying behavior that I didn&#39;t  <br/>\nthink was appropriate - or that bothered me.-=-<br/>\n<br/>\nSometimes parents make a small deal a big deal, so watch out for  <br/>\nthat.  Sometimes the parental image of what easter should be like (or  <br/>\nanything) is way bigger than the child&#39;s.<br/>\n<br/>\n-=-Then, it popped into my head that I could have just said &quot;you  <br/>\nreally wanted candy instead of money, didn&#39;t you?&quot; and let that be  <br/>\nthat. That I could have just ACCEPTED what he was feeling in the  <br/>\nmoment and not worried about his behavior.-=-<br/>\n<br/>\nFor me it would matter whether there were other kids there, whether  <br/>\nthe eggs with money had come from a grandmother or what; there would  <br/>\nbe factors, for me, that mattered.  Some people go with &quot;just accept,&quot;  <br/>\nand sometimes that&#39;s fine.<br/>\n<br/>\n-=-So, is the acceptance the answer and never mind how they behave  <br/>\nbecause they will figure it out when they figure it out and I can&#39;t  <br/>\ncontrol or shape it? -=-<br/>\n<br/>\nI don&#39;t think so.  There is an emotional reality of accepting a  <br/>\nchild&#39;s attitude, but that can&#39;t be the whole of a relationship  <br/>\nbetween a parent and child.<br/>\n<br/>\nSandra<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":170380942,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisa@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"is unshooling all about acceptance of the child where s/he is no matter what?","postDate":"1270406511","msgId":52460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhwYW1oZitzb3ZqQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":52461,"prevInTime":52459,"nextInTime":52461,"topicId":52460,"numMessagesInTopic":0,"msgSnippet":"Thank you all for the prior answers I have received.  I read and considered each with great care and am infinitely appreciative. So, this morning my son is","messageBody":"<div id=\"ygrps-yiv-1054383020\">Thank you all for the prior answers I have received.  I read and considered each with great care and am infinitely appreciative.<br/>\n<br/>\nSo, this morning my son is having his easter egg hunt.  Every time he picks up an egg he shakes it and says &quot;oh, it&#39;s money&quot; in a disappointed voice and puts it in his basket.<br/>\n<br/>\nApparently he wanted candy in all his eggs.<br/>\n<br/>\nI felt he wasn&#39;t being appreciative and it bothered me.  I finally told him something along the lines of when someone gives you something it&#39;s because they care for you and if it&#39;s not exactly what you want it is still important to be appreciative and his attitude was making me feel like he didn&#39;t deserve the money.<br/>\n<br/>\nSo, this little outburst of mine bothered me too.  I was thinking later that I would come to the list and ask how to handle a situation where a child was displaying behavior that I didn&#39;t think was appropriate - or that bothered me.<br/>\n<br/>\nThen, it popped into my head that I could have just said &quot;you really wanted candy instead of money, didn&#39;t you?&quot; and let that be that.  That I could have just ACCEPTED what he was feeling in the moment and not worried about his behavior.<br/>\n<br/>\nAnd this FELT so much better than what I did say, but I DIDN&#39;T like the way he was acting and I DIDN&#39;T want the way he was acting to continue and I don&#39;t want him to be unappreciative. ... <br/>\n<br/>\nSo, is the acceptance the answer and never mind how they behave because they will figure it out when they figure it out and I can&#39;t control or shape it?  <br/>\n<br/>\nI know the acceptance feels better in one way to me, but it&#39;s also scary to give up the idea of shaping or guiding his behavior.<br/>\n<br/>\nthanks, Lisa</div>","specialLinks":[]}],"prevTopicId":52521,"nextTopicId":52504}}