{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":61,"messages":[{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation  documentaries","postDate":"1264426566","msgId":50020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5NjM5OS4yODg2MC5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":50018,"nextInTopic":50022,"prevInTime":50019,"nextInTime":50021,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"Linnaea loved princesses when she was littler. She wanted to grow up to be one. One day, when we were in York, Princess Ann was on a royal visit and David and","messageBody":"<div id=\"ygrps-yiv-1868781181\">Linnaea loved princesses when she was littler. She wanted to grow up to be one. One day, when we were in York, Princess Ann was on a royal visit and David and Linnaea and my dad got to see her while Simon and I fed pigeons. The mayor was out in her robes and there were the councillors in attendance as well. And Princess Ann came through in a suit, I think, and Linnaea concluded that she didn&#39;t want to be like a real princess, more like a Disney princess. <br/>\n<br/>\nShe was little and her goals were different. Now she likes being herself. She likes watching ICarly and Phineas and Ferb and Chowder and Glee and QI and Mock the Week and Spongebob and some Japanese films and, and, and...  She doesn&#39;t aspire to be a princess, although Disney princesses aren&#39;t bad role models. They screw up and apologize, they are kind and generous, they wear really cool clothes, at least cool to a little girl who loves pink. <br/>\n<br/>\nBoth Linnaea and Simon have shown themselves, over and over again, to be more powerful than television and it&#39;s influence. They are very critical of claims that things make on ads, probably because they&#39;ve purchased things and had them not be all that they hoped they would be. Or maybe not, maybe because we talk about lots of things including ads and whats on television. At the moment there are a series of ads for the National Society for the Prevention of Cruelty to Children that are really disturbing. And they make me angry. There is no reason why I need my nose rubbed in the horrors that they want me to believe in enough to pay money to them. There was an ad for Great Ormond Street Hospital the other day that suggested that 3 pounds a month would house families whose children were in their care. 3 pounds a month isn&#39;t going to pay for a family to stay in London. 3 pounds a month isn&#39;t going to even pay for the ad. But that&#39;s just my rant of the<br/>\n moment. <br/>\n<br/>\nBeing able to discern fiction from reality, the bias of a salesperson and a buyer, all of that, is about critical thinking. Simon and Linnaea will test to see the validity of a statement more often than not. They aren&#39;t fools. Television hasn&#39;t swayed them to believe or disbelieve things based on one perspective. Television often has more than one perspective to offer on many different things. The different views of school, for example. Some present it in glowing terms, others as a social gathering place, and others as the first circle of hell. And, as school doesn&#39;t just exist on television, both Simon and Linnaea could explore it in lots of others ways if they chose to. <br/>\n<br/>\nJust like hypnosis, television can&#39;t make you do something you don&#39;t want to do.  <br/>\n<br/>\nSchuyler<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n<br/>\nI was explaining to friends why we don&#39;t give Disney movies to our daughter.<br/>\nWe said &quot;we don&#39;t want her to imagine Snow White as necessarily the Disney<br/>\ncharacter for the rest of her life&quot;. Our friend said &quot;what do you mean?<br/>\neveryone knows how Snow White looks like&quot;, then he described Disney&#39;s Snow<br/>\nWhite! It was so sad to see that he does not even get that Snow White can be<br/>\ndifferent from one person to another, it just depend on each one<br/>\nimagination.... Well, at least Disney is now (in 2009) starting to create<br/>\nprincesses with dark colour...<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation documentaries","postDate":"1264421718","msgId":50011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMxQ0UzQUY3LTRGNEMtNDg1OC05QzAwLTBGRTU1RTYzRkRBQkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPiA8aGppYXQxK2xiazJAZUdyb3Vwcy5jb20+IDwxYmUwNDdmMDEwMDEyNDE0MDB5NTI2NjZlZnVlNjQ3NTZhOWNmZjczM2IzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50010,"nextInTopic":50012,"prevInTime":50010,"nextInTime":50012,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"... I think you re turning the thoughts over, but you re not seeing objectively. Theories should describe real life. Real life shouldn t be filtered until it","messageBody":"<div id=\"ygrps-yiv-705336377\">On Jan 24, 2010, at 5:00 PM, Cinira Longuinho wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I do look at<br/>\n&gt; this with criticism<br/>\n<br/>\n </span></blockquote>I think you&#39;re turning the thoughts over, but you&#39;re not seeing  <br/>\nobjectively. Theories should describe real life. Real life shouldn&#39;t  <br/>\nbe filtered until it matches a theory.<br/>\n<br/>\nReal kids -- even schooled kids ;-) -- aren&#39;t as susceptible as the  <br/>\nfear mongers say they are. It might sound like it make sense. It  <br/>\nmight even make someone see the world through the theory. But if you  <br/>\ntake off the fear glasses and begin fresh, the real world works  <br/>\ndifferently.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:TV issue: Consumer kids and Corporation documentaries","postDate":"1264421429","msgId":50010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyOURDOTExLThCQUEtNDgzRC04RjEwLUVFOUM5OTc2OTI2N0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDRCNUNGOTA4LjgwNzA1MDhAeWFob28uY2E+","referencesHeader":"PDRCNUNGOTA4LjgwNzA1MDhAeWFob28uY2E+"},"prevInTopic":50008,"nextInTopic":50011,"prevInTime":50009,"nextInTime":50011,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"... And I think that fails more than it succeeds. Kathryn and I were talking about that recently that there hadn t been a huge phenomenon like Pokemon in a","messageBody":"<div id=\"ygrps-yiv-835459422\">On Jan 24, 2010, at 8:51 PM, Shira Rocklin wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I didn&#39;t realize that many television characters are<br/>\n&gt; created first as merchandise, and then they go about creating a &#39;show&#39;<br/>\n&gt; (or movie, etc) to advertise that character in order to make the<br/>\n&gt; merchandise sell ... And I think its useful to know these things<br/>\n<br/>\n </span></blockquote>And I think that fails more than it succeeds. Kathryn and I were  <br/>\ntalking about that recently that there hadn&#39;t been a huge phenomenon  <br/>\nlike Pokemon in a while. Pokemon succeeded because the original  <br/>\ndesigner loved collecting bugs as a child. And he managed to build a  <br/>\ngood game around the essence that thrilled him: the coolness of  <br/>\ncapturing something you&#39;re looking for, the coolness of hunting down  <br/>\nand actually finding something that&#39;s rare and unusual.<br/>\n<br/>\nA product -- or book or movie or game -- that begins with a thing and  <br/>\ntries to cobble a heart into it is going to fail far more than  <br/>\nsomething that begins with a heart and grows outward. Hearts can&#39;t be  <br/>\ncreated on demand of a manufacturers schedule. Manufacturers can  <br/>\ncreate products on demand and toss them into the world to see if  <br/>\nsomething sticks. It&#39;s really all they have and better than sitting  <br/>\naround waiting. Even products that fail will make some money. Not  <br/>\nbecause manufacturers are evil but because people like to try new  <br/>\nthings out if they look intriguing. But if the product has no  <br/>\nsubstance, doesn&#39;t give back what it suggests it can provide, it&#39;s  <br/>\nnot going to continue to sell. The people who bought it won&#39;t buy  <br/>\nmore and they won&#39;t tell other people about it.<br/>\n<br/>\nSo I think questioning things, looking for patterns, looking at the  <br/>\nbig picture, looking at what really happens, those are even more  <br/>\nuseful than knowledge handed to someone.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":311075098,"authorName":"Mandy Ray-Jones","from":"Mandy Ray-Jones &lt;shebrakes4rainbows@...&gt;","profile":"shebrakes4rainbows","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation \tdocumentaries","postDate":"1264419635","msgId":50018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczYzc2YzBhMTAwMTI1MDM0MHg0N2E0NGU1N2wxYzlmMWE2OGZkZTUzOGRiQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDg4RkNDNTVFLTZCNEQtNDIzRC04OTUyLUVCNDcyMEMyNTNDNkB2ZXJpem9uLm5ldD4=","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPgkgPGhqaWF0MStsYmsyQGVHcm91cHMuY29tPgkgPDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+CSA8ODhGQ0M1NUUtNkI0RC00MjNELTg5NTItRUI0NzIwQzI1M0M2QHZlcml6b24ubmV0Pg=="},"prevInTopic":50017,"nextInTopic":50020,"prevInTime":50017,"nextInTime":50019,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"I have my own issues with Disney.  The theme parks wear me out and I don t like that they financially support Planned Parenthood.  But I refuse to let my views","messageBody":"<div id=\"ygrps-yiv-1110925481\">I have my own issues with Disney.  The theme parks wear me out and I don&#39;t<br/>\nlike that they financially support Planned Parenthood.  But I refuse to let<br/>\nmy views of this &quot;evil corporation&quot; ruin things for my son.  For almost two<br/>\nyears now he has been what others might call unhealthily obsessed with<br/>\n&quot;WALL-E&quot;.  I didn&#39;t even like the movie personally but I won&#39;t let my son<br/>\nknow that.  I have learned to embrace WALL-E, the character, and all of the<br/>\nother robots the same way that I hope my kids will embrace my loves like 80s<br/>\nsitcoms and the band the B-52s.  Because my son loves WALL-E, I have found<br/>\nthat I have started to love him.  It&#39;s been fun to see if we can collect all<br/>\nof the WALL-E merchandise (non of which he saw on television but has instead<br/>\nseen online because he used his love of WALL-E as motivation to learn to<br/>\nspell and google).  For Christmas, it was so much fun to surprise him with a<br/>\nfew WALL-E things I&#39;d found that he didn&#39;t know about, one item he is taking<br/>\nto homeschool show and tell with his friends today.  I&#39;d watched his love<br/>\nturn him into a game show host, a film maker, a blogger, a writer, a<br/>\nphotographer, and now he&#39;s starting to show interest in learning how to<br/>\nbuild a WALL-E and we&#39;ve even joined a WALL-E builders group online.  He is<br/>\nhaving a blast.  He is only five.  I am so thankful for WALL-E, despite my<br/>\npersonal distaste for Disney.  Because it ain&#39;t all about me.<br/>\n<br/>\nIn addition, my daughter who has just turned four introduced me to a show on<br/>\nNickeoldeon called &quot;iCarly&quot;.  I fell in love with it.  Now my kids are<br/>\nmaking their own at home webcasts.  We even had an &quot;iCarly&quot; birthday party<br/>\nfor my daughter.  This is one of the first things that my daughter and I<br/>\nhave been able to enjoy together.  Furthermore, he brother has started to<br/>\nlove the show as well and it is something they like to watch together.  For<br/>\nme, television has brought my family closer together.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation documentaries","postDate":"1264417838","msgId":50008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4RkNDNTVFLTZCNEQtNDIzRC04OTUyLUVCNDcyMEMyNTNDNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPiA8aGppYXQxK2xiazJAZUdyb3Vwcy5jb20+IDwxYmUwNDdmMDEwMDEyNDE0MDB5NTI2NjZlZnVlNjQ3NTZhOWNmZjczM2IzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50001,"nextInTopic":50010,"prevInTime":50007,"nextInTime":50009,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"... The purpose of advertising is to persuade people they want to try something. What s wrong with that? It s been going on since there was things to buy and","messageBody":"<div id=\"ygrps-yiv-1026919364\">On Jan 24, 2010, at 5:00 PM, Cinira Longuinho wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; However, I missed you addressing how unfair game can be between  <br/>\n&gt; parents and<br/>\n&gt; corporations on what gets into the mind of our kids.<br/>\n<br/>\n </span></blockquote>The purpose of advertising is to persuade people they want to try  <br/>\nsomething. What&#39;s wrong with that? It&#39;s been going on since there was  <br/>\nthings to buy and sell.<br/>\n<br/>\nAdvertising can&#39;t persuade people to continue to buy something they  <br/>\ndon&#39;t like.<br/>\n<br/>\nI think what ultimately these people are afraid of is that kids are  <br/>\ngetting ideas separate from their parents. And then kids are thinking  <br/>\nabout those ideas and making decisions on their own that aren&#39;t in  <br/>\ntheir parents&#39; control. And then the parents are angry because they  <br/>\ndon&#39;t know how to get those foreign thoughts out of their kids&#39; heads  <br/>\nso they blame advertisers.<br/>\n<br/>\nI think those parents should spend more time with their kids. They  <br/>\nshould have conversations. They should not fear their children having  <br/>\nthoughts. They should not fear their children conducting experiments  <br/>\n(by buying something) to test the theory that what was said in the  <br/>\nadvertisement is true or not.<br/>\n<br/>\nIt was rare when my daughter wanted something she saw on TV. Her  <br/>\ntastes tended toward more unadvertised stuff: Beanies and Pokemon and  <br/>\nrobots. But occasionally she saw some food and we&#39;d buy it. Then  <br/>\nshe&#39;d try it to see if she liked it. If she did, I&#39;d buy it again. If  <br/>\nshe didn&#39;t, I didn&#39;t.<br/>\n<br/>\nYou&#39;ve done exactly what the fear mongers have said happens to kids  <br/>\nwith advertisements. You&#39;ve accepted the advertisement as truth and  <br/>\ndidn&#39;t take the next step to think it through. It only took a couple  <br/>\nof times of buying different things that didn&#39;t turn out like the  <br/>\ncommercial for my daughter to realize advertisers put buying their  <br/>\nproduct ahead of being totally clear and truthful. If anything  <br/>\ncommercials helped her think more critically.<br/>\n<br/>\nI think the big difference between persuading people they might like  <br/>\na product and persuading people to grasp an idea is fear. Fear makes  <br/>\npeople stop questioning. Who wants to question the stability of a  <br/>\nfloating piece of rotten wood when in the middle of the ocean? It  <br/>\ntakes way way more advertising to make people let go of fears than it  <br/>\ndoes to instill the fear in them. Rotten wood can be comforting when  <br/>\nyou&#39;re afraid.<br/>\n<br/>\nTheir arguments do make logical sense. It seems like the world should  <br/>\nwork like that with kids being innocent and easily deceived. It also  <br/>\nmakes *way* more sense that the Earth is stationary and sun goes  <br/>\naround the Earth. You can&#39;t feel the Earth moving and can see the sun  <br/>\nmoving every single day. And yet it isn&#39;t true.<br/>\n<br/>\nSo where&#39;s the ocean they&#39;ve sold you the rotten wood to save you  <br/>\nfrom? You need to let go of that rotten wood, stretch your legs down  <br/>\nto the solid ground beneath you so you can ask the questions you need  <br/>\nto. The questions you need to ask are: What real kids do you know  <br/>\nthat are like that? Are they unschooled kids? Do their parents spend  <br/>\ntime with them, having conversations, helping the kids explore their  <br/>\nown questions? If advertisements made kids into consuming zombies,  <br/>\nthen unschooled kids who have no limits on their TV viewing should be  <br/>\naffected most of all. Does that happen?<br/>\n<br/>\nEven better is to avoid such things! Once those fears get in, they&#39;re  <br/>\nhard to get out!<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337025893,"authorName":"Cinira Longuinho","from":"Cinira Longuinho &lt;ciniravlonguinho@...&gt;","profile":"ciniravlonguinho","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Fairy tales (was TV, and corporations, and other \tfears)","postDate":"1264405388","msgId":50017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFiZTA0N2YwMTAwMTI0MjM0M2oyMTA5NTEyYXAxZWZlODhlOTI4YmU3NjYzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEY2OUFBQzY0LTNGREUtNDRDMS1BOUU4LUEwQjgzNzcxMEFFN0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPgkgPGhqaWF0MStsYmsyQGVHcm91cHMuY29tPgkgPDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+CSA8RjY5QUFDNjQtM0ZERS00NEMxLUE5RTgtQTBCODM3NzEwQUU3QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":50013,"nextInTopic":50018,"prevInTime":50016,"nextInTime":50018,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"===One thing about Snow White is that she s always described as having black hair and white skin and red lips. I don t think they would have called her Snow","messageBody":"<div id=\"ygrps-yiv-547872768\">===One thing about Snow White is that she&#39;s always described as having<br/>\nblack hair and white skin and red lips. I don&#39;t think they would have<br/>\ncalled her &quot;Snow White&quot; otherwise.(...) Disney didn&#39;t make that up. Maybe<br/>\nvarious German storytellers made it up hundreds of years ago.====<br/>\n<br/>\nI am sorry I did not clarify my friend&#39;s description... he said Snow White<br/>\nis the one with yellow and blue dress.<br/>\n<br/>\nI do love fairy tales as well... Sometimes I read, sometimes I just tell the<br/>\nfairy tale to my DD... My mom used to tell me all types of fairy tales...I<br/>\nlove those memories. My favourite one was the little mermaid.. and the end<br/>\nwas that she became a bubble... again different from Disney.<br/>\n<br/>\nI think the topic is unschooling ... but I will tell you I was born in<br/>\nBrazil and when I used to go to school in Brazil  tourism agencies used to<br/>\ngo to my school ( every 2 or 3 months?) to show a video about Disney and<br/>\nsell the package to visit Orlando and Disney...  I had to watch a 30 min<br/>\nvideo and then listen for another 30 min  about all that stuff about<br/>\nDisney... after going upstairs to the top of the building because that was<br/>\nwhere the VCR was ..It was so hot and so annoying. I really hate it.<br/>\n<br/>\n=== But who will save their children from the fearful emotions of the<br/>\nmother?===<br/>\n<br/>\nYou are giving me the label of being fearful. I believe I am a mother<br/>\nconcerned about unlimited tv. I am researching, posting my concerns, trying<br/>\nto understand this option better and addressing it. The same way I believe<br/>\nunschoolers were concerned with sending their kids to school, they did<br/>\nresearch, tried to understand other options to not send their kids to school<br/>\nand now they are doing unschooling.<br/>\n<br/>\nIf you think it is fair to say who will save their children from the fearful<br/>\nemotions of the mother?, it will also be fair to say who will save their<br/>\nchildren from the unschooling lifestyle taken by the parents?<br/>\n<br/>\nI do not think it is fair these judgmental questions.... but that was the<br/>\nlogic proposed before.<br/>\n<br/>\n===If you were giving that much attention to your child, you wouldn&#39;t<br/>\nhave time to watch that documentary and write all this up. ===<br/>\n<br/>\nI have been reading this forum for at least 1 year. Today I did post but in<br/>\ngeneral I do not post at all... I am here to keep myself ALWAYS LEARNING<br/>\nabout unschooling because I genuinely like what I read here but I have the<br/>\nconcern about the TV... and those 2 documentaries resonate on me.<br/>\nCorporation I saw before I had my dd and the consumer kids I saw last<br/>\nyear. But now you are saying that the fact that I am writing here means I am<br/>\nnot giving that much attention to my child!  I am writing my concerns here<br/>\nto try to understand the uschooling concept and discover what I do not<br/>\nget...  with the goal to improve my parenting skills... to try to provide<br/>\nall that to my kid .... based on your comment I will have to say that maybe<br/>\nnobody should write here or on blogs anymore because ppl will be writing<br/>\nhere instead of giving attention to their children. This is nonsense.<br/>\n<br/>\nThe irony in all this was that my kid was sick today and she did  watch lots<br/>\nof dvds today. I was beside her the whole time... She was the whole morning<br/>\non my lap nursing/sleeping while I was posting here.<br/>\n<br/>\n+++Finally, I would like to say I don&#39;t want to scare anyone.+++<br/>\n==You&#39;re not scaring me except with the thought of how much energy and<br/>\n biochemical angst you&#39;re wasting on it.===<br/>\n<br/>\nI was trying to be apologetic about giving the brief description for the 2<br/>\ndocumentaries but I was not clear... your previous comments about it<br/>\nresonate on me.  I am sure you are not scared!<br/>\n<br/>\nMy family lives in love and in peace ( I read/listened the whole link about<br/>\npeaceful parenting provided here... great stuff!) . We are happy. My husband<br/>\nplays piano and guitar and my DD loves to dance, sing, play and do all types<br/>\nof stuff while we are enjoying my husband playing or while we are listening<br/>\nPete Seeger, Rafi, Bossa Nova, and more .. She also loves tea party... it is<br/>\nso much fun!<br/>\n<br/>\nWe do watch  DVDs but we do not have cable TV. When my kid asks for it, I<br/>\noffer another activity, if she does not change her mind, then she watches<br/>\nDVD. Her favourite DVD is The sound of Music... we even went to the musical<br/>\nlast December ... She loved it! After a while of DVD I offer another<br/>\nactivity... in general she is ready to leave the tv and do something else.<br/>\nMy husband and I do not watch tv and we do not invite her to watch with us<br/>\nbecause we just do not watch tv. And in general she prefers me to read a<br/>\nbook that she picked at the library than watching tv.<br/>\n<br/>\nC.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:TV issue: Consumer kids and Corporation \tdocumentaries","postDate":"1264403637","msgId":50013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI0MjMxM3ExYzJjZmUxYmc2ZjBlY2NjNDQ3NTcxOTM0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhqajFpZCt1Ymc3QGVHcm91cHMuY29tPg==","referencesHeader":"PDRCNUNGOTA4LjgwNzA1MDhAeWFob28uY2E+IDxoamoxaWQrdWJnN0BlR3JvdXBzLmNvbT4="},"prevInTopic":50012,"nextInTopic":50017,"prevInTime":50012,"nextInTime":50014,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"I didn t realize that many television characters are created first as merchandise, and then they go about creating a show (or movie, etc) to advertise that","messageBody":"<div id=\"ygrps-yiv-527233479\">&quot;I didn&#39;t realize that many television characters are created first as<br/>\nmerchandise, and then they go about creating a &#39;show&#39; (or movie, etc) to<br/>\nadvertise that character in order to make the merchandise sell&quot;<br/>\n<br/>\nWhat!!!! I don&#39;t believe it either. How inefficient and cost-ineffective if<br/>\nanyone actually does it!!! I mean, look at the investment and risk. You<br/>\ncreate a character for a merchandise, create a show, and if that show flops<br/>\nbadly.....? Where is your advertising money?<br/>\n<br/>\nA niece once advised me not to use airtel (a phone network), because she<br/>\nthinks their show &#39;airtel crazy kiya re&quot; sucks (it doesn&#39;t actually, but it<br/>\nwas a show first and got the sponsorship later anyway)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Jan 25, 2010 at 8:31 AM, NCMama &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dharmamama1@...\">dharmamama1@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-I didn&#39;t realize that many television characters are created first as<br/>\n&gt; merchandise, and then they go about creating a &#39;show&#39; (or movie, etc) to<br/>\n&gt; advertise that character in order to make the merchandise sell (as opposed<br/>\n&gt; to Sesame Street where the show was first created and then, as Sandra said,<br/>\n&gt; the merchandise came later).-=-<br/>\n&gt;<br/>\n&gt; Both of my guys, who have had free reign of television and video games for<br/>\n&gt; years now, are very perceptive when it comes to that. They *know* when<br/>\n&gt; something was created just to sell merchandise, as opposed to having an<br/>\n&gt; engaging or funny story to tell. If the story&#39;s good enough, they don&#39;t<br/>\n&gt; really care, but if it isn&#39;t, they get annoyed. This isn&#39;t something I<br/>\n&gt; presented to them or ever brought up. They know because they have have the<br/>\n&gt; experience of seeing good shows and bad shows. They can make connections<br/>\n&gt; between the movies they see, and the ads they see. They didn&#39;t particularly<br/>\n&gt; care for the new Transformer movie, and my youngest said, &quot;Well, it was just<br/>\n&gt; one long commercial for transformers. And not a good one!&quot;<br/>\n&gt;<br/>\n&gt; My youngest, especially, will get offended if he senses there&#39;s a lot of<br/>\n&gt; &quot;educational&quot; content added to something. When he was quite young, he<br/>\n&gt; stopped watching a PBS show, because &quot;they changed it to educational! It<br/>\n&gt; used to be good, now they&#39;re trying to teach me something!&quot; (I think it was<br/>\n&gt; Dragon Tales, but I can&#39;t remember.) I had never expressed frustration or<br/>\n&gt; disdain at educational content, this was his own thing, he could see and<br/>\n&gt; hear how the show had changed to add counting and spelling, when that hadn&#39;t<br/>\n&gt; been a part of the show before. He does NOT like to be manipulated at all,<br/>\n&gt; and I think he felt manipulated by characters who used to act naturally<br/>\n&gt; (well, as naturally as a cartoon dragon would act!), suddenly counting<br/>\n&gt; things for no good reason.<br/>\n&gt;<br/>\n&gt; Kids are a lot smarter and aware than that documentary maker gives them<br/>\n&gt; credit for.<br/>\n&gt;<br/>\n&gt; Caren<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: TV issue: Consumer kids and Corporation documentaries","postDate":"1264401592","msgId":50001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqamVibytkazVwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":49995,"nextInTopic":50008,"prevInTime":50000,"nextInTime":50002,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"... That s why my kids and I laugh (and have for years now--kids 11 and 14) at what are sometimes thoroughly transparent attempts to make toys look so enticing","messageBody":"<div id=\"ygrps-yiv-1739112803\"><blockquote><span title=\"ireply\">&gt; We don&#39;t necessarily think that, when you see a 30 sec commercial, there<br/>\n&gt; were meetings, people with MBA&#39;s and psychologists giving inputs, tests or<br/>\n&gt; different options, and the one chosen to be aired was probably the one that<br/>\n&gt; made the kid blink less, meaning that it hooked him up more effectively.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>That&#39;s why my kids and I laugh (and have for years now--kids 11 and 14) at what are sometimes thoroughly transparent attempts to make toys look so enticing and fun!  And when they come to me wanting me to see a commercial, we look critically at the toy and decide, sometimes with a little googling, whether it will be a toy worth the money and trouble to buy.  <br/>\n<br/>\nAnd they have had experience with buying some of the toys that looked so fun in the ad but end up being cheap and breakable, causing disappointment.  I could have said no, to protect them from from the marketing, but the real life experience actually meant something to them.<br/>\n<br/>\nCome on--really--your children can&#39;t really be so much more stupid than mine, or anyone else&#39;s on this list!  lol<br/>\n<br/>\nAnd my kids have also really enjoyed toys that have obvious marketing AND been aware of the marketing at the same time.  We&#39;ve talked about how toys like My Little Pony and Pokemon are made to be so collectible, but they have also met the desire for my daughter to collect, and we&#39;ve happily ebayed to find particular models, etc.  And I&#39;ve shared in her enjoyment and attraction.  Especially when it comes to the ponies--I&#39;m still a horsey girl at heart!<br/>\n<br/>\nThey can&#39;t learn discrimination unless they are allowed to discriminate.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":370007365,"authorName":"meadowgirl11","from":"&quot;meadowgirl11&quot; &lt;tamithameadow@...&gt;","profile":"meadowgirl11","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: TV issue: Consumer kids and Corporation documentaries","postDate":"1264400038","msgId":50012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqamNyNitmcG5pQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50011,"nextInTopic":50013,"prevInTime":50011,"nextInTime":50013,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"So, I think that TV ( the problem is not the TV itself but the marketing strategy behind it ) manipulates children to buy their products and get them addicted","messageBody":"<div id=\"ygrps-yiv-976107150\">So, I think that TV ( the<br/>\nproblem is not the TV itself but the marketing strategy behind it )<br/>\nmanipulates children to buy their products and get them addicted to<br/>\nthat..&lt;&lt;<br/>\n<br/>\n<br/>\nI just want to say that my son, who watches quite a bit of television has never, I mean not ONCE, asked me to buy him something he has seen on TV. If he did, that would be fine too, but the fact is, he isn&#39;t interested in the junk of the day they show on TV. He has very specific wants and needs like lego and video games, but other than that, he asks for very little. We have talked about marketing, but he just rolls his eyes and tells me he knows all that. Our kids are growing up absolutely surrounded my marketing, it would be amazing if they didn&#39;t become smart consumers. He usually doesn&#39;t even watch TV, he finds the things he wants to watch streaming online so he can watch when he wants, how he wants. <br/>\n<br/>\nIf you are interested in documentaries, how about one this one? <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.usnowfilm.com/\">http://www.usnowfilm.com/</a><br/>\nIt takes a positive look at the ways information and technology are transforming our world.</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation  documentaries","postDate":"1264396868","msgId":49995,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3NDNFRkY3MUZCNjQzQTdBQjZERkE1RDk0REMzQkVEQExZTEFMQVAyPg==","inReplyToHeader":"PDQwNjUyMS4yNDM2My5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPiAgPGhqaWF0MStsYmsyQGVHcm91cHMuY29tPiA8MWJlMDQ3ZjAxMDAxMjQxNDAweTUyNjY2ZWZ1ZTY0NzU2YTljZmY3MzNiM0BtYWlsLmdtYWlsLmNvbT4gPDQwNjUyMS4yNDM2My5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49994,"nextInTopic":50001,"prevInTime":49994,"nextInTime":49996,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"************* I can t even begin to tell you how many parents hate and dismiss Pokemon. Yet, after all these years, my own daughter, the lover of all things","messageBody":"<div id=\"ygrps-yiv-1687466914\">*************<br/>\nI can&#39;t even begin to tell you how many parents hate and dismiss Pokemon. Yet, after all these years, my own daughter, the lover of all things Pokemon, still plays it and has been into Pokemon for about 12 yrs. All those people who fear Pokemon, are using the same fear and judgement that you have used on Disney. Why? Is it really evil and terrible, so terrible that children must be safe guarded against it?<br/>\n**************<br/>\n<br/>\nand that&#39;s jusst jenny&#39;s daughter.  my son&#39;s experience refutes that fear based thought process in a totally different way.  he  was totally captivated at age 6, 7 by the things he saw advertised, and the things other kids had - bionicles, pokemon, etc.  he&#39;d buy them, play with them, want more. etc.  and then he was done.<br/>\n<br/>\nand at about age 9, he felt truly done with most &quot;kid&quot; oriented toys and moved on to other stuff - stuff not advertised - interesting  board games, books, crafts and projects, activities.  his room is devoid of toys now and he doen&#39;t miss them at all - he gave them all away!  &quot;they&quot; certainly didn&#39;t &quot;get him for life&quot;.  in fact now he has a much better sense of which things he sees advertised are likely to be actually pretty cool and which things will break quickly, or not be as fun or cool as they are made to seem in the ads<br/>\n<br/>\nmy daughter watched disney and other  commercial tv from very very young and NEVER wanted all the product lines.  she was into barbie for about 2 months - and not even THAT into it.  she loved to dress up, paint her whole body, and socialize with  everyone - she was all about relationships and didn&#39;t even care if other kids grabbed toys from her as long  as they&#39;d interact.  &quot;they&quot; didn&#39;t &quot;get her for life&quot; either - or at all, really.<br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation  documentaries","postDate":"1264396217","msgId":49994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNjUyMS4yNDM2My5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPiAgPGhqaWF0MStsYmsyQGVHcm91cHMuY29tPiA8MWJlMDQ3ZjAxMDAxMjQxNDAweTUyNjY2ZWZ1ZTY0NzU2YTljZmY3MzNiM0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49993,"nextInTopic":49995,"prevInTime":49993,"nextInTime":49995,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"***However, I missed you addressing how unfair game can be between parents and corporations on what gets into the mind of our kids.*** I m not the keeper of my","messageBody":"<div id=\"ygrps-yiv-1841523343\">***However, I missed you addressing how unfair game can be between parents and<br/>\ncorporations on what gets into the mind of our kids.***<br/>\n<br/>\nI&#39;m not the keeper of my child&#39;s minds anymore than I&#39;m the keeper of their vaginas, as in, one day they do what they want with each of those things, if not already doing what they want with each of those things.  I don&#39;t make assumptions about what does or does not get into their minds.  I offer them fun and interesting things to look at and be around and absorb in their own ways.<br/>\n<br/>\n*** How soon will an empowered kid be mature enough to be immune<br/>\nto those ads? Certainly your family that knows the insides of creating and<br/>\nadd can discuss, have fun, and therefore be less susceptible to that. This<br/>\nis probably not the case for the majority of the people.***<br/>\n<br/>\nSee that&#39;s the difference I think... I can say with absolute certainty that I&#39;m not looking to immunize my kids to the world.  Instead, I&#39;d like to expose them to as much of it as humanly possible, with openness and acceptance, and discuss and learn together.<br/>\n<br/>\n***We don&#39;t necessarily think that, when you see a 30 sec commercial, there<br/>\nwere meetings, people with MBA&#39;s and psychologists giving inputs, tests or<br/>\ndifferent options, and the one chosen to be aired was probably the one that<br/>\nmade the kid blink less, meaning that it hooked him up more effectively.***<br/>\n<br/>\nThis is very conspiracy theory-ish!  Yet does it work?  Really?  If all that effort was being put into it, then why do the commercials need repeated and need to be redone and revamped and reworked?  If it really were that easy to brainwash a population, Brain, from Pinky and the Brain, would&#39;ve certainly found a way to do it!  Or some other person in seek of world domination...<br/>\n<br/>\n***We are not necessarily aware that the cheapest toys in Walt Mart are the<br/>\nones with character figures. &quot;You get into the kids minds, you get them for<br/>\nlife&quot; (quoted from the documentary) . Makes sense to me!***<br/>\n<br/>\nHmmmm, if you mean memories created, then sure.  Sometimes when I get all caught up in what I&#39;m doing, the living life stuff, I stop and remind myself that part of my job here is creating memories for my children to live the rest of their life with.  What kind of memories do I want to help create?  I can guarantee that no single commercial with have more impact than what I create with my mom super powers!<br/>\n<br/>\n***For now, my option has been to not to expose my daughter to TV adds or<br/>\nanything &quot;Disney like&quot;. I know she will be exposed one day, and I hope she<br/>\nwill be by then empowered to look with the same criticism that I look today.***<br/>\n<br/>\nThis is the kind of thinking that leads folks to make websites like this one:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.cesnur.org/testi/pokemon.htm\">http://www.cesnur.org/testi/pokemon.htm</a><br/>\n<br/>\nI can&#39;t even begin to tell you how many parents hate and dismiss Pokemon.  Yet, after all these years, my own daughter, the lover of all things Pokemon, still plays it and has been into Pokemon for about 12 yrs.  All those people who fear Pokemon, are using the same fear and judgement that you have used on Disney.  Why?  Is it really evil and terrible, so terrible that children must be safe guarded against it?<br/>\n<br/>\nAre children not bright enough to make their own decisions on whether or not they like something?  I can&#39;t even imagine what my daughter&#39;s world would be like if I&#39;d banned Pokemon!  What if I&#39;d banned Harry Potter?  We knew families that did.  Why ban things?  Why not live peacefully in the world and acknowledge the world and all it has to offer?  Why let something become so big and powerful, that it&#39;s bigger and more powerful than your child?<br/>\n<br/>\nAnd just for the thought... your option is one of many that you are choosing.  What I&#39;ve found to be true, is what makes unschooling special, is to be looking for and choosing the option that is most happy and peaceful making.  If by eliminating something, it causes great peace and happiness, then sure do that, but if it&#39;s not the most peaceful and happy thing, then find another option.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation  documentaries","postDate":"1264396076","msgId":49993,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2MUVDQ0EzLUQ2RTAtNDAxNi1BQjBDLTcxM0VDRjAzODczQ0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPiA8aGppYXQxK2xiazJAZUdyb3Vwcy5jb20+IDwxYmUwNDdmMDEwMDEyNDE0MDB5NTI2NjZlZnVlNjQ3NTZhOWNmZjczM2IzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49991,"nextInTopic":49994,"prevInTime":49992,"nextInTime":49994,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"... I think there s danger is hoping that children will look at the world with the same critical eye as their parents do. A parent can model looking critically","messageBody":"<div id=\"ygrps-yiv-810376802\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; For now, my option has been to not to expose my daughter to TV adds or<br/>\n&gt; anything &quot;Disney like&quot;. I know she will be exposed one day, and I  <br/>\n&gt; hope she<br/>\n&gt; will be by then empowered to look with the same criticism that I  <br/>\n&gt; look today.<br/>\n<br/>\n </span></blockquote>I think there&#39;s danger is hoping that children will look at the world  <br/>\nwith the same critical eye as their parents do.<br/>\n<br/>\nA parent can model looking critically at the world, but wanting a  <br/>\nchild to see the world in the same way is to cloud his own view of  <br/>\nlife. What if a child fell deeply in love with everything Disney -  <br/>\nmovies, toys, dress-up clothes, etc.?  If the parent couldn&#39;t get past  <br/>\nher judgment of Disney to fully embrace what her kid loves, how would  <br/>\nthat be good? What would it tell a child about his mom? Maybe that  <br/>\nsticking it to the &quot;corporation&quot; is more important than his happiness.<br/>\n<br/>\nEmpowerment doesn&#39;t mean that kids should think like we do. It means  <br/>\nthey will be able to think for themselves.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337025893,"authorName":"Cinira Longuinho","from":"Cinira Longuinho &lt;ciniravlonguinho@...&gt;","profile":"ciniravlonguinho","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:TV issue: Consumer kids and Corporation \tdocumentaries","postDate":"1264394194","msgId":49991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFiZTA0N2YwMTAwMTI0MjAzNm40MzhjYjZmYXVhNjExMGNiMjRhMTU1YjI0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDRFOEMyQjM5LUIyRjEtNDVGQy1BNTgwLTEzNkFGM0U4OTI2QkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDRCNUNGOTA4LjgwNzA1MDhAeWFob28uY2E+CSA8NEU4QzJCMzktQjJGMS00NUZDLUE1ODAtMTM2QUYzRTg5MjZCQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":49989,"nextInTopic":49993,"prevInTime":49990,"nextInTime":49992,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"====you ll all use a computer and some electricity to get to them, so breathe and relax if possible.==== Great comment, Sandra. I am here laughing. ... C. ... ","messageBody":"<div id=\"ygrps-yiv-1293679130\">====you&#39;ll all use a computer and some electricity to get to them, so<br/>\nbreathe and relax if possible.====<br/>\n<br/>\nGreat comment, Sandra.<br/>\nI am here laughing.<br/>\n<br/>\n :)<br/>\n<br/>\nC.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jan 24, 2010 at 9:29 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=Its not like the information is NEW. Its in the newspapers, on the<br/>\n&gt;<br/>\n&gt; internet, in books, the library, etc.... its just that someone put it<br/>\n&gt; together into a cohesive argument to show a complete picture, which<br/>\n&gt; makes it easier for someone like me to digest, but in order to make that<br/>\n&gt; picture, facts are skewed, presented not quite right, and it leaves a<br/>\n&gt; person scared.-=-<br/>\n&gt;<br/>\n&gt; I&#39;m glad you said &quot;...to show a complete picture.&quot;<br/>\n&gt;<br/>\n&gt; Some people, though, think it shows &quot;THE&quot; complete picture. And other<br/>\n&gt; people don&#39;t know what the difference would be.<br/>\n&gt;<br/>\n&gt; For helping people understand unschooling, I think these things are a<br/>\n&gt; hundred times more important than anything and everything concerning<br/>\n&gt; corporations, and you&#39;ll all use a computer and some electricity to<br/>\n&gt; get to them, so breathe and relax if possible.<br/>\n&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wonder\">http://sandradodd.com/wonder</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joy\">http://sandradodd.com/joy</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/whatif\">http://sandradodd.com/t/whatif</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re:TV issue: Consumer kids and Corporation documentaries","postDate":"1264388493","msgId":49989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqajFpZCt1Ymc3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCNUNGOTA4LjgwNzA1MDhAeWFob28uY2E+"},"prevInTopic":49986,"nextInTopic":49991,"prevInTime":49988,"nextInTime":49990,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"-=-I didn t realize that many television characters are created first as merchandise, and then they go about creating a show (or movie, etc) to advertise","messageBody":"<div id=\"ygrps-yiv-109953978\">-=-I didn&#39;t realize that many television characters are created first as merchandise, and then they go about creating a &#39;show&#39; (or movie, etc) to advertise that character in order to make the merchandise sell (as opposed to Sesame Street where the show was first created and then, as Sandra said, the merchandise came later).-=-<br/>\n<br/>\nBoth of my guys, who have had free reign of television and video games for years now, are very perceptive when it comes to that. They *know* when something was created just to sell merchandise, as opposed to having an engaging or funny story to tell. If the story&#39;s good enough, they don&#39;t really care, but if it isn&#39;t, they get annoyed. This isn&#39;t something I presented to them or ever brought up. They know because they have have the experience of seeing good shows and bad shows. They can make connections between the movies they see, and the ads they see. They didn&#39;t particularly care for the new Transformer movie, and my youngest said, &quot;Well, it was just one long commercial for transformers. And not a good one!&quot;<br/>\n<br/>\nMy youngest, especially, will get offended if he senses there&#39;s a lot of &quot;educational&quot; content added to something. When he was quite young, he stopped watching a PBS show, because &quot;they changed it to educational! It used to be good, now they&#39;re trying to teach me something!&quot; (I think it was Dragon Tales, but I can&#39;t remember.) I had never expressed frustration or disdain at educational content, this was his own thing, he could see and hear how the show had changed to add counting and spelling, when that hadn&#39;t been a part of the show before. He does NOT like to be manipulated at all, and I think he felt manipulated by characters who used to act naturally (well, as naturally as a cartoon dragon would act!), suddenly counting things for no good reason.<br/>\n<br/>\nKids are a lot smarter and aware than that documentary maker gives them credit for.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re:TV issue: Consumer kids and Corporation documentaries","postDate":"1264386572","msgId":49986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFOEMyQjM5LUIyRjEtNDVGQy1BNTgwLTEzNkFGM0U4OTI2QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCNUNGOTA4LjgwNzA1MDhAeWFob28uY2E+","referencesHeader":"PDRCNUNGOTA4LjgwNzA1MDhAeWFob28uY2E+"},"prevInTopic":49985,"nextInTopic":49989,"prevInTime":49985,"nextInTime":49987,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"-=Its not like the information is NEW. Its in the newspapers, on the internet, in books, the library, etc.... its just that someone put it together into a","messageBody":"<div id=\"ygrps-yiv-803317644\">-=Its not like the information is NEW. Its in the newspapers, on the<br/>\ninternet, in books, the library, etc.... its just that someone put it<br/>\ntogether into a cohesive argument to show a complete picture, which<br/>\nmakes it easier for someone like me to digest, but in order to make that<br/>\npicture, facts are skewed, presented not quite right, and it leaves a<br/>\nperson scared.-=-<br/>\n<br/>\nI&#39;m glad you said &quot;...to show a complete picture.&quot;<br/>\n<br/>\nSome people, though, think it shows &quot;THE&quot; complete picture. And other  <br/>\npeople don&#39;t know what the difference would be.<br/>\n<br/>\nFor helping people understand unschooling, I think these things are a  <br/>\nhundred times more important than anything and everything concerning  <br/>\ncorporations, and you&#39;ll all use a computer and some electricity to  <br/>\nget to them, so breathe and relax if possible.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wonder\">http://sandradodd.com/wonder</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joy\">http://sandradodd.com/joy</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/balance\">http://sandradodd.com/balance</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choice\">http://sandradodd.com/choice</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/t/whatif\">http://sandradodd.com/t/whatif</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":251210887,"authorName":"Shira Rocklin","from":"Shira Rocklin &lt;shirarocklin@...&gt;","profile":"shirarocklin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re:TV issue: Consumer kids and Corporation documentaries","postDate":"1264384264","msgId":49985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNUNGOTA4LjgwNzA1MDhAeWFob28uY2E+"},"prevInTopic":49982,"nextInTopic":49986,"prevInTime":49984,"nextInTime":49986,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"I ve seen both those documentaries when I was doing my Bachelor of Environmental Studies several years ago.  They were very interesting, very eye-opening,","messageBody":"<div id=\"ygrps-yiv-8181270\">I&#39;ve seen both those documentaries when I was doing my Bachelor of <br/>\nEnvironmental Studies several years ago.  They were very interesting, <br/>\nvery eye-opening, about the intents of corporations, advertising, etc.  <br/>\nCall me naive, but that really was the first time I encountered many of <br/>\nthose ideas.  It was very interesting to learn about how they market <br/>\nthings the way they do, and why.  And in some ways, it was scare tactics <br/>\nand threatening.  In other ways, I don&#39;t think it was.  It was more <br/>\nabout bringing information to the front that not everyone thinks about, <br/>\nor realizes.  I didn&#39;t realize that many television characters are <br/>\ncreated first as merchandise, and then they go about creating a &#39;show&#39; <br/>\n(or movie, etc) to advertise that character in order to make the <br/>\nmerchandise sell (as opposed to Sesame Street where the show was first <br/>\ncreated and then, as Sandra said, the merchandise came later).  <br/>\n<br/>\nAnd I think its useful to know these things... in the same way that its <br/>\nuseful to know that old paint, and old toys, and old dishes (and some <br/>\nnew toys and dishes), might contain lead.  Lead is dangerous, especially <br/>\nfor children.  Its not a scare tactic, its a fact.  Should we run around <br/>\nlooking for lead?  No... be aware, get some lead test kits (someone gave <br/>\nus dishes that turned up with lead, we were just testing randomly with <br/>\nan extra test we had left over), maybe test old toys found in <br/>\ngrandparent&#39;s attics... but be overly worried?  Probably not worth the <br/>\neffort.  Caution is good, I think.  Laws about toys and lead, industry <br/>\nstandards, having choices like lovingly handmade toys by cottage <br/>\nindustries - those are all good things.<br/>\n<br/>\nBut the real threat from all these things is in not having parents <br/>\naround, paying attention, spending time together, and helping their <br/>\nchildren when they need it.  A gun isn&#39;t so much of a threat when its <br/>\nlocked up, when children are educated about it, allowed to see and hold <br/>\nit in safe ways (at least, thats what I imagine, I haven&#39;t one out and <br/>\nresearched it right this minute).  Lead isn&#39;t such a threat, once we <br/>\nknow about it, and take some measures to limit it.  The real threat is <br/>\nwhen parents don&#39;t care, aren&#39;t there with their children experiencing <br/>\nthe advertising, the shows, the messages, and helping their children <br/>\nnavigate the hidden meanings, the propaganda, the messages about body <br/>\nimage, the next greatest toy, branding, psychology, to see what it <br/>\nreally means to them. <br/>\n<br/>\nIts not like the information is NEW.  Its in the newspapers, on the <br/>\ninternet, in books, the library, etc.... its  just that someone put it <br/>\ntogether into a cohesive argument to show a complete picture, which <br/>\nmakes it easier for someone like me to digest, but in order to make that <br/>\npicture, facts are skewed, presented not quite right, and it leaves a <br/>\nperson scared.  I get the same feelings after reading books about <br/>\nconventional food systems.  I can barely bring myself to buy any food at <br/>\nthe grocery store after reading some and knowing how they got there.  <br/>\nBut the threat is huge, the impact of buying one apple, eating this way <br/>\nfor another year or years until we can afford some better alternatives, <br/>\nis not so huge.<br/>\n<br/>\nShira</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] TV issue: Consumer kids and Corporation documentaries","postDate":"1264377988","msgId":49982,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJBQUQwNTlDLUQzMTAtNDM3MC1CMUQ4LUNFRDJCODY1MjczOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk1ODI4My41MjUzMi5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPiA8OTU4MjgzLjUyNTMyLnFtQHdlYjExMDQwNC5tYWlsLmdxMS55YWhvby5jb20+"},"prevInTopic":49981,"nextInTopic":49985,"prevInTime":49981,"nextInTime":49983,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"-=- I think South Park does a great job at explaining how I feel about people who get all upset about big bad corporations and then pass it on to kids.-=- ","messageBody":"<div id=\"ygrps-yiv-1995013450\">-=- I think South Park does a great job at explaining how I feel about  <br/>\npeople who get all upset about &quot;big bad corporations&quot; and then pass it  <br/>\non to kids.-=-<br/>\n<br/>\nBut I bet South Park is a corporation, so... :-)<br/>\n<br/>\nMy husband works for a corporation:  Honeywell.<br/>\n<br/>\nMy computer came from a corporation:  Apple<br/>\nThat documentary about corporations?  Probably created by a  <br/>\ncorporation (maybe a small temporary one, but still...) using camera  <br/>\nequipment and electricity and employees all hired from or created by  <br/>\none or another incorporated union or business.<br/>\n<br/>\nProbably the more furiously (and vaguely) angry about &quot;corporations&quot; a  <br/>\nperson is, the less likely he or she would be to explain in plain  <br/>\nEnglish what &quot;a corporation&quot; is.  I&#39;ve been looking into creating a  <br/>\nnon-profit corporation to maintain unschooling.info so that people  <br/>\ncould donate money and an investment could be made to provide ongoing  <br/>\nfunds to keep the site paid for rather than me doing it myself.  That  <br/>\nwould be a corporation.  We&#39;d need three board members, and meetings  <br/>\nwith minutes, and a bank account.   OOOOOOhhhhh..... evil corporation.<br/>\n<br/>\n-=Corporations aren&#39;t evil, they are doing what they do, make money,  <br/>\nselling things and ideas that people sometimes really DO want.-=-<br/>\n<br/>\nOr to give away something people want or need.  In the case of  <br/>\nunschooling.info, I would like for it to be self-sustaining so that it  <br/>\nwon&#39;t disappear again, and so I don&#39;t end up paying for it myself  <br/>\nevery year forevermore. If it could survive all of us and be a  <br/>\nrepository of unschooling information for years to come, that seems  <br/>\nlike a good idea.  Maybe it could even provide grants for projects or  <br/>\nresearch someday.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation  documentaries","postDate":"1264377455","msgId":49981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI1Njc0OS4yMTQxMS5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PEIwMEQ3N0Q2LUREQTYtNEVGQy1COUFGLUU4M0E1RTY2Q0VBREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPiA8aGppYXQxK2xiazJAZUdyb3Vwcy5jb20+IDwxYmUwNDdmMDEwMDEyNDE0MDB5NTI2NjZlZnVlNjQ3NTZhOWNmZjczM2IzQG1haWwuZ21haWwuY29tPiA8QjAwRDc3RDYtRERBNi00RUZDLUI5QUYtRTgzQTVFNjZDRUFEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":49978,"nextInTopic":49982,"prevInTime":49980,"nextInTime":49982,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"Not every single commercial is designed by psychologist with tests. All the energy you ve put toward being alarmed could have been much better put toward","messageBody":"<div id=\"ygrps-yiv-198942143\">&quot;Not every single commercial is designed by psychologist with tests. <br/>\nAll the energy you&#39;ve put toward being alarmed could have been much <br/>\nbetter put toward being gently at peace with your child.&quot;<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nThat is true. Those documentaries are the ones milleading parents and making them so fearful.<br/>\nI loved the Hulu commercial about the aliens taking over the world with the TV making peoples brain into mush.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Fairy tales  (was TV, and corporations, and other fears)","postDate":"1264377163","msgId":49978,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY2OUFBQzY0LTNGREUtNDRDMS1BOUU4LUEwQjgzNzcxMEFFN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPiA8aGppYXQxK2xiazJAZUdyb3Vwcy5jb20+IDwxYmUwNDdmMDEwMDEyNDE0MDB5NTI2NjZlZnVlNjQ3NTZhOWNmZjczM2IzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49977,"nextInTopic":49981,"prevInTime":49977,"nextInTime":49979,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"-=- It was so sad to see that he does not even get that Snow White can be different from one person to another, it just depend on each one imagination....","messageBody":"<div id=\"ygrps-yiv-685093092\">-=- It was so sad to see that he does not even get that Snow White can  <br/>\nbe<br/>\ndifferent from one person to another, it just depend on each one<br/>\nimagination.... Well, at least Disney is now (in 2009) starting to  <br/>\ncreate<br/>\nprincesses with dark colour...-=-<br/>\n<br/>\nI&#39;ve been interested in folktales and fairy tales since I was  <br/>\nlittle.   Since I was nine, I specifically started to seek out other  <br/>\nversions and I&#39;ve never lost that interest.<br/>\n<br/>\nOne thing about Snow White is that she&#39;s always described as having  <br/>\nblack hair and white skin and red lips.  I don&#39;t think they would have  <br/>\ncalled her &quot;Snow White&quot; otherwise.  And in a lot of the versions it  <br/>\nstarts off with her mother pricking her own finger while doing  <br/>\nembroidery, and a drop of the blood getting on the white cloth, in a  <br/>\nblack embroidery hoop, or with a black window frame, or something, and  <br/>\nthe mother saying she hopes someday to have a child with those colors-- <br/>\nwhite, and black and red.<br/>\n<br/>\nDisney didn&#39;t make that up.  Maybe various German storytellers made it  <br/>\nup hundreds of years ago.  Maybe those are versions of a really old  <br/>\nstory pre-Germany, pre-France.<br/>\n<br/>\nWhat I do know is that it&#39;s not worth getting upset about in 2010.<br/>\n<br/>\nSome people are much against &quot;Disney Movies,&quot; as though they are a  <br/>\nmonolithic set of sameness, but they&#39;re all in favor of fairy tale  <br/>\nbooks with illustrations.  That&#39;s pretty hypocritical.  Any artist who  <br/>\nhas ever painted Tom Sawyer or Long John Silver or Robin Hood decided  <br/>\non the clothes and the eyes and the facial expressions, the height,  <br/>\nthe posture...<br/>\n<br/>\nFear can be almost a comfort.  People can enjoy feeling self-righteous  <br/>\nand feeling that only they can save their children from the dangers of  <br/>\nthe world.  But who will save their children from the fearful emotions  <br/>\nof the mother?<br/>\n<br/>\n-=-Back to the topic: it seems there was a big debate in the 80&#39;s in  <br/>\nthe about<br/>\nlaws regarding safety of toys, and also advertisement to kids. This is  <br/>\nshown<br/>\nin the documentary. Well, the result is that there are laws about toys<br/>\nsafety, but advertisers are free to do whatever they want !-=-<br/>\n<br/>\nThis isn&#39;t about unschooling, is it?  It&#39;s about indignation.  Let  <br/>\nchildless people be indignant and huffy and angry about things that  <br/>\nhappened 30 years ago.  People with young children need to be present  <br/>\nand calm and sweet, now, today.<br/>\n<br/>\n-=-Finally, I would like to say I don&#39;t want to scare anyone... I do  <br/>\nlook at<br/>\nthis with criticism, and I see how the documentary film makes use the  <br/>\nsame<br/>\nmarketing tactics to be effective. However, I choose to give them the  <br/>\nsame<br/>\nattention that I give to others, and that is why I brought this to the<br/>\nforum.-=-<br/>\n<br/>\nIf you were giving that much attention to your child, you wouldn&#39;t  <br/>\nhave time to watch that documentary and write all this up.<br/>\nYou&#39;re not scaring me except with the thought of how much energy and  <br/>\nbiochemical angst you&#39;re wasting on it.<br/>\n<br/>\nMy children grew up in peace, were not hurt by advertisements or by  <br/>\nplastic toys (Kirby loved Teenage Mutant Ninja Turtles in a big way,  <br/>\nand Holly just today bought some 1980&#39;s My Little Ponies at a thrift  <br/>\nstore).  I didn&#39;t live in fear; I lived in love.  My children were  <br/>\nloved and they are now loving.  They&#39;re kind, they&#39;re considerate,  <br/>\nthey&#39;re generous with their money when they have it, but also careful  <br/>\nwith it, and they are grateful for financial assistance when they need  <br/>\nit.<br/>\n<br/>\nUnschooling has not ruined anyone I&#39;ve ever seen.  Failure to try to  <br/>\ncalm down enough to understand unschooling, I think leads to school  <br/>\nand schooling.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] TV issue: Consumer kids and Corporation documentaries","postDate":"1264376889","msgId":49977,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1ODI4My41MjUzMi5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49976,"nextInTopic":49978,"prevInTime":49976,"nextInTime":49978,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"***Drawing on the insights of health care professionals, children s advocates, and industry insiders, the film focuses on the explosive growth of child","messageBody":"<div id=\"ygrps-yiv-667386376\">***Drawing on the<br/>\ninsights of health care professionals, children&#39;s advocates, and industry<br/>\ninsiders, the film focuses on the explosive growth of child marketing in the<br/>\nwake of deregulation, showing how youth marketers have used the latest<br/>\nadvances in psychology, anthropology, and neuroscience to transform American<br/>\nchildren into one of the most powerful and profitable consumer demographics<br/>\nin the world. Consuming Kids pushes back against the wholesale<br/>\ncommercialization of childhood, raising urgent questions about the ethics of<br/>\nchildren&#39;s marketing and its impact on the health and well-being of kids&quot;***<br/>\n<br/>\nSchools are the biggest mass marketing scheme out there.  Billions of dollars are spent on marketing school to children and their parents.  So what if it&#39;s government sanctioned tax dollars, it&#39;s still marketed as necessary.  Every time, in the US, please excuse this in other places where this isn&#39;t relevant, that a tax increase tries to go through locally, the most common reason for those taxes being needed is for the sake of the children&#39;s educational well being and therefore the future of our children&#39;s well being.  That&#39;s mass marketing.  That&#39;s my opinion on the matter.<br/>\n<br/>\nWhile in school, children are told that they are there to learn and become great thinkers, but are then told what to think, what not to think, what way is right or wrong to think, and that other people know better when they need to eat and use the toilet.  Kids in school get told 2 very different messages, in words and actions.  Commercialism employs the same tactics, telling people what to think.  <br/>\n<br/>\nWho is more susceptible?  Kids in school or kids out of school?  My experience, and I&#39;m going to generalize here, because not all kids fall into that non-critical thinking trap, is that kids in school give up thinking critically and look to others for answers and are willing to accept them, while I see unschooled kids look for answers within themselves and everywhere around them and question everything they see and hear.<br/>\n<br/>\n***These documentaries show the corporations. .. something part of the modern<br/>\nworld and the lack of responsibility in their actions to society, their goal<br/>\nis profit... A corporation that wants to sell toys will do everything<br/>\npossible to sell more and more toys, doing commercials and programs with the<br/>\nsole purpose of selling more and more toys... ***<br/>\n<br/>\nWhile I tend to agree with this, I&#39;ll play devil&#39;s advocate for a minute here...<br/>\nCorporations also give huge amounts of money to charitable organizations around the world.  They also provide jobs and income to places around the world that need it.  Not that I necessarily think sweat shops are great jobs, or in fact necessary, but in places that war has torn them apart, or political unrest, or other natural disasters, rebuilding is difficult.  Corporations are just a larger part of the system in the world of bringing technology and other &quot;advances&quot; to places that don&#39;t have them.  There are certainly many things that don&#39;t work well within that system.  Corporations aren&#39;t evil, they are doing what they do, make money, selling things and ideas that people sometimes really DO want.<br/>\n<br/>\nGreed is what causes evil and it happens everywhere all over the world in all cultures, in all humans.  Anyway, that&#39;s my simplistic view of the world and the systems that are in it.  I think South Park does a great job at explaining how I feel about people who get all upset about &quot;big bad corporations&quot; and then pass it on to kids.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.southparkstudios.com/clips/154822\">http://www.southparkstudios.com/clips/154822</a><br/>\n<br/>\n....I don&#39;t necessarily believe in everything South Park does either... that&#39;s my disclaimer.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation  documentaries","postDate":"1264376541","msgId":49976,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIwMEQ3N0Q2LUREQTYtNEVGQy1COUFGLUU4M0E1RTY2Q0VBREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPiA8aGppYXQxK2xiazJAZUdyb3Vwcy5jb20+IDwxYmUwNDdmMDEwMDEyNDE0MDB5NTI2NjZlZnVlNjQ3NTZhOWNmZjczM2IzQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49975,"nextInTopic":49977,"prevInTime":49975,"nextInTime":49977,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"-=-However, I missed you addressing how unfair game can be between parents and corporations on what gets into the mind of our kids.-=- Please rephrase the","messageBody":"<div id=\"ygrps-yiv-1270081407\">-=-However, I missed you addressing how unfair game can be between  <br/>\nparents and<br/>\ncorporations on what gets into the mind of our kids.-=-<br/>\n<br/>\nPlease rephrase the question.  I don&#39;t understand this.<br/>\n<br/>\n-=-Brian said: [[[[[Maybe for kids that are not unschooled and not<br/>\nempowered]]]]]. How soon will an empowered kid be mature enough to be  <br/>\nimmune<br/>\nto those ads? Certainly your family that knows the insides of creating  <br/>\nand<br/>\nadd can discuss, have fun, and therefore be less susceptible to that.  <br/>\nThis<br/>\nis probably not the case for the majority of the people.<br/>\n<br/>\n-=- How soon will an empowered kid be mature enough to be immune<br/>\nto those ads? -=-<br/>\n<br/>\nI don&#39;t understand that either.<br/>\n<br/>\nThe maturity and empowerment are in contrast to kids who are  <br/>\ntraditionally parented and needy and who go to school and want more of  <br/>\nwhat their friends might have, or want their parents to prove their  <br/>\nlove and attentiveness by buying them things.&#92;<br/>\n<br/>\nThose situations are rarer with unschooling, it seems.   It&#39;s not  <br/>\nabout first empowering a  child and then deciding when he&#39;s &quot;mature&quot;  <br/>\nenough.  &quot;Immune&quot;?  As though it&#39;s an infectious disease?<br/>\n<br/>\nAre you &quot;immune&quot; to other people&#39;s opinions?  Immune to documentaries  <br/>\nintended to frighten you?<br/>\n<br/>\nThe more mindfully people use words, the clearer their thoughts and  <br/>\ncommunications will be.<br/>\n<br/>\n-=-We don&#39;t necessarily think that, when you see a 30 sec commercial,  <br/>\nthere<br/>\nwere meetings, people with MBA&#39;s and psychologists giving inputs,  <br/>\ntests or<br/>\ndifferent options, and the one chosen to be aired was probably the one  <br/>\nthat<br/>\nmade the kid blink less, meaning that it hooked him up more  <br/>\neffectively.-=-<br/>\n<br/>\nWho is &quot;we&quot;?<br/>\nNot every single commercial is designed by psychologist with tests.   <br/>\nAll the energy you&#39;ve put toward being alarmed could have been much  <br/>\nbetter put toward being gently at peace with your child.<br/>\n<br/>\n-=-We are not necessarily aware that the cheapest toys in Walt Mart  <br/>\nare the<br/>\nones with character figures. &quot;You get into the kids minds, you get  <br/>\nthem for<br/>\nlife&quot; (quoted from the documentary). Makes sense to me!-=-<br/>\n<br/>\nAgain, &quot;We...&quot;   Don&#39;t speak for us.   Speak for your own self.  If  <br/>\nthat documentary is what makes sense to you, then maybe ask them how  <br/>\nto be with your children, and take their advice wholly and without  <br/>\nquestion.  I&#39;m sure they will, for a price, tell you what to do just  <br/>\nas you fear the corporations want to.<br/>\n<br/>\nThat fear isn&#39;t healthy for you or for your relationship with your  <br/>\nchild.<br/>\n<br/>\nI&#39;m hoping unschooling will make sense to you.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/help\">http://sandradodd.com/help</a><br/>\nThere&#39;s some encouragement for new unschoolers.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation  documentaries","postDate":"1264376180","msgId":49975,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNjA2MS41ODU5LnFtQHdlYjgxNTA2Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPiAgPGhqaWF0MStsYmsyQGVHcm91cHMuY29tPiA8MWJlMDQ3ZjAxMDAxMjQxNDAweTUyNjY2ZWZ1ZTY0NzU2YTljZmY3MzNiM0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":49973,"nextInTopic":49976,"prevInTime":49974,"nextInTime":49976,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":". You get into the kids minds, you get them for life (quoted from the documentary) . Makes sense to me! -=-=-=-=-=-=-=-=- This made me laugh.  Do you","messageBody":"<div id=\"ygrps-yiv-42216945\">. &quot;You get into the kids minds, you get them for<br/>\nlife&quot; (quoted from the documentary) . Makes sense to me!<br/>\n<br/>\n-=-=-=-=-=-=-=-=-<br/>\n<br/>\nThis made me laugh.  Do you really think that  about kids?<br/>\nI think its is BS.<br/>\nMy kids are 4 and 7 and they are not little zombies but smart people  that know what they want even at this tender age.<br/>\nWant a better quote or saying?<br/>\nFear is paralizing, knowledge is power.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: TV issue: Consumer kids and Corporation documentaries","postDate":"1264375517","msgId":49973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqaWtzdCtuZzlsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEE3OUJBMDZDLTA5NTctNENCRC1COEEyLTdGRDA5MzVGMTI2NEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49971,"nextInTopic":49975,"prevInTime":49972,"nextInTime":49974,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"-= I really believe that TV makes the world for a child smaller and smaller... -=- I used to think so too.  I was quite sure that the tv was a brain sucking","messageBody":"<div id=\"ygrps-yiv-1592222233\">-= I really believe that TV makes the world for a child smaller and<br/>\nsmaller... -=-<br/>\n<br/>\nI used to think so too.  I was quite sure that the tv was a brain sucking device.  Then as I read more about unschooling, I started to realize something.  My children see things on tv that they may never see in real life and it opens up whole worlds of possiblity for them.  I would love to be able to spend our days traveling around the world and seeing all the amazing things in real life.  But at this time, we&#39;re pretty broke.  We&#39;re using our income tax return for a trip to my mom&#39;s.  We got a YMCA membership and my daughter will probably take a dance class.  We go to lots of free places and will take a friend up on an offer to use her museum guest pass.  But I can&#39;t hop on a plane and take my kids to Africa.  But they can see elephants and lions on tv.  Hopefully, some day they will be able to see the Great Wall of China or the Eiffel Tower in person.  Until then, tv is a great substitute.  It sure beats a book or magazine any day.  And I&#39;m not just talking about &quot;educational&quot; programs.  We&#39;ve had great conversation stemming from Barbie princess movies (which I also once swore my daughters would never watch).  <br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":345152630,"authorName":"Julie V","from":"&quot;Julie V&quot; &lt;thewekkenfam@...&gt;","profile":"vegfam3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: TV issue: Consumer kids and Corporation documentaries","postDate":"1264372713","msgId":49971,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqaWk1OSs5ZGFkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49970,"nextInTopic":49973,"prevInTime":49970,"nextInTime":49972,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"Once again I just have to look to my own children when I read things like this.  Totally untrue in regards to my own two children and the other unschooled","messageBody":"<div id=\"ygrps-yiv-1013824004\">Once again I just have to look to my own children when I read things like this.  Totally untrue in regards to my own two children and the other unschooled children I&#39;m around who have unrestricted access to t.v.<br/>\n<br/>\nI can literally count on 1 hand the number of times my 7  (almost 8) year old has asked for something he&#39;s seen on t.v.  The few times he has it had to do with a current interest already and the commercial was in a sense opening up his world to what was out there, because they were things I didn&#39;t even know about.  He&#39;s had a couple experiences with receiving gifts for toys that he had seen the commercials for (not toys he asked for btw, just random gifts from friends or relatives), and he learned first hand that sometimes commercial don&#39;t truthfully show exactly how a product actually works.  This has helped him become a more conscious consumer.<br/>\n<br/>\nBoth my 7 & 4 year olds have their own wallets with their own money in them.  My 4 year old expressed an interest in buying a couple of Bakugan (a Cartoon Network show that he watches on the computer) 2 weeks ago, so my husband took him to the store where he picked out the ones he wanted and my husband helped him pay for them with his (my son&#39;s) own money.  The money he spent that day had been in his wallet since his birthday in October and that was the first time he expressed an interest in buying something.  My 7 year old has had money in his wallet since his birthday last March, and the last time he expressed an interest in using his money was when his friend had a birthday and I made him a wallet, my son wanted to put some of his own money into his friends wallet to give him for his birthday. <br/>\n<br/>\nCurrently my 7 year old wants a few new games for his Ninetnedo DS, which are on his birthday list which is March 3rd.  Other than that, neither one of my boys has anything in the near future that they want to purchase.<br/>\n<br/>\nClosing oneself off from the world doesn&#39;t make the world a safer place.  I do think it makes it easier not to concern oneself with what is going on in the rest of the world.  My son and I read a biography on Martin Luther King Jr. this past week, and we learned that it was because of television that so many people were opened up to the atrocities & illegalities that were going on at that time that propelled more people to protest.  Last week after watching a special on the earthquake in Haiti and seeing firsthand images of what the people are going through, I took out my checkbook and wrote a donation check to send for what we could afford.  <br/>\n<br/>\nApart from the above examples, as a family we derive lots of joy from watching shows together about a variety of different things that we would never have been exposed to otherwise.<br/>\n<br/>\nJulie v.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://lerendzonderschool.blogspot.com/\">http://lerendzonderschool.blogspot.com/</a><br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Cinira Longuinho &lt;ciniravlonguinho@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I am a member of this yahoo group for more than 1 year... I learn so much,<br/>\n&gt; open my eyes to so many things, it is an inspiration... But I have to say I<br/>\n&gt; do struggle with the TV issue.. I completely love the concept of parents<br/>\n&gt; being facilitators so children will make their world bigger and bigger ...<br/>\n&gt; let them explore and do what interest them, learn and thrive in freedom...<br/>\n&gt; <br/>\n&gt; On the other hand, I have watched 2 documentary movies that had a great<br/>\n&gt; impact on me about this TV issue.<br/>\n&gt; <br/>\n&gt; 1) Consumer Kids<br/>\n&gt; <br/>\n&gt;  Brief description: Consuming Kids throws desperately needed light on the<br/>\n&gt; practices of a relentless multi-billion dollar marketing machine that now<br/>\n&gt; sells kids and their parents everything from junk food and violent video<br/>\n&gt; games to bogus educational products and the family car. Drawing on the<br/>\n&gt; insights of health care professionals, children&#39;s advocates, and industry<br/>\n&gt; insiders, the film focuses on the explosive growth of child marketing in the<br/>\n&gt; wake of deregulation, showing how youth marketers have used the latest<br/>\n&gt; advances in psychology, anthropology, and neuroscience to transform American<br/>\n&gt; children into one of the most powerful and profitable consumer demographics<br/>\n&gt; in the world. Consuming Kids pushes back against the wholesale<br/>\n&gt; commercialization of childhood, raising urgent questions about the ethics of<br/>\n&gt; children&#39;s marketing and its impact on the health and well-being of kids&quot;<br/>\n&gt; <br/>\n&gt; You can watch  the whole documentary on youtube... Link for the first part<br/>\n&gt; is here <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=JCT7h-jwCWA\">http://www.youtube.com/watch?v=JCT7h-jwCWA</a><br/>\n&gt; <br/>\n&gt; 2) The Corporation<br/>\n&gt; <br/>\n&gt; Brief description: . The Corporation is today&#39;s dominant institution,<br/>\n&gt; creating great wealth but also great harm. This 26 award-winning documentary<br/>\n&gt; examines the nature, evolution, impacts and future of the modern business<br/>\n&gt; corporation and the increasing role it plays in society and our everyday<br/>\n&gt; lives.<br/>\n&gt; <br/>\n&gt; For a playlist of all 23 chapters in order, please click on:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/view_play_list...&lt;http://www.youtube.com/view_play_list?p=FA50FBC214A6CE87\">http://www.youtube.com/view_play_list...&lt;http://www.youtube.com/view_play_list?p=FA50FBC214A6CE87</a>&gt;<br/>\n&gt; <br/>\n&gt; These documentaries show the corporations... something part of the modern<br/>\n&gt; world and the lack of responsibility in their actions to society, their goal<br/>\n&gt; is profit...  A corporation that wants to sell toys will do everything<br/>\n&gt; possible to sell more and more toys, doing commercials and programs with the<br/>\n&gt; sole purpose of selling more and more toys...  So, I think that TV ( the<br/>\n&gt; problem is not the TV itself but the marketing strategy behind it )<br/>\n&gt; manipulates children to buy their products and get them addicted to<br/>\n&gt; that... I really believe that TV makes the world for a child smaller and<br/>\n&gt; smaller...   With the fact corporations are getting so powerful, I always<br/>\n&gt; question myself that protecting our children may be part  of the modern<br/>\n&gt; life... It is sad I agree I do not really like it but it seems<br/>\n&gt; inevitable...<br/>\n&gt; <br/>\n&gt; C.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":337025893,"authorName":"Cinira Longuinho","from":"Cinira Longuinho &lt;ciniravlonguinho@...&gt;","profile":"ciniravlonguinho","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: TV issue: Consumer kids and Corporation \tdocumentaries","postDate":"1264370447","msgId":49970,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFiZTA0N2YwMTAwMTI0MTQwMHk1MjY2NmVmdWU2NDc1NmE5Y2ZmNzMzYjNAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGhqaWF0MStsYmsyQGVHcm91cHMuY29tPg==","referencesHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPgkgPGhqaWF0MStsYmsyQGVHcm91cHMuY29tPg=="},"prevInTopic":49960,"nextInTopic":49971,"prevInTime":49969,"nextInTime":49971,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"[[[[[[[[So wait...That was THEIR description, not yours as a viewer.]]]]] True. I just copied their description, so you all are exposed to the same thing I was","messageBody":"<div id=\"ygrps-yiv-1669461387\">[[[[[[[[So wait...That was THEIR description, not yours as a viewer.]]]]]<br/>\n<br/>\nTrue. I just copied their description, so you all are exposed to the same<br/>\nthing I was when I first saw the documentaries.<br/>\n<br/>\nMy description I will state again:<br/>\n[[[[[I have watched 2 documentary movies that had a great impact on me about<br/>\nthis TV issue]]]]<br/>\n<br/>\nSandra, I get from your response that their &quot;dramatic, emotional description<br/>\nof their scare-tactics documentary&quot; can too be manipulative, and as such can<br/>\nhave negative consequences such as us living in world of fear. I appreciate<br/>\nand resonate with your comments.<br/>\n<br/>\nHowever, I missed you addressing how unfair game can be between parents and<br/>\ncorporations on what gets into the mind of our kids.<br/>\n<br/>\nBrian said: [[[[[Maybe for kids that are not unschooled and not<br/>\nempowered]]]]]. How soon will an empowered kid be mature enough to be immune<br/>\nto those ads? Certainly your family that knows the insides of creating and<br/>\nadd can discuss, have fun, and therefore be less susceptible to that. This<br/>\nis probably not the case for the majority of the people.<br/>\n<br/>\nWe don&#39;t necessarily think that, when you see a 30 sec commercial, there<br/>\nwere meetings, people with MBA&#39;s and psychologists giving inputs, tests or<br/>\ndifferent options, and the one chosen to be aired was probably the one that<br/>\nmade the kid blink less, meaning that it hooked him up more effectively.<br/>\n<br/>\nWe are not necessarily aware that the cheapest toys in Walt Mart are the<br/>\nones with character figures. &quot;You get into the kids minds, you get them for<br/>\nlife&quot; (quoted from the documentary). Makes sense to me!<br/>\n<br/>\nI was explaining to friends why we don&#39;t give Disney movies to our daughter.<br/>\nWe said &quot;we don&#39;t want her to imagine Snow White as necessarily the Disney<br/>\ncharacter for the rest of her life&quot;. Our friend said &quot;what do you mean?<br/>\neveryone knows how Snow White looks like&quot;, then he described Disney&#39;s Snow<br/>\nWhite! It was so sad to see that he does not even get that Snow White can be<br/>\ndifferent from one person to another, it just depend on each one<br/>\nimagination.... Well, at least Disney is now (in 2009) starting to create<br/>\nprincesses with dark colour...<br/>\n<br/>\nBack to the topic: it seems there was a big debate in the 80&#39;s in the about<br/>\nlaws regarding safety of toys, and also advertisement to kids. This is shown<br/>\nin the documentary. Well, the result is that there are laws about toys<br/>\nsafety, but advertisers are free to do whatever they want !<br/>\n<br/>\nYou merge that with the environment behind corporations. A CEO is paid to<br/>\nmake decisions about what is more profitable for the company (it is the<br/>\nlaw!). As a consequence, you see good people making business cases on what<br/>\ncosts less: to deal with a lawsuit on a child that  is injured from a toy,<br/>\nor to let an unsafe toy to go to the market.<br/>\n<br/>\nFinally, I would like to say I don&#39;t want to scare anyone... I do look at<br/>\nthis with criticism, and I see how the documentary film makes use the same<br/>\nmarketing tactics to be effective. However, I choose to give them the same<br/>\nattention that I give to others, and that is why I brought this to the<br/>\nforum.<br/>\n<br/>\nFor now, my option has been to not to expose my daughter to TV adds or<br/>\nanything &quot;Disney like&quot;. I know she will be exposed one day, and I hope she<br/>\nwill be by then empowered to look with the same criticism that I look today.<br/>\nTo me it is like drugs, you know they may sometimes be perceived to be<br/>\n&quot;nice&quot;, and our kids for sure will have contact with them one day. That<br/>\ndoesn&#39;t mean that I have to expose them at early stage in their lives, at<br/>\nleast until they are mature enough.  Oh my, when will that be? ;-)<br/>\n<br/>\nC.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sun, Jan 24, 2010 at 3:34 PM, RobynC &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezignarob@...\">dezignarob@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; Anyway, seems interesting to read about. i&#39;ll watch it anyway.&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n&gt; I won&#39;t. It sounds like fear mongering.<br/>\n&gt;<br/>\n&gt; My daughter isn&#39;t &quot;addicted&quot; to any products or buying.<br/>\n&gt;<br/>\n&gt; When people stop buying stuff, as they are now in this recession, other<br/>\n&gt; people can lose their jobs. I make art for a living. It&#39;s either a luxury or<br/>\n&gt; a triviality in this economy. Only the very rich are buying art right now.<br/>\n&gt; My usual customers are not the very rich.<br/>\n&gt;<br/>\n&gt; A while ago we were relatively affluent. Jayn was happy to receive dolls<br/>\n&gt; for her collections, and calmly make plans for her future.<br/>\n&gt;<br/>\n&gt; Right now we are poor. She is doing without new dolls, and camly making<br/>\n&gt; plans for her future.<br/>\n&gt;<br/>\n&gt; Her future includes being a doll designer and being something of a mogul.<br/>\n&gt;<br/>\n&gt; Jayn was telling me about her plans to host huge charity events four times<br/>\n&gt; a year with all the proceeds from her business ventures on that day being<br/>\n&gt; donated.<br/>\n&gt;<br/>\n&gt; Her television viewing is completely unrestricted. In her tv viewing she<br/>\n&gt; has visited the bottom of the ocean, outer space, factories all over the<br/>\n&gt; country, the cuisines of many countries, the ancient world and realms of<br/>\n&gt; fantasy. TV is not making her world at all smaller.<br/>\n&gt;<br/>\n&gt; Nor is it diminishing her sense of personal power. She just got a job - at<br/>\n&gt; the age of 10. Our neighbor has hired Jayn to help her organize her closets.<br/>\n&gt; Organizing space is one of Jayn&#39;s inborn skills. This was all her own idea.<br/>\n&gt; She is saving up to buy a collector doll that she desires - and is never<br/>\n&gt; advertised on tv (way too esoteric).<br/>\n&gt;<br/>\n&gt; Robyn L. Coburn<br/>\n&gt; www.iggyjingles.etsy.com<br/>\n&gt; www.iggyjingles.blogspot.com<br/>\n&gt; www.allthingsdoll.blogspot.com<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":359707411,"authorName":"RobynC","from":"&quot;RobynC&quot; &lt;dezignarob@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: TV issue: Consumer kids and Corporation documentaries","postDate":"1264365281","msgId":49960,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqaWF0MStsYmsyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49959,"nextInTopic":49970,"prevInTime":49959,"nextInTime":49961,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"... I won t. It sounds like fear mongering. My daughter isn t addicted to any products or buying. When people stop buying stuff, as they are now in this","messageBody":"<div id=\"ygrps-yiv-1299835729\"><blockquote><span title=\"ireply\">&gt; Anyway, seems interesting to read about. i&#39;ll watch it anyway.&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I won&#39;t. It sounds like fear mongering.  <br/>\n<br/>\nMy daughter isn&#39;t &quot;addicted&quot; to any products or buying.<br/>\n<br/>\nWhen people stop buying stuff, as they are now in this recession, other people can lose their jobs. I make art for a living. It&#39;s either a luxury or a triviality in this economy. Only the very rich are buying art right now. My usual customers are not the very rich.  <br/>\n<br/>\nA while ago we were relatively affluent. Jayn was happy to receive dolls for her collections, and calmly make plans for her future.<br/>\n<br/>\nRight now we are poor. She is doing without new dolls, and camly making plans for her future.<br/>\n<br/>\nHer future includes being a doll designer and being something of a mogul.<br/>\n<br/>\nJayn was telling me about her plans to host huge charity events four times a year with all the proceeds from her business ventures on that day being donated.<br/>\n<br/>\nHer television viewing is completely unrestricted. In her tv viewing she has visited the bottom of the ocean, outer space, factories all over the country, the cuisines of many countries, the ancient world and realms of fantasy. TV is not making her world at all smaller.<br/>\n<br/>\nNor is it diminishing her sense of personal power. She just got a job - at the age of 10. Our neighbor has hired Jayn to help her organize her closets. Organizing space is one of Jayn&#39;s inborn skills. This was all her own idea. She is saving up to buy a collector doll that she desires - and is never advertised on tv (way too esoteric).<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] TV issue: Consumer kids and Corporation documentaries","postDate":"1264364534","msgId":49959,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkyMDI5OS45NjQ4OC5xbUB3ZWI4MTUwNi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49957,"nextInTopic":49960,"prevInTime":49958,"nextInTime":49960,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-25947308\">&lt;&lt;&lt;&lt;&lt;&lt;I think that TV ( the<br/>\nproblem is not the TV itself but the marketing strategy behind it )<br/>\nmanipulates children to buy their products and get them addicted to<br/>\nthat... I really believe that TV makes the world for a child smaller and<br/>\nsmaller... With the fact corporations are getting so powerful, I always<br/>\nquestion myself that protecting our children may be part of the modern<br/>\nlife... It is sad I agree I do not really like it but it seems<br/>\ninevitable.. .&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\n-=-=-=-=-=-=-<br/>\n<br/>\nMaybe for kids that are not unschooled and not empowered.<br/>\nI have a totaly diferent perspective of that.<br/>\nMy father was a great photographer in  Brazil doing advertizing.<br/>\nI know what goes on in the heads of the people that create the advertizing campaings.<br/>\nThey are NOT a bunch of peopel that know how to manipulate small children.<br/>\nYou would be suprprised.<br/>\nI also grew up in  a household with unlimited TV where we loved commercials and ads.<br/>\nWE talked about it all the time. What worked, what did not, what was good , what was not.<br/>\nWe went to many screenings and had huge books of the best advertizing suff from the whole world.<br/>\nIt was super cool and some people are genious and tremenduous artist.<br/>\nTO this day I call my sister and she calls me to talk about new ads on TV.<br/>\nMy kids are the same way specially my 7 year old and he calls me all the time to show me funny ads on ROblox that other kids make to advertize their games.<br/>\nITs amazing.<br/>\nPlus they know that just because  Floam looks great on the TV it is not what it looks like on  T<br/>\nWHy?<br/>\nBecause we bought it to try , because we talk about it.<br/>\nBecause they are empowered.<br/>\nAlso because I help them get everything they want they don;t go out buying everything they see.<br/>\nJust this Christmas they each got a $50 dollar gift certificate to Toy&#39;r&#39;Us.<br/>\nMy 7 year old is saving his to by a Wii game the has not come out yet and has not date set for release.<br/>\nMY 4 year old ( today) went shopping with me and I was prepared for her to just spend all the money but she only found 2 things she really wanted and we spent $20 and have $30 left and she is in no hurry to buy more.<br/>\nToday she went shopping with dad for her birthday present and she boght two little dolls.<br/>\nGot home and wrap them both. SHe opened one after we blew the candles and she is saving the other for her birthday party that will probably be in a few weeks.<br/>\nIts amazing how my kids are. <br/>\n<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] TV issue: Consumer kids and Corporation \tdocumentaries","postDate":"1264361446","msgId":49957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI0MTEzMHMzOTdiZWU1MWxiMzRmYWNmYTEzNTViMjFmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49955,"nextInTopic":49959,"prevInTime":49956,"nextInTime":49958,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"Thank you. They sound interesting. I am also looking at a perception I had, which I hadn t essentially attached with a new phenomenon. I think the most","messageBody":"<div id=\"ygrps-yiv-1490977580\">Thank you. They sound interesting.<br/>\n<br/>\nI am also looking at a perception I had, which I hadn&#39;t essentially attached<br/>\nwith a new phenomenon.<br/>\n<br/>\nI think the most reliable industry in the world is kids, since the beginning<br/>\nof time. Kids make up an amazing percentage of the world&#39;s population. I<br/>\ndon&#39;t know if maternity homes are concept abroad, but in India, you<br/>\nliterally can&#39;t have any decent size of population without maternity care.<br/>\nIn cities, private practices abound. I have two maternity homes within 500<br/>\nmeters of my residence and about 16 in a two kilometer radius. 5<br/>\npediatricians, 6 schools, 3 of those mother-toddler/day-care/nursery stuff,<br/>\n2 colleges and so on (uh... I&#39;m in Mumbai - some of the highest numbers in<br/>\npopulation density). These aren&#39;t marketed. There is enough of a market for<br/>\nspecialization to happen.<br/>\n<br/>\nAs for targetted marketing to kids.... well I don&#39;t know that it has grown<br/>\ndisproportionately (though I may discover otherwise when I see the film. I<br/>\nalso get quite intense targetting for life insurance, films, mobile phones,<br/>\nbank accounts, credit cards, donations to charities, holiday clubs, etc.<br/>\nRegular advertising for sure, but I&#39;m talking of people making one on one<br/>\ncalls who actually remember my name and content of previous conversations!!!<br/>\nScary. I was under the impression that advertising as a whole is getting<br/>\nexcessive. We have too many products, too many companies trying to compete<br/>\nwith each other, too many advertising services to keep them alive competing<br/>\nwith each other....<br/>\n<br/>\nAlso looking at the fact that focusing on one thing makes it seem<br/>\ndisproportionately more. Whether that is fact cannot be said without<br/>\nfocusing with equal intensity and standards for the &#39;others&#39;.<br/>\n<br/>\nAnyway, seems interesting to read about. i&#39;ll watch it anyway.<br/>\n<br/>\nVidyut<br/>\n<br/>\nOn Mon, Jan 25, 2010 at 12:13 AM, Cinira Longuinho &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ciniravlonguinho@...\">ciniravlonguinho@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I am a member of this yahoo group for more than 1 year... I learn so much,<br/>\n&gt; open my eyes to so many things, it is an inspiration... But I have to say I<br/>\n&gt; do struggle with the TV issue.. I completely love the concept of parents<br/>\n&gt; being facilitators so children will make their world bigger and bigger ...<br/>\n&gt; let them explore and do what interest them, learn and thrive in freedom...<br/>\n&gt;<br/>\n&gt; On the other hand, I have watched 2 documentary movies that had a great<br/>\n&gt; impact on me about this TV issue.<br/>\n&gt;<br/>\n&gt; 1) Consumer Kids<br/>\n&gt;<br/>\n&gt; Brief description: Consuming Kids throws desperately needed light on the<br/>\n&gt; practices of a relentless multi-billion dollar marketing machine that now<br/>\n&gt; sells kids and their parents everything from junk food and violent video<br/>\n&gt; games to bogus educational products and the family car. Drawing on the<br/>\n&gt; insights of health care professionals, children&#39;s advocates, and industry<br/>\n&gt; insiders, the film focuses on the explosive growth of child marketing in<br/>\n&gt; the<br/>\n&gt; wake of deregulation, showing how youth marketers have used the latest<br/>\n&gt; advances in psychology, anthropology, and neuroscience to transform<br/>\n&gt; American<br/>\n&gt; children into one of the most powerful and profitable consumer demographics<br/>\n&gt; in the world. Consuming Kids pushes back against the wholesale<br/>\n&gt; commercialization of childhood, raising urgent questions about the ethics<br/>\n&gt; of<br/>\n&gt; children&#39;s marketing and its impact on the health and well-being of kids&quot;<br/>\n&gt;<br/>\n&gt; You can watch the whole documentary on youtube... Link for the first part<br/>\n&gt; is here <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=JCT7h-jwCWA\">http://www.youtube.com/watch?v=JCT7h-jwCWA</a><br/>\n&gt;<br/>\n&gt; 2) The Corporation<br/>\n&gt;<br/>\n&gt; Brief description: . The Corporation is today&#39;s dominant institution,<br/>\n&gt; creating great wealth but also great harm. This 26 award-winning<br/>\n&gt; documentary<br/>\n&gt; examines the nature, evolution, impacts and future of the modern business<br/>\n&gt; corporation and the increasing role it plays in society and our everyday<br/>\n&gt; lives.<br/>\n&gt;<br/>\n&gt; For a playlist of all 23 chapters in order, please click on:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/view_play_list...&lt;\">http://www.youtube.com/view_play_list...&lt;</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/view_play_list?p=FA50FBC214A6CE87\">http://www.youtube.com/view_play_list?p=FA50FBC214A6CE87</a>&gt;<br/>\n&gt;<br/>\n&gt; These documentaries show the corporations... something part of the modern<br/>\n&gt; world and the lack of responsibility in their actions to society, their<br/>\n&gt; goal<br/>\n&gt; is profit... A corporation that wants to sell toys will do everything<br/>\n&gt; possible to sell more and more toys, doing commercials and programs with<br/>\n&gt; the<br/>\n&gt; sole purpose of selling more and more toys... So, I think that TV ( the<br/>\n&gt; problem is not the TV itself but the marketing strategy behind it )<br/>\n&gt; manipulates children to buy their products and get them addicted to<br/>\n&gt; that... I really believe that TV makes the world for a child smaller and<br/>\n&gt; smaller... With the fact corporations are getting so powerful, I always<br/>\n&gt; question myself that protecting our children may be part of the modern<br/>\n&gt; life... It is sad I agree I do not really like it but it seems<br/>\n&gt; inevitable...<br/>\n&gt;<br/>\n&gt; C.<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/JCT7h-jwCWA?wmode=opaque","type":"VIDEO"}]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] TV issue: Consumer kids and Corporation documentaries","postDate":"1264361116","msgId":49955,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE3OUJBMDZDLTA5NTctNENCRC1COEEyLTdGRDA5MzVGMTI2NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":49952,"nextInTopic":49957,"prevInTime":49954,"nextInTime":49956,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"-=- Consuming Kids throws desperately needed light on the practices of a relentless multi-billion dollar marketing machine that now sells kids and their","messageBody":"<div id=\"ygrps-yiv-1688483214\">-=- Consuming Kids throws desperately needed light on the<br/>\npractices of a relentless multi-billion dollar marketing machine that  <br/>\nnow<br/>\nsells kids and their parents everything from junk food and violent video<br/>\ngames to bogus educational products and the family car. -=-<br/>\n<br/>\nSo wait...<br/>\nThat was THEIR description, not yours as a viewer.<br/>\n<br/>\nYou&#39;ve brought their dramatic, emotional description of their scare- <br/>\ntactics documentary to this list.  Any good reason?  Dramatic fear  <br/>\nloves company?<br/>\n<br/>\nIS there desperately-needed light, really?<br/>\nCan an unschooling family not look around and see for themselves that  <br/>\nsome things are needed more than others?  That some advertising  <br/>\nappeals to kids, some to moms, some to dads, and discuss why (IF the  <br/>\nkids want to, or if it comes up naturally)?<br/>\n<br/>\n-=- Consuming Kids pushes back against the wholesale<br/>\ncommercialization of childhood, raising urgent questions about the  <br/>\nethics of<br/>\nchildren&#39;s marketing and its impact on the health and well-being of  <br/>\nkids&quot;-=-<br/>\n<br/>\nDoes it seem &quot;urgent&quot; to you, really?  URGENT?<br/>\n<br/>\nI&#39;m guessing the makers of those documentaries used &quot;the latest<br/>\nadvances in psychology, anthropology, and neuroscience&quot; to excite  <br/>\ntheir audiences.  And why?  Were they donated out of the sweetness of  <br/>\ntheir hearts, or were the filmmakers making money somehow?  What did  <br/>\nthey have to sell, or to gain?<br/>\n<br/>\n-=These documentaries show the corporations... something part of the  <br/>\nmodern<br/>\nworld and the lack of responsibility in their actions to society,  <br/>\ntheir goal<br/>\nis profit...-=-<br/>\n<br/>\n?<br/>\nWas that part your words?   I couldn&#39;t tell from the post, exactly.<br/>\n<br/>\n&quot;Corporations&quot; aren&#39;t new.  And their goal was always profit.   Duh.   <br/>\nSeriously.  If people get together (whether it&#39;s two people or a  <br/>\nthousand) to pool their money to make a profit, whether they&#39;re  <br/>\nsending a Dutch trading ship out or trying to create a better  <br/>\ncellphone, they&#39;re probably not doing it just for fun, or it would be  <br/>\na hobby club and not a corporation.<br/>\n<br/>\n-=A corporation that wants to sell toys will do everything<br/>\npossible to sell more and more toys, doing commercials and programs  <br/>\nwith the<br/>\nsole purpose of selling more and more toys... -=-<br/>\n<br/>\nIf that was a surprise to someone, then that&#39;s the fault of the  <br/>\nsomeone who was surprised, in a way.  And if someone makes that claim  <br/>\nin such a way that it&#39;s intended to cover EVERY program ever, then it  <br/>\nbecomes untrue.<br/>\n<br/>\nWhen Snow White and the Seven Dwarfs came out in 1939,  there was no  <br/>\nlongterm intention of selling Disney Princess costumes 80 years  <br/>\nlater.   When Sesame Street started there weren&#39;t dolls or anything,  <br/>\njust the show. But the show was popular, and the show needed funding.   <br/>\nThey had some sponsors (and corporate sponsors, too, even though there  <br/>\ncouldn&#39;t be commercials on PBS--the corporations sponsored them for  <br/>\ntax breaks or whatever), but if they could sell books and license Big  <br/>\nBird sheets and pillow cases, some profit came back to support the  <br/>\nprogram.   Does that seem insidious and sneaky and horrible to you?<br/>\n<br/>\n-=I think that TV ( the problem is not the TV itself but the marketing  <br/>\nstrategy behind it ) manipulates children to buy their products and  <br/>\nget them addicted to that... -=-<br/>\n<br/>\n&quot;not the TV itself...&quot; going back how far?   Radio?  Movies?  Silent  <br/>\nmovies?   Newspapers?   The ability to broadcast moving pictures  <br/>\nwasn&#39;t created to sell toys.<br/>\n<br/>\nAre you addicted to buying products you see on TV?  I&#39;m certainly  <br/>\nnot.  I never was; my children aren&#39;t and never were.<br/>\n<br/>\n-= I really believe that TV makes the world for a child smaller and  <br/>\nsmaller... -=-<br/>\n<br/>\nI grew up in a town called Española, in northern New Mexico.  Some  <br/>\nplaces have &quot;aggie jokes&quot; or jokes about a particular ethnic group or  <br/>\nplace, but in New Mexico there are &quot;Española jokes.&quot;  It&#39;s the butt of  <br/>\nall rudeness.<br/>\n<br/>\nBecause of TV, I saw opera, The Friendly Giant, musical theatre  <br/>\nexcerpts on Ed Sullivan, rock and roll, documentaries about Egypt and  <br/>\nWales and Japan, learned some guitar finger-picking tricks from a PBS  <br/>\nguitar-lessons show, saw cooking shows and sewing shows.  Once a year  <br/>\nwe saw Peter Pan; once a year we saw The Wizard of Oz.   I also saw  <br/>\ncommercials for Spaghettios and Bandaids and Jello and Nestle&#39;s Quik,  <br/>\nand could still sing all those songs to you.  I know songs for toys  <br/>\nthat haven&#39;t been manufactured for 40 years.  &quot;Jumpin&#39; Jiminy, it&#39;s by  <br/>\nEminee!&quot;--they made mostly musical toys.   If you had one now you  <br/>\ncould eBay it for big bucks.<br/>\n<br/>\nFear makes people&#39;s worlds smaller, and scary, and dark.<br/>\n<br/>\nSinging and thinking and seeing images from other continents and from  <br/>\nmuseums and from space and from history does NOT make the world smaller.<br/>\n<br/>\n-=-I always<br/>\nquestion myself that protecting our children may be part of the modern<br/>\nlife... It is sad I agree I do not really like it but it seems<br/>\ninevitable...-=-<br/>\n<br/>\nProtect your children from scare-tactic nonsense.  Turn away from  <br/>\ndocumentaries that tell you your children are fragile automatons, in  <br/>\ndanger of becoming TV zombies.  It&#39;s bullshit.<br/>\n<br/>\nTurn toward your children and see how they are actually thinking and  <br/>\nlearning and growing right this very moment.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":337025893,"authorName":"Cinira Longuinho","from":"Cinira Longuinho &lt;ciniravlonguinho@...&gt;","profile":"ciniravlonguinho","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"TV issue: Consumer kids and Corporation documentaries","postDate":"1264358580","msgId":49952,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFiZTA0N2YwMTAwMTI0MTA0M3UyNjJkNGE4ZGo5Zjc5ZTVjZWNiNGQwZWU1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":0,"nextInTopic":49955,"prevInTime":49951,"nextInTime":49953,"topicId":49952,"numMessagesInTopic":0,"msgSnippet":"I am a member of this yahoo group for more than 1 year... I learn so much, open my eyes to so many things, it is an inspiration... But I have to say I do","messageBody":"<div id=\"ygrps-yiv-850607953\">I am a member of this yahoo group for more than 1 year... I learn so much,<br/>\nopen my eyes to so many things, it is an inspiration... But I have to say I<br/>\ndo struggle with the TV issue.. I completely love the concept of parents<br/>\nbeing facilitators so children will make their world bigger and bigger ...<br/>\nlet them explore and do what interest them, learn and thrive in freedom...<br/>\n<br/>\nOn the other hand, I have watched 2 documentary movies that had a great<br/>\nimpact on me about this TV issue.<br/>\n<br/>\n1) Consumer Kids<br/>\n<br/>\n Brief description: Consuming Kids throws desperately needed light on the<br/>\npractices of a relentless multi-billion dollar marketing machine that now<br/>\nsells kids and their parents everything from junk food and violent video<br/>\ngames to bogus educational products and the family car. Drawing on the<br/>\ninsights of health care professionals, children&#39;s advocates, and industry<br/>\ninsiders, the film focuses on the explosive growth of child marketing in the<br/>\nwake of deregulation, showing how youth marketers have used the latest<br/>\nadvances in psychology, anthropology, and neuroscience to transform American<br/>\nchildren into one of the most powerful and profitable consumer demographics<br/>\nin the world. Consuming Kids pushes back against the wholesale<br/>\ncommercialization of childhood, raising urgent questions about the ethics of<br/>\nchildren&#39;s marketing and its impact on the health and well-being of kids&quot;<br/>\n<br/>\nYou can watch  the whole documentary on youtube... Link for the first part<br/>\nis here <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/watch?v=JCT7h-jwCWA\">http://www.youtube.com/watch?v=JCT7h-jwCWA</a><br/>\n<br/>\n2) The Corporation<br/>\n<br/>\nBrief description: . The Corporation is today&#39;s dominant institution,<br/>\ncreating great wealth but also great harm. This 26 award-winning documentary<br/>\nexamines the nature, evolution, impacts and future of the modern business<br/>\ncorporation and the increasing role it plays in society and our everyday<br/>\nlives.<br/>\n<br/>\nFor a playlist of all 23 chapters in order, please click on:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/view_play_list...&lt;http://www.youtube.com/view_play_list?p=FA50FBC214A6CE87\">http://www.youtube.com/view_play_list...&lt;http://www.youtube.com/view_play_list?p=FA50FBC214A6CE87</a>&gt;<br/>\n<br/>\nThese documentaries show the corporations... something part of the modern<br/>\nworld and the lack of responsibility in their actions to society, their goal<br/>\nis profit...  A corporation that wants to sell toys will do everything<br/>\npossible to sell more and more toys, doing commercials and programs with the<br/>\nsole purpose of selling more and more toys...  So, I think that TV ( the<br/>\nproblem is not the TV itself but the marketing strategy behind it )<br/>\nmanipulates children to buy their products and get them addicted to<br/>\nthat... I really believe that TV makes the world for a child smaller and<br/>\nsmaller...   With the fact corporations are getting so powerful, I always<br/>\nquestion myself that protecting our children may be part  of the modern<br/>\nlife... It is sad I agree I do not really like it but it seems<br/>\ninevitable...<br/>\n<br/>\nC.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/JCT7h-jwCWA?wmode=opaque","type":"VIDEO"}]}],"prevTopicId":50105,"nextTopicId":50143}}