{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":16,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1094549354","msgId":99219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98920,"nextInTopic":0,"prevInTime":99218,"nextInTime":99220,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-849998346\">&lt;&lt;&lt;My son is quite attached to Mom & Dad. He has no interest in<br/>\nparticipating in any type of class, sport team, instruction, etc, unless I<br/>\nam right by his side. We have tried a couple trial classes (in things that<br/>\nhe seems to truly enjoy such as tae kwon do and gymanstics), and he<br/>\ntypically lays on the floor and cries. He will not &quot;line up&quot; or do what the<br/>\nother kids are doing or follow the instructor.&gt;&gt;&gt;<br/>\n<br/>\nMaybe it&#39;s just too soon for him to feel safe without you nearby. You are<br/>\ndoing the right thing by honoring his needs and fears. <br/>\n<br/>\nJayn started a loving, gentle modern dance class when she was 3. For the<br/>\nfirst year I pretty much had to sit in view of her at the top of the stairs.<br/>\nI tried to honor the teacher&#39;s idea that there be no audience - to encourage<br/>\nfree expression - by reading a book with my back to the class, but I was<br/>\nstill there for Jayn to run over and get a kissy at will. This year we have<br/>\nprogressed to me being downstairs in the living room, again contrary to the<br/>\nteacher&#39;s preference for her home not to be a waiting room - but she sees<br/>\nthat Jayn needs to know I am accessible to her so that she will dance<br/>\nhappily. This teacher really is a treasure, and the kids just adore her.<br/>\nFinding the right teacher is one part of the equation. <br/>\n<br/>\nAnother thing that Jayn was very sensitive to was large, echo filled indoor<br/>\nspaces with crowds of noisy people, especially if she was &quot;required&quot; to be<br/>\nsitting (egs: cinemas, theaters, halls, churches) - she would become very<br/>\nscared and clingy, and would cry to leave. She seems to have gotten over<br/>\nthat to a great degree - I believe in part because I never pushed her to<br/>\nstay in any of these types of places when she was nervous. I always left<br/>\nimmediately with her. Perhaps your son has some of the same reactions to the<br/>\nsound of crowds.<br/>\n<br/>\n&lt;&lt;&lt;&lt;My family tells me it is &quot;unhealthy&quot; for him to be with me (or Dad) all<br/>\nthe time and he needs to be able to interact with others and follow<br/>\ninstruction from others.  I do not agree with this, but on some level it<br/>\ndoes eat away at me deep inside. I was in every class imaginable as a child<br/>\nand I think it is hard for me to understand how he could not want to<br/>\nparticipate in these types of things. But I have realized that I need to<br/>\naccept his personality and find ways to work WITH it, not against it.&gt;&gt;&gt;&gt;<br/>\n<br/>\nOh yes. The little drips of poison that our other family members sometimes<br/>\nmanage to insert into our thinking at times. Flush them out if you can. Here<br/>\nyou are surrounded metaphorically by people who totally reject that notion<br/>\nof it being &quot;unhealthy&quot; to meet your little child&#39;s needs for parental<br/>\ncontact. <br/>\n<br/>\n&quot;Following Instructions&quot; is a schoolthink criterion of success. In a few<br/>\nyears your boy will be playing PS2 games with the best of them, and<br/>\nfollowing all the instructions he needs to in order to advance up the<br/>\nlevels, or solve the puzzle or whatever game type excites him. Consider that<br/>\nhe is learning to trust his own judgment and to be discerning in his choice<br/>\nof leaders and mentors - an ability that may save his life one day.<br/>\n<br/>\nMy mother does the &quot;poison zinger&quot; sometimes - she doesn&#39;t see it as a<br/>\nnegative action. She believes she is trying to help, but lives by a whole<br/>\ndifferent paradigm of parenting and love relationships.<br/>\n<br/>\nWhat works with my mother is to find some article, usually on the internet,<br/>\nwritten by a source that she respects, and send it to her. My mother<br/>\nrespects authority, especially medical doctors. Therefore for her I will<br/>\nsend information from the American Academy of Pediatrics website, rather<br/>\nthan say, Mothering Magazine. Many times the information is essentially the<br/>\nsame. Perhaps you can find a source that your relatives will respect for<br/>\nsome Attachment Parenting information, and that will quiet them down on this<br/>\npushing independence issue. <br/>\n<br/>\nFurther to your own spiritual growth as a parent, you might re-examine<br/>\nwhether you truly wanted to be in all the classes you were in as a child,<br/>\nand what function they served for you.  Maybe you were looking for approval<br/>\nor validation. In my case, being somewhere other than with my mother was my<br/>\ngoal in many of the extra classes and after-school clubs I did when young.<br/>\nDid you really have a choice about the extra classes? Maybe you really did<br/>\nwant to be there and thrived on them - were you not quite 6 years old at<br/>\nthat time, or are you recalling your feelings at a later age? Are you having<br/>\nregrets that your son seems temperamentally very different from you or from<br/>\nyour expectations? Sometimes having an expectation is the surest way to a<br/>\ndisappointment. I&#39;m NOT looking for a report here, unless you have some<br/>\nepiphany you want to share, just suggesting some ideas to help you find more<br/>\nempathy for your son&#39;s emotional reactions to the places you have tried. <br/>\n<br/>\n&lt;&lt;&lt;&lt;So my question is - does anyone have any advice on how to work with this<br/>\n<br/>\npersonality style?  I can see clearly what he is interested in, but quite <br/>\noften I just don&#39;t know how to further his learning without looking for <br/>\n&quot;outside&quot; help (class, etc.)  For example, he is extremely interested in <br/>\nmedieval living, especially the fighting. (And I have read with great <br/>\ninterest the recent thread on SCA.) I suggested a fencing class or getting <br/>\ninvolved in a Ren Faire. He tells me very bluntly that he will only do it <br/>\nif I do it with him.  OK, but it&#39;s not that easy to find this type of <br/>\nscenario. Most will expect the children to participate with other children <br/>\n- not adults.  Am I just looking in the wrong places?&gt;&gt;&gt;&gt;<br/>\n<br/>\nI have done fencing as part of an acting class, and I really enjoyed it -<br/>\nbut I was an adult. The teacher was formerly the coach of the Australian<br/>\nOlympic fencing team. It was very physically demanding, very intense and<br/>\nthere are mesh masks and padding to be worn that *could* be intimidating or<br/>\nclaustrophobic for a little fellow. For beginners it can be very formalized.<br/>\nI think first watch some classes from a safe distance, to discover if he<br/>\nwants to pursue this. <br/>\n<br/>\nMy first thoughts when I read he is interested in medieval living are:<br/>\nmovies, the History Channel, computer games, the internet, local museums and<br/>\npicture books. So immediately assuming a class or group activity is the<br/>\nFIRST option does suggest to me that yes you are looking in the wrong places<br/>\n- and making more work for yourself. With Jayn, I usually start slowly when<br/>\nshe starts expressing some interest. Rather than &quot;getting involved&quot; with a<br/>\nRen. Faire, what about just attending one in your area. I would suggest to<br/>\nyou that you release this emphasis on &quot;working&quot; with his personality (you<br/>\nuse that word more than once), and just enjoy yourselves as much as possible<br/>\ndoing anything you both find fun.<br/>\n<br/>\n&lt;&lt;&lt;&lt;I know that he will not be &quot;hanging on my leg&quot; when he is 16 years old.<br/>\nI cherish the fact that he wants to be with me now. But the part of me that <br/>\nis &quot;schooled&quot; is concerned that he may be missing his chance for many <br/>\nthings. For example, the typical schooled child will begin on a T-ball or <br/>\nlittle league team (my son also loves baseball, when played by *his* rules <br/>\nwith Mom & Dad) at, what, age 5 or 6? So if my son is not comfortable <br/>\nparticipating on a team until he&#39;s 10 - how will we find a &quot;place&quot; for him <br/>\nsince he has not started on the same level?&gt;&gt;&gt;&gt;<br/>\n<br/>\nYour son may never want to participate in a team sport. It is not a<br/>\nmandatory rite of passage. Really. If he is enjoying the physical games with<br/>\nyou and dh, then that is great. He will come to want other friends too. He<br/>\nreally will.<br/>\n<br/>\nThere are &quot;play for fun&quot; groups for different sports, and homeschool teams<br/>\nall over the place with different levels of commitment asked that start at<br/>\nall kinds of ages. Some, but not all, are serious competitive teams moving<br/>\nin the same leagues as school teams. Someone at a local University in my<br/>\narea has a semi-organized soccer playing session once a week for little<br/>\nkids, with the emphasis on enjoyment well attended by members of my<br/>\nhomeschool group. Jayn sometimes expresses an interest, but not enough to<br/>\novercome the unfortunate scheduling of the event at 10AM.<br/>\n<br/>\nAs for missing his chance, it is true that there are some things that *seem*<br/>\nto require a very young start to reach the absolute pinnacle of it. Olympic<br/>\ngymnastics for girls and being a prima ballerina come to mind at once. There<br/>\nseems, and maybe I&#39;m wrong, to be a lot more age leeway for boys in the same<br/>\nsports - possibly because many of the sports for boys place more emphasis on<br/>\nstrength and less on suppleness, and boys just keep getting bigger and<br/>\nstronger as they age and do their sport. <br/>\n<br/>\nHowever watching the Olympics, and some of the historical sports shows<br/>\naround them, I notice there are plenty of stories of successful athletes who<br/>\n&quot;beat the odds&quot; starting in their sport in their early teens, or after some<br/>\ninjury or illness pushed them out of some other sport. And this is at the<br/>\ntop levels of these sports, a long way from neighborhood leagues or the<br/>\noffice team getting together to noodle around with a basketball for fun on<br/>\nthe weekend. <br/>\n<br/>\nI would guess that enthusiasm and willingness to practice probably go a long<br/>\nway with most coaches. Other people will have more experience than I do. I<br/>\nwonder how many of these little schooled boys would rather be playing a<br/>\nloving, happy game using their own rules with Mom and Dad, instead of the<br/>\nhigh pressure of Little League.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.752 / Virus Database: 503 - Release Date: 9/3/2004</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093850022","msgId":98920,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNndWszNitqYm9iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxMkUyOTkwLjIwNzAyMDNAZWFydGhsaW5rLm5ldD4="},"prevInTopic":98919,"nextInTopic":99219,"prevInTime":98919,"nextInTime":98921,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"... did ... dad ... kid ... to ... opposed to. I did kindermusik with my youngest when he was 3 or 4.   That didn t go over. I lol thinking about our last","messageBody":"<div id=\"ygrps-yiv-1737027344\"><blockquote><span title=\"ireply\">&gt; There&#39;s a big variation in how much kids like group activites.  I <br/>\n </span></blockquote>did <br/>\n<blockquote><span title=\"ireply\"> &gt; some Kindermusik when my son was three, and even though the mom or <br/>\n </span></blockquote>dad <br/>\n<blockquote><span title=\"ireply\"> &gt; is there sitting on the floor doing the musical activities with the <br/>\n </span></blockquote>kid <br/>\n<blockquote><span title=\"ireply\"> &gt; and dancing around in circles with them, there were some kids that <br/>\n&gt; declined to participate most of the time.  I don&#39;t think it&#39;s good <br/>\n </span></blockquote>to <br/>\n<blockquote><span title=\"ireply\"> &gt; force it.  I won&#39;t insist that my son do an activity that he is <br/>\n </span></blockquote>opposed to.<br/>\n<br/>\nI did kindermusik with my youngest when he was 3 or 4.   That didn&#39;t <br/>\ngo over. I lol thinking about our last attempt at that class.  All <br/>\nthe other kids in the class were doing everything just the way it was <br/>\nsuggested and he looked at me and said, &quot;This is stupid&quot;.  lol  I&#39;m <br/>\nnot knocking kindermusik for those who like it, because for the right <br/>\npersonality it might be a nice fit and I see the value for some <br/>\npeople in participating in a group situation where everyone&#39;s doing <br/>\nthe same thing, but I have to admit that at the moment he said that I <br/>\nlooked at kids running around doing whatever little dance they were <br/>\nsupposed to be doing and thought, &quot;Well, yeah, I guess it is kind of <br/>\nstupid!&quot;   When the kindermusik teacher says, &quot;March to the music <br/>\nwhile you&#39;re waving your scarf in the air&quot;, why do so few kids <br/>\nquestion marching to the music while waving their scarves in the <br/>\nair?  Why don&#39;t more kids say, &quot;Ummm...that&#39;s not what I want to do <br/>\nwhen I hear this music...&quot; ?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Right.  People are different.  My mom was really extroverted and <br/>\n </span></blockquote>really <br/>\n<blockquote><span title=\"ireply\"> &gt; needed to get out of the house, and as a kid I ended up feeling <br/>\n </span></blockquote>that I <br/>\n<blockquote><span title=\"ireply\"> &gt; was inferior because I wasn&#39;t as &quot;brave&quot; and good with people as <br/>\n </span></blockquote>she <br/>\n<blockquote><span title=\"ireply\"> &gt; was.  (Yes, she got impatient with my shyness a lot.)  (I&#39;m not <br/>\n </span></blockquote>saying <br/>\n<blockquote><span title=\"ireply\"> &gt; you are the same, it&#39;s just the first thing that springs into my <br/>\n </span></blockquote>mind <br/>\n<blockquote><span title=\"ireply\"> &gt; when I try to visualize a kid that doesn&#39;t want to be in class.)<br/>\n<br/>\n </span></blockquote>Me too.  Yikes!  I&#39;m not really extroverted but I do like to get out <br/>\nmuch more than my boys do...as I read your post I got to thinking...I <br/>\nthink I need to be extra careful that I&#39;m accepting of their desire <br/>\nto not leave the house a whole lot.  I certainly don&#39;t want to make <br/>\nthem feel bad about it.  <br/>\n<br/>\nMy husband has the exact same personality.  He&#39;s most happy at home, <br/>\nand doesn&#39;t even like going shopping.  But it&#39;s easy to accept him--<br/>\nif I want to go somewhere and he doesn&#39;t, I just go without him.  <br/>\nIt&#39;s not so easy with little boys who cry, &quot;But I don&#39;t want you to <br/>\nleave me&quot; at the mention of me going somewhere. <br/>\n<br/>\nFor our family too, I think that the &quot;not going anywhere&quot; has maybe <br/>\nbeen part of the deschooling process.  I used to do school at home <br/>\nwith Alisha, and although we didn&#39;t do lots of textbook/workbook <br/>\nstuff, I controlled what we did VERY much.  Lots of hands-on, trip <br/>\ntype stuff that she *had* to do because of unit studies I had <br/>\ndesigned.  And even though Matt was little, he got drug to a lot of <br/>\nthat stuff.  The feeling of &quot;we have to go on another educational <br/>\ntrip&quot; was in the air all too often in those days. :(  So now, freedom <br/>\nto my daughter means being free to stay home.  Classes just don&#39;t <br/>\nseem appealing to her--and she&#39;s been free for several years now.  <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; And keep repeating the quote about education not being &quot;filling a <br/>\n&gt; pail&quot;. <br/>\n<br/>\n </span></blockquote>Yeah, but I&#39;d say it&#39;s not the lighting of a fire either.  The fire&#39;s <br/>\nalready lit.  We just need to make sure nothing does anything to put <br/>\nthe fire out. <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093848390","msgId":98919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNndWlnNitvODdwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98904,"nextInTopic":98920,"prevInTime":98918,"nextInTime":98920,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"I am Shannon, dh Paul, and ds Logan who will be 6 in November. And we have a baby girl due any day now! We live in northwest NJ, very close to Easton, PA. Hi","messageBody":"<div id=\"ygrps-yiv-1853123038\">&quot;I am Shannon, dh Paul, and ds<br/>\nLogan who will be 6 in November. And we have a baby girl due any day <br/>\nnow!<br/>\nWe live in northwest NJ, very close to Easton, PA.&quot;<br/>\n<br/>\nHi Shannon. :)  I am just a little bit less than 2 hours from <br/>\nEaston.  I have 2 unschooled boys, ages 5 and 7 (as well as an 11 yo <br/>\ndaughter).  If you would like to get together with an unschooling <br/>\nfamily sometime, I&#39;d love to do that.  Email me privately if you&#39;re <br/>\ninterested. <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sheran@...\">sheran@...</a><br/>\n<br/>\n&quot;My son is quite attached to Mom & Dad. He has no interest in <br/>\nparticipating<br/>\nin any type of class, sport team, instruction, etc, unless I am right <br/>\nby<br/>\nhis side.  We have tried a couple trial classes (in things that he <br/>\nseems to<br/>\ntruly enjoy such as tae kwon do and gymanstics), and he typically <br/>\nlays on<br/>\nthe floor and cries. He will not &quot;line up&quot; or do what the other kids <br/>\nare<br/>\ndoing or follow the instructor.<br/>\n<br/>\nMy boys are like that too.  At 5 my oldest boy did swimming lessons <br/>\n(his older sister was doing them, so I asked if he wanted to try a <br/>\nclass too).  He wouldn&#39;t go in the water without me, which was <br/>\naccepted by the swimming class at that age.  But even with me, he <br/>\nrefused to participate with the rest of the class (especially when it <br/>\ninvolved the instructor trying to get him to go with her!)  So Matt <br/>\nand I went off to our own little section of the pool each day and <br/>\nplayed around in the water by ourselves.  At 6 he signed up for <br/>\nsoccer (his idea) because he thought it looked fun.  Then we got <br/>\nthere and he realized that I wouldn&#39;t be playing &quot;with&quot; him.  It <br/>\nwasn&#39;t a mom and son soccer team and he wouldn&#39;t do it.  He wouldn&#39;t <br/>\neven go out on the field for practices unless I did it with him.  He <br/>\nquit soccer.  Then at 7 he became interested in karate.  I called <br/>\naround to all the martial arts schools within a reasonable distance <br/>\nto see if they offer any type of family class where parents/siblings <br/>\ncan take together but the closest I could find was a school that said <br/>\nparents can be right there watching.  We went to a trial lesson.  He <br/>\nwouldn&#39;t go out on the floor and wasn&#39;t interested in going back <br/>\nthere again because he didn&#39;t like that they kept encouraging him to <br/>\ngo out on the floor and try it out.  He hasn&#39;t tried anything else in <br/>\nthe way of organized classes and activities, but even at park dates <br/>\nwith other homeschoolers, we&#39;re not often the family with the mom <br/>\nsitting talking to other parents watching the kids play.  We&#39;re the <br/>\nfamily with the mom playing with the kids because my kids don&#39;t want <br/>\nto go over to the slide or the swings unless I&#39;m *right* there with <br/>\nthem.   <br/>\n<br/>\nMy daughter was/is like this too, and at 11 she&#39;s starting to not <br/>\nneed me so much.  She IS very discriminating as far as what <br/>\nactivities she chooses to participate in but when she really wants to <br/>\ndo something, she&#39;s okay leaving me.  So that gives me some comfort <br/>\nwith my boys because I&#39;m seeing first hand that it really doesn&#39;t <br/>\nlast forever. :) <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":1160699,"authorName":"Penn Acres","from":"&quot;Penn Acres&quot; &lt;pennacres@...&gt;","profile":"mtnsky2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093624070","msgId":98904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2UwMWM0OGM1MiRjYzYyMDdjMCQxOGUwYjVkMEBQZW5ubz4=","referencesHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98903,"nextInTopic":98919,"prevInTime":98903,"nextInTime":98905,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"When you think of all the little ones that prefer not to do things in classes or groups of strangers -( In my own and own extended family this is  pretty","messageBody":"<div id=\"ygrps-yiv-1255762696\">When you think of all the little ones that prefer not to do things in classes or groups of &quot;strangers&quot;-( In my own and own extended family this is  pretty common -<br/>\nJust think of all those little 5 yr old Kindergarten kids that are made to go off to school every day. Mine included. Which is why we smartened up with our ggd&#39;s and took them out of Kindergarten  half way thru the year. <br/>\nThey however  did ask for and enjoy some group sports (very laid back small  fun groups ) when  we were always there.This was at about age 6.<br/>\nThey have always been free to come back to us  or leave if they werent in the mood.<br/>\nTheir schooled cousins  never wanted to do other  activitys at that age. School was enough for them  then.<br/>\nWe took their mother to playschool because  we thought she need to &quot;play&quot; with other kids. She was so shy and only played  near them. We thought we were doing the best thing for her. How stupid was that?<br/>\nGrace<br/>\nIn the damp and chilly mountains of BC<br/>\nWhere the girls are still cozy in bed.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6108969,"authorName":"Marcia Miller","from":"Marcia Miller &lt;marcia@...&gt;","profile":"bensmom93","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] &quot;being with Mom all the time&quot;","postDate":"1093622492","msgId":98903,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMkY1QURDLjEwMDAxMDVAdGhvcm50b25jcmVlay5jb20+","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4=","referencesHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98902,"nextInTopic":98904,"prevInTime":98902,"nextInTime":98904,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"My son (now 10) was similar to your son when he was younger.  He watched for a long time as other kids joined classes and away-from-home activities like","messageBody":"<div id=\"ygrps-yiv-1357156120\">My son (now 10) was similar to your son when he was younger.  He watched <br/>\nfor a long time as other kids joined classes and away-from-home<br/>\nactivities like swimming lessons, soccer, gymnastics & baseball.<br/>\nHe just wasn&#39;t interested.  He preferred playing with friends or doing<br/>\nfamily activities.  So we found things we could do together:<br/>\n<br/>\nPlaytime with friends<br/>\nChildren&#39;s theater performances<br/>\nVisits to the zoo, science center, children&#39;s museums<br/>\nFamily swims at the local pool<br/>\nFamily whale watching trips<br/>\nBuilding model rockets and setting up an annual &quot;rocket day&quot; event<br/>\n<br/>\nIt wasn&#39;t until my son was seven that he was interested in a gymnastics<br/>\nclass, but only after watching two friends in this class for about a<br/>\nyear.  He started with a once a week class and then added another when<br/>\nhe was ready.  Quite a while later we joined a family unicycling club.<br/>\n<br/>\nHe loved playing baseball at the park, but didn&#39;t want to play on a<br/>\nteam until he was nine years old.  Then he was ready, and he loved it.<br/>\nIt didn&#39;t take very long to learn the basic team skills because he was<br/>\nreally interested and serious about playing ball.   The coach really<br/>\nliked his hard work and good attitude.  Many of the other kids seemed<br/>\nbored and not very motivated to learn to play the game well.  I think it<br/>\nwas just one more activity among many for them to attend.  If your son<br/>\nis interested in these types of activities, he&#39;ll come to them in his<br/>\nown good time.<br/>\n<br/>\nHappy mothering,<br/>\nMarcia</div>","specialLinks":[]},{"userId":162707139,"authorName":"Kristina Kahney","from":"Kristina Kahney &lt;kkahney@...&gt;","profile":"kkahney","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093585882","msgId":98902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI3MDU1MTIyLjU1NzYucW1haWxAd2ViODA3MDgubWFpbC55YWhvby5jb20+","inReplyToHeader":"PDIwMDQwODI2MTQxNS41NDE0MS5qb3lmdWxsaWZlQG13dC5uZXQ+"},"prevInTopic":98899,"nextInTopic":98903,"prevInTime":98901,"nextInTime":98903,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"Gosh, I live in such a bubble, I think, LOL! It s hard for me to imagine kids of this age running out wanting to do things away from parents (though I m sure","messageBody":"<div id=\"ygrps-yiv-488686975\">Gosh, I live in such a bubble, I think, LOL! It&#39;s hard for me to imagine kids of this age running out wanting to do things away from parents (though I&#39;m sure some do).  I just think it is so completely normal for kids that are 5-6-7 yrs old to be hesitant to do classes, group activites, ect. without mom (or even with sometimes). Especially the oldest child.<br/>\n <br/>\nMy 7 yo just started dance last year, and really loves it. She waited until she felt comfortable going &quot;to a class&quot; (as she says) even though she talked about &quot;dance class&quot; since she was 4 or 5. <br/>\n <br/>\nMy 5 (almost 5.5) yr old son says he wants to try soccer this fall. He&#39;s not a group kid at all, and is not sure about all of the rules. I assured him if he wasn&#39;t comfortable, for whatever reason, then he doesn&#39;t have to go. We&#39;ll see what he thinks of it, but honestly I&#39;m surprised he&#39;s wanting to do it. I think seeing his sister go to &quot;classes&quot; is pushing him along a bit sooner.<br/>\n <br/>\nSo, anyway, it all sounds very normal to me...for whatever that&#39;s worth ;)<br/>\nKristina<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59461774,"authorName":"Sarah","from":"Sarah &lt;sarahanne1@...&gt;","profile":"sarahanne1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093558525","msgId":98897,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI2MjIxNTI1LjIxNDEzLnFtYWlsQHdlYjUyMzAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98895,"nextInTopic":98899,"prevInTime":98896,"nextInTime":98898,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"You ve already gotten a lot of great advice, but I couldn t resist! I have a 5.5 year old daughter who has been raised *very* attached.  Still co-sleeping,","messageBody":"<div id=\"ygrps-yiv-598751746\">You&#39;ve already gotten a lot of great advice, but I<br/>\ncouldn&#39;t resist!<br/>\n<br/>\nI have a 5.5 year old daughter who has been raised<br/>\n*very* attached.  Still co-sleeping, nursed for years,<br/>\netc.  About six months ago, all on her own, she went<br/>\nfrom being by my side 24/7 to sleepovers at Grandma&#39;s<br/>\nand friend&#39;s houses.  I am so happy when I see her<br/>\nsmiling as she goes off into new territory.  I am<br/>\nhappy because it has been on her terms and she&#39;s<br/>\nproud.<br/>\n<br/>\nWe tried T-ball for one (half) day.  We tried it<br/>\nbecause we had moved to a new neighborhood, and the<br/>\npark is a block from our house.  Sophia wanted to take<br/>\nit...just for the outfit.  Before the coach even<br/>\nstarted to make it fun, he listed all the rules.  It<br/>\nwas awful.  It would have been awful for me, and it<br/>\ndefinitely was for her.  She was done after batting<br/>\nonce and we never looked back.  Classes don&#39;t make<br/>\nthings fun.  She, by the way, likes to play ball in<br/>\nour backyard once in a while.<br/>\n<br/>\nI think it is important to remember, too, that there<br/>\nis not much *real* interacting in a social way at<br/>\nthose types of classes.  There is one teacher who<br/>\ncannot by available in a real one-on-one relationship<br/>\nwith each child, and there are a bunch of kids who are<br/>\nnot allowed to talk to each other.  &quot;We are here to<br/>\nplay ball!&quot;<br/>\n<br/>\nOn another note, though, maybe you could invite<br/>\nsomeone to your home, as a dinner guest, who shares<br/>\ninterests with your son.  It is not a class.  But I&#39;m<br/>\nsure a lot (more) could be learned that way.  Also, a<br/>\nlot of teachers would let you sit in on a class, if<br/>\nthere&#39;s a class your son wants, especially if you<br/>\nvolunteer to help!<br/>\n<br/>\nSarah Anderson-Thimmes<br/>\n<br/>\n<br/>\n--- Shannon Entin &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:entinfamily@...\">entinfamily@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hello! I am new to this list, have been reading for<br/>\n&gt; several weeks and <br/>\n&gt; enjoying the conversation and information.  <br/>\n<br/>\n<br/>\n\t<br/>\n\t\t<br/>\n </span></blockquote>__________________________________<br/>\nDo you Yahoo!?<br/>\nNew and Improved Yahoo! Mail - 100MB free storage!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promotions.yahoo.com/new_mail\">http://promotions.yahoo.com/new_mail</a></div>","specialLinks":[]},{"userId":162967824,"authorName":"Dawn Adams","from":"&quot;Dawn Adams&quot; &lt;Wishbone@...&gt;","profile":"bluenosegoddess","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093555305","msgId":98895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2IwMWM0OGJiNyQwMThmZTRlMCQ5YzRjZGUxOEBhb2xkc2wubmV0Pg==","referencesHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98894,"nextInTopic":98897,"prevInTime":98894,"nextInTime":98896,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"... I think so! :) Why bother with related classes? Why not pick up some fantasy roleplaying games for your computer, some neat related library books and","messageBody":"<div id=\"ygrps-yiv-432226487\">Shannon writes:<br/>\n<blockquote><span title=\"ireply\">   &gt;So my question is - does anyone have any advice on how to work with this <br/>\n  &gt;personality style?  I can see clearly what he is interested in, but quite <br/>\n  &gt;often I just don&#39;t know how to further his learning without looking for <br/>\n  &gt;&quot;outside&quot; help (class, etc.)  For example, he is extremely interested in <br/>\n  &gt;medieval living, especially the fighting. (And I have read with great <br/>\n  &gt;interest the recent thread on SCA.) I suggested a fencing class or getting <br/>\n  &gt;involved in a Ren Faire. He tells me very bluntly that he will only do it <br/>\n  &gt;if I do it with him.  OK, but it&#39;s not that easy to find this type of <br/>\n  &gt;scenario. Most will expect the children to participate with other children <br/>\n  &gt;- not adults.  Am I just looking in the wrong places?<br/>\n  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n </span></blockquote>  I think so! :) Why bother with related classes? Why not pick up some fantasy roleplaying games for your computer, some neat related library books and videos, some middle ages looking stuff  (swords, armour) in the halloween aisles, some related toys and anything else he can explore on his own or with you? I was like him as a young child. Going to school, pushing me into lessons, all it did as far as I&#39;m concerned was help delay my social development until I was out of high school where I could finally aproach things on my own terms. Pushing someone into something they don&#39;t want to do just causes them to dig in their heels. Let him decide when he&#39;s ready. He&#39;s obviously not yet. <br/>\n<br/>\n  Dawn (in NS)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":192290539,"authorName":"Emile Snyder","from":"Emile Snyder &lt;unschooling@...&gt;","profile":"emiledsnyder","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the\ttime&quot;","postDate":"1093548518","msgId":98894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwOTM1NDg1MTguMTM1OTIuNTEuY2FtZWxAYmFzYWx0Pg==","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4=","referencesHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98893,"nextInTopic":98895,"prevInTime":98893,"nextInTime":98895,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"... When I was young I was interested in a succession of weird hobby things: fly tying, flint knapping, archery, lapidary, traditional story telling, metal","messageBody":"<div id=\"ygrps-yiv-1413729738\">On Thu, 2004-08-26 at 06:13, Shannon Entin wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; So my question is - does anyone have any advice on how to work with this <br/>\n&gt; personality style?  I can see clearly what he is interested in, but quite <br/>\n&gt; often I just don&#39;t know how to further his learning without looking for <br/>\n&gt; &quot;outside&quot; help (class, etc.)  For example, he is extremely interested in <br/>\n&gt; medieval living, especially the fighting. (And I have read with great <br/>\n&gt; interest the recent thread on SCA.) I suggested a fencing class or getting <br/>\n&gt; involved in a Ren Faire. He tells me very bluntly that he will only do it <br/>\n&gt; if I do it with him.  OK, but it&#39;s not that easy to find this type of <br/>\n&gt; scenario. Most will expect the children to participate with other children <br/>\n&gt; - not adults.  Am I just looking in the wrong places?<br/>\n<br/>\n </span></blockquote>When I was young I was interested in a succession of &quot;weird&quot; hobby<br/>\nthings: fly tying, flint knapping, archery, lapidary, traditional story<br/>\ntelling, metal working, SCA, trapping (boy, I look back and cringe at<br/>\nhow violent I seem to have been!)  Somehow, my parents managed to find<br/>\npeople willing to relate to this random kid (me) about most of these<br/>\nthings.  My dad found a blacksmith that was willing to let me come see<br/>\nhis forge and taught me some basics of using one.  Also found an old guy<br/>\nin the area that was a fur trapper who let me come over and see how it<br/>\nworked and stuff, got me going on that for awhile.  A friends dad took<br/>\nus both to learn sword and dagger fighting from an SCA guy, and found a<br/>\ncool teenage juggler who we learned juggling stuff from.  My aunt and<br/>\nuncle found someone who chipped arrowheads that I got to learn that<br/>\nfrom.<br/>\n<br/>\nMy point is, none of these were classes, just finding people with the<br/>\nright skills who were willing to share.  In that kind of situation it&#39;s<br/>\nmuch less &quot;weird&quot; for you and your son to learn them together.  And if<br/>\nyour son can form a real relationship (not just a teacher/student one)<br/>\nwith the expert then maybe he would ultimately feel more comfortable<br/>\nworking with them alone?<br/>\n<br/>\nI don&#39;t really know how my parents did it; I&#39;m not that good at finding<br/>\nand befriending random strangers.  But it sure made my life cool that my<br/>\nparents could!<br/>\n<br/>\nGood luck,<br/>\n-emile</div>","specialLinks":[]},{"userId":177721839,"authorName":"Game-Enthusiast","from":"&quot;Game-Enthusiast&quot; &lt;game-enthusiast@...&gt;","profile":"autonomousangela","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093548456","msgId":98890,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI2MTkyNzM2LlVWQlEyNDY5My5tdGExMy5hZGVscGhpYS5uZXRAbGVpZ2g+","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98888,"nextInTopic":98891,"prevInTime":98889,"nextInTime":98891,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"You wrote: We do not receive any support from our extended family in our unschooling decision. We are constantly asked are you still planning to homeschool? ","messageBody":"<div id=\"ygrps-yiv-775105032\">You wrote:<br/>\n We do not receive any support from our extended family in our unschooling <br/>\ndecision. We are constantly asked &quot;are you still planning to homeschool?&quot; <br/>\n(Forget about even discussing unschooling - &quot;home&quot;schooling is tough enough <br/>\nfor them to accept.) <br/>\n <br/>\n----------------------<br/>\n <br/>\nI only discuss unschooling with people who I feel have a valid interest or<br/>\nwho I feel will support it, if that&#39;s an issue.  It&#39;s hard sometimes to find<br/>\nlike-minded  people, but I&#39;d encourage you to keep searching through<br/>\nattending homeschool events (or setting up your own, like a game of wiffle<br/>\nball at the park)  until you find a family or two that both you and your son<br/>\nhit it off with.  <br/>\n <br/>\nHaving that support is very valuable to me.  I actively searched for a<br/>\nfriend who would understand unschooling.  It&#39;s not my nature to seek people<br/>\nout, generally, but I felt we had a need and so I kept my antennae up,<br/>\nlooking for someone that might fit the bill.  My girls were invited to a<br/>\nbirthday party a year and a half ago and I  chatted with another mom whose<br/>\ndd was also at the party and had a dd the same age as my oldest. Our lives<br/>\nhad a lot of parallels and I just had a feeling that we could all be good<br/>\nfriends.  It isn&#39;t my tendency to call up people I&#39;ve just met and ask them<br/>\nto visit, but after the party I got her email address from the lady who<br/>\nhosted the party and emailed and asked her if she wanted to get together for<br/>\na play date.  I am so glad I did.  She and her dd are now our unschooling<br/>\nsupport and best friends.<br/>\n <br/>\nKeep looking and maybe you will find the support you need.<br/>\n  <br/>\n ------------------------ <br/>\n You wrote:<br/>\nMy son is quite attached to Mom & Dad. He has no interest in participating <br/>\nin any type of class, sport team, instruction, etc, unless I am right by <br/>\nhis side. We have tried a couple trial classes (in things that he seems to <br/>\ntruly enjoy such as tae kwon do and gymanstics), and he typically lays on <br/>\nthe floor and cries. He will not &quot;line up&quot; or do what the other kids are <br/>\ndoing or follow the instructor. <br/>\n--------------------------------<br/>\n <br/>\nMy girls are just like that.  For a while I felt like attending group things<br/>\nwas something we *should* do.  &lt;got to have well rounded kids, you<br/>\nknow...ack!&gt;  I finally accepted that my kids were just happier staying home<br/>\nor visiting with friends.  (Glad it didn&#39;t take me too long to learn that!)<br/>\nI stopped trying to get them to go to different events.  I still offer to<br/>\ntake them to things that come up, if I think they are interested, but if<br/>\nthey decline then I drop it. Life is better this way.  They are happier and<br/>\nI am less stressed.  It&#39;s no fun anyway to go to a group event and have your<br/>\nkids clinging to your legs.  He&#39;ll begin to go to things that interest him<br/>\nwhen HE is ready.  <br/>\n ------------------------------------------ <br/>\nMy family tells me it is &quot;unhealthy&quot; for him to be with me (or Dad) all the <br/>\ntime and he needs to be able to interact with others and follow instruction <br/>\nfrom others. <br/>\n <br/>\n--------------------------------------<br/>\n <br/>\nWhat the heck do they know?  LOL! <br/>\n <br/>\n-------------------------------------<br/>\n You wrote:<br/>\n   I do not agree with this, but on some level it does eat away <br/>\nat me deep inside. I was in every class imaginable as a child and I think <br/>\nit is hard for me to understand how he could not want to participate in <br/>\nthese types of things. But I have realized that I need to accept his <br/>\npersonality and find ways to work WITH it, not against it. <br/>\n----------------------------------------<br/>\nTry not to let their questioning of you make you question yourself.  No one<br/>\nbecomes more outgoing by being forced to interact with other people.  If<br/>\nanything it will make them withdraw further into themselves.  He just needs<br/>\ntime and space to develop at his own pace.  <br/>\n <br/>\nMy VERY shy dd (9) (never could have imagined this a couple years ago and<br/>\nit&#39;s still hard to believe a year later) entered her cat in a pet show last<br/>\nfall and stood up in front of a dozen or 20 people and read some notes about<br/>\nher pet.  (same kid who wouldn&#39;t read in front of anyone for several years.)<br/>\nThen she answered questions from the group.  I read about the show on a<br/>\nlocal homeschool list. I mentioned it to the girls.  Both wanted to go.  We<br/>\nwrote up some notes together and typed them up and both girls followed<br/>\nthrough with the presentation. (at the last minute I wasn&#39;t sure it was<br/>\ngoing to work and the cat shit in the crate in the van and got some on him,<br/>\nbut hey.  LOL!)   It was a homeschool event, but we knew NO ONE there.  I<br/>\nwas so proud of them for stepping outside their comfort zone and both girls<br/>\nwere very proud of themselves.  It is a fond memory to them and they hope<br/>\nsomeone makes another pet show this fall.  If no one does, maybe we will<br/>\nhost the event.<br/>\n --------------------------------------------- <br/>\n You wrote:<br/>\nSo my question is - does anyone have any advice on how to work with this <br/>\npersonality style?  I can see clearly what he is interested in, but quite <br/>\noften I just don&#39;t know how to further his learning without looking for <br/>\n&quot;outside&quot; help (class, etc.) <br/>\n__________________________<br/>\n <br/>\nI would suggest books (look for some historically based novels for kids on<br/>\nthe era that interests him.)  or going to events that you can watch instead<br/>\nof being forced to participate in.   My kids like historical things but<br/>\nstill don&#39;t want to participate in most things.  This weekend we went to a<br/>\nNative American Pow Wow and we just observed the music and dancing and<br/>\nlooked in all the little booths that were selling things.  They had a dance<br/>\nfor children where they threw candy and toys in a big circle and the kids<br/>\nwere suppose to dance until the music stopped and then they could pick up<br/>\ncandy.  The kids enjoyed watching, but didn&#39;t want to participate.  That was<br/>\nfine with me. <br/>\n <br/>\nYou could also try to make homemade period items or find out how kids lived<br/>\nin those times.<br/>\n <br/>\n--------------------------------------------------------<br/>\n <br/>\n  You wrote:<br/>\n  For example, he is extremely interested in <br/>\nmedieval living, especially the fighting. (And I have read with great <br/>\ninterest the recent thread on SCA.) I suggested a fencing class or getting <br/>\ninvolved in a Ren Faire. He tells me very bluntly that he will only do it <br/>\nif I do it with him. <br/>\n <br/>\n-----------------------------------------------<br/>\n <br/>\nMaybe you could go watch a fencing class together somewhere?<br/>\n <br/>\n-----------------------------------------------------------<br/>\n You wrote:<br/>\n But the part of me that <br/>\nis &quot;schooled&quot; is concerned that he may be missing his chance for many <br/>\nthings.  <br/>\n <br/>\n------------------------------------<br/>\n <br/>\nYeah, he will be missing things.  He&#39;ll miss being forced to participate in<br/>\nthings that he doesn&#39;t want to, for his own good.  Don&#39;t worry about it.<br/>\nReally!<br/>\n-----------------------------<br/>\n You wrote:<br/>\n For example, the typical schooled child will begin on a T-ball or <br/>\nlittle league team (my son also loves baseball, when played by *his* rules <br/>\nwith Mom & Dad) at, what, age 5 or 6? So if my son is not comfortable <br/>\nparticipating on a team until he&#39;s 10 - how will we find a &quot;place&quot; for him <br/>\nsince he has not started on the same level? <br/>\n--------------------------------------- <br/>\n <br/>\nMy kids like to play wiffle ball and for the last couple of springs we&#39;ve<br/>\nwritten a note to a local homeschool list that we will be at the park with<br/>\nballs, bats, and plates at such and such a time, if anyone wants to join us.<br/>\nWe&#39;ve had good luck with this and everyone has like playing with our relaxed<br/>\nrules  (OK, no rules)  The kids hit the ball and run the bases and field<br/>\nballs, if there are enough kids.    It&#39;s fun. <br/>\n <br/>\nRelax and enjoy your little boy.  :0)<br/>\n <br/>\nAngela <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:game-enthusiast@...\">game-enthusiast@...</a><br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":131255249,"authorName":"Cornerstone Community Farm","from":"Cornerstone Community Farm &lt;joyfullife@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093547754","msgId":98899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI2MTQxNS41NDE0MS5qb3lmdWxsaWZlQG13dC5uZXQ+","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4=","referencesHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98897,"nextInTopic":98902,"prevInTime":98898,"nextInTime":98900,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"... Relax.  Let him grow and stretch his wings.  He will eventually become more social...pushing him can hurt him. Study done on homeschoolers shows the","messageBody":"<div id=\"ygrps-yiv-2114192844\">On Thursday 26 August 2004 08:13, Shannon Entin wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; My family tells me it is &quot;unhealthy&quot; for him to be with me (or Dad)<br/>\n&gt; all the time and he needs to be able to interact with others and<br/>\n&gt; follow instruction from others. I do not agree with this, but on<br/>\n&gt; some level it does eat away at me deep inside.<br/>\n <br/>\n </span></blockquote>Relax.  Let him grow and stretch his wings.  He will eventually become <br/>\nmore social...pushing him can hurt him.<br/>\n<br/>\nStudy done on homeschoolers shows the average homeschooler is in 5.2 <br/>\nactivies per kid.  (4-H, Boy Scouts, church, volley ball, etc.)<br/>\n<br/>\nAt a young age you can take him to the zoo, museums, parks, library, <br/>\netc.  lots of chances for you & dad to model social interaction.<br/>\nKeith</div>","specialLinks":[]},{"userId":179914923,"authorName":"Carmen McFarlin","from":"&quot;Carmen McFarlin&quot; &lt;cemcfarlin@...&gt;","profile":"cemcfarlin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093547363","msgId":98893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnbGNoMys1bWE1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDQxMkUyOTkwLjIwNzAyMDNAZWFydGhsaW5rLm5ldD4="},"prevInTopic":98892,"nextInTopic":98894,"prevInTime":98892,"nextInTime":98894,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"Dear Betsy and Elizabeth, First, let me introduce myself.  My name is Carmen and I live in Austin, Texas, with my husband Michael, and our three daughters, ","messageBody":"<div id=\"ygrps-yiv-1897913941\">Dear Betsy and Elizabeth,<br/>\n<br/>\nFirst, let me introduce myself.  My name is Carmen and I live in <br/>\nAustin, Texas, with my husband Michael, and our three daughters, <br/>\nages 5, 2.5, and 15 months.<br/>\n<br/>\nMy oldest daughter, Eva, is very cautious and does not like to <br/>\nparticipate in large groups of anything.  Sometimes, even meeting <br/>\nONE new person can overwhelm her and send her into my lap (as <br/>\nhappened last week when we tried to meet with a piano teacher).  We <br/>\ntried dance class...lasted a month, with me in the room the whole <br/>\ntime so that she could check in with me whenever she needed to.  We <br/>\ndid do a year of pre-school for three hours four times a week.  She <br/>\nhid behind me at the door or would go slowly toward an acitivity <br/>\narea, avoiding eye contact with any of the teachers or kids.  She <br/>\nenjoys people, just on HER terms, which usually means small groups <br/>\nand knowing where I am at all times.  She went to vacation bible <br/>\nschool for the firt time this past June, but her grandmother (who <br/>\nshe&#39;s very close to) was with her the whole time and it was at a <br/>\nchurch that she has gone to since she was two (but this is the first <br/>\nyear she would try vbs).<br/>\n<br/>\nI used to be really bothered by all of this and wondered if I needed <br/>\nto &quot;toughen&quot; her up.  But I realized that this was because I had <br/>\nbeen forced to develop a false bravado as a child as a defense <br/>\nmechanism.  My parents divorced when I was two and I was shuffled <br/>\nbetween relatives/friends/daycare as my mom had to work.  She <br/>\nremarried when I was six and looking back, I realized that I was <br/>\nreally miserable but tried my darndest to hide it.  I acted out a <br/>\nlot and became very sarcastic and snotty and tried to pretend <br/>\nnothing bothered me(STILL working on that!). <br/>\n<br/>\nI think Betsy is very right when she talks about that old-school <br/>\nmentality of forcing kids into situations to &quot;toughen them up&quot;.  I <br/>\nremember telling another pre-school mom that if Eva didn&#39;t want to <br/>\ngo to pre-school, she didn&#39;t have to...and the mom was just <br/>\nflabbergasted.  &quot;How will she EVER learn that she HAS to do things, <br/>\nespecially those things she doesn&#39;t want to?&quot; she gasped.  How, <br/>\nindeed?!  What if she learned instead that she could stay at home <br/>\nand play with mom and her two younger sisters and be happy and safe <br/>\nand that her mom and dad would never force her into a room full of <br/>\nstrangers and then walk away, telling her all the while that &quot;it&#39;ll <br/>\nbe okay, honey&quot;?  Yes, it might turn out to be fun, IF she stopped <br/>\ncrying or hiding in the corner.  What about the damage I had done to <br/>\nher trust of us?  How much better if EVA chose to go into that room <br/>\nof her own accord?  And if that never happens, so be it.  Life is <br/>\nfull of other things, other riches, that aren&#39;t exclusive to a dance <br/>\nclass, an art class, an acting class...all of those things that I&#39;ve <br/>\ntried and that we now, SHOCK, do at home!<br/>\n<br/>\nI think that&#39;s been the biggest challenge for me in my unschooling <br/>\njourney...learning to let go of expectations and just following my <br/>\ndaughters&#39; lead.  I know in the long run that each of my daughters <br/>\nwill have a true sense of themselves since they were never forced to <br/>\nbe someone they were not, or never allowed to be who they truly <br/>\nwere.  And I, in the process, am getting to know myself all over <br/>\nagain.<br/>\n<br/>\nThanks to all of you for sharing your experiences, doubts, fears, <br/>\nvictories, and advice.  Life is so exciting and overwhelming at <br/>\ntimes, but I always come away from reading these posts with a <br/>\nrenewed sense of purpose.<br/>\n<br/>\nBest,<br/>\nCarmen McFarlin</div>","specialLinks":[]},{"userId":88821644,"authorName":"christy austin","from":"christy austin &lt;romance9398@...&gt;","profile":"romance9398","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093545542","msgId":98892,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwODI2MTgzOTAyLjUyNjU1LnFtYWlsQHdlYjUxNjAzLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDQxMkUyOTkwLjIwNzAyMDNAZWFydGhsaW5rLm5ldD4="},"prevInTopic":98891,"nextInTopic":98893,"prevInTime":98891,"nextInTime":98893,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"... It states many times in the Bible that parents are supposed to raise (teach) their children.  I don t know when society decided that it was better for our ","messageBody":"<div id=\"ygrps-yiv-1536933963\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; ** My family tells me it is &quot;unhealthy&quot; for him to<br/>\n&gt; be with me (or Dad) <br/>\n&gt; all the<br/>\n&gt; time...**<br/>\n&gt; <br/>\n&gt; I had to comment on this from a christian mindset. <br/>\n </span></blockquote>It states many times in the Bible that parents are<br/>\nsupposed to raise (teach) their children.  I don&#39;t<br/>\nknow when society decided that it was better for our<br/>\nchildren to let other people raise them but they did. <br/>\nAccording to society, strangers can educate our<br/>\nchildren better, know what is better for them and will<br/>\ncreate better, more productive adults.  I do not<br/>\nbelieve this and I encourage you to believe that you<br/>\nare his parent and know what is best for him.  Whether<br/>\nyou are a christian or not, in my mind you are the<br/>\nparent that God chose for him and you are the best<br/>\nparent for him.  Believe in yourself, turn aside the<br/>\nquestions with the answers you believe in and go ahead<br/>\nwith what you know to be the best for your child.  <br/>\nChristy Austin<br/>\n<br/>\n<br/>\n\t\t<br/>\n_______________________________<br/>\nDo you Yahoo!?<br/>\nWin 1 of 4,000 free domain names from Yahoo! Enter now.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://promotions.yahoo.com/goldrush\">http://promotions.yahoo.com/goldrush</a></div>","specialLinks":[]},{"userId":154575365,"authorName":"Laura Johnson","from":"&quot;Laura Johnson&quot; &lt;lauraj2@...&gt;","profile":"imakebelieve2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093545123","msgId":98891,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzEwMWM0OGI5YSRmYjkwOWVjMCQ2ZjYzMDgwNEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98890,"nextInTopic":98892,"prevInTime":98890,"nextInTime":98892,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"Hi Shannon, Your little guy sounds like mine and so does your extended family.  Ben is 5.5 and really only wants to do things if I am with him, or his dad.","messageBody":"<div id=\"ygrps-yiv-1806512625\">Hi Shannon,<br/>\nYour little guy sounds like mine and so does your extended family.  Ben is 5.5 and really only wants to do things if I am with him, or his dad.  He&#39;ll go to a friend&#39;s house to play without me, for a few hours and he has a teenage sitter that he really likes, so he is able to be without us, but he prefers to be with me or his dad.  Which works out well because we prefer it when he&#39;s with us.<br/>\n<br/>\nMy mom and dad are so overly concerned that he is not with other people.  &quot;he really needs to be away from you some of the time, this is not normal or healthy for him to be so dependent on you.&quot;  Blah, blah blah.  It makes them crazy that they have friends whose grandkids come and stay most of the summer when they are only 4-5, and he won&#39;t even stay overnight.  My dad is a huge grouch and a ball of stress, that probably has more to do with it than anything with them.  He doesn&#39;t like to be there without me.<br/>\n<br/>\nHe also won&#39;t take any classes unless I stay.  We have great science classes at museums and zoos, when I suggested one that he could go alone for an hour and a half, he said no way!  So, I go with him.  <br/>\n<br/>\nAs far as it lasting forever, one of my fellow LLL leaders told me this when I asked her about it.  Her son never left her side, was homeschooled, co-sleeping, extended nursing, basically similar to us.  She thought he&#39;d never become dependent.  At the time I asked her about it, he was traveling through Europe alone, and she hadn&#39;t talked with him in 2 weeks because he has no cell phone with him, and very little money.  He is 23.  <br/>\nSo it does happen eventually.<br/>\n<br/>\nMy ds hasn&#39;t really showed an interest in sports, he&#39;s small for his age and not very athletic (if there is such a thing at 5).  I guess I&#39;m just going to let him go at his own pace for things.  I don&#39;t have any advice or help, but just wanted to let you know, you are not alone.  <br/>\nLaura J<br/>\nTampa<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093544336","msgId":98888,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMkUyOTkwLjIwNzAyMDNAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4=","referencesHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":98887,"nextInTopic":98890,"prevInTime":98887,"nextInTime":98889,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"** We do not receive any support from our extended family in our unschooling decision. We are constantly asked are you still planning to homeschool? (Forget","messageBody":"<div id=\"ygrps-yiv-534519079\">** We do not receive any support from our extended family in our <br/>\nunschooling<br/>\ndecision. We are constantly asked &quot;are you still planning to homeschool?&quot;<br/>\n(Forget about even discussing unschooling - &quot;home&quot;schooling is tough enough<br/>\nfor them to accept.)**<br/>\n<br/>\n(My son is 10.)<br/>\n<br/>\nWhen my son was &quot;kindergarden age&quot; I nearly avoided in-laws for an <br/>\nentire year.  So, it appears that fear of criticism is an issue that <br/>\neven mouthy and outspoken people like me can have a problem with.  You <br/>\nare not alone.   (I stopped hiding after the first year.  I stress to <br/>\nthe grandparents the advantages of having a kid who is free to spend a <br/>\nday with relatives any time they are in town.  And I&#39;ll shamelessly tell <br/>\nthem that I think having time to be with extended family is more <br/>\nvaluable than being in school.  One can learn a lot about history, <br/>\nculture, and any other special interests from family members.)<br/>\n<br/>\n** My son is quite attached to Mom & Dad. He has no interest in <br/>\nparticipating<br/>\nin any type of class, sport team, instruction, etc, unless I am right by<br/>\nhis side. We have tried a couple trial classes (in things that he seems to<br/>\ntruly enjoy such as tae kwon do and gymanstics), and he typically lays on<br/>\nthe floor and cries.**<br/>\n<br/>\nThere&#39;s a big variation in how much kids like group activites.  I did <br/>\nsome Kindermusik when my son was three, and even though the mom or dad <br/>\nis there sitting on the floor doing the musical activities with the kid <br/>\nand dancing around in circles with them, there were some kids that <br/>\ndeclined to participate most of the time.  I don&#39;t think it&#39;s good to <br/>\nforce it.  I won&#39;t insist that my son do an activity that he is opposed to.<br/>\n<br/>\nI have an only child, and sometimes I borrow a more enthusiastic child <br/>\nwhen we are going some place with activities.  (I volunteered my husband <br/>\nto supervise an extra kid at the Sacramento conference so the boys could <br/>\nplay on the game deck and go do the climbing wall together.)<br/>\n<br/>\n** My family tells me it is &quot;unhealthy&quot; for him to be with me (or Dad) <br/>\nall the<br/>\ntime...**<br/>\n<br/>\nI don&#39;t believe that this is true.  I think it&#39;s a leftover from <br/>\nold-fashioned, Germanic parenting that was reinforced by Freud.  The <br/>\nunderlying belief is that a boy who spends a lot of time being close to <br/>\nhis mom will be a &quot;girlie-man&quot; (as Ahnold calls it) and won&#39;t be hard <br/>\nand cold enough to be a valuable member of the Prussian army.  Let&#39;s <br/>\nthink about goals here! &lt;g&gt;  We&#39;re not trying to raise relentless <br/>\nkilling machines &lt;g&gt;, so let&#39;s throw out the tactics that were developed <br/>\nfor that.<br/>\n<br/>\n** I do not agree with this, but on some level it does eat away<br/>\nat me deep inside.**<br/>\n<br/>\nYeah, I&#39;m always more comfortable when other people agree with me.<br/>\n<br/>\n**I was in every class imaginable as a child and I think<br/>\nit is hard for me to understand how he could not want to participate in<br/>\nthese types of things. But I have realized that I need to accept his<br/>\npersonality and find ways to work WITH it, not against it.**<br/>\n<br/>\nRight.  People are different.  My mom was really extroverted and really <br/>\nneeded to get out of the house, and as a kid I ended up feeling that I <br/>\nwas inferior because I wasn&#39;t as &quot;brave&quot; and good with people as she <br/>\nwas.  (Yes, she got impatient with my shyness a lot.)  (I&#39;m not saying <br/>\nyou are the same, it&#39;s just the first thing that springs into my mind <br/>\nwhen I try to visualize a kid that doesn&#39;t want to be in class.)<br/>\n<br/>\n** So my question is - does anyone have any advice on how to work with this<br/>\npersonality style? **<br/>\n<br/>\nDo you go to a local unschooling or homeschooling park day?  (That&#39;s my <br/>\nknee jerk &quot;solution&quot; to every social problem.)  It might be great to <br/>\nfind another kid that has a really similar temperament and then do stuff <br/>\nwith him.<br/>\n<br/>\nAnd keep repeating the quote about education not being &quot;filling a <br/>\npail&quot;.  Teaching doesn&#39;t always cause good learning.  The teaching can <br/>\nbe confusing, or too slow, etc.  Kids who just mess around with stuff <br/>\ncan often learn more that way than through a class.<br/>\n<br/>\nI think you will be going through a process where you change from thinking:<br/>\n<br/>\n &quot;how can we learn more about this; I know there must be a class <br/>\nsomewhere?&quot; <br/>\nto<br/>\n&quot;how can we learn about this without taking a class?&quot;<br/>\nto<br/>\n&quot;how can we have fun with this?&quot;  <br/>\n<br/>\nIt&#39;s not at all surprising that classes might be your first idea if you <br/>\nyourself loved taking classes.  (My first idea is to always find a book <br/>\nabout something, and that&#39;s not what works with my kid.)  You&#39;re <br/>\nbranching out from your normal pattern of thinking to include wider and <br/>\nwider possibilities.  It&#39;ll take practice.<br/>\n<br/>\nI wish more classes let kids watch first.  If all the local parks and <br/>\nrec classes had video clips on their website, there&#39;s a chance that I <br/>\ncould get my kid to take more classes.<br/>\n<br/>\n**So if my son is not comfortable<br/>\nparticipating on a team until he&#39;s 10 - how will we find a &quot;place&quot; for him<br/>\nsince he has not started on the same level?**<br/>\n<br/>\nI don&#39;t know.  My son is 10 and doesn&#39;t play team sports.  My husband <br/>\nwanted to sign him up at 6, but I thought he was too tender and too <br/>\nlikely to burst into tears to play a game with a lot of rules with a lot <br/>\nof kids he didn&#39;t know.<br/>\n<br/>\nBetsy</div>","specialLinks":[]},{"userId":183835305,"authorName":"Shannon Entin","from":"Shannon Entin &lt;entinfamily@...&gt;","profile":"scrapbookershan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Intro & ? on &quot;being with Mom all the time&quot;","postDate":"1093526026","msgId":98887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMi4xLjEuMi4yMDA0MDgyNjA4NDczNS4wMzBiYTY3OEBwb3Auc2hhbm5vbmVudGluLmNvbT4="},"prevInTopic":0,"nextInTopic":98888,"prevInTime":98886,"nextInTime":98888,"topicId":98887,"numMessagesInTopic":0,"msgSnippet":"Hello! I am new to this list, have been reading for several weeks and enjoying the conversation and information.  I am Shannon, dh Paul, and ds Logan who will","messageBody":"<div id=\"ygrps-yiv-1022684050\">Hello! I am new to this list, have been reading for several weeks and <br/>\nenjoying the conversation and information.  I am Shannon, dh Paul, and ds <br/>\nLogan who will be 6 in November. And we have a baby girl due any day now! <br/>\nWe live in northwest NJ, very close to Easton, PA.  My greatest challenge <br/>\nso far has been to &quot;unschool myself&quot; and trust that learning will happen.<br/>\n<br/>\nWe do not receive any support from our extended family in our unschooling <br/>\ndecision. We are constantly asked &quot;are you still planning to homeschool?&quot; <br/>\n(Forget about even discussing unschooling - &quot;home&quot;schooling is tough enough <br/>\nfor them to accept.)<br/>\n<br/>\nMy son is quite attached to Mom & Dad. He has no interest in participating <br/>\nin any type of class, sport team, instruction, etc, unless I am right by <br/>\nhis side. We have tried a couple trial classes (in things that he seems to <br/>\ntruly enjoy such as tae kwon do and gymanstics), and he typically lays on <br/>\nthe floor and cries. He will not &quot;line up&quot; or do what the other kids are <br/>\ndoing or follow the instructor.<br/>\n<br/>\nMy family tells me it is &quot;unhealthy&quot; for him to be with me (or Dad) all the <br/>\ntime and he needs to be able to interact with others and follow instruction <br/>\nfrom others.  I do not agree with this, but on some level it does eat away <br/>\nat me deep inside. I was in every class imaginable as a child and I think <br/>\nit is hard for me to understand how he could not want to participate in <br/>\nthese types of things. But I have realized that I need to accept his <br/>\npersonality and find ways to work WITH it, not against it.<br/>\n<br/>\nSo my question is - does anyone have any advice on how to work with this <br/>\npersonality style?  I can see clearly what he is interested in, but quite <br/>\noften I just don&#39;t know how to further his learning without looking for <br/>\n&quot;outside&quot; help (class, etc.)  For example, he is extremely interested in <br/>\nmedieval living, especially the fighting. (And I have read with great <br/>\ninterest the recent thread on SCA.) I suggested a fencing class or getting <br/>\ninvolved in a Ren Faire. He tells me very bluntly that he will only do it <br/>\nif I do it with him.  OK, but it&#39;s not that easy to find this type of <br/>\nscenario. Most will expect the children to participate with other children <br/>\n- not adults.  Am I just looking in the wrong places?<br/>\n<br/>\nI know that he will not be &quot;hanging on my leg&quot; when he is 16 years old. I <br/>\ncherish the fact that he wants to be with me now. But the part of me that <br/>\nis &quot;schooled&quot; is concerned that he may be missing his chance for many <br/>\nthings. For example, the typical schooled child will begin on a T-ball or <br/>\nlittle league team (my son also loves baseball, when played by *his* rules <br/>\nwith Mom & Dad) at, what, age 5 or 6? So if my son is not comfortable <br/>\nparticipating on a team until he&#39;s 10 - how will we find a &quot;place&quot; for him <br/>\nsince he has not started on the same level?<br/>\n<br/>\nThanks for listening/reading. Looking forward to chatting with you all!<br/>\n<br/>\n<br/>\n&quot;Education is not the filling of a pail, but the lighting of a fire.&quot;<br/>\n-- William Butler Yeats<br/>\n<br/>\nShannon Entin<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:entinfamily@...\">entinfamily@...</a><br/>\nwww.ShannonEntin.com and www.TheEntins.com<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":98924,"nextTopicId":99167}}