{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Moments--good moments","postDate":"1342196940","msgId":68131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGOTU1M0Q4LTQyRDEtNDYyRS05NDQ3LTQ2N0JGMTlDNDU3MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":68130,"nextInTime":68132,"topicId":68131,"numMessagesInTopic":0,"msgSnippet":"I m going to put this on my site, and I m not sure where yet.  Linked to moments, I guess. The first part is page 198 of The Big Book of Unschooling,  2009 The","messageBody":"<div id=\"ygrps-yiv-831762239\">I&#39;m going to put this on my site, and I&#39;m not sure where yet.  Linked to moments, I guess.  <br/>\n<br/>\nThe first part is page 198 of The Big Book of Unschooling,  2009<br/>\n<br/>\nThe second part was added for the California Homeschool Network conference July 2011.<br/>\n<br/>\nIf anyone here would like to write up a moment when time seemed to stop because things came together in that way that only rarely happens,   and if you&#39;d like to allow me to share it on my site, please e-mail or leave it right in this topic.<br/>\n<br/>\n====================<br/>\n<br/>\nNo more bad days<br/>\n<br/>\nYears ago someone in the AOL homeschooling discussions said she never liked to think of &quot;a bad day,&quot; but only a bad moment. The next moment might always be better.  That idea changed my life.<br/>\n<br/>\nLast weekend, I was thinking a lot and talking a bit with some others about moments, about the value of moments, and hobbies, and work and activities. Moments have different value to different people, certainly.<br/>\n<br/>\nI&#39;m heating my hot tub, which uses wood. It&#39;s right at 100 and I&#39;m aiming for 105 degrees F, and the moon&#39;s coming into view through some trees and I was reminded of part of a Robert Louis Stevenson poem:<br/>\n<br/>\n...and the pail by the wall / Would be half full of water and stars.<br/>\n<br/>\n . . . .<br/>\n<br/>\nRecently I was thinking about moments, about how many hours of preparation or travel or build-up precede every magic moment in a life, and what makes a thing &quot;worth it.&quot;<br/>\n<br/>\nWhen, standing stirring my hot tub, I saw the moon this evening, with the past few days&#39; thoughts shuffling and settling in my head, I understood something about haiku for the first time ever. The good ones describe a moment, a perception—one point in time, and the breathtaking thought of an instant.<br/>\n<br/>\nMy next-door neighbor&#39;s name is Harry. He was in the Navy in WWII, on a submarine in the Pacific. He was young, and far from Pinos Altos, New Mexico, his boyhood home. He said the officer on watch invited him up to look out at the surface of the ocean, and he saw the rising moon&#39;s reflection like a silver road to the horizon. The day he described it to me I got a shiver.           (Harry Hickel died in the summer of 2009.)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://SandraDodd.com/badmoment\">http://SandraDodd.com/badmoment</a><br/>\n<br/>\n_________<br/>\nend of the book quote, beginning of 2011 addition) <br/>\n_________<br/>\n<br/>\n<br/>\nLife keeps flowing. <br/>\n<br/>\nI went to Scotland.  After I got interested in the stone walls in England, I stayed with an homeschooling family.  The dad was a drystone contractor, or Dyker.  He had read my book, and on a circuit to show me some stone stiles and a bridge he had made, he drove by a house that Robert Louis Stevenson had lived in.  It might have been the very place where he saw stars reflected in a pail of water.<br/>\n<br/>\nThat&#39;s how unschooling works.  I&#39;ve seen it in my kids their whole lives.  They meet people, they come across magazine articles or old movies, and they synthesize and incorporate, awake or asleep.  Tuesday night, Holly said she dreamed a long dream that seemed to last all night, and told us about it.  The next day Marty said he had dreamed a long, lucid dream.  In both cases they dreams included things they were excited about and still thinking about, still processing. <br/>\n<br/>\nThey were learning in their sleep.<br/>\n<br/>\n_________<br/>\nend of 2011 quote<br/>\n_________<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":68117,"nextTopicId":68118}}