{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Responsibilities of parents","postDate":"1371065000","msgId":71608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4MzZBM0ZFLUM3OUMtNEEzQy05OTE3LTU3NDA0RTFEOTA3OUBnbWFpbC5jb20+","inReplyToHeader":"PDFCQkVEQzg0LTlERjUtNDRERi1CQkFGLTlERjRFRTE2N0EyQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDNGQjlDODVELTZEQ0MtNEQzOS1CQzc4LTIxNDY4N0E2NDQ0RkBTYW5kcmFkb2RkLmNvbT4gPDk3NjFGOUVCLTc3REYtNEIxMy1BOUI1LTRENzk5NjQ4M0IzMUBTYW5kcmFkb2RkLmNvbT4gPDFCQkVEQzg0LTlERjUtNDRERi1CQkFGLTlERjRFRTE2N0EyQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71607,"nextInTopic":0,"prevInTime":71607,"nextInTime":71609,"topicId":71599,"numMessagesInTopic":0,"msgSnippet":"-=- The parent shouldn t create a situation in which their relationship with a child is adversarial and antagonistic. That will fling them out into the world","messageBody":"<div id=\"ygrps-yiv-539515489\">-=- The parent shouldn&#39;t create a situation in which their relationship with a child is adversarial and antagonistic. That will fling them out into the world in reactionary mode, in an unprepared way, in a way that they can easily become a victim.-=- <br/>\n<br/>\nSomething else that can happen is when that child (whether young or grown up) is going through something heavy, they can feel like they have no one to talk to, to confide in, or someone who really understands them.<br/>\n<br/>\nI think this is a condition that affects many. I really noticed this during the years I volunteered as a counsellor at both my university and at my city&#39;s distress and suicide hotline. What I remember most from those conversations with distressed people was that they shared a feeling of being alone in the world and/or feeling abandoned. <br/>\n<br/>\nSome people did not feel connected or safe with anyone. For some, connecting to someone (even a stranger on a telephone) made the difference between life or death. <br/>\n<br/>\nIn unschooling families, the feeling of connection and closeness is nurtured every day. Parents are consciously making the choice to be their child&#39;s partner, friend, and safe haven. I imagine in families where unschooling is flourishing, children know in their bones how deeply they are loved and that their parents will always be there for them.<br/>\n<br/>\nRippy<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Responsibilities of parents","postDate":"1371047285","msgId":71607,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQWkpYZEowSzRhX0ZrNGtYNUdYVWFCMlZCM1NzR3RaPStGQ29NQzVHRWR0QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDdDMjAzNDk2LThCQjQtNDI5RC05OEQ1LUJGNDg1NDYzRkRERkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDNGQjlDODVELTZEQ0MtNEQzOS1CQzc4LTIxNDY4N0E2NDQ0RkBTYW5kcmFkb2RkLmNvbT4JPDk3NjFGOUVCLTc3REYtNEIxMy1BOUI1LTRENzk5NjQ4M0IzMUBTYW5kcmFkb2RkLmNvbT4JPDFCQkVEQzg0LTlERjUtNDRERi1CQkFGLTlERjRFRTE2N0EyQUBTYW5kcmFkb2RkLmNvbT4JPDdDMjAzNDk2LThCQjQtNDI5RC05OEQ1LUJGNDg1NDYzRkRERkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71606,"nextInTopic":71608,"prevInTime":71606,"nextInTime":71608,"topicId":71599,"numMessagesInTopic":0,"msgSnippet":"... The key word is decide - you decide. Don t do anything because someone else is persuasive or even because it seems to work for someone else. Do it ","messageBody":"<div id=\"ygrps-yiv-2097486448\">On Wed, Jun 12, 2013 at 1:33 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n&gt; More than that, take ideas and try them out in your family and in your<br/>\n&gt; life.  Decide what you believe and want.  &gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>The key word is &quot;decide&quot; - you decide. Don&#39;t do anything because someone<br/>\nelse is persuasive or even because it seems to work for someone else. Do it<br/>\nbecause it makes sense to you. Do it because you, yourself, have considered<br/>\noptions and made a choice.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;<br/>\n<br/>\n&gt; Be a good parent.   Be a good person.<br/>\n&gt;<br/>\n&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Don&#39;t reject the word &quot;good.&quot; Think about it, figure out what it means to<br/>\nyou. Then strive for it.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Responsibilities of parents","postDate":"1371026003","msgId":71606,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDMjAzNDk2LThCQjQtNDI5RC05OEQ1LUJGNDg1NDYzRkRERkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDFCQkVEQzg0LTlERjUtNDRERi1CQkFGLTlERjRFRTE2N0EyQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDNGQjlDODVELTZEQ0MtNEQzOS1CQzc4LTIxNDY4N0E2NDQ0RkBTYW5kcmFkb2RkLmNvbT4gPDk3NjFGOUVCLTc3REYtNEIxMy1BOUI1LTRENzk5NjQ4M0IzMUBTYW5kcmFkb2RkLmNvbT4gPDFCQkVEQzg0LTlERjUtNDRERi1CQkFGLTlERjRFRTE2N0EyQUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71605,"nextInTopic":71607,"prevInTime":71605,"nextInTime":71607,"topicId":71599,"numMessagesInTopic":0,"msgSnippet":"Pam Sorooshian wrote, a while back: +++++++++++++++++ The parent needs to be so aware of the child that the parent automatically thinks of him/her and","messageBody":"<div id=\"ygrps-yiv-2094563524\">Pam Sorooshian wrote, a while back:  <br/>\n<br/>\n+++++++++++++++++<br/>\n<br/>\nThe parent needs to be so aware of the child that the parent automatically thinks of him/her and partially sees the world through h/her eyes.<br/>\n<br/>\nThis is all a tall order. Overly self-centered people can&#39;t do it because it requires a lot of empathy. People with too many personal problems that they haven&#39;t addressed in their own lives probably can&#39;t do it because they are too distracted by those. People who are too negative or cynical can&#39;t do it because they tend to crush interest and joy, not build it up. People who lack curiosity and a certain amount of gusto for life can&#39;t really do it.<br/>\n<br/>\n+++++++++++++++++<br/>\n<br/>\nMore of that is here:   <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lazy/parents\">http://sandradodd.com/lazy/parents</a><br/>\n<br/>\nThere are people this season (the past several months) campaigning for the idea that there is no such thing as failure to unschool, that unschooling operates on a spectrum from school at home to radical unschooling, and from some school to no school, and that if a parent says she&#39;s unschooling she is, and that no one else can or should suggest otherwise.   There are people saying learning happens all the time no matter what the parents do, so the parents don&#39;t need to do anything special or different from what they would do if they didn&#39;t have children (or something along those lines).  There are people saying that if anyone says &quot;that&#39;s not unschooling,&quot; or &quot;that&#39;s not good unschooling,&quot; that EVERYONE should ignore and shun them.<br/>\n<br/>\nI&#39;m sure anyone who just read that and thinks they&#39;re right can find links.  I&#39;m equally sure that most of those links will have disappeared in a year or two, or will have changed focus, because they&#39;re reactionary and self-soothing things, or designed to make money one way or another.<br/>\n<br/>\nIn this discussion and its ancestors and relatives, we have shared real stories of real children.  Many people here have met and know well others who are writing.  I&#39;m staying at Marta Pires&#39;s house right now, and Joyce Fetteroll is here.  We all know each other better now.  That happens other places, too.  Dozens (maybe hundreds) of the readers of this list know some or all of my children.<br/>\n<br/>\nGo to conferences and gatherings when you can.  Listen to the speakers, and see how their children are with them, and how they are when they&#39;re not with them.  See who seems at peace and to have children who want to be with them.  Listen to side conversations and see who is being listened to by others, and why.<br/>\n<br/>\nIt should matter to people who are reading ideas who the people are who write them, and how those people are, and how unschooling went at their houses, and whether the ideas they&#39;re promoting were useful and workable.  I have no idea how (or even if) some of those authors who are badmouthing radical unschooling or making it look bad unschooled in their homes.  Sometimes I have an idea and it&#39;s not great.  Sometimes I truly don&#39;t know, or I know it&#39;s new to them and they want to believe that there&#39;s nothing to it.<br/>\n<br/>\nAdvice from someone who is using her own ideas with good results might be much more valuable than advice from someone who wants you to subscribe/enroll/hire/move.<br/>\n<br/>\nMore than that, take ideas and try them out in your family and in your life.  Decide what you believe and want.  Is peace more important than protest?  Is learning more important than the satisfaction of having defied the government?  Do you want a relationship more than you want to have power?  Health, choices, fears, pressures, personal damage, memories, hopes, realities, change and centeredness—everyone has dozens of things to rearrange and to prioritize and to examine.<br/>\n<br/>\nRead a little, try a little wait a while, watch.<br/>\n<br/>\nBe a good parent.   Be a good person.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lazy/parents\">http://sandradodd.com/lazy/parents</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being\">http://sandradodd.com/being</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Responsibilities of parents","postDate":"1371023042","msgId":71605,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFCQkVEQzg0LTlERjUtNDRERi1CQkFGLTlERjRFRTE2N0EyQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDk3NjFGOUVCLTc3REYtNEIxMy1BOUI1LTRENzk5NjQ4M0IzMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDNGQjlDODVELTZEQ0MtNEQzOS1CQzc4LTIxNDY4N0E2NDQ0RkBTYW5kcmFkb2RkLmNvbT4gPDk3NjFGOUVCLTc3REYtNEIxMy1BOUI1LTRENzk5NjQ4M0IzMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71601,"nextInTopic":71606,"prevInTime":71604,"nextInTime":71606,"topicId":71599,"numMessagesInTopic":0,"msgSnippet":"On a collection of quotes that Katherine Anderson keeps, she re-animated this one (put it near the top) today. I don t remember where it came from, but I want","messageBody":"<div id=\"ygrps-yiv-1921605278\">On a collection of quotes that Katherine Anderson keeps, she re-animated this one (put it near the top) today. I don&#39;t remember where it came from, but I want to give it a larger context.<br/>\n<br/>\n-=-I think putting a child out for turning 18, or 20, or 21 is as arbitrary as putting a child in school for turning five. If home isn&#39;t pleasant and safe, a young adult will leave with just anybody. If &quot;anything is better than home,&quot; that creates a dangerous situation. ~~Sandra Dodd (via Kelly Lovejoy)-=-<br/>\n<br/>\nSince it&#39;s a government law in most places that a child be enrolled in school at a certain age (it&#39;s five where I live), then it&#39;s not really &quot;arbitrary&quot; for a parent to comply.<br/>\n<br/>\nThere are some laws that parents use to justify putting a child out of the house.  If they have foster children, that arrangement and obligation ends at 18.  If they are receiving (in the U.S.) social security benefits for a child whose father has died, they might be getting one check for the child and one for the mother, and that all ends when the child is 18.  <br/>\n<br/>\nSometimes the child is frustrated and feeling overly controlled and wants out as soon as possible.<br/>\n<br/>\nSometimes the parent has been collecting and nursing and cultivating resentment and has persuaded herself or himself that what will make them feel better is to have the kids out of the house.<br/>\n<br/>\nSome families &quot;require&quot; a child to go to college, and in such cases it&#39;s not unusual for the child to request a college quite far away.<br/>\n<br/>\nAll of that can be legally and morally justified as fulfilling the responsibilities of parents.<br/>\n<br/>\nSo the unschooling part:  <br/>\n<br/>\nIf a family opts to register a child to homeschool, when she&#39;s school age, that sets them on a new path and a different trajectory.  With different priorities and goals and principles at work, then a separation by the arrival of a birthday becomes arbitrary.  It&#39;s okay to consider some earlier forays into short-term separations, or to be accepting of a child&#39;s desire to stay home a while, for years, forever.  Once someone has survived the social questioning of not having a child in school, and then of not using a curriculum, questions about having a young adult at home shouldn&#39;t be so hard to cope with.<br/>\n<br/>\nBack to the quote above:  <br/>\n<br/>\n-=-If &quot;anything is better than home,&quot; that creates a dangerous situation. -=-<br/>\n<br/>\nThe parent shouldn&#39;t create a situation in which their relationship with a child is adversarial and antagonistic.  That will fling them out into the world in reactionary mode, in an unprepared way, in a way that they can easily become a victim.<br/>\n<br/>\nBut some people say &quot;anything is better than school.&quot;  <br/>\nI think John Holt even said that.<br/>\n<br/>\nBut I don&#39;t think John Holt had an alcoholic mother. <br/>\nAnd I know that John Holt never had a wife or children.<br/>\n<br/>\nIf home isn&#39;t better than school, then making the better choice means that school is better than home.<br/>\nIf someone&#39;s unschooling is created haphazardly and without principles and clarity, home won&#39;t be better than school.<br/>\n<br/>\nIf the parent believes that &quot;anything is better than school,&quot;  that creates a dangerous situation. <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Responsibilities of parents","postDate":"1370942858","msgId":71601,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk3NjFGOUVCLTc3REYtNEIxMy1BOUI1LTRENzk5NjQ4M0IzMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDNGQjlDODVELTZEQ0MtNEQzOS1CQzc4LTIxNDY4N0E2NDQ0RkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDNGQjlDODVELTZEQ0MtNEQzOS1CQzc4LTIxNDY4N0E2NDQ0RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71600,"nextInTopic":71605,"prevInTime":71600,"nextInTime":71602,"topicId":71599,"numMessagesInTopic":0,"msgSnippet":"Oh.  Now it s in the mail. :-) This is how it looks when I respond from e-mail. When parents are helping children learn to make responsible, family-enriching","messageBody":"<div id=\"ygrps-yiv-355331811\">Oh.  Now it&#39;s in the mail. :-)<br/>\nThis is how it looks when I respond from e-mail.  <br/>\n<br/>\nWhen parents are helping children learn to make responsible, family-enriching decisions, decisions that help learning thrive, it&#39;s good when the examples the parents are setting are good ones.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"sandralynndodd","from":"&quot;sandralynndodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Responsibilities of parents","postDate":"1370941838","msgId":71600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtwNnBpZStuOWF0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDNGQjlDODVELTZEQ0MtNEQzOS1CQzc4LTIxNDY4N0E2NDQ0RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":71599,"nextInTopic":71601,"prevInTime":71599,"nextInTime":71601,"topicId":71599,"numMessagesInTopic":0,"msgSnippet":"(This didn t come to me in e-mail yet, but I did want to say another thing or two.) My mom was an alcoholic.  Sometimes she was present and helpful and","messageBody":"<div id=\"ygrps-yiv-1759613352\">(This didn&#39;t come to me in e-mail yet, but I did want to say another thing or two.)<br/>\n<br/>\n<br/>\nMy mom was an alcoholic.  Sometimes she was present and helpful and sometimes not at all.  Sometimes unavailable (physically or emotionally, or passed out).  Sometimes saying and doing things that were harmful or embarrassing.<br/>\n<br/>\nSomeone asked me for ideas about how to deal with a child who is a friend of her child, whose parent isn&#39;t responsible/available/sober all the time.  <br/>\n<br/>\nFrom the point of view of a child, it was wonderful for me to have some families I could visit who were attentive and sweet and safe.<br/>\n<br/>\nFrom the point of view of the parent of a child, some chidlren pick up the bad, sneaky, underanded habits of dysfunctional families and that can be a problem.  But I always gave kids a chance to see if they might be good kids who needed a better environment.<br/>\n<br/>\nI think it can be possible to have adult friends whose kids aren&#39;t a good match for one&#39;s own kids, and do things without forcing the kids together.<br/>\n<br/>\nAnd I think it&#39;s possible to maintain a friendship with a child without supporting or condoning the parents&#39; behaviors, but it can be tricky.  Meeting in public places to take the child, and then delivering him home without having his mom come over is one way that can be subtly accomplished sometimes.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Responsibilities of parents","postDate":"1370939694","msgId":71599,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGQjlDODVELTZEQ0MtNEQzOS1CQzc4LTIxNDY4N0E2NDQ0RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":71600,"prevInTime":71598,"nextInTime":71600,"topicId":71599,"numMessagesInTopic":0,"msgSnippet":"I didn t know what to call this.  It s about problems caused between families when a parent drinks too much, basically. Someone wrote to me that she wished she","messageBody":"<div id=\"ygrps-yiv-1360803668\">I didn&#39;t know what to call this.  It&#39;s about problems caused between families when a parent drinks too much, basically.  <br/>\n<br/>\nSomeone wrote to me that she wished she could find a way to ask how to deal with a child&#39;s friends when the parents are problematical (irresponsible, drink too much, not really connected to the kids).  ( I paraphrased a baser phrase with &quot;problematical.&quot;)<br/>\n<br/>\nSometimes at conferences, sometimes at gatherings, sometimes just at home, some people drink too much.  Let childless people drink too much.  Let people whose kids are grown drink too much, if they have to.   But when the parent of a child gets too drunk to take care of her own child, that is a problem for more than one person, and for more than two people.  When it&#39;s happening at conferences, it&#39;s a problem for unschooling in general.<br/>\n<br/>\nBut then I&#39;ve resisted the thought of there being an &quot;unschooling in general.&quot; <br/>\n<br/>\nI have said many times and I&#39;m about to say it again:  Unschooling isn&#39;t done by big groups, or in big groups,  It is done by a family.  It happens among the members of a family.  The parents enrich their children&#39;s lives and maintain an environment of learning, or they don&#39;t.   The parents find ways to create a safe and joyful place for their children, or they don&#39;t.<br/>\n<br/>\nI don&#39;t want ANY names named in a negative way at all in this discussion.  If you&#39;re asking a question, make it general.  If you&#39;re telling a story, make it vague.  I know stories going back a dozen years.  It&#39;s not about a single person or a single conference, but I will say that it doesn&#39;t happen at ALL conferences, though I heard someone who had only been to the same conference suggest that it did.  It doesn&#39;t.<br/>\n<br/>\nAt the Albuquerque Always Learning Live site, we were allowed to have our own champagne the first year because New Year&#39;s Eve came during the conference.  Our hotel coordinator said no problem about liquor, if we wanted, the next year.  And I told people, but there wasn&#39;t really any drinking.  Third year, again.  I reminded them it was okay, and people came and knitted and talked and played board games and I don&#39;t even remember anyone having a beer in there, though they could have. <br/>\n<br/>\nIf the tone of a gathering is Party Party, rather than meeting and learning, the problem will be worse.<br/>\n<br/>\nWhat is legal in a certain place isn&#39;t the thing I&#39;m talking about, and it&#39;s difficult to narrow down what I&#39;m talking about. :-)  It IS a difficult topic to discuss.<br/>\n<br/>\nI&#39;ll think and post responses to my own post... <br/>\nAnd there can be a &quot;designated parent&quot; plan, too.  There have been times Keith or I were under the influence of alcohol or something, when camping, but one parent was the one who stayed sober and alert to take care of the kids.  And I&#39;m thinking a handful or times in 27 years, too.  When the kids have parties now (they&#39;re all grown) Keith will show up for the &quot;car bomb&quot; portion of the drinking, have a couple, and go watch a movie in our bedroom.  <br/>\n<br/>\nIt&#39;s not being &quot;a tee totaller&quot; to make a conscious decision about when and how much to drink.  Some people never drink.  Some people drink occasionally.  Some drink too much.  If their children need them and they&#39;re not safely helpful and available, that&#39;s too much.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":71548,"nextTopicId":31}}