{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Abusers","postDate":"1013291512","msgId":4541,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjA5MjE1MTUyLjUzNTE2LnFtYWlsQHdlYjEzNzAxLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMTMyNTA4NzUuMTUzLjEzMDg5Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4540,"nextInTime":4542,"topicId":4541,"numMessagesInTopic":0,"msgSnippet":"... This is pretty personal, but I felt like sharing. It s not a secret or anything, just not something a lot of people know about me now.  My elder son is not","messageBody":"<div id=\"ygrps-yiv-586132811\"><blockquote><span title=\"ireply\">&gt;the main reason women stay with their batterers are<br/>\n&gt;that they are less likely to get killed staying than<br/>\n&gt;leaving. ...(snip)...For many women the thing that<br/>\n&gt;made them decide the risk was worth it was when he<br/>\n&gt;started hurting the kids. I heard this over and over.<br/>\n&gt;Another reason is a lack of resources. Most batterers<br/>\n&gt;not only use physical violence, but psychological.<br/>\n&gt;Frequently the batterer has set things up so the <br/>\n&gt;woman has no friends, and also alienates the woman&#39;s<br/>\n&gt;family.  <br/>\n&gt;Kathryn Baptista<br/>\n<br/>\n </span></blockquote>This is pretty personal, but I felt like sharing. <br/>\nIt&#39;s not a secret or anything, just not something a<br/>\nlot of people know about me now.  My elder son is not<br/>\nmy husband&#39;s biological child, although we married<br/>\nbefore he was born.  Having grown up in an abusive<br/>\nhome and environment, I unconsciously sought out those<br/>\ntypes of relationships as an adult also.  The last<br/>\nrelationship I had with a man before my husband was<br/>\n4.5 years living with an extremely abusive and<br/>\nunbalanced addicted person.  He was physically and<br/>\npsychologically abusive and HAD cut off most of my<br/>\ncontacts with others, driving my friends away one by<br/>\none, controlling my time, taking my money, even taking<br/>\nmy car overnight to keep me from going places.  He was<br/>\na lot like my dad unfortunately.<br/>\n<br/>\nAnyways, the final straw came for me when I<br/>\nacidentally got pregnant after 4.5 years.  I tried for<br/>\na couple of months to get him interested in the baby,<br/>\nbut he always said the same things: &quot;Get rid of it. <br/>\nYou&#39;ll be a rotten mother.&quot; and other scarier things<br/>\nabout what he would teach a child about the world and<br/>\nhow he would teach these things.  I finally got<br/>\nterrified of having this person around my child, MY<br/>\nCHILD, and realized I would never allow someone like<br/>\nhim near my child (let alone parent them) in any other<br/>\nsituation.  <br/>\n<br/>\nSO I decided to leave.  I told him that whatever I<br/>\ndecided to do was none of his business, since he had<br/>\nalready made it abundantly clear what his feelings<br/>\nwere about it.  He didn&#39;t care anyway.  But I was<br/>\nterrified to go bak to the house and pack up my<br/>\nfurniture and things alone.  I could usually trust him<br/>\nnot to touch me if I had witnesses (abusers usually<br/>\nwant everyone else to think they are wonderful<br/>\npeople.)  I asked a couple of co-workers if they could<br/>\nhelp me get my things.  One in particular was an over<br/>\n6 foot tall Engineer whom I had worked with for over 2<br/>\nand a half years and was a good work pal who shared<br/>\nthe same friends at work as I.  <br/>\n<br/>\nYup...that was my husband.  We began to see each other<br/>\na couple of months after that, and knowing each other<br/>\nso well already things progressed quickly.  We decided<br/>\nto have a small, very romantic, private ceremony on<br/>\nSan Juan Island in the Puget sound and his name is on<br/>\nour son&#39;s birth certificate.  I kept photos of my ex<br/>\nso that my son can have them when he is older and I<br/>\nfully intend to tell him his story (how do I broach<br/>\nthat subject????.)  My husband was really, REALLY<br/>\nexcited about me being pregnant and very involved in<br/>\nmy pregnancy.  His ex wife had two children and he was<br/>\nVERY ready to be a daddy.  Both my sons adore their<br/>\ndaddy, the best daddy in the world.  And I am so<br/>\nthankful for the blessing of my older boy, coming when<br/>\nhe did, and knocking some sense into me to get me away<br/>\nfrom where I was.<br/>\n<br/>\nNanci K.<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nSend FREE Valentine eCards with Yahoo! Greetings!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://greetings.yahoo.com\">http://greetings.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":4431,"nextTopicId":4548}}