{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":28,"messages":[{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268510978","msgId":52012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOUJGMTAyLjYwMDA5MDJAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PGhuZ29zaCtnYTZnQGVHcm91cHMuY29tPg==","referencesHeader":"PGhuZ29zaCtnYTZnQGVHcm91cHMuY29tPg=="},"prevInTopic":52008,"nextInTopic":52013,"prevInTime":52011,"nextInTime":52013,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"... Yes, this was the point in mentioning this. Having the instrument and book with DVD was a comfortable place for her to start. Then she decided she wanted","messageBody":"<div id=\"ygrps-yiv-885573381\"><blockquote><span title=\"ireply\">&gt;  <br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; -=-My daughter played violin for a short while- she did not want <br/>\n&gt; lessons to<br/>\n&gt; &gt; begin with, so we rented a violin and got a beginner book with a DVD.<br/>\n&gt; &gt; After a short while she found she did need some more help and <br/>\n&gt; decided to<br/>\n&gt; &gt; try lessons - she just wasn&#39;t able to figure out on her own how to hold<br/>\n&gt; &gt; the bow and instrument in a way that made a sound she liked. And more<br/>\n&gt; &gt; than one lesson was needed, and lots of reminders in order to really <br/>\n&gt; get<br/>\n&gt; &gt; the hang of it.-=-<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; **I think that videos and/or DVD&#39;s could very well substitute for a <br/>\n&gt; live person at first, though. Sure, probably not quite as useful, but <br/>\n&gt; way less pressure, the player can see a good model in action, AND they <br/>\n&gt; have the information to determine whether they need further <br/>\n&gt; instruction or not.**<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Yes, this was the point in mentioning this. Having the instrument and <br/>\nbook with DVD was a comfortable place for her to start. Then she decided <br/>\nshe wanted help from an experienced person, that she needed that.  The <br/>\nteacher did a lot of guiding her arms and hands gently to where they <br/>\nneeded to be to make a sweeter sound, and also playing along with her. <br/>\nOver and over.<br/>\n<br/>\nWhereas if we had told her she must have the help from another person <br/>\nright away she may not ever have even gotten that far, to even trying <br/>\nthe instrument. She is often very anxious about meeting new people.<br/>\n<br/>\nHeather</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ideas for facilitating music interest?","postDate":"1268508369","msgId":52008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZ29zaCtnYTZnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCOUI4OURGLjMwMjAyQHR3Y255LnJyLmNvbT4="},"prevInTopic":52001,"nextInTopic":52012,"prevInTime":52007,"nextInTime":52009,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"... I think that videos and/or DVD s could very well substitute for a live person at first, though.  Sure, probably not quite as useful, but way less pressure,","messageBody":"<div id=\"ygrps-yiv-418105510\"><blockquote><span title=\"ireply\">&gt; -=-My daughter played violin for a short while- she did not want lessons to <br/>\n&gt; begin with, so we rented a violin and got a beginner book with a DVD. <br/>\n&gt; After a short while she found she did need some more help and decided to <br/>\n&gt; try lessons - she just wasn&#39;t able to figure out on her own how to hold <br/>\n&gt; the bow and instrument in a way that made a sound she liked. And more <br/>\n&gt; than one lesson was needed, and lots of reminders in order to really get <br/>\n&gt; the hang of it.-=-<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I think that videos and/or DVD&#39;s could very well substitute for a live person at first, though.  Sure, probably not quite as useful, but way less pressure, the player can see a good model in action, AND they have the information to determine whether they need further instruction or not.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268494777","msgId":52013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVCNjU0RjYyLUI0RTgtNEZDQi04RjJGLTkzNjQyN0JGNUFFMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhuZmFjNCtwZWI2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuZmFjNCtwZWI2QGVHcm91cHMuY29tPg=="},"prevInTopic":52012,"nextInTopic":0,"prevInTime":52012,"nextInTime":52014,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"-=-The very first thing my first flute teacher did was to open up a book of duets and play a simple duet with me. It was magical--MAGICAL! (I could play a bit","messageBody":"<div id=\"ygrps-yiv-1283899483\">-=-The very first thing my first flute teacher did was to open up a  <br/>\nbook of duets and play a simple duet with me. It was magical--MAGICAL!  <br/>\n(I could play a bit from band in school--but mostly self-learned) The  <br/>\nway our tones blended in the harmonies was literally intoxicating--and  <br/>\noh so much better than all the beginning squeaks and squawks from band  <br/>\nclass! Who knows what would have happened if I&#39;d had the &quot;learn the  <br/>\nscales first&quot; teacher--but maybe that&#39;s a question that could be asked  <br/>\nwhen looking for a teacher.-=-<br/>\n<br/>\nAlthough other books have been published in the 60 years since, the  <br/>\nbest recorder book is The Trapp Family How to Play Recorder or  <br/>\nwhatever it is.  Old-timey-looking, dark brown cover.  But when people  <br/>\nwant to learn recorder, I buy them a copy of that and give it to them  <br/>\nand go through the first two or three lessons with them.   There&#39;s a  <br/>\nduet on every page, from the time they know the simplest three notes  <br/>\nof all.  Nice ones, too.<br/>\n<br/>\nI did this most recently three years ago with a math-minded adult who  <br/>\ndidn&#39;t read  music.  I explained music as the graph it is, told him  <br/>\nwhat was tone, what was time, and he was reading music within days.   <br/>\nHe amazed me; it was fun.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268485359","msgId":52001,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOUI4Q0VGLjUwMjAxMDBAdHdjbnkucnIuY29tPg==","inReplyToHeader":"PDhDQzkwMThDMEVDODAzRC01RTNDLTg5NDhAd2VibWFpbC1tMDIyLnN5c29wcy5hb2wuY29tPg==","referencesHeader":"PDhDQzkwMThDMEVDODAzRC01RTNDLTg5NDhAd2VibWFpbC1tMDIyLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":52000,"nextInTopic":52008,"prevInTime":52000,"nextInTime":52002,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"... Hi Sherri Is the problem with his hand coming from the playing, or is it unrelated? I know my son, also a bass player, was helped with issues of pain in","messageBody":"<div id=\"ygrps-yiv-1446998729\"><a rel=\"nofollow\" target=\"_blank\" href=\"mailto:KaitKalKenz3@...\">KaitKalKenz3@...</a> wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; I&#39;ve told Kaleb many times that if he ever decides that he does not <br/>\n&gt; want to play in the band anymore that he can stop. There are times <br/>\n&gt; when he&#39;s tired. And recently he&#39;s had some problems with his hand <br/>\n&gt; that have led us to some nerve testing and seeing a specialist. He <br/>\n&gt; practices at least 3 times or more per week. He also writes the music <br/>\n&gt; and lyrics as well. And he is the lead singer in the band. He loves it <br/>\n&gt; but there are times that it is tiring. I enjoy it as well but would <br/>\n&gt; support him in whatever he wanted to do.<br/>\n&gt;<br/>\n&gt; <br/>\n </span></blockquote>Hi Sherri<br/>\n<br/>\nIs the problem with his hand coming from the playing, or is it <br/>\nunrelated? I know my son, also a bass player, was helped with issues of <br/>\npain in his hands after long periods of playing with advice from music <br/>\nteachers and some instruction in technique. That is another benefit of <br/>\nhaving some instruction in technique-  learning how to play without <br/>\nhurting yourself. My son has been through periods when he was playing 3- <br/>\n6 hours a day with performances, rehearsals, and practice, and it can be <br/>\nreally rough on your body.<br/>\n<br/>\nThough I think there are many benefits to learning on your own, too.<br/>\n<br/>\nHeather</div>","specialLinks":[]},{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268484575","msgId":52000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCOUI4OURGLjMwMjAyQHR3Y255LnJyLmNvbT4=","inReplyToHeader":"PGhuY25wdisyNXNtQGVHcm91cHMuY29tPg==","referencesHeader":"PGhuY25wdisyNXNtQGVHcm91cHMuY29tPg=="},"prevInTopic":51996,"nextInTopic":52001,"prevInTime":51999,"nextInTime":52001,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"My son plays the electric bass.  The electric bass is easier to learn on your own than some other instruments, I think. My son has also played the upright","messageBody":"<div id=\"ygrps-yiv-1513485080\">My son plays the electric bass.  The electric bass is easier to learn on <br/>\nyour own than some other instruments, I think. My son has also played <br/>\nthe upright acoustic bass, which is not as easy to learn without some <br/>\ninstruction in technique. The way one of his teachers described it is <br/>\nthat with an instrument like the upright acoustic bass, your body is <br/>\npart of the instrument, more so than with the piano, for example.  Since <br/>\nthe player&#39;s body is actually part of the instrument, variations in use <br/>\nof the body make more difference in how the instrument sounds. With a <br/>\nstringed instrument such as a violin or a bass, the arms and hands and <br/>\nhow they are positioned and move are a large part of how the sound is <br/>\nmade. For a flute, the mouth of the player could be considered part of <br/>\nthe instrument also, in this way of looking at it.  When we first met <br/>\nthis teacher, he said that my son&#39;s instrument was essentially broken, <br/>\nand the training in technique was to fix the part of the instrument that <br/>\nwas his body. His program certainly resulted in a great improvement in <br/>\nthe quality of sound my son could produce with the instrument. The piano <br/>\nwill make a satisfactory sound for a person without as much focus on <br/>\ntechnique, and a guitar or bass guitar is also more forgiving.  My son <br/>\nfinds it much easier to make the sounds he wants to make with an <br/>\nelectric bass than the acoustic upright.<br/>\n<br/>\nSomething very interesting though - the teacher mentioned above follows <br/>\na very specific method of instruction (The Rabbath Method) for the <br/>\nupright acoustic bass- fingering, how to hold your arms, your body, <br/>\nwhere to put your feet, etc. Francios Rabbath, who develped this method, <br/>\nwas self taught.  Which perhaps was how he was able to develop what some <br/>\npeople think is a very superior technique for playing the upright <br/>\nacoustic bass, which as well as produces better sound, protects the <br/>\nmusician&#39;s body from injury. He invented a new type of end pin, made of <br/>\nwood, that allows the bass to sit at a whole different angle, and is an <br/>\ninnovative composer, as well. SO perhaps another self taught musician <br/>\ncould come up with a brand new technique for getting an even better <br/>\nsound out of another difficult to learn instrument.<br/>\n<br/>\nMy daughter played violin for a short while- she did not want lessons to <br/>\nbegin with, so we rented a violin and got a beginner book with a DVD. <br/>\nAfter a short while she found she did need some more help and decided to <br/>\ntry lessons - she just wasn&#39;t able to figure out on her own how to hold <br/>\nthe bow and instrument in a way that made a sound she liked. And more <br/>\nthan one lesson was needed, and lots of reminders in order to really get <br/>\nthe hang of it.<br/>\n<br/>\nA book that we found very interesting is Victor Wooten&#39;s The Music <br/>\nLesson. One of the chapters talks about one way to &quot;practice&quot; music - he <br/>\ncalls it &quot;jamming with the experts&quot;. By this he means playing along with <br/>\nrecordings. Youtube is a great resource, as you can observe as well as <br/>\nlisten. Of course a live expert is wonderful if you have one around, and <br/>\nhaving a lesson is the most usual way to have access to an expert. <br/>\nHaving a musician as a relative or friend would be ideal, then the help <br/>\ncan be sought as it is wanted, more informally, at least to start with. <br/>\nVictor is not a big fan of traditional lessons(scales, etc), and his <br/>\nbook might be worth a look for anyone interested in learning music, <br/>\nthough geared towards bass players.<br/>\n<br/>\nMy son has also used Play Along Books with CD. Play along CDs  have <br/>\ntracks with and without the instrument the book is for, so you can play <br/>\nalong with the expert, and then without. Watching live performances is <br/>\nanother way to observe experts- my husband used to take our son up close <br/>\nto the band when we attended outdoor concerts when he was very young- <br/>\nand I know he watches bass players at live performances pretty intently <br/>\nnow, and talks to them afterwards, too. And he listens to a wide variety <br/>\nof music on his Ipod.<br/>\n<br/>\nMy son  had been listening to music for a while - and wanted to start <br/>\nplaying bass- at about age 11. Getting an instrument was the first step. <br/>\nA friend gave him an electric bass which was in pretty bad shape- we <br/>\nhave a relative who does repairs. My son bought a practice amp with his <br/>\nbirthday money. He played on his own for maybe 6 months. He picked out a <br/>\nbook that helped with fingerings, and played along with music he liked. <br/>\nHe asked for lessons then, and we were lucky enough to find an <br/>\nunschooling dad and musician to barter with for lessons. The lessons <br/>\noften look like lots of playing music together. They have never used a <br/>\nregular program together, like many teachers prefer to do- you know - <br/>\nBook 1, 2, 3, and maybe the reward when you are done is to choose your <br/>\nown music. They have from the first day picked music out together to <br/>\nplay- sometimes my son brings something, sometimes the teacher brings <br/>\nsomething. This teacher had a student group for awhile- and each member <br/>\npicked a few songs, and they came up with the arrangements, and composed <br/>\nsome of the songs. The arrangement of Jimi Hendrix&#39;s Little Wing for two <br/>\nelectric guitars, one bass, and two cellos was incredible. I think it is <br/>\na good idea, if you can, if and when your child does want to find a <br/>\nteacher, to look for one who is flexible, and works with the student to <br/>\nchoose music.<br/>\n<br/>\nWhen my son started playing the upright acoustic bass, he did this at a <br/>\nsummer camp that offered an introduction to various instruments- he had <br/>\na few lessons there from college students. I don&#39;t know if other areas <br/>\noffer these types of programs - this group offers afterschool programs <br/>\nalso, but it was a good opportunity for him. He was interested enough <br/>\nafter that that we bought him a used upright bass. He did want lessons <br/>\nin order to be able to make a sound that was satisfying - so he took a <br/>\nfew more casual lessons from one of the college students. After a while <br/>\nhe started more traditional lessons on the upright bass, technique <br/>\noriented, as mentioned above.  He has also played with a youth <br/>\norchestra, high school jazz band, state-wide adjudications, lots of <br/>\nother groups, etc. He isn&#39;t doing any of that now. He tried all that for <br/>\na couple of years- the structured lessons, classical music, jazz, and <br/>\nthen stopped playing any music for 6 months. It was kind of like a tide <br/>\nhe got swept along on, in a way. He started making choices for reasons <br/>\nthat ultimately weren&#39;t the right ones for him. He was getting a lot of <br/>\npositive feedback, and  wanted to become a better player, and so would <br/>\ndo anything that anyone suggested would make him a better player, then <br/>\nended up involved in a bunch of stuff he wasn&#39;t thrilled about. He <br/>\nhasn&#39;t played the upright acoustic in several months. He is playing <br/>\nelectric, playing with a few bands, learning about sound engineering, <br/>\ndoing beat making, sampling, composing. The latest thing he is into is <br/>\nsampling video game music as part of his compositions- really cool stuff!<br/>\n<br/>\n<br/>\nHeather in NY</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ideas for facilitating music interest?","postDate":"1268460740","msgId":51996,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuZmFjNCtwZWI2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU2MjE4MS40NTQ2LnFtQHdlYjgxNTA2Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":51969,"nextInTopic":52000,"prevInTime":51995,"nextInTime":51997,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"... The very first thing my first flute teacher did was to open up a book of duets and play a simple duet with me.  It was magical--MAGICAL!  (I could play a","messageBody":"<div id=\"ygrps-yiv-1871724848\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; I think one of the things that children envision when they want to learn an  instrument and go to take classes<br/>\n&gt; is that they are going to learn to play songs. Unfortunately most have to do scales and other things before the<br/>\n&gt; instructor teaches them even a very simple song they can play.<br/>\n<br/>\n </span></blockquote>The very first thing my first flute teacher did was to open up a book of duets and play a simple duet with me.  It was magical--MAGICAL!  (I could play a bit from band in school--but mostly self-learned)  The way our tones blended in the harmonies was literally intoxicating--and oh so much better than all the beginning squeaks and squawks from band class!  Who knows what would have happened if I&#39;d had the &quot;learn the scales first&quot; teacher--but maybe that&#39;s a question that could be asked when looking for a teacher.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":330448208,"authorName":"KaitKalKenz3@aol.com","from":"KaitKalKenz3@...","profile":"kaitkalkenz3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Ideas for facilitating music interest?","postDate":"1268411554","msgId":51969,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDQzkwMThDMEVDODAzRC01RTNDLTg5NDhAd2VibWFpbC1tMDIyLnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":51957,"nextInTopic":51996,"prevInTime":51968,"nextInTime":51970,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"My 15 year old son has been playing the bass guitar for 3 years now without any lessons. His father played guitar but no where near as well as Kaleb plays. His","messageBody":"<div id=\"ygrps-yiv-434305854\">My 15 year old son has been playing the bass guitar for 3 years now without any lessons. His father played guitar but no where near as well as Kaleb plays. His father also passed away 2 years ago without really showing Kaleb anything as far as guitar playing goes. Kaleb has a friend that he did learn a few things from but for the most part, he learned how to play on his own. He has been in a band now for a year. They have been playing for several months at local venues around the Northeast Ohio area. He actually has a show tonight. I don&#39;t know if I&#39;m allowed to post any show info on this list. I&#39;m just a proud mom. If anyone appreciates hard rock / heavy metal music and lives in the Northeast Ohio area, e-mail me privately for Kaleb&#39;s band&#39;s schedule. They have 7 shows scheduled for the next 3 months.<br/>\n<br/>\nBack to the topic, I learned how to play the recorder in 4th grade at school but other than that, I have never had any musical ability nor have I wanted to. I think that either a person has the musical gift or doesn&#39;t. Of course, lessons will help someone improve but if their heart isn&#39;t really in it, is it really worth it? I also believe that some instruments may be much harder to learn than others. If your daughter really wants to learn to play the piccolo, I would say that you should rent one to let her play around with. If she wants lessons, if you can, get her lessons. She will be able to make the decision if she is enjoying it and wants to continue or not. She&#39;ll never know unless she tries. <br/>\n<br/>\nI&#39;ve told Kaleb many times that if he ever decides that he does not want to play in the band anymore that he can stop. There are times when he&#39;s tired. And recently he&#39;s had some problems with his hand that have led us to some nerve testing and seeing a specialist. He practices at least 3 times or more per week. He also writes the music and lyrics as well. And he is the lead singer in the band. He loves it but there are times that it is tiring. I enjoy it as well but would support him in whatever he wanted to do. <br/>\n<br/>\nContinue to support your daughter&#39;s interests if playing the piccolo is what she wants to do, she could go on to be great at it or she may decide she&#39;d rather play another instrument or none at all. Good luck!!!<br/>\n<br/>\nTake care,<br/>\nSherri<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ideas for facilitating music interest?","postDate":"1268376721","msgId":51957,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuY29haCthYXMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuY25wdisyNXNtQGVHcm91cHMuY29tPg=="},"prevInTopic":51956,"nextInTopic":51969,"prevInTime":51956,"nextInTime":51958,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"... And you can ask the guy at the music store if he knows how to play enough to make sounds and show your daughter a little about how to play. Joanna","messageBody":"<div id=\"ygrps-yiv-1771619976\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Joanna&quot; &lt;ridingmom@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; <br/>\n&gt; -=-I thought I&#39;d read a suggestion to rent a piccolo for her to just play with a little. I can&#39;t seem to find that message (so maybe I made it up!) but it seemed like a great idea to me-=-<br/>\n&gt; <br/>\n&gt; Yes, I said that.  :-)<br/>\n&gt; <br/>\n&gt; -=-And, perhaps, rent a flute, too, so that she can play with making sounds on both of them.-=-<br/>\n&gt; <br/>\n&gt; That seems like a good idea if money isn&#39;t a problem.<br/>\n<br/>\n<br/>\n </span></blockquote>And you can ask the guy at the music store if he knows how to play enough to make sounds and show your daughter a little about how to play.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ideas for facilitating music interest?","postDate":"1268376191","msgId":51956,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuY25wdisyNXNtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuYmZxcStzb2hqQGVHcm91cHMuY29tPg=="},"prevInTopic":51948,"nextInTopic":51957,"prevInTime":51955,"nextInTime":51957,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"-=-I thought I d read a suggestion to rent a piccolo for her to just play with a little. I can t seem to find that message (so maybe I made it up!) but it","messageBody":"<div id=\"ygrps-yiv-89147614\">-=-I thought I&#39;d read a suggestion to rent a piccolo for her to just play with a little. I can&#39;t seem to find that message (so maybe I made it up!) but it seemed like a great idea to me-=-<br/>\n<br/>\nYes, I said that.  :-)<br/>\n<br/>\n-=-And, perhaps, rent a flute, too, so that she can play with making sounds on both of them.-=-<br/>\n<br/>\nThat seems like a good idea if money isn&#39;t a problem.<br/>\n<br/>\n<br/>\n-=-Being part of band (instead of having private lessons) means that I did teach myself to play the flute competently, so it is possible.-=-<br/>\n <br/>\n<br/>\nI had a similar experience--I brought myself along quickly because it was so much fun to actually make music!  Totally possible!!  Although when I did have private lessons (when I was begging for them) I improved so quickly--and had to undo quite a few bad habits.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268353012","msgId":51948,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2MjE4MS40NTQ2LnFtQHdlYjgxNTA2Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VJS0dIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VJS0dIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":51944,"nextInTopic":51956,"prevInTime":51947,"nextInTime":51949,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"I think one of the things that children envision when they want to learn an  instrument and go to take classes is that they are going to learn to play songs.","messageBody":"<div id=\"ygrps-yiv-933075046\">I think one of the things that children envision when they want to learn an  instrument and go to take classes<br/>\nis that they are going to learn to play songs. Unfortunately most have to do scales and other things before the<br/>\ninstructor teaches them even a very simple song they can play.<br/>\nThat is the reason I shared my brothers story with the flute. Luckily when we had classes in school it<br/>\nwas just to teach one song that semester, so everyone learned , even the people like me who are not&#39;<br/>\nmusically inclined. My brother who had a ear for music was able to figure it out how to play other songs by ears from just<br/>\nlearning that one song.<br/>\n<br/>\nIt was the same way with a guitar. My mom showed us how to play a simple song and my brother was really into it<br/>\nThen they both tinkered with the guitar and by the time my brother was 10 or younger he was the one tuning my moms guitar.<br/>\nThe only time he took classes was way into his late teens when he did a very advanced week of group classes with some famous <br/>\nacoustic guitarist in a music school. <br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268348009","msgId":51944,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBRTZCNjc5LUExMDUtNDI5MS05RkIzLUUyMTNCRUU1NDJFRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLT0VJTkdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLT0VJTkdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":51942,"nextInTopic":51948,"prevInTime":51943,"nextInTime":51945,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"-=-Isn t this the key to the whole discussion? Yes, a teacher is invaluable to a child who wants one, who is frustrated with just trying things out, who wants","messageBody":"<div id=\"ygrps-yiv-731643817\">-=-Isn&#39;t this the key to the whole discussion? Yes, a teacher is  <br/>\ninvaluable to<br/>\na child who wants one, who is frustrated with just trying things out,  <br/>\nwho<br/>\nwants to further their learning, or get past something that they can&#39;t  <br/>\nseem<br/>\nto get past alone.-=-<br/>\n<br/>\n&quot;A teacher is invaluable&quot; might be going too far.  But seeing someone  <br/>\nactually DO the thing one is trying to do is helpful, even if the  <br/>\nother person can&#39;t see the student back.  And better yet, if someone  <br/>\nwho has knitted says &quot;Maybe you could hold the needles like this&quot; or  <br/>\nsomeone who has thrown pots says &quot;You&#39;d know this if you had an  <br/>\nelectric wheel, but you&#39;re kicking the wrong way,&quot; that&#39;s helpful.  It  <br/>\ndoesn&#39;t mean they are invaluable teachers.  It means the learner got  <br/>\nsome help, just a little, just enough.  Not &quot;a lesson&quot; or &quot;a course.&quot;<br/>\n<br/>\n-=-I don&#39;t play recorder, I play piano. But, with the very good book  <br/>\nwe have,<br/>\nmy daughter and I have been able to work out how to play it, my  <br/>\ndaughter has<br/>\nlearnt to read music using the book, not by me teaching her, but I&#39;ve  <br/>\nbeen<br/>\nwith her every time she&#39;s practised so she can ask for help if she  <br/>\nneeds it.-=-<br/>\n<br/>\nPiano is the ultimate mechanical musical instrument.  You don&#39;t have  <br/>\nto learn how to hold your mouth, or how to hold the piano or how to  <br/>\nbreathe or tongue, or whether the inside of your mouth needs to be  <br/>\nkept wet or dry.  :-)<br/>\n<br/>\nPam&#39;s daughter Roxana figured piano out without lessons.  That was  <br/>\nawesome.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268346589","msgId":51942,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5MzY3LjE2ODM3LnFtQHdlYjExMDQwNC5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PDAxRkRFMTZBLTk4OTAtNEMwRC1CM0NGLTU0OEZEMjdBNTMzMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhuYmZxcStzb2hqQGVHcm91cHMuY29tPiA8MDFGREUxNkEtOTg5MC00QzBELUIzQ0YtNTQ4RkQyN0E1MzMxQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":51941,"nextInTopic":51944,"prevInTime":51941,"nextInTime":51943,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"***So I think renting a piccolo without going straight from there to a half hour session with someone who can play flute and piccolo would be a recipe for","messageBody":"<div id=\"ygrps-yiv-349655668\">***So I think renting a piccolo without going straight from there to a <br/>\nhalf hour session with someone who can play flute and piccolo would be <br/>\na recipe for frustration and tears. But finding someone, anyone, high <br/>\nschool marching band piccolo player, or someone from the local <br/>\norchestra, or a flute teacher, and ask for a half hour session and <br/>\ndemonstration of the instruments. .. that would be fun!***<br/>\n<br/>\n<br/>\nRight!  My kids have always had their dad around to ask!  <br/>\n<br/>\nNot very long ago, John was doing some electric guitar, kind of complicated stuff, for 2 of Chamille&#39;s friends.  At first I thought he was showing off, and maybe he was a bit, but when I jokingly said something to that effect, they all gave the, &quot;what are you talking about?&quot; sort of look and explained to me that, this was exactly the best way to learn new material.  John then went on to explain that some really great musicians have found ways to hide what their hands are doing so that others can&#39;t steal their stuff.  So, demonstrations are VERY helpful.<br/>\n<br/>\nI found that to be true of crocheting too.  I have some really good &quot;how to&quot; books, but it wasn&#39;t until I sat down with someone that did it, that it made sense to me.  Youtube videos have been helpful too.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"&quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt;","profile":"claremkirkpatrick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268343826","msgId":51941,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLT0VJTkdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","inReplyToHeader":"PEQ3N0RFMkYzMThENjQzMEM4OTk0QTc3ODJBQjk5RjI5QExZTEFMQVAyPg=="},"prevInTopic":51939,"nextInTopic":51942,"prevInTime":51940,"nextInTime":51942,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":" i really regret not listening to her about that. Isn t this the key to the whole discussion?  Yes, a teacher is invaluable to a child who wants one, who is","messageBody":"<div id=\"ygrps-yiv-860485677\">&quot; i really regret not listening to her about that.&quot;<br/>\n<br/>\nIsn&#39;t this the key to the whole discussion?  Yes, a teacher is invaluable to<br/>\na child who wants one, who is frustrated with just trying things out, who<br/>\nwants to further their learning, or get past something that they can&#39;t seem<br/>\nto get past alone.  And if your child, who has a recorder to play with wants<br/>\nlessons, then you find a way to provide that.  I think what I&#39;m saying is<br/>\nthat I don&#39;t think that lessons are inevitably necessary - they might be,<br/>\nand they might not.  Listening to your child and what he/she wants or feels<br/>\nhe/she needs at any one time will tell you whether or not lessons are<br/>\nnecessary.<br/>\n<br/>\nI don&#39;t play recorder, I play piano.  But, with the very good book we have,<br/>\nmy daughter and I have been able to work out how to play it, my daughter has<br/>\nlearnt to read music using the book, not by me teaching her, but I&#39;ve been<br/>\nwith her every time she&#39;s practised so she can ask for help if she needs it.<br/>\nShe takes it when she visits my parents-in-law - my MIL plays clarinet and<br/>\nif my BIL is there, he usually has his flute.  They usually have a &#39;jamming&#39;<br/>\nsession together and I imagine (I&#39;m never with them) that they help her with<br/>\nhints and tips.  I&#39;m not anticipating her needing or wanting any formal<br/>\nlessons until she gets a clarinet but even then, we&#39;ll continue playing it<br/>\nby ear.  What I want most is that she loves it and if she needs lessons to<br/>\ndo that, that&#39;s fine, and if she categorically wants to only play by<br/>\nherself, with no teacher, in order to love it, then that&#39;s fine too :-)<br/>\n<br/>\nI am enjoying this discussion hugely - I was very surprised when my MIL told<br/>\nme she didn&#39;t insist on my BIL continuing his flute lessons when he asked to<br/>\nstop.  She doesn&#39;t take children very seriously usually, but as a musician,<br/>\nshe seemed to really understand how much more important it was that he loved<br/>\nmusic, than that he learnt to do it perfectly according to the book.<br/>\n<br/>\nClare</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268343271","msgId":51939,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ3N0RFMkYzMThENjQzMEM4OTk0QTc3ODJBQjk5RjI5QExZTEFMQVAyPg==","inReplyToHeader":"PDk1NDZFQTFELURGMzMtNEUwMC1BQzBGLTY1QjI0OENENTA4QkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VJS0dIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4gPDk1NDZFQTFELURGMzMtNEUwMC1BQzBGLTY1QjI0OENENTA4QkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51938,"nextInTopic":51941,"prevInTime":51938,"nextInTime":51940,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"my daughter just had a resurgence  in her interest in piano - after a long deschooling break (3years without piano lessons specifically, 1.5 years without","messageBody":"<div id=\"ygrps-yiv-1515927940\">my daughter just had a resurgence  in her interest in piano - after a long deschooling break (3years without piano lessons specifically, 1.5 years without school). <br/>\n<br/>\nshe hasn&#39;t touched the piano in 3 years, and was at a bookstore with her unschooling teen crowd and found a book of amanda palmer&#39;s sheet music and became extremely inspired  - to the extent that she was willing to buy it with her own money (i bought it for her) - she came straight home and worked on a song on the piano for a couple hours.  she  just needed me to remind her of how to read the bar, and she took it from there.  <br/>\n<br/>\ni have never seen her so excited about piano or music.  yes, she learned to read music when she took lessons, but i actually think i could have shown her how in 15 minutes, because she was so engaged and inpsired by it.  her friend is going to learn the chords on guitar so they can play it together. <br/>\n<br/>\nwhen she was taking lessons, we tried everything to help her &quot;stick with it&quot; :/  - switched teachers several times, switched to every other week, etc.  she loved one teacher - didn&#39;t really love the rest, and would have quit long before if we hadn&#39;t pushed.  if she&#39;d quit earlier, i think she&#39;d have picked it back up earlier.  i really regret not listening to her about that.<br/>\n<br/>\nwarmly, lyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca","from":"&quot;Rebecca&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ideas for facilitating music interest?","postDate":"1268341129","msgId":51938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuYmxpOSs4MW81QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAxRkRFMTZBLTk4OTAtNEMwRC1CM0NGLTU0OEZEMjdBNTMzMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51935,"nextInTopic":51939,"prevInTime":51937,"nextInTime":51939,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"... After thinking this over a little (and digging deep into my dusty memories), I agree with Sandra on this. Access to a mentor, even if it s short-term,","messageBody":"<div id=\"ygrps-yiv-1288446672\"><blockquote><span title=\"ireply\">&gt; So I think renting a piccolo without going straight from there to a  <br/>\n&gt; half hour session with someone who can play flute and piccolo would be  <br/>\n&gt; a recipe for frustration and tears.  But finding someone, anyone, high  <br/>\n&gt; school marching band piccolo player, or someone from the local  <br/>\n&gt; orchestra, or a flute teacher, and ask for a half hour session and  <br/>\n&gt; demonstration of the instruments... that would be fun!<br/>\n<br/>\n </span></blockquote>After thinking this over a little (and digging deep into my dusty memories), I agree with Sandra on this. Access to a mentor, even if it&#39;s short-term, would likely be a very fun and encouraging way to begin.<br/>\n<br/>\nAfter receiving my flute, I did attend an afternoon workshop to help me learn to make sounds. And then I started band (where I did have access to someone who understood the instrument, even if he wasn&#39;t an expert flautist). I also played piano previous to this and was reading music. So, my experience really can&#39;t be compared to someone who is wanting to explore and try an instrument for the first time.<br/>\n<br/>\nI was getting over a cold when my mom brought home my flute and I remember sitting on the couch trying to get the thing to make a noise and thinking that I&#39;d never be able to play it! I&#39;m glad I didn&#39;t have to wallow in those feelings for long.<br/>\n<br/>\nSo, yeah. Supported exploration is likely the most encouraging route.<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"&quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt;","profile":"claremkirkpatrick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268339108","msgId":51932,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLS0VJTEdIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","inReplyToHeader":"PDk1NDZFQTFELURGMzMtNEUwMC1BQzBGLTY1QjI0OENENTA4QkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":51930,"nextInTopic":51933,"prevInTime":51931,"nextInTime":51933,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"I taught myself to play the piano, with basic help from my Grandma.  When my parents had the money for lessons, I was started by my teacher at Grade 5! You","messageBody":"<div id=\"ygrps-yiv-199724860\">I taught myself to play the piano, with basic help from my Grandma.  When my<br/>\nparents had the money for lessons, I was started by my teacher at Grade 5!<br/>\nYou don&#39;t need a teacher to learn music.  It helps, but not if it puts you<br/>\noff!<br/>\n<br/>\nMy 6yo is learning recorder, from a book.  She&#39;s lucky - both DH and I can<br/>\nread music, and he is a talented bass guitarist.  But we will pay for<br/>\nlessons if she seems to want them, and not hesitate to stop them if she<br/>\nchanges her mind.<br/>\n<br/>\nI think that learning to play an instrument is much like learning to read -<br/>\npush too much and it can stop them enjoying reading completely, but give<br/>\nthem help when they need it, just the right amount at just the right time,<br/>\nand they&#39;ll thrive, especially if, in the case of music, they have a passion<br/>\nand a talent for it.<br/>\n<br/>\nI&#39;m interested in others&#39; views because of our situation with our oldest -<br/>\nshe wants to learn saxophone eventually and we have been advised to start<br/>\noff with a clarinet until she&#39;s in her early teens.  We&#39;re going with seeing<br/>\nhow often she likes to practice her recorder before we invest the rather<br/>\nlarger amount of money in a clarinet, even though she&#39;s really very keen to<br/>\nget one.<br/>\n<br/>\nClare<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\n[mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>]On Behalf Of Sandra Dodd<br/>\nSent: 11 March 2010 20:12<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSubject: Re: [AlwaysLearning] Re: Ideas for facilitating music interest?<br/>\n<br/>\n<br/>\n-=-I am now a great believer in letting a child learn an instrument<br/>\nthe way<br/>\nthey see fit - if that means lessons and exams, then fine, if it means<br/>\njust<br/>\nexploring and playing then also fine. Personally, I&#39;m staring to<br/>\nwonder if<br/>\nthat inate musicality that some people have can be crushed by too formal<br/>\nlessons.-=-<br/>\n<br/>\nI agree, but your brother did have enough lessons to learn how to make<br/>\nthe tone and to know what the symbols on the fingering chart meant.<br/>\nThat&#39;s enough, for some people.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268338306","msgId":51930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk1NDZFQTFELURGMzMtNEUwMC1BQzBGLTY1QjI0OENENTA4QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VJS0dIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VJS0dIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":51928,"nextInTopic":51932,"prevInTime":51929,"nextInTime":51931,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"-=-I am now a great believer in letting a child learn an instrument the way they see fit - if that means lessons and exams, then fine, if it means just ","messageBody":"<div id=\"ygrps-yiv-472680797\">-=-I am now a great believer in letting a child learn an instrument  <br/>\nthe way<br/>\nthey see fit - if that means lessons and exams, then fine, if it means  <br/>\njust<br/>\nexploring and playing then also fine. Personally, I&#39;m staring to  <br/>\nwonder if<br/>\nthat inate musicality that some people have can be crushed by too formal<br/>\nlessons.-=-<br/>\n<br/>\nI agree, but your brother did have enough lessons to learn how to make  <br/>\nthe tone and to know what the symbols on the fingering chart meant.    <br/>\nThat&#39;s enough, for some people.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268337781","msgId":51935,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0NjY3MC4zMDk2NS5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VJS0dIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","referencesHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VJS0dIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4="},"prevInTopic":51933,"nextInTopic":51938,"prevInTime":51934,"nextInTime":51936,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"***I am now a great believer in letting a child learn an instrument the way they see fit - if that means lessons and exams, then fine, if it means just ","messageBody":"<div id=\"ygrps-yiv-1416463414\">***I am now a great believer in letting a child learn an instrument the way<br/>\nthey see fit - if that means lessons and exams, then fine, if it means just<br/>\nexploring and playing then also fine. Personally, I&#39;m staring to wonder if<br/>\nthat inate musicality that some people have can be crushed by too formal<br/>\nlessons.***<br/>\n<br/>\nMy husband is one of those people that can pick up just about any instrument and make it sound good, without ever having touched it before, let alone having any music lessons.<br/>\n<br/>\nOur house is full of music instruments.  We seem to have a constant influx and outgo of instruments.  More stay than leave.  Both my girls have fiddled around with musical instruments.  Chamille has a drum set in her bedroom right now.  She rarely practices, but when she plays, she&#39;s good.  She&#39;s been good at playing the drums since she was old enough to sit on the throne.<br/>\n<br/>\nI really believe motivation and desire is far more important to learning an instrument than the technicalities.  If the piccolo turns out to be too hard at first, what does the kid have to lose?  You can still go out and get a flute to learn on if it seems like that might be better.  That&#39;s all part of the trial and error part of life!  Learning is still happening!  In the meantime help keep the frustration levels down, if they seem higher than they need be!<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268336933","msgId":51933,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxRkRFMTZBLTk4OTAtNEMwRC1CM0NGLTU0OEZEMjdBNTMzMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhuYmZxcStzb2hqQGVHcm91cHMuY29tPg==","referencesHeader":"PGhuYmZxcStzb2hqQGVHcm91cHMuY29tPg=="},"prevInTopic":51932,"nextInTopic":51935,"prevInTime":51932,"nextInTime":51934,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"On my own I tried several times to learn calligraphy, but couldn t get it.  One lesson with a calligrapher and the rest was easy.  The things I needed to know","messageBody":"<div id=\"ygrps-yiv-1709686667\">On my own I tried several times to learn calligraphy, but couldn&#39;t get  <br/>\nit.  One lesson with a calligrapher and the rest was easy.  The things  <br/>\nI needed to know how to do needed someone right there coaching me  <br/>\nthrough how deep to dip the pen, what angle to hold it, how hard to  <br/>\npress.<br/>\n<br/>\nOn my own I had tried to play recorder, and I did do it a little, but  <br/>\nnot smoothly--very awkwardly.  I had no idea what to do with the hand  <br/>\nthat was covering any holes!  Clarinets and saxophones have a  <br/>\nthumbrest; recorders don&#39;t.<br/>\n<br/>\nOne session with an experienced player to answer my questions, and I  <br/>\nwas OFF!<br/>\n<br/>\nAfter a couple of years I took some serious lessons (one year of  <br/>\nuniversity lessons) with Floyd Williams, who teaches at a conservatory  <br/>\nin Australia now, and that was coaching for playing Telemann Sonatas  <br/>\nand suchlike--the serious recorder repertoire.  It was fun!  But to  <br/>\nhave lessons like that, one already needs to know music reading and  <br/>\nthe instrument.  So I&#39;m not recommending those lessons.  I&#39;m telling  <br/>\nthat to keep from being a fibber about &quot;one session.&quot;<br/>\n<br/>\nI have a lot of facility with calligraphy and playing recorder now,  <br/>\nbut I did need that session with someone who could say &quot;Oh!  Tongue  <br/>\nagainst the roof of your mouth, &#39;duh,&#39; rather than the back of your  <br/>\nteen &quot;tuh,&quot; and &quot;Dip the pen about halfway to the top of the  <br/>\nreservoir, and then scrape off the excess; or some people use a piece  <br/>\nof paper towel...&quot; [in a way I can&#39;t describe in writing, but could  <br/>\nshow you in person].&quot;<br/>\n<br/>\nSo I think renting a piccolo without going straight from there to a  <br/>\nhalf hour session with someone who can play flute and piccolo would be  <br/>\na recipe for frustration and tears.  But finding someone, anyone, high  <br/>\nschool marching band piccolo player, or someone from the local  <br/>\norchestra, or a flute teacher, and ask for a half hour session and  <br/>\ndemonstration of the instruments... that would be fun!<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":279436458,"authorName":"Clare Kirkpatrick","from":"&quot;Clare Kirkpatrick&quot; &lt;clare.kirkpatrick@...&gt;","profile":"claremkirkpatrick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Re: Ideas for facilitating music interest?","postDate":"1268336691","msgId":51928,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PElGRUFMQk1FRUZNSUhESUZIT0tLQ0VJS0dIQUEuY2xhcmUua2lya3BhdHJpY2tAYmx1ZXlvbmRlci5jby51az4=","inReplyToHeader":"PGhuYmZxcStzb2hqQGVHcm91cHMuY29tPg=="},"prevInTopic":51926,"nextInTopic":51930,"prevInTime":51927,"nextInTime":51929,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"My brother in law wanted to learn to play the flute.  He got so bored of having to learn scales in lessons that he asked his mum if he could stop the lessons","messageBody":"<div id=\"ygrps-yiv-1176212723\">My brother in law wanted to learn to play the flute.  He got so bored of<br/>\nhaving to learn scales in lessons that he asked his mum if he could stop the<br/>\nlessons and just play for fun.  She, thankfully, agreed.  He is now an<br/>\nextremely talented and experienced jazz flautist, with his own independent<br/>\nrecord label.  He&#39;s a talented composer too, and has qualifications from<br/>\nGoldsmiths in London, where he now teaches as well.<br/>\n<br/>\nI am now a great believer in letting a child learn an instrument the way<br/>\nthey see fit - if that means lessons and exams, then fine, if it means just<br/>\nexploring and playing then also fine.  Personally, I&#39;m staring to wonder if<br/>\nthat inate musicality that some people have can be crushed by too formal<br/>\nlessons.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My daughter is unenthusiastic about flute lessons.  So I wondered if<br/>\n </span></blockquote>anyone in this group had any suggestions on how to help my daughter explore<br/>\nthis interest of hers.  Is the above statement true, or just pedagogically<br/>\ncorrect? &lt;</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca","from":"&quot;Rebecca&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ideas for facilitating music interest?","postDate":"1268335258","msgId":51926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuYmZxcStzb2hqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuOGhmaytraWo2QGVHcm91cHMuY29tPg=="},"prevInTopic":51917,"nextInTopic":51928,"prevInTime":51925,"nextInTime":51927,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"... I thought I d read a suggestion to rent a piccolo for her to just play with a little. I can t seem to find that message (so maybe I made it up!) but it","messageBody":"<div id=\"ygrps-yiv-2040085442\"><blockquote><span title=\"ireply\">&gt; My daughter is unenthusiastic about flute lessons.  So I wondered if anyone in this group had any suggestions on how to help my daughter explore this interest of hers.  Is the above statement true, or just pedagogically correct? &lt;<br/>\n<br/>\n </span></blockquote>I thought I&#39;d read a suggestion to rent a piccolo for her to just play with a little. I can&#39;t seem to find that message (so maybe I made it up!) but it seemed like a great idea to me. And, perhaps, rent a flute, too, so that she can play with making sounds on both of them. She may be able to make her own decision about which instrument feels best to her (or feels most satisfactory as she&#39;s learning to make sounds). <br/>\n<br/>\nWhen I was 7, I wanted to play in the school band and I really wanted to play the clarinet. I was told that my fingers were too small to cover the holes and that I should play a closed-hole flute instead (and I did manage just fine at that age). I liked the flute but was always a bit sad that I didn&#39;t get my first choice because I was &quot;too small&quot;.<br/>\n<br/>\nBeing part of band (instead of having private lessons) means that I did teach myself to play the flute competently, so it is possible. <br/>\n<br/>\nThe suggestion to start by making sound only using the mouth piece is a good one. And &quot;playing&quot; bottles (different levels of fluid) is a fun way to get the feel for how the air works.<br/>\n<br/>\nWould love to know how this works out for her!<br/>\n<br/>\n- Rebecca</div>","specialLinks":[]},{"userId":62589750,"authorName":"JudithAnneMurphy@aol.com","from":"JudithAnneMurphy@...","profile":"shepherdlass","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Ideas for facilitating music interest?","postDate":"1268332998","msgId":51917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFiMzBlLjE1MzczOTk3LjM4Y2E5M2M2QGFvbC5jb20+"},"prevInTopic":51888,"nextInTopic":51926,"prevInTime":51916,"nextInTime":51918,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1761875226\">&lt;Flutes come in closed hole models so that finger positions don&#39;t need  to <br/>\nbe exact, making it pretty likely &lt;that she could play if she wanted to,  <br/>\nunless she&#39;s a very small 9. There is a whole world of good quality &lt;penny  <br/>\nwhistles and pipes that you could investigate that might be in the piccolo  <br/>\nrange, if it&#39;s the sound that &lt;intrigues her, although having small hands  <br/>\nmyself, I have actually found the holes frustratingly challenging &lt;to  cover&gt;<br/>\n <br/>\nI agree with this.  I play flute and recorders, and a closed hole  flute <br/>\n(with the keywork doing the work of your finger pads)  is less  of a stretch <br/>\nfor small hands than an alto/treble recorder. Descant/soprano  recorder is <br/>\nsmaller, but it isn&#39;t necessarily an ideal stepping stone  to flute:  the <br/>\nblowing techniques of recorders and flutes are very  different and she&#39;d have to <br/>\nrelearn what to do with her  cheek muscles.  <br/>\n <br/>\nAlso you can get flutes with curved head joints which mean that small arms  <br/>\ndon&#39;t have to stretch so far to hold the instrument in position.<br/>\n <br/>\nI do think it would be easiest to start on flute because it&#39;s more  <br/>\nforgiving on the embouchure (shape of the mouth) and the breath  control.  This <br/>\nmeans your daughter will be making music more quickly and  the transition to <br/>\npiccolo will not be so difficult as starting from  scratch.  It can be <br/>\ndiscouraging to spend so much time  in mastering a difficult technique that you get <br/>\nlittle chance to actually  play a tune.<br/>\n <br/>\nJude x<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Ideas for facilitating music interest?","postDate":"1268294367","msgId":51888,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuYTdzdiszNWRpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhuOGhmaytraWo2QGVHcm91cHMuY29tPg=="},"prevInTopic":51872,"nextInTopic":51917,"prevInTime":51887,"nextInTime":51889,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"I play the flute, and played piccolo as well as a young person.  I would have to agree with what they ve said, although I hate to say anything that would come","messageBody":"<div id=\"ygrps-yiv-149898826\">I play the flute, and played piccolo as well as a young person.  I would have to agree with what they&#39;ve said, although I hate to say anything that would come across as discouraging.  Getting a good tone on the piccolo really is very challenging.  Although I still occasionally play (some times more than others) I can&#39;t even really get a good sound anymore without a lot of practice--and I was at the point where I considered playing professionally.<br/>\n<br/>\nI don&#39;t know that I agree about the &quot;...acquiring improper technique&quot; part.  I think it&#39;s easier to acquire improper technique on the flute than the piccolo--in part because you have to be good to get a sound and to be able to move the sound up and down--hence the frustration part.  All that being said, though, would there be that much harm in renting one for a month or so to play around with?  The first thing you do in teaching flute, or piccolo, is to use just the headpiece, unconnected to the body, and play with it to make a sound.  When the sound is relatively clear and consistent, then you attach the body, and it&#39;ll be easier to find the way to make sound again.<br/>\n<br/>\nFlutes come in closed hole models so that finger positions don&#39;t need to be exact, making it pretty likely that she could play if she wanted to, unless she&#39;s a very small 9.  There is a whole world of good quality penny whistles and pipes that you could investigate that might be in the piccolo range, if it&#39;s the sound that intrigues her, although having small hands myself, I have actually found the holes frustratingly challenging to cover, depending on the style and model--even some of the smaller ones, because they don&#39;t necessarily scale down the finger spacing.  Just something to keep in mind.<br/>\n<br/>\nYou&#39;ve probably already thought about recorders...<br/>\n<br/>\nThis place has an amazing selection of high quality pipes, etc., plus lots of other good stuff:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://larkinthemorning.com/\">http://larkinthemorning.com/</a><br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Ideas for facilitating music interest?","postDate":"1268246923","msgId":51872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3MEZCRUE3LUU1RDAtNDA1OC1BQkQzLTc5RjA1QzUxODk4NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhuOGhmaytraWo2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuOGhmaytraWo2QGVHcm91cHMuY29tPg=="},"prevInTopic":51871,"nextInTopic":51888,"prevInTime":51871,"nextInTime":51873,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"-=- I would advise against starting on the piccolo. This manner of instruction is...the approach of competent pedagoues world-wide. The flute is extremely","messageBody":"<div id=\"ygrps-yiv-2090831858\">-=- I would advise against starting on the piccolo. This manner of  <br/>\ninstruction is...the approach of competent pedagoues world-wide. The  <br/>\nflute is extremely challenging to learn with the finest instruction,  <br/>\nyet is easier to learn than the piccolo. Trying to pick up the piccolo  <br/>\non one&#39;s own is a recipe for frustration and acquiring improper  <br/>\ntechnique that will hinder future progress.---=-<br/>\n<br/>\nMaybe you could find a teacher.  There&#39;s NO WAY,  unless you&#39;ve played  <br/>\nflute, that she&#39;ll figure it out from a book.   *MAYBE* there are some  <br/>\nyoutube videos or a video flute instruction that would help.<br/>\n<br/>\nAt nine, her hands might be small for a flute.<br/>\n<br/>\nLast night Holly was making a &quot;hooo&quot; sound with a coke bottle, which  <br/>\nshe only learned to do yesterday.  She was kinda berating me for not  <br/>\nhaving shown her earlier, but coke has come in cans her whole life.   <br/>\nShe just happened to get a case of Mexican coke, and it didn&#39;t occur  <br/>\nto me to show her earlier on juice, and a SoBe bottle is too big a  <br/>\nmouth.   But that&#39;s the kind of sound making flutes take, and you  <br/>\nchange the speed of the air and the angle of the flute a little bit to  <br/>\nmake it an octave higher.  It&#39;s tricky.<br/>\n<br/>\nWith a piccolo, the speed and angle are even more important.  It&#39;s  <br/>\neasier to make a sound on a flute than a piccolo.<br/>\n<br/>\n-=-At this point I&#39;m not worried about her &quot;future progress&quot;. On the  <br/>\nother hand, I don&#39;t want to set her up for frustration or make it  <br/>\nharder to learn to play well later on, should her interest lead her  <br/>\nthat way.-=-<br/>\n<br/>\nIt wouldn&#39;t make it harder to learn later on.  What if you find a  <br/>\nflute player, explain all this (or just forward the e-mails) and ask  <br/>\nfor a session in which she can see the flute and piccolo played, close  <br/>\nup.  And maybe you could ask in advance for the name of musical pieces  <br/>\nthat feature piccolo, and maybe download some of those, or get them  <br/>\nsomehow.  She could explore the history and reality of piccolos  <br/>\nwithout starting from trying to learn to play one.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":221591978,"authorName":"Bernadette Lynn","from":"Bernadette Lynn &lt;bernadette.lynn@...&gt;","profile":"bwalyalynn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Ideas for facilitating music interest?","postDate":"1268240673","msgId":51871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU2OGY4YWExMDAzMTAwOTA0cjY3OThkNDR5ZDkzY2UzYjA4Yjc5MDAyNUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGhuOGhmaytraWo2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuOGhmaytraWo2QGVHcm91cHMuY29tPg=="},"prevInTopic":51870,"nextInTopic":51872,"prevInTime":51870,"nextInTime":51872,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"... My sister did learn the flute first and had a handful of lessons from a school music teacher - who was actually a clarinet player and barely played the","messageBody":"<div id=\"ygrps-yiv-398250449\">On 10 March 2010 16:30, thecugals &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:thecugals@...\">thecugals@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; -- I would advise against starting on the piccolo. This manner of<br/>\n&gt; instruction is...the approach of competent pedagoues world-wide. The flute<br/>\n&gt; is extremely challenging to learn with the finest instruction, yet is easier<br/>\n&gt; to learn than the piccolo. Trying to pick up the piccolo on one&#39;s own is a<br/>\n&gt; recipe for frustration and acquiring improper technique that will hinder<br/>\n&gt; future progress.--<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>My sister did learn the flute first and had a handful of lessons from a<br/>\nschool music teacher - who was actually a clarinet player and barely played<br/>\nthe flute - in lessons which she shared with a clarinet student and an oboe<br/>\nstudent. However apart from that she learned flute and piccolo on her own<br/>\nand did well enough to gain a place in music college to study for a<br/>\nperformance (degree equivalent) qualification.<br/>\n<br/>\nI would agree that her instruction made learning extremely challenging for<br/>\nher though!<br/>\n<br/>\nI believe the piccolo takes more breath control and requires stronger mouth<br/>\nmuscles than the flute; it may take longer to make a nice sound and to reach<br/>\nthe higher registers than the flute would, but if someone wants to learn<br/>\nthey probably won&#39;t see that as a problem as much as a teacher does.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nBernadette.<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bbc.co.uk/dna/h2g2/U15459\">http://www.bbc.co.uk/dna/h2g2/U15459</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":415223200,"authorName":"BlueOcean","from":"&quot;BlueOcean&quot; &lt;blueocean@...&gt;","profile":"littaladybug","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Ideas for facilitating music interest?","postDate":"1268240344","msgId":51870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2MwMWNhYzA3MiRmZGMyYjA4MCQwMzAyYThjMEBsaXNhc3I3MXZueWt5dT4=","referencesHeader":"PGhuOGhmaytraWo2QGVHcm91cHMuY29tPg=="},"prevInTopic":51869,"nextInTopic":51871,"prevInTime":51869,"nextInTime":51871,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"I would agree from experience that there is truth to their statement. If I knew someone wanting to learn how to play the piccolo trumpet, for example, I would","messageBody":"<div id=\"ygrps-yiv-1450759739\">I would agree from experience that there is truth to their statement. If I <br/>\nknew someone wanting to learn how to play the piccolo trumpet, for example, <br/>\nI would definitely advise them to start on the trumpet. The embouchure <br/>\n(adjustment of the player&#39;s mouth to the mouthpiece) for playing trumpet is <br/>\nchallenging, and the same general technique is used for the piccolo trumpet <br/>\nbut it is much harder (tighter, etc.) needing the slow building of those <br/>\nmuscles over time. To start out with the PT would be very frustrating and <br/>\ndifficult--not that it couldn&#39;t be done, but it would be much harder and <br/>\ntake a lot of perseverance and determination to overcome the building of <br/>\nembouchure muscles leading up to it.<br/>\n<br/>\nI would suggest renting a flute on a short-term basis, say, three months or <br/>\nso, so that your daughter can get the fingerings down (much easier on the <br/>\nflute keys because they are larger) and start to build proper embouchure <br/>\ntechnique. That way she can see the relationship between one instrument and <br/>\nthe other and will feel like she has a bit of a leg up when she starts with <br/>\nthe piccolo. She could consider it another type of warm-up, like any good <br/>\nmusician would do before playing his/her instrument.<br/>\n<br/>\nAs for lessons or trying to go it on her own, she can very likely find good <br/>\ntutorials on YouTube and see how that works out before looking into face to <br/>\nface lessons if that doesn&#39;t interest her at first.<br/>\n<br/>\nHTH,<br/>\nBlue<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\n<br/>\nMy daughter is unenthusiastic about flute lessons.  So I wondered if anyone <br/>\nin this group had any suggestions on how to help my daughter explore this <br/>\ninterest of hers.  Is the above statement true, or just pedagogically <br/>\ncorrect?  At this point I&#39;m not worried about her &quot;future progress&quot;.  On the <br/>\nother hand, I don&#39;t want to set her up for frustration or make it harder to <br/>\nlearn to play well later on, should her interest lead her that way.<br/>\n<br/>\nBeth C. </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Ideas for facilitating music interest?","postDate":"1268240223","msgId":51869,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI5NjI5Mi42MDQwNi5xbUB3ZWI4MTUwMi5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGhuOGhmaytraWo2QGVHcm91cHMuY29tPg==","referencesHeader":"PGhuOGhmaytraWo2QGVHcm91cHMuY29tPg=="},"prevInTopic":51868,"nextInTopic":51870,"prevInTime":51868,"nextInTime":51870,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"I would advise against starting on the piccolo. This manner of instruction is...the approach of competent pedagoues world-wide. The flute is extremely","messageBody":"<div id=\"ygrps-yiv-551176535\">&quot;I would advise against starting on the piccolo. This manner of instruction is...the approach of competent pedagoues world-wide. The flute is extremely challenging to learn with the finest instruction, yet is easier to learn than the piccolo. Trying to pick up the piccolo on one&#39;s own is a recipe for frustration and acquiring improper technique that will hinder future progress.--&quot;<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nI think they forgot to tell my brother that.<br/>\nWhen he was about about 12 y.o they has some flute classes at school were  we learned a simple song. Even I did and I am musically handicapped.<br/>\nMy brother learned the song and right way started playing many other songs by ear. Not simple ones either. But any thing he wanted on the flute.<br/>\nLater on my dad got him a beautiful harmonica and he also learned to play that on his own.<br/>\nIf you go to my Youtube channel under Polykow you can see a video of him playing guitar and his harmonica at the same time.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":241447822,"authorName":"thecugals","from":"&quot;thecugals&quot; &lt;thecugals@...&gt;","profile":"thecugals","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Ideas for facilitating music interest?","postDate":"1268238644","msgId":51868,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhuOGhmaytraWo2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":51869,"prevInTime":51867,"nextInTime":51869,"topicId":51868,"numMessagesInTopic":0,"msgSnippet":"My 9-year-old daughter is interested in playing the piccolo.  Next year she could take lessons at the local elementary school, and in the meantime my husband","messageBody":"<div id=\"ygrps-yiv-1186415424\">My 9-year-old daughter is interested in playing the piccolo.  Next year she could take lessons at the local elementary school, and in the meantime my husband and I thought it would be nice for her to have a piccolo just to have fun with/play on.  While looking around for piccolos to buy or rent, we were told that the school may not let her take piccolo lessons without taking flute lessons first.  So I contacted someone at the school and got this reply:<br/>\n<br/>\n-- I would advise against starting on the piccolo. This manner of instruction is...the approach of competent pedagoues world-wide. The flute is extremely challenging to learn with the finest instruction, yet is easier to learn than the piccolo. Trying to pick up the piccolo on one&#39;s own is a recipe for frustration and acquiring improper technique that will hinder future progress.--<br/>\n<br/>\nMy daughter is unenthusiastic about flute lessons.  So I wondered if anyone in this group had any suggestions on how to help my daughter explore this interest of hers.  Is the above statement true, or just pedagogically correct?  At this point I&#39;m not worried about her &quot;future progress&quot;.  On the other hand, I don&#39;t want to set her up for frustration or make it harder to learn to play well later on, should her interest lead her that way.<br/>\n<br/>\nBeth C.</div>","specialLinks":[]}],"prevTopicId":51860,"nextTopicId":52014}}