{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":33,"messages":[{"userId":342782030,"authorName":"K Pennell","from":"K Pennell &lt;mrsringsabre@...&gt;","profile":"mrsringsabre","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1360848491","msgId":70532,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjA4NDg0OTEuODU1MDkuWWFob29NYWlsTmVvQHdlYjE2MjEwMy5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PDEzNjA2OTM1NjEuOTQzNDkuWWFob29NYWlsTmVvQHdlYjE4MjIwMi5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PDYwMzk0RkU1LUJGQzAtNDM0MC1BOTlELUE3NjY2MkY1OTZDN0BTYW5kcmFkb2RkLmNvbT4gPGtmZHN1Zit1czR1QGVHcm91cHMuY29tPiA8MTM2MDY5MzU2MS45NDM0OS5ZYWhvb01haWxOZW9Ad2ViMTgyMjAyLm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":70525,"nextInTopic":70534,"prevInTime":70531,"nextInTime":70533,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"At one point constipation was a problem with my son. We tried Miralax, Milk of Mag (with some success). The Milk of Mag was very bad tasting, and my son would","messageBody":"<div id=\"ygrps-yiv-1994777542\">At one point constipation was a problem with my son. We tried Miralax, Milk of Mag (with some success). The Milk of Mag was very bad tasting, and my son would practically gag. He generally wouldn&#39;t take that. Miralax not so bad, but it didn&#39;t work as consistently either.The doctor at one point suggested mineral oil in juice. It doesn&#39;t change the taste, but does change the consistency of the juice. We tried it, and he was able to go and feel better after a bit. For a while after, he was taking a spoonful of mineral oil in juice every night, to help with avoiding constipation and encopresis. This seemed to stop the cycle he&#39;d gotten in, where he&#39;d have a painful movement, then avoid going until he was very backed up again, have another painful one, etc...The mineral oil just helped it to be easier, so he had successful pain free bowel movements.<br/>\n<br/>\nWe&#39;ve stopped doing it as a general thing. Now he will let us know if he&#39;s getting backed up and ask for some mineral oil for a few days. It isn&#39;t an instant cure, but if your son doesn&#39;t mind the consistency, it might help him to be able to go more easily.<br/>\n<br/>\nMy son doesn&#39;t have as much difficulty now, and he is more active, that&#39;s true. But when he was very constipated, he had little interest in being active. We used to try to encourage him to go for a walk when he was very constipated. But his belly hurt, he was lethargic and felt lousy. The last thing he wanted to do was go do something away from home (and away from our own bathroom, if the urge came). Instead, we let him to jump on our bed if he was up for it. I think knowing  his bathroom was right there for him was a comfort. We made sure to keep his favorite comic books in there for him.</div>","specialLinks":[]},{"userId":359707411,"authorName":"dezignarob","from":"&quot;dezignarob&quot; &lt;dezignarob@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1360716043","msgId":70525,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmZW5lYitrM2s5QGVHcm91cHMuY29tPg=="},"prevInTopic":70524,"nextInTopic":70532,"prevInTime":70524,"nextInTime":70526,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"==== Today I found myself feeling lost. I told my son that I miss him and although I enjoy connecting with him on things he is passionate about, I would like","messageBody":"<div id=\"ygrps-yiv-789036661\">==== Today I found myself feeling lost. I told my son that I miss him and although I enjoy connecting with him on things he is passionate about, I would like to share with him things I&#39;m passionate about. I asked him if we could schedule a hike in our week to do together. He looked at our chalkboard calendar and pointed at Friday and I immediately wrote it in. ===<br/>\n<br/>\nIt can&#39;t be an even handed, tit-for-tat, equal relationship between a mom and an 8 year old, where you take turns sharing a passion back and forth. You aren&#39;t equals emotionally or developmentally.<br/>\n<br/>\nAre you actually &quot;passionate&quot; about hiking? It sounded earlier like it was something you considered a means to an end (exercise for digestion). I know some people are - my step-mother-in-law was. She went hiking just about daily for 5+ hours in the Hollywood Hills or wherever they happened to be, as part of her rigorous fitness regimen. She was childless. Her husband sometimes felt neglected, to judge from his grumpy remarks about it. <br/>\n<br/>\nAnyway, I would be cautious about describing your interest as a &quot;passion&quot;, IF that is too strong a term for what is really just a pleasant hobby. It can sometimes sound like an unschooling buzzword - we talk about our kids&#39; passions. I think part of it is as an antidote to the conventional parents&#39; dismissiveness or minimizing of children&#39;s interests, and partly as an acknowledgement of the fierceness of their emotional attachment, focus and enjoyment of their favorite pastimes - even if it only lasts a short while.<br/>\n<br/>\nIt seems like you spend a lot of time in the company of younger children, if you are nannying part of the time as well as parenting. I wonder if you are subconsciously relying on your son to fulfill your emotional needs for connection. That is a lot of pressure to put on a child.  <br/>\n<br/>\nWhen Jayn was 8 she was utterly incapable of making a bargain in the future and sticking to it. She is only now at 13 coming close to being able to look 5 days into the future and make a commitment to an activity. I am worried that this Friday hiking appointment is a disaster waiting to happen. I&#39;m wondering if he looked at the calendar and said a day as far away as was practical - because as an 8 year old he lives in the now, and now he wanted Mom to quit bugging him about her stuff.<br/>\n<br/>\nIf it were Jayn, and Friday morning rolled around, chances are she would prefer to continue playing her games, skyping with her friends or laying in bed looking up funny memes on her phone. I could develop a resentment that she wasn&#39;t keeping her commitment and either express it and cause crankiness, or suppress it and feel lousy. Or I could consider this plan to be something fluid, something offered to her without obligation, and enjoy my hike on my own if she had changed her mind, and be delighted if she had not.<br/>\n<br/>\nJayn spends a lot of time doing her own thing, and asking for privacy. Then when she feels the lack of connection herself, she voluntarily chooses to spend time with me, telling me about her games, running errands, cuddling, watching our favorite shows or even going for a walk together. I make myself available to her.<br/>\n<br/>\nI would say spend time with your 4 year old, while you have the chance to do so, and be available for your 8 year old. There may come a time when they both want you at once, and you will have a tougher time.<br/>\n<br/>\n=== I also have a 4 yo that is in need of my attention, a partner and a house that I manage. I have little time for myself. <br/>\n <br/>\nHow do I manage with out going to a time schedule?===<br/>\n<br/>\nWorking out an organized schedule for yourself, such as planning a good day to do the laundry, or adding specific tasks to your own weekly calendar, is one thing, probably a good thing.<br/>\n<br/>\nImposing a schedule of how many hours one of your kids should do any particular activity, including having Mom&#39;s passions foisted on them, would probably build a pretty big unschooling road block. <br/>\n<br/>\n=== How do I detach from the members of my family with out the guilt of doing something for myself? ===<br/>\n<br/>\nPerhaps it depends on what you want to do for yourself. When you say &quot;detach&quot; do you mean leave them in the care of others, while you do something out of the house? What about that hike you mentioned? I like to walk - I go around the block, sometimes twice for at least 40 minutes. Usually I am alone, and I find it refreshing and bracing. I did a lot less solitary walking when Jayn was 8, even less when she was 4. She got older, and I got more time to focus on my own work and interests. <br/>\n<br/>\nOne day she won&#39;t be in the next room, and I will have even more time. Darn it.<br/>\n<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.robyncoburn.blogspot.com</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: I want to break out of this pattern.","postDate":"1360710442","msgId":70524,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmZWh2YSsxMDlscEBlR3JvdXBzLmNvbT4="},"prevInTopic":70523,"nextInTopic":70525,"prevInTime":70523,"nextInTime":70525,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"Does your son drink enough water?  My 7 yr old daughter sometimes gets constipated and when she drinks more, it helps.  If you son would enjoy herbal tea, you","messageBody":"<div id=\"ygrps-yiv-66601317\">Does your son drink enough water?  My 7 yr old daughter sometimes gets constipated and when she drinks more, it helps.  If you son would enjoy herbal tea, you could try offering nettles tea as is supposed to help constipation (google &quot;herbs for constipation&quot; for other ideas).  <br/>\n<br/>\nMaybe bring him some warm tea, cold water or whatever you think he would like to increase his fluid intake.  It will be another chance to interact and check in with him while he&#39;s gaming.  <br/>\n<br/>\nLaurie</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1360706798","msgId":70523,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCRkY2ODlFLTNBNUQtNDQ4RC1BODdBLTExOTVDNjFCQjNDN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtmZHN1Zit1czR1QGVHcm91cHMuY29tPg==","referencesHeader":"PGtmZHN1Zit1czR1QGVHcm91cHMuY29tPg=="},"prevInTopic":70522,"nextInTopic":70524,"prevInTime":70522,"nextInTime":70524,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"-=-I have been observing and honoring what each member of my family is wanting to spend time doing. -=- You began your post that way, but ended up sounding","messageBody":"<div id=\"ygrps-yiv-479099091\">-=-I have been observing and honoring what each member of my family is wanting to spend time doing. -=-<br/>\n<br/>\nYou began your post that way, but ended up sounding frazzled and unhappy.   <br/>\n<br/>\n-=-I still have asked a few times if he feels he needs to sit on the toilet and he has gone and come out disappointed that he hasn&#39;t had any movement.-=-<br/>\n<br/>\nProbably disappointed that you were disappointed.  Stop asking him.  Let HIM figure out when he actually needs to go.  Don&#39;t confuse him by making him think that he&#39;s late, or that it&#39;s going to sit on the toilet that causes poo to come.<br/>\n<br/>\n-=- I have talked to him about being active so his intestines become more active-=-<br/>\n<br/>\nPeople who are bedridden have bowelmovements.  Quadraplegics create poo.<br/>\nIt&#39;s not activity that causes intestines to function.<br/>\n<br/>\n-=- I have encouraged a midday hike together and he declines it and goes back to stimulating his mind and engaging with his passion. -=-<br/>\n<br/>\nYou invited him to go hiking.  Don&#39;t say &quot;I encouraged a midday hike.&quot;  Be direct and honest with your phrasing.  It will help your thinking.  A hike didn&#39;t exist.  There was only a hike in your imagination.  The imaginary hike didn&#39;t need encouragement.<br/>\n<br/>\n-=-Today I found myself feeling lost. I told my son that I miss him and although I enjoy connecting with him on things he is passionate about, I would like to share with him things I&#39;m passionate about.-=-<br/>\n<br/>\nThat is not honoring his choices. That&#39;s attempting to make him feel guilty about his choices.  <br/>\n<br/>\nIf you want to share something with him, share it, in a five or ten second share.  No one shoul dneed to schedule time to share something another person is passionate about, not in this day of recorded music and three-minute videos, magazines, digital images.  <br/>\n<br/>\nIf you show him something you think is interesting, consider it moving one pawn in an unscheduled chess match.  He might make a move; he might not.  He might make more than one move, so that there&#39;s a little conversation, or he might ask a question.  Let him be done when he&#39;s done, though, without telling him that you feel lost and that you miss him and he&#39;s not sharing.<br/>\n<br/>\n-=-I can only handle as much computer as I can process.-=-<br/>\n<br/>\nDo you imagine there is another human who can handle more of anything than they can process?  I don&#39;t want to know, but I would like for you to consider privately, why you wrote that and sent it.  What did you think we would think when we read it?  <br/>\n<br/>\n-=-I spend time looking and learning how to minecraft so that I can help him.-=-<br/>\n<br/>\nDoes he want help?  If so, you&#39;re doing a sweet mom thing. <br/>\nBut you could spend time watching him, and learning more just to observe and honor what he&#39;s interested in.  You could see it as learning about him, rather than learning about Minecraft.<br/>\n<br/>\n-=-How do I manage with out going to a time schedule? How do I detach from the members of my family with out the guilt of doing something for myself? -=-<br/>\n<br/>\nI don&#39;t understand the questions, honestly.  <br/>\n<br/>\nMake choices.  Each choice has factors.  Each time you make a choice, consider some factors.  You&#39;ll get etter at making those choices.<br/>\n<br/>\nPlease don&#39;t try to make your child feel guilty for the choices he&#39;s making.  And try not to make &quot;guilt&quot; a factor in your choices (unless you&#39;re making dozens of selfish choices every day).<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I want to break out of this pattern.","postDate":"1360701269","msgId":70522,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGNDM1NzU4LTEzOTItNEEyNS04NzVFLTMwMkY3MzA1N0I4M0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtmZHN1Zit1czR1QGVHcm91cHMuY29tPg==","referencesHeader":"PGtmZHN1Zit1czR1QGVHcm91cHMuY29tPg=="},"prevInTopic":70520,"nextInTopic":70523,"prevInTime":70521,"nextInTime":70523,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"... Those are some decent sources of fiber. Though some people need more fiber than others. Fiber tends to absorb fluid so not getting enough water can cause","messageBody":"<div id=\"ygrps-yiv-2008234152\">On Feb 12, 2013, at 12:08 PM, phoebience wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; peanuts and popcorn, carrots, hummus, hot oats. <br/>\n<br/>\n </span></blockquote>Those are some decent sources of fiber. Though some people need more fiber than others.<br/>\n<br/>\nFiber tends to absorb fluid so not getting enough water can cause constipation. So keeping water nearby is good. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I offer dried plums<br/>\n<br/>\n </span></blockquote>Google good sources of fiber. There are loads of options other than dried plums!<br/>\n<br/>\nDon&#39;t try to solve the problem for him. Look over information about constipation with him as you might show him information about pirates. Ask him if there are some he&#39;d like to add to the monkey platter or add to his diet. He might enjoy making bread with whole wheat flour. There are 10 minute artisan bread recipes. There&#39;s bread machines.<br/>\n<br/>\nBe helpful. Be a resource. But don&#39;t take over ownership of the problem. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I still have asked a few times if he feels he needs to sit on the toilet and<br/>\n&gt; he has gone and come out disappointed that he hasn&#39;t had any movement.<br/>\n<br/>\n </span></blockquote>Does he have something interesting to do in there? Does he have an iPad? Books? A handheld game?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do I detach from the members of my family with out the guilt of doing something for myself? <br/>\n<br/>\n </span></blockquote>Why should you detach? Why should be be attached? It sounds mechanical.<br/>\n<br/>\nIf you&#39;re not building meeting your needs into your day, you&#39;re showing your kids it isn&#39;t important for them to treat their needs seriously. You&#39;re showing them the best way to be is put yourself at the bottom of the priority list and everyone else above. Is that what you want to show them?<br/>\n<br/>\nAlso, people who don&#39;t treat themselves with respect tend to not get much respect. Why should others treat you with more respect than you show yourself?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Inside I struggle.<br/>\n<br/>\n </span></blockquote>I can feel it in your writing. I&#39;m betting your son does too. Stop struggling. Live life :-)<br/>\n<br/>\nFind interesting things to do while others are occupied. Do them joyfully. :-) Stay connected with everyone so you can give them space when they need it and help when they need it. Be aware of the mood in the house and mix things up. Plan outings and draw the family along with you. If they don&#39;t like others planning for them -- all depends on personality -- find other ways to mix things up.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1360695827","msgId":70520,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmZTNtais4ZGc2QGVHcm91cHMuY29tPg=="},"prevInTopic":70519,"nextInTopic":70522,"prevInTime":70519,"nextInTime":70521,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"... **************** Would he like: a mini trampoline? an exercise ball? some games which involve a lot of movement? Those would be things to do while gaming,","messageBody":"<div id=\"ygrps-yiv-87870076\">&quot;phoebience&quot;  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I have talked to him about being active so his intestines become more active. I have encouraged a midday hike together and he declines it and goes back to stimulating his mind and engaging with his passion. <br/>\n </span></blockquote>****************<br/>\n<br/>\nWould he like: a mini trampoline? an exercise ball? some games which involve a lot of movement? Those would be things to do while gaming, so he&#39;s not stuck choosing between going for a dull ol&#39; hike  and doing something engaging and intellectually stimulating. <br/>\n<br/>\nIf he like pirates, what about playing with swords? Climbing and swinging on a rope?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He is very constipated, complaining his belly hurts. <br/>\n<br/>\n </span></blockquote>Do some research into dietary and herbal remedies. You may be able to offer him something like juice or tea to help things along. He may need some kind of supplement - B vitamins maybe. Lots of people sit all day - kids in school sit all day! - without it causing constipation, so I wouldn&#39;t jump to the conclusion that&#39;s the cause.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; How do I manage with out going to a time schedule?<br/>\n<br/>\n </span></blockquote>It&#39;s not clear what you&#39;re asking... manage what? It&#39;s not bad to schedule &quot;dates&quot; to do things with your son - it could be a good solution! I&#39;d be careful about scheduling things You want to do without being sensitive to what He wants, though. So if &quot;going for a hike&quot; isn&#39;t very exciting for him, what about rock climbing? Taking a sword-fighting class together? Going to an event, a Ren-fair or Highland games, a carnival, a gaming convention, a comic book store, visit an old fort, go to a skatepark. Some of those you can do with the younger child in tow, others not so much. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1360693561","msgId":70519,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjA2OTM1NjEuOTQzNDkuWWFob29NYWlsTmVvQHdlYjE4MjIwMi5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGtmZHN1Zit1czR1QGVHcm91cHMuY29tPg==","referencesHeader":"PDYwMzk0RkU1LUJGQzAtNDM0MC1BOTlELUE3NjY2MkY1OTZDN0BTYW5kcmFkb2RkLmNvbT4gPGtmZHN1Zit1czR1QGVHcm91cHMuY29tPg=="},"prevInTopic":70518,"nextInTopic":70520,"prevInTime":70518,"nextInTime":70520,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"His diet does not sound like it is a problem and he is drinking water. You could also offer more juices if that would make him drink more and those could help","messageBody":"<div id=\"ygrps-yiv-1550456072\">His diet does not sound like it is a problem and he is drinking water.<br/>\nYou could also offer more juices if that would make him drink more and those could help too. <br/>\nI would used some Milk of Magnesium to help him out.<br/>\nSOme people will have constipation no matter what and diet and exercise sometimes is not enough why not a little help?<br/>\n Too much fiber can make you constipated!<br/>\n<br/>\nWhy do you think schedules will help? Help what?<br/>\nHim not be constipated?<br/>\nI sounds like you still are not really valuing what he likes to do and you want him to do what you want.<br/>\n Do you think making him do it will help him and you get closer?<br/>\n<br/>\nMy son&#39;s physical activities in the winter are few. I wish I could go skiing with him more but it is very expensive and about an hour away.<br/>\nWhat he loves is playing with dad, they do push ups together, rough house, do some basketball and football  play in the house, go jumping at a jumping place ( inflatables).<br/>\n I think messing with dad is his favorite and it connects them.<br/>\nWhat if you guys pretend play some pirate sword fighting ??<br/>\n<br/>\nIf your husband made you do something with him would that help you feel more loving and close to him?<br/>\n <br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n <br/>\n <br/>\n <br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":488106178,"authorName":"phoebience","from":"&quot;phoebience&quot; &lt;phoebience@...&gt;","profile":"phoebience","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1360688911","msgId":70518,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmZHN1Zit1czR1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYwMzk0RkU1LUJGQzAtNDM0MC1BOTlELUE3NjY2MkY1OTZDN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":70496,"nextInTopic":70519,"prevInTime":70517,"nextInTime":70519,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"Update and more questions: I have been observing and honoring what each member of my family is wanting to spend time doing. My son is passionate about pirates","messageBody":"<div id=\"ygrps-yiv-1439065811\">Update and more questions:<br/>\n<br/>\nI have been observing and honoring what each member of my family is wanting to spend time doing. <br/>\n<br/>\nMy son is passionate about pirates and computer gaming right now. He spends his time immersed in what he loves and I am thankful for that. <br/>\n<br/>\nInside I struggle. He eats snack foods, monkey trays and concentrates on peanuts and popcorn, carrots, hummus, hot oats. He is very constipated, complaining his belly hurts. I offer dried plums, I bought a special cup that he has been downing water with (I keep it filled all day). I still have asked a few times if he feels he needs to sit on the toilet and he has gone and come out disappointed that he hasn&#39;t had any movement. I have talked to him about being active so his intestines become more active. I have encouraged a midday hike together and he declines it and goes back to stimulating his mind and engaging with his passion. <br/>\n<br/>\nToday I found myself feeling lost. I told my son that I miss him and although I enjoy connecting with him on things he is passionate about, I would like to share with him things I&#39;m passionate about. I asked him if we could schedule a hike in our week to do together. He looked at our chalkboard calendar and pointed at Friday and I immediately wrote it in. <br/>\n<br/>\nI can only handle as much computer as I can process. I spend time looking and learning how to minecraft so that I can help him. I also have a 4 yo that is in need of my attention, a partner and a house that I manage. I have little time for myself. <br/>\n<br/>\nHow do I manage with out going to a time schedule? How do I detach from the members of my family with out the guilt of doing something for myself? <br/>\n<br/>\nI feel a flood gate opening here. <br/>\n<br/>\nThanks in advance!<br/>\nPhoebe<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd  wrote:<br/>\n&gt;<br/>\n&gt; -=-I want to break out of this pattern. I want to help guide and not control. -=-<br/>\n&gt; <br/>\n&gt; My oldest had some problems when he was young, too.  He&#39;s fine now.<br/>\n&gt; <br/>\n&gt; If it were me, I would add plums and prunes to things, see if he would take TriPhala tablets, encourage everyone in the family to drink more water, and not keep a chart, not measure, not say &quot;time to practice.&quot;  <br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":240002389,"authorName":"Andrea Catalano","from":"Andrea Catalano &lt;fennel1001@...&gt;","profile":"ajcm1207","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1360278535","msgId":70496,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA4RUI2Q0NDLTUzNUUtNDlFQi05MTkzLTRDMEZGMTZDMUNFQ0B5YWhvby5jb20+"},"prevInTopic":70489,"nextInTopic":70518,"prevInTime":70495,"nextInTime":70497,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"We tried a detangling hair brush called tangle teezer . It was recommended by a friend and it really helps. It has flexible bristles of varying lengths. It s","messageBody":"<div id=\"ygrps-yiv-540211619\">We tried a detangling hair brush called &quot;tangle teezer&quot;. It was recommended by a friend and it really helps. It has flexible bristles of varying lengths. It&#39;s available at amazon. <br/>\n<br/>\nAndrea</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1360210216","msgId":70489,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIzN0M5ODIyLUNEMjItNDk3Qi1BMUE4LTE2QkEzOTRFMzkxRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRlpqNytScmp6Qj1rTmlQNlR3Vj1yZWd0MnNTRENSLU5HNHo9NU9LYkNpUXdLMldpZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRlpqNytScmp6Qj1rTmlQNlR3Vj1yZWd0MnNTRENSLU5HNHo9NU9LYkNpUXdLMldpZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":70488,"nextInTopic":70496,"prevInTime":70488,"nextInTime":70490,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"-=- I am now so regular that if I don t go 5 x a day is weird.-=- That s a lot of times. :-) Regular might not mean what you think it means. But if a child","messageBody":"<div id=\"ygrps-yiv-2017521603\">-=- I am now so regular that if I don&#39;t go 5 x a day is weird.-=-<br/>\n<br/>\nThat&#39;s a lot of times. :-)  <br/>\n<br/>\n&quot;Regular&quot; might not mean what you think it means.<br/>\n<br/>\nBut if a child is having a hard time emotionally or physically, softer and more frequent might be helpful.  Lots of liquids can help, and fruit smoothies can too, if the goal is softer and more frequent.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"Alex Polikowsky","from":"Alex Polikowsky &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1360208155","msgId":70487,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4RkJDNTk4LTNEQzUtNDI0NS1BRTIwLUIwQTE4RThBQjJDMEB5YWhvby5jb20+","inReplyToHeader":"PDRCQUZERUMzLTMwQzMtNDkwQS1BNTk1LTk2NjdDMzQ3RkIzRUBnbWFpbC5jb20+","referencesHeader":"PGtlcDA0Nitwa3YzQGVHcm91cHMuY29tPiA8NEJBRkRFQzMtMzBDMy00OTBBLUE1OTUtOTY2N0MzNDdGQjNFQGdtYWlsLmNvbT4="},"prevInTopic":70485,"nextInTopic":70488,"prevInTime":70486,"nextInTime":70488,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"There is an informecial on TV about a new brush that is supposed to be awesome for dettangling and not tugging your hair. Gigi wants to try it and we are Going","messageBody":"<div id=\"ygrps-yiv-1042255443\">There is an informecial on TV about a new brush that is supposed to be awesome for dettangling and not tugging your hair. Gigi wants to try it and we are<br/>\nGoing to try it ! <br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt;                        \t<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":526735221,"authorName":"haydee deldenovese","from":"haydee deldenovese &lt;shybarbie22@...&gt;","profile":"shybarbie22","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1360207810","msgId":70488,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRlpqNytScmp6Qj1rTmlQNlR3Vj1yZWd0MnNTRENSLU5HNHo9NU9LYkNpUXdLMldpZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":70487,"nextInTopic":70489,"prevInTime":70487,"nextInTime":70489,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"I can only suggest raw foods. I myself had issues until I became a raw foodist. I am now so regular that if I don t go 5 x a day is weird. I would suggest raw","messageBody":"<div id=\"ygrps-yiv-1279217292\">I can only suggest raw foods. I myself had issues until I became a raw<br/>\nfoodist. I am now so regular that if I don&#39;t go 5 x a day is weird. I would<br/>\nsuggest raw foods, it works very well.<br/>\n<br/>\nGood luck<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":442033011,"authorName":"Gwen Montoya","from":"Gwen Montoya &lt;lifeisjustthis@...&gt;","profile":"willow_selene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1360201370","msgId":70485,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCQUZERUMzLTMwQzMtNDkwQS1BNTk1LTk2NjdDMzQ3RkIzRUBnbWFpbC5jb20+","inReplyToHeader":"PGtlcDA0Nitwa3YzQGVHcm91cHMuY29tPg==","referencesHeader":"PGtlcDA0Nitwa3YzQGVHcm91cHMuY29tPg=="},"prevInTopic":70470,"nextInTopic":70487,"prevInTime":70484,"nextInTime":70486,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"My SIL s trick to brushing Megan s hair (around ages 3-5) was to put on a movie Megan liked and also pull out a container of scented lipgloss for Megan to play","messageBody":"<div id=\"ygrps-yiv-659403174\">My SIL&#39;s trick to brushing Megan&#39;s hair (around ages 3-5) was to put on a movie Megan liked and also pull out a container of scented lipgloss for Megan to play with.<br/>\n<br/>\nBrushing it in the shower after applying a bunch of conditioner helps the tangles slide out. If I didn&#39;t use conditioner, I wouldn&#39;t be able to run a brush through my hair.<br/>\n<br/>\nFor a long time, Megan wore her hair long. She has fabulously curly hair that usually looked good for a few days after washing it - then it started to look a little wild. So we would wash it, then I&#39;d either brush it out, or just divide it into sections, and braid it. That look would last for a week.<br/>\n<br/>\nShe keeps her hair shorter now. Her dad gives her a hard time about how<br/>\nher hair looks (childhood issues passed on from his mom). So she is sure to wash it before she sees him - but it is a crack in their relationship for sure.<br/>\n<br/>\nGwen<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Feb 4, 2013, at 10:53 AM, &quot;Meredith&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n&gt; <br/>\n&gt; In addition to a sensitive scalp, my daughter doesn&#39;t like to be touched very much at all. In the past I would braid her hair in lots of little plaits with ribbons in them - I&#39;d get a new video game and do it while she played. It looked eccentric but deliberate - and given a little homeschooling girl who pulled away from strangers and never made eye-contact,I wanted her hair to look deliberate, not like she was neglected and abused. It had the advantage of looking good for months at a time, and polyester ribbons wash just fine in the hair. </span></blockquote></div>","specialLinks":[]},{"userId":220655190,"authorName":"Janette","from":"Janette &lt;yamaguchi3@...&gt;","profile":"iguanagirl66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1360132587","msgId":70470,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4QzI5NUNCLTY2NkItNDU1MC04NjY4LTA3NEUxQTk0Nzk1OEB2ZXJpem9uLm5ldD4="},"prevInTopic":70461,"nextInTopic":70485,"prevInTime":70469,"nextInTime":70471,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"Sandra wrote: Seeing a child where he is, and as he is, leads to love. Thank you for this. I moved into unschooling without realizing my partner wasn t as","messageBody":"<div id=\"ygrps-yiv-385397162\">Sandra wrote: Seeing a child where he is, and as he is, leads to love.<br/>\n<br/>\nThank you for this.<br/>\n<br/>\nI moved into unschooling without realizing my partner wasn&#39;t as ready  <br/>\nfor it as I was.  Because I did a ton of research and he listened when  <br/>\nI shared with him, and because he&#39;s always been, and still is, 100%  <br/>\nbehind keeping Tomás out of school (his own school years were  <br/>\nhorrible), I thought we were in this together.  But I was wrong.  I  <br/>\napologized for my error and asked how he&#39;d like to proceed, how I  <br/>\ncould make things better but he had no answer, seems resigned, and now  <br/>\nthings like pooping in diapers and not yet reading are evidence to him  <br/>\nthat this kind of learning doesn&#39;t work.  I tried to soothe his  <br/>\ndiscomfort by having Tomás do a few schoolish worksheets (Tomás would  <br/>\nhave nothing to do with them, and ran crying from the room when I  <br/>\nasked him if he wanted to try writing his name).  I shared with him  <br/>\nthe various things Tomás did in a day, let him know when he learned  <br/>\nsomething or was excited about something new.  I said if he was really  <br/>\nworried and against this we could send him to school; he said he&#39;d be  <br/>\ntoo far behind.<br/>\n<br/>\nWhat Sandra wrote has been in my head for a few days now.  When Stan  <br/>\nlooks at his son, I see how much he loves and adores him, and how good  <br/>\nthey are together.  But when his worry sets in, when he feeling  as  <br/>\nthough our son is behind (compared to schooled kids, and Tomás&#39;  <br/>\nschooled cousin, in particular), he is then seeing Tomás wrong and  <br/>\nlacking.  Not seeing his actual, lovely child at that moment, but  <br/>\neverything he is not.   Similar to how I felt about the diapers,  <br/>\nbefore I let it go.<br/>\n<br/>\nOur marriage is strong.  I do not take that for granted, though.  I  <br/>\nsee my husband, where he is, and love him there.  I want peace of mind  <br/>\nand confidence in learning for all of us. I don&#39;t know how to get  <br/>\nthere from where we are now.   How do I make this possible?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1360026984","msgId":70461,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRFMjk4NzAxLUFFOTEtNEI0My04MEM1LUQxNzMxNDY3QTVDMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE5NDI2MkNBLUZFQjMtNDdGRC05MEEwLTE3OEY2QkNERDU3QkBnbWFpbC5jb20+","referencesHeader":"PDE5NDI2MkNBLUZFQjMtNDdGRC05MEEwLTE3OEY2QkNERDU3QkBnbWFpbC5jb20+"},"prevInTopic":70460,"nextInTopic":70470,"prevInTime":70460,"nextInTime":70462,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"-=- Ps Is this a balding mans process with their own children? -=- My dad always had lots of hair, until his death in his 50 s.  (Kirby has inherited my dad s","messageBody":"<div id=\"ygrps-yiv-502217276\">-=-<br/>\nPs Is this a balding mans process with their own children? -=-<br/>\n<br/>\nMy dad always had lots of hair, until his death in his 50&#39;s.  (Kirby has inherited my dad&#39;s hair; Marty&#39;s isn&#39;t as thick.)<br/>\n<br/>\nWhen I was little, he didn&#39;t want me to cut my hair, because of a religious-based feeling that women should let their hair grow to its natural length, and not wear makeup.   I nearly always had long hair (one haircut at 11, and it grew back out; two short haircuts as an adult, both grew out.<br/>\n<br/>\nHe had grown up Southern Baptist and was big into godly modesty.  I did get my ears pierced when I was 14. Both my parents thought that was barbaric.<br/>\n<br/>\nSometimes its the voices in their heads (from their parents or grandparents)  maybe.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1360019868","msgId":70459,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlcGZpcyt1OHZ2QGVHcm91cHMuY29tPg=="},"prevInTopic":70458,"nextInTopic":70460,"prevInTime":70458,"nextInTime":70460,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"... ************** If you do an image search for cornrows or corn braids you ll get the basic idea, crossed with something like a hair wrap - now that I","messageBody":"<div id=\"ygrps-yiv-1880754685\">Lucy&#39;s web  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Are there any links or pics you could point me to, that I could show to my girls and see if they fancy giving it a try?   <br/>\n </span></blockquote>**************<br/>\n<br/>\nIf you do an image search for &quot;cornrows&quot; or &quot;corn braids&quot; you&#39;ll get the basic idea, crossed with something like a &quot;hair wrap&quot; - now that I think of it, I think I tried wrapping first and it was muuuuuuuch too time consuming, so I tried braiding a piece of ribbon around a length of hair instead - double over the ribbon and use it as two strands of the braid, with the hair as the third. As the hair grows out, you can add more ribbon to the top.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":488106178,"authorName":"Phoebe Wyllyamz","from":"Phoebe Wyllyamz &lt;phoebience@...&gt;","profile":"phoebience","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1360015335","msgId":70460,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5NDI2MkNBLUZFQjMtNDdGRC05MEEwLTE3OEY2QkNERDU3QkBnbWFpbC5jb20+"},"prevInTopic":70459,"nextInTopic":70461,"prevInTime":70459,"nextInTime":70461,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"While we are on the subject of hair here: When I was a little girl many times I had wanted to cut my hair, as it was quite long. My father seemed to have","messageBody":"<div id=\"ygrps-yiv-1450856564\">While we are on the subject of hair here:  <br/>\n<br/>\nWhen I was a little girl many times I had wanted to cut my hair, as it was quite long. My father seemed to have dominion over my hair. Each time I asked the response seemed to be &quot;your father would be upset&quot; or &quot;I like my little girls to keep their hair long&quot;. At 10 or 11 I was &quot;old enough&quot; to get my hair cut to my shoulders and get a permanent. As soon as I made my separation from my father I chopped off my hair. I felt free from control. To this day, I often will shave my head and grow it a bit and do the process over when I desire.<br/>\n<br/>\nOur 4 year old daughter also cuts her own hair. I am 100% fine with her exploration of her hair. It has taken time for my husband to let go, as I see a similar pattern of him holding on to hair. <br/>\n<br/>\nOur 8 year old son likes to grow out his hair. He hasn&#39;t groomed it on his own, but like the previous poster I tend to monkey groom him while he plays. My husband encourages my son to cut his hair. I know he will cut it if my husband is persistent as in previous years (he tends to encourage this around his birthday). I talked to my husband about it when it was recently mentioned. I feel softening and understanding happening  I can only continue to talk to him. <br/>\n<br/>\nI would like to encourage my husband to support getting him a grooming kit all his own for his birthday (which is next month). <br/>\n<br/>\nAny other suggestions? <br/>\nThanks<br/>\nPhoebe<br/>\n<br/>\nPs Is this a balding mans process with their own children?</div>","specialLinks":[]},{"userId":343381924,"authorName":"Lucy&#39;s web","from":"Lucy&#39;s web &lt;lucy.web@...&gt;","profile":"lucylists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I want to break out of this pattern.","postDate":"1360005656","msgId":70458,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBQ0MxMDg0LUY5RDYtNEI1My1CNzdGLUJGOEZDRjU1MTlBQ0BtYWMuY29tPg==","inReplyToHeader":"PGtlcDA0Nitwa3YzQGVHcm91cHMuY29tPg==","referencesHeader":"PGtlcDA0Nitwa3YzQGVHcm91cHMuY29tPg=="},"prevInTopic":70457,"nextInTopic":70459,"prevInTime":70457,"nextInTime":70459,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"... Meredith, this sounds fantastic.   Are there any links or pics you could point me to, that I could show to my girls and see if they fancy giving it a try? ","messageBody":"<div id=\"ygrps-yiv-565139416\">On 4 Feb 2013, at 19:53, Meredith &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; In addition to a sensitive scalp, my daughter doesn&#39;t like to be touched very much at all. In the past I would braid her hair in lots of little plaits with ribbons in them - I&#39;d get a new video game and do it while she played. It looked eccentric but deliberate - and given a little homeschooling girl who pulled away from strangers and never made eye-contact,I wanted her hair to look deliberate, not like she was neglected and abused. It had the advantage of looking good for months at a time, and polyester ribbons wash just fine in the hair. <br/>\n<br/>\n<br/>\n </span></blockquote>Meredith, this sounds fantastic.   Are there any links or pics you could point me to, that I could show to my girls and see if they fancy giving it a try?   <br/>\n<br/>\nMy girls both have long, easily tangled hair.  Neither of them wants to have hair cuts, but they don&#39;t like having it brushed that much either.  We have tried many different kinds of brushes and combs but it is still a chore that we all put off.<br/>\n<br/>\nUnfortunately we live &#39;under the radar&#39; here in France, and it would only take one report to the authorities for unschooling to be made very complicated for us.   I&#39;m keen to protect us from that for as long as I possibly can, and I do worry that outsiders might look at my daughters&#39; tangled hair and see it as a sign of neglect.  Your plaits sound like an excellent way of addressing that.<br/>\n<br/>\nLucy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1360004038","msgId":70457,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlcDA0Nitwa3YzQGVHcm91cHMuY29tPg=="},"prevInTopic":70456,"nextInTopic":70458,"prevInTime":70456,"nextInTime":70458,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"... In addition to a sensitive scalp, my daughter doesn t like to be touched very much at all. In the past I would braid her hair in lots of little plaits with","messageBody":"<div id=\"ygrps-yiv-1176230918\">Virginia Warren  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; Another thing that works for us is when I get in touch with my inner<br/>\n&gt; primate and groom their hair by hand (my 6 yo daughter grooms her hair<br/>\n&gt; plenty, but still loves this). You can gently tease out even<br/>\n&gt; borderline-dreadlock tangles with your fingers.<br/>\n<br/>\n </span></blockquote>In addition to a sensitive scalp, my daughter doesn&#39;t like to be touched very much at all. In the past I would braid her hair in lots of little plaits with ribbons in them - I&#39;d get a new video game and do it while she played. It looked eccentric but deliberate - and given a little homeschooling girl who pulled away from strangers and never made eye-contact,I wanted her hair to look deliberate, not like she was neglected and abused. It had the advantage of looking good for months at a time, and polyester ribbons wash just fine in the hair. <br/>\n<br/>\nEventually she didn&#39;t want me to touch her hair at all, and it has gotten pretty wild. It bugged me a lot for awhile. But recently she started writing fan fiction and now and then she works herself into the stories as a character. The Morgan character always has spectacularly wild hair, and other characters are amazed and a little envious. Now, how can I make a fuss over her hair? It&#39;s obviously something she likes and wants to keep. (And she&#39;s now a more assertive homeschooling girl - she might be strange, but I don&#39;t think people look at her and wonder if her parents keep her in a closet.)<br/>\n<br/>\n---Meredith<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; -=-<br/>\n&gt; &gt;<br/>\n&gt; &gt; Brushing her hair hurt. So we found a hairbrush that doesn&#39;t pull.<br/>\n&gt; &gt;<br/>\n&gt; -=-<br/>\n&gt; <br/>\n&gt; My daughter (8) is also reluctant to groom her hair or have it groomed. We<br/>\n&gt; discovered plastic combs can have quite sharp teeth. The teeth of real hard<br/>\n&gt; rubber combs are polished before sale and very comfortable. They can be<br/>\n&gt; found at discount beauty supply stores. They cost more than plastic combs,<br/>\n&gt; but they also reputedly last for 30 years or more, and some manufacturers<br/>\n&gt; offer unconditional lifetime warranties.<br/>\n&gt; <br/>\n&gt; Another thing that works for us is when I get in touch with my inner<br/>\n&gt; primate and groom their hair by hand (my 6 yo daughter grooms her hair<br/>\n&gt; plenty, but still loves this). You can gently tease out even<br/>\n&gt; borderline-dreadlock tangles with your fingers. Whenever someone climbs in<br/>\n&gt; my lap, or sits next to me on the couch, or lays down with me in bed, I can<br/>\n&gt; monkey-groom their hair. When I do a good job, it&#39;s very pleasant for<br/>\n&gt; everyone. It is impossible to rush.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":547671143,"authorName":"supermomblues","from":"&quot;supermomblues&quot; &lt;supermom2jakeandemmy@...&gt;","profile":"supermomblues","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1359944591","msgId":70456,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlbjYyZitibWx0QGVHcm91cHMuY29tPg=="},"prevInTopic":70455,"nextInTopic":70457,"prevInTime":70455,"nextInTime":70457,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"**Whenever someone climbs in my lap, or sits next to me on the couch, or lays down with me in bed, I can monkey-groom their hair. When I do a good job, it s","messageBody":"<div id=\"ygrps-yiv-433934773\">**Whenever someone climbs in my lap, or sits next to me on the couch, or lays down with me in bed, I can monkey-groom their hair. When I do a good job, it&#39;s very pleasant for everyone.**<br/>\n<br/>\nThis is such a great idea!! The hairbrush we found is a natural boar bristle brush - it doesn&#39;t snag at all for her. I love the rubber combs - we have a couple that we use all the time.</div>","specialLinks":[]},{"userId":254796796,"authorName":"Virginia Warren","from":"Virginia Warren &lt;vafnord@...&gt;","profile":"vafnord23","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1359937779","msgId":70455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBS1g5OGZqOUM1LWhWQ2Zja2R6SG1HQldIemNUT3JrMmhTNlpYdGVnOVlqX3F3RVNId0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGtlbTllcys2NWVxQGVHcm91cHMuY29tPg==","referencesHeader":"PDYwMzk0RkU1LUJGQzAtNDM0MC1BOTlELUE3NjY2MkY1OTZDN0BTYW5kcmFkb2RkLmNvbT4JPGtlbTllcys2NWVxQGVHcm91cHMuY29tPg=="},"prevInTopic":70454,"nextInTopic":70456,"prevInTime":70454,"nextInTime":70456,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"-=- ... -=- My daughter (8) is also reluctant to groom her hair or have it groomed. We discovered plastic combs can have quite sharp teeth. The teeth of real","messageBody":"<div id=\"ygrps-yiv-1636649336\">-=-<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Brushing her hair hurt. So we found a hairbrush that doesn&#39;t pull.<br/>\n&gt;<br/>\n </span></blockquote>-=-<br/>\n<br/>\nMy daughter (8) is also reluctant to groom her hair or have it groomed. We<br/>\ndiscovered plastic combs can have quite sharp teeth. The teeth of real hard<br/>\nrubber combs are polished before sale and very comfortable. They can be<br/>\nfound at discount beauty supply stores. They cost more than plastic combs,<br/>\nbut they also reputedly last for 30 years or more, and some manufacturers<br/>\noffer unconditional lifetime warranties.<br/>\n<br/>\nAnother thing that works for us is when I get in touch with my inner<br/>\nprimate and groom their hair by hand (my 6 yo daughter grooms her hair<br/>\nplenty, but still loves this). You can gently tease out even<br/>\nborderline-dreadlock tangles with your fingers. Whenever someone climbs in<br/>\nmy lap, or sits next to me on the couch, or lays down with me in bed, I can<br/>\nmonkey-groom their hair. When I do a good job, it&#39;s very pleasant for<br/>\neveryone. It is impossible to rush.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":547671143,"authorName":"supermomblues","from":"&quot;supermomblues&quot; &lt;supermom2jakeandemmy@...&gt;","profile":"supermomblues","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1359915292","msgId":70454,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlbTllcys2NWVxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDYwMzk0RkU1LUJGQzAtNDM0MC1BOTlELUE3NjY2MkY1OTZDN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":70445,"nextInTopic":70455,"prevInTime":70453,"nextInTime":70455,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"As for the with holding: My nine year old daughter has had issues with constipation and encopresis since she was being potty trained. She also has frequent","messageBody":"<div id=\"ygrps-yiv-1273827150\">As for the with holding: My nine year old daughter has had issues with constipation and encopresis since she was being potty trained. She also has frequent accidents (both urine and BM). When these happen I help her clean up and move on. We are also seeing a play therapist that helps with the emotional scars from public school (she was in school until this January when I began the deschooling process - but that&#39;s for another post). She also drinks water throughout the day (she has her own special cup that lights up), and has the freedom to go whenever she needs to. These things have all helped with that issue. I never bully, berade, coerce, or try to force her to go. That just enhances the problem. Let go, and soon your child will too.<br/>\n<br/>\nAs for the hygene: She refuses to brush her hair (it hurts because it pulls). She rarely brushes her teeth, and she voluntarily bathes maybe once a week. I fought, begged, pleaded, and DEMANDED that she did all these things, and was rewarded with arguments, tears, and temper fits. <br/>\n<br/>\nThen something dawned on me: there must be a REASON why she doesn&#39;t want to do these things. And lo and behold, there WAS.<br/>\n<br/>\nBrushing her teeth was boring. So we made it more exciting by getting her a Hello Kitty toothbrush, her own design-your-own toothpaste, and letting her take her CD player into the bathroom with her while she brushes (all at her suggestion.)<br/>\n<br/>\nBrushing her hair hurt. So we found a hairbrush that doesn&#39;t pull.<br/>\n<br/>\nTaking a bath took too much time. So she started taking showers instead.<br/>\n<br/>\nWhile she does not do these things on a regular basis, she is starting to choose to do them more.<br/>\n<br/>\nI hope this helps and gives you some hope!</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1359771457","msgId":70445,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2M0E3QTA1LTBDM0ItNDA1OS04RDNCLTNFNEE2QjU2NTQ1NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtlaHBpNythbDg3QGVHcm91cHMuY29tPg==","referencesHeader":"PGtlaHBpNythbDg3QGVHcm91cHMuY29tPg=="},"prevInTopic":70444,"nextInTopic":70454,"prevInTime":70444,"nextInTime":70446,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"-=- Also, she has to be home to go. She can t do it in a store or someone else s house. -=- I have a friend in his late 30 s who can only go at his own house.","messageBody":"<div id=\"ygrps-yiv-353681646\">-=- Also, she has to be home to go. She can&#39;t do it in a store or someone else&#39;s house. -=-<br/>\n<br/>\nI have a friend in his late 30&#39;s who can only go at his own house.  VERY occasionally he will go somewhere else, but there has to be lot of noise==loud music or a movie in the other part of the house, and he wants a fan, and running water and all the noise easily available.  I know this because he&#39;s gone at my house twice, and both times it was a big deal.  Otherwise he would have had to drive home to go.  <br/>\n<br/>\nLots of people will go a day or two without &quot;going&quot; if they&#39;re camping or travelling, but on day 3 they&#39;re more comfortable (and more full).  There&#39;s probably something normal, natural and biological about not going if it doesn&#39;t seem safe, so parental pressure probably never makes it feel safer.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":528259386,"authorName":"trish52101","from":"&quot;trish52101&quot; &lt;simplycrunchy@...&gt;","profile":"trish52101","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: I want to break out of this pattern.","postDate":"1359767943","msgId":70443,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlaHBpNythbDg3QGVHcm91cHMuY29tPg=="},"prevInTopic":70442,"nextInTopic":70444,"prevInTime":70442,"nextInTime":70444,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"My daughter has always had a hard time going- we actually ended up at the hospital getting a CT scan due to her bellyache- she was just super backed up. A few","messageBody":"<div id=\"ygrps-yiv-1467196130\">My daughter has always had a hard time going- we actually ended up at the hospital getting a CT scan due to her bellyache- she was just super backed up. A few things that I have learned about her- she needs a LONG time on the toilet and something to get her mind off what she&#39;s doing.  I think for her, sometimes, she feels pressured to go- much like I feel at the doctor if I have to pee in a cup. When she was little enough, we&#39;d put her potty seat in front of the tv and let her watch a movie. That was the only way she could go. Now she either takes one of our phones or the tablet and watches Netflix or plays games. If I try to rush her, she&#39;ll say, &quot;Mom, I really think I might need to poop.&quot; Sure enough, a half hour later, she&#39;ll go. For her, it has to be first thing in the morning. She hates stopping what she is doing during the day. She usually wakes up slowly, playing on the tablet while she&#39;s still in bed. Then after a while, I&#39;ll suggestion going taking the tablet to the bathroom with her. When we first started relaxing about her going, I&#39;d suggest she just sit for a bit and see what happens- making sure she knew it was her choice when to get up. She&#39;d end up getting lost in the movie/game and sit long enough to go. Also, she has to be home to go. She can&#39;t do it in a store or someone else&#39;s house. If we have a few days in a row where we are out and about, she will get very constipated. It can&#39;t always be helped, but I know she will need a ton of apple juice for a few days and possibly a new game on the tablet. <br/>\n<br/>\n-Trisha</div>","specialLinks":[]},{"userId":254796796,"authorName":"Virginia Warren","from":"Virginia Warren &lt;vafnord@...&gt;","profile":"vafnord23","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1359761798","msgId":70444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBS1g5OGZpcFFwOUZBRmg9Y2diVk4tWHZEamZiR0d3OUhGclI1T2FrcXJ1SG0wcmFWZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEFDM0I5OTk5LTI1MUYtNDg4MS05NkMwLUM3QkY2M0IzQkRBQkB2ZXJpem9uLm5ldD4=","referencesHeader":"PEFDM0I5OTk5LTI1MUYtNDg4MS05NkMwLUM3QkY2M0IzQkRBQkB2ZXJpem9uLm5ldD4="},"prevInTopic":70443,"nextInTopic":70445,"prevInTime":70443,"nextInTime":70445,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"My daughter just turned 8. She still needs me to wipe her every time, still has many urine accidents at home right in front of the toilet, and still ","messageBody":"<div id=\"ygrps-yiv-49293935\">My daughter just turned 8. She still needs me to wipe her every time, still<br/>\nhas many urine accidents at home right in front of the toilet, and still<br/>\noccasionally wets the bed (heavy sleeper).<br/>\n<br/>\nNothing I&#39;ve done or said, other than clean up and help her be comfortable,<br/>\nhas had any good effect. I have some hurts to heal.<br/>\n<br/>\n*****<br/>\nNow if I say anything about it at all,<br/>\n<blockquote><span title=\"ireply\"> &gt; it&#39;s that I&#39;ll change his diapers for ever, which feels better.<br/>\n </span></blockquote>*****<br/>\n<br/>\nI love this.<br/>\n<br/>\nVirginia<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: I want to break out of this pattern.","postDate":"1359759793","msgId":70442,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMzY1RkRBLTQwMzMtNERCMi04RkQ3LTYyNkM1RDlDNzg0MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFDM0I5OTk5LTI1MUYtNDg4MS05NkMwLUM3QkY2M0IzQkRBQkB2ZXJpem9uLm5ldD4=","referencesHeader":"PEFDM0I5OTk5LTI1MUYtNDg4MS05NkMwLUM3QkY2M0IzQkRBQkB2ZXJpem9uLm5ldD4="},"prevInTopic":70441,"nextInTopic":70443,"prevInTime":70441,"nextInTime":70443,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"-=-My husband worries that it really will be forever. Any thoughts to comfort him?-=- Remind him that his son is alive. Point out that he can walk, and (I m","messageBody":"<div id=\"ygrps-yiv-1918534878\">-=-My <br/>\nhusband worries that it really will be forever. Any thoughts to <br/>\ncomfort him?-=-<br/>\n<br/>\nRemind him that his son is alive.<br/>\nPoint out that he can walk, and (I&#39;m assuming) talk. <br/>\nMaybe he can run.  Maybe he can sing.<br/>\n<br/>\nMillions of people have children of whom the things above cannot be said.<br/>\n<br/>\nIf your husband can&#39;t imagine ways in which he could ruin his relationship with his son forever, or maybe create enough ill will and ire that there could be violence, naybe he could just watch some local news (but I don&#39;t recommend it; it&#39;s too often the child-abuse and murder show, at least in New Mexico).<br/>\n<br/>\nSeeing a child where he is, and as he is, leads to love.<br/>\nSeeing a child in comparison to an ideal, imaginary child can lead to heartbreak all the way around.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220655190,"authorName":"Janette","from":"Janette &lt;yamaguchi3@...&gt;","profile":"iguanagirl66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1359755567","msgId":70441,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFDM0I5OTk5LTI1MUYtNDg4MS05NkMwLUM3QkY2M0IzQkRBQkB2ZXJpem9uLm5ldD4="},"prevInTopic":70425,"nextInTopic":70442,"prevInTime":70440,"nextInTime":70442,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"My son is 8 and has a difficult time with bowel movements as well, and asks to have a diaper put on him when he needs to go.  I used to ask him once in a while","messageBody":"<div id=\"ygrps-yiv-413395375\">My son is 8 and has a difficult time with bowel movements as well, and  <br/>\nasks to have a diaper put on him when he needs to go.  I used to ask  <br/>\nhim once in a while if he&#39;d like to try it on the potty, but he  <br/>\ndoesn&#39;t want to.  Once I bought a smaller sized package of diapers,  <br/>\nhoping he&#39;d think the toilet was better that tight diapers; not a  <br/>\npartner building choice on my part, and one that made the chore more  <br/>\ndifficult for me, as it was harder to cinch up the smaller size.  I  <br/>\nrealized that my feeling as though he was wrong and in need of fixing  <br/>\nwas adding to his discomfort.  Now if I say anything about it at all,  <br/>\nit&#39;s that I&#39;ll change his diapers for ever, which feels better.  My  <br/>\nhusband worries that it really will be forever.  Any thoughts to  <br/>\ncomfort him?<br/>\n<br/>\nJanette<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] I want to break out of this pattern.","postDate":"1359664863","msgId":70425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwMzk0RkU1LUJGQzAtNDM0MC1BOTlELUE3NjY2MkY1OTZDN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtlZTA4aCs2MnR1QGVHcm91cHMuY29tPg==","referencesHeader":"PGtlZTA4aCs2MnR1QGVHcm91cHMuY29tPg=="},"prevInTopic":70420,"nextInTopic":70441,"prevInTime":70424,"nextInTime":70426,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"-=-I want to break out of this pattern. I want to help guide and not control. -=- My oldest had some problems when he was young, too.  He s fine now. If it","messageBody":"<div id=\"ygrps-yiv-944522356\">-=-I want to break out of this pattern. I want to help guide and not control. -=-<br/>\n<br/>\nMy oldest had some problems when he was young, too.  He&#39;s fine now.<br/>\n<br/>\nIf it were me, I would add plums and prunes to things, see if he would take TriPhala tablets, encourage everyone in the family to drink more water, and not keep a chart, not measure, not say &quot;time to practice.&quot;  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":526125213,"authorName":"Michelle","from":"&quot;Michelle&quot; &lt;shellthed@...&gt;","profile":"pamperedthed","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: I want to break out of this pattern.","postDate":"1359650085","msgId":70420,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlZTZmNSs0cmdsQGVHcm91cHMuY29tPg=="},"prevInTopic":70419,"nextInTopic":70425,"prevInTime":70419,"nextInTime":70421,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"Phoebe, My now 13yo son used to have a lot of trouble - in my opinion, not his! - having a bowel movement regularly. For a while we made a big deal out of it,","messageBody":"<div id=\"ygrps-yiv-1490986552\">Phoebe,<br/>\n<br/>\nMy now 13yo son used to have a lot of trouble - in my opinion, not his! - having a bowel movement regularly. For a while we made a big deal out of it, as you describe you are doing. The result was that he held it for a much longer time. When we realized that, we shut up about the whole thing completely. Although he still goes less frequently than anyone else in the house, he goes just fine and never has any problems. It has become a non-issue.<br/>\n<br/>\nEven before we started down the path of Radical Unschooling, I was realizing that you cannot control if someone eats, sleeps, or uses the toilet. Trying will stress yourself out needlessly and damage your relationship with that person.<br/>\n<br/>\nMichelle<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;phoebience&quot;  wrote:<br/>\n<br/>\n&gt; My 8 year old bathes sporadically, brushes teeth maybe every other day, and has what I would call a difficult time with bowel movements. He has had such a difficult time having a BM since he was a baby, 6 months old. It started as what the medical Doctors called &quot;breastmilk colitis&quot; with bloody stools, and lead into a withholding pattern. We have tried so many different things: Diet changes, charts/calendars, potty practice, suppositories,  &quot;poop&quot; books, magnesium, incentives. We have talked about what goes in must come out and what happens when it doesn&#39;t, drawn diagrams,. I thought it was because we sat too long on the computer so we had limited that, thought it was food, controlled that. Let go of both of those things as the &quot;problem&quot; and moved passed that. He goes when he wants to and in the mean time I worry. We have been encouraging a potty practice every evening until things have straightend out. This causes unnecessary power struggles and I hate it as much as he does. I fear if I don&#39;t say anything he won&#39;t listen to his body cues and hold it in until he gets severely constipated to the point of causing a fissure that sets him up again for withholding.He has withheld for up to 3 weeks. I have a calendar that I use to keep track of when I take my vitamins (as I tend to forget if I have taken them during the day) I have also used the same calendar to keep track of his BM&#39;s, more for me than him as it stresses me...and I know my stress probably stresses him and causes withholding too. If I don&#39;t say anything he may not make the choice to go until he is writhing in pain. Is that what needs to happen for change to happen for him. Do I just let go and be there for him in this capacity until he finds his way? It is heartbreaking and really painful for him. <br/>\n&gt; <br/>\n&gt; I want to break out of this pattern. I want to help guide and not control. <br/>\n&gt; <br/>\n&gt; Thank you!<br/>\n&gt; Phoebe<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":488106178,"authorName":"phoebience","from":"&quot;phoebience&quot; &lt;phoebience@...&gt;","profile":"phoebience","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"I want to break out of this pattern.","postDate":"1359643729","msgId":70419,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtlZTA4aCs2MnR1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":70420,"prevInTime":70418,"nextInTime":70420,"topicId":70419,"numMessagesInTopic":0,"msgSnippet":"We are a pretty laid back family. My partner works from home. I nanny 3 days a week outside of the home and our 2 children have a choice most of the time to","messageBody":"<div id=\"ygrps-yiv-1900370355\">We are a pretty laid back family. My partner works from home. I nanny 3 days a week outside of the home and our 2 children have a choice most of the time to stay home or come. We have let go of the many ideas that were set forth by our parents and struggle with others. Our days are guided by our individual desires and I try to keep new things flowing so we can explore new passions that come our way.<br/>\n<br/>\nWe have done what we call &quot;night time rituals&quot;, brushing teeth, bathing, and pottying, since infancy. I don&#39;t believe it ever worked for anyone other than me because it is something that I learned as a child I had to do. I changed the name and tried to make it fun...but it was always resisted. I see this as control and I want to change that and facilitate learning to take care of our own bodies. How do I do that?<br/>\n<br/>\nMy 4 year old loves bathing, potties when she needs to, does not care to brush her teeth.We have been to the dentist and had terrible experiences which I understand may be deterring her from wanting to brush. I encourage brushing when I go into brush in the morning and most evenings. I have let go of this. Her teeth aren&#39;t causing her pain, she is happy, and when the time comes when she is better equipped to sit in a dental chair she may be ready to take care of her teeth better. She does brush just not as frequently as I do. We&#39;ve let go.<br/>\n<br/>\nMy 8 year old bathes sporadically, brushes teeth maybe every other day, and has what I would call a difficult time with bowel movements. He has had such a difficult time having a BM since he was a baby, 6 months old. It started as what the medical Doctors called &quot;breastmilk colitis&quot; with bloody stools, and lead into a withholding pattern. We have tried so many different things: Diet changes, charts/calendars, potty practice, suppositories,  &quot;poop&quot; books, magnesium, incentives. We have talked about what goes in must come out and what happens when it doesn&#39;t, drawn diagrams,. I thought it was because we sat too long on the computer so we had limited that, thought it was food, controlled that. Let go of both of those things as the &quot;problem&quot; and moved passed that. He goes when he wants to and in the mean time I worry. We have been encouraging a potty practice every evening until things have straightend out. This causes unnecessary power struggles and I hate it as much as he does. I fear if I don&#39;t say anything he won&#39;t listen to his body cues and hold it in until he gets severely constipated to the point of causing a fissure that sets him up again for withholding.He has withheld for up to 3 weeks. I have a calendar that I use to keep track of when I take my vitamins (as I tend to forget if I have taken them during the day) I have also used the same calendar to keep track of his BM&#39;s, more for me than him as it stresses me...and I know my stress probably stresses him and causes withholding too. If I don&#39;t say anything he may not make the choice to go until he is writhing in pain. Is that what needs to happen for change to happen for him. Do I just let go and be there for him in this capacity until he finds his way? It is heartbreaking and really painful for him. <br/>\n<br/>\nI want to break out of this pattern. I want to help guide and not control. <br/>\n<br/>\nThank you!<br/>\nPhoebe</div>","specialLinks":[]}],"prevTopicId":70570,"nextTopicId":70573}}