{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"8h_xGfe19lzEQdq2COSW7indQaVYDXLeGfjoO39kpmR9ovSZCUAJa-RnrKRZFyYvewJzHsDg3iLAj9U6KaOle0odPxRqng","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japan news: Kicking the education football","postDate":"971407174","msgId":13649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMDEzMDMxOS5NQUEwMTc1N0BzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13648,"nextInTime":13650,"topicId":13649,"numMessagesInTopic":0,"msgSnippet":"Greetings all, A news story has been published today on education reform in Japan and how such reform is being handled by the Japanese government. Prime","messageBody":"<div id=\"ygrps-yiv-116209584\">Greetings all,<br/>\n<br/>\nA news story has been published today on &quot;education reform&quot; in Japan and <br/>\nhow such reform is being handled by the Japanese government.<br/>\n<br/>\nPrime Minister Mori is not entirely clear on how he wants to &quot;revise&quot; the <br/>\ncurrent Constitution-based &quot;Fundamental Law of Education&quot; in Japan, but <br/>\nit would appear that he is aiming for much tighter reform of state <br/>\neducation, not looser.<br/>\n<br/>\nAccording to an earlier news account, Mori intends to include &quot;patriotic <br/>\nsentiment and respect for Japanese culture and tradition&quot; in the revised <br/>\nlaw he is pushing for (Daily Yomiuri, 5 Oct. 2000).<br/>\n<br/>\nAs the article below shows, Prime Minister Mori may actually be turning <br/>\nback the educational clock more than a century in Japan when it comes to <br/>\nhis so-called &quot;reform package.&quot; Mori apparently wants to revise the <br/>\ncurrent Constitution-based &quot;Fundamental Law of Education&quot; (adopted in <br/>\npostwar 1947) to be more reflective of the former Shinto religion-based <br/>\n&quot;Imperial Rescript on Education&quot; (issued in 1890 -- yes, that&#39;s *1890*, <br/>\nfolks).<br/>\n<br/>\nThe latter, issued by the then-reigning emperor of Japan, calls on the <br/>\nnation as loyal, educated &quot;subjects&quot; to &quot;guard and maintain the <br/>\nprosperity of Our Imperial Throne coeval with heaven and earth&quot; <br/>\n(quote-unquote).<br/>\n<br/>\nWhich all goes to show that the Japanese government can kick around an <br/>\neducation football just as well as any other government in the world can.<br/>\n<br/>\nRegards,<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nOsaka, Japan<br/>\n<br/>\n------------------------<br/>\n<br/>\nThe Daily Yomiuri - 13 October 2000<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.yomiuri.co.jp/newse/1013po14.htm\">http://www.yomiuri.co.jp/newse/1013po14.htm</a><br/>\n<br/>\n<br/>\nMORI REQUESTS EDUCATION LAW REVISION REPORT BY NEXT SPRING<br/>\n<br/>\nYomiuri Shimbun<br/>\n<br/>\n<br/>\nPrime Minister Yoshiro Mori on Wednesday asked Hirofumi Shimomura, the <br/>\nvice chairman of a Liberal Democratic Party committee on education, to <br/>\ncompile a report detailing LDP opinions on the revision of the <br/>\nFundamental Law of Education by next spring.<br/>\n<br/>\nWhile Mori expressed a strong desire to revise the law in the hope that <br/>\nthe LDP will be able to use the revision as a focal point in the House of <br/>\nCouncillors election campaign next summer, LDP ruling coalition ally New <br/>\nKomeito is strongly opposed to a hasty revision of the law.<br/>\n<br/>\nShimomura told Mori that the discussion on the law&#39;s revision -- which <br/>\nwas being conducted by an LDP research group on education reform and <br/>\nchaired by former Education Minister Kosuke Hori -- had been delayed.<br/>\n<br/>\nShimomura then told Mori that the LDP should take the revision of the law <br/>\nseriously, partly to promote Mori as an education reform advocate.<br/>\n<br/>\nMori asked Shimomura to draw up a report on the law&#39;s revision by next <br/>\nspring so that the party could use it in the upper house election <br/>\ncampaign next summer.<br/>\n<br/>\nMori&#39;s willingness to revise the law comes after some LDP members voiced <br/>\nstrong support for the revision.<br/>\n<br/>\n&quot;We need to consider revising the law as various education problems have <br/>\nemerged under the current Fundamental Law of Education,&quot; said an LDP <br/>\nmember who has long been involved in education matters.<br/>\n<br/>\nEarlier this month, an LDP faction led by Takami Eto and LDP Policy <br/>\nResearch Council Chairman Shizuka Kamei, with which Mori has aligned <br/>\nhimself in an attempt to strengthen his base within the party, agreed at <br/>\na meeting to work to revise the law.<br/>\n<br/>\nKamei told Mori that an outline of the revision should be compiled before <br/>\nthe upper house election, and urged him to advance the government&#39;s <br/>\nschedule to work on the revision.<br/>\n<br/>\nThe government intends to revise the law after the next ordinary Diet <br/>\nsession, according to Chief Cabinet Secretary Hidenao Nakagawa.<br/>\n<br/>\nKamei met Mori on Wednesday and said: &quot;Education reform is the raison <br/>\nd&#39;etre of the Mori Cabinet. We should use a proposal on the revision of <br/>\nthe Fundamental Law of Education as a focal point in the upper house <br/>\nelection campaign.&quot;<br/>\n<br/>\nNew Komeito leader Takenori Kanzaki said at a press conference the same <br/>\nday that he had no reason to give his opinions on what other political <br/>\nparties would do individually.<br/>\n<br/>\nKanzaki then said, &quot;However, as a coalition ally, we will express our <br/>\nopinion in the discussions.&quot;<br/>\n<br/>\nKanzaki said in an article in the party&#39;s gazette dated Sunday, &quot;It is <br/>\noverly simplistic and anachronistic to blame the Fundamental Education <br/>\nLaw for (current child-related) problems, and to call for a reevaluation <br/>\nof the defunct Imperial Rescript on Education.&quot;<br/>\n<br/>\n<br/>\nCopyright 2000 The Yomiuri Shimbun</div>","specialLinks":[]}],"prevTopicId":13648,"nextTopicId":13653}}