{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":167822625,"authorName":"Sunday Cote","from":"&quot;Sunday Cote&quot; &lt;sundaycote@...&gt;","profile":"revsunday2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"RE: [AlwaysLearning] Video game music","postDate":"1192286782","msgId":31036,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM4MGRhNyRkMmIxYjQyMCQ2ODAxYThjMEBEMTZWNDk0MT4=","inReplyToHeader":"PDg1ODM4RDQyLThGMDgtNDBDMC1CQjY1LUZCMDZBNjZBQzlGM0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":31035,"nextInTopic":0,"prevInTime":31035,"nextInTime":31037,"topicId":31031,"numMessagesInTopic":0,"msgSnippet":"I really appreciated this thread.  It s gotten me thinking about all the ways videos games have enriched our lives and created opportunities for enjoyment and","messageBody":"<div id=\"ygrps-yiv-1049312141\">I really appreciated this thread.  It&#39;s gotten me thinking about all the<br/>\nways videos games have enriched our lives and created opportunities for<br/>\nenjoyment and growth along the way.  The music has been a very big<br/>\ninfluence on us and I can see how it will continue to lead us down paths<br/>\nof interest and passion.  <br/>\n<br/>\nThe first game we got when we bought our GameCube was PacMan 2.  The<br/>\nbackground music played a lot during those days and now every time I<br/>\nhear it I think back to that time when we were just beginning our<br/>\nunschooling journey and the excitement and newness of it all.  Now, many<br/>\nof the background songs for our favorite games take me back to the time<br/>\nwe first played a particular game and what was going on in our lives at<br/>\nthe time.  <br/>\n<br/>\nNow my 9 year old, Connor, has expanded his interest in music and has<br/>\nstarted learning to play the piano by ear.  Every morning he plays a bit<br/>\nand the music that he has chosen are all songs from his favorite video<br/>\ngames.  This thread helped me realized that there is even more expansion<br/>\nwith this passion by exploring the composers of the songs (duh!) and<br/>\nsharing that with Connor as well.  <br/>\n<br/>\nConnor also has a great ear for discerning different instruments.  He<br/>\npointed out that the PS special edition of Harvest Moon used a banjo in<br/>\nthe theme song instead of the guitar features in the GameCube version.<br/>\n(I may have the instruments mixed up, because I don&#39;t have the ear for<br/>\nmusic that he does &lt;g&gt;.)  In any case, we can also add &quot;Music<br/>\nAppreciation&quot; to the long list of benefits we experience from our games.<br/>\n<br/>\nConnor has some great role models, as his dad is a passionate musician<br/>\nand my step-son (Connor&#39;s older half-brother) is a composer and writes<br/>\nmusic/sound effects for computer and video games, and movies, etc.<br/>\nRecently he had a song used on the TV show, &quot;My Name is Earl.&quot;  We have<br/>\none of his computer games, (Professor Wizmo&#39;s Workshop) and it&#39;s so much<br/>\nfun to be aware when we are playing it and think, &quot;Wow, Rob created all<br/>\nthose sounds that affect our mood and cue us into what&#39;s going to happen<br/>\nnext.&quot;  We have had some great conversations about what he uses for<br/>\ninspiration for some of the sounds.  He&#39;s always on the look out for<br/>\ncool new sounds that he can add to his library.  Now that Connor has<br/>\nrecently started producing videos for YouTube, we are about at the point<br/>\nto start introducing musical effect into them, so that will be an<br/>\nexciting venture.  <br/>\n<br/>\nAnyway, just wanted to add my own little A-has about how learning is<br/>\nhappening in our lives and how huge influences can come in (seemingly)<br/>\nvery subtle ways by just following our passions and enjoying life.<br/>\n<br/>\nRock on!<br/>\nSunday<br/>\nMom to Connor (9) and Treyson (5)</div>","specialLinks":[]},{"userId":77070457,"authorName":"Sanguinegirl83@aol.com","from":"Sanguinegirl83@...","profile":"sanguinegirl83","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Video game music","postDate":"1192248780","msgId":31035,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNjNy4xZWUwZGVmYS4zNDQxOWZjY0Bhb2wuY29tPg=="},"prevInTopic":31034,"nextInTopic":31036,"prevInTime":31034,"nextInTime":31036,"topicId":31031,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/12/2007 7:19:30 PM Eastern Daylight Time, Sandra@SandraDodd.com writes: His versatility as a composer has also been demonstrated from","messageBody":"<div id=\"ygrps-yiv-1214530728\">In a message dated 10/12/2007 7:19:30 PM Eastern Daylight Time,  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a> writes:<br/>\n<br/>\nHis  <br/>\nversatility as a composer has also been demonstrated from  his  <br/>\ncritically acclaimed traditional Asian score for Guild Wars  Factions  <br/>\nto his work with children’s properties such as Rugrats  <br/>\n<br/>\n<br/>\nThanks for the new connection! I had thought all the Rugrats cartoons&#39;  music <br/>\nwas done by Mark Mothersbaugh or the Mothersbaugh brothers (Devo, Ohio  <br/>\nnatives), so I had to Google and search. Turns out that not only has Soule  created <br/>\nthe score for Rugrats games (how could I forget there were Rugrats video  <br/>\ngames??), but he&#39;s also done at least one episode of the cartoon. Cool.<br/>\n <br/>\nWhip It Good,<br/>\nSang<br/>\n<br/>\n<br/>\n<br/>\n************************************** See what&#39;s new at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com\">http://www.aol.com</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":117369878,"authorName":"Kelli Traaseth","from":"Kelli Traaseth &lt;kellitraas@...&gt;","profile":"kellitraas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Video game music","postDate":"1192235964","msgId":31034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU5NzQyMC4zMDU1LnFtQHdlYjUxMTA0Lm1haWwucmUyLnlhaG9vLmNvbT4=","inReplyToHeader":"PDg1ODM4RDQyLThGMDgtNDBDMC1CQjY1LUZCMDZBNjZBQzlGM0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":31031,"nextInTopic":31035,"prevInTime":31033,"nextInTime":31035,"topicId":31031,"numMessagesInTopic":0,"msgSnippet":"***When Holly and I were at the Traaseth s last week, Kelli had some piano music for something from Final Fantasy or Halo... (Kelli, fill in, please and could","messageBody":"<div id=\"ygrps-yiv-1288726668\">***When Holly and I were at the Traaseth&#39;s last week, Kelli had some  <br/>\npiano music for something from Final Fantasy or Halo... (Kelli, fill  <br/>\nin, please and could you post that YouTube link with the mood  <br/>\nlighting? )****<br/>\n<br/>\nIt&#39;s from Final Fantasy XI,  To Zanarkand is the song,  composed by Nobuo Uematsu.  It is beautiful.<br/>\n<br/>\nHere&#39;s the youtube with the version I&#39;m trying to find music to, probably a lost cause though.   I think this guy put some different arrangements together and added in some of his own.  I&#39;ve found a few different variations but not as good as his, (dang!)  I&#39;ll keep working on it though.<br/>\n<br/>\nThe mood lighting that Sandra mentions is really cute &lt;g&gt;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtube.com/watch?v=6Eqyca46J0A\">http://youtube.com/watch?v=6Eqyca46J0A</a><br/>\n<br/>\n<br/>\nI also like a lot of different music from video games.  I liked Crystal Chronicles, Final Fantasies, and there&#39;s some Halo stuff that&#39;s pretty good too.<br/>\n<br/>\nThanks for the info on Soule Sandra,  I&#39;m going to check it out.  We have Oblivion but Alec gets a little freaked out playing it.  He says some of it is just too much for him.   <br/>\n<br/>\nAnd here&#39;s another video that Sandra shared with us that other&#39;s might like too:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://youtube.com/watch?v=TSBIAGCulDw\">http://youtube.com/watch?v=TSBIAGCulDw</a><br/>\n<br/>\nIt&#39;s a Nintendo a capella piece,  really amazing :)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  Kelli~<br/>\n<br/>\n   <br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://ourjoyfullife.blogspot.com/\">http://ourjoyfullife.blogspot.com/</a>  <br/>\n<br/>\n&quot;Life shrinks or expands in proportion to one&#39;s courage.&quot;  ~Anais Nin<br/>\n<br/>\n<br/>\n<br/>\n       <br/>\n---------------------------------<br/>\nBoardwalk for $500? In 2007? Ha! <br/>\nPlay Monopoly Here and Now (it&#39;s updated for today&#39;s economy) at Yahoo! Games.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/TSBIAGCulDw?wmode=opaque","type":"VIDEO"},{"url":"http://www.youtube.com/embed/6Eqyca46J0A?wmode=opaque","type":"VIDEO"}]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Video game music","postDate":"1192231078","msgId":31031,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1ODM4RDQyLThGMDgtNDBDMC1CQjY1LUZCMDZBNjZBQzlGM0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":31034,"prevInTime":31030,"nextInTime":31032,"topicId":31031,"numMessagesInTopic":0,"msgSnippet":"Marty s sitting next to me playing Oblivion, an X-Box game.  He said he thought he had played just about all the scenarios in the game, but discovered thirteen","messageBody":"<div id=\"ygrps-yiv-214695938\">Marty&#39;s sitting next to me playing Oblivion, an X-Box game.  He said  <br/>\nhe thought he had played just about all the scenarios in the game,  <br/>\nbut discovered thirteen or so more.  He was happy about that.<br/>\n<br/>\nA certain theme came on and I said &quot;I like that.&quot;  The art&#39;s  <br/>\nbeautiful and the music, in that game.  I&#39;ve loved the music since  <br/>\nthe NES Mario games, though, when it was all tinky and beepy.<br/>\n<br/>\nMarty said he could tell me in just a minute who wrote it, and I  <br/>\nasked if he was at the end of the game.  No, this game doesn&#39;t have  <br/>\nan ending, but there&#39;s a credits link, so we watched the credits and  <br/>\ntalked about the people&#39;s names.  American looking names.  Maybe  <br/>\nGerman and other northern European, or maybe just Americans with  <br/>\nthose kinds of names.<br/>\n<br/>\nDown below is what we found, in just moments, along with pictures of  <br/>\nthe twenty or so video games whose soundtracks he&#39;s done, and lots of  <br/>\nmusic on the site.<br/>\n<br/>\n<br/>\n<br/>\nBut I have two more stories first.  A few years ago Dan Vilter, Kathy  <br/>\n&quot;sofar8&quot; (I&#39;m forgetting her real name) and I did a workshop at the  <br/>\nHSC conference in Sacramento.  It was well received to standing-room  <br/>\nonly, but was also reviled by a few hecklers and I felt pointed not  <br/>\ninvited back fora couple of years (could&#39;ve been my imagination, but  <br/>\npart of the objection and negativity  was definite).  When people  <br/>\nwere coming into the room and leaving, we were playing music from  <br/>\nFinal Fantasy (IX, I think), which Kirby had bought and sent along  <br/>\nwith me.<br/>\n<br/>\nWhen Holly and I were at the Traaseth&#39;s last week, Kelli had some  <br/>\npiano music for something from Final Fantasy or Halo... (Kelli, fill  <br/>\nin, please and could you post that YouTube link with the mood  <br/>\nlighting? &lt;g&gt;)<br/>\n<br/>\n<br/>\n<br/>\nSo here is something very thought-provoking and moving:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://jeremysoule.com/\">http://jeremysoule.com/</a><br/>\n<br/>\nJeremy Soule began life as a passionate composer of symphonic music  <br/>\nat a very early age.  Since the age of five, Soule took an intense  <br/>\ninterest in the symphony orchestra.  “The Orchestra is the ultimate  <br/>\ninstrument.  I find that it has the ability to define nearly every  <br/>\nhuman emotion in existence” stated Soule from his Cascadian studio in  <br/>\nthe Great Northwest of America.<br/>\n<br/>\nMastering the art of orchestration, melodic composition and emotional  <br/>\ncontext was no easy task for the British Academy Award winning  <br/>\ncomposer...<br/>\n<br/>\n“Every day is a challenge.  I am not able to take anything for  <br/>\ngranted when it comes to music.  Music is a literal language that is  <br/>\na life study for me.  I find that the natural inspiration behind  <br/>\nsound starts with the beauty of the human spirit.  Everything in  <br/>\nmusic is a reflection of who we are in Creation.  Composers draw from  <br/>\nthe same sorts of places as other disciplines of the Arts in that we  <br/>\nare all connected to some greater cause and energy.  Defining our  <br/>\nplace in this energy is the beauty of our Art.”<br/>\n<br/>\nThat video games could be considered “Art” was unthinkable over 30  <br/>\nyears ago during the debut of the first game machines such as the  <br/>\nMagnavox Odyssey.  The sights and sounds of the mid-eighties machines  <br/>\nalso did little to hint at the coming revolution.  Today, video games  <br/>\nfeature development budgets in the tens of millions of dollars and  <br/>\noften command some of the top talent in an ever-growing $20 billion  <br/>\nindustry.<br/>\n<br/>\nFor over a decade, Soule has provided music for some of the most  <br/>\nsuccessful and admired games of all time.  Star Wars: Knights of the  <br/>\nOld Republic, Harry Potter, Total Annihilation, SOCOM: The Navy Seals  <br/>\nand the Elder Scrolls series can all attribute music to him.  His  <br/>\nversatility as a composer has also been demonstrated from his  <br/>\ncritically acclaimed traditional Asian score for Guild Wars Factions  <br/>\nto his work with children’s properties such as Rugrats and Lemony  <br/>\nSnicket and the Series of Unfortunate Events.<br/>\n<br/>\nThe year 2006 witnessed one of the best years yet for Soule with such  <br/>\ncritical and commercial success coming from The Elder Scrolls IV:  <br/>\nOblivion, Guild Wars: Factions/Nightfall, Prey and the World War II  <br/>\nepic Company of Heroes.  Soule won the inaugural MTV Video Music  <br/>\nAward in August for “Best Score” and was honored with his third  <br/>\ncareer British Academy Award nomination in October.  In November,  <br/>\nSoule won another “Best Score” award from Spike TV and was the  <br/>\nrecipient of numerous press awards such as Game Daily’s “most iPod- <br/>\nworthy score”.<br/>\n<br/>\nIn feature films, Soule’s Walden Logo was used at the start of the  <br/>\n$744 million earning film: The Chronicles of Narnia: The Lion the  <br/>\nWitch and the Wardrobe.  His work with Narnia also continued with  <br/>\ndirector Norman Stone’s critically acclaimed film C.S. Lewis: Beyond  <br/>\nNarnia.<br/>\n<br/>\nIn concerts, Soule’s music was a component of the successful “Play  <br/>\nSymphony” tour that featured prominently Elder Scrolls as well as  <br/>\nPrey as part of their concert program.  Performances were conducted  <br/>\nwith symphony orchestras in Vienna, Stockholm, Chicago, Philadelphia,  <br/>\nDetroit and Toronto.  Future performances are scheduled in Stockholm,  <br/>\nSydney and Singapore.  Visit www.play-symphony.com for more  <br/>\ninformation. A special note to our readers...<br/>\n  “I love my fans—especially young composers.  I encourage anyone  <br/>\nthat wishes to contact me to write me here at this website.  It may  <br/>\ntake me a little while to reply to everyone but be assured that I  <br/>\nwill respond.” –Jeremy Soule</div>","specialLinks":[]}],"prevTopicId":31022,"nextTopicId":31041}}