{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"Kw3tdtKMqP-1ChjYNHooQQU5LdDDifH7BwJyLIUjmWg1Y41iE1itQn_3XAuqHVcwB8yfgCuXxR1fsK0puMHBWOc6X_FEEA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"KnoK NEWS for 22 Sept. 2000","postDate":"969591600","msgId":13266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwOTIyMDMwMC5NQUEyMTg1NEBzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13265,"nextInTime":13267,"topicId":13266,"numMessagesInTopic":0,"msgSnippet":"* * * *  KnoK NEWS  * * * * -- Views from the world of learning in Japan -- Welcome to the 22 September 2000 edition of KnoK (pronounced knock ) NEWS, an","messageBody":"<div id=\"ygrps-yiv-144082833\">* * * *  KnoK NEWS  * * * *<br/>\n            -- Views from the world of learning in Japan --<br/>\n<br/>\n<br/>\nWelcome to the 22 September 2000 edition of KnoK (pronounced &quot;knock&quot;) <br/>\nNEWS, an informal and periodic bulletin concerning issues of learning in <br/>\nJapan. It is brought to you by the Covert family -- Kazumi, Kenya and <br/>\nBrian -- a multicultural, homelearning family in Osaka, Japan.<br/>\n<br/>\nKnoK stands for *Kodomo no Kokoro*, meaning &quot;Heart of a Child&quot; in <br/>\nJapanese. It is our belief that the heart of any child is indeed at the <br/>\ncenter of true learning, wherever and however such learning may take <br/>\nplace. <br/>\n<br/>\n<br/>\n              &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nEDITOR&#39;S WELCOME: A hearty greeting to all on this first day of Autumn! <br/>\nYes, summer break is over in Japan, and the streets, parks, shops and <br/>\ntrains in our town seem eerily quiet with the schoolchildren now back in <br/>\nclasses.<br/>\n<br/>\nHow long the students will stay there is anybody&#39;s guess, however. <br/>\nRecently released data by the Japanese Ministry of Education confirms <br/>\nthat the number of Japanese students who were absent from schools <br/>\nnationwide for 30 or more days exceeded 130,000, a record high, during <br/>\nthe 1999-2000 school year. And the figures show no sign of dropping in <br/>\nthe near future.  <br/>\n<br/>\nMany in Japanese academia are calling for educational reform one way or <br/>\nthe other. Among them are a couple of educators-cum-authors whose books <br/>\nwere recently reviewed in a trade publication in Japan, and which we <br/>\ncarry in this issue of KnoK NEWS strictly for informational purposes.<br/>\n<br/>\nThen there are people like Akio Furuyama, a Japanese homelearning <br/>\nadvocate and mentor-teacher in his own right who envisions a Japan where <br/>\nchildren learn for the pure joy of it. If you have read the opening pages <br/>\nof the US-based &quot;Growing Without Schooling&quot; magazine (May/June 2000), <br/>\nthen you know that he is something of a writer as well.<br/>\n<br/>\nIt is our great pleasure to carry an original article by Furuyama this <br/>\ntime as the debut of our new series, &quot;Voices of Japanese Homelearners.&quot; <br/>\nThe news media in Japan are paying much attention to homelearning as a <br/>\nserious alternative to school, but even so, there are lots of Japanese <br/>\nhomelearning families out there whose voices are not getting heard at the <br/>\ngrassroots level. We have thus decided to offer a forum in KnoK NEWS <br/>\nwhere Japanese homelearners can share their stories -- in their own words <br/>\n-- with other homelearners and alternative educators around the globe. <br/>\nAkio Furuyama&#39;s set of mini-essays and reflections here on lifelong <br/>\nlearning seems the perfect kickoff for our new series.<br/>\n<br/>\nSo without further ado, and fresh from an extended summer break of our <br/>\nown, we&#39;re back on the case with a full issue of KnoK NEWS. As always, <br/>\nfeel free to pass this around and share it with others.<br/>\n<br/>\nEnjoy,<br/>\n<br/>\nBrian Covert<br/>\nOsaka, Japan<br/>\n<br/>\n<br/>\n                             *   *   *   *<br/>\n<br/>\n<br/>\nBOOK REVIEWS:<br/>\n<br/>\n(1)<br/>\n*Bunsu ga deikinai daigakusei: Niju-isseiki no Nihon ga abunai*<br/>\n[University Students Can&#39;t Do Fractions: Twenty-first-century Japan in <br/>\nPeril]<br/>\n[by] Okabe Tsuneharu et al., eds.<br/>\nToyo Keizai Shimposha, 1999<br/>\n<br/>\nWhile the country is poor in natural resources, Japan has developed on <br/>\nthe strength of its technology. Partly for that reason and partly because <br/>\nof the image of fierce competition for school and university placement in <br/>\nJapan, it is generally believed that the Japanese on the whole are strong <br/>\nin mathematics.<br/>\n<br/>\nAccording to this book, that image is an illusion. In reality, he shows, <br/>\nJapan&#39;s schools offer the lowest number of class hours devoted to <br/>\nmathematics of any advanced industrial nation, and many of its <br/>\nuniversities do not make mathematics a required subject in their entrance <br/>\nexaminations. Some 20 percent of students in top private universities, <br/>\naccording to a survey report, were unable to solve such elementary <br/>\nmathematical equations as division of fractions. Based on comparison with <br/>\ndata from other countries, the book confirms the fact that the math <br/>\nskills of Japanese college students have declined to a shockingly low <br/>\nlevel, and considers what mathematics and other fundamental education <br/>\nshould be like in the future.<br/>\n<br/>\nEdited by members of the Nihon Sugaku Kai (Japan Mathematics Society), <br/>\nthe book conveys their strong commitment to reversing the course of the <br/>\nalready dire education crisis they encounter daily. The book attracted <br/>\nconsiderable media attention, stirring up a lively public debate.<br/>\n<br/>\n(2)<br/>\n*Nihonjin wa naze Eigo ga dekinai ka*<br/>\n[Why Japanese Are Poor at English]<br/>\n[by] Suzuki Tadao<br/>\nIwanami Shoten, 1999<br/>\n<br/>\nFew of Japan&#39;s prime ministers throughout modern history have been <br/>\nproficient enough in English to function in the international political <br/>\narena without the aid of interpreters. Such being the case for the <br/>\nnation&#39;s top representatives, it is hardly surprising that the English <br/>\nlanguage skills of the vast majority of ordinary Japanese remain poor <br/>\neven in the so-called age of internationalization. Despite six years of <br/>\nEnglish study in junior and senior high school and four years at the <br/>\nuniversity level, the degree of English proficiency of even well-educated <br/>\nJapanese is low.<br/>\n<br/>\nThe sociolinguist author of this book stresses the need to reform the <br/>\nanachronistic and ineffectual approaches to English education in Japan so <br/>\nas to cultivate real competence in the language. He argues that achieving <br/>\nthat goal requires a fundamental change in assumptions and would entail <br/>\nsuch measures as making English a non-compulsory component of the school <br/>\ncurriculum and using only teaching materials with Japan-related content. <br/>\nWhat is needed, he maintains, is to replace the conventional approach of <br/>\n&quot;passive English,&quot; which is based mainly on understanding the West and <br/>\nputting English into Japanese, with &quot;active English&quot; centered on <br/>\nself-expression and the use of English to describe and explain Japan to <br/>\nnon-Japanese.<br/>\n<br/>\nTo those ends, the author presents a convincing array of practical <br/>\nsuggestions based on his own experience in language education reform at <br/>\nKeio University.<br/>\n<br/>\n<br/>\n(Copyright - The Japan Foundation 2000)<br/>\n<br/>\n[Source: &quot;Japanese Book News,&quot; No. 30, Summer 2000, pp. 15-16. Published <br/>\nby The Japan Foundation; Tokyo, Japan]<br/>\n<br/>\n<br/>\n                             *   *   *   *<br/>\n<br/>\n<br/>\n                   VOICES OF JAPANESE HOMELEARNERS<br/>\n<br/>\n<br/>\n&quot;OF CARS AND STARS&quot;<br/>\n<br/>\nBy Akio Furuyama<br/>\n<br/>\n<br/>\n--Fantasy concerned with real life<br/>\n<br/>\nChildren&#39;s spirits are always weaving a variety of stories. I find <br/>\naspects of their stories seem to change after they become 10 years old or <br/>\nso: While children used to live in pure fantasy, now they are more <br/>\nconcerned with reality and they follow the nature of things they encounter.<br/>\n<br/>\nThese &quot;things&quot; are called hobbies. Children are completely absorbed in <br/>\nthem. These hobbies are situated between pure fantasy and objective <br/>\nreason; for children, hobbies are bridges leading to the real world.<br/>\n<br/>\nMy 12-year-old nephew, who is homeschooling with me, is absorbed in cars <br/>\nand fishing. He knows about sports cars, in particular. As we walk <br/>\nthrough town, he  eagerly finds his favorite cars.<br/>\n<br/>\n&quot;That&#39;s a Nissan Sylvia S-13!&quot; &quot;A Honda NSX just passed by!&quot;<br/>\n<br/>\nThe cars seem almost the same to me, so I ask him how he recognizes them.<br/>\n<br/>\n&quot;That one has a big air-spoiler and....&quot;<br/>\n<br/>\nHe explains himself eloquently. I listen carefully, and though I think I <br/>\nunderstand, I find his explanations have faded from my memory the next <br/>\nday. I&#39;m not as keenly tuned in as he is.<br/>\n<br/>\nHe remembers places through cars. When my nephew tries to point out a <br/>\nplace, he says something like: &quot;Near the parking lot where the Nissan <br/>\nSkyline GTR is....&quot;<br/>\n<br/>\nHe has also made many plastic model cars and has assembled a big <br/>\nradio-controlled car. He seems to know well about the general structure <br/>\nof automobiles. He has many car-race video games, and talks of things <br/>\nlike the friction of the tires and &quot;inertia drift.&quot;<br/>\n<br/>\nHe seems to have learned much through cars. Yet I think there is more to <br/>\nthis kind of hobby than even my nephew lets on. He is building his own <br/>\nbridge to the real world.<br/>\n<br/>\n--Glittering on the outside<br/>\n<br/>\nThe force which leads a child is like something glittering in the outside <br/>\nworld. It is a force which almost seems to say: &quot;Come here, here&#39;s what <br/>\nwill fulfill your heart, what will spread your wings of fantasy, what <br/>\nwill help exert your brain and hands.&quot; Something very important happens <br/>\nto a child when he or she pursues this &quot;glistening.&quot;<br/>\n<br/>\nSome children in Japan pursue insects; they know the many names of <br/>\ninsects and how to tame them. Some children remember all the <br/>\ncharacteristics of &quot;Pocket Monsters,&quot; or Pokemon. Some busy themselves <br/>\nwith handicrafts. Some are absorbed in drawing *manga* (Japanese cartoons).<br/>\n<br/>\nWhile respecting each child&#39;s uniqueness, I have found a few points <br/>\ncommon to most children&#39;s absorptions:<br/>\n<br/>\n(1) Children do an activity for the sake of doing it, because it is <br/>\nfascinating.<br/>\n(2) Children are sensitive to small differences. They know the shapes, <br/>\ntypes and data of things.<br/>\n(3) Children want to comprehend all kinds of objects, to put them in order.<br/>\n(4) Children enjoy dramas and stories.<br/>\n(5) Children&#39;s interests are contagious. One child&#39;s absorption induces <br/>\nanother&#39;s.<br/>\n(6) Children communicate with each other through these hobbies.<br/>\n<br/>\n--A stone&#39;s throw from imagination<br/>\n<br/>\nSupporting these kinds of positive activities among children should be <br/>\nthe main dish of education. In these activities, will, emotions and <br/>\nintelligence all work together in children, and help them to find a sense <br/>\nof harmony. It doesn&#39;t seem to matter what the activity is: What is <br/>\nimportant is that a child does it by his or her own will -- and <br/>\nwholeheartedly.<br/>\n<br/>\nAlthough studying subjects is considered to be the major part of modern <br/>\neducation, it is a supplementary factor in the growth of children. What <br/>\ngood is knowledge if children are deprived of their own feelings and <br/>\ntheir own will in the process of gaining that knowledge?<br/>\n<br/>\nChildren are indeed in love with finding things; they pursue things that <br/>\nfascinate them. I&#39;ve noticed that when children are about 12 years old, <br/>\nthey also become able to understand a cause-effect relationship in <br/>\nmatters which have nothing to do directly with them. They can achieve <br/>\nsubstantial academic progress, if they have to.<br/>\n<br/>\nBut children at this stage don&#39;t yet have a complete thinking ability. <br/>\nTheir thinking is still based more on the fantasy side. For them, <br/>\n&quot;thinking&quot; requires body action, fun, beauty, vividness, pictures and so <br/>\non. A conclusion might well be summarized by following a mental line, but <br/>\nit must also be touched, experienced, deduced and dramatized. The best of <br/>\nschool classes fosters this vividness -- but it could happen anywhere or <br/>\nanytime, without any class or lecture.<br/>\n<br/>\nChildren have in themselves the power to find direction, to figure out <br/>\nwhat&#39;s around them, to find relationships between things. When they are <br/>\nvery young, this power appears as fantasy, and I see this fantasy as <br/>\ndeveloping in various ways: Fantasy will become science if it corresponds <br/>\nwell with cause-effect relationships. Fantasy will become ethics if it is <br/>\nconcerned with what one should do. Fantasy will become art if beauty and <br/>\nimpressions are what is pursued.<br/>\n<br/>\nI believe this is the way a child&#39;s intellect develops. After all, does <br/>\nit not require a great deal of imagination for one to observe the force <br/>\nof acceleration and momentum involved in the simple act of, say, throwing <br/>\na stone?<br/>\n<br/>\n--Space travel through stargazing<br/>\n<br/>\nSeveral years ago, an 11th-grade high school student said she wanted to <br/>\nsee some stars, so we walked to a nearby park and I offered some <br/>\nexplanations as we looked up at the night sky. She loved watching stars, <br/>\nshe said, because &quot;when I&#39;m watching stars, I become part of that world <br/>\nand I feel like I&#39;m traveling in space.&quot; It wasn&#39;t long before she was <br/>\nindeed completely immersed in the star world, remarking &quot;Oh, how <br/>\nbeautiful....&quot;<br/>\n<br/>\nI myself could do this kind of &quot;space travel&quot; when I was young. I <br/>\nremember I used to walk looking up at the night sky as I made my way to <br/>\nand from a public bath. Forty years ago or so in Japan, only rich <br/>\nfamilies had their own baths in their homes. Watching the stars as I <br/>\nwalked along back then, I found myself traveling in space. This, for me, <br/>\nwas supreme bliss.<br/>\n<br/>\nSo, it was a surprise to me that the girl could still do that kind of <br/>\nspace traveling when she was 17. But then again, maybe it&#39;s not all that <br/>\ndifficult. A completely new type of education might make it possible to <br/>\nbe both aesthetic and logical at the same time. It would be wonderful if <br/>\none could grow into adulthood with the world still aglitter. But then I <br/>\nthink of the reality of Japan&#39;s hellish examinations for entering <br/>\nschools....and I sigh.<br/>\n<br/>\nTo give more freedom to children. To assure their freedom to pursue that <br/>\nwhich glitters. To let them be free of a life of struggling with given <br/>\ntasks. These are very important for children. Likewise, they are <br/>\nimportant for our personal happiness -- and for a better future for our <br/>\nsociety.<br/>\n<br/>\n----------------------<br/>\nAkio Furuyama (<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:akiofrym@...\">akiofrym@...</a>) was born in 1949 in the city <br/>\nof Chiba, Japan. He has worked on the editorial staff of a Japanese <br/>\nmagazine. These days, he runs a small &quot;free school&quot; and *juku* (private <br/>\nlearning center) in Chiba. He has been assisting Japanese <br/>\n&quot;school-refusing&quot; students for more than a decade, and for two years now <br/>\nhe has been homelearning with his nephew. Furuyama believes that <br/>\n&quot;homeschooling is the most effective, the most flexible, and the cheapest <br/>\nway of alternative education.&quot;<br/>\n<br/>\n<br/>\n                             *   *   *   *<br/>\n<br/>\n<br/>\nNATIONAL NEWSPAPER COVERAGE IN JAPAN:<br/>\n<br/>\nIn case you missed earlier updates, here is a listing of recent press <br/>\ncoverage of homelearning and alternative education in Japan. Lately we <br/>\nhave been seeing a genuine interest by the Japanese news media -- at both <br/>\nthe local and national levels -- in covering these kinds of viable <br/>\nchoices to conventional schooling. The articles below were all carried in <br/>\nnewspapers with nationwide circulation, the coverage ranging in tone from <br/>\nobjective to supportive. More updates on Japanese news reports as they <br/>\ndevelop.... <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The Daily Yomiuri - 19 September 2000<br/>\n </span></blockquote>&quot;Defiant children a product of school rigidity&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.yomiuri.co.jp/newse/0919so18.htm\">http://www.yomiuri.co.jp/newse/0919so18.htm</a><br/>\n--This story, part of a full-page spread, is a lengthy Q & A session with <br/>\nJapanese social critic Shunsuke Serizawa on the state of public education <br/>\nin Japan and how it &quot;suffocates&quot; Japanese schoolchildren. Written by a DY <br/>\nstaff writer, this original English-language article was carried on the <br/>\npaper&#39;s &quot;Focus&quot; page as part of its &quot;Matters of Opinion&quot; series. <br/>\nHome-based learning is mentioned in passing.<br/>\n<br/>\n&quot;&#39;Free&#39; schools strive to give students an alternative&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.yomiuri.co.jp/newse/0919so17.htm\">http://www.yomiuri.co.jp/newse/0919so17.htm</a><br/>\n--A long sidebar to the above main story, focusing on the life of a <br/>\nstudent of the Tokyo Shure &quot;free school&quot; and on some of the institution&#39;s <br/>\nactivities. Mentions homelearning in passing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The Daily Yomiuri - 2 September 2000<br/>\n </span></blockquote>&quot;Stay-at-home kids shunning the system&quot;<br/>\n(inactive website link)<br/>\n--Part of a full-page spread that appeared on the &quot;Saturday Scene&quot; page. <br/>\nThis main story, an original English-language piece by a DY staff writer, <br/>\nis centered on the activities and experiences of Yoshiko Kubo, one of our <br/>\nveteran homelearning parents and advocates here in Japan. Featured as a <br/>\nsidebar is a Washington Post story titled &quot;Cyberschools filling <br/>\nhomeschooling gaps&quot; by Post reporter Nancy Trejo. <br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt;Asahi Evening News - 28 August 2000<br/>\n </span></blockquote>&quot;Homeschoolers undeterred by dim view taken on high&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.asahi.com/english/asahi/0828/asahi082812.html\">http://www.asahi.com/english/asahi/0828/asahi082812.html</a><br/>\n--A hefty article on homelearning that first appeared in Japanese in the <br/>\nAsahi&#39;s vernacular mothership newspaper, the Asahi Shimbun, on 31 July <br/>\n2000. Carried on the AEN&#39;s Education page, this translated story includes <br/>\ninterviews with prominent homelearning advocates in Japan, such as <br/>\nYoshiko Kubo and Kyoko Aizawa. <br/>\n<br/>\n&quot;Son takes the lead, now &#39;living is learning&#39;&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.asahi.com/english/asahi/0828/asahi082813.html\">http://www.asahi.com/english/asahi/0828/asahi082813.html</a><br/>\n--An original English-language sidebar to the above main story in the <br/>\nAEN, featuring a first-person account by a homelearning parent in Japan.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Mainichi Daily News - 8 August 2000<br/>\n </span></blockquote>&quot;Community schools&quot; (editorial)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mainichi.co.jp/english/news/archive/200008/08/opinion.html\">http://www.mainichi.co.jp/english/news/archive/200008/08/opinion.html</a><br/>\n--This English-language version was translated from a Japanese editorial <br/>\nthat first appeared 6 August 2000 in the vernacular Mainichi Shimbun <br/>\nnewspaper. It calls on the Japanese government to &quot;reform&quot; Japanese <br/>\nschools so they are more flexible and better meet students&#39; needs. <br/>\nMentions homelearning in passing.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;The Japan Times - 29 June 2000 <br/>\n </span></blockquote>&quot;Making Home a School Away from School&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.japantimes.co.jp/cgi-bin/getarticle.pl5?fl20000629a2.htm\">http://www.japantimes.co.jp/cgi-bin/getarticle.pl5?fl20000629a2.htm</a><br/>\n--A nicely done, original English-language article from a columnist of <br/>\nthe Times. Features interviews with some of the key players of the <br/>\n&quot;Homeschooling in Japan&quot; website <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www2.gol.com/users/milkat/index.html)\">http://www2.gol.com/users/milkat/index.html)</a>. <br/>\n<br/>\n<br/>\n                             *   *   *   *<br/>\n<br/>\n<br/>\n                 WISH I&#39;D SAID THAT  (Quote of the Day):<br/>\n<br/>\nThe little boy went first day of school<br/>\nHe got some crayons and started to draw<br/>\nHe put colors all over the paper<br/>\nFor colors was what he saw<br/>\nAnd the teacher said &quot;What you doing, young man?&quot;<br/>\n&quot;I&#39;m paintin&#39; flowers,&quot; he said<br/>\nShe said &quot;It&#39;s not the time for art, young man,<br/>\nand anyway, flowers are green and red....&quot;<br/>\n<br/>\n  --Singer/songwriter Harry Chapin, &quot;Flowers Are Red,&quot; from &quot;Living Room <br/>\nSuite,&quot; 1978</div>","specialLinks":[]}],"prevTopicId":13249,"nextTopicId":13220}}