{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What to say to the naysayers","postDate":"1343560583","msgId":68444,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMyQzJCNjAxLTEyRjgtNDQ5MS05NUI4LUY4N0Y0MDQ1OTc2NUBnbWFpbC5jb20+","inReplyToHeader":"PGp1cGI1ZitkMmVkQGVHcm91cHMuY29tPg==","referencesHeader":"PGp1cGI1ZitkMmVkQGVHcm91cHMuY29tPg=="},"prevInTopic":68357,"nextInTopic":0,"prevInTime":68443,"nextInTime":68445,"topicId":68341,"numMessagesInTopic":0,"msgSnippet":"-=- The advice I am looking to receive is about how to deal with these people. They want to know how I m going to do it and when I meet homeschoolers, they","messageBody":"<div id=\"ygrps-yiv-1885259118\">-=- The advice I am looking to receive is about how to deal with these people. They want to know how I&#39;m going to do it and when I meet homeschoolers, they want to know what curriculum I&#39;m going to use. -=-<br/>\n<br/>\nMy answer depends on who is asking. I start with short, simple answers. If they ask for more information, I give a bit more. <br/>\n<br/>\nIf parents of school children ask, I usually say our homeschooling is pretty eclectic. I may give certain examples such as visiting interesting places, doing experiments, playing &#39;learning&#39; games, reading stories, having conversations of events that happened in the past, talking about famous people, making things, hanging out with friends, etc. Sometimes I share with them a detailed description of an interesting day that we&#39;ve had, especially if it has impressive signs of learning that they will recognize. <br/>\n<br/>\nIf I notice that a parent is particularly anxious with my answers, I might add that the children use Brain Quest workbooks (see note below). Or something else schoolish that we have in our house that the children have showed some sort of interest in. I usually don&#39;t tell the parent that I never ask our children to use workbooks. I don&#39;t tell them that sometimes the children cut up their unfinished workbooks to make other things. I don&#39;t tell them that sometimes the children pretend to be my teacher and ask me to do homework and fill out the workbooks. I let the parent fill in the blanks with their own thoughts and ideas. <br/>\n<br/>\nOften a school parent will ask what hours we homeschool and I tell them we have slow mornings and then we do different things that the children find interesting - maybe working on an ongoing project or going on a little trip. I tell them that we have some really busy days, and some really luxurious downtime days. Most days are a mix of both. Some school parents ask whether or not our homeschooling is similar to Montessori or Waldorf. I tell them it can have elements of either one. It is more similar to the open classroom philosophy or the democratic Sudbury model. Sometimes it has elements of Reggio Emilia. Usually at this point, they suspect I may know more about educational approaches than they do, and they change the topic.<br/>\n<br/>\nIf it is a homeschooler that asks, I tell them we unschool. If they ask about curriculum, I say unschooling parents provide a rich and interesting environment for children to learn and use things like games, books, television, music, maps, art and craft supplies, computers, and much, much more to help create this environment. I tell them that we help our children follow their interests and passions by being a facilitator. If they want more information on curriculum, I direct them here: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum\">http://sandradodd.com/unschoolingcurriculum</a><br/>\n<br/>\nIf the homeschooling parent shows curiosity or interest in unschooling, I direct them to Sandra&#39;s and Joyce&#39;s websites:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com\">http://sandradodd.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<br/>\nIf the person asking is attached to the idea of &#39;real research&#39;, I often answer that our approach is natural learning. I suggest that they might want to read the work of Peter Gray (professor at Boston University), Alan Thomas (Visiting Fellow at University of London) and/or Carlo Ricci (professor at Nipissing University) if they would like to learn more. <br/>\n<br/>\nNo matter who is asking, I answer with confidence and matter of factness. I&#39;m friendly and disarming. I smile :-) If there is a lull in the conversation, I smoothly transition into asking something about their child. Maybe something like - &#39;How is Susie doing? I saw that she has a brand new pink bicycle with a Barbie bell. She must love that&#39;. <br/>\n<br/>\nThe way I&#39;ve dealt with people&#39;s questions has improved with time and practice. <br/>\n<br/>\n<br/>\n-=- In your experience, after the first year of everyone asking what we are doing, does the hub nub die down or do they keep coming? -=- <br/>\n<br/>\nOur confidence in unschooling helped the hub nub die down for us. My confidence in answering people&#39;s questions dramatically improved after the first year. In the very beginning I was almost apologetic that we homeschooled :-)<br/>\n<br/>\nThese days, if someone asks me a question about homeschooling, it&#39;s usually Gianluca and Gisele that bubble over with excitement and take over the conversation. They explain with great enthusiasm what homeschooling is for them and happily answer people&#39;s questions. <br/>\n<br/>\nI didn&#39;t expect for that to happen. Something else that I didn&#39;t expect was that the people who asked us lots of homeschooling questions in the early days, began to make complimentary remarks about our children and started to notice different things that they were learning. Some things that people have said are &#39;Gianluca is a really logical problem solver&#39; or &#39;Gisele is super confident&#39; or &#39;you have really happy/helpful/friendly children&#39;. <br/>\n<br/>\nPeople see evidence of us doing all sorts of stuff. If someone comes into our house, they see a rich and nourishing environment where there are recognizable (to them) signs of learning - little family post boxes for notes that we write each other, a substantial library, craft projects and lego structures in different stages of completion, drawings, puzzles and more.<br/>\n<br/>\nPeople see our children out and about in the world - having conversations with adults, teens, younger children and older children. They see Gianluca and Gisele go exploring in the neighbourhood with binoculars, magnifying glasses, nature identification cards, and other fun tools. They see them build things in front of the house, trade games, toys and cards with neighbourhood kids, bike around with friends, invite friends over to play wii and watch movies. People see the children come back from interesting places and witness them enthusiastically tell others what they saw, felt, heard, witnessed, smelled, tasted, and talked about. The children themselves radiate confidence in their happiness with homeschooling. Probably that helped most with the questions dying down.<br/>\n<br/>\nRippy<br/>\n(Gianluca 7, Gisele 5)<br/>\n<br/>\nNote: For your family, the most important thing now is to deschool. Avoid anything schoolish, unless your children really want to use those types of resources. This is their rest and recovery time from their 6 years of schooling. It&#39;s important not to rush them and to give yourself plenty of time to deschool as well. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://livingjoyfully.ca/unschooling/getting_started/what_is_deschooling.htm\">http://livingjoyfully.ca/unschooling/getting_started/what_is_deschooling.htm</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":343381924,"authorName":"Lucy&#39;s web","from":"Lucy&#39;s web &lt;lucy.web@...&gt;","profile":"lucylists","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What to say to the naysayers","postDate":"1343305980","msgId":68357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA2RDEyMEJELTk0MDktNDIyNi1CNThFLTQ1NUYwODg4MERCNEBtYWMuY29tPg==","inReplyToHeader":"PGp1cjcxNitqZzBsQGVHcm91cHMuY29tPg==","referencesHeader":"PGp1cjcxNitqZzBsQGVHcm91cHMuY29tPg=="},"prevInTopic":68353,"nextInTopic":68444,"prevInTime":68356,"nextInTime":68358,"topicId":68341,"numMessagesInTopic":0,"msgSnippet":"... I ve found this kind of trying it for a while phrase has been really valuable when dealing with schooling questions.   People just seem to accept that,","messageBody":"<div id=\"ygrps-yiv-2067617353\">On 26 Jul 2012, at 12:43, sandralynndodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &quot;We&#39;re going to try this and see how it goes.&quot;<br/>\n<br/>\n </span></blockquote>I&#39;ve found this kind of &#39;trying it for a while&#39; phrase has been really valuable when dealing with schooling questions.   People just seem to accept that, easier than: &quot;My kids don&#39;t go to school.&quot;   Maybe it comes over as less confrontational, somehow.   <br/>\n<br/>\nI&#39;ve found that I need to say it with some certainty, though, and a kind of &#39;final sounding&#39; full stop at the end.   Any hint of &quot;we&#39;re not sure about this&quot; seems to open the way for a lecture. :roll:<br/>\n<br/>\nLucy <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"sandralynndodd","from":"&quot;sandralynndodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: What to say to the naysayers","postDate":"1343299430","msgId":68353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1cjcxNitqZzBsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp1cGI1ZitkMmVkQGVHcm91cHMuY29tPg=="},"prevInTopic":68349,"nextInTopic":68357,"prevInTime":68352,"nextInTime":68354,"topicId":68341,"numMessagesInTopic":0,"msgSnippet":"I just came across this, on my site, by Amy Carpenter: Change When I was beginning to change my parenting behavior, I would memorize a phrase to get me started","messageBody":"<div id=\"ygrps-yiv-1614815147\">I just came across this, on my site, by Amy Carpenter:<br/>\n<br/>\n<br/>\nChange<br/>\nWhen I was beginning to change my parenting behavior, I would memorize a phrase to get me started in the direction I wanted to go.<br/>\n<br/>\nWhen I was worried about answering people&#39;s concerns that we were taking our son out of school, I memorized, &quot;We&#39;re going to try this and see how it goes.&quot;<br/>\n<br/>\nWhen I wanted to respond to my children without bossiness but still tell them my concerns, I memorized, &quot;I&#39;m not sure about this, but let&#39;s think about it together.&quot;<br/>\n<br/>\nAnd so on. It was my version of carrying something in my wallet.<br/>\n<br/>\nPeace,<br/>\nAmy (arcarpenter)<br/>\n-----------------<br/>\n<br/>\nIt&#39;s here, and might have other helpful ideas for the rough feelings when unschooling is new: <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/beginning\">http://sandradodd.com/beginning</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: What to say to the naysayers","postDate":"1343255594","msgId":68349,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1cHM3YStla2VlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGp1cGI1ZitkMmVkQGVHcm91cHMuY29tPg=="},"prevInTopic":68342,"nextInTopic":68353,"prevInTime":68348,"nextInTime":68350,"topicId":68341,"numMessagesInTopic":0,"msgSnippet":"... ********** With other homeschoolers you can say I m still kind of playing it by ear or something to that effect... use the word eclectic maybe, since","messageBody":"<div id=\"ygrps-yiv-1386369310\">&quot;lucia&quot; &lt;ciastar1000@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; They want to know how I&#39;m going to do it and when I meet homeschoolers, they want to know what curriculum I&#39;m going to use.  I don&#39;t want to have to explain to every person I meet my educational philosophy, but I don&#39;t know what else to do.<br/>\n </span></blockquote>**********<br/>\n<br/>\nWith other homeschoolers you can say &quot;I&#39;m still kind of playing it by ear&quot; or something to that effect... use the word &quot;eclectic&quot; maybe, since that tends to mean something looser than committing to a single curriculum. Plenty of homeschoolers also change curriculum after the first year, so it&#39;s not unrealistic to be a bit vague about what you&#39;re doing at first, and you can use it as a jumping off point to ask questions like: are your kids in any clubs? or which reporting method do you use?<br/>\n<br/>\nWith people who have never homeschooled, it helps to be a step more vague about what your family actually does but stock up on generic &quot;this is what homeschoolers in general do&quot; sorts of information, or at least one-liners. Like it or not, people will be asking you the same basic questions about home-education for years, so it helps to have a set of quick and dirty replies in your head: yes it&#39;s legal, yes, the law requires us to test/keep records/be evaluated, no its not really all that hard, yes homeschooled kids can go to college - colleges even recruit homeschoolers, no I don&#39;t worry about socialization... yada yada yada.<br/>\n<br/>\nIf a non-homeschooler asks about curricula, you can make a brief comment about the joys of being able to individually tailor what you do you meet the specific needs of each child and then, if you want, comment about how Much Happier your whole family is now. That was one we got lots of mileage out of with Ray: &quot;OMG, we&#39;re all So Much Happier!&quot; With Mo, since she got to unschool from the start, the line I use is &quot;she&#39;s Just So Independent!&quot;<br/>\n<br/>\nThe real key is to appear confident in your decisions, even if you&#39;re still figuring things out. That tends to keep people from being overly critical.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] What to say to the naysayers","postDate":"1343239634","msgId":68342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENDNkM2NTA1LUVFMzktNEUzRS1BQTVDLTZBQTgwQzU1RTQxREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGp1cGI1ZitkMmVkQGVHcm91cHMuY29tPg==","referencesHeader":"PGp1cGI1ZitkMmVkQGVHcm91cHMuY29tPg=="},"prevInTopic":68341,"nextInTopic":68349,"prevInTime":68341,"nextInTime":68343,"topicId":68341,"numMessagesInTopic":0,"msgSnippet":"Maybe invest in several copies of Pam Laricchia s new book to lend out to people who wonder. Or come up with some quick answers, and qualify them. Like For","messageBody":"<div id=\"ygrps-yiv-811278815\">Maybe invest in several copies of Pam Laricchia&#39;s new book to lend out to people who wonder.<br/>\nOr come up with some quick answers, and qualify them.<br/>\n<br/>\nLike &quot;For now, we&#39;re doing a free-form individualized kind of homeschooling.&quot;<br/>\n<br/>\nPam&#39;s book is here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.livingjoyfully.ca/\">http://www.livingjoyfully.ca/</a><br/>\n<br/>\nThere are ideas for things to say to others on my site, but I&#39;m in the chat now and can&#39;t look them up.  Maybe someone else can.  There are some under what to say to relatives, so I&#39;m guessing<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/relatives\">http://sandradodd.com/relatives</a><br/>\nwill have ideas or links to ideas.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":283456903,"authorName":"lucia","from":"&quot;lucia&quot; &lt;ciastar1000@...&gt;","profile":"ciastar1000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"What to say to the naysayers","postDate":"1343238127","msgId":68341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGp1cGI1ZitkMmVkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":68342,"prevInTime":68340,"nextInTime":68342,"topicId":68341,"numMessagesInTopic":0,"msgSnippet":"My family, after years of being afraid to leap into unschooling, is now taking the plunge.  We have been a public school for three years and catholic school","messageBody":"<div id=\"ygrps-yiv-1505333408\">My family, after years of being afraid to leap into unschooling, is now taking the plunge.  We have been a public school for three years and catholic school for three years.  We live in a smallish town and I know many of the parents from both schools.  The advice I am looking to receive is about how to deal with these people.  They want to know how I&#39;m going to do it and when I meet homeschoolers, they want to know what curriculum I&#39;m going to use.  I don&#39;t want to have to explain to every person I meet my educational philosophy, but I don&#39;t know what else to do.  I am neither a confrontational person, nor would I tell anyone to m.y.o.b..  <br/>\n<br/>\nPeople can be very judgmental and that doesn&#39;t bother me because I know my heart and my children&#39;s hearts too.  I don&#39;t care if they judge me but I am tired of their ignorance leading to me having to explain over and over.  <br/>\n<br/>\nIn your experience, after the first year of everyone asking what we are doing, does the hub nub die down or do they keep coming?<br/>\n<br/>\nPeace,<br/>\nCia</div>","specialLinks":[]}],"prevTopicId":68402,"nextTopicId":68429}}