{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":154575365,"authorName":"Laura Johnson","from":"&quot;Laura Johnson&quot; &lt;lauraj2@...&gt;","profile":"imakebelieve2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"sports was intro","postDate":"1093726601","msgId":98916,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwM2UwMWM0OGQ0MSQ4NTMwNmFmMCQ2ZjYzMDgwNEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PGNncTIzZSs4OHZxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":98915,"nextInTime":98917,"topicId":98916,"numMessagesInTopic":0,"msgSnippet":"My dh wasn t involved in team sports as a kid, his parents say they they were not joiner , so he didn t do any type of sports or lessons at all.  They were","messageBody":"<div id=\"ygrps-yiv-938521648\">My dh wasn&#39;t involved in team sports as a kid, his parents say they they were not &quot;joiner&quot;, so he didn&#39;t do any type of sports or lessons at all.  They were pretty involved in their own business and lives, not for reasons that had to do with him, he pretty much ran around on his own much of the time.  Anyhow, he played a lot of backyard or neighborhood sports with buddies and then in high school made the football team and wrestling team and did pretty well. So he didn&#39;t feel he missed out by not being involved sooner.  His only concern for our son is that we don&#39;t have a good neighborhood for him to run around and play in.  None of the kids are ever around, they are all in afterschool activities or childcare, plus some are pretty rough, so our ds won&#39;t have those same opportunities.  And without going to school, he won&#39;t have as many chances for meeting them.  And he admits that it isn&#39;t as safe to run loose like he did when he was a kid.  We live in a city.  But, he doesn&#39;t think that he needs the sports if he doesn&#39;t want them.  And would only have ds do sports if he were heavily involved in the whole thing as a coach or something to be sure the kids were treated right.  Our ds doesn&#39;t seem that interested in sports at this time.  And he&#39;s on the small side, I can&#39;t see him playing football, thank goodness.  We are looking into a gymnastics class, that he requested,  for homeschoolers.  But, he only wants to go with me there.  He&#39;s only 5, but most of our friend&#39;s kids have been doing sports since they were 2-3.  Yes, soccer for 2-3 year olds, they play games even with uniforms.  So, I do feel some pressure to get him into something.  <br/>\nLaura J<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":98909,"nextTopicId":98917}}