{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":29,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Yelling/ Being Rude (was Dealing with Family and  Different philosophies)","postDate":"1262357648","msgId":49346,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2RkM1N0Q5LTcwNjgtNDFDRC04QUJCLUZEM0ZENEEyRERCNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEQwREYxRDQ5LTU4QTItNEU0Ni04RjI0LTU1Q0U0MTM1QjRFMEBjb21jYXN0Lm5ldD4=","referencesHeader":"PGhoaDFiZCs1MGVrQGVHcm91cHMuY29tPiA8QzVEQzMzQUQtN0Y1Ny00RDMxLUJEMDQtNUZBMkIzRTU1RTAwQFNhbmRyYWRvZGQuY29tPiA8NzNjNzZjMGEwOTEyMzAyMzU1cTQwNWZjZjVkczg3NGY1YjNkNDNkY2Q5MmVAbWFpbC5nbWFpbC5jb20+IDxEMERGMUQ0OS01OEEyLTRFNDYtOEYyNC01NUNFNDEzNUI0RTBAY29tY2FzdC5uZXQ+"},"prevInTopic":49342,"nextInTopic":0,"prevInTime":49345,"nextInTime":49347,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"-=-When Michelle was little, we played she was a radio (guess you could do it with an iPod now) and turned down her volume knob. It was less obtrusive than","messageBody":"<div id=\"ygrps-yiv-258085435\">-=-When Michelle was little, we played she was a radio (guess you could<br/>\ndo it with an iPod now) and turned down her volume knob. It was less<br/>\nobtrusive than telling her to be quieter, especially when she couldnʻt<br/>\n(and maybe didnʻt want to &lt;g&gt;), really hear us anyway.-=-<br/>\n<br/>\nI would half-cover my ears and cringe as though I was in pain and  <br/>\nMarty would get quieter. &lt;g&gt;  That one still works.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Grades","postDate":"1262305823","msgId":49342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzM0M3QkVCLUI5NDYtNDE4RC1CRjBBLUQ0RUI0NkQzRjZEQ0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRCM0NGQzFBLjMwOTA1MDJAbWFjLmNvbT4=","referencesHeader":"PGhoaDlzNytsYThuQGVHcm91cHMuY29tPiA8NEIzQ0ZDMUEuMzA5MDUwMkBtYWMuY29tPg=="},"prevInTopic":49341,"nextInTopic":49346,"prevInTime":49341,"nextInTime":49343,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"-=-My goal was to do just the right amount of work to get the A, but not waste my time doing extra. I didn t think about learning for its own sake at all - not","messageBody":"<div id=\"ygrps-yiv-200585764\">-=-My goal was to do just the right amount of work to get the<br/>\nA, but not waste my time doing extra. I didn&#39;t think about learning for<br/>\nits own sake at all - not EVER. I only thought about what would be on<br/>\nthe test.-=-<br/>\n<br/>\nMy kids have seen this in co-workers, who learned in school that to do  <br/>\nmore than the bare minimum is to be a chump and a dope.  My kids will  <br/>\nwork harder and faster to satisfy themselves, to keep from being  <br/>\nbored, to see how efficiently they can do something, because they  <br/>\nhaven&#39;t been trained to stop when it&#39;s good enough just not to get  <br/>\nfired from the job.<br/>\n<br/>\nSometimes I think unschoolers are asking how much they &quot;have to do,&quot;  <br/>\nto be unschooling, and it seems like that same thing, as though  <br/>\nthey&#39;re afraid they could overshoot the goal.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Yelling/ Being Rude (was Dealing with Family and  Different philosophies)","postDate":"1262292785","msgId":49341,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwREYxRDQ5LTU4QTItNEU0Ni04RjI0LTU1Q0U0MTM1QjRFMEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDczYzc2YzBhMDkxMjMwMjM1NXE0MDVmY2Y1ZHM4NzRmNWIzZDQzZGNkOTJlQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhoaDFiZCs1MGVrQGVHcm91cHMuY29tPiA8QzVEQzMzQUQtN0Y1Ny00RDMxLUJEMDQtNUZBMkIzRTU1RTAwQFNhbmRyYWRvZGQuY29tPiA8NzNjNzZjMGEwOTEyMzAyMzU1cTQwNWZjZjVkczg3NGY1YjNkNDNkY2Q5MmVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":49340,"nextInTopic":49342,"prevInTime":49340,"nextInTime":49342,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"... When Michelle was little, we played she was a radio (guess you could do it with an iPod now) and turned down her volume knob. It was less obtrusive than","messageBody":"<div id=\"ygrps-yiv-2020150601\"><blockquote><span title=\"ireply\">&gt; I would love some ideas on how to help communicate to her that the  <br/>\n&gt; volume just needs to be a little<br/>\n&gt; lower or for her to move locations so that she understands what I&#39;m  <br/>\n&gt; telling<br/>\n&gt; her.  It&#39;s been a real problem with trying to get the baby to sleep  <br/>\n&gt; and<br/>\n&gt; there is a hyena in the room!  :)<br/>\n&gt;<br/>\n </span></blockquote>When Michelle was little, we played she was a radio (guess you could  <br/>\ndo it with an iPod now) and turned down her volume knob. It was less  <br/>\nobtrusive than telling her to be quieter, especially when she couldnʻt  <br/>\n(and maybe didnʻt want to &lt;g&gt;), really hear us anyway.<br/>\n<br/>\nI still make a gesture with my hands in front of me, parallel to the  <br/>\nfloor, going from high to low (meaning &quot;bring it down&quot;) and she  <br/>\nmodulates her voice right away. A very quiet &quot;shhh&quot; also helps.<br/>\n<br/>\nAt 14, sheʻs still loud - itʻs her natural voice. She recorded her  <br/>\nvoice recently and realized that what sounds like yelling to us, is  <br/>\nnot at all that way in her head. Good for all of us to know and  <br/>\nunderstand.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Grades","postDate":"1262291347","msgId":49340,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ1MTkyMi40NDE1NS5xbUB3ZWIxMTA0MTAubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRCM0NGQzFBLjMwOTA1MDJAbWFjLmNvbT4=","referencesHeader":"PGhoaDlzNytsYThuQGVHcm91cHMuY29tPiA8NEIzQ0ZDMUEuMzA5MDUwMkBtYWMuY29tPg=="},"prevInTopic":49339,"nextInTopic":49341,"prevInTime":49339,"nextInTime":49341,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"***There are some subject areas where the schools don t seem to mind giving lots of A s and B s --- but in most academic worlds (high school and college level,","messageBody":"<div id=\"ygrps-yiv-733220188\">***There are some subject areas where the schools don&#39;t seem to mind giving <br/>\nlots of A&#39;s and B&#39;s --- but in most academic worlds (high school and <br/>\ncollege level, at least), there is always an expectation of a certain <br/>\ngrade distribution.***<br/>\n <br/>\nI haven&#39;t been involved in a school system in a long time because I&#39;ve been really trying to live as if school didn&#39;t exist, but every once in a while it gets slammed into our lives and I do a bit of searching online.<br/>\n <br/>\nChamille&#39;s boyfriend was recently grounded from her because of failing a class.  This entire concept rocked Chamille&#39;s world, the fact that a person&#39;s very being could be seen as good or bad based on a letter grade, or percentage in a class given to another person by a complete stranger, then interpreted by a parent as somehow completely and absolutely about their child&#39;s character, good or bad.  Then to have the parent act on this and use it to discipline and guide the child to do it differently and somehow be &quot;good&quot; or better just added more confusion.  In her mind, if the grade itself was a system to measure or dole out rewards and punishments to get a student to do better, then shouldn&#39;t that be enough? <br/>\n <br/>\nWhat we&#39;ve found is that it rarely is.  Over and over, parents and schools push kids to get better grades, to do better, to be &quot;good&quot; within that system.  The reality is that it makes very little difference because the system itself isn&#39;t designed to work that way.  The high school that Chamille&#39;s boyfriend goes to is implementing this new program this year and like all new programs in schools, it&#39;s presented as this positive and wonderful thing to help student achieve better scores and get better grades so that the kids can be better people.  The wording is all peaches and roses.  The reality that the school faces is that 17%, an actual statistic from that high school, of all incoming freshman will fail a required class in that first year of high school.  Since the school is required to have a certain level of passing students to continue getting funding, then for that school, a 17% failure rate is pretty dismal indeed.<br/>\n <br/>\nSo they created a program called &quot;homework in the now&quot;, and guess where the burden always lies... with the student.  It&#39;s presented as this great program to give students who have failed a class a way to get their grade up.  Sounds ok on the surface, but this is what really happens... the students are forced to do a study hall during their lunch hour and if they miss it or are late it&#39;s counted against them and they get detentions or saturday school.  Each student gets about 5 min to get their lunch and take it to their study room.  Most of the students don&#39;t even have time to stand in line to get their lunch.  Not only that, it violates their own student handbook policy that clearly states that no student will be denied their lunch break.  Yet no kid is going to say anything because the school does this program without the parents knowledge or permission, unless the parent is really really aware of everything that goes on in school and I find that<br/>\n most parents don&#39;t.<br/>\n <br/>\nThe school even admits that it&#39;s not even aiming to eliminate failure, it&#39;s only looking to raise that 17% to 10%.  All those students get subjected to this &quot;homework in the now&quot; program thinking they have the potential to raise their grade and that they WILL raise their grade or stay in the program until they do, yet only a few, less than half are going to do that.  The rest of them just miss lunch for the entire year.<br/>\n <br/>\nThe conclusion that I always come to is that all these kids jump through hoops to meet benchmarks set up without even knowing that most of them won&#39;t make them.  Schools set kids up to fail, yet talk about creating successful future people.  I&#39;m so glad that I found unschooling and walked away from that system.  I try very hard to set my kids up to succeed!  It shows too!<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128961575,"authorName":"Vicki Dennis","from":"Vicki Dennis &lt;vicki@...&gt;","profile":"vickitexan2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Grades","postDate":"1262288865","msgId":49339,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5Y2ExYmJhMDkxMjMxMTE0N2s0YzliMWY4NHk0NjlhNzFlNzZhZDNjZTM2QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDRCM0NGQzFBLjMwOTA1MDJAbWFjLmNvbT4=","referencesHeader":"PGhoaDlzNytsYThuQGVHcm91cHMuY29tPiA8NEIzQ0ZDMUEuMzA5MDUwMkBtYWMuY29tPg=="},"prevInTopic":49338,"nextInTopic":49340,"prevInTime":49338,"nextInTime":49340,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"... Absolutely true across geography and time!.  I try to encourage my kids or anyone I advise that this inclination is one reason to not procrastinate....to","messageBody":"<div id=\"ygrps-yiv-143278530\">On Thu, Dec 31, 2009 at 1:31 PM, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;   partly it is bias on the part of the teacher (once the teacher thinks of<br/>\n&gt; you as a top student,<br/>\n&gt;<br/>\n&gt; turns out you can slack off a bit and they&#39;ll still grade you higher<br/>\n&gt; than other students),<br/>\n&gt;<br/>\n </span></blockquote>Absolutely true across geography and time!.  I try to encourage my kids or<br/>\nanyone I advise that this inclination is one reason to not<br/>\nprocrastinate....to not count on pulling it all together at the end.    Work<br/>\nvery, very, hard at the beginning of a course.   If it is a course that<br/>\nrequires &quot;papers&quot; then make sure the first paper &quot;blows them away&quot;.   If<br/>\nyour first paper is great then you can slide a long way on the last paper<br/>\nand still get an &quot;A&quot;.  In some cases I think the dirty little instructor<br/>\nsecret is that the last papers or &quot;term&quot; papers of &quot;good&quot; students aren&#39;t<br/>\neven read!.<br/>\n<br/>\nThe same can also apply to tests if there is ever any leeway on how it is<br/>\ngraded.  A student who &quot;usually&quot; does well on tests will often find that<br/>\nsome mercy points will be given even on objective test questions.<br/>\n<br/>\n<br/>\n  Vicki<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Grades","postDate":"1262287898","msgId":49338,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCM0NGQzFBLjMwOTA1MDJAbWFjLmNvbT4=","inReplyToHeader":"PGhoaDlzNytsYThuQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoaDlzNytsYThuQGVHcm91cHMuY29tPg=="},"prevInTopic":49337,"nextInTopic":49339,"prevInTime":49337,"nextInTime":49339,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"... There are some subject areas where the schools don t seem to mind giving lots of A s and B s --- but in most academic worlds (high school and college","messageBody":"<div id=\"ygrps-yiv-786207605\">On 12/30/2009 8:38 PM, Kathryn wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;    Anyway, we were advised that the percentage of students to get an &#39;A&#39; was, say, 20%, &#39;B&#39; say, 40%, etc, etc . . .<br/>\n<br/>\n </span></blockquote>There are some subject areas where the schools don&#39;t seem to mind giving <br/>\nlots of A&#39;s and B&#39;s --- but in most academic worlds (high school and <br/>\ncollege level, at least), there is always an expectation of a certain <br/>\ngrade distribution.<br/>\n<br/>\nBut, when students ask if a course is graded &quot;on a curve&quot; the answer is <br/>\nusually &quot;no.&quot; We don&#39;t just automatically give the top 10 percent an &quot;A&quot; <br/>\nand the next 20 percent a &quot;B.&quot;  That&#39;s not how it works - things are <br/>\nmuch more tricky than that.<br/>\n<br/>\nThe way it works, in reality, is that a teacher sets up a grading system <br/>\nbased on points earned or percentage of points earned. So, to an <br/>\nindividual student, it looks like if they can earn 90 percent of the <br/>\npossible points, they can get an A. True enough, on the surface.<br/>\n<br/>\nBut when we teachers turn in the grades for ALL the students, those <br/>\ngrades had better fall roughly into the expected grade distribution, or <br/>\nwe will be questioned or even called on the carpet or (in the case of <br/>\npart-time faculty) not re-hired.<br/>\n<br/>\nIn my field, and in most &quot;academic&quot; fields, the expected grade <br/>\ndistribution is something like 10 percent As, 20 percent B&#39;s, and 30 to <br/>\n50 percent C&#39;s and the rest D&#39;s and F&#39;s.  Nobody holds to these hard and <br/>\nfast, but woe to the teacher who would dare to give, say, 30 percent <br/>\nA&#39;s. Different schools and different departments may have different <br/>\ngrade distribution expectations, but they exist and those teachers who <br/>\ndon&#39;t follow them will hear about it from their dean or department head.<br/>\n<br/>\nFaculty have two ways to make sure our grades come reasonably close to <br/>\nthe expected distribution. First, just based on experience, we make the <br/>\nmaterial just difficult enough that we can expect the grades to fall <br/>\ninto the desired distribution. If we have a semester that the grades are <br/>\ntoo high, we make the tests a little harder. Second, a significant part <br/>\nof the grade is always subjective. By the time we are grading the <br/>\nsubjective part of the course, it is usually a term paper of some sort, <br/>\nwe already can see how the grades are turning out and we can grade <br/>\nharder or easier depending on if we think too many people are getting <br/>\ntoo high or too low grades. Many teachers have a &quot;participation&quot; <br/>\ncomponent to their grading, too, which is subjective. In my courses, the <br/>\nmaterial is very difficult and I give extra credit to help students <br/>\nraise their grades. I can control how much extra credit I offer in such <br/>\na way that I can move about 10 percent of the students into the A&#39;s and <br/>\nabout 20 percent into the B&#39;s.<br/>\n<br/>\nThis is the reality of every college I have ever worked for - and I&#39;ve <br/>\nworked at a LOT of them -- maybe 15 different colleges over the past <br/>\n30-plus years.<br/>\n<br/>\nSo - it will usually be worked out just as if it had been graded on a <br/>\ncurve, but there will be the illusion that every student in the class <br/>\ncould earn an A.<br/>\n<br/>\nMy kids understand this system very well, having grown up with a parent <br/>\nteaching college courses and hanging out at colleges their whole lives. <br/>\nThey don&#39;t take grades very seriously in the sense that they don&#39;t <br/>\nbelieve in the slightest that the grade reflects what they have truly <br/>\n&quot;gotten out of&quot; the course. They totally separate &quot;learning&quot; from <br/>\n&quot;grading.&quot; They understand very well that the grade measures something <br/>\ndifferent - partly it is psyching out the teacher and guessing what will <br/>\nbe on the tests, partly it is how much time you spend on detail - the <br/>\nkind of minutia that IS so often asked on tests, party it is bias on the <br/>\npart of the teacher (once the teacher thinks of you as a top student, <br/>\nturns out you can slack off a bit and they&#39;ll still grade you higher <br/>\nthan other students), A big chunk of good grades is being very very very <br/>\ncareful to fully follow directions. Some of good grades is just good <br/>\ntest-taking. Some of it is willingness to be bored - to study the stuff <br/>\nthat is going to be on the test, rather than focusing on learning what <br/>\nseems interesting and important.<br/>\n<br/>\nSandra, I think, said something earlier in this conversation about how <br/>\nunschooled kids can go to college and be more able to withstand a system <br/>\nof grades, etc., all the school stuff they&#39;ve not had to deal with as <br/>\nunschoolers. That has been our experience. However, I do think <br/>\nunschooling parents should be aware that, yes, going to college DOES <br/>\nmean stepping into that school-think world and should help their kids <br/>\nanalyze it and consider how they want to approach it.<br/>\n<br/>\nWhen Roya (now 25 yo) was a student at Cal State Long Beach, she was <br/>\nstudying with a group of friends and she told me later that she&#39;d gotten <br/>\na little exasperated with them and told them that if they&#39;d think more <br/>\nabout what they could learn in the class and less about grades, that the <br/>\ngrades would be better. She said they were distracted and unfocused <br/>\nbecause they were constantly worrying about grades.<br/>\n<br/>\nI took a college class last semester just for fun - I took ASL, which is <br/>\ntaught as a foreign language course.  I was very much enjoying the <br/>\ncourse and then, suddenly, it was time for the first test and I was <br/>\ntaken by surprise at how much tension that created. I had to talk myself <br/>\ndown, a couple of times, from being anxious over it. I had to remind <br/>\nmyself that I was there to learn ASL, not to get a grade for taking a <br/>\nclass in ASL. That was a very very different attitude than I had had <br/>\nwhen I was an actual college student. So I talked to myself, reminded <br/>\nmyself that the test was a good time to review and sort of intensely <br/>\npractice all that we&#39;d covered so far - I got myself to use the occasion <br/>\nof a test to focus a little more on what I was learning. It worked and, <br/>\nyes, I probably got an A in the course, but, to be honest, I haven&#39;t <br/>\neven gone to my school account to check my grade because I really did <br/>\ntalk myself into NOT thinking about it and, I keep forgetting to check.<br/>\n<br/>\nWhen I was a college and graduate school student, I thought about grades <br/>\nall the time. My goal was to do just the right amount of work to get the <br/>\nA, but not waste my time doing extra. I didn&#39;t think about learning for <br/>\nits own sake at all - not EVER. I only thought about what would be on <br/>\nthe test.<br/>\n<br/>\nUnschooling helped ME get over this awful attitude. My kids don&#39;t have <br/>\nto get over it - they don&#39;t have it to start with. They do care about <br/>\ntheir college grades, but for completely rational reasons - they see <br/>\ngrades for what they are and good grades can get you things <br/>\n(scholarships, good driver car insurance discounts, etc). They don&#39;t at <br/>\nALL see grades as reflections of their value as a person or even as <br/>\nreflections of how much they&#39;ve learned in the class.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Family and Different philosophies","postDate":"1262285572","msgId":49337,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCM0NGMzA0LjMwMDAzMDlAbWFjLmNvbT4=","inReplyToHeader":"PGhoaDM0MCtjM2RuQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoaDM0MCtjM2RuQGVHcm91cHMuY29tPg=="},"prevInTopic":49333,"nextInTopic":49338,"prevInTime":49336,"nextInTime":49338,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"... Maybe you can switch the focus to the positives of what they get from their grandparents. You could do it kind of subtly, perhaps, by just making little","messageBody":"<div id=\"ygrps-yiv-380786248\">On 12/30/2009 6:43 PM, kelly_sturman wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I think shorter and fewer visits with the extended family are<br/>\n&gt; necessary.  It&#39;s too bad.  It really is.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Maybe you can switch the focus to the positives of what they get from <br/>\ntheir grandparents. You could do it kind of subtly, perhaps, by just <br/>\nmaking little comments about the importance of grandparents to kids - <br/>\nand throw in there how it is so great to have grandparents because THEY <br/>\ndon&#39;t pressure their grandkids, they just love them so unconditionally, <br/>\netc. Mention the special relationship between grandparents and <br/>\ngrandchildren, how nice it must be not to have to WORRY about them, just <br/>\nlove and enjoy them as they are. Stuff like that.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":216682108,"authorName":"Claudia","from":"Claudia &lt;paxxie@...&gt;","profile":"aquacat59","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Yelling/ Being Rude (was Dealing with Family and \tDifferent philosophies)","postDate":"1262267280","msgId":49333,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhhM2ViM2UwOTEyMzEwNTQ4dDM5M2E5NDg5bjQ3YTM4NzVkMDE3YzhhYjhAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PEM1REMzM0FELTdGNTctNEQzMS1CRDA0LTVGQTJCM0U1NUUwMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhoaDFiZCs1MGVrQGVHcm91cHMuY29tPgkgPEM1REMzM0FELTdGNTctNEQzMS1CRDA0LTVGQTJCM0U1NUUwMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49332,"nextInTopic":49337,"prevInTime":49332,"nextInTime":49334,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"2009/12/31 Sandra Dodd  ... I used to say something like: Oh!!! You want me to get up from this cosy sofa,  watching tv, and walk to the","messageBody":"<div id=\"ygrps-yiv-1043863904\">2009/12/31 Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; -=-Ezabella just turned 4 and is usually polite, but more lately,<br/>\n&gt; she&#39;s been acting kind of rude. Things like &quot;GET ME SOME FOOD!&quot;<br/>\n&gt;<br/>\n&gt; -=-I&#39;ve been responding by saying things like &quot;You&#39;re being rude. Try<br/>\n&gt; again&quot; and she almost always turns on a sweet voice and says &quot;Get me<br/>\n&gt; some food please.&quot;-=-<br/>\n&gt;<br/>\n&gt; I think humor is fine, if all involved are in the mood for it. Or<br/>\n&gt; plain old information. I used to remind my kids variously, different<br/>\n&gt; times, of things like that people would like to do things for them<br/>\n&gt; more if they were nice, or that if they used that tone with people<br/>\n&gt; they might not have many friends. Not in a mean or threatening way,<br/>\n&gt; but in a matter-of-fact way.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I used to say something like:<br/>\n<br/>\nOh!!! You want me to get up from this cosy sofa,  watching tv, and walk to<br/>\nthe kitchen, and take a glass out, and fill it with orange juice and bring<br/>\nit here!!! Well!!! I&#39;d feel MUCH MORE motivated to do that if you asked me<br/>\ndifferently!<br/>\n<br/>\n:)<br/>\n<br/>\nClaudia<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Yelling/ Being Rude (was Dealing with Family and  Different philosophies)","postDate":"1262260279","msgId":49332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxNjEzM0RELUUxMTctNDI1OS1BRUMwLUUwRkFFRThBMEM1QkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDczYzc2YzBhMDkxMjMwMjM1NXE0MDVmY2Y1ZHM4NzRmNWIzZDQzZGNkOTJlQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhoaDFiZCs1MGVrQGVHcm91cHMuY29tPiA8QzVEQzMzQUQtN0Y1Ny00RDMxLUJEMDQtNUZBMkIzRTU1RTAwQFNhbmRyYWRvZGQuY29tPiA8NzNjNzZjMGEwOTEyMzAyMzU1cTQwNWZjZjVkczg3NGY1YjNkNDNkY2Q5MmVAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":49331,"nextInTopic":49333,"prevInTime":49331,"nextInTime":49333,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"-=-My daughter gets extremely carried away with giggling and cackling and is so loud it literally hurts my ears. I try telling her that but how can she hear me","messageBody":"<div id=\"ygrps-yiv-1311557443\">-=-My daughter gets extremely carried away with giggling and<br/>\ncackling and is so loud it literally hurts my ears. I try telling her  <br/>\nthat<br/>\nbut how can she hear me over the cackling? &lt;g&gt; I would love some ideas  <br/>\non<br/>\nhow to help communicate to her that the volume just needs to be a little<br/>\nlower or for her to move locations so that she understands what I&#39;m  <br/>\ntelling<br/>\nher. It&#39;s been a real problem with trying to get the baby to sleep and<br/>\nthere is a hyena in the room! :)-=-<br/>\n<br/>\nSometimes talking softly to the person helps bring the volume back  <br/>\ndown.  It&#39;s hard for some people (me, sometimes) to know they&#39;ve  <br/>\ngotten really loud.  Keith and Marty are both bad about that, and  <br/>\nthey&#39;re way older than four.    Some people are louder than others.<br/>\n<br/>\nSome families have the concept of &quot;indoor voice&quot; or &quot;library  <br/>\nvoice&quot; (though libraries aren&#39;t as quiet as they used to be).<br/>\n<br/>\nModelling and discussing being quiet when it&#39;s not about her or the  <br/>\nbaby might help, gradually.  I used to find times to say &quot;Let&#39;s be  <br/>\nextra quiet, because it&#39;s still early,&quot; or &quot;Dad&#39;s sleeping--could you  <br/>\nplay with soft stuff instead?&quot;   And sometimes I&#39;d say it when we were  <br/>\nout and about, not always at the house.   Playing at a park in broad  <br/>\ndaylight, screaming and yelling is not bad.  Walking the dog at night,  <br/>\nwe&#39;d talk quietly.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":311075098,"authorName":"Mandy Ray-Jones","from":"Mandy Ray-Jones &lt;shebrakes4rainbows@...&gt;","profile":"shebrakes4rainbows","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Yelling/ Being Rude (was Dealing with Family and \tDifferent philosophies)","postDate":"1262246103","msgId":49331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDczYzc2YzBhMDkxMjMwMjM1NXE0MDVmY2Y1ZHM4NzRmNWIzZDQzZGNkOTJlQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEM1REMzM0FELTdGNTctNEQzMS1CRDA0LTVGQTJCM0U1NUUwMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhoaDFiZCs1MGVrQGVHcm91cHMuY29tPgkgPEM1REMzM0FELTdGNTctNEQzMS1CRDA0LTVGQTJCM0U1NUUwMEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49330,"nextInTopic":49332,"prevInTime":49330,"nextInTime":49332,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"Emily, My daughter turns 4 tomorrow (sniff ;)) and we have the same issue.  I just wanted to add that I say to her, Maybe you could try asking in a nicer ","messageBody":"<div id=\"ygrps-yiv-1406655223\">Emily,<br/>\nMy daughter turns 4 tomorrow (sniff ;)) and we have the same issue.  I just<br/>\nwanted to add that I say to her, &quot;Maybe you could try asking in a nicer<br/>\nvoice?&quot; or &quot;Will you try nicer words, please?&quot; or something of that nature<br/>\nand it works.  And we use humor at times too.  Like reflecting back to her<br/>\nwhat she has said.  &quot;Hey, get me some food!!&quot;  &quot;Hey, give me some kisses!&quot;<br/>\nEveryone laughs, all is well, she asks in a more appropriate way.<br/>\n<br/>\nPerhaps you, or someone else here, may have some advice for dealing with<br/>\nVOLUME issues?  My daughter gets extremely carried away with giggling and<br/>\ncackling and is so loud it literally hurts my ears.  I try telling her that<br/>\nbut how can she hear me over the cackling?  &lt;g&gt;  I would love some ideas on<br/>\nhow to help communicate to her that the volume just needs to be a little<br/>\nlower or for her to move locations so that she understands what I&#39;m telling<br/>\nher.  It&#39;s been a real problem with trying to get the baby to sleep and<br/>\nthere is a hyena in the room!  :)<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Dec 30, 2009 at 8:53 PM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-Ezabella just turned 4 and is usually polite, but more lately,<br/>\n&gt; she&#39;s been acting kind of rude. Things like &quot;GET ME SOME FOOD!&quot;<br/>\n&gt;<br/>\n&gt; -=-I&#39;ve been responding by saying things like &quot;You&#39;re being rude. Try<br/>\n&gt; again&quot; and she almost always turns on a sweet voice and says &quot;Get me<br/>\n&gt; some food please.&quot;-=-<br/>\n&gt;<br/>\n&gt; I think humor is fine, if all involved are in the mood for it. Or<br/>\n&gt; plain old information. I used to remind my kids variously, different<br/>\n&gt; times, of things like that people would like to do things for them<br/>\n&gt; more if they were nice, or that if they used that tone with people<br/>\n&gt; they might not have many friends. Not in a mean or threatening way,<br/>\n&gt; but in a matter-of-fact way.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nMandy Ray-Jones<br/>\nArtsy Mamas Executive Director and Founder<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://artsymamas.org/\">http://artsymamas.org/</a><br/>\nChild of God, Supermom, Wife, Natural Learning Facilitator, Aspiring Natural<br/>\nNutritionist, Truth Seeker, Lover of Life, Friend, and Geeky Blogger<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.bonafidemama.com/\">http://www.bonafidemama.com/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":141243160,"authorName":"Kathryn","from":"&quot;Kathryn&quot; &lt;kathryndubay@...&gt;","profile":"observeandlearn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dealing with Family and Different philosophies","postDate":"1262234311","msgId":49330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoaDlzNytsYThuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyMzc1NS4zNzExMi5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49329,"nextInTopic":49331,"prevInTime":49329,"nextInTime":49331,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"... Not every student can receive an A , administrators frown on that... if everyone got A s, then A s would lose their value and a new system for student","messageBody":"<div id=\"ygrps-yiv-923635105\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Jenny Cyphers &lt;jenstarc4@...&gt; wrote:<br/>\n<br/>\n&quot;Not every student can receive an &quot;A&quot;, administrators frown on that... if everyone got A&#39;s, then A&#39;s would lose their value and a new system for student measurement would need to be invented.&quot;<br/>\n<br/>\n<br/>\nWow -- flashback!!  Here in the State of Victoria, Australia, when I was in Year 11, 1990 (16?) the HSC (High School Certificate) went through administrative changes to become the VCE (Victorian Education Certificate).  I remember we were told we were the &#39;guinea pigs&#39; of higher school education.  Anyway, we were advised that the percentage of students to get an &#39;A&#39; was, say, 20%, &#39;B&#39; say, 40%, etc, etc . . . you get the picture.  This does not/did not make sense!!  As students, we pondered just what Would happen if All students did extrememly well.  We determined to not bother trying to excel, as Others would be Chosen above us; those Usually in the top 20%, that is.  Most importantly, we were Well Aware that it had all become a numbers game -- our individuality had been overided.  Sad.<br/>\n<br/>\nKathryn D<br/>\nx<br/>\n<br/>\n<br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Yelling/ Being Rude (was Dealing with Family and Different philosophies)","postDate":"1262228029","msgId":49329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEM1REMzM0FELTdGNTctNEQzMS1CRDA0LTVGQTJCM0U1NUUwMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhoaDFiZCs1MGVrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoaDFiZCs1MGVrQGVHcm91cHMuY29tPg=="},"prevInTopic":49328,"nextInTopic":49330,"prevInTime":49328,"nextInTime":49330,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"-=-Ezabella just turned 4 and is usually polite, but more lately, she s been acting kind of rude. Things like GET ME SOME FOOD! -=-I ve been responding by","messageBody":"<div id=\"ygrps-yiv-2030095789\">-=-Ezabella just turned 4 and is usually polite, but more lately,  <br/>\nshe&#39;s been acting kind of rude. Things like &quot;GET ME SOME FOOD!&quot;<br/>\n<br/>\n-=-I&#39;ve been responding by saying things like &quot;You&#39;re being rude. Try  <br/>\nagain&quot; and she almost always turns on a sweet voice and says &quot;Get me  <br/>\nsome food please.&quot;-=-<br/>\n<br/>\nI think humor is fine, if all involved are in the mood for it.   Or   <br/>\nplain old information.  I used to remind my kids variously, different  <br/>\ntimes, of things like that people would like to do things for them  <br/>\nmore if they were nice, or that if they used that tone with people  <br/>\nthey might not have many friends.  Not in a mean or threatening way,  <br/>\nbut in a matter-of-fact way.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":381959449,"authorName":"kelly_sturman","from":"&quot;kelly_sturman&quot; &lt;conspicuousfamily@...&gt;","profile":"kelly_sturman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dealing with Family and Different philosophies","postDate":"1262227392","msgId":49328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoaDM0MCtjM2RuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyMzc1NS4zNzExMi5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49327,"nextInTopic":49329,"prevInTime":49327,"nextInTime":49329,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"... The thing is, if my kids were in school, they *would* be getting the straight As.  (Never mind that they would be miserable.) So my kids grandparents are","messageBody":"<div id=\"ygrps-yiv-561209312\"><blockquote><span title=\"ireply\">&gt; You can turn that around you know.  Ask how many kids pass every class every year, ask for specific statistics.  Your kids should not be held up to the top 1% of every school child out there.  I hope that you weren&#39;t when you were a child!  Remember that for every child that gets an &quot;A&quot; in a subject in school there is a polar opposite or barely passing child in that very same class.  Not every student can receive an &quot;A&quot;, administrators frown on that... if everyone got A&#39;s, then A&#39;s would lose their value and a new system for student measurement would need to be invented.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>The thing is, if my kids were in school, they *would* be<br/>\ngetting the straight As.  (Never mind that they would be miserable.)<br/>\nSo my kids&#39; grandparents are sure I am wasting their childhoods, setting them up for failure in later life, and all that.  In<br/>\ntheir minds, being the ones getting the straight As is the whole<br/>\npoint of going to school, and they are sure that this is the only<br/>\npath to a happy life.<br/>\n<br/>\nI keep reading Amy Childs essay about her teen son, and his path<br/>\nto his MBA, and more importantly, about how her faith in him<br/>\nallowed their relationship to blossom through those teen years,<br/>\nand so much of that essay rings true for me.  But that same essay<br/>\nwould make no sense to my parents and my in-laws.<br/>\n<br/>\nI think shorter and fewer visits with the extended family are<br/>\nnecessary.  It&#39;s too bad.  It really is.<br/>\n<br/>\nKelly Sturman</div>","specialLinks":[]},{"userId":324049237,"authorName":"Emily S","from":"&quot;Emily S&quot; &lt;saturnfire16@...&gt;","profile":"saturnfire16","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Yelling/ Being Rude (was Dealing with Family and Different philosophies)","postDate":"1262225581","msgId":49327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoaDFiZCs1MGVrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEwNDYwNS40MTE0OS5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":49324,"nextInTopic":49328,"prevInTime":49326,"nextInTime":49328,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"I m glad you wrote that, because I was just about to come here and ask a question about how to handle rudeness.  Ezabella just turned 4 and is usually polite,","messageBody":"<div id=\"ygrps-yiv-1804638953\">I&#39;m glad you wrote that, because I was just about to come here and ask a question about how to handle rudeness.  Ezabella just turned 4 and is usually polite, but more lately, she&#39;s been acting kind of rude.  Things like &quot;GET ME SOME FOOD!&quot; <br/>\n<br/>\nI&#39;ve been responding by saying things like &quot;You&#39;re being rude.  Try again&quot; and she almost always turns on a sweet voice and says &quot;Get me some food please.&quot;<br/>\n<br/>\nI&#39;ve also said things like, &quot;How about, &#39;I&#39;m hungry, I need some food please&#39;&quot; or some other script. <br/>\n<br/>\nOr it&#39;s been happening so much lately that at this point I can just say &quot;I need some food please mom&quot; and she&#39;ll repeat back &quot;I need some food please mom.&quot;   <br/>\n<br/>\nOr sometimes, depending on everyone&#39;s mood, I&#39;ll just be playful and say &quot;Food?  No way!&quot; (which totally doesn&#39;t come across right in writing, but it&#39;s totally playful and she giggles and then acts nicer).<br/>\n<br/>\nI&#39;ve also said &quot;I cannot understand you when you&#39;re whinning.&quot;<br/>\n<br/>\nSo, on the one hand, I think maybe I&#39;m not handling this well.  I always hated when my mom critisized anything I said.  For now, Ezabella doesn&#39;t seem to mind.  I try to either be lighthearted about it or sometimes if she&#39;s being really rude I&#39;ll use my serious mom voice.  She almost always changes her tone or words.  But lately we&#39;ve been going through this every day, sometimes a few times a day, and I&#39;m afraid that it is going to cause resentment about me always &quot;correcting&quot; her.  <br/>\n<br/>\nOn the other hand, I think that I&#39;m handling it well.  I&#39;m not punishing her, I don&#39;t withhold anything, in fact I&#39;m usually getting up to get her what she wants as I&#39;m reminding her to ask nicely.  I&#39;m not mean about it, but I am firm sometimes especially if she does it to someone else.  <br/>\n<br/>\nWhat do you all think?<br/>\n<br/>\nEmily<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Jenny Cyphers &lt;jenstarc4@...&gt; wrote:<br/>\n&gt;&gt;  <br/>\n&gt; Chamille never really did that, but Margaux has always done that.  She&#39;s getting better about it as she gets older, but she demands things from everyone around her and sometimes it really isn&#39;t nice.  I will almost always say something, like, &quot;you are being really bossy, maybe next time ask nicer.&quot; or &quot;when you demand and yell at me like that, it makes me feel less like jumping up and helping you do something that I would otherwise be very happy to help you with.&quot;.  If she&#39;s really upset, and she does a 180 turn around in less than 30 sec sometimes, it&#39;s better to not say anything in the moment, help her out, do whatever it is she&#39;s asking for, kindly, get her in a better space, THEN say something about how to deal with that better next time.<br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Family and Different philosophies","postDate":"1262211925","msgId":49324,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwNEQ5REIyLTEyQzktNDU0Ri1CNEZFLUY1MjkxRDQ2MTIzMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhoZzI2bytqMXAxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoZzI2bytqMXAxQGVHcm91cHMuY29tPg=="},"prevInTopic":49323,"nextInTopic":49327,"prevInTime":49323,"nextInTime":49325,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"-=-My in-laws are so anti-homeschooling, esp. RU-=- Please don t refer to it as RU.  On this list, please say unschooling.  And if in your mind, in your","messageBody":"<div id=\"ygrps-yiv-1427510545\">-=-My in-laws are so anti-homeschooling, esp. RU-=-<br/>\n<br/>\nPlease don&#39;t refer to it as &quot;RU.&quot;  On this list, please say  <br/>\n&quot;unschooling.&quot;  And if in your mind, in your thoughts, you think  <br/>\n&quot;unschooling&quot; instead of &quot;RU&quot; or &quot;radical unschooling,&quot; I think it  <br/>\nwill settle down some of the drama and angst and antagonism.<br/>\n<br/>\n-=- She just doesn&#39;t get it, so I just smile, knod my head and say  <br/>\nokay, thanks for the advice. Then go on my merry way.-=-<br/>\n<br/>\nThat&#39;s good when people can pull it off.<br/>\n<br/>\nIf people go on their merry way (they think) but the way is really a  <br/>\ntrail of grumbling and resentment, that too will mar the unschooling.<br/>\n<br/>\nFor the general question, maybe shorter and less frequent visits to  <br/>\nprofessional educators and child psychologists and school board  <br/>\nmembers (current or past) who happen to also be relatives would take  <br/>\nsome of the pressure off everyone.  It can&#39;t be easy for the  <br/>\nrelatives, either, if they see you as people who &quot;strongly disagree  <br/>\nand don&#39;t want to learn from them.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Family and Different philosophies","postDate":"1262204945","msgId":49318,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyMzc1NS4zNzExMi5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGhoZjFtYStmbmNvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoZjFtYStmbmNvQGVHcm91cHMuY29tPg=="},"prevInTopic":49317,"nextInTopic":49323,"prevInTime":49317,"nextInTime":49319,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"***Two kids are working above grade level (according to their age, according to what grade they d be placed in public school), in several subject areas.","messageBody":"<div id=\"ygrps-yiv-2060166496\">***Two kids are working &quot;above grade level&quot; (according to their age,<br/>\naccording to what grade they&#39;d be placed in public school), in<br/>\nseveral subject areas. (This is not a matter we focus on at home, <br/>\nbut it matters to the relatives.) Still, the relatives focus on where the kids are &quot;below grade level.&quot; I point out that the two <br/>\nof the four kids have &quot;skipped&quot; grades because of high test scores <br/>\non year-end standardized tests--there&#39; s no point in arguing that those tests are ridiculous-- but still, all they can focus on are <br/>\nthe areas where they think the kids should be doing more, doing better. ***<br/>\n <br/>\nYou can turn that around you know.  Ask how many kids pass every class every year, ask for specific statistics.  Your kids should not be held up to the top 1% of every school child out there.  I hope that you weren&#39;t when you were a child!  Remember that for every child that gets an &quot;A&quot; in a subject in school there is a polar opposite or barely passing child in that very same class.  Not every student can receive an &quot;A&quot;, administrators frown on that... if everyone got A&#39;s, then A&#39;s would lose their value and a new system for student measurement would need to be invented.<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Family and Different philosophies","postDate":"1262204377","msgId":49317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4NzY0MC4zMTk5MS5xbUB3ZWIxMTA0MDQubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDRCM0FFNUZGLjgwOTAzMDhAbWFjLmNvbT4=","referencesHeader":"PGhoZTB2ZiszazUxQGVHcm91cHMuY29tPiA8OEY0MkY3NEMtOTI2OS00Njg4LUEwRDItREJCQkEyQjE4RjI2QFNhbmRyYWRvZGQuY29tPiA8NEIzQUU1RkYuODA5MDMwOEBtYWMuY29tPg=="},"prevInTopic":49306,"nextInTopic":49318,"prevInTime":49316,"nextInTime":49318,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"***Is there anybody here with an 18 yo or older who doesn t feel like at least some of what they worried about was really unnecessary and that some of what","messageBody":"<div id=\"ygrps-yiv-577291605\">***Is there anybody here with an 18 yo or older who doesn&#39;t feel like at <br/>\nleast some of what they worried about was really unnecessary and that <br/>\nsome of what they thought was really important was really not?***<br/>\n<br/>\nI parent Margaux differently than I parented Chamille because of this!  They are 7 yrs apart, enough for me to know more and see things in a different light.  There were things I worried about with Chamille that I just simply don&#39;t worry about with Margaux, because there are bigger things in life than those weird things like what a movie is rated and how late a child stays up at night, or whether she reads by the age of &quot;whatever&quot;.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":304763189,"authorName":"cookiesforthree@verizon.net","from":"&quot;cookiesforthree@...&quot; &lt;cookiesforthree@...&gt;","profile":"cookiesforthree@verizon.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dealing with Family and Different philosophies","postDate":"1262193688","msgId":49323,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZzI2bytqMXAxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDMyNDA5MDIzLUVBMTgtNDAwRS1CRkM1LTk2Mzc1M0REQkUxMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49318,"nextInTopic":49324,"prevInTime":49322,"nextInTime":49324,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"My in-laws are so anti-homeschooling, esp. RU.  My mother in law is just a disagreeable person anhyow.  With the exeception of her negativity towards RU, she","messageBody":"<div id=\"ygrps-yiv-1341198554\">My in-laws are so anti-homeschooling, esp. RU.  My mother in law is just a disagreeable person anhyow.  With the exeception of her negativity towards RU, she is a very loving Grandma to my kids and they love to spend time with her.  When she grills my kids about what they are &quot;learning&quot;,  can they read yet, what math are you doing... I have just told my kids to answer whatever they will or they can just say, &quot;Ask my Mom&quot; and I will be more than happy to handle it for them.<br/>\n<br/>\nMy mother in law has mostly given up buggin us about it.  Yipee.<br/>\n<br/>\nMy sister in law, who just graduated with a masters in child physcology, and has no children of her own.... likes to make little comments to me about how my kids need STRUCTURE and more sit down learning time.  Whoa to the family that gets her as their advisor...<br/>\n<br/>\nShe also says that we baby our kids and is appauled that our 2 littlest still sleep in our room (8 & 10).  My oldest moved out of our room around 10 because he wanted his own space.  I once tried to explain why we allow our kids to be with us all the time and how much we love spending time with them and how much they love spending time with us.  She just doesn&#39;t get it, so I just smile, knod my head and say okay, thanks for the advice.  Then go on my merry way.  I feel so sad for her when she has her children, most of her parenting advice will be so dispelled.  Or the poor kids will be really f.ed up, how sad.<br/>\n<br/>\nAs for me and mine, we just continue on our adventure allowing ourselves to learn through life and just smile and pass over others who strongly disagree and don&#39;t want to learn from us.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Family and Different philosophies","postDate":"1262186112","msgId":49306,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyNDA5MDIzLUVBMTgtNDAwRS1CRkM1LTk2Mzc1M0REQkUxMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEQyRURCQTE1LUQxRDEtNDJERS04QTU0LUNBOUEyNDZEQzUwQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhoZjFtYStmbmNvQGVHcm91cHMuY29tPiA8RDJFREJBMTUtRDFEMS00MkRFLThBNTQtQ0E5QTI0NkRDNTBBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":49305,"nextInTopic":49317,"prevInTime":49305,"nextInTime":49307,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"I should also say, of me and family differences, that I ve been a confident person since I was a kid, and willing to talk back, or to press a logical point.","messageBody":"<div id=\"ygrps-yiv-835565503\">I should also say, of me and family differences, that I&#39;ve been a  <br/>\nconfident person since I was a kid, and willing to &quot;talk back,&quot; or to  <br/>\npress a logical point.  I&#39;m not cutthroat and not out to shame anyone,  <br/>\nI&#39;m just aware of my own space and when they&#39;ve crossed the line, and  <br/>\nwhen I had kids I included them in &quot;my space&quot; rather than expecting  <br/>\nthem to fend for themselves.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Family and Different philosophies","postDate":"1262186037","msgId":49305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzMjI2REQ2LUJEMzYtNDMyMi1BMTEyLTE1QTc3NjBBQUQwNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEQyRURCQTE1LUQxRDEtNDJERS04QTU0LUNBOUEyNDZEQzUwQUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhoZjFtYStmbmNvQGVHcm91cHMuY29tPiA8RDJFREJBMTUtRDFEMS00MkRFLThBNTQtQ0E5QTI0NkRDNTBBQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":49304,"nextInTopic":49306,"prevInTime":49304,"nextInTime":49306,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"Sorry I sent a blank.   I  meant to ask, when you said you weren t out as unschoolers, did that mean your family didn t know you were unschooling? The way I","messageBody":"<div id=\"ygrps-yiv-1256189351\">Sorry I sent a blank.   I  meant to ask, when you said you weren&#39;t out  <br/>\nas unschoolers, did that mean your family didn&#39;t know you were  <br/>\nunschooling?<br/>\n<br/>\nThe way I dealt with not arguing with my in-laws was kind of like  <br/>\nJoyce&#39;s how do you lift a bell?  Build a foundation.  But I didn&#39;t  <br/>\nknow I was doing it.<br/>\n<br/>\nWhen Kirby was days old, his grandmother (a nurse) came to visit and I  <br/>\noffered to let her change him (which I thought would be sweet, but she  <br/>\nacted like it was supid), and when she came back she said &quot;You have to  <br/>\nget him circumcised.&quot;  Not in a friendly way.  In a &quot;no question about  <br/>\nit&quot; way.  Like we were ignorant parents.<br/>\n<br/>\nI said we had decided not to and that we had read a lot about it  <br/>\nbefore we decided.   She clearly showed disdain, and I asked her if  <br/>\nshe wanted to read what we had read (me very nicely, her kind snorty  <br/>\nand eye-rolling).  She said &quot;I&#39;ll read it, but it&#39;s not going to  <br/>\nchange my mind.&quot;<br/>\n<br/>\nSo I put sticky notes in three or four books, on the circumcision  <br/>\nsection, and she took them overnight (they were trailer camping  <br/>\nnearby, on their way back from Alaska, to Alamogordo).<br/>\n<br/>\nThe next day she brought them back and set them very quietly, gently,  <br/>\n*respectfully* on the table where she got them and said &quot;Well things  <br/>\nhave changed since I went to nursing school.&quot;<br/>\n<br/>\nAnd I didn&#39;t say &quot;NO SHIT, SHIRLEY!&quot;   And I never said any harsh  <br/>\nthing to her, ever, and she never did die until this year.<br/>\n<br/>\nWhen Kirby didn&#39;t go to school, she asked, and I said we read a lot  <br/>\nabout it and did she want to read what we had read.  Same tone of  <br/>\nvoice, like I was quoting myself, but not sarcastically at all.  And  <br/>\nshe said no, that&#39;s okay, thanks or something, but  nicely.<br/>\n<br/>\nWhen he was seven or so she asked if we were going to get him tested.   <br/>\nWe were at a restaurant; all the kids were at the table.  I said no.   <br/>\nShe asked how would we know if he was behind.   I said I was sure he  <br/>\nWAS behind in some areas, and that he was ahead in some other ones.  I  <br/>\nsaid kids at school are behind in some things and ahead in others, and  <br/>\nI put food in my mouth, and she didn&#39;t say anything else.<br/>\n<br/>\nMy mantra, though, when people would express vague misgivings or want  <br/>\nto talk about it, was that if this stopped working we could put them  <br/>\nin school.<br/>\n<br/>\nTo schoolteacher friends, though, I would say cheerily that if this  <br/>\ndidn&#39;t work we could always put him in special ed and they&#39;d get him  <br/>\nall caught up.  They&#39;d sputter (or spit, if they had coffee in their  <br/>\nmouths &lt;g&gt;) and laugh, because they knew and they  knew that I knew  <br/>\nthat special ed does not &quot;get kids all caught up.&quot;  One of those  <br/>\nfriends was an award-winning, master&#39;s degree special ed teacher,  <br/>\ntoo.  She got it, when I said that.<br/>\n<br/>\nI&#39;d also sometimes remind them that there was a school within walking  <br/>\ndistance, and it was free, and he could go there if he wanted to.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Family and Different philosophies","postDate":"1262185104","msgId":49304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQyRURCQTE1LUQxRDEtNDJERS04QTU0LUNBOUEyNDZEQzUwQUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhoZjFtYStmbmNvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoZjFtYStmbmNvQGVHcm91cHMuY29tPg=="},"prevInTopic":49303,"nextInTopic":49305,"prevInTime":49303,"nextInTime":49305,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"","specialLinks":[]},{"userId":381959449,"authorName":"kelly_sturman","from":"&quot;kelly_sturman&quot; &lt;conspicuousfamily@...&gt;","profile":"kelly_sturman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dealing with Family and Different philosophies","postDate":"1262160394","msgId":49303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZjFtYStmbmNvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU2NjY5RjlFLTdGMTEtNEUyRi1CRkNFLTZGMERDNjhDMzQzMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49302,"nextInTopic":49304,"prevInTime":49302,"nextInTime":49304,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"My problem in visiting the extended family is not with the kids behavior; it s with the extended family members.  Specifically, the kids are always getting ","messageBody":"<div id=\"ygrps-yiv-288691310\">My problem in visiting the extended family is not<br/>\nwith the kids&#39; behavior; it&#39;s with the extended family<br/>\nmembers.  Specifically, the kids are always getting <br/>\ngrilled on &quot;what are you learning?&quot;  <br/>\n<br/>\n&quot;What are you doing in science these days?&quot;<br/>\n<br/>\n&quot;What are you studying in history?&quot;<br/>\n<br/>\n&quot;Show me something you wrote.&quot;<br/>\n<br/>\nI, likewise, am getting grilled on &quot;what are you <br/>\nteaching them?&quot;<br/>\n<br/>\nMy family and my husband&#39;s both include a lot of former <br/>\nteachers and members of Boards of Education.  Well <br/>\nmeaning, traditional parents.  <br/>\n<br/>\nI actually got my father-in-law to read some Alfie Kohn, <br/>\nbut of course, he thought it was total bunk.<br/>\n<br/>\nMy mother will say, in one breath, that she trusts me in<br/>\nhow I am educating my children, and then in the next breath<br/>\nsay, &quot;They&#39;ll be living with you forever, you know, and <br/>\ncompletely ill-equipped to support themselves or do anything productive with their lives.&quot;  It so sad that she believes<br/>\nthat, and sad that her grandkids overhear her saying so.<br/>\n<br/>\nEverybody in the extended family is convinced that you need<br/>\nto have an advanced degree in order to live a successful, <br/>\nfulfilling life.  Since several of them are computer scientists,<br/>\nI point to Bill Gates, Steve Jobs and Steve Wozniak (sp?) as<br/>\nexamples that this is simply not true.  And then I get, &quot;Well,<br/>\nthose successes happened in a specific place and time, and the<br/>\nworld isn&#39;t like that anymore.&quot;<br/>\n<br/>\nI recognize a fear-based statement for what it is, but just <br/>\nseeing that the statement and the belief behind it are fear-fed, doesn&#39;t make it easier to face.  I don&#39;t know how to ease their <br/>\nfears.  I could give them tons of stuff to read, and they&#39;d come <br/>\nback with &quot;it&#39;s all bunk, bunk, bunk.&quot;<br/>\n<br/>\nI try to shut down these conversations/interrogations as politely<br/>\nas I can, but &quot;we&#39;re just going to have to agree to disagree&quot; and <br/>\n&quot;I am confident that the children are happy now, and learning what they need to learn, and that they will go on to lead fulfilling lives..&quot; doesn&#39;t ease the fears of a grandparent worried about the <br/>\ngrandchildren&#39;s current education and future possibilities.  I <br/>\npoint out that the kids are very active in their community and <br/>\nhave many adult role models and mentors.  The fears remain.<br/>\n<br/>\nI try to point out that the time we can spend together is limited,<br/>\nand spending it arguing is a waste of a precious opportunity.<br/>\nBut when they are asking for me to assuage their fears, any<br/>\nstatement that I don&#39;t want to discuss their fears comes across<br/>\nas conceited, or else defensive.  But how can I assuage their fears?<br/>\n<br/>\nTwo kids are working &quot;above grade level&quot; (according to their age,<br/>\naccording to what grade they&#39;d be placed in public school), in<br/>\nseveral subject areas.  (This is not a matter we focus on at home, <br/>\nbut it matters to the relatives.)  Still, the relatives focus on where the kids are &quot;below grade level.&quot;  I point out that the two <br/>\nof the four kids have &quot;skipped&quot; grades because of high test scores <br/>\non year-end standardized tests--there&#39;s no point in arguing that those tests are ridiculous--but still, all they can focus on are <br/>\nthe areas where they think the kids should be doing more, doing better.  <br/>\n<br/>\nHow on earth can I assuage their fears, so that they can see the beautiful children that they have in their lives right now, so that<br/>\nthey can just love them for who they are right now?<br/>\nThey are of the &quot;public school was good enough for me...&quot; and &quot;these kids are exceptionally bright; they should be working harder...&quot; schools of thought.<br/>\n<br/>\nI do believe grandparents and aunts and uncles are important to have in our lives, and I&#39;m afraid if I make a simple statement to the effect that how we raise our children is NOT a topic that is open for discussion, that is going to blow up into a situation where we just don&#39;t see the extended family any more.  And that would be a real loss.<br/>\n<br/>\nStill, when we are on our way to grandpa&#39;s house, and the kids are all taking turns role playing grandpa, and preparing answers to the questions they know he&#39;ll ask, translating their passions into educationalese, that seems sad to me.  The kids are aware that grandpa is not accepting them for who they are, but rather for what<br/>\nthey can accomplish.  Yes, they see that as a fault in grandpa, and not as a problem with themselves, but, still.  Likewise, when a child <br/>\ndoesn&#39;t want to share a wonderful story she wrote with grandma, &#39;cause she knows grandma is going to pick apart the grammar and spelling...<br/>\n...well, it&#39;s a rift between them, and that&#39;s sad.<br/>\n<br/>\nI try to avoid conversations about homeschooling, but the relatives keep bringing &#39;em up.  I try to be vague:  &quot;Oh, they&#39;re doing very well.... followed by a brief synopsis of each of the kids current passions (leaving out the passion for gaming, which the extended family just cannot appreciate as educational).&quot;  But then we&#39;ll<br/>\nplay a board game together, and any mispronunciation on a game<br/>\ncard read aloud gets pounced on, any mistake in reading the roll<br/>\nof the dice raises eyebrows.<br/>\n<br/>\nI don&#39;t want to be strident.  I want to be tactful.  But how to <br/>\nmanage it?  I am meeting my state&#39;s homeschooling regulatory requirements.  But the grandparents remain concerned, and I don&#39;t<br/>\nknow how to assuage those concerns.  If they believe that a fifth<br/>\ngrader should know standard grammar and punctuation, and should<br/>\nspell better, then the fact that she did well enough on the required<br/>\nend-of-year exam doesn&#39;t calm them.  The older the kids get, the<br/>\nmore fearful the extended family seems.  We are not &quot;out&quot; as <br/>\nunschoolers, but if the kids don&#39;t start taking AP or community<br/>\ncollege courses soon, I do expect that we are going to get a<br/>\nlot more flack.  And truth to tell, the kids may very well NOT.<br/>\nThey may play a lot of computer games.  Read.  Ski, skate, swim,<br/>\nkayak.  Train the dogs.  Grow a garden.  Cook and bake.  They may<br/>\nor may not want to get a job when they are old enough to do so.  <br/>\nThey may or may not go to college when they are 18.  They may<br/>\nnot go ever. <br/>\n<br/>\nMaybe family visits aren&#39;t worth facing all this emotional toxicity,<br/>\nbut the kids love their grandparents, aunts, uncles, and cousins.<br/>\nSeems like I need a better way to be a buffer; I just don&#39;t know<br/>\nhow to do it.  Has anybody successfully managed this and have <br/>\nBTDT advice for us?<br/>\n<br/>\nKelly Sturman</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Family and Different philosophies","postDate":"1262151167","msgId":49302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCM0FFNUZGLjgwOTAzMDhAbWFjLmNvbT4=","inReplyToHeader":"PDhGNDJGNzRDLTkyNjktNDY4OC1BMEQyLURCQkJBMkIxOEYyNkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhoZTB2ZiszazUxQGVHcm91cHMuY29tPiA8OEY0MkY3NEMtOTI2OS00Njg4LUEwRDItREJCQkEyQjE4RjI2QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":49300,"nextInTopic":49303,"prevInTime":49301,"nextInTime":49303,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"... Is there anybody here with an 18 yo or older who doesn t feel like at least some of what they worried about was really unnecessary and that some of what","messageBody":"<div id=\"ygrps-yiv-980210822\">On 12/29/2009 5:27 PM, Sandra Dodd wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; But if you make lots of decisions with a view to the future, she&#39;ll be<br/>\n&gt; four and then five and pretty soon eighteen, and you might feel that<br/>\n&gt; you worried too much.<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Is there anybody here with an 18 yo or older who doesn&#39;t feel like at <br/>\nleast some of what they worried about was really unnecessary and that <br/>\nsome of what they thought was really important was really not?<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":363518215,"authorName":"claire.horsley08","from":"&quot;claire.horsley08&quot; &lt;claire.horsley08@...&gt;","profile":"claire.horsley08","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dealing with Family and Different philosophies","postDate":"1262143978","msgId":49300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZWhsYStpa2EwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDhGNDJGNzRDLTkyNjktNDY4OC1BMEQyLURCQkJBMkIxOEYyNkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49299,"nextInTopic":49302,"prevInTime":49299,"nextInTime":49301,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"Firstly I wanted to say to the OP that you have a 3 year old and a very young baby - it s a full-on time of your life so good on you for trying to parent","messageBody":"<div id=\"ygrps-yiv-1574005036\">Firstly I wanted to say to the OP that you have a 3 year old and a very young baby - it&#39;s a full-on time of your life so good on you for trying to parent mindfully and lovingly.  When I was in your position I was in the early stages of learning about unschooling/peaceful parenting.  I look back now and wish I could&#39;ve been more accommodating of my then three-year-old&#39;s quirks. As it is, my kids are now nearly 5 and 2.5, and I can tell you that things are definitely getting easier.  And one of the reasons for that is that I am more confident and calmer within myself.<br/>\n<br/>\nWith regard to the incident of the soft toy, there was clearly more going on than just a child&#39;s toy left on a bench. Your SIL is 33 and living with her parents. Presumably she doesn&#39;t have kids, probably has very little idea about how to interact with kids. So her getting stroppy about a toy on a bench says to me that she wasn&#39;t coping well with the whole situation. Plus it sounds like she and your husband have a fairly adversarial relationship, which would not have helped the situation. One solution could have been for your DH to get into puppet mode and get the toy to &#39;ask&#39; Marisol if it could come down and play with her. I&#39;ve found that if I turn something into a game, especially if I play the voice of a toy, kids often respond very well.<br/>\n<br/>\nGenerally I have found that if I want happy playing within the rules of the house we are visiting, my calm presence is the biggest factor in ensuring that this will happen. I try to intervene in a way that is fun for the kids and saves face for our hosts. I don&#39;t tend to explain how things are at our house or my &#39;parenting philosophy&#39;. If there are tensions beyond my control, I keep the visit as short as possible.<br/>\n<br/>\nClaire</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Dealing with Family and Different philosophies","postDate":"1262136462","msgId":49299,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGNDJGNzRDLTkyNjktNDY4OC1BMEQyLURCQkJBMkIxOEYyNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhoZTB2ZiszazUxQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoZTB2ZiszazUxQGVHcm91cHMuY29tPg=="},"prevInTopic":49298,"nextInTopic":49300,"prevInTime":49298,"nextInTime":49300,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"-=- So then the decision is whether to leave your child with someone or to keep giving your child the choice. She is 3 years old and gets upset sometimes","messageBody":"<div id=\"ygrps-yiv-285426367\">-=- So then the decision is whether to leave your child with someone  <br/>\nor to keep giving your child the choice. She is 3 years old and gets  <br/>\nupset sometimes whether she is with us or someone else. -=-<br/>\n<br/>\nOr to take the child with you.  Or to take someone else with you to be  <br/>\nwith her in case she wants to leave or walk around while you&#39;re in  <br/>\nchurch or whatever.<br/>\n<br/>\nBut if you make lots of decisions with a view to the future, she&#39;ll be  <br/>\nfour and then five and pretty soon eighteen, and you might feel that  <br/>\nyou worried too much.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Dealing with Family and Different philosophies","postDate":"1262126895","msgId":49298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZTB2ZiszazUxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU2NjY5RjlFLTdGMTEtNEUyRi1CRkNFLTZGMERDNjhDMzQzMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":49297,"nextInTopic":49299,"prevInTime":49297,"nextInTime":49299,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"... This was mostly happening with my husband being around - I wasn t there initially. Although I don t know if I would have discouraged it initially anyways","messageBody":"<div id=\"ygrps-yiv-1793743176\"><blockquote><span title=\"ireply\">&gt; I would&#39;ve moved the stuffed animal way more quickly, had it been me. I probably wouldn&#39;t have encouraged it to be on any flat food prep surface, either.  But rather than ask her if she&#39;s ready to move it,you might&#39;ve found a cool little place an make &quot;a den&quot; or something for it to be in and show her excitedly what a cool place you&#39;ve found,so that she sees it as going to a better place, not losing a battle of wills, or a territorial battle.-=-<br/>\n<br/>\n </span></blockquote>This was mostly happening with my husband being around - I wasn&#39;t there initially. Although I don&#39;t know if I would have discouraged it initially anyways -- it was actually a &quot;bar&quot; area of the counter where there are chairs for people to eat and often there are laptops there too. Not really a food prep area per se. I tend to agree with my husband that it wasn&#39;t really a big deal with the toys being there, but we are really laid back with Marisol and where she puts stuff. I do think that if if bothers the people whose house it is then it should be moved.<br/>\n<br/>\nI mostly wanted to convey to her that when we are at someone else&#39;s house we may have to do things differently than at our own. I think your idea of making a cool new place for them is a good one and would work with my daughter in &quot;perfect&quot; conditions. As it was, with my husband and SIL arguing about it, it would not have worked because she already sensed it was a point of contention. Also I think that me and my mother-in-law tried something like that, to make a bed for them or something, but as I said Marisol was already resisting moving them.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I don&#39;t think you can expect to leave your child somewhere for an hour and even hope that those people will be you while you&#39;re gone.<br/>\n<br/>\n </span></blockquote>I agree with this. So then the decision is whether to leave your child with someone or to keep giving your child the choice. She is 3 years old and gets upset sometimes whether she is with us or someone else. <br/>\n<br/>\n-=- Why don&#39;t you want to &quot;teach&quot; please and thank you?  They&#39;re powerful.  Not just speaking the words, but feeling the feelings that go with them.-=-<br/>\n<br/>\n-=-To have a rule that someone does or does not have to say &quot;please&quot; is a rule.   To react to a &quot;please&quot; requirement by never encouraging &quot;please&quot; will handicap your child. If you tell your child in words or actions that &quot;thank you&quot; is no better than saying nothing at all, that child will be at a social and emotional disadvantage.-=-<br/>\n<br/>\nThis is when I know that I need to get better at being very clear with my posts. As it was, my post seemed long. By &quot;teach&quot; I mean having a rule, or forcing the issue when it isn&#39;t warranted, or not giving things or helping until the &quot;right&quot; words are spoken. We role model please and thank you ALL the time, AND Marisol says please and thank you spontaneously all the time -- I&#39;d say just about every day. She says &quot;Thank you Mama&quot;, and &quot;I love you Mama&quot; so many times a day it is almost ridiculous! I have also started to tell her when she is being extra demanding that there is a nicer way to ask me to do something, I have even said those oft repeated words, &quot;What do you say?&quot; But I really think that role modeling and saying thank you for them are powerful ways to help them learn these things. SO I don&#39;t think that I disagree with you Sandra. <br/>\n<br/>\n-=- She&#39;s right.  There are some things you just have to do.  &lt;g&gt; She&#39;s wrong, though, because some people choose never to choose, and so they go with the flow, like a stick in a river, until they get stuck somewhere.-=-<br/>\n<br/>\nThis is actually almost exactly what I was thinking. Yes, there are some things that you just have to do -- but I&#39;m pretty sure that the things that my MIL thinks you just &quot;have to do&quot; are not the same things that I think you have to do. <br/>\n<br/>\n-=- First you decide what you want, and then it makes it easier to decide what to do next year.  Do you stay at grandma&#39;s next year again?  It depends what your priorities are. If you stay again, can you prepare your daughter better for it?-=-<br/>\n<br/>\nDefinitely something I can work on, especially as she gets older.   <br/>\n<br/>\n-=-Maybe meeting grandma in a public place would be more peaceful, so that the limitations were imposed by strangers (a hotel with a water park or something designed for kids and fun, maybe, for example)-=-<br/>\n<br/>\nAlready doing this more as my parents actually only live about 45 minutes from my in-laws. I used to stay with my in-laws with my daughter (when my husband wasn&#39;t with us), but I don&#39;t think that I will do that anymore. It is hard enough when he is there.<br/>\n<br/>\nActually that is partly what is so hard for me. Figuring out how to communicate with these people who are now my &quot;family&quot; but so different from me. I have felt it is up to my husband to navigate but leaving it to him doesn&#39;t seem to be going so well! :-) When I am tired and feeling fed up I am more likely to feel drastic about the measures we should take, but I am more myself, optimistic and happy, I know that they are our family and I want to work things out for the best for everyone.<br/>\n<br/>\nthanks for your input!<br/>\n<br/>\nSusan</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dealing with Family and Different philosophies","postDate":"1262123915","msgId":49297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEwNDYwNS40MTE0OS5xbUB3ZWIxMTA0MDYubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDU2NjY5RjlFLTdGMTEtNEUyRi1CRkNFLTZGMERDNjhDMzQzMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhoZGZmcitmaGdnQGVHcm91cHMuY29tPiA8NTY2NjlGOUUtN0YxMS00RTJGLUJGQ0UtNkYwREM2OEMzNDMxQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":49292,"nextInTopic":49298,"prevInTime":49296,"nextInTime":49298,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"***We had a family staying with us and the kids would yell for one or the other of the parents to come where they were. And the parents would. And my kids","messageBody":"<div id=\"ygrps-yiv-837128836\">***We had a family staying with us and the kids would yell for one or the <br/>\nother of the parents to come where they were. And the parents would. <br/>\nAnd my kids never did that with me, and I didn&#39;t like it much. I <br/>\nwondered (but didn&#39;t want to make things worse by asking) whether they <br/>\ndid that at home, too, or whether being at my house was a factor.***<br/>\n <br/>\nChamille never really did that, but Margaux has always done that.  She&#39;s getting better about it as she gets older, but she demands things from everyone around her and sometimes it really isn&#39;t nice.  I will almost always say something, like, &quot;you are being really bossy, maybe next time ask nicer.&quot; or &quot;when you demand and yell at me like that, it makes me feel less like jumping up and helping you do something that I would otherwise be very happy to help you with.&quot;.  If she&#39;s really upset, and she does a 180 turn around in less than 30 sec sometimes, it&#39;s better to not say anything in the moment, help her out, do whatever it is she&#39;s asking for, kindly, get her in a better space, THEN say something about how to deal with that better next time.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Dealing with Family and Different philosophies","postDate":"1262111988","msgId":49292,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2NjY5RjlFLTdGMTEtNEUyRi1CRkNFLTZGMERDNjhDMzQzMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhoZGZmcitmaGdnQGVHcm91cHMuY29tPg==","referencesHeader":"PGhoZGZmcitmaGdnQGVHcm91cHMuY29tPg=="},"prevInTopic":49287,"nextInTopic":49297,"prevInTime":49291,"nextInTime":49293,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"-=- I thought SIL maybe had a point about us â•˛respecting their houseâ•ˇ but do not agree at all with how she reacts to things. I told Marisol that we","messageBody":"<div id=\"ygrps-yiv-1840268897\">-=- I thought SIL maybe had a point about us â•˛respecting their  <br/>\nhouseâ•ˇ but do not agree at all with how she reacts to things. I  <br/>\ntold Marisol that we may have to move them in a little bit. My MIL  <br/>\nsaid it would be nice to move them before preparing dinner. We told  <br/>\nMarisol a couple of times and she kept saying â•˛she wasnâ•˙t  <br/>\nreadyâ•ˇ. I finally did move them and it led to a pretty big  <br/>\nmeltdown on Marisolâ•˙s part. I realize that helping her through  <br/>\nbig emotions like that and not always having her way is part of what I  <br/>\nneed to do as a parent. Philosophically we are in a very different  <br/>\nplace from our family though, so how do we reconcile that? Or  <br/>\ndonâ•˙t we?-=-<br/>\n<br/>\nI would&#39;ve moved the stuffed animal way more quickly, had it been me.   <br/>\nI probably wouldn&#39;t have encouraged it to be on any flat food prep  <br/>\nsurface, either.  But rather than ask her if she&#39;s ready to move it,  <br/>\nyou might&#39;ve found a cool little place an make &quot;a den&quot; or something  <br/>\nfor it to be in and show her excitedly what a cool place you&#39;ve found,  <br/>\nso that she sees it as going to a better place, not losing a battle of  <br/>\nwills, or a territorial battle.<br/>\n<br/>\n-=- From what we gathered from SIL, Marisol, and MIL she had asked (or  <br/>\nmore likely demanded in the eyes or our family) that her Grandmother  <br/>\ncome to her. MIL told her to say please and Marisol said she  <br/>\ncouldnâ•˙t. Not sure how many times this was recited, â•˛say  <br/>\npleaseâ•ˇ â•˛I canâ•˙t!â•ˇ but she was very upset. She  <br/>\ntold me that she was sad because her Nonna Gigi wouldnâ•˙t come to  <br/>\nher (a perfect example I think of children learning something  <br/>\ncompletely different than what you are trying to â•˛teach!â•ˇ)  <br/>\nBesides the fact that I just donâ•˙t agree with the idea of  <br/>\nâ•˛teachingâ•ˇ please and thank you, it was disheartening that  <br/>\nwe couldnâ•˙t leave for an hour without coming home to a very upset  <br/>\nlittle girl. -=-<br/>\n<br/>\nWe had a family staying with us and the kids would yell for one or the  <br/>\nother of the parents to come where they were.  And the parents would.   <br/>\nAnd my kids never did that with me, and I didn&#39;t like it much.  I  <br/>\nwondered (but didn&#39;t want to make things worse by asking) whether they  <br/>\ndid that at home, too, or whether being at my house was a factor.   <br/>\nSometimes parents seem nervous in front of me about how they interact  <br/>\nwith their kids, or they don&#39;t seem nervous but they tell me later  <br/>\nthat they were.<br/>\n<br/>\nI don&#39;t think you can expect to leave your child somewhere for an hour  <br/>\nand even hope that those people will be you while you&#39;re gone.<br/>\n<br/>\nWhy don&#39;t you want to &quot;teach&quot; please and thank you?  They&#39;re  <br/>\npowerful.  Not just speaking the words, but feeling the feelings that  <br/>\nshould go with them.   If my child says &quot;Mom, could you please come  <br/>\nhere?&quot; she&#39;s saying that if I&#39;m not busy and I feel like it, she would  <br/>\nlike my attention.  I&#39;m eager, if I can, to go there.  If a kid yells  <br/>\nMOM!  it depends on the tone of voice.  If they&#39;re hurt, I&#39;m running.   <br/>\nIf they sound excited, they&#39;ll probably follow with &quot;This is cool,&quot; or  <br/>\n&quot;Come look!&quot; and I&#39;ll rush over.  To have a rule that someone does or  <br/>\ndoes not have to say &quot;please&quot; is a rule.   To react to a &quot;please&quot;  <br/>\nrequirement by never encouraging &quot;please&quot; will handicap your child.   <br/>\nIf you tell your child in words or actions that &quot;thank you&quot; is no  <br/>\nbetter than saying nothing at all, that child will be at a social and  <br/>\nemotional disadvantage.<br/>\n<br/>\n-=- She said â•˛there are some things that you just have to  <br/>\ndoâ•ˇ. I didnâ•˙t respond because once again I have a  <br/>\ncompletely different philosophy than her.-=-<br/>\n<br/>\nShe&#39;s right.  There are some things you just have to do.  &lt;g&gt;  She&#39;s  <br/>\nwrong, though, because some people choose never to choose, and so they  <br/>\ngo with the flow, like a stick in a river, until they get stuck  <br/>\nsomewhere.<br/>\n<br/>\nFirst you decide what you want, and then it makes it easier to decide  <br/>\nwhat to do next year.  Do you stay at grandma&#39;s next year again?  It  <br/>\ndepends what your priorities are. If you stay again, can you prepare  <br/>\nyour daughter better for it?  Maybe meeting grandma in a public place  <br/>\nwould be more peaceful, so that the limitations were imposed by  <br/>\nstrangers (a hotel with a water park or something designed for kids  <br/>\nand fun, maybe, for example).<br/>\n<br/>\n-=-What is the balance of â•˛respectingâ•ˇ their house but also  <br/>\nour daughter when she is doing things that normal 3 year olds do?  <br/>\nMaybe we shouldnâ•˙t stay there anymore, but maybe they deserve to  <br/>\nknow why first?-=-<br/>\n<br/>\nI wouldn&#39;t dramatize it at all.  She won&#39;t be three again.  At some  <br/>\npoint she&#39;ll be able to help you figure out ways to get along better  <br/>\nthere.  Our kids had some similar problems with my mother-in-law&#39;s  <br/>\nhouse, but they were better at the transition, after a few years, than  <br/>\nI was myself.   She didn&#39;t like for them to say &quot;poop&quot; or &quot;pee.&quot;  I  <br/>\nwas more likely to offend her than they were.  They saw it as just  <br/>\nanother place with another set of expectations, and they adapted fine.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":335633701,"authorName":"DaBreeze21","from":"&quot;DaBreeze21&quot; &lt;susanmay15@...&gt;","profile":"DaBreeze21","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Dealing with Family and Different philosophies","postDate":"1262108987","msgId":49287,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhoZGZmcitmaGdnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":49292,"prevInTime":49286,"nextInTime":49288,"topicId":49287,"numMessagesInTopic":0,"msgSnippet":"Holiday s at my in-laws brought to the front of my mind how to deal with things that are done differently at other peopleâ€™s homes compared to","messageBody":"<div id=\"ygrps-yiv-432685518\">Holiday&#39;s at my in-laws brought to the front of my mind how to deal with things that are done differently at other peopleâs homes compared to oneâs own home. One thing that has helped me a lot is hearing some of Sandraâs and other peopleâs input about helping your children in other peopleâs homes (That children donât have âabsolute freedomâ to do whatever they wantâ¦ It seems obvious, but tangling out what is acceptable and what is not isnât as easy especially when it is family â&quot; trying to search for the principles). For example, maybe they are allowed to jump or eat on the couch at home, but at other peopleâs homes they are not. (Actually a good example of two things that my 3 yo does at our house, but my Mother-in-law does not want in her home.) <br/>\n<br/>\nSo, I the idea that when we are guests somewhere we may have to act differently than we do at home makes sense. What I am having a hard time with is where the lines are, especially with family. A few examples from this last week â&quot; Marisol had her new pillow pets (a big stuffed animal) on a kitchen counter that no one was using. My SIL came in the kitchen and wanted them off â&quot; said it was disgusting and that we need to respect the house. I was not present for this particular incident â&quot; it was between my husband and her. SIL lives there with their mom and dad right now. Marisol was very upset and did NOT want to move the stuffed animals. My husband didnât see why they had to be moved, felt that they were not bothering anyone. SIL stomped up the stairs, kicked some boxes out of the way (that Marisol had been playing with earlier) slammed the door to her room and didnât come out for a couple of hours (I think she may have taken a nap). SIL is 33 years old and she had several âtantrumsâ like this while we were home â&quot; stomping feet, leaving in a huff etc. In fact she didnât even say goodbye to us! She seems to take Marisolâs intense feelings very personally. She does not really play with her either. On the other hand, my husband is not very sensitive in the way he says things to his sister.<br/>\n<br/>\nWhen I found out what happened I felt a lot of anxiety. It is not my parentâs house and my in-laws keep things very neat.  My husband and I both feel between having a 3 yo and it being Christmas â&quot; lots of new stuff and toysâ&quot;that their expectations are not realistic. Plus the way they interact is much different than my family. I thought SIL maybe had a point about us ârespecting their houseâ but do not agree at all with how she reacts to things. I told Marisol that we may have to move them in a little bit. My MIL said it would be nice to move them before preparing dinner. We told Marisol a couple of times and she kept saying âshe wasnât readyâ. I finally did move them and it led to a pretty big meltdown on Marisolâs part. I realize that helping her through big emotions like that and not always having her way is part of what I need to do as a parent. Philosophically we are in a very different place from our family though, so how do we reconcile that? Or donât we?<br/>\n<br/>\nAnother example â&quot; on Sunday Marisol stayed home with the family while my husband, her baby brother, and I went to Mass. We gave her the option of staying at their house to play or going to Mass. She chose to stay with them. We were gone for almost exactly an hour. When we came home Marisol was very upset. From what we gathered from SIL, Marisol, and MIL she had asked (or more likely demanded in the eyes or our family) that her Grandmother come to her. MIL told her to say please and Marisol said she couldnât. Not sure how many times this was recited, âsay pleaseâ âI canât!â but she was very upset. She told me that she was sad because her Nonna Gigi wouldnât come to her (a perfect example I think of children learning something completely different than what you are trying to âteach!â) Besides the fact that I just donât agree with the idea of âteachingâ please and thank you, it was disheartening that we couldnât leave for an hour without coming home to a very upset little girl. Iâm not sure if we should not leave her with them or keep giving her the choice â&quot; I think that maybe if things like that keep occurring she will naturally choose to go with us rather than stay. I donât know. My husband asked his mother if it was worth insisting on a âpleaseâ when it resulted in such a negative result. She said something to the effect that âIf you can never say no to a childâ¦â  I donât think that she finished the thought but it was clear what she meant.<br/>\n<br/>\nLastly, Marisol does NOT like having her hair brushed right now. We managed to do it the day that we went to the in-laws house, and Christmas eve too (with no tears or upset). So it looked decent through the holiday. But the time we left yesterday it was very messy and tangled. My MIL made several comments â&quot; one that Marisol âlet her brush it a couple timesâ. I said âit depends on her moodâ. She said âthere are some things that you just have to doâ. I didnât respond because once again I have a completely different philosophy than her.<br/>\n <br/>\nDo we try to explain some of the reasons behind why we do things? Do we limit our visits to short stays? We live in DC and they live in upstate NY. It makes me not want to visit very often, but to be fair maybe I should tell them that first. I have not really ever talked with them about my parenting &quot;philosophy&quot; and up till now have tried to get along without doing so. But things seem to be getting harder rather than easier as Marisol gets older. She is actually more like my in-laws side of the family than mine in tempermentâ&quot; she knows her mind, knows what she wants, and she is pretty intense. Ironically because of this she clashes with them more than my family, particular my parents, who are way more easy going. My family think she is âhigh maintenanceâ but love her and are way more tolerant of her projects (&quot;messes&quot;) and emotions at their house. Plus they are way more hands on. Also ironically, our baby boy, (Gerry 5 months old) is very laid back so far and the in-laws are just LOVING him. I am worried about comparisons. <br/>\n<br/>\nWhat is the balance of ârespectingâ their house but also our daughter when she is doing things that normal 3 year olds do? Maybe we shouldnât stay there anymore, but maybe they deserve to know why first? If we canât be comfortable but they feel we arenât respecting their home maybe it is best? Maybe Iâm missing other choices.</div>","specialLinks":[]}],"prevTopicId":49239,"nextTopicId":49347}}