{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":74604204,"authorName":"Deborah Lewis","from":"Deborah Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]TV Time was  Adult time","postDate":"1034698875","msgId":46423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIxMDE1LjEwMjExNS42MzIuMS5kZHppbWxld0BqdW5vLmNvbT4="},"prevInTopic":46403,"nextInTopic":0,"prevInTime":46422,"nextInTime":46424,"topicId":46391,"numMessagesInTopic":0,"msgSnippet":"On Tue, 15 Oct 2002 18:21:52 +1300 Dalene and Andy  ... It has been my experience that little kids aren t terribly interested in sex and","messageBody":"<div id=\"ygrps-yiv-1526009093\">On Tue, 15 Oct 2002 18:21:52 +1300 &quot;Dalene and Andy&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mactier@...\">mactier@...</a>&gt;<br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Back to TV. I am not concerned that my five year old will find some <br/>\n&gt; sex or violence to watch on the TV, but I am concerned that if he <br/>\n&gt; watches something during adult broadcasting time - let&#39;s say the <br/>\n&gt; news - he might be exposed to sex or violence during advertisements <br/>\n&gt; or trailers of other kinds.<br/>\n<br/>\n </span></blockquote>It has been my experience that little kids aren&#39;t terribly interested in<br/>\nsex and violence.  If you were watching a program and something came on<br/>\nthat concerned him you would be there to explain it.   <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Mmm... that I believe, but that would not allow unrestricted <br/>\n&gt; television viewing to my 5 yo, since the age-appropriate programmes <br/>\n&gt; are limited in hours.<br/>\n<br/>\n </span></blockquote>I don&#39;t think we can know what age appropriate is.  I think the person<br/>\nwho can best decide that is the child.  My son always loved monster<br/>\nmovies and when Starship Troopers came out I was worried that the brain<br/>\nsucking scene would be too much for him.  We talked about it and he<br/>\nwanted to see the movie anyway.  He loved it.  What I thought might be a<br/>\nproblem wasn&#39;t in any way.  He has a firm grasp on what is real and what<br/>\nis not.  He&#39;s a good judge of what he can handle.  <br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt; The other question is, are you not concerned with limitless hours of <br/>\n&gt; TV viewing for a child. Again I find it hard to ignore the research <br/>\n&gt; on hours spent watching TV. I accept that you don&#39;t pay much notice <br/>\n&gt; to the research, but it does make me nervous. In all honesty I can <br/>\n&gt; see the effects on children around me. Obesity seems to be an <br/>\n&gt; increasing problem and most primary schools here have a perceptual <br/>\n&gt; development program - where kids learn to jump and hop and climb. <br/>\n&gt; Things that they should have been doing in their first five years at <br/>\n&gt; least (and off course beyond).<br/>\n<br/>\n </span></blockquote>I&#39;ve never known my son&#39;s TV viewing to be limitless.  It&#39;s just I&#39;m not<br/>\nthe one limiting it.  He does that himself.  Sometimes he watches TV,<br/>\nsometimes he doesn&#39;t.  He has other interests and ambitions.   We can<br/>\nmake sure our kids have other good choices of entertainment and they can<br/>\ndecide for themselves which are appropriate.  <br/>\nI have seen some of the concerns relating TV to obesity in children but<br/>\nTV has no calories.  A  sedentary lifestyle may not be the healthiest<br/>\none, but we sit for other things as well, and I&#39;ve not yet heard any push<br/>\nto ban books because kids who read all the time are sitting. <br/>\nKids sit at school too, much longer than my son ever sits during TV.  <br/>\nFrequently he is upside down or in the process of getting upside down. <br/>\nKids sit for homework.  Let&#39;s be realistic.  A parent doesn&#39;t have to<br/>\nwatch their child sit all day.  You can take kids walking and hiking and<br/>\nswimming and skiing and biking and out to play hopscotch. <br/>\n<br/>\nAs far as schools having to teach kids to jump and hop, etc, school<br/>\n&quot;teaches&quot; a lot of things that kids will do when they&#39;re ready without<br/>\nall that teaching.  Gross motor skill development is on their list now of<br/>\nthings that must be taught, but If the child is walking at school age I&#39;d<br/>\nsay he&#39;s on his way to gross motor skill development and he did it<br/>\nwithout the schools help.  I believe it&#39;s wrong that schools force<br/>\nchildren into reading because they are a certain age, and I don&#39;t see any<br/>\ndifference between that and forcing jump rope skills.  It&#39;s more than a<br/>\nlittle silly that we make kids go sit all day at school and then develop<br/>\nspecial programs for them because they sit too much.  It probably works<br/>\nslick for everyone to blame TV.<br/>\n<br/>\nDeb L<br/>\n  <br/>\n<br/>\n.</div>","specialLinks":[]},{"userId":80046248,"authorName":"Dalene and Andy","from":"&quot;Dalene and Andy&quot; &lt;mactier@...&gt;","profile":"mactiers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]TV Time was  Adult time","postDate":"1034664385","msgId":46403,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwN2QwMWMyNzQxNiQ5NWZlYzcwMCQ5MTZhMzZkMkBocHBhdj4=","referencesHeader":"PGFvZ2FlcytzdGlwQGVHcm91cHMuY29tPg=="},"prevInTopic":46394,"nextInTopic":46423,"prevInTime":46402,"nextInTime":46404,"topicId":46391,"numMessagesInTopic":0,"msgSnippet":"... sound like when disagreeing with you To me the difference lies in a statement and a hypothesis. I know it s semantics, but it certainly works for me. ","messageBody":"<div id=\"ygrps-yiv-899805661\"><blockquote><span title=\"ireply\">&gt;&gt;just not sure what you would &quot;like&quot; people to <br/>\n </span></blockquote>sound like when disagreeing with you<br/>\n<br/>\nTo me the difference lies in a statement and a hypothesis. I know it&#39;s semantics, but it certainly works for me.<br/>\n<br/>\nThanks for sharing your views on TV. I&#39;m still digesting it. I do not believe my problem is a lack of trust, but rather a fear installed by the media.<br/>\n<br/>\nYes I can see that the research might be a reflection on families a bit different to ours. I know my son usually always chooses reading to stories to watching TV, but sometimes I say know when he&#39;s already spent two hours in the mornings watching his programmes and then want to watch a video later.<br/>\n<br/>\nDalene<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2523757,"authorName":"Pam Hartley","from":"&quot;Pam Hartley&quot; &lt;pamhartley@...&gt;","profile":"pdhartley2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]TV Time was  Adult time","postDate":"1034661148","msgId":46394,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFvZ2FlcytzdGlwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNGIwMWMyNzQwYSRjNWFkZWM4MCQ5MTZhMzZkMkBocHBhdj4="},"prevInTopic":46391,"nextInTopic":46403,"prevInTime":46393,"nextInTime":46395,"topicId":46391,"numMessagesInTopic":0,"msgSnippet":"... then again I might be more sensitive than the rest. Could be cultural. ... Could be. Or it could be the statement IS judgmental, but I m not sure how to","messageBody":"<div id=\"ygrps-yiv-554198963\">--- In Unschooling-dotcom@y..., &quot;Dalene and Andy&quot; &lt;mactier@x&gt; <br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;   &gt;&gt;You are suffering from a lack of trust (my opinion).<br/>\n&gt; <br/>\n&gt; Personally I find these kind of statements judgemental. But <br/>\n </span></blockquote>then again I might be more sensitive than the rest. Could be <br/>\ncultural. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Could be. Or it could be the statement IS judgmental, but I&#39;m not <br/>\nsure how to answer questions or hold debates without making <br/>\nsome judgments or sharing the judgments I&#39;ve made in my life <br/>\n(not being sarcastic, just not sure what you would &quot;like&quot; people to <br/>\nsound like when disagreeing with you).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Back to TV. I am not concerned that my five year old will find <br/>\n </span></blockquote>some sex or violence to watch on the TV, but I am concerned that <br/>\nif he watches something during adult broadcasting time - let&#39;s <br/>\nsay the news - he might be exposed to sex or violence during <br/>\nadvertisements or trailers of other kinds.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Brit (who to be fair is almost 8, but this sort of thing happened <br/>\nregularly when she was much younger, too) just walked in as I <br/>\nwas watching the news. Victim #11 was shot tonight in Virginia <br/>\nand I exclaimed, &quot;Oh no!&quot; as the news report came on. She said, <br/>\n&quot;What? What&#39;s wrong?&quot; I could have lied. I could have changed <br/>\nthe subject. I could have said, &quot;You&#39;re too young.&quot; Instead I <br/>\nexplained what I was upset about. I made sure to reassure her <br/>\nthat we&#39;re far from where it&#39;s happening (we&#39;re in California) and <br/>\nthat I was hoping the police would catch the criminal soon.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Mmm... that I believe, but that would not allow unrestricted <br/>\n </span></blockquote>television viewing to my 5 yo, since the age-appropriate <br/>\nprogrammes are limited in hours.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>Well, again, I&#39;m sure I have a much broader range of what I <br/>\nconsider &quot;age appropriate&quot;. My oldest (the almost-8) is a fan of <br/>\nJapanese anime and watches some fairly adult-style shows on <br/>\nAdult Swim late on Saturday nights. My just-5 year old loves to <br/>\nwatch veterinary shows on Animal Planet. My oldest, earlier this <br/>\nspring, decided to watch CSI (revolting crime scene drama) with <br/>\nher father (we told her what to expect, and I did try to talk her out <br/>\nof it - I was wrong about what she could handle) and enjoyed it. <br/>\nShe also watches surgery programs on television.<br/>\n<br/>\nBasically, age appropriate depends on the child. If I think <br/>\nsomething is going to be too much for my daughters, I tell them <br/>\nwhat I think. If they still want to watch, I watch with them or their <br/>\nfather does until we know they&#39;re okay with it (or they&#39;ve said, <br/>\n&quot;yuck&quot; and turned it off themselves).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The other question is, are you not concerned with limitless <br/>\n </span></blockquote>hours of TV viewing for a child. Again I find it hard to ignore the <br/>\nresearch on hours spent watching TV. I accept that you don&#39;t pay <br/>\nmuch notice to the research, but it does make me nervous. In all <br/>\nhonesty I can see the effects on children around me. Obesity <br/>\nseems to be an increasing problem and most primary schools <br/>\nhere have a perceptual development program - where kids learn <br/>\nto jump and hop and climb. Things that they should have been <br/>\ndoing in their first five years at least (and off course beyond).<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n<br/>\n </span></blockquote>I am not concerned with limitles hours of TV viewing for a child <br/>\nwho has parents who notice and who has actual options for how <br/>\nto spend their time. <br/>\n<br/>\nChildren who do not have limits under those circumstances <br/>\ndon&#39;t watch TV the way children who do have limits watch TV. The <br/>\ntelevision is not a magical forbidden temple to my children. It&#39;s <br/>\nentertainment they take advantage of -- sometimes a little, <br/>\nsometimes a lot. They practice somersaults while watching <br/>\nSponge Bob. They pretend to be baby foxes and crawl all over <br/>\nthe floor during Crocodile Hunter. They race in and out of a room <br/>\nwhile the television is on and leave it on the slightest whim to go <br/>\nplay outside. <br/>\n<br/>\nActually sitting down to watch a program for more than awhile <br/>\nindicates they need the quiet time, or that the program is simply <br/>\nriveting (and they aren&#39;t easily riveted, they know they don&#39;t have <br/>\nto stuff in as much TV as they can before we say &quot;that&#39;s enough&quot; <br/>\nand decide for them. It&#39;s the same reason my children don&#39;t <br/>\ngorge on chocolate -- what&#39;s the point when they can have it any <br/>\ntime in any quantity they want?)<br/>\n<br/>\nMany children in school come from TV-watching houses where <br/>\nthere is nothing better to do and/or where the parents are <br/>\nconstantly shushing the children and punishing them for being <br/>\nspirited, so the kids have little choice of anything to do BUT <br/>\nwatch TV.<br/>\n<br/>\nMy oldest daughter is very slender, my youngest somewhat <br/>\nchunky. I was slender, my husband&#39;s sisters were chunky. <br/>\nNeither is a couch potato, they&#39;re both very active girls with <br/>\ndifferent body types. And they may change body type as time <br/>\ngoes on. I have been given no reason to worry about their <br/>\nphysical health or weight.<br/>\n<br/>\nPam</div>","specialLinks":[]},{"userId":80046248,"authorName":"Dalene and Andy","from":"&quot;Dalene and Andy&quot; &lt;mactier@...&gt;","profile":"mactiers","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom]TV Time was  Adult time","postDate":"1034659312","msgId":46391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGIwMWMyNzQwYSRjNWFkZWM4MCQ5MTZhMzZkMkBocHBhdj4=","referencesHeader":"PDBINDAwMEEwS0FUWVIwQG10YTUuc25mYzIxLnBiaS5uZXQ+"},"prevInTopic":0,"nextInTopic":46394,"prevInTime":46390,"nextInTime":46392,"topicId":46391,"numMessagesInTopic":0,"msgSnippet":"... Personally I find these kind of statements judgemental. But then again I might be more sensitive than the rest. Could be cultural. Back to TV. I am not","messageBody":"<div id=\"ygrps-yiv-1814936874\"><blockquote><span title=\"ireply\">&gt;&gt;You are suffering from a lack of trust (my opinion).<br/>\n<br/>\n </span></blockquote>Personally I find these kind of statements judgemental. But then again I might be more sensitive than the rest. Could be cultural. <br/>\n<br/>\nBack to TV. I am not concerned that my five year old will find some sex or violence to watch on the TV, but I am concerned that if he watches something during adult broadcasting time - let&#39;s say the news - he might be exposed to sex or violence during advertisements or trailers of other kinds.<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;I have not<br/>\n </span></blockquote>  ever seen a child with both unrestricted access to television *and* a parent<br/>\n  who paid attention and saw that options of other activities were always<br/>\n  open, consistently choose age-inappropriate television.<br/>\nMmm... that I believe, but that would not allow unrestricted television viewing to my 5 yo, since the age-appropriate programmes are limited in hours.<br/>\n<br/>\nThe other question is, are you not concerned with limitless hours of TV viewing for a child. Again I find it hard to ignore the research on hours spent watching TV. I accept that you don&#39;t pay much notice to the research, but it does make me nervous. In all honesty I can see the effects on children around me. Obesity seems to be an increasing problem and most primary schools here have a perceptual development program - where kids learn to jump and hop and climb. Things that they should have been doing in their first five years at least (and off course beyond).<br/>\n<br/>\nI am a flexible person, and I change my reality constantly. Even though these are my views on TV right now, they might change in the near future. That is why I like to read different opinions. Thanks for sharing yours.<br/>\n<br/>\nDalene<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":46420,"nextTopicId":46425}}