{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":155,"messages":[{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;mom&#39;s needs first&quot;","postDate":"1264757124","msgId":50210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1M0FDOTgwLTMwQzMtNDIwMC04QUUzLThBMTJEMDk0NTRDOUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGhqdTg0MStjZTJsQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqdTg0MStjZTJsQGVHcm91cHMuY29tPg=="},"prevInTopic":50209,"nextInTopic":50211,"prevInTime":50209,"nextInTime":50211,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"... I think the compromised rules...ch***ing is cheating, though I have no idea what that part has to do with the discussion of meeting children s needs. ","messageBody":"<div id=\"ygrps-yiv-1808548768\"><blockquote><span title=\"ireply\">&gt;&gt;<br/>\n&gt;&gt; The suits are not the game. They are the conditions. That is the  <br/>\n&gt;&gt; stage for<br/>\n&gt;&gt; the magic to begin, not a &#39;period&#39;. If a game were as dead decided  <br/>\n&gt;&gt; as you<br/>\n&gt;&gt; describe, gambling wouldn&#39;t be in industry. Where is any unclarity  <br/>\n&gt;&gt; to gamble<br/>\n&gt;&gt; upon? Las Vegas declares your statement absurd. There is such a  <br/>\n&gt;&gt; thing as<br/>\n&gt;&gt; play, skill, uh.... compromises( uh... compromized rules.... ch***ing<br/>\n&gt;&gt; *cough*)<br/>\n&gt;<br/>\n&gt; I don&#39;t understand the last part of this paragraph, but as far as I  <br/>\n&gt; know bridge isn&#39;t a game that is played in Las Vegas like poker or  <br/>\n&gt; blackjack.  Bridge is the game that you referenced by speaking of  <br/>\n&gt; trumping.  There are rules to playing bridge, and some suites trump  <br/>\n&gt; others, period.  You brought in the analogy, Sandra just followed it  <br/>\n&gt; through.  You can&#39;t go changing the analogy and then call her absurd.<br/>\n<br/>\n </span></blockquote>I think the &quot;compromised rules...ch***ing&quot; is &quot;cheating,&quot; though I  <br/>\nhave no idea what that part has to do with the discussion of meeting  <br/>\nchildren&#39;s needs.<br/>\n<br/>\nMaybe it&#39;s just too late at night for me to get it...<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;mom&#39;s needs first&quot;","postDate":"1264757082","msgId":50211,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4OTg4NC41ODMzOC5xbUB3ZWI4NjIwNi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDc5YzFkMWI0MTAwMTI4MjAzMWs0NzU3YjFiN3VkNjBhMjFjMjFmZGViZTk4QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhqc2Fzdis5OTNsQGVHcm91cHMuY29tPiA8aGp0N2thK2piZm9AZUdyb3Vwcy5jb20+IDw3OWMxZDFiNDEwMDEyODIwMzFrNDc1N2IxYjd1ZDYwYTIxYzIxZmRlYmU5OEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":50210,"nextInTopic":50213,"prevInTime":50210,"nextInTime":50212,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"Sure, I can support his curiosity and growth and let him discover natural consequences. Natural consequences of EVERYTHING that is not dangerous - this means","messageBody":"<div id=\"ygrps-yiv-1666156645\">Sure, I can support his curiosity and growth and let him discover natural<br/>\nconsequences. Natural consequences of EVERYTHING that is not dangerous -<br/>\nthis means also the consequences of invading another&#39;s space - that the<br/>\nother will not like it or will succumb, or will get angry, or will not like<br/>\nit but is open to allowing him with reservation and finding out, or will<br/>\navoid him, or whatever pans out. Why exclude emotional intelligence from the<br/>\npicture?<br/>\n----------<br/>\n<br/>\nNatural does not exclude parental assistance. Simply letting something run it&#39;s course is not natural. Helping a child to negotiate a new or difficult thing is totally natural. So, letting them screw up as a &quot;learning opportunity&quot; (not your words, but they&#39;ve been said before) isn&#39;t a natural consequence, it&#39;s closer to neglect than to nature. Not that neglect isn&#39;t also within the bounds of natural, but neglect isn&#39;t really about facilitating learning in a safe and nurturing environment, whereas unschooling is. And why would you want to piss off other people by making their annoyance a learning moment for your child? <br/>\n<br/>\nI was playing WoW with a 19 year old boy who started telling me angry tales of this girl he had gotten involved through WoW. They met in real life and soon afterwards she dumped him in the game. And he was furious at her. I figured she wasn&#39;t as impressed with him in real life as she had been on-line and that his expectations of what a WoW girlfriend would offer him were greater than what would actually be the case. So what he learned, through natural consequences, was that girls were bitches and unreliable, and not that his expectations were greater than they probably should have been. And there wasn&#39;t anyone in his life to help him to see those things. He only had his experience and his sense of injustice to mold his understanding of what happened. <br/>\n<br/>\nI wouldn&#39;t hold my breath for natural consequences to give a full and rich picture of the world that helps a child to become better at recognizing the needs of others. Helping someone leads to them being more helpful, looking to bigger picture understandings with them, helps them to see a bigger picture. <br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;mom&#39;s needs first&quot;","postDate":"1264756868","msgId":50209,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDOTQxNkJBLTc1QkYtNDk3NC1CNTMzLUQ2MDE3OTg1MkU3N0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGhqdHAzaCtrMGZkQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqdHAzaCtrMGZkQGVHcm91cHMuY29tPg=="},"prevInTopic":50208,"nextInTopic":50210,"prevInTime":50208,"nextInTime":50210,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"... I understood that phrase ( ...my true response being transparent is intimacy... ) to mean when she responds authentically (ie. with anger, frustration,","messageBody":"<div id=\"ygrps-yiv-1393197420\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; -= There is a huge difference between<br/>\n&gt; not-interfering and caring. I don&#39;t have to stop him, but my true  <br/>\n&gt; response<br/>\n&gt; being transparent is intimacy - whether I am gung ho, or pulling my  <br/>\n&gt; hair<br/>\n&gt; out. It would be an insult to him to pretend enthusiasm and support  <br/>\n&gt; for<br/>\n&gt; everything.-=-<br/>\n&gt;<br/>\n&gt; Wherever you&#39;ve gathered your unschooling ideas, I don&#39;t understand  <br/>\n&gt; your first two statements.  &quot;My true response to being transparent  <br/>\n&gt; is intimacy&quot; doesn&#39;t make sense to me.  I honestly don&#39;t know what  <br/>\n&gt; you&#39;re talking about.<br/>\n<br/>\n </span></blockquote>I understood that phrase (&quot;...my true response being transparent is  <br/>\nintimacy...&quot;) to mean when she responds authentically (ie. with anger,  <br/>\nfrustration, happiness, sadness, or whatever emotion), that particular  <br/>\nemotion creates intimacy between parent and child.<br/>\n<br/>\nAnd while I understand the thought behind that statement in terms of  <br/>\n&quot;being our authentic selves,&quot; it doesn&#39;t necessarily create the  <br/>\nintimacy one might want. A child might end up knowing intimately that  <br/>\nhis mother can&#39;t be trusted to be his willing and helpful partner in  <br/>\nnegotiating the world.<br/>\n<br/>\nAnd if one&#39;s authentic self is to be an unenthusiastic fun-squasher  <br/>\n(or religious-ritual-insister in the case of a mother-in-law), how  <br/>\nmuch and how long will a child want to be around that?<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna","from":"&quot;Joanna&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;mom&#39;s needs first&quot;","postDate":"1264755649","msgId":50208,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqdTg0MStjZTJsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5YzFkMWI0MTAwMTI4MjAzMWs0NzU3YjFiN3VkNjBhMjFjMjFmZGViZTk4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50207,"nextInTopic":50209,"prevInTime":50207,"nextInTime":50209,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"... I don t understand the last part of this paragraph, but as far as I know bridge isn t a game that is played in Las Vegas like poker or blackjack.  Bridge","messageBody":"<div id=\"ygrps-yiv-687894904\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Vidyut Kale &lt;wide.aware@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &quot;In card games there aren&#39;t compromises. Some suites trump others, period.&quot;<br/>\n&gt; <br/>\n&gt; The suits are not the game. They are the conditions. That is the stage for<br/>\n&gt; the magic to begin, not a &#39;period&#39;. If a game were as dead decided as you<br/>\n&gt; describe, gambling wouldn&#39;t be in industry. Where is any unclarity to gamble<br/>\n&gt; upon? Las Vegas declares your statement absurd. There is such a thing as<br/>\n&gt; play, skill, uh.... compromises( uh... compromized rules.... ch***ing<br/>\n&gt; *cough*)<br/>\n<br/>\n </span></blockquote>I don&#39;t understand the last part of this paragraph, but as far as I know bridge isn&#39;t a game that is played in Las Vegas like poker or blackjack.  Bridge is the game that you referenced by speaking of trumping.  There are rules to playing bridge, and some suites trump others, period.  You brought in the analogy, Sandra just followed it through.  You can&#39;t go changing the analogy and then call her absurd.<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n </span></blockquote>Joanna</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;mom&#39;s needs first&quot;","postDate":"1264747055","msgId":50213,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI4MjIzN243MTY1YzUwMW81NzYzMTI4YmNiMzYxNTM0QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhqdHAzaCtrMGZkQGVHcm91cHMuY29tPg==","referencesHeader":"PDc5YzFkMWI0MTAwMTI4MjAzMWs0NzU3YjFiN3VkNjBhMjFjMjFmZGViZTk4QG1haWwuZ21haWwuY29tPgkgPGhqdHAzaCtrMGZkQGVHcm91cHMuY29tPg=="},"prevInTopic":50211,"nextInTopic":50215,"prevInTime":50212,"nextInTime":50214,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"Hi Sandra, I appreciate you letting my post through when you could easily have stopped it. I understand that you found it impolite and did not like me","messageBody":"<div id=\"ygrps-yiv-361900309\">Hi Sandra,<br/>\n<br/>\nI appreciate you letting my post through when you could easily have stopped<br/>\nit. I understand that you found it impolite and did not like me devaluing it<br/>\nin any way through calling it absurd, ridiculous or &#39;lol&#39;. My apologies. My<br/>\nintention was not to hurt you. I do have a great deal of respect for your<br/>\nway of thought. It is not my intention to trivialize you in any manner.<br/>\n<br/>\nI think that perhaps from having being unschooling for so long, you accept<br/>\nas evident or non-negotiable many things that are not so to someone with a<br/>\nnew perspective for someone who has not developed a capacity for such<br/>\nchoices. I found statements like *&quot;**If she can&#39;t give enough to make<br/>\nunschooling better than school, she should put the child in school.&quot; and &quot;If<br/>\nshe can&#39;t give enough to keep the child from being an absolute mess, she<br/>\nshould give him up for adoption.&quot; extremely crass and judgmental, though I<br/>\nunderstand that they make perfect sense where you stand.*<br/>\n<br/>\n*Yet, it is the rules here that we can examine the words written and not the<br/>\nintent, so ...*<br/>\n*<br/>\n*<br/>\n*<br/>\nI may lack experience, but so is the OP of this thread. Things are obviously<br/>\nin a bad space for her. She is already questioning how her children behave<br/>\nand that things are not right. How do you think a suggestion for putting<br/>\nthem up for adoption rather than messing them up hits her in this frame of<br/>\nmind? Being experienced is little use if it cannot be appropriate to<br/>\ncircumstances.<br/>\n<br/>\n*<br/>\n*I bet you were right where we are in the beginning and didn&#39;t actually<br/>\nbegin knowing it all. How would you have felt when you didn&#39;t know what was<br/>\nto come and things were rough, and some &#39;expert&#39; suggested that your child<br/>\nwould be better off without your contributions if you were not able to<br/>\n&#39;crack it&#39;? You still don&#39;t know the future. What if they get messed a few<br/>\nyears later? Will you give them up for adoption?*<br/>\n<br/>\nOr, in other words, I don&#39;t know if I can make unschooling better than<br/>\nschool. I don&#39;t know if I can keep my child from being an absolute mess. All<br/>\nI know is that I believe that it is the most respectful choice I can make<br/>\nfor my child. By the time I am forced to accept that I did indeed mess my<br/>\nchild up, it will be too late, since of course, I&#39;m not intentionally<br/>\nmessing him up. My child would also have some security in what was<br/>\nhappening, however messed it was. Would he cope with whatever parents he<br/>\nwould get through adoption? How do I know the adopted parents won&#39;t mess him<br/>\nfurther? I will never see my child as messed, so I cant trust my own<br/>\njudgment. I want the best life for him, even if it means I should keep my<br/>\ntoxic self away. Should I send him to school or adoption? By these<br/>\nstandards, does anyone deserve a child at all?<br/>\n<br/>\nDo you even care, when you say this?<br/>\n<br/>\nVidyut<br/>\n<br/>\nPS: I have read you recommendation for not posting, and I will try and not<br/>\ninvolve myself on new threads. However, I find myself unable to stop letting<br/>\nthis be, because I feel very strongly about this. I can unsubscribe now, and<br/>\nthen join when my son is a &quot;successful unschooler&quot; as defined by schooling<br/>\nage if you prefer. I wonder why schooling age matters so much. I possibly<br/>\ndon&#39;t &#39;get it&#39; since schooling was never a lure for me. Some people plan for<br/>\ntheir child to go to school, others don&#39;t. We really need to create our own<br/>\ndefinitions rather than defining ourselves with respect to schooling.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Jan 29, 2010 at 10:14 AM, sandralynndodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; -=-Las Vegas declares your statement absurd.-=-<br/>\n&gt;<br/>\n&gt; I let this post through even though I thought it was very impolite.<br/>\n&gt;<br/>\n&gt; I very much dislike anything being called &quot;absurd&quot; or &quot;ridiculous.&quot;<br/>\n&gt;<br/>\n&gt; Parenting is not about gambling. If someone uses an analogy and I follow<br/>\n&gt; that analogy, that is not absurd.<br/>\n&gt;<br/>\n&gt; I have three children who never went to school and who are happy. People<br/>\n&gt; whose children are not school age, whose children might yet go to school and<br/>\n&gt; so nothing will have been different, should be very sweet and polite on this<br/>\n&gt; list until their children are older and until they/the parents have proven<br/>\n&gt; their usefulness. And after that they should continue to be polite.<br/>\n&gt;<br/>\n&gt; -=So now what? I&#39;m doomed to a life of dancing to his tune? I&#39;d better send<br/>\n&gt; him to<br/>\n&gt; school, where someone will take this kind of crap.-=-<br/>\n&gt;<br/>\n&gt; If you define his actual needs as &quot;crap,&quot; you probably should send him to<br/>\n&gt; school.<br/>\n&gt;<br/>\n&gt; -= There is a huge difference between<br/>\n&gt;<br/>\n&gt; not-interfering and caring. I don&#39;t have to stop him, but my true response<br/>\n&gt; being transparent is intimacy - whether I am gung ho, or pulling my hair<br/>\n&gt; out. It would be an insult to him to pretend enthusiasm and support for<br/>\n&gt; everything.-=-<br/>\n&gt;<br/>\n&gt; Wherever you&#39;ve gathered your unschooling ideas, I don&#39;t understand your<br/>\n&gt; first two statements. &quot;My true response to being transparent is intimacy&quot;<br/>\n&gt; doesn&#39;t make sense to me. I honestly don&#39;t know what you&#39;re talking about.<br/>\n&gt;<br/>\n&gt; -= It would be an insult to him to pretend enthusiasm and support for<br/>\n&gt; everything.-=-<br/>\n&gt;<br/>\n&gt; No one is asking you to pretend. If you are to be your child&#39;s partner<br/>\n&gt; rather than his adversary, it can and will (if you want it to, if you work<br/>\n&gt; at it) become increasingly easy for you to BE enthusiastic and supportive,<br/>\n&gt; without any pretense whatsoever.<br/>\n&gt;<br/>\n&gt; -=Sure, I can support his curiosity and growth and let him discover natural<br/>\n&gt;<br/>\n&gt; consequences. Natural consequences of EVERYTHING that is not dangerous -<br/>\n&gt; this means also the consequences of invading another&#39;s space - that the<br/>\n&gt; other will not like it or will succumb, or will get angry, or will not like<br/>\n&gt; it but is open to allowing him with reservation and finding out, or will<br/>\n&gt; avoid him, or whatever pans out. Why exclude emotional intelligence from<br/>\n&gt; the<br/>\n&gt; picture?-=-<br/>\n&gt;<br/>\n&gt; Part of having a partner who does have emotional intelligence (or any) is<br/>\n&gt; the advantage of sage counsel. I didn&#39;t leave my children to discover from<br/>\n&gt; other people&#39;s responses alone what they might want to do to be courteous<br/>\n&gt; and polite. Their lives aren&#39;t trial and error. They have me and their dad<br/>\n&gt; and many other friends and relatives they can trust and count on to help<br/>\n&gt; them do well in the world.<br/>\n&gt;<br/>\n&gt; i hope you didn&#39;t say &quot;absurd&quot; to your mother in law, because I&#39;m kinda<br/>\n&gt; miffed about it myself. Don&#39;t exclude emotional intelligence from this<br/>\n&gt; picture.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;mom&#39;s needs first&quot;","postDate":"1264744284","msgId":50215,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI4MjE1MXU3ODA3NGYxZW8yOWU3YWY3MTgwMTBhOTYzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDRCNjI2REUzLjkwMTAwQG1hYy5jb20+","referencesHeader":"PGhqc2Fzdis5OTNsQGVHcm91cHMuY29tPiA8aGp0N2thK2piZm9AZUdyb3Vwcy5jb20+CSA8NzljMWQxYjQxMDAxMjgyMDMxazQ3NTdiMWI3dWQ2MGEyMWMyMWZkZWJlOThAbWFpbC5nbWFpbC5jb20+CSA8NEI2MjZERTMuOTAxMDBAbWFjLmNvbT4="},"prevInTopic":50213,"nextInTopic":50216,"prevInTime":50214,"nextInTime":50216,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"Hi Pam, You did miss my viewpoint, but its fine, since you spoke the essence of it yourself. You are saying what I did, in response, if not in understanding, ","messageBody":"<div id=\"ygrps-yiv-580531516\">Hi Pam,<br/>\n<br/>\nYou did miss my viewpoint, but its fine, since you spoke the essence of it<br/>\nyourself. You are saying what I did, in response, if not in understanding,<br/>\nso on some level, the essence of it reached you (I choose to believe).<br/>\n<br/>\n&quot;Are you saying it is &quot;natural&quot; for a parent to see the problems coming<br/>\nand not to step in to help out? As unschoolers, why would we withhold<br/>\nuseful information and advice and guidance and help from our kids?&quot;<br/>\n<br/>\nAs unschoolers, or simply members of a family, or being a true friend, I<br/>\ndon&#39;t think we should withhold useful information and guidance. It is part<br/>\nof being engaged in any relationship.<br/>\n<br/>\nI&#39;m looking at the two kinds of &quot;yes&quot; there are. There is one where a child<br/>\nis exploring curiosity. There is another where a child is exploring<br/>\ncuriosity in directions that are invading another&#39;s territory. I am not<br/>\nsaying that we stop them from anything. I am saying that if our space is<br/>\ngetting invaded, it doesn&#39;t help to get paralyzed and depressed and feeling<br/>\nhelpless out of an ideal. There is a point where we need to trust our<br/>\nchildren with our state of being - whether that point is at 2 months or 20<br/>\nyears. We need to share that okay, you want my computer, but I don&#39;t want to<br/>\nget up and drop what I&#39;m doing. What are the possibilities? &lt;-- I see this<br/>\nas useful information that helps both of us discover possibilities. Like<br/>\nsaid earlier. Those could be another time, another computer, one of us<br/>\nletting off..... I don&#39;t see me doing any favours to my child if I don&#39;t<br/>\nwant to drop what I&#39;m doing but I do, because he wants it. That is only<br/>\nsetting the stage for further frustrations for me, and further lack of<br/>\nknowledge for the child on how his actions may impact another.<br/>\n<br/>\nA parent being mean is a parent being mean. It may be a natural consequence<br/>\nif that is how the person is, but that is not our objective. I don&#39;t see the<br/>\nvalue in generalizing natural consequences to mean that, particularly if<br/>\nneither of us see them as truly only that. I trust that we all will be able<br/>\nto see that, if we stop using such generalizations because we believe others<br/>\ndo.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;mom&#39;s needs first&quot;","postDate":"1264741859","msgId":50207,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNjI2REUzLjkwMTAwQG1hYy5jb20+","inReplyToHeader":"PDc5YzFkMWI0MTAwMTI4MjAzMWs0NzU3YjFiN3VkNjBhMjFjMjFmZGViZTk4QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhqc2Fzdis5OTNsQGVHcm91cHMuY29tPiA8aGp0N2thK2piZm9AZUdyb3Vwcy5jb20+IDw3OWMxZDFiNDEwMDEyODIwMzFrNDc1N2IxYjd1ZDYwYTIxYzIxZmRlYmU5OEBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":50206,"nextInTopic":50208,"prevInTime":50206,"nextInTime":50208,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"... Natural consequences - usually a euphemism for parents being mean enough to just let the chips fall where they may even though they could have prevented","messageBody":"<div id=\"ygrps-yiv-1183102013\">On 1/28/2010 8:31 PM, Vidyut Kale wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Sure, I can support his curiosity and growth and let him discover natural<br/>\n&gt; consequences. Natural consequences of EVERYTHING that is not dangerous -<br/>\n&gt; this means also the consequences of invading another&#39;s space - that the<br/>\n&gt; other will not like it or will succumb, or will get angry, or will not like<br/>\n&gt; it but is open to allowing him with reservation and finding out, or will<br/>\n&gt; avoid him, or whatever pans out. Why exclude emotional intelligence from the<br/>\n&gt; picture?<br/>\n&gt;    <br/>\n<br/>\n </span></blockquote>Natural consequences - usually a euphemism for parents being mean enough <br/>\nto just &quot;let the chips fall where they may&quot; even though they could have <br/>\nprevented it.<br/>\n<br/>\nAre you saying it is &quot;natural&quot; for a parent to see the problems coming <br/>\nand not to step in to help out? As unschoolers, why would we withhold <br/>\nuseful information and advice and guidance and help from our kids?<br/>\n<br/>\nVidyut - I find it kind of hard to follow your writing, so I apologize <br/>\nif I&#39;ve misunderstood your point.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"sandralynndodd","from":"&quot;sandralynndodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;mom&#39;s needs first&quot;","postDate":"1264740884","msgId":50206,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqdHBtays3NjlzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5YzFkMWI0MTAwMTI4MjAwN3IyMzhkM2VhMmxkNTcxNjI5MjBhMDJjYjM5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50205,"nextInTopic":50207,"prevInTime":50205,"nextInTime":50207,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"... LOL is right up there with absurd and ridiculous when it follow s someone s serious statement. I don t know who told you unschooling isn t done.  Do","messageBody":"<div id=\"ygrps-yiv-219068085\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Vidyut Kale &lt;wide.aware@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; *&quot;**If she can&#39;t give enough to make unschooling better than school, she<br/>\n&gt; should put the child in school.&quot; *<br/>\n&gt; <br/>\n&gt; lol. I thought you can&#39;t *make* unschooling better than school, because<br/>\n&gt; unschooling isn&#39;t done, it happens when you allow it?<br/>\n<br/>\n<br/>\n </span></blockquote>LOL is right up there with &quot;absurd&quot; and &quot;ridiculous&quot; when it follow&#39;s someone&#39;s serious statement.<br/>\n<br/>\nI don&#39;t know who told you &quot;unschooling isn&#39;t done.&quot;  Do you really believe unschooling is something that just happens?  I think you&#39;ll feel differently when your child can walk and talk.  There are many things to do to make unschooling work.<br/>\n<br/>\nSimply keeping a child out of school isn&#39;t unschooling.  In India where school attendance isn&#39;t a legal mandate your flexibility is different, but if parents cannot and do not intend to try to make their children&#39;s lives better than they would have been in school, then I do think school would be better.  (Especially where compulsory attendance laws are in effect.)<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; *&quot;If she can&#39;t give enough to keep the child from being an absolute mess,<br/>\n&gt; she should give him up for adoption.&quot;<br/>\n&gt; *<br/>\n&gt; <br/>\n&gt; Wow? Who decides what constitutes absolute mess? Do you think it can be<br/>\n&gt; concluded before the child grows up?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Don&#39;t you think you are being very harsh?<br/>\n<br/>\n </span></blockquote>If a mother intends to put her own desires and preferences before her child&#39;s, she will not be a good mother.  I don&#39;t think I&#39;m being harsh at all to point that out.  I&#39;ve gone to great pains to be what I thought was a good mother, and it didn&#39;t just happen.  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<br/>\nI&#39;m not going door to door advising mothers.  I&#39;m only advising those who come to this list.  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"sandralynndodd","from":"&quot;sandralynndodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;mom&#39;s needs first&quot;","postDate":"1264740273","msgId":50205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqdHAzaCtrMGZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5YzFkMWI0MTAwMTI4MjAzMWs0NzU3YjFiN3VkNjBhMjFjMjFmZGViZTk4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50204,"nextInTopic":50206,"prevInTime":50204,"nextInTime":50206,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"-=-Las Vegas declares your statement absurd.-=- I let this post through even though I thought it was very impolite. I very much dislike anything being called","messageBody":"<div id=\"ygrps-yiv-531907158\">-=-Las Vegas declares your statement absurd.-=-<br/>\n<br/>\nI let this post through even though I thought it was very impolite.<br/>\n<br/>\nI very much dislike anything being called &quot;absurd&quot; or &quot;ridiculous.&quot;<br/>\n<br/>\nParenting is not about gambling.  If someone uses an analogy and I follow that analogy, that is not absurd.  <br/>\n<br/>\nI have three children who never went to school and who are happy.  People whose children are not school age, whose children might yet go to school and so nothing will have been different, should be very sweet and polite on this list until their children are older and until they/the parents have proven their usefulness.  And after that they should continue to be polite.<br/>\n<br/>\n-=So now what? I&#39;m doomed to a life of dancing to his tune? I&#39;d better send him to<br/>\nschool, where someone will take this kind of crap.-=-<br/>\n<br/>\nIf you define his actual needs as &quot;crap,&quot; you probably should send him to school.<br/>\n<br/>\n-= There is a huge difference between<br/>\nnot-interfering and caring. I don&#39;t have to stop him, but my true response<br/>\nbeing transparent is intimacy - whether I am gung ho, or pulling my hair<br/>\nout. It would be an insult to him to pretend enthusiasm and support for<br/>\neverything.-=-<br/>\n<br/>\nWherever you&#39;ve gathered your unschooling ideas, I don&#39;t understand your first two statements.  &quot;My true response to being transparent is intimacy&quot; doesn&#39;t make sense to me.  I honestly don&#39;t know what you&#39;re talking about.<br/>\n<br/>\n-= It would be an insult to him to pretend enthusiasm and support for<br/>\neverything.-=-<br/>\n<br/>\nNo one is asking you to pretend.  If you are to be your child&#39;s partner rather than his adversary, it can and will (if you want it to, if you work at it) become increasingly easy for you to BE enthusiastic and supportive, without any pretense whatsoever.<br/>\n<br/>\n-=Sure, I can support his curiosity and growth and let him discover natural<br/>\nconsequences. Natural consequences of EVERYTHING that is not dangerous -<br/>\nthis means also the consequences of invading another&#39;s space - that the<br/>\nother will not like it or will succumb, or will get angry, or will not like<br/>\nit but is open to allowing him with reservation and finding out, or will<br/>\navoid him, or whatever pans out. Why exclude emotional intelligence from the<br/>\npicture?-=-<br/>\n<br/>\nPart of having a partner who does have emotional intelligence (or any) is the advantage of sage counsel.  I didn&#39;t leave my children to discover from other people&#39;s responses alone what they might want to do to be courteous and polite.  Their lives aren&#39;t trial and error.  They have me and their dad and many other friends and relatives they can trust and count on to help them do well in the world.<br/>\n<br/>\ni hope you didn&#39;t say &quot;absurd&quot; to your mother in law, because I&#39;m kinda miffed about it myself.  Don&#39;t exclude emotional intelligence from this picture.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;mom&#39;s needs first&quot;","postDate":"1264739483","msgId":50204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI4MjAzMWs0NzU3YjFiN3VkNjBhMjFjMjFmZGViZTk4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhqdDdrYStqYmZvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqc2Fzdis5OTNsQGVHcm91cHMuY29tPiA8aGp0N2thK2piZm9AZUdyb3Vwcy5jb20+"},"prevInTopic":50202,"nextInTopic":50205,"prevInTime":50203,"nextInTime":50205,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"In card games there aren t compromises. Some suites trump others, period. The suits are not the game. They are the conditions. That is the stage for the","messageBody":"<div id=\"ygrps-yiv-1700417333\">&quot;In card games there aren&#39;t compromises. Some suites trump others, period.&quot;<br/>\n<br/>\nThe suits are not the game. They are the conditions. That is the stage for<br/>\nthe magic to begin, not a &#39;period&#39;. If a game were as dead decided as you<br/>\ndescribe, gambling wouldn&#39;t be in industry. Where is any unclarity to gamble<br/>\nupon? Las Vegas declares your statement absurd. There is such a thing as<br/>\nplay, skill, uh.... compromises( uh... compromized rules.... ch***ing<br/>\n*cough*)<br/>\n<br/>\nSure, I planned children (well, actually, we didn&#39;t, but let&#39;s say we<br/>\nunderstood that these things happen *blush*. We love the son anyway. So now<br/>\nwhat? I&#39;m doomed to a life of dancing to his tune? I&#39;d better send him to<br/>\nschool, where someone will take this kind of crap. It is because I love him<br/>\nthat I will not blindly agree. There is a huge difference between<br/>\nnot-interfering and caring. I don&#39;t have to stop him, but my true response<br/>\nbeing transparent is intimacy - whether I am gung ho, or pulling my hair<br/>\nout. It would be an insult to him to pretend enthusiasm and support for<br/>\neverything.<br/>\n<br/>\nSure, I can support his curiosity and growth and let him discover natural<br/>\nconsequences. Natural consequences of EVERYTHING that is not dangerous -<br/>\nthis means also the consequences of invading another&#39;s space - that the<br/>\nother will not like it or will succumb, or will get angry, or will not like<br/>\nit but is open to allowing him with reservation and finding out, or will<br/>\navoid him, or whatever pans out. Why exclude emotional intelligence from the<br/>\npicture?<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;mom&#39;s needs first&quot;","postDate":"1264738076","msgId":50202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI4MjAwN3IyMzhkM2VhMmxkNTcxNjI5MjBhMDJjYjM5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhqdDdrYStqYmZvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqc2Fzdis5OTNsQGVHcm91cHMuY29tPiA8aGp0N2thK2piZm9AZUdyb3Vwcy5jb20+"},"prevInTopic":50199,"nextInTopic":50204,"prevInTime":50201,"nextInTime":50203,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"* **If she can t give enough to make unschooling better than school, she should put the child in school. * lol. I thought you can t *make* unschooling better","messageBody":"<div id=\"ygrps-yiv-571435930\">*&quot;**If she can&#39;t give enough to make unschooling better than school, she<br/>\nshould put the child in school.&quot; *<br/>\n<br/>\nlol. I thought you can&#39;t *make* unschooling better than school, because<br/>\nunschooling isn&#39;t done, it happens when you allow it?<br/>\n<br/>\n<br/>\n*&quot;If she can&#39;t give enough to keep the child from being an absolute mess,<br/>\nshe should give him up for adoption.&quot;<br/>\n*<br/>\n<br/>\nWow? Who decides what constitutes absolute mess? Do you think it can be<br/>\nconcluded before the child grows up?<br/>\n<br/>\n<br/>\nDon&#39;t you think you are being very harsh?<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"sandralynndodd","from":"&quot;sandralynndodd&quot; &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;mom&#39;s needs first&quot;","postDate":"1264722378","msgId":50199,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqdDdrYStqYmZvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhqc2Fzdis5OTNsQGVHcm91cHMuY29tPg=="},"prevInTopic":50190,"nextInTopic":50202,"prevInTime":50198,"nextInTime":50200,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"-=-So now I m thinking that if traditional parenting is adult-centered, radical unschooling need not be child-centered. Everyone s needs, even Mom s, should be","messageBody":"<div id=\"ygrps-yiv-916147983\">-=-So now I&#39;m thinking that if traditional parenting is adult-centered, radical unschooling need not be child-centered. Everyone&#39;s needs, even Mom&#39;s, should be considered.-=-<br/>\n<br/>\nI agree to an extent, but not to the wall.  It shouldn&#39;t be 50/50, and the child shouldn&#39;t be expected to meet the mom&#39;s needs.<br/>\n<br/>\nThe mom should give as much as she possibly can.  If she can&#39;t give enough to make unschooling better than school, she should put the child in school.  If she can&#39;t give enough to keep the child from being an absolute mess, she should give him up for adoption.<br/>\n<br/>\nIf a family chooses to have children (and these days it IS a choice, even if the choice was to be Mormon or Catholic or &quot;full quiver&quot;), they have a duty to those children.  The children didn&#39;t pop up unexpectedly, when the parents are intelligent enough to take care of them at all.    <br/>\n<br/>\n-=-the very last thing I wanted was to have my needs trump hers.--<br/>\n<br/>\n-=-Maybe you didn&#39;t mean it that way, but it sounds like you&#39;re saying her needs trump yours.-=-<br/>\n<br/>\nIn card games there aren&#39;t compromises.  Some suites trump others, period.<br/>\n<br/>\nIf a card game analogy (or dominoes/42) is to be used, then one or the other must trump, and in an unschooling discussion, I&#39;d say that should tip toward the child.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: &quot;mom&#39;s needs first&quot;","postDate":"1264712381","msgId":50190,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5NzUxNC4yNzAucW1Ad2ViMTEwNDA2Lm1haWwuZ3ExLnlhaG9vLmNvbT4=","inReplyToHeader":"PGhqc2Fzdis5OTNsQGVHcm91cHMuY29tPg==","referencesHeader":"PGhqc2Fzdis5OTNsQGVHcm91cHMuY29tPg=="},"prevInTopic":50184,"nextInTopic":50199,"prevInTime":50189,"nextInTime":50191,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"***Maybe you didn t mean it that way, but it sounds like you re saying her needs trump yours. If your daughter was playing with a sibling who was a year or two","messageBody":"<div id=\"ygrps-yiv-426269489\">***Maybe you didn&#39;t mean it that way, but it sounds like you&#39;re saying her needs trump yours. If your daughter was playing with a sibling who was a year or two older, would you have told that sibling she had to play exactly how Margaux wanted?***<br/>\n<br/>\nNo, not at all.  It&#39;s better to find something that works for all parties.  We were visiting with a friend last week.  The girls were playing and getting along nicely the whole visit, then near the end, the other girl got really upset and was crying because she felt that Margaux was making all the decisions.  What had triggered it, was the naming of a doll that already had a name.  When we were talking about it, I told the other little girl that Margaux really dislikes it when other kids come over and make all the decisions and have all the ideas.  It&#39;s true, and even if Margaux was doing that, she will surely understand how that feels, and it&#39;s a way to talk about it.  Some kids are better at understanding from someone else&#39;s viewpoint and others take a while to gain that sort of empathy.<br/>\n<br/>\nMargaux has gotten a lot better about that sort of thing in the last year.  Talking to her about it later, she stated very clearly to me that she was  very much trying NOT to do what the other little girl felt she was doing.  She said that she was making suggestions, not commands, but the other girl took them as commands.  It made her sad that she had been accused of something that she was intentionally trying NOT to do.  <br/>\n<br/>\nThe girls were able to work it out and continue playing happily.  If they hadn&#39;t been able to, it simply would have involved more negotiating.  The key is to find ways to mesh each others needs together, not trump one or the others.  To me, if I&#39;d insisted on playing my music to play tag, I&#39;d have trumped her very stated needs of not wanting music.  Finding something else to play was a better option.  It didn&#39;t trump my needs, because my need to play music was specific to having and keeping momentum and energy for a rousing game of tag.<br/>\n<br/>\n***So now I&#39;m thinking that if traditional parenting is adult-centered, radical unschooling need not be child-centered. Everyone&#39;s needs, even Mom&#39;s, should be considered.***<br/>\n<br/>\nMom&#39;s needs should be considered, but since moms are usually better at negotiating skills than little kids, sometimes moms can find their needs being met in better ways than with confrontation with a child&#39;s needs.  I guess it&#39;s not either parent or child centered, it&#39;s more harmony centered.<br/>\n<br/>\n________________________________<br/>\nFrom: thecugals &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:thecugals@...\">thecugals@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Thu, January 28, 2010 7:35:59 AM<br/>\nSubject: [AlwaysLearning] Re: &quot;mom&#39;s needs first&quot;<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In AlwaysLearning@ yahoogroups. com, Jenny Cyphers &lt;jenstarc4@. ..&gt; wrote:<br/>\n<br/>\n--Our needs were at odds with one another and it created tension, but the very last thing I wanted was to have my needs trump hers.--<br/>\n<br/>\nMaybe you didn&#39;t mean it that way, but it sounds like you&#39;re saying her needs trump yours.  If your daughter was playing with a sibling who was a year or two older, would you have told that sibling she had to play exactly how Margaux wanted?  You probably would have tried to help them find a way to play that would have been fun for both of them.  I don&#39;t think you ought to feel bad about trying to make the activity fun for the both of you.  And in the end you got what you were shooting for--a nice connection with your daughter.<br/>\n<br/>\nI tend to put everybody else&#39;s needs before mine--husband&#39; s and kiddos&#39;--which means that my own needs often go unmet.  Heck, I didn&#39;t even realize I had any special needs (ha ha--I&#39;m a special needs parent).  I just wondered why I kept feeling depressed all the time.<br/>\n<br/>\nSo now I&#39;m thinking that if traditional parenting is adult-centered, radical unschooling need not be child-centered.  Everyone&#39;s needs, even Mom&#39;s, should be considered.<br/>\n<br/>\nBeth C.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":241447822,"authorName":"thecugals","from":"&quot;thecugals&quot; &lt;thecugals@...&gt;","profile":"thecugals","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;mom&#39;s needs first&quot;","postDate":"1264692959","msgId":50184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhqc2Fzdis5OTNsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzMzI0OS4yMjgucW1Ad2ViMTEwNDA0Lm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":50155,"nextInTopic":50190,"prevInTime":50183,"nextInTime":50185,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"... --Our needs were at odds with one another and it created tension, but the very last thing I wanted was to have my needs trump hers.-- Maybe you didn t mean","messageBody":"<div id=\"ygrps-yiv-653048660\"><blockquote><span title=\"qreply\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Jenny Cyphers &lt;jenstarc4@...&gt; wrote:<br/>\n<br/>\n--Our needs were at odds with one another and it created tension, but the very last thing I wanted was to have my needs trump hers.--<br/>\n<br/>\nMaybe you didn&#39;t mean it that way, but it sounds like you&#39;re saying her needs trump yours.  If your daughter was playing with a sibling who was a year or two older, would you have told that sibling she had to play exactly how Margaux wanted?  You probably would have tried to help them find a way to play that would have been fun for both of them.  I don&#39;t think you ought to feel bad about trying to make the activity fun for the both of you.  And in the end you got what you were shooting for--a nice connection with your daughter.<br/>\n<br/>\nI tend to put everybody else&#39;s needs before mine--husband&#39;s and kiddos&#39;--which means that my own needs often go unmet.  Heck, I didn&#39;t even realize I had any special needs (ha ha--I&#39;m a special needs parent).  I just wondered why I kept feeling depressed all the time.<br/>\n<br/>\nSo now I&#39;m thinking that if traditional parenting is adult-centered, radical unschooling need not be child-centered.  Everyone&#39;s needs, even Mom&#39;s, should be considered.<br/>\n<br/>\nBeth C. </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264629751","msgId":50155,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMzI0OS4yMjgucW1Ad2ViMTEwNDA0Lm1haWwuZ3ExLnlhaG9vLmNvbT4=","inReplyToHeader":"PEIyODAyMDJDNTQ2MzQyNTY5RDEyQjlDRTJBNUE2NzRDQExZTEFMQVAyPg==","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPiA8NTMwNEFFN0ItOThBNC00NDZELTgxNjYtRjRFMTVBOUZDREI5QGNvbWNhc3QubmV0PiA8RjMzRUE0NTItQjc0NS00Mzc0LUEzN0EtRUUwRkM1OTlGN0JDQGNvbWNhc3QubmV0PiA8QjI4MDIwMkM1NDYzNDI1NjlEMTJCOUNFMkE1QTY3NENATFlMQUxBUDI+"},"prevInTopic":50142,"nextInTopic":50184,"prevInTime":50154,"nextInTime":50156,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"***i was looking for something to offer when i (so frequently) hear that oft-quoted truism. i do think it s a truism, but not true, and not thoughtful or","messageBody":"<div id=\"ygrps-yiv-1637538040\">***i was looking for something to offer when i (so frequently) hear that oft-quoted truism. i do think it&#39;s a truism, but not true, and not thoughtful or examined. it&#39;s often used not only as a threat, as sandra says on that page, but also, more subtly, as an internal excuse to not do what our kids really need for us to do. whether that is unschooling, laying with them when they go to bed, helping/cleaning up for them, etc. <br/>\n<br/>\ni think the topic of mother burnout and isolated parenting is a very valuable topic to discuss and examine, but that concept is used so flippantly, sometimes by others trying to be &quot;helpful&quot; toward a mother expressing feelings of burnout, and i wish it got examined more.*** <br/>\n<br/>\nI&#39;ve come to the conclusion over and over again that it&#39;s pure selfishness, that feeling.  It&#39;s putting one&#39;s own needs above the needs of others.  Lots of people do it in lots of ways and find reasons to justify it.<br/>\n<br/>\nYesterday, Margaux wanted to play tag with me.  I&#39;ve never been a fan of tag, even as a little girl, and I was really tired yesterday, fighting an ear infection.  I really wanted to psych myself up to playing with her because I AM a fan of Margaux, so I put music on and it was really really helping me to gain momentum that I could keep going.  Margaux got really upset about it and insisted I turn it off.  So, it kind of ruined the whole thing for me and I told her she was being really mean and that I didn&#39;t feel like playing anymore because of the huge big stink she made over the music.<br/>\n<br/>\nThe whole experience was unpleasant.  She went to her room to play with her barbies and I went to the kitchen and cried and then started cleaning up a storm because that always helps me think more clearly about a situation.  Of course most mothers would feel completely justified in insisting on playing music while playing tag, but I really didn&#39;t, it made me feel terrible.  It was a stuck moment for me.<br/>\n<br/>\nSo, instead of revisiting the whole thing of playing tag and listening to music or not, I pulled out my mop and bucket and filled it with pine sol, something I think smells terrible, but I know for a fact that Margaux loves the smell of, and she loves to mop.  So I went in to where she was and told her I was using pine sol to mop the floor and that she would be welcome to join me if she wanted.  She said &quot;no&quot; at first, but then decided that it sounded fun.  We had a really good time cleaning the floor together.  Then, rather than revisit the idea that put us at odds, we did something different, we played hide and seek and barbies for the rest of the day.<br/>\n<br/>\nI wish I could&#39;ve moved past my needing music, I wish that we&#39;d never been at odds.  Our needs were at odds with one another and it created tension, but the very last thing I wanted was to have my needs trump hers.  Since that was my focus and where I am at, I found another way to BE with her that we could both enjoy.  Tag, for Margaux is a way of deep connection, is goes back to baby-hood games of &quot;I&#39;m gonna get you!&quot;, so hide and seek was very appropriate for that same connection.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":352545834,"authorName":"tiffermom@comcast.net","from":"tiffermom@...","profile":"tiffermomof5","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264615214","msgId":50142,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUwMTEzNTc4OC4xNDYzODMyMTI2NDYxNTIxNDQwMi5KYXZhTWFpbC5yb290QHN6MDAzOWEuZW1lcnl2aWxsZS5jYS5tYWlsLmNvbWNhc3QubmV0Pg==","inReplyToHeader":"PDE3NGRmOWRjMTAwMTI3MDY0MnRkMDg2Zjg0a2VjZGFhZTI1Y2M3ZTM3MmNAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":50136,"nextInTopic":50155,"prevInTime":50141,"nextInTime":50143,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"After I had my third child, I had a neighbor who had the picture perfect house. She was frugal, made everything from scratch, house was spotless and she threw","messageBody":"<div id=\"ygrps-yiv-225792107\">After I had my third child, I had a neighbor who had the picture perfect house. She was frugal, made everything from scratch, house was spotless and she threw the most amazing parties. It was Christmas time and I found myself crying because I couldn&#39;t keep my house up, and I couldn&#39;t even make a pie from scratch like my mom use to. My Mom happened to call just then and when I told her my frustration (not being as great as the neighbor and unable to make pie) she chuckled a bit and told me she hadn&#39;t make a pie from scratch in many years. She bought them from the store already made. I was shocked. She reminded me my kids love me just the way I am and so does she. And just after this conversation with my Mom, my then 8 year old who was listening to the whole thing told me how he loved our house more then the neighbors because even though the house &quot;looks&quot; perfect it is not a fun place to be. That is why their kids play at our house. Sometimes the things we think are important really aren&#39;t. I think a lot of Mom&#39;s needs would be met if she were not stressing herself out trying to be what someone else deems is perfection. My needs were met that day. Not by homemade pie or a clean house. They were met by love from my Mom and my son. <br/>\n<br/>\nTiffani <br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Marina DeLuca-Howard&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:delucahoward@...\">delucahoward@...</a>&gt; <br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Wednesday, January 27, 2010 6:42:05 AM GMT -08:00 US/Canada Pacific <br/>\nSubject: Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot; <br/>\n<br/>\n&gt;I understand that what you mean. The words jolted me :D Of course, meeting <br/>\n&gt;her need for assistance dealing with this perceived need is what you are <br/>\n&gt;talking about. <br/>\n<br/>\nYes, tragic incidents do occur with mothers who need help, but don&#39;t get <br/>\nany. Just a few blocks from my house an affluent mother, who was an <br/>\nacquaintance of mine wasn&#39;t so lucky. I remember feeling jealous of her <br/>\nallowance from her husband--just over $100 000 a year though my family <br/>\nof five lived on less than half of that. She had designer maternity wear, <br/>\nand her kids had all the best. She decided to have a large family of <br/>\nclosely spaced kids and was already planning her third pregnancy by the time <br/>\nher second daughter was a month old. This mom planned on tandem nursing <br/>\nboth the younger kids and she cooked gourmet meals, once telling me she <br/>\nowned fourteen different kinds of mustard. The other mothers marvelled at <br/>\nher perfection and egged her on: living vicariously on her story, while <br/>\naspiring to svelte figures, designer clothes and perfection. <br/>\n<br/>\nShe didn&#39;t recognize her baby blues, and as a perfectionist she hid her <br/>\nstress, so nobody knew. Things ended when she killed her husband, killed <br/>\nher eldest child, and wounded the middle child but the baby survived <br/>\ncompletely unharmed. Her husband placed the emergency call, but by the time <br/>\nhelp arrived it was too late and she ended up committing suicide. It is a <br/>\nhorrible story, and I remember for months afterward people being politer to <br/>\nmothers, worried I suppose we were all ticking time bombs. I think people <br/>\nwere shocked because she seemed to be the &quot;perfect&quot; mother and was already <br/>\ntalking about her fourth unconceived child. <br/>\n<br/>\nI remember feeling a bit inferior trying to lose &quot;baby weight&quot;, with a baby <br/>\nin a sling, in my whatever happened to be clean clothes that vaguely <br/>\nmatched, with my boys spaced three years apart, saying three kids was our <br/>\nlimit financially and emotionally, if we wanted to give the kids parental <br/>\nattention and freedom to explore. We didn&#39;t speak much after I told her how <br/>\nhard it is to have three kids and I tried to suggest she focus on the two <br/>\ngirls she already had for a while longer, before having a third child. <br/>\n<br/>\nOf course, I also knew La Leche mothers who had four kids in six years and <br/>\nthey seemed to cope well meeting the needs of their kids--though I often saw <br/>\ntears at meetings as they struggled with competing expectations. Many <br/>\nmothers looked for validation from other mothers because they felt <br/>\n*bad* serving <br/>\nfrozen lasagna to toddlers or pancakes and fruit three times a day, instead <br/>\nof the gourmet &#39;whole&#39; food meals they&#39;d imagined. They felt bad their <br/>\nhusbands were having to do so many chores after work and on weekends. I <br/>\nremember as a leader we discussed priorities, doing the best you can, and <br/>\nfocusing on loving your family. I wasn&#39;t strident about breastfeeding <br/>\nexclusively, though I did nurse my kids exclusively, because it is better to <br/>\nhave a healthy happy family, and have twins receive the occasional bottle <br/>\nonce a day than have mom fretting and unable to cope. <br/>\n<br/>\nMac and cheese by candlelight, served with fruits or salad/veggies made with <br/>\nlove is way better than overstretching with a gourmet meal made of organic <br/>\nbison, with wild crafted mushrooms served over an exotic grain dish by a <br/>\ncranky exhausted mother. I learned from my own experience to try to live in <br/>\nthe moment and follow a path with my family, trying to slough of <br/>\npreconceptions of the perfect mother. It doesn&#39;t make you popular when you <br/>\nfocus on love and freedom, but it sure seems to make things better <br/>\nemotionally for the family as a whole and really what values or ethics are <br/>\nworth jeopardizing that safe joyfilled nest? <br/>\n<br/>\nMarina <br/>\n<br/>\n<br/>\n<br/>\n2010/1/27 Vidyut Kale &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wide.aware@...\">wide.aware@...</a>&gt; <br/>\n<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &quot;if mom&#39;s convinced she needs to kill her baby because he is an alien it is <br/>\n&gt; a <br/>\n&gt; case of meeting her need so everyone can be safe.&quot; <br/>\n&gt; <br/>\n&gt; I understand that what you mean. The words jolted me :D Of course, meeting <br/>\n&gt; her need for assistance dealing with this perceived need is what you are <br/>\n&gt; talking about. <br/>\n&gt; <br/>\n&gt; Its an incredible story. <br/>\n&gt; <br/>\n&gt; Vidyut <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; On Wed, Jan 27, 2010 at 4:30 PM, Marina DeLuca-Howard &lt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:delucahoward@...\">delucahoward@...</a> &lt;delucahoward%40gmail.com&gt;&gt; wrote: <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; In extraordinary circumstances it is good to put on your oxygen mask <br/>\n&gt; first, <br/>\n&gt; &gt; because that can save the baby. My friend&#39;s neighbour noticed she was <br/>\n&gt; &gt; having postpartum psychotic episodes. She fearfully told her husband, <br/>\n&gt; went <br/>\n&gt; &gt; on heavy medication, went back to work as a lawyer and he became the <br/>\n&gt; &gt; primary <br/>\n&gt; &gt; caregiver. She played, sang to and changed the baby under dad&#39;s watchful <br/>\n&gt; &gt; eye. When I met him he was a control freak kind of guy, but when my <br/>\n&gt; friend <br/>\n&gt; &gt; told me this story I realized why he helicoptered around his only child. <br/>\n&gt; &gt; <br/>\n&gt; &gt; I might be pro breastfeeding and a big advocate of mothers and babies, <br/>\n&gt; but <br/>\n&gt; &gt; if mom&#39;s convinced she needs to kill her baby because he is an alien it <br/>\n&gt; is <br/>\n&gt; &gt; a <br/>\n&gt; &gt; case of meeting her need so everyone can be safe. The episodes for her <br/>\n&gt; were <br/>\n&gt; &gt; brief, and she was lucid enough to know putting her baby&#39;s needs first in <br/>\n&gt; &gt; this case meant dad bottlefeeding, her returning to work on medication <br/>\n&gt; and <br/>\n&gt; &gt; her not being alone with the baby, even though she was envisioning <br/>\n&gt; &gt; mothering <br/>\n&gt; &gt; him differently. It was difficult for her to get help, but she did it. I <br/>\n&gt; &gt; have seen them over the years and she truly loves her son--but for the <br/>\n&gt; &gt; first <br/>\n&gt; &gt; few months of his life she needed to &quot;have an oxygen mask&quot;. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Marina <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; [Non-text portions of this message have been removed] <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed] <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nRent our cottage: <a rel=\"nofollow\" target=\"_blank\" href=\"http://davehoward.ca/cottage/\">http://davehoward.ca/cottage/</a> <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] <br/>\n<br/>\n<br/>\n<br/>\n------------------------------------ <br/>\n<br/>\nYahoo! Groups Links <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264608673","msgId":50136,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0QUMzRDY4LTNBNzMtNEUwQi1CREJELUI5RDBBQ0U5QUY0Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDE3NGRmOWRjMTAwMTI3MDMwMGk2MjdkM2YwZnNiYWY1ZDg1YmZkNmJmYmFmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPiA8NTMwNEFFN0ItOThBNC00NDZELTgxNjYtRjRFMTVBOUZDREI5QGNvbWNhc3QubmV0PiA8RjMzRUE0NTItQjc0NS00Mzc0LUEzN0EtRUUwRkM1OTlGN0JDQGNvbWNhc3QubmV0PiA8QjI4MDIwMkM1NDYzNDI1NjlEMTJCOUNFMkE1QTY3NENATFlMQUxBUDI+IDw3RDZBQjkxRi02RjJDLTQ2MjctODgxRC01M0E5MjE1RjNFRkJAY29tY2FzdC5uZXQ+IDwxNzRkZjlkYzEwMDEyNzAzMDBpNjI3ZDNmMGZzYmFmNWQ4NWJmZDZiZmJhZkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":50133,"nextInTopic":50142,"prevInTime":50135,"nextInTime":50137,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"-=-I might be pro breastfeeding and a big advocate of mothers and babies, but if mom s convinced she needs to kill her baby because he is an alien it is a case","messageBody":"<div id=\"ygrps-yiv-1003964380\">-=-I might be pro breastfeeding and a big advocate of mothers and  <br/>\nbabies, but<br/>\nif mom&#39;s convinced she needs to kill her baby because he is an alien  <br/>\nit is a<br/>\ncase of meeting her need so everyone can be safe. The episodes for her  <br/>\nwere<br/>\nbrief, and she was lucid enough to know putting her baby&#39;s needs first  <br/>\nin<br/>\nthis case meant dad bottlefeeding, her returning to work on medication  <br/>\nand<br/>\nher not being alone with the baby, even though she was envisioning  <br/>\nmothering<br/>\nhim differently-=-<br/>\n<br/>\nSo that comes down to being another &quot;put the baby first&quot; story.<br/>\n<br/>\nMany moms seem to feel that they can&#39;t be present for their children  <br/>\nuntil &quot;their own needs are met,&quot; but kids&#39; needs can&#39;t be put off  <br/>\nmuch, or the whole world is needy.  And honestly, I bet we all know  <br/>\nfamilies where every single family member has a lifetime of unmet needs.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264603325","msgId":50133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMTAwMTI3MDY0MnRkMDg2Zjg0a2VjZGFhZTI1Y2M3ZTM3MmNAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PDc5YzFkMWI0MTAwMTI3MDMwN3U2MzNjYjc4ZGkxM2FkYjMyMzE4MmEwYmE5QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPgkgPDUzMDRBRTdCLTk4QTQtNDQ2RC04MTY2LUY0RTE1QTlGQ0RCOUBjb21jYXN0Lm5ldD4JIDxGMzNFQTQ1Mi1CNzQ1LTQzNzQtQTM3QS1FRTBGQzU5OUY3QkNAY29tY2FzdC5uZXQ+CSA8QjI4MDIwMkM1NDYzNDI1NjlEMTJCOUNFMkE1QTY3NENATFlMQUxBUDI+CSA8N0Q2QUI5MUYtNkYyQy00NjI3LTg4MUQtNTNBOTIxNUYzRUZCQGNvbWNhc3QubmV0PgkgPDE3NGRmOWRjMTAwMTI3MDMwMGk2MjdkM2YwZnNiYWY1ZDg1YmZkNmJmYmFmQG1haWwuZ21haWwuY29tPgkgPDc5YzFkMWI0MTAwMTI3MDMwN3U2MzNjYjc4ZGkxM2FkYjMyMzE4MmEwYmE5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50131,"nextInTopic":50136,"prevInTime":50132,"nextInTime":50134,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"... Yes, tragic incidents do occur with mothers who need help, but don t get any.  Just a few blocks from my house an affluent mother, who was an acquaintance","messageBody":"<div id=\"ygrps-yiv-428893293\"><blockquote><span title=\"ireply\">&gt;I understand that what you mean. The words jolted me :D Of course, meeting<br/>\n&gt;her need for assistance dealing with this perceived need is what you are<br/>\n&gt;talking about.<br/>\n<br/>\n </span></blockquote>Yes, tragic incidents do occur with mothers who need help, but don&#39;t get<br/>\nany.  Just a few blocks from my house an affluent mother, who was an<br/>\nacquaintance of mine wasn&#39;t so lucky.  I remember feeling jealous of her<br/>\nallowance from her husband--just over $100 000 a year though my family<br/>\nof five lived on less than half of that.  She had designer maternity wear,<br/>\nand her kids had all the best.  She decided to have a large family of<br/>\nclosely spaced kids and was already planning her third pregnancy by the time<br/>\nher second daughter was a month old.  This mom planned on tandem nursing<br/>\nboth the younger kids and she cooked gourmet meals, once telling me she<br/>\nowned fourteen different kinds of mustard.  The other mothers marvelled at<br/>\nher perfection and egged her on: living vicariously on her story, while<br/>\naspiring to svelte figures, designer clothes and perfection.<br/>\n<br/>\nShe didn&#39;t recognize her baby blues, and as a perfectionist she hid her<br/>\nstress, so nobody knew.  Things ended when she killed her husband, killed<br/>\nher eldest child, and wounded the middle child but the baby survived<br/>\ncompletely unharmed.  Her husband placed the emergency call, but by the time<br/>\nhelp arrived it was too late and she ended up committing suicide.  It is a<br/>\nhorrible story, and I remember for months afterward people being politer to<br/>\nmothers, worried I suppose we were all ticking time bombs.  I think people<br/>\nwere shocked because she seemed to be the &quot;perfect&quot; mother and was already<br/>\ntalking about her fourth unconceived child.<br/>\n<br/>\nI remember feeling a bit inferior trying to lose &quot;baby weight&quot;, with a baby<br/>\nin a sling, in my whatever happened to be clean clothes that vaguely<br/>\nmatched, with my boys spaced three years apart, saying three kids was our<br/>\nlimit financially and emotionally, if we wanted to give the kids parental<br/>\nattention and freedom to explore.  We didn&#39;t speak much after I told her how<br/>\nhard it is to have three kids and I tried to suggest she focus on the two<br/>\ngirls she already had for a while longer, before having a third child.<br/>\n<br/>\nOf course, I also knew La Leche mothers who had four kids in six years and<br/>\nthey seemed to cope well meeting the needs of their kids--though I often saw<br/>\ntears at meetings as they struggled with competing expectations.  Many<br/>\nmothers looked for validation from other mothers because they felt<br/>\n*bad* serving<br/>\nfrozen lasagna to toddlers or pancakes and fruit three times a day, instead<br/>\nof the gourmet &#39;whole&#39; food meals they&#39;d imagined.  They felt bad their<br/>\nhusbands were having to do so many chores after work and on weekends.  I<br/>\nremember as a leader we discussed priorities, doing the best you can, and<br/>\nfocusing on loving your family.  I wasn&#39;t strident about breastfeeding<br/>\nexclusively, though I did nurse my kids exclusively, because it is better to<br/>\nhave a healthy happy family, and have twins receive the occasional bottle<br/>\nonce a day than have mom fretting and unable to cope.<br/>\n<br/>\nMac and cheese by candlelight, served with fruits or salad/veggies made with<br/>\nlove is way better than overstretching with a gourmet meal made of organic<br/>\nbison, with wild crafted mushrooms served over an exotic grain dish by a<br/>\ncranky exhausted mother.  I learned from my own experience to try to live in<br/>\nthe moment and follow a path with my family, trying to slough of<br/>\npreconceptions of the perfect mother.  It doesn&#39;t make you popular when you<br/>\nfocus on love and freedom, but it sure seems to make things better<br/>\nemotionally for the family as a whole and really what values or ethics are<br/>\nworth jeopardizing that safe joyfilled nest?<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n<br/>\n2010/1/27 Vidyut Kale &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:wide.aware@...\">wide.aware@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; &quot;if mom&#39;s convinced she needs to kill her baby because he is an alien it is<br/>\n&gt; a<br/>\n&gt; case of meeting her need so everyone can be safe.&quot;<br/>\n&gt;<br/>\n&gt; I understand that what you mean. The words jolted me :D Of course, meeting<br/>\n&gt; her need for assistance dealing with this perceived need is what you are<br/>\n&gt; talking about.<br/>\n&gt;<br/>\n&gt; Its an incredible story.<br/>\n&gt;<br/>\n&gt; Vidyut<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; On Wed, Jan 27, 2010 at 4:30 PM, Marina DeLuca-Howard &lt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:delucahoward@...\">delucahoward@...</a> &lt;delucahoward%40gmail.com&gt;&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; In extraordinary circumstances it is good to put on your oxygen mask<br/>\n&gt; first,<br/>\n&gt; &gt; because that can save the baby. My friend&#39;s neighbour noticed she was<br/>\n&gt; &gt; having postpartum psychotic episodes. She fearfully told her husband,<br/>\n&gt; went<br/>\n&gt; &gt; on heavy medication, went back to work as a lawyer and he became the<br/>\n&gt; &gt; primary<br/>\n&gt; &gt; caregiver. She played, sang to and changed the baby under dad&#39;s watchful<br/>\n&gt; &gt; eye. When I met him he was a control freak kind of guy, but when my<br/>\n&gt; friend<br/>\n&gt; &gt; told me this story I realized why he helicoptered around his only child.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I might be pro breastfeeding and a big advocate of mothers and babies,<br/>\n&gt; but<br/>\n&gt; &gt; if mom&#39;s convinced she needs to kill her baby because he is an alien it<br/>\n&gt; is<br/>\n&gt; &gt; a<br/>\n&gt; &gt; case of meeting her need so everyone can be safe. The episodes for her<br/>\n&gt; were<br/>\n&gt; &gt; brief, and she was lucid enough to know putting her baby&#39;s needs first in<br/>\n&gt; &gt; this case meant dad bottlefeeding, her returning to work on medication<br/>\n&gt; and<br/>\n&gt; &gt; her not being alone with the baby, even though she was envisioning<br/>\n&gt; &gt; mothering<br/>\n&gt; &gt; him differently. It was difficult for her to get help, but she did it. I<br/>\n&gt; &gt; have seen them over the years and she truly loves her son--but for the<br/>\n&gt; &gt; first<br/>\n&gt; &gt; few months of his life she needed to &quot;have an oxygen mask&quot;.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Marina<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>-- <br/>\nRent our cottage:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://davehoward.ca/cottage/\">http://davehoward.ca/cottage/</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264590443","msgId":50131,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMTI3MDMwN3U2MzNjYjc4ZGkxM2FkYjMyMzE4MmEwYmE5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDE3NGRmOWRjMTAwMTI3MDMwMGk2MjdkM2YwZnNiYWY1ZDg1YmZkNmJmYmFmQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPgkgPDUzMDRBRTdCLTk4QTQtNDQ2RC04MTY2LUY0RTE1QTlGQ0RCOUBjb21jYXN0Lm5ldD4JIDxGMzNFQTQ1Mi1CNzQ1LTQzNzQtQTM3QS1FRTBGQzU5OUY3QkNAY29tY2FzdC5uZXQ+CSA8QjI4MDIwMkM1NDYzNDI1NjlEMTJCOUNFMkE1QTY3NENATFlMQUxBUDI+CSA8N0Q2QUI5MUYtNkYyQy00NjI3LTg4MUQtNTNBOTIxNUYzRUZCQGNvbWNhc3QubmV0PgkgPDE3NGRmOWRjMTAwMTI3MDMwMGk2MjdkM2YwZnNiYWY1ZDg1YmZkNmJmYmFmQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50126,"nextInTopic":50133,"prevInTime":50130,"nextInTime":50132,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"if mom s convinced she needs to kill her baby because he is an alien it is a case of meeting her need so everyone can be safe. I understand that what you","messageBody":"<div id=\"ygrps-yiv-858681693\">&quot;if mom&#39;s convinced she needs to kill her baby because he is an alien it is<br/>\na<br/>\ncase of meeting her need so everyone can be safe.&quot;<br/>\n<br/>\nI understand that what you mean. The words jolted me :D Of course, meeting<br/>\nher need for assistance dealing with this perceived need is what you are<br/>\ntalking about.<br/>\n<br/>\nIts an incredible story.<br/>\n<br/>\nVidyut<br/>\n<br/>\nOn Wed, Jan 27, 2010 at 4:30 PM, Marina DeLuca-Howard &lt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:delucahoward@...\">delucahoward@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; In extraordinary circumstances it is good to put on your oxygen mask first,<br/>\n&gt; because that can save the baby. My friend&#39;s neighbour noticed she was<br/>\n&gt; having postpartum psychotic episodes. She fearfully told her husband, went<br/>\n&gt; on heavy medication, went back to work as a lawyer and he became the<br/>\n&gt; primary<br/>\n&gt; caregiver. She played, sang to and changed the baby under dad&#39;s watchful<br/>\n&gt; eye. When I met him he was a control freak kind of guy, but when my friend<br/>\n&gt; told me this story I realized why he helicoptered around his only child.<br/>\n&gt;<br/>\n&gt; I might be pro breastfeeding and a big advocate of mothers and babies, but<br/>\n&gt; if mom&#39;s convinced she needs to kill her baby because he is an alien it is<br/>\n&gt; a<br/>\n&gt; case of meeting her need so everyone can be safe. The episodes for her were<br/>\n&gt; brief, and she was lucid enough to know putting her baby&#39;s needs first in<br/>\n&gt; this case meant dad bottlefeeding, her returning to work on medication and<br/>\n&gt; her not being alone with the baby, even though she was envisioning<br/>\n&gt; mothering<br/>\n&gt; him differently. It was difficult for her to get help, but she did it. I<br/>\n&gt; have seen them over the years and she truly loves her son--but for the<br/>\n&gt; first<br/>\n&gt; few months of his life she needed to &quot;have an oxygen mask&quot;.<br/>\n&gt;<br/>\n&gt; Marina<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":301108410,"authorName":"Marina DeLuca-Howard","from":"Marina DeLuca-Howard &lt;delucahoward@...&gt;","profile":"matedgirl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264590045","msgId":50126,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3NGRmOWRjMTAwMTI3MDMwMGk2MjdkM2YwZnNiYWY1ZDg1YmZkNmJmYmFmQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDdENkFCOTFGLTZGMkMtNDYyNy04ODFELTUzQTkyMTVGM0VGQkBjb21jYXN0Lm5ldD4=","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPgkgPDUzMDRBRTdCLTk4QTQtNDQ2RC04MTY2LUY0RTE1QTlGQ0RCOUBjb21jYXN0Lm5ldD4JIDxGMzNFQTQ1Mi1CNzQ1LTQzNzQtQTM3QS1FRTBGQzU5OUY3QkNAY29tY2FzdC5uZXQ+CSA8QjI4MDIwMkM1NDYzNDI1NjlEMTJCOUNFMkE1QTY3NENATFlMQUxBUDI+CSA8N0Q2QUI5MUYtNkYyQy00NjI3LTg4MUQtNTNBOTIxNUYzRUZCQGNvbWNhc3QubmV0Pg=="},"prevInTopic":50118,"nextInTopic":50131,"prevInTime":50125,"nextInTime":50127,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"In extraordinary circumstances it is good to put on your oxygen mask first, because that can save the baby.  My friend s neighbour noticed she was having","messageBody":"<div id=\"ygrps-yiv-1492206748\">In extraordinary circumstances it is good to put on your oxygen mask first,<br/>\nbecause that can save the baby.  My friend&#39;s neighbour noticed she was<br/>\nhaving postpartum psychotic episodes.  She fearfully told her husband, went<br/>\non heavy medication, went back to work as a lawyer and he became the primary<br/>\ncaregiver.  She played, sang to and changed the baby under dad&#39;s watchful<br/>\neye.  When I met him he was a control freak kind of guy, but when my friend<br/>\ntold me this story I realized why he helicoptered around his only child.<br/>\n<br/>\nI might be pro breastfeeding and a big advocate of mothers and babies, but<br/>\nif mom&#39;s convinced she needs to kill her baby because he is an alien it is a<br/>\ncase of meeting her need so everyone can be safe.  The episodes for her were<br/>\nbrief, and she was lucid enough to know putting her baby&#39;s needs first in<br/>\nthis case meant dad bottlefeeding, her returning to work on medication and<br/>\nher not being alone with the baby, even though she was envisioning mothering<br/>\nhim differently.  It was difficult for her to get help, but she did it.  I<br/>\nhave seen them over the years and she truly loves her son--but for the first<br/>\nfew months of his life she needed to &quot;have an oxygen mask&quot;.<br/>\n<br/>\nMarina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264548685","msgId":50118,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdENkFCOTFGLTZGMkMtNDYyNy04ODFELTUzQTkyMTVGM0VGQkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEIyODAyMDJDNTQ2MzQyNTY5RDEyQjlDRTJBNUE2NzRDQExZTEFMQVAyPg==","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPiA8NTMwNEFFN0ItOThBNC00NDZELTgxNjYtRjRFMTVBOUZDREI5QGNvbWNhc3QubmV0PiA8RjMzRUE0NTItQjc0NS00Mzc0LUEzN0EtRUUwRkM1OTlGN0JDQGNvbWNhc3QubmV0PiA8QjI4MDIwMkM1NDYzNDI1NjlEMTJCOUNFMkE1QTY3NENATFlMQUxBUDI+"},"prevInTopic":50116,"nextInTopic":50126,"prevInTime":50117,"nextInTime":50119,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"... No need! It was by serendipity that I remembered there was a search feature. And I had a good combination of words. So I thought I d pass that avenue along","messageBody":"<div id=\"ygrps-yiv-125653569\">On Jan 26, 2010, at 2:10 PM, Lyla Wolfenstein wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; ***********<br/>\n&gt; Oh, and I found them by using the search feature at the bottom of<br/>\n&gt; Sandra&#39;s Unschooling page and typing &quot;if momma ain&#39;t happy&quot; &lt;g&gt;.<br/>\n&gt;<br/>\n&gt; Robin B.<br/>\n&gt; **********<br/>\n&gt;<br/>\n&gt; thanks robin - i feel sheepish - i am usually a really good internet  <br/>\n&gt; searcher, not sure what happened there :)<br/>\n<br/>\n </span></blockquote>No need! It was by serendipity that I remembered there was a search  <br/>\nfeature. And I had a good combination of words. So I thought I&#39;d pass  <br/>\nthat avenue along &lt;g&gt;.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264544998","msgId":50116,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU4OUVEQ0FFOTQ0RjRCQzQ5NTQyRkY3RDc5NDREQkE1QExZTEFMQVAyPg==","inReplyToHeader":"PEE5RUZCRkM0LUQ0NEEtNERCNS05MjlDLTE3QTI4MjhEQkZFN0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPiA8NTMwNEFFN0ItOThBNC00NDZELTgxNjYtRjRFMTVBOUZDREI5QGNvbWNhc3QubmV0PiA8RjMzRUE0NTItQjc0NS00Mzc0LUEzN0EtRUUwRkM1OTlGN0JDQGNvbWNhc3QubmV0PiA8QjI4MDIwMkM1NDYzNDI1NjlEMTJCOUNFMkE1QTY3NENATFlMQUxBUDI+IDxBOUVGQkZDNC1ENDRBLTREQjUtOTI5Qy0xN0EyODI4REJGRTdAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":50115,"nextInTopic":50118,"prevInTime":50115,"nextInTime":50117,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"wow! i didn t even know you could do that!  thanks! lyla ... From: Sandra Dodd To: AlwaysLearning@yahoogroups.com Sent: Tuesday, January 26, 2010 2:17 PM ","messageBody":"<div id=\"ygrps-yiv-1962529643\">wow! i didn&#39;t even know you could do that!  thanks!<br/>\n<br/>\nlyla<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Sandra Dodd <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Tuesday, January 26, 2010 2:17 PM<br/>\n  Subject: Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;<br/>\n<br/>\n<br/>\n    <br/>\n  -=-<br/>\n  thanks robin - i feel sheepish - i am usually a really good internet <br/>\n  searcher, not sure what happened there :)-=-<br/>\n<br/>\n  Hey, I didn&#39;t find it first try myself.<br/>\n<br/>\n  I have a new search with five unschooling sites all in one!<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://unschooling.blogspot.com\">http://unschooling.blogspot.com</a><br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264544237","msgId":50115,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5RUZCRkM0LUQ0NEEtNERCNS05MjlDLTE3QTI4MjhEQkZFN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEIyODAyMDJDNTQ2MzQyNTY5RDEyQjlDRTJBNUE2NzRDQExZTEFMQVAyPg==","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPiA8NTMwNEFFN0ItOThBNC00NDZELTgxNjYtRjRFMTVBOUZDREI5QGNvbWNhc3QubmV0PiA8RjMzRUE0NTItQjc0NS00Mzc0LUEzN0EtRUUwRkM1OTlGN0JDQGNvbWNhc3QubmV0PiA8QjI4MDIwMkM1NDYzNDI1NjlEMTJCOUNFMkE1QTY3NENATFlMQUxBUDI+"},"prevInTopic":50114,"nextInTopic":50116,"prevInTime":50114,"nextInTime":50116,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"-=- thanks robin - i feel sheepish - i am usually a really good internet searcher, not sure what happened there :)-=- Hey, I didn t find it first try myself. I","messageBody":"<div id=\"ygrps-yiv-439968829\">-=-<br/>\nthanks robin - i feel sheepish - i am usually a really good internet  <br/>\nsearcher, not sure what happened there :)-=-<br/>\n<br/>\nHey, I didn&#39;t find it first try myself.<br/>\n<br/>\n<br/>\nI have a new search with five unschooling sites all in one!<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://unschooling.blogspot.com\">http://unschooling.blogspot.com</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264543809","msgId":50114,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyODAyMDJDNTQ2MzQyNTY5RDEyQjlDRTJBNUE2NzRDQExZTEFMQVAyPg==","inReplyToHeader":"PEYzM0VBNDUyLUI3NDUtNDM3NC1BMzdBLUVFMEZDNTk5RjdCQ0Bjb21jYXN0Lm5ldD4=","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPiA8NTMwNEFFN0ItOThBNC00NDZELTgxNjYtRjRFMTVBOUZDREI5QGNvbWNhc3QubmV0PiA8RjMzRUE0NTItQjc0NS00Mzc0LUEzN0EtRUUwRkM1OTlGN0JDQGNvbWNhc3QubmV0Pg=="},"prevInTopic":50112,"nextInTopic":50115,"prevInTime":50113,"nextInTime":50115,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"*********** Oh, and I found them by using the search feature at the bottom of Sandra s Unschooling page and typing if momma ain t happy . Robin B. ","messageBody":"<div id=\"ygrps-yiv-89819775\">***********<br/>\nOh, and I found them by using the search feature at the bottom of <br/>\nSandra&#39;s Unschooling page and typing &quot;if momma ain&#39;t happy&quot; &lt;g&gt;.<br/>\n<br/>\nRobin B.<br/>\n**********<br/>\n<br/>\nthanks robin - i feel sheepish - i am usually a really good internet searcher, not sure what happened there :)<br/>\n<br/>\ni was looking for something to offer when i (so frequently) hear that oft-quoted truism.  i do think it&#39;s a truism, but not true, and not thoughtful or examined.  it&#39;s often used not only as a threat, as sandra says on that page, but also, more subtly, as an internal excuse to not do what our kids really need for us to do.  whether that is unschooling, laying with them when they go to bed, helping/cleaning up for them, etc. <br/>\n<br/>\ni think the topic of mother burnout and isolated parenting is a very valuable topic to discuss and examine, but that concept is used so flippantly, sometimes by others trying to be &quot;helpful&quot; toward a mother expressing feelings of burnout, and i wish it got examined  more.  <br/>\n<br/>\nthe discussion on that page isn&#39;t quite in depth enough for me to use (as a link) to get the point i am trying to make across for others, as i realize, reading it, that it&#39;s really years worth of posts on this list and a more global mental collection of perspectives from  the unschooling voices out there, that i am trying to distill.  and it&#39;s too much to distill, maybe?<br/>\n<br/>\nlyla<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264543119","msgId":50112,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVEMjFBOEQxQkE1MTQ0NzU5OEVBQTMwRjkzMjY4NjdDQExZTEFMQVAyPg==","inReplyToHeader":"PEY4RTRGMkFCLTc1RDgtNDgzNy05MzFELUFDNEZCQTNBN0YxREBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPiA8RjhFNEYyQUItNzVEOC00ODM3LTkzMUQtQUM0RkJBM0E3RjFEQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":50111,"nextInTopic":50114,"prevInTime":50111,"nextInTime":50113,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"-=-i know i have read some good discussion on this list about the oft quoted fallacy of putting on your own oxygen mask first -=- I don t think that s a","messageBody":"<div id=\"ygrps-yiv-858972068\">-=-i know i have read some good discussion on this list about the oft <br/>\n  quoted fallacy of &quot;putting on your own oxygen mask first&quot;-=-<br/>\n<br/>\n  I don&#39;t think that&#39;s a fallacy. In literal airplane emergency <br/>\n  situations, the baby won&#39;t be able to assist the mom.<br/>\n<br/>\n  About people extending that too every aspect of their own lives and <br/>\n  saying they need an hour-long bubble bath...<br/>\n  *******************<br/>\n<br/>\n  yes, that is what i meant.  sorry i wasn&#39;t more clear.  thanks!<br/>\n<br/>\n  lyla<br/>\n<br/>\n  MARKETPLACE<br/>\n  Going Green: Your Yahoo! Groups resource for green living<br/>\n   Switch to: Text-Only, Daily Digest . Unsubscribe . Terms of Use.<br/>\n   <br/>\n  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264542338","msgId":50111,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzM0VBNDUyLUI3NDUtNDM3NC1BMzdBLUVFMEZDNTk5RjdCQ0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDUzMDRBRTdCLTk4QTQtNDQ2RC04MTY2LUY0RTE1QTlGQ0RCOUBjb21jYXN0Lm5ldD4=","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPiA8NTMwNEFFN0ItOThBNC00NDZELTgxNjYtRjRFMTVBOUZDREI5QGNvbWNhc3QubmV0Pg=="},"prevInTopic":50110,"nextInTopic":50112,"prevInTime":50110,"nextInTime":50112,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"... Oh, and I found them by using the search feature at the bottom of Sandra s Unschooling page and typing if momma ain t happy . Robin B. [Non-text","messageBody":"<div id=\"ygrps-yiv-426414978\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/phrases\">http://sandradodd.com/phrases</a><br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/mama\">http://sandradodd.com/peace/mama</a><br/>\n&gt;<br/>\n&gt; Links are listed on &quot;peace/mama&quot;, too. The AlwaysLearning link takes<br/>\n&gt; you right to the discussion!<br/>\n<br/>\n </span></blockquote>Oh, and I found them by using the search feature at the bottom of  <br/>\nSandra&#39;s Unschooling page and typing &quot;if momma ain&#39;t happy&quot; &lt;g&gt;.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264542151","msgId":50110,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzMDRBRTdCLTk4QTQtNDQ2RC04MTY2LUY0RTE1QTlGQ0RCOUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPg==","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPg=="},"prevInTopic":50109,"nextInTopic":50111,"prevInTime":50109,"nextInTime":50111,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"... http://sandradodd.com/phrases http://sandradodd.com/peace/mama Links are listed on peace/mama , too. The AlwaysLearning link takes you right to the","messageBody":"<div id=\"ygrps-yiv-366460844\">On Jan 26, 2010, at 1:30 PM, Lyla Wolfenstein wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i know i have read some good discussion on this list about the oft  <br/>\n&gt; quoted fallacy of &quot;putting on your own oxygen mask first&quot; and &quot;if  <br/>\n&gt; mom ain&#39;t happy ain&#39;t nobody happy&quot; etc.<br/>\n&gt;<br/>\n&gt; i have searched a bit and can&#39;t seem to find it.  anyone have links  <br/>\n&gt; to those discussions or pages on sandra&#39;s or joyce&#39;s site?<br/>\n<br/>\n </span></blockquote><a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/phrases\">http://sandradodd.com/phrases</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/mama\">http://sandradodd.com/peace/mama</a><br/>\n<br/>\nLinks are listed on &quot;peace/mama&quot;, too. The AlwaysLearning link takes  <br/>\nyou right to the discussion!<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264541974","msgId":50109,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyREE1QTkxLTJGNTItNDg3RS1CMEE1LTMwNDJEMTA1RTVFMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPg==","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPg=="},"prevInTopic":50108,"nextInTopic":50110,"prevInTime":50108,"nextInTime":50110,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"this one, I bet: http://sandradodd.com/peace/mama","messageBody":"<div id=\"ygrps-yiv-491875283\">this one, I bet:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/peace/mama\">http://sandradodd.com/peace/mama</a></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;mom&#39;s needs first&quot;","postDate":"1264541917","msgId":50108,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY4RTRGMkFCLTc1RDgtNDgzNy05MzFELUFDNEZCQTNBN0YxREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPg==","referencesHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPg=="},"prevInTopic":50107,"nextInTopic":50109,"prevInTime":50107,"nextInTime":50109,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"-=-i know i have read some good discussion on this list about the oft quoted fallacy of putting on your own oxygen mask first -=- I don t think that s a","messageBody":"<div id=\"ygrps-yiv-1573347247\">-=-i know i have read some good discussion on this list about the oft  <br/>\nquoted fallacy of &quot;putting on your own oxygen mask first&quot;-=-<br/>\n<br/>\nI don&#39;t think that&#39;s a fallacy.  In literal airplane emergency  <br/>\nsituations, the baby won&#39;t be able to assist the mom.<br/>\n<br/>\n<br/>\nAbout people extending that too every aspect of their own lives and  <br/>\nsaying they need an hour-long bubble bath...<br/>\n<br/>\nI&#39;ll look, but so far I&#39;ve found this:<br/>\nsandradodd.com/chores/gift<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/service\">http://sandradodd.com/service</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/being/\">http://sandradodd.com/being/</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185586397,"authorName":"Lyla Wolfenstein","from":"&quot;Lyla Wolfenstein&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"&quot;mom&#39;s needs first&quot;","postDate":"1264541457","msgId":50107,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNjhGQ0U0QjQ3MTQ5NDVCNzk3RjQ1NkFCQUUwOTdBQExZTEFMQVAyPg=="},"prevInTopic":0,"nextInTopic":50108,"prevInTime":50106,"nextInTime":50108,"topicId":50107,"numMessagesInTopic":0,"msgSnippet":"i know i have read some good discussion on this list about the oft quoted fallacy of putting on your own oxygen mask first and if mom ain t happy ain t","messageBody":"<div id=\"ygrps-yiv-1252038695\">i know i have read some good discussion on this list about the oft quoted fallacy of &quot;putting on your own oxygen mask first&quot; and &quot;if mom ain&#39;t happy ain&#39;t nobody happy&quot; etc.  <br/>\n<br/>\ni have searched a bit and can&#39;t seem to find it.  anyone have links to those discussions or pages on sandra&#39;s or joyce&#39;s site? <br/>\n<br/>\nthanks!<br/>\n<br/>\nlyla<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":50484,"nextTopicId":50506}}