{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":229442577,"authorName":"Kris","from":"Kris &lt;kris1956@...&gt;","profile":"louisam1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s behavior","postDate":"1239428288","msgId":43997,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZkZWM0OGIwOTA0MTAyMjM4cDE4NTMxYzFkZzk2YjNhMjE1ZDRhNDFhOTdAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGdybnBiYitnYnAxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdybnBiYitnYnAxQGVHcm91cHMuY29tPg=="},"prevInTopic":43994,"nextInTopic":0,"prevInTime":43996,"nextInTime":43998,"topicId":43983,"numMessagesInTopic":0,"msgSnippet":"From what you wrote I would say that the only problems are the school, the activities and an impatient parent.  I would take him out of school now, let him","messageBody":"<div id=\"ygrps-yiv-116996154\">From what you wrote I would say that the only problems are the school, the<br/>\nactivities and an impatient parent.  I would take him out of school now, let<br/>\nhim quit team sports and give the dh a clue and a chill pill.  In our house<br/>\nyour son&#39;s behavior would be just fine, we always make it so my son can stay<br/>\nhome if he chooses (he gets horribly car sick) and anyone can be as silly<br/>\nand lost in as many little worlds as they please.  My kids are VERY patient<br/>\nwith my mind wanderings.<br/>\n<br/>\nKris<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Fri, Apr 10, 2009 at 8:41 AM, mjphipps &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mjphipps@...\">mjphipps@...</a>&gt; wrote:<br/>\n<br/>\n&gt; My husband can sometimes be very hard on him because he just doesn&#39;t<br/>\n&gt; understand (or can&#39;t accept) that he is just a six year old boy! I want to<br/>\n&gt; be able to help him move into this more peaceful parenting with me.<br/>\n&gt;<br/>\n&gt; Thank you,<br/>\n&gt;<br/>\n&gt; Molly<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\nA little Madness in the Spring Is wholesome even for the King. - Emily<br/>\nDickinson<br/>\n<br/>\nI haz a blog, u can reedz it!<br/>\nwww.krisspeed.blogspot.com<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son&#39;s behavior","postDate":"1239407439","msgId":43994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdyb20wZittYzJiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdybnBiYitnYnAxQGVHcm91cHMuY29tPg=="},"prevInTopic":43992,"nextInTopic":43997,"prevInTime":43993,"nextInTime":43995,"topicId":43983,"numMessagesInTopic":0,"msgSnippet":"... He likes school for the most part but he is in trouble constantly due to the intense structure and rules- not something he can follow well. ... inability","messageBody":"<div id=\"ygrps-yiv-1866571758\"><blockquote><span title=\"ireply\">&gt;&gt;&gt; My six year old is currently in Kindergarten in a public school...<br/>\n </span></blockquote>He likes school for the most part but he is in trouble constantly due to<br/>\nthe intense structure and rules- not something he can follow well.<br/>\n....&gt;&gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; The main thing that I am struggling with him right now is his<br/>\n </span></blockquote>inability to focus. He always seems to be off in his own little world.<br/>\n...this is really a problem is when we are trying to get out the door to<br/>\ngo somewhere or something like that. &gt;&gt;&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; Also, my second issue is his silliness when he is around others.<br/>\n </span></blockquote>...(for instance at t-ball last night he was rolling around on the<br/>\nground in circles instead of playing catch, even when the other little<br/>\nboy came up and asked him to throw it right because he wanted to catch<br/>\nit)&gt;&gt;&gt;<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>All of the above and this...<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;&gt;My husband can sometimes be very hard on him because he just doesn&#39;t<br/>\n </span></blockquote>understand (or can&#39;t accept) that he is just a six year old boy! &gt;&gt;&gt;<br/>\n<br/>\nAll of these are classic signs of reacting to controlled situations that<br/>\nhe doesn&#39;t want to deal with.  Little kids will do this, even big kids,<br/>\nor adults will do these things when forced to pay attention or do things<br/>\nthey don&#39;t want to do.  Aversion, day dreaming, not paying attention,<br/>\ndistracting others, are all clear signs that say, &quot;I&#39;m not interested, I<br/>\ndon&#39;t want to do this, I don&#39;t want to be here...&quot;.<br/>\n<br/>\nKids that really want to play t-ball, will play t-ball.  Your son wants<br/>\nto play, he wants free unstructured play.  He may not want to get his<br/>\nshoes on right when you ask him to.  If he is more able to make more<br/>\ndecisions for his own life, he may be able to get his shoes on when you<br/>\nneed to go out, but it may take a while to get to that point where he<br/>\nisn&#39;t in reactionary mode.</div>","specialLinks":[]},{"userId":374703076,"authorName":"Roberta Scherr","from":"Roberta Scherr &lt;robertascherr@...&gt;","profile":"robertascherr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son&#39;s behavior","postDate":"1239388464","msgId":43992,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUzOTk3Ny45MDA5NS5xbUB3ZWIxMTEyMTUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PGdybzBwdis1ZWZtQGVHcm91cHMuY29tPg==","referencesHeader":"PGdybzBwdis1ZWZtQGVHcm91cHMuY29tPg=="},"prevInTopic":43991,"nextInTopic":43994,"prevInTime":43991,"nextInTime":43993,"topicId":43983,"numMessagesInTopic":0,"msgSnippet":"My son is ten, and he and school never mixed well.  We adopted him in the summer he turned five and immediately sent him to school.  He had been abused in","messageBody":"<div id=\"ygrps-yiv-400364158\">My son is ten, and he and school never mixed well.  We adopted him in the summer he turned five and immediately sent him to school.  He had been abused in the foster care system since age three weeks, we were a new Mom and Dad, and school seemed like it was the next thing to do.<br/>\n<br/>\nRobbie&#39;s has made enormous progress in the last 5 years, but it was in spite of, not because of public school and special education.  If I had it to do all over again, I would never have sent him. <br/>\n<br/>\nIt took me a while to realize it, but school was toxic to Robbie.  He had already heard that he was a bad boy in foster care, and he was hearing it over and over again in school.  And he was hearing that he was not neat enough, not fast enough, not smart enough....all of the time there.   I am new at unschooling - really still deschooling at this point, but he is more relaxed and comfortable inside his skin after three months of being home than ever before.  Now when he pick up a book or magazine or movie it is because he wants to, and he absorbs everything of meaning to him.  His &quot;social skills&quot; have improved markedly since we chat about what happened at the playground and how it felt for him, rather than school trying so hard to prevent any untoward event, that they prevented any meaningful interaction at all.<br/>\n<br/>\nYou are so right that they don&#39;t see our children the way we do... They see what doesn&#39;t fit their process and structure, and try to change it to make things simpler for themselves.  I see a boy who is unique and see how miraculous it is that he has come through his early years with a  kind heart and a mind yearning to understand the world.  It is so obvious to anyone who has their eyes open what a miracle he is!!!<br/>\n<br/>\nEvery child is a miracle, and yours sounds wonderful.  I&#39;m so glad that you figured out that school doesn&#39;t work for him now.  Follow everyone&#39;s advice and start the healing, NOW.<br/>\n<br/>\nPeace,<br/>\n<br/>\nBobbi<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Joanna Murphy &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ridingmom@...\">ridingmom@...</a>&gt;<br/>\nTo: AlwaysLearning@yahoogroups..com<br/>\nSent: Friday, April 10, 2009 1:48:47 PM<br/>\nSubject: [AlwaysLearning] Re: Son&#39;s behavior<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n) If<br/>\n<blockquote><span title=\"ireply\"> &gt; getting out the door to be at school on time is what you&#39;re having trouble<br/>\n&gt; with, that&#39;s another argument in favor of not sending him at all anymore.<br/>\n<br/>\n </span></blockquote>Hallelujah sister!!<br/>\n<br/>\nThere were many reasons why we were all ready to leave school behind when my son was 7, and this was a biggy. It was like someone opened the window on a close, dank, stuffy room the day we DIDN&quot;T have to march out the door for school. It was heaven.<br/>\n<br/>\nI fourth, or fifth, or something, the idea of just not going back to school. You are putting off what will blossom, if you continue down the path of unschooling, into so much more fun and joy and ease for both of you. <br/>\n<br/>\nThere is nothing more to be gained, but there is more to be lost. In time, I&#39;ll bet, you will see his dreaminess in a whole new light. I recognize that quality in my son (13), who I often think of as a balloon, with my job to be holding the string so that he doesn&#39;t float away. &lt;g&gt; The thinks he thinks are truly inspired--and they &quot;seem&quot; to come out of nowhere. He probably could have been forced to pay attention and &quot;focus,&quot; but the cost would have been far too high. Focus, in children, is highly overrated, imho, and not always a desirable trait. Wonderful if it&#39;s natural, but completely artificial and wrong if it&#39;s forced.<br/>\n<br/>\nJoanna<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":294520986,"authorName":"Joanna Murphy","from":"&quot;Joanna Murphy&quot; &lt;ridingmom@...&gt;","profile":"ridingmom1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son&#39;s behavior","postDate":"1239385727","msgId":43991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdybzBwdis1ZWZtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGI0NmI1NzhmMDkwNDEwMTAzMGkyOWEzNmEyMmwyNzM2MmE0ZmZiNWQ4MDcyQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":43990,"nextInTopic":43992,"prevInTime":43990,"nextInTime":43992,"topicId":43983,"numMessagesInTopic":0,"msgSnippet":") If ... Hallelujah sister!! There were many reasons why we were all ready to leave school behind when my son was 7, and this was a biggy.  It was like someone","messageBody":"<div id=\"ygrps-yiv-1526668262\">) If<br/>\n<blockquote><span title=\"ireply\"> &gt; getting out the door to be at school on time is what you&#39;re having trouble<br/>\n&gt; with, that&#39;s another argument in favor of not sending him at all anymore.<br/>\n<br/>\n </span></blockquote>Hallelujah sister!!<br/>\n<br/>\nThere were many reasons why we were all ready to leave school behind when my son was 7, and this was a biggy.  It was like someone opened the window on a close, dank, stuffy room the day we DIDN&quot;T have to march out the door for school.  It was heaven.<br/>\n<br/>\nI fourth, or fifth, or something, the idea of just not going back to school.  You are putting off what will blossom, if you continue down the path of unschooling, into so much more fun and joy and ease for both of you.  <br/>\n<br/>\nThere is nothing more to be gained, but there is more to be lost.  In time, I&#39;ll bet, you will see his dreaminess in a whole new light.  I recognize that quality in my son (13), who I often think of as a balloon, with my job to be holding the string so that he doesn&#39;t float away.  &lt;g&gt;  The thinks he thinks are truly inspired--and they &quot;seem&quot; to come out of nowhere.  He probably could have been forced to pay attention and &quot;focus,&quot; but the cost would have been far too high.  Focus, in children, is highly overrated, imho, and not always a desirable trait.  Wonderful if it&#39;s natural, but completely artificial and wrong if it&#39;s forced.<br/>\n<br/>\nJoanna</div>","specialLinks":[]},{"userId":272603634,"authorName":"Melissa Wiley","from":"Melissa Wiley &lt;thebonnyglen@...&gt;","profile":"glencaraid","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s behavior","postDate":"1239384640","msgId":43990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI0NmI1NzhmMDkwNDEwMTAzMGkyOWEzNmEyMmwyNzM2MmE0ZmZiNWQ4MDcyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDE2OURCMzkzLUQxNzMtNEI0NC04ODYyLUFGRUYzRUMzOTZEOEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGdybnBiYitnYnAxQGVHcm91cHMuY29tPgkgPDE2OURCMzkzLUQxNzMtNEI0NC04ODYyLUFGRUYzRUMzOTZEOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":43989,"nextInTopic":43991,"prevInTime":43989,"nextInTime":43991,"topicId":43983,"numMessagesInTopic":0,"msgSnippet":"... Some people like long periods of deep immersion in an idea or activity. School doesn t usually allow for that. You re constantly being whisked from one","messageBody":"<div id=\"ygrps-yiv-266791126\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; The main thing that I am struggling with him right now is his inability to<br/>\n&gt; focus. He always seems to be off in his own little world. (Not necessarily a<br/>\n&gt; bad thing because this little world of his seems like a very beautiful<br/>\n&gt; place)<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Some people like long periods of deep immersion in an idea or activity.<br/>\nSchool doesn&#39;t usually allow for that. You&#39;re constantly being whisked from<br/>\none focus to the next. That can be really tough on an immersion kind of<br/>\nperson. Your son might not have an &#39;inability to focus&#39;--he might have<br/>\ndifficulty with switching to something new when he&#39;s just gotten focused on<br/>\nthe first thing.<br/>\n<br/>\nThe times when this is really a problem is when we are trying to get out the<br/>\n<blockquote><span title=\"ireply\"> &gt; door to go somewhere or something like that.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Ooh, I have lots to say about this! :) This has been a problem for me in the<br/>\npast, too, the getting out the door. Well, I have six kids 13 and under, so<br/>\nnaturally it takes some finesse to get that many people organized to leave<br/>\nthe house at the same time. Even when there were only 5 kids, or 4, or 3,<br/>\nit was hard. I realized that situation was what brought out the worst in me<br/>\nas a mother--impatience, snappishness, or slipping into drill sergeant mode,<br/>\ncalling out orders to everyone. What I realized, eventually, maybe two<br/>\nbabies ago, was that the problem with getting out the house was ME, not<br/>\nthem. I wasn&#39;t allowing enough time, was the main thing. I wasn&#39;t factoring<br/>\n&quot;getting out of the house&quot; time into our travel time. If we needed to be<br/>\nsomewhere at noon and the drive took 15 minutes, I&#39;d think &quot;we need to leave<br/>\nat 11:45&quot;--but what that means (I learned) was &quot;we need to start walking out<br/>\nthe front door at 11:30.&quot; Fifteen minutes sounds like a big margin of time<br/>\nfor the walk from house to carseat, but for little kids I think you often<br/>\nneed AT LEAST that much time.  And that means I need to start getting shoes<br/>\non the toddlers, check diapers, etc, even earlier.<br/>\n<br/>\nMy 13yo will remind me, sometimes, if I haven&#39;t left a big enough margin and<br/>\nI&#39;m stressing over getting the littles buckled and we might be late. She&#39;ll<br/>\nlaugh and sing a line from my favorite Springsteen song: &quot;...that loooong<br/>\nwalk from your front porch to my front seat.&quot;  LOL. And I&#39;ll remember to<br/>\ntake a breath, and if we&#39;re late, we&#39;re late. Better late-and-joyful than<br/>\nprompt-and-crabby -- but prompt and joyful is better still, so I try to<br/>\nalways leave that very big margin for that &quot;long walk.&quot;<br/>\n<br/>\nAnyway, just thinking this is one place you might be able to rethink a<br/>\nproblem. Getting out the door is more your problem than your son&#39;s. If he&#39;s<br/>\nimmersed in his own world, as you said, and it&#39;s time for you to go<br/>\nsomewhere, you can give him lots of transition time even *before* it&#39;s time<br/>\nto start getting ready to leave the house. Or you could stay home. ;) If<br/>\ngetting out the door to be at school on time is what you&#39;re having trouble<br/>\nwith, that&#39;s another argument in favor of not sending him at all anymore.<br/>\n<br/>\nLissa, mom of six in San Diego<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s behavior","postDate":"1239382066","msgId":43989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVGMERGRUFGMTUzMDQ5OUFCODEwRkI0MzRFNjc1RjRDQEVkUEM+","inReplyToHeader":"PDZBMkM2NjRCLTdENTItNDVGNC05MjdBLTgzNkNCRTVFNjM2M0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGdybnBiYitnYnAxQGVHcm91cHMuY29tPiA8NkEyQzY2NEItN0Q1Mi00NUY0LTkyN0EtODM2Q0JFNUU2MzYzQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":43987,"nextInTopic":43990,"prevInTime":43988,"nextInTime":43990,"topicId":43983,"numMessagesInTopic":0,"msgSnippet":"I wanted to add my agreement to Sandra s post.  Why keep doing harm that you have already recognized?  The peanut allergy and finishing the jar is an excellent","messageBody":"<div id=\"ygrps-yiv-1438163638\">I wanted to add my agreement to Sandra&#39;s post.  Why keep doing harm that you have already recognized?  The peanut allergy and finishing the jar is an excellent analogy.  <br/>\n<br/>\nWe pulled our son out of third grade, mid year, 6.5 years ago.  I agree - don&#39;t send him back. It is very freeing.<br/>\n <br/>\nAND we wish we&#39;d thought of homeschooling sooner - he still has scars from school. <br/>\n<br/>\n<br/>\nLisa W.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s behavior","postDate":"1239379396","msgId":43987,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2OURCMzkzLUQxNzMtNEI0NC04ODYyLUFGRUYzRUMzOTZEOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdybnBiYitnYnAxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdybnBiYitnYnAxQGVHcm91cHMuY29tPg=="},"prevInTopic":43986,"nextInTopic":43989,"prevInTime":43986,"nextInTime":43988,"topicId":43983,"numMessagesInTopic":0,"msgSnippet":"-=- Deschooling means dismantling the overlay of school. Gradually (or just all of a sudden, if you have that ability) stop speaking and thinking in terms of","messageBody":"<div id=\"ygrps-yiv-302906527\">-=-<br/>\nDeschooling means dismantling the overlay of school. Gradually (or  <br/>\njust all of a sudden, if you have that ability) stop speaking and  <br/>\nthinking in terms of grades, semesters, school-days, education,  <br/>\nscores, tests, introductions, reviews, and performance, and replace  <br/>\nthose artificial strictures and measures with ideas like morning,  <br/>\nhungry, happy, new, learning, interesting, playing, exploring and  <br/>\nliving.-=-<br/>\n<br/>\nThat&#39;s from this:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/interview\">http://sandradodd.com/interview</a><br/>\n<br/>\nThe words are mine, from when Holly was still very young.<br/>\n<br/>\nTo &quot;finish the school year&quot; once you&#39;ve decided to homeschool doesn&#39;t  <br/>\nmake any more sense than finishing off all the meat in your freezer  <br/>\nonce you&#39;ve decided to be a vegetarian.<br/>\n<br/>\nIt makes LESS sense, because every second of harm in school will need  <br/>\nto be undone IF it can be undone.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son&#39;s behavior","postDate":"1239379294","msgId":43986,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZBMkM2NjRCLTdENTItNDVGNC05MjdBLTgzNkNCRTVFNjM2M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdybnBiYitnYnAxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdybnBiYitnYnAxQGVHcm91cHMuY29tPg=="},"prevInTopic":43983,"nextInTopic":43987,"prevInTime":43985,"nextInTime":43987,"topicId":43983,"numMessagesInTopic":0,"msgSnippet":"-=-It has been a struggle and we will be thankful when the year is over. -=- Don t send him back next week. If he were allergic to peanut butter, would you","messageBody":"<div id=\"ygrps-yiv-1125671756\">-=-It has been a struggle and we will be thankful when the year is  <br/>\nover. -=-<br/>\n<br/>\nDon&#39;t send him back next week.<br/>\n<br/>\nIf he were allergic to peanut butter, would you make him finish that  <br/>\nlast jar and THEN start avoiding peanuts for him?<br/>\n<br/>\nTo people who read this just as it comes or not long after, there&#39;s a  <br/>\ntext chat here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/room\">http://sandradodd.com/room</a><br/>\n<br/>\nThe password is goodidea<br/>\n<br/>\nYou can check times here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chats/regular\">http://sandradodd.com/chats/regular</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":392643059,"authorName":"mjphipps","from":"&quot;mjphipps&quot; &lt;mjphipps@...&gt;","profile":"mjphipps","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Son&#39;s behavior","postDate":"1239378091","msgId":43983,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdybnBiYitnYnAxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":43986,"prevInTime":43982,"nextInTime":43984,"topicId":43983,"numMessagesInTopic":0,"msgSnippet":"I am new to the group and I have been reading everyone s posts for a few weeks now.  I have a 6 year old son, and an almost 1 year old son. My six year old is","messageBody":"<div id=\"ygrps-yiv-593498350\">I am new to the group and I have been reading everyone&#39;s posts for a few weeks now.  I have a 6 year old son, and an almost 1 year old son.<br/>\n<br/>\nMy six year old is currently in Kindergarten in a public school, but I will be homeschooling him after the year is over.  He likes school for the most part but he is in trouble constantly due to the intense structure and rules- not something he can follow well. At the beginning of all of this, I would get upset at him and punish him at home and we tried everything to MAKE him follow the rules that the school had put into place.  Since I cannot force him to do anything he doesn&#39;t want to, this method obviously did not work!  Instead, we decided that what he was getting into trouble for was not something that we saw as &#39;trouble worthy&#39;, and so instead we just talked to him about each individual situation as we deemed necessary, and then moved on.  It has been a struggle and we will be thankful when the year is over.  <br/>\n<br/>\nI suppose its hard for everyone else to see in my child what I do when he is &#39;misbehaving&#39;, but he is one of the smartest, kindest souls I have ever been around.  He opens my eyes to something new everyday.<br/>\n<br/>\nThe main thing that I am struggling with him right now is his inability to focus.  He always seems to be off in his own little world.  (Not necessarily a bad thing because this little world of his seems like a very beautiful place)  The times when this is really a problem is when we are trying to get out the door to go somewhere or something like that.  I know this is their biggest issue at school also, but I think a lot of it is that he just doesn&#39;t want to do what they are doing at the time.  How can I help him understand when we have to get something done, or be somewhere, that I really need him to focus on the task at hand?  A lot of people seem to think there is something wrong with him, I think he is strong willed! He can focus JUST FINE when it&#39;s something he wants to do.<br/>\n<br/>\nAlso, my second issue is his silliness when he is around others.  I know the main reason he is doing it is because he wants people to laugh but its the kind of silliness that is WOW...but not funny! (for instance at t-ball last night he was rolling around on the ground in circles instead of playing catch, even when the other little boy came up and asked him to throw it right because he wanted to catch it)<br/>\n<br/>\nI am trying to do as much research as I can and really absorb myself in this new parenting and these are the two main things that I need help with him.  My husband can sometimes be very hard on him because he just doesn&#39;t understand (or can&#39;t accept) that he is just a six year old boy!  I want to be able to help him move into this more peaceful parenting with me.<br/>\n<br/>\nThank you, <br/>\n<br/>\nMolly<br/>\n<br/>\nMother to Jayden, 6<br/>\nJaxon, almost 1<br/>\n<br/>\nand wife to Keith</div>","specialLinks":[]}],"prevTopicId":43993,"nextTopicId":44012}}