{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Child-led, parent-led, family-led","postDate":"1253837145","msgId":47586,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2QkEzMkE1LTgzMTctNDdBOS05Qjk0LTQwRjYyN0MzNTlDMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDY5RTgyNzY5OTFBRDRFRUZBRTIwMkVGMkI5NzlFM0U2QFJvYnluUEM+","referencesHeader":"PDI4Mjg3NS40OTI3Ni5xbUB3ZWI1MTgwMi5tYWlsLnJlMi55YWhvby5jb20+IDw1ODg2OTcuMzkyNjcucW1Ad2ViMTEwNDEyLm1haWwuZ3ExLnlhaG9vLmNvbT4gPDY5RTgyNzY5OTFBRDRFRUZBRTIwMkVGMkI5NzlFM0U2QFJvYnluUEM+"},"prevInTopic":47585,"nextInTopic":0,"prevInTime":47585,"nextInTime":47587,"topicId":47575,"numMessagesInTopic":0,"msgSnippet":"-=-When we were making miniature dioramas out of food packaging recently, I was cutting out pictures of landscapes from the newspaper for the backgrounds. Jayn","messageBody":"<div id=\"ygrps-yiv-1584553442\">-=-When we were making miniature dioramas out of food packaging  <br/>\nrecently, I was<br/>\ncutting out pictures of landscapes from the newspaper for the  <br/>\nbackgrounds.<br/>\nJayn thought I was cheating because I wasn&#39;t painting the whole thing  <br/>\nas she<br/>\nwas.=-<br/>\n<br/>\nGood thing you didn&#39;t suggest she do that.  It would&#39;ve been like...   <br/>\ncontributing to the artistic delinquency of a minor or something.<br/>\n<br/>\nMy kids usually don&#39;t mine suggestions, but sometimes I say &quot;I have an  <br/>\nidea, but you probably already thought of it&quot; or something like that,  <br/>\nto ease in gently.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Child-led, parent-led, family-led","postDate":"1253836007","msgId":47585,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5RTgyNzY5OTFBRDRFRUZBRTIwMkVGMkI5NzlFM0U2QFJvYnluUEM+","inReplyToHeader":"PDU4ODY5Ny4zOTI2Ny5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDI4Mjg3NS40OTI3Ni5xbUB3ZWI1MTgwMi5tYWlsLnJlMi55YWhvby5jb20+IDw1ODg2OTcuMzkyNjcucW1Ad2ViMTEwNDEyLm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":47583,"nextInTopic":47586,"prevInTime":47584,"nextInTime":47586,"topicId":47575,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-553676676\">&lt;&lt;&lt;&lt; Imagine if your child was deeply engaged in making a house from a <br/>\ncardboard box, working intently. You come in the room and watch a moment, <br/>\nthen say “You should do this for the stairs … you could use that magazine to <br/>\ncut out rugs and pictures … those spools would make good furniture …”&gt;&gt;&gt;<br/>\n<br/>\nJayn would hear this kind of conversation as me taking over her project. <br/>\nWhen she wants my help or ideas, she asks for it. Otherwise her journey of <br/>\ndiscovery and process of invention is the most important part of any kind of <br/>\nproject like this, any creative endeavor - and she has done this kind of <br/>\nthing a lot.<br/>\n<br/>\nHowever there is a context to this, which is that almost constant crafting <br/>\nand making that is pretty much the foundation of our lives. I do some <br/>\ncreative/making/crafting every single day, just like I write just about <br/>\nevery day. We watch crafting programs on tv. Jayn uses drawing both to plan <br/>\nher future life and express her current emotional life.<br/>\n<br/>\nI have modelled using all kinds of stuff for making all kinds of things for <br/>\nthe whole of her life. I remember when she had the plan to make furniture <br/>\nfor a particular doll using &quot;ordinary household objects&quot; and was actively <br/>\nsearching all over the house for bits and pieces to convert.<br/>\n<br/>\nWhen we were making miniature dioramas out of food packaging recently, I was <br/>\ncutting out pictures of landscapes from the newspaper for the backgrounds. <br/>\nJayn thought I was cheating because I wasn&#39;t painting the whole thing as she <br/>\nwas.<br/>\n<br/>\nRobyn L. Coburn<br/>\nwww.Iggyjingles.etsy.com<br/>\nwww.iggyjingles.blogspot.com<br/>\nwww.allthingsdoll.blogspot.com</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Child-led, parent-led, family-led","postDate":"1253815906","msgId":47583,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU4ODY5Ny4zOTI2Ny5xbUB3ZWIxMTA0MTIubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDI4Mjg3NS40OTI3Ni5xbUB3ZWI1MTgwMi5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDI4Mjg3NS40OTI3Ni5xbUB3ZWI1MTgwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":47578,"nextInTopic":47585,"prevInTime":47582,"nextInTime":47584,"topicId":47575,"numMessagesInTopic":0,"msgSnippet":"... Imagine if your child was deeply engaged in making a house from a cardboard box, working intently. You come in the room and watch a moment, then say “You","messageBody":"<div id=\"ygrps-yiv-1053984240\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Your mind will leap ahead to great possibilities, like visiting the museum. Write them down in your journal. But keep them to yourself for now.<br/>\n </span></blockquote>Imagine if your child was deeply engaged in making a house from a cardboard box, working intently. You come in the room and watch a moment, then say “You should do this for the stairs … you could use that magazine to cut out rugs and pictures … those spools would make good furniture …”&gt;&gt;&gt;<br/>\n<br/>\nSee, here&#39;s the difference in my life.... First, I wouldn&#39;t take notes in a journal, I&#39;d simply talk to my child about an exciting possibility that I&#39;d just considered.  Secondly, my kids have rarely worked on projects of this nature by themselves.  <br/>\n<br/>\nWhen I was a kid, my own mother and grandmother used to do all kinds of projects with my sister and I, like building cardboard dollhouses and making little pieces of furniture for the doll house out of spools and lids and other interesting found objects.  Some things kids will discover on their own, but having an adult around showing cool ideas, is pretty cool.  My mom saved a lot of that stuff and a really fancy store bought house, all of which she just gave to Margaux on her 8th b-day, list last Sept. 3rd.  My daughter gets to play with all that stuff I made as a child.<br/>\n<br/>\nI would never assume that making a suggestion would ever in a million years cause my children to actually do that thing.  Now, if I go and do it with them and be with them, and talk and hang out and play with them, those things happen and my children learn from them.<br/>\n<br/>\nIt&#39;s not a difference of me doing it for them or them doing it themselves, it&#39;s us doing it together, often on my initiative, sometimes on theirs.  <br/>\n<br/>\nOne time, when Margaux was pretty little, like 3 perhaps, she came with Chamille and I to a ceramics studio to work on pottery stuff.  We chose to both, build and create, and glaze, so we did it in 2 session.  The second session, Margaux wasn&#39;t interested, except that she did want her creation to be colored a certain way, but didn&#39;t want to do it herself.  We were happily working together painting her thing, me doing most of it, when the studio attendant came over and told me that I shouldn&#39;t be doing it for her because then we won&#39;t have any memories of her doing her own project.  She told me about how she always used to do her daughter&#39;s projects for her, and now all they have are projects that she did, but none that her daughter did.  That was sad, but for me, it wasn&#39;t about a finished project, you couldn&#39;t even really tell that it was an apple tree anyway, but it was about shared memories of doing something together.  Now, when I look at that apple<br/>\n tree, that is the story, the memory that I have.<br/>\n<br/>\nOne time I did make a cardboard doll house for Chamille, it was really cool and she loved it a lot, but it eventually got squished and ruined and I tossed it.  That was really sad for her, but she never told me until much later.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Child-led, parent-led, family-led","postDate":"1253811643","msgId":47578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwMDAwRjQ2LTlGOUYtNDAyMS1CNjY4LTYyQkUwQUJCNDVBNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDI4Mjg3NS40OTI3Ni5xbUB3ZWI1MTgwMi5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDI4Mjg3NS40OTI3Ni5xbUB3ZWI1MTgwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":47575,"nextInTopic":47583,"prevInTime":47577,"nextInTime":47579,"topicId":47575,"numMessagesInTopic":0,"msgSnippet":"-=-She has taught herself Word, spell check, how to use the thesaurus and many other valuable writing skills.=- She learned, I would ve said. If you think she","messageBody":"<div id=\"ygrps-yiv-455037452\">-=-She has taught herself Word, spell check, how to use the thesaurus  <br/>\nand many other valuable writing skills.=-<br/>\n<br/>\nShe learned, I would&#39;ve said.<br/>\nIf you think &quot;she taught herself&quot; it&#39;s not the same direction and  <br/>\nenergy and &quot;doingness&quot; as if you think &quot;she figured out on her own how  <br/>\nto use...&quot;<br/>\n<br/>\n-=- Some things she can&#39;t or hasn&#39;t or might not discover on her own,  <br/>\nand I think my job is to act as a team-member; supporting her  <br/>\ninterests without squashing them. I think of this as family-led rather  <br/>\nthan child-led.-=-<br/>\n<br/>\nI totally agree with the team idea, or partner theory, but rather than  <br/>\narguing whether the child is leading or the family is leading or the  <br/>\nfamily is leading, what if you just rephrase it to something without  <br/>\n&quot;leading&quot; at all?<br/>\n<br/>\nI had company recently, a longtime friend married someone I didn&#39;t  <br/>\nknow at all, and brought her to Albuquerque to stay with me for three  <br/>\ndays because I had missed the wedding because of my trip to the UK,  <br/>\nand most of our other friends had met her.   We went to Southwestern  <br/>\nMinerals, a rock shop and jewelry supply store.  I thought of it  <br/>\nbecause when we were in Old Town she looked at some geodes, and had  <br/>\ncommented on a fossil.  I knew this place had beautifully polished  <br/>\ngeode book ends, and it&#39;s like a museum of fossils and pearls.  She  <br/>\ndoes historical costuming.  Sure enough she had a great time there.   <br/>\nIt&#39;s an old business, on Central in Albuquerque, and better than most  <br/>\nmuseums because if you really like something you can buy it, and there  <br/>\nare fossils from $4, $6.<br/>\n<br/>\nWhether a kid or an adult friend, if I think someone might be  <br/>\ninterested in something, I mention it.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":59461774,"authorName":"Sarah","from":"Sarah &lt;sarahanne1@...&gt;","profile":"sarahanne1","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Child-led, parent-led, family-led","postDate":"1253805910","msgId":47575,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI4Mjg3NS40OTI3Ni5xbUB3ZWI1MTgwMi5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":47578,"prevInTime":47574,"nextInTime":47576,"topicId":47575,"numMessagesInTopic":0,"msgSnippet":"Recently, on my local homeschool group, the idea came up of the merits of being child-led. Since this subject was raised here recently, I thought it might be","messageBody":"<div id=\"ygrps-yiv-247094443\">Recently, on my local homeschool group, the idea came up of the merits of being child-led. Since this subject was raised here recently, I thought it might be apropos to post this here.  I&#39;d love to hear your thoughts.<br/>\n<br/>\nThe original writing is first, and my response is second.<br/>\n<br/>\n<br/>\n <br/>\n  ---   <br/>\nfrom Camp Creek blog<br/>\n <br/>\n <br/>\nA question from Jess:<br/>\n<br/>\n&quot;Your blog has answered lots of questions, but I definitely will have more … for example, my daughter absolutely loves rock collecting. Should I not mention the Museum of Natural History that has a rock collection?&quot;<br/>\n <br/>\nIf your goal is to have your child experience the entire arc of learning, from initial interest to knowing enough to teach someone else, they need adequate time to explore outward from that beginning point.<br/>\n <br/>\nYour mind will leap ahead to great possibilities, like visiting the museum. Write them down in your journal. But keep them to yourself for now.<br/>\nImagine if your child was deeply engaged in making a house from a cardboard box, working intently. You come in the room and watch a moment, then say “You should do this for the stairs … you could use that magazine to cut out rugs and pictures … those spools would make good furniture …”<br/>\n <br/>\nDepending on the child, and the day, your suggestions might be well received and inspire them further — or, you might kill their interest altogether. In any case, whose project is it?<br/>\nAs you build a strong, trusted learning relationship with your child, they need to know that you will support them and get them whatever they need but you won’t take over. They will remain in control.<br/>\n <br/>\nAnything that you do for them takes away their opportunity to do it for themselves — including having ideas and making connections. Of course you are going to make those connections quickly; of course you are going to have wonderful ideas! Save them, and later, if they never come up in any other way, you can introduce them. But give your child the chance to make their way there on their own — possibly much more slowly, or via a circuitous path. Slow learning.<br/>\n <br/>\nAnother analogy — when your three-year-old is hunting for Easter eggs, you don’t want to point out each and every egg. They would hate that. On the other hand, if they are looking too hard and long and making no progress, becoming frustrated and upset in the process, a little hint or a bit of subtle redirection can get them back on the right path and happily working again. There’s a delicate balance to this, and it’s a learned skill. Try to always err on the side of doing less; you can always do more later.<br/>\n <br/>\nYour goal here is for your child to work independently and have their own ideas. Of course, you could plan a fun unit study, but that’s not what we’re doing. We’re planning along, not planning ahead. We’re seeing what form our child’s work takes over an extended period of time, allowing it to take its own shape without imposing our preconceived ideas.<br/>\n <br/>\nRather than making direct suggestions about places you could visit, back it up a step or two or three and ask “What kinds of places might teach us more about rocks? Where could we go? Who could we talk to?” Write down every idea your child has and start following them up one by one. It’s entirely possible that along the way, she will stumble across the museum on her own or gather that suggestion from someone else, making it her discovery. The more they own their work, the more they will learn and the more pleasure and pride they will take in it.<br/>\n <br/>\n*********************************************<br/>\n(Me Now)<br/>\n<br/>\nI think letting the child lead is so important for some things.  For example, Sophia (age 10), is a wonderful writer.  Her dream is to be an author.  She has started four original novels, one of which is 120 pages so far.  They are creative, unique and highly entertaining. I have been very careful not to push anything about this interest.  She has taught herself Word, spell check, how to use the thesaurus and many other valuable writing skills.  I tread carefully, very carefully, when grammatical issues come up.  I would never in a million years give her a writing assignment.<br/>\n <br/>\nThat said, if her favorite writer was going to be speaking in Logan, I would tell her immediately!  If a writing contest came up, I would tell her the details.  If a writing club were available, I would offer to drive. I WOULD NOT push any of those things, but I would make the ideas available. Some things she can&#39;t or hasn&#39;t or might not discover on her own, and I think my job is to act as a team-member; supporting her interests without squashing them.  I think of this as family-led rather than child-led.<br/>\n <br/>\nAlso, I did put a dictionary, thesaurus, and writer&#39;s reference on the desk where Sophia types.  I didn&#39;t tell her to use them, but I made them available as a tool if she wanted.  She has used the thesaurus, and then she found one on Word by herself.  <br/>\n <br/>\nIn the paper today, there&#39;s a story about a kid from Utah State who won $10,000 from a writing contest.  He&#39;ll get to meet a couple famous authors when he is presented with the trophy.  I&#39;ll show Sophia the story because I think she&#39;ll like it, and because she doesn&#39;t usually read the paper.  I won&#39;t make her read it, but I will offer it.<br/>\n <br/>\nIf my child loved rocks, and there was a museum I thought they&#39;d love close by, I would not hesitate to say, &quot;Hey, there&#39;s a cool museum around the corner.  They have a rock collection.  Do you want to go see it?&quot;  All the child would have to say was, &quot;No.&quot;  But, if the child said, &quot;Yes,&quot; we could certainly learn about the rocks together!<br/>\n <br/>\nSarah</div>","specialLinks":[]}],"prevTopicId":47345,"nextTopicId":47584}}