{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"HEM-Online-Newsletter  by way of Home Ed","from":"HEM-Online-Newsletter &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  July 2002","postDate":"1025717844","msgId":38950,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTk0YWI5NDhlNmMxMWQ0YUBbMjA4LjI2LjIyNy4yMjBdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":38949,"nextInTime":38951,"topicId":38950,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS July 2002 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS! For more","messageBody":"<div id=\"ygrps-yiv-200214420\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nJuly 2002<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS! For more information on Home Education <br/>\nMagazine, see the end of this newsletter or visit our web site at <br/>\nhttp://home-ed-magazine.com. Send your comments and questions to <br/>\neditor Carol Narigon at HEM-Newsletter@....<br/>\n<br/>\nIn the July issue:<br/>\n<br/>\n~ Letter to My Neurosurgeon ~<br/>\n~ Visual Thesaurus ~<br/>\n~ Ask Carol ~<br/>\n~ Linda Dobson Goes Mainstream ~<br/>\n~ Unschooling ~<br/>\n~ Trusting the Children, Trusting Ourselves ~<br/>\n~ Myth America ~<br/>\n~ BookCrossing.com ~<br/>\n~ FirstGov for Kids ~<br/>\n~ NHEN ~<br/>\n~ The Final Word ~<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nWhen you give a lesson in meanness to a critter or a person, don&#39;t be<br/>\nsurprised if they learn their lesson. ~~ Will Rogers ~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nLETTER TO MY NEUROSURGEON<br/>\nhttp://www.home-ed-magazine.com/HEM/194.html<br/>\n<br/>\n&quot;...You see, we don&#39;t really homeschool at the kitchen table. Few <br/>\nhomeschoolers do, though that is the image the media has chosen to <br/>\ngive us. Our kitchen table is generally too full of various projects <br/>\nto accommodate bookwork. Once it was Native American pottery (our <br/>\nversion of it, anyway). Another time leaves of all colors and sizes <br/>\ncovered the surface as we painstakingly ironed delicate window <br/>\ndecorations. Often times my inventive, creative daughter usurps the <br/>\ntable for her own purposes, leaving us to eat in the living room once <br/>\nagain.<br/>\n<br/>\nMuch of our homeschooling has taken place outside, in fields, on <br/>\nrivers, in the forests, and near ponds. Sometimes our homeschool <br/>\ncomes from investigating odd parts of town, discovering old shops and <br/>\nunusual restaurants. So much of our homeschool comes from the library <br/>\nthat we practically live there, volunteering when we can. We&#39;ve spent <br/>\nlots of time learning with friends, girl scouting, science club, <br/>\nsports and other pursuits that throw us together with people of all <br/>\nages and interests.<br/>\n<br/>\nQuite frankly, none of this would be possible without me. I am <br/>\npivotal to this life of ours. The facilitator, the nutritionist, the <br/>\nscheduler, and the protector. I am the dreamer who envisions what <br/>\nlearning and life can be and I am the bricklayer who lays the <br/>\nfoundation. I am the one who lights the candles and adds the fresh <br/>\nflowers. I am the one who wraps the children up in the middle of the <br/>\nnight and serves their hot chocolate outside so they can watch stars <br/>\nstreaking across the sky. I am the one who warms the honey-colored <br/>\nbeeswax so they can create fragrant models. I am the one who once <br/>\nfilled an entire high school auditorium with homeschoolers so that my <br/>\nown children could watch knights joust and sword fight. I help them <br/>\nfind mentors, take classes, and shape dreams. As they grow older, I <br/>\nhelp them plan their lives and listen to their hopes and aspirations.<br/>\n<br/>\nI often think that homeschooling moms overlook just how important <br/>\nthey are. Do any of us wonder just what might happen to their <br/>\nfamilies if they weren&#39;t there? I have had to do this and it&#39;s <br/>\nfrightening...&quot; ~~ excerpt from Teri Brown&#39;s article in the <br/>\nJuly/August issue of Home Education Magazine ~~<br/>\n<br/>\nYou can read the rest of this thought-provoking story, as well as a <br/>\ncouple of articles and columns from the July/August issue at the <br/>\naddress above, but you&#39;ll have to get the magazine--the one you hold <br/>\nin your hands--to read them all! See special subscription information <br/>\nat the end of this newsletter or visit your local bookseller to get <br/>\nyour copy today.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nVISUAL THESAURUS<br/>\nhttp://www.plumbdesign.com/thesaurus<br/>\n<br/>\nI&#39;m not sure how to convince you a thesaurus can be exciting, but it <br/>\ncan! The Visual Thesaurus at http://www.plumbdesign.com/thesaurus <br/>\ngives you a 3-D view of a particular word and its synonyms, with the <br/>\nclosest relatives in bolder type and the second and third cousins <br/>\nfading to the back. You can click on any of the synonyms to bring it <br/>\nfront and center along with its own synonyms, creating a kind of <br/>\ntrail of meanings that can take some interesting turns. Use the <br/>\napplet in the bottom left corner to change nouns to verbs and verbs <br/>\nto adjectives or adverbs, or click on auto-navigate and just watch <br/>\nthe program gently change on its own. This is truly an elegant <br/>\nprogram.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nASK CAROL<br/>\n<br/>\nIn addition to editing this newsletter, I write a column for Home <br/>\nEducation Magazine. Now, I don&#39;t want to take Ann Lander&#39;s place, but <br/>\nI will take those thorny questions and problems you struggle with and <br/>\ntry to give you some options or information that might help you. <br/>\nAlthough I don&#39;t answer the questions in this newsletter, I do answer <br/>\nthem in every issue of HEM, the original print version where <br/>\nhomeschoolers have found support for over 20 years. A couple of them <br/>\nare online (http://www.home-ed-magazine.com), but most you have to <br/>\nread in the magazine.<br/>\n<br/>\nI really like to get your questions-any questions at all, even if you <br/>\nthink your question is too stupid and you&#39;re the only one who has <br/>\nyour particular problem (probably not true). So, don&#39;t be shy; don&#39;t <br/>\nprocrastinate; send me your questions. I even have a special email <br/>\naddress: askcarol@... . Of course, I don&#39;t promise I <br/>\ncan answer every question in the magazine (especially if you don&#39;t <br/>\nsend one!), but I try to respond to each one, whether I use it for a <br/>\ncolumn or not. Don&#39;t wait! (~ CN ~)<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\nhttp://www.unschooling.com<br/>\n<br/>\n&quot;As an electrical engineer (in my former life) I took a *lot* of math <br/>\n(4 years in HS and at least 10 course in college.) I love math. I did <br/>\nwell at math. School math is like puzzles for me. Lots of pattern <br/>\nrecognition.<br/>\n<br/>\nBut that helped me not at all in electrical engineering because what <br/>\ngeneralized subjects lack is *context*. Being able to solve numerous <br/>\nexamples of the various types of problems is the details when someone <br/>\nhas no experience with the big picture. Being able to find the slope <br/>\nof a line during the chapter on finding the slope of a line is <br/>\njumping through hoops so teachers can demonstrate to administrators, <br/>\nthe state and parents that a concept was taught. It&#39;s meaningless -- <br/>\nI&#39;m betting most people here who took algebra can&#39;t say why they&#39;d <br/>\nwant to find the slope of a line! -- when the kids have never <br/>\nexperienced needing a line graph for personally meaningful reasons <br/>\nnor experienced how the slope of a line that results from some real <br/>\nproblem is important and how a different slope would affect the <br/>\nmeaning of the outcome.<br/>\n<br/>\nKnowing how to do percentage problems before you&#39;ve experienced <br/>\ndozens of different ways percentages are used in real life, before <br/>\nyou&#39;ve actually had to use the *concept* of percentage is like <br/>\nlearning how to spell before you can speak.<br/>\n<br/>\nUnschooling provides kids with the opportunities to experience how <br/>\nmath is used in real life. They don&#39;t need to do a bazillion problems <br/>\nto understand the details. They need years of experience with how the <br/>\nconcepts are used in real contexts. After they understand the context <br/>\nthen the details -- that schooled kids take 12 years to learn -- are <br/>\nlearned in minutes and hours.&quot;  ~~ Joyce Fetteroll at the <br/>\nunschooling.com message boards ~~<br/>\n<br/>\nUnschooling.com offers a free monthly newsletter (edited by former <br/>\nAOL Homeschool Connection manager Deborah Cunefare), message boards, <br/>\nan email list and more just for unschoolers. To subscribe to the <br/>\nemail list send a blank email to:<br/>\nUnschooling-dotcom-subscribe@yahoogroups.com<br/>\nOr visit the email list website at: <br/>\nhttp://groups.yahoo.com/group/Unschooling-dotcom .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nLINDA DOBSON GOES MAINSTREAM<br/>\n<br/>\n From the Prima Publishing website <br/>\n(http://www.primapublishing.com/index.php): &quot;The August 2002 issue of <br/>\nBetter Homes and Gardens will contain an article on homeschooling <br/>\nwith Prima&#39;s Linda Dobson extensively quoted. Linda is the author of <br/>\n&#39;The First Year of Homeschooling Your Child,&#39; &#39;Homeschoolers&#39; Success <br/>\nStories,&#39; &#39;The Homeschooling Book of Answers,&#39; &#39;Homeschooling: The <br/>\nEarly Years,&#39; and coming in November 2002 &#39;The Ultimate Book of <br/>\nHomeschooling Ideas.&#39; The last book is how she is identified in the <br/>\narticle.&quot;<br/>\n<br/>\nAnd, &quot;The September 2002 issue of Reader&#39;s Digest will feature an <br/>\narticle about homeschooling which includes quotes from author Linda <br/>\nDobson...&quot;<br/>\n<br/>\nWow! Linda&#39;s taking homeschooling out into the world! You can read <br/>\nmore of Linda&#39;s writing in every issue of Home Education Magazine and <br/>\neven hear her speak at the California Home=Education Conference (see <br/>\nbelow).<br/>\n<br/>\n  &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHome Education Magazine<br/>\nhttp://www.home-ed-magazine.com<br/>\n<br/>\nThe Home Education Magazine website is a crash course in <br/>\nhomeschooling and it&#39;s ALL FREE! You&#39;ll find message boards, articles <br/>\nand columns, state laws, resources, support groups, email lists and a <br/>\nwhole lot more. Stop by and take advantage of us!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nTRUSTING THE CHILDREN, TRUSTING OURSELVES<br/>\nThe 2002 California Home=Education Conference<br/>\nAugust 16-18, Radisson Hotel Sacramento.<br/>\n<br/>\nA weekend of inspiring talks, workshops, and fun activities for <br/>\neveryone in the family! Keynotes: Jane Healy and Frank Smith. <br/>\nFeatured speakers: Mary Griffith, David Albert, Sandra Dodd, Richard <br/>\nPrystowsky, Marty Layne, Laurel Schmidt, Donald Asher, Wes Beach, <br/>\nLenore Hayes and Roneale Berry.  Delightful programs for teens, <br/>\ntweens and kids, as well as new panels and lots of round table <br/>\ndiscussions among homeschoolers. http://conference.hsc.org, or email <br/>\nconference@... or info@....<br/>\n<br/>\n(I&#39;ll be there! Will you? ~CN~)<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nMYTH AMERICA<br/>\n<br/>\nHEM Online News subscriber Susan Foreman writes: &quot;I wanted to let <br/>\nreaders know of a really neat half hour show on the Discovery <br/>\nCivilization Channel called &#39;Myth America.&#39;   A few of the shows I&#39;ve <br/>\nseen included myths about American presidents, the American flag, <br/>\ncelebrations, the Liberty Bell and other historical &#39;facts&#39; we&#39;ve <br/>\nbeen taught in textbooks and/or school growing up.<br/>\n<br/>\nFor example, the American flag was a subject of indifference until <br/>\nwell after George Washington fought in battle - the pictures of him <br/>\nin the boat with the flag are a fabrication of the artist! In that <br/>\nsame show it featured Betsy Ross&#39;s involvement or lack thereof with <br/>\nthe flag.  Very interesting stuff!   The episode featuring the <br/>\norigins of today&#39;s popular celebrations and holidays was <br/>\nenlightening! Perhaps it may be of interest to others who receive <br/>\nthis terrific e-newsletter - keep up the good work!&quot;<br/>\n<br/>\nThanks, Susan. I need to convince my cable company to add Discovery <br/>\nCivilization Channel to my cable lineup just so I can see this show. <br/>\nI looked at their website at http://civilization.discovery.com, and <br/>\nit looks like another excellent channel from the same people who <br/>\nbring us Discovery Channel, TLC, Animal Planet and other learning <br/>\nchannels. Myth America airs at 7pm every night. ~CN~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBOOKCROSSING.COM<br/>\nPress Release<br/>\nhttp://www.bookcrossing.com<br/>\n<br/>\nYou are cordially invited to play a part in an unlikely global <br/>\nsociology experiment spearheaded by a year-old Web site called <br/>\nBookCrossing.com: Lose your books.<br/>\n<br/>\nThe brainchild of a group of Kansas City-based computer consultants, <br/>\nBookCrossing.com encourages people to experience what it terms &quot;the <br/>\nkarma of literature&quot; by registering books at the site and then <br/>\nleaving them behind in public places, like coffee shops, airplanes, <br/>\nand park benches, reports Book magazine.<br/>\n<br/>\nPart book club, part behavioral study, part message in a bottle, it&#39;s <br/>\na concept made entirely possible by the Internet. Every book <br/>\nregistered at BookCrossing.com receives a unique ID number and a <br/>\nregistration card which can be printed out and attached inside the <br/>\nfront cover. The card explains the Book Crossing&#39;s mission and <br/>\ndirects anyone who finds a book toward its dedicated online journal <br/>\npage. There, recipients can post where they came across the book and, <br/>\nif they read it, what they thought of it.<br/>\n<br/>\nIn keeping with a favorite BookCrossing.com mantra, finders are not <br/>\nencouraged to become keepers. &quot;We call it &#39;read and release,&#39; &quot; says <br/>\nco-founder Ron Allen Hornbaker. &quot;It gives people a way to share their <br/>\nbooks without feeling like they&#39;re losing something. I think of it as <br/>\nletting something go as a means of keeping it.&quot;<br/>\n<br/>\nThe site makes no money, doesn&#39;t advertise, and relies entirely on <br/>\nword-of-mouth promotion. So far, that low-key strategy is yielding <br/>\ngood results. As of mid-June, the site boasted listings of 24,222 <br/>\nindividual books and 10,042 members.<br/>\n<br/>\n* This is terribly intriguing for a confirmed book addict like me. <br/>\nThere&#39;s even a place on the website where you can look up the book <br/>\nreleases in your city or town, and see where they occurred. What will <br/>\npeople think of next? ~CN~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nFIRSTGOV FOR KIDS<br/>\nhttp://www.kids.gov<br/>\n<br/>\nThe Federal Consumer Information Center, that place that sends out <br/>\nthe free and almost free brochures on everything from windmills to <br/>\nbuying a new car, has put together a great site for kids (you&#39;ll like <br/>\nit too). Lists of links are categorized into 20 subject areas <br/>\nincluding art, music, recreation, and transportation. You&#39;ll even <br/>\nfind a list of sites just for your state.<br/>\n<br/>\nWhile you&#39;re at it, you might as well check out the Federal Consumer <br/>\nInformation Catalog from the link on the FirstGov site. Those <br/>\npamphlets that used to cost fifty cents or a dollar are now free <br/>\nonline. They also offer a lot of other information and services for <br/>\nconsumers. Isn&#39;t the Internet great?<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nNATIONAL HOME EDUCATION NETWORK<br/>\nhttp://www.nhen.org<br/>\n<br/>\nIf you haven&#39;t taken a look at the NHEN website in a while, you need <br/>\nto go there NOW and see what this organization is doing. I can&#39;t <br/>\nbelieve it&#39;s only been 2 years since a handful of hard-working, <br/>\ndedicated homeschoolers banded together to create a creative, dynamic <br/>\nhomeschool organization for all homeschoolers. They have so much to <br/>\noffer-information, advocacy, discussion lists, newsletters (NHENotes <br/>\nis great!), and even t-shirts and tote bags.<br/>\n<br/>\nIf you haven&#39;t joined yet, why not do what thousands of homeschoolers <br/>\nhave done in the past 2 years? Get over there and sign up. We are <br/>\npowerful when we stand together!<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at <br/>\nHEM-Newsletter@....<br/>\n<br/>\n________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nWhat do you call your family? Unschoolers//Interest-Based <br/>\nLearners//Life-Long Learners//Eclectic Homeschoolers//Learner-Led <br/>\nSchoolers//Relaxed Homeschoolers//<br/>\nWhatever you call yourselves, The Resourceful Homeschooler carries great<br/>\nbooks, science materials and kits, learning games, and the most interesting<br/>\nsoftware. Visit us at http://www.resourcefulhomeschooler.com .<br/>\nMaterials to involve, inspire and support independent learners of all ages!<br/>\n_________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nNew science and art books for spring and summer are in...several new <br/>\nseries to engage and delight your children and you. Shop online and <br/>\nearn FREE books at: http://www.UsborneAmerica.com. For personal <br/>\nshopping service, email SharonVE@... or call 888-474-8499 toll <br/>\nfree. Sharon Vander Ende, Supervisor, Usborne America.<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\ngnarlymath.com<br/>\n<br/>\nMATH AND THE MEDIA.  BOY, ARE WE MISLED! Look at the types of math <br/>\nerrors made by TV and newspaper reporters in the latest issue of the <br/>\nGnarly Gnews. Subscribe to our free newsletter, download free <br/>\nexamples of our CD-ROM Solid Gold Gnarly Math, show your children how <br/>\nmuch fun math can be, and refresh your own math. It&#39;s all at <br/>\nhttp://www.gnarlymath.com . Our moneyback-guaranteed CD will make <br/>\nAlgebra, Geometry, Trig, Topology, and Probability fun for you and <br/>\nyour children.<br/>\n_________<br/>\n<br/>\nTEACH YOUR CHILD TO READ!  TRY ONLINE LESSONS NOW FOR FREE!<br/>\nheadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading <br/>\nprogram that will give your child a real advantage by systematically <br/>\nteaching essential skills and strategies ensuring reading success and <br/>\nconfidence. Outstanding fast results!  After just five 20-minute <br/>\nanimated, interactive episodes, children read their first Headsprout <br/>\nbook. Act quickly! For a limited time you can try out Headsprout <br/>\nReading FOR FREE!<br/>\nhttp://www.headsprout.com Please enter the promotional code: HENJ7<br/>\n_________<br/>\n<br/>\nFREE ONLINE VEGETABLE GARDENING TRAINING FOR HOMESCHOOLERS!<br/>\ngrowfood.com<br/>\n<br/>\nGet world renowned Dr. Jacob R. Mittleider&#39;s &#39;Mittleider Basics <br/>\nCourse&#39; free at www.growfood.com.  Go to Online Education section and <br/>\nenjoy.  Books, Natural Mineral Nutrients & CD ROM&#39;s also available. <br/>\nAlso, look at the Garden Master CD, with $70 in Mittleider gardening <br/>\nbooks and manuals and a great program to take your children through <br/>\nevery step of the gardening process.  Took 3 years & $100,000 to <br/>\ncreate and costs only $29.95.  Look in Products under Garden Master.<br/>\n_________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\nhttp://www.home-ed-magazine.com<br/>\n<br/>\nIn the July/August issue of Home Education Magazine, you&#39;ll enjoy <br/>\narticles on learning to write without school, German, single-parent <br/>\nhomeschooling, a family learning center and more. Columns include: <br/>\nPeter Kowalke wonders if college and homeschool fit; Linda Dobson <br/>\ncelebrates independence; Laura Weldon offers advice on animal <br/>\nhusbandry and science; Ann Zeise stays on-topic in email <br/>\nconversations; and Barbara Theisen goes to infinity and beyond. Other <br/>\ncolumnists include Larry and Susan Kaseman, Sandra Dodd, Becky Rupp, <br/>\nDavid Albert and Carol Narigon. HEM also offers a special essay by <br/>\npublisher Helen Hegener, classified ads, letters and discussion, pen <br/>\npals and networking, and more.<br/>\n<br/>\nSubscriptions to Home Education Magazine are currently $26 (regularly <br/>\n$32.00) for one year/6 issues; $48 (regularly $64) for 2 years; <br/>\nsingle issue $6.50. Home Education Magazine, PO Box 1083, Tonasket WA <br/>\n98855; for orders: toll-free 1-800-236-3278; email <br/>\norders@.... MC/Visa cards accepted.<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\nhttp://jewishworldreview.com/strips/mallard/2000/mallard061002.asp<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To <br/>\nsubscribe, visit our web site at <br/>\nhttp://www.home-ed-magazine.com/wlcm_hemnewsltr.html or send an email <br/>\nto majordomo@... with the words subscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. subscribe hem-online-newsletter <br/>\nyouremailaddress). To unsubscribe, send an email to <br/>\nmajordomo@... with the words unsubscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter <br/>\nyouremailaddress). To change the address at which you receive the <br/>\nnewsletter, unsubscribe your old address and then subscribe to your <br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\nHEM-Newsletter@...<br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":38881,"nextTopicId":38949}}