{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":522719163,"authorName":"","from":"sukaynalabboun@...","profile":"sukaynalabboun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Using this group well","postDate":"1457369289","msgId":76878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDMjQwMTlCLTQ0RDMtNDgzMi1CRkI2LUIzMjEzMEZEQzIyN0B5YWhvby5jb20+","inReplyToHeader":"PDBCQTRCQ0EzLTlBREEtNDIxQi04REI3LTI4RTZDRkU1NTA4MUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDBCQTRCQ0EzLTlBREEtNDIxQi04REI3LTI4RTZDRkU1NTA4MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":76876,"nextInTopic":0,"prevInTime":76877,"nextInTime":76879,"topicId":76876,"numMessagesInTopic":0,"msgSnippet":"I know we are not meant to post thank-you s here, but I feel it is important to thank Sandra (and all the moderators) for keeping this group on track.","messageBody":"<div id=\"ygrps-yiv-586124606\">I know we are not meant to post &quot;thank-you&#39;s&quot; here, but I feel it is important to thank Sandra (and all the moderators) for keeping this group on track. Focussed squarely on unschooling principles. It is what makes this group both unique and valuable, and at least for our family, one of two main resources for unschooling information.<br/>\n<br/>\n I would rather read posts answered from a well-thought-out and knowledgeable, experienced perspective than just a pat on the back. I can probably find that almost anywhere, especially online, but I cannot find creative solutions to issues in unschooling families, suggestions for improving our lives as unschoolers, or the really tough questions posed at times in response to a post. That picking things apart has helped me in my thinking, in my clarity of thought and communication. It has really helped me in becoming much more mindful of my words and actions (always improving hopefully, no such thing as perfection is a hard one ;-)<br/>\n<br/>\nI am extremely grateful for the group as it is, since it honors my time and intellect and challenges my thinking to do better.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Using this group well","postDate":"1457364057","msgId":76876,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBCQTRCQ0EzLTlBREEtNDIxQi04REI3LTI4RTZDRkU1NTA4MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":76878,"prevInTime":76875,"nextInTime":76877,"topicId":76876,"numMessagesInTopic":0,"msgSnippet":"Always Learning is fifteen years old (since November) so it’s in its sixteenth year.  It can be frustrating for moderators who have helped for years (fifteen","messageBody":"<div id=\"ygrps-yiv-1401236741\">Always Learning is fifteen years old (since November) so it’s in its sixteenth year.  It can be frustrating for moderators who have helped for years (fifteen years, some of them) to field complaints about the group from people whose children are younger than fifteen years, or who have only been unschooling for a couple of years (or less).<br/>\n<br/>\nIn what ended up being side conversation, someone wrote &quot;Is the point of the group to find good solutions for parenting/communicating/unschooling? Should you worry more about how people will cope with a different perspective or the idea itself? What if it was a new, good idea?”<br/>\n<br/>\nThe idea itself.  The purpose of the group is to discuss ideas in the light of unschooling.<br/>\nAny idea brought as a question or as part of a response can, should, be put on the table under the bright lights of unschooling principles.  <br/>\n<br/>\nThat is stated on the main page of this group.  I will bring the group’s description:<br/>\n___________________________<br/>\n<br/>\nGroup Description<br/>\n<br/>\nNEW MEMBERS: Read at the Group Website link below before posting.<br/>\n<br/>\nHow and why does unschooling work? What kind of parents and parenting<br/>\ndoes it take? What will help, and what will hinder?<br/>\n<br/>\nThis is a list for the examination of the philosophy of unschooling<br/>\nand attentive parenting and a place for sharing examined lives based<br/>\non the principles underlying unschooling. <br/>\n<br/>\nAlways Learning will focus on how people learn no matter<br/>\nwhere in the world they are, rather than on what&#39;s legal in any<br/>\nparticular country or jurisdiction.  <br/>\n<br/>\nThis is a moderated group, with trapdoors for the uncooperative. (Not moderated in the advance-approval way, but in the be-nice-to-play way. New members&#39; posts are moderated, and it&#39;s good to read several dozen posts before jumping in.) <br/>\n<br/>\nIf you&#39;ve never read any John Holt, his thoughts and writing are behind unschooling. There is a link on that page, too. <br/>\n<br/>\n&quot;I can honestly say that I&#39;ve grown more as a person, parent and unschooler due to the discussions on this list than on any other list I&#39;ve been on.”<br/>\n<br/>\nGroup Website:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearning\">http://sandradodd.com/lists/alwayslearning</a><br/>\n___________________<br/>\n<br/>\n-=-Is the point of the group to find good solutions for parenting/communicating/unschooling?-=-<br/>\n<br/>\nNot for parenting.  Not for communicating.  Not “to find good solutions,” even.  To discuss the philosophy of unschooling.  <br/>\n<br/>\nBy discussing unschooling and what helps, then within a family parenting is improved.  Communication is improved.  Relationships are improved.  Clarity of thought, and analytical thought are improved.<br/>\n<br/>\n-=-What if it was a new, good idea?-=-<br/>\n<br/>\nNew, good ideas in keeping with unschooling principles are wonderful. <br/>\n<br/>\n-=-  I was offering a solution for a conflict of needs resolution and some reassurance from one peaceful parent to another.-=-<br/>\n<br/>\n“Peaceful parent” is applied to lots of philosophies and ideas.  If it’s not unschooling-specific, there are other places to discuss it.<br/>\n<br/>\n“Some reassurance” when it’s unschooling based is okay, but generally “reassurance” is “support,” and generally in online discussions, “support” is fluff at best, and dangerous at worst.<br/>\n<br/>\nSupport groups abound.  This is &quot;a list for the examination of the philosophy of unschooling and attentive parenting and a place for sharing examined lives based on the principles underlying unschooling.”<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":76706,"nextTopicId":76881}}