{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":44602810,"authorName":"Stefanie Mohsennia","from":"Stefanie Mohsennia &lt;mohsennia@...-wuppertal.de&gt;","profile":"drmohde","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Support for German homeschooling movement","postDate":"1108128959","msgId":103319,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMENCNEJGLjQwNjA2QGJpYi51bmktd3VwcGVydGFsLmRlPg=="},"prevInTopic":103284,"nextInTopic":0,"prevInTime":103318,"nextInTime":103320,"topicId":103274,"numMessagesInTopic":0,"msgSnippet":"Hi Sandra, the translation is correct. Ute Schaefer actually said The Compulsory Education law is a child s right to education and to grow up within our ","messageBody":"<div id=\"ygrps-yiv-1609441063\">Hi Sandra,<br/>\n<br/>\nthe translation is correct. Ute Schaefer actually said &quot;The Compulsory <br/>\nEducation law is a child&#39;s right to education and to grow up within our <br/>\ncommunity. It is the parent&#39;s duty to grant their children this right.&quot; <br/>\nBut what happens if the child himself decides that &quot;no, thank you&quot; he <br/>\nprefers not to make use of his right to state education? Can and/or <br/>\nshould a right be transformed into compulsion?<br/>\n<br/>\nYou wrote:<br/>\nMaybe instead of random foreigners writing to a government official in<br/>\nGermany, a bright German writer should summarize other kinds of <br/>\nhomeschooling,<br/>\nlisting other countries in which homeschooling has taken hold without <br/>\ndisasters,<br/>\nand work from inside that way.<br/>\n<br/>\nThat&#39;s exactly what I have just done, my book was published last <br/>\nDecember: www.leben-ohne-schule.de/schulfrei.html. Hope that more <br/>\ninformation about homeschooling will some day bring about a change of <br/>\ncompulsory schooling laws to a right to education. Unfortunately, we <br/>\nGermans can be really conservative, pigheaded and reluctant to try <br/>\nsomething new.<br/>\n<br/>\nMany greetings from Germany,<br/>\nStefanie<br/>\nwww.unschooling.de</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Support for German homeschooling movement","postDate":"1108040660","msgId":103284,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5LjU3Yzc4MTlmLjJmM2NiNWQ0QGFvbC5jb20+"},"prevInTopic":103274,"nextInTopic":103319,"prevInTime":103283,"nextInTime":103285,"topicId":103274,"numMessagesInTopic":0,"msgSnippet":"In a message dated 2/10/05 2:13:07 AM, mohsennia@bib.uni-wuppertal.de writes: ","messageBody":"<div id=\"ygrps-yiv-602955551\">In a message dated 2/10/05 2:13:07 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mohsennia@...\">mohsennia@...</a>-wuppertal.de writes:<br/>\n<br/>\n&lt;&lt; Because of this the public in Germany believe that home education is not<br/>\n<br/>\nabout the best interest of the child but rather about the parents<br/>\n<br/>\ndisseminating (again what many members of the public - probably all but<br/>\n<br/>\na few would see as being) a strange world view.&quot; &gt;&gt;<br/>\n<br/>\nThe U.S. has probably hundreds of thousands of homeschoolers who fit that <br/>\ndescription, so it&#39;s a stereotype with a solid basis and many living examples.   <br/>\n<br/>\nThat&#39;s unfortunate, but if homeschoolers deny it exists, it makes them all <br/>\nlook underhanded and dishonest.   So when homeschoolers say &quot;That&#39;s not true,&quot; <br/>\nor &quot;Why would you think that?&quot; it only helps the critics entrench deeper.  I <br/>\nthink it&#39;s better to say &quot;Though some do, others don&#39;t!&quot;  <br/>\n<br/>\nBut in a society used to more conformity (Japan, Germany) and less individual <br/>\n&quot;whatever&quot; (Canada &lt;g&gt;), that honesty might be enough to make people say &quot;If <br/>\nONE family wants to keep kids home to tell them dinosaurs are a Satanic plot <br/>\nand that Jesus is coming before May so going to school would have been stupid, <br/>\nthen homeschooling will never be legal here.&quot;<br/>\n<br/>\n-=-One homeschooling mother here in Germany called the local<br/>\n<br/>\nauthorities in January and got the answer: &quot;Oh yes, I am familiar with<br/>\n<br/>\nhomeschooling. It is for circus children.&quot; -=-<br/>\n<br/>\nHEY!  So in Germany it&#39;s legal for circus children to homeschool?<br/>\nCool!  I had heard it was illegal in Germany, period.<br/>\n<br/>\n-=- Seven Families who are members of an extreme-Baptist community <br/>\n<br/>\nin  Paderborn . . .-=-<br/>\n<br/>\nI grew up Baptist.  I&#39;m sorry there are extreme Baptists in Paderborn.<br/>\n<br/>\n-=-The Compulsory Education law is a child&#39;s right to education <br/>\n<br/>\nand to grow up within our community. It is a cornerstone of our society <br/>\n<br/>\nin Germany. Therefore, it is the parent&#39;s duty to let children <br/>\n<br/>\nparticipate. -=-<br/>\n<br/>\nI realize it was translated, but this is one of the problems with <br/>\n&quot;compulsory&quot; and &quot;let&quot; all in one place.  If it&#39;s compulsory, parents don&#39;t &quot;let&quot; them <br/>\nparticipate, they are bound by law to force them to participate.   <br/>\n<br/>\nMaybe instead of random foreigners writing to a government official in <br/>\nGermany, a bright German writer should summarize other kinds of homeschooling, <br/>\nlisting other countries in which homeschooling has taken hold without disasters, <br/>\nand work from inside that way.  People tend to hate to hear from outsiders, <br/>\n&quot;Well WE do it this way.&quot;  <br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":44602810,"authorName":"Stefanie Mohsennia","from":"Stefanie Mohsennia &lt;mohsennia@...-wuppertal.de&gt;","profile":"drmohde","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Support for German homeschooling movement","postDate":"1108026430","msgId":103274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMEIyNDNFLjcwODA4MDFAYmliLnVuaS13dXBwZXJ0YWwuZGU+"},"prevInTopic":0,"nextInTopic":103284,"prevInTime":103273,"nextInTime":103275,"topicId":103274,"numMessagesInTopic":0,"msgSnippet":"Hi everybody, we could need some support and enlightenment here in Germany. Currently, there is again a case of religious homeschoolers being harrassed by the ","messageBody":"<div id=\"ygrps-yiv-1618719186\">Hi everybody,<br/>\n<br/>\nwe could need some support and enlightenment here in Germany. Currently,<br/>\nthere is again a case of religious homeschoolers being harrassed by the<br/>\nschool authorities. Here is an account of the case:<br/>\nwww.hslda.org/hs/international/Germany/200501100.asp?PrinterFriendly=True<br/>\n<br/>\nAs Mike Fortune-Wood put it on the learning-unlimited mailing list:<br/>\n&quot;I think one of the problems in Germany is that the public have the idea<br/>\nthat the only reason one would home educate is one of religious<br/>\nseparatism. That parents with extreme religious views want to keep their<br/>\nchildren away from modern society and teach them what many secular<br/>\npeople would think of as being odd ideas.<br/>\nIts noticeable that all the groups that we have heard about are such<br/>\ngroups and even the newspaper polls that have been run work on that<br/>\nassumption.<br/>\nBecause of this the public in Germany believe that home education is not<br/>\nabout the best interest of the child but rather about the parents<br/>\ndisseminating (again what many members of the public - probably all but<br/>\na few would see as being) a strange world view.&quot;<br/>\n<br/>\nIt would be great if you could write to the persons below to tell them<br/>\nthat homeschooling has different faces, that it is a completely accepted<br/>\neducational alternative in your country and how much you love your<br/>\nhomeschooling lifestyle:<br/>\n<br/>\nMs. Ute Schaefer, Secretary for Education in Northrhine-Westfalia:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ute.schaefer@...\">ute.schaefer@...</a><br/>\nMr. Manfred Mueller, Landrat Paderborn (county official):<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:landrat@...\">landrat@...</a><br/>\n<br/>\nUte Schaefer used to be an English teacher, so no problem to write in<br/>\nEnglish. One homeschooling mother here in Germany called the local<br/>\nauthorities in January and got the answer: &quot;Oh yes, I am familiar with<br/>\nhomeschooling. It is for circus children.&quot; Here is an interview Ms.<br/>\nSchaefer gave on Jan. 17th, translated into English:<br/>\n<br/>\nInterview with the Minister for Schools and Children, Ms. Ute Schaefer, <br/>\ngiven by the NRW press entitled: Compulsory Schooling isn&#39;t an End in <br/>\nItself (Schulpflicht ist kein Selbstzweck, 17.1.05)<br/>\n<br/>\nSummary: Seven Families who are members of an extreme-Baptist community <br/>\nin  Paderborn are refusing to send their 15 children to school (as we <br/>\nhave reported). No solution to this problem in Paderborn is in sight. <br/>\nThe county government Integration Official, Klaus Lefringhausen, wants <br/>\nto conduct talks with the parents. NRW Minister<br/>\nfor Schools Ute Schäfer (SPD party) gives her first public interview <br/>\nabout the case here. This interview was conducted by Carsten Heil.<br/>\n<br/>\nHeil: Ms. Schaefer, can you understand the point of view of the Baptist <br/>\nfamilies who are not sending their children to school?<br/>\n<br/>\nSchaefer: The Compulsory Education law is a child&#39;s right to education <br/>\nand to grow up within our community. It is a cornerstone of our society <br/>\nin Germany. Therefore, it is the parent&#39;s duty to let children <br/>\nparticipate. Thus I have  no understanding for parents who behave in <br/>\nthis way.<br/>\n<br/>\nHeil: What is to be done, now, to resolve this impasse in Paderborn?<br/>\n<br/>\nSchaefer: The well-being of the children must be at the center of our <br/>\nefforts. For that there are legal guidelines, in which all parties are <br/>\nnow involved. Klaus Lefringhausen, the county Integration Official, has <br/>\nbeen called on to arbitrate. He is on the job now. I don&#39;t wish to <br/>\nanticipate the outcome of these talks. But it is completely clear, that <br/>\nthe law of Compulsury Education will be enforced. It isn&#39;t an end unto <br/>\nitself, rather we are thinking about the children. And that is what is <br/>\nin our hearts.<br/>\n<br/>\nHeil: The effected families have applied to found their own school. <br/>\nShouldn&#39;t the school authorities at least look their application over?<br/>\n<br/>\nSchaefer:  In our county, Nordrhein-Westfalen, we have faith-based <br/>\nschools. They are open for all other children. We have an excellent <br/>\nsupply of those schools for parents who want to send their children to a <br/>\nChristian-oriented school. I don&#39;t see any need for any further schools.<br/>\n<br/>\n<br/>\nThanks so much for your support!<br/>\n<br/>\nStefanie Mohsennia<br/>\nwww.unschooling.de</div>","specialLinks":[]}],"prevTopicId":103316,"nextTopicId":103217}}