{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":10,"messages":[{"userId":130289185,"authorName":"Alice","from":"Alice &lt;alijay@...&gt;","profile":"alijaywec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"grief help","postDate":"1073498489","msgId":17792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGRkM0OTc5LjUwNjA1MDhAZWMucnIuY29tPg=="},"prevInTopic":17790,"nextInTopic":0,"prevInTime":17791,"nextInTime":17793,"topicId":17770,"numMessagesInTopic":0,"msgSnippet":"I haven t been getting all of my yahoo messages, only a spattering here and there. Went to the web site and found all these I d never even gotten... Anyway,","messageBody":"<div id=\"ygrps-yiv-1853176975\">I haven&#39;t been getting all of my yahoo messages, only a spattering here and there. Went to the web <br/>\nsite and found all these I&#39;d never even gotten...<br/>\n<br/>\nAnyway, thank you for all the help and advice for this family.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;Well, except for the murderous accusations, I think it&#39;s a perfectly<br/>\n </span></blockquote>normal way to feel.&lt;&lt;<br/>\n<br/>\nI&#39;m even finding out that the murderous accusations aren&#39;t even all that uncommon.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;The dad in this family needs to be able to<br/>\n </span></blockquote>understand the kids&#39; feelings, not try to argue them out of having those<br/>\nfeelings just so he can feel better. He should not try to make them<br/>\nfeel wrong about the way they feel.&lt;&lt;<br/>\n<br/>\nHe is a very supportive person and always lets them be angry, express there feelings, whatever. He <br/>\nwould never say what they were feeling was wrong. He has said some of the things they said were very <br/>\nhurtful though.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;My uncle is 80 and his wife died a little more than a year ago. When he<br/>\n </span></blockquote>got remarried, not all of his kids were cheerful about it. And I&#39;m<br/>\ntalking &quot;kids&quot; that are in their 50s.&lt;&lt;<br/>\n<br/>\nWow, I find that pretty amazing. My mom remarried about a year and a half after my dad died. (I was <br/>\nmid twenties) I loved my dad but was still happy for my mom...<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;Looping back to the beginning, a man who hides his grief from his<br/>\n </span></blockquote>children messes everything up.&lt;&lt;<br/>\n<br/>\nHe definitely never did that. He was very open about how devastated he was. There is an extremely <br/>\ntouching web site dedicated to her and is a very good look at the depth of his love for her.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;And a sad side-effect will be that the relatives may have unwittingly<br/>\n </span></blockquote>suggested that their mom was wrong to be homeschooling them,&lt;&lt;&lt;<br/>\n<br/>\n From what I could tell, all the relatives were very supportive of the family homeschooling. The <br/>\nkids are really bright. All the other homeschool moms that knew her envied her energy and creativity <br/>\nas she did things with the kids. Then the family took off in an rv and traveled around the country. <br/>\nI&#39;ve always heard she did all the right things to foster a love of learning.<br/>\n<br/>\nBUT then the dad wanted to keep homeschooling them. Mostly because he thought they wanted to, I <br/>\nthink. That didn&#39;t work. The daughter wanted the school social scene desperately. So he let them go <br/>\nthis year after giving it a shot last year. I could see how the kids might&#39;ve changed their minds <br/>\nabout hs&#39;ing (other than wanting the social scene) since he (admittedly) wasn&#39;t as relaxed or <br/>\ncreative as she was and did things very differently than she did.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;There are often<br/>\n </span></blockquote>groups for kid OR adults, but none for the entire family at the same time. If<br/>\nyou could find that it would be awesome.&lt;&lt;&lt;<br/>\n<br/>\nHe contacted the small local hospice and they didn&#39;t have anything at all for kids. Then I told him <br/>\nabout the one farther away. I talked to the woman there and she said she&#39;d definitely be able to do <br/>\nit as a family thing short term and would be able to recommend someone if they wanted to continue. <br/>\n(I can&#39;t see why going with the whole family wouldn&#39;t be a common way in the first place)  She also <br/>\nmentioned school counselor or psychologist, which I hadn&#39;t thought of.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt; Another thing, this Dad must be somewhat clueless if he really thought his kids were fine and <br/>\n </span></blockquote>not even grieving much. That&#39;s a big sign that they don&#39;t feel they have enough support to share <br/>\ntheir grieving!&lt;&lt;&lt;<br/>\n<br/>\nThis is the confusing part. He grieved openly. Tried at times to bring them out. Asking them if they <br/>\never want to talk about her, it&#39;s ok to miss her, that kind of thing. They visit relatives about 6-7 <br/>\nhours away, pretty frequently (her side of the family). This is the message he&#39;s always gotten from <br/>\nthe mom&#39;s family. &quot;Well _of course_ the kids are doing all right. They&#39;re strong, mature, wonderful, <br/>\nkids. There _her_ kids after all.&quot; Like how could you expect kids who had the perfect mother be <br/>\nanything less than perfect. I&#39;m beginning to think the kids may have been getting that &quot;be strong&quot; <br/>\nthing (as in don&#39;t be sad) from her family or maybe his, who knows?.  I remember him trying to bring <br/>\nthem out, trying to get them to show some emotion about there mom and they would get angry with him <br/>\nand say they were FINE.<br/>\n<br/>\n<blockquote><span title=\"ireply\">  &gt;&gt;&gt;I think he really needs to find ways to honor the memory of their mother, do things that show <br/>\n </span></blockquote>she is not being forgotten.<br/>\nIt doesn&#39;t sound like he was honoring her loss, or her memory in very healthy ways.&lt;&lt;&lt;<br/>\n<br/>\nOh, but he has. (I think, anyway) There are library books donated to the local library in her <br/>\nmemory. (He suggested they take one of the books out to read and the daughter got mad.)  On the <br/>\nanniversary of her death they had a celebration of her life and a ceremonial burning of the sympathy <br/>\ncards they&#39;d received. (apparently the kids thought that was a good idea too, but I thought it <br/>\nsounded a bit strange)  At christmas there was an entire tree in her honor decorated with pics and <br/>\nmementos (and her favorite hat under it...)   He&#39;s always made an attempt to keep her memory alive <br/>\nand speaks of her freely.<br/>\n<br/>\nWhatever the cause of all the bottled up anger, at least he&#39;s not attempting to pretend it didn&#39;t <br/>\nhappen. He&#39;s doing something about it.<br/>\n<br/>\nThe kids had off of school for the holidays when we had park day (last friday). He managed to <br/>\nconvince the 10yob to go, though not easily. &quot;why do I have to go play with a bunch of <br/>\nhomeschoolers?&quot; Even though he and my son seemed to be really good friends in the past, he seemed to <br/>\nthink he couldn&#39;t be friends with him anymore. The next two days is when the &quot;explosion&quot; occurred. <br/>\nI&#39;m not sure when in time it relates to the woman, but he also said he wasn&#39;t really &quot;dating&quot; her, <br/>\njust invited her and two of her kids to dinner.  One thing that was revealed was that the daughter <br/>\nhad been reading his emails!!!! This (as you could imagine) kind of freaked him out. He also <br/>\nmentioned he thought that the daughter was harmfully influencing the son and putting ideas into his <br/>\nhead. (he didn&#39;t say turning him against him, but it sounded something like that)<br/>\n<br/>\nNOW, (yesterday?) he emailed me and said his son has asked to homeschool again next year. YIPPEE!! <br/>\nHe may not be a lost soul after all. I have no idea what happened for him to change his attitude so <br/>\nabruptly, but with the proximity of the rough weekend, I wonder...  The boy said homeschooling (the <br/>\ndad said it as &quot;self directed learning&quot;) far outweighed any social life he&#39;d get from school. Now I <br/>\njust have to work on the unschooling part.<br/>\n<br/>\nSorry for the lengthy soap opera. But I thought it would help answer some questions.<br/>\n<br/>\nThanks again for all the help. I think they&#39;re on the right track.<br/>\n<br/>\nAlice</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"grief help","postDate":"1073492676","msgId":17790,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTA3LjA4MjUzMi4xOTk5NS4zNzI4MjZAd2VibWFpbDA5Lm55Yy51bnRkLmNvbT4="},"prevInTopic":17789,"nextInTopic":17792,"prevInTime":17789,"nextInTime":17791,"topicId":17770,"numMessagesInTopic":0,"msgSnippet":"Another thing, this Dad must be somewhat clueless if he really thought his kids were fine and not even grieving much. That s a big sign that they don t feel","messageBody":"<div id=\"ygrps-yiv-647581679\">Another thing, this Dad must be somewhat clueless if he really thought his kids were fine and not even grieving much. That&#39;s a big sign that they don&#39;t feel they have enough support to share their grieving!<br/>\n<br/>\nI think he really needs to find ways to honor the memory of their mother, do things that show she is not being forgotten. Special trees planted, memorials made, or rituals really help grieving people find connections to their loved one that has died. We don&#39;t ever &quot;get over&quot; losing a loved one, we do however, need to figure out a relationship with them that does not involve their physical presence, a most difficult thing to do.<br/>\nIt doesn&#39;t sound like he was honoring her loss, or her memory in very healthy ways. <br/>\nSomething we did at Christmas that was very nourishing for us, was to line our hearth with pictures of our loved ones that are no longer with us. We lit a bunch of small candles and made a small &quot;altar&quot; so to speak. It was very beautiful up there with all the pretty Christmas stuff, and it reminded us of those we miss, but are still with us in so many ways. Honoring the dead is important to the living. I think he really needs to find ways to do this with his children (without the other woman involved as of yet).<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"Ren &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"grief help","postDate":"1073492321","msgId":17789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTA3LjA4MTkxNy4xOTk5NS4zNzI3OThAd2VibWFpbDA5Lm55Yy51bnRkLmNvbT4="},"prevInTopic":17784,"nextInTopic":17790,"prevInTime":17788,"nextInTime":17790,"topicId":17770,"numMessagesInTopic":0,"msgSnippet":"They, or any other hospice, might be a good resource for finding a grief counseling/support group. That was what I would suggest also. I did Hopsice grief","messageBody":"<div id=\"ygrps-yiv-1895146547\">They,<br/>\n or any other hospice, might be a good resource for finding a grief<br/>\n counseling/support group. <br/>\n<br/>\nThat was what I would suggest also. I did Hopsice grief support for a while, very rewarding work. If you can find a family support group that would be ideal. The one I was with gave the entire family an outlet, no matter what the ages. We had rooms with appropriate activities for all ages. Though the children did separate from the adults for a while so each group could talk in developmentally appropriate ways. Toddlers had a lot of dramatic play items available to help them express feelings, teens had a lot of opportunities to talk and connect with other hurting teens, the games and topics of discussion varied for different ages, but the entire family was in the same house and they could all come and go at the same time. I saw a lot of healing happen there.<br/>\nIt&#39;s hard to find support groups like that for some reason. There are often groups for kid OR adults, but none for the entire family at the same time. If you could find that it would be awesome.<br/>\n<br/>\nRen</div>","specialLinks":[]},{"userId":130289185,"authorName":"Alice","from":"Alice &lt;alijay@...&gt;","profile":"alijaywec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] grief help","postDate":"1073313458","msgId":17784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGRjk3NkIyLjUwMDA0MDBAZWMucnIuY29tPg==","referencesHeader":"PDIwMDQwMTA1MDQ0MTE1LjQ5OTgxLnFtYWlsQHdlYjIxNjA0Lm1haWwueWFob28uY29tPg=="},"prevInTopic":17783,"nextInTopic":17789,"prevInTime":17783,"nextInTime":17785,"topicId":17770,"numMessagesInTopic":0,"msgSnippet":"... Thanks. Found one, - the person to talk with wasn t there but will get back to me. Alice","messageBody":"<div id=\"ygrps-yiv-1282557604\"><blockquote><span title=\"ireply\">&gt; She had mentioned there&#39;s a great hospice outfit nearby. <br/>\n &gt; Often, you can find one in the yellow pages.<br/>\n<br/>\n </span></blockquote>Thanks. Found one, - the person to talk with wasn&#39;t there but will get back to me.<br/>\n<br/>\nAlice</div>","specialLinks":[]},{"userId":127921172,"authorName":"Sylvia Toyama","from":"Sylvia Toyama &lt;syltoyama@...&gt;","profile":"syltoyama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] grief help","postDate":"1073277675","msgId":17783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTA1MDQ0MTE1LjQ5OTgxLnFtYWlsQHdlYjIxNjA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDU3LjI2NjFmYWVlLjJkMmEwZjRmQGFvbC5jb20+"},"prevInTopic":17782,"nextInTopic":17784,"prevInTime":17782,"nextInTime":17784,"topicId":17770,"numMessagesInTopic":0,"msgSnippet":"I don t know where in NC you are -- my Mom is in Cornelius, near Mooresville on Lake Norman.  She had mentioned there s a great hospice outfit nearby.  They,","messageBody":"<div id=\"ygrps-yiv-978021366\">I don&#39;t know where in NC you are -- my Mom is in Cornelius, near Mooresville on Lake Norman.  She had mentioned there&#39;s a great hospice outfit nearby.  They, or any other hospice, might be a good resource for finding a grief counseling/support group.  When my grandmother died in &#39;97, the hospice was wonderful for my Mom and her sisters -- they give amazing support to families and survivors.  Often, you can find one in the yellow pages.  <br/>\n <br/>\nSylvia<br/>\n<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nFind out what made the Top Yahoo! Searches of 2003<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] grief help","postDate":"1073272729","msgId":17782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGRjhENzk5LjIwMzA3QGVhcnRobGluay5uZXQ+","referencesHeader":"PDNGRjgzNkZELjQwMDA0MDNAZWMucnIuY29tPg=="},"prevInTopic":17780,"nextInTopic":17783,"prevInTime":17781,"nextInTime":17783,"topicId":17770,"numMessagesInTopic":0,"msgSnippet":"**So here it is 16 months later and he brings home another woman. Both the kids completely lose it. They ripped into him, screaming, yelling, crying, saying","messageBody":"<div id=\"ygrps-yiv-422799954\">**So here it is 16 months later and<br/>\nhe brings home another woman. Both the kids completely lose it. They <br/>\nripped into him, screaming,<br/>\nyelling, crying, saying extremely vicious things**<br/>\n<br/>\nWell, except for the murderous accusations, I think it&#39;s a perfectly <br/>\nnormal way to feel.  The dad in this family needs to be able to <br/>\nunderstand the kids&#39; feelings, not try to argue them out of having those <br/>\nfeelings just so he can feel better.  He should not try to make them <br/>\nfeel wrong about the way they feel.<br/>\n<br/>\nMy uncle is 80 and his wife died a little more than a year ago.  When he <br/>\ngot remarried, not all of his kids were cheerful about it.  And I&#39;m <br/>\ntalking &quot;kids&quot; that are in their 50s.  The hurtful wedge here is that <br/>\nwhile a man can find a new life partner, the &quot;children&quot; can&#39;t go out and <br/>\nget a new mother.  So it&#39;s not surprising that they find another woman <br/>\nin their mother&#39;s &quot;place&quot; to be distressing.<br/>\n<br/>\nIf I die before my husband, I have told him that I don&#39;t want him to <br/>\nlive alone, forever.  (That doesn&#39;t mean I&#39;d &quot;approve&quot; if he started to <br/>\ndate immediately!)  But, since I don&#39;t always get along with my <br/>\nstepmother, I&#39;ve cautioned him about remarrying before my son is 18. <br/>\n(I&#39;m thinking if I&#39;m dead he can have sex with other women, but can&#39;t <br/>\nmake any of them the &quot;boss&quot; of my son.)<br/>\n<br/>\nLooping back to the beginning, a man who hides his grief from his <br/>\nchildren messes everything up.  He looks heartless to them and he sets a <br/>\nbad example to them on how to handle grief.  This may or may not have <br/>\nhappened with your friends, but it&#39;s pretty typical given the way many <br/>\nmen in our culture think they are supposed to handle their feelings.<br/>\n<br/>\nMy two cents,<br/>\nBetsy<br/>\n<br/>\nPS  I think counseling is good.  Perhaps the dad should go for awhile <br/>\nand work through his issues (even if he doesn&#39;t admit he has any) before <br/>\nbringing in the kids.</div>","specialLinks":[]},{"userId":56051484,"authorName":"grlynbl@aol.com","from":"grlynbl@...","profile":"tbb1967","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] grief help","postDate":"1073263951","msgId":17780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3LjI2NjFmYWVlLjJkMmEwZjRmQGFvbC5jb20+"},"prevInTopic":17779,"nextInTopic":17782,"prevInTime":17779,"nextInTime":17781,"topicId":17770,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/4/2004 7:38:45 PM Eastern Standard Time, alijay@ec.rr.com writes: Excellent idea. Though we live in the middle coastal region of NC and","messageBody":"<div id=\"ygrps-yiv-1831173521\">In a message dated 1/4/2004 7:38:45 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alijay@...\">alijay@...</a> writes:<br/>\nExcellent idea. Though we live in the middle coastal region of NC and the <br/>\nnearest largest town would <br/>\nbe almost an hour away with a pop of a bit over 20,000.  <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I&#39;m trying to think exactly where that is, what town?  My sil&#39;s family lives <br/>\nin Farmville.  I live in NC too,  in the western piedmont, near Hickory.<br/>\n<br/>\nTeresa<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":130289185,"authorName":"Alice","from":"Alice &lt;alijay@...&gt;","profile":"alijaywec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] grief help","postDate":"1073263010","msgId":17779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGRjhCMUEyLjgwMTA2MDBAZWMucnIuY29tPg==","referencesHeader":"PDg5LmE0ODRjYS4yZDI5YjA1M0Bhb2wuY29tPg=="},"prevInTopic":17771,"nextInTopic":17780,"prevInTime":17778,"nextInTime":17780,"topicId":17770,"numMessagesInTopic":0,"msgSnippet":"... Excellent idea. Though we live in the middle coastal region of NC and the nearest largest town would be almost an hour away with a pop of a bit over","messageBody":"<div id=\"ygrps-yiv-937803897\"><blockquote><span title=\"ireply\">&gt; If you&#39;re in a fair-sized city or university town, maybe you yourself could<br/>\n&gt; make a couple of calls and see if there are meetings of grief counselling<br/>\n&gt; organizations they could attend.  And while you&#39;re calling, you could ask if there<br/>\n&gt; is a good gried counsellor for kids.  Then it would be a gift for all of them<br/>\n&gt; if you would write all that up with the phone numbers, names and addresses and<br/>\n&gt; give it to the dad so he doesn&#39;t have to do the same footwork.<br/>\n<br/>\n </span></blockquote>Excellent idea. Though we live in the middle coastal region of NC and the nearest largest town would <br/>\nbe almost an hour away with a pop of a bit over 20,000. But I do recall seeing meetings of such <br/>\ntypes advertised in the paper. The next problem being finding one that won&#39;t be preachy. &quot;look to <br/>\ngod to heal your sorrows - god will show the way&quot;  He&#39;s atheist. :-/  (and I&#39;m pretty sure the kids <br/>\nwould be of an agnostic bent) But I&#39;m definitely going to look into it.<br/>\n<br/>\nthanks<br/>\nAlice</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] grief help","postDate":"1073239635","msgId":17771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5LmE0ODRjYS4yZDI5YjA1M0Bhb2wuY29tPg=="},"prevInTopic":17770,"nextInTopic":17779,"prevInTime":17770,"nextInTime":17772,"topicId":17770,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/4/04 8:55:29 AM, alijay@ec.rr.com writes: ","messageBody":"<div id=\"ygrps-yiv-1692553916\">In a message dated 1/4/04 8:55:29 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:alijay@...\">alijay@...</a> writes:<br/>\n<br/>\n&lt;&lt; now the kids go to school. (and, as an aside, have developed an extreme <br/>\ndislike toward <br/>\nhomeschoolers) &gt;&gt;<br/>\n<br/>\nI would guess that would be frustration at not being able to homeschool <br/>\nanymore or to be with their mom anymore while other kids are getting to be with <br/>\ntheirs, coated with all the justifications their other relatives have made to <br/>\nhelp them accept going to school.<br/>\n<br/>\nAnd a sad side-effect will be that the relatives may have unwittingly <br/>\nsuggested that their mom was wrong to be homeschooling them, so it could be harder <br/>\nfor them to process their feelings if friends and neighbors are by their <br/>\nschool-praise saying, &quot;Your mom was a misguided person wasting your life, but it will <br/>\nbe better now that you&#39;re in school.&quot;<br/>\n<br/>\nI&#39;ve seen a couple of divorce situations where the kids ended up going to <br/>\nschool, and if they rejected homeschooling they also ended up blaming the <br/>\nhomeschooling parent for all school-related woes.<br/>\n<br/>\n-=-They ripped into him, screaming, <br/>\nyelling, crying, saying extremely vicious things &quot;you killed our mother just <br/>\nso you could see other <br/>\nwoman!&quot; !!! -=-<br/>\n<br/>\nThat happens.  When I was younger, my sympathies would have lain with the <br/>\ndad, but now that I&#39;m older, I feel for the kids.<br/>\n<br/>\n-=-Does anyone <br/>\nhave any suggestions on how to help? He&#39;s thinking about counseling. -=-<br/>\n<br/>\nIf you&#39;re in a fair-sized city or university town, maybe you yourself could <br/>\nmake a couple of calls and see if there are meetings of grief counselling <br/>\norganizations they could attend.  And while you&#39;re calling, you could ask if there <br/>\nis a good gried counsellor for kids.  Then it would be a gift for all of them <br/>\nif you would write all that up with the phone numbers, names and addresses and <br/>\ngive it to the dad so he doesn&#39;t have to do the same footwork.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":130289185,"authorName":"Alice","from":"Alice &lt;alijay@...&gt;","profile":"alijaywec","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"grief help","postDate":"1073231613","msgId":17770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGRjgzNkZELjQwMDA0MDNAZWMucnIuY29tPg=="},"prevInTopic":0,"nextInTopic":17771,"prevInTime":17769,"nextInTime":17771,"topicId":17770,"numMessagesInTopic":0,"msgSnippet":"Hi folks, I don t post much to this list (or any other for that matter). I m usually so behind in emails that whatever I want to say, someone has already said","messageBody":"<div id=\"ygrps-yiv-900534634\">Hi folks,<br/>\n<br/>\nI don&#39;t post much to this list (or any other for that matter). I&#39;m usually so behind in emails that <br/>\nwhatever I want to say, someone has already said (and usually said it in a more concise way). But <br/>\nI&#39;ve heard that before, so it sort of helps to know that I&#39;m not the only one.  But I do feel sort <br/>\nof weird coming here for advice when only a couple of you actually even know me.<br/>\n<br/>\nAnyway, this is a list that has the most wisest folks I&#39;ve ever run across, so I can&#39;t _not_ ask for <br/>\nadvice when I need it.<br/>\n<br/>\nI&#39;ve spoken in the past about friends of ours - a family who used to homeschool, the mom died in <br/>\nsept 2002, now the kids go to school. (and, as an aside, have developed an extreme dislike toward <br/>\nhomeschoolers) A year ago, the dad was saying how well the kids were doing handling their grief, <br/>\neven to say that it didn&#39;t seem like they were even grieving at all. My dh and I both just sort of <br/>\nthought, &quot;ok, but watch out&quot;. We didn&#39;t want to say anything. We didn&#39;t really know them very well <br/>\nand they really did seem like very smart and well adjusted kids. So here it is 16 months later and <br/>\nhe brings home another woman. Both the kids completely lose it. They ripped into him, screaming, <br/>\nyelling, crying, saying extremely vicious things &quot;you killed our mother just so you could see other <br/>\nwoman!&quot; !!! Anyway, I&#39;ve no idea how I can help. His kids don&#39;t even like mine anymore. Does anyone <br/>\nhave any suggestions on how to help? He&#39;s thinking about counseling. (He knows he has to do <br/>\nsomething) Are there any good books that he can read to help his kids through this. Maybe a <br/>\nrecommended email list?  They are 12yog(going on 17) and 10yob.   He feels so bad and is at a total <br/>\nloss for what to do. It sounded like it was a really bad, long, drawn out explosion of anger and <br/>\nhatred. Apparently it all was quite a surprise, too.  Any help would be much appreciated.<br/>\n<br/>\nThanks everyone<br/>\nAlice</div>","specialLinks":[]}],"prevTopicId":6499,"nextTopicId":17793}}