{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"brendaclaspell@aol.com","from":"brendaclaspell@...","profile":"brendaclaspell","replyTo":"LIST","senderId":"puwzAAGRC6ytDBZk52PKPhpYUvc3yjAVAZyRSZwVmKX2n2Gj54qgBfPOTUsIjJSgnZ_JgDFTlQ5x5TxxRw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"TV at our house....Long","postDate":"1005616447","msgId":27630,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGFiLjEyMjk2NWQ4LjI5MjFkNzNmQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":27629,"nextInTime":27631,"topicId":27630,"numMessagesInTopic":0,"msgSnippet":"I just thought I d share what  we do here. I m a single mom with a 3yo son and I don t have to work. So I may have quite a bit more flexibility for ","messageBody":"<div id=\"ygrps-yiv-228917412\">I just thought I&#39;d share what  we do here. I&#39;m a single mom with a 3yo son <br/>\nand I don&#39;t have to work. So I may have quite a bit more flexibility for <br/>\nexperimentation than some others on here, but here&#39;s what I&#39;ve been trying.<br/>\n<br/>\nLately he&#39;s been watching a lot of tv again and I got weird about it again, <br/>\nbut rather than make hasty changes or try to revoke the complete freedom I <br/>\nallowed &lt;g&gt; him, I read on the unschooling.com boards and looked at our <br/>\nsituation a bit more creatively.<br/>\n<br/>\nI&#39;ve moved the child size play table from the dining room near all the craft <br/>\nstuff into the living room in front of the tv. We were doing everything in <br/>\nthere anyway, it just made it more comfortable and acceptable in some way. <br/>\nLuckily one of the chairs is missing the arms so my wonderfully womanly butt <br/>\nfits there.:-) I don&#39;t limit tv at all: content, time, duration, etc. I have <br/>\nbeen watching with him more than I used to. (Sometimes this is a real problem <br/>\nfor me. I don&#39;t enjoy watching things more than once or twice at most. And he <br/>\nlikes seeing things repeatedly. I always try to sit attentive through the <br/>\nfirst viewing, but sometimes on the second, third and so on I have something <br/>\nto do that comes second if he needs me.) He asks me a lot of questions now <br/>\nabout nearly everything on tv. The material things he&#39;s never seen before, <br/>\nthe personal interactions/dynamics/emotions between characters, the slang <br/>\nterms/figures of speech, the new words, the different locations, different <br/>\noccupations, etc. There have been times when he&#39;s asked me to turn things he <br/>\nwanted to watch off because they upset him (scare, sadden, etc). <br/>\n<br/>\nI cringe when I see him light up at the toys and stuff that are advertised, <br/>\nbut I try to be honest and open with anything he brings up (or will let me <br/>\nbring up!) I have learned a lot about advertising from living and research. <br/>\nIf and when I can I will share all that I know with him; but even at 3, I can <br/>\ntell that he can see beyond some of it. I&#39;m leaning towards helping him be <br/>\nmore informed and equipped rather than shielded and protected. And of course, <br/>\nalways being there for shielding and protecting when it&#39;s needed/asked for.<br/>\n<br/>\nI bring the food in there, I bring crafts in there, sometimes he joins in and <br/>\nsometimes he doesn&#39;t. When I&#39;m really buggin out about it, I make sure that <br/>\nI&#39;m giving him plenty of opportunities to do cool stuff in and out of the <br/>\nhouse. And if he still wants to watch tv, then he&#39;s deciding from a variety <br/>\nof options and I know it&#39;s what he wants/needs.<br/>\n<br/>\nAs someone suggested on one of the message boards, I try to make sure there <br/>\nis plenty of time and props to recreate play from the stuff he watches. Like <br/>\ntoys from ads that I say, &quot;we could try to make that if you&#39;d like&quot; sometimes <br/>\nyes, sometimes no. And on the intro to one of the movies we rented he saw an <br/>\nad for &#39;Cats&#39; and now we&#39;re going to try to make a cat costume. And a lot of <br/>\nthe stuff just naturally works into the free play around the house with toys <br/>\nand props and stuff. He can recreate what he sees, adjust it, change it, <br/>\nintensify it......play around with a new concept in his own creative way. <br/>\n<br/>\nTv is stimulating lots of interests and conversation and learning. And <br/>\nsometimes I still think, &quot;Geez, he&#39;s like a zombie! I&#39;m an awful mom, what <br/>\nwould people say?&quot; But I&#39;m trying to separate my need to fit in from my <br/>\ndesire to parent the best way I can. And also reading all the technical, <br/>\nintelligent articles on here about how great tv watching is really helps me.<br/>\n<br/>\nSo....ramble ramble ramble....that&#39;s what we&#39;re doing now. Writing this has <br/>\nbeen great for me, lol, I think we&#39;re doing better than I thought we were!<br/>\n<br/>\nBrenda<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":27618,"nextTopicId":27605}}