{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":87403280,"authorName":"Jeff & Kate Kerr","from":"Jeff & Kate Kerr &lt;windystreet@...&gt;","profile":"saffronwoman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Digest Number 2247 - 19 year old","postDate":"1029476411","msgId":41247,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENUM5MDM5LkU2NTQ0NzdAZWFydGhsaW5rLm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":41246,"nextInTime":41248,"topicId":41247,"numMessagesInTopic":0,"msgSnippet":"So... I have filled out the papers to start unschooling my youngest who is 11. My 19 year old is having a hard time with it. Basically he said suffering the","messageBody":"<div id=\"ygrps-yiv-1811388211\">So... I have filled out the papers to start unschooling my youngest who<br/>\nis 11. My 19 year old is having a hard time with it. Basically he said<br/>\nsuffering the trauma of school has helped him grow.<br/>\nMichele<br/>\n<br/>\nI feel I need to talk to the 19 year old&#39;s feelings right now.  I went<br/>\nto school, suffered for it, hated it, spent most of my time ditching and<br/>\nin the darkroom.  Then went to art school, hated it dropped out, went<br/>\nback, dropped out again.  Then to barber college, hated it, stopped for<br/>\na while to get ready for a photography show in Europe (ringing my own<br/>\nbell here), did the show and went back and got my barber&#39;s license.<br/>\nWorked for a while, moved to San Francisco, worked for a while, decided<br/>\nthat I was ready for &quot;real&quot; college, moved again and started college.  I<br/>\ndidn&#39;t do that well initially in college and it took me forever to<br/>\ntransfer from a junior college to a university.  I finally did transfer<br/>\nto one in Northern CA.  Loved it there, loved my core classes.  Finally<br/>\nfinished with my degree in Anthropology.<br/>\nThen I moved to Albuquerque for a year.  I holed up for that year.  I<br/>\ndidn&#39;t work, I watched tv, rode my bike, ran, read, and in general<br/>\nde-schooled myself.  It&#39;s taken me 8 years to learn that that&#39;s what I<br/>\nspent that year off doing: repairing my school damaged self.  I come<br/>\nfrom an academically overachieving family - many PhD&#39;s, many teachers,<br/>\nmany physicians, etc...  I&#39;m the only one with &quot;just&quot; a BA.  They never<br/>\nunderstood what I was doing, only my mother got it (she&#39;s our staunchest<br/>\nsupporter for unschooling).<br/>\nThe point is, maybe he needs some time even at this age to repair his<br/>\nschool damaged self.  I was 27 when I finally got it and stopped<br/>\nschooling.  It&#39;s important to do at any age.  My mom provided me with a<br/>\nsafe space to be in while I de-schooled, perhaps you could do the same<br/>\nfor your son, he sounds like he needs it.<br/>\nSorry to sound preachy (I get accused of that occasionally) but this is<br/>\na subject close to my heart.  The time I spent deschooling transformed<br/>\nme.  Isn&#39;t that lucky for my children!<br/>\nKate<br/>\n&quot;To be nobody but yourself in a world which is doing it&#39;s best night and<br/>\nday to make you like everybody else means to fight the hardest battle<br/>\namy human being can fight and never stop fighting.&quot;  e.e. cummings</div>","specialLinks":[]}],"prevTopicId":41246,"nextTopicId":41125}}