{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":194790463,"authorName":"diana jenner","from":"diana jenner &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: How unschooling works---","postDate":"1110922189","msgId":104527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyMzc1M0NELjQwNTAyMDZAc2lvLm1pZGNvLm5ldD4=","inReplyToHeader":"PEJBWTUtREFWMTUwQjExMTlBRDc1QTFFMzI1ODFBMkYxNTUwQHBoeC5nYmw+","referencesHeader":"PGRmLmYyZGMzYjcuMmY2NWE1ZDhAYW9sLmNvbT4gPEJBWTUtREFWMTUwQjExMTlBRDc1QTFFMzI1ODFBMkYxNTUwQHBoeC5nYmw+"},"prevInTopic":104452,"nextInTopic":0,"prevInTime":104526,"nextInTime":104528,"topicId":104437,"numMessagesInTopic":0,"msgSnippet":"... My fears are generally about ME and my own abilities... I imagine these fears and the fuel they provide for me to overcome them is exactly the reason I","messageBody":"<div id=\"ygrps-yiv-1399530040\">Jennifer Fischetto wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I have been skeptical as to whether or not *I* can unschool. <br/>\n&gt;<br/>\n </span></blockquote>My fears are generally about ME and my own abilities... I imagine these <br/>\nfears and the fuel they provide for me to overcome them is exactly the <br/>\nreason I *can* unschool.  Deschooling is a far longer process than <br/>\nunschooling -- not for the kids, but for the parents: we&#39;ve got far more <br/>\nschool-think to overcome, to avoid passing down to the next generation. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Specifically <br/>\n&gt;because of severely limited funds (hopefully not for to long) and using the <br/>\n&gt;public transit system....more so the money. When I first started researching <br/>\n&gt;about homeschooling I continually read about families and their exciting <br/>\n&gt;adventures...day trips, vacations, etc. It led me to believe that these type <br/>\n&gt;of outings were the gist of homeschooling. I hope that is not correct. I <br/>\n&gt;have recently read about typical days of unschooling on Sandra&#39;s site and <br/>\n&gt;they have given me a sense of calm.<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>We live on a meager budget and still find funds for the priorities.  I <br/>\ngot a zoo membership and children&#39;s museum membership for my birthday -- <br/>\nI did the leg work to find reciprocal memberships for FAR less than our <br/>\nlocal fees (got both for less than one), filled out the paperwork and <br/>\nhanded them over to the first person to ask what I wanted &lt;bg&gt;  The kids <br/>\nare in an art class because I asked for a scholarship, Hannah will use <br/>\nyet another scholarship to play basketball this summer.  Our homeschool <br/>\ngroup has a membership card with great discounts around town, including <br/>\n$2/game bowling w/free shoe rental and 10% off at our favorite art <br/>\nsupply store.  Never underestimate the value of the free, already doing <br/>\nit anyway-type of adventures awaiting you, like the grocery store, the <br/>\nbank, the cool downtown stores you&#39;ve yet to visit. &lt;bg&gt;  We do eat lots <br/>\nof peanut butter sandwiches on our vacations; seeing the ocean, the <br/>\nGrammas, a hotel full of unschoolers -- all worth the sacrifice it takes <br/>\nto get there :) <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I am still not confident yet but hopeful and will continue to look within <br/>\n&gt;myself, question my &quot;capabilities&quot; and willingness and &quot;review&quot; our life for <br/>\n&gt;signs of richness (being a bit silly there). A &quot;how to&quot; list was exactly <br/>\n&gt;what I would love. As to *why*....well why not? It makes perfect sense to <br/>\n&gt;this newbie. :)<br/>\n&gt;  <br/>\n&gt;<br/>\n </span></blockquote>There were times when I, too, would have loved a checklist of some <br/>\nsort... but that would be just one more thing to feel pressured about <br/>\n&quot;am I doing unschooing the prescribed way?&quot; syndrome :)  The glory of <br/>\nunschooling is the absence of &quot;how-to s&quot; and &quot;have-to s&quot; and the <br/>\nembracing of the &quot;why nots,&quot; saying YES to what brings joy to our own <br/>\nindividual peoples and ourselves by providing it :)  Confidence and <br/>\nsuccess are measured very differently over here &lt;g&gt; and you&#39;ll find both <br/>\nin the most unusual, uncommon places - JOY being the benchmark :)  where <br/>\nelse will you find that kind of reinforcement??? <br/>\n<br/>\nI hope this helps quell a few fears!  Welcome to the adventure :) diana<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":137593245,"authorName":"Jennifer Fischetto","from":"&quot;Jennifer Fischetto&quot; &lt;jenn58125@...&gt;","profile":"jenn58125","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Re: How unschooling works---","postDate":"1110742306","msgId":104452,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTUtREFWMTUwQjExMTlBRDc1QTFFMzI1ODFBMkYxNTUwQHBoeC5nYmw+","referencesHeader":"PGRmLmYyZGMzYjcuMmY2NWE1ZDhAYW9sLmNvbT4="},"prevInTopic":104437,"nextInTopic":104527,"prevInTime":104451,"nextInTime":104453,"topicId":104437,"numMessagesInTopic":0,"msgSnippet":"... Hi, I am new to this group and have been reading for a couple of weeks. After this post I will probably go back to lurking for some time. :) When I signed","messageBody":"<div id=\"ygrps-yiv-575462605\"><blockquote><span title=\"ireply\">&gt; Lately some of the feedback from people who&#39;ve left the list as been that <br/>\n&gt; they wanted<br/>\n&gt; a &#39;how to,&#39; and more directly useful information to get started, but we <br/>\n&gt; were<br/>\n&gt; just talking about why.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Hi, I am new to this group and have been reading for a couple of weeks. <br/>\nAfter this post I will probably go back to lurking for some time. :)<br/>\nWhen I signed on and began reading I came in the middle of posts that had <br/>\nbeen continuing for a bit and may have misunderstood their premise. As a <br/>\nnewbie to the list AND to homeschooling and unschooling, I was perplexed by <br/>\nwhat sounded like some bashing of parents. I have been wondering if I should <br/>\neven remain a member but thought to stick it out longer to get a better <br/>\nfeel.<br/>\n<br/>\nThe comments, from this latest response by Sandra, have helped me realize <br/>\nthat I am still somewhat clueless, lol, but starting to understand why some <br/>\nof the posts have sounded harsh. I am a single mother of two (daughter is 10 <br/>\nand son is 3). I just withdrew my daughter from school two weeks ago and we <br/>\nare trying to &quot;gain our footing&quot;. I am not skeptical of the *why*. It makes <br/>\nperfect sense that a child (anyone) can learn better when they are <br/>\ninterested than forced. I remember leaving the PS system believing I was <br/>\nstupid and then 10 years later I was/am soaking up as much information as I <br/>\ncan, about various topics.<br/>\n<br/>\nCertain areas of our lives have always been &quot;unschooled&quot;...no limits to TV, <br/>\nthe computer, movies, computer games, playing in general. Recently I began a <br/>\nprocess called Overcoming Overeating (I have an eating disorder) and learned <br/>\nabout eating what I want, when I want and how much I want. Never to diet <br/>\nagain, as diets do not work. This is something my children do now too. The <br/>\nrest of our lives have been pretty structured though. There has been a lot <br/>\nof yelling, threatening and power struggles. I have stopped the threatening <br/>\nand working on the yelling (still happens occasionally as I learn to stop), <br/>\ntherefore the power struggles are pretty non inexistent. Suffice, this is <br/>\nall to say that I don&#39;t come to unschooling having practiced it all our <br/>\nlives.<br/>\n<br/>\nI have been skeptical as to whether or not *I* can unschool. Specifically <br/>\nbecause of severely limited funds (hopefully not for to long) and using the <br/>\npublic transit system....more so the money. When I first started researching <br/>\nabout homeschooling I continually read about families and their exciting <br/>\nadventures...day trips, vacations, etc. It led me to believe that these type <br/>\nof outings were the gist of homeschooling. I hope that is not correct. I <br/>\nhave recently read about typical days of unschooling on Sandra&#39;s site and <br/>\nthey have given me a sense of calm.<br/>\n<br/>\nI am still not confident yet but hopeful and will continue to look within <br/>\nmyself, question my &quot;capabilities&quot; and willingness and &quot;review&quot; our life for <br/>\nsigns of richness (being a bit silly there). A &quot;how to&quot; list was exactly <br/>\nwhat I would love. As to *why*....well why not? It makes perfect sense to <br/>\nthis newbie. :)<br/>\nNow I will return to my lurking mode. Thanks for listening.<br/>\nJenn</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: How unschooling works---","postDate":"1110723544","msgId":104437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRmLmYyZGMzYjcuMmY2NWE1ZDhAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":104452,"prevInTime":104436,"nextInTime":104438,"topicId":104437,"numMessagesInTopic":0,"msgSnippet":"I wrote: -=-There are  other things too; other elements need to be in place to be made to make it work really well.-=- Nichole wrote (well, and it s probably","messageBody":"<div id=\"ygrps-yiv-980939175\">I wrote: <br/>\n-=-There are  other <br/>\n  things too; other elements need to be in place to be made to make it work  <br/>\n  really well.-=-<br/>\n<br/>\nNichole wrote (well, and it&#39;s probably enough, too!):<br/>\n<br/>\n-=-  In a nut-shell or elaborately what are those elements?  <br/>\n<br/>\n-=-   * trusting your child to learn what she needs when she needs it<br/>\n<br/>\n -=-  * ability and desire to show your children the world through living a <br/>\nrich and interesting life<br/>\n<br/>\n-=-   * a deep respect for your child as an individual, regarding her as a <br/>\nwhole human being right now<br/>\n<br/>\n-=-   * ability and desire to learn every day, to try new things, and go new <br/>\nplaces, meet new people<br/>\n<br/>\n -=-  What else?  I bet you have a post or two on this, Sandra.<br/>\n<br/>\n -=-  Thanks,<br/>\n<br/>\n -=-  Nichole<br/>\n<br/>\n-----------------------------------------------------<br/>\n<br/>\nThat&#39;s a good list.  Many years ago I wanted to do a kind of <br/>\nquestionnaire/checklist/aptitude test so people could come to it in a self-service way and see <br/>\nif they were suited to unschooling.  When I brought it up, people (even peole <br/>\nwho really liked me, and maybe especially those) said &quot;Don&#39;t!&quot;     Their <br/>\nthinking was to help everyone on the assumption they all had the potential to be <br/>\nunschoolers.  <br/>\n<br/>\nSometimes I think they&#39;re right, and sometimes I don&#39;t think so.  <br/>\n<br/>\nIf we were offering chat and resources about owning small yachts, might we <br/>\nnot eliminate some people up front by asking if they lived anywhere near an <br/>\nocean, how they were with motion sickness, whether they could swim, how was their <br/>\nspatial reasoning, and did they have millions of dollars.   LOTS of people own <br/>\nsmall yachts.  It&#39;s not an impossible goal/hobby/pursuit.  It takes a lot of <br/>\ntime to make it worth it.  Jackie Kennedy needed to actually want to go <br/>\nsailing with her family, and to plan, organize it and get it together on the morning <br/>\nof the trip.  Maybe they had others to clean up afterwards, but there were <br/>\nstill sunburns and other booboos to deal with when they got home.  The Kennedies <br/>\nknew others who could advise them on what to buy and where to dock it and all <br/>\nthat.  <br/>\n<br/>\nIs unschooling at least as involved as yacht ownership?  It can be a heck of <br/>\na lot cheaper, but it takes way more time and has a greater demand of self <br/>\nreflection and relationship building.  <br/>\n<br/>\nMaybe it would have been better to make it a secret back room instead of all <br/>\nupfront where we get criticized and misunderstood.  Maybe it should have only <br/>\nbeen for people who got almost there on their own, and then asked for the last <br/>\nsecret info.  Probably not, but the level of skepticism and insult and <br/>\nnonsense does get old sometimes.   The reason it&#39;s not flaring up so much on this <br/>\nlist anymore is that we keep new members on moderation until it seems they are <br/>\nsincere and calm and non-reactionary.  We&#39;ve elminated the &quot;what kind of <br/>\nneglectful insanity are you promoting?&quot; fringe.  Sometimes, maybe, that makes the <br/>\nlist too bland.   And just as with real life, some people like football and some <br/>\npeople like ice dance.  So either way, some readers wish the list were some <br/>\n*other* level of excitement or depth or spirituality or practicality.   Lately <br/>\nsome of the feedback from people who&#39;ve left the list as been that they wanted <br/>\na &#39;how to,&#39; and more directly useful information to get started, but we were <br/>\njust talking about why.  <br/>\n<br/>\n&quot;Why&quot; is pretty big.<br/>\n<br/>\nMaybe add that to the list, although at first it seems useless:<br/>\n<br/>\n-=-  * ability and desire to figure out WHY unschooling is important and can <br/>\nwork<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":104526,"nextTopicId":104531}}