{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Sarah","from":"Sarah &lt;sld29@...&gt;","replyTo":"LIST","senderId":"k_Q0v1r7_3vFzGq2TPpcabHsJL579vSs9dheXkb4-RFO4qwDMZG5JniQ1sgt7JGa7hpPK9rCFIZJLyPfPZi4","spamInfo":{"isSpam":false,"reason":"0"},"subject":"starting school (Nicki)","postDate":"989964052","msgId":21297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNCMDFBNzE0LjVFQ0I1OTI0QGNjLnVzdS5lZHU+","referencesHeader":"PDQwLmI4MDA2M2EuMjgzMWIzODhAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":21296,"nextInTime":21298,"topicId":21297,"numMessagesInTopic":0,"msgSnippet":"Hi Nicki, I ve been thinking about this post a lot today.  You re in Ketchum, right?  I went to elementary school at Hemingway.  It was a fair experience","messageBody":"<div id=\"ygrps-yiv-736388093\">Hi Nicki,<br/>\n<br/>\nI&#39;ve been thinking about this post a lot today.  You&#39;re in Ketchum,<br/>\nright?  I went to elementary school at Hemingway.  It was a fair<br/>\nexperience (email me off-list for specifics, if you want).  I have<br/>\ncousins that go to The Community School, and they like it, for the most<br/>\npart.  In fact, I will be in Ketchum this weekend for a baby shower.<br/>\n<br/>\nI do not think it is coercive to tell your child everything you know<br/>\nabout kindergarten.  This includes the good.  Does she know she has to<br/>\nget permission to go the bathroom, for example?  Does she know that she<br/>\ncannot eat whenever she wants, that she will have to sit in one place<br/>\nfor a good portion of the day, that time with friends is very limited?<br/>\nDoes she know that there are plenty of opportunities to interact with<br/>\nother children outside of school in classes, playdates, the park, etc.<br/>\nIf she knows all of these things, and she still wants to go to school,<br/>\nmaybe she&#39;d like you to schedule a time when the two of you could<br/>\nobserve the kindergarten classes in the area.  Maybe she needs to see it<br/>\nfor herself.  If she loves it, you can do lots of things to help her<br/>\nhave the best possible experience.  You can see how many days a week you<br/>\ncould volunteer in her class, join the PTA, send really great snacks,<br/>\nget to know the children she likes so she has plenty of opportunities<br/>\noutside of school to interact with them, etc.  Let her know that she is<br/>\nwelcome to come home whenever she wants.<br/>\n<br/>\nUtah allows homeschooled children access to public school activities and<br/>\ncertain classes, does Idaho?  If so, maybe she would like to go to<br/>\nKindergarten only on art days. Or assembly days.  Or PE days.<br/>\n<br/>\nTalk to her teacher and make sure she will have access to a telephone to<br/>\ncall you if and whenever she wants.<br/>\n<br/>\nSarah<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sld29@...\">sld29@...</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;    Marianne,<br/>\n&gt;<br/>\n&gt;       How old is your dd? My 5 this wed. dd is now voicing that she<br/>\n&gt; wants to<br/>\n&gt; go to school. I am so bummed. I am having nightmares. I always said if<br/>\n&gt; my<br/>\n&gt; child wanted to go I would let s/he. I decided when I was very young I<br/>\n&gt; would<br/>\n&gt; school through life,I had no idea there was even such a thing as<br/>\n&gt; unschooling,honestly. School was so bad for me I knew what would be<br/>\n&gt; right.<br/>\n&gt; Now what? I could cry thinking of it. I am afraid if she does attend<br/>\n&gt; she&#39;ll<br/>\n&gt; come out a different child. Or what if K is fun and she decideds to<br/>\n&gt; keep<br/>\n&gt; going and by say 8 wants out. Then I have 4 years to unravel.<br/>\n&gt;<br/>\n&gt;    This kid is so spirited and different I fear how it will go. She<br/>\n&gt; still<br/>\n&gt; pretends to be a dog 1/2 the day and we have to call her Jenna the dog<br/>\n&gt; and<br/>\n&gt; treat her as a dog. She still occaisionally makes dog faces at mean<br/>\n&gt; kids in<br/>\n&gt; the playground. She really isn&#39;t an extrovert though the way she is w/<br/>\n&gt; dh and<br/>\n&gt; I you&#39;d think she was. She clams up w/ other kids and adults. This is<br/>\n&gt; fine by<br/>\n&gt; us and we understand her personality. I can see the first time she<br/>\n&gt; gets told<br/>\n&gt; to not do something or corrected.she will be crushed. I am so<br/>\n&gt; concerned for<br/>\n&gt; her self esteem. School ruined me along w/ my mother&#39;s controling I<br/>\n&gt; became<br/>\n&gt; someone else to make it through.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;    I would love to go off on why she doesn&#39;t want to go but I feel<br/>\n&gt; that would<br/>\n&gt; be brainwashing or coersive. What to do?<br/>\n&gt;<br/>\n&gt;    Any advice? NICKI~ </span></blockquote></div>","specialLinks":[]}],"prevTopicId":21275,"nextTopicId":21299}}