{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":220655190,"authorName":"Janette","from":"Janette &lt;yamaguchi3@...&gt;","profile":"iguanagirl66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with family happiness","postDate":"1360966022","msgId":70569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzNDMzMEQ2LUExNDgtNDJCOS04QjQwLUNGRTVDNEE1OTdGMUB2ZXJpem9uLm5ldD4="},"prevInTopic":70529,"nextInTopic":0,"prevInTime":70568,"nextInTime":70570,"topicId":70514,"numMessagesInTopic":0,"msgSnippet":"Meredith wrote: It s entirely possible he d feel essentially the same way if your son was in school or if you were homeschooling rather than unschooling...","messageBody":"<div id=\"ygrps-yiv-818655934\">Meredith wrote: It&#39;s entirely possible he&#39;d feel essentially the same  <br/>\nway if your son was in school or if you were homeschooling rather than  <br/>\nunschooling... he&#39;s not so much worried about his son as worrying<br/>\n<br/>\nOh, wow, this seems spot on, Meredith.  Thank you for the observation.<br/>\n<br/>\nI know that when my husband was growing up, the message he received  <br/>\nfrom his family was that &quot;different&quot; was to be avoided; fitting in was  <br/>\nthe goal.  And while that seemed to be a common mindset of the era (he  <br/>\nwas born in 1956), he had the added distinction of being one of the  <br/>\nfew minority families, and the only one of his descent, Japanese, in a  <br/>\nvery Caucasian town.  He also had a brother who was severely impaired  <br/>\ndevelopmentally. The goal to fit in was never quite attainable, and in  <br/>\nsome ways he seems to still be striving for it.<br/>\n<br/>\nSo on top of having a not-yet-reading, poops-in-diapers, odd-syntax- <br/>\nusing son, this man who seems to want normality is being asked to  <br/>\nfollow a very unfamiliar path to learning and living..... poor guy!    <br/>\nI can see how this would push his status quo buttons.  Heck, it still  <br/>\ndoes that to me sometimes, and I tend to like &quot;different.&quot;<br/>\n<br/>\nMeredith wrote: So it would help to look at what sorts of things help  <br/>\nyour husband feel good in a general sense, rather than &quot;feel good  <br/>\nabout his son&quot; specifically. What sets him up to feel cared for,  <br/>\nsupported, appreciated? What can you do to &quot;fill his cup&quot; so he&#39;s more  <br/>\nlikely to look at his home and family through a positive lens?<br/>\n<br/>\nYes yes yes.  This will be the focus.  Thank you.<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with family happiness","postDate":"1360798227","msgId":70529,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmaDdtaisxYzBkQGVHcm91cHMuY29tPg=="},"prevInTopic":70527,"nextInTopic":70569,"prevInTime":70528,"nextInTime":70530,"topicId":70514,"numMessagesInTopic":0,"msgSnippet":"... It s entirely possible he d feel essentially the same way if your son was in school or if you were homeschooling rather than unschooling - that it s not so","messageBody":"<div id=\"ygrps-yiv-90993534\">&quot;Janette&quot;  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;When Stan<br/>\n&gt; looks at his son, I see how much he loves and adores him, and how good<br/>\n&gt; they are together. But when his worry sets in, when he feeling as<br/>\n&gt; though our son is behind (compared to schooled kids, and Tomás&#39;<br/>\n&gt; schooled cousin, in particular), he is then seeing Tomás wrong and<br/>\n&gt; lacking.<br/>\n<br/>\n </span></blockquote>It&#39;s entirely possible he&#39;d feel essentially the same way if your son was in school or if you were homeschooling rather than unschooling - that it&#39;s not so much about unschooling as it is a dad wanting his kid to be okay, and not seeing the signs he thinks goes along with &quot;my kid is okay&quot;. And to an extent, that may not be about his kid at all, but about himself - he&#39;s not so much worried about his son as worrying, and his son makes a good focus for that worry. I do that sometimes - if I&#39;m out of sorts I&#39;m likely to look at my life and my family through that uncomfortable lens and &quot;see&quot; my feelings projected onto the details of my life. (Something similar happens with the internet if I&#39;m in a crummy mood - if everyone online seems really bitchy, I&#39;m probably the one in a bitchy mood!).<br/>\n<br/>\nSo it would help to look at what sorts of things help your husband feel good in a general sense, rather than &quot;feel good about his son&quot; specifically. What sets him up to feel cared for, supported, appreciated? What can you do to &quot;fill his cup&quot; so he&#39;s more likely to look at his home and family through a positive lens? <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":220655190,"authorName":"Janette","from":"Janette &lt;yamaguchi3@...&gt;","profile":"iguanagirl66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Help with family happiness","postDate":"1360789548","msgId":70527,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQyM0VFNTIwLTk1MkItNDBCNi05MDgwLTNGOThEOUVBQzE2MUB2ZXJpem9uLm5ldD4="},"prevInTopic":70521,"nextInTopic":70529,"prevInTime":70526,"nextInTime":70528,"topicId":70514,"numMessagesInTopic":0,"msgSnippet":"Sandra wrote: How old is your son? He is 8.  And a quirky little guy.  He was diagnosed with apraxia of speech when he was 2+ and, reluctantly, we worked with","messageBody":"<div id=\"ygrps-yiv-1408736929\">Sandra wrote: How old is your son?<br/>\n<br/>\nHe is 8.  And a quirky little guy.  He was diagnosed with apraxia of  <br/>\nspeech when he was 2+ and, reluctantly, we worked with a speech  <br/>\ntherapist for a few months as prescribed by our Regional Center (we  <br/>\nare in the US, in California).  The therapist was sweet, enjoyed  <br/>\nTomás&#39; sense of humor, and wasn&#39;t terribly worried about his speech so  <br/>\nwe didn&#39;t pursue further intervention once our county-sponsored  <br/>\nsessions ended.  From what I observed, the therapy was not helping his  <br/>\nspeech, and he didn&#39;t like going.  It can still be difficult to  <br/>\nunderstand him at times, which frustrates him a bit, and his syntax is  <br/>\noften odd with certain phrases (&quot;What he said?&quot; for example), although  <br/>\nI hardly notice it any more as I&#39;m used to how he talks.<br/>\n<br/>\nHe&#39;s a sweet, compassionate kid.  Very cuddly, very determined.  He  <br/>\nworries about death, has come up with his own version of an afterlife  <br/>\nreincarnation, and often needs me to affirm the statement, &quot;We will  <br/>\nnever die.&quot;  (I view this like believing in Santa, that he seems to  <br/>\nreally need this belief right now...not sure if my thinking on this is  <br/>\nOK or helpful in the long run, but he was terribly disturbed by the  <br/>\nidea that someday we would die.  Thoughts?)  He can be quick to melt  <br/>\ndown if things aren&#39;t working out the way he wants, loves Minecraft  <br/>\nand the YouTube tutorials, and mostly wants to be at home this last  <br/>\nyear or so.  Last year we had annual passes to Disneyland, and often  <br/>\nhe would go on a ride or two and be ready to go home (Crazy, right?  A  <br/>\ngood example of how unlimited access does not make one want more of  <br/>\nsomething.)  We work to meet his needs, canceling or or postponing  <br/>\noutings depending on his mood.  Usually it is Stan who makes the call  <br/>\nto stay in when our son really wants to be at home.  Sometimes he is  <br/>\ncompletely sympathetic about it, other times resentful.  I tend to try  <br/>\nto smooth things over, and am not sure if that is helpful or wanted.<br/>\n<br/>\nI have Pam&#39;s book and her emails.  I have not shared either as Stan  <br/>\nasked me to not send him anything (I used to email bits and pieces to  <br/>\nhim that I thought he was find interesting).  I will see if he&#39;d be  <br/>\nopen to going through the emails together.<br/>\n<br/>\nAn outside voice seems like a good idea.  Thank you for the link.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with family happiness","postDate":"1360699103","msgId":70521,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzNjc0MzEzLTA1QTUtNDBDNC1BRTgxLUY5NTdGODk3MTM2QkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGtmYzRrbSsyaXFmQGVHcm91cHMuY29tPg==","referencesHeader":"PGtmYzRrbSsyaXFmQGVHcm91cHMuY29tPg=="},"prevInTopic":70515,"nextInTopic":70527,"prevInTime":70520,"nextInTime":70522,"topicId":70514,"numMessagesInTopic":0,"msgSnippet":"... Maybe make blog and put up pictures and write a bit. Seeing all the stuff that he s learning collected in a big chunk might be more helpful than a few","messageBody":"<div id=\"ygrps-yiv-1292602964\">On Feb 11, 2013, at 8:07 PM, Janette wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I shared with him<br/>\n&gt; the various things Tomás did in a day, let him know when he learned<br/>\n&gt; something or was excited about something new.<br/>\n<br/>\n<br/>\n </span></blockquote>Maybe make blog and put up pictures and write a bit. Seeing all the stuff that he&#39;s learning collected in a big chunk might be more helpful than a few things here and there.<br/>\n<br/>\nHis worry has built up over time so it may take some time to ease. Keep drawing him in.<br/>\n<br/>\nThere was a recent thread on Facebook about a mom worrying about a 10 yo. There might be something reassuring in the responses. Or it might make him worry more that he doesn&#39;t get to stop worrying! So better to read it first.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.facebook.com/groups/303347574750/permalink/10151314099509751/\">http://www.facebook.com/groups/303347574750/permalink/10151314099509751/</a><br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Help with family happiness","postDate":"1360634424","msgId":70515,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5MzJFRkQzLTM0QjQtNDhBOS04MDA4LUE0NjRFODJFQzE1QUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtmYzRrbSsyaXFmQGVHcm91cHMuY29tPg==","referencesHeader":"PGtmYzRrbSsyaXFmQGVHcm91cHMuY29tPg=="},"prevInTopic":70514,"nextInTopic":70521,"prevInTime":70514,"nextInTime":70516,"topicId":70514,"numMessagesInTopic":0,"msgSnippet":"-=- he s always been, and still is, 100% behind keeping Tomás out of school (his own school years were horrible), I thought we were in this together. But I","messageBody":"<div id=\"ygrps-yiv-1862598290\">-=- he&#39;s always been, and still is, 100%<br/>\nbehind keeping Tomás out of school (his own school years were<br/>\nhorrible), I thought we were in this together. But I was wrong.-=-<br/>\n<br/>\nHow old is your son?<br/>\n<br/>\nIf you don&#39;t have Pam Laricchia&#39;s book that would help.<br/>\nIf you haven&#39;t gone through her e-mail intro, that would help.  If you and your partner do that together, that would help.  Finding other unschooling families to meet might help.<br/>\n<br/>\n_+_ he&#39;s always been, and still is, 100%<br/>\nbehind keeping Tomás out of school (his own school years were<br/>\nhorrible), I thought we were in this together. But I was wrong.-=-<br/>\n<br/>\nWhen you (the mom) read inspiring things, that&#39;s to inspire you. <br/>\nIt&#39;s not to give you tools to use against the other partner.   <br/>\n<br/>\nSometimes a dad is &quot;behind&quot; and it might take a year or two, but sometimes then that same dad Really gets it, and leaps ahead.  The danger is if the relationship is shakey, or if the mom uses unschooling as a wedge between people.  Don&#39;t team up with your child against his dad.   It sounds simpler than it might be, but school and two parents is better than attempted unschooling, separation/divorce, step parents, judges and social workers, no unschooling ever.  <br/>\n<br/>\nIf it seems hiring an outside voice would help, here&#39;s an assortment of possibilities:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/issues/therapy\">http://sandradodd.com/issues/therapy</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220655190,"authorName":"Janette","from":"&quot;Janette&quot; &lt;yamaguchi3@...&gt;","profile":"iguanagirl66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Help with family happiness","postDate":"1360631254","msgId":70514,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtmYzRrbSsyaXFmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":70515,"prevInTime":70513,"nextInTime":70515,"topicId":70514,"numMessagesInTopic":0,"msgSnippet":"I posted the following last week and wonder if it got lost in another thread?  Any advice is greatly appreciated. Sandra wrote: Seeing a child where he is, and","messageBody":"<div id=\"ygrps-yiv-961298788\">I posted the following last week and wonder if it got lost in another thread?  Any advice is greatly appreciated.  <br/>\n<br/>\n<br/>\nSandra wrote: Seeing a child where he is, and as he is, leads to love.<br/>\n<br/>\nThank you for this.<br/>\n<br/>\nI moved into unschooling without realizing my partner wasn&#39;t as ready<br/>\nfor it as I was. Because I did a ton of research and he listened when<br/>\nI shared with him, and because he&#39;s always been, and still is, 100%<br/>\nbehind keeping Tomás out of school (his own school years were<br/>\nhorrible), I thought we were in this together. But I was wrong. I<br/>\napologized for my error and asked how he&#39;d like to proceed, how I<br/>\ncould make things better but he had no answer, seems resigned, and now<br/>\nthings like pooping in diapers and not yet reading are evidence to him<br/>\nthat this kind of learning doesn&#39;t work. I tried to soothe his<br/>\ndiscomfort by having Tomás do a few schoolish worksheets (Tomás would<br/>\nhave nothing to do with them, and ran crying from the room when I<br/>\nasked him if he wanted to try writing his name). I shared with him<br/>\nthe various things Tomás did in a day, let him know when he learned<br/>\nsomething or was excited about something new. I said if he was really<br/>\nworried and against this we could send him to school; he said he&#39;d be<br/>\ntoo far behind.<br/>\n<br/>\nWhat Sandra wrote has been in my head for a few days now. When Stan<br/>\nlooks at his son, I see how much he loves and adores him, and how good<br/>\nthey are together. But when his worry sets in, when he feeling as<br/>\nthough our son is behind (compared to schooled kids, and Tomás&#39;<br/>\nschooled cousin, in particular), he is then seeing Tomás wrong and<br/>\nlacking. Not seeing his actual, lovely child at that moment, but<br/>\neverything he is not. Similar to how I felt about the diapers,<br/>\nbefore I let it go.<br/>\n<br/>\nOur marriage is strong. I do not take that for granted, though. I<br/>\nsee my husband, where he is, and love him there. I want peace of mind<br/>\nand confidence in learning for all of us. I don&#39;t know how to get<br/>\nthere from where we are now. How do I make this possible?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":70540,"nextTopicId":70570}}