{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Give me some ideas how to support my sensitive son","postDate":"1358107383","msgId":70273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEREQUQxNjVBLTEwMzEtNDNFRS1CNzE5LUIzNTE2QkZGMjExRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtjdDdlaitjbWo3QGVHcm91cHMuY29tPg==","referencesHeader":"PGtjdDdlaitjbWo3QGVHcm91cHMuY29tPg=="},"prevInTopic":70271,"nextInTopic":0,"prevInTime":70272,"nextInTime":70274,"topicId":70267,"numMessagesInTopic":0,"msgSnippet":"In neither example did you seem to be recommending how he can respond more politely or productively. If you read through (and listen to the sound file) here,","messageBody":"<div id=\"ygrps-yiv-1659296790\">In neither example did you seem to be recommending how he can respond more politely or productively.<br/>\n<br/>\nIf you read through (and listen to the sound file) here, and work on making the better choice yourself for a while, you might be able (after a few months, or a year) to coach him to do the same kind of thinking.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nHolly is still that way sometimes, especially if she&#39;s hungry (specifically if she hasn&#39;t had protein--because carbohydrates, fruit and vegetables don&#39;t undo her headache and grumpiness and short-temperedness).  She can be very frustrated and want to recite what happened and who said what and did what, and didn&#39;t do what.  When she&#39;s at a better starting place (and she usually is pretty good at it) she can relax and remember that other people get to make their own decisions and she should respond in ways that make situations better, and not worse.<br/>\n<br/>\nIf he&#39;s not old enough, calm enough, analytical enough, accepting enough to play team games, maybe you should avoid them.  <br/>\n<br/>\n-=-I tell him &quot;I don&#39;t like to listen to you complain, please stop&quot; but I&#39;m not sure if this is harmful to him?-=--<br/>\n<br/>\nThat&#39;s making it about you, though.  It should be about his  growing awareness and maturity, and the effect his actions will have on his own peace and composure.<br/>\n<br/>\n-=-if I always tell him not to do it am I stifling his growth or telling him I don&#39;t accept him how he is? Or am I turning him in to someone who won&#39;t come to me when he is upset? Should I just be letting him complain to me?-=-<br/>\n<br/>\nSome and some.  Beware the word &quot;just.&quot;   &quot;Just be letting him complain&quot;?  Sometimes listen to his complaints.  Sometimes distract or defuse.  Not always any one thing.  It depends.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Give me some ideas how to support my sensitive son","postDate":"1358091495","msgId":70271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjdWtkNytidXBzQGVHcm91cHMuY29tPg=="},"prevInTopic":70267,"nextInTopic":70273,"prevInTime":70270,"nextInTime":70272,"topicId":70267,"numMessagesInTopic":0,"msgSnippet":"... ************* I ve found a good rule of thumb to be: don t make it worse. You can t always make things better - sometimes a person needs time to be","messageBody":"<div id=\"ygrps-yiv-986955565\">&quot;Lisa&quot;  wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;lately I have found myself feeling like I don&#39;t know how I should be handling or helping his outbursts<br/>\n </span></blockquote>*************<br/>\n<br/>\nI&#39;ve found a good &quot;rule of thumb&quot; to be: don&#39;t make it worse. You can&#39;t always make things better - sometimes a person needs time to be emotional, to move through the feelings like a kind of storm, and the best you can do is not add to the intensity with your own emotional reaction. Deep breathing or something like meditation are often good tools in the moment, to stay calm in the face of someone else&#39;s upset. <br/>\n<br/>\nThe other thing which has really helped with both my kids has been for me to be sensitive to the sorts of situations which are going to be hugely upsetting and reduce those. It seems counter-intuitive - like &quot;how ever are they going to learn if they don&#39;t experience this?&quot; but in reality if they don&#39;t have the skills to deal with a situation to a basic extent all they learn is failure and frustration. So it&#39;s better to let them learn the skills they need - and maybe do the growing they need - in situations where they can feel successful and supported. <br/>\n<br/>\nIn the middle of an emotional &quot;storm&quot; isn&#39;t the time to problem solve, its time for you to support him calmly. Before and after is when you can help him look for alternatives, remind him of what he needs to know, help him make thoughtful choices.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; 1)  He is really excited about something and it doesn&#39;t go just as he plans and he gets really upset about it.<br/>\n </span></blockquote>***************<br/>\n<br/>\nThe fact that he&#39;s really excited about something doesn&#39;t mean he&#39;s ready or able to handle that situation, at least without a lot of help. I&#39;d look for ways he can do something similar but which lets him have a lot more control so he&#39;s not getting *as* frustrated.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Example.  Playing Just Dance teams...<br/>\n<br/>\n </span></blockquote>Other people are impossible to control! So it could be better to play games like this with just one friend, someone accomodating - maybe just with you - for now. When he does play in teams, suggest a lower level of competition or be ready for him to melt down - flat out expect that he&#39;ll get upset and want to stop playing. Make a back-up plan with him so that when the team wants to do something he doesn&#39;t, he can go do something else for awhile and come back - a snack, or another game maybe. Or talk with the other players about him &quot;floating&quot; from one team to the other - I don&#39;t know how the game works, but set up the expectation that he&#39;s not going to play by the usual rules, and how can we make that fun for everyone? For some players, that&#39;s going to ruin the game! So he shouldn&#39;t play with those people - it won&#39;t be fun for anyone.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I sometimes try to get him to calm down and tell him next time not to let someone else pick his team<br/>\n </span></blockquote>************<br/>\n<br/>\nDo that for him, ahead of time - don&#39;t set all the kids up to be frustrated! Remind him before the team-choosing even starts. Or maybe avoid the whole situation - it&#39;s the sort of thing which a Lot of people find frustrating, having teams picked with no care for the feelings of the players, and the results can be to spoil the fun for everyone. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I tell him &quot;I don&#39;t like to listen to you complain, please stop&quot;<br/>\n<br/>\n </span></blockquote>You complain at him to stop complaining? Woops.<br/>\n<br/>\nTake some deep breaths. Listen calmly and gracefully. Make sympathetic sounds. Let the storm blow by you without whipping you up in its winds, as it were. Don&#39;t take it personally. You&#39;re his mom - if he can&#39;t complain to you, who can he share his most uncomfortable feelings with?<br/>\n<br/>\nWhat would you rather he do- stuff all those feelings away, believing no-one cares about him or his feelings, until he explodes? That&#39;s the usual way of raising boys. Your guy doesn&#39;t sound over-the-top to me, from your description, a little needy maybe, but not a huge amount (he&#39;s not flying at people in a rage, just crying and complaining). The bigger problem is that you&#39;re over-reacting to his feelings and trying to push them away. That won&#39;t help him deal with them. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":474282117,"authorName":"Lisa","from":"&quot;Lisa&quot; &lt;lisakleinweber@...&gt;","profile":"cslisacs","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Give me some ideas how to support my sensitive son","postDate":"1358045459","msgId":70267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtjdDdlaitjbWo3QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":70271,"prevInTime":70266,"nextInTime":70268,"topicId":70267,"numMessagesInTopic":0,"msgSnippet":"My son Joe is 9.  He is very sensitive and always has been.  I am also very sensitive and a lot of what I do is manage my own anxiety response when he gets","messageBody":"<div id=\"ygrps-yiv-1183507569\">My son Joe is 9.  He is very sensitive and always has been.  I am also very sensitive and a lot of what I do is manage my own anxiety response when he gets upset.  I am getting better at this though, and lately I have found myself feeling like I don&#39;t know how I should be handling or helping his outbursts.  <br/>\n<br/>\nHere&#39;s the two kinds of situations I am not sure if I am helping or hurting and would like some ideas for.<br/>\n<br/>\n1)  He is really excited about something and it doesn&#39;t go just as he plans and he gets really upset about it.  Example.  Playing Just Dance teams and the other team gets to pick his song and he doesn&#39;t like the song so he refuses to play, tells them their song is stupid, and runs out of the room and cries.  <br/>\n<br/>\nI sometimes say &quot;it&#39;s ok, you&#39;ll feel better soon&quot;<br/>\n<br/>\nI sometimes say nothing and just hang with him till he feels better.<br/>\n<br/>\nI sometimes try to get him to calm down and tell him next time not to let someone else pick his team.  ... I think I do this more when I am not doing a good job at managing my own upset-ness.  Not sure if it&#39;s helpful or hurtful.  <br/>\n<br/>\nThe other situation is more of a new thing that he is doing.  He&#39;ll get upset at a situation like the one above, and instead of crying and getting over it, he&#39;ll stomp around and complain about it angrily for a while. <br/>\n<br/>\nThis probably bothers me more.  I specifically choose my friends so that I do not hang out with people who complain and bitch and moan, and here I find my son starting to do it more and more.<br/>\n<br/>\nI tell him &quot;I don&#39;t like to listen to you complain, please stop&quot; but I&#39;m not sure if this is harmful to him?  I guess my concern is, is this a stage he is going through that he will grow out of but if I always tell him not to do it am I stifling his growth or telling him I don&#39;t accept him how he is?  Or am I turning him in to someone who won&#39;t come to me when he is upset?  Should I just be letting him complain to me?<br/>\n<br/>\nThank you in advance for your thoughts.  Lisa</div>","specialLinks":[]}],"prevTopicId":70269,"nextTopicId":70257}}