{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Sharon Corage","from":"Sharon Corage &lt;sluror@...&gt;","replyTo":"LIST","senderId":"QocYIqjVKVkBU5bDoY2FMWfxQlvSyxApPxmnd73cRHhpughDXqlMY8QxHThZn7H6IfUFMUMdf5pJlWA4xUndiKLASnzgNQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Ponds","postDate":"1000140380","msgId":25040,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDEwOTEwLjExNDYyMC4tNjc4NDMuMS5zbHVyb3JAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":25039,"nextInTime":25041,"topicId":25040,"numMessagesInTopic":0,"msgSnippet":"I love these things! I m living with my second one. We dug the first one in the Philadelphia suburbs, it was three years old when we left it. Now our new pond","messageBody":"<div id=\"ygrps-yiv-414877498\">I love these things!<br/>\nI&#39;m living with my second one. We dug the first one in the Philadelphia<br/>\nsuburbs, it was three years old when we left it. Now our new pond in the<br/>\nDenver suburbs is 16 months old. No pumps or filters in either one. I<br/>\nsuggest reading as many books as you can find at your local library<br/>\nbefore you start or get too far on a project like this, but don&#39;t let the<br/>\n&quot;must have filtration&quot; books discourage you. How many natural ponds do<br/>\nyou see with extension cords running up to them?;-) We used rubber<br/>\nroofing to line our ponds covered in clay soil and gravel. Rubber roofing<br/>\nis the same as but cheaper than pond liners, but check to make sure the<br/>\nrubber&#39;s not toxic. A couple things to keep in mind are: The larger the<br/>\nsurface area of the water the better for oxygenating the water. Fish eat<br/>\nalgae and larvae. Gold fish and minnows have been very happy in these<br/>\nponds, but larger fish like Koi demand a filtration system. Plants below<br/>\nthe surface make oxygen and eat up (filter) the nutrients (the fish leave<br/>\nbehind) that cause algae. Surface floating plants like water hyacinths,<br/>\nwater lilies, and parrot feathers block the sun from growing algae. I<br/>\nthink the rule I read was 2/3 of the water surface should be covered with<br/>\nplants. If you want to attract wildlife it&#39;s a good idea to dig a gentle<br/>\nslope into part of the pond for easy access. We&#39;ve found local turtles,<br/>\nfrogs, snakes, squirrels, birds, gophers, dogs, cats and smelled skunks<br/>\nthat have visited for a drink, swim, or bath at one time or another. You<br/>\nmust dig at least 3 ft down in at least one part of the pond if you get<br/>\ncold winters and you want to keep your fish outside. Winter in Pa. was<br/>\nkinder to the pond. The kids would slide across the frozen pond for a<br/>\nweek or two then be totally amazed to find the fish were still alive as<br/>\nit defrosted. Co. has been a different story. The pond stayed frozen for<br/>\nmonths, then the fish floated lifelessly to the surface in the spring. To<br/>\nour surprise after we put in another dozen feeder goldfish this spring an<br/>\narmy of baby gold fish hatched from below. We&#39;re guessing last years fish<br/>\nleft behind the new generation. This year we&#39;re going to try to keep at<br/>\nleast one hole melted in the ice to help vent any gases that might build<br/>\nup from decaying plants below and give the fish some air. I use bird<br/>\nnetting in the fall to keep out the majority of the falling leaves to<br/>\nhelp keep the pond clean. Like life itself the pond is a never ending<br/>\nexperiment. It&#39;s great when we find frog eggs and baby minnows and<br/>\ngoldfish , it&#39;s a sign that the pond is doing good. I think it&#39;s a<br/>\nwonderfully fun learning experience for the whole family. Have fun with<br/>\nit!<br/>\nSharon<br/>\n________________________________________________________________<br/>\nGET INTERNET ACCESS FROM JUNO!<br/>\nJuno offers FREE or PREMIUM Internet access for less!<br/>\nJoin Juno today!  For your FREE software, visit:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://dl.www.juno.com/get/tagj.\">http://dl.www.juno.com/get/tagj.</a></div>","specialLinks":[]}],"prevTopicId":25022,"nextTopicId":24987}}