{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":153568917,"authorName":"Beth Monteverde","from":"&quot;Beth Monteverde&quot; &lt;ebsenterprises@...&gt;","profile":"monteverdegirls","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"new person - teeth help - long","postDate":"1121861643","msgId":107381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGRibGY2YitxbnB2QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":107380,"nextInTime":107382,"topicId":107381,"numMessagesInTopic":0,"msgSnippet":"Dear Group - I posted this on two other groups, so I apologize if you re reading this again.  I am new to the unschooling e-mail groups and am needing some","messageBody":"<div id=\"ygrps-yiv-1607121351\">Dear Group - I posted this on two other groups, so I apologize if <br/>\nyou&#39;re reading this again.  I am new to the unschooling e-mail <br/>\ngroups and am needing some feedback.  I signed up a while ago, but <br/>\nam just now starting to read a little bit.  I am not new to <br/>\nunschooling, but at times find that I still struggle with my need to <br/>\ncontrol things.  I&#39;m growing all the time in this life philosophy <br/>\nand so appreciate all the help that is out there!  Sandra - thanks <br/>\nso much for your website - it is incredibly helpful!!!  My dd is <br/>\nVERY sensitive (Elaine Aron) and VERY spirited and introverted (Mary <br/>\nKurcinka) and we love and honor that about her.  However, when it <br/>\ncomes to things like cavities and dentists, my creative abilities <br/>\nare stretched!!!  Thanks in advance for your help! :)<br/>\n<br/>\n*****original message*****Robyn - Thank you so very much for sharing <br/>\nyour story.  Your journey was difficult but I truly believe that you <br/>\nand James both handled it with open hearts.  You listened to your <br/>\nchild, and honored your child, while responding to the very real <br/>\nconcern for her health.  <br/>\n<br/>\nI am new to this group.  I am not new to unschooling, although I <br/>\nwon&#39;t pretend to have it all worked out.  It is a journey of growth <br/>\nfor me - truly, for our whole family.  Your story resonates deeply <br/>\nwith our family as my daughter has two visible cavities right now, <br/>\nand I&#39;ve been letting it go because she DOES NOT want to go to the <br/>\ndentist.  So we haven&#39;t gone.<br/>\n<br/>\nShe had visible cavities in her teeth within 6 months of when they <br/>\ncame in (two of her teeth virtually came in with cavities) and at <br/>\nthe time, we had her knocked out and had procedures done on her that <br/>\njust about broke my heart.  She was around 18 mo. when we finally <br/>\nhad her teeth fixed.  It took me a long time to come to a place <br/>\nwhere I knew she had to have it done.  She had two front teeth that <br/>\nwere so decayed that the dentist had to re-build them with some sort <br/>\nof filling material.  These were two of her front teeth.  She also <br/>\nhad 4 other cavities that were filled at that time.  It was VERY <br/>\ndifficult as we didn&#39;t have a dentist that I trusted at that time.  <br/>\nI did a ton of research, and against a lot of pressure to wean her, <br/>\nwe went an alternative route with homeopathy, natural products, <br/>\netc.  That worked very well for a time.  It has only been recently, <br/>\nwhen she has chosen to not brush her teeth regularly, that I&#39;ve seen <br/>\nany new problems with her teeth.  I do not want to ever force her to <br/>\nbrush, but I do explain to her regularly why it is important.  We <br/>\nare very creative, and her dolls brush, our imaginary friends brush, <br/>\netc., and many of these techniques work some of the time - but of <br/>\ncourse, since she has a choice, there are many times that she just <br/>\ndoesn&#39;t brush.  <br/>\n<br/>\nWe have taken her back to the dentist 3 times, just for check-ups <br/>\n(the same one, which I&#39;m realizing was probably not a good plan) and <br/>\nEmmy has been great about going, and she&#39;ll get in the chair, but <br/>\nWILL NOT let anyone near her mouth.  I, too, have probably spent too <br/>\nlong trying to talk her into just letting someone look at her teeth, <br/>\n(10 minutes or so) rather than just grabbing her up and taking her <br/>\nhome.  The last time, I left with the understanding that the dentist <br/>\ntruly thought I was stupid for letting my child &quot;rule&quot; me and she <br/>\nreally thought I should force Emmy to submit, rather than give her a <br/>\nchoice.  I left realizing that we needed a new dentist, and my new <br/>\nplan has been to pick 3 or 4 and have Emmy &quot;interview&quot; them.  I do, <br/>\nhowever, keep procrastinating making the appointments because she <br/>\njust doesn&#39;t want to go.  We read books about it (there is a great <br/>\none from the Dora character that is very descriptive about going to <br/>\nthe dentist), we play dentist, and she has been to my appointments <br/>\nnumerous times.  <br/>\n<br/>\nAs a little background, Emmy is VERY sensitive and VERY spirited, <br/>\nand we love that about her.  At 4 1/2 she still doesn&#39;t like groups, <br/>\nand doesn&#39;t like other children around her unless she has been <br/>\naround them many, many times and knows who they are.  Even then, she <br/>\nonly enjoys one-on-one with other kids - not kids in a group, even <br/>\nif she knows them.  It takes her quite a while to feel safe enough <br/>\nin any new situation for her to reach out a little bit, let alone <br/>\nhave someone she doesn&#39;t know look at her teeth!  But as these <br/>\ncavities get bigger, I get more and more worried.  Especially as I <br/>\ndo know that cavities in the teeth mean that there is a level of <br/>\nbacteria in her body that her little system constantly has to <br/>\nfight.  There is just no way at 4 1/2 that she can understand some <br/>\nof the ramifications of all that.  And I really don&#39;t want to let it <br/>\ngo to the point that she has an emergency situation, like you have <br/>\nhad with Jayn.  My heart just goes out to your family, and I honor <br/>\nso much how all of you have handled this difficult situation.  We <br/>\ndon&#39;t force her to do anything, and I won&#39;t start now, but at the <br/>\nsame time, I&#39;m stumped as to how to get her to understand how <br/>\nimportant this is.  One of her cavities now is like a big crack in <br/>\nher tooth, and is completely black. <br/>\n<br/>\nI would truly love any suggestions that anyone has on how to get my <br/>\ndarling girl to understand how important it is that she get these <br/>\ncavities fixed before they become much more serious.  I haven&#39;t yet <br/>\ntried letting her interview different dentists, but your story has <br/>\nhelped me see that I need to trust that the Universe is bringing me <br/>\na little nudge and I need to get it done.  Thank you, and I welcome <br/>\nany and all suggestions.<br/>\n<br/>\nWarmest Regards,<br/>\nBeth & Emmy :)</div>","specialLinks":[]}],"prevTopicId":107367,"nextTopicId":107363}}