{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":171830749,"authorName":"nycartgal2003","from":"&quot;nycartgal2003&quot; &lt;mranzer@...&gt;","profile":"nycartgal2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Lots of Learning","postDate":"1289178224","msgId":58022,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGliN2k5ZythZW04QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":58021,"nextInTime":58023,"topicId":58022,"numMessagesInTopic":0,"msgSnippet":"I ve noticed so many wonderful things happening in our home lately that I thought could help some parents of young children who have written. Here are some","messageBody":"<div id=\"ygrps-yiv-328396894\">I&#39;ve noticed so many wonderful things happening in our home lately that I thought could help some parents of young children who have written.<br/>\n<br/>\nHere are some things an almost 4 year old has learned without being taught. I don&#39;t think of these things as school subjects as they are happening in our lives.<br/>\n<br/>\nSpelling-Logan loves all the Toy Story Movies. There is a scene in Toy Story One when Woody says to Buzz, &quot;Your a Toy, T-O-Y, toy.&quot;. Logan repeated it, and now knows how to spell toy. He asks me how to spell words all the time.<br/>\n<br/>\nReading and poetry-We read lots of Dr. Suess books. Logan will pick up a book, sit by himself, and repeat the pages he has memorized. He also makes up Suessian poetry all the time.<br/>\n<br/>\nLearning other languages-He watches Diego and Dora, and has learned many words in Spanish. Sometimes he&#39;ll ask me how to say something in Spanish, so we look it up on the computer. I always felt that that I couldn&#39;t learn another language becasue I did so bad in French in school. Now, I&#39;m learning Spanish with Logan!<br/>\n<br/>\nMath and technology-Before reading this list, I was wary of video games, probably becasue I&#39;ve never been very good at them. When I bought my Iphone, Logan wanted to play with it. I started downloading Apps for him. He was able to use the phone easily. It&#39;s so intuitive, which is great. He plays all kinds of games, memory matching, spelling, puzzles. He even found the Apps store on his own, and picks out games and books he wants to download.<br/>\nThe other day we were downloading an App, Logan likes to watch them come into the phone. There is a bar that goes from white to blue. He was watching and commented that it was half blue, and half white, then he said that it is half full. We have not taught him fractions. He picked it up by listening to conversations, maybe cooking with me. <br/>\n<br/>\nTime-He looks at the numbers on the digital clock and tells me the time. When I leave the house, he wants to know how long I&#39;ll be gone, and what time I&#39;ll be back. On another note, he likes me to tell him which subways I took, transfers, etc.<br/>\n<br/>\nAgriculture-We are growing peppers and avacado pits on our windowsill, with herbs to follow. Logan is very intrigued by how they grow, and checks on their progress daily.<br/>\n<br/>\nOn another note, I wrote last month about Logan&#39;s sleeping habits, being up until the middle of the night. He is still up until very late many nights, but things are so much better. I had a major attitude adjustment after reading the responses I got here, so now our nights are more peaceful and fun. <br/>\n<br/>\nMeryl</div>","specialLinks":[]}],"prevTopicId":57931,"nextTopicId":58026}}