{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":135098343,"authorName":"Peggy","from":"Peggy &lt;durrell@...&gt;","profile":"waptia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"NEWS: Purdue Researchers Determine Age Of Fossilized Human Ancestor","postDate":"1051302425","msgId":13911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFQTk5QTE5LjcwNzAxMDNAYWl0YWNjZXNzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13910,"nextInTime":13912,"topicId":13911,"numMessagesInTopic":0,"msgSnippet":"This is pretty cool! Peggy http://www.sciencedaily.com/releases/2003/04/030425071144.htm Purdue Researchers Determine Age Of Fossilized Human Ancestor WEST","messageBody":"<div id=\"ygrps-yiv-164821044\">This is pretty cool! Peggy<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.sciencedaily.com/releases/2003/04/030425071144.htm\">http://www.sciencedaily.com/releases/2003/04/030425071144.htm</a><br/>\n<br/>\nPurdue Researchers Determine Age Of Fossilized Human Ancestor<br/>\n<br/>\nWEST LAFAYETTE, Ind. - In a finding that could shed light on the <br/>\nearliest origins of mankind, fossil remains found in South Africa of an <br/>\nancestral human species have proven far older than expected when <br/>\nevaluated by a Purdue University research team.<br/>\n<br/>\nPurdue&#39;s Darryl Granger and Marc Caffee have determined the age of a <br/>\nfossilized skeleton thought to be an Australopithecus - a genus of <br/>\nAfrican hominids from which humanity is thought to have developed - by <br/>\nmeasuring the radioactivity of the cave sediments in which the skeleton <br/>\nwas buried millions of years ago. Their measurement technique, generally <br/>\nused to estimate the age of geological formations such as glaciated <br/>\nvalleys and river terraces, has never before been used to date <br/>\nbiological fossils.<br/>\n<br/>\n&quot;By dating the sediments surrounding the fossil skeleton, we have <br/>\ndetermined that this species reached southern Africa approximately 4 <br/>\nmillion years ago,&quot; said Granger, associate professor of earth and <br/>\natmospheric sciences in Purdue&#39;s School of Science. &quot;If the skeleton is <br/>\nindeed an Australopithecus, as we believe, the findings could mean that <br/>\nthese hominids were present in the area far earlier than is generally <br/>\naccepted.&quot;<br/>\n<br/>\nThe research appears in Friday&#39;s (4/25) issue of Science.<br/>\n<br/>\nTracing the development and spread of the hominid species that may have <br/>\nbeen mankind&#39;s ancestor is an arduous process, and it is difficult to <br/>\ndetermine what happened because precisely dated fossil records are hard <br/>\nto come by. Many such fossils have been found in eastern Africa&#39;s Rift <br/>\nValley, a region that was geologically active when Australopithecus <br/>\nwalked the Earth. The abundance of lake sediments and volcanic ash that <br/>\noften surrounds Rift Valley hominid fossils provide good clues as to <br/>\ntheir age. But there is no such luck with similar fossils from South <br/>\nAfrica, a region that also is rich in hominid remains but lacks the <br/>\ndefinitive geological clues that are present in the Rift Valley.<br/>\n<br/>\nT.C. Partridge and R.J. Clarke, researchers from the University of the <br/>\nWitwatersrand in South Africa, were thus confronted with a mixed <br/>\nblessing when, in 1997, they discovered a nearly complete skeleton of <br/>\nwhat appeared to be an Australopithecus buried in the sediments on the <br/>\nfloor of the Sterkfontein cave in central South Africa. The fossil was <br/>\nwell preserved, but its age was uncertain. It was more than 2 million <br/>\nyears old, but how much more? The answer to that question would affect <br/>\ntheories of how and when Australopithecus spread through Africa.<br/>\n<br/>\n&quot;Their initial estimate of 3.3 million years provoked a lot of <br/>\ncontroversy,&quot; Granger said. &quot;Few thought that Australopithecus had <br/>\ntraveled so far so long ago, and scientists wanted more proof. If the <br/>\nestimate was accurate, it might require a rethinking of human prehistory.&quot;<br/>\n<br/>\nA firmer answer would require the innovative use of a particle <br/>\naccelerator half a world away at Purdue in Indiana, where Granger was <br/>\nusing radioactive isotopes in sediment to determine the age of rivers <br/>\nand caves.<br/>\n<br/>\nDating fossils by examining the minute quantities of radioactive <br/>\nelements they contain is not a new technique in archaeology. Carbon-14, <br/>\na radioactive isotope that slowly decays as centuries pass, has been a <br/>\ncommon benchmark for dating many human fossils; the more carbon-14 has <br/>\ndecayed in a sample, the older it must be. The speed at which carbon-14 <br/>\ndecays, called its half-life, is only 5,730 years. This means that after <br/>\na few millennia, the isotope is no longer useful to mark a fossil&#39;s age.<br/>\n<br/>\n&quot;Once your fossil is older than 50,000 years, its carbon-14 is nearly <br/>\ngone,&quot; Granger said. &quot;We knew the South African fossils were at least 2 <br/>\nmillion years old, so it was clear we needed another way to establish <br/>\ntheir age.&quot;<br/>\n<br/>\nGranger, a physics major as an undergraduate, eventually became an earth <br/>\nscientist when he developed an interest in studying the age and changes <br/>\nin mountains and river beds, geological formations that are often many <br/>\nmillions of years old. Rather than use carbon-14 to date his landscapes, <br/>\nhe looked for isotopes with far longer half-lives - and found them in <br/>\naluminum-26 and beryllium-10. These elements often form in common quartz <br/>\nwhen it is on the Earth&#39;s surface and exposed to cosmic rays.<br/>\n<br/>\n&quot;When radiation from outer space strikes silicon and oxygen atoms in a <br/>\nquartz crystal, they split into aluminum-26 and beryllium-10, both of <br/>\nwhich have half-lives of around a million years,&quot; Granger said. &quot;Because <br/>\nthey decay so slowly, they allow you to reach back much further in <br/>\nhistory than you can using carbon-14.&quot;<br/>\n<br/>\nThe use of aluminum and beryllium for radiometric dating had only been <br/>\naround for a few years when Granger began to use it on cave sediments. <br/>\nThe technique was not widely known outside geological circles, so when <br/>\nhe heard about the Australopithecus discovery, he contacted the South <br/>\nAfrican scientists who found the skeleton and asked if he could be of <br/>\nassistance.<br/>\n<br/>\n&quot;It was the first time this method had been used to determine the age of <br/>\nsomething that had been alive,&quot; Granger said. &quot;But based on the <br/>\nevidence, we found that the fossil was even older than the initial <br/>\nestimate.&quot;<br/>\n<br/>\nGranger and Caffee, of Purdue&#39;s physics department, analyzed samples of <br/>\nthe skeleton in Purdue&#39;s accelerator mass spectrometer, a device capable <br/>\nof detecting the infinitesimal quantities of radioactive aluminum and <br/>\nberyllium in the samples.<br/>\n<br/>\n&quot;We found that the skeleton was between 3.5 and 4.5 million years old,&quot; <br/>\nGranger said. &quot;That&#39;s admittedly quite a large window of possibility, <br/>\nbut even if it&#39;s on the young side, it still puts Australopithecus in <br/>\nsouthern Africa far earlier than expected.&quot;<br/>\n<br/>\nThe significance for anthropologists would be the possibility that <br/>\nmankind&#39;s earliest ancestors were a different species than scientists <br/>\ngenerally believe.<br/>\n<br/>\n&quot;Early hominid finds in eastern Africa have traditionally been regarded <br/>\nas the base populations from which all later hominids sprung,&quot; said <br/>\nMelissa Remis, associate professor of anthropology in Purdue&#39;s School of <br/>\nLiberal Arts. &quot;An earlier hominid find in southern Africa, whatever the <br/>\nspecies might be, could force a rethinking of what that base population <br/>\nmight have been.&quot;<br/>\n<br/>\nGranger said he hesitated to speculate on the broader significance of <br/>\nthe findings, but he hopes the technique will prove useful in other <br/>\ninvestigations into prehuman history.<br/>\n<br/>\nThis research was funded in part by the National Science Foundation.</div>","specialLinks":[]}],"prevTopicId":13910,"nextTopicId":13912}}