{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Relationship between stepfather and stepson: issues and solutions","postDate":"1465186696","msgId":77183,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQzNDdCODJCLTM1M0EtNEI5NS1BRkYxLUMxNTg2MjUzOTM2NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDRDOEIyMTJFLTJDODktNDFFRS05NDcwLTNDMTBBQkVENUY5M0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhCOTQ0NTZFLTNGQUItNDU1MS05OUI4LTc4NTQ3QjNEMUU5RkBTYW5kcmFkb2RkLmNvbT4gPG5pczhtOSt0bGFsYWJAWWFob29Hcm91cHMuY29tPiA8NEM4QjIxMkUtMkM4OS00MUVFLTk0NzAtM0MxMEFCRUQ1RjkzQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":77147,"nextInTopic":0,"prevInTime":77182,"nextInTime":77184,"topicId":77143,"numMessagesInTopic":0,"msgSnippet":"This is from Divia, and has a couple of REALLY WONDERFUL points: _______________________ I’ve had trouble formatting, so I’m sending this to you. Thanks in","messageBody":"<div id=\"ygrps-yiv-841369264\">This is from Divia, and has a couple of REALLY WONDERFUL points:<br/>\n_______________________<br/>\n<br/>\nI’ve had trouble formatting, so I’m sending this to you. Thanks in advance if you can fwd it to the list for me.<br/>\n<br/>\nI have some overall thoughts that are mostly informed by my memories of living with my stepfather. I think I met him when I was 11 and he started dating my mother, and started living with him when I was 13. <br/>\n<br/>\nMy stepfather is a nice guy. I was older by then, and he mostly didn’t try to directly tell me what to do, outside of a few minor conflicts early on. (I remember something about him wanting the fan on and me wanting it off…)<br/>\n<br/>\nEven so, I had a really hard time living with him. It was harder for me because I didn’t understand why it bothered me so much, since he wasn’t doing anything in particular I knew how to object to. But he was a new person in my space. My best friend at the time told me she didn’t understand what I didn’t like about him. There wasn’t much I could explain.<br/>\n<br/>\n<br/>\nYears later, I found some statistics about stepparents being much more likely to be abusive, and that felt validating. My stepfather *wasn’t* abusive, at all. He was good to my mother and helped pay for my private high school, and college. But I think on a biological level I never trusted him. <br/>\n<br/>\nSo please try to keep in mind that some of that may be going on with your son. <br/>\n<br/>\nOne thing that helped was having my mother as a relationship buffer. When she tried talking to me about the nice things that my stepfather was doing for me, I felt resentful. It felt unfair for her to bring that up since I didn’t choose to have him in my life. But when she talked about how he was important to her, and how he made her happy, I wanted to be nicer to him.<br/>\n<br/>\nMake relationship deposits with both of them, and make withdrawals on behalf of each other, if that makes sense.<br/>\n<br/>\nCan you tell your partner to be gentle and patient with son *for your sake*, without emphasizing that you think it’s the right thing to do objectively? I expect that would feel lighter. <br/>\n<br/>\nI’m often happy to do seemingly nonsensical things for people I love and trust just because they want them, even hard things. But I would resent the same things if the people I love tried to convince me that their way was objectively better. And when it’s really better, it’s often nice to get to confront that gradually. <br/>\n<br/>\n(As a final random note, I also have a stepmother. I never lived with her full-time, so it was an easier relationship to navigate. And it helped that my dad married his cousin, even though I hadn’t know her much before he got involved with her. She already felt like family, because she was! An unexpected benefit of a thing many people disapprove of. And they never had kids, so no genetic downside.)<br/>\n<br/>\n________<br/>\n<br/>\nend of quote<br/>\n_______</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Relationship between stepfather and stepson: issues and solutions","postDate":"1464974535","msgId":77147,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDOEIyMTJFLTJDODktNDFFRS05NDcwLTNDMTBBQkVENUY5M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PG5pczhtOSt0bGFsYWJAWWFob29Hcm91cHMuY29tPg==","referencesHeader":"PDhCOTQ0NTZFLTNGQUItNDU1MS05OUI4LTc4NTQ3QjNEMUU5RkBTYW5kcmFkb2RkLmNvbT4gPG5pczhtOSt0bGFsYWJAWWFob29Hcm91cHMuY29tPg=="},"prevInTopic":77145,"nextInTopic":77183,"prevInTime":77146,"nextInTime":77148,"topicId":77143,"numMessagesInTopic":0,"msgSnippet":"-=-Anytime I hear a should, whether from me or anyone I care about, I rephrase the sentence/question with either need or want , and if neither of those","messageBody":"<div id=\"ygrps-yiv-1728210291\">-=-Anytime I hear a should, whether from me or anyone I care about, I rephrase the sentence/question with either &quot;need&quot; or &quot;want&quot;, and if neither of those fits, the thought is likely from somewhere else, meant to shape behavior. Should is shaming, even if the actual word isn&#39;t used. Children should sit quietly at the table, socialize in a certain manner, sleep by themselves, use the potty by themselves by age 7. Why? Who says, and do you agree?-=-<br/>\n<br/>\nThat’s interesting but I disagree with it. :-)<br/>\n<br/>\nThere are if/then situations in which “should” is way better than “have to.”  <br/>\n<br/>\nDevyn should eat with her mouth shut.  She’s seven.  She has the ability.  She has no physical problems.  <br/>\nIf she wants to eat at my house, she should eat with her mouth shut.  Maybe that could change to “need,” but it’s not “want” except that she DOES want to be at my house.  So in this case it’s an if/then, and he should.  But she should eat with her mouth closed everywhere, because there is an assumption that she will want to eat at restaurants, and at other people’s houses, and not to be disgusting and irritating at the school cafeteria (where, unfortunately, she has too many of her meals).<br/>\n<br/>\nIn the case of the situation described, there are very many more factors than one, and it’s part of why people should work as hard as they can to live peacefully with the parent of the children.  The complications of step families have never been, and can never be, dissolved.  They are real and biological.  The man who can raise another man’s child lovingly is a rare sort of saintly person.  I know they exist, but the mothers of those children should not take it for granted.  They’re going against  human nature, and the women SHOULD be extra sweet to them.  But not at the expensive of the security of the older child(ren).<br/>\n<br/>\nIt’s not going to be easy.  It’s a little late to say to the guy “if/then”—IF you want to be in a relationship with me, then you should take my son’s needs into consideration.  <br/>\n<br/>\nWould that be considered too strong a use of “should”?  But another baby is more than half processed for delivery.<br/>\n<br/>\nIF the relationship is going to be endangered, maybe it would make sense to let the older boy be with his dad more.   If the mom risks losing the second marriage over it, and having two children on her own, that’s a huge risk to take, and will not add to the security of either child.  And so it’s unreasonable to recommend that the older boy’s needs and wants come before anything else.<br/>\n<br/>\nBeause it cannot all be decided at once, because the relationship already solidly exists, then it’s okay to untangle it gently bit by bit.  The seven year old boy will be eight, and nine, and the situation is not static or solid.  The step dad will know him better and better, and so the mom should probably concentrate on smiles, nice food, smells, pleasant surroundings, and few conflicts.   This might be harder, with a new baby, and the mom should be super sweet and not totally controlling of the step dad’s actions concerning the boy, if she ever wants them to develop a friendship separate from her. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/control.html#spouses\">http://sandradodd.com/control.html#spouses</a><br/>\n(something about how and why to avoid controlling a spouse)<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":486569116,"authorName":"","from":"cheri.tilford@...","profile":"boobearcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Relationship between stepfather and stepson: issues and solutions","postDate":"1464968713","msgId":77145,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PG5pczhtOSt0bGFsYWJAWWFob29Hcm91cHMuY29tPg==","inReplyToHeader":"PDhCOTQ0NTZFLTNGQUItNDU1MS05OUI4LTc4NTQ3QjNEMUU5RkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDhCOTQ0NTZFLTNGQUItNDU1MS05OUI4LTc4NTQ3QjNEMUU5RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":77143,"nextInTopic":77147,"prevInTime":77144,"nextInTime":77146,"topicId":77143,"numMessagesInTopic":0,"msgSnippet":"It sounds to me like there are a lot of unspoken assumptions about how things should be. I wonder if these shoulds could be exposed and examined for","messageBody":"<div id=\"ygrps-yiv-14812824\">It sounds to me like there are a lot of unspoken assumptions about how things &quot;should&quot; be. I wonder if these &quot;shoulds&quot; could be exposed and examined for clarity and understanding?<div><br></div><div>Anytime I hear a should, whether from me or anyone I care about, I rephrase the sentence/question with either &quot;need&quot; or &quot;want&quot;, and if neither of those fits, the thought is likely from somewhere else, meant to shape behavior. Should is shaming, even if the actual word isn&#39;t used. Children should sit quietly at the table, socialize in a certain manner, sleep by themselves, use the potty by themselves by age 7. Why? Who says, and do you agree?</div><div><br></div><div>On a good day, maybe try talking about the assumptions each of you have for each other and your children. This could open up an avenue for conscious thinking and talking and living that could extend far beyond one conversation and ripple out positively to your children.&nbsp;</div><div><br></div><div>Your partner is an adult, responsible for himself. Your son is a small child, you are responsible for him. While ideally you will all be on the same team, in those moments you feel you have to choose sides, choose wisely. Better to explain yourself to your partner than your son.&nbsp;</div><div><br></div><div>cheers,</div><div>cheri</div></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Relationship between stepfather and stepson: issues and solutions","postDate":"1464900736","msgId":77143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhCOTQ0NTZFLTNGQUItNDU1MS05OUI4LTc4NTQ3QjNEMUU5RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":77145,"prevInTime":77142,"nextInTime":77144,"topicId":77143,"numMessagesInTopic":0,"msgSnippet":"This is brought anonymously.  It’s about relationships more than about unschooling, but perhaps unschooling principles could be poured on it. Anyone with any","messageBody":"<div id=\"ygrps-yiv-1146729339\">This is brought anonymously.  It’s about relationships more than about unschooling, but perhaps unschooling principles could be poured on it.  <br/>\nAnyone with any good idea, please post if you want to.  It’s too much for a full analysis by any one person, I think, but you might see something you think could be easily helped.<br/>\n________________________________<br/>\n<br/>\n<br/>\n<br/>\nI&#39;m 34 years old and I have a 7 year old boy from a past relationship. My son lives with me and his father lives in another country.<br/>\n<br/>\nMy partner is 52 years old and he has a 18 year old boy from his 30 year relationship. His son lives with his mother.<br/>\nWe are living at my place most of the time. He works 50 minutes from my house and he has an apartment there that he rents. His furniture is still there. We plan to move to a different house, together, as soon as we can afford a rent, because, at the moment I don&#39;t pay a rent. It&#39;s my mom&#39;s house, but small for two adults and two kids.<br/>\n<br/>\nI&#39;m 5 months pregnant from my partner and we are living beautiful moments about this pregnancy. Choosing the midwife together for the labour at home, reading about labour, going together to the doctor appointments, choosing the baby name. It has been a positive and intense experience for both. We both had never had an experience like this one, for different reasons.<br/>\n<br/>\nThe problem is that my partner has been complaining a couple of times about my son, specially when something goes wrong in own his life, for example, when something happens to his stuff (like the day his computer broke) or when his son doesn&#39;t call him for over a month, after he, the father, tried to contact him twenty times via sms and phone calls. Or, also, when my partner&#39;s mother gets upset with him because he doesn&#39;t do something she asked him to do. On those days he gets furious, a lot of anger, his eyes get red, he gets a headache and his blood pressure gets high. He can&#39;t dialog calmly. I usually get silent and wait for him to get relaxed. But my son will still talk with me and will cry, if he needs, about his own child things. This seems to be the last drop of water for my partner and he then explodes with my son. I get furious when he does this, but I don&#39;t say anything.<br/>\n<br/>\nHe can say some rude words to my son, like:<br/>\n- &quot;Things can&#39;t be exactly like the little kid wants!!!&quot;<br/>\n- &quot; It&#39;s not possible to install minecraft mods on the mackintosh computer, because this kind of computer is for work, not to play! I would never give my work computer to someone to play with! This is not a toy! People that want to play minecraft, must buy a chipper computer!&quot;<br/>\n- &quot; When we go to a place by car, we must come back by car as well!&quot; (we were coming home and my son was not comfortable at the car. He feels seasick at the car and he wants to get out in a few minutes.)<br/>\n<br/>\nLast Sunday was one of those days and when we came home, I was afraid that he would yell at my son, so I took my son rollerblading until 9pm.<br/>\n<br/>\nBesides that, my partner will play wrestling with my son, talk nicely to him, tell him nice stories, watch children movies with us, come with us to the children museum, buy him fruits he likes, help him with minecraft, when I&#39;m cooking, or cook for us, so I can play with my son; he will take him to the forest and beach, which he knows my son loves to go.<br/>\n<br/>\nSometimes my partner will tell me that he admires me as a mom and that my son has a lot of love, which he thinks is good and unique. And that he is proud that I will be the mother of his second child. He also tells me, sometimes, that he understands my son is a shy boy, that he is not an anti-social boy.<br/>\n<br/>\nOther times, when he&#39;s ok, when he isn&#39;t tense, he will tell me that he loves to be with me and my son, but at the same time that he feels annulled next to us. He says that my son rules the house and that I&#39;m annulled as well. He says he feels that he, my partner, has no presence at my place. He says that my son should sleep in his bedroom, that he should come to sit and eat at the table, sometimes without saying no first. He also says that he must eat what we cooked, even if he doesn&#39;t like it, and that he must come by car if an adult says so, instead of taking the subway with me. He said that my son must know that my partner is an adult, not a child and that he should respect him more, because at night sometimes my son asks for my hand or for my help to go to the bathroom and he wakes him up. He told me today that my son is anti-social and that because of that I should come to his mother&#39;s house without my son, which confused me because has had otherwise before. But his mother didn&#39;t complain about my son.<br/>\n<br/>\nOn the other hand, my son asked me why my partner is always here, with an upset face. I&#39;ve asked my son to come sometimes and sit at the table for dinner and also if he could make less noise at night, to which he answered that then he will change to another family. But, he also likes to play with my partner and talk with him, when both are happy with each other. Both can say, sometimes to me, that they like each other and that they are happy for that. My son is really happy about his little sister in my womb and can kiss my belly and talk to her many times a day.<br/>\n<br/>\nIn the middle of them, at the moment, I feel tense and a bit anxious to quickly find quickly the answer to have peace for both of them two and I want to have a connected family, which I had never had.<br/>\n<br/>\nI will talk about us for a bit, about our past:<br/>\n<br/>\nBefore me, my partner had been single for two years. Two years ago, he had ended a crazy two year relationship that sent him, in the end, to try to suicide himself. After that he went to the psychiatrist and took medicines for depression.<br/>\n<br/>\nBefore that crazy relationship, he had a 17 year peaceful marriage, plus 13 years of dating his ex-wife. He had his own business company and he was making good money at the time. Then a financial crisis came and he had to close his company. No money and they got divorced at the same time that the crisis happened.<br/>\n<br/>\nHe now has a simple job, which he likes but makes very little money from it. So we are both building our own company. He feels very motivated about that and he gives me a lot of good motivation and hope to work on it, since I&#39;m the main manager of it. He is very important to me on this work.<br/>\n<br/>\nBecause we are in the beginning, we&#39;re not making money yet. So we are living on a tight budget and with the help of both families. Sometimes, he feels so frustrated about not having enough money to pay for his things, that he can sleep all day and not feel like talking to anyone. A month ago, he was drinking 2 jars of wine, at dinner, at his place, alone. He is being more careful regarding wine consumption now, by himself, and he also took the initiative of going to therapy. It looks like he goes to therapy a bit upset but then he always comes smiling, when the session is over.<br/>\n<br/>\nThere are other days where he feels a lot of hope for our future financial condition, he says nice things to me, he brings me flowers, he cooks yummy food, he shows me things that he knows I like, he sends me music that I like, he writes me a lot of romantic texts, and he kisses me and hugs me a lot, and we can have 3 weeks one after the other, of peace.<br/>\n<br/>\nI see him as a sweet, romantic and lovely partner. At the same time with a very strong personality, leader&#39;s personality, having his own convictions about education and other issues. He is a very good professional as well, like a unique in our country. I have admired him professionally for many years.<br/>\n<br/>\nNow for me: <br/>\n<br/>\nBefore him, I tried to have a relationship a few times, and I always gave up on them, especially because it always looked like they wanted to order my son around and they set a lot of rules for him and punishments, even with his biological father. I didn&#39;t liked that and gave up.<br/>\n<br/>\nAbout my childhood, I only remember a few times that my parents were happy. Usually they were upset with each other, yelling. There were only a few times of peace at home and they could not understand and accept the differences between them. They got divorced when I was 7 years old.<br/>\n<br/>\nI&#39;ve been in therapy for a year now. I see myself as having a strong personality and with my own convictions about education, like my partner. I really believe that what I&#39;m doing is the best for my son and will be the best for our baby girl.<br/>\n<br/>\nWith him, with my partner now, I like to cook his favorite cakes and food. I try to always have the things he likes to eat and snack at home. I&#39;ve arranged a working space for him to have his own privacy. I try to make him feel comfortable and loved at my place or when we go out. I try not to bug him with too much talk and I read for him, things he likes. I also write him poetry, that he loves. I answer him when he calls me to talk.<br/>\n<br/>\nThe big difference from now and my previous relationships, is that we - my partner and I - love each other so much, we have been having so many beautiful moments together, laughing, talking, eating, sleeping while holding our hands, feeling our baby, talking to her. We also understand each other, in so many different aspects of life, that I really would like to manage this issue so we can all live in peace, preserving, at the same time, my son&#39;s happiness and the love that connects me and my partner.<br/>\n<br/>\nYour help is most welcome! So, thank you in advance!</div>","specialLinks":[]}],"prevTopicId":77161,"nextTopicId":77149}}