{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":17,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: exposure, and the follow-up","postDate":"1350413086","msgId":69391,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhFRUJDOTIzLTdFQTQtNEVCRS04OEIzLUNBRTdBNzY4REIwRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEQwMjQ5MDE0LUFFM0YtNDRBMC04QTlELTdDM0VCOTJCNzgwMkB5YWhvby5jb20+","referencesHeader":"PGs1aTVnNys0c2Z1QGVHcm91cHMuY29tPiA8RDAyNDkwMTQtQUUzRi00NEEwLThBOUQtN0MzRUI5MkI3ODAyQHlhaG9vLmNvbT4="},"prevInTopic":69388,"nextInTopic":69393,"prevInTime":69390,"nextInTime":69392,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"You could print this out and forward it to him: Disturbed by this, and uncomfortable myself, in the past I have disregarded whatever my BIL s feelings and","messageBody":"<div id=\"ygrps-yiv-1804622376\">You could print this out and forward it to him:  <br/>\n<br/>\nDisturbed by this, and uncomfortable myself, in the past I have disregarded whatever my BIL&#39;s feelings and simply removed my son from the situation with a quick apology and a &quot;he&#39;ll warm up after he&#39;s settled in&quot; (which is often the case). But in the last several months I&#39;ve been more aware of how that has hurt my brother in law, becoming a point of tension. It is very important to my husband to keep the peace as much as possible. I want to protect my son&#39;s boundaries, and I also want to take my brother in law&#39;s feelings into consideration. I am looking for suggestions on how to handle this situation in a way that is kind to them both- if that&#39;s possible.<br/>\n<br/>\nWe don&#39;t spend a lot of time with my in laws, they live an hour away, and we see them maybe once a month at family dinners or gatherings. I want to do what I can to help their limited interactions be positive experiences for them both, and shield my son from his uncle&#39;s unwelcome pushiness.<br/>\n<br/>\n--------<br/>\n<br/>\nOr you could e-mail him and ask him nicely to let your son express affection in his own way, when he&#39;s ready.    It might be better to make the request on the side, in writing, and give him time to think about it before the next in-person meeting.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":224796703,"authorName":"otherstar","from":"&quot;otherstar&quot; &lt;otherstar@...&gt;","profile":"casouthworth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: exposure, and the follow-up","postDate":"1350407275","msgId":69393,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDA3NjAwNUVCQUEwQjQyRDFCNjA2Q0U2MjE2OUNCM0QyQExhcHB5SFA+","inReplyToHeader":"PEQwMjQ5MDE0LUFFM0YtNDRBMC04QTlELTdDM0VCOTJCNzgwMkB5YWhvby5jb20+","referencesHeader":"PGs1aTVnNys0c2Z1QGVHcm91cHMuY29tPiA8RDAyNDkwMTQtQUUzRi00NEEwLThBOUQtN0MzRUI5MkI3ODAyQHlhaG9vLmNvbT4="},"prevInTopic":69391,"nextInTopic":0,"prevInTime":69392,"nextInTime":69394,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"... Depending on the age of your son, you may be able to hold him while you give the uncle hug for your son. I have done that in the past. I have a few family","messageBody":"<div id=\"ygrps-yiv-1075865901\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;&gt;&gt;I have a question about this- when we visit my in laws, my brother in <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;law is pretty demanding about my son giving him hugs and kisses (the <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;whole family is affectionate at greetings and partings) I can tell my <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;son is uncomfortable, and though he&#39;s not always verbal about it, he <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;turns away, hiding his face, sometimes saying or shouting no. This <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;leads my brother in law to be more pushy and demanding.&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n </span></blockquote>Depending on the age of your son, you may be able to hold him while you give <br/>\nthe uncle hug for your son. I have done that in the past. I have a few <br/>\nfamily members that tend to be pushy about hugs. I turn it into a bit of a <br/>\ngame that allows my child to NOT give a hug while still acknowledging the <br/>\nother person’s need for a hug. Also, depending on the age of the child, it <br/>\nhelps to talk about the hugging part in advance. Whenever we are going to <br/>\nsee my mom, I remind the girls that grandma is going to want a hug. <br/>\nSometimes we can talk about it in advance and come up with strategies such <br/>\nas a hand shake instead of a hug. Sometimes, the girls saying “Goodbye, I <br/>\nlove you.” will work instead of a hug. Sometimes, I can hold one of the <br/>\ngirls in one arm while giving the person a one armed hug with the other arm. <br/>\nI have also gotten a hug from my child and asked if I could give that hug to <br/>\nthe relative for them. Blowing kisses is another idea. Showing kids how to <br/>\nthrow hugs is another possibility. (Hug yourself and then throw your arms <br/>\nout like you are throwing the hug.)  Something else that I have done is beat <br/>\nthe other person to the hug bit. If I know it is time to say goodbye or <br/>\nhello, I will say something like, “Hey, who wants to give grandma/uncle/etc. <br/>\na hug?” Then, I will rush to be the first one to do it while being silly and <br/>\nsaying, “Me, me, me.” and giving the person a hug. : –)<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;We don&#39;t spend a lot of time with my in laws, they live an hour away, <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;and we see them maybe once a month at family dinners or gatherings. I <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;want to do what I can to help their limited interactions be positive <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;experiences for them both, and shield my son from his uncle&#39;s <br/>\n&gt;&gt;&gt;&gt;&gt;&gt;unwelcome pushiness.&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>I am not sure how old the child in question is but it sounds like he is <br/>\nstill rather young. Be the buffer between that pushiness. Hold your son. <br/>\nSpeak for him so he doesn’t feel cornered. All of my girls have gone through <br/>\nphases where they hated hugging anybody but me or their dad. During those <br/>\ntimes, I have put myself between my child and the person that was being <br/>\npushy. The key is to be lighthearted about it. I know that it is really easy <br/>\nfor the mamma bear instincts to kick in. If it is too stressful, maybe you <br/>\ncould skip a gathering or two. Or, another possibility is to invite the <br/>\nuncle to your house to get to know your son better. I have found that my <br/>\nkids are more comfortable showing affection to visitors when they are home. <br/>\nIt can be difficult for a child to get comfortable with somebody that they <br/>\nonly see once a month.<br/>\n<br/>\n<br/>\nConnie<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":420468373,"authorName":"Lisa Celedon","from":"Lisa Celedon &lt;lisajceledon@...&gt;","profile":"lisajceledon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: exposure, and the follow-up","postDate":"1350347859","msgId":69388,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQwMjQ5MDE0LUFFM0YtNDRBMC04QTlELTdDM0VCOTJCNzgwMkB5YWhvby5jb20+","inReplyToHeader":"PGs1aTVnNys0c2Z1QGVHcm91cHMuY29tPg==","referencesHeader":"PGs1aTVnNys0c2Z1QGVHcm91cHMuY29tPg=="},"prevInTopic":69384,"nextInTopic":69391,"prevInTime":69387,"nextInTime":69389,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-597486983\">&lt;&lt;&lt;&lt;<br/>\nand a big, big part of that comes from parents listening and trying to understand the child&#39;s perspectives in little, everyday things, like a child not wanting to wear a certain pair of socks, or not wanting to kiss Aunty, <br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>I have a question about this- when we visit my in laws, my brother in law is pretty demanding about my son giving him hugs and kisses (the whole family is affectionate at greetings and partings) I can tell my son is uncomfortable, and though he&#39;s not always verbal about it, he turns away, hiding his face, sometimes saying or shouting no.  This leads my brother in law to be more pushy and demanding.<br/>\n<br/>\nI understand my brother in law wants to feel loved by his nephew (he often makes comments to him like, someday I&#39;ll be your favorite because I&#39;ll let you do all the things your parents won&#39;t let you do (not sure what he means by that), or, &quot;One of these days you *will* love me!&quot;), but his pushiness is clearly unwelcome to my son.<br/>\n<br/>\nDisturbed by this, and uncomfortable myself, in the past I have disregarded whatever my BIL&#39;s feelings and simply removed my son from the situation with a quick apology and a &quot;he&#39;ll warm up after he&#39;s settled in&quot; (which is often the case). But in the last several months I&#39;ve been more aware of how that has hurt my brother in law, becoming a point of tension. It is very important to my husband to keep the peace as much as possible.  I want to protect my son&#39;s boundaries, and I also want to take my brother in law&#39;s feelings into consideration. I am looking for suggestions on how to handle this situation in a way that is kind to them both- if that&#39;s possible.<br/>\n<br/>\nWe don&#39;t spend a lot of time with my in laws, they live an hour away, and we see them maybe once a month at family dinners or gatherings.  I want to do what I can to help their limited interactions be positive experiences for them both, and shield my son from his uncle&#39;s unwelcome pushiness.<br/>\n<br/>\nThank you<br/>\n<br/>\nLisa<br/>\n<br/>\nSent from my iPhone<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Oct 15, 2012, at 4:16 PM, &quot;Meredith&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:plaidpanties666@...\">plaidpanties666@...</a>&gt; wrote:<br/>\n<br/>\n&gt; and a big, big part of that comes from parents listening and trying to understand the child&#39;s perspectives in little, everyday things, like a child not wanting to wear a certain pair of socks, or not wanting to kiss Aunty, </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: exposure, and the follow-up","postDate":"1350342983","msgId":69384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1aTVnNys0c2Z1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRDVwVTBzcnE4RjY9WVZ5Z0RSV1hNZ0JUQzIwMFYxSEptXzRnRzAyVnl1ODMraXlHUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69383,"nextInTopic":69388,"prevInTime":69383,"nextInTime":69385,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"... I don t think it s necessary or helpful to narrow it down to keeping secrets like that - it s Good when kids know they can trust their parents. It s good","messageBody":"<div id=\"ygrps-yiv-1767569201\">Emma Goldman-Sherman &lt;emmagoldmansherman@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; I didn&#39;t mean that parents should not have<br/>\n&gt; secrets from children, but children should not have secrets from parents,<br/>\n&gt; especially if another adult asks them to keep something secret.  I meant it<br/>\n&gt; only in the context of children being asked to keep things secret. <br/>\n<br/>\n </span></blockquote>I don&#39;t think it&#39;s necessary or helpful to narrow it down to &quot;keeping secrets&quot; like that - it&#39;s Good when kids know they can trust their parents. It&#39;s good when kids trust that their parents will listen and understand - and a big, big part of that comes from parents listening and trying to understand the child&#39;s perspectives in little, everyday things, like a child not wanting to wear a certain pair of socks, or not wanting to kiss Aunty, or not wanting to play with a neighbor. Some of building trust between parents and kids involves parents learning to take &quot;no&quot; as an answer from a child, and some comes from being sensitive to the unspoken &quot;nos&quot; - respecting a child&#39;s boundaries. <br/>\n<br/>\nAnd you get more than just trust! When kids know their boundaries are respected, then it&#39;s a Problem when they meet people who don&#39;t respect those bounaries, whether that be in an abuse situation, or a dare from friends, or a date. They know their boundaries are important and valuable, and those include emotional boundaries: they get better at trusting their own intuition as to when situations aren&#39;t what they should be. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: exposure, and the follow-up","postDate":"1350341035","msgId":69383,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1aTNqYis3ZzVnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRDVwVTB0Q1U3ZHljaFQyaytFZ01uUz1TdnA3NkZod3RVa2FuckpwNkNRNUhyT2szUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69382,"nextInTopic":69384,"prevInTime":69382,"nextInTime":69384,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"... ************** It would have been better to start there. It s not somehow dishonest to tone things down for people who don t want/need all the details,","messageBody":"<div id=\"ygrps-yiv-1172732626\">Emma Goldman-Sherman &lt;emmagoldmansherman@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; It would be best if your husband could also talk to your son about what<br/>\n&gt; happened in a general way (without being overly excited) in order  to show<br/>\n&gt; your son that sometimes bad things happen<br/>\n </span></blockquote>**************<br/>\n<br/>\nIt would have been better to start there. It&#39;s not somehow dishonest to tone things down for people who don&#39;t want/need all the details, it&#39;s kind and thoughtful. And if you start speaking more generally, you give your kid the option of asking for more information - you set him (or her) up to be able to decide how much is too much, and that&#39;s better than potentially crossing his boundaries in the name of &quot;honesty&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;we should not have any secrets<br/>\n&gt; (between children and parents), that children should know to come to a<br/>\n&gt; parent to tell them if anything happens to them or a friend of theirs that<br/>\n&gt; is of a &quot;private parts&quot; nature.<br/>\n<br/>\n </span></blockquote>The one does not necessarily set the stage for the other. If parents are dumping too much infomation on a kid who doesn&#39;t want it, it can lead a kid to shut down for self protection. It&#39;s important to be very, very sensitive to kids&#39; boundaries in this regard. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":351240414,"authorName":"Ann-Marie","from":"&quot;Ann-Marie&quot; &lt;annmariehorsley1@...&gt;","profile":"annmariehorsley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: exposure, and the follow-up","postDate":"1350271260","msgId":69382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1ZnZlcytmc28wQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI0OTZEMkZDLUM2ODctNEJBMy1CRTFFLUI3RTNERkMxQjdGNEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69380,"nextInTopic":69383,"prevInTime":69381,"nextInTime":69383,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"I couldn t agree with you more Sandra. When I was 8 my mum told me in some detail about my dad having an affair. I didn t even understand what sex was at that","messageBody":"<div id=\"ygrps-yiv-869442999\">I couldn&#39;t agree with you more Sandra. <br/>\n<br/>\nWhen I was 8 my mum told me in some detail about my dad having an affair. I didn&#39;t even understand what sex was at that stage. At 12 she told me all about the sexual abuse she suffered at the hands of her brother (some of it in quite graphic detail). I was the first person she told about it and was sworn to secrecy. Throughout my life my parents both shared far too much information with me about things which should have stayed personal and/or between them. It happened until I was old enough to understand that I could say no to them and was able to establish boundaries with them. <br/>\n<br/>\nIt affected me greatly including my ability to trust others in relationships and in my attitude towards and comfortableness with sex. It took a lot of therapy and personal effort to get past the negative effect it all had on me. Children can&#39;t always say what affect certain knowledge and experiences are having on them. They don&#39;t necessarily realise they can say no. Sometimes they listen and reply how they think you want them to. That&#39;s what I did. I was protecting my mum, protecting her feelings because I saw her as being very vulnerable and emotionally fragile. I felt responsible for her in some way. It was years before I understood the full extent of the damage my parents had done to me. They had no idea. My mum partly thought she was protecting me!<br/>\n<br/>\nI understand this is at the more extreme end of what we&#39;re discussing but I can genuinely say that there are things that children do not ever need to know about their parents, particularly things which disturb or harm their children&#39;s peace and sense of safety and security. Experiences or knowledge which would damage their sense of wholeness and negatively impact their relationships with others.<br/>\n<br/>\nAnn-Marie<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; -=-that we should not have any secrets<br/>\n&gt; (between children and parents), -=-<br/>\n&gt; <br/>\n&gt; There are LOTS of things parents know and do, regarding sexuality, that children should not know.<br/>\n&gt; <br/>\n&gt; It&#39;s not &quot;secrets&quot; to keep some private things private.<br/>\n&gt; <br/>\n&gt; It&#39;s not &quot;having a secret&quot; to shield a child from something he&#39;s too young to understand.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: exposure, and the follow-up","postDate":"1350245371","msgId":69380,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2QkFGRTZBLUY4NUMtNEIxOC1BNjE3LTFFMjBCNjRFODdCRUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEJCQTA1QzU3LUJEQUYtNDExQy05OUFCLTNDMzQ3RDkyQTU4RkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PENBRDVwVTBzcnE4RjY9WVZ5Z0RSV1hNZ0JUQzIwMFYxSEptXzRnRzAyVnl1ODMraXlHUUBtYWlsLmdtYWlsLmNvbT4gPEEwMDM4RjVGLTI2ODItNDFCRS1CRURGLUI0Q0REOEE0NEU3OUBjb21jYXN0Lm5ldD4gPEJCQTA1QzU3LUJEQUYtNDExQy05OUFCLTNDMzQ3RDkyQTU4RkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69379,"nextInTopic":69382,"prevInTime":69379,"nextInTime":69381,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"... I made an assumption that most people now know that. Not a good one to make! Robin B.","messageBody":"<div id=\"ygrps-yiv-1875568589\"><blockquote><span title=\"ireply\">&gt; It&#39;s good for parents to know that sexual abuse comes from friends  <br/>\n&gt; and relatives more than from strangers.<br/>\n&gt;<br/>\n </span></blockquote>I made an assumption that most people now know that. Not a good one to  <br/>\nmake!<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: exposure, and the follow-up","postDate":"1350245058","msgId":69379,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBDMjc1RUE3LUJDQzEtNDJFNC05NTJFLTYxMzA3NzlDNjIzMEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEEwMDM4RjVGLTI2ODItNDFCRS1CRURGLUI0Q0REOEE0NEU3OUBjb21jYXN0Lm5ldD4=","referencesHeader":"PENBRDVwVTBzcnE4RjY9WVZ5Z0RSV1hNZ0JUQzIwMFYxSEptXzRnRzAyVnl1ODMraXlHUUBtYWlsLmdtYWlsLmNvbT4gPEEwMDM4RjVGLTI2ODItNDFCRS1CRURGLUI0Q0REOEE0NEU3OUBjb21jYXN0Lm5ldD4="},"prevInTopic":69377,"nextInTopic":69380,"prevInTime":69378,"nextInTime":69380,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"... ...ready for them Robin B.","messageBody":"<div id=\"ygrps-yiv-1238005944\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; It&#39;s good to be aware, yes. It&#39;s best to be your child&#39;s partner in<br/>\n&gt; navigating difficult subjects, when they&#39;re ready for it (as with<br/>\n&gt; anything a child learns).<br/>\n<br/>\n<br/>\n </span></blockquote>...ready for &quot;them&quot;<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: exposure, and the follow-up","postDate":"1350244817","msgId":69377,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJCQTA1QzU3LUJEQUYtNDExQy05OUFCLTNDMzQ3RDkyQTU4RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEEwMDM4RjVGLTI2ODItNDFCRS1CRURGLUI0Q0REOEE0NEU3OUBjb21jYXN0Lm5ldD4=","referencesHeader":"PENBRDVwVTBzcnE4RjY9WVZ5Z0RSV1hNZ0JUQzIwMFYxSEptXzRnRzAyVnl1ODMraXlHUUBtYWlsLmdtYWlsLmNvbT4gPEEwMDM4RjVGLTI2ODItNDFCRS1CRURGLUI0Q0REOEE0NEU3OUBjb21jYXN0Lm5ldD4="},"prevInTopic":69376,"nextInTopic":69379,"prevInTime":69376,"nextInTime":69378,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"-=-We aren t talking about statistics here, though, on this list. We are talking about our real-life, in-person children with whom we are with pretty much 24","messageBody":"<div id=\"ygrps-yiv-1655951955\">-=-We aren&#39;t talking about statistics here, though, on this list. We are <br/>\ntalking about our real-life, in-person children with whom we are with <br/>\npretty much 24 hours a day (especially the younger ones).-=-<br/>\n<br/>\nYes, but no, about statistics.  <br/>\nIt&#39;s good for parents to know that sexual abuse comes from friends and relatives more than from strangers.<br/>\n<br/>\nBut more:  -=- But occasionally things do happen to children and mostly  (statistically speaking) in their own homes or with adults that they know.-=-<br/>\n<br/>\nNot always adults.  I don&#39;t think the statistic says it&#39;s more likely to be an adult than another child or a teen they know, possibly relatives who don&#39;t live in the home.<br/>\n<br/>\nThe top quote is Robin B.  I agree that we&#39;re talking (generally, about unschoolers) about young kids who are NOT out and about so much, not gone all day to school, not travelling alone in busses, not latchkey kids or kids cared for by others while parents are both at work.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: exposure, and the follow-up","postDate":"1350243905","msgId":69376,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwMDM4RjVGLTI2ODItNDFCRS1CRURGLUI0Q0REOEE0NEU3OUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PENBRDVwVTBzcnE4RjY9WVZ5Z0RSV1hNZ0JUQzIwMFYxSEptXzRnRzAyVnl1ODMraXlHUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRDVwVTBzcnE4RjY9WVZ5Z0RSV1hNZ0JUQzIwMFYxSEptXzRnRzAyVnl1ODMraXlHUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69375,"nextInTopic":69377,"prevInTime":69375,"nextInTime":69377,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"... We aren t talking about statistics here, though, on this list. We are talking about our real-life, in-person children with whom we are with pretty much 24","messageBody":"<div id=\"ygrps-yiv-1195419589\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; But occasionally things do happen to children and mostly  <br/>\n&gt; (statistically<br/>\n&gt; speaking) in their own homes or with adults that they know.  It is  <br/>\n&gt; really<br/>\n&gt; important that children know that they should not be keeping secrets  <br/>\n&gt; from<br/>\n&gt; adults, even secrets other adults ask them to keep.<br/>\n&gt;<br/>\n </span></blockquote>We aren&#39;t talking about statistics here, though, on this list. We are  <br/>\ntalking about our real-life, in-person children with whom we are with  <br/>\npretty much 24 hours a day (especially the younger ones).<br/>\n<br/>\nKids don&#39;t need to know all the details of what happens to their  <br/>\nparents, sexually or otherwise. A 7-year-old barely has context to  <br/>\nunderstand the motivation behind such an occurrence. Too much  <br/>\ninformation can be confusing to kids. And if parents get into the  <br/>\nhabit of offering too much for either a child&#39;s level of understanding  <br/>\nor their level of interest, eventually the parents get tuned out. &quot;La  <br/>\nla la, I&#39;m not listening...&quot;.<br/>\n<br/>\nIt&#39;s good to be aware, yes. It&#39;s best to be your child&#39;s partner in  <br/>\nnavigating difficult subjects, when they&#39;re ready for it (as with  <br/>\nanything a child learns). It&#39;s not helpful to be fearful and try to  <br/>\nmitigate every possible event.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: exposure, and the follow-up","postDate":"1350233542","msgId":69375,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU1ODk3MzkzLUU2RUMtNDIwNy05MDc4LUM4NzQwNTkxODU2MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRDVwVTBzcnE4RjY9WVZ5Z0RSV1hNZ0JUQzIwMFYxSEptXzRnRzAyVnl1ODMraXlHUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRDVwVTBzcnE4RjY9WVZ5Z0RSV1hNZ0JUQzIwMFYxSEptXzRnRzAyVnl1ODMraXlHUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69373,"nextInTopic":69376,"prevInTime":69374,"nextInTime":69376,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"-=-I am sorry I wasn t clear. I didn t mean that parents should not have secrets from children, but children should not have secrets from parents, especially","messageBody":"<div id=\"ygrps-yiv-425988580\">-=-I am sorry I wasn&#39;t clear. I didn&#39;t mean that parents should not have<br/>\nsecrets from children, but children should not have secrets from parents,<br/>\nespecially if another adult asks them to keep something secret. I meant it<br/>\nonly in the context of children being asked to keep things secret. I am<br/>\nsorry if it looked like I meant that parents should share everything.-=-<br/>\n<br/>\nEvery post to this discussion should be as clear as possible, and should be aimed at and coming from an unschooling perspective.  There&#39;s an ocean of free information one click away fro here.  THIS discussion, though, is special and particular.<br/>\n<br/>\nPosts for this list need to fulfill at least one of these criteria:<br/>\n<br/>\nhelps lots of people understand unschooling<br/>\nasks a question that actually needs an answer<br/>\nrequests help seeing different aspects of a situation<br/>\nhelps people have more peaceful and joyful lives (helps lots of people on the list)<br/>\nALL posts should be<br/>\nhonest<br/>\nproofread<br/>\nsincere<br/>\nclear<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/lists/alwayslearningPOSTS\">http://sandradodd.com/lists/alwayslearningPOSTS</a><br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359725273,"authorName":"Emma Goldman-Sherman","from":"Emma Goldman-Sherman &lt;emmagoldmansherman@...&gt;","profile":"scottsemma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: exposure, and the follow-up","postDate":"1350231785","msgId":69373,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRDVwVTBzcnE4RjY9WVZ5Z0RSV1hNZ0JUQzIwMFYxSEptXzRnRzAyVnl1ODMraXlHUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69372,"nextInTopic":69375,"prevInTime":69372,"nextInTime":69374,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"I am sorry I wasn t clear.  I didn t mean that parents should not have secrets from children, but children should not have secrets from parents, especially if","messageBody":"<div id=\"ygrps-yiv-726123697\">I am sorry I wasn&#39;t clear.  I didn&#39;t mean that parents should not have<br/>\nsecrets from children, but children should not have secrets from parents,<br/>\nespecially if another adult asks them to keep something secret.  I meant it<br/>\nonly in the context of children being asked to keep things secret.  I am<br/>\nsorry if it looked like I meant that parents should share everything.<br/>\n<br/>\nClearly something big was happening while the child was waiting for his<br/>\nfather, and clearly the father was upset when he got into the car and then<br/>\ntalked about it over dinner with the child quite nearby.  The mom&#39;s impulse<br/>\nwas to try to explain it, and I don&#39;t think that is wrong.  I think it is<br/>\nthe beginning of an important dialogue about how to protect oneself in the<br/>\nworld.  I don&#39;t think it is too young for a seven year old to understand.<br/>\n<br/>\nHere in NYC we have self-defense classes that begin at six years old for<br/>\nchildren in the elementary schools that are lucky to have the program, and<br/>\nI only know about it because I sought out such a class for my own son and<br/>\nhis homeschooled friends after my son was abused (long story).<br/>\n<br/>\nThe program I found and highly recommend (www.prepareinc.com) is fond of<br/>\nGavin de Becker&#39;s &lt;&lt;Protecting the Gift&gt;&gt; which is a book that puts the<br/>\ndangers we face today in proportion, because they are not out there around<br/>\nevery corner and being reactionary will only frighten children<br/>\nunnecessarily.  I am not advocating that type of behavior.<br/>\n<br/>\nBut occasionally things do happen to children and mostly (statistically<br/>\nspeaking) in their own homes or with adults that they know.  It is really<br/>\nimportant that children know that they should not be keeping secrets from<br/>\nadults, even secrets other adults ask them to keep.<br/>\n<br/>\n-- <br/>\nBarbara &quot;Emma&quot; Goldman-Sherman<br/>\n<br/>\nNB:  This email is not monitored regularly, so if you need a prompt reply,<br/>\nplease call me at 212-544-2367.  Thank you.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: exposure, and the follow-up","postDate":"1350226174","msgId":69372,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1ZWpkdStlc2h1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRDVwVTB0Q1U3ZHljaFQyaytFZ01uUz1TdnA3NkZod3RVa2FuckpwNkNRNUhyT2szUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69368,"nextInTopic":69373,"prevInTime":69371,"nextInTime":69373,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"==I think it is commendable that you were so honest with your son.== I would not have shared that much with my young child. It s too scary, I think. It was","messageBody":"<div id=\"ygrps-yiv-1105837840\">==I think it is commendable that you were so honest with your son.==<br/>\n<br/>\nI would not have shared that much with my young child. It&#39;s too scary, I think. It was possible to say that someone bothered Daddy without going into the details about what happened. <br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: exposure, and the follow-up","postDate":"1350176827","msgId":69368,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI0OTZEMkZDLUM2ODctNEJBMy1CRTFFLUI3RTNERkMxQjdGNEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRDVwVTB0Q1U3ZHljaFQyaytFZ01uUz1TdnA3NkZod3RVa2FuckpwNkNRNUhyT2szUUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PENBRDVwVTB0Q1U3ZHljaFQyaytFZ01uUz1TdnA3NkZod3RVa2FuckpwNkNRNUhyT2szUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69367,"nextInTopic":69372,"prevInTime":69367,"nextInTime":69369,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"-=-that we should not have any secrets (between children and parents), -=- There are LOTS of things parents know and do, regarding sexuality, that children","messageBody":"<div id=\"ygrps-yiv-1182865706\">-=-that we should not have any secrets<br/>\n(between children and parents), -=-<br/>\n<br/>\nThere are LOTS of things parents know and do, regarding sexuality, that children should not know.<br/>\n<br/>\nIt&#39;s not &quot;secrets&quot; to keep some private things private.<br/>\n<br/>\nIt&#39;s not &quot;having a secret&quot; to shield a child from something he&#39;s too young to understand.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":359725273,"authorName":"Emma Goldman-Sherman","from":"Emma Goldman-Sherman &lt;emmagoldmansherman@...&gt;","profile":"scottsemma","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: exposure, and the follow-up","postDate":"1350175762","msgId":69367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRDVwVTB0Q1U3ZHljaFQyaytFZ01uUz1TdnA3NkZod3RVa2FuckpwNkNRNUhyT2szUUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":69363,"nextInTopic":69368,"prevInTime":69366,"nextInTime":69368,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"I think it is commendable that you were so honest with your son.  Even though he is only seven years old, he would have known that something happened, and","messageBody":"<div id=\"ygrps-yiv-559759981\">I think it is commendable that you were so honest with your son.  Even<br/>\nthough he is only seven years old, he would have known that something<br/>\nhappened, and speculating might only lead to further fear and unknowing.<br/>\n<br/>\nIf we learn anything from the Penn State scandals of sex abuse and other<br/>\nsituations like this, I think it could be that being open about the<br/>\npossibility of sex abuse is important, that we should not have any secrets<br/>\n(between children and parents), that children should know to come to a<br/>\nparent to tell them if anything happens to them or a friend of theirs that<br/>\nis of a &quot;private parts&quot; nature.<br/>\n<br/>\nIt would be best if your husband could also talk to your son about what<br/>\nhappened in a general way (without being overly excited) in order to show<br/>\nyour son that sometimes bad things happen, but we can overcome them and<br/>\ndeal with them in healthy ways by getting support from our loved ones,<br/>\ndoctors/therapists, and when necessary the police, etc.  If there are<br/>\nmemories that bother us, we discuss them, etc.<br/>\n<br/>\nBe well, Emma<br/>\n<br/>\n-- <br/>\nBarbara &quot;Emma&quot; Goldman-Sherman<br/>\n<br/>\nNB:  This email is not monitored regularly, so if you need a prompt reply,<br/>\nplease call me at 212-544-2367.  Thank you.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] exposure, and the follow-up","postDate":"1350102191","msgId":69363,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIxN0NBOEQ3LTlDMEYtNDBFRC05MDNBLUI1NkJBRTJDRjkzMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs1YW80bCszc25rQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1YW80bCszc25rQGVHcm91cHMuY29tPg=="},"prevInTopic":69362,"nextInTopic":69367,"prevInTime":69362,"nextInTime":69364,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"-=-When Woody, my almost-7 year old, asked what was keeping his dad, I told him that a man had pushed his penis toward daddy in the bathroom, and that that s","messageBody":"<div id=\"ygrps-yiv-1543081510\">-=-When Woody, my almost-7 year old, asked what was keeping his dad, I told him that a man had pushed his penis toward daddy in the bathroom, and that that&#39;s not what people do, that people don&#39;t show each other their private parts in the bathroom and certainly don&#39;t ask or try to force anyone else to touch them. I said it was against the law because people needed to know they were safe and could have some privacy while going to the bathroom.-=-<br/>\n<br/>\nThat seems a lot to have said to a boy so young.<br/>\n<br/>\nMaybe after a day or so you could gently, privately, say you&#39;re sorry you said so much, and that most people go their whole lives without anything like that happening to him.  Otherwise he might become fearful of public restrooms and other people and such.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":177967425,"authorName":"teresa","from":"&quot;teresa&quot; &lt;treesock@...&gt;","profile":"treesock","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"exposure, and the follow-up","postDate":"1350099925","msgId":69362,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1YW80bCszc25rQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":69363,"prevInTime":69361,"nextInTime":69363,"topicId":69362,"numMessagesInTopic":0,"msgSnippet":"My husband works at a university library, and today while he was in the stall a man flagrantly exposed himself and propositioned him, from beneath the adjacent","messageBody":"<div id=\"ygrps-yiv-260733725\">My husband works at a university library, and today while he was in the stall a man flagrantly exposed himself and propositioned him, from beneath the adjacent stall door. It was unsettling to my husband to say the least, and he ended up making a police report. <br/>\n<br/>\nAll this happened while my two sons and I were waiting in the parking lot to pick him up for lunch. Through texts, I had an idea of what had happened, and I thought it best to continue to wait so that my husband could get a chance to leave campus and get some emotional support. When Woody, my almost-7 year old, asked what was keeping his dad, I told him that a man had pushed his penis toward daddy in the bathroom, and that that&#39;s not what people do, that people don&#39;t show each other their private parts in the bathroom and certainly don&#39;t ask or try to force anyone else to touch them. I said it was against the law because people needed to know they were safe and could have some privacy while going to the bathroom.<br/>\n<br/>\nIt was the best I could come up with at the time, though I worried maybe that the take-away message would be more about penises being dangerous than about the boundary-crossing. Woody listened wide-eyed while I told the story, but didn&#39;t say anything. He&#39;s a very socially aware and sensitive kid.<br/>\n<br/>\nWhen my husband got into the car, he was still processing what had happened, but in a way that was cognizant of our two boys being in the back seat. Still, I think the mood in the car was probably obviously jangled, upset, shaken up, etc. But, we went and got our lunch together, and ate it happily with only a few side comments and conversations here and there as my husband initiated them with me.<br/>\n<br/>\nI wanted to revisit the information with Woody, briefly, to make sure he knew the door was open for questions or worries or checking understanding. But I thought maybe he would want to know he could talk to his dad about it, too, so I asked my husband if he&#39;d be willing to do the check-in. He did, but Woody wasn&#39;t interested in talking. In fact, he walked away and pretended not to hear my husband ask. <br/>\n<br/>\nMy instinct is to drop it, to trust that he has some information to work with, that he&#39;s seeing his dad process the trauma in healthy ways--talking to me, telling stories about having talked to co-workers and the police, etc. (Just to be clear, this talking is happening in the background, not in ways that involve Woody.) I&#39;m thinking that it will either percolate up later when he does have questions or feel comfortable talking about it, or something in the future will make an obvious connection to this incident and it will come up naturally. Or, maybe not at all. <br/>\n<br/>\nBut, I&#39;m not clear on what he understood from the event, and I&#39;m worried he may be sitting with some big, difficult ideas.<br/>\n<br/>\nThanks for any insight,<br/>\n<br/>\nTeresa<br/>\nMama to Woody, almost 7, and Fox, close to 4</div>","specialLinks":[]}],"prevTopicId":69389,"nextTopicId":69394}}