{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"DiamondAir","from":"&quot;DiamondAir&quot; &lt;diamondair@...&gt;","replyTo":"LIST","senderId":"p56T0s0yxsYNCaYCJNgR8ixRWedgHIIV7bSW37Wgi3fbNAvV637JwbV02BcYYrOrRdxzkS-M1w9V41HXE62945PxV0Sm1YhUmrd6Q34d","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Challenging kids, was Re: Disciplining toddlers","postDate":"989510595","msgId":21054,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDkwMWMwZDk2YSRmM2MwNGEwMCRkYWQzMGUzZkA4MzhmMzAxPg==","referencesHeader":"PDk4OTQyNjgzNy41NTU3Ljk1ODEzLmw4QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":21053,"nextInTime":21055,"topicId":21054,"numMessagesInTopic":0,"msgSnippet":"... My heart goes out to you Nanci as we have been down some of the same path with our own son (who is also 4 1/2). One thing I can tell you is that when we","messageBody":"<div id=\"ygrps-yiv-910763852\"><blockquote><span title=\"ireply\">&gt;    From: Nanci Kuykendall &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aisliin@...\">aisliin@...</a>&gt;<br/>\n&gt; I guess I should post on this thread, since I<br/>\n&gt; inadvertantly started it with my thread on dubious<br/>\n&gt; &quot;expert advice&quot;.  Many of you know that I have an<br/>\n&gt; eldest son with many challenges that make him a daily<br/>\n&gt; struggle to raise.  I am not certain from whence all<br/>\n&gt; his problems stem, but we know that he has agression<br/>\n&gt; and anger management issues, patience and attention<br/>\n&gt; span limitations, self control problems and explosive<br/>\n&gt; emotions, multiple severe allergies, asthma, eczema,<br/>\n&gt; and other issues.  He is a bright child, and a joy<br/>\n&gt; sometimes, with a hyperactive imagination and a<br/>\n&gt; charming sense of humor.  Most folks tell us that we<br/>\n&gt; are models of patience (which I often feel the<br/>\n&gt; opposite of) and that we are wonderful parents doing<br/>\n&gt; our best with a difficult child (when I often feel<br/>\n&gt; like the worst kind of miserable failure with him).<br/>\n&gt; My son right now is four and a half years old and we<br/>\n&gt; are struggling daily with the issue of potty training.<br/>\n<br/>\n<br/>\n </span></blockquote>My heart goes out to you Nanci as we have been down some of the same path<br/>\nwith our own son (who is also 4 1/2). One thing I can tell you is that when<br/>\nwe finally got the food allergy issues straightened out, so much else<br/>\nmagically fell into line too that we were amazed. He instantly potty<br/>\ntrained, I could brush his teeth or his hair without a major battle, he<br/>\nwould go into a swimming pool willingly, go down slides and on swings, was<br/>\nable to wear different kinds of clothes (he has been extremely sensitive to<br/>\ntextures, sounds, tastes, smells his whole life) so many things he had never<br/>\ndone before! In his case, most of his issues were centered around the whole<br/>\nsensory integration issue, and the resulting motor coordination problems.<br/>\nOnce those became straightened out, he had so much incredibly less<br/>\nfrustrations in his daily life, and overstimulation, that everything else<br/>\njust seemed to even out too.<br/>\n<br/>\nIf you haven&#39;t read them already, I found the following books to be<br/>\nexceedingly helpful and important in our road to healing:<br/>\n<br/>\n&quot;The Out-of-sync Child&quot; (don&#39;t forget the hyphens if you&#39;re doing a search<br/>\nfor this book) - about sensory integration<br/>\n&quot;Is This Your Child&quot; - about how food allergies affect everything in a<br/>\nperson&#39;s life<br/>\n&quot;Say Goodbye to Illness&quot; and &quot;Say Goodbye to Allergy-related Autism&quot; - about<br/>\nNAET practices (which has been our saving grace), written by Dr. Nambudripad<br/>\n<br/>\nLastly, on the potty training, I know how difficult it is to have a child<br/>\nwho is 4 and not able to control their bowels/bladder. So many people think<br/>\nthey need to give well-meaning advice on this issue when they see a 4 year<br/>\nold in diapers. And it begins to be emotionally telling on the child as<br/>\nwell, once he realizes that this is &quot;different&quot;. If your child has no<br/>\ncontrol, daily battles are not going to change that, and only result in<br/>\nheartbreak. For us, the potty issue was directly linked to the allergies, so<br/>\nif you can find a way to alleviate the allergies, it might just magically<br/>\nresolve itself. For us, that meant eliminating almost every food source on<br/>\nearth it seemed, until we could get things under control. Then we started<br/>\nthe NAET treatments and have been able to add the foods back, a bit at a<br/>\ntime, with no adverse effects. That&#39;s just my experience, in case it helps!<br/>\nBest of luck to you!!!!<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I can sympathise with Eileen, in her quest to deal<br/>\n&gt; with a child with no fear of danger, as I had one too.<br/>\n<br/>\n<br/>\n </span></blockquote>I sympathize as this is my daughter to a &quot;T&quot;, at 18 months I found her<br/>\nswinging from a chandelier in the dining room. It was also me as a child, so<br/>\nI feel really sorry for my parents! They were always taking me to the<br/>\nemergency room, and these days probably would&#39;ve received a visit or two<br/>\nfrom CPS. I&#39;ve broken 13 bones and gotten over 300 stitches in my life. And<br/>\nnow that I&#39;m a &quot;responsible&quot; adult, my passions are things like skydiving,<br/>\nLOL. I guess sometimes we don&#39;t totally grow out of it :-). I also have to<br/>\nrun my body *hard* every day or I have too much energy and I literally<br/>\njitter to pieces and can&#39;t sleep. So I understand to a certain extent what<br/>\nthese kids need and crave - it was me as a child and it still is today. I<br/>\nalso understand that when people say &quot;kids will learn their limits&quot; that<br/>\nthis isn&#39;t always strictly true. Some people have a hard time feeling their<br/>\nlimits and this can be both a good and a bad thing. Being in the world of<br/>\nskydiving, I&#39;ve come into contact with quite a few of these people :-).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If he didn&#39;t want to be in a<br/>\n&gt; cart or his stroller (and believe me, we had plenty of<br/>\n&gt; battles over it) we didn&#39;t go.  I spent a lot of time<br/>\n&gt; at home his first three years<br/>\n<br/>\n </span></blockquote>Ah, this sounds familiar. There was quite a time period where<br/>\ngrocery shopping was just impossible for us. My son was *not* into being<br/>\nrestrained. I don&#39;t think he has ever ridden in a grocery cart, LOL! I used<br/>\nto see other kids riding in the fronts of the carts and wonder how the heck<br/>\ntheir parents got them to do that. My DH got good at shopping at nighttime<br/>\nwith my illegible lists :-)<br/>\n<br/>\n<br/>\nBlue Skies!<br/>\n   -Robin-<br/>\nMom to Mackenzie (8/28/96) inventer of new and wonderful things<br/>\nand Asa (10/5/99) singer of protest songs<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/the_clevengers\">http://www.geocities.com/the_clevengers</a>   Flying Clevenger Family</div>","specialLinks":[]}],"prevTopicId":20928,"nextTopicId":20925}}