{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":61,"messages":[{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093264176","msgId":98749,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzkwMWM0ODkwYyRkYjJmYzNkMCQzZWFlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDAwMTYwMWM0ODdhZCQ5MzAzODU3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4gPDAwMGUwMWM0ODdiZSQxNGVjYjY1MCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+IDwwMTBkMDFjNDg3Y2QkMTFlMGZmMjAkMWNhZWNlZDFAaGVyb25vZmZpY2U+IDwwMDEyMDFjNDg3ZDckYzE2ZDIzMTAkMDIwMWE4YzBAa3Jpc3RlbnNjb21wdXRlPg=="},"prevInTopic":98748,"nextInTopic":98750,"prevInTime":98748,"nextInTime":98750,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-38643714\">&lt;&lt;Are you saying that my kids are asking for tv because it annoys me?  I<br/>\ndon&#39;t<br/>\nthink this is the case.&gt;&gt;<br/>\n<br/>\nOh, no, of course not.  I was thinking that if they sense your disapproval,<br/>\nthen they too are going to be conflicted, and are not really making choices<br/>\nof their own then.  I was thinking that maybe it was prolonging their need<br/>\nto &#39;test boundaries&#39;.  Just a thought though.<br/>\n<br/>\nBut I also wonder if that isn&#39;t the case with most of the things you are<br/>\nfinding frustrating.<br/>\n===================<br/>\n<br/>\nIt could be that my kids just haven&#39;t had a long enough time without limits<br/>\non tv and sweets, etc and real freedom to trust me fully and to get some of<br/>\nthat stuff out of the systems a bit, so it&#39;s not so important to them.  I&#39;m<br/>\nfinding it difficult to balance my emotions on this.<br/>\n<br/>\nOn the one hand, I want them to make their own choices  On the other hand,<br/>\nI&#39;m afraid that even my hope of them doing these things is causing<br/>\ndiscontent in our household and certainly in my heart.  Is it wrong to also<br/>\nhope they&#39;ll NOT want to eat so much food, sugary and otherwise, that has<br/>\nlittle or no nutritional value, and NOT want to watch tv to the exclusion of<br/>\nso many other things?  How can I balance my desire to see them physically<br/>\nhealthy with my desire for them to be emotionally healthy?<br/>\n<br/>\n~Andrea</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093263408","msgId":98748,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNzIwMWM0ODkwYiQxMTk0ZGE3MCQzZWFlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDE0LjMxN2JlNTliLjJlNTkzNWQyQGFvbC5jb20+"},"prevInTopic":98746,"nextInTopic":98749,"prevInTime":98747,"nextInTime":98749,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"I think if you have bad  (tv)*associations with a former roommate and ex husband you should get through and over those issues so they don t affect your","messageBody":"<div id=\"ygrps-yiv-723854298\">I think if you have bad  (tv)*associations with a former roommate and ex<br/>\nhusband you should get through and over those issues so they don&#39;t affect<br/>\nyour children.<br/>\n============<br/>\n<br/>\n*parenthesis mine<br/>\nI don&#39;t think I learned to to be annoyed by tv in the daytime, or whatever,<br/>\nbecause of my former roommate or ex husband.  If I have tv issues, they<br/>\nexisted before these people were in my life.  I just used these examples to<br/>\nillustrate that my annoyance with tv in the daytime existed  and it existed<br/>\nbefore I had kids even and therefore I do not believe my issue with tv is<br/>\nsimply an issue involving the need to control them.<br/>\n<br/>\nThat said, I do beleive that concern for them  and their health, etc...<br/>\ndrives some--alot--of my irritation.  Before their interest in watching,<br/>\nthey played and played, and I liked that better.  I realize this is an issue<br/>\nI need to work on.  Still, it is hard for me to tolerate the tv my own self,<br/>\nwhen I lift the limits.  I&#39;m working on this now.<br/>\n<br/>\n~Andrea<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, August 21, 2004 4:33 PM<br/>\nSubject: Re: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n<br/>\n<br/>\n&gt; In a message dated 8/21/2004 4:26:22 PM Mountain Daylight Time,<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a> writes:<br/>\n&gt; Are you saying that my kids are asking for tv because it annoys me?  I<br/>\ndon&#39;t<br/>\n&gt; think this is the case.<br/>\n&gt; --------------<br/>\n&gt;<br/>\n&gt; I don&#39;t think anyone was suggesting that, but if you&#39;re being cranky and<br/>\n&gt; critical they&#39;ll feel it.<br/>\n&gt;<br/>\n&gt; -=-Watching the same shows over and over again is really boring to me-=-<br/>\n&gt;<br/>\n&gt; Then don&#39;t watch them with them every time.<br/>\n&gt;<br/>\n&gt; Will you read a book you&#39;ve read before?  Listen to music you&#39;ve heard<br/>\n&gt; before?  It&#39;s no different.  There is MORE input in a movie than either a<br/>\nbook or a<br/>\n&gt; recording, so if they like it and really want to process and know it all,<br/>\nthey<br/>\n&gt; will watch it over and over before they know all the lines and the songs.<br/>\n&gt; That&#39;s studying &lt;g&gt;.<br/>\n&gt;<br/>\n&gt; -=-and, YES, I&#39;m<br/>\n&gt; dissappointed that they&#39;d rather do that than something more interactive<br/>\n&gt; with me.<br/>\n&gt; -=-<br/>\n&gt;<br/>\n&gt; I used to be disappointed if Kirby wasn&#39;t interested in something I was<br/>\n&gt; interested in, but I&#39;m glad I got over it, because honestly it was selfish<br/>\non my<br/>\n&gt; part, and a kind of distracted immaturity.  Everything went better when I<br/>\n&gt; learned how to follow his interests, and find things he wanted to do.<br/>\nWhen he was<br/>\n&gt; excited, I was excited.  When I was sad, and he was sad, there was just a<br/>\nbig<br/>\n&gt; wad of sadness.<br/>\n&gt;<br/>\n&gt; -=-I believe the tv is partly to blame for the irritableness and short<br/>\n&gt; -tempers<br/>\n&gt; around here.-=-<br/>\n&gt;<br/>\n&gt; I think if you have bad associations with a former roommate and ex husband<br/>\n&gt; you should get through and over those issues so they don&#39;t affect your<br/>\nchildren.<br/>\n&gt;  That might sound harsh, but really...  if you&#39;re outnumbered and haven&#39;t<br/>\n&gt; offered a more enticing alternative, they want to watch TV at their house.<br/>\nMaybe<br/>\n&gt; you can get a walkman and listen to birdsons or soothing music with<br/>\n&gt; headphones.  If they want you they can come tug your pants if you don&#39;t<br/>\nsee them.  You<br/>\n&gt; would hear them call you over white-noise tapes or soothing tapes.<br/>\n&gt;<br/>\n&gt; -=-This is too simplistic.  The apple hasn&#39;t become more important than my<br/>\n&gt; kids.  It wouldn&#39;t have mattered what food it was, a bowl of ice cream or<br/>\n&gt; some cookies and milk or broccolli and dip or apples, I would still have<br/>\n&gt; been equally annoyed if she asked and I prepared and served and she<br/>\ndecided<br/>\n&gt; she was too full and then 20 minutes later asked me for something<br/>\nlse.  -=-<br/>\n&gt;<br/>\n&gt; You  need to get over that, then.<br/>\n&gt; It used to really bother my husband if he made food and people din&#39;t like<br/>\nit.<br/>\n&gt;  But he was making things HE liked, and giving people big servings.  He<br/>\ngot<br/>\n&gt; over it and everything&#39;s better.  What he does now is announce if food&#39;s<br/>\nready,<br/>\n&gt; wait a while, and pack up leftovers into individual packages.  If it&#39;s not<br/>\n&gt; eating in the next day or so  he takes them to work for lunches.  I tend<br/>\nto only<br/>\n&gt; make what i know someone wants or likes.  Kirby doesn&#39;t like pork, so we<br/>\nhave<br/>\n&gt; it when he&#39;s not home.  Holly likes spinach.  The boys don&#39;t. If it&#39;s just<br/>\n&gt; me, Keith and Holly, we have spinach merrily together!<br/>\n&gt;<br/>\n&gt; We had to get loose, flexible, expecting happiness.<br/>\n&gt;<br/>\n&gt; -= It seems to me that my children are<br/>\n&gt; becoming more dissatisfied rather than less so as I pull away limits.  I<br/>\n&gt; really do want to give them more choice and I want to accept their choices<br/>\n&gt; with equal grace, but I don&#39;t want to be around demanding children who<br/>\ncan&#39;t<br/>\n&gt; be pleased. -=-<br/>\n&gt;<br/>\n&gt; Don&#39;t do it if it&#39;s not working.<br/>\n&gt; You might do better with the rules.  If you don&#39;t want to change or you<br/>\ndon&#39;t<br/>\n&gt; think it will work, change course.  We can&#39;t guarantee you anything.<br/>\nWe&#39;re<br/>\n&gt; offering options, but you don&#39;t have to choose any of them at all.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Why isn&#39;t this working!?","postDate":"1093246517","msgId":98746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNWUwMWM0ODhlMyRiZGQ1OGZhMCQzZWFlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PGNnYzUzcSs2ZnMyQGVHcm91cHMuY29tPg=="},"prevInTopic":98745,"nextInTopic":98748,"prevInTime":98745,"nextInTime":98747,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"... Well, I don t know what we d come up with, actually, because I don t have their input.  I think the way I might bring this up with them would be to say to","messageBody":"<div id=\"ygrps-yiv-879503296\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; I&#39;d be afraid that not being allowed to watch in the morning would<br/>\n&gt; make them look so forward to afternoon tv time that they would watch<br/>\n&gt; every afternoon just because they&#39;re allowed to then.    If there<br/>\n&gt; were no limits, they might choose not to watch some afternoons<br/>\n&gt; though.<br/>\n&gt;<br/>\n&gt; Sheila<br/>\n<br/>\n </span></blockquote>Well, I don&#39;t know what we&#39;d come up with, actually, because I don&#39;t have<br/>\ntheir input.  I think the way I might bring this up with them would be to<br/>\nsay to them, &quot;Girls, I know you really like watching movies and I want you<br/>\nto be able to do that and enjoy it.  Some days for me it seems like the tv<br/>\non all day and that starts to bother me.  How can we work it out so that you<br/>\nfeel good about being able to watch movies and I feel good about being able<br/>\nto have some quiet time each day?  Do you have any ideas?&quot;  And then we&#39;d<br/>\nbrainstorm, taking all ideas seriously and being flexible enough to change a<br/>\nplan if it didn&#39;t work out well.<br/>\n<br/>\nPerhaps we&#39;d end up having no limits, but they&#39;d be willing to wait<br/>\nsometimes, when I&#39;m having a particular need for quiet. You know...deal with<br/>\nit as it comes up.  At least we&#39;d all be more aware of everyone else&#39;s needs<br/>\nand concerns, and that would help us all be more patient and understanding<br/>\nregarding this issue.  I also plan to work on adjusting my attitude<br/>\nregarding the tv, because it&#39;s clearly an issue for me...and I don&#39;t think<br/>\nit should be as big an issue as it is.<br/>\n<br/>\n~Andrea</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093245687","msgId":98745,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTcwMWM0ODhlMSRjZWFiMmJjMCQzZWFlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDAwMTYwMWM0ODdhZCQ5MzAzODU3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4gPDQxMjdDMTQzLjEwMDA4MDhAY29tY2FzdC5uZXQ+"},"prevInTopic":98744,"nextInTopic":98746,"prevInTime":98744,"nextInTime":98746,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"Try to organize your house to make your life and your job as easy as possible; do the same for the kids. Shortcuts are extremely valuable with young kids.","messageBody":"<div id=\"ygrps-yiv-805849565\">Try to organize your house to make your life and your job as easy as<br/>\npossible; do the same for the kids. Shortcuts are extremely valuable with<br/>\nyoung kids. Focus your priorities on living joyfully and easily together.<br/>\n==============<br/>\n<br/>\nThis is great advice that I can never hear enough of, because even though I<br/>\nknow it too be true, I get lost in the fray sometimes and can forget how<br/>\nsimply changing something that&#39;s not working can really help.  Today,<br/>\ninstead of griping at my 4 yo daughter about her clothes being on the living<br/>\nroom floor again, I added another wicker basket to the living room for<br/>\nclothes (we already have 2--one for books and one for toys).  My girls often<br/>\nstrip down naked to play in the pool, and their clothes end up on the living<br/>\nroom floor or somewhere nearby.  Now, instead of nagging them and giving up<br/>\nand grumpily taking them into their bedroom to put them away myself, I can<br/>\nleave them alone and just toss them easily into the basket and put them away<br/>\nat the end of the day or whenever I get to it.  I also pointed out the new<br/>\nbasket to the girls and told them that if they don&#39;t feel like walking to<br/>\ntheir room to put clothes away (they just end up all over the floor in<br/>\nthere, anyway!), they can toss them there.  It&#39;s a small thing, but I know<br/>\nit will help...along with my intention to change my atttitude about the<br/>\nwhole thing! (Which I know is ALSO key!)<br/>\n<br/>\n=================<br/>\nSo let them. Even if they just woke up, even if they have sleep in their<br/>\neyes, even if you have other plans, let them. If it&#39;s bugging you, then find<br/>\nsomething else to occupy your time.<br/>\n=================<br/>\n<br/>\nI did well with this today.  When they woke up and wanted watch, I didn&#39;t<br/>\ntense up or tell them no or try to entice them with something else.  I just<br/>\nlet them.  And I focused on some things I needed/wanted to do today.  When I<br/>\nconsidered adjusting my attitude about this last night, I also realized that<br/>\nit would help if I kept a running list of things that I can do during that<br/>\ntime, because often, I&#39;m too disorganized to remember what I want to or need<br/>\nto do and I don&#39;t take advantage of those moments the way I could.  So<br/>\nanyway, I had my list ready, and I felt SOOO efficient.....and completely<br/>\nunruffled by their enjoyment of the tv.  Yay!!!  Oh...and I have to mention<br/>\nthat being so efficient allowed me to have something ready for them to do<br/>\nwhen they finished and were asking what they could do.  Yay!!!  (We had a<br/>\nGREAT day today, by the way!)<br/>\n<br/>\n=============<br/>\nPut on some music and dance together. -=snip=- If I was really grumpy or<br/>\nreally depressed, I would put on one of my hardcore CDs like the Chilli<br/>\nPeppers or, now, Alannis Morissett. Yeah, the language in them is bad, but<br/>\nthe kids don&#39;t even pick that up, and man, does it provide a really great<br/>\nrealease! Way better to be exposed to the occasional curse words and some<br/>\nnasty lyrics that are all slurred together anyway than a mama&#39;s yelling or<br/>\ngeneral grumpiness. Do this while your kids are watching something, crank it<br/>\nup loud and just dance with abandon. Seriously.<br/>\n===============<br/>\n<br/>\nYou know, I used to do this with my older son (now 15) when he was little.<br/>\nSometimes I know he thought I was a dork, but I also know that he liked it.<br/>\nI have danced with my girls some, but not enough.  I&#39;m not sure why.  They&#39;d<br/>\nlike even more than he did. (He can be a bit stuffy at times.  LOL)  You<br/>\nknow, I think I&#39;m going to start doing this when I feel my chest tightening<br/>\nand I&#39;m feeling too negative to breath (at least until I get better at the<br/>\nbreathing and calming thing.)  You just can&#39;t stay in a bad mood with good<br/>\nmusic and dancing going on!  Some things are so simple, I have to wonder why<br/>\nI haven&#39;t just done them all along!<br/>\n<br/>\n============<br/>\nThere are several books you may find helpful if you haven&#39;t already read<br/>\nthem:<br/>\n============<br/>\n<br/>\nI have read many of these, and even have a couple of them out from the<br/>\nlibrary right now.  I feel I need to look again and let some of what they<br/>\nhave to offer really sink in good.  Thanks for the list.<br/>\n<br/>\n============<br/>\nBiggest thing is being honest with your kids and including them in the<br/>\nbrainstorming process.<br/>\n============<br/>\n<br/>\nI think that I need to really work on this, because it could make a huge<br/>\ndifference.  I&#39;ve already thought of some ways that it could help.  I wonder<br/>\nif the 3 yo is ready to participate in a family meeting.  No...I think she<br/>\nis, if we are all ready to really listen carefully to her input!<br/>\n<br/>\nDanielle, I thank you for your help here.  You put things in such a way that<br/>\nI can&#39;t help but want to try your ideas out right away.  Your descriptions<br/>\nof your family life make me feel hopeful that we can have that too.<br/>\n<br/>\nThanks,<br/>\nAndrea</div>","specialLinks":[]},{"userId":1352017,"authorName":"kayb85","from":"&quot;kayb85&quot; &lt;sheran@...&gt;","profile":"kayb85","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why isn&#39;t this working!?","postDate":"1093244858","msgId":98744,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnYzUzcSs2ZnMyQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwNDIwMWM0ODhkZCQzOTU3YzVhMCQzZWFlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":98743,"nextInTopic":98745,"prevInTime":98743,"nextInTime":98745,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"Now, I m thinking about approaching the children with ... or ... could watch ... could ... again ... knowing that ... help to ... care ... yet, nor ... serious","messageBody":"<div id=\"ygrps-yiv-839948651\">Now, I&#39;m thinking about approaching the children with<br/>\n<blockquote><span title=\"ireply\"> &gt; the suggestion that we come up with some sort of loose  tv schedule <br/>\n </span></blockquote>or<br/>\n<blockquote><span title=\"ireply\"> &gt; something like that,  that makes us all happier. Like maybe they <br/>\n </span></blockquote>could watch<br/>\n<blockquote><span title=\"ireply\"> &gt; unlimited in the afternoon and evenings, and in the mornings they <br/>\n </span></blockquote>could<br/>\n<blockquote><span title=\"ireply\"> &gt; watch a shorter (30 min.) show when they get up, but then not watch <br/>\n </span></blockquote>again<br/>\n<blockquote><span title=\"ireply\"> &gt; until after lunch...or something like that.  I&#39;d be WAY happier <br/>\n </span></blockquote>knowing that<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;d have that no tv time each day, and  I&#39;m thinking that if they <br/>\n </span></blockquote>help to<br/>\n<blockquote><span title=\"ireply\"> &gt; put a plan in place, they&#39;ll know they have some choice and that I <br/>\n </span></blockquote>care<br/>\n<blockquote><span title=\"ireply\"> &gt; about what they want. It&#39;s an idea.  I haven&#39;t thought it out fully <br/>\n </span></blockquote>yet, nor<br/>\n<blockquote><span title=\"ireply\"> &gt; have I mentioned it to the girls, but can anyone here see any <br/>\n </span></blockquote>serious flaws<br/>\n<blockquote><span title=\"ireply\"> &gt; with this??<br/>\n<br/>\n </span></blockquote>I&#39;d be afraid that not being allowed to watch in the morning would <br/>\nmake them look so forward to afternoon tv time that they would watch <br/>\nevery afternoon just because they&#39;re allowed to then.    If there <br/>\nwere no limits, they might choose not to watch some afternoons <br/>\nthough.  <br/>\n<br/>\nSheila</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Why isn&#39;t this working!?","postDate":"1093243718","msgId":98743,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDIwMWM0ODhkZCQzOTU3YzVhMCQzZWFlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PGNnODkyNCt2MWJtQGVHcm91cHMuY29tPg=="},"prevInTopic":98740,"nextInTopic":98744,"prevInTime":98742,"nextInTime":98744,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"About the TV - why isn t your voice as important as others in this? If you don t want to have one, can it at least be brought up? Can a compromise be found -","messageBody":"<div id=\"ygrps-yiv-1959341597\">About the TV - why isn&#39;t your voice as important as others in this? If you<br/>\ndon&#39;t want to have one, can it at least be brought up? Can a compromise be<br/>\nfound - children can have it on sometimes, mom can have it off sometimes?<br/>\n=================<br/>\n<br/>\nJen, I appreciate your thoughts and wanted in particular to respond to the<br/>\nabove.  I have been forcing my &quot;voice&quot; into the picture regarding the tv, by<br/>\nsometimes saying, &quot;No, I&#39;m tired of hearing the tv today.  It&#39;s already been<br/>\non for 2 movies and I need a break.&quot;  I guess I was thinking of this as only<br/>\nfair--that I&#39;m a member of the family who should have some say, too.  But<br/>\nafter I read this (your post) I started thinking about it more carefully,<br/>\nand I realized that noone is coming to any mutually agreeable plan or<br/>\ncompromising at all.  It&#39;s just me dictating my version of fairness.  How<br/>\nfair is that!? LOL  Now, I&#39;m thinking about approaching the children with<br/>\nthe suggestion that we come up with some sort of loose  tv schedule or<br/>\nsomething like that,  that makes us all happier. Like maybe they could watch<br/>\nunlimited in the afternoon and evenings, and in the mornings they could<br/>\nwatch a shorter (30 min.) show when they get up, but then not watch again<br/>\nuntil after lunch...or something like that.  I&#39;d be WAY happier knowing that<br/>\nI&#39;d have that no tv time each day, and  I&#39;m thinking that if they help to<br/>\nput a plan in place, they&#39;ll know they have some choice and that I care<br/>\nabout what they want. It&#39;s an idea.  I haven&#39;t thought it out fully yet, nor<br/>\nhave I mentioned it to the girls, but can anyone here see any serious flaws<br/>\nwith this??<br/>\n<br/>\n~Andrea</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093241927","msgId":98740,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWUwMWM0ODhkOSQwZGUzN2RmMCQzZWFlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDE5M0JGNEE4LUYzQkYtMTFEOC1CMUQ3LTAwMzA2NTdERTQxOEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":98734,"nextInTopic":98743,"prevInTime":98739,"nextInTime":98741,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"It sounds like you are feeling lonely and isolated. I can relate to that too. I am way out in the country and don t drive. I am also living rent free in a","messageBody":"<div id=\"ygrps-yiv-172395334\">It sounds like you are feeling lonely and isolated. I can relate to that<br/>\ntoo. I am way out in the country and don&#39;t drive. I am also living rent free<br/>\nin a house owned by my MIL. DH makes only about 20K a year, so I understand<br/>\nabout being on a tight budget too.<br/>\n====================<br/>\n<br/>\nI was really feeling lonely and isolated the last week or so, and I feel<br/>\nthat way periodically--most noticeably when I&#39;m PMSing, which I was this<br/>\ntime, too.  Ugh.  Usually I recognize it coming and try to prepare myself<br/>\nbetter, but I&#39;ve had a cluttered mind dealing with late bills and such...<br/>\nThank you, Vijay,  for the understanding and also for your thoughtful<br/>\nreplies.  I&#39;m mulling them over and below have responded to some of what you<br/>\nsaid.<br/>\n<br/>\n=============<br/>\nIs there any way that you could pack all of the kids up and go to a<br/>\nplayground or a beach or a park and let them run around?<br/>\n=============<br/>\n<br/>\nWe do this quite a bit, since I live within walking distance of the Pacific<br/>\nOcean and a very, very long sandy beach.  (I live in Ocean Park, WA on the<br/>\nLong Beach Penninsula which is on the southern Washington coast.)  We are<br/>\nreally enjoying it, actually, but sometimes the kids decide they don&#39;t want<br/>\nto go to the beach, even though when we do, they always have fun.  We change<br/>\nit up by going to the southern tip of the peninsula too, because there are<br/>\ncliffs and rock formations there to climb on and a really cool beach located<br/>\nin a rocky cove (as opposed to just a really long and wide stretch of<br/>\nsand!).  It&#39;s in a state park, though, so we have to pay $5 to park.  Still<br/>\nwe go 2-3 times a month to change things up, and we also go hiking on some<br/>\nof the trails and visit the lighthouses on that end.  I really can&#39;t<br/>\ncomplain too much about where I live, other than having no friends here<br/>\n(yet) and also the fact that I&#39;m here most of the time without my husband,<br/>\nso I start to feel a little wacky! LOL<br/>\n<br/>\nAnyway, I&#39;m happy to report that I&#39;m feeling better, in part because it&#39;s<br/>\njust time to feel better, but also because I took some proactive steps today<br/>\nto not be so isolated here.<br/>\n<br/>\n=================<br/>\nI could be wrong, but I think maybe you are expecting too much from a 1 y.o.<br/>\n================<br/>\n<br/>\nActually, I don&#39;t have any unrealistic expectations of my 1 yo.  He is<br/>\nnumber 4 for me, and I&#39;m aware of the stages and such.  I only mentioned his<br/>\n&quot;stuff&quot;  because it&#39;s adding to the hoopla around here.  The girls are<br/>\nreally frustrated and I spend alot of time redirecting him and helping them<br/>\nto do the same.  But they are so little and have a hard time being patient,<br/>\nespecially my 3 yo.  She hurts him back, and I can totally understand her<br/>\nimpulse, even though I don&#39;t condone her actions.<br/>\n<br/>\nThe 4 yo breaks out in tears when he hurts her.  I have to keep reminding<br/>\nher to move away and not just sit there and let him abuse her.  She goes<br/>\ninto &quot;helpless mode&quot; LOL.<br/>\n<br/>\nI think sometimes my 4 yo has a really hard time with 2 younger siblings,<br/>\nbecause she was so rational and articulate at such a young age (she knew<br/>\nseveral words at around 9-10 months, and spoke very clearly and in sentences<br/>\nby 18 mos), that it&#39;s easy to forget she is so young.  She is only 15 months<br/>\nolder than her younger sister, who is a completely different kind of child<br/>\nwho seems  2+ years younger than the 4 yo most of the time.  Anyway, I&#39;m<br/>\ntrying to focus on each of them as individuals, so I won&#39;t slip into<br/>\nthinking too much of them in relation to each other--you know, &quot;the oldest&quot;,<br/>\n&quot;the middle child&quot;, &quot;the baby&quot;.  It helps me to see that the 4 yo is still a<br/>\nreally young girl who needs to be nurtured as such.  I&#39;m not perfect about<br/>\nit, but I am conscious of her needs.  I wish my husband was able to live<br/>\nwith us, because I would like to spend more one on one time with all of my<br/>\nchildren.  I was able to do alot more of that in Portland when we were all<br/>\nin the same house, and they girls LOVED it.<br/>\n<br/>\nThanks again for the time you spent trying to help me see things more<br/>\nclearly.  I&#39;m still &quot;chewing on&quot; much of what you wrote and also what others<br/>\nhave written and it&#39;s all swirling  and mingling with other reading I&#39;ve<br/>\nbeen doing--about meditation and anger, and  finding peace.  I&#39;m going to<br/>\nget to that better place.  I just have to keep working at it and this list<br/>\ninspires me so much.  I have to say, I agree with what Sandra said about my<br/>\nsituation not really being about unschooling.  This is just parenting little<br/>\nkids.  I know that.  But I also want to say that this is the only list I&#39;ve<br/>\nwanted to post to, because it&#39;s the only list that I read anymore--because I<br/>\nam truly challenged to think things here and I get well thought-out and<br/>\nhelpful replies that make me want to take action.  The writing here  is, for<br/>\nthe most part, REALLY intelligent and often life-changing.  Too many other<br/>\nlists offer fluffy stuff  that, yes, can sometimes make you feel better, but<br/>\nI just can&#39;t grow on that, regardless of the kind intentions.  My children<br/>\nare young, but I&#39;m SO thankful for this list, because regardless of what I<br/>\ntake and don&#39;t take from it, I am growing and learning so much, and I have a<br/>\nreal headstart on giving my kids the freedom and tools they need to be<br/>\nstrong, fullfilled and functional in their lives, and I&#39;m finally working on<br/>\nmyself in ways that I&#39;ve needed to and wanted to for so long.  So, maybe I<br/>\nwon&#39;t post so much (especially when I&quot;m so emotional--sorry all), but I&#39;ll<br/>\ncertainly keep reading as much as possible.<br/>\n<br/>\n~Andrea</div>","specialLinks":[]},{"userId":90027250,"authorName":"Penne & Buddies","from":"&quot;Penne & Buddies&quot; &lt;crrbuddy@...&gt;","profile":"crrbuddy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why isn&#39;t this working!?  Uplifting approaches","postDate":"1093226505","msgId":98734,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnYmo2OStmcm00QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDE5Ny4yZDVjYzZkNC4yZTU5NGVjOEBhb2wuY29tPg=="},"prevInTopic":98713,"nextInTopic":98740,"prevInTime":98733,"nextInTime":98735,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"Pam returned this post with a suggestion that I delete the reference text at the end of my message.  Since I felt that much of my reply played off of Sandra s","messageBody":"<div id=\"ygrps-yiv-985783568\">Pam returned this post with a suggestion that I delete the reference <br/>\ntext at the end of my message.  Since I felt that much of my reply <br/>\nplayed off of Sandra&#39;s observations, I decided to trim and post <br/>\nwithin the text, which is usually my habit anyway.  I never really <br/>\nnoticed how helpful this method is in clarifying, edifying, and <br/>\nbasically making things a wee bit briefer(I try, honest!) than <br/>\nstanding on its own.  Thanks, Pam!  See replies at Buddyflies :)(: <br/>\nbelow and HAND-PDA <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, SandraDodd@a... wrote:<br/>\n&gt; In a message dated 8/21/2004 5:50:33 PM Mountain Daylight Time, <br/>\n&gt; aburlingame@c... writes:<br/>\n&lt;snip&gt;<br/>\n&gt; <br/>\n&gt; Really.<br/>\n&gt; If your child needs structure, she will create it.<br/>\n&gt; Perhaps the structure she wants is to watch that video. &lt;g&gt;<br/>\n<br/>\n:)(: I wish someone had unschooled me so I could have learned as <br/>\nmuch about structuring my life as my kids do! They are amazing in <br/>\nself-sufficiency, self-direction, self-discipline (I&#39;m learning from <br/>\nthem all the time!) Just give &#39;em some time and you&#39;ll see! <br/>\n<br/>\n&gt; <br/>\n&gt; -=-or my need for peace and quiet<br/>\n&gt; or to spend more interactive time with them?<br/>\n&gt; -=-<br/>\n<br/>\n&gt; Your need for peace and quiet was forfeited when you got <br/>\npregnant.  Those <br/>\n&gt; last few months before the baby came were  about the last rest <br/>\nbefore they&#39;re <br/>\n&gt; older.  Bummer.  I can&#39;t change it.  <br/>\n&gt; <br/>\n&gt; Lots of parents do change it but there&#39;s a high cost.  They lose <br/>\nthe <br/>\n&gt; relationship with their child.<br/>\n&gt; <br/>\n<br/>\n:)(: Amen to that.  Sandra is absolutely right, life has to be lived <br/>\nin the here and now -- with each other.  That relationship is <br/>\neverything you _choose_ to make of it, but I have found that it <br/>\ntakes more than blind faith to make this work.  It takes <br/>\nunderstanding and experience.  We have nine kids, a DIL, and a new <br/>\ngrandbaby -- and I&#39;m trying my best to help them see that everything <br/>\nfalls into place if we keep our focus on what&#39;s important.  <br/>\n<br/>\n&gt; <br/>\n&gt; -=-  Sometimes<br/>\n&gt; I&#39;m just too overwhelmed like the last couple of days.  I&#39;ll start <br/>\nfresh<br/>\n&gt; again tomorrow.  -=-<br/>\n&gt; <br/>\n&gt; Why tomorrow?  Why not now?  The next breath you take, take a <br/>\ndeeper breath <br/>\n&gt; than you usually do.  Hold it a little longer than you ordinarily <br/>\nwould.  <br/>\n&gt; Choose to let it out slowly.<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeedmag.com/HEM/HEM154.98/154.98_clmn_unschl.html\">http://www.homeedmag.com/HEM/HEM154.98/154.98_clmn_unschl.html</a><br/>\n&gt; <br/>\n&gt; Something about new days, and mornings.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n:)(: That&#39;s the spirit!  With my brood, you can believe that every <br/>\nsingle moment is a new beginning around here!  Awesome article, <br/>\nSandra -- I memorized all the verses to &quot;Morning Has Broken&quot; and <br/>\nlearned to play it on my guitar when I was in highschool.  My heart <br/>\nwas broken when Cat Stevens denounced his work in music as a <br/>\nmeaningful contribution to society, but I hear he&#39;s reconsidered <br/>\nusing his creativity to promote the Muslim faith now.  We live, we <br/>\nlearn, we grow up together and it seems like just this morning, we <br/>\nwere beginning the whole adventure.  <br/>\n<br/>\nI can tell you that my old religion (United Methodist) taught that <br/>\nthese trials and tribulations are God&#39;s way of making one stronger, <br/>\nand my extended family still firmly believes that.  Only problem is <br/>\nthat one of my brothers decided he was sick & tired of being tested <br/>\nby a so-called loving Parent and put an end to the charade once and <br/>\nfor all... or so he thought.  I learned about Christian Science (CS) <br/>\nabout seven years later while investigating the vaccination issue <br/>\nand dealing with my own health and family issues -- it has made all <br/>\nthe difference in the world in handling life&#39;s little (and big) <br/>\nchallenges.<br/>\n<br/>\nThe most important thing I learned is that there&#39;s more to it than <br/>\nmaking up your mind to make lemonade with the lemons life throws at <br/>\nyou.  CS gave us a practical way to handle any and every problem <br/>\nthat comes our way (unwarranted fear being the basis for much of our <br/>\nnegative experiences) and it has proved its worth over and over <br/>\nagain since my first unexpected healing back in &#39;94 of a crippling <br/>\ncase of psoriasis that had plagued me for a decade.  For an avid <br/>\nwriter, that&#39;s a biggie!<br/>\n<br/>\nIf you or anyone else is interested in learning more about it, check <br/>\nout &quot;Science and Health with Key to the Scriptures&quot; by Mary Baker <br/>\nEddy.  There&#39;s some great stuff on marriage and family and her <br/>\ncomments on education are timeless (Mrs. Eddy was homeschooled, <br/>\ntoo.)  Full text of the book is freely available online at Healing <br/>\nUnlimited <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.christianscience.org\">http://www.christianscience.org</a> and at the local library, <br/>\nthough I prefer the final 1910 edition at HU over the one currently <br/>\nbeing published by the corrupt Boston organization.<br/>\n<br/>\nTie a knot in the end of the rope and hang on! as my mom always <br/>\nlikes to say :o) Vayan con Dios, Amigos ~ <br/>\n<br/>\nPenne & the Family<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.ardfamilyco-op.net\">http://www.ardfamilyco-op.net</a> </span></blockquote></div>","specialLinks":[]},{"userId":234387,"authorName":"andrea@ns.sympatico.ca","from":"&quot;andrea@...&quot; &lt;andrea@...&gt;","profile":"runmum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093176368","msgId":98713,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4xLjEuMS4yMDA0MDgyMjA4NDMyNy4wMjU5NGM3MEBwb3AxLm5zLnN5bXBhdGljby5jYT4=","inReplyToHeader":"PDAxNTkwMWM0ODdkOSQ1OGU3OGY0MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDFjYS4yOTNiOGM3Mi4yZTU5MWI1YkBhb2wuY29tPiA8MDE1OTAxYzQ4N2Q5JDU4ZTc4ZjQwJDFjYWVjZWQxQGhlcm9ub2ZmaWNlPg=="},"prevInTopic":98708,"nextInTopic":98734,"prevInTime":98712,"nextInTime":98714,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"... I feel for you, Andrea. I ve been through a lot of this myself. I m going to be blunt: nothing will change until you change yourself. If you are committed","messageBody":"<div id=\"ygrps-yiv-52347187\">At 08:47 PM 8/21/04, Andrea wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;It does make me grumpy, but I don&#39;t think I&#39;d be nearly as grumpy if they<br/>\n&gt;weren&#39;t also fighting alot and so on.  I think it&#39;s all feeling a bit<br/>\n&gt;jumbled at this point.  I&#39;d be lying if I said that it doesn&#39;t bother and<br/>\n&gt;worry me that they watch so much tv.  So maybe that&#39;s part of why the sound<br/>\n&gt;of tv bothers me, even though I&#39;ve always detested tv on (and on and on) in<br/>\n&gt;the daytime.  Maybe it is all just a vicious cycle.  I want out.<br/>\n<br/>\n </span></blockquote>I feel for you, Andrea. I&#39;ve been through a lot of this myself.<br/>\n<br/>\nI&#39;m going to be blunt: nothing will change until you change yourself. If <br/>\nyou are committed to unschooling you have to embrace it fully. The problems <br/>\nyou have written about are your problems, not your childrens&#39;. If you don&#39;t <br/>\nlike the tv noise you can learn to accept it or not. The fighting will <br/>\nhappen, every day, maybe many times a day. Accept it and learn ways to deal <br/>\nwith it. A calm attitude really does change childrens&#39; behaviour.<br/>\n<br/>\nI think that having been restricted in the past makes the tv more <br/>\nattractive to your kids. They may want to watch a lot for a while but <br/>\neventually it will balance out and they will go back to the other enticing <br/>\nactivities you are offering. Keep offering without pushing.<br/>\n<br/>\nAre you spending a lot of time on housework? You didn&#39;t say. You have no <br/>\ntime for housework. Food and laundry are priorities but a spotless floor <br/>\nisn&#39;t. Neither is a clean kitchen, except to keep the insects down. Three <br/>\nkids and a mom live in your house, really live there, not just sleep there. <br/>\nThe house should reflect this.<br/>\n<br/>\nI also think you need a little bit of time to focus just on you. Is there <br/>\ntime before the kids get up, before you go to bed, or when the 1-y.o. is <br/>\nnapping to do some yoga or aerobics or dancing? It makes a world of <br/>\ndifference to me.<br/>\n<br/>\nDonna</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093151961","msgId":98708,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAxMGQwMWM0ODdjZCQxMWUwZmYyMCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":98707,"nextInTopic":98713,"prevInTime":98707,"nextInTime":98709,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1974549756\">&lt;&lt;&lt;&lt; And having &quot;peace&quot; starts with your own state of mind.  You are having<br/>\ntrouble letting go of controls to begin with.  That is creating a conflict<br/>\nfor your state of mind.  I suspect a lot of this follows from that conflict.<br/>\n======================<br/>\nI think this is pretty accurate for me.  I keep trying to meditate and use<br/>\naffirmations.  I&#39;m terrible at it.  I feel WAY behind the eight-ball, so to<br/>\nspeak.  If only things would stay calm for a few days and let me refresh<br/>\nmyself.  If only...&gt;&gt;&gt;&gt;<br/>\n<br/>\nKeep at it. Affirmations work best when you say them aloud so your ears and<br/>\nyour mind hear them. (I know it feels goofy at first). I have read that you<br/>\nneed to say each one 21 times (in each session of affirming) before it<br/>\nactually starts to work. Perhaps learn about the concept of detachment some<br/>\nmore.<br/>\n<br/>\n&lt;&lt;&lt;I only ASKED if they could wait, because I was in the middle of making<br/>\nthem something they asked me to make.  They didn&#39;t seem to mind.  I was<br/>\nfully prepared to give them the red vines if they still wanted it then.  I<br/>\nwas very conscious of that possibility when I asked.&gt;&gt;&gt;&gt;<br/>\n<br/>\nSometimes parents assume that their consciousness equals the child&#39;s<br/>\nconsciousness. Sometimes Jayn doesn&#39;t seem to mind waiting, but she is<br/>\nactually distracted. She says OK, then a moment later comes back with<br/>\n&quot;Where&#39;s my ice-cream sandwich?&quot; even though I had asked her to wait a<br/>\nminute (for some reason) as if she didn&#39;t REALLY hear me ask her. <br/>\n<br/>\n&lt;&lt;&lt;It does bother me when I prepare food that someone has asked to prepare<br/>\nandit just sits there uneaten or with a single bite taken out.  I ate the<br/>\nfruit because I was already overwhelmed with things to do and the baby was<br/>\nwanting to nurse and I didn&#39;t have the time or lemon on hand to do something<br/>\nelse (I actually considered saving them just as you have described.)..... <br/>\n[snip]<br/>\nI would still have<br/>\nbeen equally annoyed if she asked and I prepared and served and she decided<br/>\nshe was too full and then 20 minutes later asked me for something else.&gt;&gt;&gt;<br/>\n<br/>\nJayn sometimes does this too. Her tummy is the size of her tiny little fist.<br/>\nI don&#39;t believe she is saying she is full but being untruthful. <br/>\n<br/>\nIf it makes you feel any better, this issue of letting go of &quot;waste is a bad<br/>\noutcome&quot; is one that comes back cyclically on these boards amongst new<br/>\nunschoolers. The amount of waste our kids create is orders of magnitude less<br/>\nthan say any restaurant, plus we have the opportunity to make compost a lot<br/>\nof the time. It is really OK to throw out a cut apple sometimes, and it<br/>\nwon&#39;t be forever that you have a baby wanting to nurse taking the proper<br/>\npriority. <br/>\n<br/>\nIt is not necessarily a good thing to model eating something anyway when you<br/>\nare not hungry for it.<br/>\n<br/>\nRobyn L. Coburn  <br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.740 / Virus Database: 494 - Release Date: 8/16/2004</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093149844","msgId":98706,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAyYjMwMWM0ODdmMCRmMTEyZDJlMCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":98703,"nextInTopic":98707,"prevInTime":98705,"nextInTime":98707,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1745243194\">&lt;&lt;&lt;To others who have responded to my original posts--thank you.  I will<br/>\nrespond as I can...usually can&#39;t do much during the day.  When I do, there<br/>\nare even more problems around here than usual.  I do appreicate your taking<br/>\nthe time read and then offer me your advice and insights.&gt;&gt;&gt;<br/>\n<br/>\nFor my own part, please don&#39;t feel obliged to express any thanks<br/>\nindividually merely because I posted on something you wrote. You have enough<br/>\nto do with your time, Andrea. Go ahead and argue if you disagree, of course!<br/>\n(g)<br/>\n<br/>\nIt is not necessary for individual responses since this is a list of over<br/>\n1000 members. The above reply is more than enough, and the discussion will<br/>\nprobably move on to &quot;universal&quot; issues initiated by your posts pretty<br/>\nquickly. I sometimes mix up short quotes from several persons&#39; responses<br/>\ninto one reply if the ideas are still bubbling up.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.740 / Virus Database: 494 - Release Date: 8/16/2004</div>","specialLinks":[]},{"userId":151469531,"authorName":"velvet jiang","from":"&quot;velvet jiang&quot; &lt;jiangvelvet@...&gt;","profile":"lizzie47025","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093149514","msgId":98707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTE0LUY5eDVDWXhsdlZlY0EwMDBiMGM5ZkBob3RtYWlsLmNvbT4="},"prevInTopic":98706,"nextInTopic":98708,"prevInTime":98706,"nextInTime":98708,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"It seems to me that my children are becoming more dissatisfied rather than less so as I pull away limits i only have one child so i don t know how hard it is","messageBody":"<div id=\"ygrps-yiv-1035187389\">&quot;It seems to me that my children are<br/>\nbecoming more dissatisfied rather than less so as I pull away limits&quot;<br/>\n<br/>\ni only have one child so i don&#39;t know how hard it is with more. i can only <br/>\nsay that my dd when she was younger took her behavior ques from me. when i <br/>\nwas feeling really annoyed, angry, any emotion she would follow suit. so if <br/>\nyou are feeling so upset and frustrated it is easy to see how that could <br/>\ntransfer to the children. i also know that when my dd talks sharply to me if <br/>\ni listen with an open mind i can hear either me or my dh in her words and <br/>\nmannerism. i have had to work very hard due to my childhood experiences to <br/>\nreally listen to myself and how i sound because sometimes i&#39;m not even aware <br/>\nof my sharpness. i don&#39;t believe based on my own experience with my family <br/>\n(parents, siblings) that your children as children can learn the things that <br/>\nyou want them to without you learning them first.<br/>\n<br/>\ni really sympothize with the way that you are feeling because it is hard to <br/>\nface these kinds of things about ourself and even harder to change them. i <br/>\nknow from first hand experience how hard it was and still is (close to 12 <br/>\nyears working on it) to change the things that are programmed into us from <br/>\nbirth.<br/>\n<br/>\nvelvet<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;From: &quot;Andrea Burlingame&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a>&gt;<br/>\n&gt;Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n&gt;To: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\n&gt;Subject: Re: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n&gt;Date: Sat, 21 Aug 2004 15:20:29 -0700<br/>\n&gt;<br/>\n&gt;Its good to remove her from the situation but at the age of 3, is it<br/>\n&gt;possible to get her involved in something she likes rather than &quot;remove<br/>\n&gt;her&quot;. Can she take a warm bath?  Do they all have to play together?<br/>\n&gt;=============================<br/>\n&gt;<br/>\n&gt;Oh, this is EXACTLY what I try to to do for her.   Sometimes she is<br/>\n&gt;interested in another activity away from her sister, but lately she more<br/>\n&gt;often just kicks her heel down over and over, grunts, throws things and<br/>\n&gt;screams &quot;NO!&quot; at me when I make suggestions or offer somethign soothing.  I<br/>\n&gt;have to just leave her alone for awhile when she does that, and eventually,<br/>\n&gt;sometimes sooner, sometimes much later she comes around.<br/>\n&gt;............................................................................<br/>\n&gt;.........................<br/>\n&gt;<br/>\n&gt;Many 1 year olds pull hair.  Maybe find something similar for him to pull<br/>\n&gt;on?<br/>\n&gt;============================<br/>\n&gt;<br/>\n&gt;I realize that 1 year olds do this, although he is the first of my 4 to <br/>\n&gt;bite<br/>\n&gt;as well.  I know it&#39;s normal and try to help the girls keep safe from him<br/>\n&gt;and I distract him from it all the time.  He mostly does it when he is<br/>\n&gt;frustrated, like when he wants to knock down their creations and they won&#39;t<br/>\n&gt;let him.  I either have them go where he can&#39;t bother him, or sometimes I<br/>\n&gt;just carry him in on my back, which he likes.  The main reason I mentioned<br/>\n&gt;his hair pulling and biting and such, is because it is part of the whole<br/>\n&gt;chaos around here.  It isn&#39;t that I don&#39;t expect it from<br/>\n&gt;him.........................................................................<br/>\n&gt;..................<br/>\n&gt;<br/>\n&gt;   Your disapproval of tv first thing in the morning is very clear from <br/>\n&gt;your<br/>\n&gt;post, and I&#39;m sure your kids are aware of it too.<br/>\n&gt;========================<br/>\n&gt;<br/>\n&gt;Yes,  they know that I don&#39;t like the noise of the tv first thing in the<br/>\n&gt;morning and they know I don&#39;t like the tv on as much as it&#39;s been on lately<br/>\n&gt;either.   They also know I don&#39;t care for watching the same DVD&#39;s over and<br/>\n&gt;over and over again, which is what happens here because we can&#39;t get any<br/>\n&gt;network tv here and can&#39;t afford cable.  We get our DVD&#39;s from the library<br/>\n&gt;and they trickle in a few each week I put 100 holds on titles.  It&#39;s<br/>\n&gt;annoying to me to listen to the same theme songs and such over and over.<br/>\n&gt;<br/>\n&gt;Are you saying that my kids are asking for tv because it annoys me?  I <br/>\n&gt;don&#39;t<br/>\n&gt;think this is the case.<br/>\n&gt;............................................................................<br/>\n&gt;...................<br/>\n&gt;<br/>\n&gt;Why do they have to do other things.  Can&#39;t they watch tv if they want?<br/>\n&gt;======================<br/>\n&gt;<br/>\n&gt;They don&#39;t HAVE to do other things.  They usually enjoy doing other things.<br/>\n&gt;They have been watching ALOT of tv lately.  I&#39;m sick of it, personally and<br/>\n&gt;wish they wanted to do some crafts with me or go to the beach.  Watching <br/>\n&gt;the<br/>\n&gt;same shows over and over again is really boring to me, and, YES, I&#39;m<br/>\n&gt;dissappointed that they&#39;d rather do that than something more interactive<br/>\n&gt;with me.<br/>\n&gt;............................................................................<br/>\n&gt;......................<br/>\n&gt;Why does tv affect you this way?  It is clear that you do not like tv, but<br/>\n&gt;have you ever thought about why?  Are you sure that your reasons for the<br/>\n&gt;dislike are really valid?<br/>\n&gt;=======================<br/>\n&gt;<br/>\n&gt;I do like tv.  I love to watch Survivor.  I watched so many movies in my<br/>\n&gt;life that it is rare to find one I haven&#39;t seen at the video store.  I just<br/>\n&gt;don&#39;t really like it to be on during the day so much.  I have thought about<br/>\n&gt;why.  I like to hear birds outside the window.  I like to hear my own<br/>\n&gt;thoughts or to listen to music sometimes.  I like the quiet.  I also like <br/>\n&gt;to<br/>\n&gt;talk and to listen to my children talk, which they don&#39;t do much when the <br/>\n&gt;tv<br/>\n&gt;is on.  I&#39;ve always been this way, not just since my kids were born.  When <br/>\n&gt;I<br/>\n&gt;was in the Air Force and had to live in a dorm with a roomate, I hated when<br/>\n&gt;she&#39;d get home before me and turn her tv on and leave it on until she <br/>\n&gt;either<br/>\n&gt;went out or to bed.  She wouldn&#39;t turn it off even if I asked, so I would<br/>\n&gt;find somewhere else to be. (I eventually requested to be moved to another<br/>\n&gt;room.)  When I was dating my first husband, he kept the tv on low or muted<br/>\n&gt;and tuned to the cartoon channel for ambiance.  Ugh.  I hated that.  Even<br/>\n&gt;when it was muted, I hated the visual &quot;noise.&quot;  I just don&#39;t like the tv on<br/>\n&gt;very much.<br/>\n&gt;............................................................................<br/>\n&gt;.......................<br/>\n&gt;<br/>\n&gt;Is it possible you are setting up a power struggle with the kids because<br/>\n&gt;although you haven&#39;t said no, you would feel much better if you did?<br/>\n&gt;<br/>\n&gt;I&#39;m sure of it.<br/>\n&gt;............................................................................<br/>\n&gt;......................<br/>\n&gt;<br/>\n&gt;   Is it the tv?  Or is it that they sense your disapproval?<br/>\n&gt;============================<br/>\n&gt;I believe the tv is partly to blame for the irritableness and short <br/>\n&gt;-tempers<br/>\n&gt;around here.  I have seen it over and over again with my kids and myself.<br/>\n&gt;I&#39;ve seen it when I wasn&#39;t looking for it.  My experience with my children<br/>\n&gt;is that when they spent several hours a day sitting in front of the tv to<br/>\n&gt;watch a movie or whatever, they end up with excess energy and are also much<br/>\n&gt;more irritable.  I don&#39;t think they are sniping at each other because I let<br/>\n&gt;them watch tv when I didn&#39;t want to.<br/>\n&gt;............................................................................<br/>\n&gt;...................<br/>\n&gt;<br/>\n&gt;   Are you actually *with* your kids while they are doing things that<br/>\n&gt;interest them?  Are you content just being with them doing whatever they<br/>\n&gt;like to do (even if its tv)?  Or are you using the time that they are<br/>\n&gt;occupied to &quot;get things done&quot;.  If you are using that time to &quot;Get things<br/>\n&gt;done&quot;, they are going to drop what they are doing to get your<br/>\n&gt;attention...even if you&#39;re only MIA for 10 minutes.  Its the nature of the<br/>\n&gt;age.<br/>\n&gt;===============================<br/>\n&gt;<br/>\n&gt;I watch things with them often, but not all of the time.  Sometimes I wash<br/>\n&gt;dishes or cook dinner. Sometimes I sit in the same room and read the posts<br/>\n&gt;on this list.  Other times I sit down with them and knit or nurse the baby,<br/>\n&gt;or just watch with them.  Since the baby doesn&#39;t really watch much yet, I <br/>\n&gt;am<br/>\n&gt;often playing with him.<br/>\n&gt;............................................................................<br/>\n&gt;.....................<br/>\n&gt;<br/>\n&gt;When you have children so young, arriving at a &#39;place of peace&quot; does not<br/>\n&gt;mean that you get time to yourself :o).<br/>\n&gt;=================<br/>\n&gt;<br/>\n&gt;I&#39;ve noticed! LOL  No, really, though, when I say a &quot;place of peace&quot;  I <br/>\n&gt;just<br/>\n&gt;mean that I want people to use civil tones around here and  for there to be<br/>\n&gt;less fighting and hollering.   I realize that it may take awhile.  I&#39;m just<br/>\n&gt;tired.  I also wish I could stay calmer in the storm.<br/>\n&gt;............................................................................<br/>\n&gt;.....................<br/>\n&gt;<br/>\n&gt;   And having &quot;peace&quot; starts with your own state of mind.  You are having<br/>\n&gt;trouble letting go of controls to begin with.  That is creating a conflict<br/>\n&gt;for your state of mind.  I suspect a lot of this follows from that <br/>\n&gt;conflict.<br/>\n&gt;======================<br/>\n&gt;I think this is pretty accurate for me.  I keep trying to meditate and use<br/>\n&gt;affirmations.  I&#39;m terrible at it.  I feel WAY behind the eight-ball, so to<br/>\n&gt;speak.  If only things would stay calm for a few days and let me refresh<br/>\n&gt;myself.  If only...<br/>\n&gt;............................................................................<br/>\n&gt;......................<br/>\n&gt;   &gt;&gt;Yesterday we went shopping. &lt;&lt;<br/>\n&gt;<br/>\n&gt;   Big mistake.  There is no reason why you should take 3 young kids <br/>\n&gt;shopping<br/>\n&gt;with you (unless there are circumstances that I missed somewhere).  There <br/>\n&gt;is<br/>\n&gt;no reason why you need to do that to yourself.<br/>\n&gt;===========================<br/>\n&gt;<br/>\n&gt;I have no choice.  Nobody here to leave them with, and no money for a <br/>\n&gt;sitter<br/>\n&gt;(or for the groceries for that matter--I think I overdrew my account<br/>\n&gt;accidently!)  They are pretty well-behaved in grocery stores actually.  We<br/>\n&gt;have fun.  They ask for alot, but don&#39;t pitch fits when I do have to say <br/>\n&gt;no.<br/>\n&gt;Occasionally the three year old will cause trouble by not coming along with<br/>\n&gt;me or by standing up in the cart if I insist she ride there if she&#39;s<br/>\n&gt;misbehaving, but usually people compliment me on what &quot;well-behaved&quot; or<br/>\n&gt;&quot;nice&quot; children I have.  This happens most places we go, actually.<br/>\n&gt;............................................................................<br/>\n&gt;.....................<br/>\n&gt;<br/>\n&gt;   Is there a reason why the 3 yo couldn&#39;t watch the movie while you did<br/>\n&gt;things with the baby and 4 year old?  Honestly, it really sounds as if they<br/>\n&gt;are testing you to see if you are really going to let *them* make the<br/>\n&gt;choices.<br/>\n&gt;===================<br/>\n&gt;<br/>\n&gt;The movie wasn&#39;t the issue for the 3 yo.  She had already started playing<br/>\n&gt;with her dollies more than she was watching.  The transition was what got<br/>\n&gt;her going.  Even if she really wanted to watch the movie, I wouldn&#39;t have<br/>\n&gt;let her watch it alone.  It was Close Encounters of the Third Kind.  I was<br/>\n&gt;going to watch it after they were asleep, but they asked me to watch it <br/>\n&gt;with<br/>\n&gt;me, and I thought it would be fun, but the baby was putting the nix on that<br/>\n&gt;plan by standing in front of the screen, pulling hair and throwing blocks.<br/>\n&gt;I couldn&#39;t let the 3 yo watch without me there close by, so I suggested<br/>\n&gt;something else to do and we&#39;d try the movie again later when baby was<br/>\n&gt;asleep.<br/>\n&gt;............................................................................<br/>\n&gt;.....................<br/>\n&gt;<br/>\n&gt;   Again, your disapproval of their choices comes through loud and clear.<br/>\n&gt;You are also still doling out the food in quantities that you decide on, <br/>\n&gt;and<br/>\n&gt;asking them to &quot;wait until dinner&quot;.<br/>\n&gt;====================<br/>\n&gt;I only ASKED if they could wait, because I was in the middle of making them<br/>\n&gt;something they asked me to make.  They didn&#39;t seem to mind.  I was fully<br/>\n&gt;prepared to give them the red vines if they still wanted it then.  I was<br/>\n&gt;very conscious of that possibility when I asked.<br/>\n&gt;............................................................................<br/>\n&gt;.....................<br/>\n&gt;<br/>\n&gt;You are upset because things are &quot;going to waste&quot; and &quot;biting your toungue&quot;<br/>\n&gt;at your kids while you describe a piece of fruit as &quot;beautiful and crispy&quot;.<br/>\n&gt;And you ate the fruit even though you weren&#39;t hungry.  That was your choice<br/>\n&gt;based on your ideas of the &quot;Right way to handle leftover food&quot;.<br/>\n&gt;=====================<br/>\n&gt;It does bother me when I prepare food that someone has asked to prepare and<br/>\n&gt;it just sits there uneaten or with a single bite taken out.  I ate the <br/>\n&gt;fruit<br/>\n&gt;because I was already overwhelmed with things to do and the baby was <br/>\n&gt;wanting<br/>\n&gt;to nurse and I didn&#39;t have the time or lemon on hand to do something else <br/>\n&gt;(I<br/>\n&gt;actually considered saving them just as you have described.). I mentioned<br/>\n&gt;the apple as being crisp and beautiful because sometimes my 4 yo won&#39;t eat<br/>\n&gt;an apple if it&#39;s grainy or doesn&#39;t look just right.  My point was that it<br/>\n&gt;was just how she normally likes it.<br/>\n&gt;............................................................................<br/>\n&gt;....................<br/>\n&gt;   I know that you are thinking of the money it takes to buy the food you<br/>\n&gt;have, and how much could be saved if things weren&#39;t wasted.   But when it<br/>\n&gt;comes right down to it....an apple has become a higher priority than the<br/>\n&gt;kids.<br/>\n&gt;===========================<br/>\n&gt;This is too simplistic.  The apple hasn&#39;t become more important than my<br/>\n&gt;kids.  It wouldn&#39;t have mattered what food it was, a bowl of ice cream or<br/>\n&gt;some cookies and milk or broccolli and dip or apples, I would still have<br/>\n&gt;been equally annoyed if she asked and I prepared and served and she decided<br/>\n&gt;she was too full and then 20 minutes later asked me for something else.  <br/>\n&gt;She<br/>\n&gt;rejected the apple and that did bother me, yes, but I was also bothered by<br/>\n&gt;the seeming onslaught of demands and my inability to do anything that<br/>\n&gt;satisfied them, no matter how I tried.  It seems to me that my children are<br/>\n&gt;becoming more dissatisfied rather than less so as I pull away limits.  I<br/>\n&gt;really do want to give them more choice and I want to accept their choices<br/>\n&gt;with equal grace, but I don&#39;t want to be around demanding children who <br/>\n&gt;can&#39;t<br/>\n&gt;be pleased.  I&#39;m very frustrated and afraid to take it any further than I<br/>\n&gt;have by letting them have total access--which would be very impractical <br/>\n&gt;with<br/>\n&gt;a one year old running around too.<br/>\n&gt;<br/>\n&gt;~Andrea<br/>\n&gt;............................................................................<br/>\n&gt;......................<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;----- Original Message -----<br/>\n&gt;From: &quot;Have a Nice Day!&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a>&gt;<br/>\n&gt;To: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\n&gt;Sent: Saturday, August 21, 2004 1:33 PM<br/>\n&gt;Subject: Re: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt; I understand your need to explain it all, it sounds very chaotic and <br/>\n&gt;your<br/>\n&gt;post conveys your frustration.  But it might be easier to try and sum up <br/>\n&gt;the<br/>\n&gt;specific problems in order to arrive at some solutions.<br/>\n&gt; &gt;<br/>\n&gt; &gt; It sounds like the two major problems in your post are about TV and <br/>\n&gt;Food.<br/>\n&gt; &gt;<br/>\n&gt; &gt; See below.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   ----- Original Message -----<br/>\n&gt; &gt;   From: Andrea Burlingame<br/>\n&gt; &gt;   To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n&gt; &gt;   Sent: Saturday, August 21, 2004 11:35 AM<br/>\n&gt; &gt;   Subject: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt;They hit and kick each other.  The 3yo does this for no apparent<br/>\n&gt;reason.  If I remove her from the scene, she yells screams and stomps her<br/>\n&gt;feet andthen when she finally calms down 15-20 minutes later and lets me<br/>\n&gt;hold her and care for her a bit, she goes right back in and starts bugging<br/>\n&gt;someone. &lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Its good to remove her from the situation but at the age of 3, is it<br/>\n&gt;possible to get her involved in something she likes rather than &quot;remove<br/>\n&gt;her&quot;. Can she take a warm bath?  Do they all have to play together?<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt;&gt;The baby (1yo) pulls everyones hair and scratches and bites and<br/>\n&gt;pinches when he is thwarted in any way (and sometimes for no apparent <br/>\n&gt;reason<br/>\n&gt;he&#39;ll just run over and hurt one of the girls when they are watching<br/>\n&gt;something on tv)&lt;&lt;&lt;<br/>\n&gt; &gt;   Many 1 year olds pull hair.  Maybe find something similar for him to<br/>\n&gt;pull on?<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt;Also, they want to watch tv (dvd&#39;s in our case, since we can&#39;t get <br/>\n&gt;tv<br/>\n&gt;here and can&#39;t afford cable) first thing in the morning, before the sleep <br/>\n&gt;is<br/>\n&gt;rubbed out of their eyes,&lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Your disapproval of tv first thing in the morning is very clear from<br/>\n&gt;your post, and I&#39;m sure your kids are aware of it too.<br/>\n&gt; &gt;<br/>\n&gt; &gt;    &gt;&gt;and then ask for it every hour or more all day long, even when I <br/>\n&gt;have<br/>\n&gt;other things to do with them. &lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Why do they have to do other things.  Can&#39;t they watch tv if they <br/>\n&gt;want?<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt;I haven&#39;t been saying no except for when I just don&#39;t want to hear <br/>\n&gt;and<br/>\n&gt;see the blasted thing anymore.  I don&#39;t really like the tv on in the<br/>\n&gt;daytime.  It literally drones in my ears and I find it very distracting and<br/>\n&gt;I start to feel depressed when it&#39;s on as much as it&#39;s been on lately.  If<br/>\n&gt;it were up to me, we wouldn&#39;t have one. &lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Why does tv affect you this way?  It is clear that you do not like tv,<br/>\n&gt;but have you ever thought about why?  Are you sure that your reasons for <br/>\n&gt;the<br/>\n&gt;dislike are really valid?<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Is it possible you are setting up a power struggle with the kids <br/>\n&gt;because<br/>\n&gt;although you haven&#39;t said no, you would feel much better if you did?<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt;Plus, my kids are snippier and grumpier with alot of tv. &lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Is it the tv?  Or is it that they sense your disapproval?<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt;They are also more &quot;wired&quot;, literally bouncing off the walls after a<br/>\n&gt;long session.  I&#39;ve seen it before when I&#39;ve eased up, and now I&#39;ve been<br/>\n&gt;living with since June.  I keep hoping that they will get their fill and <br/>\n&gt;not<br/>\n&gt;be so obsessed with watching it, but I&#39;m really starting to lose it.&lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   But if you keep hoping things will change, then you aren&#39;t really <br/>\n&gt;giving<br/>\n&gt;them the control.  You&#39;re giving them a reprieve from the status quo.  They<br/>\n&gt;probably know that.  Maybe you need to come to terms with the idea that tv<br/>\n&gt;is ok, and that if they are happy watching tv right now and you don&#39;t like<br/>\n&gt;tv, then you can be happy finding something else to do, albeit with them.<br/>\n&gt;And it would probably have to be something you can put down easily.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt;With 3 little ones, there is constantly something going on that <br/>\n&gt;needs<br/>\n&gt;my immediate attention.&lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   I&#39;m absolutely sure you are right about that.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt;(Since I sat down in desperation to write this, I&#39;ve stopped to<br/>\n&gt;mediate a fight twice, got a snack for someone 3 times, kissed an &quot;owie&quot;<br/>\n&gt;once, cleaned up an accident the 3 yo had, got the baby away from the<br/>\n&gt;hamsters once and removed him from the girls&#39; room just now--all in a space<br/>\n&gt;of what?  Maybe 10-15 minutes.  Argh!)  How do you get to a place of <br/>\n&gt;peace!?<br/>\n&gt;I swear I&#39;ve been trying, but I keep failing miserably!&lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Are you actually *with* your kids while they are doing things that<br/>\n&gt;interest them?  Are you content just being with them doing whatever they<br/>\n&gt;like to do (even if its tv)?  Or are you using the time that they are<br/>\n&gt;occupied to &quot;get things done&quot;.  If you are using that time to &quot;Get things<br/>\n&gt;done&quot;, they are going to drop what they are doing to get your<br/>\n&gt;attention...even if you&#39;re only MIA for 10 minutes.  Its the nature of the<br/>\n&gt;age.<br/>\n&gt; &gt;   When you have children so young, arriving at a &#39;place of peace&quot; does <br/>\n&gt;not<br/>\n&gt;mean that you get time to yourself :o).<br/>\n&gt; &gt;<br/>\n&gt; &gt;   And having &quot;peace&quot; starts with your own state of mind.  You are having<br/>\n&gt;trouble letting go of controls to begin with.  That is creating a conflict<br/>\n&gt;for your state of mind.  I suspect a lot of this follows from that <br/>\n&gt;conflict.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt;Yesterday we went shopping. &lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Big mistake.  There is no reason why you should take 3 young kids<br/>\n&gt;shopping with you (unless there are circumstances that I missed somewhere).<br/>\n&gt;There is no reason why you need to do that to yourself.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt; They were happy.   They ate a red vine on the way home and then I<br/>\n&gt;asked them to wait for more, since I was making dinner (Mac and Cheese,<br/>\n&gt;which they had been asking me for all day.)  Fine.  One ate most of her<br/>\n&gt;dinner and the other ate about half of a small bowl.  Said she was full.<br/>\n&gt;Then they wanted ice cream.  I didn&#39;t say a word about being full, but got<br/>\n&gt;them each a little bowl of ice cream.  They also ate another red vine.  We<br/>\n&gt;tried to watch a movie at their request (they&#39;d already watched 3 that <br/>\n&gt;day),<br/>\n&gt;but the baby wouldn&#39;t let us and it was getting late, so we went to feed <br/>\n&gt;and<br/>\n&gt;play with the hamsters.  I suggested watching the movie later the next day,<br/>\n&gt;and 4 yo was fine, but 3 yo balked, even though she wasn&#39;t really watching<br/>\n&gt;the show anyway.  &lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Is there a reason why the 3 yo couldn&#39;t watch the movie while you did<br/>\n&gt;things with the baby and 4 year old?  Honestly, it really sounds as if they<br/>\n&gt;are testing you to see if you are really going to let *them* make the<br/>\n&gt;choices.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   This morning I got up at 7:30 and everyone else followed shortly<br/>\n&gt;afterward.  I am usually very cheerful in the morning, hoping for and ready<br/>\n&gt;for a happy day, and this day was no different.  I gave everyone hugs and<br/>\n&gt;asked them how they slept.  I asked everyone if they were hungry.  They<br/>\n&gt;wanted Frosted Flakes.  I poured them each a bowl and afterward offered <br/>\n&gt;some<br/>\n&gt;peanut butter in a spoon (something they like), because in the past a <br/>\n&gt;simple<br/>\n&gt;bowl of cereal has preceded grumpiness and them being hungry very shortly<br/>\n&gt;after eating.  4yo didn&#39;t want any, but 3yo  and 1yo ate a little.  Then<br/>\n&gt;they all wanted a movie, even though I had offered both the beach and to<br/>\n&gt;make plaster of paris creatures using balloons and then painting them with<br/>\n&gt;acrylic paint.  They also ate red vines.  My three year old asked for her<br/>\n&gt;6th red vine and I suggested that we had some other snacks too.  Would she<br/>\n&gt;like an apple or some cheese?  4 yo squeals, &quot;Yes! and apple!and some<br/>\n&gt;chocolate bears!&quot;  3 yo screams,!<br/>\n&gt; &gt;   &quot;NO and stomps her feet and crosses her arms and demands red vines.&quot;  <br/>\n&gt;I<br/>\n&gt;gave her another red vine, cored and sliced and apple and gave everyone <br/>\n&gt;some<br/>\n&gt;bears.  4 yo says she doesn&#39;t have enough bears even before eating one.  I<br/>\n&gt;told her that if she was still hungry afterward and wanted more, she could<br/>\n&gt;have some.  I started cleaning up the very messy kitchen that didn&#39;t get<br/>\n&gt;cleaned the night before.  Before I could even get the dish water started, <br/>\n&gt;4<br/>\n&gt;yo says she is full and leaves the table full of uneaten apple<br/>\n&gt;wedges--beautiful, crispy, tart-sweet Braeburns that she used to love.  I<br/>\n&gt;bite my tongue and ate them myself even though I&#39;m not hungry.  I also<br/>\n&gt;peeled one wedge and gave it to the baby.   I hate to see them turn brown<br/>\n&gt;and go to waste.  Then, about 20 minutes later, 4 yo comes up to me and <br/>\n&gt;says<br/>\n&gt;she&#39;s hungry.  She asked me for chocolate bears.  3 yo asked for more red<br/>\n&gt;vines.  They have been fighting and whining and screaming at each other and<br/>\n&gt;me all morning.  I said no to!<br/>\n&gt; &gt;   more bears and vines and 3 yo started screaming at me and stomping he<br/>\n&gt; &gt; r feet.  I held her firmly by the arms and said, &quot;Enough!  I don&#39;t like <br/>\n&gt;to<br/>\n&gt;be screamed at.&quot;  She started crying and stomping her feet and finally went<br/>\n&gt;off to play.&lt;&lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Again, your disapproval of their choices comes through loud and clear.<br/>\n&gt;You are also still doling out the food in quantities that you decide on, <br/>\n&gt;and<br/>\n&gt;asking them to &quot;wait until dinner&quot;.  You are upset because things are <br/>\n&gt;&quot;going<br/>\n&gt;to waste&quot; and &quot;biting your toungue&quot; at your kids while you describe a piece<br/>\n&gt;of fruit as &quot;beautiful and crispy&quot;.  And you ate the fruit even though you<br/>\n&gt;weren&#39;t hungry.  That was your choice based on your ideas of the &quot;Right way<br/>\n&gt;to handle leftover food&quot;.  I know that you are thinking of the money it<br/>\n&gt;takes to buy the food you have, and how much could be saved if things<br/>\n&gt;weren&#39;t wasted.   But when it comes right down to it....an apple has become<br/>\n&gt;a higher priority than the kids.<br/>\n&gt; &gt;<br/>\n&gt; &gt;   If they don&#39;t eat all the apple wedges, sprinkle them with lemon juice<br/>\n&gt;and put them in a zip lock bag.  They won&#39;t turn brown then.  Or, cook them<br/>\n&gt;down and make applesauce or compote out of them.<br/>\n&gt; &gt;   Can you just put all the food where they can freely access it?  And <br/>\n&gt;then<br/>\n&gt;just let them pick and choose what they want in whatever quantity they <br/>\n&gt;want.<br/>\n&gt;That way you don&#39;t have to decide how much they should have of what.  They<br/>\n&gt;can decide for themselves.  Of course, then you will have to deal with the<br/>\n&gt;same problem I have....keeping enough around so that they aren&#39;t hording it<br/>\n&gt;:o).<br/>\n&gt; &gt;<br/>\n&gt; &gt;   It leaves the kitchen a bit of a mess, for sure.  And you&#39;ll have to<br/>\n&gt;deal with your feelings of things &quot;going to waste&quot;.  But the trade off is<br/>\n&gt;that they will learn how to eat in a way that satisfies their hunger,<br/>\n&gt;without attatching any particular signigicance to food.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   &gt;&gt; It seems like the more I freedom I give, the ruder they get with me<br/>\n&gt;and each other.  &lt;&lt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Are you really giving them freedom?  Or are you giving them the <br/>\n&gt;illusion<br/>\n&gt;of freedom while you monitor everything they do and hope they change?  It<br/>\n&gt;sounds like you are still holding on to your idea of &quot;the way things should<br/>\n&gt;be&quot; and hoping that by letting go of controls, they&#39;ll just naturally<br/>\n&gt;gravitate toward what you believe.<br/>\n&gt; &gt;<br/>\n&gt; &gt;   If you are really going to let go of controls, you have to let them<br/>\n&gt;develop their own...and they may not be the same as yours.<br/>\n&gt; &gt;<br/>\n&gt; &gt;   Kristen<br/>\n&gt; &gt;<br/>\n&gt; &gt; [Non-text portions of this message have been removed]<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Visit the Unschooling website and message boards:<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; &gt; Yahoo! Groups Links<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093143110","msgId":98703,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyZjIwMWM0ODdmMiRmYTRhNWY3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDFjYS4yOTNiOGM3Mi4yZTU5MWI1YkBhb2wuY29tPiA8MDA0ZTAxYzQ4N2UxJGFlNTdkNjgwJDZiYzIwOTQ1QENEMDIxMjIwMTEzMT4="},"prevInTopic":98701,"nextInTopic":98706,"prevInTime":98702,"nextInTime":98704,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"My latest one is I will be rewarded for remaining calm... Where I would before whip myself into a frenzy over lost keys, I breathe and repeat and there they","messageBody":"<div id=\"ygrps-yiv-73433242\">My latest one is &quot;I will be rewarded for remaining calm...&quot; Where I would<br/>\nbefore whip myself into a frenzy over lost keys, I breathe and repeat and<br/>\nthere they are -- three times this week already!  :)  &quot;This too shall pass&quot;<br/>\n&quot;I love my children&quot; ;) &quot;I CAN do this&quot;  have all helped at different times.<br/>\nFind yours, it will get you through the moment :)  ~~<br/>\n==========================<br/>\n<br/>\nI hope I&#39;ll get better at this.  I keep working at it.  Sometimes I have to<br/>\nremove myself and go to another room and close the door for a minute.  I do<br/>\nmanage to calm down enough to carry on, but I don&#39;t always feel any less<br/>\naggravated  when I think about what aggravated me in the first place.  I<br/>\nhave a hard time thinking differently, even when I calm down little.  I<br/>\ndon&#39;t have time to give myself &quot;more time&quot;.  Does anyone know what I&#39;m<br/>\ntalking about?<br/>\n<br/>\n~Andrea<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;diana jenner&quot; &lt;hahamommy@...&gt;<br/>\nTo: &lt;UnschoolingDiscussion@yahoogroups.com&gt;<br/>\nSent: Saturday, August 21, 2004 5:48 PM<br/>\nSubject: Re: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n<br/>\n<br/>\n&gt; &gt;&gt;Learn to calm yourself with deep breathing. Find some self-talk things<br/>\n&gt; (affirmations, some kind of personal encouragement) to remind yourself why<br/>\n&gt; you want to do what you want to do.  Fill your head with the  kind of<br/>\nmother<br/>\n&gt; you want to be.  Try to be with other such mothers so you can emulate<br/>\n&gt; them.&lt;&lt;<br/>\n&gt;<br/>\n&gt; My latest one is &quot;I will be rewarded for remaining calm...&quot; Where I would<br/>\n&gt; before whip myself into a frenzy over lost keys, I breathe and repeat and<br/>\n&gt; there they are -- three times this week already!  :)  &quot;This too shall<br/>\npass&quot;<br/>\n&gt; &quot;I love my children&quot; ;) &quot;I CAN do this&quot;  have all helped at different<br/>\ntimes.<br/>\n&gt; Find yours, it will get you through the moment :)  ~~diana<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ---<br/>\n&gt; Outgoing mail is certified Virus Free.<br/>\n&gt; Checked by AVG anti-virus system (http://www.grisoft.com).<br/>\n&gt; Version: 6.0.742 / Virus Database: 495 - Release Date: 8-19-2004<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\nhttp://www.unschooling.com<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093142687","msgId":98701,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyZTMwMWM0ODdmMSRmZTM5NDI1MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDE0LjMxN2JlNTliLjJlNTkzNWQyQGFvbC5jb20+IDwwMDIzMDFjNDg3ZDkkMzI3OGQ4NTAkMDIwMWE4YzBAa3Jpc3RlbnNjb21wdXRlPg=="},"prevInTopic":98700,"nextInTopic":98703,"prevInTime":98700,"nextInTime":98702,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"Those conflicts between our values/expectations, and the reality of our children is what creates the annoyance we feel, moment by moment. Its also those","messageBody":"<div id=\"ygrps-yiv-1557079892\">Those conflicts between our values/expectations, and the reality of our<br/>\nchildren is what creates the annoyance we feel, moment by moment.<br/>\n<br/>\nIts also those conflicts that we need to look at.  Where did we get our<br/>\nvalues?  Why do we have this or that expectation?  And when we start<br/>\nthinking about where it all came from, and what its all based in, then we<br/>\ncan change what our values/expectations are, leading to less annoyances (and<br/>\nmore peace of mind).<br/>\n<br/>\nDoes that make sense?<br/>\n=======================<br/>\n<br/>\nYes, it does.  I&#39;ll give it some more thought, too.<br/>\n<br/>\nThanks,<br/>\nAndrea</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093142236","msgId":98700,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyYjMwMWM0ODdmMCRmMTEyZDJlMCQxY2FlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDE5Ny4yZDVjYzZkNC4yZTU5NGVjOEBhb2wuY29tPg=="},"prevInTopic":98698,"nextInTopic":98701,"prevInTime":98699,"nextInTime":98701,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"You have a need to spend more interactive time with them? I d hope you were doing that for their benefit. ========================= I mean as oppossed to","messageBody":"<div id=\"ygrps-yiv-136930865\">You have a need to spend more interactive time with them?<br/>\nI&#39;d hope you were doing that for their benefit.<br/>\n=========================<br/>\n<br/>\nI mean as oppossed to sitting around the tv for several hours a day.  They&#39;d<br/>\nlove for me to do that.  I don&#39;t usually.  Sometimes I do other things while<br/>\nthey watch tv (though not always.)  I didn&#39;t mean to say I&#39;d have them do<br/>\nthings with me, interactive or not, that they didn&#39;t want to do.<br/>\n<br/>\nJust wanted to clarify.<br/>\n<br/>\nTo others who have responded to my original posts--thank you.  I will<br/>\nrespond as I can...usually can&#39;t do much during the day.  When I do, there<br/>\nare even more problems around here than usual.  I do appreicate your taking<br/>\nthe time read and then offer me your advice and insights.<br/>\n<br/>\n~Andrea</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093137608","msgId":98698,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5Ny4yZDVjYzZkNC4yZTU5NGVjOEBhb2wuY29tPg=="},"prevInTopic":98696,"nextInTopic":98700,"prevInTime":98697,"nextInTime":98699,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/21/2004 5:50:33 PM Mountain Daylight Time, aburlingame@centurytel.net writes: And, if so, does it always supercede other needs like what","messageBody":"<div id=\"ygrps-yiv-1800797182\">In a message dated 8/21/2004 5:50:33 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a> writes:<br/>\nAnd, if so, does it always supercede other needs like what seems to be their<br/>\nneed for some structure <br/>\n------------<br/>\n<br/>\nI think the slightest whim supercedes a young child&#39;s &quot;need for structure,&quot; <br/>\nwhen reported by a parent.<br/>\n<br/>\nReally.<br/>\nIf your child needs structure, she will create it.<br/>\nPerhaps the structure she wants is to watch that video. &lt;g&gt;<br/>\n<br/>\n-=-or my need for peace and quiet<br/>\nor to spend more interactive time with them?<br/>\n-=-<br/>\n<br/>\nYour need for peace and quiet was forfeited when you got pregnant.  Those <br/>\nlast few months before the baby came were  about the last rest before they&#39;re <br/>\nolder.  Bummer.  I can&#39;t change it.  <br/>\n<br/>\nLots of parents do change it but there&#39;s a high cost.  They lose the <br/>\nrelationship with their child.<br/>\n<br/>\nYou have a need to spend more interactive time with them?<br/>\nI&#39;d hope you were doing that for their benefit.<br/>\nYou need to propose something they really want to do.<br/>\nBe fascinating.  Be funny.  Be surprising.<br/>\n<br/>\n=&#92;=But you&#39;re taking about really little kids who might go to school.  It&#39;s <br/>\nnot<br/>\nan unschooling matter, in several ways, in my opinion.<br/>\n==============<br/>\n-=-I have never planned to send my kids to school.=&#92;=<br/>\n<br/>\nBut if you DID plan to send them to school, you&#39;d still be where you are now, <br/>\nwith the same situation.<br/>\n<br/>\n-=- Maybe it is all just a vicious cycle.  I want out.-=-<br/>\n<br/>\nDo you have a charge card?  You could move to another continent and never <br/>\nlook back.<br/>\nI bet you don&#39;t want out that badly.<br/>\nYou&#39;re where you are by choice.  If you waste any energy misguidedly thinking <br/>\nyou have no choice, it&#39;s a wste of good martyrdom.  You could put them up for <br/>\nadoption.  You could apply for government funding of some kind for daycare <br/>\nwhile you went to college (like THAT would give you more free time and peace...)<br/>\n<br/>\nBut you&#39;re choosing to be home and take care of your children.  You&#39;re not <br/>\ntrapped.  <br/>\nSee it as a choice and it will give you power.  It will make you big and real <br/>\nto have a choice.<br/>\nIt&#39;s how kids become big and real too, ultimately.<br/>\n<br/>\n-=-  Sometimes<br/>\nI&#39;m just too overwhelmed like the last couple of days.  I&#39;ll start fresh<br/>\nagain tomorrow.  -=-<br/>\n<br/>\nWhy tomorrow?  Why not now?  The next breath you take, take a deeper breath <br/>\nthan you usually do.  Hold it a little longer than you ordinarily would.  <br/>\nChoose to let it out slowly.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeedmag.com/HEM/HEM154.98/154.98_clmn_unschl.html\">http://www.homeedmag.com/HEM/HEM154.98/154.98_clmn_unschl.html</a><br/>\n<br/>\nSomething about new days, and mornings.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":194790463,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093135683","msgId":98696,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGUwMWM0ODdlMSRhZTU3ZDY4MCQ2YmMyMDk0NUBDRDAyMTIyMDExMzE+","referencesHeader":"PDFjYS4yOTNiOGM3Mi4yZTU5MWI1YkBhb2wuY29tPg=="},"prevInTopic":98686,"nextInTopic":98698,"prevInTime":98695,"nextInTime":98697,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"... (affirmations, some kind of personal encouragement) to remind yourself why you want to do what you want to do.  Fill your head with the  kind of mother you","messageBody":"<div id=\"ygrps-yiv-1581899642\"><blockquote><span title=\"ireply\">&gt;&gt;Learn to calm yourself with deep breathing. Find some self-talk things<br/>\n </span></blockquote>(affirmations, some kind of personal encouragement) to remind yourself why<br/>\nyou want to do what you want to do.  Fill your head with the  kind of mother<br/>\nyou want to be.  Try to be with other such mothers so you can emulate<br/>\nthem.&lt;&lt;<br/>\n<br/>\nMy latest one is &quot;I will be rewarded for remaining calm...&quot; Where I would<br/>\nbefore whip myself into a frenzy over lost keys, I breathe and repeat and<br/>\nthere they are -- three times this week already!  :)  &quot;This too shall pass&quot;<br/>\n&quot;I love my children&quot; ;) &quot;I CAN do this&quot;  have all helped at different times.<br/>\nFind yours, it will get you through the moment :)  ~~diana<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.742 / Virus Database: 495 - Release Date: 8-19-2004</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093132038","msgId":98685,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMjMwMWM0ODdkOSQzMjc4ZDg1MCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+","referencesHeader":"PDE0LjMxN2JlNTliLjJlNTkzNWQyQGFvbC5jb20+"},"prevInTopic":98680,"nextInTopic":98686,"prevInTime":98684,"nextInTime":98686,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"-=-This is too simplistic.  The apple hasn t become more important than my kids. ","messageBody":"<div id=\"ygrps-yiv-257531160\">-=-This is too simplistic.  The apple hasn&#39;t become more important than my<br/>\nkids. &lt;&lt;&lt;&lt;<br/>\n<br/>\n<br/>\nI wanted to clarify this.  I wasn&#39;t saying that in general, food is more important than your kids. I know that isn&#39;t true.  I was talking about a single instantaneous moment of time.  For a single instant (and it happens to everyone!) your values about wasting food became just a little more important than the fact that the kids didn&#39;t want to eat it.<br/>\n<br/>\nThose conflicts between our values/expectations, and the reality of our children is what creates the annoyance we feel, moment by moment.<br/>\n<br/>\nIts also those conflicts that we need to look at.  Where did we get our values?  Why do we have this or that expectation?  And when we start thinking about where it all came from, and what its all based in, then we can change what our values/expectations are, leading to less annoyances (and more peace of mind).<br/>\n<br/>\nDoes that make sense?<br/>\n<br/>\nKristen<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093132029","msgId":98686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxNTkwMWM0ODdkOSQ1OGU3OGY0MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDFjYS4yOTNiOGM3Mi4yZTU5MWI1YkBhb2wuY29tPg=="},"prevInTopic":98685,"nextInTopic":98696,"prevInTime":98685,"nextInTime":98687,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"============= Don t remove your structuress.  Just say yes more. ============= This is what I ve been trying to do.  I don t think it would be practical to ","messageBody":"<div id=\"ygrps-yiv-1044424589\">=============<br/>\nDon&#39;t remove your structuress.  Just say yes more.<br/>\n=============<br/>\n<br/>\nThis is what I&#39;ve been trying to do.  I don&#39;t think it would be practical to<br/>\njust eliminate all of what little structure we have.  OMG--total chaos!<br/>\nThanks for the link.  I&#39;ve read that one before and will read it again (and<br/>\nagain, I&#39;m sure.)<br/>\n<br/>\nAlso, by structure, do you mean current implied limits?  or personal<br/>\nboundaries?  Can you explain this more fully?  I&#39;ll also check the link<br/>\nagain.<br/>\n<br/>\n====================<br/>\nIf you find some sing-along videos or other happy kids&#39; shows you can stand<br/>\nto listen to, just leave them on all the time, then there&#39;s no asking.<br/>\n===================<br/>\n<br/>\nUgh...I do this.  I&#39;m getting better at tuning it out, but not if they also<br/>\nbicker most of the day and then come and ask me for more and more in between<br/>\nbickering.  I&#39;ve been lately considering showing Stella, my very bright 4<br/>\nyo, how to more fully operate the DVD player so she can just put something<br/>\nin if she wants to watch.  A small part of what&#39;s annoying about them<br/>\nwatching is having to set it up so often--usually right when I&#39;m in the<br/>\nmiddle of something else.<br/>\n<br/>\n====================<br/>\nMaybe unschooling won&#39;t work for you.  it&#39;s hard, but I think in any case in<br/>\nwhich a parent can&#39;t put the kids&#39; needs first, it&#39;s going to be a problem.<br/>\nOthers might disagree with me, but that&#39;s what I think.<br/>\n====================<br/>\n<br/>\nI can put my kid&#39;s needs first.  That&#39;s what I do daily. I wouldn&#39;t be at<br/>\nhome trying so hard if I wasn&#39;t putting their needs first.    Still, is<br/>\nwatching a tv really a need, beyond the need to choose their own activity?<br/>\nAnd, if so, does it always supercede other needs like what seems to be their<br/>\nneed for some structure (4 yo thrives on more structure I notice, though 3<br/>\nyo chafes a bit under outside limitations), or my need for peace and quiet<br/>\nor to spend more interactive time with them?<br/>\n<br/>\n==============<br/>\nBut you&#39;re taking about really little kids who might go to school.  It&#39;s not<br/>\nan unschooling matter, in several ways, in my opinion.<br/>\n==============<br/>\n<br/>\nI have never planned to send my kids to school.<br/>\n<br/>\n==============<br/>\nMaybe they&#39;re grumpier when  you&#39;re grumpier, and you&#39;re saying it makes you<br/>\ngrumpy, right?<br/>\n==============<br/>\n<br/>\nIt does make me grumpy, but I don&#39;t think I&#39;d be nearly as grumpy if they<br/>\nweren&#39;t also fighting alot and so on.  I think it&#39;s all feeling a bit<br/>\njumbled at this point.  I&#39;d be lying if I said that it doesn&#39;t bother and<br/>\nworry me that they watch so much tv.  So maybe that&#39;s part of why the sound<br/>\nof tv bothers me, even though I&#39;ve always detested tv on (and on and on) in<br/>\nthe daytime.  Maybe it is all just a vicious cycle.  I want out.<br/>\n<br/>\n=================<br/>\nCan you get out of the house every day?  Can you go to a different park, a<br/>\nmall, a place with a loading dock and a ramp?<br/>\n=================<br/>\n<br/>\nThis is one thing that works really well for us, though we don&#39;t always get<br/>\nout everyday.  We go to the beach, the park.  Thrift stores are fun, because<br/>\nthey can play with the toys.  Portland had many more destinations, but we<br/>\nstill do alright.  The beach is an endless source of fun for us all.<br/>\nDepends on weather, money and kids, but we try to get out every day and do<br/>\nsomething.  Sometimes they just don&#39;t want to go--usually the 3 yo is most<br/>\nresisitant to going to the beach, but she has fun once we get there.  But,<br/>\nyes, going somewhere is a sanity saver for us all.<br/>\n<br/>\n=================<br/>\nLearn to calm yourself with deep breathing.<br/>\nFind some self-talk things (affirmations, some kind of personal<br/>\nencouragement) to remind yourself why you want to dowhat you want to do.<br/>\nFill your head<br/>\nwith the  kind of mother you want to be.  Try to be with other such mothers<br/>\nso<br/>\nyou can emulate them.<br/>\n=================<br/>\n<br/>\nI&#39;m trying these things.  I am not even close to breaking my old habits,<br/>\nthough and still yell.  Somedays are MUCH better than others, though, and I<br/>\nkeep thinking I&#39;ll be able to turn the corner on calming myself.  Sometimes<br/>\nI&#39;m just too overwhelmed like the last couple of days.  I&#39;ll start fresh<br/>\nagain tomorrow.  Something has to give soon.  I really do want to be a<br/>\nbetter mother and I do plan to unschool.<br/>\n<br/>\nThank you for this list.  It inspires me more than I can say.  I just wish I<br/>\ncould get to where I want to be faster.<br/>\n<br/>\n~Andrea</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093131419","msgId":98680,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTIwMWM0ODdkNyRjMTZkMjMxMCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+","referencesHeader":"PDAwMTYwMWM0ODdhZCQ5MzAzODU3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4gPDAwMGUwMWM0ODdiZSQxNGVjYjY1MCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+IDwwMTBkMDFjNDg3Y2QkMTFlMGZmMjAkMWNhZWNlZDFAaGVyb25vZmZpY2U+"},"prevInTopic":98679,"nextInTopic":98685,"prevInTime":98679,"nextInTime":98681,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"Are you saying that my kids are asking for tv because it annoys me?  I don t think this is the case. Oh, no, of course not.  I was thinking that if they sense","messageBody":"<div id=\"ygrps-yiv-862268464\">Are you saying that my kids are asking for tv because it annoys me?  I don&#39;t<br/>\nthink this is the case.<br/>\n<br/>\nOh, no, of course not.  I was thinking that if they sense your disapproval, then they too are going to be conflicted, and are not really making choices of their own then.  I was thinking that maybe it was prolonging their need to &#39;test boundaries&#39;.  Just a thought though.<br/>\n<br/>\nBut I also wonder if that isn&#39;t the case with most of the things you are finding frustrating.<br/>\n<br/>\nIt is really hard to have kids the ages that yours are.  Mine were spaced 3 years apart, which made it a *little* easier, though I just had different challenges.  What I have found over the years with all ages so far, is that its easier to set things up to avoid a problem (like the big platter with food, instead of individual servings, which I hadn&#39;t thought of) than it is to treat the problem after there is one.<br/>\n<br/>\nDoes that make sense?<br/>\n<br/>\nThe other thing I have found to really help me is to ask myself how important it really truly is, and whether or not I would try to control these things when they are 20.  <br/>\n<br/>\nKristen<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Andrea Burlingame <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Saturday, August 21, 2004 3:20 PM<br/>\n  Subject: Re: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n<br/>\n<br/>\n  Its good to remove her from the situation but at the age of 3, is it<br/>\n  possible to get her involved in something she likes rather than &quot;remove<br/>\n  her&quot;. Can she take a warm bath?  Do they all have to play together?<br/>\n  =============================<br/>\n<br/>\n  Oh, this is EXACTLY what I try to to do for her.   Sometimes she is<br/>\n  interested in another activity away from her sister, but lately she more<br/>\n  often just kicks her heel down over and over, grunts, throws things and<br/>\n  screams &quot;NO!&quot; at me when I make suggestions or offer somethign soothing.  I<br/>\n  have to just leave her alone for awhile when she does that, and eventually,<br/>\n  sometimes sooner, sometimes much later she comes around.<br/>\n  ............................................................................<br/>\n  .........................<br/>\n<br/>\n  Many 1 year olds pull hair.  Maybe find something similar for him to pull<br/>\n  on?<br/>\n  ============================<br/>\n<br/>\n  I realize that 1 year olds do this, although he is the first of my 4 to bite<br/>\n  as well.  I know it&#39;s normal and try to help the girls keep safe from him<br/>\n  and I distract him from it all the time.  He mostly does it when he is<br/>\n  frustrated, like when he wants to knock down their creations and they won&#39;t<br/>\n  let him.  I either have them go where he can&#39;t bother him, or sometimes I<br/>\n  just carry him in on my back, which he likes.  The main reason I mentioned<br/>\n  his hair pulling and biting and such, is because it is part of the whole<br/>\n  chaos around here.  It isn&#39;t that I don&#39;t expect it from<br/>\n  him.........................................................................<br/>\n  ..................<br/>\n<br/>\n    Your disapproval of tv first thing in the morning is very clear from your<br/>\n  post, and I&#39;m sure your kids are aware of it too.<br/>\n  ========================<br/>\n<br/>\n  Yes,  they know that I don&#39;t like the noise of the tv first thing in the<br/>\n  morning and they know I don&#39;t like the tv on as much as it&#39;s been on lately<br/>\n  either.   They also know I don&#39;t care for watching the same DVD&#39;s over and<br/>\n  over and over again, which is what happens here because we can&#39;t get any<br/>\n  network tv here and can&#39;t afford cable.  We get our DVD&#39;s from the library<br/>\n  and they trickle in a few each week I put 100 holds on titles.  It&#39;s<br/>\n  annoying to me to listen to the same theme songs and such over and over.<br/>\n<br/>\n  Are you saying that my kids are asking for tv because it annoys me?  I don&#39;t<br/>\n  think this is the case.<br/>\n  ............................................................................<br/>\n  ...................<br/>\n<br/>\n  Why do they have to do other things.  Can&#39;t they watch tv if they want?<br/>\n  ======================<br/>\n<br/>\n  They don&#39;t HAVE to do other things.  They usually enjoy doing other things.<br/>\n  They have been watching ALOT of tv lately.  I&#39;m sick of it, personally and<br/>\n  wish they wanted to do some crafts with me or go to the beach.  Watching the<br/>\n  same shows over and over again is really boring to me, and, YES, I&#39;m<br/>\n  dissappointed that they&#39;d rather do that than something more interactive<br/>\n  with me.<br/>\n  ............................................................................<br/>\n  ......................<br/>\n  Why does tv affect you this way?  It is clear that you do not like tv, but<br/>\n  have you ever thought about why?  Are you sure that your reasons for the<br/>\n  dislike are really valid?<br/>\n  =======================<br/>\n<br/>\n  I do like tv.  I love to watch Survivor.  I watched so many movies in my<br/>\n  life that it is rare to find one I haven&#39;t seen at the video store.  I just<br/>\n  don&#39;t really like it to be on during the day so much.  I have thought about<br/>\n  why.  I like to hear birds outside the window.  I like to hear my own<br/>\n  thoughts or to listen to music sometimes.  I like the quiet.  I also like to<br/>\n  talk and to listen to my children talk, which they don&#39;t do much when the tv<br/>\n  is on.  I&#39;ve always been this way, not just since my kids were born.  When I<br/>\n  was in the Air Force and had to live in a dorm with a roomate, I hated when<br/>\n  she&#39;d get home before me and turn her tv on and leave it on until she either<br/>\n  went out or to bed.  She wouldn&#39;t turn it off even if I asked, so I would<br/>\n  find somewhere else to be. (I eventually requested to be moved to another<br/>\n  room.)  When I was dating my first husband, he kept the tv on low or muted<br/>\n  and tuned to the cartoon channel for ambiance.  Ugh.  I hated that.  Even<br/>\n  when it was muted, I hated the visual &quot;noise.&quot;  I just don&#39;t like the tv on<br/>\n  very much.<br/>\n  ............................................................................<br/>\n  .......................<br/>\n<br/>\n  Is it possible you are setting up a power struggle with the kids because<br/>\n  although you haven&#39;t said no, you would feel much better if you did?<br/>\n<br/>\n  I&#39;m sure of it.<br/>\n  ............................................................................<br/>\n  ......................<br/>\n<br/>\n    Is it the tv?  Or is it that they sense your disapproval?<br/>\n  ============================<br/>\n  I believe the tv is partly to blame for the irritableness and short -tempers<br/>\n  around here.  I have seen it over and over again with my kids and myself.<br/>\n  I&#39;ve seen it when I wasn&#39;t looking for it.  My experience with my children<br/>\n  is that when they spent several hours a day sitting in front of the tv to<br/>\n  watch a movie or whatever, they end up with excess energy and are also much<br/>\n  more irritable.  I don&#39;t think they are sniping at each other because I let<br/>\n  them watch tv when I didn&#39;t want to.<br/>\n  ............................................................................<br/>\n  ...................<br/>\n<br/>\n    Are you actually *with* your kids while they are doing things that<br/>\n  interest them?  Are you content just being with them doing whatever they<br/>\n  like to do (even if its tv)?  Or are you using the time that they are<br/>\n  occupied to &quot;get things done&quot;.  If you are using that time to &quot;Get things<br/>\n  done&quot;, they are going to drop what they are doing to get your<br/>\n  attention...even if you&#39;re only MIA for 10 minutes.  Its the nature of the<br/>\n  age.<br/>\n  ===============================<br/>\n<br/>\n  I watch things with them often, but not all of the time.  Sometimes I wash<br/>\n  dishes or cook dinner. Sometimes I sit in the same room and read the posts<br/>\n  on this list.  Other times I sit down with them and knit or nurse the baby,<br/>\n  or just watch with them.  Since the baby doesn&#39;t really watch much yet, I am<br/>\n  often playing with him.<br/>\n  ............................................................................<br/>\n  .....................<br/>\n<br/>\n  When you have children so young, arriving at a &#39;place of peace&quot; does not<br/>\n  mean that you get time to yourself :o).<br/>\n  =================<br/>\n<br/>\n  I&#39;ve noticed! LOL  No, really, though, when I say a &quot;place of peace&quot;  I just<br/>\n  mean that I want people to use civil tones around here and  for there to be<br/>\n  less fighting and hollering.   I realize that it may take awhile.  I&#39;m just<br/>\n  tired.  I also wish I could stay calmer in the storm.<br/>\n  ............................................................................<br/>\n  .....................<br/>\n<br/>\n    And having &quot;peace&quot; starts with your own state of mind.  You are having<br/>\n  trouble letting go of controls to begin with.  That is creating a conflict<br/>\n  for your state of mind.  I suspect a lot of this follows from that conflict.<br/>\n  ======================<br/>\n  I think this is pretty accurate for me.  I keep trying to meditate and use<br/>\n  affirmations.  I&#39;m terrible at it.  I feel WAY behind the eight-ball, so to<br/>\n  speak.  If only things would stay calm for a few days and let me refresh<br/>\n  myself.  If only...<br/>\n  ............................................................................<br/>\n  ......................<br/>\n    &gt;&gt;Yesterday we went shopping. &lt;&lt;<br/>\n<br/>\n    Big mistake.  There is no reason why you should take 3 young kids shopping<br/>\n  with you (unless there are circumstances that I missed somewhere).  There is<br/>\n  no reason why you need to do that to yourself.<br/>\n  ===========================<br/>\n<br/>\n  I have no choice.  Nobody here to leave them with, and no money for a sitter<br/>\n  (or for the groceries for that matter--I think I overdrew my account<br/>\n  accidently!)  They are pretty well-behaved in grocery stores actually.  We<br/>\n  have fun.  They ask for alot, but don&#39;t pitch fits when I do have to say no.<br/>\n  Occasionally the three year old will cause trouble by not coming along with<br/>\n  me or by standing up in the cart if I insist she ride there if she&#39;s<br/>\n  misbehaving, but usually people compliment me on what &quot;well-behaved&quot; or<br/>\n  &quot;nice&quot; children I have.  This happens most places we go, actually.<br/>\n  ............................................................................<br/>\n  .....................<br/>\n<br/>\n    Is there a reason why the 3 yo couldn&#39;t watch the movie while you did<br/>\n  things with the baby and 4 year old?  Honestly, it really sounds as if they<br/>\n  are testing you to see if you are really going to let *them* make the<br/>\n  choices.<br/>\n  ===================<br/>\n<br/>\n  The movie wasn&#39;t the issue for the 3 yo.  She had already started playing<br/>\n  with her dollies more than she was watching.  The transition was what got<br/>\n  her going.  Even if she really wanted to watch the movie, I wouldn&#39;t have<br/>\n  let her watch it alone.  It was Close Encounters of the Third Kind.  I was<br/>\n  going to watch it after they were asleep, but they asked me to watch it with<br/>\n  me, and I thought it would be fun, but the baby was putting the nix on that<br/>\n  plan by standing in front of the screen, pulling hair and throwing blocks.<br/>\n  I couldn&#39;t let the 3 yo watch without me there close by, so I suggested<br/>\n  something else to do and we&#39;d try the movie again later when baby was<br/>\n  asleep.<br/>\n  ............................................................................<br/>\n  .....................<br/>\n<br/>\n    Again, your disapproval of their choices comes through loud and clear.<br/>\n  You are also still doling out the food in quantities that you decide on, and<br/>\n  asking them to &quot;wait until dinner&quot;.<br/>\n  ====================<br/>\n  I only ASKED if they could wait, because I was in the middle of making them<br/>\n  something they asked me to make.  They didn&#39;t seem to mind.  I was fully<br/>\n  prepared to give them the red vines if they still wanted it then.  I was<br/>\n  very conscious of that possibility when I asked.<br/>\n  ............................................................................<br/>\n  .....................<br/>\n<br/>\n  You are upset because things are &quot;going to waste&quot; and &quot;biting your toungue&quot;<br/>\n  at your kids while you describe a piece of fruit as &quot;beautiful and crispy&quot;.<br/>\n  And you ate the fruit even though you weren&#39;t hungry.  That was your choice<br/>\n  based on your ideas of the &quot;Right way to handle leftover food&quot;.<br/>\n  =====================<br/>\n  It does bother me when I prepare food that someone has asked to prepare and<br/>\n  it just sits there uneaten or with a single bite taken out.  I ate the fruit<br/>\n  because I was already overwhelmed with things to do and the baby was wanting<br/>\n  to nurse and I didn&#39;t have the time or lemon on hand to do something else (I<br/>\n  actually considered saving them just as you have described.). I mentioned<br/>\n  the apple as being crisp and beautiful because sometimes my 4 yo won&#39;t eat<br/>\n  an apple if it&#39;s grainy or doesn&#39;t look just right.  My point was that it<br/>\n  was just how she normally likes it.<br/>\n  ............................................................................<br/>\n  ....................<br/>\n    I know that you are thinking of the money it takes to buy the food you<br/>\n  have, and how much could be saved if things weren&#39;t wasted.   But when it<br/>\n  comes right down to it....an apple has become a higher priority than the<br/>\n  kids.<br/>\n  ===========================<br/>\n  This is too simplistic.  The apple hasn&#39;t become more important than my<br/>\n  kids.  It wouldn&#39;t have mattered what food it was, a bowl of ice cream or<br/>\n  some cookies and milk or broccolli and dip or apples, I would still have<br/>\n  been equally annoyed if she asked and I prepared and served and she decided<br/>\n  she was too full and then 20 minutes later asked me for something else.  She<br/>\n  rejected the apple and that did bother me, yes, but I was also bothered by<br/>\n  the seeming onslaught of demands and my inability to do anything that<br/>\n  satisfied them, no matter how I tried.  It seems to me that my children are<br/>\n  becoming more dissatisfied rather than less so as I pull away limits.  I<br/>\n  really do want to give them more choice and I want to accept their choices<br/>\n  with equal grace, but I don&#39;t want to be around demanding children who can&#39;t<br/>\n  be pleased.  I&#39;m very frustrated and afraid to take it any further than I<br/>\n  have by letting them have total access--which would be very impractical with<br/>\n  a one year old running around too.<br/>\n<br/>\n  ~Andrea<br/>\n  ............................................................................<br/>\n  ......................<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  ----- Original Message ----- <br/>\n  From: &quot;Have a Nice Day!&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a>&gt;<br/>\n  To: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\n  Sent: Saturday, August 21, 2004 1:33 PM<br/>\n  Subject: Re: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n<br/>\n<br/>\n  &gt; I understand your need to explain it all, it sounds very chaotic and your<br/>\n  post conveys your frustration.  But it might be easier to try and sum up the<br/>\n  specific problems in order to arrive at some solutions.<br/>\n  &gt;<br/>\n  &gt; It sounds like the two major problems in your post are about TV and Food.<br/>\n  &gt;<br/>\n  &gt; See below.<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   ----- Original Message ----- <br/>\n  &gt;   From: Andrea Burlingame<br/>\n  &gt;   To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n  &gt;   Sent: Saturday, August 21, 2004 11:35 AM<br/>\n  &gt;   Subject: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt;They hit and kick each other.  The 3yo does this for no apparent<br/>\n  reason.  If I remove her from the scene, she yells screams and stomps her<br/>\n  feet andthen when she finally calms down 15-20 minutes later and lets me<br/>\n  hold her and care for her a bit, she goes right back in and starts bugging<br/>\n  someone. &lt;&lt;<br/>\n  &gt;<br/>\n  &gt;   Its good to remove her from the situation but at the age of 3, is it<br/>\n  possible to get her involved in something she likes rather than &quot;remove<br/>\n  her&quot;. Can she take a warm bath?  Do they all have to play together?<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt;&gt;The baby (1yo) pulls everyones hair and scratches and bites and<br/>\n  pinches when he is thwarted in any way (and sometimes for no apparent reason<br/>\n  he&#39;ll just run over and hurt one of the girls when they are watching<br/>\n  something on tv)&lt;&lt;&lt;<br/>\n  &gt;   Many 1 year olds pull hair.  Maybe find something similar for him to<br/>\n  pull on?<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt;Also, they want to watch tv (dvd&#39;s in our case, since we can&#39;t get tv<br/>\n  here and can&#39;t afford cable) first thing in the morning, before the sleep is<br/>\n  rubbed out of their eyes,&lt;&lt;<br/>\n  &gt;<br/>\n  &gt;   Your disapproval of tv first thing in the morning is very clear from<br/>\n  your post, and I&#39;m sure your kids are aware of it too.<br/>\n  &gt;<br/>\n  &gt;    &gt;&gt;and then ask for it every hour or more all day long, even when I have<br/>\n  other things to do with them. &lt;&lt;<br/>\n  &gt;<br/>\n  &gt;   Why do they have to do other things.  Can&#39;t they watch tv if they want?<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt;I haven&#39;t been saying no except for when I just don&#39;t want to hear and<br/>\n  see the blasted thing anymore.  I don&#39;t really like the tv on in the<br/>\n  daytime.  It literally drones in my ears and I find it very distracting and<br/>\n  I start to feel depressed when it&#39;s on as much as it&#39;s been on lately.  If<br/>\n  it were up to me, we wouldn&#39;t have one. &lt;&lt;<br/>\n  &gt;<br/>\n  &gt;   Why does tv affect you this way?  It is clear that you do not like tv,<br/>\n  but have you ever thought about why?  Are you sure that your reasons for the<br/>\n  dislike are really valid?<br/>\n  &gt;<br/>\n  &gt;   Is it possible you are setting up a power struggle with the kids because<br/>\n  although you haven&#39;t said no, you would feel much better if you did?<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt;Plus, my kids are snippier and grumpier with alot of tv. &lt;&lt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   Is it the tv?  Or is it that they sense your disapproval?<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt;They are also more &quot;wired&quot;, literally bouncing off the walls after a<br/>\n  long session.  I&#39;ve seen it before when I&#39;ve eased up, and now I&#39;ve been<br/>\n  living with since June.  I keep hoping that they will get their fill and not<br/>\n  be so obsessed with watching it, but I&#39;m really starting to lose it.&lt;&lt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   But if you keep hoping things will change, then you aren&#39;t really giving<br/>\n  them the control.  You&#39;re giving them a reprieve from the status quo.  They<br/>\n  probably know that.  Maybe you need to come to terms with the idea that tv<br/>\n  is ok, and that if they are happy watching tv right now and you don&#39;t like<br/>\n  tv, then you can be happy finding something else to do, albeit with them.<br/>\n  And it would probably have to be something you can put down easily.<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt;With 3 little ones, there is constantly something going on that needs<br/>\n  my immediate attention.&lt;&lt;<br/>\n  &gt;<br/>\n  &gt;   I&#39;m absolutely sure you are right about that.<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt;(Since I sat down in desperation to write this, I&#39;ve stopped to<br/>\n  mediate a fight twice, got a snack for someone 3 times, kissed an &quot;owie&quot;<br/>\n  once, cleaned up an accident the 3 yo had, got the baby away from the<br/>\n  hamsters once and removed him from the girls&#39; room just now--all in a space<br/>\n  of what?  Maybe 10-15 minutes.  Argh!)  How do you get to a place of peace!?<br/>\n  I swear I&#39;ve been trying, but I keep failing miserably!&lt;&lt;<br/>\n  &gt;<br/>\n  &gt;   Are you actually *with* your kids while they are doing things that<br/>\n  interest them?  Are you content just being with them doing whatever they<br/>\n  like to do (even if its tv)?  Or are you using the time that they are<br/>\n  occupied to &quot;get things done&quot;.  If you are using that time to &quot;Get things<br/>\n  done&quot;, they are going to drop what they are doing to get your<br/>\n  attention...even if you&#39;re only MIA for 10 minutes.  Its the nature of the<br/>\n  age.<br/>\n  &gt;   When you have children so young, arriving at a &#39;place of peace&quot; does not<br/>\n  mean that you get time to yourself :o).<br/>\n  &gt;<br/>\n  &gt;   And having &quot;peace&quot; starts with your own state of mind.  You are having<br/>\n  trouble letting go of controls to begin with.  That is creating a conflict<br/>\n  for your state of mind.  I suspect a lot of this follows from that conflict.<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt;Yesterday we went shopping. &lt;&lt;<br/>\n  &gt;<br/>\n  &gt;   Big mistake.  There is no reason why you should take 3 young kids<br/>\n  shopping with you (unless there are circumstances that I missed somewhere).<br/>\n  There is no reason why you need to do that to yourself.<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt; They were happy.   They ate a red vine on the way home and then I<br/>\n  asked them to wait for more, since I was making dinner (Mac and Cheese,<br/>\n  which they had been asking me for all day.)  Fine.  One ate most of her<br/>\n  dinner and the other ate about half of a small bowl.  Said she was full.<br/>\n  Then they wanted ice cream.  I didn&#39;t say a word about being full, but got<br/>\n  them each a little bowl of ice cream.  They also ate another red vine.  We<br/>\n  tried to watch a movie at their request (they&#39;d already watched 3 that day),<br/>\n  but the baby wouldn&#39;t let us and it was getting late, so we went to feed and<br/>\n  play with the hamsters.  I suggested watching the movie later the next day,<br/>\n  and 4 yo was fine, but 3 yo balked, even though she wasn&#39;t really watching<br/>\n  the show anyway.  &lt;&lt;<br/>\n  &gt;<br/>\n  &gt;   Is there a reason why the 3 yo couldn&#39;t watch the movie while you did<br/>\n  things with the baby and 4 year old?  Honestly, it really sounds as if they<br/>\n  are testing you to see if you are really going to let *them* make the<br/>\n  choices.<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   This morning I got up at 7:30 and everyone else followed shortly<br/>\n  afterward.  I am usually very cheerful in the morning, hoping for and ready<br/>\n  for a happy day, and this day was no different.  I gave everyone hugs and<br/>\n  asked them how they slept.  I asked everyone if they were hungry.  They<br/>\n  wanted Frosted Flakes.  I poured them each a bowl and afterward offered some<br/>\n  peanut butter in a spoon (something they like), because in the past a simple<br/>\n  bowl of cereal has preceded grumpiness and them being hungry very shortly<br/>\n  after eating.  4yo didn&#39;t want any, but 3yo  and 1yo ate a little.  Then<br/>\n  they all wanted a movie, even though I had offered both the beach and to<br/>\n  make plaster of paris creatures using balloons and then painting them with<br/>\n  acrylic paint.  They also ate red vines.  My three year old asked for her<br/>\n  6th red vine and I suggested that we had some other snacks too.  Would she<br/>\n  like an apple or some cheese?  4 yo squeals, &quot;Yes! and apple!and some<br/>\n  chocolate bears!&quot;  3 yo screams,!<br/>\n  &gt;   &quot;NO and stomps her feet and crosses her arms and demands red vines.&quot;  I<br/>\n  gave her another red vine, cored and sliced and apple and gave everyone some<br/>\n  bears.  4 yo says she doesn&#39;t have enough bears even before eating one.  I<br/>\n  told her that if she was still hungry afterward and wanted more, she could<br/>\n  have some.  I started cleaning up the very messy kitchen that didn&#39;t get<br/>\n  cleaned the night before.  Before I could even get the dish water started, 4<br/>\n  yo says she is full and leaves the table full of uneaten apple<br/>\n  wedges--beautiful, crispy, tart-sweet Braeburns that she used to love.  I<br/>\n  bite my tongue and ate them myself even though I&#39;m not hungry.  I also<br/>\n  peeled one wedge and gave it to the baby.   I hate to see them turn brown<br/>\n  and go to waste.  Then, about 20 minutes later, 4 yo comes up to me and says<br/>\n  she&#39;s hungry.  She asked me for chocolate bears.  3 yo asked for more red<br/>\n  vines.  They have been fighting and whining and screaming at each other and<br/>\n  me all morning.  I said no to!<br/>\n  &gt;   more bears and vines and 3 yo started screaming at me and stomping he<br/>\n  &gt; r feet.  I held her firmly by the arms and said, &quot;Enough!  I don&#39;t like to<br/>\n  be screamed at.&quot;  She started crying and stomping her feet and finally went<br/>\n  off to play.&lt;&lt;&lt;<br/>\n  &gt;<br/>\n  &gt;   Again, your disapproval of their choices comes through loud and clear.<br/>\n  You are also still doling out the food in quantities that you decide on, and<br/>\n  asking them to &quot;wait until dinner&quot;.  You are upset because things are &quot;going<br/>\n  to waste&quot; and &quot;biting your toungue&quot; at your kids while you describe a piece<br/>\n  of fruit as &quot;beautiful and crispy&quot;.  And you ate the fruit even though you<br/>\n  weren&#39;t hungry.  That was your choice based on your ideas of the &quot;Right way<br/>\n  to handle leftover food&quot;.  I know that you are thinking of the money it<br/>\n  takes to buy the food you have, and how much could be saved if things<br/>\n  weren&#39;t wasted.   But when it comes right down to it....an apple has become<br/>\n  a higher priority than the kids.<br/>\n  &gt;<br/>\n  &gt;   If they don&#39;t eat all the apple wedges, sprinkle them with lemon juice<br/>\n  and put them in a zip lock bag.  They won&#39;t turn brown then.  Or, cook them<br/>\n  down and make applesauce or compote out of them.<br/>\n  &gt;   Can you just put all the food where they can freely access it?  And then<br/>\n  just let them pick and choose what they want in whatever quantity they want.<br/>\n  That way you don&#39;t have to decide how much they should have of what.  They<br/>\n  can decide for themselves.  Of course, then you will have to deal with the<br/>\n  same problem I have....keeping enough around so that they aren&#39;t hording it<br/>\n  :o).<br/>\n  &gt;<br/>\n  &gt;   It leaves the kitchen a bit of a mess, for sure.  And you&#39;ll have to<br/>\n  deal with your feelings of things &quot;going to waste&quot;.  But the trade off is<br/>\n  that they will learn how to eat in a way that satisfies their hunger,<br/>\n  without attatching any particular signigicance to food.<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;   &gt;&gt; It seems like the more I freedom I give, the ruder they get with me<br/>\n  and each other.  &lt;&lt;<br/>\n  &gt;<br/>\n  &gt;   Are you really giving them freedom?  Or are you giving them the illusion<br/>\n  of freedom while you monitor everything they do and hope they change?  It<br/>\n  sounds like you are still holding on to your idea of &quot;the way things should<br/>\n  be&quot; and hoping that by letting go of controls, they&#39;ll just naturally<br/>\n  gravitate toward what you believe.<br/>\n  &gt;<br/>\n  &gt;   If you are really going to let go of controls, you have to let them<br/>\n  develop their own...and they may not be the same as yours.<br/>\n  &gt;<br/>\n  &gt;   Kristen<br/>\n  &gt;<br/>\n  &gt; [Non-text portions of this message have been removed]<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n  &gt;<br/>\n  &gt; Visit the Unschooling website and message boards:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n  &gt; Yahoo! Groups Links<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n  &gt;<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n              ADVERTISEMENT<br/>\n             <br/>\n       <br/>\n       <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n  Yahoo! Groups Links<br/>\n<br/>\n    a.. To visit your group on the web, go to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/UnschoolingDiscussion/\">http://groups.yahoo.com/group/UnschoolingDiscussion/</a><br/>\n      <br/>\n    b.. To unsubscribe from this group, send an email to:<br/>\n    <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion-unsubscribe@yahoogroups.com\">UnschoolingDiscussion-unsubscribe@yahoogroups.com</a><br/>\n      <br/>\n    c.. Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093131218","msgId":98679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0LjMxN2JlNTliLjJlNTkzNWQyQGFvbC5jb20+"},"prevInTopic":98674,"nextInTopic":98680,"prevInTime":98678,"nextInTime":98680,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/21/2004 4:26:22 PM Mountain Daylight Time, aburlingame@centurytel.net writes: Are you saying that my kids are asking for tv because it","messageBody":"<div id=\"ygrps-yiv-1161242824\">In a message dated 8/21/2004 4:26:22 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a> writes:<br/>\nAre you saying that my kids are asking for tv because it annoys me?  I don&#39;t<br/>\nthink this is the case.<br/>\n--------------<br/>\n<br/>\nI don&#39;t think anyone was suggesting that, but if you&#39;re being cranky and <br/>\ncritical they&#39;ll feel it.<br/>\n<br/>\n-=-Watching the same shows over and over again is really boring to me-=-<br/>\n<br/>\nThen don&#39;t watch them with them every time.<br/>\n<br/>\nWill you read a book you&#39;ve read before?  Listen to music you&#39;ve heard <br/>\nbefore?  It&#39;s no different.  There is MORE input in a movie than either a book or a <br/>\nrecording, so if they like it and really want to process and know it all, they <br/>\nwill watch it over and over before they know all the lines and the songs.  <br/>\nThat&#39;s studying &lt;g&gt;.<br/>\n<br/>\n-=-and, YES, I&#39;m<br/>\ndissappointed that they&#39;d rather do that than something more interactive<br/>\nwith me.<br/>\n-=-<br/>\n<br/>\nI used to be disappointed if Kirby wasn&#39;t interested in something I was <br/>\ninterested in, but I&#39;m glad I got over it, because honestly it was selfish on my <br/>\npart, and a kind of distracted immaturity.  Everything went better when I <br/>\nlearned how to follow his interests, and find things he wanted to do.  When he was <br/>\nexcited, I was excited.  When I was sad, and he was sad, there was just a big <br/>\nwad of sadness.<br/>\n<br/>\n-=-I believe the tv is partly to blame for the irritableness and short <br/>\n-tempers<br/>\naround here.-=-<br/>\n<br/>\nI think if you have bad associations with a former roommate and ex husband <br/>\nyou should get through and over those issues so they don&#39;t affect your children. <br/>\n That might sound harsh, but really...  if you&#39;re outnumbered and haven&#39;t <br/>\noffered a more enticing alternative, they want to watch TV at their house.  Maybe <br/>\nyou can get a walkman and listen to birdsons or soothing music with <br/>\nheadphones.  If they want you they can come tug your pants if you don&#39;t see them.  You <br/>\nwould hear them call you over white-noise tapes or soothing tapes.<br/>\n<br/>\n-=-This is too simplistic.  The apple hasn&#39;t become more important than my<br/>\nkids.  It wouldn&#39;t have mattered what food it was, a bowl of ice cream or<br/>\nsome cookies and milk or broccolli and dip or apples, I would still have<br/>\nbeen equally annoyed if she asked and I prepared and served and she decided<br/>\nshe was too full and then 20 minutes later asked me for something else.  -=-<br/>\n<br/>\nYou  need to get over that, then.<br/>\nIt used to really bother my husband if he made food and people din&#39;t like it. <br/>\n But he was making things HE liked, and giving people big servings.  He got <br/>\nover it and everything&#39;s better.  What he does now is announce if food&#39;s ready, <br/>\nwait a while, and pack up leftovers into individual packages.  If it&#39;s not <br/>\neating in the next day or so  he takes them to work for lunches.  I tend to only <br/>\nmake what i know someone wants or likes.  Kirby doesn&#39;t like pork, so we have <br/>\nit when he&#39;s not home.  Holly likes spinach.  The boys don&#39;t. If it&#39;s just <br/>\nme, Keith and Holly, we have spinach merrily together!<br/>\n<br/>\nWe had to get loose, flexible, expecting happiness.<br/>\n<br/>\n-= It seems to me that my children are<br/>\nbecoming more dissatisfied rather than less so as I pull away limits.  I<br/>\nreally do want to give them more choice and I want to accept their choices<br/>\nwith equal grace, but I don&#39;t want to be around demanding children who can&#39;t<br/>\nbe pleased. -=-<br/>\n<br/>\nDon&#39;t do it if it&#39;s not working.<br/>\nYou might do better with the rules.  If you don&#39;t want to change or you don&#39;t <br/>\nthink it will work, change course.  We can&#39;t guarantee you anything.  We&#39;re <br/>\noffering options, but you don&#39;t have to choose any of them at all.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093127438","msgId":98670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNlLjU1ODBiNjU1LjJlNTkyNzBlQGFvbC5jb20+"},"prevInTopic":98669,"nextInTopic":98674,"prevInTime":98669,"nextInTime":98671,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/21/2004 2:45:57 PM Mountain Daylight Time, ... Big mistake.  There is no reason why you should take 3 young kids shopping with you (unless","messageBody":"<div id=\"ygrps-yiv-408239840\">In a message dated 8/21/2004 2:45:57 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a> writes:<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;Yesterday we went shopping. &lt;&lt;<br/>\n<br/>\n </span></blockquote>  Big mistake.  There is no reason why you should take 3 young kids shopping <br/>\nwith you (unless there are circumstances that I missed somewhere).  There is <br/>\nno reason why you need to do that to yourself<br/>\n--------<br/>\n<br/>\nSome of our finest memories are all three kids and me.  We&#39;d take two carts <br/>\nsometimes, two riding in one and the baaby in the baby seat of the <br/>\ngrocery-intended cart.  Or kids in the big basket of two, baby in the abby seat, and kids <br/>\nwould sort groceries into where they were.  Eggs or fragile things went in the <br/>\nextra baby seat.  I&#39;d pull one and push one and we&#39;d take our time, and talk, <br/>\nand joke, and sing.<br/>\n<br/>\n=&#92;=It sounds like you are still holding on to your idea of &quot;the way things <br/>\nshould be&quot; and hoping that by letting go of controls, they&#39;ll just naturally <br/>\ngravitate toward what you believe.<br/>\n=&#92;=<br/>\n<br/>\nIn case that idea rang true, here&#39;s  something related enough to help, about <br/>\nlooking for the wrong thing.  It&#39;s about unschooling, not about food, but if <br/>\nit ought to transfer.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093126829","msgId":98668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMGQwMWM0ODdjZCQxMWUwZmYyMCQxY2FlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDAwMTYwMWM0ODdhZCQ5MzAzODU3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4gPDAwMGUwMWM0ODdiZSQxNGVjYjY1MCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+"},"prevInTopic":98662,"nextInTopic":98669,"prevInTime":98667,"nextInTime":98669,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"Its good to remove her from the situation but at the age of 3, is it possible to get her involved in something she likes rather than remove her . Can she take","messageBody":"<div id=\"ygrps-yiv-1245652302\">Its good to remove her from the situation but at the age of 3, is it<br/>\npossible to get her involved in something she likes rather than &quot;remove<br/>\nher&quot;. Can she take a warm bath?  Do they all have to play together?<br/>\n=============================<br/>\n<br/>\nOh, this is EXACTLY what I try to to do for her.   Sometimes she is<br/>\ninterested in another activity away from her sister, but lately she more<br/>\noften just kicks her heel down over and over, grunts, throws things and<br/>\nscreams &quot;NO!&quot; at me when I make suggestions or offer somethign soothing.  I<br/>\nhave to just leave her alone for awhile when she does that, and eventually,<br/>\nsometimes sooner, sometimes much later she comes around.<br/>\n............................................................................<br/>\n.........................<br/>\n<br/>\nMany 1 year olds pull hair.  Maybe find something similar for him to pull<br/>\non?<br/>\n============================<br/>\n<br/>\nI realize that 1 year olds do this, although he is the first of my 4 to bite<br/>\nas well.  I know it&#39;s normal and try to help the girls keep safe from him<br/>\nand I distract him from it all the time.  He mostly does it when he is<br/>\nfrustrated, like when he wants to knock down their creations and they won&#39;t<br/>\nlet him.  I either have them go where he can&#39;t bother him, or sometimes I<br/>\njust carry him in on my back, which he likes.  The main reason I mentioned<br/>\nhis hair pulling and biting and such, is because it is part of the whole<br/>\nchaos around here.  It isn&#39;t that I don&#39;t expect it from<br/>\nhim.........................................................................<br/>\n..................<br/>\n<br/>\n  Your disapproval of tv first thing in the morning is very clear from your<br/>\npost, and I&#39;m sure your kids are aware of it too.<br/>\n========================<br/>\n<br/>\nYes,  they know that I don&#39;t like the noise of the tv first thing in the<br/>\nmorning and they know I don&#39;t like the tv on as much as it&#39;s been on lately<br/>\neither.   They also know I don&#39;t care for watching the same DVD&#39;s over and<br/>\nover and over again, which is what happens here because we can&#39;t get any<br/>\nnetwork tv here and can&#39;t afford cable.  We get our DVD&#39;s from the library<br/>\nand they trickle in a few each week I put 100 holds on titles.  It&#39;s<br/>\nannoying to me to listen to the same theme songs and such over and over.<br/>\n<br/>\nAre you saying that my kids are asking for tv because it annoys me?  I don&#39;t<br/>\nthink this is the case.<br/>\n............................................................................<br/>\n...................<br/>\n<br/>\nWhy do they have to do other things.  Can&#39;t they watch tv if they want?<br/>\n======================<br/>\n<br/>\nThey don&#39;t HAVE to do other things.  They usually enjoy doing other things.<br/>\nThey have been watching ALOT of tv lately.  I&#39;m sick of it, personally and<br/>\nwish they wanted to do some crafts with me or go to the beach.  Watching the<br/>\nsame shows over and over again is really boring to me, and, YES, I&#39;m<br/>\ndissappointed that they&#39;d rather do that than something more interactive<br/>\nwith me.<br/>\n............................................................................<br/>\n......................<br/>\nWhy does tv affect you this way?  It is clear that you do not like tv, but<br/>\nhave you ever thought about why?  Are you sure that your reasons for the<br/>\ndislike are really valid?<br/>\n=======================<br/>\n<br/>\nI do like tv.  I love to watch Survivor.  I watched so many movies in my<br/>\nlife that it is rare to find one I haven&#39;t seen at the video store.  I just<br/>\ndon&#39;t really like it to be on during the day so much.  I have thought about<br/>\nwhy.  I like to hear birds outside the window.  I like to hear my own<br/>\nthoughts or to listen to music sometimes.  I like the quiet.  I also like to<br/>\ntalk and to listen to my children talk, which they don&#39;t do much when the tv<br/>\nis on.  I&#39;ve always been this way, not just since my kids were born.  When I<br/>\nwas in the Air Force and had to live in a dorm with a roomate, I hated when<br/>\nshe&#39;d get home before me and turn her tv on and leave it on until she either<br/>\nwent out or to bed.  She wouldn&#39;t turn it off even if I asked, so I would<br/>\nfind somewhere else to be. (I eventually requested to be moved to another<br/>\nroom.)  When I was dating my first husband, he kept the tv on low or muted<br/>\nand tuned to the cartoon channel for ambiance.  Ugh.  I hated that.  Even<br/>\nwhen it was muted, I hated the visual &quot;noise.&quot;  I just don&#39;t like the tv on<br/>\nvery much.<br/>\n............................................................................<br/>\n.......................<br/>\n<br/>\nIs it possible you are setting up a power struggle with the kids because<br/>\nalthough you haven&#39;t said no, you would feel much better if you did?<br/>\n<br/>\nI&#39;m sure of it.<br/>\n............................................................................<br/>\n......................<br/>\n<br/>\n  Is it the tv?  Or is it that they sense your disapproval?<br/>\n============================<br/>\nI believe the tv is partly to blame for the irritableness and short -tempers<br/>\naround here.  I have seen it over and over again with my kids and myself.<br/>\nI&#39;ve seen it when I wasn&#39;t looking for it.  My experience with my children<br/>\nis that when they spent several hours a day sitting in front of the tv to<br/>\nwatch a movie or whatever, they end up with excess energy and are also much<br/>\nmore irritable.  I don&#39;t think they are sniping at each other because I let<br/>\nthem watch tv when I didn&#39;t want to.<br/>\n............................................................................<br/>\n...................<br/>\n<br/>\n  Are you actually *with* your kids while they are doing things that<br/>\ninterest them?  Are you content just being with them doing whatever they<br/>\nlike to do (even if its tv)?  Or are you using the time that they are<br/>\noccupied to &quot;get things done&quot;.  If you are using that time to &quot;Get things<br/>\ndone&quot;, they are going to drop what they are doing to get your<br/>\nattention...even if you&#39;re only MIA for 10 minutes.  Its the nature of the<br/>\nage.<br/>\n===============================<br/>\n<br/>\nI watch things with them often, but not all of the time.  Sometimes I wash<br/>\ndishes or cook dinner. Sometimes I sit in the same room and read the posts<br/>\non this list.  Other times I sit down with them and knit or nurse the baby,<br/>\nor just watch with them.  Since the baby doesn&#39;t really watch much yet, I am<br/>\noften playing with him.<br/>\n............................................................................<br/>\n.....................<br/>\n<br/>\nWhen you have children so young, arriving at a &#39;place of peace&quot; does not<br/>\nmean that you get time to yourself :o).<br/>\n=================<br/>\n<br/>\nI&#39;ve noticed! LOL  No, really, though, when I say a &quot;place of peace&quot;  I just<br/>\nmean that I want people to use civil tones around here and  for there to be<br/>\nless fighting and hollering.   I realize that it may take awhile.  I&#39;m just<br/>\ntired.  I also wish I could stay calmer in the storm.<br/>\n............................................................................<br/>\n.....................<br/>\n<br/>\n  And having &quot;peace&quot; starts with your own state of mind.  You are having<br/>\ntrouble letting go of controls to begin with.  That is creating a conflict<br/>\nfor your state of mind.  I suspect a lot of this follows from that conflict.<br/>\n======================<br/>\nI think this is pretty accurate for me.  I keep trying to meditate and use<br/>\naffirmations.  I&#39;m terrible at it.  I feel WAY behind the eight-ball, so to<br/>\nspeak.  If only things would stay calm for a few days and let me refresh<br/>\nmyself.  If only...<br/>\n............................................................................<br/>\n......................<br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;Yesterday we went shopping. &lt;&lt;<br/>\n<br/>\n </span></blockquote>  Big mistake.  There is no reason why you should take 3 young kids shopping<br/>\nwith you (unless there are circumstances that I missed somewhere).  There is<br/>\nno reason why you need to do that to yourself.<br/>\n===========================<br/>\n<br/>\nI have no choice.  Nobody here to leave them with, and no money for a sitter<br/>\n(or for the groceries for that matter--I think I overdrew my account<br/>\naccidently!)  They are pretty well-behaved in grocery stores actually.  We<br/>\nhave fun.  They ask for alot, but don&#39;t pitch fits when I do have to say no.<br/>\nOccasionally the three year old will cause trouble by not coming along with<br/>\nme or by standing up in the cart if I insist she ride there if she&#39;s<br/>\nmisbehaving, but usually people compliment me on what &quot;well-behaved&quot; or<br/>\n&quot;nice&quot; children I have.  This happens most places we go, actually.<br/>\n............................................................................<br/>\n.....................<br/>\n<br/>\n  Is there a reason why the 3 yo couldn&#39;t watch the movie while you did<br/>\nthings with the baby and 4 year old?  Honestly, it really sounds as if they<br/>\nare testing you to see if you are really going to let *them* make the<br/>\nchoices.<br/>\n===================<br/>\n<br/>\nThe movie wasn&#39;t the issue for the 3 yo.  She had already started playing<br/>\nwith her dollies more than she was watching.  The transition was what got<br/>\nher going.  Even if she really wanted to watch the movie, I wouldn&#39;t have<br/>\nlet her watch it alone.  It was Close Encounters of the Third Kind.  I was<br/>\ngoing to watch it after they were asleep, but they asked me to watch it with<br/>\nme, and I thought it would be fun, but the baby was putting the nix on that<br/>\nplan by standing in front of the screen, pulling hair and throwing blocks.<br/>\nI couldn&#39;t let the 3 yo watch without me there close by, so I suggested<br/>\nsomething else to do and we&#39;d try the movie again later when baby was<br/>\nasleep.<br/>\n............................................................................<br/>\n.....................<br/>\n<br/>\n  Again, your disapproval of their choices comes through loud and clear.<br/>\nYou are also still doling out the food in quantities that you decide on, and<br/>\nasking them to &quot;wait until dinner&quot;.<br/>\n====================<br/>\nI only ASKED if they could wait, because I was in the middle of making them<br/>\nsomething they asked me to make.  They didn&#39;t seem to mind.  I was fully<br/>\nprepared to give them the red vines if they still wanted it then.  I was<br/>\nvery conscious of that possibility when I asked.<br/>\n............................................................................<br/>\n.....................<br/>\n<br/>\nYou are upset because things are &quot;going to waste&quot; and &quot;biting your toungue&quot;<br/>\nat your kids while you describe a piece of fruit as &quot;beautiful and crispy&quot;.<br/>\nAnd you ate the fruit even though you weren&#39;t hungry.  That was your choice<br/>\nbased on your ideas of the &quot;Right way to handle leftover food&quot;.<br/>\n=====================<br/>\nIt does bother me when I prepare food that someone has asked to prepare and<br/>\nit just sits there uneaten or with a single bite taken out.  I ate the fruit<br/>\nbecause I was already overwhelmed with things to do and the baby was wanting<br/>\nto nurse and I didn&#39;t have the time or lemon on hand to do something else (I<br/>\nactually considered saving them just as you have described.). I mentioned<br/>\nthe apple as being crisp and beautiful because sometimes my 4 yo won&#39;t eat<br/>\nan apple if it&#39;s grainy or doesn&#39;t look just right.  My point was that it<br/>\nwas just how she normally likes it.<br/>\n............................................................................<br/>\n....................<br/>\n  I know that you are thinking of the money it takes to buy the food you<br/>\nhave, and how much could be saved if things weren&#39;t wasted.   But when it<br/>\ncomes right down to it....an apple has become a higher priority than the<br/>\nkids.<br/>\n===========================<br/>\nThis is too simplistic.  The apple hasn&#39;t become more important than my<br/>\nkids.  It wouldn&#39;t have mattered what food it was, a bowl of ice cream or<br/>\nsome cookies and milk or broccolli and dip or apples, I would still have<br/>\nbeen equally annoyed if she asked and I prepared and served and she decided<br/>\nshe was too full and then 20 minutes later asked me for something else.  She<br/>\nrejected the apple and that did bother me, yes, but I was also bothered by<br/>\nthe seeming onslaught of demands and my inability to do anything that<br/>\nsatisfied them, no matter how I tried.  It seems to me that my children are<br/>\nbecoming more dissatisfied rather than less so as I pull away limits.  I<br/>\nreally do want to give them more choice and I want to accept their choices<br/>\nwith equal grace, but I don&#39;t want to be around demanding children who can&#39;t<br/>\nbe pleased.  I&#39;m very frustrated and afraid to take it any further than I<br/>\nhave by letting them have total access--which would be very impractical with<br/>\na one year old running around too.<br/>\n<br/>\n~Andrea<br/>\n............................................................................<br/>\n......................<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Have a Nice Day!&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Saturday, August 21, 2004 1:33 PM<br/>\nSubject: Re: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n<br/>\n<br/>\n&gt; I understand your need to explain it all, it sounds very chaotic and your<br/>\npost conveys your frustration.  But it might be easier to try and sum up the<br/>\nspecific problems in order to arrive at some solutions.<br/>\n&gt;<br/>\n&gt; It sounds like the two major problems in your post are about TV and Food.<br/>\n&gt;<br/>\n&gt; See below.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   ----- Original Message ----- <br/>\n&gt;   From: Andrea Burlingame<br/>\n&gt;   To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a><br/>\n&gt;   Sent: Saturday, August 21, 2004 11:35 AM<br/>\n&gt;   Subject: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   &gt;&gt;They hit and kick each other.  The 3yo does this for no apparent<br/>\nreason.  If I remove her from the scene, she yells screams and stomps her<br/>\nfeet andthen when she finally calms down 15-20 minutes later and lets me<br/>\nhold her and care for her a bit, she goes right back in and starts bugging<br/>\nsomeone. &lt;&lt;<br/>\n&gt;<br/>\n&gt;   Its good to remove her from the situation but at the age of 3, is it<br/>\npossible to get her involved in something she likes rather than &quot;remove<br/>\nher&quot;. Can she take a warm bath?  Do they all have to play together?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   &gt;&gt;&gt;The baby (1yo) pulls everyones hair and scratches and bites and<br/>\npinches when he is thwarted in any way (and sometimes for no apparent reason<br/>\nhe&#39;ll just run over and hurt one of the girls when they are watching<br/>\nsomething on tv)&lt;&lt;&lt;<br/>\n&gt;   Many 1 year olds pull hair.  Maybe find something similar for him to<br/>\npull on?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   &gt;&gt;Also, they want to watch tv (dvd&#39;s in our case, since we can&#39;t get tv<br/>\nhere and can&#39;t afford cable) first thing in the morning, before the sleep is<br/>\nrubbed out of their eyes,&lt;&lt;<br/>\n&gt;<br/>\n&gt;   Your disapproval of tv first thing in the morning is very clear from<br/>\nyour post, and I&#39;m sure your kids are aware of it too.<br/>\n&gt;<br/>\n&gt;    &gt;&gt;and then ask for it every hour or more all day long, even when I have<br/>\nother things to do with them. &lt;&lt;<br/>\n&gt;<br/>\n&gt;   Why do they have to do other things.  Can&#39;t they watch tv if they want?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   &gt;&gt;I haven&#39;t been saying no except for when I just don&#39;t want to hear and<br/>\nsee the blasted thing anymore.  I don&#39;t really like the tv on in the<br/>\ndaytime.  It literally drones in my ears and I find it very distracting and<br/>\nI start to feel depressed when it&#39;s on as much as it&#39;s been on lately.  If<br/>\nit were up to me, we wouldn&#39;t have one. &lt;&lt;<br/>\n&gt;<br/>\n&gt;   Why does tv affect you this way?  It is clear that you do not like tv,<br/>\nbut have you ever thought about why?  Are you sure that your reasons for the<br/>\ndislike are really valid?<br/>\n&gt;<br/>\n&gt;   Is it possible you are setting up a power struggle with the kids because<br/>\nalthough you haven&#39;t said no, you would feel much better if you did?<br/>\n&gt;<br/>\n&gt;   &gt;&gt;Plus, my kids are snippier and grumpier with alot of tv. &lt;&lt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   Is it the tv?  Or is it that they sense your disapproval?<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   &gt;&gt;They are also more &quot;wired&quot;, literally bouncing off the walls after a<br/>\nlong session.  I&#39;ve seen it before when I&#39;ve eased up, and now I&#39;ve been<br/>\nliving with since June.  I keep hoping that they will get their fill and not<br/>\nbe so obsessed with watching it, but I&#39;m really starting to lose it.&lt;&lt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   But if you keep hoping things will change, then you aren&#39;t really giving<br/>\nthem the control.  You&#39;re giving them a reprieve from the status quo.  They<br/>\nprobably know that.  Maybe you need to come to terms with the idea that tv<br/>\nis ok, and that if they are happy watching tv right now and you don&#39;t like<br/>\ntv, then you can be happy finding something else to do, albeit with them.<br/>\nAnd it would probably have to be something you can put down easily.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   &gt;&gt;With 3 little ones, there is constantly something going on that needs<br/>\nmy immediate attention.&lt;&lt;<br/>\n&gt;<br/>\n&gt;   I&#39;m absolutely sure you are right about that.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   &gt;&gt;(Since I sat down in desperation to write this, I&#39;ve stopped to<br/>\nmediate a fight twice, got a snack for someone 3 times, kissed an &quot;owie&quot;<br/>\nonce, cleaned up an accident the 3 yo had, got the baby away from the<br/>\nhamsters once and removed him from the girls&#39; room just now--all in a space<br/>\nof what?  Maybe 10-15 minutes.  Argh!)  How do you get to a place of peace!?<br/>\nI swear I&#39;ve been trying, but I keep failing miserably!&lt;&lt;<br/>\n&gt;<br/>\n&gt;   Are you actually *with* your kids while they are doing things that<br/>\ninterest them?  Are you content just being with them doing whatever they<br/>\nlike to do (even if its tv)?  Or are you using the time that they are<br/>\noccupied to &quot;get things done&quot;.  If you are using that time to &quot;Get things<br/>\ndone&quot;, they are going to drop what they are doing to get your<br/>\nattention...even if you&#39;re only MIA for 10 minutes.  Its the nature of the<br/>\nage.<br/>\n&gt;   When you have children so young, arriving at a &#39;place of peace&quot; does not<br/>\nmean that you get time to yourself :o).<br/>\n&gt;<br/>\n&gt;   And having &quot;peace&quot; starts with your own state of mind.  You are having<br/>\ntrouble letting go of controls to begin with.  That is creating a conflict<br/>\nfor your state of mind.  I suspect a lot of this follows from that conflict.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   &gt;&gt;Yesterday we went shopping. &lt;&lt;<br/>\n&gt;<br/>\n&gt;   Big mistake.  There is no reason why you should take 3 young kids<br/>\nshopping with you (unless there are circumstances that I missed somewhere).<br/>\nThere is no reason why you need to do that to yourself.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   &gt;&gt; They were happy.   They ate a red vine on the way home and then I<br/>\nasked them to wait for more, since I was making dinner (Mac and Cheese,<br/>\nwhich they had been asking me for all day.)  Fine.  One ate most of her<br/>\ndinner and the other ate about half of a small bowl.  Said she was full.<br/>\nThen they wanted ice cream.  I didn&#39;t say a word about being full, but got<br/>\nthem each a little bowl of ice cream.  They also ate another red vine.  We<br/>\ntried to watch a movie at their request (they&#39;d already watched 3 that day),<br/>\nbut the baby wouldn&#39;t let us and it was getting late, so we went to feed and<br/>\nplay with the hamsters.  I suggested watching the movie later the next day,<br/>\nand 4 yo was fine, but 3 yo balked, even though she wasn&#39;t really watching<br/>\nthe show anyway.  &lt;&lt;<br/>\n&gt;<br/>\n&gt;   Is there a reason why the 3 yo couldn&#39;t watch the movie while you did<br/>\nthings with the baby and 4 year old?  Honestly, it really sounds as if they<br/>\nare testing you to see if you are really going to let *them* make the<br/>\nchoices.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   This morning I got up at 7:30 and everyone else followed shortly<br/>\nafterward.  I am usually very cheerful in the morning, hoping for and ready<br/>\nfor a happy day, and this day was no different.  I gave everyone hugs and<br/>\nasked them how they slept.  I asked everyone if they were hungry.  They<br/>\nwanted Frosted Flakes.  I poured them each a bowl and afterward offered some<br/>\npeanut butter in a spoon (something they like), because in the past a simple<br/>\nbowl of cereal has preceded grumpiness and them being hungry very shortly<br/>\nafter eating.  4yo didn&#39;t want any, but 3yo  and 1yo ate a little.  Then<br/>\nthey all wanted a movie, even though I had offered both the beach and to<br/>\nmake plaster of paris creatures using balloons and then painting them with<br/>\nacrylic paint.  They also ate red vines.  My three year old asked for her<br/>\n6th red vine and I suggested that we had some other snacks too.  Would she<br/>\nlike an apple or some cheese?  4 yo squeals, &quot;Yes! and apple!and some<br/>\nchocolate bears!&quot;  3 yo screams,!<br/>\n&gt;   &quot;NO and stomps her feet and crosses her arms and demands red vines.&quot;  I<br/>\ngave her another red vine, cored and sliced and apple and gave everyone some<br/>\nbears.  4 yo says she doesn&#39;t have enough bears even before eating one.  I<br/>\ntold her that if she was still hungry afterward and wanted more, she could<br/>\nhave some.  I started cleaning up the very messy kitchen that didn&#39;t get<br/>\ncleaned the night before.  Before I could even get the dish water started, 4<br/>\nyo says she is full and leaves the table full of uneaten apple<br/>\nwedges--beautiful, crispy, tart-sweet Braeburns that she used to love.  I<br/>\nbite my tongue and ate them myself even though I&#39;m not hungry.  I also<br/>\npeeled one wedge and gave it to the baby.   I hate to see them turn brown<br/>\nand go to waste.  Then, about 20 minutes later, 4 yo comes up to me and says<br/>\nshe&#39;s hungry.  She asked me for chocolate bears.  3 yo asked for more red<br/>\nvines.  They have been fighting and whining and screaming at each other and<br/>\nme all morning.  I said no to!<br/>\n&gt;   more bears and vines and 3 yo started screaming at me and stomping he<br/>\n&gt; r feet.  I held her firmly by the arms and said, &quot;Enough!  I don&#39;t like to<br/>\nbe screamed at.&quot;  She started crying and stomping her feet and finally went<br/>\noff to play.&lt;&lt;&lt;<br/>\n&gt;<br/>\n&gt;   Again, your disapproval of their choices comes through loud and clear.<br/>\nYou are also still doling out the food in quantities that you decide on, and<br/>\nasking them to &quot;wait until dinner&quot;.  You are upset because things are &quot;going<br/>\nto waste&quot; and &quot;biting your toungue&quot; at your kids while you describe a piece<br/>\nof fruit as &quot;beautiful and crispy&quot;.  And you ate the fruit even though you<br/>\nweren&#39;t hungry.  That was your choice based on your ideas of the &quot;Right way<br/>\nto handle leftover food&quot;.  I know that you are thinking of the money it<br/>\ntakes to buy the food you have, and how much could be saved if things<br/>\nweren&#39;t wasted.   But when it comes right down to it....an apple has become<br/>\na higher priority than the kids.<br/>\n&gt;<br/>\n&gt;   If they don&#39;t eat all the apple wedges, sprinkle them with lemon juice<br/>\nand put them in a zip lock bag.  They won&#39;t turn brown then.  Or, cook them<br/>\ndown and make applesauce or compote out of them.<br/>\n&gt;   Can you just put all the food where they can freely access it?  And then<br/>\njust let them pick and choose what they want in whatever quantity they want.<br/>\nThat way you don&#39;t have to decide how much they should have of what.  They<br/>\ncan decide for themselves.  Of course, then you will have to deal with the<br/>\nsame problem I have....keeping enough around so that they aren&#39;t hording it<br/>\n:o).<br/>\n&gt;<br/>\n&gt;   It leaves the kitchen a bit of a mess, for sure.  And you&#39;ll have to<br/>\ndeal with your feelings of things &quot;going to waste&quot;.  But the trade off is<br/>\nthat they will learn how to eat in a way that satisfies their hunger,<br/>\nwithout attatching any particular signigicance to food.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;   &gt;&gt; It seems like the more I freedom I give, the ruder they get with me<br/>\nand each other.  &lt;&lt;<br/>\n&gt;<br/>\n&gt;   Are you really giving them freedom?  Or are you giving them the illusion<br/>\nof freedom while you monitor everything they do and hope they change?  It<br/>\nsounds like you are still holding on to your idea of &quot;the way things should<br/>\nbe&quot; and hoping that by letting go of controls, they&#39;ll just naturally<br/>\ngravitate toward what you believe.<br/>\n&gt;<br/>\n&gt;   If you are really going to let go of controls, you have to let them<br/>\ndevelop their own...and they may not be the same as yours.<br/>\n&gt;<br/>\n&gt;   Kristen<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":173427227,"authorName":"Vijay Berry Owens","from":"Vijay Berry Owens &lt;vijayowens@...&gt;","profile":"vijay_berry_owens","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093126309","msgId":98662,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5M0JGNEE4LUYzQkYtMTFEOC1CMUQ3LTAwMzA2NTdERTQxOEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDAwMTYwMWM0ODdhZCQ5MzAzODU3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":98659,"nextInTopic":98668,"prevInTime":98661,"nextInTime":98663,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"I am by no means an expert on unschooling, there are others here who are, but a few things leapt out at me when I read your post that I just had to respond to.","messageBody":"<div id=\"ygrps-yiv-1725441010\">I am by no means an expert on unschooling, there are others here who <br/>\nare, but a few things leapt out at me when I read your post that I just <br/>\nhad to respond to. Before you read them, please let me say that I really <br/>\nreally sympathize with how stressed out you are. I never get a break <br/>\neither, but I only have one child. She&#39;s a handful, but it&#39;s nothing <br/>\ncompared to what you are going through. I wish I could help. It sounds <br/>\nlike you are feeling lonely and isolated. I can relate to that too. I am <br/>\nway out in the country and don&#39;t drive. I am also living rent free in a <br/>\nhouse owned by my MIL. DH makes only about 20K a year, so I understand <br/>\nabout being on a tight budget too.<br/>\n<br/>\nIs there any way that you could pack all of the kids up and go to a <br/>\nplayground or a beach or a park and let them run around? It makes <br/>\nmatters worse for us when we fall into the trap of staying cooped up all <br/>\nday. Even just going for a walk might help them expend some of their <br/>\nenergy in a healthier way than messing with each other and you all day. <br/>\nI know it&#39;s hard with 3 kids, but it might help. Some fresh air and a <br/>\nchange of scenery sometimes really clears my head and helps me stay more <br/>\npatient.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Saturday, August 21, 2004, at 02:35 PM, Andrea Burlingame wrote:<br/>\n<br/>\n&gt; my children are just becoming more and more demanding.<br/>\n<br/>\nI think this may just be a natural result of loosening the controls. The <br/>\npendulum swings all the way from one side to the other, but will reach <br/>\nequilibrium in time. This is my understanding based on my reading about <br/>\nunschooling. I&#39;ve never actually experienced it. But I believe it to be <br/>\ntrue.<br/>\n<br/>\n&gt; The baby (1yo) pulls everyones hair and scratches and bites and pinches <br/>\n&gt; when he is thwarted in any way (and sometimes for no apparent reason <br/>\n&gt; he&#39;ll just run over and hurt one of the girls when they are watching <br/>\n&gt; something on tv)<br/>\n<br/>\nI could be wrong, but I think maybe you are expecting too much from a 1 <br/>\ny.o. They are easily frustrated at this age because they lack the <br/>\ncommunication skills and intuition into their own emotions. Many times <br/>\nthey do things that hurt people just out of curiosity, not <br/>\nmaliciousness. &quot;What happens when I pull mommy&#39;s hair really hard?&quot; If <br/>\nthey are truly upset, they usually have a reason (hungry, tired, <br/>\nteething, etc.) although sometimes it is hard to figure that out, <br/>\nespecially with the distraction of dealing with other kids. If I were in <br/>\nyour shoes I would put more effort into preventing this behavior rather <br/>\nthan into figuring out how to deal with it once it happens. That&#39;s not <br/>\nvery helpful, I know. You are already doing your best to keep everyone <br/>\nhappy I&#39;m sure.<br/>\n<br/>\nI had a problem a few months ago with DD hitting me in the face, and it <br/>\nwas easy to get SOOOOO angry and to think &quot;how dare she?&quot; but I learned <br/>\nfrom some great moms at the AP discipline group that there must be a <br/>\nreason why she is doing it, and she is not trying to hurt me or be mean. <br/>\nThey were right. I was invading her personal space by sticking my face <br/>\ntoo close to hers. It got her too excited and she would slap me due to <br/>\nbeing overstimulated by my face being in her face. It took a while to <br/>\nfigure this out, but once I did, no more hitting. Just an example.<br/>\n&gt;<br/>\n&gt; I haven&#39;t been saying no except<br/>\n<br/>\nSo you haven&#39;t removed the limits after all. It is my understanding that <br/>\nit doesn&#39;t work until you do.<br/>\n<br/>\n&gt;  My three year old asked for her 6th red vine and I suggested that we <br/>\n&gt; had some other snacks too. Would she like an apple or some cheese?<br/>\n<br/>\nBut they didn&#39;t ask for the apple. And it&#39;s pretty clear that they don&#39;t <br/>\nbelieve that the sweets are unlimited. I don&#39;t think it works in one <br/>\nday. Maybe rather than dole them out a few at a time while still pushing <br/>\napples and peanut butter you could just put everything within reach and <br/>\nlet them help themselves?<br/>\n<br/>\n&gt; Then, about 20 minutes later, 4 yo comes up to me and says she&#39;s <br/>\n&gt; hungry. She asked me for chocolate bears. 3 yo asked for more red <br/>\n&gt; vines. They have been fighting and whining and screaming at each other <br/>\n&gt; and me all morning. I said no to more bears and vines<br/>\n<br/>\nI don&#39;t think you have removed the controls yet. Maybe you WANT to, and <br/>\nmaybe you are trying to move in that direction, but you can&#39;t expect the <br/>\nresults you have been told you will get from removing controls unless <br/>\nyou actually remove them. Saying something along the lines of &quot;This <br/>\nremoving controls thing doesn&#39;t work&quot; is only logical if you have <br/>\nactually tried it. For real.<br/>\n<br/>\n&gt; the more I freedom I give, the ruder they get with me and each other.<br/>\n<br/>\nI think you need to give even more freedom and more consistently before <br/>\nyou will see any changes. But of course I have to say that this is all <br/>\n*theoretical* for me. I believe in this theory, but I have not tested it <br/>\nmyself.<br/>\n<br/>\nPlease hang in there, I feel for you, I really do. If you want to email <br/>\nme offlist I would be happy to be your pen pal and try to help you <br/>\nthrough this in whatever way I can.<br/>\n<br/>\n:-)<br/>\n<br/>\n-Vijay Berry Owens<br/>\nSAHM to Charlotte, 15 months<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093124443","msgId":98659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjYS4yOTNiOGM3Mi4yZTU5MWI1YkBhb2wuY29tPg=="},"prevInTopic":98657,"nextInTopic":98662,"prevInTime":98658,"nextInTime":98660,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/21/2004 12:35:33 PM Mountain Daylight Time, aburlingame@centurytel.net writes: I know this isn t a support group, but I don t have anyone","messageBody":"<div id=\"ygrps-yiv-340048919\">In a message dated 8/21/2004 12:35:33 PM Mountain Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aburlingame@...\">aburlingame@...</a> writes:<br/>\nI know this isn&#39;t a support group, but I don&#39;t have anyone else to talk to.  <br/>\nI keep loosening up the contol around here, and my children are just becoming <br/>\nmore and more demanding.  <br/>\n-------------<br/>\n<br/>\nDon&#39;t remove your structuress.  Just say yes more.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/joyce/yes\">http://sandradodd.com/joyce/yes</a><br/>\n<br/>\nOne and three are babies.  Treat them like babies, gently, spend tons of time <br/>\nwith them, there&#39;s nothing else to do.  <br/>\n<br/>\n-=-There is the near-constant bickering and fighting that I&#39;ve mentioned <br/>\nbefore.  They hit and kick each other.  The 3yo does this for no apparent reason. <br/>\n-=-<br/>\n<br/>\nIt&#39;s not an unschooling matter.<br/>\n<br/>\n-=-Also, they want to watch tv (dvd&#39;s in our case, since we can&#39;t get tv here <br/>\nand can&#39;t afford cable) first thing in the morning, before the sleep is <br/>\nrubbed out of their eyes, and then ask for it every hour or more all day long, even <br/>\nwhen I have other things to do with them.  I haven&#39;t been saying no except <br/>\nfor when I just don&#39;t want to hear and see the blasted thing anymore. -=-<br/>\n<br/>\nIf you find some sing-along videos or other happy kids&#39; shows you can stand <br/>\nto listen to, just leave them on all the time, then there&#39;s no asking.<br/>\n<br/>\n-=-  I don&#39;t really like the tv on in the daytime.  It literally drones in my <br/>\nears and I find it very distracting and I start to feel depressed-=-<br/>\n<br/>\nMaybe unschooling won&#39;t work for you.  it&#39;s hard, but I think in any case in <br/>\nwhich a parent can&#39;t put the kids&#39; needs first, it&#39;s going to be a problem.  <br/>\nOthers might disagree with me, but that&#39;s what I think.<br/>\n<br/>\nBut you&#39;re taking about really little kids who might go to school.  It&#39;s not <br/>\nan unschooling matter, in several ways, in my opinion.<br/>\n<br/>\n-=-  Plus, my kids are snippier and grumpier with alot of tv. -=-<br/>\n<br/>\nMaybe they&#39;re grumpier when  you&#39;re grumpier, and you&#39;re saying it makes you <br/>\ngrumpy, right?<br/>\n<br/>\nCan you get out of the house every day?  Can you go to a different park, a <br/>\nmall, a place with a loading dock and a ramp?<br/>\n<br/>\n-= How do you get to a place of peace!?  I swear I&#39;ve been trying, but I keep <br/>\nfailing miserably!<br/>\n-=-<br/>\n<br/>\nLearn to calm yourself with deep breathing.<br/>\nFind some self-talk things (affirmations, some kind of personal <br/>\nencouragement) to remind yourself why you want to dowhat you want to do.  Fill your head <br/>\nwith the  kind of mother you want to be.  Try to be with other such mothers so <br/>\nyou can emulate them.<br/>\n<br/>\nI had kids 1, 3 and 5.  I know.<br/>\n<br/>\nIt gets better gradually.  At the moment I have no one at the house but me.  <br/>\nThere were years when I had kids all over me, sucking, crying, asking for <br/>\ndiferent food.   I could have put them in preschool or daycare.  Chose not to.  <br/>\nWasn&#39;t homeschooling, wasn&#39;t unschooling, just trying to get them old enough for <br/>\nschool (which ended up not happening).<br/>\n<br/>\nSo if you plan to unschool, you have a better goal than I had!<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":164542605,"authorName":"Danielle Conger","from":"Danielle Conger &lt;danielle.conger@...&gt;","profile":"danielleconger","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093124419","msgId":98674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMjdDMTQzLjEwMDA4MDhAY29tY2FzdC5uZXQ+","inReplyToHeader":"PDAwMTYwMWM0ODdhZCQ5MzAzODU3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4=","referencesHeader":"PDAwMTYwMWM0ODdhZCQ5MzAzODU3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":98670,"nextInTopic":98679,"prevInTime":98673,"nextInTime":98675,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"Andrea wrote: I want to cry (and often do) everyday out of frustration with dealing with my children.  I feel guilty for getting so frustrated that yell and","messageBody":"<div id=\"ygrps-yiv-1695293071\">Andrea wrote: <br/>\nI want to cry (and often do) everyday out of frustration with dealing with my children.  I feel guilty for getting so frustrated that yell and slam cabinets on occasion.  With 3 little ones, there is constantly something going on that needs my immediate attention. *** How do you get to a place of peace!?  I swear I&#39;ve been trying, but I keep failing miserably!<br/>\n=====<br/>\n<br/>\nThe first thing anyone here is going to say is *breathe*.  Breathing is incredibly valuable if you don&#39;t underestimate its power. When folks here tell you to breathe, I don&#39;t think they mean just catch your breath from talking so fast. It&#39;s more like slow down and breathe deeply. Close your eyes; breathe through your nose; feel your lungs fill up with air until they can&#39;t hold anymore; slowly let the breath back out through your nose. This is a deep cleansing breath. Your nose is a natural filtration system. Closing your eyes helps shut out the world. Take another deep cleansing breath and another. <br/>\n<br/>\nI first learned the value of deep breathing when I quit smoking in grad school. One of the reasons smoking relaxes people is that it forces them to breath deeply and slowly for as long as they&#39;re smoking the cigarette. I realized that I could hold a pencil in my hand and focus on my breathing for 10 minutes. Believe it or not, this made a tremendous difference in dealing with the stress of graduate life without the crutch of smoking. Lamaze also taught me the value of deep breathing, so if you took a Lamaze class, start doing those cleansing breaths again: one for the baby, one for the mama, and maybe one for each of the other kiddos, too. Do this every time you feel your body tensing up and think you&#39;re spiraling out of control.<br/>\n<br/>\n======<br/>\nI keep loosening up the contol around here, and my children are just becoming more and more demanding.  And I am losing my cool even as much or more than ever, it seems.  There is the near-constant bickering and fighting that I&#39;ve mentioned before. <br/>\n======<br/>\n<br/>\nIt&#39;s going to take them a while. They&#39;re seeing how far they can go before the freedom and choices get cut off again. Why are they bickering and fighting? Try to identify what&#39;s causing the problems and brainstorm with them for ways to solve it. My kids are 17 and 16 months apart--I know what it&#39;s like to try to parent several very young children. Right now, they&#39;re 7, 5 and 4, and it&#39;s getting easier. The biggest difference I made in my life was getting things down on their level--giving them control over their environment and making it easier for them to do for themselves. It always amazes me how much I love my refridgerator (water and ice on the door) when I go visiting and I&#39;m up and down all day getting the kids drinks and other things they&#39;d be able to do for themselves at home. Try to organize your house to make your life and your job as easy as possible; do the same for the kids. Shortcuts are extremely valuable with young kids. Focus your priorities on living joyfully and easily together.<br/>\n<br/>\n=====<br/>\nAlso, they want to watch tv (dvd&#39;s in our case, since we can&#39;t get tv here and can&#39;t afford cable) first thing in the morning, before the sleep is rubbed out of their eyes, and then ask for it every hour or more all day long, even when I have other things to do with them. <br/>\n=====<br/>\n<br/>\nSo let them. Even if they just woke up, even if they have sleep in their eyes, even if you have other plans, let them. If it&#39;s bugging you, then find something else to occupy your time. Where&#39;s your tv located that it&#39;s bugging you? Can you move it to another room where you don&#39;t have to listen to it? We have one in the playroom downstairs with a VCR and one in our bedroom with a DVD--either way, I can get away from it if I need to, which I often do because I don&#39;t like to watch during the day either. Lots of other times I&#39;ll watch with the kids or I&#39;ll bring my laptop and read email, write or work on my webpage, lots of times I&#39;ll read a book or do a crossword puzzle, so that I&#39;m with them but fulfilling my needs at the same time. Find stuff that makes you happy and do it alongside them so you don&#39;t even notice the tv, but are physically close, present and available. Be prepared to be interrupted, and welcome the chance to help. Learn to do the things you like through the interruptions and don&#39;t be resentful. If you can prepare yourself for the requests for help and look at any time you get to focus on your own things as a gift, then you can start nurturing yourself and your children. I think the key is working them together and not seeing them as mutually exclusive possibilities.<br/>\n<br/>\n=====<br/>\nPlus, my kids are snippier and grumpier with alot of tv.  They are also more &quot;wired&quot;, literally bouncing off the walls after a long session. <br/>\n=====<br/>\n<br/>\nWhen they&#39;re done, get them outside or wrestle on the floor with them for a while. We have an indoor hopscotch that we can put together and play if it&#39;s dark outside. There are lots of physical options to get that energy out before it gets directed at each other in negative ways. Get them to brainstorm with you. Bath tubs have been really helpful in defusing my kids as well. See who can jump the highest, or grab a broom and do the limbo. Put on some music and dance together. My kids *love* dancing, and we probably don&#39;t do that enough! Two of my favorite little kids CD&#39;s to dance to are Sugar Beats &quot;Everybody is a Star&quot; and Red Grammer&#39;s &quot;Hello World!&quot; We would put those on, grab some silky scarves and dance. If I was really grumpy or really depressed, I would put on one of my hardcore CDs like the Chilli Peppers or, now, Alannis Morissett. Yeah, the language in them is bad, but the kids don&#39;t even pick that up, and man, does it provide a really great realease! Way better to be exposed to the occasional curse words and some nasty lyrics that are all slurred together anyway than a mama&#39;s yelling or general grumpiness. Do this while your kids are watching something, crank it up loud and just dance with abandon. Seriously.<br/>\n<br/>\n=====<br/>\nMY budget is so strict that I shouldn&#39;t have been buying this stuff, but I was inspired to let them pick.  Well, they of course wanted EVERY single sweet treat they saw.  I said yes to a couple of other things (Frosted Flakes and ice cream), but then said that&#39;s all we could afford for now and we needed milk and eggs.  They were happy.<br/>\n=====<br/>\n<br/>\nLots of us here operate on a budget--some tighter than others. In my experience, the most important thing is to explain the situation to the kids clearly before going to the store. Make it clear to them that there is a limited amount of money to spend, that they may each choose one special thing and that they may want to consider carefully how long it will last because that&#39;s it until the next budgeted shopping time. I&#39;ve had conversations with my kids recently about how expensive preprepared foods can be. I just honestly tell them that we can afford only a few things like that, but that ingredients to make cookies are pretty cheap. So, we can spend our money on icecream and buy ingredients to make cookies. Cereal is the thing that hits me the hardest: a $5 box disappears in one or two days in my family. Even young kids can grasp money constraints if you can demonstrate it in concrete terms. I&#39;ve done it before with my kids using M&Ms. It becomes really obvious how quickly a limited number of M&Ms disappear. <br/>\n<br/>\nMoney can be a great source of stress and unhappiness. If you&#39;re always worrying about money, then those beautiful crispy apples become way more than just an apple someone didn&#39;t want to finish. That simple apple takes on the power to make or break a household--more power than it probably deserves even on the tightest budget. I don&#39;t want to presume to understand what your financial situation is or to give you bad advice, but I do want to say that sometimes ease and joy outweigh finances. Only you can decide when that is practical in your own household.<br/>\n<br/>\nThere are several books you may find helpful if you haven&#39;t already read them: Raising Your Spirited Child, by Kurcinka; Living Joyfully with Children, by the Sweets; The Explosive Child, by Greene; Siblings without Rivalry and How to Talk so Your Kids will Listen, by Faber and Mazlish; Wherever You Go, There you Are, by Kabat-Zinn. That&#39;s a lot of reading but the books all offer some really practical advice for what you&#39;re going through. I have also found eliminating corn syrup from guys diet to be tremendously helpful in reducing his tantrums and rages--the whole foods can be harder on the budget, but cooking from scratch makes up for a lot of that. Doris Rapp&#39;s Is This Your Child? is helpful for trying to see if there&#39;s some connection between behavior and food sensitivities.<br/>\n<br/>\nThe biggest difference you can make is shifting your own attitude, which is simple and really hard at the same time. From your second post, it sounds like you&#39;re with the kids 24/7 pretty much without anyone to help out or give you any relief. I&#39;m sure folks here have suggested having a mother&#39;s helper in. If your finances don&#39;t allow that, you might try to find a younger child who&#39;s looking for some babysitting experience who could come in while you&#39;re still at home. Or try to trade off with another mother. If nothing like that works out, it sounds to me like you need to find a way to carve out some time for yourself without someone else coming in. Taking a hot bath by yourself after the kids have gone to sleep or while they&#39;re watching the tv, for instance. I think embracing the tv/videos instead of fighting might do you a world of good and go a long way towards getting some time for yourself. <br/>\n<br/>\nYoung kids are needy--there&#39;s no way around that. What would help is trying to find a way to meet their needs and yours at the same time. Find strategies that bring joy and happiness to everyone and quickly shift into those when you feel you&#39;re getting ready to lose it. When my dh goes away, that approach is invaluable. Making our own sundaes, with all different topings to choose from; popping popcorn and snuggling over a movie; making milkshakes; cllimb into the tub and blow bubbles. We do those things fairly regularly, but they still seem like treats when we quickly shift into them at an unexpected time, and they can really defuse escalating tempers. Biggest thing is being honest with your kids and including them in the brainstorming process. Sit down together for a family meeting and come up with ways to solve the problems that seem most frequent. My kids have come up with some terrific solutions for things that I never would have thought of--even little ones can do this, honest, and it will lay the foundation for family problem-solving and communication that will be so important as they grow older.<br/>\n<br/>\n&lt;&gt;--Danielle<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.danielleconger.com/Homeschool/Welcomehome.html\">http://www.danielleconger.com/Homeschool/Welcomehome.html</a></div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093122937","msgId":98657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PDAwMGUwMWM0ODdiZSQxNGVjYjY1MCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+"},"prevInTopic":98647,"nextInTopic":98659,"prevInTime":98656,"nextInTime":98658,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-439514024\">&lt;&lt;&lt;I understand your need to explain it all, it sounds very chaotic and your<br/>\npost conveys your frustration.  But it might be easier to try and sum up the<br/>\nspecific problems in order to arrive at some solutions.<br/>\n[snip]....<br/>\nAre you really giving them freedom?  Or are you giving them the illusion of<br/>\nfreedom while you monitor everything they do and hope they change?  It<br/>\nsounds like you are still holding on to your idea of &quot;the way things should<br/>\nbe&quot; and hoping that by letting go of controls, they&#39;ll just naturally<br/>\ngravitate toward what you believe.<br/>\n<br/>\n  If you are really going to let go of controls, you have to let them<br/>\ndevelop their own...and they may not be the same as yours.&gt;&gt;&gt;&gt;<br/>\n<br/>\nWithout quoting the whole thing, I want to endorse *everything* that Kristen<br/>\nhas posted. I was going to say pretty much the same ideas, even to making<br/>\napple sauce. Andrea and her kids are still decompressing from a controlled<br/>\nlifestyle - so it will seem wild while that process continues. <br/>\n<br/>\nThe only thing I will say is that I think Andrea has few resources in terms<br/>\nof other people to help and pretty much has to take them all with her to go<br/>\nshopping. Sometimes more but briefer trips work better than fewer longer<br/>\ntrips to the store. I get Jayn (4.5) to choose things and fetch them to the<br/>\ncart to help assuage her boredom at the store eg I send her for a package of<br/>\ntomatoes. Sometimes we get romas when beefsteaks would be better, but I<br/>\ndon&#39;t complain.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.740 / Virus Database: 494 - Release Date: 8/16/2004</div>","specialLinks":[]},{"userId":166495566,"authorName":"Have a Nice Day!","from":"&quot;Have a Nice Day!&quot; &lt;litlrooh@...&gt;","profile":"litlrooh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why isn&#39;t this working!?","postDate":"1093120391","msgId":98647,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMGUwMWM0ODdiZSQxNGVjYjY1MCQwMjAxYThjMEBrcmlzdGVuc2NvbXB1dGU+","referencesHeader":"PDAwMTYwMWM0ODdhZCQ5MzAzODU3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":98640,"nextInTopic":98657,"prevInTime":98646,"nextInTime":98648,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"I understand your need to explain it all, it sounds very chaotic and your post conveys your frustration.  But it might be easier to try and sum up the specific","messageBody":"<div id=\"ygrps-yiv-229337011\">I understand your need to explain it all, it sounds very chaotic and your post conveys your frustration.  But it might be easier to try and sum up the specific problems in order to arrive at some solutions.<br/>\n<br/>\nIt sounds like the two major problems in your post are about TV and Food.<br/>\n<br/>\nSee below.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Andrea Burlingame <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Saturday, August 21, 2004 11:35 AM<br/>\n  Subject: [UnschoolingDiscussion] Why isn&#39;t this working!?<br/>\n<br/>\n<br/>\n  &gt;&gt;They hit and kick each other.  The 3yo does this for no apparent reason.  If I remove her from the scene, she yells screams and stomps her feet andthen when she finally calms down 15-20 minutes later and lets me hold her and care for her a bit, she goes right back in and starts bugging someone. &lt;&lt;<br/>\n<br/>\n  Its good to remove her from the situation but at the age of 3, is it possible to get her involved in something she likes rather than &quot;remove her&quot;. Can she take a warm bath?  Do they all have to play together? <br/>\n<br/>\n<br/>\n  &gt;&gt;&gt;The baby (1yo) pulls everyones hair and scratches and bites and pinches when he is thwarted in any way (and sometimes for no apparent reason he&#39;ll just run over and hurt one of the girls when they are watching something on tv)&lt;&lt;&lt;<br/>\n  Many 1 year olds pull hair.  Maybe find something similar for him to pull on?<br/>\n<br/>\n<br/>\n  &gt;&gt;Also, they want to watch tv (dvd&#39;s in our case, since we can&#39;t get tv here and can&#39;t afford cable) first thing in the morning, before the sleep is rubbed out of their eyes,&lt;&lt;<br/>\n<br/>\n  Your disapproval of tv first thing in the morning is very clear from your post, and I&#39;m sure your kids are aware of it too.<br/>\n<br/>\n   &gt;&gt;and then ask for it every hour or more all day long, even when I have other things to do with them. &lt;&lt;<br/>\n<br/>\n  Why do they have to do other things.  Can&#39;t they watch tv if they want?  <br/>\n<br/>\n<br/>\n  &gt;&gt;I haven&#39;t been saying no except for when I just don&#39;t want to hear and see the blasted thing anymore.  I don&#39;t really like the tv on in the daytime.  It literally drones in my ears and I find it very distracting and I start to feel depressed when it&#39;s on as much as it&#39;s been on lately.  If it were up to me, we wouldn&#39;t have one. &lt;&lt;<br/>\n<br/>\n  Why does tv affect you this way?  It is clear that you do not like tv, but have you ever thought about why?  Are you sure that your reasons for the dislike are really valid?<br/>\n<br/>\n  Is it possible you are setting up a power struggle with the kids because although you haven&#39;t said no, you would feel much better if you did?<br/>\n<br/>\n  &gt;&gt;Plus, my kids are snippier and grumpier with alot of tv. &lt;&lt;<br/>\n<br/>\n<br/>\n  Is it the tv?  Or is it that they sense your disapproval?<br/>\n<br/>\n<br/>\n  &gt;&gt;They are also more &quot;wired&quot;, literally bouncing off the walls after a long session.  I&#39;ve seen it before when I&#39;ve eased up, and now I&#39;ve been living with since June.  I keep hoping that they will get their fill and not be so obsessed with watching it, but I&#39;m really starting to lose it.&lt;&lt;<br/>\n<br/>\n<br/>\n  But if you keep hoping things will change, then you aren&#39;t really giving them the control.  You&#39;re giving them a reprieve from the status quo.  They probably know that.  Maybe you need to come to terms with the idea that tv is ok, and that if they are happy watching tv right now and you don&#39;t like tv, then you can be happy finding something else to do, albeit with them.  And it would probably have to be something you can put down easily.<br/>\n<br/>\n<br/>\n  &gt;&gt;With 3 little ones, there is constantly something going on that needs my immediate attention.&lt;&lt;<br/>\n<br/>\n  I&#39;m absolutely sure you are right about that.<br/>\n<br/>\n<br/>\n  &gt;&gt;(Since I sat down in desperation to write this, I&#39;ve stopped to mediate a fight twice, got a snack for someone 3 times, kissed an &quot;owie&quot; once, cleaned up an accident the 3 yo had, got the baby away from the hamsters once and removed him from the girls&#39; room just now--all in a space of what?  Maybe 10-15 minutes.  Argh!)  How do you get to a place of peace!?  I swear I&#39;ve been trying, but I keep failing miserably!&lt;&lt;<br/>\n<br/>\n  Are you actually *with* your kids while they are doing things that interest them?  Are you content just being with them doing whatever they like to do (even if its tv)?  Or are you using the time that they are occupied to &quot;get things done&quot;.  If you are using that time to &quot;Get things done&quot;, they are going to drop what they are doing to get your attention...even if you&#39;re only MIA for 10 minutes.  Its the nature of the age.<br/>\n  When you have children so young, arriving at a &#39;place of peace&quot; does not mean that you get time to yourself :o).<br/>\n<br/>\n  And having &quot;peace&quot; starts with your own state of mind.  You are having trouble letting go of controls to begin with.  That is creating a conflict for your state of mind.  I suspect a lot of this follows from that conflict.<br/>\n<br/>\n<br/>\n  &gt;&gt;Yesterday we went shopping. &lt;&lt;<br/>\n<br/>\n  Big mistake.  There is no reason why you should take 3 young kids shopping with you (unless there are circumstances that I missed somewhere).  There is no reason why you need to do that to yourself.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  &gt;&gt; They were happy.   They ate a red vine on the way home and then I asked them to wait for more, since I was making dinner (Mac and Cheese, which they had been asking me for all day.)  Fine.  One ate most of her dinner and the other ate about half of a small bowl.  Said she was full.  Then they wanted ice cream.  I didn&#39;t say a word about being full, but got them each a little bowl of ice cream.  They also ate another red vine.  We tried to watch a movie at their request (they&#39;d already watched 3 that day), but the baby wouldn&#39;t let us and it was getting late, so we went to feed and play with the hamsters.  I suggested watching the movie later the next day, and 4 yo was fine, but 3 yo balked, even though she wasn&#39;t really watching the show anyway.  &lt;&lt;<br/>\n<br/>\n  Is there a reason why the 3 yo couldn&#39;t watch the movie while you did things with the baby and 4 year old?  Honestly, it really sounds as if they are testing you to see if you are really going to let *them* make the choices.<br/>\n<br/>\n<br/>\n  This morning I got up at 7:30 and everyone else followed shortly afterward.  I am usually very cheerful in the morning, hoping for and ready for a happy day, and this day was no different.  I gave everyone hugs and asked them how they slept.  I asked everyone if they were hungry.  They wanted Frosted Flakes.  I poured them each a bowl and afterward offered some peanut butter in a spoon (something they like), because in the past a simple bowl of cereal has preceded grumpiness and them being hungry very shortly after eating.  4yo didn&#39;t want any, but 3yo  and 1yo ate a little.  Then they all wanted a movie, even though I had offered both the beach and to make plaster of paris creatures using balloons and then painting them with acrylic paint.  They also ate red vines.  My three year old asked for her 6th red vine and I suggested that we had some other snacks too.  Would she like an apple or some cheese?  4 yo squeals, &quot;Yes! and apple!and some chocolate bears!&quot;  3 yo screams, &quot;NO and stomps her feet and crosses her arms and demands red vines.&quot;  I gave her another red vine, cored and sliced and apple and gave everyone some bears.  4 yo says she doesn&#39;t have enough bears even before eating one.  I told her that if she was still hungry afterward and wanted more, she could have some.  I started cleaning up the very messy kitchen that didn&#39;t get cleaned the night before.  Before I could even get the dish water started, 4 yo says she is full and leaves the table full of uneaten apple wedges--beautiful, crispy, tart-sweet Braeburns that she used to love.  I bite my tongue and ate them myself even though I&#39;m not hungry.  I also peeled one wedge and gave it to the baby.   I hate to see them turn brown and go to waste.  Then, about 20 minutes later, 4 yo comes up to me and says she&#39;s hungry.  She asked me for chocolate bears.  3 yo asked for more red vines.  They have been fighting and whining and screaming at each other and me all morning.  I said no to more bears and vines and 3 yo started screaming at me and stomping her feet.  I held her firmly by the arms and said, &quot;Enough!  I don&#39;t like to be screamed at.&quot;  She started crying and stomping her feet and finally went off to play.&lt;&lt;&lt;<br/>\n<br/>\n  Again, your disapproval of their choices comes through loud and clear.  You are also still doling out the food in quantities that you decide on, and asking them to &quot;wait until dinner&quot;.  You are upset because things are &quot;going to waste&quot; and &quot;biting your toungue&quot; at your kids while you describe a piece of fruit as &quot;beautiful and crispy&quot;.  And you ate the fruit even though you weren&#39;t hungry.  That was your choice based on your ideas of the &quot;Right way to handle leftover food&quot;.  I know that you are thinking of the money it takes to buy the food you have, and how much could be saved if things weren&#39;t wasted.   But when it comes right down to it....an apple has become a higher priority than the kids.<br/>\n<br/>\n  If they don&#39;t eat all the apple wedges, sprinkle them with lemon juice and put them in a zip lock bag.  They won&#39;t turn brown then.  Or, cook them down and make applesauce or compote out of them.<br/>\n  Can you just put all the food where they can freely access it?  And then just let them pick and choose what they want in whatever quantity they want.  That way you don&#39;t have to decide how much they should have of what.  They can decide for themselves.  Of course, then you will have to deal with the same problem I have....keeping enough around so that they aren&#39;t hording it :o).<br/>\n<br/>\n  It leaves the kitchen a bit of a mess, for sure.  And you&#39;ll have to deal with your feelings of things &quot;going to waste&quot;.  But the trade off is that they will learn how to eat in a way that satisfies their hunger, without attatching any particular signigicance to food.<br/>\n<br/>\n<br/>\n  &gt;&gt; It seems like the more I freedom I give, the ruder they get with me and each other.  &lt;&lt;<br/>\n<br/>\n  Are you really giving them freedom?  Or are you giving them the illusion of freedom while you monitor everything they do and hope they change?  It sounds like you are still holding on to your idea of &quot;the way things should be&quot; and hoping that by letting go of controls, they&#39;ll just naturally gravitate toward what you believe.<br/>\n<br/>\n  If you are really going to let go of controls, you have to let them develop their own...and they may not be the same as yours.<br/>\n<br/>\n  Kristen<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":193840366,"authorName":"valgird","from":"&quot;valgird&quot; &lt;valgird@...&gt;","profile":"valgird","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Why isn&#39;t this working!?","postDate":"1093117828","msgId":98669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGNnODkyNCt2MWJtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMTYwMWM0ODdhZCQ5MzAzODU3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":98668,"nextInTopic":98670,"prevInTime":98668,"nextInTime":98670,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"Andrea, I m new, but I see that nobody has responded to your e-mail, which brought tears to my eyes in empathy! You know, I think it is good to keep in mind","messageBody":"<div id=\"ygrps-yiv-1510397626\">Andrea,<br/>\n<br/>\nI&#39;m new, but I see that nobody has responded to your e-mail, which <br/>\nbrought tears to my eyes in empathy!<br/>\n<br/>\nYou know, I think it is good to keep in mind that *every* individual <br/>\nin the family is important and worthy of respect. That means that the <br/>\nchildren&#39;s needs and the parents&#39; needs are equally important. If one <br/>\nperson poses a physical or emotional threat to another, aren&#39;t the <br/>\nrights of the threatened person impinged upon? Can you help them to <br/>\nfigure out ways to work out difficulties - sometimes they just need a <br/>\nlittle help in figuring out how to make their needs/frustrations <br/>\nknown. (With my children, I might help one by saying something <br/>\nlike, &quot;You hit me! It hurt! Don&#39;t do it again!&quot; There isn&#39;t a <br/>\npunishment involved, but the hurt child may need that help in getting <br/>\na message across.)<br/>\nIf the family does not have enough money to buy &#39;junk&#39; food as well <br/>\nas healthy food, it seems fine to let the children in on that. Yes, <br/>\nchildren can and will make the &quot;right&quot; choices, and they may choose <br/>\nto have just what tastes good - as an adult, I know I&#39;d often choose <br/>\nchocolate over fruit, even knowing rationally why I shouldn&#39;t. I <br/>\nthink it is OK to talk to the children about healthy eating habits - <br/>\nyou know, not emotionally, but just informing - and let them know <br/>\nthat as long as there is a food budget, we as a family need to choose <br/>\nthings that will make our bodies healthy. Maybe you could help them <br/>\nfigure out the yummiest healthy food, and have them choose among <br/>\nthem...just to get them looking in that direction?<br/>\n <br/>\nI wonder if the little ones are asking for attention from the older <br/>\nones, and are still figuring out ways to do it. A pinch gets an <br/>\nimmediate response, eh! Maybe giving the older ones the words/tools <br/>\nto help them let the babies know they don&#39;t like it - those words, <br/>\nand even walking away from the baby - &quot;If you pinch me, I will go <br/>\naway from you so my body is safe&quot; (or something, you know) - without <br/>\na huge emotional response, which is sort of fun for a baby to get. <br/>\nKeeping calm is the hardest thing! But if you rob the baby of the <br/>\nresponse from the &#39;bad&#39; stuff, and then quickly come back and give <br/>\nlots of hugs and attention, they&#39;ll figure out how to get the nice <br/>\nthings they want without hurting others. Again, I really think it&#39;s <br/>\nso good to remember that *every* individual in the family is <br/>\ndeserving of respect, and one&#39;s individual freedom must stop where <br/>\nanother&#39;s begins. You can kick and run all you want, but when your <br/>\nfeet hit my body, well, that&#39;s enough! :)<br/>\n<br/>\nAbout the TV - why isn&#39;t your voice as important as others in this? <br/>\nIf you don&#39;t want to have one, can it at least be brought up? Can a <br/>\ncompromise be found - children can have it on sometimes, mom can have <br/>\nit off sometimes?<br/>\n  <br/>\nI do think when control has been heavy and is lifted, there can be <br/>\nchaos, as you are feeling (although I&#39;m sure to an outside observer, <br/>\nit&#39;s not that bad, really!). I wonder if going in smaller steps might <br/>\nbe helpful for everybody, as you all travel along this path? You <br/>\nknow, as the children become used to having their power and control, <br/>\nthey will also learn how to use it positively. <br/>\n<br/>\nI hope my post doesn&#39;t come off sounding bad, it&#39;s hard to get this <br/>\nacross in e-mail, and it&#39;s certainly not like I&#39;m some expert at <br/>\nthis. I just really feel for you and your famly, and I hope you can <br/>\nget the support you need in this. Clearly, you are a good, loving, <br/>\nand caring mother!<br/>\n<br/>\ntake care,<br/>\nJen</div>","specialLinks":[]},{"userId":185471567,"authorName":"Andrea Burlingame","from":"&quot;Andrea Burlingame&quot; &lt;aburlingame@...&gt;","profile":"raineeday66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Why isn&#39;t this working!?","postDate":"1093113301","msgId":98640,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTYwMWM0ODdhZCQ5MzAzODU3MCQxY2FlY2VkMUBoZXJvbm9mZmljZT4="},"prevInTopic":0,"nextInTopic":98647,"prevInTime":98639,"nextInTime":98641,"topicId":98640,"numMessagesInTopic":0,"msgSnippet":"I know this isn t a support group, but I don t have anyone else to talk to.  I keep loosening up the contol around here, and my children are just becoming more","messageBody":"<div id=\"ygrps-yiv-592098852\">I know this isn&#39;t a support group, but I don&#39;t have anyone else to talk to.  I keep loosening up the contol around here, and my children are just becoming more and more demanding.  And I am losing my cool even as much or more than ever, it seems.  There is the near-constant bickering and fighting that I&#39;ve mentioned before.  They hit and kick each other.  The 3yo does this for no apparent reason.  If I remove her from the scene, she yells screams and stomps her feet andthen when she finally calms down 15-20 minutes later and lets me hold her and care for her a bit, she goes right back in and starts bugging someone.  This is just one example of the complete chaos everyday is.  The baby (1yo) pulls everyones hair and scratches and bites and pinches when he is thwarted in any way (and sometimes for no apparent reason he&#39;ll just run over and hurt one of the girls when they are watching something on tv)<br/>\n<br/>\nAlso, they want to watch tv (dvd&#39;s in our case, since we can&#39;t get tv here and can&#39;t afford cable) first thing in the morning, before the sleep is rubbed out of their eyes, and then ask for it every hour or more all day long, even when I have other things to do with them.  I haven&#39;t been saying no except for when I just don&#39;t want to hear and see the blasted thing anymore.  I don&#39;t really like the tv on in the daytime.  It literally drones in my ears and I find it very distracting and I start to feel depressed when it&#39;s on as much as it&#39;s been on lately.  If it were up to me, we wouldn&#39;t have one.  I love to watch sometimes in the evenings, but this is just adding to the crazy-making (of me anyway)around here.  Plus, my kids are snippier and grumpier with alot of tv.  They are also more &quot;wired&quot;, literally bouncing off the walls after a long session.  I&#39;ve seen it before when I&#39;ve eased up, and now I&#39;ve been living with since June.  I keep hoping that they will get their fill and not be so obsessed with watching it, but I&#39;m really starting to lose it.<br/>\n<br/>\nI want to cry (and often do) everyday out of frustration with dealing with my children.  I feel guilty for getting so frustrated that yell and slam cabinets on occasion.  With 3 little ones, there is constantly something going on that needs my immediate attention.  (Since I sat down in desperation to write this, I&#39;ve stopped to mediate a fight twice, got a snack for someone 3 times, kissed an &quot;owie&quot; once, cleaned up an accident the 3 yo had, got the baby away from the hamsters once and removed him from the girls&#39; room just now--all in a space of what?  Maybe 10-15 minutes.  Argh!)  How do you get to a place of peace!?  I swear I&#39;ve been trying, but I keep failing miserably!<br/>\n<br/>\nYesterday we went shopping. All the recent posts had me inspired.  When 4 yo asked me for Red Vines, I said, &quot;yeah, grab a bag for us.&quot;  Then 3 yo immediately wanted chocolate teddy bear graham crackers.  &quot;OK.&quot;  MY budget is so strict that I shouldn&#39;t have been buying this stuff, but I was inspired to let them pick.  Well, they of course wanted EVERY single sweet treat they saw.  I said yes to a couple of other things (Frosted Flakes and ice cream), but then said that&#39;s all we could afford for now and we needed milk and eggs.  They were happy.   They ate a red vine on the way home and then I asked them to wait for more, since I was making dinner (Mac and Cheese, which they had been asking me for all day.)  Fine.  One ate most of her dinner and the other ate about half of a small bowl.  Said she was full.  Then they wanted ice cream.  I didn&#39;t say a word about being full, but got them each a little bowl of ice cream.  They also ate another red vine.  We tried to watch a movie at their request (they&#39;d already watched 3 that day), but the baby wouldn&#39;t let us and it was getting late, so we went to feed and play with the hamsters.  I suggested watching the movie later the next day, and 4 yo was fine, but 3 yo balked, even though she wasn&#39;t really watching the show anyway.  She finally came around, though grumpily and she was obviously tired at 10:30.  Circles under her eyes and all.  <br/>\n<br/>\nThis morning I got up at 7:30 and everyone else followed shortly afterward.  I am usually very cheerful in the morning, hoping for and ready for a happy day, and this day was no different.  I gave everyone hugs and asked them how they slept.  I asked everyone if they were hungry.  They wanted Frosted Flakes.  I poured them each a bowl and afterward offered some peanut butter in a spoon (something they like), because in the past a simple bowl of cereal has preceded grumpiness and them being hungry very shortly after eating.  4yo didn&#39;t want any, but 3yo  and 1yo ate a little.  Then they all wanted a movie, even though I had offered both the beach and to make plaster of paris creatures using balloons and then painting them with acrylic paint.  They also ate red vines.  My three year old asked for her 6th red vine and I suggested that we had some other snacks too.  Would she like an apple or some cheese?  4 yo squeals, &quot;Yes! and apple!and some chocolate bears!&quot;  3 yo screams, &quot;NO and stomps her feet and crosses her arms and demands red vines.&quot;  I gave her another red vine, cored and sliced and apple and gave everyone some bears.  4 yo says she doesn&#39;t have enough bears even before eating one.  I told her that if she was still hungry afterward and wanted more, she could have some.  I started cleaning up the very messy kitchen that didn&#39;t get cleaned the night before.  Before I could even get the dish water started, 4 yo says she is full and leaves the table full of uneaten apple wedges--beautiful, crispy, tart-sweet Braeburns that she used to love.  I bite my tongue and ate them myself even though I&#39;m not hungry.  I also peeled one wedge and gave it to the baby.   I hate to see them turn brown and go to waste.  Then, about 20 minutes later, 4 yo comes up to me and says she&#39;s hungry.  She asked me for chocolate bears.  3 yo asked for more red vines.  They have been fighting and whining and screaming at each other and me all morning.  I said no to more bears and vines and 3 yo started screaming at me and stomping her feet.  I held her firmly by the arms and said, &quot;Enough!  I don&#39;t like to be screamed at.&quot;  She started crying and stomping her feet and finally went off to play.<br/>\n<br/>\nI&#39;m sorry this is so long.  It doesn&#39;t even scratch the surface of what goes on around here.  Though we also have fun, many of our days are filled with fighting, crying,  and whining.  I just don&#39;t know what to do.  It wasn&#39;t always this hard.  It seems like the more I freedom I give, the ruder they get with me and each other.  I have to go, because my baby is crying and needing to nurse, and the girls are fighting again, so I can&#39;t even think to explain the nuances of our life.  I&#39;m just so tired of this.  So tired.  <br/>\n<br/>\n~Andrea<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":99172,"nextTopicId":99188}}