{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":52490229,"authorName":"Leslie Avery","from":"Leslie Avery &lt;ljbakavery@...&gt;","profile":"ljbakavery","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] reading &quot;late&quot;","postDate":"1026063655","msgId":39060,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNzA3MTc0MDU1Ljc5MTI3LnFtYWlsQHdlYjQwMTA3Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDUuMC4yLjEuMC4yMDAyMDcwMzE5MjYwNy4wMmE1Y2EwMEBsb2NhbGhvc3Q+"},"prevInTopic":38968,"nextInTopic":0,"prevInTime":39059,"nextInTime":39061,"topicId":38929,"numMessagesInTopic":0,"msgSnippet":"This article really help put me at ease about reading. My son is 9 and doesn t read nor does he show any interest.  although lately I have noticed he is asking","messageBody":"<div id=\"ygrps-yiv-605796534\">This article really help put me at ease about reading.<br/>\n My son is 9 and doesn&#39;t read nor does he show any<br/>\ninterest.  although lately I have noticed he is asking<br/>\nme to put my finger under the words as I read to him. <br/>\n<br/>\n<br/>\nI have been a total believer in natural learning for<br/>\nabout 4 years but the reading hurdle was a hard one to<br/>\nget over until I read this article.  I realized why,<br/>\nbecause I needed to deschool myself from what I had<br/>\nheard and learned through my own experiences and<br/>\nthrough &quot;peer pressure&quot;  (Peer pressure at 46 years<br/>\nold who would have thought).<br/>\n<br/>\nLeslie<br/>\n--- Tia Leschke &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a>&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; &gt;<br/>\n&gt; &gt;This has been comforting to read but I wonder how<br/>\n&gt; strong my faith in my<br/>\n&gt; &gt;children will be if they end up being late readers.<br/>\n&gt; I hope as strong as<br/>\n&gt; &gt;yours Sandra<br/>\n&gt; <br/>\n&gt; Mine faltered when Lars turned 12 and couldn&#39;t read.<br/>\n&gt;  That seemed to be my <br/>\n&gt; personal comfort level.  I wish I hadn&#39;t pressured<br/>\n&gt; him then.<br/>\n&gt; Tia<br/>\n&gt; <br/>\n&gt; No one can make you feel inferior without your<br/>\n&gt; consent.<br/>\n&gt; Eleanor Roosevelt<br/>\n&gt; *********************************************<br/>\n&gt; Tia Leschke<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\n&gt; On Vancouver Island<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n </span></blockquote>__________________________________________________<br/>\nDo You Yahoo!?<br/>\nSign up for SBC Yahoo! Dial - First Month Free<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sbc.yahoo.com\">http://sbc.yahoo.com</a></div>","specialLinks":[]},{"userId":1509055,"authorName":"Tia Leschke","from":"Tia Leschke &lt;leschke@...&gt;","profile":"leschke2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] reading &quot;late&quot;","postDate":"1025749636","msgId":38968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMC4yLjEuMC4yMDAyMDcwMzE5MjYwNy4wMmE1Y2EwMEBsb2NhbGhvc3Q+","inReplyToHeader":"PDAxMGYwMWMyMjJmYyRlODg3ZWJjMCRlOTAwYThjMEBzdWViPg==","referencesHeader":"PDFhMi40YTQ5YjRkLjJhNTQ1NDAwQGFvbC5jb20+"},"prevInTopic":38966,"nextInTopic":39060,"prevInTime":38967,"nextInTime":38969,"topicId":38929,"numMessagesInTopic":0,"msgSnippet":"... Mine faltered when Lars turned 12 and couldn t read.  That seemed to be my personal comfort level.  I wish I hadn t pressured him then. Tia No one can make","messageBody":"<div id=\"ygrps-yiv-327498553\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;This has been comforting to read but I wonder how strong my faith in my<br/>\n&gt;children will be if they end up being late readers. I hope as strong as<br/>\n&gt;yours Sandra<br/>\n<br/>\n </span></blockquote>Mine faltered when Lars turned 12 and couldn&#39;t read.  That seemed to be my <br/>\npersonal comfort level.  I wish I hadn&#39;t pressured him then.<br/>\nTia<br/>\n<br/>\nNo one can make you feel inferior without your consent.<br/>\nEleanor Roosevelt<br/>\n*********************************************<br/>\nTia Leschke<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:leschke@...\">leschke@...</a><br/>\nOn Vancouver Island</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] reading &quot;late&quot;","postDate":"1025749438","msgId":38966,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1LjI5MjVjYjdhLjJhNTUwYmJlQGFvbC5jb20+"},"prevInTopic":38965,"nextInTopic":38968,"prevInTime":38965,"nextInTime":38967,"topicId":38929,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/3/02 7:49:18 PM, werapfamily@optushome.com.au writes: ","messageBody":"<div id=\"ygrps-yiv-698886551\">In a message dated 7/3/02 7:49:18 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:werapfamily@...\">werapfamily@...</a> writes:<br/>\n<br/>\n&lt;&lt; This has been comforting to read but I wonder how strong my faith in my<br/>\nchildren will be if they end up being late readers. I hope as strong as<br/>\nyours Sandra &gt;&gt;<br/>\n<br/>\nIf you see them learn to read on their own at ANY age your faith in their <br/>\nability to learn will be stronger than if you feel you had to teach them to <br/>\nread.<br/>\n<br/>\nIf you &quot;teach them&quot; before they&#39;re ready you can do more damage than good, <br/>\noverall.  AND if you teach them just as they&#39;re ready and they learn easily, <br/>\nyou&#39;re likely to believe that they ONLY learned because you &quot;taught&quot; them.  <br/>\nThey&#39;ll probably feel the same way.  And it will seem your obligation and <br/>\nduty to teach them everything else.<br/>\n<br/>\nNatural learning can&#39;t happen unless you back off and give it a chance.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":77615025,"authorName":"Sue","from":"&quot;Sue&quot; &lt;werapfamily@...&gt;","profile":"werapfamily","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] reading &quot;late&quot;","postDate":"1025747314","msgId":38965,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxMGYwMWMyMjJmYyRlODg3ZWJjMCRlOTAwYThjMEBzdWViPg==","referencesHeader":"PDFhMi40YTQ5YjRkLjJhNTQ1NDAwQGFvbC5jb20+"},"prevInTopic":38943,"nextInTopic":38966,"prevInTime":38964,"nextInTime":38966,"topicId":38929,"numMessagesInTopic":0,"msgSnippet":"... and ... This has been comforting to read but I wonder how strong my faith in my children will be if they end up being late readers. I hope as strong as ","messageBody":"<div id=\"ygrps-yiv-198353639\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; &lt;&lt; I&#39;m not particularly worried. He didn&#39;t really talk until he was 2 1/2<br/>\n </span></blockquote>and<br/>\n<blockquote><span title=\"ireply\"> &gt; was potty trained at 4 1/2 ....he like&#39;s to think about things a lot....<br/>\n&gt;&gt;<br/>\n&gt;<br/>\n&gt; I was surprised that all my kids read late.  Holly&#39;s still sounding out<br/>\n&gt; longer words, and she&#39;s ten.  The boys zip along on anything at 15 and 13,<br/>\n&gt; but they didn&#39;t read until eight and nine.<br/>\n&gt;<br/>\n </span></blockquote>This has been comforting to read but I wonder how strong my faith in my<br/>\nchildren will be if they end up being late readers. I hope as strong as<br/>\nyours Sandra<br/>\n<br/>\nSue<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":3490918,"authorName":"MDMomatHm@aol.com","from":"MDMomatHm@...","profile":"mdmomathm","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] reading &quot;late&quot;","postDate":"1025706178","msgId":38938,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMi4xMDMwYzBlYy4yYTU0NjJjMkBhb2wuY29tPg=="},"prevInTopic":38929,"nextInTopic":38943,"prevInTime":38937,"nextInTime":38939,"topicId":38929,"numMessagesInTopic":0,"msgSnippet":"Most people seem to equate reading early with intelligence ....so I tell them that I started to read at 3....so I m smart enough o know what I m doing.... ","messageBody":"<div id=\"ygrps-yiv-1602281887\">Most people seem to equate reading early with intelligence ....so I tell them <br/>\nthat I started to read at 3....so I&#39;m smart enough o know what I&#39;m doing....<br/>\n<br/>\nRegina<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"reading &quot;late&quot;","postDate":"1025702400","msgId":38929,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFhMi40YTQ5YjRkLjJhNTQ1NDAwQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":38938,"prevInTime":38928,"nextInTime":38930,"topicId":38929,"numMessagesInTopic":0,"msgSnippet":"In a message dated 7/2/02 10:44:59 PM, MDMomatHm@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-2040800254\">In a message dated 7/2/02 10:44:59 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MDMomatHm@...\">MDMomatHm@...</a> writes:<br/>\n<br/>\n&lt;&lt; I&#39;m not particularly worried. He didn&#39;t really talk until he was 2 1/2 and <br/>\nwas potty trained at 4 1/2 ....he like&#39;s to think about things a lot.... &gt;&gt;<br/>\n<br/>\nI was surprised that all my kids read late.  Holly&#39;s still sounding out <br/>\nlonger words, and she&#39;s ten.  The boys zip along on anything at 15 and 13, <br/>\nbut they didn&#39;t read until eight and nine.<br/>\n<br/>\nMy kids hang out with another family they&#39;ve known since infancy through La <br/>\nLeche League, babysitting co-op and homeschooling, and the late reading of <br/>\nthat family is documented in the library (first page) of www.unschooling.com<br/>\n<br/>\nbut here&#39;s a less attractive dump of it (OH!  And Julie, the youngest, had <br/>\nher birthday this week, is up to a book a DAY, and Marty bought her four <br/>\nnovels for the birthday):<br/>\n<br/>\nI CAN BREATHE AGAIN—MY CHILDREN FINALLY LEARNED TO READ<br/>\nby Carol Rice<br/>\n<br/>\nWaiting to Exhale was such an inspiring book. In fact, just its title <br/>\ninspires me the most. Have you ever caught yourself &quot;waiting to exhale&quot;?<br/>\n<br/>\nI have spent so much of my life holding my breath. Raising my children has <br/>\ncertainly been one of those situations. For me, every decision in parenting <br/>\nhad to be thoroughly researched and then deliberated and discussed. And once <br/>\nthe decision was made, I found myself holding my breath, worrying about how <br/>\nit would turn out.<br/>\n<br/>\nOne of the most deliberated decisions I made for my kids was the education <br/>\ndecision—whether to homeschool or not, and how to homeschool. It wasn&#39;t a <br/>\ndecision made once and then laid to rest, either. It was a decision <br/>\ndeliberated daily for years. How much should I push them, how much should I <br/>\nlet them be, what should I teach them and how and when? I tried many <br/>\ndifferent approaches from often widely opposing viewpoints. And as I swung <br/>\nmadly about, my kids just seemed to go about their business, unaware of the <br/>\nconundrums I faced.<br/>\n<br/>\nWhen my first child was a baby, a friend was very excited about a method of <br/>\nteaching your baby to read that was popular at the time. We decided to try <br/>\nwith our babies, envisioning our babies reading very young and growing up <br/>\nvery smart and well educated. Neither of our babies took to the program well, <br/>\neven though we tried it with them again and again. My son, Chris, refused to <br/>\nread at two years, then at three years. I gradually tried more traditional <br/>\nways of teaching him letters and sounds. Surely he would read by five years <br/>\nof age. But not Chris. Maybe by the time he was six years old, or by seven? <br/>\nBut Chris refused to be forced or cajoled into reading. By now his friends <br/>\nwere learning to read in school, but Chris still couldn&#39;t read. He struggled <br/>\nto decipher simple words and he hated trying to read because it was so <br/>\nfrustrating.<br/>\n<br/>\nI was holding my breath the whole time. I was battling tremendous self-doubt. <br/>\nI must be an awful mother. Some folks advised me to take Chris to <br/>\nspecialists, test his hearing, eyesight, cognitive abilities, look into <br/>\nreading labs for him. Deep in my soul, those didn&#39;t feel right and I never <br/>\ntook Chris to any of those things. <br/>\n<br/>\nAnd then the miracle happened. Right about his ninth birthday, reading <br/>\nclicked in his mind and he just began reading. Within a month he was reading <br/>\neasily at his grade level. Within a year he had read every book on airplanes <br/>\nat the public library. The librarian, who thought he was a wonderful and <br/>\nprecocious child because he read so much, gave him a special &quot;adult&quot; library <br/>\ncard, so he could begin checking out adult books about airplanes.<br/>\n<br/>\nI breathed a sigh of relief. The muscles in my stomach could finally relax. I <br/>\ncould let my shoulders drop and I could unfurrow my brow. One of my kids, at <br/>\nlong last, was reading.<br/>\n<br/>\nBut there were two more kids behind Chris. Renee and Liam, twins, are two <br/>\nyears younger than Chris. Already they were seven years old. I had been <br/>\ntrying to teach them to read alongside of Chris, to learn letter names and <br/>\nsounds, string the sounds together, hurry up and read! But like Chris, they <br/>\nrefused to read as babies. They refused to read at two years, three years, <br/>\neven at five, six and seven years of age. There were times when I believed <br/>\nnone of my kids would ever read. And of course it would be all my fault.<br/>\n<br/>\nFor a while I assured myself that Chris was unusual, and that my younger kids <br/>\nwould read early or at least at a &quot;normal&quot; age. And I consoled myself with <br/>\nthe fact that their dad and uncle had both been later readers. But my sister <br/>\nand I had both taken to reading young. Therefore it must be something on the <br/>\ntroublesome Y gene. Perhaps my sons would learn to read late, like their male <br/>\nrelatives. But my daughter would learn to read at a normal age, like my <br/>\nsister and me, surely.<br/>\n<br/>\nBut Renee had a mind of her own. Boy, truer words have never been spoken. <br/>\nPeople will attest to Renee having a mind of her own. And she would learn to <br/>\nread when she was darn good and ready. As the years went by, and she didn&#39;t <br/>\nread, I assured myself she would be like Chris after all and learn to read at <br/>\nher ninth birthday. But her ninth birthday came and went and still she didn&#39;t <br/>\nread. How could anyone learn to read even later than nine years old, I <br/>\nscreamed inside my head. On the outside I smiled patiently.<br/>\n<br/>\nWithin the next year she slowly began reading. It wasn&#39;t the amazing <br/>\novernight reading leap that Chris had taken. But by her tenth birthday she <br/>\nwas reading quite happily, although a little behind her grade level. By her <br/>\neleventh birthday, she was reading quite well at her grade level.<br/>\n<br/>\nI breathed a half-hearted small sigh of relief. Thank goodness she was <br/>\nfinally reading. But my attention was stolen by her twin brother, Liam. Liam <br/>\nwas a beautiful little child with light blond curly hair and a mischievous <br/>\nsmile. He was as smart as could be, but wouldn&#39;t learn to read, no matter how <br/>\nmuch he struggled, not at nine years, not at ten years, not at eleven years <br/>\nof age.<br/>\n<br/>\nPeople came out of the woodwork with ideas on what to do. I could have spent <br/>\na million dollars on specialists to find out how to teach Liam how to read <br/>\nand to learn why he wasn&#39;t reading yet. But it just didn&#39;t feel right, so I <br/>\nnever took him either.<br/>\n<br/>\nInstead I leaned heavily on the words of John Holt. He said that many kids, <br/>\nespecially boys, when left to their own learning pace, would not read until <br/>\neleven to fifteen years of age. This idea was hard for me to believe before <br/>\nthis, but now I embraced it. But even then, I still didn&#39;t believe that <br/>\nanyone who couldn&#39;t read by the age of fifteen was of normal intelligence.<br/>\n<br/>\nI bet Liam would read by age twelve then. He was a smart kid. He would get it <br/>\nsoon. But he wasn&#39;t reading at his twelfth birthday. Not at his fourteenth <br/>\nbirthday, not even at his fifteenth birthday. At that point I even gave up on <br/>\nJohn Holt&#39;s philosophy too.<br/>\n<br/>\nI tried to let Liam learn at his own pace and not worry (although my stomach <br/>\nwas clenched while I held my breath, hunched my shoulders and furrowed my <br/>\nbrow). I turned my attention to my youngest child, Julie, who was four years <br/>\nyounger Maybe she would learn to read early, I hoped vaguely. But she didn&#39;t. <br/>\nMaybe she would read at six or seven years old and I should be on the lookout <br/>\nfor clues to teach her letters, sounds, something. There were no signs, and <br/>\nthe years went by. Maybe she would be like Chris and miraculously read at age <br/>\nnine. Age nine came and went. Then surely she would be like her sister, and <br/>\ngradually pick it up between the ages of nine and ten. Her tenth birthday <br/>\ncame and went and still no reading. She struggled with very simple words. It <br/>\nwas as though there just wasn&#39;t a place in her brain that could master the <br/>\nreading process. Not yet.<br/>\nHer older sister tried to help her learn to read. Her friends&#39; mothers tried <br/>\nto teach her to read. All were loving and patient and, sadly, unsuccessful.<br/>\n<br/>\nJulie&#39;s twelfth birthday came. She could read a little, but only with great <br/>\ndifficulty and frustration. Liam&#39;s sixteenth birthday came the next month. He <br/>\ncould read a little too, haltingly, and with great effort. What to do? I just <br/>\ndoggedly held on to the belief that they would read someday. I didn&#39;t <br/>\nconsider specialists or therapies. I just waited, trying to ignore the <br/>\nworried voices in my head.<br/>\n<br/>\nThen something happened. I have no idea what. They both just started reading. <br/>\nMaybe it was the incentive of online chatting. Maybe it was long boring days <br/>\nat home. Maybe it was just the right time, and the parts of their brains that <br/>\ncan process the written word had a growth spurt. It doesn&#39;t matter.<br/>\n<br/>\nLiam is sixteen and a half now. Six months ago, he was unsure about taking a <br/>\ndriver&#39;s ed class for fear his reading level might cause him to lag far <br/>\nbehind the class, or for fear of the embarrassment it might cause him. And <br/>\nhow could he take notes? Would it be too much?<br/>\n<br/>\nToday he is reading adult level books out of his father&#39;s paperback <br/>\ncollection. He loves war stores based on real battles and other kinds of <br/>\nadventure books. Julie is devouring Harry Potter and Goosebumps . They are <br/>\nboth reading about a book a week.<br/>\n<br/>\nAt long last all my kids are reading. I can stop holding my breath. I can <br/>\nbreathe deeply and can actually dare to use both my lungs. It has been many <br/>\nyears of waiting to exhale. The wonderful world of books has opened to them. <br/>\n<br/>\nA book a week! Do you know what that means? They always have their noses in <br/>\nbooks! I take a deep breath and as I exhale, I holler, &quot;Liam, Julie, put <br/>\nthose books down! Pay attention to me when I&#39;m talking to you. Stop reading <br/>\nfor five minutes and get in there and help with dinner! Have you done your <br/>\nchores today or have you just sat there on the couch reading all day long?&quot; <br/>\nThey look at me, annoyed, and come dragging into the kitchen. I look into <br/>\ntheir eyes and remember the years of waiting. I breathe a silent prayer of <br/>\nthanks for my kids and for the patience it took for me to wait until they <br/>\nread. The excitement of their reading returns to me.<br/>\n&quot;Hey, so what book are you reading now, honey?&quot;<br/>\n<br/>\n[This article originally appeared in the Spring 2001 issue of Enchanted <br/>\nFamilies, a local publication in Albuquerque, New Mexico. For permission to <br/>\nreprint or to write to the author: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Starseeker11@...\">Starseeker11@...</a>]</div>","specialLinks":[]},{"userId":92305498,"authorName":"LLindsey","from":"&quot;LLindsey&quot; &lt;llindsey@...&gt;","profile":"lllindsey","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] reading &quot;late&quot;","postDate":"1025633450","msgId":38943,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzZWEwMWMyMjFmMyRjY2ViNTZlMCQwMDAwYTM5OEBDSElMRD4=","referencesHeader":"PDFhMi40YTQ5YjRkLjJhNTQ1NDAwQGFvbC5jb20+"},"prevInTopic":38938,"nextInTopic":38965,"prevInTime":38942,"nextInTime":38944,"topicId":38929,"numMessagesInTopic":0,"msgSnippet":"(oops.. this got long before i noticed.. be glad i t writing. talking-- i really get out of control) sandra, what a great article! i love it!! i gotta keep it","messageBody":"<div id=\"ygrps-yiv-497599612\">(oops.. this got long before i noticed.. be glad i&#39;t writing. talking-- i really get out of control)<br/>\n<br/>\nsandra, what a great article! i love it!! i gotta keep it and include it in my &quot;packets&quot; i shall prepare for my older son&#39;s teachers .. as long as he wants to go to high school, i must &quot;prepare&quot; his teachers.. lol... (i must confess, i have learned to find great pleasure in telling them how to deal with my child.. and even a harsh word or two (or more) to a former-bully-presently-bullheaded jr hi principal gave me a bit of a rush.. .. i just wish i&#39;d insisted he just SKIP jr hi.. or the rest of school.. but he wants to try high school.. he&#39;s the kid that fails classes (the honors ones we insist they put him in) but totally aces standardized tests and complains because he must correct his teachers on their facts so often. (okay okay.. i want to brag on him, i admit it.. the kid&#39;s brilliant.. and learned NONE of it at school..)<br/>\n<br/>\nand julie and susan. one thing that i think is very important is to have faith in ourselves and our kids. it is amazing what kids learn when left on their own.. even when we aer in the other room working.... and remember, if we are feeling guilty, or like we are doing a bad job those negative thoughts will translate themselves to our children. we want them to have confidence and faith in themsleves as well.. so read articles like this one and remind yourself that you are doing the best for your child.. at least they are not in the state subsidized &#39;obedience training&#39; called public school. i know i work so hard not to just yell GO AWAY.. to my kids when i&#39;m trying to concentrate and work, and they want to show me how they can jump on a big beach ball... but i forgive myself for my slips and go on.. i might even apoligise later and explain about real life meaning mom&#39;s gotta get things done... (it&#39; s not like they don&#39;t tell me to GO AWAY when they are in the middle of a video game and i want to get all mommyish and mushy)... <br/>\n<br/>\ni think one of the important lessons in life is to focus on the positive... it will multiply.. and don&#39;t beat yourself up.. for one thing you are teaching your kids to do the best they can.. with what they have.. when we think.. oh we&#39;re bad parents... i think we are succumbing to the prevailing notion of someone-else-knows-better-than-me-so-i-better-do-what-i&#39;m-told--- --you know.. the great lesson they learn at school.. so i guess we gotta unschool ourselves as well. to trust ourselves and our kids ... i know we will find a way to deal with our work and unschooling.. and our kids will end up better educated than most high school graduates..<br/>\n<br/>\nand my youngest,8, taught himself to read, add, subtract and a lot of geography .. and amazingly early.. for  a kid at home on his own.(when he was in kindergarten.. failing cut and paste at school) . i sure didn&#39;t put out the effort to try to teach him at five.. he did it all without even really noticing because he wanted the information on the sports page.. it was funny.. suddenly he was telling me about basketball scores and different players and knew where the teams were from... i just recently let him in on the secret that he was teaching himself geography when he did this.. he was appalled.. as he professes to hate to learn anything.. lololll<br/>\n<br/>\nLinda L<br/>\nkindergarten/first grade teachers of both my boys had this thing about cutting and gluing.. and apparently it concerned them that my kids were not good at this at about five and six years of age.. i never really got the importance of being able to cut and paste perfectly at this age.. haha. like GET A LIFE... PLEASE... they can cut and paste later.. if they EVER find a reason to do it.. (altho .. as an artist, myself i find it a quite pleasurable occupation.. hahhaaahah.. )<br/>\nwhich reminds me.. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a> <br/>\n  Sent: Wednesday, July 03, 2002 6:20 AM<br/>\n  Subject: [Unschooling-dotcom] reading &quot;late&quot;<br/>\n<br/>\n<br/>\n<br/>\n  In a message dated 7/2/02 10:44:59 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:MDMomatHm@...\">MDMomatHm@...</a> writes:<br/>\n<br/>\n  &lt;&lt; I&#39;m not particularly worried. He didn&#39;t really talk until he was 2 1/2 and <br/>\n  was potty trained at 4 1/2 ....he like&#39;s to think about things a lot.... &gt;&gt;<br/>\n<br/>\n  I was surprised that all my kids read late.  Holly&#39;s still sounding out <br/>\n  longer words, and she&#39;s ten.  The boys zip along on anything at 15 and 13, <br/>\n  but they didn&#39;t read until eight and nine.<br/>\n<br/>\n  My kids hang out with another family they&#39;ve known since infancy through La <br/>\n  Leche League, babysitting co-op and homeschooling, and the late reading of <br/>\n  that family is documented in the library (first page) of www.unschooling.com<br/>\n<br/>\n  but here&#39;s a less attractive dump of it (OH!  And Julie, the youngest, had <br/>\n  her birthday this week, is up to a book a DAY, and Marty bought her four <br/>\n  novels for the birthday):<br/>\n<br/>\n  I CAN BREATHE AGAIN—MY CHILDREN FINALLY LEARNED TO READ<br/>\n  by Carol Rice<br/>\n<br/>\n  Waiting to Exhale was such an inspiring book. In fact, just its title <br/>\n  inspires me the most. Have you ever caught yourself &quot;waiting to exhale&quot;?<br/>\n<br/>\n  I have spent so much of my life holding my breath. Raising my children has <br/>\n  certainly been one of those situations. For me, every decision in parenting <br/>\n  had to be thoroughly researched and then deliberated and discussed. And once <br/>\n  the decision was made, I found myself holding my breath, worrying about how <br/>\n  it would turn out.<br/>\n<br/>\n  One of the most deliberated decisions I made for my kids was the education <br/>\n  decision—whether to homeschool or not, and how to homeschool. It wasn&#39;t a <br/>\n  decision made once and then laid to rest, either. It was a decision <br/>\n  deliberated daily for years. How much should I push them, how much should I <br/>\n  let them be, what should I teach them and how and when? I tried many <br/>\n  different approaches from often widely opposing viewpoints. And as I swung <br/>\n  madly about, my kids just seemed to go about their business, unaware of the <br/>\n  conundrums I faced.<br/>\n<br/>\n  When my first child was a baby, a friend was very excited about a method of <br/>\n  teaching your baby to read that was popular at the time. We decided to try <br/>\n  with our babies, envisioning our babies reading very young and growing up <br/>\n  very smart and well educated. Neither of our babies took to the program well, <br/>\n  even though we tried it with them again and again. My son, Chris, refused to <br/>\n  read at two years, then at three years. I gradually tried more traditional <br/>\n  ways of teaching him letters and sounds. Surely he would read by five years <br/>\n  of age. But not Chris. Maybe by the time he was six years old, or by seven? <br/>\n  But Chris refused to be forced or cajoled into reading. By now his friends <br/>\n  were learning to read in school, but Chris still couldn&#39;t read. He struggled <br/>\n  to decipher simple words and he hated trying to read because it was so <br/>\n  frustrating.<br/>\n<br/>\n  I was holding my breath the whole time. I was battling tremendous self-doubt. <br/>\n  I must be an awful mother. Some folks advised me to take Chris to <br/>\n  specialists, test his hearing, eyesight, cognitive abilities, look into <br/>\n  reading labs for him. Deep in my soul, those didn&#39;t feel right and I never <br/>\n  took Chris to any of those things. <br/>\n<br/>\n  And then the miracle happened. Right about his ninth birthday, reading <br/>\n  clicked in his mind and he just began reading. Within a month he was reading <br/>\n  easily at his grade level. Within a year he had read every book on airplanes <br/>\n  at the public library. The librarian, who thought he was a wonderful and <br/>\n  precocious child because he read so much, gave him a special &quot;adult&quot; library <br/>\n  card, so he could begin checking out adult books about airplanes.<br/>\n<br/>\n  I breathed a sigh of relief. The muscles in my stomach could finally relax. I <br/>\n  could let my shoulders drop and I could unfurrow my brow. One of my kids, at <br/>\n  long last, was reading.<br/>\n<br/>\n  But there were two more kids behind Chris. Renee and Liam, twins, are two <br/>\n  years younger than Chris. Already they were seven years old. I had been <br/>\n  trying to teach them to read alongside of Chris, to learn letter names and <br/>\n  sounds, string the sounds together, hurry up and read! But like Chris, they <br/>\n  refused to read as babies. They refused to read at two years, three years, <br/>\n  even at five, six and seven years of age. There were times when I believed <br/>\n  none of my kids would ever read. And of course it would be all my fault.<br/>\n<br/>\n  For a while I assured myself that Chris was unusual, and that my younger kids <br/>\n  would read early or at least at a &quot;normal&quot; age. And I consoled myself with <br/>\n  the fact that their dad and uncle had both been later readers. But my sister <br/>\n  and I had both taken to reading young. Therefore it must be something on the <br/>\n  troublesome Y gene. Perhaps my sons would learn to read late, like their male <br/>\n  relatives. But my daughter would learn to read at a normal age, like my <br/>\n  sister and me, surely.<br/>\n<br/>\n  But Renee had a mind of her own. Boy, truer words have never been spoken. <br/>\n  People will attest to Renee having a mind of her own. And she would learn to <br/>\n  read when she was darn good and ready. As the years went by, and she didn&#39;t <br/>\n  read, I assured myself she would be like Chris after all and learn to read at <br/>\n  her ninth birthday. But her ninth birthday came and went and still she didn&#39;t <br/>\n  read. How could anyone learn to read even later than nine years old, I <br/>\n  screamed inside my head. On the outside I smiled patiently.<br/>\n<br/>\n  Within the next year she slowly began reading. It wasn&#39;t the amazing <br/>\n  overnight reading leap that Chris had taken. But by her tenth birthday she <br/>\n  was reading quite happily, although a little behind her grade level. By her <br/>\n  eleventh birthday, she was reading quite well at her grade level.<br/>\n<br/>\n  I breathed a half-hearted small sigh of relief. Thank goodness she was <br/>\n  finally reading. But my attention was stolen by her twin brother, Liam. Liam <br/>\n  was a beautiful little child with light blond curly hair and a mischievous <br/>\n  smile. He was as smart as could be, but wouldn&#39;t learn to read, no matter how <br/>\n  much he struggled, not at nine years, not at ten years, not at eleven years <br/>\n  of age.<br/>\n<br/>\n  People came out of the woodwork with ideas on what to do. I could have spent <br/>\n  a million dollars on specialists to find out how to teach Liam how to read <br/>\n  and to learn why he wasn&#39;t reading yet. But it just didn&#39;t feel right, so I <br/>\n  never took him either.<br/>\n<br/>\n  Instead I leaned heavily on the words of John Holt. He said that many kids, <br/>\n  especially boys, when left to their own learning pace, would not read until <br/>\n  eleven to fifteen years of age. This idea was hard for me to believe before <br/>\n  this, but now I embraced it. But even then, I still didn&#39;t believe that <br/>\n  anyone who couldn&#39;t read by the age of fifteen was of normal intelligence.<br/>\n<br/>\n  I bet Liam would read by age twelve then. He was a smart kid. He would get it <br/>\n  soon. But he wasn&#39;t reading at his twelfth birthday. Not at his fourteenth <br/>\n  birthday, not even at his fifteenth birthday. At that point I even gave up on <br/>\n  John Holt&#39;s philosophy too.<br/>\n<br/>\n  I tried to let Liam learn at his own pace and not worry (although my stomach <br/>\n  was clenched while I held my breath, hunched my shoulders and furrowed my <br/>\n  brow). I turned my attention to my youngest child, Julie, who was four years <br/>\n  younger Maybe she would learn to read early, I hoped vaguely. But she didn&#39;t. <br/>\n  Maybe she would read at six or seven years old and I should be on the lookout <br/>\n  for clues to teach her letters, sounds, something. There were no signs, and <br/>\n  the years went by. Maybe she would be like Chris and miraculously read at age <br/>\n  nine. Age nine came and went. Then surely she would be like her sister, and <br/>\n  gradually pick it up between the ages of nine and ten. Her tenth birthday <br/>\n  came and went and still no reading. She struggled with very simple words. It <br/>\n  was as though there just wasn&#39;t a place in her brain that could master the <br/>\n  reading process. Not yet.<br/>\n  Her older sister tried to help her learn to read. Her friends&#39; mothers tried <br/>\n  to teach her to read. All were loving and patient and, sadly, unsuccessful.<br/>\n<br/>\n  Julie&#39;s twelfth birthday came. She could read a little, but only with great <br/>\n  difficulty and frustration. Liam&#39;s sixteenth birthday came the next month. He <br/>\n  could read a little too, haltingly, and with great effort. What to do? I just <br/>\n  doggedly held on to the belief that they would read someday. I didn&#39;t <br/>\n  consider specialists or therapies. I just waited, trying to ignore the <br/>\n  worried voices in my head.<br/>\n<br/>\n  Then something happened. I have no idea what. They both just started reading. <br/>\n  Maybe it was the incentive of online chatting. Maybe it was long boring days <br/>\n  at home. Maybe it was just the right time, and the parts of their brains that <br/>\n  can process the written word had a growth spurt. It doesn&#39;t matter.<br/>\n<br/>\n  Liam is sixteen and a half now. Six months ago, he was unsure about taking a <br/>\n  driver&#39;s ed class for fear his reading level might cause him to lag far <br/>\n  behind the class, or for fear of the embarrassment it might cause him. And <br/>\n  how could he take notes? Would it be too much?<br/>\n<br/>\n  Today he is reading adult level books out of his father&#39;s paperback <br/>\n  collection. He loves war stores based on real battles and other kinds of <br/>\n  adventure books. Julie is devouring Harry Potter and Goosebumps . They are <br/>\n  both reading about a book a week.<br/>\n<br/>\n  At long last all my kids are reading. I can stop holding my breath. I can <br/>\n  breathe deeply and can actually dare to use both my lungs. It has been many <br/>\n  years of waiting to exhale. The wonderful world of books has opened to them. <br/>\n<br/>\n  A book a week! Do you know what that means? They always have their noses in <br/>\n  books! I take a deep breath and as I exhale, I holler, &quot;Liam, Julie, put <br/>\n  those books down! Pay attention to me when I&#39;m talking to you. Stop reading <br/>\n  for five minutes and get in there and help with dinner! Have you done your <br/>\n  chores today or have you just sat there on the couch reading all day long?&quot; <br/>\n  They look at me, annoyed, and come dragging into the kitchen. I look into <br/>\n  their eyes and remember the years of waiting. I breathe a silent prayer of <br/>\n  thanks for my kids and for the patience it took for me to wait until they <br/>\n  read. The excitement of their reading returns to me.<br/>\n  &quot;Hey, so what book are you reading now, honey?&quot;<br/>\n<br/>\n  [This article originally appeared in the Spring 2001 issue of Enchanted <br/>\n  Families, a local publication in Albuquerque, New Mexico. For permission to <br/>\n  reprint or to write to the author: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Starseeker11@...\">Starseeker11@...</a>] <br/>\n<br/>\n        Yahoo! Groups Sponsor <br/>\n          <br/>\n<br/>\n  If you have questions, concerns or problems with this list, please email the Moderator, Joyce Fetteroll, at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a><br/>\n<br/>\n  To unsubscribe from this group, send an email to:<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n  Visit the Unschooling website: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n<br/>\n  Your use of Yahoo! Groups is subject to the Yahoo! Terms of Service. <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]}],"prevTopicId":38981,"nextTopicId":39064}}