{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":7143857,"authorName":"jrossedd@aol.com","from":"jrossedd@...","profile":"jrossedd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Hating to Lose at Games was:  Brag on Kirby","postDate":"1080659142","msgId":92315,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE5YS4yMjZkMTBmNy4yZDlhZTZjNkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":92314,"nextInTime":92316,"topicId":92315,"numMessagesInTopic":0,"msgSnippet":"One thing we did sometimes was to play from the beginning so that one person would win.  Let s let Holly win and then all moves would be made with that goal","messageBody":"<div id=\"ygrps-yiv-298879431\">One thing we did sometimes was to play from the beginning so that one person <br/>\nwould win.  &quot;Let&#39;s let Holly win&quot; and then all moves would be made with that <br/>\ngoal in mind.  It doesn&#39;t make the game easier or harder, just different.<br/>\n<br/>\nThere were times I said &quot;Kirby, it&#39;s not fun to play with you when you&#39;re not <br/>\n<br/>\nwilling to possibly lose.&quot;  I wish I&#39;d thought of something better to do, but <br/>\n<br/>\nI didn&#39;t, and the other two kids weren&#39;t that way.<br/>\n<br/>\n<br/>\n<br/>\n       DD wasn&#39;t like this, but our eight-year-old son always has taken games <br/>\nand wining very seriously. We&#39;ve done versions of both of these coping ideas. <br/>\n<br/>\n<br/>\n       When we&#39;d modify a game to his overt advantage, we&#39;d rechristen the <br/>\ngame. We hoped it would help prevent him from confusing what we were doing with <br/>\nthe regular game, figuring he&#39;d also need to be able to play the real game <br/>\naccording to common rules, with other people who don&#39;t love him like we do! &lt;g&gt;<br/>\n<br/>\n       So when the family would go out to play baseball in the back yard, and <br/>\nhe got ALL the at-bats while we had to play the field (he was too little to <br/>\npitch anyway) we all called it &quot;Evan Baseball&quot; -- frankly, this turned out to <br/>\nhelp us, too, to focus on &quot;playing with him&quot; instead of getting caught up in <br/>\nactually playing baseball. We three, dad, mom and older sister, all are <br/>\nfirst-borns and extremely task-oriented, so we can do just about anything as long as <br/>\nwe stay clear on what the task really is!<br/>\n<br/>\n      Evan became a big baseball fan last fall, during the unusually <br/>\nthrilling run-up to the 2003 World Series. We watched the Cubs and Red Sox on tv with <br/>\nhim, and he was able to gradually understand for himself, with no loss of <br/>\nface, what little resemblance Major League Baseball bore to what he&#39;d been <br/>\n&quot;winning&quot; in the backyard.<br/>\n<br/>\n      We&#39;ve used this same idea in reverse when he&#39;s losing at a game we <br/>\nhaven&#39;t modified and renamed. Say he&#39;s having a bad run of luck at Monopoly and <br/>\ndemands extra turns or announces he&#39;ll just owe the rent, without the agreement <br/>\nof his landlord. We explain that those rules don&#39;t belong in this game, but <br/>\nmaybe he wants to negotiate new rules for a different game, or we could go play <br/>\nsome other game entirely? But that it&#39;s not fun for anyone to just abandon the <br/>\nrules in the middle of a game you&#39;re losing. <br/>\n<br/>\n       Also whenever WE are losing, we all model ways to keep enjoying the <br/>\ngame anyway -- over-the-top jokes about our imminent doom, theatrical wailing <br/>\nwith a big smile and a wink, bestowing extravagant titles like Landlord of the <br/>\nUniverse, loudly plotting revenge for the rematch we demand, et cetera. <br/>\n<br/>\n       I&#39;d say no matter what game we&#39;re playing, we tend to turn the whole <br/>\nthing into theatre, egging each other on, improvising, trading roles, doing <br/>\nbits of dialog from famous characters or stories.  (Sometimes we do have more fun <br/>\nlosing than winning! &lt;g&gt;)  JJ<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":92288,"nextTopicId":92317}}