{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":73238415,"authorName":"J. Stauffer","from":"&quot;J. Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Digest Number 4662","postDate":"1084889611","msgId":94242,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTUwMWM0M2NlMiQ0ZDA5MGExMCQwZWJkYjFkOEB5b3VybzBrd2t3OWp3Yz4=","referencesHeader":"PDIwMDQwNTE4LjA2NTU1Mi4yNzM4Ni41MDlAd2VibWFpbDA5Lm55Yy51bnRkLmNvbT4="},"prevInTopic":94241,"nextInTopic":0,"prevInTime":94241,"nextInTime":94243,"topicId":94241,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-2095957026\">&lt;&lt;&lt;&lt; I think it&#39;s selfish for a parent to take loving energy away from the<br/>\nchildren they are obligated to nurture (their children by birth), by<br/>\nadopting or fostering children that bring negative energy into the home and<br/>\ntake too much of the parents energy.&gt;&gt;&gt;&gt;<br/>\n<br/>\nWe adopted 5 children, 3 out of the foster system.  I agree with Ren and so<br/>\nwill any good social worker.  It is extremely important to consider the<br/>\neffects bringing children into the home will have on the people already<br/>\nthere.<br/>\n<br/>\nOf course, I think it needs to be considered in families formed only by<br/>\nbirth as well.  Anytime you are adding to the mix, you will be getting<br/>\npositive and negative energies added and you don&#39;t always know which way the<br/>\nbalance will go.<br/>\n<br/>\nJulie S.<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message ----- <br/>\nFrom: &quot;Ren&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:starsuncloud@...\">starsuncloud@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, May 18, 2004 8:55 AM<br/>\nSubject: Re: [UnschoolingDiscussion] Digest Number 4662<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt; I just felt guilty for being<br/>\n&gt; &quot;selfish&quot;.<br/>\n&gt;<br/>\n&gt; Well Sang, let me tell you about selfish. I think it&#39;s selfish for a<br/>\nparent to take loving energy away from the children they are obligated to<br/>\nnurture (their children by birth), by adopting or fostering children that<br/>\nbring negative energy into the home and take too much of the parents energy.<br/>\n&gt; I know happy, successful adoption stories aplenty, my dh is one. But the<br/>\nparents adopted a healthy child at birth or shortly thereafter. Many, many<br/>\nof the older kid stories are not so happy, because everything done to them<br/>\nprior to adoption could not be undone no matter how much loving time was<br/>\ngiven.<br/>\n&gt; I think if a person is going to adopt children with problems, they should<br/>\nonly adopt...they shouldn&#39;t have birth children in the home. Or at the<br/>\nleast, they should properly prepare the birth children for what their lives<br/>\ncould become and let them be part of the choice.<br/>\n&gt; Problem is, I was all for adopting siblings, I had no idea the negative<br/>\nenergy it would bring into our home at times...though there was positive<br/>\ntoo.<br/>\n&gt; I think my parents were more concerned about image and doing what society<br/>\nthought was good and right (or the church), rather than thinking about their<br/>\nown children&#39;s best interests. We had many good discussions about it after<br/>\nall was said and done. I know for a fact my parents would not do it over<br/>\nagain, though they love their adopted children very much.<br/>\n&gt; My Mom was convinced that God had called her to do this thing...but when<br/>\nshe was more mature (in her 40&#39;s) she says &quot;I think sometimes people let<br/>\nemotion convince them God is talking to them, I don&#39;t think it was God at<br/>\nall&quot; (in reference to the adoption issue)<br/>\n&gt; I was sad at the time that she felt so strongly that it had been a<br/>\nmistake, because I love my screwed up siblings and it taught us a lot about<br/>\ngiving. I understand better now. She came to terms with it eventually, but I<br/>\nthink she still wished she&#39;d given all her energy and time to the three<br/>\nbirth children.<br/>\n&gt; I think it&#39;s sensible, not selfish.<br/>\n&gt;<br/>\n&gt; Ren<br/>\n&gt;  &quot;There is no way to<br/>\n&gt; peace.  Peace is the way.&quot;<br/>\n&gt;                    ~Quaker saying<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &quot;List Posting Policies&quot; are provided in the files area of this group.<br/>\n&gt;<br/>\n&gt; Visit the Unschooling website and message boards:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":150527288,"authorName":"Ren","from":"&quot;Ren&quot; &lt;starsuncloud@...&gt;","profile":"gruvystarchild","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Digest Number 4662","postDate":"1084888535","msgId":94241,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNTE4LjA2NTU1Mi4yNzM4Ni41MDlAd2VibWFpbDA5Lm55Yy51bnRkLmNvbT4="},"prevInTopic":0,"nextInTopic":94242,"prevInTime":94240,"nextInTime":94242,"topicId":94241,"numMessagesInTopic":0,"msgSnippet":"I just felt guilty for being selfish . Well Sang, let me tell you about selfish. I think it s selfish for a parent to take loving energy away from the","messageBody":"<div id=\"ygrps-yiv-2034854491\">I just felt guilty for being <br/>\n&quot;selfish&quot;.<br/>\n<br/>\nWell Sang, let me tell you about selfish. I think it&#39;s selfish for a parent to take loving energy away from the children they are obligated to nurture (their children by birth), by adopting or fostering children that bring negative energy into the home and take too much of the parents energy.<br/>\nI know happy, successful adoption stories aplenty, my dh is one. But the parents adopted a healthy child at birth or shortly thereafter. Many, many of the older kid stories are not so happy, because everything done to them prior to adoption could not be undone no matter how much loving time was given.<br/>\nI think if a person is going to adopt children with problems, they should only adopt...they shouldn&#39;t have birth children in the home. Or at the least, they should properly prepare the birth children for what their lives could become and let them be part of the choice. <br/>\nProblem is, I was all for adopting siblings, I had no idea the negative energy it would bring into our home at times...though there was positive too. <br/>\nI think my parents were more concerned about image and doing what society thought was good and right (or the church), rather than thinking about their own children&#39;s best interests. We had many good discussions about it after all was said and done. I know for a fact my parents would not do it over again, though they love their adopted children very much.<br/>\nMy Mom was convinced that God had called her to do this thing...but when she was more mature (in her 40&#39;s) she says &quot;I think sometimes people let emotion convince them God is talking to them, I don&#39;t think it was God at all&quot; (in reference to the adoption issue)<br/>\nI was sad at the time that she felt so strongly that it had been a mistake, because I love my screwed up siblings and it taught us a lot about giving. I understand better now. She came to terms with it eventually, but I think she still wished she&#39;d given all her energy and time to the three birth children.<br/>\nI think it&#39;s sensible, not selfish.<br/>\n<br/>\nRen<br/>\n &quot;There is no way to <br/>\npeace.  Peace is the way.&quot; <br/>\n                   ~Quaker saying</div>","specialLinks":[]}],"prevTopicId":94239,"nextTopicId":35221}}