{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":39,"messages":[{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289336502","msgId":58033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzRjMxNjM0LTZGRjAtNDA0Ri1CM0FBLTQyNUU1ODM4RTRCNkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEFBTkxrVGk9c1ZMMS0wM2F3WW9uU2NDMjZlMTgwRWJmeW1oX2tVcEZHaW1vRkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDc0MjE0Ni41NzUxOS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPiA8NDk2RTE4MDEtRUMzOC00OEFGLUE3NTctMDc5MkQ2Njc4MjhGQFNhbmRyYWRvZGQuY29tPiA8QUFOTGtUaT1zVkwxLTAzYXdZb25TY0MyNmUxODBFYmZ5bWhfa1VwRkdpbW9GQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":58032,"nextInTopic":58034,"prevInTime":58032,"nextInTime":58034,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... Will she allow you to read to her? The shared experience of storytelling and watching the words as you read them might be better than books on CD for her. ","messageBody":"<div id=\"ygrps-yiv-439592515\"><blockquote><span title=\"ireply\">&gt;   It&#39;s<br/>\n&gt; just that she wants to read the chapter books - the books other kids  <br/>\n&gt; in our<br/>\n&gt; group are reading.  Maximum Ride, Guardians of Ga&#39;hoole, etc.<br/>\n<br/>\n </span></blockquote>Will she allow you to read to her? The shared experience of  <br/>\nstorytelling and watching the words as you read them might be better  <br/>\nthan books on CD for her.<br/>\n<br/>\nSometimes, a kid&#39;s brain (in its own individual way) just isn&#39;t ready  <br/>\nto read, regardless of desire. It&#39;s capable of doing lots of other  <br/>\nthings, though. If you haven&#39;t already explained this to your  <br/>\ndaughter, you could let her know that *that* part of her brain isn&#39;t  <br/>\nquite ready. And that it&#39;s fine.  Help her focus on what she *can* do.<br/>\n<br/>\nI&#39;ve always thought that once print begins to &quot;make sense&quot;, there&#39;s a  <br/>\npart of the brain that goes to just deciphering that input. New neural  <br/>\npathways are being formed and others atrophy.  When we start reading,  <br/>\nwe can&#39;t *not* read. I think that&#39;s why observation (and imagination)  <br/>\nis the &quot;reading&quot; before the reading. It&#39;s an important part of brain  <br/>\ndevelopment.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think I&#39;d mentioned that maybe we could<br/>\n&gt; study the ocean, and a few weeks (or months) later, she asked about  <br/>\n&gt; it.<br/>\n<br/>\n </span></blockquote>Try to eliminate the &quot;study&quot; from your vocabulary. Just do, see, feel,  <br/>\nexperience.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I am sad thinking about all the REALLY<br/>\n&gt; important things I missed by not savoring those times, but we still  <br/>\n&gt; have the<br/>\n&gt; sewing machine and they still would be interested, so I&#39;m not a lost  <br/>\n&gt; cause.<br/>\n<br/>\n </span></blockquote>What you have is the &quot;now&quot; so focus on that, instead of regret. Regret  <br/>\n*can* inform how you proceed, but dwelling on it won&#39;t help.<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; ...but right now, I need to go read a book.  Littlest has found one  <br/>\n&gt; and has<br/>\n&gt; brought it over once. I don&#39;t want to wait until she&#39;s brought it a  <br/>\n&gt; second<br/>\n&gt; time, so I&#39;ll try to answer any other things I missed later today.<br/>\n<br/>\n </span></blockquote>You don&#39;t have to respond to everything! It&#39;s okay to just let it sink  <br/>\nin for a while.<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying to wrap my mind around this","postDate":"1289335324","msgId":58032,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGliY2JtcytxajYzQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9c1ZMMS0wM2F3WW9uU2NDMjZlMTgwRWJmeW1oX2tVcEZHaW1vRkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58029,"nextInTopic":58033,"prevInTime":58031,"nextInTime":58033,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... ************* Its a pretty common problem with phonics, actually - some people can t do the processing in between sounding out each letter and combining","messageBody":"<div id=\"ygrps-yiv-210991320\">Natalie Bullock &lt;nasb2pyrs@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;she could sound out each letter<br/>\n&gt; individually, but after doing that (puh-er-eh-ess-ess), she said, &quot;pretty&quot;!<br/>\n </span></blockquote>*************<br/>\n<br/>\nIts a pretty common problem with phonics, actually - some people can&#39;t do the processing in between sounding out each letter and combining those sounds to make a word *while still learning* how to read. Once they can read, then they can learn specific decoding skills around phonetic clues, but not before. <br/>\n<br/>\nThat&#39;s why what a lot of teachers call &quot;phonics&quot; isn&#39;t &quot;sounding out&quot; but involves learning a select vocabulary lumping together words with similar pronounciations and/or learning about roots and affixes. It &quot;looks like&quot; phonics but &quot;works like&quot; memorizing words for people who can&#39;t &quot;sound out&quot;. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;her ONLY goal was to learn to<br/>\n&gt; read; she knew all the letters and most of their sounds before she started.<br/>\n </span></blockquote>***********<br/>\n<br/>\nGosh that&#39;s such a good example of how a belief in phonics instruction can get in the way of learning! She was all &quot;ready&quot; to do a trick her brain wasn&#39;t capable of performing until after she learned to read. That must have been frustrating for her. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;So...earlier this year, I took her to a developmental<br/>\n&gt; optomotrist, where we learned that her eyes don&#39;t converge on the same spot<br/>\n&gt; (so an &quot;a&quot; would look like an a, and another, slightly offset, &quot;a&quot;; eg.,<br/>\n&gt; it&#39;s blurry), and not only that, but one eye focuses slightly higher than<br/>\n&gt; the other<br/>\n<br/>\n </span></blockquote>Were you told there were exercises to correct that? If your dd is interested, its something to look into, but its also not something to &quot;push&quot; if she isn&#39;t interested right now. There&#39;s No &quot;critical period&quot; for learning how to focus the eyes - even older adults can learn.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt; As for the sewing machine...yep, I have one.  A nice one, even, according to<br/>\n&gt; my sister; I trust her, but I&#39;m not especially adept at using it<br/>\n<br/>\n </span></blockquote>Some kids can learn to use a sewing machine on their own, especially kids who tend to learn by doing anyway. If you have space, it may be worth it just to have the thing out and set up so that if someone gets an idea its all ready to go. There are a whole lot of things that can be done with just a straight stitch and a basic zig-zag - virtually all plain sewing can be done with those, in fact, so its just a matter of confidence in using the machine. If you aren&#39;t feeling confident and one of your kids wants to learn, ask around friends with machines, or small fabric shops to see if someone would be willing to give one of your kids a walk-through. There are plenty of things both my kids do well that I&#39;m not very good at, and I help them find other, better resources than me if they want them. It can help to think of yourself as a kind of librarian - you don&#39;t Need all the answers, just have an idea of where to start looking. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":393140665,"authorName":"Natalie Bullock","from":"Natalie Bullock &lt;nasb2pyrs@...&gt;","profile":"dubbadubbadub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289239670","msgId":58029,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9c1ZMMS0wM2F3WW9uU2NDMjZlMTgwRWJmeW1oX2tVcEZHaW1vRkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDQ5NkUxODAxLUVDMzgtNDhBRi1BNzU3LTA3OTJENjY3ODI4RkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4JPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4JPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4JPDc0MjE0Ni41NzUxOS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPgk8NDk2RTE4MDEtRUMzOC00OEFGLUE3NTctMDc5MkQ2Njc4MjhGQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":58025,"nextInTopic":58032,"prevInTime":58028,"nextInTime":58030,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"Thank you to those who answered in my absence yesterday; yes, the daughter with dyslexia is my 9yo.  To clarify, though: *I* am not putting pressure on her.","messageBody":"<div id=\"ygrps-yiv-2010843709\">Thank you to those who answered in my absence yesterday; yes, the daughter<br/>\nwith dyslexia is my 9yo.  To clarify, though: *I* am not putting pressure on<br/>\nher.  Molly is a perfectionist - she observes, she tries, and usually, she<br/>\ndoes...and does well, because she usually compares herself to whatever she<br/>\nwas seeing.  When my son learned to ride a bike at age 5.5y, Molly watched<br/>\nhim and within a month, she was riding her bike, too.  She had just turned<br/>\n3.  That wasn&#39;t good enough - she then wanted a 16&quot; bike, so I told her that<br/>\nif and when she could ride her brother&#39;s 16&quot; bike, I&#39;d buy one for her,<br/>\ntoo.  Within a few weeks, she had a new 16&quot; bike.  It would never have<br/>\noccurred to me that a 3yo would be doing any of that, but as with so many<br/>\nthings, she sees her big brother doing something, and she wants to do it,<br/>\ntoo.  That has been true for many things.<br/>\n<br/>\nWhen she was 5, and started kindergarten at the local public school (we&#39;ll<br/>\ncall this my &quot;blissfully unaware&quot; stage), her ONLY goal was to learn to<br/>\nread; she knew all the letters and most of their sounds before she started.<br/>\nBy that time, big brother, who is 2 years older, was reading Roald Dahl and<br/>\nother meaty chapter books.  She learned the requisite sight words pretty<br/>\neasily.  In March of her kindergarten year, we moved from Florida to<br/>\nCalifornia.  Her K here was more like a preschool, but with nearly twice as<br/>\nmany kids and a harried, sometimes grumpy teacher who told me that Molly was<br/>\nso advanced, she should be promoted to 2nd grade, and to skip first<br/>\nentirely.  Instead, at the end of that school year, I had had enough of the<br/>\nschool here, primarily because of what I viewed as poor security and<br/>\nunacceptable oversight of the too-large playground, where my son had been<br/>\nknocked down and hit because he bothered to try to defend a classmate who<br/>\nhad a speech impediment.  Although many kids witnessed it, there were no<br/>\nsupervisors nearby, so officially, the school would do nothing.<br/>\n<br/>\nAnd that, sorry to say, is how I came to homeschooling - it wasn&#39;t something<br/>\nI embraced enthusiastically, but rather something I felt was my only<br/>\noption.  A little over 3 years later, I&#39;m at a different place entirely:   I<br/>\ndon&#39;t want my children ever to go back to a school, but I still see that<br/>\nit&#39;s not an optimal situation *as it is*, and that is why I am here - I<br/>\nthink it&#39;s because all along, I&#39;ve read about and flirted with the idea of<br/>\nunschooling, but it wasn&#39;t until this list and many of Sandra&#39;s pages that I<br/>\nrealized my idea of it was wholly inaccurate.  I am drawn evermore to it,<br/>\neven though with every response, I realize I still have a long way to go. :)<br/>\n<br/>\nFor Molly, I realized there may be a problem because when she was almost 7,<br/>\nshe was sounding out the word &quot;press&quot;.  You&#39;ll remember that she&#39;s wanted to<br/>\nread all along, and here we were - she could sound out each letter<br/>\nindividually, but after doing that (puh-er-eh-ess-ess), she said, &quot;pretty&quot;!<br/>\nIf I had sounded out those sounds, she would have put them together without<br/>\na problem, but for her, there seemed to be a sort of disconnect between the<br/>\nvisual and the oral.  She doesn&#39;t do that now so much, but at 9.5 years old,<br/>\nshe can read easily for about two minutes and then things get blurry.  When<br/>\nshe writes, there are letter and number reversals, and even spelling<br/>\nreversals.  Sometimes the reversals are vertical flips, but not as much as<br/>\nhorizontal.  So...earlier this year, I took her to a developmental<br/>\noptomotrist, where we learned that her eyes don&#39;t converge on the same spot<br/>\n(so an &quot;a&quot; would look like an a, and another, slightly offset, &quot;a&quot;; eg.,<br/>\nit&#39;s blurry), and not only that, but one eye focuses slightly higher than<br/>\nthe other, so on both vertical and horizontal planes, her eyes are not<br/>\nfocusing on the same point.  So...she may or may not have dyslexia, but this<br/>\nphysiological issue is interfering with her desire and ability to read.  She<br/>\ndoes not want to listen to the books; I&#39;ve asked.  We all enjoy a good book<br/>\non CD when we are driving a long distance, but it is not her preference to<br/>\nlisten otherwise.  She really, really wants to read.  And she can, but not<br/>\nfor any length of time - her eyes hurt after a couple of minutes, and if she<br/>\ncontinue anyway, you can be sure she&#39;ll have a headache soon after.  I have<br/>\nnever asked her to read a chapter book, and I haven&#39;t asked her to read much<br/>\nof anything in a long, long time.  She has begun to read picture books out<br/>\nloud to her little sister, and no long seems to mind (very much)  if she has<br/>\nto ask what a word is.  When I comment on her reading, it&#39;s to thank her for<br/>\nbeing sweet and thoughtful for reading to her sister; I make every effort<br/>\nnot to focus on how she has read (though many times, it&#39;s just fine).  It&#39;s<br/>\njust that she wants to read the chapter books - the books other kids in our<br/>\ngroup are reading.  Maximum Ride, Guardians of Ga&#39;hoole, etc.<br/>\n<br/>\nI&#39;m running out of time here - kids are awake, and I do not want to spend<br/>\ntoday online, but quickly:<br/>\n<br/>\nRobin, yeah, that was my fault.  I think I&#39;d mentioned that maybe we could<br/>\nstudy the ocean, and a few weeks (or months) later, she asked about it.  I<br/>\ntried to make a simple interest (in starfish, if I recall correctly) into<br/>\nsomething bigger and unit-like.  Sadly, I don&#39;t remember what the original<br/>\nrequest was, but (really not surprisingly, she has not really embraced a<br/>\nunit study on the ocean).  She did like visiting the tide pools.  :)<br/>\n<br/>\nAs for the sewing machine...yep, I have one.  A nice one, even, according to<br/>\nmy sister; I trust her, but I&#39;m not especially adept at using it, so I<br/>\nwouldn&#39;t really know.  :)  We always have fun when it &#39;s out, but<br/>\npreviously, it felt like if I took it out, we were missing out on &quot;more<br/>\nimportant&quot; things.  I know, I know!  I am sad thinking about all the REALLY<br/>\nimportant things I missed by not savoring those times, but we still have the<br/>\nsewing machine and they still would be interested, so I&#39;m not a lost cause.<br/>\n<br/>\n<br/>\n<br/>\nSandra, I appreciate the additional links and your input, and although they<br/>\ndon&#39;t know it, my children do, too.<br/>\n<br/>\n...but right now, I need to go read a book.  Littlest has found one and has<br/>\nbrought it over once. I don&#39;t want to wait until she&#39;s brought it a second<br/>\ntime, so I&#39;ll try to answer any other things I missed later today.<br/>\n<br/>\nI&#39;m so grateful for each of you; thanks.<br/>\n<br/>\nNatalie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289185570","msgId":58025,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5NkUxODAxLUVDMzgtNDhBRi1BNzU3LTA3OTJENjY3ODI4RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc0MjE0Ni41NzUxOS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDc0MjE0Ni41NzUxOS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":58024,"nextInTopic":58029,"prevInTime":58024,"nextInTime":58026,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"-=-A kid whose parents don t own a sewing machine, may never think to sew a mask, but they might make one out of paper. -=- Marty made a cow mask with leather,","messageBody":"<div id=\"ygrps-yiv-665177664\">-=-A kid whose parents don&#39;t own a sewing machine, may<br/>\nnever think to sew a mask, but they might make one out of paper. -=-<br/>\n<br/>\nMarty made a cow mask with leather, paint and glue:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.blogspot.com/2009/11/off-to-ball.html\">http://sandradodd.blogspot.com/2009/11/off-to-ball.html</a><br/>\n<br/>\n(And Holly bought that mask she&#39;s wearing, which was also made mostly  <br/>\nwith glue, I think.)<br/>\n<br/>\n<br/>\nAh wait... Marty based that mask on a hood I had sewn years ago, and  <br/>\nit was sewn to the hood...  So SOME sewing, though that could have  <br/>\nbeen avoided by fastening it to something else or adding a strap or  <br/>\ncords.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289185347","msgId":58024,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUyMjU3QUJDLTNGM0YtNDE5My05NEExLUU2RUFBNjlFRUUxOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4="},"prevInTopic":58023,"nextInTopic":58025,"prevInTime":58023,"nextInTime":58025,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"-=-I doubt that your focus on learning styles will be helpful to you in unschooling. I don t think about my family s learning syles when considering what to","messageBody":"<div id=\"ygrps-yiv-2136232552\">-=-I doubt that your focus on learning styles will be helpful to you  <br/>\nin unschooling. I don&#39;t think about my family&#39;s learning syles when  <br/>\nconsidering what to bring to our lives - I think of what will be fun  <br/>\nand interesting; what might engage or amaze or amuse. With interest  <br/>\nand engagement, learning will happen naturally and maximally. -=-<br/>\n<br/>\nTrue.<br/>\nAnd if one child is more verbal than another, that child will do more  <br/>\nverbal learning in the same situation, with the same materials or  <br/>\ninput, from which another child might be learning more tactilely or  <br/>\nvisually.<br/>\n<br/>\nI&#39;m not &quot;a foodie.&quot;  I know it will really bother some of my friends  <br/>\nwhen I get home and they ask if I ate this or that, and I don&#39;t know.   <br/>\nI&#39;m not learning the names of food.  I&#39;m trying to save all my  <br/>\nlearning energy for the names of people.  (There are some names I&#39;m  <br/>\nhaving a hard time with, and I care more about people than food.) I  <br/>\ndon&#39;t learn by tasting. :-)  Some people do.  It&#39;s not that I can&#39;t  <br/>\ntaste things or I don&#39;t have preferences, but I&#39;m more interested in  <br/>\nthe social stories of the foods--which is more formal, which is  <br/>\ncasual, which is home-food which is fancy-restaurant food, how it&#39;s  <br/>\nnormally eaten.  Here in India, they wash hands before a meal--many  <br/>\nhouses (and the restaurant I was in yesterday) have a special sink  <br/>\nnear where they eat that&#39;s just for washing hands.  Afterwards they  <br/>\nwash hands and rinse their mouths out at that same sink.    That&#39;s  <br/>\nmore interesting to me than the food itself.  No one could keep me  <br/>\nfrom my own preferences and interests, and they can&#39;t &quot;make&quot; me learn  <br/>\nother aspects that I&#39;m not so interested in.<br/>\n<br/>\nSo if you provide situations and materials and input, each child will  <br/>\nlearn in her own way those things she&#39;s interested in.  The more  <br/>\nopportunities, the better, but don&#39;t &quot;have your feelings hanging out&quot;  <br/>\nabout whether the kids love what you bring (videos, books, web sites,  <br/>\nvisits, people, games, objects).  They might not be interested in what  <br/>\nyou thought they would be interested in.  Don&#39;t take it personally.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/museum\">http://sandradodd.com/museum</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289182098","msgId":58023,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEyRjc4QzJCLUZENTMtNDgwRC1BOUQzLUREMDFCOTMwRjlCOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDgzNTI2MS4yMDIwMS5xbUB3ZWIxMTA0MDUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4gPEFBTkxrVGk9X0t4cEV6TEFRLVh3PU9YZ2Itck9UamliRGJaNWtiV3JqaVErYkBtYWlsLmdtYWlsLmNvbT4gPDgzNTI2MS4yMDIwMS5xbUB3ZWIxMTA0MDUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":58021,"nextInTopic":58024,"prevInTime":58022,"nextInTime":58024,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"-=-No amount of cajoling would have made her learn better or faster how to read. No amount of forced letter formation of any kind would have helped her write ","messageBody":"<div id=\"ygrps-yiv-1414052405\">-=-No amount of cajoling would have made her learn better or faster  <br/>\nhow to read.<br/>\nNo amount of forced letter formation of any kind would have helped her  <br/>\nwrite<br/>\nher numbers the right direction. -=-<br/>\n<br/>\nThis is true of every child.<br/>\nSome children are ready to learn to read when the force and cajoling  <br/>\nare going on at school.<br/>\nSome people are ready to get well when the witch doctor dances and  <br/>\nchants.<br/>\n<br/>\nSome children are messed up by school.<br/>\nSome people die in spite of witch doctors.<br/>\n<br/>\nRather than looking at school, or at any correlations about teaching,  <br/>\nspend some time looking at natural learning, and looking at your own  <br/>\nchild to see what she&#39;s learning and how.<br/>\n<br/>\n-=- It&#39;s a wonderful visual skill that she has<br/>\nthat lends itself well to all kinds of spatial reasoning and  <br/>\nunderstanding!<br/>\nIt&#39;s also no surprise to me that she&#39;s good at puzzles and sewing and  <br/>\npattern<br/>\nmaking.-=-<br/>\n<br/>\nThere are people who read easily and early who are good at spatial  <br/>\nreasoning too, though.  It&#39;s true there seem to be sets of skills,  <br/>\ngenetically speaking, that can go together, but there are also other  <br/>\ncombinations of skills.<br/>\n<br/>\n&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/intelligences\">http://sandradodd.com/intelligences</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/interview\">http://sandradodd.com/interview</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":454093105,"authorName":"lalow","from":"&quot;lalow&quot; &lt;lalougor@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Trying to wrap my mind around this","postDate":"1289178198","msgId":58021,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGliN2k4bSsxbTVnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc0MjE0Ni41NzUxOS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":58020,"nextInTopic":58023,"prevInTime":58020,"nextInTime":58022,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... My oldest is only 9, and he isnt reading alot yet.  An aquantance the other day was discussing how they are having their 8 year old tested for dyslexia and","messageBody":"<div id=\"ygrps-yiv-1713777886\"><blockquote><span title=\"ireply\">&gt; Seriously consider books on cd or mp3&#39;s.  Book for book my oldest had &quot;heard&quot; <br/>\n&gt; and absorbed far more than the average school kid.  She didn&#39;t need to read the <br/>\n&gt; words on paper.  She did a lot of reading in games and online, that by the time <br/>\n&gt; she DID pick up a book and read it, it was a manga, she had a large vocabulary <br/>\n&gt; and was familiar enough with written text that she went straight into reading <br/>\n&gt; and understanding.  There wasn&#39;t a struggle for her.<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n </span></blockquote>My oldest is only 9, and he isnt reading alot yet.  An aquantance the other day was discussing how they are having their 8 year old tested for dyslexia and what it looks like and honestly everything she said sounded like my son... oh and me as well.  I learned to read by school standards kind of late.  But often schools are worried that if a child isnt reading his vocabulary will be behind other kids and he wont be getting the same or as much information etc.  My 9 year old absolutely loves stories and being read to and books on tape and honestly picks up so much more information that way than I ever have.</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289173581","msgId":58020,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNENTI4NzJGLTY3NjItNEQ2NC04OENGLTEwRTdFNDExRkJDQkBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PEFBTkxrVGk9X0t4cEV6TEFRLVh3PU9YZ2Itck9UamliRGJaNWtiV3JqaVErYkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4gPEFBTkxrVGk9X0t4cEV6TEFRLVh3PU9YZ2Itck9UamliRGJaNWtiV3JqaVErYkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58019,"nextInTopic":58021,"prevInTime":58019,"nextInTime":58021,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... I don t know many 6 year olds that would say I want to study the ocean ! Sometimes, they say Look, Mom! about finding a cool picture or show about ocean","messageBody":"<div id=\"ygrps-yiv-755971764\"><blockquote><span title=\"ireply\">&gt; My question is - if my<br/>\n&gt; daughter says she wants to study the ocean, and none of the things I  <br/>\n&gt; bring<br/>\n&gt; to her really capture her attention, then where do we go with that?<br/>\n&gt;  She&#39;s 6, so I would imagine I need to provide *something*.<br/>\n<br/>\n </span></blockquote>I don&#39;t know many 6 year olds that would say &quot;I want to study the  <br/>\nocean&quot;! Sometimes, they say &quot;Look, Mom!&quot; about finding a cool picture  <br/>\nor show about ocean life.  Or they want to go swimming or play on a  <br/>\nbeach. That doesn&#39;t mean you have to jump on it and get everything  <br/>\nhumanly possible about oceans and swimming and beaches! That *does*  <br/>\nsmack of unit study.<br/>\n<br/>\nYou could look around for shows on Discovery Channel or National  <br/>\nGeographic Channel. Let her know what time it&#39;s on. You could ask if  <br/>\nshe wants to watch it with you. It&#39;s completely okay if she says no,  <br/>\n*even* if she&#39;d indicated a prior interest. Now she knows you&#39;re  <br/>\nhelping her. Now she knows about options. It&#39;s the same with books,  <br/>\ninternet sites, the sound of ocean waves on CD, aquariums, the ocean  <br/>\nitself. All available; none compulsory.<br/>\n<br/>\nJust keep an eye out for things she might like. Keep her interests  <br/>\n(and your other kids&#39; interests) in mind. And bring cool things into  <br/>\nthe house that *you* like and leave them around. Get really interested  <br/>\nin something yourself and share it with your kids, if they&#39;re  <br/>\ninterested. Show them *you&#39;re* interesting - and still learning.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I could pull out the<br/>\n&gt; books I have, and we could sit down on the computer together<br/>\n<br/>\n </span></blockquote>Sure. Only if she wants to do that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; but as the<br/>\n&gt; ocean is 3 hours from here, it would take a bit of planning to get  <br/>\n&gt; there<br/>\n&gt; (but we do manage now and then - visited some tide pools last  <br/>\n&gt; month...and<br/>\n&gt; learned that some shoes are just not good for walking on those  <br/>\n&gt; slippery<br/>\n&gt; rocks, ahem).<br/>\n<br/>\n </span></blockquote>You could plan a vacation there sometime. Plan to get some rock shoes  <br/>\nbeforehand!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I have also heard of the concept of &quot;strewing&quot;, which<br/>\n&gt; provided a sort of missing link for me a couple months ago.  I  <br/>\n&gt; think...maybe<br/>\n&gt; I am overthinking it all.<br/>\n<br/>\n </span></blockquote>The term was coined by Sandra Dodd, the list owner. Here&#39;s her page on  <br/>\nstrewing, with lots of links:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; (And I enjoyed your paragraph about sewing; in our case, I don&#39;t  <br/>\n&gt; know how to<br/>\n&gt; sew well, although my daughter and I did work on a sort of  <br/>\n&gt; collaborative<br/>\n&gt; effort with a more sewing-capable friend to make a Southern Belle  <br/>\n&gt; type of<br/>\n&gt; dress for dd.  :)  Both of my girls would probably be happy if I  <br/>\n&gt; sewed for<br/>\n&gt; them all day.<br/>\n<br/>\n </span></blockquote>What would they want you to sew?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe we&#39;ll try that this week.  I think I have enough<br/>\n&gt; thread.  ;)<br/>\n<br/>\n </span></blockquote>Maybe *you* should try that this week.<br/>\n<br/>\nDo you have material? Patterns? A sewing machine? Ideas? It might be a  <br/>\nfun shopping trip!<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":214171486,"authorName":"Heather","from":"Heather &lt;swingdancechick@...&gt;","profile":"heather_200115","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289172442","msgId":58018,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9TFNna1J2UVljMU0tRStjQW02V2VjMlA2Y1pkZzhwc09qMEhvVEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDgxMjAzMi4xMzEwLnFtQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4JPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4JPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4JPDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4JPEFBTkxrVGk9X0t4cEV6TEFRLVh3PU9YZ2Itck9UamliRGJaNWtiV3JqaVErYkBtYWlsLmdtYWlsLmNvbT4JPDgxMjAzMi4xMzEwLnFtQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":58017,"nextInTopic":58019,"prevInTime":58017,"nextInTime":58019,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"Not her 6 yo... She said this in her first post... The second consideration is that my middle child - my 9yo daughter - has dyslexia... heather On Sun, Nov","messageBody":"<div id=\"ygrps-yiv-1479409922\">Not her 6 yo...<br/>\nShe said this in her first post...<br/>\n<br/>\n&quot;The second consideration is that my middle child - my 9yo daughter - has<br/>\ndyslexia...&quot;<br/>\n<br/>\nheather<br/>\n<br/>\nOn Sun, Nov 7, 2010 at 4:03 PM, BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a><br/>\n<blockquote><span title=\"ireply\"> &gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; OK Maybe I can&#39;t remember the first post really well but I see ou wrote<br/>\n&gt; your<br/>\n&gt; daugther is only 6??!!!!!<br/>\n&gt; Is that the daughter you are certain is dislexic because she cannot read<br/>\n&gt; yet????<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289172438","msgId":58019,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgzNTI2MS4yMDIwMS5xbUB3ZWIxMTA0MDUubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGk9X0t4cEV6TEFRLVh3PU9YZ2Itck9UamliRGJaNWtiV3JqaVErYkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4gPEFBTkxrVGk9X0t4cEV6TEFRLVh3PU9YZ2Itck9UamliRGJaNWtiV3JqaVErYkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58018,"nextInTopic":58020,"prevInTime":58018,"nextInTime":58020,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"***I appreciate the information (and clarification) on that myth. I also think I ve read that for many kids who have dyslexia, age 11 seems to be a common age","messageBody":"<div id=\"ygrps-yiv-2114650655\">***I appreciate the information (and clarification) on that myth. I<br/>\nalso think I&#39;ve read that for many kids who have dyslexia, age 11 seems to<br/>\nbe a common age when they see big improvements in reading. Whether that<br/>\nwill be true or not for my daughter, she seems to do best if she does it on<br/>\nher own terms.***<br/>\n<br/>\nShe 9 now, if I remember correctly.  That&#39;s 2 yrs.  Not a very long time really. <br/>\n She&#39;s had damage done to her, pressure to read and resistance.  If it were me, <br/>\nI&#39;d back way off and not even mention anything to do with reading at all, don&#39;t <br/>\ntalk about it, don&#39;t analyze her reading abilities, do nothing about it, <br/>\nseriously, and MAYBE she&#39;ll read by the time she&#39;s 11.  My daughter&#39;s first book <br/>\nwas manga, read from right to left, it totally makes sense that it would happen <br/>\nthat way.  Once she mastered that, she was able to read left to right.  <br/>\n<br/>\nI never had her diagnosed, so it&#39;s only a guess, based on what I know of it and <br/>\nwhat I observed my daughter doing, that there was any sort of dyslexia going on. <br/>\n No amount of cajoling would have made her learn better or faster how to read. <br/>\n No amount of forced letter formation of any kind would have helped her write <br/>\nher numbers the right direction.  Using the internet and keyboard were very <br/>\nuseful tools for her.  They simply don&#39;t turn words and letters around.  When <br/>\npeople do that on facebook, my daughter knows immediately what it says without <br/>\ntrying at all, her brain just automatically can read things backwards, turned <br/>\nupside down, etc.  It&#39;s kinda cool!  It&#39;s a wonderful visual skill that she has <br/>\nthat lends itself well to all kinds of spatial reasoning and understanding! <br/>\n It&#39;s also no surprise to me that she&#39;s good at puzzles and sewing and pattern <br/>\nmaking.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289172396","msgId":58017,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwQjlFNDFDLUNERTAtNDA3RC1BQzVGLThBNTRDNEVFQTU5N0Bjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDgxMjAzMi4xMzEwLnFtQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4gPEFBTkxrVGk9X0t4cEV6TEFRLVh3PU9YZ2Itck9UamliRGJaNWtiV3JqaVErYkBtYWlsLmdtYWlsLmNvbT4gPDgxMjAzMi4xMzEwLnFtQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4="},"prevInTopic":58016,"nextInTopic":58018,"prevInTime":58016,"nextInTime":58018,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"It s Natalie s middle child - 9 years old . And nine (as well as six) can be young for some kids to read - it depends on the kid. Robin B.","messageBody":"<div id=\"ygrps-yiv-1985865547\">It&#39;s Natalie&#39;s middle child - 9 years old &lt;g&gt;.<br/>\n<br/>\nAnd nine (as well as six) can be young for some kids to read - it  <br/>\ndepends on the kid.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; OK Maybe I can&#39;t remember the first post really well but I see ou  <br/>\n&gt; wrote your<br/>\n&gt; daugther is only 6??!!!!!<br/>\n&gt; Is that the daughter you are certain is dislexic because she cannot  <br/>\n&gt; read yet????<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289171032","msgId":58016,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgxMjAzMi4xMzEwLnFtQHdlYjgxNTA1Lm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PEFBTkxrVGk9X0t4cEV6TEFRLVh3PU9YZ2Itck9UamliRGJaNWtiV3JqaVErYkBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4gPEFBTkxrVGk9X0t4cEV6TEFRLVh3PU9YZ2Itck9UamliRGJaNWtiV3JqaVErYkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58015,"nextInTopic":58017,"prevInTime":58015,"nextInTime":58017,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"OK Maybe I can t remember the first post really well but I see ou wrote your daugther is only 6??!!!!! Is that the daughter you are certain is","messageBody":"<div id=\"ygrps-yiv-1061991093\">OK Maybe I can&#39;t remember the first post really well but I see ou wrote your <br/>\ndaugther is only 6??!!!!!<br/>\nIs that the daughter you are certain is dislexic because she cannot read yet????<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"1"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289161190","msgId":58015,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc0MjE0Ni41NzUxOS5xbUB3ZWIxMTA0MDMubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58014,"nextInTopic":58016,"prevInTime":58014,"nextInTime":58016,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"***My method - what would work for ME - would be to read a few books and/or look up information online. Maybe I d watch a documentary. It doesn t readily come","messageBody":"<div id=\"ygrps-yiv-1529345450\">***My method - what would work for ME - would be to read a few books and/or<br/>\nlook up information online. Maybe I&#39;d watch a documentary. It doesn&#39;t<br/>\nreadily come to me to consider sewing a wolf mask, nor would anything<br/>\ninherently kinesthetic.***<br/>\n<br/>\nSomething that I&#39;ve found interesting, is that, a lot of what works for ME was <br/>\nlargely what school trained me to do.  The farther along I get away from school, <br/>\nand the more I watch my kids learn, the easier it is to see the multi faceted <br/>\nways in which a thing can be done, or knowledge can be had and used.  There is a <br/>\npoint after the deschooling process, at least for me, where I just saw the world <br/>\ndifferent.  Our kids are much better at this since they&#39;ve either had way less <br/>\nschool or no school at all.  A kid whose parents don&#39;t own a sewing machine, may <br/>\nnever think to sew a mask, but they might make one out of paper.  You&#39;ll find <br/>\nthat the farther you are along in deschooling, the more your kids will <br/>\nspontaneously do things like that.  They will play with their world and whatever <br/>\nis in it, so keep interesting things in their world that are easily accessible.<br/>\n<br/>\n<br/>\n***I&#39;ve been focusing on saying &quot;yes&quot; more often and while I&#39;m certainly<br/>\nnot going to claim that we&#39;ve had any sort of radical changes for the<br/>\nbetter, I will say it felt very nice...and my children have noticed and<br/>\nappreciated it. ***<br/>\n<br/>\nThat is the sort of radical change that will change everything.  It will <br/>\npermeate the house and shift people&#39;s thinking.  If the answers become &quot;yes&quot;, <br/>\nthen kids will start thinking in terms of how to go about doing something, <br/>\ninstead of in terms of how to go around your &quot;no&quot; or accept your &quot;no&quot; and move <br/>\nno further.  It&#39;s the sort of change that changes everything, even if it doesn&#39;t <br/>\nfeel radical.  Probably better for it to not feel radical.  It can seep into <br/>\ntheir lives and their thoughts.  That part is about attitude and how our <br/>\nattitudes and thoughts affect actions.<br/>\n<br/>\n***I have<br/>\na hard time with TV (not the documentaries, but definitely many of the shows<br/>\ncurrently playing on the popular kids&#39; channels) and games, not only<br/>\nbecause, personally, I don&#39;t like them very much, but also because<br/>\npractically, we have a small house and what might be interesting for one<br/>\nchild, is not likely going to be interesting to one or two of the others.***<br/>\n<br/>\nWe have TV&#39;s and computers in just about every room in our house.  We could all <br/>\nwatch or do something in separate rooms and be undisturbed if we wanted to. <br/>\n Mostly though, it&#39;s more easy and flowing than that.  We find things in common <br/>\nand watch things together a lot.  This part will even out after a while.  The <br/>\nmore you let go, the easier it will be for them to find ways to get along with <br/>\neach other in that regard.<br/>\n<br/>\n***That need to<br/>\ndefine &quot;need to know&quot; things might eventually dissipate, but it can&#39;t be<br/>\ncompletely denied now. I can put it under the heading of future business,<br/>\nbut it&#39;s a prominent and present concern of my husband***<br/>\n<br/>\nThe older my kids have gotten, the easier it was for my husband to see the <br/>\nlearning and relax.  More than that, what he saw was how much kinder our kids <br/>\nwere compared to school kids, how much more confident and relaxed they are/were, <br/>\nhow much better they got along with others and navigated life easier.  The <br/>\nlearning and all that stuff seemed like it wasn&#39;t as huge in that glaring part <br/>\nof how are kids compared to schooled kids.  Our oldest is 16 and her school <br/>\nfriends rely on her for word definitions and information and how to spell and <br/>\nwhat to do when they are bored.  My husband sees these things and gets it, gets <br/>\nhow it is ALL about the unschooling.<br/>\n<br/>\n***I have read that many kids with<br/>\ndyslexia seem to really pick up steam somewhere around age 11. For now, dd<br/>\nis reading big books like the Maximum Ride series, but she misses a lot of<br/>\nthe content. It bothers her, but not enough to do &quot;work&quot; (like phonics or<br/>\nother reading aid program) to help. Maybe that&#39;s a part of growing up and<br/>\nallowing kids to realize what they need anyway. ***<br/>\n<br/>\nSeriously consider books on cd or mp3&#39;s.  Book for book my oldest had &quot;heard&quot; <br/>\nand absorbed far more than the average school kid.  She didn&#39;t need to read the <br/>\nwords on paper.  She did a lot of reading in games and online, that by the time <br/>\nshe DID pick up a book and read it, it was a manga, she had a large vocabulary <br/>\nand was familiar enough with written text that she went straight into reading <br/>\nand understanding.  There wasn&#39;t a struggle for her.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":393140665,"authorName":"Natalie Bullock","from":"Natalie Bullock &lt;nasb2pyrs@...&gt;","profile":"dubbadubbadub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289158350","msgId":58014,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9X0t4cEV6TEFRLVh3PU9YZ2Itck9UamliRGJaNWtiV3JqaVErYkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4JPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4JPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4JPDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4="},"prevInTopic":58013,"nextInTopic":58015,"prevInTime":58013,"nextInTime":58015,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"I am going to try to stay offline for most of the day, but I couldn t help reading this thread.  :) Kelly - I like that bumper sticker!  If I did bumper","messageBody":"<div id=\"ygrps-yiv-203219519\">I am going to try to stay offline for most of the day, but I couldn&#39;t help<br/>\nreading this thread.  :)<br/>\n<br/>\nKelly - I like that bumper sticker!  If I did bumper stickers, I&#39;d hope to<br/>\nsport one of those one day.  I couldn&#39;t do it now - not honestly - but I can<br/>\naspire.  :)  I also like how you&#39;ve channeled your inner control freak!  No<br/>\nway I&#39;d try to manage a conference - much too much organization required<br/>\n(I&#39;d be lost!), but I keep &quot;planning&quot; to get to work gardening.  Right now,<br/>\nmy raw material is rock hard, &quot;baked&quot; and very rocky dirt, but my children<br/>\nand I have been perusing some books on fun ways to remake yards so that<br/>\nthey&#39;re really kid-friendly, and I have lots of ideas.  Getting those ideas<br/>\ninto action = very hard for me. I think perhaps today would be a good time<br/>\nto start.<br/>\n<br/>\nBrie, I have LOTS of craft supplies, but they are scattered all over, out of<br/>\nsight and not easily accessible.  Perhaps purchasing a few big containers<br/>\nand placing them all in there, within easy view and reach, would be better.<br/>\nMy daughter made a birthday cake the other day by cutting out paper and<br/>\nforming it into a 3-tier round cake (well, cakes) that she&#39;s not yet<br/>\ndecorated; it rests on a little paper table she also made.  I love how she<br/>\nsees those things.  Thanks for the link to the vision site; I&#39;ll look at<br/>\nthat later this evening.<br/>\n<br/>\nLisa, I have Ron&#39;s book - the one you mentioned.  I did the eval exercise<br/>\nwith my daughter, and...she was definitely not receptive.  She didn&#39;t want<br/>\nto do it, and it didn&#39;t make sense to her.  I&#39;ve been put off by his very<br/>\nexpensive (and apparently, only moderately successful) program.  One of the<br/>\nthings he wants children to do is to make the words in clay.  My daughter<br/>\nalmost cried at the mere suggestion, so even if it were a wildly successful<br/>\nmethod, if she&#39;s that resistant, it wouldn&#39;t work for her anyway.  Not<br/>\nespecially while she doesn&#39;t want to do it.<br/>\n<br/>\nRobin, I appreciate the information (and clarification) on that myth.  I<br/>\nalso think I&#39;ve read that for many kids who have dyslexia, age 11 seems to<br/>\nbe a common age when they see big improvements in reading.  Whether that<br/>\nwill be true or not for my daughter, she seems to do best if she does it on<br/>\nher own terms.  Brie, although I don&#39;t necessarily foresee learning Hebrew<br/>\n(but it sounds kinda cool to me - I love languages), your comment about what<br/>\nworked best for your brother was for people to back off...well, yeah, that&#39;s<br/>\nwhat has worked best for my daughter so far, too.  I think that is what she<br/>\nneeds me to keep doing.  :)<br/>\n<br/>\nDebbie - SO MUCH good stuff in your last response!<br/>\n<br/>\nLet your children explore freely with support. When you&#39;ve shaken off the<br/>\n<blockquote><span title=\"ireply\"> &gt; belief that you need to direct their learning, you will be free to engage<br/>\n&gt; with your children as a supportive partner in their lives; helping them to<br/>\n&gt; thrive, exploring the world with enthusiasm; learning all sorts of things<br/>\n&gt; along the way and making meaningful connections amongst it all.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I...I love this.  It is a core statement, isn&#39;t it?  I think I&#39;m just going<br/>\nto meditate on that today.<br/>\n<br/>\nAnd yes, in response to seeing the difference between even a<br/>\nparent-choreographed attempt at creating a unit study even on something a<br/>\nchild is interested in, I see the difference now.  My question is - if my<br/>\ndaughter says she wants to study the ocean, and none of the things I bring<br/>\nto her really capture her attention, then where do we go with that?  She&#39;s<br/>\n6, so I would imagine I need to provide *something*.  I could pull out the<br/>\nbooks I have, and we could sit down on the computer together, but as the<br/>\nocean is 3 hours from here, it would take a bit of planning to get there<br/>\n(but we do manage now and then - visited some tide pools last month...and<br/>\nlearned that some shoes are just not good for walking on those slippery<br/>\nrocks, ahem).  I have also heard of the concept of &quot;strewing&quot;, which<br/>\nprovided a sort of missing link for me a couple months ago.  I think...maybe<br/>\nI am overthinking it all.<br/>\n<br/>\n(And I enjoyed your paragraph about sewing; in our case, I don&#39;t know how to<br/>\nsew well, although my daughter and I did work on a sort of collaborative<br/>\neffort with a more sewing-capable friend to make a Southern Belle type of<br/>\ndress for dd.  :)  Both of my girls would probably be happy if I sewed for<br/>\nthem all day.  Maybe we&#39;ll try that this week.  I think I have enough<br/>\nthread.  ;)<br/>\n<br/>\nSo much else I could write, but I am going to turn off the computer now and<br/>\ngo clear away some of the rocks in my yard.  There&#39;s a metaphor there...<br/>\n<br/>\nThank you all,<br/>\nNatalie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":459359078,"authorName":"Regan","from":"Regan &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289154527","msgId":58013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0MkREQUZGLUIzQTctNDk1Ni04MzlCLTVCMUQzOTY3NTU0NEBiaWdwb25kLmNvbT4=","inReplyToHeader":"PEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58012,"nextInTopic":58014,"prevInTime":58012,"nextInTime":58014,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... I doubt that your focus on learning styles will be helpful to you in unschooling.   I don t think about my family s learning syles when considering what to","messageBody":"<div id=\"ygrps-yiv-988719553\">On 07/11/2010, at 4:08 PM, Natalie Bullock wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My method - what would work for ME - would be to read a few books and/or<br/>\n&gt; look up information online.  Maybe I&#39;d watch a documentary.  It doesn&#39;t<br/>\n&gt; readily come to me to consider sewing a wolf mask, nor would anything<br/>\n&gt; inherently kinesthetic.<br/>\n<br/>\n </span></blockquote>I doubt that your focus on learning styles will be helpful to you in unschooling.   I don&#39;t think about my family&#39;s learning syles when considering what to bring to our lives - I think of what will be fun and interesting; what might engage or amaze or amuse.  With interest and engagement, learning will happen naturally and maximally.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I realize that those were examples, but I know<br/>\n&gt; there&#39;s a whole world of opportunities and exciting ways to incorporate<br/>\n&gt; learning out there...and if it doesn&#39;t come to me naturally, then,<br/>\n&gt; naturally, I spend time looking for these things online.  It&#39;s<br/>\n&gt; ...time-consuming.  For myself, I need to relocate and bring forth my own<br/>\n&gt; creative ability.  It&#39;s not quite here, but I am fairly confident it&#39;s still<br/>\n&gt; inside me somewhere.<br/>\n<br/>\n </span></blockquote>As you deschool more, you will learn that you don&#39;t need to look for ways to &quot;incorporate learning&quot;.  Learning will happen anyway.  And if you&#39;re goal-directed in your approach to your children&#39;s learning, you and your children will all miss out on so much.  Your home will be more like a school than a place of learning ;-)<br/>\n<br/>\nUnschooling parents don&#39;t look for ways to &quot;incorporate learning&quot; into their children&#39;s days.  Learning is not separate from the rest of life.  It doesn&#39;t need to have time set aside and plans made for it.  Unschooling parents support and facilitate their children&#39;s interests; notice what&#39;s engaging to them, notice potentially interesting paths diverging from there.   Help to make those available to them.  Rich, complex learning will happen.<br/>\n<br/>\nDo you see how different that is from getting online to look up an interesting way to present a unit study?  Even when the child chooses the topic of the unit study, if the parent then takes over how it&#39;s to be explored, it&#39;s very likely that the child&#39;s initial interest will wane.  They may even then be seen as fickle, when in reality they keep having their interests messed with - slowed down, sped up, gone in wrong directions.   That&#39;s no fun.  <br/>\n<br/>\nAnd it can take quite a lot of time and effort to be the co-ordinator of the unit study, as you&#39;ve found out.  And meanwhile real learning opportunities are being missed.<br/>\n<br/>\nLet your children explore freely with support.  When you&#39;ve shaken off the belief that you need to direct their learning, you will be free to engage with your children as a supportive partner in their lives; helping them to thrive, exploring the world with enthusiasm; learning all sorts of things along the way and making meaningful connections amongst it all.<br/>\n<br/>\nI smiled at your comment about how sewing a wolf mask is not something you&#39;d naturally think of.  I am not drawn to sewing either.   However, I have sewn in my role as an unschooling parent - dolls, a couple of recorder cases, several costumes; including a two-person cow costume for a local musical dd was in.  She was cast as the rear half of a dancing cow (yees :-), and so a big cow costume was needed.  Although I&#39;m not interested in sewing as a pastime for me, I am interested in supporting my dd&#39;s passions, so I focus on how to make exciting stuff happen.<br/>\n<br/>\nAnd just in case it helps you to understand unschooling a bit better, in all those sewing projects, my dd was only involved in ways that she wanted to be, which was mostly only using the end product.   She has seen me measure, cut out and sew, and she&#39;s driven the sewing machine fast on scrap fabric, helped to choose colours and styles but she hasn&#39;t wanted to sew much herself.  I&#39;m sure that she&#39;s picked up quite a lot just because she&#39;s been around when projects have been happening, but she hasn&#39;t stopped what she&#39;s been doing to explore it.  <br/>\n<br/>\nThere is no need for my dd to delve into sewing if she&#39;s not interested.  I&#39;m sure that she would pick it up quite quickly if she wanted to take it further, but she may never want to.  She knows how to do lots of other things that *have* grabbed her interest.  Watching interests grow and develop and intermingle with other interests and blossom all over the place, is one of the delights of unschooling.   <br/>\n<br/>\nDebbie. <br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; </span></blockquote></div>","specialLinks":[]},{"userId":432657691,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;naturewalkersinfo@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Trying to wrap my mind around this","postDate":"1289151749","msgId":58012,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGliNm9lNSt1OWpvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDlBNjkxNjgxLTcxNzAtNDk2Qi04NkQyLUYwNDM1RDlDNzMyREBjb21jYXN0Lm5ldD4="},"prevInTopic":58011,"nextInTopic":58013,"prevInTime":58011,"nextInTime":58013,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"I m glad you shared that belief and its myth-y-ness, Robin.  I should have been clearer in my post too, and explained that All the interventions in the world","messageBody":"<div id=\"ygrps-yiv-1486419671\">I&#39;m glad you shared that belief and its myth-y-ness, Robin.  I should have been clearer in my post too, and explained that All the interventions in the world were of little help for my brother.  Having everyone back-off, and learning to read in Hebrew (because he wanted to), when we moved to Israel, was the best thing for him.  It was only later, in reading some of the material I had from Steve Gallop, that he realized he had probably re-trained his mind, via his eyes moving in an &quot;unnatural&quot; direction, to decipher text more easily.  The point is, it happened gently because he was engaged in something that he chose to do for his own reasons; it wasn&#39;t something done to him or something he was made to do.<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289147054","msgId":58011,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlBNjkxNjgxLTcxNzAtNDk2Qi04NkQyLUYwNDM1RDlDNzMyREBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDI3RTk3QjM2LTU2OEMtNEFGNC04NzJGLUMzNTQ1MDc1NzQ5MUBjb21jYXN0Lm5ldD4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDM4MzE4OS40OTY1NS5xbUB3ZWI4MzUwNS5tYWlsLnNwMS55YWhvby5jb20+IDwyN0U5N0IzNi01NjhDLTRBRjQtODcyRi1DMzU0NTA3NTc0OTFAY29tY2FzdC5uZXQ+"},"prevInTopic":58010,"nextInTopic":58012,"prevInTime":58010,"nextInTime":58012,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"To clarify (as my e-mail program shmushed it altogether)... ... Robin B.","messageBody":"<div id=\"ygrps-yiv-1410545637\">To clarify (as my e-mail program shmushed it altogether)...<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; And from Sandra&#39;s &quot;Myths&quot; page:<br/>\n<br/>\n </span></blockquote>This is Sandra&#39;s commentary:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; This quote came from a discussion on MySpace and was sent to me by one<br/>\n&gt; of the participants (not by the author). People do believe these<br/>\n&gt; things, though, and it&#39;s just not so.<br/>\n<br/>\n </span></blockquote>This is the quote that&#39;s the myth:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; With dyslexia you HAVE to be trained in how to get past it. this isnt<br/>\n&gt; just some person that could read at some point. if he isnt trained HOW<br/>\n&gt; to see letters in groups that form words he never will be able to do<br/>\n&gt; it and it will ALWAYS be frustrating for him. since neither of you are<br/>\n&gt; very aware of dyslexia I am going to tell you that some of the<br/>\n&gt; unschooling pracitces just do not apply to dyslexics. the whole<br/>\n&gt; concept of not insisting they do things doesnt work. people with<br/>\n&gt; dyslexia are forced to do these types of eye and mind training so that<br/>\n&gt; at some point things suddenly get easier for them.<br/>\n&gt;<br/>\n </span></blockquote>Robin B.</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289146698","msgId":58010,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3RTk3QjM2LTU2OEMtNEFGNC04NzJGLUMzNTQ1MDc1NzQ5MUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PDM4MzE4OS40OTY1NS5xbUB3ZWI4MzUwNS5tYWlsLnNwMS55YWhvby5jb20+","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDM4MzE4OS40OTY1NS5xbUB3ZWI4MzUwNS5tYWlsLnNwMS55YWhvby5jb20+"},"prevInTopic":58009,"nextInTopic":58011,"prevInTime":58009,"nextInTime":58011,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"As Ron Davis has a program to sell and links dyslexia with all manner of learning disabilities , I d take the advice of unschooling parents and how their","messageBody":"<div id=\"ygrps-yiv-927863610\">As Ron Davis has a &quot;program&quot; to sell and links dyslexia with all  <br/>\nmanner of &quot;learning disabilities&quot;, I&#39;d take the advice of unschooling  <br/>\nparents and how their kids (&quot;diagnosed&quot; or not) learned to read instead.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/reading\">http://sandradodd.com/reading</a><br/>\n<br/>\nHere&#39;s an article by an unschooling dad, diagnosed as dyslexic:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/r/mikedyslexia\">http://sandradodd.com/r/mikedyslexia</a><br/>\n<br/>\nAnd from Sandra&#39;s &quot;Myths&quot; page:<br/>\n<br/>\nThis quote came from a discussion on MySpace and was sent to me by one  <br/>\nof the participants (not by the author). People do believe these  <br/>\nthings, though, and it&#39;s just not so.<br/>\nWith dyslexia you HAVE to be trained in how to get past it. this isnt  <br/>\njust some person that could read at some point. if he isnt trained HOW  <br/>\nto see letters in groups that form words he never will be able to do  <br/>\nit and it will ALWAYS be frustrating for him. since neither of you are  <br/>\nvery aware of dyslexia I am going to tell you that some of the  <br/>\nunschooling pracitces just do not apply to dyslexics. the whole  <br/>\nconcept of not insisting they do things doesnt work. people with  <br/>\ndyslexia are forced to do these types of eye and mind training so that  <br/>\nat some point things suddenly get easier for them.<br/>\n<br/>\nRobin B.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Have you read The Gift of Dyslexia: Why Some of the Smartest People  <br/>\n&gt; Can&#39;t Read<br/>\n&gt; and How They Can Learn by Ronald D. Davis (2010)?<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":233098946,"authorName":"Lisa E Biesemeyer","from":"Lisa E Biesemeyer &lt;l.biesemeyer@...&gt;","profile":"l.biesemeyer@sbcglobal.net","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289143746","msgId":58009,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4MzE4OS40OTY1NS5xbUB3ZWI4MzUwNS5tYWlsLnNwMS55YWhvby5jb20+","inReplyToHeader":"PEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58008,"nextInTopic":58010,"prevInTime":58008,"nextInTime":58010,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"Hi, Natalie, Have you read The Gift of Dyslexia: Why Some of the Smartest People Can t Read and How They Can Learn by Ronald D. Davis (2010)? I have not read","messageBody":"<div id=\"ygrps-yiv-202301633\">Hi, Natalie, <br/>\n<br/>\nHave you read The Gift of Dyslexia: Why Some of the Smartest People Can&#39;t Read <br/>\nand How They Can Learn by Ronald D. Davis (2010)? I have not read this <br/>\nparticular book on dyslexia, but I read a review of it as well as this synopsis <br/>\n(below), and I think it sounds particularly wonderful and fascinating. It may be <br/>\nuseful to you and your daughter.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.dyslexia.com/bookstore/giftbook.htm\">http://www.dyslexia.com/bookstore/giftbook.htm</a><br/>\n<br/>\nLisa B<br/>\n<br/>\n Lisa Biesemeyer<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Natalie Bullock &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nasb2pyrs@...\">nasb2pyrs@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Sat, November 6, 2010 10:08:12 PM<br/>\nSubject: Re: [AlwaysLearning] Trying to wrap my mind around this<br/>\n<br/>\n  <br/>\nI took some time to mull over the responses to my post earlier this week,<br/>\nand I have to say that they&#39;ve been illuminating and very helpful.  I think<br/>\nthat part of my problem is that, at least based on learning style<br/>\nassessment, my own learning style is very different than any of my<br/>\nchildren...well, that, or I was able to accommodate regular schoolwork (when<br/>\nI was in school, rather a long time ago) so easily that I&#39;ve lost sight of<br/>\nwhat really IS my style.  An example would be the suggestions Debbie gives<br/>\nWRT where we might find ourselves as she gives herself over to studying<br/>\nwolves.<br/>\n<br/>\nNo need to concern yourself with notional prerequisites to taking the<br/>\nsubject &#39;Wolves&#39;. No need for lesson plans. Have fun with it. See where it<br/>\ntakes you both. You might end up sewing wolf masks or getting interested in<br/>\nsome of the wolf myths or bears or theatre or...<br/>\n<br/>\nMy method - what would work for ME - would be to read a few books and/or<br/>\nlook up information online.  Maybe I&#39;d watch a documentary.  It doesn&#39;t<br/>\nreadily come to me to consider sewing a wolf mask, nor would anything<br/>\ninherently kinesthetic.  I realize that those were examples, but I know<br/>\nthere&#39;s a whole world of opportunities and exciting ways to incorporate<br/>\nlearning out there...and if it doesn&#39;t come to me naturally, then,<br/>\nnaturally, I spend time looking for these things online.  It&#39;s<br/>\n...time-consuming.  For myself, I need to relocate and bring forth my own<br/>\ncreative ability.  It&#39;s not quite here, but I am fairly confident it&#39;s still<br/>\ninside me somewhere.<br/>\n<br/>\nI noticed that for so long, my first response - to just about anything - was<br/>\n&quot;no&quot;.  I&#39;ve been focusing on saying &quot;yes&quot; more often and while I&#39;m certainly<br/>\nnot going to claim that we&#39;ve had any sort of radical changes for the<br/>\nbetter, I will say it felt very nice...and my children have noticed and<br/>\nappreciated it.  I&#39;ve also talked to them about changing how we approach<br/>\nlearning and that I wanted to work on refocusing how we view learning vs.<br/>\n&quot;school&quot; - that I don&#39;t want to recreate school at home so let&#39;s talk about<br/>\nsome things we might want to learn about today.   Suddenly, I&#39;m flooded with<br/>\nso many requests that I get a little overloaded, but enthusiasm is always<br/>\nbetter than misery, and the details will shake themselves out well enough, I<br/>\nsuppose.<br/>\n<br/>\nThere are still many things that I&#39;m working through - thank you, Debbie,<br/>\nfor reminding (and reassuring) me that it&#39;s an incremental process.  I have<br/>\na hard time with TV (not the documentaries, but definitely many of the shows<br/>\ncurrently playing on the popular kids&#39; channels) and games, not only<br/>\nbecause, personally, I don&#39;t like them very much, but also because<br/>\npractically, we have a small house and what might be interesting for one<br/>\nchild, is not likely going to be interesting to one or two of the others.<br/>\nMy son wants to watch anything to do with war (good gracious, but I loved<br/>\nthe recommendations in another thread on this list!), but my girls do not.<br/>\nAt all.  My daughters might want to watch about wolves or horses, but my son<br/>\ncomplains of the noise from the TV no matter where else he might be in the<br/>\nhouse.  Perhaps I should seek out information on a good pair of<br/>\nnoise-canceling earphones.<br/>\n<br/>\nI think there&#39;s another challenge that I&#39;m encountering - I really do like<br/>\nto be in control.  In a larger sense, I&#39;m not (I so very much want to leave<br/>\nour current state), but on the day-to-day scene, it comes down to &quot;if I<br/>\ncan&#39;t control those things, then I guess I need to control these.&quot;  My<br/>\nchildren have been caught up in that, and only  lately have I realized that,<br/>\nand have started trying to disentangle my issues from how my children<br/>\nexperience ME.  When I reflect on the kinds of memories I am making for<br/>\nthem, it has been a painful reminder that I&#39;ve fallen short of my goal as a<br/>\nparent, but that they&#39;re not grown, and there&#39;s no time like the present to<br/>\nmake THIS moment better.  It occurs to me that maybe part of this journey is<br/>\nalso parenting myself.  When I look at it that way, unschooling takes on a<br/>\nwhole different dimension and perhaps more than ever, I realize why I&#39;m<br/>\ndrawn to make these changes - and why I feel how &#39;right&#39; they are even<br/>\nwithout fully understanding how to get there - because the child I was would<br/>\nvery much have liked to have been raised in an unschooling way.  (I did say<br/>\nthanks for reminding me about taking it one step at a time, right?)<br/>\n<br/>\nMeredith, thank you for the links you included on what learning can look<br/>\nlike.  I&#39;m going to read them more than a few times - it&#39;s a bit like<br/>\nunpeeling a banana, as each time I look at them, there&#39;s something I didn&#39;t<br/>\n&quot;see&quot; before.  I love and appreciate how you can frame so many everyday<br/>\nthings as learning opportunities - or how an everyday thing can become a<br/>\nlearning opportunity especially if you keep following rabbit trails.  My<br/>\nhusband - and maybe even a little bit of who I still am - worries that it&#39;s<br/>\none thing to call reading a Dr. Seuss book on space as an example of<br/>\n&quot;learning&quot;, but if there&#39;s no recollection of any of it two days later, does<br/>\nit count?  On the one hand, I think that remembering something for a test in<br/>\nschool and forgetting it two days later...well, that&#39;s not any better at<br/>\nall, and probably is worse.  The beauty of a child-directed approach is that<br/>\nit nurtures a child&#39;s enthusiasm for something that matters/is interestig to<br/>\nthem, which means the learning is more...real? and meaningful...and doesn&#39;t<br/>\nwaste a lot of time on the stuff they&#39;d forget anyway.  I know I didn&#39;t say<br/>\nthat very well.  On the other hand, well...are there things you think your<br/>\nchild *should* know (besides, in the end, how to be a good person)?<br/>\nCounting money?  Multiplication tables?  Something else?  That need to<br/>\ndefine &quot;need to know&quot; things might eventually dissipate, but it can&#39;t be<br/>\ncompletely denied now.  I can put it under the heading of future business,<br/>\nbut it&#39;s a prominent and present concern of my husband...and he&#39;s my<br/>\nchildren&#39;s parent, too.  This is the sort of thing for which I don&#39;t yet<br/>\nhave an answer - not that I expect anyone here to know, either, but I figure<br/>\nI should put it out there anyway.<br/>\n<br/>\nAs for what my dd (with dyslexia) wants to do to aid in learning to<br/>\nread...the answer is, for now, nothing.  Or more specifically, to be left<br/>\nalone to read quietly.  I am okay with this but I guess I still worry if<br/>\nthere&#39;s something else I should be doing.  I have read that many kids with<br/>\ndyslexia seem to really pick up steam somewhere around age 11.  For now, dd<br/>\nis reading big books like the Maximum Ride series, but she misses a lot of<br/>\nthe content.  It bothers her, but not enough to do &quot;work&quot; (like phonics or<br/>\nother reading aid program) to help.  Maybe that&#39;s a part of growing up and<br/>\nallowing kids to realize what they need anyway.  (I should disclose that she<br/>\nhas some visual processing problems - she has a convergence insufficiency<br/>\nand hypertropia, which, once resolved [if resolved] may or may not reveal<br/>\nthat dyslexia was never the problem after all.  But for now, she is REALLY<br/>\nresistant to any sort of vision therapy.  She also gets many headaches, and<br/>\nI simply don&#39;t know if they are related to her visual problems or not.)<br/>\n<br/>\nPam and Katherine, I&#39;ve requested a copy of that book from the library - I<br/>\nappreciate the recommendation and look forward to reading it.<br/>\n<br/>\nThis is already terribly long, but I&#39;m going to print it out, along with the<br/>\nresponses to my original post, and keep them handy, especially on those days<br/>\nwhen workbooks look even a little appealing.  :)<br/>\n<br/>\n-Natalie (who is mostly kidding about the workbooks)<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":432657691,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;naturewalkersinfo@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying to wrap my mind around this","postDate":"1289139113","msgId":58008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGliNmMzOStra2dvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58007,"nextInTopic":58009,"prevInTime":58007,"nextInTime":58009,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... inherently kinesthetic. I realize that those were examples, but I know there s a whole world of opportunities and exciting ways to incorporate learning out","messageBody":"<div id=\"ygrps-yiv-675477533\">--- It doesn&#39;t readily come to me to consider sewing a wolf mask, nor would anything<br/>\ninherently kinesthetic. I realize that those were examples, but I know<br/>\nthere&#39;s a whole world of opportunities and exciting ways to incorporate<br/>\nlearning out there...and if it doesn&#39;t come to me naturally, then,<br/>\nnaturally, I spend time looking for these things online. It&#39;s<br/>\n...time-consuming. For myself, I need to relocate and bring forth my own<br/>\ncreative ability. It&#39;s not quite here, but I am fairly confident it&#39;s still<br/>\ninside me somewhere.----- AND----Suddenly, I&#39;m flooded with<br/>\n<blockquote><span title=\"ireply\"> &gt; so many requests that I get a little overloaded--------<br/>\n<br/>\n </span></blockquote>I wanted to chime in here real quick with an idea I&#39;ve suggested often to new unschoolers--it&#39;s something I learned from living with my daughter, who is highly creative and hands-on.  Have a few boxes or baskets full of materials they can go to without having to ask for supplies.  Recyclables (egg cartons, coffee cans, flattened cardboard cereal boxes, assorted packaging materials) are wonderful for all kinds of things.  Put together a box of fabric scraps, large and small (old clothing and sheets are a great start).  Glue, scissors, paint/markers, aluminum foil, modeling clay, wire, pompoms, googly eyes, feathers, craft foam, magazine pictures........the &quot;creative stuff,&quot; from what I can tell, is pretty natural in many kids, especially if they have a host of materials to freely choose from.  <br/>\n<br/>\nOf course, there are tons of great websites and books with craft ideas for kids, and I do offer some ideas from outside sources, or leave a webpage open or book on her desk.  For the most part, however, the seed comes from her and I assist with gathering and information, if asked.  Also, be fully prepared that an idea you offer will get spun beyond recognition--that&#39;s a wonderful thing to watch!<br/>\n<br/>\nMy dd has been working on dioramas for the past few weeks after being inspired by a trip to the Natural History museum.  She asks for help looking things up online, and in books we have at home, because she&#39;s interested in making some parts realistic.  One of the dioramas is made with her many dinosaur figures (some of which are now covered in red paint (blood)), but she was unhappy with the ground cover she drew.  She&#39;s always saved rocks, leaves, sticks, dead bugs, etc.... so she dug out a bunch of Ginkgo leaves she&#39;d stashed away earlier this year and glued them to sticks (trees) because she remembered that Ginkgo is a prehistoric plant......something we talked about MONTHS ago, for a brief moment, on a hike.  <br/>\n<br/>\n------  (I should disclose that she has some visual processing problems - she has a convergence insufficiency and hypertropia, which, once resolved [if resolved] may or may not reveal that dyslexia was never the problem after all.  But for now, she is REALLY resistant to any sort of vision therapy.  She also gets many headaches, and I simply don&#39;t know if they are related to her visual problems or not.)-------<br/>\n<br/>\nI&#39;ve only recently discovered that a large part of my own headaches come from vision issues.  My brother is becoming increasingly convinced that his dyslexia was a vision issue that he corrected when he learned to read Hebrew (right to left).  We&#39;ve found an amazing eye doctor (and former unschooling dad) who has been a wealth of information and assistance.  He has a lot of good information on his website and in his book.  I wonder if your daughter is interested, if the exercises could be something she does at home, whenever she chooses?<br/>\n<br/>\nHere is his info: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.gallopintovision.com/\">http://www.gallopintovision.com/</a><br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":896746,"authorName":"Kelly Lovejoy","from":"Kelly Lovejoy &lt;kbcdlovejo@...&gt;","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289125645","msgId":58007,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRDRDN0Q4MTJFNjQ2Qy1FNDgtMTI3RTFAd2VibWFpbC1kMDkwLnN5c29wcy5hb2wuY29tPg==","inReplyToHeader":"PEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT48RjNFNjIwQzctNTk0Mi00NDcyLThBRTktNERCODUzMEUwRjRBQGJpZ3BvbmQuY29tPiA8QUFOTGtUaW4zVWs9Y1VpYWFKY29BbTRvLW5DcHhhblZ6MXlHQ1kwdEhveDA5QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":58006,"nextInTopic":58008,"prevInTime":58006,"nextInTime":58008,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... From: Natalie Bullock  I ve also talked to them about changing how we approach learning and that I wanted to work on refocusing how we","messageBody":"<div id=\"ygrps-yiv-1646735603\">-----Original Message-----<br/>\nFrom: Natalie Bullock &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nasb2pyrs@...\">nasb2pyrs@...</a>&gt;<br/>\n<br/>\n<br/>\nI&#39;ve also talked to them about changing how we approach<br/>\nlearning and that I wanted to work on refocusing how we view learning vs.<br/>\n&quot;school&quot; - that I don&#39;t want to recreate school at home so let&#39;s talk about<br/>\nsome things we might want to learn about today. <br/>\n-=-=-=-=-=-<br/>\nI have a bumper sticker: <br/>\n               WE UNSCHOOL<br/>\nbecause we refuse to recreate a failed system<br/>\n-=-=-=-=-=-=-=-=-<br/>\n<br/>\nI think there&#39;s another challenge that I&#39;m encountering - I really do like<br/>\nto be in control.  In a larger sense, I&#39;m not (I so very much want to leave<br/>\nour current state), but on the day-to-day scene, it comes down to &quot;if I<br/>\ncan&#39;t control those things, then I guess I need to control these.&quot; <br/>\n<br/>\n-=-=-=-=-=-=-=-<br/>\nI too am a control freak. So I had to have something else to control. <br/>\nI started an unscholing conference. When that was not enough, we got a guide dog puppy (or three) to raise. When that was not enough, I became a gardener. That was still not enough, so we got chickens. That may be enough, especially with the new puppy! &lt;bwg&gt;<br/>\nEasy solution. Find something else to control.<br/>\n<br/>\n<br/>\n ~Kelly<br/>\n<br/>\nKelly Lovejoy<br/>\n&quot;There is no single effort more radical in its potential for saving the world than a transformation of the way we raise our children.&quot; Marianne Williamson<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289125045","msgId":58006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU2Mzg3OERELUJBODItNEM5Mi1BRTY4LTJGRDUxMEEyMTgxOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEFBTkxrVGluU3NYenlfREpKcFRZdy1Ta1crLVBocUhyYUVpUDdOaHhWTGtDVUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4gPDYzRDc1OEVBLUNCMjMtNDdCMy1BNDU2LTIzNkY4MjA0RjE3RUB2ZXJpem9uLm5ldD4gPEFBTkxrVGluU3NYenlfREpKcFRZdy1Ta1crLVBocUhyYUVpUDdOaHhWTGtDVUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58005,"nextInTopic":58007,"prevInTime":58005,"nextInTime":58007,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"-=-The daughter of a Marine in me knows how to answer this - it has to do with the fact that there are plenty of things we have to do in life that we might","messageBody":"<div id=\"ygrps-yiv-189208563\">-=-The &quot;daughter of a Marine&quot; in me knows how to answer this - it has  <br/>\nto do<br/>\nwith the fact that there are plenty of things we have to do in life  <br/>\nthat we<br/>\nmight not want to do (like on a job), but that we have to do it  <br/>\nanyway,-=-<br/>\n<br/>\nI would like to say that as the parent of three now-grown unschoolers,  <br/>\neverything is a choice.  Becoming a marine is a choice.  Remaining a  <br/>\nmarine is a choice.  If you see the world as a maze of &quot;no choice,&quot;  <br/>\nyou will have a harder time understanding unschooling.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<br/>\nYou don&#39;t &quot;have to&quot; do anything.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":393140665,"authorName":"Natalie Bullock","from":"Natalie Bullock &lt;nasb2pyrs@...&gt;","profile":"dubbadubbadub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289120649","msgId":58005,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluU3NYenlfREpKcFRZdy1Ta1crLVBocUhyYUVpUDdOaHhWTGtDVUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDYzRDc1OEVBLUNCMjMtNDdCMy1BNDU2LTIzNkY4MjA0RjE3RUB2ZXJpem9uLm5ldD4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4JPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4JPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4JPDYzRDc1OEVBLUNCMjMtNDdCMy1BNDU2LTIzNkY4MjA0RjE3RUB2ZXJpem9uLm5ldD4="},"prevInTopic":58004,"nextInTopic":58006,"prevInTime":58004,"nextInTime":58006,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... The daughter of a Marine in me knows how to answer this - it has to do with the fact that there are plenty of things we have to do in life that we might","messageBody":"<div id=\"ygrps-yiv-1958413118\">On Sun, Nov 7, 2010 at 12:34 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; If they find something useful they&#39;ll get better at it as a side<br/>\n&gt; effect of using it.<br/>\n&gt;<br/>\n&gt; If it&#39;s something that&#39;s not useful right now why would they need to<br/>\n&gt; learn it? Would learning to drive a car be useful right now? Why would<br/>\n&gt; anything else that&#39;s future useful be needed earlier than it&#39;s needed?<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>The &quot;daughter of a Marine&quot; in me knows how to answer this - it has to do<br/>\nwith the fact that there are plenty of things we have to do in life that we<br/>\nmight not want to do (like on a job), but that we have to do it anyway, and<br/>\nthat order and discipline are good habits to cultivate - and by extension,<br/>\nschool and education are reasonable and appropriate avenues to ensuring that<br/>\nthose &quot;values&quot; are instilled in us even at an early age.  However, the me<br/>\nthat is me right now has come to realize that people are far more amenable<br/>\nand adaptable to things when the need or desire is brought to the fore, just<br/>\nas they can be far more resistant (rather than cooperative) when it is a<br/>\nrequirement without an apparent purpose.  I also know that school is no<br/>\nbargain - it works for some kids (or maybe it&#39;s that some kids figure out<br/>\nhow to work the system), but it is certainly no guarantee that a &quot;schooled&quot;<br/>\nindividual is going to be a perfectly organized and disciplined widget.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If it&#39;s something they won&#39;t need, then they&#39;ll waste time learning it<br/>\n&gt; that could have been spent on something that&#39;s useful right now.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Agreed.  Except for the charter school thing, but I guess I&#39;m going to find<br/>\nout just how unschooling-friendly they really are.  It might be that it&#39;s<br/>\nentirely compatible, or it might be that we don&#39;t stay with them after all.<br/>\n<br/>\nI think what scares people about kids not learning future important<br/>\n<blockquote><span title=\"ireply\"> &gt; stuff now is that they have picked up from school that learning is<br/>\n&gt; long and hard. But what&#39;s hard is learning stuff that you don&#39;t see a<br/>\n&gt; point in.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>I think what scares people about not learning future important stuff is that<br/>\na) it might be needed sooner than you expect (eg., be prepared), and b)<br/>\nunschooling is a really unfortunate term.  There&#39;s an element of<br/>\nconfrontation in it, even, especially for those who accept the system<br/>\nwithout question (and who cannot imagine questioning the system), and even<br/>\nfor those who can see the system doesn&#39;t work, but who think that tweaking<br/>\nit a little and doing it at home makes it better (that was sort of me...sort<br/>\nof).  I have spent some time this evening re-reading the articles posted by<br/>\nMeredith above.  I also looked up &quot;Sandra Dodd&quot; on Facebook and found her<br/>\narticle, <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling\">http://sandradodd.com/deschooling</a> on that page&#39;s &quot;wall&quot;, after<br/>\nwhich I followed some of the links at the bottom of that article, and some<br/>\nof the links on those, etc...  and while I definitely can&#39;t say I *know*<br/>\nwhat I&#39;m doing, I think I &quot;get&quot; it a little more of it than I did earlier.<br/>\n<br/>\nThis one was maybe my favorite:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/seeingit\">http://sandradodd.com/seeingit</a><br/>\nand there is a lot here, too:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com/deschooling/deschoolingmom.html\">http://joyfullyrejoycing.com/deschooling/deschoolingmom.html</a><br/>\n<br/>\nInteresting aside that sort of illustrates the value of letting a child take<br/>\nthe lead:  my son, who is 11.5 years old, has been a history buff since he<br/>\nwas a wee little guy.  He told me that he wanted to study American History<br/>\nthis year so I bought a textbook (just for a timeline), and another<br/>\ntexty-ish book, and a teacher&#39;s guide...and you know what?  There&#39;s no joy<br/>\nin it for him.  I think I just need to help him find some books/movies/etc.<br/>\nand let him approach it in his own way, which is apparently MUCH more<br/>\neffective than what I&#39;ve been doing.  He is an unschooling success story<br/>\njust waiting to happen - waiting for mom to figure it out.  I&#39;m willing to<br/>\nbet that my girls are, too.<br/>\n<br/>\nBefore I forget - the one thing that has been the hardest to &quot;get&quot; is that<br/>\nunschooling isn&#39;t just about learning/modifying how we view<br/>\nlearning/education.  It&#39;s a huge shift from the generally traditional view<br/>\nof parenting (especially, but not limited to, authoritarian, &quot;I&#39;m the parent<br/>\n- that&#39; why&quot; parenting) to something that&#39;s just...different.  Really<br/>\ndifferent.  I&#39;m still working out how to make that shift in my head.  I<br/>\nthink it will just take time - I think I can connect many, maybe most, of<br/>\nthe dots, but not yet all of them.<br/>\n<br/>\nThanks again,<br/>\nNatalie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289115288","msgId":58004,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzRDc1OEVBLUNCMjMtNDdCMy1BNDU2LTIzNkY4MjA0RjE3RUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4gPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4gPEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":58003,"nextInTopic":58005,"prevInTime":58003,"nextInTime":58005,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... If they find something useful they ll get better at it as a side effect of using it. If it s something that s not useful right now why would they need to ","messageBody":"<div id=\"ygrps-yiv-1217939957\">On Nov 7, 2010, at 1:08 AM, Natalie Bullock wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On the other hand, well...are there things you think your<br/>\n&gt; child *should* know (besides, in the end, how to be a good person)?<br/>\n&gt; Counting money? Multiplication tables? Something else?<br/>\n<br/>\n </span></blockquote>If they find something useful they&#39;ll get better at it as a side  <br/>\neffect of using it.<br/>\n<br/>\nIf it&#39;s something that&#39;s not useful right now why would they need to  <br/>\nlearn it? Would learning to drive a car be useful right now? Why would  <br/>\nanything else that&#39;s future useful be needed earlier than it&#39;s needed?<br/>\n<br/>\nIf it&#39;s something they won&#39;t need, then they&#39;ll waste time learning it  <br/>\nthat could have been spent on something that&#39;s useful right now.<br/>\n<br/>\nI think what scares people about kids not learning future important  <br/>\nstuff now is that they have picked up from school that learning is  <br/>\nlong and hard. But what&#39;s hard is learning stuff that you don&#39;t see a  <br/>\npoint in. If someone loves cars and a new engine design comes out,  <br/>\nthey&#39;re going to suck in whatever gets put in front of them and reach  <br/>\nfor more. If someone who has no interest in cars is made to memorize  <br/>\nthe workings of the new engine, it&#39;s going to be a huge, boring task  <br/>\nand they&#39;ll try to do as little as they can get away with, for  <br/>\nsomething that will fade quickly and leave them feeling even less  <br/>\ninterested in cars.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":393140665,"authorName":"Natalie Bullock","from":"Natalie Bullock &lt;nasb2pyrs@...&gt;","profile":"dubbadubbadub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289106492","msgId":58003,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluM1VrPWNVaWFhSmNvQW00by1uQ3B4YW5WejF5R0NZMHRIb3gwOUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4JPEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4="},"prevInTopic":58000,"nextInTopic":58004,"prevInTime":58002,"nextInTime":58004,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"I took some time to mull over the responses to my post earlier this week, and I have to say that they ve been illuminating and very helpful.  I think that part","messageBody":"<div id=\"ygrps-yiv-1751738843\">I took some time to mull over the responses to my post earlier this week,<br/>\nand I have to say that they&#39;ve been illuminating and very helpful.  I think<br/>\nthat part of my problem is that, at least based on learning style<br/>\nassessment, my own learning style is very different than any of my<br/>\nchildren...well, that, or I was able to accommodate regular schoolwork (when<br/>\nI was in school, rather a long time ago) so easily that I&#39;ve lost sight of<br/>\nwhat really IS my style.  An example would be the suggestions Debbie gives<br/>\nWRT where we might find ourselves as she gives herself over to studying<br/>\nwolves.<br/>\n<br/>\nNo need to concern yourself with notional prerequisites to taking the<br/>\nsubject &#39;Wolves&#39;. No need for lesson plans. Have fun with it. See where it<br/>\ntakes you both. You might end up sewing wolf masks or getting interested in<br/>\nsome of the wolf myths or bears or theatre or...<br/>\n<br/>\n<br/>\nMy method - what would work for ME - would be to read a few books and/or<br/>\nlook up information online.  Maybe I&#39;d watch a documentary.  It doesn&#39;t<br/>\nreadily come to me to consider sewing a wolf mask, nor would anything<br/>\ninherently kinesthetic.  I realize that those were examples, but I know<br/>\nthere&#39;s a whole world of opportunities and exciting ways to incorporate<br/>\nlearning out there...and if it doesn&#39;t come to me naturally, then,<br/>\nnaturally, I spend time looking for these things online.  It&#39;s<br/>\n...time-consuming.  For myself, I need to relocate and bring forth my own<br/>\ncreative ability.  It&#39;s not quite here, but I am fairly confident it&#39;s still<br/>\ninside me somewhere.<br/>\n<br/>\nI noticed that for so long, my first response - to just about anything - was<br/>\n&quot;no&quot;.  I&#39;ve been focusing on saying &quot;yes&quot; more often and while I&#39;m certainly<br/>\nnot going to claim that we&#39;ve had any sort of radical changes for the<br/>\nbetter, I will say it felt very nice...and my children have noticed and<br/>\nappreciated it.  I&#39;ve also talked to them about changing how we approach<br/>\nlearning and that I wanted to work on refocusing how we view learning vs.<br/>\n&quot;school&quot; - that I don&#39;t want to recreate school at home so let&#39;s talk about<br/>\nsome things we might want to learn about today.   Suddenly, I&#39;m flooded with<br/>\nso many requests that I get a little overloaded, but enthusiasm is always<br/>\nbetter than misery, and the details will shake themselves out well enough, I<br/>\nsuppose.<br/>\n<br/>\nThere are still many things that I&#39;m working through - thank you, Debbie,<br/>\nfor reminding (and reassuring) me that it&#39;s an incremental process.  I have<br/>\na hard time with TV (not the documentaries, but definitely many of the shows<br/>\ncurrently playing on the popular kids&#39; channels) and games, not only<br/>\nbecause, personally, I don&#39;t like them very much, but also because<br/>\npractically, we have a small house and what might be interesting for one<br/>\nchild, is not likely going to be interesting to one or two of the others.<br/>\nMy son wants to watch anything to do with war (good gracious, but I loved<br/>\nthe recommendations in another thread on this list!), but my girls do not.<br/>\nAt all.  My daughters might want to watch about wolves or horses, but my son<br/>\ncomplains of the noise from the TV no matter where else he might be in the<br/>\nhouse.  Perhaps I should seek out information on a good pair of<br/>\nnoise-canceling earphones.<br/>\n<br/>\nI think there&#39;s another challenge that I&#39;m encountering - I really do like<br/>\nto be in control.  In a larger sense, I&#39;m not (I so very much want to leave<br/>\nour current state), but on the day-to-day scene, it comes down to &quot;if I<br/>\ncan&#39;t control those things, then I guess I need to control these.&quot;  My<br/>\nchildren have been caught up in that, and only  lately have I realized that,<br/>\nand have started trying to disentangle my issues from how my children<br/>\nexperience ME.  When I reflect on the kinds of memories I am making for<br/>\nthem, it has been a painful reminder that I&#39;ve fallen short of my goal as a<br/>\nparent, but that they&#39;re not grown, and there&#39;s no time like the present to<br/>\nmake THIS moment better.  It occurs to me that maybe part of this journey is<br/>\nalso parenting myself.  When I look at it that way, unschooling takes on a<br/>\nwhole different dimension and perhaps more than ever, I realize why I&#39;m<br/>\ndrawn to make these changes - and why I feel how &#39;right&#39; they are even<br/>\nwithout fully understanding how to get there - because the child I was would<br/>\nvery much have liked to have been raised in an unschooling way.  (I did say<br/>\nthanks for reminding me about taking it one step at a time, right?)<br/>\n<br/>\nMeredith, thank you for the links you included on what learning can look<br/>\nlike.  I&#39;m going to read them more than a few times - it&#39;s a bit like<br/>\nunpeeling a banana, as each time I look at them, there&#39;s something I didn&#39;t<br/>\n&quot;see&quot; before.  I love and appreciate how you can frame so many everyday<br/>\nthings as learning opportunities - or how an everyday thing can become a<br/>\nlearning opportunity especially if you keep following rabbit trails.  My<br/>\nhusband - and maybe even a little bit of who I still am - worries that it&#39;s<br/>\none thing to call reading a Dr. Seuss book on space as an example of<br/>\n&quot;learning&quot;, but if there&#39;s no recollection of any of it two days later, does<br/>\nit count?  On the one hand, I think that remembering something for a test in<br/>\nschool and forgetting it two days later...well, that&#39;s not any better at<br/>\nall, and probably is worse.  The beauty of a child-directed approach is that<br/>\nit nurtures a child&#39;s enthusiasm for something that matters/is interestig to<br/>\nthem, which means the learning is more...real? and meaningful...and doesn&#39;t<br/>\nwaste a lot of time on the stuff they&#39;d forget anyway.  I know I didn&#39;t say<br/>\nthat very well.  On the other hand, well...are there things you think your<br/>\nchild *should* know (besides, in the end, how to be a good person)?<br/>\nCounting money?  Multiplication tables?  Something else?  That need to<br/>\ndefine &quot;need to know&quot; things might eventually dissipate, but it can&#39;t be<br/>\ncompletely denied now.  I can put it under the heading of future business,<br/>\nbut it&#39;s a prominent and present concern of my husband...and he&#39;s my<br/>\nchildren&#39;s parent, too.  This is the sort of thing for which I don&#39;t yet<br/>\nhave an answer - not that I expect anyone here to know, either, but I figure<br/>\nI should put it out there anyway.<br/>\n<br/>\nAs for what my dd (with dyslexia) wants to do to aid in learning to<br/>\nread...the answer is, for now, nothing.  Or more specifically, to be left<br/>\nalone to read quietly.  I am okay with this but I guess I still worry if<br/>\nthere&#39;s something else I should be doing.  I have read that many kids with<br/>\ndyslexia seem to really pick up steam somewhere around age 11.  For now, dd<br/>\nis reading big books like the Maximum Ride series, but she misses a lot of<br/>\nthe content.  It bothers her, but not enough to do &quot;work&quot; (like phonics or<br/>\nother reading aid program) to help.  Maybe that&#39;s a part of growing up and<br/>\nallowing kids to realize what they need anyway.  (I should disclose that she<br/>\nhas some visual processing problems - she has a convergence insufficiency<br/>\nand hypertropia, which, once resolved [if resolved] may or may not reveal<br/>\nthat dyslexia was never the problem after all.  But for now, she is REALLY<br/>\nresistant to any sort of vision therapy.  She also gets many headaches, and<br/>\nI simply don&#39;t know if they are related to her visual problems or not.)<br/>\n<br/>\nPam and Katherine, I&#39;ve requested a copy of that book from the library - I<br/>\nappreciate the recommendation and look forward to reading it.<br/>\n<br/>\nThis is already terribly long, but I&#39;m going to print it out, along with the<br/>\nresponses to my original post, and keep them handy, especially on those days<br/>\nwhen workbooks look even a little appealing.  :)<br/>\n<br/>\n-Natalie (who is mostly kidding about the workbooks)<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":459359078,"authorName":"Regan","from":"Regan &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1289051134","msgId":58000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzRTYyMEM3LTU5NDItNDQ3Mi04QUU5LTREQjg1MzBFMEY0QUBiaWdwb25kLmNvbT4=","inReplyToHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57987,"nextInTopic":58003,"prevInTime":57999,"nextInTime":58001,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... Do things that make life better; more interesting, more fun.  After some time doing this, you re then in a different position than you were when you","messageBody":"<div id=\"ygrps-yiv-1979314940\">On 01/11/2010, at 6:06 PM, Natalie Bullock wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; For some reason I cannot explain, I continue to be pulled toward unschooling<br/>\n&gt; and the problem is, I am afraid that I am too much a product of the<br/>\n&gt; conventional method to really make it work well.<br/>\n<br/>\n </span></blockquote>  Do things that make life better; more interesting, more fun.  After some time doing this, you&#39;re then in a different position than you were when you started.  You can then reassess how things are going then.  If things could be better, then make some positive changes. <br/>\n<br/>\nPeople do not just flick the switch to unschooling.  It takes making lots of more helpful choices.  This you can do from any starting point.  And some will take it further than others, but it all starts with being engaged in supporting your family. <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; My husband is not enamored of homeschooling.  His dream would be to move to<br/>\n&gt; an area where there are &quot;good&quot; schools so we can put our three children<br/>\n&gt; (ages, 11, 9 and 6) in school, and so that I can go to work.  He agrees that<br/>\n&gt; our children are doing well, but he&#39;s just not someone who feels comfortable<br/>\n&gt; doing things that are so far out of the ordinary.  We are fortunate to have<br/>\n&gt; some fantastic homeschool families, and that eases his mind a bit...but not<br/>\n&gt; enough to grasp it enthusiastically and exclaim that it really is the right<br/>\n&gt; thing after all.<br/>\n<br/>\n </span></blockquote> If you, at home with your children, are not clear about the benefits of what you are doing, it&#39;s not surprising that your husband is underwhelmed.  Getting clear in yourself about how to best help your children learn and thrive would be a starting point if you want to move towards unschooling.   <br/>\n<br/>\nLearning more about unschooling will help, but where and how to start?   Quietly reading this list every day and bringing to your family some of the positive changes you learn about, will help enormously.   There are websites full of wonderful unschooling information.  There are unschooling books.  Like anything else, you explore; open to new ideas and information, making changes that make sense, given the context of your family.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; She shows so little joy in anything academic or educational, and as for learning - she<br/>\n&gt; says she wants to learn about wolves.  If I ask her how she wants to learn, she says, &quot;By doing.&quot;  <br/>\n<br/>\n </span></blockquote> You can help her to learn about wolves (or anything else) without even asking her how she wants to learn.  They&#39;re interesting, what do you know about wolves?  Go exploring together.  Sooo many things you could do.  Looking up pictures on the net would be a simple starting point.  Take it further form there.  You know her - what can you guess that might interest her?   One of the delights of having children is participating in their interests.<br/>\n<br/>\nNo need to concern yourself with notional prerequisites to taking the subject &#39;Wolves&#39;.  No need for lesson plans.  Have fun with it.  See where it takes you both.  You might end up sewing wolf masks or getting interested in some of the wolf myths or bears or theatre or...  Being interested enables learning to happen.  Help to make it swirl through your lives.  That is what unschooling parents do.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; my middle child - my 9yo daughter - has<br/>\n&gt; dyslexia, and some &quot;experts&quot; say in order to help her read, she needs<br/>\n&gt; intensive phonics work.  Others say she needs an intensive whole language<br/>\n&gt; approach.  OTOH, I think she needs everyone to back off.She is very visual-spatial, and I am not.  I feel<br/>\n&gt; like whatever I&#39;ve done is only increased her resistance.  I want to undo<br/>\n&gt; the damage, but considering the dyslexia is problematic, I don&#39;t really know<br/>\n&gt; how.  Would I be doing her a disservice by not giving intensive phonics<br/>\n&gt; review?  If she didn&#39;t want to read, it would be easy enough to put this off<br/>\n&gt; for now, but she wants to read very, very much.<br/>\n<br/>\n </span></blockquote> If she wants to read, then help her to read in ways that work for her now.  Think creatively about &#39;reading&#39; things that could bring her joy.  Label items around the house together, write out a little story with words that she may know how to read.  Print out the words to songs she knows and sing them together.  Word and letter fridge magnets may be fun.  Read logos.  Make up logos. None of these ideas may be relevant to your situation but I hope that you can come up with some fun things that can help to address her desire to read.  <br/>\n<br/>\nIf her journey to reading has included being diagnosed as dyslexic and visual-spatial,  having experts address her reading progress as a problem,  having experts give prescriptions as to how to fix her &#39;problem&#39; and  having her mother implement some of the prescriptions, then her current desire to read may be mixed up with a desire to be doing what the people around her have lead her to believe she should be doing.<br/>\n<br/>\nStart now to help her have some successes (and fun) with reading, since she wants to read.  And continue to help and support her desires as she grows and changes and her needs and desires change.  <br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; I want to let go of the bonds of planning forms and worrying about the order<br/>\n&gt; in which one must learn science or reading, and just let it happen<br/>\n&gt; naturally.  I believe that it can, but there is an elusive &quot;something&quot; that<br/>\n&gt; I still need - that would allow me to let this mere belief yield to an<br/>\n&gt; enduring trust in the process and an appreciation for the journey.  I can<br/>\n&gt; see the other side, but I don&#39;t know how to get there.<br/>\n<br/>\n </span></blockquote> One foot in front of the other.  Step by step.  You cannot know what unschooling will look like for each of your children, just as you don&#39;t know what interests they will develop, who their friends will be, how tall they will be etc.  You don&#39;t need to know.  You need to help make now as vibrant and interesting and fun as it can be.    <br/>\n<br/>\nI suspect that the &#39; elusive &quot;something&quot; &#39; that you&#39;re looking for is more understanding of unschooling.  With more understanding you will be confident in what you&#39;re doing and why you&#39;re doing it.  With conventional schooling and homeschooling, parents often don&#39;t question how to proceed - so many people are following the same patterns.  Stepping outside those preset patterns requires parents to be observant and thoughtful participants in their childrens lives.  <br/>\n<br/>\nYou&#39;re already questioning what you&#39;ve been doing, noticing what&#39;s not helping.  Learning more about unschooling will help you make decisions in the best interests of *your* family.<br/>\n<br/>\nDebbie.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Trying to wrap my mind around this","postDate":"1288830383","msgId":57987,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlhc3VqZityYjdmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57980,"nextInTopic":58000,"prevInTime":57986,"nextInTime":57988,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... It may be the problem is you don t have a strong enough grasp of what learning really is - that s not uncommon, especially for homeschoolers, since its","messageBody":"<div id=\"ygrps-yiv-442906574\">Natalie Bullock &lt;nasb2pyrs@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Samples can include pictures and videos, and for<br/>\n&gt; example, math for the day can be a game instead of a worksheet...but<br/>\n&gt; something has to be happening every day and we need to provide evidence that<br/>\n&gt; it is happening. <br/>\n<br/>\n </span></blockquote>It may be the problem is you don&#39;t have a strong enough grasp of what &quot;learning&quot; really is - that&#39;s not uncommon, especially for homeschoolers, since its easy to get all wrapped up in teaching and lose sight of how learning really happens. I&#39;ll give you a couple specific links to read and get you thinking, the first is about writing a &quot;curriculum&quot; to describe an unschooling life and the others are about how learning really works:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum.html\">http://sandradodd.com/unschoolingcurriculum.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections/\">http://sandradodd.com/connections/</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dot/elvis\">http://sandradodd.com/dot/elvis</a><br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; physical samples of work in each of four subject areas (math, language<br/>\n&gt; arts, science, and social studies/history)<br/>\n<br/>\n </span></blockquote>Anything to do with numbers, patterns, sequences, time, space, measurement, organization - that&#39;s math. Anything to do with stories (including movies and shows) and story telling (including dramatic play) is part of language arts. Telling jokes, comedy skits, even slapstick humor are all language arts for your purposes. Science - any thing with animals, food (cooking or eating), water, dirt, fire, air, can be science. Most outside play can be chalked up as science. Social studies - gosh this stuff if everywhere... what do y&#39;all do during the day? Who do you hang out with? Do you watch tv? I bet there are tons of things you can use - were there just elections in your area? Pull some flyers out of the trash, you probably talked about them at some point if only to complain about junk mail. The existance of junk mail is a topic of &quot;social studies&quot; (economics, advertising, culture, culture wars, taste, norms... but you don&#39;t have to make a lesson about it, just realize you can&#39;t avoid those topics even if they only get a passing glance most of the time). <br/>\n<br/>\nSTart looking for the real learning that&#39;s going on all the time, when you&#39;re kids aren&#39;t doing anything that looks like homeschool - that&#39;s a place for You to start getting comfortable and get some ideas for how you can explain this unschooling craziness to your husband. If he&#39;s uncomfortable with homeschooling, then unschooling might seem like a crazy cult to him, so go slowly with that. Also, if you&#39;ve been gung-ho about homeschooling your kids may be skeptical if you just quit - so you&#39;ll need to be able to reassure them, too. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I want to undo<br/>\n&gt; the damage, but considering the dyslexia is problematic, I don&#39;t really know<br/>\n&gt; how.  Would I be doing her a disservice by not giving intensive phonics<br/>\n&gt; review?  If she didn&#39;t want to read, it would be easy enough to put this off<br/>\n&gt; for now, but she wants to read very, very much.<br/>\n<br/>\n </span></blockquote>Wholly unschooled kids who are also dyslexic learn to read. That&#39;s not a direct answer to your question, but this is an unschooling list, its not a great place to ask educational advice, if you see what I mean. I can give you my opinion as a former teacher of reading but that won&#39;t help you understand unschooling. <br/>\n<br/>\nIf she wants help, what kind of help would she find reassuring? Would putting captions on the tv be enough for her to feel like she has some more tools at her disposal? Does she think she needs lessons?<br/>\n<br/>\nIf &quot;phonics&quot; (and different things are meant by that) seems excruciating to her, then no, don&#39;t do that, but recently I&#39;m noticing teachers use &quot;phonics&quot; to mean something more like a managed vocabulary, where students learn a few words at a time and add to them. If that would reassure your dd, then its something to offer her. But also realize that some kids aren&#39;t ready to read until puberty! For some people all the necessary brain functions don&#39;t click until then - in that sense reading is an &quot;adult&quot; skill, its better to wait than push someone to read too early. Unschooled kids who read later do need some reassurance - after all, there&#39;s a lot of social pressure from other kids and extended family that links reading to intelligence. <br/>\n<br/>\nWith that in mind, its good to consider if your dd wants to read, or wants what reading &quot;gives&quot; her. Would she like some audio books? Would she like to be read to? Maybe she doesn&#39;t need to read right now, but to have mroe access to the world on her own terms. <br/>\n<br/>\n---Meredith (Mo 9, Ray 17)</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1288748466","msgId":57980,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltZXZTVFpQTUI9RGN6WEhoQ0pxWCs2NDhTUHlOSld5UmNXYV9QMEBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDRDQ0YyRDY1LjUwMzA1MDFAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4JPDRDQ0YyRDY1LjUwMzA1MDFAZWFydGhsaW5rLm5ldD4="},"prevInTopic":57968,"nextInTopic":57987,"prevInTime":57979,"nextInTime":57981,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... Barbara Sher. I read that book and no longer thought of myself as scattered or distracted. Supporting my own strengths rather than fighting against them","messageBody":"<div id=\"ygrps-yiv-1129015623\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I also was influenced positively by the book, &quot;Refuse to Choose,&quot; by<br/>\n </span></blockquote>Barbara Sher. I read that book and no longer thought of myself as<br/>\nscattered or distracted. Supporting my own strengths rather than<br/>\nfighting against them has been really amazing for me.&lt;&lt;&lt;<br/>\n<br/>\nPam, I&#39;m not adding much to what you have above but that&#39;s just the<br/>\nbook that I thought of in response to the thread questions in the<br/>\noriginal post. Same book.<br/>\n<br/>\nThe actual advice of ways to organize are probably less helpful but<br/>\nthey are some ideas. The biggest help I got from Barbara&#39;s book is the<br/>\nrealization that I have a lot to offer in this thing called<br/>\nunschooling. It is NOT a book that focuses on or that even mentions<br/>\nunschooling but it was very encouraging to me, a person who personally<br/>\nfinds being organized both over- and underwhelming.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 11/1/10, Pam Sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt; wrote:<br/>\n&gt;   On 11/1/2010 12:06 AM, Natalie Bullock wrote:<br/>\n&gt;&gt; It only<br/>\n&gt;&gt; recently occurred to me that fighting against my natural abilities (and<br/>\n&gt;&gt; letting go of some of the things that are endless struggles) isn&#39;t just<br/>\n&gt;&gt; hurting me, it&#39;s wasting time - time for me, time with my children, etc<br/>\n&gt;<br/>\n&gt; Something that really helped me see myself as having a bundle of<br/>\n&gt; strengths to support and pursue versus a bundle of weaknesses to try to<br/>\n&gt; correct was unschooling my own children. It was a lot easier to see them<br/>\n&gt; that way than to see myself that way, and it rubbed off on how i saw<br/>\n&gt; myself (and my husband), over time.<br/>\n&gt;<br/>\n&gt; I also was influenced positively by the book, &quot;Refuse to Choose,&quot; by<br/>\n&gt; Barbara Sher. I read that book and no longer thought of myself as<br/>\n&gt; scattered or distracted. Supporting my own strengths rather than<br/>\n&gt; fighting against them has been really amazing for me.<br/>\n&gt;<br/>\n&gt; pam<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":126919745,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Trying to wrap my mind around this","postDate":"1288645989","msgId":57968,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDQ0YyRDY1LjUwMzA1MDFAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":57967,"nextInTopic":57980,"prevInTime":57967,"nextInTime":57969,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"... Something that really helped me see myself as having a bundle of strengths to support and pursue versus a bundle of weaknesses to try to correct was","messageBody":"<div id=\"ygrps-yiv-1394917477\">On 11/1/2010 12:06 AM, Natalie Bullock wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; It only<br/>\n&gt; recently occurred to me that fighting against my natural abilities (and<br/>\n&gt; letting go of some of the things that are endless struggles) isn&#39;t just<br/>\n&gt; hurting me, it&#39;s wasting time - time for me, time with my children, etc<br/>\n<br/>\n </span></blockquote>Something that really helped me see myself as having a bundle of <br/>\nstrengths to support and pursue versus a bundle of weaknesses to try to <br/>\ncorrect was unschooling my own children. It was a lot easier to see them <br/>\nthat way than to see myself that way, and it rubbed off on how i saw <br/>\nmyself (and my husband), over time.<br/>\n<br/>\nI also was influenced positively by the book, &quot;Refuse to Choose,&quot; by <br/>\nBarbara Sher. I read that book and no longer thought of myself as <br/>\nscattered or distracted. Supporting my own strengths rather than <br/>\nfighting against them has been really amazing for me.<br/>\n<br/>\npam</div>","specialLinks":[]},{"userId":393140665,"authorName":"Natalie Bullock","from":"Natalie Bullock &lt;nasb2pyrs@...&gt;","profile":"dubbadubbadub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Trying to wrap my mind around this","postDate":"1288595192","msgId":57967,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrc1p4Y3U1PS05QVk2ak5VOTg9TGc5V0UyNG5TYkNLUjcyM09tS0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":57968,"prevInTime":57966,"nextInTime":57968,"topicId":57967,"numMessagesInTopic":0,"msgSnippet":"For some reason I cannot explain, I continue to be pulled toward unschooling and the problem is, I am afraid that I am too much a product of the conventional","messageBody":"<div id=\"ygrps-yiv-1047096507\">For some reason I cannot explain, I continue to be pulled toward unschooling<br/>\nand the problem is, I am afraid that I am too much a product of the<br/>\nconventional method to really make it work well.<br/>\n<br/>\nI did not come to homeschooling easily, and it was a decision borne of (what<br/>\nI perceived as) a need, not a true desire, but we are wending our way<br/>\nthrough our fourth homeschooling year.  My husband still considers it a<br/>\nnecessary....well, not evil, but it&#39;s not desirable.  I&#39;ve come to love the<br/>\ngood things about it but I think I&#39;m making it too hard for all of us.<br/>\nHowever, while that&#39;s all true, I also knew that I have a particular disdain<br/>\nfor textbooks and even though I had no idea what I was looking for, I knew<br/>\nit didn&#39;t involve textbooks.  :)<br/>\n<br/>\nI&#39;m Natalie, and I am an introvert.  On the Myers-Briggs test, I am as<br/>\nintroverted as it gets - there&#39;s just very little middle ground, so being<br/>\n&quot;on&quot; all day was not an easy adjustment.  Not so much now, but somehow I<br/>\nstill need my own time to recharge, which I think is hard anyway when you<br/>\nhave younger kids.  I&#39;m also very ADD - which for me means that I have a<br/>\nVERY high need to be organized, and a very low ability to pull that off.  I<br/>\nhave spent HOURS trying to devise schedules (even just the forms) that<br/>\ncreate the kind of flow I think my children should have, and then never<br/>\nusing them because when I&#39;m in the moment, I don&#39;t use them.  It only<br/>\nrecently occurred to me that fighting against my natural abilities (and<br/>\nletting go of some of the things that are endless struggles) isn&#39;t just<br/>\nhurting me, it&#39;s wasting time - time for me, time with my children, etc.<br/>\n<br/>\nI&#39;ve been reading this list for a couple of weeks now, and when I find time,<br/>\nreading more on Sandra&#39;s site, and it&#39;s the one about respecting and showing<br/>\nlove for your spouse that finally has prompted me to write.<br/>\n<br/>\nMy husband is not enamored of homeschooling.  His dream would be to move to<br/>\nan area where there are &quot;good&quot; schools so we can put our three children<br/>\n(ages, 11, 9 and 6) in school, and so that I can go to work.  He agrees that<br/>\nour children are doing well, but he&#39;s just not someone who feels comfortable<br/>\ndoing things that are so far out of the ordinary.  We are fortunate to have<br/>\nsome fantastic homeschool families, and that eases his mind a bit...but not<br/>\nenough to grasp it enthusiastically and exclaim that it really is the right<br/>\nthing after all.<br/>\n<br/>\nThere are some things in my mind that I cannot reconcile with this notion<br/>\nthat unschooling just feels *right*, and I hope that by putting them out<br/>\nhere, you will gently help me see things that maybe I&#39;m missing.<br/>\n<br/>\nThe first one is that we belong to a charter school here in CA.  It is<br/>\napparently very &quot;friendly&quot; to unschooling families, but there still needs to<br/>\nbe physical samples of work in each of four subject areas (math, language<br/>\narts, science, and social studies/history) that we are expected to submit<br/>\nevery three weeks.  Samples can include pictures and videos, and for<br/>\nexample, math for the day can be a game instead of a worksheet...but<br/>\nsomething has to be happening every day and we need to provide evidence that<br/>\nit is happening.  The benefit to this is purely financial (nearly $5K/school<br/>\nyear).  We don&#39;t need it, but it definitely helps...and it is one way to<br/>\nshow my husband that we are meeting certain state standards.  Intuitively,<br/>\nthis requirement makes learning less fun...but maybe it&#39;s just that I&#39;ve<br/>\nbeen trying to squeeze my own square peg into a round hole, and maybe square<br/>\npegs really can happily live within the requirements of the charter.   Or<br/>\nmaybe it means that I just cannot really effectively unschool like this and<br/>\nI shouldn&#39;t bother trying, but...I really think it would be so much better<br/>\nif we could disentangle our (my!) schooly notions from the joy of learning.<br/>\n<br/>\nThe second consideration is that my middle child - my 9yo daughter - has<br/>\ndyslexia, and some &quot;experts&quot; say in order to help her read, she needs<br/>\nintensive phonics work.  Others say she needs an intensive whole language<br/>\napproach.  OTOH, I think she needs everyone to back off.  She shows so<br/>\nlittle joy in anything academic or educational, and as for learning - she<br/>\nsays she wants to learn about wolves.  If I ask her how she wants to learn,<br/>\nshe says, &quot;By doing.&quot;  She is very visual-spatial, and I am not.  I feel<br/>\nlike whatever I&#39;ve done is only increased her resistance.  I want to undo<br/>\nthe damage, but considering the dyslexia is problematic, I don&#39;t really know<br/>\nhow.  Would I be doing her a disservice by not giving intensive phonics<br/>\nreview?  If she didn&#39;t want to read, it would be easy enough to put this off<br/>\nfor now, but she wants to read very, very much.<br/>\n<br/>\nI want to let go of the bonds of planning forms and worrying about the order<br/>\nin which one must learn science or reading, and just let it happen<br/>\nnaturally.  I believe that it can, but there is an elusive &quot;something&quot; that<br/>\nI still need - that would allow me to let this mere belief yield to an<br/>\nenduring trust in the process and an appreciation for the journey.  I can<br/>\nsee the other side, but I don&#39;t know how to get there.<br/>\n<br/>\nAny advice?<br/>\n<br/>\nGratefully,<br/>\nNatalie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":58030,"nextTopicId":58077}}