{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":20,"messages":[{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Radical honesty","postDate":"1297313886","msgId":59626,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE2Mzg2LjQxOTIyLnFtQHdlYjgxNTAyLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PDZDRTQyREIwLTlFNTEtNEFFOC04QzJBLTcwOUY2RjRGOTk1Q0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGlpdm5nYit0YW5iQGVHcm91cHMuY29tPiA8NkNFNDJEQjAtOUU1MS00QUU4LThDMkEtNzA5RjZGNEY5OTVDQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":59625,"nextInTopic":0,"prevInTime":59625,"nextInTime":59627,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1273985225\">&lt;&lt;&lt;No, she will never, EVER be certain. And so having made that comment, the <br/>\nchild has lost his freedom to make his own choice about the book. He can agree <br/>\nwith his mom, or disagree with his mom, but he cannot come to his own <br/>\nconclusion.&gt;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nAnd that is what happened to me after the incident with the doll clothing and my <br/>\nmom. It took me years to start picking up clothes for myself<br/>\nthat I liked without worrying they were not pretty enough.<br/>\n I  was probably between 7-10 and I never forgot that incident.  <br/>\n<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Radical honesty","postDate":"1297312610","msgId":59625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrZVR4cWVucE1lRFBzNTV1SjBfNUNianFGT3JpeVdFVXV5VDk0NkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDZDRTQyREIwLTlFNTEtNEFFOC04QzJBLTcwOUY2RjRGOTk1Q0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGlpdm5nYit0YW5iQGVHcm91cHMuY29tPgk8NkNFNDJEQjAtOUU1MS00QUU4LThDMkEtNzA5RjZGNEY5OTVDQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":59624,"nextInTopic":59626,"prevInTime":59624,"nextInTime":59626,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"-=-Also, can you be certain he is not liking the book only because you made the comment about the dad treating his son badly?-=- ... the child has lost his","messageBody":"<div id=\"ygrps-yiv-599673352\">-=-Also, can you be certain he is not liking the book only because you made<br/>\nthe comment about the dad treating his son badly?-=-<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;No, she will never, EVER be certain.  And so having made that comment,<br/>\n </span></blockquote>the child has lost his freedom to make his own choice about the book.  He<br/>\ncan agree with his mom, or disagree with his mom, but he cannot come to his<br/>\nown conclusion.&lt;&lt;&lt;<br/>\n<br/>\nI have to say that the above is a FABulous example of why it&#39;s a wonderful<br/>\nadvantage to me NOT to be able to hear well and to doubt what I might or<br/>\nmight not have understood someone to say. I often wait to see what will come<br/>\nafter I hear something that doesn&#39;t add up to my way of thinking, and been<br/>\npaid generously with new knowledge for having waited to see what comes next.<br/>\n<br/>\n<br/>\nHow many times I have been surprised by the unexpected and often delightful<br/>\ndifference in Karl&#39;s opinion on things. By now, at Karl&#39;s ripe age of 7, I&#39;d<br/>\nsay the times have been countless.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Radical honesty","postDate":"1297311875","msgId":59624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZDRTQyREIwLTlFNTEtNEFFOC04QzJBLTcwOUY2RjRGOTk1Q0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlpdm5nYit0YW5iQGVHcm91cHMuY29tPg==","referencesHeader":"PGlpdm5nYit0YW5iQGVHcm91cHMuY29tPg=="},"prevInTopic":59623,"nextInTopic":59625,"prevInTime":59623,"nextInTime":59625,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"-=- It is totally okay if you share how the book made you feel.-=- I think it depends how much those feelings will shame or frighten or make another person","messageBody":"<div id=\"ygrps-yiv-1898012755\">-=- It is totally okay if you share how the book made you feel.-=-<br/>\n<br/>\nI think it depends how much those feelings will shame or frighten or make another person feel guilty for having so horribly inconvenience the poor mom.<br/>\n<br/>\nI offered lassi to a young-adult friend of mine once.  I made it while he was there.  I was making it for me and Keith, but offered to give him some.  I told him it was a little sour, and he might not like it.     He took a taste and reacted horribly and said in full-loud theatrical voice, &quot;That&#39;s RANCID!&quot;  <br/>\n<br/>\nWhat a jerk.<br/>\nI told him he needed to find out what &quot;rancid&quot; means.   Yogurt isn&#39;t going to be &quot;rancid.&quot;<br/>\n<br/>\nIt wasn&#39;t totally okay for him to share how that lassi made him feel.<br/>\n<br/>\n-=-We don&#39;t hesitate to comment for fear of turning others off to those kinds of shows. We talk about the show, others chime in and a conversation happens. It is normal discourse. And we learn more about each other in the process too. -=-<br/>\n<br/>\nIf people interrupt a show I&quot;m watching to tell what they think about it, I will ask them to wait for the commercial, or I&#39;ll pause it so they can make a comment.  If I don&#39;t like something one of my kids is watching, why should I say so?  I DO hesitate to comment when it might turn someone off to something they would otherwise enjoy.  Same with music, art, clothes...  <br/>\n<br/>\n-=-There is nothing wrong with reading a book, deciding halfway through it that you don&#39;t like it, and trying another. <br/>\n-=-It is totally okay if you share how the book made you feel.-=-<br/>\n<br/>\nThose statements are too strong, standing alone that way.<br/>\nIt might not be okay with the child, in which case it wasn&#39;t &quot;totally okay.&quot;<br/>\n<br/>\n-=-Also, can you be certain he is not liking the book only because you made the comment about the dad treating his son badly?-=-<br/>\n<br/>\nNo, she will never, EVER be certain.  And so having made that comment, the child has lost his freedom to make his own choice about the book.  He can agree with his mom, or disagree with his mom, but he cannot come to his own conclusion.<br/>\n<br/>\n-=-This isn&#39;t the end of special reading time together.-=-<br/>\n<br/>\nYou do not know that that won&#39;t be the last book that mother ever has an opportunity to read to her son.  You just cannot know.<br/>\n<br/>\nI object to this, for the purposes of this list:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Am I wrong?<br/>\n&gt; <br/>\n </span></blockquote>-=-No! You are not wrong. You are being yourself and yet trying to see if doing so changed how your son reacted. And then wondering if that is good or bad. It is neither good nor bad.-=-<br/>\n<br/>\nWhen the purpose of this list and the discussions here are to examine what leads to understanding the principles that help unschooling work well and longterm, things ARE good or bad.  Things ARE sometimes wrong, in that they do not lead closer to unschooling and peace and giving children the opportunity to learn independently of the instruction and expectations of others.<br/>\n<br/>\nIf someone pays a person money for an hour of one-on-one advice, then that person can say &quot;No! You are not wrong.&quot;  But on this list, in a discussion like this, statements should be qualified.  &quot;I think,&quot; or &quot;Because of this, maybe...&quot;  or &quot;If... then...&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":124256069,"authorName":"Bun","from":"&quot;Bun&quot; &lt;alohabun@...&gt;","profile":"alohabun","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Radical honesty","postDate":"1297310027","msgId":59623,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpdm5nYit0YW5iQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":59600,"nextInTopic":59624,"prevInTime":59622,"nextInTime":59624,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"... Most people would agree that honesty is a good value.  But sometimes it is good to be honest and sometimes it isn t. ... Just because they liked it doesn t","messageBody":"<div id=\"ygrps-yiv-614913051\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;&gt; I really like honesty and I value it.<br/>\n<br/>\n </span></blockquote>Most people would agree that honesty is a good value.  But sometimes it is good to be honest and sometimes it isn&#39;t.    <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I started reading the book Rune Warrior to my son as a friend said it was &gt; awesome and her son &gt; loved it ( our kids are the same age)<br/>\n<br/>\n </span></blockquote>Just because they liked it doesn&#39;t mean it will be liked by either you or your son.  Even if the boys have alot in common.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The book is very interesting and it is a good read but there are things that really bother me in the relationship between the dad and the boy and Saturday night I blurted out that I did not like some things in the book like the way the father sometimes treats his son and shames him.<br/>\n<br/>\n </span></blockquote>I wouldn&#39;t like that either and if I felt kind of shocked or appalled at the way the son was being treated, I too would have said so.  I don&#39;t think that is wrong.  I think that is human sharing of opinions and thoughts.  Your son knows that kind of treatment is not nice or okay.  He knows the values you believe in.  It is totally okay if you share how the book made you feel.  Books often try to evoke emotions in people.  Some people look especially for books that do just that ie. scary stories, books that are tear-jerkers, etc.  <br/>\n<br/>\nTwo nights ago my 9 yr old son and I were reading a story about Narcissus and Echo and I said I didn&#39;t like the way that they were so focused on looks (which is what the story is all about, but I felt like I wanted to say that aloud).  I can&#39;t remember if he commented or not.  I then went on reading and it was no big deal.  <br/>\n<br/>\nWe read and share as we both feel in the moment. Or sometimes we talk about it afterward.  This can lead to an interesting discussion and others might even join in.  The same sort of thing happens when we watch a show or movie - sometimes one of us wants to talk about a part of it that evoked some kind of response.  We don&#39;t hesitate to comment for fear of turning others off to those kinds of shows.  We talk about the show, others chime in and a conversation happens.  It is normal discourse.  And we learn more about each other in the process too.  <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son really really cherishes laying down and me reading to him. Its really &gt; something he loves and looks forward too.<br/>\n&gt; Well last night he did not want to read the book and that was surprising and I &gt; could  feel the night before that me saying I did not like the book &gt; was not the way to go. <br/>\n<br/>\n </span></blockquote>Just because he doesn&#39;t want to read that book doesn&#39;t mean you can&#39;t snuggle up and read a different one that you will both enjoy.  If you both cherish reading together at night, find one that he does like.  There is nothing wrong with reading a book, deciding halfway through it that you don&#39;t like it, and trying another.   <br/>\n<br/>\nAlso, can you be certain he is not liking the book only because you made the comment about the dad treating his son badly?  Could he have lost interest on his own?  <br/>\n<br/>\nEven if your comment did prompt him to think more deeply about whether or not he wanted to continue reading the book, *he did decide* that he didn&#39;t want to read it anymore.  Go with that.  Find another great book that both of you can enjoy (or at least one that he can enjoy and you don&#39;t mind reading).  <br/>\n<br/>\nHave you asked him why he doesn&#39;t want to read Rune Warriors anymore?  If it is because he feels it is upsetting to you, thank him for caring about your feelings but tell him you can handle it and offer to keep reading it (without comment unless he wants to talk about it).  If he says it is because he doesn&#39;t like how the dad treats his son, ask him if he wants to find another Viking or adventure book where people don&#39;t treat each other so badly - maybe you could read it first.  <br/>\n<br/>\nThis isn&#39;t the end of special reading time together.  It is an experience in figuring out what things your son might be sensitive to and so it is a learning experience.   <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;He was loving the book.<br/>\n </span></blockquote>But he isn&#39;t now.  There are plenty of other books to love!  And maybe someday he will come back to Rune Warriors.  Maybe so, maybe not.  Go with what he is interested in.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I remember when I was  a little girl I picked out a doll outfit and my mom  &gt; called it plain and not pretty and why did I not pick up something as colorful &gt; as &gt; my sister. It took me until adulthood almost to get over it. &gt; That is one of the reasons I disagree with this article about Radical Honesty &gt; and saying things even if .<br/>\n&gt; It may have been that beiges were not what my mom liked and she was honest to &gt; tell me but it did so much damage.<br/>\n&gt;  I radical honesty is  not something people should be telling parents to do.<br/>\n&gt; Yes be honesty but  do we need to tell  our daughter that indeed the dress she <br/>\n&gt; loves is very uggly?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>It depends.  If my five year old wore this dress that I thought was very ugly and asked me how beautiful she looked as she twirled around like a princess, I&#39;d say she looked gorgeous!  I see her shine and her spirit shine.  If my thirteen year old asked me to help her pick out a dress, I&#39;d be honest with her and tell her which ones I liked and why and which ones I didn&#39;t and why.  I&#39;d say anything with care, but I&#39;d be honest.  She and I have different taste sometimes - in music, clothes, whatever.  We both are cool with that and allow each other to freely be themselves.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Am I wrong?<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>No!  You are not wrong.  You are being yourself and yet trying to see if doing so changed how your son reacted.  And then wondering if that is good or bad.  It is neither good nor bad.  You shared your reaction to the story.  He then decided (on his own) to not want to read it anymore.  Neither thing is good or bad.  <br/>\n<br/>\nHowever, if you notice he only does what he thinks you want him to do all the time, that is something to consider.  <br/>\n<br/>\nI think he considered your opinion and then formulated his own opinion which was that he didn&#39;t want to read the book anymore.  It is okay.  And good that he even told you, right?!  You wouldn&#39;t want him to keep listening to it if he wasn&#39;t really enjoying it.  Or only listening to it because he thought it pleased you to finish it or because he thought you wanted him to enjoy it (like his friend and his friend&#39;s mom did).  <br/>\n<br/>\nLaurie</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Radical honesty","postDate":"1297264949","msgId":59600,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpdWJmbCszam0xQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlpcnRoaCs0M2oxQGVHcm91cHMuY29tPg=="},"prevInTopic":59597,"nextInTopic":59623,"prevInTime":59599,"nextInTime":59601,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"... Yes, sorry, Scott Noelle s post was considerably more nuanced than Blanton s book - although the concepts are directly derived from that book. Noelle did a","messageBody":"<div id=\"ygrps-yiv-586015324\">&quot;aldq75&quot; &lt;aldq75@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Are two different things are being discussed?<br/>\n&gt; <br/>\n&gt; Alex brought up a post by Scott Noelle &gt; <br/>\n&gt; I think Meredith is referring to a book by Brad Blanton?<br/>\n<br/>\n </span></blockquote>Yes, sorry, Scott Noelle&#39;s post was considerably more nuanced than Blanton&#39;s book - although the concepts are directly derived from that book. Noelle did a pretty good job of &quot;softening up&quot; the basic philosophy so that its more about personal integrity - which I think is the underlying intention of Radical Honesty, to strive for greater personal integrity.<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Radical honesty","postDate":"1297212956","msgId":59597,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGlrdWNrS3RQV2laVWZxTWNiWHVXZUV1elRwcGFlS1NRcEE4aDZqcUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlpcmtiaitya2k2QGVHcm91cHMuY29tPg==","referencesHeader":"PEFBTkxrVGltcXpKMng2MDRaY2dKPWUtYjBTS0xDeEU4ZmlQa2lfTjhmVFgzQ0BtYWlsLmdtYWlsLmNvbT4JPGlpcmtiaitya2k2QGVHcm91cHMuY29tPg=="},"prevInTopic":59592,"nextInTopic":59600,"prevInTime":59596,"nextInTime":59598,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"... in her opinion, sets herself up as having the ultimate say in judging everything around her.  There is no room to have a differing opinion -- because her s","messageBody":"<div id=\"ygrps-yiv-1773476525\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;Her &quot;radical honesty,&quot; while completely justified and &quot;just who she is&quot;<br/>\n </span></blockquote>in her opinion, sets herself up as having the ultimate say in judging<br/>\neverything around her.  There is no room to have a differing opinion --<br/>\nbecause her&#39;s is right, anything different must be wrong.  I learned very<br/>\nearly not to tell her anything about my thoughts or life, because she<br/>\ncouldn&#39;t help but blurt out her thoughts and run over mine.&lt;&lt;&lt;<br/>\n<br/>\nLinda, that&#39;s very familiar to me about unsolicited opinions and advice.<br/>\nBeing opinionated can be about not feeling worthy or accepted. Supposedly, a<br/>\nperson has zero authority to speak at all, if that person is without an<br/>\nopinion.<br/>\n<br/>\nAn opinion that is lived is very different from a perspective on something<br/>\none hasn&#39;t experienced much (or at all). Experiencing something in several<br/>\nshades means some degree of confidence.<br/>\n<br/>\nOf course I don&#39;t want to experience absolutely everything. And I&#39;m fine now<br/>\nwith saying &quot;I don&#39;t know.&quot; Without feeling unworthiness for not having an<br/>\nopinion.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187853867,"authorName":"aldq75","from":"&quot;aldq75&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Radical honesty","postDate":"1297185137","msgId":59592,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpcnRoaCs0M2oxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlpcm5zdCtlbGJrQGVHcm91cHMuY29tPg=="},"prevInTopic":59587,"nextInTopic":59597,"prevInTime":59591,"nextInTime":59593,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"Are two different things are being discussed? Alex brought up a post by Scott Noelle (http://www.enjoyparenting.com/daily-groove/radical-honesty) I think","messageBody":"<div id=\"ygrps-yiv-1020350272\">Are two different things are being discussed?<br/>\n<br/>\nAlex brought up a post by Scott Noelle (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.enjoyparenting.com/daily-groove/radical-honesty)\">http://www.enjoyparenting.com/daily-groove/radical-honesty)</a><br/>\n<br/>\nI think Meredith is referring to a book by Brad Blanton?<br/>\n<br/>\nAndrea Q<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; But that&#39;s what I mean about the book being un-nuanced, there&#39;s not much recognition of the value of waiting to cool down, or tempering one&#39;s words in order to be nurturing and supportive *while also* expressing one&#39;s needs and feelings. <br/>\n&gt; <br/>\n&gt; ---Meredith<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Radical honesty","postDate":"1297179357","msgId":59583,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpcm5zdCtlbGJrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":59582,"nextInTopic":59587,"prevInTime":59582,"nextInTime":59584,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"I ve read Radical Honesty, and found it kind of... un-nuanced. Its potentially a useful set of strategies for personal growth if you have a problem with","messageBody":"<div id=\"ygrps-yiv-2090377154\">I&#39;ve read Radical Honesty, and found it kind of... un-nuanced. Its potentially a useful set of strategies for personal growth if you have a problem with glossing over your feelings - and in that it may be useful to moms who have been raised to expect that its their job to squash down their needs and feelings and take care of eveyone else first. Getting &quot;real&quot; about your needs and issues can be a good thing in that case! <br/>\n<br/>\nAs a set of tools for communication, Radical Honesty only works if everyone is on the same page. Otherwise it ends up looking like people spewing bile and hatred under the guise of &quot;being honest about my feelings&quot; and hurting one another over and over. <br/>\n<br/>\nBut that&#39;s what I mean about the book being un-nuanced, there&#39;s not much recognition of the value of waiting to cool down, or tempering one&#39;s words in order to be nurturing and supportive *while also* expressing one&#39;s needs and feelings. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Radical honesty","postDate":"1297179168","msgId":59587,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI0NzUwNDgxLjEyOTcxNzkxNjgzMDMuSmF2YU1haWwucm9vdEB3YW11aS1oYXppcmFuLmF0bC5zYS5lYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":59583,"nextInTopic":59592,"prevInTime":59586,"nextInTime":59588,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"... I remember reading advice somewhere about dealing with a person like this, by having interactions that go something like: I really think those red shoes","messageBody":"<div id=\"ygrps-yiv-234539019\">-----Original Message-----<br/>\n<blockquote><span title=\"ireply\"> &gt;From: lspswr &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lspswr@...\">lspswr@...</a>&gt;<br/>\n<br/>\n&gt;In my own experience, more damage has been done to my relationship with my own mother by her incessant need to comment on and voice her opinion of every detail around her than by her doing most anything else.  Most every sentence has some sort of judgement attached to it -- &quot;oh that&#39;s good, that&#39;s bad, that&#39;s right, that&#39;s ugly, that&#39;s pretty, that&#39;s wrong, that&#39;s okay....&quot; <br/>\n<br/>\n </span></blockquote>I remember reading advice somewhere about dealing with a person like this, by having interactions that go something like:<br/>\n<br/>\n&quot;I really think those red shoes are ugly.&quot;<br/>\n<br/>\n&quot;You really think those red shoes are ugly.&quot;<br/>\n<br/>\n&quot;Yes, I do.&quot;<br/>\n<br/>\n&quot;Yes, you do.&quot;<br/>\n<br/>\nKind of different way of saying, &quot;So what?&quot;  ; )<br/>\n<br/>\nMichelle<br/>\n<br/>\n<br/>\n<br/>\nWife to Bob<br/>\nMomma to George (12), Theo (9), Eli (6), and Oliver (18 mo)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]},{"userId":332347767,"authorName":"lspswr","from":"&quot;lspswr&quot; &lt;lspswr@...&gt;","profile":"lspswr","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Radical honesty","postDate":"1297175731","msgId":59582,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpcmtiaitya2k2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGltcXpKMng2MDRaY2dKPWUtYjBTS0xDeEU4ZmlQa2lfTjhmVFgzQ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59577,"nextInTopic":59583,"prevInTime":59581,"nextInTime":59583,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"... In my own experience, more damage has been done to my relationship with my own mother by her incessant need to comment on and voice her opinion of every","messageBody":"<div id=\"ygrps-yiv-249200013\">k &lt;katherand@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Even if so, I don&#39;t have to say everything I&#39;m thinking. I don&#39;t have<br/>\n&gt; to explain. That&#39;s a choice. I can say and see that certain<br/>\n&gt; preferences and tastes which Karl has are cool even if they aren&#39;t<br/>\n&gt; something I would choose for myself.<br/>\n&gt; <br/>\n&gt; So *what.* Not trying to be rude but opinions don&#39;t always matter.<br/>\n<br/>\n<br/>\n </span></blockquote>In my own experience, more damage has been done to my relationship with my own mother by her incessant need to comment on and voice her opinion of every detail around her than by her doing most anything else.  Most every sentence has some sort of judgement attached to it -- &quot;oh that&#39;s good, that&#39;s bad, that&#39;s right, that&#39;s ugly, that&#39;s pretty, that&#39;s wrong, that&#39;s okay....&quot;  Her inability to speak without judgement words long ago destroyed any possibility of trust because her opinions carry the weight of final judgement.  Her &quot;radical honesty,&quot; while completely justified and &quot;just who she is&quot; in her opinion, sets herself up as having the ultimate say in judging everything around her.  There is no room to have a differing opinion -- because her&#39;s is right, anything different must be wrong.  I learned very early not to tell her anything about my thoughts or life, because she couldn&#39;t help but blurt out her thoughts and run over mine.<br/>\n<br/>\nBeing &quot;honest&quot; or &quot;radically honest&quot; has it&#39;s place -- but running around spewing diarrhea of the mouth does nothing to enhance anyone&#39;s life.  Thoughtful pause and attention to what is important to those you love will go much further in building trust.<br/>\n<br/>\nI really appreciate that phrase, &quot;SO WHAT?&quot;  That simple phrase has been a very helpful self-edit for my own journey of choosing what to say.  If I can stop and think &quot;so what does it matter if I interject my opinion here,&quot; the results are usually more condusive to relationship building/maintaining. <br/>\n<br/>\nLinda</div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Radical honesty","postDate":"1297147025","msgId":59577,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9QWhmVThWZ0JyWEVjdVQ1azl0VWtSU2RLTW1LTStTaWlxQ0hFRkBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":59572,"nextInTopic":59582,"prevInTime":59576,"nextInTime":59578,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"Just reading to him and letting him draw his own conclusions and letting him ask questions if he feels the need to is probably a better way. If he felt ","messageBody":"<div id=\"ygrps-yiv-1432146651\">Just reading to him and letting him draw his own conclusions and letting him<br/>\nask questions if he feels the need to is probably a better way. If he felt<br/>\nsomething not right and it is important to him he might ask you. then you<br/>\ncould initiate a dialogue on what you thought of the dad and son<br/>\nrelationship or other things. To simply put across your judgement on the<br/>\nbook and its characters might be an impediment to his own thinking and<br/>\nimagination skills.<br/>\n<br/>\nWhen I watch films with my children, I do not deliberately put across my<br/>\nopinion. I let them absorb the things and keep answering their queries as<br/>\nwhen they have some. Even sometimes later on my daughter asks me stuff about<br/>\ncertain scenes or relationships that we saw in a film. I simply answer them<br/>\nwhen she asks.<br/>\n<br/>\nAnd with my son too I try and introduce more material in terms of stories,<br/>\nfilms or internet stuff on similar things and feed his curiosity.<br/>\n<br/>\nDola<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOn Tue, Feb 8, 2011 at 2:20 AM, BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a><br/>\n<blockquote><span title=\"ireply\"> &gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; OK I just read a post someone posted a link to on Facebook about Radical<br/>\n&gt; Honesty<br/>\n&gt; and I don&#39;t agree with it.<br/>\n&gt; It does bring me to what happened this weekend in my home.<br/>\n&gt;<br/>\n&gt; I really like honesty and I value it.<br/>\n&gt; But here   is what went on.<br/>\n&gt; I started reading the book Rune Warrior to my son as a friend said it was<br/>\n&gt; awesome and her son<br/>\n&gt;<br/>\n&gt; loved it ( our kids are the same age)<br/>\n&gt; The book is about a kid that grows up to be a warrior in the time of the<br/>\n&gt; Vikings.<br/>\n&gt; The book is very interesting and it is a good read but there are things<br/>\n&gt; that<br/>\n&gt; really bother me<br/>\n&gt; in the relationship between the dad and the boy and<br/>\n&gt; Saturday night I blurted out that I did not like some things in the book<br/>\n&gt; like<br/>\n&gt; the way the father sometimes treats his son and shames him.<br/>\n&gt; My son really really cherishes laying down and me reading to him. Its<br/>\n&gt; really<br/>\n&gt; something he loves and looks forward too.<br/>\n&gt; Well last night he did not want to read the book and that was surprising<br/>\n&gt; and I<br/>\n&gt; could  feel the night before that me saying I did not like the book<br/>\n&gt;<br/>\n&gt; was not the way to go. He was loving the book.<br/>\n&gt; I remember when I was  a little girl I picked out a doll outfit and my mom<br/>\n&gt; called it plain and not pretty and why did I not pick up something as<br/>\n&gt; colorful<br/>\n&gt; as<br/>\n&gt; my sister. It took me until adulthood almost to get over it.<br/>\n&gt; That is one of the reasons I disagree with this article about Radical<br/>\n&gt; Honesty<br/>\n&gt; and saying things even if .<br/>\n&gt; It may have been that beiges were not what my mom liked and she was honest<br/>\n&gt; to<br/>\n&gt; tell me but it did so much damage.<br/>\n&gt;  I radical honesty is  not something people should be telling parents to<br/>\n&gt; do.<br/>\n&gt; Yes be honesty but  do we need to tell  our daughter that indeed the dress<br/>\n&gt; she<br/>\n&gt; loves is very uggly?<br/>\n&gt;<br/>\n&gt; Am I wrong?<br/>\n&gt;<br/>\n&gt; Here is the link to the article/blog post<br/>\n&gt;<br/>\n&gt;  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.enjoyparenting.com/daily-groove/radical-honesty\">http://www.enjoyparenting.com/daily-groove/radical-honesty</a><br/>\n&gt; Alex Polikowsky<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Radical honesty","postDate":"1297143404","msgId":59572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMDI2NC44NjEyMS5xbUB3ZWI4MTUwNy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDMyNDJEOUYxLTFCRjgtNDFERS1CNTg1LTE0RkE0NDQ5MDlGMEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+IDxENjlBMEZGRS1CMjIyLTRBOTAtQTQzRC0wODk5QTRGNzIzNTBAU2FuZHJhZG9kZC5jb20+IDwzMDk0MTAuMjAxNDUucW1Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPiA8MzI0MkQ5RjEtMUJGOC00MURFLUI1ODUtMTRGQTQ0NDkwOUYwQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":59571,"nextInTopic":59577,"prevInTime":59571,"nextInTime":59573,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"I do not like Berenstein Bears either. Luckly my kids never cared for it. I do not like Olivia at all. Gigi used to like it and watch it a NickJr. I could ","messageBody":"<div id=\"ygrps-yiv-741474933\">I do not like Berenstein Bears either. Luckly my kids never cared for it.<br/>\nI do not like Olivia at all. Gigi used to like it and watch it a NickJr. I could <br/>\nnot stand it but I <br/>\n<br/>\nwas pretty good at keeping my mouth shut.<br/>\nI still don&#39;t like Olivia but Gigi is into Dragon Ball Z , Avatar the Last <br/>\nAirbender and Fairly Odd Parents <br/>\n<br/>\nand those are pretty great to me.<br/>\n Thank Goodness the Olivia  fase was short and not intense. I never went out of <br/>\nthe way to by Olivia stuff but I did show Gigi some online games <br/>\n<br/>\nshe liked and played.<br/>\nIf she had asked I would have gotten her videos and books or whatever she <br/>\nwanted.<br/>\nNow I know everything about Dragon Ball Z and Avatar ! Those I love it as much <br/>\nas my kids do!<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Radical honesty","postDate":"1297129813","msgId":59571,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyNDJEOUYxLTFCRjgtNDFERS1CNTg1LTE0RkE0NDQ5MDlGMEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDMwOTQxMC4yMDE0NS5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+IDxENjlBMEZGRS1CMjIyLTRBOTAtQTQzRC0wODk5QTRGNzIzNTBAU2FuZHJhZG9kZC5jb20+IDwzMDk0MTAuMjAxNDUucW1Ad2ViODE1MDgubWFpbC5tdWQueWFob28uY29tPg=="},"prevInTopic":59570,"nextInTopic":59572,"prevInTime":59570,"nextInTime":59572,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"I couldn t stand Berenstain Bears, and didn t come to feel differently later.  I just didn t keep those that came through the house and never bought any. Had","messageBody":"<div id=\"ygrps-yiv-1599316530\">I couldn&#39;t stand Berenstain Bears, and didn&#39;t come to feel differently later.  I just didn&#39;t keep those that came through the house and never bought any.<br/>\n<br/>\nHad one of my children loved them, I would&#39;ve probably sucked it up.  I didn&#39;t need to.<br/>\n<br/>\nI was reading aloud to Holly one, something from the 1960&#39;s, reading it because it was set in New Mexico.  One of the characters was from one of the Pueblos here, and that would&#39;ve been cool, except they kept referring to him as &quot;the Indian...&quot; in that they would say &quot;Bobby came out of the store and his father and the Indian were there.&quot;  They weren&#39;t using his name, in narrative reference like that.  I said it was written for young kids who knew nothing about New Mexico, and it was quite a long time ago, and Holly said it was too irritating, and why did they do that, so we abandoned the reading.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Radical honesty","postDate":"1297121151","msgId":59570,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3MzY2OTguMTI5NzEyMTE1MTQ1NC5KYXZhTWFpbC5yb290QHdhbXVpLWp1bmUuYXRsLnNhLmVhcnRobGluay5uZXQ+"},"prevInTopic":59569,"nextInTopic":59571,"prevInTime":59569,"nextInTime":59571,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"... It s not at all unusual for my kids to ask me if I like something.  I mean, it s not every day, but it comes up about bands or art, etc. ... I almost never","messageBody":"<div id=\"ygrps-yiv-1774507558\">-----Original Message-----<br/>\n<blockquote><span title=\"ireply\"> &gt;From: k &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:katherand@...\">katherand@...</a>&gt;<br/>\n<br/>\n&gt;I&#39;m trying to remember if Karl has EVER asked me if I like something.<br/>\n&gt;..... Still thinking.<br/>\n<br/>\n </span></blockquote>It&#39;s not at all unusual for my kids to ask me if I like something.  I mean, it&#39;s not every day, but it comes up about bands or art, etc.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I&#39;ve blurted out things and been sorry. &lt;<br/>\n<br/>\n </span></blockquote>I almost never give an unsolicited negative opinion.  I&#39;m never going to walk into a room where my child is enjoying a cd and tell him I don&#39;t like it.  What would be the point of that?<br/>\n<br/>\nMichelle<br/>\n<br/>\nWife to Bob<br/>\nMomma to George (12), Theo (9), Eli (6), and Oliver (18 mo)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Radical honesty","postDate":"1297120285","msgId":59569,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGltcXpKMng2MDRaY2dKPWUtYjBTS0xDeEU4ZmlQa2lfTjhmVFgzQ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDQ5NDEwNzEuMTI5NzExMzcxNjMzMS5KYXZhTWFpbC5yb290QHdhbXVpLWp1bmUuYXRsLnNhLmVhcnRobGluay5uZXQ+","referencesHeader":"PDQ5NDEwNzEuMTI5NzExMzcxNjMzMS5KYXZhTWFpbC5yb290QHdhbXVpLWp1bmUuYXRsLnNhLmVhcnRobGluay5uZXQ+"},"prevInTopic":59568,"nextInTopic":59570,"prevInTime":59568,"nextInTime":59570,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"... I m trying to remember if Karl has EVER asked me if I like something. ..... Still thinking. Even if so, I don t have to say everything I m thinking. I","messageBody":"<div id=\"ygrps-yiv-1567742230\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;I think, too, that if a child asks our opinion, the only way they can trust when we tell them we truly like something is if they know that we&#39;ll tell them when we don&#39;t.  It&#39;s nuanced, of course.  I don&#39;t see ever telling my child I didn&#39;t like something they made...but I can see myself expressing a preference among the things they made.&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>I&#39;m trying to remember if Karl has EVER asked me if I like something.<br/>\n..... Still thinking.<br/>\n<br/>\nEven if so, I don&#39;t have to say everything I&#39;m thinking. I don&#39;t have<br/>\nto explain. That&#39;s a choice. I can say and see that certain<br/>\npreferences and tastes which Karl has are cool even if they aren&#39;t<br/>\nsomething I would choose for myself.<br/>\n<br/>\nSo *what.* Not trying to be rude but opinions don&#39;t always matter.<br/>\n<br/>\nI&#39;ve blurted out things and been sorry. I&#39;m trying to remember when<br/>\nI&#39;ve kept quiet and been sorry. Sometimes I&#39;ve been lax when I didn&#39;t<br/>\nsee what someone was asking, and then it looked like I was<br/>\ncommunicating with silence something that I wasn&#39;t trying to &quot;say.&quot;<br/>\nBut blurting out things is different from that situation.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Radical honesty","postDate":"1297117932","msgId":59568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMwOTQxMC4yMDE0NS5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PEQ2OUEwRkZFLUIyMjItNEE5MC1BNDNELTA4OTlBNEY3MjM1MEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+IDxENjlBMEZGRS1CMjIyLTRBOTAtQTQzRC0wODk5QTRGNzIzNTBAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":59566,"nextInTopic":59569,"prevInTime":59567,"nextInTime":59569,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"Michelle , it was less the comparison and more about a kid who thinks mom is great and has awesome taste telling me my choice ( taste) was not good. I think","messageBody":"<div id=\"ygrps-yiv-1601784325\">Michelle ,<br/>\nit was less the comparison and more about a kid who thinks mom is great and has <br/>\nawesome taste<br/>\ntelling me my choice ( taste) was not good.<br/>\nI think if a child asks &quot; do you like this band?&quot; you can be<br/>\n honest and say  &quot;hey not my  style of music &quot; but to<br/>\njust go to your kid that loves it and tell them &quot; I don;t like this band <br/>\nbecause I think their music sucks and is a lot of noise&quot; ( and that could be <br/>\nhonest)<br/>\nis that I am not in agreement.<br/>\nMany kids have their parents in a pedestal and when a parent criticizes <br/>\nsomething they love it can be hurtful. It is different than <br/>\n<br/>\nhaving different taste.<br/>\nMy kids have asked me if I like candy and I tell them I don;t really care for <br/>\nthem. They  have asked me to taste some of their candy and they were horrible to <br/>\nme.<br/>\nI don;t tell them their favorite candy is horrible. I tell them I don;t really <br/>\nlike it but hey people like different things and if they like it great!<br/>\nNo the same and maybe that is what I am getting at.<br/>\nSandra,<br/>\nYes I was frustrated and had been since the first chapter, shaming and teasing <br/>\nand stuff that bothered me.<br/>\nI should have just read and enjoyed that my son was loving the book.<br/>\nI used to not like Thomas The Tank Engine right when MD fell in love with it but <br/>\nI streched my comfort zone and for a while<br/>\nI enjoyed it because of his joy. Little by little I became a Thomas fan and I am <br/>\na huge fan now, because of MD<br/>\nso I am usually open to looking at things my kids like and enjoying them just <br/>\nbecause my kids do.<br/>\nI sure should just have read the book. <br/>\nI think it will all be fine tonight.<br/>\nSchuyler,<br/>\nYes yes yes! I so agree with you. This ring pop maybe delicious to Gigi but <br/>\nfor me is pretty horrible. Two differnt truths that one has to respect without <br/>\nthe parent<br/>\nbeing radically honesty!<br/>\n <br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Radical honesty","postDate":"1297115557","msgId":59566,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ2OUEwRkZFLUIyMjItNEE5MC1BNDNELTA4OTlBNEY3MjM1MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":59565,"nextInTopic":59568,"prevInTime":59565,"nextInTime":59567,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"-=- The book is very interesting and it is a good read but there are things that really bother me in the relationship between the dad and the boy and Saturday","messageBody":"<div id=\"ygrps-yiv-435677642\">-=-<br/>\nThe book is very interesting and it is a good read but there are things that <br/>\nreally bother me<br/>\nin the relationship between the dad and the boy and<br/>\nSaturday night I blurted out that I did not like some things in the book like <br/>\nthe way the father sometimes treats his son and shames him.-=-<br/>\n<br/>\nIt sounds like you were frustrated. You describe it as &quot;blurting out&quot; so maybe you could have discharged some of your frustration by saying things more like &quot;I&#39;m glad most dads aren&#39;t as mean as that these days,&quot; or something, but overlaying too much modern sensibility on historical situations can be really distracting.   It might be better to just read it, let it digest, and let him draw his own conclusions.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Radical honesty","postDate":"1297114065","msgId":59564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYyOTQ5NS4xMDE0NS5xbUB3ZWI4NjIwMi5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+","referencesHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":59563,"nextInTopic":59565,"prevInTime":59563,"nextInTime":59565,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"There is probably more than one truth. The truth that you didn t like the book and the truth that you liked that your son liked the book. You don t have to ","messageBody":"<div id=\"ygrps-yiv-314983603\">There is probably more than one truth. The truth that you didn&#39;t like the book <br/>\nand the truth that you liked that your son liked the book. You don&#39;t have to <br/>\ntell all the truth all the time. And, sometimes, by looking at the side of the <br/>\ntruth that makes everyone feel better, when possible, you can shift your truth <br/>\nfrom, for example, &quot;I hate the book&quot; to &quot;I love reading the book with you&quot;. <br/>\n<br/>\n<br/>\nTruth is variable. Sometimes what feels true one moment doesn&#39;t feel nearly like <br/>\nthe truth in a different moment. Truth is different from facts, and sometimes <br/>\neven facts can shift like sand. I&#39;m not sure what Scott Noelle is getting at in <br/>\nhis Radical Honesty post, but I wouldn&#39;t worry to much about trying to find ways <br/>\nto shift your comfort zone as far out as you possibly can to expand your truth <br/>\nto one that aligns with MD&#39;s more. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Monday, 7 February, 2011 20:50:59<br/>\nSubject: [AlwaysLearning] Radical honesty<br/>\n<br/>\nOK I just read a post someone posted a link to on Facebook about Radical Honesty <br/>\n<br/>\nand I don&#39;t agree with it.<br/>\nIt does bring me to what happened this weekend in my home.<br/>\n<br/>\nI really like honesty and I value it.<br/>\nBut here   is what went on.<br/>\nI started reading the book Rune Warrior to my son as a friend said it was <br/>\nawesome and her son <br/>\n<br/>\nloved it ( our kids are the same age)<br/>\nThe book is about a kid that grows up to be a warrior in the time of the <br/>\nVikings.<br/>\nThe book is very interesting and it is a good read but there are things that <br/>\nreally bother me<br/>\nin the relationship between the dad and the boy and<br/>\nSaturday night I blurted out that I did not like some things in the book like <br/>\nthe way the father sometimes treats his son and shames him.<br/>\nMy son really really cherishes laying down and me reading to him. Its really <br/>\nsomething he loves and looks forward too.<br/>\nWell last night he did not want to read the book and that was surprising and I <br/>\ncould  feel the night before that me saying I did not like the book <br/>\n<br/>\nwas not the way to go. He was loving the book.<br/>\nI remember when I was  a little girl I picked out a doll outfit and my mom <br/>\ncalled it plain and not pretty and why did I not pick up something as colorful <br/>\nas<br/>\nmy sister. It took me until adulthood almost to get over it.<br/>\nThat is one of the reasons I disagree with this article about Radical Honesty <br/>\nand saying things even if .<br/>\nIt may have been that beiges were not what my mom liked and she was honest to <br/>\ntell me but it did so much damage.<br/>\n I radical honesty is  not something people should be telling parents to do.<br/>\nYes be honesty but  do we need to tell  our daughter that indeed the dress she <br/>\nloves is very uggly?<br/>\n<br/>\nAm I wrong?<br/>\n<br/>\nHere is the link to the article/blog post<br/>\n<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.enjoyparenting.com/daily-groove/radical-honesty\">http://www.enjoyparenting.com/daily-groove/radical-honesty</a><br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Radical honesty","postDate":"1297113716","msgId":59565,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ5NDEwNzEuMTI5NzExMzcxNjMzMS5KYXZhTWFpbC5yb290QHdhbXVpLWp1bmUuYXRsLnNhLmVhcnRobGluay5uZXQ+"},"prevInTopic":59564,"nextInTopic":59566,"prevInTime":59564,"nextInTime":59566,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"... I think honesty is completely situational.  There is absolutely nothing to be gained, nor could there be any relationship in the world that lasted longer","messageBody":"<div id=\"ygrps-yiv-43388105\">-----Original Message-----<br/>\n<blockquote><span title=\"ireply\"> &gt;From: BRIAN POLIKOWSKY &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:polykowholsteins@...\">polykowholsteins@...</a>&gt;<br/>\n<br/>\n&gt; I radical honesty is  not something people should be telling parents to do.<br/>\n&gt;Yes be honesty but  do we need to tell  our daughter that indeed the dress she <br/>\n&gt;loves is very uggly?<br/>\n&gt;<br/>\n&gt;Am I wrong?<br/>\n<br/>\n </span></blockquote>I think honesty is completely situational.  There is absolutely nothing to be gained, nor could there be any relationship in the world that lasted longer than a day, if we equate honesty with blurting out everything we think and feel all the time.<br/>\n<br/>\nI&#39;ll say, though, that I think it&#39;s okay to tell our kids that we have differing tastes from them.  If my kid likes a band I don&#39;t happen to, I can say that that sort of music isn&#39;t really my thing (though I&#39;d be open to listening to a particular favorite song).  But I can&#39;t believe that my not liking heavy metal, if said without any judgment on someone who *does* like it, is going to be a lasting wound.<br/>\n<br/>\nSounds to me like what your mom did was not just express a different taste, but then compare you unfavorably to your sister. Do you think that it was more the *way* that she disagreed with your taste rather than just having a different taste that was so painful?  Although, in that situation, I do think it would have been kinder just to say she liked it.  <br/>\n<br/>\nI think, too, that if a child asks our opinion, the only way they can trust when we tell them we truly like something is if they know that we&#39;ll tell them when we don&#39;t.  It&#39;s nuanced, of course.  I don&#39;t see ever telling my child I didn&#39;t like something they made...but I can see myself expressing a preference among the things they made. <br/>\n<br/>\n<br/>\nMichelle<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWife to Bob<br/>\nMomma to George (12), Theo (9), Eli (6), and Oliver (18 mo)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Radical honesty","postDate":"1297111859","msgId":59563,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU0NjAxNy4xNzY0NC5xbUB3ZWI4MTUwMS5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":59564,"prevInTime":59562,"nextInTime":59564,"topicId":59563,"numMessagesInTopic":0,"msgSnippet":"OK I just read a post someone posted a link to on Facebook about Radical Honesty and I don t agree with it. It does bring me to what happened this weekend in","messageBody":"<div id=\"ygrps-yiv-1411714156\">OK I just read a post someone posted a link to on Facebook about Radical Honesty <br/>\nand I don&#39;t agree with it.<br/>\nIt does bring me to what happened this weekend in my home.<br/>\n<br/>\nI really like honesty and I value it.<br/>\nBut here   is what went on.<br/>\nI started reading the book Rune Warrior to my son as a friend said it was <br/>\nawesome and her son <br/>\n<br/>\nloved it ( our kids are the same age)<br/>\nThe book is about a kid that grows up to be a warrior in the time of the <br/>\nVikings.<br/>\nThe book is very interesting and it is a good read but there are things that <br/>\nreally bother me<br/>\nin the relationship between the dad and the boy and<br/>\nSaturday night I blurted out that I did not like some things in the book like <br/>\nthe way the father sometimes treats his son and shames him.<br/>\nMy son really really cherishes laying down and me reading to him. Its really <br/>\nsomething he loves and looks forward too.<br/>\nWell last night he did not want to read the book and that was surprising and I <br/>\ncould  feel the night before that me saying I did not like the book <br/>\n<br/>\nwas not the way to go. He was loving the book.<br/>\nI remember when I was  a little girl I picked out a doll outfit and my mom <br/>\ncalled it plain and not pretty and why did I not pick up something as colorful <br/>\nas<br/>\nmy sister. It took me until adulthood almost to get over it.<br/>\nThat is one of the reasons I disagree with this article about Radical Honesty <br/>\nand saying things even if .<br/>\nIt may have been that beiges were not what my mom liked and she was honest to <br/>\ntell me but it did so much damage.<br/>\n I radical honesty is  not something people should be telling parents to do.<br/>\nYes be honesty but  do we need to tell  our daughter that indeed the dress she <br/>\nloves is very uggly?<br/>\n<br/>\nAm I wrong?<br/>\n<br/>\nHere is the link to the article/blog post<br/>\n<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.enjoyparenting.com/daily-groove/radical-honesty\">http://www.enjoyparenting.com/daily-groove/radical-honesty</a><br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":59573,"nextTopicId":59601}}