{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] NEWS Gulf War Contamination","postDate":"1047833955","msgId":61219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBOUExNzkzLjE1NTBDJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDUuMS4wLjE0LjAuMjAwMzAzMTUxNTM3NTUuMDFiY2ZlYTBAbWFpbC5keWtlbWEubmV0Pg=="},"prevInTopic":61205,"nextInTopic":0,"prevInTime":61218,"nextInTime":61220,"topicId":61194,"numMessagesInTopic":0,"msgSnippet":"In case there s still some question about this, yes, I did ask list members to refrain from discussing the situation with Iraq. Any good that could come from","messageBody":"<div id=\"ygrps-yiv-1909707551\">In case there&#39;s still some question about this, yes, I did ask list members<br/>\nto refrain from discussing the situation with Iraq.<br/>\n<br/>\nAny good that could come from discussing the rightness or wrongness of it<br/>\nwill be far out weighed by the hurt it could do to families whose loved ones<br/>\ncould be involved.<br/>\n<br/>\nThis list shouldn&#39;t be anyone&#39;s be all and end all resource for interacting<br/>\nwith their kids. If anyone needs resources to discuss the situation with<br/>\ntheir kids there are loads of places on the internet.<br/>\n<br/>\nJoyce<br/>\nUnschooling-dotcom moderator</div>","specialLinks":[]},{"userId":78134331,"authorName":"genant2@aol.com","from":"genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] NEWS Gulf War Contamination","postDate":"1047773309","msgId":61205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY0LjJhNWU3NTJjLjJiYTUxYTdkQGFvbC5jb20+"},"prevInTopic":61204,"nextInTopic":61219,"prevInTime":61204,"nextInTime":61206,"topicId":61194,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/15/03 6:51:19 PM Eastern Standard Time, heidi@dykema.net ... I thought I read a note from Joyce a while ago that said we were going to ","messageBody":"<div id=\"ygrps-yiv-462993064\">In a message dated 3/15/03 6:51:19 PM Eastern Standard Time, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:heidi@...\">heidi@...</a> <br/>\nwrites:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It may not be helping you specifically, but it&#39;s helping some of us <br/>\n&gt; unschool.  In our family, the social and political ramifications of what&#39;s <br/>\n&gt; going on in the world is talked about with our kids.  I knew about some <br/>\n&gt; non-soldier-friendly things the armed forces were doing (like anthrax <br/>\n&gt; vaccines), but this was news to me.<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I thought I read a note from Joyce a while ago that said we were going to <br/>\nrefrain from War talk.  As there are many here that have family directly <br/>\ninvolved and there are so many issues and opinions.  We really don&#39;t want to <br/>\nhave hurt feelings all around and, from other lists I have been on, War talk <br/>\nusually leads to hurt feelings.  <br/>\nPam G.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":50009731,"authorName":"Heidi Wordhouse-Dykema","from":"Heidi Wordhouse-Dykema &lt;heidi@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] NEWS Gulf War Contamination","postDate":"1047772241","msgId":61204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4wLjE0LjAuMjAwMzAzMTUxNTM3NTUuMDFiY2ZlYTBAbWFpbC5keWtlbWEubmV0Pg==","inReplyToHeader":"PEJBOTk1MUFFLjIxM0QlYWJ0bGVvQGVhcnRobGluay5uZXQ+","referencesHeader":"PDEwNDc3NDc2NDAuODUwLjI4MDk5Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":61201,"nextInTopic":61205,"prevInTime":61203,"nextInTime":61205,"topicId":61194,"numMessagesInTopic":0,"msgSnippet":"(variously snipped) ... It may not be helping you specifically, but it s helping some of us unschool.  In our family, the social and political ramifications of","messageBody":"<div id=\"ygrps-yiv-1435698013\">(variously snipped)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; The War Against Ourselves<br/>\n&gt; &gt; An Interview with Major Doug Rokke<br/>\n&gt;Why are you sending this to us?  It doesn&#39;t help me unschool.<br/>\n<br/>\n </span></blockquote>It may not be helping you specifically, but it&#39;s helping some of us <br/>\nunschool.  In our family, the social and political ramifications of what&#39;s <br/>\ngoing on in the world is talked about with our kids.  I knew about some <br/>\nnon-soldier-friendly things the armed forces were doing (like anthrax <br/>\nvaccines), but this was news to me.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I regret reading it, but scanning through the digests, I don&#39;t always catch<br/>\n&gt;the subject line.<br/>\n<br/>\n </span></blockquote>Yes, if one is sensitive to a particular topic, it is always good to read <br/>\nthe subject lines!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;My husband is being sent to the Middle East, probably within the next month.<br/>\n&gt;I do NOT need to read this kind of stuff right now.<br/>\n<br/>\n </span></blockquote>Well, it&#39;s your perogative to think it&#39;s not helpful in your particular <br/>\nsituation, but if *my* husband were to be in a hostile environment where he <br/>\nwould have to make decisions over touch-don&#39;t touch possibly contaminated <br/>\nthings, I&#39;d sure as heck want him to have this particular information.  It <br/>\nmight save his life and the lives of the people in his platoon.  Or, it <br/>\ncould make us examine if we shouldn&#39;t store a little &#39;manly essence&#39; in <br/>\ncase we want healthy future children and he returns contaminated.  The <br/>\nability to make those kinds of decisions is worth a little discomfort any <br/>\nday of the week!<br/>\nMy opinion and it needn&#39;t be anyone elses.<br/>\nHeidiWD</div>","specialLinks":[]},{"userId":39764976,"authorName":"Alan & Brenda Leonard","from":"Alan & Brenda Leonard &lt;abtleo@...&gt;","profile":"abtleo","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] NEWS Gulf War Contamination","postDate":"1047761820","msgId":61201,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBOTk1MUFFLjIxM0QlYWJ0bGVvQGVhcnRobGluay5uZXQ+","inReplyToHeader":"PDEwNDc3NDc2NDAuODUwLjI4MDk5Lm0xMkB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":61194,"nextInTopic":61204,"prevInTime":61200,"nextInTime":61202,"topicId":61194,"numMessagesInTopic":0,"msgSnippet":"... Why are you sending this to us?  It doesn t help me unschool.  And it hurt. I regret reading it, but scanning through the digests, I don t always catch the","messageBody":"<div id=\"ygrps-yiv-114127982\">3/15/03 18:00:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; The War Against Ourselves<br/>\n&gt; <br/>\n&gt; An Interview with Major Doug Rokke<br/>\n<br/>\n </span></blockquote>Why are you sending this to us?  It doesn&#39;t help me unschool.  And it hurt.<br/>\nI regret reading it, but scanning through the digests, I don&#39;t always catch<br/>\nthe subject line.  And the point isn&#39;t very clear until you&#39;re well into it.<br/>\n<br/>\nMy husband is being sent to the Middle East, probably within the next month.<br/>\nI do NOT need to read this kind of stuff right now.  Send me unschooling<br/>\nstories instead.<br/>\n<br/>\nbrenda</div>","specialLinks":[]},{"userId":135098343,"authorName":"Peggy","from":"Peggy &lt;durrell@...&gt;","profile":"waptia","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"NEWS Gulf War Contamination","postDate":"1047746018","msgId":61194,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNFNzM1NUUyLjQwMjA1MDJAYWl0YWNjZXNzLmNvbT4="},"prevInTopic":0,"nextInTopic":61201,"prevInTime":61193,"nextInTime":61195,"topicId":61194,"numMessagesInTopic":0,"msgSnippet":"The War Against Ourselves An Interview with Major Doug Rokke http://www.yesmagazine.org/25environmentandhealth/rokke.htm Doug Rokke has a PhD in health physics","messageBody":"<div id=\"ygrps-yiv-836651097\">The War Against Ourselves<br/>\n<br/>\nAn Interview with Major Doug Rokke<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.yesmagazine.org/25environmentandhealth/rokke.htm\">http://www.yesmagazine.org/25environmentandhealth/rokke.htm</a><br/>\n<br/>\nDoug Rokke has a PhD in health physics and was originally trained as a <br/>\nforensic scientist. When the Gulf War started, he was assigned to <br/>\nprepare soldiers to respond to nuclear, biological, and chemical <br/>\nwarfare, and sent to the Gulf. What he experienced has made him a <br/>\npassionate voice for peace, traveling the country to speak out. The <br/>\nfollowing interview was conducted by the director of the Traprock Peace <br/>\nCenter, Sunny Miller, supplemented with questions from YES! editors.<br/>\n<br/>\n<br/>\nQUESTION: Any viewer who saw the war on television had the impression <br/>\nthis was an easy war, fought from a distance and soldiers coming back <br/>\nrelatively unharmed. Is this an accurate picture?<br/>\n<br/>\nROKKE: At the completion of the Gulf War, when we came back to the <br/>\nUnited States in the fall of 1991, we had a total casualty count of 760: <br/>\n294 dead, a little over 400 wounded or ill. But the casualty rate now <br/>\nfor Gulf War veterans is approximately 30 percent. Of those stationed in <br/>\nthe theater, including after the conflict, 221,000 have been awarded <br/>\ndisability, according to a Veterans Affairs (VA) report issued September <br/>\n10, 2002.<br/>\n<br/>\nMany of the US casualties died as a direct result of uranium munitions <br/>\nfriendly fire. US forces killed and wounded US forces.<br/>\n<br/>\nWe recommended care for anybody downwind of any uranium dust, anybody <br/>\nworking in and around uranium contamination, and anyone within a <br/>\nvehicle, structure, or building that’s struck with uranium munitions. <br/>\nThat’s thousands upon thousands of individuals, but not only US troops. <br/>\nYou should provide medical care not only for the enemy soldiers but for <br/>\nthe Iraqi women and children affected, and clean up all of the <br/>\ncontamination in Iraq.<br/>\n<br/>\nAnd it’s not just children in Iraq. It’s children born to soldiers after <br/>\nthey came back home. The military admitted that they were finding <br/>\nuranium excreted in the semen of the soldiers. If you’ve got uranium in <br/>\nthe semen, the genetics are messed up. So when the children were <br/>\nconceived—the alpha particles cause such tremendous cell damage and <br/>\ngenetics damage that everything goes bad. Studies have found that male <br/>\nsoldiers who served in the Gulf War were almost twice as likely to have <br/>\na child with a birth defect and female soldiers almost three times as <br/>\nlikely.<br/>\n<br/>\nQ: You have been a military man for over 35 years. You served in Vietnam <br/>\nas a bombardier and you are still in the US Army Reserves. Now you’re <br/>\ngoing around the country speaking about the dangers of depleted uranium <br/>\n(DU). What made you decide you had to speak publicly about DU?<br/>\n<br/>\nROKKE: Everybody on my team was getting sick. My best friend John Sitton <br/>\nwas dying. The military refused him medical care, and he died. John set <br/>\nup the medical evacuation communication system for the entire theater. <br/>\nThen he got contaminated doing the work.<br/>\n<br/>\nJohn and Rolla Dolph and I were best friends in the civilian world, the <br/>\nmilitary world, forever. Rolla got sick. I personally got the order that <br/>\nsent him to war. We were both activated together. I was given the <br/>\nassignment to teach nuclear, biological, and chemical warfare and make <br/>\nsure soldiers came back alive and safe. I take it seriously. I was sent <br/>\nto the Gulf with this instruction: Bring ‘em back alive. Clear as could <br/>\nbe. But when I got all the training together, all the environmental <br/>\ncleanup procedures together, all the medical directives, nothing happened.<br/>\n<br/>\nMore than 100 American soldiers were exposed to DU in friendly fire <br/>\naccidents, plus untold numbers of soldiers who climbed on and entered <br/>\ntanks that had been hit with DU, taking photos and gathering souvenirs <br/>\nto take home. They didn’t know about the hazards.<br/>\n<br/>\nDU is an extremely effective weapon. Each tank round is 10 pounds of <br/>\nsolid uranium-238 contaminated with plutonium, neptunium, americium. It <br/>\nis pyrophoric, generating intense heat on impact, penetrating a tank <br/>\nbecause of the heavy weight of its metal. When uranium munitions hit, <br/>\nit’s like a firestorm inside any vehicle or structure, and so we saw <br/>\ntremendous burns, tremendous injuries. It was devastating.<br/>\n<br/>\nThe US military decided to blow up Saddam’s chemical, biological, and <br/>\nradiological stockpiles in place, which released the contamination back <br/>\non the US troops and on everybody in the whole region. The chemical <br/>\nagent detectors and radiological monitors were going off all over the <br/>\nplace. We had all of the various nerve agents. We think there were <br/>\nbiological agents, and there were destroyed nuclear reactor facilities. <br/>\nIt was a toxic wasteland. And we had DU added to this whole mess.<br/>\n<br/>\nWhen we first got assigned to clean up the DU and arrived in northern <br/>\nSaudi Arabia, we started getting sick within 72 hours. Respiratory <br/>\nproblems, rashes, bleeding, open sores started almost immediately.<br/>\n<br/>\nWhen you have a mass dose of radioactive particulates and you start <br/>\nbreathing that in, the deposit sits in the back of the pharynx, where <br/>\nthe cancer started initially on the first guy. It doesn’t take a lot of <br/>\ntime. I had a father and son working with me. The father is already dead <br/>\nfrom lung cancer, and the sick son is still denied medical care.<br/>\n<br/>\nQ: Did you suspect what was happening?<br/>\n<br/>\nROKKE: We didn’t know anything about DU when the Gulf War started. As a <br/>\nwarrior, you’re listening to your leaders, and they’re saying there are <br/>\nno health effects from the DU. But, as we started to study this, to go <br/>\nback to what we learned in physics and our engineering—I was a professor <br/>\nof environmental science and engineering—you learn rapidly that what <br/>\nthey’re telling you doesn’t agree with what you know and observe.<br/>\n<br/>\nIn June of 1991, when I got back to the States, I was sick. Respiratory <br/>\nproblems and the rashes and neurological things were starting to show up.<br/>\n<br/>\nQ: Why didn’t you go to the VA with a medical complaint?<br/>\n<br/>\nROKKE: Because I was still in the Army, and I was told I couldn’t file. <br/>\nYou have to have the information that connects your exposure to your <br/>\nservice before you go to the VA. The VA obviously wasn’t going to take <br/>\ncare of me, so I went to my private physician. We had no idea what it <br/>\nwas, but so many good people were coming back sick.<br/>\n<br/>\nThey didn’t do tests on me or my team members. According to the <br/>\nDepartment of Defense’s own guidelines put out in 1992, any excretion <br/>\nlevel in the urine above 15 micrograms of uranium per day should result <br/>\nin immediate medical testing, and when you get up to 250 micrograms of <br/>\ntotal uranium excreted per day, you’re supposed to be under continuous <br/>\nmedical care.<br/>\n<br/>\nFinally the US Department of Energy performed a radiobioassay on me in <br/>\nNovember 1994, while I was director of the Depleted Uranium Project for <br/>\nthe Department of Defense. My excretion rate was approximately 1500 <br/>\nmicrograms per day. My level was 5 to 6 times beyond the level that <br/>\nrequires continuous medical care.<br/>\n<br/>\nBut they didn’t tell me for two and a half years.<br/>\n<br/>\nQ: What are the symptoms of exposure to DU?<br/>\n<br/>\nROKKE: Fibromyalgia. Eye cataracts from the radiation. When uranium <br/>\nimpacts any type of vehicle or structure, uranium oxide dust and pieces <br/>\nof uranium explode all over the place. This can be breathed in or go <br/>\ninto a wound. Once it gets in the body, a portion of this stuff is <br/>\nsoluble, which means it goes into the blood stream and all of your <br/>\norgans. The insoluble fraction stays—in the lungs, for example. The <br/>\nradiation damage and the particulates destroy the lungs.<br/>\n<br/>\nQ: What kind of training have the troops had, who are getting called up <br/>\nright now—the ones being shipped to the vicinity of what may be the next <br/>\nGulf War?<br/>\n<br/>\nROKKE: As the director of the Depleted Uranium Project, I developed a <br/>\n40-hour block of training. All that curriculum has been shelved. They <br/>\nturned what I wrote into a 20-minute program that’s full of distortions. <br/>\nIt doesn’t deal with the reality of uranium munitions.<br/>\n<br/>\nThe equipment is defective. The General Accounting Office verified that <br/>\nthe gas masks leak, the chemical protective suits leak. Unbelievably, <br/>\nDefense Department officials recently said the defects can be fixed with <br/>\nduct tape.<br/>\n<br/>\nQ: If my neighbors are being sent off to combat with equipment and <br/>\ntraining that is inadequate, and into battle with a toxic weapon, DU, <br/>\nwho can speak up?<br/>\n<br/>\nROKKE: Every husband and wife, son and daughter, grandparent, aunt and <br/>\nuncle, needs to call their congressmen and cite these official <br/>\ngovernment reports and force the military to ensure that our troops have <br/>\nadequate equipment and adequate training. If we don’t take care of our <br/>\nAmerican veterans after a war, as happened with the Gulf War, and now <br/>\nwe’re about ready to send them into a war again—we can’t do it. We can’t <br/>\ndo it. It’s a crime against God. It’s a crime against humanity to use <br/>\nuranium munitions in a war, and it’s devastating to ignore the <br/>\nconsequences of war.<br/>\n<br/>\nThese consequences last for eternity. The half life of uranium 238 is <br/>\n4.5 billion years. And we left over 320 tons all over the place in Iraq.<br/>\n<br/>\nWe also bombarded Vieques, Puerto Rico, with DU in preparation for the <br/>\nwar in Kosovo. That’s affecting American citizens on American territory. <br/>\nWhen I tried to activate our team from the Department of Defense <br/>\nresponsible for radiological safety and DU cleanup in Vieques, I was <br/>\ntold no. When I tried to activate medical care, I was told no.<br/>\n<br/>\nThe US Army made me their expert. I went into the project with the total <br/>\nintent to ensure they could use uranium munitions in war, because I’m a <br/>\nwarrior. What I saw as director of the project, doing the research and <br/>\nworking with my own medical conditions and everybody else’s, led me to <br/>\none conclusion: uranium munitions must be banned from the planet, for <br/>\neternity, and medical care must be provided for everyone, not just the <br/>\nUS or the Canadians or the British or the Germans or the French but for <br/>\nthe American citizens of Vieques, for the residents of Iraq, of Okinawa, <br/>\nof Scotland, of Indiana, of Maryland, and now Afghanistan and Kosovo.<br/>\n<br/>\nQ: If your information got out widely, do you think there’s a <br/>\npossibility that the families of those soldiers would beg them to refuse?<br/>\n<br/>\nROKKE: If you’re going to be sent into a toxic wasteland, and you know <br/>\nyou’re going to wear gas masks and chemical protective suits that leak, <br/>\nand you’re not going to get any medical care after you’re exposed to all <br/>\nof these things, would you go? Suppose they gave a war and nobody came. <br/>\nYou’ve got to start peace sometime.<br/>\n<br/>\nQ: It does sound remarkable for someone who has been in the military for <br/>\n35 years to be talking about when peace should begin.<br/>\n<br/>\nROKKE: When I do these talks, especially in churches, I’m reminded that <br/>\nthese religions say, “And a child will lead us to peace.” But if we <br/>\ncontaminate the environment, where will the child come from? The <br/>\nchildren won’t be there. War has become obsolete, because we can’t deal <br/>\nwith the consequences on our warriors or the environment, but more <br/>\nimportant, on the noncombatants. When you reach a point in war when the <br/>\ncontamination and the health effects of war can’t be cleaned up because <br/>\nof the weapons you use, and medical care can’t be given to the soldiers <br/>\nwho participated in the war on either side or to the civilians affected, <br/>\nthen it’s time for peace.<br/>\n<br/>\nFor more information on DU, see the WISE Uranium Project, <br/>\nwww.antenna.nl/wise/uranium/; the National Gulf War Resource Center, <br/>\nwww.ngwrc.org; or Veterans for Common Sense, <br/>\nwww.veteransforcommonsense.org. Sunny Miller’s interview was originally <br/>\nbroadcast on WMFO (Boston) in November 2002 and is available for <br/>\nre-broadcast at www.traprockpeace.org.</div>","specialLinks":[]}],"prevTopicId":61206,"nextTopicId":61224}}