{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Reliance on Experts","postDate":"1073405291","msgId":87990,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3ZC4yNTIxYmFkMy4yZDJjMzc2YkBhb2wuY29tPg=="},"prevInTopic":87963,"nextInTopic":0,"prevInTime":87989,"nextInTime":87991,"topicId":87880,"numMessagesInTopic":0,"msgSnippet":"In a message dated 1/5/04 11:43:08 PM, ecsamhill@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-290766235\">In a message dated 1/5/04 11:43:08 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ecsamhill@...\">ecsamhill@...</a> writes:<br/>\n<br/>\n&lt;&lt;  So a mother or father&#39;s <br/>\nexpertise in knowing their child could be much more important than a <br/>\nresearcher&#39;s expertise in knowing &quot;the field&quot;. &gt;&gt;<br/>\n<br/>\nI think where the statistics can be helpful is when a mother (or more usually <br/>\na father) takes a child in for medical help or counselling for something <br/>\nwhich he&#39;s sure is a serious flaw in his child, and the experts and say <br/>\n&quot;Statistically, your child is well in the range of normal [so leave her alone about it, <br/>\nshe&#39;s fine].&quot;<br/>\n<br/>\nPsychology and Sociology were greatly disparaged and many universities <br/>\nwouldn&#39;t count them as science, but they were social sciences or &quot;soft sciences&quot; <br/>\nbecause their stuff was hard to prove, and I think that&#39;s why they moved from <br/>\nobservation and descriptions of observations and testing more the way unschoolers <br/>\nare testing by doing in a natural environment, to lab-tests and statistics.   <br/>\nInstead of finding how people behave in their natural habitats (as biologists <br/>\nstill do without criticism), they went to laboratory tests where people copy <br/>\npatterns or respond to stimuli (while sitting in a chair in a lab) and then <br/>\nmeasure and chart how they learn and react.  Then they try to apply that to <br/>\nnormal life.  Some things apply much better than others.<br/>\n<br/>\nWhat they don&#39;t study very well is how regular people act in regular <br/>\nsituations.<br/>\n<br/>\nA lot of the school reform studies and educational research done in the 60&#39;s <br/>\nfound some pretty good stuff, but it was pooh-poohed as soft-science nonsense. <br/>\n The arguments against grading, the principle that the way the teacher treats <br/>\na child affects how the child sees himself and moreover that if a teacher is <br/>\ngiven false information about a child, the teacher will react to the <br/>\ndescription instead of the child himself===those studies were pretty awful, because <br/>\nthey used real kids and teachers, and real kids were treated better or worse by <br/>\nreal teachers based on scrambled &quot;test scores&quot; and reports from alleged former <br/>\nteachers (the researchers).   <br/>\n<br/>\nAn argument back against doing away with grades and measures though was that <br/>\nkids in ungraded classrooms were interviewed about who in their class was best <br/>\nin math, who was the best reader, etc, and who needed most help, and the kids <br/>\nknew better than the teacher did, because the teacher was going by <br/>\nperformance on tests and assignments.  But still, not grading didn&#39;t give the kids any <br/>\nanonymity or safety from the judgment of others.  <br/>\n<br/>\nSo I think it&#39;s interesting to know what people have learned about classroom <br/>\nbehavior if one is going to work in a classroom, and it might be helpful even <br/>\nfor people who are going to run big homeschooling groups to be a little aware <br/>\nof interpersonal realities and potential problems, but if each of those <br/>\nstudies and principles is seen as one tiny piece in a huge, changing puzzle it&#39;s <br/>\nmore helpful than if any one of them is seen as The Big News that changes <br/>\nanything.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":2300774,"authorName":"Betsy","from":"Betsy &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Reliance on Experts","postDate":"1073371338","msgId":87963,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNGRkE1OENBLjQwMjAzMDNAZWFydGhsaW5rLm5ldD4=","referencesHeader":"PDE1OS4yYjE0OWRhMC4yZDJiNDU4MEBhb2wuY29tPiA8OTgwNkNGRTgtM0ZENS0xMUQ4LTgyQUEtMDAwQTk1RTI5MkM2QG1hYy5jb20+"},"prevInTopic":87894,"nextInTopic":87990,"prevInTime":87962,"nextInTime":87964,"topicId":87880,"numMessagesInTopic":0,"msgSnippet":"** It is the opposite that is being supported though. Nobody is suggesting dismissing info because it comes from an expert - with degrees or whatever. But when","messageBody":"<div id=\"ygrps-yiv-225262866\">**<br/>\nIt is the opposite that is being supported though. Nobody is suggesting<br/>\ndismissing info because it comes from an expert - with degrees or<br/>\nwhatever. But when it comes to parenting and homeschooling it is good<br/>\nadvice to remain skeptical even WHEN an advice-giver is a credentialed<br/>\nexpert.**<br/>\n<br/>\nI&#39;ve been thinking about this thread off and on today while doing the <br/>\nlaundry, etc.<br/>\n<br/>\nI think a flaw with some types of social sciences is that individuals <br/>\nare transformed into numbers and aggregated together.  From that <br/>\naccumulation of data, conclusions are drawn and then applied back to <br/>\npeople in general.  Particularly in education we see experts (sometimes) <br/>\napplying rules that might be true in general (in the institutional <br/>\nsetting) but that can be far from suitable in an individual case.  For <br/>\nexample, the &quot;best&quot; technique for encouraging reading in a generic 8 <br/>\nyear old might not be best for Esmerelda.<br/>\n<br/>\nThere is so much variation in human personality, taste and manner of <br/>\nthinking that a one-sized-fits-all answer from an expert is not often <br/>\nthe best answer for a given individual.  So a mother or father&#39;s <br/>\nexpertise in knowing their child could be much more important than a <br/>\nresearcher&#39;s expertise in knowing &quot;the field&quot;.<br/>\n<br/>\nBetsy<br/>\n<br/>\nPS  Professional expertise is often filtered through journalists before <br/>\nit reaches the public.  It can certainly be oversimplified and even <br/>\nmisunderstood in this process.  Being misquoted and mangled in the press <br/>\nmay be one reason that &quot;experts&quot; can seem so boneheaded.  But not the <br/>\nonly reason. &lt;g&gt;</div>","specialLinks":[]},{"userId":141316284,"authorName":"pam sorooshian","from":"pam sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Reliance on Experts","postDate":"1073344761","msgId":87894,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk4MDZDRkU4LTNGRDUtMTFEOC04MkFBLTAwMEE5NUUyOTJDNkBtYWMuY29tPg==","inReplyToHeader":"PDE1OS4yYjE0OWRhMC4yZDJiNDU4MEBhb2wuY29tPg==","referencesHeader":"PDE1OS4yYjE0OWRhMC4yZDJiNDU4MEBhb2wuY29tPg=="},"prevInTopic":87880,"nextInTopic":87963,"prevInTime":87893,"nextInTime":87895,"topicId":87880,"numMessagesInTopic":0,"msgSnippet":"... It is the opposite that is being supported though. Nobody is suggesting dismissing info because it comes from an expert - with degrees or whatever. But","messageBody":"<div id=\"ygrps-yiv-48134219\">On Jan 5, 2004, at 2:56 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:marbleface@...\">marbleface@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  Dismissing  any possible source of info simply because it is from an <br/>\n&gt; acknowledged expert<br/>\n&gt; is not helping parents though.<br/>\n<br/>\n </span></blockquote>It is the opposite that is being supported though. Nobody is suggesting <br/>\ndismissing info because it comes from an expert - with degrees or <br/>\nwhatever. But when it comes to parenting and homeschooling it is good <br/>\nadvice to remain skeptical even WHEN an advice-giver is a credentialed <br/>\nexpert.<br/>\n<br/>\nAnd, we&#39;re not talking about just &quot;a person with recognized expertise&quot; <br/>\nbut we&#39;re talking about experts in the sense that they have some kind <br/>\nof degree or credential on which their &quot;expertness&quot; is based.<br/>\n<br/>\n-pam<br/>\nNational Home Education Network<br/>\n&lt;www.NHEN.org&gt;<br/>\nServing the entire homeschooling community since 1999<br/>\nthrough information, networking and public relations.</div>","specialLinks":[]},{"userId":1421182,"authorName":"marbleface@aol.com","from":"marbleface@...","profile":"nanceconfer","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Reliance on Experts","postDate":"1073343360","msgId":87880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1OS4yYjE0OWRhMC4yZDJiNDU4MEBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":87894,"prevInTime":87879,"nextInTime":87881,"topicId":87880,"numMessagesInTopic":0,"msgSnippet":"Sometimes. Sometimes the newbie unschooler might wander in here and gets some reassurance that what she is doing is OK -- from all those experts who got to be","messageBody":"<div id=\"ygrps-yiv-922682653\">Sometimes. Sometimes the newbie unschooler might wander in here and gets some <br/>\nreassurance that what she is doing is OK -- from all those experts who got to <br/>\nbe experts by doing. <br/>\n<br/>\nOr they make their way to enough different places to be able to compare and <br/>\ndecide what is best for them and -- ta da -- some of the different places have <br/>\nexperts who are titled, degreed, published, etc., or none of the above.<br/>\n<br/>\nGiving parents the confidence to sort things out is fantastic imo. Dismissing <br/>\nany possible source of info simply because it is from an acknowledged expert <br/>\nis not helping parents though. Degreed or not, unschoolish or not, they may <br/>\nhave something helpful to say. Which, put together with other info, might help a <br/>\nparent.<br/>\n<br/>\nIf we let our personal experiences (my son was not happy in ps, for instance) <br/>\ncolor our reactions and cause a knee-jerk reaction every time a certain <br/>\nflavor of expert is available, we miss out on a lot.  It&#39;s easy to do, but not <br/>\nhelpful.<br/>\n<br/>\nMy 2 cents -- why not take it all in, evaluate it with confidence, realize <br/>\nthe expert is right or wrong for you, and learn something.<br/>\n<br/>\nToday&#39;s email brought this whole series of posts on another list from a Mom <br/>\nconcerned about her parenting style. She is, for one thing, protective of her <br/>\nson being outside alone. Now, it does her no good for me or some expert to <br/>\ndecree that she should or should not allow her son to be outside alone. What she <br/>\nfound helpful was the range of responses she received -- she seemed to be <br/>\ngenuinely helped by hearing a lot of different takes on how other parents handle <br/>\nthings. None of the positions was dismissed as being from an expert -- or not -- <br/>\nand therefore worthy. Now, and as she goes along, she can carve her own <br/>\nplace. <br/>\n<br/>\nOTOH, we may individually decide never to listen to an expert with a degree. <br/>\nThat may suit us for various reasons. We may decide that anything that isn&#39;t <br/>\ncompletely counterculture is necessarily wrong -- and avoid anything from a <br/>\nmainstream pov. Or we may come to a list like this and only want to hear <br/>\naffirmations that we are allowed to ignore experts. Poof -- you are given permission <br/>\nby a list to do what you want to do. <br/>\n<br/>\nOver-reliance on experts, lack of confidence, damaging conformity -- all bad <br/>\nthings, all things to watch out for. If some of us choose to read the whole <br/>\nbody of information available though -- I don&#39;t see the problem with that. <br/>\nLimiting each other as we try to figure things out doesn&#39;t seem helpful to me.<br/>\n<br/>\nGuess that&#39;s more than 2 cents. :)<br/>\n<br/>\nNance<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nIn a message dated 1/4/2004 10:50:34 PM Eastern Standard Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> writes:<br/>\nMessage: 18<br/>\n   Date: Sun, 4 Jan 2004 19:07:46 -0800<br/>\n   From: pam sorooshian &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:pamsoroosh@...\">pamsoroosh@...</a>&gt;<br/>\nSubject: Reliance on Experts (Was - Re: The lovely Jane Jacobs)<br/>\n<br/>\nWe live in an era in which parents hardly trust themselves at all - <br/>\ndon&#39;t rely on their own good sense, their own experience, their love <br/>\nfor their own children, their own traditions, their own values, the <br/>\ngentle examples of more experienced friends and relatives, but instead <br/>\nare &quot;parenting advice&quot; junkies, spending millions of dollars on <br/>\nparenting classes, books, magazines, counselors, etc, looking to <br/>\nexperts to help them make every possible decision. Over-reliance on <br/>\nexperts makes parents feel they are never doing enough, never making <br/>\ngood enough decisions. Parents are persuaded by first one expert and <br/>\nthen another. Their approach to parenting does not come from deeply <br/>\nheld personal beliefs about what it means to care for and rear a new <br/>\nhuman being - instead they try out the newest parenting fads, often one <br/>\nafter another, with increasing desperation when they don&#39;t &quot;work&quot; (kids <br/>\nare still kids with their own individual strengths and weaknesses) and <br/>\nthey feel like failures when they don&#39;t feel the deep satisfaction that <br/>\nthe experts tell them parenting ought to bring them. Relying on experts <br/>\nmakes parents fearful and anxious about doing the wrong thing since <br/>\nthey are &quot;not experts&quot; themselves. It drains the confidence from <br/>\nparents and the joy from family life.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":22486,"nextTopicId":87998}}