{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Literacy Question","postDate":"1263239737","msgId":113355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgwNTgxMy4zMTkxMy5xbUB3ZWIxMTA0MDgubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDJCQkRGNjQ2LThGNjYtNDcwQS05NkJGLTY1Mzc3NTk1QkVGNUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhpMzFwayt0ZDRjQGVHcm91cHMuY29tPiA8MkJCREY2NDYtOEY2Ni00NzBBLTk2QkYtNjUzNzc1OTVCRUY1QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":113354,"nextInTopic":0,"prevInTime":113354,"nextInTime":113356,"topicId":113327,"numMessagesInTopic":0,"msgSnippet":"****It s possible that some people are unable to make any sense of visual squiggles. They can learn from audio books then, or movies, or TV, or going places","messageBody":"<div id=\"ygrps-yiv-2023731555\">****It&#39;s possible that some people are unable to make any sense of visual <br/>\nsquiggles. They can learn from audio books then, or movies, or TV, or <br/>\ngoing places and seeing people directly doing things and talking about <br/>\nthem, or learn from doing.<br/>\n<br/>\nIf a child decides he&#39;s &quot;ready to learn&quot; it doesn&#39;t mean he&#39;ll be able <br/>\nto decipher all the things necessary to read. Parents shouldn&#39;t think <br/>\nthat they can teach a child to read. The most they can do is make it <br/>\neasier for him to learn to read.****<br/>\n<br/>\nI just read this article about blind people and the use of Braille and it&#39;s decline in use.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.nytimes.com/2010/01/03/magazine/03Braille-t.html?pagewanted=1&hpw\">http://www.nytimes.com/2010/01/03/magazine/03Braille-t.html?pagewanted=1&hpw</a><br/>\n<br/>\nHere&#39;s a few excerpts:<br/>\n<br/>\n“What we’re finding are students who are very smart, very verbally able — and illiterate,” Jim Marks, a board member for the past five years of the Association on Higher Education and Disability, told me. “We stopped teaching our nation’s blind children how to read and write. We put a tape player, then a computer, on their desks. Now their writing is phonetic and butchered. They never got to learn the beauty and shape and structure of language.”<br/>\n<br/>\n“If all you have in the world is what you hear people say, then your mind is limited,” Darrell Shandrow, who runs a blog called Blind Access Journal, told me. “You need written symbols to organize your mind. If you can’t feel or see the word, what does it mean? The substance is gone.” <br/>\n<br/>\nLearning to read is so entwined in the normal course of child development that it is easy to assume that our brains are naturally wired for print literacy. But humans have been reading for fewer than 6,000 years (and literacy has been widespread for no more than a century and a half).<br/>\n<br/>\nBraille readers do not deny that new reading technology has been transformative, but Braille looms so large in the mythology of blindness that it has assumed a kind of talismanic status.<br/>\n<br/>\n Among people with fewer resources, Braille-readers tend to form the blind elite, in part because it is more plausible for a blind person to find work doing intellectual rather than manual labor.<br/>\n<br/>\n****<br/>\n<br/>\nI know it&#39;s not the same as a sighted person learning to read or not, but the idea of literacy and knowledge are all a part of it.<br/>\n<br/>\nI watched Chamille hear stories for years.  I could hear in what she said and how she talked that she understood the story and the language and sentence structure long before she was able to read and write.  She had a large vocabulary from hearing the written word.  I&#39;m pretty sure that her ability to really understand the written word would have been far less if she&#39;d been plunked down at a desk with a tape recorder and a computer.  Where is the beauty of that, where is the learning?  <br/>\n<br/>\nIt was a fascinating article and it highlited some interesting ideas about literacy.  Braille, like other books do have a kind of talismanic status as the be all, end all, for all knowledge and literacy.  Yet, even those that are blind today that can&#39;t read Braille are doing intellectual work.  The very premise that many blind educators are making against the use of other media for knowledge gathering doesn&#39;t hold in the reality of what some of the blind people, that were referenced within the article that don&#39;t use Braille, are doing.  The governor of NY is one of those very people.<br/>\n<br/>\nHow did paper literacy get to be so much better than actual knowledge and the use of it?  Since when do we need written symbols to organize the mind?  Words don&#39;t lose their meanings when they are spoken.  I like reading and writing, I really do.  I used to feel like it was the best and only way to achieve information.  Chamille showed me differently.  I sometimes wish that I could go back to my own childhood and learn about the world anew without being forced to do so through reading.<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Literacy Question","postDate":"1263229958","msgId":113354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJCQkRGNjQ2LThGNjYtNDcwQS05NkJGLTY1Mzc3NTk1QkVGNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhpMzFwayt0ZDRjQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpMzFwayt0ZDRjQGVHcm91cHMuY29tPg=="},"prevInTopic":113329,"nextInTopic":113355,"prevInTime":113353,"nextInTime":113355,"topicId":113327,"numMessagesInTopic":0,"msgSnippet":"I bet this has already been answered, but I m way behind on mail. -=-I am puzzled by someone that cannot read I am sure they at some point in life needed or","messageBody":"<div id=\"ygrps-yiv-412847420\">I bet this has already been answered, but I&#39;m way behind on mail.<br/>\n<br/>\n-=-I am puzzled by someone that cannot read I am sure they at some  <br/>\npoint in life needed or really wanted to understand something.<br/>\nwas she just not ready to learn until now??? I did not want to pry  <br/>\ninto her life but it is very interesting? I do not want to sound  <br/>\noffensive if so I am sorry. Does anyone understand what I am asking?-=-<br/>\n<br/>\nShe might have been &quot;ready to learn&quot; earlier and school destroyed her  <br/>\nconfidence that it was something she COULD learn.<br/>\n<br/>\nIn every reading class from first grade or pre-school, some of the  <br/>\nkids are marked (with a letter or number or phrase) as non-readers.<br/>\nOnce official teachers tell someone she can&#39;t read, why should she  <br/>\nkeep trying?   If looking at the printed word makes a person want to  <br/>\ncry, how easy would it be for her to learn to read on her own?  Not  <br/>\nvery.<br/>\n<br/>\nIt&#39;s possible that some people are unable to make any sense of visual  <br/>\nsquiggles.  They can learn from audio books then, or movies, or TV, or  <br/>\ngoing places and seeing people directly doing things and talking about  <br/>\nthem, or learn from doing.<br/>\n<br/>\nIf a child decides he&#39;s &quot;ready to learn&quot; it doesn&#39;t mean he&#39;ll be able  <br/>\nto decipher all the things necessary to read.  Parents shouldn&#39;t think  <br/>\nthat they can teach a child to read.  The most they can do is make it  <br/>\neasier for him to learn to read.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce","from":"&quot;Joyce&quot; &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Literacy Question","postDate":"1262858053","msgId":113329,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpNGIwNStkOW11QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGhpMzFwayt0ZDRjQGVHcm91cHMuY29tPg=="},"prevInTopic":113328,"nextInTopic":113354,"prevInTime":113328,"nextInTime":113330,"topicId":113327,"numMessagesInTopic":0,"msgSnippet":"**** How does illiteracy happen if children read when they want? **** Because need is only half of what s necessary.  The other half is a warm supportive","messageBody":"<div id=\"ygrps-yiv-470017792\">**** How does illiteracy happen if children read when they want? **** <br/>\nBecause need is only half of what&#39;s necessary.  The other half is a warm<br/>\nsupportive environment where their experiences with the printed words<br/>\nare positive. If she had no support, if she was pressured or shamed to<br/>\ndo things before she was able  (which makes some kids decide they&#39;re<br/>\nstupid or that reading is stupid), if reading wasn&#39;t something fun and<br/>\ninteresting but something to be dreaded, it&#39;s likely she shut down when<br/>\nopportunities to learn came along.<br/>\nJoyce<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128961575,"authorName":"Vicki Dennis","from":"Vicki Dennis &lt;vicki@...&gt;","profile":"vickitexan2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [UnschoolingDiscussion] Literacy Question","postDate":"1262818561","msgId":113328,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5Y2ExYmJhMTAwMTA2MTQ1NnkzY2ZmN2NjYnBmNTA1ZDE5ZTIyYWVhOTc5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhpMzFwayt0ZDRjQGVHcm91cHMuY29tPg==","referencesHeader":"PGhpMzFwayt0ZDRjQGVHcm91cHMuY29tPg=="},"prevInTopic":113327,"nextInTopic":113329,"prevInTime":113327,"nextInTime":113329,"topicId":113327,"numMessagesInTopic":0,"msgSnippet":"It is my opinion that the huge increase in learning disabilities , particularly with regard to reading, happens because our culture pushes earlier and earlier","messageBody":"<div id=\"ygrps-yiv-1539124651\">It is my opinion that the huge increase in &quot;learning disabilities&quot;,<br/>\nparticularly with regard to reading, happens because our culture pushes<br/>\nearlier and earlier reading instruction.    When children who are not<br/>\ndevelopmentally ready are labelled non-readers at age 8 after 4-5 years of<br/>\nmisguided instruction, many are never able to recover from the damage done.<br/>\n<br/>\nI think that adult illiteracy can happen in much the same way.<br/>\n<br/>\nWhen I say that children will read when they are ready, it is usually with<br/>\nthe proviso that they are in an environment where reading is enjoyed and<br/>\nwhere they have access to written words.  I think it doubtful children would<br/>\ncommunicate verbally if there is not spoken language in their environment.<br/>\nTo support reading there needs to be an environment where questions about<br/>\n&quot;what is that word&quot; are answered rather than the child shamed or ignored or<br/>\ntold to pay attention when in school and he would know.<br/>\nOr the response that really prickles me.........&quot;sound it out&quot;.<br/>\n Encouragement that they are not reading yet rather than that they have not<br/>\nbeen taught is also helpful.<br/>\n<br/>\nDid your acquaintance mention how she learned to read after whatever was<br/>\ndone to her as a child disabled her?<br/>\n<br/>\nvicki<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Jan 6, 2010 at 4:11 PM, sabrrbas &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:sabrrbas@...\">sabrrbas@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I just today met an elderly woman who was amazed by the fact that I want to<br/>\n&gt; unschool. she was concerned because she recently learned how to read.<br/>\n&gt; How does illiteracy happen if children read when they want?<br/>\n&gt; I am puzzled by someone that cannot read I am sure they at some point in<br/>\n&gt; life needed or really wanted to understand something.<br/>\n&gt; was she just not ready to learn until now??? I did not want to pry into her<br/>\n&gt; life but it is very interesting? I do not want to sound offensive if so I am<br/>\n&gt; sorry. Does anyone understand what I am asking?<br/>\n&gt;<br/>\n&gt; any insight?<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":414368780,"authorName":"sabrrbas","from":"&quot;sabrrbas&quot; &lt;sabrrbas@...&gt;","profile":"sabrrbas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Literacy Question","postDate":"1262815860","msgId":113327,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhpMzFwayt0ZDRjQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":113328,"prevInTime":113326,"nextInTime":113328,"topicId":113327,"numMessagesInTopic":0,"msgSnippet":"I just today met an elderly woman who was amazed by the fact that I want to unschool. she was concerned because she recently learned how to read. How does","messageBody":"<div id=\"ygrps-yiv-105856897\">I just today met an elderly woman who was amazed by the fact that I want to unschool. she was concerned because she recently learned how to read.<br/>\nHow does illiteracy happen if children read when they want?<br/>\nI am puzzled by someone that cannot read I am sure they at some point in life needed or really wanted to understand something. <br/>\nwas she just not ready to learn until now??? I did not want to pry into her life but it is very interesting? I do not want to sound offensive if so I am sorry. Does anyone understand what I am asking?<br/>\n<br/>\nany insight?</div>","specialLinks":[]}],"prevTopicId":113226,"nextTopicId":113356}}