{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Covert","from":"Covert &lt;covert@...&gt;","replyTo":"LIST","senderId":"Kij1W8eksZW5P7f92NvZ5QzbR904xm6EgJ8KK5NmyGN2RlvHTPNIa6B-vcHkAXkz5maQQJKwAVPmTrjoQCzD9wCQ7Ljw7w","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Japan news: &quot;Problem teachers&quot;","postDate":"971499263","msgId":13654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAxMDE0MDQ1NC5OQUEwMDE5N0BzbXRwMi5kdGkubmUuanA+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":13653,"nextInTime":13655,"topicId":13654,"numMessagesInTopic":0,"msgSnippet":"Hi everyone, A story here in today s Yomiuri, a conservative national daily newspaper in Japan, on yet another aspect of Japanese Prime Minister Yoshiro Mori s","messageBody":"<div id=\"ygrps-yiv-234696060\">Hi everyone,<br/>\n<br/>\nA story here in today&#39;s Yomiuri, a conservative national daily newspaper <br/>\nin Japan, on yet another aspect of Japanese Prime Minister Yoshiro Mori&#39;s <br/>\n&quot;education reform&quot; measures: the purging of those teachers deemed to be <br/>\nproblematic from public schools nationwide.<br/>\n<br/>\nTo some degree, one could welcome such government action, since there <br/>\ncertainly are problems with schoolteachers in Japan who physically or <br/>\nemotionally abuse students in their classes.<br/>\n<br/>\nBut reading the following story, one also gets the impression that those <br/>\nare not necessarily the same kind of &quot;problem teachers&quot; the Ministry of <br/>\nEducation plans to go after.<br/>\n<br/>\nHistorically in Japan, &quot;problem teachers&quot; has meant the same thing as <br/>\n&quot;problem students&quot;: those people who dare to question higher authority <br/>\nand thus are judged to be &quot;troublemakers.&quot; That would appear to be the <br/>\ncase this time as well.<br/>\n<br/>\nPurging the country&#39;s public schools, as the Ministry of Education <br/>\nintends to do, would seem to serve two convenient purposes: (1) It gives <br/>\nnotice to public school teachers nationwide that they will &quot;shape up or <br/>\nship out&quot; if they do not conform to the tighter &quot;education reform&quot; <br/>\nmeasures planned by the Japanese government.<br/>\n<br/>\nAnd (2) It punishes teachers only, while leaving the deeper underlying <br/>\nproblems of Japan&#39;s educational system untouched. <br/>\n<br/>\nRegards,<br/>\n<br/>\nBrian Covert<br/>\n(KnoK NEWS)<br/>\nOsaka, Japan<br/>\n<br/>\n-------------------------------------<br/>\n<br/>\n<br/>\nThe Daily Yomiuri - 14 October 2000<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.yomiuri.co.jp/newse/1014so09.htm\">http://www.yomiuri.co.jp/newse/1014so09.htm</a><br/>\n<br/>\n<br/>\nMINISTRY IN DRIVE TO FIRE &#39;PROBLEM TEACHERS&#39;<br/>\n<br/>\n[by] Natsuki Komatsu<br/>\nYomiuri Shimbun Staff Writer<br/>\n<br/>\n<br/>\nSo-called problem teachers -- ones who lack the leadership to conduct <br/>\nmeaningful classes -- may find themselves removed from the classroom if <br/>\nthe Education Ministry has its way.<br/>\n<br/>\nA campaign the ministry is preparing to launch includes a planned <br/>\nrevision of the law so that such teachers can be dismissed from the <br/>\nnation&#39;s public schools.<br/>\n<br/>\nTeachers are currently screened and hired by prefectural governments, <br/>\nalthough they are technically classified as local community government <br/>\nofficials.<br/>\n<br/>\nUnder the ministry&#39;s plan, teachers who are deemed problematic would be <br/>\ntransferred out of the classroom and reemployed as prefectural government <br/>\nofficials in a nonteaching capacity. The ministry also aims to be able to <br/>\ntake such action without the consent of the teachers in question.<br/>\n<br/>\nA more coercive measure for the dismissal of problem teachers was also <br/>\nconsidered, but the ministry turned down the idea on grounds that the <br/>\nteachers themselves are not necessarily always accountable for their <br/>\nactions.<br/>\n<br/>\nThe chosen method would also guarantee alternative employment for the <br/>\nindividuals to be dismissed as teachers, thus sparing them the shock of a <br/>\nsudden firing.<br/>\n<br/>\nThe plan requires a partial revision to the law on the organization and <br/>\noperation of local educational administrations.<br/>\n<br/>\n&quot;Prefectural governments that hired the individuals in the first place <br/>\nshould be held responsible,&quot; a ministry official said.<br/>\n<br/>\nWho are these so-called problem teachers? Their characteristics include <br/>\nan inability to communicate with pupils and a lack of enthusiasm for <br/>\nmaking learning more interesting or exciting for the pupils. Many of them <br/>\nreportedly only &quot;lecture&quot; students from blackboard notes. Some teachers <br/>\nhave even been accused of harming their charges by discouraging them <br/>\nthrough words and actions.<br/>\n<br/>\nEstimates put such teachers at about 1 percent of the entire body of <br/>\npublic primary and middle school teachers nationwide, according to <br/>\nundisclosed survey documents compiled by prefectural education boards.<br/>\n<br/>\nA teachers&#39; union official has voiced concern that such an attempt by the <br/>\nministry to remove problem teachers could backfire, resulting in the <br/>\nostracization of capable or popular teachers.<br/>\n<br/>\nNonetheless, the seemingly small ratio of suspected problem teachers may <br/>\nmask a teacher apathy whose effects are more widespread than apparent. <br/>\nIndeed, such apathy constitutes a problem that cannot be ignored in that <br/>\nhomeroom teachers have considerable influence over the lives of children <br/>\nin their charge.<br/>\n<br/>\nThe ministry and prefectural education boards previously have neglected <br/>\nthe issue, confessing that they were at a loss for effective solutions.<br/>\n<br/>\nIn theory, such teachers can legally be dismissed or demoted from their <br/>\nteaching positions for a lack of professionalism under the Local Civil <br/>\nService Law, even though their lack of professionalism may not be <br/>\nintentional.<br/>\n<br/>\nIn stark contrast with the ease of implementing punitive dismissals of <br/>\nindividuals implicated in crimes, however, in cases of dismissals or <br/>\ndemotions based on professional ability, the burden of proof is on <br/>\nauthorities to show that a teacher cannot be expected to improve.<br/>\n<br/>\nCourts also have accepted complaints filed by dismissed teachers and <br/>\noften have ruled in their favor, making local authorities all the more <br/>\ncautious about dismissing teachers in general.<br/>\n<br/>\nThe result has been that problem teachers continue to occupy the <br/>\nclassroom, despite protests from children and their guardians.<br/>\n<br/>\nThe concessionary practice that has become common is to bring in another, <br/>\nmore compatible teacher or transfer the unpopular teacher to another <br/>\nschool.<br/>\n<br/>\nThis, however, is hardly a solution, and has just given rise to increased <br/>\ndistrust of the public education system among parents.<br/>\n<br/>\nThe ministry&#39;s apparent determination to revise the law is seen as an <br/>\neffort to nip the further spread of public distrust in primary and middle <br/>\nschool education in the bud by taking the rights of pupils in the <br/>\nclassroom more seriously.<br/>\n<br/>\nThe concept of rehiring dismissed teachers as prefectural government <br/>\nofficials is seen as a bridge from the protective educational environment <br/>\nto the competitive working world. It also takes the burden off local <br/>\ncommunities that otherwise would be saddled with incompetent teachers.<br/>\n<br/>\nFurthermore, small local governments, with their limited resources, would <br/>\nbe hard-pressed to find new jobs for the dismissed teachers within their <br/>\nown jurisdictions.<br/>\n<br/>\nThe ministry, however, expects the revised law to be applied carefully, <br/>\nincluding having the teachers undergo various training programs before <br/>\nthe final decision is made to transfer them.<br/>\n<br/>\nAfter all, public school teachers are hired as specialized public <br/>\nservants under a law that not only assures job security but also prevents <br/>\nthem from looking into other fields.<br/>\n<br/>\nFurthermore, views held by the local community, including those of the <br/>\nparents and the pupils, should be taken into consideration, in addition <br/>\nto the opinion of the final decision-maker -- which in this case would be <br/>\nthe school principal -- in determining the professional aptitude of the <br/>\nteacher in question.<br/>\n<br/>\n<br/>\nCopyright 2000 The Yomiuri Shimbun</div>","specialLinks":[]}],"prevTopicId":13653,"nextTopicId":13655}}