{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Bonknit@xxx.xxx","from":"Bonknit@...","replyTo":"LIST","senderId":"bM-bSPrym0IH7NfXqxxUUAqhrNJMpj-FGuSrU9Ic4kHDZJe6YBRIJKY2ArtPUzog2IfZtCY9","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: &quot;Scum bucket&quot; jobs","postDate":"940040088","msgId":3905,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNTguMzkwNS45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":3883,"nextInTopic":0,"prevInTime":3904,"nextInTime":3906,"topicId":3883,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/15/99 12:23:42 PM Eastern Daylight Time, andersen@spiritone.com writes:  ","messageBody":"<div id=\"ygrps-yiv-108418245\">In a message dated 10/15/99 12:23:42 PM Eastern Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:andersen@...\">andersen@...</a> writes:<br/>\n<br/>\n&lt;&lt; Below is a &quot;short&quot; statement I made on this very topic. &gt;&gt;<br/>\n<br/>\n    Well said, Bravo!!<br/>\n<br/>\nLaura</div>","specialLinks":[]},{"userId":0,"authorName":"John O. Andersen","from":"&quot;John O. Andersen&quot; &lt;andersen@...","replyTo":"LIST","senderId":"lbaInsXz8nXfSGvIlLT7YcN2qYdnDtNZUEO_W6535UBa0oaGalGd312p3SVJmqfMaSBxbF6jPmnt0sF4qmJ8Sozo8_8JIzLqnoEJ2qKnd54t7A","spamInfo":{"isSpam":false,"reason":"0"},"subject":"&quot;Scum bucket&quot; jobs","postDate":"940005076","msgId":3883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNTcuMzg4My45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":3905,"prevInTime":3882,"nextInTime":3884,"topicId":3883,"numMessagesInTopic":0,"msgSnippet":"Rick and Deborah, I hear you loud and clear.  People who look down their noses at manual labor are often clueless anyway.  Manual labor work is some of the","messageBody":"<div id=\"ygrps-yiv-1130794170\">Rick and Deborah,<br/>\n<br/>\nI hear you loud and clear.  People who look down their noses at manual labor<br/>\nare often clueless anyway.  Manual labor work is some of the best work there<br/>\nis in terms of what you get out of it.  A lot of it beats office politics by<br/>\nmiles and miles.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;the job does not make the person, though<br/>\n&gt; there are many who believe it does.<br/>\n<br/>\n </span></blockquote>And they are sadly mistaken.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; because they have no life outside of<br/>\n&gt; thier work. ok i&#39;ll be done ranting.<br/>\n<br/>\n </span></blockquote>Precisely.<br/>\n<br/>\nBelow is a &quot;short&quot; statement I made on this very topic.<br/>\n<br/>\nJohn Andersen<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://members.xoom.com/joandersen\">http://members.xoom.com/joandersen</a><br/>\n<br/>\n<br/>\nManual Labor: An Attractive Career for the College-Educated<br/>\nBy John O. Andersen<br/>\nMay 10, 1998<br/>\n        Manual labor conjures up negative images for many people. Some think<br/>\nthat making a living with their hands is beneath their potential. When<br/>\nparents encourage their children to have high career aspirations, this<br/>\ninvariably means some form of white-collar work. Have you ever heard of an<br/>\nhonors student whose career goal was to become a plumber or house painter?<br/>\n<br/>\n        Manual labor careers are clustered near the bottom of the job status<br/>\nhierarchy. Yet if the truth be told, many of us truly enjoy manual labor. We<br/>\nlove to show off our manicured gardens, and remodeling projects. We also<br/>\nlike to brag about the leak we fixed, or the old motor we rebuilt. Work<br/>\nwhich employs both our brains and our brawn is good for us and feels right.<br/>\n<br/>\n        There are many people who recognize this and a few of those who are<br/>\nactually turning down white-collar careers in order to do manual labor.<br/>\nPerhaps this unconventional choice stems from a growing desire among workers<br/>\nfor more authenticity and meaning in their work. They just want to be real<br/>\npeople when they go to work, not feel like they have to put on a mask. They<br/>\nwant to make a tangible difference, not just do a bunch of inconsequential<br/>\npaper-shuffling. And they want a life outside of work as well.<br/>\n<br/>\n         Many people believe that the best jobs are invariably white-collar.<br/>\nThrough my experience I&#39;ve found this not necessarily true. Manual labor for<br/>\nme has always been more satisfying and enjoyable than anything I&#39;ve done in<br/>\nthe white-collar world. Unfortunately, social conditioning and traditional<br/>\nideas of success made it very difficult for me to break free from the notion<br/>\nthat I should choose a better career than manual labor. It took me several<br/>\nyears of outward success yet private frustration in the white-collar world<br/>\nto even entertain the idea that I could do manual labor without feeling like<br/>\na &quot;failure&quot; or needing to apologize to people who thought I was loony for<br/>\neven considering such things.<br/>\n<br/>\n        My experience in manual labor has been as the owner of a cleaning<br/>\nbusiness. I chose business ownership because when it comes to work, I&#39;m very<br/>\nindependent and a poor teamplayer. Self-employment is nirvana for me. I<br/>\nabsolutely love it. This path is not for everybody, however, and I&#39;m certain<br/>\nthat others not so inclined can find the same degree of satisfaction in<br/>\nmanual labor as an employee.<br/>\n<br/>\n        It has been five years since I embarked on my career in manual<br/>\nlabor. During that time I&#39;ve discovered a few major benefits of manual<br/>\nlabor. Here they are:<br/>\n<br/>\n<br/>\n1.  It&#39;s a good way to continue learning.<br/>\n<br/>\n        I make a living cleaning carpets. This brings me in contact with a<br/>\nwide spectrum of people. For instance, in the past few months I&#39;ve had<br/>\ncareer-related conversations with landlords, doctors, realtors, homemakers,<br/>\nschool teachers, writers, an interior designer, a drapery manufacturer,<br/>\nstockbrokers, a sculptor, an opera singer, an executive recruiter, and a<br/>\nprofessional storyteller.<br/>\n<br/>\n        Not many careers offer the same degree of exposure to so many<br/>\ndifferent people in their homes and the chance to chat with them about their<br/>\ncareer. Any service business which covers the residential market is a gold<br/>\nmine for such opportunities.<br/>\n<br/>\n        When I did the job for the opera singer, he gave me suggestions for<br/>\nlearning to understand and appreciate opera. Other customers tell me about<br/>\ntheir home projects or hobbies. Each day is packed with learning<br/>\nopportunities. About the only boring jobs are those in the &quot;pop-n-fresh&quot;<br/>\nsuburbs where dual careers and daycare leave the house uninhabited for the<br/>\nbulk of the day. Those customers leave me a key and I just take care of the<br/>\njob.<br/>\n<br/>\n        Each night when I record daily service calls in the customer<br/>\nrecords, I include interesting tidbits such as &quot;she is a piano teacher&quot; or<br/>\n&quot;they are from India.&quot; These entries are a permanent record of my business<br/>\nadventures. I&#39;ve threatened more than once to someday write Memoirs of a<br/>\nCarpet Cleaner.<br/>\n<br/>\n<br/>\n2.  You get a lot of physical exercise.<br/>\n<br/>\n        If you do manual labor for a living, you generally don&#39;t need to<br/>\nspend money on fitness clubs, exercise equipment, or diet plans. The daily<br/>\nexertion and sweat go a long way in maintaining physical health. Also, many<br/>\nmanual laborers work outdoors and therefore take in the benefits of fresh<br/>\nair and sunshine. Jobs requiring physical output contribute to hearty<br/>\nappetites, restful nights, and overall well-being. Manual laborers who burn<br/>\nthousands of calories a day, can also find it easy to control their weight.<br/>\n<br/>\n<br/>\n3.  You produce tangible results which people sincerely appreciate.<br/>\n<br/>\n        When I compare job satisfaction as a military officer with the<br/>\nsatisfaction of cleaning soiled carpets, the military career pales. Yes,<br/>\nthere was pride in being an officer, but because very little of what I did<br/>\nwas tangible, I often wondered whether I was making a difference. The senior<br/>\nofficers told us our job was to be a spokesperson, but that always seemed<br/>\ntoo passive and indirect to me. When I was on leave, the unit carried on<br/>\nquite well; arguably even better than when I was there. I had to keep<br/>\nreassuring myself that I was doing something useful even though my<br/>\nconscience suspected the opposite.<br/>\n<br/>\n        The usefulness of carpet cleaning, on the other hand, speaks for<br/>\nitself. When I&#39;m not there, the work doesn&#39;t get done. Praise from customers<br/>\nis honest and sincere. When a soiled carpet comes clean, it makes everyone<br/>\nhappy. If the customer is satisfied with my work, I get paid. If not, I<br/>\ndon&#39;t make a cent. Maybe I&#39;m just a simpleton, but that&#39;s the way I like<br/>\nthings: simple and straight-forward. That&#39;s manual labor in a nutshell.<br/>\n<br/>\n<br/>\n4.  You&#39;re emancipated from the &quot;job world.&quot;<br/>\n<br/>\n        Imagine if you can a working life free from the torture of boring<br/>\nmeetings, clueless managers, trendy mission statements, and threatening<br/>\nannual performance reviews. Such a dream is reality for the self-employed<br/>\nmanual laborer. As far as I can tell, it is one of the few ways to escape<br/>\nall of those insults to your intelligence and still make a decent living.<br/>\n<br/>\n        It often seems that the job market rewards those who most<br/>\nsuccessfully suppress their true personalities and recast themselves as<br/>\none-dimensional gung-ho teamplayers. In more than a few workplaces, people<br/>\nare pressured to publicly spout the &quot;party line&quot; even though privately they<br/>\nmay think otherwise. They are also compelled to squelch non-mainstream<br/>\ninterests and ideas. Frequently, those who successfully jump through these<br/>\nhoops are &quot;rewarded&quot; with the &quot;good jobs&quot; and promotions.<br/>\n<br/>\n        The self-employed manual laborer is largely exempt from those rules.<br/>\nWhile image plays a role in their success, it is far less important than the<br/>\nquality of their tangible work. White-collar workers often don&#39;t have<br/>\ntangible results, and therefore must sometimes resort to &quot;impression<br/>\nmanagement&quot; as the way to showcase their value to the organization. In other<br/>\nwords, they must pay attention to things like wardrobe, quality of their<br/>\nhandshake, smile, haircut, and concocting daily evidence of their<br/>\nteamplaying attitude.<br/>\n<br/>\n         Hence, in terms of having to &quot;play ball&quot; i.e. create a &quot;winning&quot;<br/>\nimage to get ahead, manual laborers get off lightly.<br/>\n<br/>\n<br/>\n5.  You have true job security.<br/>\n<br/>\n        When you have several hundred happy customers who call you back year<br/>\nafter year to do their cleaning, repairs, etc., and those people also tell<br/>\ntheir friends about your service, you enjoy the ultimate in job security.<br/>\nAbout the only thing that will get you &quot;fired&quot; is if you allow your<br/>\nstandards to slip.<br/>\n<br/>\n        Such businesses usually do well regardless of the economy. In good<br/>\ntimes, customers call because they want to keep their homes tidy and in good<br/>\nrepair. In bad times they call because they don&#39;t have the money to replace<br/>\ntheir investments, so they want to maintain them. Carpets become soiled,<br/>\ntoilets clog up, paint chips and peels, and cars break down regardless of<br/>\nwhether the economy is up or down.<br/>\n<br/>\n        There is nothing like having your own business in which you are<br/>\ndaily complimented by the simple fact that the phone continues ringing with<br/>\nprevious customers who want your service again and again. That&#39;s what I call<br/>\njob security.<br/>\n<br/>\n<br/>\nSome excellent manual labor businesses.<br/>\n<br/>\n        What are some of the best manual labor businesses in terms of the<br/>\nadvantages outlined above?<br/>\n<br/>\n         There are thousands of options, but my personal preference is for<br/>\nservice businesses which primarily repair, restore, clean, and maintain. A<br/>\nfew sure bets include: cleaning (carpets, windows, furniture, etc.),<br/>\ngardening and lawn mowing, auto repair, house painting, plumbing, and<br/>\nhandyman services.<br/>\n<br/>\n<br/>\nHow does a person get into manual labor?<br/>\n<br/>\n        The beauty of it is that the world isn&#39;t stampeding toward manual<br/>\nlabor careers. If you want to do manual labor and don&#39;t care about status or<br/>\nwhat anybody thinks of your career choice, you should have no problem<br/>\nfinding work.<br/>\n<br/>\n        Sometimes though it isn&#39;t clear how a college graduate gets into a<br/>\nmanual labor business. The path to a corporate career is well laid out in<br/>\nbooks, courses, and by college placement offices, but how to become a<br/>\nsuccessful self-employed laborer is less documented.<br/>\n<br/>\n        While in college you might take a part-time job in manual labor.<br/>\nThere are always plenty of jobs mowing lawns, cleaning buildings, or<br/>\npainting houses. After getting some experience as an employee, you may be<br/>\nready to run your own business. Many self-employed janitors, carpenters,<br/>\nplumbers, and electricians got their start as employees during college.<br/>\n<br/>\n        To make the transition from employee to self-employed, sometimes you<br/>\ncan purchase the company you work for. If the owner is nearing retirement or<br/>\nhas other interests, this can be a good option. Once you&#39;ve proven your<br/>\nknowledge of the trade and ability to work hard, treat customers right, and<br/>\nrun an organized operation, you usually won&#39;t have trouble convincing an<br/>\nowner to sell the business on a contract. What this means is that after a<br/>\ndown payment (sometimes that isn&#39;t even necessary) the owner will finance<br/>\nthe rest.<br/>\n<br/>\n        Some claim that all you need is a dream, and a positive mental<br/>\nattitude to succeed in business. Those notions can be misleading. I don&#39;t<br/>\nknow anyone who has successfully run a service business for more than a few<br/>\nyears who would say such things. From my experience, the service businesses<br/>\nwhich supposedly &quot;succeed&quot; overnight often bend ethics in the process.<br/>\n<br/>\n        Enthusiasm is important to business success, but far more useful are<br/>\nqualities like hard work, financial discipline and patience. A successful<br/>\nbusiness with many repeat customers is built one job at a time over a period<br/>\nof years. Many intelligent and hard-working people report that it usually<br/>\ntakes three years or more before you can harvest repeat and referral<br/>\ncustomers, and that is if you run a high quality business. There are no<br/>\nshortcuts to true business success.<br/>\n<br/>\n<br/>\nAnswers to common objections.<br/>\n<br/>\n        Over and over again, I hear objections from people about why they<br/>\nwouldn&#39;t do manual labor. Here are responses to three of the most common<br/>\nones.<br/>\n<br/>\n<br/>\n1.  What if I get hurt or I can&#39;t do physical labor as I get older?<br/>\n<br/>\n        These are valid concerns. There are many ways to deal with them.<br/>\n<br/>\n        To avoid financial difficulty due to injury, you might build a<br/>\nbusiness which includes several employees. This would reduce your<br/>\ninvolvement in the physical work. However, this option carries the<br/>\nconsiderable burden of the employer role. Some employers find that their<br/>\nhealth (mental if nothing else) suffers far more than if they just did all<br/>\nof the work themselves. It all depends on the individual. For some the<br/>\nemployer role is a panacea, for others a nightmare.<br/>\n<br/>\n        Another strategy is to develop secondary or passive income sources.<br/>\nIncome from real estate, securities, or part-time businesses could fit this<br/>\ndescription. For instance, for the past few years I&#39;ve had a part-time<br/>\ntutoring business. This provides a modest supplemental income, and a way for<br/>\nme to teach young people without having to be a full-time teacher. In the<br/>\nfuture I may choose to increase the amount of tutoring I do. Should an<br/>\naccident force me out of carpet cleaning, I would hopefully have enough of a<br/>\ntutoring business established that I could rely on it as a primary income.<br/>\n<br/>\n        Some people don&#39;t fret too much over the danger of an accident or<br/>\nphysical disability. Over and over again I hear of people who live into<br/>\ntheir nineties and beyond who credit a lifetime of physical labor as a major<br/>\nfactor in their longevity. I like to think that the majority of those who<br/>\ntake the necessary precautions, work carefully and methodically, and<br/>\npractice healthy living habits, should be able to perform physical labor<br/>\nwell beyond the traditional retirement age.<br/>\n<br/>\n<br/>\n2.  How can I ever take time off?<br/>\n<br/>\n        This one is a cinch to answer. People who say they can never get<br/>\naway from their business, are usually those who haven&#39;t taken the necessary<br/>\nsteps to keep the business from controlling their life.<br/>\n<br/>\n        People who are strapped to their business with no time or money to<br/>\nget away, often could buy their freedom by cutting overhead, and regularly<br/>\nsaving money to cover expenses during the slow season. It usually comes down<br/>\nto having the discipline to avoid the frills which only increase overhead,<br/>\nwithout a corresponding increase in the quality of service to the customer.<br/>\n<br/>\n        Occasionally to meet customer demand, the self-employed have no<br/>\nchoice but to put in long hours for several weeks or months at a time. The<br/>\nreward, however, can be weeks or months of time off. The important point to<br/>\nremember is that when it&#39;s slow season, don&#39;t sit around waiting for the<br/>\nphone to ring. That is the time to take a vacation or pursue a hobby.<br/>\n<br/>\n<br/>\n3.  But I won&#39;t be able to &quot;use my degree.&quot;<br/>\n<br/>\n        Manual labor may not be the most obvious way to &quot;use your degree,&quot;<br/>\nbut it is certainly an excellent way to use your brain.<br/>\n<br/>\n        You&#39;ll discover that manual labor provides a wealth of ways to use<br/>\nyour brain, ingenuity, creativity, what have you. As an entrepreneur, you<br/>\nget to wear many hats: production, marketing, public relations, accountant,<br/>\nrepairperson, purchaser, janitor, etc. With such a range of tasks, it&#39;s hard<br/>\nto get bored, and even possible to get smarter.<br/>\n<br/>\n<br/>\nConclusion<br/>\n<br/>\n        Clearly, manual labor is not beneath the &quot;dignity&quot; of a college<br/>\ngraduate. Those who think that such work is only for the uneducated<br/>\nunderachievers, are either misguided or just plain ignorant.<br/>\n<br/>\n        College graduates who are so inclined should consider a career in<br/>\nmanual labor. Just because they earned a degree, doesn&#39;t mean they have to<br/>\ntake the white-collar path. Some of them may discover a lifetime of job<br/>\nsatisfaction and opportunity in manual labor.<br/>\nFrom such a discovery, a person would be foolish to turn away.<br/>\n<br/>\n<br/>\nCopyright � 1998 John O. Andersen.  All rights reserved.<br/>\nPlease e-mail John Andersen regarding comments or permission to reprint.</div>","specialLinks":[]}],"prevTopicId":3902,"nextTopicId":3815}}