{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":193844353,"authorName":"Nicole Willoughby","from":"Nicole Willoughby &lt;cncnawilloughby@...&gt;","profile":"cncnawilloughby","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Choices & power was Subway","postDate":"1215489150","msgId":36271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4MzA4OS4xMzYyOS5xbUB3ZWIzMTkwMy5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PDAwNDMwMWM4ZGY5ZiQ4N2E0ZmNiMCQ2NzAxYThjMEBNT01TPg=="},"prevInTopic":36234,"nextInTopic":0,"prevInTime":36270,"nextInTime":36272,"topicId":36210,"numMessagesInTopic":0,"msgSnippet":"No you can t go on the trampoline because there is no net - NO not even if only one goes at a time OR I stand and watch Ok sorry these comments are kinda","messageBody":"<div id=\"ygrps-yiv-1117027323\">No you can&#39;t go on the trampoline because there is no net - NO not even if <br/>\nonly one goes at a time OR I stand and watch&gt;&gt;&gt;&gt;<br/>\n   <br/>\n  Ok sorry these comments are kinda off topic of the original subject but a ton of trampoline injuries are from hitting the net wrong. I cringe when my kids get on a tramp with a net.<br/>\n   <br/>\n  and ...I find it soo kewl to run into another Sorsha .....my youngest godchild is Sorcha.:)<br/>\n   <br/>\n  Nicole<br/>\n<br/>\n       <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Choices & power was Subway","postDate":"1215402619","msgId":36234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5QzlCNkUzLUVDMTAtNDgxMy05NjYyLTgxOEIxOTk1OTg5RkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwNDMwMWM4ZGY5ZiQ4N2E0ZmNiMCQ2NzAxYThjMEBNT01TPg==","referencesHeader":"PDEyMTUzNjM1ODcuNjUwLjMwMjM4Lm00NUB5YWhvb2dyb3Vwcy5jb20+IDwwMDQzMDFjOGRmOWYkODdhNGZjYjAkNjcwMWE4YzBATU9NUz4="},"prevInTopic":36210,"nextInTopic":36271,"prevInTime":36233,"nextInTime":36235,"topicId":36210,"numMessagesInTopic":0,"msgSnippet":"This is long and starts with a quote and it won t hurt my feelings if people skip it all. -=-No you can t go on the trampoline because there is no net - NO not","messageBody":"<div id=\"ygrps-yiv-860404005\">This is long and starts with a quote and it won&#39;t hurt my feelings if  <br/>\npeople skip it all.<br/>\n<br/>\n<br/>\n-=-No you can&#39;t go on the trampoline because there is no net - NO not  <br/>\neven if<br/>\nonly one goes at a time OR I stand and watch.<br/>\n<br/>\nNo you can&#39;t have soda or ice cream (we have a kid cabana where ice  <br/>\ncreams,<br/>\nsoda&#39;s, and waters are there for the kids&#39; takings).<br/>\n<br/>\nNo you can&#39;t run in the water on the lawn while it&#39;s being irrigating.<br/>\n<br/>\nNo you can&#39;t have another piece of cake.<br/>\n<br/>\nNo you can&#39;t throw a soda bomb (the kids are each allowed to throw  <br/>\none soda<br/>\nbomb when they&#39;re here).<br/>\n<br/>\nNo you can&#39;t ride the scooter or the bike because you don&#39;t have your  <br/>\nhelmet<br/>\n(we have a long driveway and the yard is completely fenced. No  <br/>\ndownhill or<br/>\nanything).-=-<br/>\n<br/>\n<br/>\n<br/>\nThat whole list made me sad.<br/>\n<br/>\n<br/>\n<br/>\nWe had religious homeschoolers staying with us for several days one  <br/>\nwinter a dozen and some years ago.  The mom and I were both in the  <br/>\nSCA (well both whole families were) and she was my student (Laurel  <br/>\napprentice, for those who know the structure and the lingo), though  <br/>\nthey lived in another kingdom.<br/>\n<br/>\nI kept hoping she would understand that the same way she was learning  <br/>\nall kinds of arts, and doing all kinds of research for fun, that her  <br/>\nkids could learn in that same way.  But she had a full-on double  <br/>\nstandard, and was very (very) controlling.<br/>\n<br/>\nI could write a long list of stunning things as evidence of the  <br/>\nproblems with what they were doing, but I will tell this one story,  <br/>\nwhich was triggered by the report of the mom having said &quot;Well at  <br/>\nleast MY kids listen.&quot;<br/>\n<br/>\nThe kids had crayons and our box of coloring books, which included  <br/>\nbooks of mazes and puzzles, and little-kid workbooks.<br/>\n<br/>\nHolly came and asked me to read the directions to her, on some  <br/>\nmatching page.   I said something like &quot;Draw a red line from  <br/>\n[whatever to whatever],&quot; or whatever it was---red X, or circle with  <br/>\nred.  She asked me if it needed to be red, and I said no, it didn&#39;t  <br/>\neven need to be a circle (I wish I could remember the quote; sorry).   <br/>\nShe and one of the other family&#39;s little girls ran off happily to  <br/>\nwork that page.<br/>\n<br/>\nWhen they were a little ways away (at least it wasn&#39;t right in front  <br/>\nof Holly), the mom said snootily something like &quot;We expect our  <br/>\nchildren to learn to follow the directions.&quot;<br/>\n<br/>\nSo for me, if Holly wanted to do the counting or sound-matching or  <br/>\nWHATever was the theme of that workbook page, that was fine, and if  <br/>\nshe did it wrong, that was fine.  For the other family, if a workbook  <br/>\nsaid to use red, THAT was the important thing.  To follow the  <br/>\ndirections.<br/>\n<br/>\nThis was not a good SCA match for my beliefs about learning and doing  <br/>\nand being.<br/>\n<br/>\n<br/>\n<br/>\nThat couple ended up divorced, the kids dividing their time, the  <br/>\nparents bitter and mean, the mom living with a man, posing  <br/>\nsuggestively on a motorcycle on a webpage...      It&#39;s been a long  <br/>\ntime.  I&#39;ve lost touch with them.  Their certain knowledge that they  <br/>\nwere doing things the only right way, God&#39;s way, and that it would  <br/>\nguarantee a good outcome for their daughters was shot to hell.   <br/>\nMeanwhile, our kids grew up in an intact family, more concerned about  <br/>\nbeing thoughtful and resourceful than in using the right color in a  <br/>\ncartoony workbook.<br/>\n<br/>\nToday is Keith&#39;s birthday.  He is &quot;thirty and a Kirby.&quot;  Kirby will  <br/>\nbe 22 on the 29th, so Keith is 52.  Keith was 20 when I met him, 21  <br/>\nwhen we were first involved.  We have been told Kirby would grow up  <br/>\nwild and awful.  He did not.  We&#39;ve been told our kids would never  <br/>\nget jobs.  They&#39;ve all had jobs and their employers gush about them.<br/>\n<br/>\nHolly will be housesitting next weekend, for friends who have in the  <br/>\npast hired Kirby or Marty to housesit, but neither of them is going  <br/>\nto be in town, so Holly inherits the job.  Probably her boyfriend  <br/>\nBrett will be over there with her.  Many parents would criticize us  <br/>\nfor that, but screw &#39;em.  She&#39;ll be safer with Brett there, and less  <br/>\nbored, and if there are any problems with the three dogs, or the  <br/>\nneighbors, or the guy who has come to steal guns there twice (the  <br/>\nguns are all very locked up now, but still...), I&#39;d really rather  <br/>\nHolly not be there alone.<br/>\n<br/>\nHolly will leave the house cleaner than she found it, the dogs will  <br/>\nhave fun, she&#39;ll have her computer there, and will watch their DVDs  <br/>\non the big TV and water their bushes and probably call me two or  <br/>\nthree times a day.  She can come home in the daytime, as long as  <br/>\nshe&#39;s there from 6:00 to feed dogs and keep lights and noise in the  <br/>\nhouse at night.<br/>\n<br/>\nYes, of course, not many sixteen year olds could be trusted with a  <br/>\nsituation like that, but my kids have nothing to be sneaky about, and  <br/>\nare not destructive and they are thoughtful and careful and  <br/>\nresponsible.  That&#39;s not accident or coincidence.  It&#39;s because each  <br/>\nof them (at 16) had had sixteen years of exploration of the world  <br/>\nwithout a bunch of rules and punishments and restrictions and limits  <br/>\nand shame.  They&#39;ve heard yes a lot more than they&#39;ve heard no, and  <br/>\nso they are full of &quot;yes&quot; and &quot;Yes, I can do that.&quot;  They are  <br/>\nconfident and generous.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":201248820,"authorName":"Crystal Miller","from":"&quot;Crystal Miller&quot; &lt;willowsfortress@...&gt;","profile":"sorschasmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Choices & power was Subway","postDate":"1215372964","msgId":36210,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDMwMWM4ZGY5ZiQ4N2E0ZmNiMCQ2NzAxYThjMEBNT01TPg==","referencesHeader":"PDEyMTUzNjM1ODcuNjUwLjMwMjM4Lm00NUB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":36234,"prevInTime":36209,"nextInTime":36211,"topicId":36210,"numMessagesInTopic":0,"msgSnippet":" Yea.  When Sorscha and I go to Starbucks or","messageBody":"<div id=\"ygrps-yiv-1855067810\">&lt;&lt;My kids&#39; lives are So far from that it&#39;s hard to imagine how it must feel <br/>\n(compared to me as a younger kid).&gt;&gt;<br/>\n<br/>\n<br/>\n<br/>\nYea.  When Sorscha and I go to Starbucks or whatever, she&#39;ll say, &quot;Get me my <br/>\nusual.&quot;   We also hang out with mostly radically unschooled kids.  If they <br/>\nare with us, they&#39;ll just chime up with their choices also.  It&#39;s <br/>\ncool~~~It&#39;s normal.<br/>\n<br/>\n<br/>\n<br/>\nWe had guest over a few weeks ago - A traditional, religious, school family. <br/>\nIt was weird because I forgot how many rules some kiddos have.  Here are a <br/>\nfew:<br/>\n<br/>\n<br/>\n<br/>\nNo you can&#39;t go on the trampoline because there is no net - NO not even if <br/>\nonly one goes at a time OR I stand and watch.<br/>\n<br/>\nNo you can&#39;t have soda or ice cream (we have a kid cabana where ice creams, <br/>\nsoda&#39;s, and waters are there for the kids&#39; takings).<br/>\n<br/>\nNo you can&#39;t run in the water on the lawn while it&#39;s being irrigating.<br/>\n<br/>\nNo you can&#39;t have another piece of cake.<br/>\n<br/>\nNo you can&#39;t throw a soda bomb (the kids are each allowed to throw one soda <br/>\nbomb when they&#39;re here).<br/>\n<br/>\nNo you can&#39;t ride the scooter or the bike because you don&#39;t have your helmet <br/>\n(we have a long driveway and the yard is completely fenced.  No downhill or <br/>\nanything).<br/>\n<br/>\n<br/>\n<br/>\nDuring the BBQ I had asked the kids to next time try and go in one of the <br/>\nback doors because there were old rugs to catch the mud and dirt there <br/>\n(instead of it going directly onto the wood floor at the front door). <br/>\nSorscha was already in the front door and said, &quot;Okay.&quot;  The other two kids <br/>\nstopped and then walked completely around the house to go in the other door. <br/>\nThe mom said, &quot;Well at least MY kids listen.&quot;  I remember thinking to myself <br/>\nthat it so odd to see someone go completely around the house when they were <br/>\nalready walking in a door.  Just odd, kind of like a programmed robot.<br/>\n<br/>\n<br/>\n<br/>\nSo later I was cleaning up and I found something interesting.  We just had <br/>\nour home restuccod so it&#39;s all bright and happy cream.  I found mud balls <br/>\nthrown at the house and all our little plant plaques dug up from the garden. <br/>\nI smiled to myself thinking, &quot;Hmmm, those little robots are not as <br/>\nprogrammed as one thinks they are. It&#39;s kind of like one of those movies <br/>\nwhere the robots find out they have power & choices and eventually, well, <br/>\nyou know.&quot;  &lt;g&gt;<br/>\n<br/>\n~Crystal~</div>","specialLinks":[]}],"prevTopicId":36266,"nextTopicId":36274}}