{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Always learning","postDate":"1340612097","msgId":67930,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCMzVFMDUzLURBREItNDJDMC1BRTUyLTI4Q0Y5QjdDMTY5RkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzNDA1ODI3OTUuOTE0NDguWWFob29NYWlsTmVvQHdlYjE2MDMwMS5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PDEzNDA1ODI3OTUuOTE0NDguWWFob29NYWlsTmVvQHdlYjE2MDMwMS5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":67926,"nextInTopic":0,"prevInTime":67929,"nextInTime":67931,"topicId":67926,"numMessagesInTopic":0,"msgSnippet":"-=-I think Sandra posted- Something about as unschoolers we start at the premise of our children are always learning rather than coming around to that idea","messageBody":"<div id=\"ygrps-yiv-1620817760\">-=-I think Sandra posted- <br/>\nSomething about as unschoolers we start at the premise of our children are always learning rather than coming around to that idea from a different perspective. .. I remember you saying it was a subtle but important distinction. -=-<br/>\n<br/>\nIt might have been something Joyce wrote.<br/>\n<br/>\nCan you rephrase your question?  On a list called &quot;always learning&quot; I&#39;m unclear on whether you&#39;re asking if we believe children are always learning. :-)<br/>\n<br/>\n-=-I&#39;ve been digging though the last few digests, but can&#39;t seem to find it.-=-<br/>\n<br/>\nDon&#39;t dig through digests.  Use the link at the bottom of the digest to go to the yahoo group page, and search for a phrase you remember or to look at topics and then down through who posted.<br/>\n<br/>\n-=-I&#39;m wondering if you can restate that comment and give an example? what each might look like, especially for parents of young children? I think those of us who are relatively new to this philosophy may not have internalized this distinction.-=-<br/>\n<br/>\nSometimes I say that learning should be the primary consideration.<br/>\nThen sometimes other people say it&#39;s secondary.  <br/>\nAnd those are people who live the same kinds of busy learning-lives.<br/>\n<br/>\nAll as one substance, all in the same swirl, people who care about learning can create an environment where the relationships and the atmosphere set  up to make learning happen effortlessly, all the time.<br/>\n<br/>\nI could tell stories of yesterday, and my day spent mostly in the presence of a seven year old boy.  We played with games (and I do mean played WITH games--not playing them linearly or competitively, but seeing what they can do), we listened to music (he used to only like music he had heard before, but he has changed over the three years I&#39;ve known him--and I sent a note to Holly, who had been the one to tell me he only likes music he knows, that he&#39;s over that  hump), we traded playing a song to listen to while we played games, but ended up looking at videos on YouTube (he had never heard Caribbean Amphibian, sung by Kermit/Jim Henson, but it was part of the soundtrack of my children&#39;s lives), and in and around that, he used two suitcase scales to see how hard he could pull up (with a strap under his foot), and spent some of the day playing spies with a friend of his all around the house, and we watched &quot;Enchanted&quot; with his parents, and if I thought about it I could write two thousand words, but I won&#39;t.<br/>\nAnyone who wishes I had written more should go and read some of these:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/typical\">http://sandradodd.com/typical</a><br/>\n<br/>\nThose are too old to include Minecraft, so fold this in:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames/minecraft\">http://sandradodd.com/videogames/minecraft</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/videogames/minecraftlearning\">http://sandradodd.com/videogames/minecraftlearning</a><br/>\n<br/>\nFrom looking up a Pokemon song, we saw a walkthrough by a guy showing a Pokemon mod on Minecraft (it doesn&#39;t work very well yet, he said, so don&#39;t tell your kids yet), and the video had a warning for language.  It wasn&#39;t &quot;bad language&quot; so much as comedic teen reference to something Adam doesn&#39;t know about yet, and I said it wasn&#39;t so bad, it was just things not to be said in front of grandmothers.    He didn&#39;t know or care any more than he had, and we decided the guy was actually quite polite and nice to share what he knew about Minecraft that way.  Then Adam went into the next room to try some of the digging and bridge-building he had seen in the video.<br/>\n<br/>\nI don&#39;t need to know or even think about the many things Adam was learning yesterday.  After years of experience with my own now-grown kids, I know that if I started naming things I could.   And one subtle theme was The Beatles.  Unstated as a theme.  I was sneaking Beatles knowledge into him, because the fish and chips shop in his town does Elvis nights he goes to, but they&#39;re going to start having a Beatles night and he doesn&#39;t think he likes the Beatles, because he doesn&#39;t know any of their songs.  So I slipped three Beatles songs in, subtly.  One was &quot;Pollen, yes I have Pollen, and she keeps callin&#39; me back again&quot; (&quot;I&#39;ve Just Seen a Face,&quot; turned to a song for the iPad game Bees, about going back to the hive with the pollen collection to see if the queen bee has any new brothers for us), and when Adam wanted to show me a trick and asked for some circus music, I put on &quot;Being for the Benefit of Mr. Kite,&quot; without mentioning it was the Beatles.<br/>\n<br/>\nWe also watched the beginning and the end of the England/Italy game, though we missed the long middle so I could make noise with him in the other room while his parents watched the game with better focus than explaining things to a non-soccer-playing American and answering Adam&#39;s random and unrelated questions. :-)<br/>\n<br/>\nAt first unschoolers trust that learning happens easily in other families, and then eventually they start to see it in their own, and the trust starts turning to confidence.  Eventually the confidence can turn to unshakable conviction and undeniable fact, but that can&#39;t happen all at once.  There are no shortcuts, except not to take other paths and come back, because deschooling starts over each time.<br/>\n<br/>\nCaribbean Amphibian:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.youtube.com/embed/glQPQalXQVg?rel=0\">http://www.youtube.com/embed/glQPQalXQVg?rel=0</a><br/>\n<br/>\nComposed by Mark Saltzman &quot;...As a script and song writer for Sesame Street, Mark received seven Emmy Awards and wrote dozens of songs, including Caribbean Amphibian. For the movies, he wrote The Adventures of Milo and Otis, and has written screenplays for Universal, Sony, and Disney.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[{"url":"http://www.youtube.com/embed/glQPQalXQVg?wmode=opaque","type":"VIDEO"}]},{"userId":136234893,"authorName":"Shauna Reisewitz","from":"Shauna Reisewitz &lt;shaunareisewitz@...&gt;","profile":"shaunareisewitz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Always learning","postDate":"1340582795","msgId":67926,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNDA1ODI3OTUuOTE0NDguWWFob29NYWlsTmVvQHdlYjE2MDMwMS5tYWlsLmJmMS55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":67930,"prevInTime":67925,"nextInTime":67927,"topicId":67926,"numMessagesInTopic":0,"msgSnippet":"Hello,  I ve been ruminating on an idea I saw mentioned (and it could be the core belief of unschooling) a couple days ago-- I think Sandra posted-  ","messageBody":"<div id=\"ygrps-yiv-755120001\">Hello, <br/>\n<br/>\nI&#39;ve been ruminating on an idea I saw mentioned (and it could be the core belief of unschooling) a couple days ago-- I think Sandra posted- <br/>\nSomething about as unschoolers we start at the premise of our children are always learning rather than coming around to that idea from a different perspective. .. I remember you saying it was a subtle but important distinction. <br/>\n<br/>\nI&#39;ve been digging though the last few digests, but can&#39;t seem to find it.  I&#39;m wondering if you can restate that comment and give an example? what each might look like, especially for parents of young children? I think those of us who are relatively new to this philosophy may not have internalized this distinction.<br/>\n<br/>\nThanks. Shauna<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":67891,"nextTopicId":67955}}