{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unmath","postDate":"1062728702","msgId":79919,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0LjNlYWM3ODNjLjJjODk0ZGZlQGFvbC5jb20+"},"prevInTopic":79913,"nextInTopic":0,"prevInTime":79918,"nextInTime":79920,"topicId":79911,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/4/03 7:15:18 PM, Dnowens@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1509608434\">In a message dated 9/4/03 7:15:18 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Dnowens@...\">Dnowens@...</a> writes:<br/>\n<br/>\n&lt;&lt; I think that if they see that sometimes I <br/>\ndon&#39;t know and that I use the dictionary, encyclopedia, Google, someone else <br/>\nwho <br/>\nknows better than I, then they eventually will too. I have always responded <br/>\nthat IF he doesn&#39;t know how to spell something or what a word means that I <br/>\ntell <br/>\nhim, I don&#39;t say *look it up yourself.* I say that the kids need to be <br/>\nafforded the same respect.  &gt;&gt;<br/>\n<br/>\nI agree with you.<br/>\n<br/>\nFor anyone undecided, here&#39;s another link.  I&#39;ve sent more links today than <br/>\nany other day in my life so far! &lt;g&gt;<br/>\n<br/>\nHow Not to use Reference Materials , which is actually in favor of using <br/>\nreference materials, just not in favor of abusing kids with them.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://SandraDodd.com/aradicalthought\">http://SandraDodd.com/aradicalthought</a><br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":113028911,"authorName":"Dnowens@aol.com","from":"Dnowens@...","profile":"echomygecko","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] unmath","postDate":"1062723058","msgId":79913,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI0LjIxY2RkMjlhLjJjODkzN2YyQGFvbC5jb20+"},"prevInTopic":79911,"nextInTopic":79919,"prevInTime":79912,"nextInTime":79914,"topicId":79911,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/4/03 07:14:31 PM Central Daylight Time, lrjem1@dodo.com.au writes: Hi all, thought I d chip in here with a bit of a story about my Emma","messageBody":"<div id=\"ygrps-yiv-2046258161\">In a message dated 9/4/03 07:14:31 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lrjem1@...\">lrjem1@...</a> writes:<br/>\nHi all,<br/>\n<br/>\nthought I&#39;d chip in here with a bit of a story about my Emma (11) &lt;g&gt;<br/>\n<br/>\nDH, Emma and I were doing the dishes and Emma asked us to quiz her on the <br/>\ntimes tables.  I hate doing that.  I think it&#39;s boring.  Robert (dh) hates doing <br/>\nthat, too, so in a joking voice he said &quot;Why don&#39;t you figure out how many <br/>\ntimes I&#39;ve had to tell you to turn the shower off properly?&quot;<br/>\n<br/>\nEmma&#39;s face lit up and she dropped her tea towel and grabbed pencil and <br/>\npaper.  She sat at the table and worked out how many years she&#39;s been having <br/>\nshowers, how many times a week etc.  We just cracked up laughing about it and she <br/>\nthought it was great fun.<br/>\n*****************************************************************<br/>\n<br/>\nI love this story! That and with everyone discussing teens wanting &quot;more&quot; and <br/>\nquestions about what it is exactly that they have learned; I have been <br/>\nthinking about a situation here in our own home. <br/>\n<br/>\nDarin brings home his profit and loss statements and other things that <br/>\nrequire him to add up long columns of numbers and other math chores I hate. <br/>\nRecently, the kids have taken to sitting by him at the table and he will call out <br/>\nnumbers for them to put into the calculator. Sometimes, if the numbers are smaller <br/>\nand more manageable, they will write them out and figure in their heads. <br/>\nOften when the kids are doing that, they will ask things like *what does such and <br/>\nsuch equal?* I always just tell them, but Darin makes them figure it out. He <br/>\ngets, not mad really, but always says that I need to stop telling them. This <br/>\nhappens other times as well. One will ask me something about, (example here) how <br/>\nfast is the speed of light. I will tell them if I know or look it up if I <br/>\ndon&#39;t and then tell them. Darin again, will say *Don&#39;t do that, let them look it <br/>\nup themselves.* He thinks that is more unschooling. I think that if I MAKE <br/>\nthem look everything up or ALWAYS figure out what 67+85 is, or shove the <br/>\ndictionary at them every time they ask how to spell something or what a word means, <br/>\nthat I will quash their enthusiasm. I think that if they see that sometimes I <br/>\ndon&#39;t know and that I use the dictionary, encyclopedia, Google, someone else who <br/>\nknows better than I, then they eventually will too. I have always responded <br/>\nthat IF he doesn&#39;t know how to spell something or what a word means that I tell <br/>\nhim, I don&#39;t say *look it up yourself.* I say that the kids need to be <br/>\nafforded the same respect. He says the kids are different, that the need to LEARN <br/>\nhow to do these things themselves. I think that they will learn by observing me. <br/>\n<br/>\nThe other evening, Moly and I were watching the movie We Were Soldiers. The <br/>\nMel Gibson character made a comment about how his platoon had the same number <br/>\nas Custer&#39;s, and then wondered aloud if Custer knew he was sending his men into <br/>\na slaughter. Moly wanted to know who Custer was, and what the guy was talking <br/>\nabout. So I told her about Custer and how he and his men went to fight the <br/>\nSioux and what all happened. Then I said, well maybe it was Pawnee, bring me <br/>\nthat book over there. She kind of got huffy with me and asked if I was going to <br/>\nbe giving her a history lesson like Daddy. I laughed and said, no I just wanted <br/>\nto make sure I was giving her the correct information, and that now I was <br/>\ncurious myself. I was right the first time, it was the Sioux. But I got a glimpse <br/>\nof what it is like for her when Darin insists that she do for herself all the <br/>\ntime, and what it is like for kids in school, or school-at-home. I wonder how <br/>\nI can help him, and sometimes I wonder if maybe he is more right in how he <br/>\ndoes things with the kids than I am. (the next day, I found Moly on the porch <br/>\nswing with that same book reading all about Custer.) <br/>\n<br/>\nAny insight?<br/>\n<br/>\n~Nancy<br/>\n<br/>\nGenius may have its limitations, but stupidity is not thus handicapped. <br/>\nElbert Hubbard <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":133582445,"authorName":"Lee-Ann and Robert Storer","from":"&quot;Lee-Ann and Robert Storer&quot; &lt;lrjem1@...&gt;","profile":"pookie2au_still","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unmath","postDate":"1062720633","msgId":79911,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYzQwMWMzNzM0MiQyMGJkMDQ4MCQ5YzUwZmVhOUBwYmVsbD4=","referencesHeader":"PDY1MjI1NjMuMTA2MjcxNjUzOTA0NS5KYXZhTWFpbC5wYW1zb3Jvb3NoQG1hYy5jb20+"},"prevInTopic":0,"nextInTopic":79913,"prevInTime":79910,"nextInTime":79912,"topicId":79911,"numMessagesInTopic":0,"msgSnippet":"Hi all, thought I d chip in here with a bit of a story about my Emma (11)  DH, Emma and I were doing the dishes and Emma asked us to quiz her on the times","messageBody":"<div id=\"ygrps-yiv-969381107\">Hi all,<br/>\n<br/>\nthought I&#39;d chip in here with a bit of a story about my Emma (11) &lt;g&gt;<br/>\n<br/>\nDH, Emma and I were doing the dishes and Emma asked us to quiz her on the times tables.  I hate doing that.  I think it&#39;s boring.  Robert (dh) hates doing that, too, so in a joking voice he said &quot;Why don&#39;t you figure out how many times I&#39;ve had to tell you to turn the shower off properly?&quot;<br/>\n<br/>\nEmma&#39;s face lit up and she dropped her tea towel and grabbed pencil and paper.  She sat at the table and worked out how many years she&#39;s been having showers, how many times a week etc.  We just cracked up laughing about it and she thought it was great fun.<br/>\n<br/>\nWhen we were doing school at home (before their stint at public school), it was like pulling teeth to get Emma to sit and do math.  She does it now when it means something to her and it&#39;s fun because it&#39;s not forced.  <br/>\n<br/>\nMy three are getting plenty of math just by playing &#39;Harvest Moon&#39; on the playstation, fiddling around with their pocket money and gosh just about everything they do during the day has some kind of math in it.  <br/>\n<br/>\nYou know this is the first time I&#39;ve even really thought about math since we finished up with school a year and a half ago.  Wow, I love unmath.<br/>\n<br/>\nIt&#39;s hard to &#39;chill&#39; and let the learning happen but things are way happier if parents can do that.<br/>\n<br/>\nLee-Ann in Australia :)<br/>\nup to Return of the Jedi in the video connection game<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":79917,"nextTopicId":79922}}