{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":140416022,"authorName":"luv_2_craft","from":"&quot;luv_2_craft&quot; &lt;unschoolerof3@...&gt;","profile":"luv_2_craft","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Whining kids and selective hearing","postDate":"1051204647","msgId":65689,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4OTY3NytmZmphQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":65688,"nextInTime":65690,"topicId":65689,"numMessagesInTopic":0,"msgSnippet":"... hrs, of it I tend to get a bit snippy with him. I am a proud mommy of a hyperactive 4 year old who has a tendancy to go on a verbal whiney rampage at least","messageBody":"<div id=\"ygrps-yiv-286969875\"><blockquote><span title=\"ireply\">&gt; Yes, I am trying to validate all of his complaints, after about 6 <br/>\n </span></blockquote>hrs, of it I tend to get a bit snippy with him. <br/>\n<br/>\n<br/>\nI am a proud mommy of a hyperactive 4 year old who has a tendancy to <br/>\ngo on a verbal whiney rampage at least daily regarding something I <br/>\nusually cannot change to his satisfaction.<br/>\n<br/>\nI have learned to give myself a mental vacation during these times. I <br/>\nhave learned to block out the unimportant complaining. Then when a <br/>\nlegitimate complaint comes forth like &quot;I&#39;m hungry&quot; I am all ears <br/>\nagain.<br/>\n<br/>\nIt takes practice, but if you could live thru the discomfort of <br/>\nbearing this child into the world, you can train yourself to have <br/>\nselective hearing.  Men have this inherantly. The last time I told my <br/>\nhusband to pick up his socks, he used this selective hearing and the <br/>\nsocks remained there. If I were to tell him someone was choking on a <br/>\nlego, then he&#39;d be there so quick! Thus the glories of selective <br/>\nhearing.  <br/>\n<br/>\nIt doesn&#39;t work all the time.  The husband still can&#39;t use his to <br/>\nblock out the loudness of the kids at play when he&#39;s trying to <br/>\nconcentrate on something.  I usually choose not to take that time to <br/>\ndo anything and let the kids have their fun.  But still...<br/>\n<br/>\nThe whining is not playtime noise.  It is meant to get mom&#39;s <br/>\nattention.  It is like a siren.  A bell.  A signal that something is <br/>\nnot right.  <br/>\n<br/>\nBabies cry, little kids whine, older kids complain and adults vent. <br/>\nAh, the glories of communication.  We are human and we are never <br/>\nfully satisfied with things.  That&#39;s why we are capable of adaptation <br/>\nand changing. <br/>\n<br/>\nLittle kids don&#39;t have the aptitude yet to understand the world <br/>\naround them fully; what they can change and what they cannot and how <br/>\nto adapt to any of it. So they whine.<br/>\n<br/>\nMoms are a bit different.  We can understand the difference between <br/>\nthese things and we are pros at adaptation.  We also understand when <br/>\na child is just whiney or when it is a serious need requiring our <br/>\nattentiveness.<br/>\n<br/>\nYou CAN selectively tune out the whining. You can also note to your <br/>\nchild that you are going to ignore until the complaining stops and <br/>\nexplain that you cannot change what cannot be changed (kids believe <br/>\nmoms are superhuman sometimes).<br/>\n<br/>\nI would also look into diet, general stresses, television <br/>\nprogramming, sleep disturbances, and playtime situations to see if <br/>\nthere isn&#39;t an underlying stress that is causing your child to be <br/>\noverly sensitive. This goes back to the part where mommies can change <br/>\nsome things. :)<br/>\n<br/>\nGood luck.  And remember that raising a child is like growing a <br/>\nflower garden.  The more effort you put into it, the more beautiful <br/>\nand wonderful it will be.<br/>\n<br/>\n<br/>\n(forgive this if it second posts.... had trouble posting the 1st time <br/>\nit didn&#39;t show up)</div>","specialLinks":[]}],"prevTopicId":65640,"nextTopicId":65604}}