{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":107520860,"authorName":"hmsclmyboy@aol.com","from":"hmsclmyboy@...","profile":"hmsclmyboy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] more serious aspects RE: re plug in drug conversation","postDate":"1049127905","msgId":62508,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0LmRmNTUzODMuMmJiOWM1ZTFAYW9sLmNvbT4="},"prevInTopic":62504,"nextInTopic":0,"prevInTime":62507,"nextInTime":62509,"topicId":62504,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"more serious aspects RE: re plug in drug conversation","postDate":"1049123897","msgId":62504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlkLjM2ZTY2YjZlLjJiYjliNjM5QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":62508,"prevInTime":62503,"nextInTime":62505,"topicId":62504,"numMessagesInTopic":0,"msgSnippet":"In a message dated 3/31/03 5:49:49 AM, fetteroll@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-1758423449\">In a message dated 3/31/03 5:49:49 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:fetteroll@...\">fetteroll@...</a> writes:<br/>\n<br/>\n&lt;&lt; In a loving home where children are respected and where the parents are<br/>\ninvolved with their kids lives (not glued to them but are with them and<br/>\naware of what&#39;s going on with them and what interests them) TV loses much of<br/>\nthe power that is found in homes where children are leading separate lives<br/>\nfrom their families. &gt;&gt;<br/>\n<br/>\nWhat Joyce said about schools separating parents and children is true.  <br/>\nAnd television under those circumstances can be just one more, yet smaller, <br/>\nfactor in the child being influenced by something other than the parent.  It <br/>\ncan be the straw that broke the camel&#39;s back, and it&#39;s also the only one the <br/>\nparents really see happening.  School they try to fantasize as  happy, <br/>\nproductive, and good for the kids.  And maybe they miss their kids.  So when <br/>\nthe kids are home, it&#39;s easy for the parents to villify television.  <br/>\n<br/>\nI think the logic goes this way:<br/>\n<br/>\nParents see their kids changing and becoming more distant.   <br/>\nParents have identified school as good and necessary.<br/>\nSchool can&#39;t be the evil destruction.<br/>\nMust be something else.<br/>\nThey see the child choosing to look at TV instead of at them.<br/>\n<br/>\nNew homeschoolers and structured homeschoolers are often working from that <br/>\nsame model, that there is an education children need to obtain.  They don&#39;t <br/>\nsee those science/language/history/math units being represented well on <br/>\ntelevision.   So they see television as a factor that might somehow prevent <br/>\nthe acquisition of needed information.  That minute spent watching television <br/>\nis a minute not spent reading about The Battle of Waterloo.<br/>\n<br/>\nIn the past week at our house Waterloo has been presented to my children <br/>\ntwice.  Once by Black Adder Bact details, but few people do and fewer yet <br/>\nreally need to.  But they know France lost, they know it was not long after <br/>\nthe revolution, and they know the English commander was Wellington.   That <br/>\nmight be enough to enable them to mark the right answer on a variety of <br/>\nmultiple choice questions that might come along, or to get a right response <br/>\non Jeopardy.  <br/>\n<br/>\nA few weeks ago, there was an Amadeus marathon here (various people watching <br/>\nit more than once, DVD commentary, &quot;come see this good part&quot;) and so there&#39;s <br/>\nanother point of information for them.  They can tell by costumes that Mozart <br/>\nis before Waterloo, and by reference to Marie Antoinette being Queen of <br/>\nFrance.  <br/>\n<br/>\nIt doesn&#39;t matter in what order people learn things like that, or from what <br/>\nsources, as long as they&#39;re sorting and connecting in their heads to create <br/>\ntheir own model and understanding of history and the world and people, music, <br/>\ncostume, motive, results and affects.<br/>\n<br/>\nIt might be hard to just work into conversation, but it&#39;s not hard to work <br/>\ninto conversation after seeing that if Black Adder dropped his time machine <br/>\non Wellington, England could&#39;ve been using francs instead of pounds.<br/>\n<br/>\nOh!  And Leonardo da Vinci&#39;s notebook (which the kids know about in part from <br/>\nDover coloring books) came up in both the Eddie Izzard DVD (in the French <br/>\npart--he said just like da Vinci, he too had designed a helicopter that <br/>\ndidn&#39;t work) and on Black Adder (and Marty knew that was a fictional mention, <br/>\nbut still totally understood the reference).<br/>\n<br/>\nIf they learn from a board game or comedy, it&#39;s probably going to stick <br/>\nbetter than if they try to read a history textbook.  If they learn from a <br/>\nbook about armor and weapons and horses, they learned it just as well as if <br/>\nthey learned it from a list of the kings of France.   Too many people confuse <br/>\nfactoid with knowledge.  You can have the knowledge in vague yet very <br/>\ncolorful ways, which would make the list of facts make sense.  If you have a <br/>\nlist of facts without clues about what, why, when or how, it&#39;s just your eyes <br/>\ngazing at words, and Charlemagne will look just like Louis XIV on that list, <br/>\na string of letters, black on white.<br/>\n<br/>\nThere&#39;s no hurry to learn it, there&#39;s no reason to learn it in order, and in <br/>\nfact, teaching things &quot;in order&quot; is one of the major causes of kids deciding <br/>\nat some point in school that they hate science or history or math.  Because <br/>\nthey didn&#39;t like one part in &quot;the order,&quot; they&#39;d rather never even look at <br/>\nthe rest than suffer one more moment, and they shut down.<br/>\n<br/>\nHowever pictures, sounds, and ideas get into my kids is good.<br/>\nWhatever doesn&#39;t turn them against learning is good.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":40541,"nextTopicId":61950}}