{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"Home Education Magazine  by way of Home","from":"Home Education Magazine &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  March 2002","postDate":"1015037204","msgId":32197,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkxZGI4YTVlZDhkMDFiZEBbMjA4LjI2LjIzNS44MF0+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":32196,"nextInTime":32198,"topicId":32197,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS March 2002 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS, a free","messageBody":"<div id=\"ygrps-yiv-256295716\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nMarch 2002<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS, a free monthly newsletter published by<br/>\nHome Education Magazine and full of the best internet resources,<br/>\nhomeschooling news, announcements and article excerpts. For more<br/>\ninformation on Home Education Magazine, see the end of this<br/>\nnewsletter or visit our web site at http://home-ed-magazine.com. For<br/>\nsubscription information for the newsletter, scroll to the end,<br/>\nreading everything in between. Send your comments and questions to<br/>\neditor Carol Narigon at HEM-Newsletter@....<br/>\n<br/>\nIn the March issue:<br/>\n<br/>\n~ The Golden Age of Homeschooling ~<br/>\n~ Free Resource Guide ~<br/>\n~ Women&#39;s History Month ~<br/>\n~ Unschooling ~<br/>\n~ Ask Carol ~<br/>\n~ Lists ~<br/>\n~ Free Gatto ~<br/>\n~ Archives ~<br/>\n~ Educating Marilyn ~<br/>\n~ Unclassified Ads ~<br/>\n~ The Final Word (content warning) ~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\n   One cannot consent to creep when one has an impulse to soar. ~ Helen Keller ~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nTHE GOLDEN AGE OF HOMESCHOOLING<br/>\nhttp://www.home-ed-magazine.com/HEM/192.html<br/>\n<br/>\n&quot;It was a little scary to take or keep one&#39;s children out of school<br/>\nwhen sending them was the societal norm. The word &#39;homeschooling&#39;<br/>\nitself was suspect, a sort of code word for going against the grain,<br/>\nrefusing to conform, seeking that almost mythical &#39;road less traveled<br/>\nby.&#39;<br/>\n<br/>\nWe who identified ourselves as homeschoolers breathed a sigh of<br/>\nrelief and collectively cheered when John Holt appeared on The Phil<br/>\nDonohue Show, when Linda Dobson&#39;s article was published in Good<br/>\nHousekeeping, when the Colfax boys gained admission to Harvard.<br/>\n<br/>\nIn our book &#39;Alternatives in Education&#39; (Tonasket, WA. Home Education<br/>\nPress. 1987, 1992) writer and homeschooling father Earl Gary Stevens<br/>\nnotes in the Introduction, &#39;There is a mythological golden age of<br/>\npublic education in our consciousness, captured in Norman Rockwell<br/>\npaintings, cinema, television, and modern literature, in which the<br/>\npublic school is a positive place where the children of our nation<br/>\ncome together to learn academics and social skills.&#39;<br/>\n<br/>\nHas homeschooling progressed beyond a similar &#39;golden age,&#39; when the<br/>\nterm evoked a certain edgy rebelliousness, a commonality of striving<br/>\nfor acceptance, seeking approval and validation from society, the<br/>\nmedia, legislators, and the education bureaucracy? We sought<br/>\nacceptance for a different way; have we found more than we bargained<br/>\nfor in society&#39;s embrace? Homeschooling, like public schooling, faces<br/>\never-increasing challenges, but the greatest threat to homeschooling<br/>\nmay be its own unquestionable success.<br/>\n<br/>\nThe word &#39;homeschooling&#39; has become a much-sought-after appellation,<br/>\nappearing in advertisements for educational toys, distance learning,<br/>\ncomputer software, and school district alternative education<br/>\nprograms. The term has developed a certain cachet, so it now has a<br/>\nperceived &#39;selling power.&#39; But like the word &#39;organic,&#39; which once<br/>\nmeant grown without chemicals and now merely seems to mean grown, the<br/>\nword &#39;homeschooling&#39; is losing all functional meaning.<br/>\n<br/>\nIn Power For All or For None (1998), a book of essays by Everett<br/>\nReimer and his daughter Katherine Reimer, a poem by Everett Reimer<br/>\nincludes these lines:<br/>\n<br/>\nMere words cannot convey the truth<br/>\nThey always miss it, pass it by<br/>\nDistort it just enough to change<br/>\nA perfect truth to partial lie.<br/>\n<br/>\nThe perfect truth is that homeschooling works. The partial lie - no,<br/>\nthe perfect lie - is that what may come to pass for homeschooling in<br/>\nthe years ahead will work as well.<br/>\n~~ excerpt from Helen Hegener, Publisher&#39;s Note, March/April HEM ~<br/>\n<br/>\nYou can read the rest of this article, as well as a couple of<br/>\narticles on the dangers of cyber homeschooling from the March/April<br/>\nissue at the address above, but you&#39;ll have to get the magazine--the<br/>\none you hold in your hands--to read them all! See subscription<br/>\ninformation at the end of this newsletter or visit your local<br/>\nbookseller to get your copy today.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM&#39;S FREE INFORMATION AND RESOURCE GUIDE<br/>\nhttp://www.home-ed-magazine.com/ORD/mtrlst.html<br/>\n<br/>\nHEM&#39;s free information and resource guide has been updated. This<br/>\nonline guide offers excerpts from Home Education Magazine&#39;s writers<br/>\nand columnists, sharing helpful advice, resource recommendations,<br/>\ninsights and experiences and much more - making this a widely<br/>\nrespected field guide to homeschooling!<br/>\n<br/>\nCheck this guide for recommendations on the best homeschooling books,<br/>\ncorrespondence programs, online services, software programs, support<br/>\ngroups and organizations, and more. This is the place to begin your<br/>\nhomeschooling research, and provides valuable support for those<br/>\nalready on the homeschooling journey. Download it at the address<br/>\nabove!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nWOMEN&#39;S HISTORY MONTH<br/>\n<br/>\nMarch is National Women&#39;s History month, a time for recognizing and<br/>\ncelebrating the accomplishments throughout history.<br/>\n<br/>\nFor the best resources, try the National Women&#39;s History Project at<br/>\nhttp://www.nwhp.org.<br/>\n<br/>\nA subscriber suggested the National Women&#39;s Hall of Fame site, which<br/>\noffers a list of famous women, at http://www.greatwomen.org . Thanks<br/>\nfor the tip!<br/>\n<br/>\nTo delve further into women&#39;s history, follow some of the many links<br/>\nfrom About.com at http://womenshistory.about.com .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\nhttp://www.unschooling.com<br/>\n<br/>\nI&#39;m sure you enjoyed Sandra Dodd&#39;s treatise on Gilligan&#39;s Isle in the<br/>\nFebruary issue of this newsletter. Sandra explains that the Gilligan<br/>\nessay was written several years ago, and her daughter Holly no longer<br/>\nwanders around the neighborhood naked. She&#39;s long outgrown such<br/>\nfreedoms.<br/>\n<br/>\n&quot;There was a debate about whether someone could use schedules and<br/>\ntextbooks and still be considered unschooling. The consensus was that<br/>\ntextbooks and unschooling are not mutually exclusive. Most<br/>\nunschoolers have textbooks in the house - sometimes lots of<br/>\ntextbooks. The schedule part is less cut-and-dried. You see, there&#39;s<br/>\nthe coercion part of the equation, too. There&#39;s the trusting your<br/>\nchild&#39;s innate ability and interest in learning. I think the<br/>\nstrongest and truest statement was something along the lines of,<br/>\n&#39;Until you completely trust in your children and unschooling you<br/>\nwon&#39;t get the full benefit.&#39; I didn&#39;t believe it at the time, and I<br/>\ndon&#39;t think most people do until they try it. I believe it now,<br/>\nbecause I see it working in my own family.&quot; ~~ Lisa Caryl ~~<br/>\n<br/>\nUnschooling.com offers message boards, essays, an email list and more<br/>\njust for unschoolers. Check it out!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nASK CAROL<br/>\n<br/>\nI wear two hats for HEM-one is the editor hat for this newsletter;<br/>\nthe other is a columnist hat for Home Education Magazine, the<br/>\noriginal print version that&#39;s been supporting homeschoolers for over<br/>\n20 years.<br/>\n<br/>\nEvery other month, I ask people to send me questions and I promise to<br/>\nanswer as many as I can in future columns. Although I don&#39;t answer<br/>\nthem in this newsletter, where the space is just too tiny for my BIG<br/>\nadvice, I do answer them in every issue of Home Education Magazine. A<br/>\ncouple of them are online (http://www.home-ed-magazine.com), but most<br/>\nof them you have to read in the magazine.<br/>\n<br/>\nI really like to get your questions-any questions at all, even if you<br/>\nthink your question is stupid and you&#39;re the only one who has your<br/>\nparticular problem (it&#39;s probably not true). So, help me out with<br/>\nthat other hat, and send me your questions. I even have a special<br/>\nemail address: askcarol@... . Of course, I don&#39;t<br/>\npromise I can answer every question (especially if you don&#39;t send<br/>\none!), but I try to respond to each one, whether I use it for a<br/>\ncolumn or not. What are you waiting for? (~ CN ~)<br/>\n<br/>\n   &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nLISTS!<br/>\n<br/>\nHome Education Magazine provides several venues for networking and<br/>\nbuilding community among homeschoolers and those interested in<br/>\nhomeschooling including an impressive array of email lists. Join a<br/>\nfew today!<br/>\n<br/>\n* HEM Networking--for discussing a wide range of topics.<br/>\nWebsite: http://groups.yahoo.com/community/HEM-Networking<br/>\nOr send a blank email to: HEM-Networking-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM Support Groups: for discussing support group related.<br/>\nWebsite: http://groups.yahoo.com/community/HEM-SupportGroups<br/>\nOr send a blank email to: HEM-SupportGroups-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM Conferences: for discussing conference-related issues.<br/>\nWebsite: http://groups.yahoo.com/community/HEM-Conferences<br/>\nOr send a blank email to: HEM-Conferences-subscribe@yahoogroups.com<br/>\n<br/>\n* Homeschooling Resources: for news, press releases, product reviews, etc.<br/>\nWebsite: http://groups.yahoo.com/community/HomeschoolingResources<br/>\nOr a blank email to: HomeschoolingResources-subscribe@yahoogroups.com<br/>\n<br/>\n* Homeschooling Movie Lover: for discussing movies and videos.<br/>\nWebsite: http://groups.yahoo.com/community/Homeschooling-Movielovers<br/>\nOr a blank email  to: Homeschooling-Movielovers-subscribe@yahoogroups.com<br/>\n<br/>\n* Public and Private School Programs and Homeschooling: for<br/>\ndiscussion of the issues surrounding school programs and<br/>\nhomeschooling.<br/>\nWebsite: http://groups.yahoo.com/community/PPSP-H<br/>\nOr send a blank email  to:PPSP-H-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM Writers: for networking contributors to Home Education<br/>\nMagazine, as well as well-known speakers, authors, conference<br/>\norganizers and homeschoolers who enjoy writing. Website:<br/>\nhttp://groups.yahoo.com/community/HEM-Writers<br/>\nOr send a blank email  to HEM-Writers-subscribe@yahoogroups.com<br/>\n<br/>\n* History of Homeschooling: for discussing the history of home education.<br/>\nWebsite: http://groups.yahoo.com/community/HistoryofHomeschooling<br/>\nOr a blank email  to: HistoryofHomeschooling-subscribe@yahoogroups.com<br/>\n<br/>\n* Homeschool History, Politics and Religion List: for an in-depth<br/>\ndiscussion of how political and religious concerns have affected<br/>\nhomeschooling over the years.<br/>\nWebsite: http://groups.yahoo.com/community/HomeschoolHistory-Politics-Religion<br/>\nOr a blank email to:<br/>\nHomeschoolHistory-Politics-Religion-subscribe@yahoogroups.com<br/>\n<br/>\n* HEM Letters: for discussion of homeschool issues to be considered<br/>\nfor publication in HEM&#39;s Letters and Discussion section.<br/>\nWebsite: http://groups.yahoo.com/group/HEM-Letters<br/>\nOr send a blank email to: HEM-Letters-subscribe@yahoogroups.com<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nFREE GATTO!<br/>\nhttp://www.johntaylorgatto.com<br/>\n<br/>\nJohn Taylor Gatto, a New York State Teacher of the Year, shares<br/>\nunusual opinions on public schooling in the US, especially for a guy<br/>\nwho was so successful in the system. If you haven&#39;t read his book<br/>\n&#39;Dumbing Us Down,&#39; you should. If you want to read his latest book,<br/>\n&#39;The Underground History of American Education,&#39; you can buy it,<br/>\ncheck it out at the library or read it at his website. The first five<br/>\nchapters are already there and the rest of the book is promised in<br/>\nthe future.<br/>\n<br/>\nCheck out David Albert&#39;s tribute to John Taylor Gatto in the<br/>\nMarch/April issue of HEM.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nARCHIVES<br/>\n<br/>\nLaura Weldon&#39;s Question and Answer column is now archived at the HEM<br/>\nwebsite. Just go to http://www.home-ed-magazine.com/wlcm_hsinf.html .<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nEDUCATING MARILYN<br/>\n<br/>\nThe Guinness Book of World Records says Marilyn Vos Savant has the<br/>\nhighest IQ of any living person. She also writes a question/answer<br/>\ncolumn that appears in Parade, a weekly supplement Sunday newspaper<br/>\nsupplement. In a recent issue, the following question about<br/>\nhomeschooling was asked and answered:<br/>\n<br/>\nReader:  My husband and I are thinking of home-schooling. Do you recommend it?<br/>\n<br/>\nMarilyn:  I believe that traditional homeschooling (one parent stays<br/>\nhome to teach all children in the family up through the high school<br/>\nyears) can be a fine alternative to an unacceptable public school,<br/>\nbut I would not recommend it broadly unless most schools were<br/>\ninadequate and most parents could teach everything from literature to<br/>\nphysics. And I don&#39;t believe that either is true.<br/>\n<br/>\nIf home-schooling were institutionalized, half of the youthful<br/>\npotential of Americans would go unfulfilled. Say that a bright young<br/>\nparent sacrifices a rewarding career to stay home and teach the<br/>\nchildren. When those children grow up, would half of them (one parent<br/>\nfrom each married couple) also sacrifice their potential to stay home<br/>\nand teach their own children? If so, then much of the result of<br/>\nhome-schooling would be the creation of more home-schooling parents<br/>\nfor the next generation, and so on.<br/>\n<br/>\nMaybe home-schoolers can justify this loss. If so, please write. I<br/>\nbelieve that home-schooling is a noble experiment done for the right<br/>\nreasons, and I hope to hear why it may prove to be a success.<br/>\n<br/>\nTo write Marilyn please use the following address:<br/>\n<br/>\nAsk Marilyn<br/>\nParade Magazine<br/>\n711 Third Avenue<br/>\nNew York, NY  10017<br/>\ne-mail: marilyn@...<br/>\n<br/>\nMarilyn may be smart, but it looks like she may need an education<br/>\nabout homeschooling. Here&#39;s your chance to be heard!<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this<br/>\nnewsletter, please contact the editor at<br/>\nHEM-Newsletter@....<br/>\n<br/>\n________<br/>\n<br/>\nALPHA OMEGA<br/>\nprayingwife.com<br/>\n<br/>\nBest price curriculum! 30% off Alpha Omega curriculum during March<br/>\n2002 when you order from www.prayingwife.com/homeschool. All good<br/>\ndeals are given from the Lord.  It is favor given unto His chosen.<br/>\nPraise the Lord in all things for He is faithful!<br/>\n________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nNew science and art books for spring and summer are in...several new<br/>\nseries to engage and delight your children and you. Shop online and<br/>\nearn FREE books at: http://www.UsborneAmerica.com. For personal<br/>\nshopping service, email SharonVE@... or call 888-474-8499 toll<br/>\nfree. Sharon Vander Ende, Supervisor, Usborne America.<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\ngnarlymath.com<br/>\n<br/>\nMATH IN ANCIENT MAYA. The current issue of our free hilarious math<br/>\nnewsletter reports on Guatemala in 256AD, when the Mayan civilization<br/>\nwas at its peak. . See how kids lived in ancient Maya by subscribing,<br/>\nfor free, at http://www.gnarlymath.com, where you can also download<br/>\nfree examples of our CD-ROM Solid Gold Gnarly Math. For a refresher<br/>\ncourse in Algebra, Geometry, Trig, and Probability, or to give your<br/>\nkids a fun and exciting outlook on math, try our moneyback-guaranteed<br/>\nCD.<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nresourcefulhomeschooler.com<br/>\n<br/>\nAttention unschoolers and eclectic homeschoolers! Looking for<br/>\nsomething to do? The Resourceful Homeschooler carries great books,<br/>\nscience materials and kits, learning games, and the most interesting<br/>\nsoftware. AND here is your opportunity to clear some shelf space!<br/>\nList or consign your surplus or used homeschooling materials. Store<br/>\ncredit available for consignments. Visit<br/>\nhttp://www.resourcefulhomeschooler.com or call (877)523-0494.<br/>\nMaterials to involve, inspire and support independent learners of all<br/>\nages!<br/>\n_________<br/>\n<br/>\nFREE ONLINE VEGETABLE GARDENING TRAINING FOR HOMESCHOOLERS!<br/>\ngrowfood.com<br/>\n<br/>\nGet world renowned Dr. Jacob R. Mittleider&#39;s &#39;Mittleider Basics<br/>\nCourse&#39; FREE at www.growfood.com.  Go to Online Education section and<br/>\nenjoy.  Books, Natural Mineral Nutrients & CD ROM&#39;s also available.<br/>\nAlso, look at the Garden Master CD, with $70 in Mittleider gardening<br/>\nbooks and manuals and a great program to take your children through<br/>\nevery step of the gardening process.  Took 3 years & $100,000 to<br/>\ncreate and costs only $29.95.  Look in Products under Garden Master.<br/>\n<br/>\n__________<br/>\n<br/>\nTEACH YOUR CHILD TO READ!  TRY ONLINE LESSONS NOW FOR FREE!<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading<br/>\nprogram that will give your child a real advantage by systematically<br/>\nteaching essential skills and strategies ensuring reading success and<br/>\nconfidence. Outstanding fast results!  After just five 20-minute<br/>\nanimated, interactive episodes, children read their first Headsprout<br/>\nbook. Act quickly! For a limited time you can try out Headsprout<br/>\nReading FOR FREE!<br/>\nhttp://www.headsprout.com Please enter the promotional code: HENB2<br/>\n_________<br/>\n<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\nhttp://www.home-ed-magazine.com<br/>\n<br/>\nIn the March/April issue of Home Education Magazine, you&#39;ll enjoy<br/>\narticles on John Taylor Gatto, dragons, setting sail, make believe<br/>\nand charter schools. Columns include: Peter Kowalke works with Jamie<br/>\nHopkins; Linda Dobson pulls up a chair and drinks tea; Laura Weldon<br/>\nbrings home an ADD teen; Ann Zeise learns to drive; and Barbara<br/>\nTheisen births a colt. Other columnists include Larry and Susan<br/>\nKaseman, Sandra Dodd, Becky Rupp and Carol Narigon. HEM also offers<br/>\nclassified ads, letters and discussion, pen pals and networking, and<br/>\nmore.<br/>\n<br/>\nSubscriptions to Home Education Magazine are currently $32.00 for one<br/>\nyear/6 issues; single issue $6.50. Home Education Magazine, PO Box<br/>\n1083, Tonasket WA 98855; for orders: toll-free 1-800-236-3278; email<br/>\norders@.... MC/Visa cards accepted. DON&#39;T MISS IT!<br/>\n<br/>\n_________<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\nTHINKERS GO TO THE BACK OF THE LUNCH LINE<br/>\n<br/>\n&quot;There&#39;s no such thing as public education. Education happens to<br/>\nexactly one person at a time.<br/>\n<br/>\nThere are some things that you just have to do by yourself. Even if<br/>\nI&#39;m your teacher, you can&#39;t have my education; your education is a<br/>\nprivate task that is given to yourself.<br/>\n<br/>\nThe education of someone or everyone else doesn&#39;t add a single item<br/>\nto your stock of knowledge.<br/>\n<br/>\nAnd there&#39;s no such thing as compulsory education. Education is<br/>\nsomething that each of us gives to ourselves or allows others to give<br/>\nus. Otherwise we call it indoctrination or assault; we don&#39;t call it<br/>\nknowledge.<br/>\n<br/>\nIn my son&#39;s elementary school, there is a slogan plastered on the<br/>\nwalls:  &#39;Have the courage to stand up for what you believe.&#39;<br/>\n<br/>\nNo one actually sees it at all: It&#39;s a form of wallpaper. It&#39;s not<br/>\nintended to communicate information but to sweeten our day with words<br/>\nso often repeated that no one&#39;s brain gets any traction on them<br/>\nanymore. They are nothing more than a set of high-sounding nonsense<br/>\nsyllables.<br/>\n<br/>\nBesides that, it is utterly dishonest. The people who put up that<br/>\nsign want anything, everything, except for your child to have the<br/>\ncourage to stand up for what she believes.<br/>\n<br/>\nThe reason my son, Vince, and I were in the school in the first place<br/>\nwas because Vince had refused to take a test. He sat there quietly<br/>\nbut simply refused to make any marks on the paper, although he<br/>\nthought the test was easy.<br/>\n<br/>\nAsked why, Vince said that the material was stupid, and that it was<br/>\nexactly the same thing he had been learning in health for the last<br/>\nseveral years:  how to make decisions, how to deal with stress, etc.<br/>\n-- stuff Vince doesn&#39;t think bears repeating...<br/>\n<br/>\nYou could put it like this: It had suddenly dawned on Vince that he<br/>\nwas the one who was responsible for his own education...&quot;<br/>\n<br/>\nThis is an excerpt from an essay by Crispin Sartwell, chair of<br/>\nhumanities and sciences at the Maryland Institute College of Art. You<br/>\ncan read the rest of it at his website, but BE WARNED-many of you<br/>\nwill be offended by other material at the site. In fact, almost all<br/>\nof us can probably find something offensive there. Some may even find<br/>\nthe end of this essay offensive. In spite of some good rhetoric<br/>\npenned by his dad, Vince takes the test anyway. At least he didn&#39;t<br/>\nhave to wait for his lunch.  www.crispinsartwell.com (1.28)<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To<br/>\nsubscribe, visit our web site at<br/>\nhttp://www.home-ed-magazine.com/wlcm_hemnewsltr.html or send an email<br/>\nto majordomo@... with the words subscribe<br/>\nhem-online-newsletter followed by your name@your address.com in the<br/>\nbody of the email. (e.g. subscribe hem-online-newsletter<br/>\nyouremailaddress). To unsubscribe, send an email to<br/>\nmajordomo@... with the words unsubscribe<br/>\nhem-online-newsletter followed by your name@your address.com in the<br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter<br/>\nyouremailaddress). To change the address at which you receive the<br/>\nnewsletter, unsubscribe your old address and then subscribe to your<br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\nHEM-Newsletter@...<br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":32192,"nextTopicId":32199}}