{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":117801964,"authorName":"Todd M.","from":"&quot;Todd M.&quot; &lt;Ozarkren@...&gt;","profile":"trozark","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[CA] Deadline for home schools","postDate":"1034700811","msgId":46425,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDUuMS4xLjYuMi4yMDAyMTAxNTExNTEyOC4wMDllZjJjMEBlZGlzb24ucmlwaW50ZXJuZXQuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":46424,"nextInTime":46426,"topicId":46425,"numMessagesInTopic":0,"msgSnippet":"Saturday, October 12, 2002 Deadline for home schools Oct. 11, 2002 Orange County Register Editorial ","messageBody":"<div id=\"ygrps-yiv-568337461\">Saturday, October 12, 2002<br/>\n<br/>\nDeadline for home schools<br/>\nOct. 11, 2002 Orange County Register Editorial<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www2.ocregister.com/ocrweb/ocr/article.do?id=6429&section=COMMENTARY&year=2002&month=10&day=11\">http://www2.ocregister.com/ocrweb/ocr/article.do?id=6429&section=COMMENTARY&year=2002&month=10&day=11</a><br/>\n<br/>\nHalloween frights could come early this year for home-schooling families. <br/>\nOct. 15 marks the last day home schools may file required private-school <br/>\naffidavits with the California Department of Education. This is a departure <br/>\nfrom previous years, when the affidavits were filed with county departments <br/>\nof education.<br/>\n<br/>\nAfter Oct. 15, parents will find out how serious Superintendent of Public <br/>\nInstruction Delaine Eastin is in trying to outlaw home-schooling. In <br/>\nAugust, she announced that California law by her reading doesn&#39;t allow home <br/>\nschooling. As she explained in a Sept. 1 letter to the Register, &quot;The <br/>\nclassic &#39;home school&#39;- where children are taught by their parent who does <br/>\nnot have a teaching credential - is not a legal means of complying with <br/>\ncompulsory education law, which means that home-schooled children are truant.&quot;<br/>\n<br/>\nBut she&#39;s wrong. A home school is legal because it is a private school, <br/>\nsometimes called a parent-operated private school, which clearly is allowed <br/>\nby state law. And Education Code Section 44237(b)(4) even allows &quot;a parent <br/>\nor legal guardian working exclusively with his or her children.&quot;<br/>\n<br/>\nThe shift to the state for filing the affidavit is an attempt by state <br/>\neducation authorities to locate home-schoolers, Michael Smith, president of <br/>\nthe Home School Legal Defense Association, told us. Although located in <br/>\nVirginia, his group is closely watching California&#39;s situation and is ready <br/>\nto defend in court any of its members who are challenged by the government.<br/>\n<br/>\nHe said the state figures that anybody filing an affidavit &quot;with five <br/>\nstudents or less is a home schooler,&quot; instead of a more traditional private <br/>\nschool, which also must fill in the form but the Department of Education <br/>\nconsiders legitimate (for now).<br/>\n<br/>\nHe said that, if the Department of Education does go after home-schoolers, <br/>\nit will do so through local district attorneys. The procedure would be for <br/>\na local D.A. to file truancy charges against a home-schooling family, which <br/>\nmeans a child has been absent from a public or private school for more than <br/>\nthree days. The parents then are given an opportunity to get the child in <br/>\nschool before being prosecuted in court.<br/>\n<br/>\nOrange County District Attorney Tony Rackauckas was not available to talk <br/>\nto us yesterday. But his spokesperson, deputy D.A. Susan Kang Schroeder, <br/>\ntold us, &quot;We&#39;re going to look at every case that comes in to see if a crime <br/>\noccurred. But we won&#39;t say with a broad stroke that these kinds of people <br/>\nwill be prosecuted.&quot;<br/>\n<br/>\nGiven the nature of Orange County as a place that appreciates freedom more <br/>\nthan Ms. Eastin, and where in the 1998 election she got just 45 percent of <br/>\nthe vote here (compared to 54 percent statewide), we hope - and even expect <br/>\n- Mr. Rackauckas will avoid such prosecutions, instead spending scarce <br/>\nresources on real crimes.<br/>\n<br/>\nMr. Smith said parents who are home-schooling, or considering it, should <br/>\nnot worry that they will be hauled into court. He believes state law is <br/>\nclear and will hold up in court.<br/>\n<br/>\nWe hope so. Home-schooling, which has produced many notable success <br/>\nstories, obviously is a choice that should be made by parents, not the <br/>\neducation establishment as represented by Ms. Eastin.<br/>\n<br/>\n(The affidavit is available online: www.cde.ca.gov/privateschools. <br/>\nInstructions are provided there, but more information is available at the <br/>\nsite of the Home School Legal Defense Association: www.hslda.org. The <br/>\nInternet also is chock-full of home-schooling sites.)<br/>\n<br/>\nTodd<br/>\n------<br/>\nYou&#39;re just jealous because the voices are talking to ME! &lt;g&gt;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://rambleman.tripod.com/index.html\">http://rambleman.tripod.com/index.html</a></div>","specialLinks":[]}],"prevTopicId":46391,"nextTopicId":46406}}