{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":155049550,"authorName":"rpofwarwick@aol.com","from":"rpofwarwick@...","profile":"rpofwarwick","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Our Rights vs. Power Institutions","postDate":"1074469095","msgId":89332,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3RTQ0MzlCLjFCMEZFODIwLjNGRjY2MEJCQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":89331,"nextInTime":89333,"topicId":89332,"numMessagesInTopic":0,"msgSnippet":"Hi All, I thought that sharing this recent case would be appropriate considering we ve been talking about a person s rights and the medical establishment and","messageBody":"<div id=\"ygrps-yiv-1936367364\">Hi All,<br/>\n<br/>\nI thought that sharing this recent case would be appropriate considering we&#39;ve been talking about a person&#39;s rights and the medical establishment and other powerful institutions trying to claim control over our bodies and children.  Even though this case is in PA, it is the first of its kind and the impact of its outcome will have a profound effect across the country.<br/>\n<br/>\nWarmly,<br/>\n<br/>\nRegina<br/>\n<br/>\nThe Citizens Voicehome                          <br/>\nWoman hits hospitals&#39; stance that she agree to C-section <br/>\nBy Lisa Napersky , Citizens&#39; Voice Staff Writer 01/17/2004A Plymouth<br/>\nwoman who was ordered by a Luzerne County judge to consent to a<br/>\nCaesarean section delivery of her baby said Friday she was appalled by<br/>\nthe treatment she received at two area hospitals. <br/>\n<br/>\nWhile she was in labor Tuesday night, Amber Marlowe, Academy Street,<br/>\nPlymouth, said she spent hours defending her right to deliver her baby<br/>\nvaginally.<br/>\n<br/>\nShe and her husband, John, drove to three different hospitals before she<br/>\nfound a doctor who would respect her wishes.<br/>\n<br/>\n&quot;It was very upsetting,&quot; stated Marlow, who gave birth vaginally to a<br/>\nhealthy baby girl Thursday morning in Moses Taylor Hospital, Scranton.<br/>\n&quot;All this just because I didn&#39;t want an operation.&quot;<br/>\n<br/>\nAfter Marlowe refused to consent to a C-section and checked herself out<br/>\nof Wilkes-Barre General Hospital Wednesday morning, the hospital took<br/>\nlegal action against her. Hospital workers claimed that an ultrasound<br/>\nindicated Marlowe&#39;s fetus weighed 13 pounds and the lives of the mother<br/>\nand the baby would be in jeopardy if the operation weren&#39;t performed.<br/>\n<br/>\nAt the request of Wyoming Valley Health Care Systems, Luzerne County<br/>\nPresident Michael Conahan signed an order Wednesday appointing the<br/>\nhospital as legal guardian for the unborn child.<br/>\n<br/>\nJudge Conahan also ordered that the parents &quot;are hereby temporarily<br/>\nrestrained from refusing to consent to a C-section delivery of their<br/>\nunborn fetus if the professional medical judgment of WVHCS and the<br/>\ntreating obstetrician is that such a procedure is necessary.&quot;<br/>\n<br/>\nThe preliminary injunction ordering Marlowe to submit to the C-section<br/>\nwas delivered to her residence, but she never received the document.<br/>\n<br/>\n&quot;They kept wanting to cut me open to get the baby. I think they may have<br/>\nactually sent police to our house, but we weren&#39;t home,&quot; said Marlowe.<br/>\n&quot;I kept telling them I&#39;ve already had six kids, and the biggest one<br/>\nweighed 12 pounds and there were no problems.&quot;<br/>\n<br/>\nMarlowe said when she started having contractions Tuesday night, she<br/>\nwent to Mercy Hospital, Wilkes-Barre, because it was close to her home.<br/>\nAfter medical personnel performed an ultrasound, Marlowe said she was<br/>\ninformed the baby was going to weigh more than 11 pounds and a doctor<br/>\ninsisted that she undergo a C-section operation, even though there were<br/>\nno apparent problems.<br/>\n<br/>\n&quot;They told me there was no way they would let me deliver the baby<br/>\nnaturally because the doctor didn&#39;t want a lawsuit,&quot; said Marlowe. &quot;I<br/>\nhad a friend who died during a C-section, and I was afraid to do it that<br/>\nway.&quot;<br/>\n<br/>\nEven when the couple offered to sign papers promising not to file a<br/>\nlawsuit, the doctor refused, explained Marlowe. She said staff members<br/>\nat Mercy Hospital called security when she told them she was leaving.<br/>\n<br/>\nShe and her husband next drove to Wilkes-Barre General Hospital. Marlowe<br/>\nwas admitted at 10 p.m., and a second ultrasound was done.<br/>\n<br/>\nDoctors there reached the same conclusion as those at Mercy Hospital.<br/>\nThey also refused to deliver the baby vaginally, claiming it was too<br/>\ndangerous because of the size of the fetus.<br/>\n<br/>\nThroughout the night, said Marlowe, nurses and doctors told her &quot;horror<br/>\nstories&quot; about how her baby was going to be handicapped if she didn&#39;t<br/>\nhave the operation. She checked herself out at 11 a.m.<br/>\n<br/>\n&quot;I told them, forget it - I&#39;m leaving. Then I came up here (Moses<br/>\nTaylor) and had my baby the proper way,&quot; she stated. &quot;The doctor here<br/>\nnever even suggested a C-section. <br/>\n<br/>\nThey did an ultrasound and blood work and continued to monitor me, and<br/>\nthere was no problem.&quot; In the civil complaint filed against the<br/>\nMarlowes, who are referred to as Jane and John Doe in court documents<br/>\nbecause of patient confidentiality, plaintiffs are listed as the WVHCS<br/>\nand Baby Doe.<br/>\n<br/>\n&quot;Even in the absence of present fetal distress and even with ongoing<br/>\nfetal monitoring, a vaginal delivery of this size fetus could result in<br/>\ncomplications occurring during the delivery ... and result in<br/>\nunavoidable death or serious impairment to the baby,&quot; states the<br/>\ncomplaint. &quot;Baby Doe, a full term viable fetus, has certain rights,<br/>\nincluding the right to have decisions made for it, independent of its<br/>\nparents, regarding its health and survival.&quot;<br/>\n<br/>\nAccording to the suit, John and Amber Marlowe cited religious reasons<br/>\nfor not wanting to have the operation. The complaint also states that<br/>\nduring one of Marlowe&#39;s previous pregnancies, the baby suffered shoulder<br/>\nimpairment because of the size of the fetus. The couple said neither<br/>\nallegation is true, and that the main reason for wanting vaginal<br/>\ndelivery was fear of having an operation.<br/>\n<br/>\nMarlowe said she and her husband are contemplating filing a lawsuit<br/>\nagainst Mercy and General hospitals for causing them distress.<br/>\n<br/>\n_______________________________________________________<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.timesleader.com/mld/timesleader/7730516.htm\">http://www.timesleader.com/mld/timesleader/7730516.htm</a><br/>\n<br/>\nPosted on Sun, Jan. 18, 2004<br/>\nHospital faces fight in birth dispute <br/>\nA now-moot Luzerne County court order for a Caesarian section will see a<br/>\nchallenge. <br/>\n<br/>\nBy TERRIE MORGAN-BESECKER <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:tmorgan@...\">tmorgan@...</a><br/>\n<br/>\nWILKES-BARRE - Concerned his case could impact other pregnant women, a<br/>\nPlymouth man said Friday he&#39;s working with a national reproductive<br/>\nrights group to challenge a court order that sought to force his wife to<br/>\nundergo a Caesarean section against her will. <br/>\nJohn Marlowe said he&#39;s pressing on with the case - even though the order<br/>\nis moot since his wife already gave birth to an 11 pound, 9 ounce baby -<br/>\nbecause he doesn&#39;t want other couples to endure the stress they did as<br/>\nthey battled hospital officials regarding their decision. <br/>\n&quot;It&#39;s more than my wife. What happens to the next lady that goes in<br/>\nthere?&quot; Marlowe said. &quot;If they get away with this, what it&#39;s telling<br/>\npeople across the country is a hospital has a right to do what it wants,<br/>\nand the woman has no rights.&quot; <br/>\nMarlowe&#39;s wife, Amber, checked out against medical advice from<br/>\nWilkes-Barre General Hospital on Wednesday morning after physicians<br/>\nthere insisted she have a Caesarean section because of concerns about<br/>\nthe fetus&#39; weight, which was estimated at 13 pounds. She later gave<br/>\nbirth vaginally at Moses Taylor Hospital in Scranton. <br/>\nUnbeknownst to the Marlowes, after they left General Hospital, attorneys<br/>\nfor Wyoming Valley Healthcare System sought a court order to gain<br/>\nguardianship of the fetus in case the Marlowes returned to their<br/>\nhospital. The order, granted without the Marlowes&#39; knowledge, forbade<br/>\nthem from refusing a Caesarean section if doctors there deemed it<br/>\nmedically necessary. <br/>\nKevin McDonald, spokesman for the health-care system, said Friday the<br/>\nhospital stands by its decision to seek the order. &quot;These were really<br/>\nunique circumstances. We did what we believed was in the best interest<br/>\nof the patient.&quot; <br/>\nMcDonald said as far as the health system is concerned the legal dispute<br/>\nis over. <br/>\n&quot;The injunction was only effective if she came to our hospital and we<br/>\nhad to do a Caesarean section. Since that didn&#39;t happen, the order is<br/>\nmoot,&quot; he said. <br/>\nBut Lynn Paltrow, an attorney specializing in women&#39;s reproductive<br/>\nrights, said the issue goes far deeper than the Marlowes. <br/>\n&quot;This is not a conflict between a pregnant woman and a fetus. It is a<br/>\nconflict between a pregnant woman and her fetus against the raw power of<br/>\nthe state to impose an unnecessary surgical procedure on a woman&#39;s own<br/>\nbody.&quot; <br/>\nPaltrow, of the National Advocates for Pregnant Women in New York City,<br/>\nsaid she&#39;s working with the Marlowes to find a Pennsylvania attorney to<br/>\nfight Conahan&#39;s order. She said she believes the couple might also have<br/>\na civil case against the hospital for violating their rights. <br/>\nMarlowe said he and his wife are still considering their options and<br/>\nmight file suit seeking monetary damages. But he said money is not the<br/>\nkey factor motivating him. <br/>\n&quot;We&#39;re talking civil liberties issues, not suing for money,&quot; he said.<br/>\n&quot;Right now you have a judge saying a hospital has the right to claim<br/>\nguardianship of an unborn fetus and guardianship after it is born.<br/>\nThat&#39;s unacceptable. We need to set a precedent that a hospital cannot<br/>\nhave higher rights than the parents.&quot;</div>","specialLinks":[]}],"prevTopicId":89195,"nextTopicId":89322}}