{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":185008026,"authorName":"wesschool3","from":"&quot;wesschool3&quot; &lt;wesschool3@...&gt;","profile":"wesschool3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"dazed, confused--YES!","postDate":"1085537560","msgId":94728,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5MHVlbytlczQzQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":94727,"nextInTime":94729,"topicId":94728,"numMessagesInTopic":0,"msgSnippet":"Hi, I am a few weeks new to navigating this site and have been mostly confused as to how exactly to get around.  Alas, I fear not...I am as new to unschooling","messageBody":"<div id=\"ygrps-yiv-254939384\">Hi, I am a few weeks new to navigating this site and have been mostly <br/>\nconfused as to how exactly to get around.  Alas, I fear not...I am as <br/>\nnew to unschooling and just as scared yet I am moving forward with my <br/>\nfingers crossed and my intuitive ear pressed firmly to my childs <br/>\nchest!  My 10 yo son came home to &quot;BE&quot; after attending a Waldorf <br/>\nschool since kindergarten. Although his coming home was a reaction to <br/>\na long overdue decision to finally let him be who He came here to <br/>\nbecome..not who I or his father or even the well-intended teachers of <br/>\nhis school would have him be.  It was like my head all of a sudden <br/>\ncame bursting though the clouds that had surrounded my best intuitive <br/>\nknowing about this child who came to me/us.  There was no turning my <br/>\nback on this knowledge once I fully understood what was being asked <br/>\nof me.  I was to bring my son home and allow him the opportunities to <br/>\ngrow and strive and succeed and falter and guess and know and not <br/>\nknow...to fully become who he decides to become!  As a mother who is <br/>\nlimited only by her humanness, I began schooling the way he and I <br/>\nthought he&#39;d like it...it looked like school, but not like a Waldorf <br/>\nschool.  That was nice and it lasted a month or so, just until the <br/>\nnewness wore off.  Then I struggled and pressed him and fear welled <br/>\nup in me about the unknowns and the what if&#39;s about his future.  He <br/>\nfought back against my oppessive tendencies and reminded me on a <br/>\ndaily basis that I was turning into the teacher who&#39;d we just <br/>\nreleased him from and he was hurting.  I stopped cold in my tracks <br/>\nbecause I really heard him, I really saw his wounded boy spirit--I <br/>\nwept alot that couple of weeks...<br/>\nWhat I am so utterly grateful for is my intuitive nature and my quick <br/>\nturn arounds...which have led me to find &quot;unschooling.&quot;  This feels <br/>\nlike all the &quot;rights&quot; that I&#39;ve felt with my son-from conception to <br/>\nhome-birthing, to not vaccinating, to homeopathy, to Waldorf (while <br/>\nit held him and nurtured) and now to feel this newest path of seeking <br/>\nand believing he will lead his own unique way to knowledge. <br/>\nUnschooling is the YES in our lives today--thank you for being here <br/>\nwhen I needed to find the defintion of my feelings.</div>","specialLinks":[]}],"prevTopicId":94583,"nextTopicId":94514}}