{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":8,"messages":[{"userId":332164648,"authorName":"Rippy and Graham Dusseldorp","from":"Rippy and Graham Dusseldorp &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] arguing","postDate":"1328632774","msgId":65426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCMTlGMTgzLUFDQjUtNDFBOS05MTEyLTNFNzE2NjFCODA4QkBnbWFpbC5jb20+","inReplyToHeader":"PDY0MTk1NzM5ODU3QzQyQUFCMDY3ODUxNkVGOTk5NjBFQFJ1c3NldFBlYXI+","referencesHeader":"PDg5MTQ5OTBGLTc1QzgtNDRDRS1BREVCLUExODVGQUYyQUJFNEBTYW5kcmFEb2RkLmNvbT4gPENBT09UYVhQRFJ6YzVjVGM5VVZnbVRQTXg2YVAwSjBEYk40aD11SDFfQVFzcWc9SnNWQUBtYWlsLmdtYWlsLmNvbT4gPDY0MTk1NzM5ODU3QzQyQUFCMDY3ODUxNkVGOTk5NjBFQFJ1c3NldFBlYXI+"},"prevInTopic":65421,"nextInTopic":0,"prevInTime":65425,"nextInTime":65427,"topicId":65406,"numMessagesInTopic":0,"msgSnippet":"... Sandra s coming to stay with my family for a few days at the end of June. When I told my children that she would be visiting, I said you know the mama","messageBody":"<div id=\"ygrps-yiv-1039752112\">--- Her dedication and presence in online unschooling circles is like a golden cocoon around our children. ---<br/>\n<br/>\nSandra&#39;s coming to stay with my family for a few days at the end of June. When I told my children that she would be visiting, I said &#39;you know the mama that gives me good ideas and helps me think good thoughts? She&#39;s coming here to visit&#39;. <br/>\n<br/>\nWhen my children asked which one (there are so many helpful people on this list : ), I specified Sandra: <br/>\n<br/>\n&#39;Remember when I was a bit afraid to get you a Wii? She was one of the people that helped me think about it and see that it was a good idea and that maybe I should get you one sooner, rather than later.&#39; <br/>\n<br/>\n&#39;Oh, we like her!&#39; they exclaimed.<br/>\n<br/>\nI like that I have someone that is on my children&#39;s side when I have blind spots.<br/>\n<br/>\nRippy<br/>\n(Gianluca 7, Gisele 5)<br/>\n<br/>\np.s. I never posted about my Wii concerns, but was encouraged by all of you who dedicate time to write about radical unschooling. I think all the experienced unschooling moms (and Bob) that write regularly on Always Learning are like a golden cocoon around our children.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] arguing","postDate":"1328600145","msgId":65421,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyRDQ0QzRCLUU1ODEtNDhFQS05MDA2LTY2RTc2RDgzODIwOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBT09UYVhQRFJ6YzVjVGM5VVZnbVRQTXg2YVAwSjBEYk40aD11SDFfQVFzcWc9SnNWQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDg5MTQ5OTBGLTc1QzgtNDRDRS1BREVCLUExODVGQUYyQUJFNEBTYW5kcmFEb2RkLmNvbT4gPENBT09UYVhQRFJ6YzVjVGM5VVZnbVRQTXg2YVAwSjBEYk40aD11SDFfQVFzcWc9SnNWQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":65414,"nextInTopic":65426,"prevInTime":65420,"nextInTime":65422,"topicId":65406,"numMessagesInTopic":0,"msgSnippet":"-=- In describing the second group, Sandra used that person s phrase about thinking her kids were atrophying on the couch. -=- I used three people s terms","messageBody":"<div id=\"ygrps-yiv-1535021653\">-=- In describing the second group, Sandra used that person&#39;s phrase about<br/>\nthinking her kids were &quot;atrophying on the couch.&quot;-=-<br/>\n<br/>\nI used three people&#39;s terms from various discussions there over that day and the day before that.<br/>\n<br/>\nI&#39;m nearly 12 hours behind on e-mail.  I have company and we were out and about, and then made dinner and Holly&#39;s boyfriend was here and then we watched a video and I realized I hadn&#39;t done a just-add-light.  Marty came home all excited about having gotten to use his girlfriend&#39;s dad&#39;s industrial oven to heat-treat some steel armor bits (shoulders) he had made (and put linseed oil on it to try to turn the steel black).  And I told him about our trip up the tram, and showed him photos, and he told me about the snow he had driven through to get home from Bernalillo, where his girlfriend lives.<br/>\n<br/>\nI would like to read all the e-mail, but I probably should go to sleep instead.<br/>\n<br/>\n-=-Our families<br/>\nhave let themselves be held up under harsh lights to be questioned and<br/>\ndiscussed. Not always easy at all. We have made our credibility and<br/>\nintegrity matters of public scrutiny and feel the pressure to be<br/>\nscrupulously honest and clear at all times about absolutely everything.-=-<br/>\n<br/>\nI&#39;m glad to have a life so exciting that I can&#39;t always keep up with e-mail.  I don&#39;t mind sharing some of the details of that, because I know (not &quot;I think&quot;, but I KNOW) that sharing my life honestly has helped some people.    Learning from others who have shared their stories of progress, confusion and success is rewarding and relaxing.  <br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] arguing","postDate":"1328562093","msgId":65414,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjg1NjIwOTMuMjc3MjguWWFob29NYWlsTmVvQHdlYjEyMjUwNy5tYWlsLm5lMS55YWhvby5jb20+","inReplyToHeader":"PENBT09UYVhQRFJ6YzVjVGM5VVZnbVRQTXg2YVAwSjBEYk40aD11SDFfQVFzcWc9SnNWQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDg5MTQ5OTBGLTc1QzgtNDRDRS1BREVCLUExODVGQUYyQUJFNEBTYW5kcmFEb2RkLmNvbT4gPENBT09UYVhQRFJ6YzVjVGM5VVZnbVRQTXg2YVAwSjBEYk40aD11SDFfQVFzcWc9SnNWQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":65413,"nextInTopic":65421,"prevInTime":65413,"nextInTime":65415,"topicId":65406,"numMessagesInTopic":0,"msgSnippet":"Pam wrote: ***I think this is an issue of people not having a high enough level of Gardner s interpersonal intelligence to understand the point of what ","messageBody":"<div id=\"ygrps-yiv-974930218\">Pam wrote:<br/>\n<br/>\n<br/>\n***I think this is an issue of people not having a high enough level of<br/>\n<br/>\nGardner&#39;s &quot;interpersonal intelligence&quot; to understand the point of what<br/>\nsomeone else says when it isn&#39;t prefaced with enough explanation. (And if<br/>\nthat Facebook poster is reading this, she&#39;s maybe angry and hurt again<br/>\nbecause she thinks I&#39;m insulting her and saying she&#39;s not smart.)***<br/>\nI have a really good friend who totally gets this stuff!  Our own code word for talking about that idea is, self awareness.  When either of us use that, we are referring to the idea that a person can look internally and critically examine their own thoughts and ideas, they are comfortable enough with themselves and aware enough to do that.  She does life coaching, so for her, when she has a client who is not at all self aware, what that person can take from a coaching session is going to be very minimal compared to someone who is more self aware and can look inwards to see and change things.<br/>\n<br/>\nSandra quoted me:<br/>\n<br/>\n***What kind of relationship does a mom or dad have with their kids if they are really sensitive and defensive? If their child corrects them, will they respond that way to their child?***<br/>\n<br/>\nand added:<br/>\n<br/>\n***Another side benefit of me &quot;letting them argue&quot; is that there never was any &quot;because I&#39;m the mom.&quot; It was &quot;Because I think this makes the best sense.&quot; So when they were teens, and now that they&#39;re young adults, they know if I suggest they tweak their thinking that it&#39;s not anything beyond my regard for their peace and progress.***<br/>\n<br/>\nI had written in that long long facebook thread a little story about Chamille and her boyfriend that she just broke up with a month ago.  I&#39;ve had a lot of time to analyze their relationship and see it in action.  That boy was never allowed to be right, NEVER.  He grew up in a home where the parents were always right.  His reaction was to never want to be wrong.  It was, in a huge part, a conditioned reaction to someone who he felt was trying to say in any way shape or form that something he was doing or saying could potentially be wrong.  In EVERY disagreement or pondering that Chamille brought to him, his reaction was ALWAYS, &quot;You&#39;re wrong and you are hurting my feelings.&quot;  I can&#39;t remember a single instance where it was something other than that.  Even with very silly things like, &quot;Could you please not keep your water glasses on that particular table because I&#39;m worried it might spill and harm my computer?&quot;  His reaction would go like this,<br/>\n &quot;I didn&#39;t put that glass there.&quot;, even though he clearly did.  So, if Chamille wanted to get a positive response at all, or the understanding that glasses of liquid shouldn&#39;t be kept in that location, she needed to first get him to see that he was actually leaving his glasses there.<br/>\n<br/>\nIt was a vicious cycle of crap.  It left her incredibly frustrated that she couldn&#39;t have an open honest dialog with the person she loved, something that she has grown used to doing because that is how we live. <br/>\n<br/>\nThat&#39;s how it can be when talking to people in unschooling discussions who literally cannot see that the words they choose to describe their children, or the thoughts behind the ideas presented are harmful.  If the person&#39;s response is, &quot;no it&#39;s not, I&#39;m not a mean person who thinks bad things about my kids, I love my kids and know them better than anyone else.&quot;, then the rest of the conversation isn&#39;t going anywhere until that person can see exactly what they are putting out there that others can see.<br/>\n<br/>\nIt gave me pause to wonder..... since it clearly is a trait that kids learn and are conditioned by, if the parent is doing that in public forums with other adults, are they doing that in their own families too?  If that&#39;s true, and I&#39;ve seen it to be that way, I think all of us would do a terrible disservice by NOT pointing it out.<br/>\nI&#39;ve seen kids run away from home because they can never be right, because the mom or dad or both must have it their way.  If a person wants unschooling to work at ALL, it needs to stop.  Unschooling simply can&#39;t unfold in that kind of environment.  Even a tiny dose of poison will still poison someone, even if slower or not as much.<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":490059542,"authorName":"Kim H","from":"&quot;Kim H&quot; &lt;kim.featherandnest@...&gt;","profile":"kimhoussenloge","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] arguing","postDate":"1328560811","msgId":65413,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY0MTk1NzM5ODU3QzQyQUFCMDY3ODUxNkVGOTk5NjBFQFJ1c3NldFBlYXI+","inReplyToHeader":"PENBT09UYVhQRFJ6YzVjVGM5VVZnbVRQTXg2YVAwSjBEYk40aD11SDFfQVFzcWc9SnNWQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDg5MTQ5OTBGLTc1QzgtNDRDRS1BREVCLUExODVGQUYyQUJFNEBTYW5kcmFEb2RkLmNvbT4gPENBT09UYVhQRFJ6YzVjVGM5VVZnbVRQTXg2YVAwSjBEYk40aD11SDFfQVFzcWc9SnNWQUBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":65412,"nextInTopic":65414,"prevInTime":65412,"nextInTime":65414,"topicId":65406,"numMessagesInTopic":0,"msgSnippet":" Everything you said Pam is so very, very true. I so loved reading this. Having not ever met Sandra in","messageBody":"<div id=\"ygrps-yiv-261287320\">&lt;&lt;&lt;...The insights Sandra has to offer are amazing...&gt;&gt;&gt;<br/>\n<br/>\nEverything you said Pam is so very, very true. I so loved reading this. Having not ever met Sandra in real life I can only imagine that she is exactly how you’ve described her. Her dedication and presence in online unschooling circles is  like a golden cocoon around our children. It is what I continually long for. Her honest and straightforwardness comes from the most wonderful place – she cares totally about the lives of children and the tender, precious relationship between parents and children. <br/>\n<br/>\nI fear that I sound like a psycho Sandra fan every time I post here as it’s usually only to glorify Sandra but I am really just a normal, unschooling-role-model deprived Aussie mum trying to take head of all that I hear on this wonderful list because I treasure it as precious gold. It sickens me every time I hear the Sandra knockers. They are so quickly offended by the very advice that they apparently desire. If only they would read the intro to these groups and read, read, read before they open their mouths. <br/>\n<br/>\nHey, and by the way, you are pretty darn special yourself, Pam. Love everything you have to say too. <br/>\n<br/>\nThe world is a much better place because of the unschooling  likes of  Sandra’s and Pam’s.<br/>\n<br/>\nKim <br/>\n<br/>\n<br/>\nFrom: Pam Sorooshian <br/>\nSent: Tuesday, February 07, 2012 7:20 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSubject: Re: [AlwaysLearning] arguing<br/>\n<br/>\n  <br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; &gt;&gt;&gt;......someone came to defend the overly sensitive, the deeply wounded,<br/>\n&gt; and a couple of people (new to unschooling, new to discussions) assured us<br/>\n&gt; that it COULD be discussed without hurting anyone&#39;s feelings ever, and<br/>\n&gt; someone said &quot;It&#39;s a shame that...&quot; (which translates to &quot;you should be<br/>\n&gt; ashamed&quot; or, if the person isn&#39;t a very careful or thoughtful writer, it<br/>\n&gt; could mean &quot;bummer.&quot; But they got it from someone who didn&#39;t mean &quot;bummer,&quot;<br/>\n&gt; they meant &quot;you should be ashamed.&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Although I think there are very sensitive people who are not at a stage of<br/>\ntheir own development where our kind of critical thinking approach is<br/>\nsomething they are able to handle, I don&#39;t think that is the main reason<br/>\npeople get hurt and defensive and angry (mostly at Sandra, sometimes at<br/>\nsome of the rest of us).<br/>\n<br/>\nOn Facebook, someone posted about the thoughts she was having because she<br/>\ndidn&#39;t want to have those thoughts and was asking how to get rid of them<br/>\n(thinking the children were atrophying on the couch when they were watching<br/>\na lot of tv).<br/>\n<br/>\nSandra responded with a description of an experiment - there would be a<br/>\ngroup where unschooling parents accept what their kids love, a group where<br/>\nparents know about unschooling but think what the kids love is bad for<br/>\nthem, and a control group that knows nothing about unschooling. In<br/>\ndescribing the second group, Sandra used that person&#39;s phrase about<br/>\nthinking her kids were &quot;atrophying on the couch.&quot;<br/>\n<br/>\nI, myself, thought this was a new and brilliant way to make the point that<br/>\nI hoped would be so clear and convincing to the person that she would be<br/>\nable to replace her thoughts about her children and tv with new ideas about<br/>\nwhat would be relationship-building for her family over the long haul. I<br/>\nLOVED it. I seemed to make the point SO obvious and I thought, &quot;Aha - what<br/>\na GREAT way to get someone to really &quot;get&quot; that the way they think about<br/>\ntheir children will have far-reaching implications on what their<br/>\nrelationship will be like for their entire lifetimes.&quot;<br/>\n<br/>\nBut some people entirely missed the point, the person who&#39;d posted<br/>\noriginally among them.<br/>\n<br/>\nShe thought Sandra used her words to mock her for the sake of humor.<br/>\n<br/>\nShe thought Sandra had insulted her and lumped her in the &quot;bad parents&quot;<br/>\ngroup.<br/>\n<br/>\nShe didn&#39;t realize Sandra had given her a gift - a tool to use to change<br/>\nher own thinking.<br/>\n<br/>\nI think this is an issue of people not having a high enough level of<br/>\nGardner&#39;s &quot;interpersonal intelligence&quot; to understand the point of what<br/>\nsomeone else says when it isn&#39;t prefaced with enough explanation. (And if<br/>\nthat Facebook poster is reading this, she&#39;s maybe angry and hurt again<br/>\nbecause she thinks I&#39;m insulting her and saying she&#39;s not smart.)<br/>\n<br/>\nPeople are usually insulting and mocking to others because it builds up<br/>\ntheir own ego - they knock someone else down to make themselves feel<br/>\nsuperior. And people accuse Sandra of that. But I know her really well. She<br/>\nhas a perfectly healthy ego and isn&#39;t at all into belittling others to<br/>\nbuild her&#39;s up at all. By speaking and writing publicly, in fact, she sets<br/>\nherself up to BE criticized and bad-mouthed in pretty ego-crushing ways;<br/>\nshe could stay quiet and not have to bear it.<br/>\n<br/>\nWhen people have a lot of interpersonal intelligence, they sometimes assume<br/>\nothers have more than they actually do. They don&#39;t realize how much they<br/>\nare leaving unsaid that others don&#39;t fill in or understand.<br/>\n<br/>\nI think this is sometimes (not always, by any means) the source of<br/>\nmisunderstanding of what Sandra offers. People have an &quot;I asked for help<br/>\nand she gave me insults,&quot; reaction when they don&#39;t get that she DID offer<br/>\nhelp - really awesome amazing help incredibly insightful help.<br/>\n<br/>\nSandra doesn&#39;t typically start out by saying things like, &quot;This might seem<br/>\ninsulting to you, but I don&#39;t mean it that way and I hope you&#39;ll take it in<br/>\nthe spirit intended. I&#39;m going to lay out an experiment with three groups<br/>\nof parents. I&#39;m not saying you are a bad person and stuck in the bad<br/>\nparents group, I&#39;m describing what would happen if you don&#39;t get yourself<br/>\nOUT of thinking the way you are, and it is great that that is what you are<br/>\ntrying to do. I&#39;m hoping that if you think about this experiment, you&#39;ll<br/>\nhave a realization about the damage that kind of thinking can do to your<br/>\nlong-term relationships with your children. I&#39;m hoping that your increased<br/>\nawareness will help you put your relationships first so that you will focus<br/>\non that. Once you start focusing on finding the value in what your children<br/>\nlove, you will discover that those old thought patterns disappear -<br/>\nreplaced by enjoyment and even surprise at how much the kids are learning.<br/>\nNow, I hope you find the following useful.&quot;<br/>\n<br/>\nAnd on and on....<br/>\n<br/>\nSandra says what she has to say. It is direct and to the point. Because<br/>\nwe&#39;re talking about the most important relationships humans can have -<br/>\nparent/child - imagined insults hurt a lot and emotions run high and people<br/>\nare very reactive. Others feel defensive on behalf of those they believe<br/>\nwere insulted. They tell Sandra she should be nicer. But Sandra is already<br/>\nspending a huge part of her life being &quot;nice&quot; - she does what she does<br/>\nentirely out of the goodness of her heart and the sheer quantity of what<br/>\nshe offers is staggering. Telling her to be nicer makes no sense - from her<br/>\npoint of view it sounds like people are telling her that being nicer means<br/>\nbeing less helpful - to soften what she says, to pat people on the back and<br/>\ntell them what they&#39;re doing is just fine, that they are the parent and<br/>\nknow what&#39;s best for their child, etc.<br/>\n<br/>\nThe insights Sandra has to offer are amazing. I&#39;ve been the beneficiary of<br/>\na lot of her help, and I&#39;ve been around to watch what she&#39;s been able to<br/>\noffer people for the past 16 or 17 years. Her ability to get to the heart<br/>\nof a matter is a direct result of her having an extraordinarily high level<br/>\nof that Gardner interpersonal intelligence. Therapists go to school for<br/>\nyears to try to develop that kind of ability. She shakes people up because<br/>\nshe gets so quickly and strongly right to the crux of the matter. I have,<br/>\nmyself, described feeling kind of an electric shock pass through me when I<br/>\nfirst heard some of what Sandra had to say. I&#39;ve felt my breath catch in my<br/>\nthroat. And, I have felt angry and hurt, too, by the way. But those were my<br/>\ninitial reactions and I used my intellect to get past my emotional<br/>\nresponses and I analyzed what she had said and I made discoveries about<br/>\nmyself and my family that significantly changed our lives for the better.<br/>\n<br/>\nWhat we do on this list (and on the Radical Unschoolers Info facebook page)<br/>\nis not easy-going casual sweet-sounding conversation. On this list, we have<br/>\nintroductory materials that everybody is asked to read before<br/>\nparticipating. We try really hard to get the idea across that this may not<br/>\nbe a good place for those who are easily insulted or sensitive to having<br/>\ntheir ideas laid out and dissected and critiqued.<br/>\n<br/>\nThere are many many people who love this stuff. It is, for me, like really<br/>\ndifficult therapy sessions - hard to get through, painful, but, at the end<br/>\nof the process, life is SO much better and it is extremely worth it. I<br/>\nwouldn&#39;t want people telling a therapist to go easier on me, be nicer, not<br/>\nto dig so deeply, to avoid causing pain, and I don&#39;t want Sandra (or<br/>\nothers) to change, either, for the sake of those who don&#39;t want to do this<br/>\nkind of work.<br/>\n<br/>\nALL that said - can we who do a lot of writing about unschooling improve<br/>\nhow we offer what we offer? ALL these years there has been nonstop<br/>\nself-evaluation going on - Sandra is at the forefront of that, too. We talk<br/>\nand talk about how we can do better, how we can help people, what will help<br/>\nthem understand more and faster, what we are learning, how we can improve<br/>\nour own lives, and so on. We get defensive sometimes and don&#39;t respond at<br/>\nour best. We have our blind spots. We have our own family issues and we<br/>\ngenerally confess openly to those, and that&#39;s not easy either. Our families<br/>\nhave let themselves be held up under harsh lights to be questioned and<br/>\ndiscussed. Not always easy at all. We have made our credibility and<br/>\nintegrity matters of public scrutiny and feel the pressure to be<br/>\nscrupulously honest and clear at all times about absolutely everything.<br/>\n<br/>\nSocrates said, &quot;The unexamined life is not worth living.&quot; That&#39;s an<br/>\nincredibly strong statement - &quot;not worth living&quot; - and I think this kind of<br/>\ndiscussion is only good for those who take that quite seriously. We are<br/>\ntrying to live deeply examined lives. That&#39;s what it is all about!<br/>\n<br/>\n-pam sorooshian<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":504505579,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] arguing","postDate":"1328559634","msgId":65412,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT09UYVhQRFJ6YzVjVGM5VVZnbVRQTXg2YVAwSjBEYk40aD11SDFfQVFzcWc9SnNWQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDg5MTQ5OTBGLTc1QzgtNDRDRS1BREVCLUExODVGQUYyQUJFNEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDg5MTQ5OTBGLTc1QzgtNDRDRS1BREVCLUExODVGQUYyQUJFNEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":65411,"nextInTopic":65413,"prevInTime":65411,"nextInTime":65413,"topicId":65406,"numMessagesInTopic":0,"msgSnippet":"... Although I think there are very sensitive people who are not at a stage of their own development where our kind of critical thinking approach is something","messageBody":"<div id=\"ygrps-yiv-1180917970\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; &gt;&gt;&gt;......someone came to defend the overly sensitive, the deeply wounded,<br/>\n&gt; and a couple of people (new to unschooling, new to discussions) assured us<br/>\n&gt; that it COULD be discussed without hurting anyone&#39;s feelings ever, and<br/>\n&gt; someone said &quot;It&#39;s a shame that...&quot; (which translates to &quot;you should be<br/>\n&gt; ashamed&quot; or, if the person isn&#39;t a very careful or thoughtful writer, it<br/>\n&gt; could mean &quot;bummer.&quot; But they got it from someone who didn&#39;t mean &quot;bummer,&quot;<br/>\n&gt; they meant &quot;you should be ashamed.&gt;&gt;&gt;&gt;&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Although I think there are very sensitive people who are not at a stage of<br/>\ntheir own development where our kind of critical thinking approach is<br/>\nsomething they are able to handle, I don&#39;t think that is the main reason<br/>\npeople get hurt and defensive and angry (mostly at Sandra, sometimes at<br/>\nsome of the rest of us).<br/>\n<br/>\nOn Facebook, someone posted about the thoughts she was having because she<br/>\ndidn&#39;t want to have those thoughts and was asking how to get rid of them<br/>\n(thinking the children were atrophying on the couch when they were watching<br/>\na lot of tv).<br/>\n<br/>\nSandra responded with a description of an experiment - there would be a<br/>\ngroup where unschooling parents accept what their kids love, a group where<br/>\nparents know about unschooling but think what the kids love is bad for<br/>\nthem, and a control group that knows nothing about unschooling. In<br/>\ndescribing the second group, Sandra used that person&#39;s phrase about<br/>\nthinking her kids were &quot;atrophying on the couch.&quot;<br/>\n<br/>\nI, myself, thought this was a new and brilliant way to make the point that<br/>\nI hoped would be so clear and convincing to the person that she would be<br/>\nable to replace her thoughts about her children and tv with new ideas about<br/>\nwhat would be relationship-building for her family over the long haul. I<br/>\nLOVED it. I seemed to make the point SO obvious and I thought, &quot;Aha - what<br/>\na GREAT way to get someone to really &quot;get&quot; that the way they think about<br/>\ntheir children will have far-reaching implications on what their<br/>\nrelationship will be like for their entire lifetimes.&quot;<br/>\n<br/>\nBut some people entirely missed the point, the person who&#39;d posted<br/>\noriginally among them.<br/>\n<br/>\nShe thought Sandra used her words to mock her for the sake of humor.<br/>\n<br/>\nShe thought Sandra had insulted her and lumped her in the &quot;bad parents&quot;<br/>\ngroup.<br/>\n<br/>\nShe didn&#39;t realize Sandra had given her a gift - a tool to use to change<br/>\nher own thinking.<br/>\n<br/>\nI think this is an issue of people not having a high enough level of<br/>\nGardner&#39;s &quot;interpersonal intelligence&quot; to understand the point of what<br/>\nsomeone else says when it isn&#39;t prefaced with enough explanation. (And if<br/>\nthat Facebook poster is reading this, she&#39;s maybe angry and hurt again<br/>\nbecause she thinks I&#39;m insulting her and saying she&#39;s not smart.)<br/>\n<br/>\nPeople are usually insulting and mocking to others because it builds up<br/>\ntheir own ego - they knock someone else down to make themselves feel<br/>\nsuperior. And people accuse Sandra of that. But I know her really well. She<br/>\nhas a perfectly healthy ego and isn&#39;t at all into belittling others to<br/>\nbuild her&#39;s up at all. By speaking and writing publicly, in fact, she sets<br/>\nherself up to BE criticized and bad-mouthed in pretty ego-crushing ways;<br/>\nshe could stay quiet and not have to bear it.<br/>\n<br/>\nWhen people have a lot of interpersonal intelligence, they sometimes assume<br/>\nothers have more than they actually do. They don&#39;t realize how much they<br/>\nare leaving unsaid that others don&#39;t fill in or understand.<br/>\n<br/>\nI think this is sometimes (not always, by any means) the source of<br/>\nmisunderstanding of what Sandra offers. People have an &quot;I asked for help<br/>\nand she gave me insults,&quot; reaction when they don&#39;t get that she DID offer<br/>\nhelp - really awesome amazing help incredibly insightful help.<br/>\n<br/>\nSandra doesn&#39;t typically start out by saying things like, &quot;This might seem<br/>\ninsulting to you, but I don&#39;t mean it that way and I hope you&#39;ll take it in<br/>\nthe spirit intended. I&#39;m going to lay out an experiment with three groups<br/>\nof parents. I&#39;m not saying you are a bad person and stuck in the bad<br/>\nparents group, I&#39;m describing what would happen if you don&#39;t get yourself<br/>\nOUT of thinking the way you are, and it is great that that is what you are<br/>\ntrying to do. I&#39;m hoping that if you think about this experiment, you&#39;ll<br/>\nhave a realization about the damage that kind of thinking can do to your<br/>\nlong-term relationships with your children. I&#39;m hoping that your increased<br/>\nawareness will help you put your relationships first so that you will focus<br/>\non that. Once you start focusing on finding the value in what your children<br/>\nlove, you will discover that those old thought patterns disappear -<br/>\nreplaced by enjoyment and even surprise at how much the kids are learning.<br/>\nNow, I hope you find the following useful.&quot;<br/>\n<br/>\nAnd on and on....<br/>\n<br/>\nSandra says what she has to say. It is direct and to the point.  Because<br/>\nwe&#39;re talking about the most important relationships humans can have -<br/>\nparent/child - imagined insults hurt a lot and emotions run high and people<br/>\nare very reactive. Others feel defensive on behalf of those they believe<br/>\nwere insulted. They tell Sandra she should be nicer. But Sandra is already<br/>\nspending a huge part of her life being &quot;nice&quot; - she does what she does<br/>\nentirely out of the goodness of her heart and the sheer quantity of what<br/>\nshe offers is staggering. Telling her to be nicer makes no sense - from her<br/>\npoint of view it sounds like people are telling her that being nicer means<br/>\nbeing less helpful - to soften what she says, to pat people on the back and<br/>\ntell them what they&#39;re doing is just fine, that they are the parent and<br/>\nknow what&#39;s best for their child, etc.<br/>\n<br/>\nThe insights Sandra has to offer are amazing. I&#39;ve been the beneficiary of<br/>\na lot of her help, and I&#39;ve been around to watch what she&#39;s been able to<br/>\noffer people for the past 16 or 17 years. Her ability to get to the heart<br/>\nof a matter is a direct result of her having an extraordinarily high level<br/>\nof that Gardner interpersonal intelligence. Therapists go to school for<br/>\nyears to try to develop that kind of ability. She shakes people up because<br/>\nshe gets so quickly and strongly right to the crux of the matter. I have,<br/>\nmyself, described feeling kind of an electric shock pass through me when I<br/>\nfirst heard some of what Sandra had to say. I&#39;ve felt my breath catch in my<br/>\nthroat. And, I have felt angry and hurt, too, by the way. But those were my<br/>\ninitial reactions and I used my intellect to get past my emotional<br/>\nresponses and I analyzed what she had said and I made discoveries about<br/>\nmyself and my family that significantly changed our lives for the better.<br/>\n<br/>\nWhat we do on this list (and on the Radical Unschoolers Info facebook page)<br/>\nis not easy-going casual sweet-sounding conversation. On this list, we have<br/>\nintroductory materials that everybody is asked to read before<br/>\nparticipating. We try really hard to get the idea across that this may not<br/>\nbe a good place for those who are easily insulted or sensitive to having<br/>\ntheir ideas laid out and dissected and critiqued.<br/>\n<br/>\nThere are many many people who love this stuff. It is, for me, like really<br/>\ndifficult therapy sessions - hard to get through, painful, but, at the end<br/>\nof the process, life is SO much better and it is extremely worth it. I<br/>\nwouldn&#39;t want people telling a therapist to go easier on me, be nicer, not<br/>\nto dig so deeply, to avoid causing pain, and I don&#39;t want Sandra (or<br/>\nothers) to change, either, for the sake of those who don&#39;t want to do this<br/>\nkind of work.<br/>\n<br/>\nALL that said - can we who do a lot of writing about unschooling improve<br/>\nhow we offer what we offer? ALL these years there has been nonstop<br/>\nself-evaluation going on - Sandra is at the forefront of that, too. We talk<br/>\nand talk about how we can do better, how we can help people, what will help<br/>\nthem understand more and faster, what we are learning, how we can improve<br/>\nour own lives, and so on. We get defensive sometimes and don&#39;t respond at<br/>\nour best. We have our blind spots. We have our own family issues and we<br/>\ngenerally confess openly to those, and that&#39;s not easy either. Our families<br/>\nhave let themselves be held up under harsh lights to be questioned and<br/>\ndiscussed. Not always easy at all. We have made our credibility and<br/>\nintegrity matters of public scrutiny and feel the pressure to be<br/>\nscrupulously honest and clear at all times about absolutely everything.<br/>\n<br/>\n Socrates said, &quot;The unexamined life is not worth living.&quot; That&#39;s an<br/>\nincredibly strong statement - &quot;not worth living&quot; - and I think this kind of<br/>\ndiscussion is only good for those who take that quite seriously. We are<br/>\ntrying to live deeply examined lives. That&#39;s what it is all about!<br/>\n<br/>\n-pam sorooshian<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] arguing","postDate":"1328543249","msgId":65411,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0NUM1RkY1LUJGMjUtNEFFOS05RjM3LThENDZEMTk5MDMwQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQwMDU5NkYyLTE0MzEtNEE1NS05NjY1LUUyQjNEQzY0MDc3MUB5YWhvby5jb20+","referencesHeader":"PDg5MTQ5OTBGLTc1QzgtNDRDRS1BREVCLUExODVGQUYyQUJFNEBTYW5kcmFEb2RkLmNvbT4gPDQwMDU5NkYyLTE0MzEtNEE1NS05NjY1LUUyQjNEQzY0MDc3MUB5YWhvby5jb20+"},"prevInTopic":65409,"nextInTopic":65412,"prevInTime":65410,"nextInTime":65412,"topicId":65406,"numMessagesInTopic":0,"msgSnippet":"-=- I can t find the radical unschooling info facebook page (maybe because I m searching on an app) Could you please send post a link to it.-=- ","messageBody":"<div id=\"ygrps-yiv-961150194\">-=- I can&#39;t find the radical unschooling info facebook page (maybe because I&#39;m searching on an app) Could you please send post a link to it.-=-<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.facebook.com/groups/303347574750/\">http://www.facebook.com/groups/303347574750/</a><br/>\n<br/>\nI&#39;m not really recommending it.  I was just saying where those quotes came from.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":48652687,"authorName":"rachk2000@yahoo.com","from":"&quot;rachk2000@...&quot; &lt;rachk2000@...&gt;","profile":"rachk2000","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] arguing","postDate":"1328540554","msgId":65409,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwMDU5NkYyLTE0MzEtNEE1NS05NjY1LUUyQjNEQzY0MDc3MUB5YWhvby5jb20+","inReplyToHeader":"PDg5MTQ5OTBGLTc1QzgtNDRDRS1BREVCLUExODVGQUYyQUJFNEBTYW5kcmFEb2RkLmNvbT4=","referencesHeader":"PDg5MTQ5OTBGLTc1QzgtNDRDRS1BREVCLUExODVGQUYyQUJFNEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":65406,"nextInTopic":65411,"prevInTime":65408,"nextInTime":65410,"topicId":65406,"numMessagesInTopic":0,"msgSnippet":"Hi Sandra I can t find the radical unschooling info facebook page (maybe because I m searching on an app) Could you please send  post a link to it. Many thanks","messageBody":"<div id=\"ygrps-yiv-365334056\">Hi Sandra<br/>\n<br/>\nI can&#39;t find the radical unschooling info facebook page (maybe because I&#39;m searching on an app) Could you please send  post a link to it.<br/>\n<br/>\nMany thanks <br/>\n<br/>\nRachel <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 6 Feb 2012, at 16:06, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n&gt; There&#39;s a facebook page I started, a group called Radical Unschooling Info.  It&#39;s getting big, and this weekend there was a lot of activity because of the same old reason--I suck, I&#39;m mean.  And as usual, that flared up, was argued, got cooler, people started writing mushy things, good writing came of it, good writing was praised, people testified, people calmed down.<br/>\n&gt; <br/>\n&gt; Somewhere in there, though, someone came to defend the overly sensitive, the deeply wounded, and a couple of people (new to unschooling, new to discussions) assured us that it COULD be discussed without hurting anyone&#39;s feelings ever, and someone said &quot;It&#39;s a shame that...&quot; (which translates to &quot;you should be ashamed&quot; or, if the person isn&#39;t a very careful or thoughtful writer, it could mean &quot;bummer.&quot;  But they got it from someone who didn&#39;t mean &quot;bummer,&quot; they meant &quot;you should be ashamed.&quot;<br/>\n&gt; <br/>\n&gt; Jenny wrote this this, though, and I&#39;m bringing one full response of hers and a story from my house that I posted there.  I would rather the best stuff stay here, where more people see it and it can be found again.<br/>\n&gt; <br/>\n&gt; Jenny Cyphers:<br/>\n&gt; ----------<br/>\n&gt; What kind of relationship does a mom or dad have with their kids if they are really sensitive and defensive? If their child corrects them, will they respond that way to their child?<br/>\n&gt; <br/>\n&gt; Something that I&#39;ve found to really super cool about unschooling, is my own ability to be wrong when confronted by one of my kids. There was a time that I might have held onto my own belief that I was right and missed out on that.<br/>\n&gt; ----------<br/>\n&gt; <br/>\n&gt; Me:<br/>\n&gt; <br/>\n&gt; When our kids were very young, Keith asked me why I let them argue with me.  I said if I was wrong, and they were right, it was good for them to be able to express that.  We talked about it various times.  I told him I thought it was good practice for them, and that if they could win an argument with me, they could probably win one with anybody.   <br/>\n&gt; <br/>\n&gt; They didn&#39;t grow up to be argumentative.  They grew up to be thoughtful, careful and analytical.  They grew up to gravitate toward people who were honest and made sense, and to avoid bullshitters.<br/>\n&gt; <br/>\n&gt; Another side benefit of me &quot;letting them argue&quot; is that there never was any &quot;because I&#39;m the mom.&quot;  It was &quot;Because I think this makes the best sense.&quot;   So when they were teens, and now that they&#39;re young adults, they know if I suggest they tweak their thinking that it&#39;s not anything beyond my regard for their peace and progress.<br/>\n&gt; <br/>\n&gt; They don&#39;t take a position they can&#39;t defend.<br/>\n&gt; <br/>\n&gt; ------------------------------------<br/>\n&gt; <br/>\n&gt; Yahoo! Groups Links<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"arguing","postDate":"1328533579","msgId":65406,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5MTQ5OTBGLTc1QzgtNDRDRS1BREVCLUExODVGQUYyQUJFNEBTYW5kcmFEb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":65409,"prevInTime":65405,"nextInTime":65407,"topicId":65406,"numMessagesInTopic":0,"msgSnippet":"There s a facebook page I started, a group called Radical Unschooling Info.  It s getting big, and this weekend there was a lot of activity because of the same","messageBody":"<div id=\"ygrps-yiv-206454229\">There&#39;s a facebook page I started, a group called Radical Unschooling Info.  It&#39;s getting big, and this weekend there was a lot of activity because of the same old reason--I suck, I&#39;m mean.  And as usual, that flared up, was argued, got cooler, people started writing mushy things, good writing came of it, good writing was praised, people testified, people calmed down.<br/>\n<br/>\nSomewhere in there, though, someone came to defend the overly sensitive, the deeply wounded, and a couple of people (new to unschooling, new to discussions) assured us that it COULD be discussed without hurting anyone&#39;s feelings ever, and someone said &quot;It&#39;s a shame that...&quot; (which translates to &quot;you should be ashamed&quot; or, if the person isn&#39;t a very careful or thoughtful writer, it could mean &quot;bummer.&quot;  But they got it from someone who didn&#39;t mean &quot;bummer,&quot; they meant &quot;you should be ashamed.&quot;<br/>\n<br/>\nJenny wrote this this, though, and I&#39;m bringing one full response of hers and a story from my house that I posted there.  I would rather the best stuff stay here, where more people see it and it can be found again.<br/>\n<br/>\nJenny Cyphers:<br/>\n----------<br/>\nWhat kind of relationship does a mom or dad have with their kids if they are really sensitive and defensive? If their child corrects them, will they respond that way to their child?<br/>\n<br/>\nSomething that I&#39;ve found to really super cool about unschooling, is my own ability to be wrong when confronted by one of my kids. There was a time that I might have held onto my own belief that I was right and missed out on that.<br/>\n----------<br/>\n<br/>\nMe:<br/>\n<br/>\nWhen our kids were very young, Keith asked me why I let them argue with me.  I said if I was wrong, and they were right, it was good for them to be able to express that.  We talked about it various times.  I told him I thought it was good practice for them, and that if they could win an argument with me, they could probably win one with anybody.   <br/>\n<br/>\nThey didn&#39;t grow up to be argumentative.  They grew up to be thoughtful, careful and analytical.  They grew up to gravitate toward people who were honest and made sense, and to avoid bullshitters.<br/>\n<br/>\nAnother side benefit of me &quot;letting them argue&quot; is that there never was any &quot;because I&#39;m the mom.&quot;  It was &quot;Because I think this makes the best sense.&quot;   So when they were teens, and now that they&#39;re young adults, they know if I suggest they tweak their thinking that it&#39;s not anything beyond my regard for their peace and progress.<br/>\n<br/>\nThey don&#39;t take a position they can&#39;t defend.</div>","specialLinks":[]}],"prevTopicId":65344,"nextTopicId":65428}}