{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":5,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Growing with Unschooling","postDate":"1163520340","msgId":27331,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc4N0U0M0U4LUIzNEYtNERCQi1CMEE1LTk5MzQ1NkVGNjBFOEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDhDOEQ2MEY2NTlDMUQ0MS01MkMtNTUyQUBNQkxLLU0wNC5zeXNvcHMuYW9sLmNvbT4=","referencesHeader":"PDJGQjc3RjgzLTgzNzQtNDlBNi05RDE5LUFGMTAyOTRCNUI1OUBzYW5kcmFkb2RkLmNvbT4gPDAwMTAwMWM2ZmRkYiQzOTk4ZDNlMCQ2OTAxYThjMEBTaGFubm9uPiA8OEM4RDYwRjY1OUMxRDQxLTUyQy01NTJBQE1CTEstTTA0LnN5c29wcy5hb2wuY29tPg=="},"prevInTopic":27330,"nextInTopic":0,"prevInTime":27330,"nextInTime":27332,"topicId":27234,"numMessagesInTopic":0,"msgSnippet":"-=-I think that s the hardest age to see the learning. Toddlers and teens seem to *actively* pursue learning. I think from eight to twelve is kind of a","messageBody":"<div id=\"ygrps-yiv-1190264237\">-=-I think that&#39;s the hardest age to see the learning. Toddlers and  <br/>\nteens<br/>\nseem to *actively* pursue learning. I think from eight to twelve is<br/>\nkind of a &quot;passive&quot; learning stage. More absorbing and digesting and<br/>\n&quot;storing up&quot; for the next phase-=-<br/>\n<br/>\nI&#39;ve definitely seen that here, in the 10, 12, 13 range.<br/>\n<br/>\nTeachers are supposed to document learning so they can get a  <br/>\npaycheck.  Too many unschoolers want to play teacher.  It&#39;s a good  <br/>\nurge to get over. &lt;g&gt;<br/>\n<br/>\n-=-. He comes up<br/>\nwith words and phrases that assure me of this. He changes almost<br/>\novernight (although I know it&#39;s been percolating there for<br/>\ndays/weeks/months).-=-<br/>\n<br/>\nSeeming-sudden changes have fascinated me, with my kids.  One  <br/>\nmorning, one would just *look* different, a new facial expression, or  <br/>\na new gaze, it seemed.  Or in just a few days&#39; time one would seem so  <br/>\nmuch taller, or stand differently, or laugh differently.  With babies  <br/>\nlearning language, I remember there would be sudden differences in  <br/>\nintonation, like they had reached a new plateau of language use.<br/>\n<br/>\nA couple of weeks ago I was hearing Marty (who&#39;s 17) in the next room  <br/>\nsinging along with hip-hop stuff I don&#39;t know.  He knew all the  <br/>\nwords, his intonation was great, but his voice was new.  It was  <br/>\nstronger and deeper.  He wasn&#39;t just singing out of his throat or the  <br/>\ntop of his chest.  It was all supported (even though he was singing  <br/>\nto himself in his room), and it was a beautiful, new deeper tone.<br/>\n<br/>\nI told Keith (who sings) and Holly, but didn&#39;t mention it to Marty.<br/>\n<br/>\nLast week Marty was gone to visit some other families who were  <br/>\nmeeting at Zenmomma&#39;s house.  He left Tuesday and returned Saturday.   <br/>\nI was gone for the weekend, so when I got back Sunday night, I hadn&#39;t  <br/>\nseen him for nearly six days.   He looked different.  He stood  <br/>\ndifferently.  I liked it.   He seemed serene.  His hair was  <br/>\nnoticeably longer (probably because it got to the starting-to-curl  <br/>\nstage).  He had a new tan corduroy Levi jacket he had bought with his  <br/>\nown money, and a new visor.<br/>\n<br/>\nBeing accepting and welcoming of changes and stages is better than  <br/>\nfear and resentment and suspicion.  Wanting their lives to be  <br/>\nhomogenous and measurable can keep us from loving the quiet and  <br/>\nexcitement and fits and starts of how natural life goes.<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":896746,"authorName":"kbcdlovejo@aol.com","from":"kbcdlovejo@...","profile":"kellyinsc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: [AlwaysLearning] Re: Growing with Unschooling","postDate":"1163514126","msgId":27330,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDOEQ2MEY2NTlDMUQ0MS01MkMtNTUyQUBNQkxLLU0wNC5zeXNvcHMuYW9sLmNvbT4=","inReplyToHeader":"PDAwMTAwMWM2ZmRkYiQzOTk4ZDNlMCQ2OTAxYThjMEBTaGFubm9uPg==","referencesHeader":"PDJGQjc3RjgzLTgzNzQtNDlBNi05RDE5LUFGMTAyOTRCNUI1OUBzYW5kcmFkb2RkLmNvbT4gPDAwMTAwMWM2ZmRkYiQzOTk4ZDNlMCQ2OTAxYThjMEBTaGFubm9uPg=="},"prevInTopic":27243,"nextInTopic":27331,"prevInTime":27329,"nextInTime":27331,"topicId":27234,"numMessagesInTopic":0,"msgSnippet":"Late, again. Too many irons in teh fire, but these posts sit until I can get to them. ... From: EREICHARD@carolina.rr.com But, somehow I feel it is harder to ","messageBody":"<div id=\"ygrps-yiv-1051600379\">Late, again. Too many irons in teh fire, but these posts sit until I <br/>\ncan get to them.<br/>\n<br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:EREICHARD@...\">EREICHARD@...</a><br/>\n<br/>\n  But, somehow I feel it is harder to<br/>\ndetermine what my oldest (10 year old) is actually doing with her days. <br/>\n I can<br/>\nsee what it is that the kids are doing when they are unschooling and <br/>\nyounger.  I<br/>\ncan always feel safe because I &quot;see&quot; the learner taking place.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nI think that&#39;s the hardest age to see the learning. Toddlers and teens <br/>\nseem to *actively* pursue learning. I think from eight to twelve is <br/>\nkind of a &quot;passive&quot; learning stage. More absorbing and digesting and <br/>\n&quot;storing up&quot; for the next phase.<br/>\n<br/>\n-==-=-=-=-=-=-=-<br/>\n<br/>\n They are<br/>\nlearning to write, read and do math based on their every day needs and <br/>\nit comes<br/>\nnaturally.    Now as my older daughter ages I find it more difficult to <br/>\ndocument<br/>\nwhat she is actually doing.  She writes easily and computates math <br/>\neasily when<br/>\nshe needs to.  However, she is not interested in pursuing mathematical <br/>\nor<br/>\nwriting just for the fun of it likes she does with reading.  She reads <br/>\nfar<br/>\nbeyond her age and a variety of fiction and nonfiction.   She loves to <br/>\nread and<br/>\nshe spends many hours reading.  But, it&#39;s not like we discuss these <br/>\nbooks.<br/>\n<br/>\n-=-=-=-<br/>\n<br/>\nDo you read them too? Or are you just asking her to regurgitate to you <br/>\nwhat she read?<br/>\n<br/>\n-=-=-=-=-=-<br/>\n<br/>\nI think I read somewhere at one time that unschooled kids hit a spot in <br/>\ntheir<br/>\ndevelopment where they may not look like they are doing anything <br/>\nimportant even<br/>\nthough they really are growing in leaps and bounds.  My question is <br/>\ncould this<br/>\nbe where my daughter is at the moment.   I&#39;m interested in hearing if <br/>\nother<br/>\nunschooling families have experienced this same sort of thing as there <br/>\nchildren<br/>\npass into those tween years.  And, how they came out on the other side. <br/>\n I know<br/>\nunschooling has worked up to this age and I would like for it to <br/>\ncontinue to<br/>\nwork.<br/>\n<br/>\n-=-=-=-=-<br/>\n<br/>\nWhen Cameron came out of it, he suddenly couldn&#39;t get enough stuff in <br/>\nhis head at once. And it&#39;s not as if he&#39;s slowed down one bit. He&#39;s <br/>\nsnowballing now at 18. I suggested yesterday that he write it all down <br/>\nso that we could break things down into workable pieces instead of his <br/>\nmassive lump of things he wants to pursue with nowhere to start.<br/>\n<br/>\nThe schooled kids seem to do the opposite: they don&#39;t have a chance to <br/>\nsit back and digest what they&#39;re learning from 8-12---they&#39;re pushed <br/>\nharder and harder and harder until they just don&#39;t *want* to learn <br/>\nanymore. Until you &quot;can&#39;t make them.&quot; Then they shut down just when <br/>\nthey would naturally be gearing up.<br/>\n<br/>\n  I&#39;ve watched both my boys slow way down and seem unimpressive in <br/>\ncomparison to friends and cousins who were doing science fairs and <br/>\nlearning languages and creating imaginary countries. But then (Cameron <br/>\ndid, and I expect Duncan to) they SHOOOOT out of the other side eager <br/>\nto keep learning and learn *everything* now!<br/>\n<br/>\nI *know* Duncan is still learning every day at ten now. He comes up <br/>\nwith words and phrases that assure me of this. He changes almost <br/>\novernight (although I know it&#39;s been percolating there for <br/>\ndays/weeks/months). No, he&#39;s not doing long-division or conjugating <br/>\nverbs or diagramng sentences or blowing up the science lab. But he <br/>\ntravels a lot and thinks deeply and questions *everything*. He just <br/>\nlost another tooth yesterday, so I know his body&#39;s working hard to <br/>\nchange too! There&#39;a a lot going on in there.<br/>\n<br/>\nI wouldn&#39;t worry about this apparent &quot;lull&quot;---there&#39;s a LOT going on <br/>\nunder the surface that&#39;ll erupt when she&#39;s ready!<br/>\n<br/>\n~Kelly<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________________________________________________<br/>\nCheck out the new AOL.  Most comprehensive set of free safety and <br/>\nsecurity tools, free access to millions of high-quality videos from <br/>\nacross the web, free AOL Mail and more.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Growing with Unschooling","postDate":"1162477328","msgId":27238,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdGMTc3REIyLTcwRjgtNEI2Mi05MzNCLTFFQjI2QjBBNDA3MUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwMTAwMWM2ZmRkYiQzOTk4ZDNlMCQ2OTAxYThjMEBTaGFubm9uPg==","referencesHeader":"PDJGQjc3RjgzLTgzNzQtNDlBNi05RDE5LUFGMTAyOTRCNUI1OUBzYW5kcmFkb2RkLmNvbT4gPDAwMTAwMWM2ZmRkYiQzOTk4ZDNlMCQ2OTAxYThjMEBTaGFubm9uPg=="},"prevInTopic":27234,"nextInTopic":27243,"prevInTime":27237,"nextInTime":27239,"topicId":27234,"numMessagesInTopic":0,"msgSnippet":"-=-I think I read somewhere at one time that unschooled kids hit a spot in their development where they may not look like they are doing anything important","messageBody":"<div id=\"ygrps-yiv-72505920\">-=-I think I read somewhere at one time that unschooled kids hit a  <br/>\nspot in their development where they may not look like they are doing  <br/>\nanything important even though they really are growing in leaps and  <br/>\nbounds-=-<br/>\n<br/>\nIt seemed to me that there was a time when my kids were &quot;ahead,&quot; when  <br/>\nthey were little, and then seemed &quot;behind&quot; (mid-school/Jr.-Highesh  <br/>\nages) and then about the time the high school kids started rebelling  <br/>\nand realizing how disgusted they were with school, and they had the  <br/>\nskills (learned in school, though not on the curriculum) to really  <br/>\nNOT learn, to avoid learning, my kids were zooming along.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210653085,"authorName":"Kim H","from":"&quot;Kim H&quot; &lt;kimlewismark@...&gt;","profile":"kimhoussenloge","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Growing with Unschooling","postDate":"1162455140","msgId":27243,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNGUwMWM2ZmU1NiRhMmUxZmUwMCRlNzQyNjkzYUBraW04Y2U4YWYzNTQzZT4=","referencesHeader":"PDJGQjc3RjgzLTgzNzQtNDlBNi05RDE5LUFGMTAyOTRCNUI1OUBzYW5kcmFkb2RkLmNvbT4gPDAwMTAwMWM2ZmRkYiQzOTk4ZDNlMCQ2OTAxYThjMEBTaGFubm9uPg=="},"prevInTopic":27238,"nextInTopic":27330,"prevInTime":27242,"nextInTime":27244,"topicId":27234,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1373622708\">&lt;&lt;&lt;I think I read somewhere at one time that unschooled kids hit a spot in their development where they may not look like they are doing anything important even though they really are growing in leaps and bounds. My question is could this be where my daughter is at the moment.&gt;&gt;.<br/>\n<br/>\nHi Shannon,<br/>\n<br/>\nI guess, when we remain focussed on what learning is (and what it isn&#39;t) then we may find it hard to box in what our kids are doing, especially as they grow older. I think the danger with this way of looking at learning lies in the labelling and boxing in. True unschooling is life learning. Learning is life - like breathing, sleeping, eating, dreaming, playing, the 3 R&#39;s etc. To compartmentalise learning is very schooly and not a natural part of life. <br/>\n<br/>\nYou already listed so many things that your daughter enjoys doing in her day. All of that (and more) is learning and growing and developing her as a person. That&#39;s the learning. That&#39;s the living.<br/>\n That&#39;s what&#39;s important for her.<br/>\n<br/>\nIt&#39;s so important for us with younger children, (and all ages)  to get this early so we don&#39;t only notice the writing and the reading and the maths but we take joy in ALL of the things our children are doing in their life and see ALL of that as their learning journey. Unschooling has no framework of &#39;shoulds&#39; and outcomes to be ticked. It is a fluid, natural journey which is unique to all who live it.<br/>\n<br/>\nKim<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:EREICHARD@...\">EREICHARD@...</a> <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\n  Sent: Thursday, November 02, 2006 4:29 AM<br/>\n  Subject: [AlwaysLearning] Re: Growing with Unschooling<br/>\n<br/>\n<br/>\n  Hello, <br/>\n<br/>\n  I&#39;ve been lurking for a while. I joined the group because we are an unschooling family and I needed to hear what other families were experiencing. My background is in teaching. I originally started homeschooling my ten year old daughter because she taught herself to read at four and was very active. I decided Kindergarten would be a boring frustration for her. I did not want to break her love of learning spirit. She never went to preschool but every year I started the year out with organized type learning activities for her to suit my teaching needs. This was before I really knew about unschooling. But, every year we quickly learned that she was much better off exploring her world and learning naturally without the typical &quot;school&quot; type activities so this only lasted for a while. I guess you should say my daughter taught me to be an unschooler. I also have a seven year old daughter. <br/>\n<br/>\n  This year my daughter asked me to give her assingments. We ordered some materials she was interested in and made ourselves a schedule. Of course, after six weeks this no longer worked. We dropped everything because I no longer saw her spark for learning and she seemed needlessly bored. So, now we are back to strict unschooling days which we love. But, somehow I feel it is harder to determine what my oldest (10 year old) is actually doing with her days. I can see what it is that the kids are doing when they are unschooling and younger. I can always feel safe because I &quot;see&quot; the learner taking place. They are learning to write, read and do math based on their every day needs and it comes naturally. Now as my older daughter ages I find it more difficult to document what she is actually doing. She writes easily and computates math easily when she needs to. However, she is not interested in pursuing mathematical or writing just for the fun of it likes she does with reading. She reads far eyond her age and a variety of fiction and nonfiction. She loves to read and she spends many hours reading. But, it&#39;s not like we discuss these books. She takes it all in her brain and usually I never even hear about what she is reading anymore. She still spends time each day telling stories and playing with her horses and little people. I love that she has not outgrown these and she can still enjoy playing with them. She enjoys playing with her younger sister, too. They are very good friends. We have a horse and we spend hours out at the barn. Both girls are involved in piano and theater. We explore, travel and spend times with friends. <br/>\n<br/>\n  I think I read somewhere at one time that unschooled kids hit a spot in their development where they may not look like they are doing anything important even though they really are growing in leaps and bounds. My question is could this be where my daughter is at the moment. I&#39;m interested in hearing if other unschooling families have experienced this same sort of thing as there children pass into those tween years. And, how they came out on the other side. I know unschooling has worked up to this age and I would like for it to continue to work. <br/>\n<br/>\n  Thanks for you help,<br/>\n<br/>\n  Shannon M. Reichard<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n------------------------------------------------------------------------------<br/>\n<br/>\n<br/>\n  No virus found in this incoming message.<br/>\n  Checked by AVG Free Edition.<br/>\n  Version: 7.1.409 / Virus Database: 268.13.21/509 - Release Date: 31/10/2006<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":153957730,"authorName":"EREICHARD@carolina.rr.com","from":"&lt;EREICHARD@...&gt;","profile":"ereichard03","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Growing with Unschooling","postDate":"1162402143","msgId":27234,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMTAwMWM2ZmRkYiQzOTk4ZDNlMCQ2OTAxYThjMEBTaGFubm9uPg==","referencesHeader":"PDJGQjc3RjgzLTgzNzQtNDlBNi05RDE5LUFGMTAyOTRCNUI1OUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":27238,"prevInTime":27233,"nextInTime":27235,"topicId":27234,"numMessagesInTopic":0,"msgSnippet":"Hello, I ve been lurking for a while.  I joined the group because we are an unschooling family and I needed to hear what other families were experiencing.  My","messageBody":"<div id=\"ygrps-yiv-1763529515\">Hello, <br/>\n<br/>\nI&#39;ve been lurking for a while.  I joined the group because we are an unschooling family and I needed to hear what other families were experiencing.  My background is in teaching.  I originally started homeschooling my ten year old daughter because she taught herself to read at four and was very active.  I decided Kindergarten would be a boring  frustration for her.  I did not want to break her love of learning spirit.  She never went to preschool but every year I started the year out with organized type learning activities for her to suit my teaching needs.  This was before I really knew about unschooling.    But, every year we quickly learned that she was much better off exploring her world and learning naturally without the typical &quot;school&quot; type activities so this only lasted for a while.  I guess you should say my daughter taught me to be an unschooler.  I also have a seven year old daughter. <br/>\n<br/>\nThis year my daughter asked me to give her assingments.  We ordered some materials she was interested in and made ourselves a schedule.  Of course, after six weeks this no longer worked.  We dropped everything because I no longer saw her spark for learning and she seemed needlessly bored.  So, now we are back to strict unschooling days which we love.  But, somehow I feel it is harder to determine what my oldest (10 year old) is actually doing with her days.  I can see what it is that the kids are doing when they are unschooling and younger.  I can always feel safe because I &quot;see&quot; the learner taking place.  They are learning to write, read and do math based on their every day needs and it comes naturally.    Now as my older daughter ages I find it more difficult to document what she is actually doing.  She writes easily and computates math easily when she needs to.  However, she is not interested in pursuing mathematical or writing just for the fun of it likes she does with reading.  She reads far beyond her age and a variety of fiction and nonfiction.   She loves to read and she spends many hours reading.  But, it&#39;s not like we discuss these books.  She takes it all in her brain and usually I never even hear about what she is reading anymore.  She still spends time each day telling stories and playing with her horses and little people.  I love that she has not outgrown these and she can still enjoy playing with them. She enjoys playing with her younger sister, too.  They are very good friends.   We have a horse and we spend hours out at the barn.  Both girls are involved in piano and theater.  We explore, travel and spend times with friends.  <br/>\n<br/>\nI think I read somewhere at one time that unschooled kids hit a spot in their development where they may not look like they are doing anything important even though they really are growing in leaps and bounds.  My question is could this be where my daughter is at the moment.   I&#39;m interested in hearing if other unschooling families have experienced this same sort of thing as there children pass into those tween years.  And, how they came out on the other side.  I know unschooling has worked up to this age and I would like for it to continue to work.  <br/>\n<br/>\nThanks for you help,<br/>\n<br/>\nShannon M. Reichard<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":27297,"nextTopicId":27334}}