{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Reading  &quot;Escape From Childhood&quot; again, thought I&#39;d share...","postDate":"1083769614","msgId":93504,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNTA1LjA5MDY1NC4yMDcyLjIuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":93502,"nextInTopic":0,"prevInTime":93503,"nextInTime":93505,"topicId":93502,"numMessagesInTopic":0,"msgSnippet":"Well, ok, more than one excerpt.   A excerpt,  an excerpt, some excerpts, excerpts.  I m not an expert on excerpts. Deb L","messageBody":"<div id=\"ygrps-yiv-718623601\">Well, ok, more than one excerpt.   A excerpt,  an excerpt, some excerpts,<br/>\nexcerpts.  I&#39;m not an expert on excerpts. <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Reading  &quot;Escape From Childhood&quot; again, thought I&#39;d share...","postDate":"1083768778","msgId":93502,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNTA1LjA4NTI1OS4yMDcyLjEuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":0,"nextInTopic":93504,"prevInTime":93501,"nextInTime":93503,"topicId":93502,"numMessagesInTopic":0,"msgSnippet":"This is a excerpt from John Holt s Escape From Childhood ______________________________________________________ The words expect and expectation are on","messageBody":"<div id=\"ygrps-yiv-1452928976\">This is a excerpt from John Holt&#39;s &quot;Escape From Childhood&quot;   <br/>\n<br/>\n______________________________________________________<br/>\nThe words &quot;expect&quot; and &quot;expectation&quot; are on the whole badly misunderstood<br/>\nand misused by most people who write about children. Most people use them<br/>\nas synonyms for &quot;demand&quot; or &quot;insist&quot; or &quot;compel.&quot; When they say we should<br/>\nhave higher expectations of children they mean that we should demand that<br/>\nthey do certain things and threaten to punish them if they do not. When I<br/>\nspeak of expecting a lot of children, I only mean that we should not in<br/>\nour minds put an upper limit on what they may be able to do. I don&#39;t mean<br/>\nwe should assume that they can, and therefore should, do certain things<br/>\nor be disappointed and worried if they do not - everyone has his own path<br/>\nand timetable into life. I do mean that we should not assume that there<br/>\nare things that they cannot do or be astonished and even threatened when<br/>\nthey do them. We should be open to their way of growing, whatever it may<br/>\nbe. With this understanding of the world, I believe that if we expected<br/>\nmore from children, and they from themselves, they would be able to learn<br/>\nmuch more about the world around them, much more quickly, then they do<br/>\nnow. or, to put it differently, they would go on exploring and learning<br/>\nafter the age of three as eagerly and capably as they did in their first<br/>\nthree years.<br/>\n<br/>\n <br/>\n<br/>\nYoung people should have the right to control and direct their own<br/>\nlearning, that is, to decide what they want to learn, and when, where,<br/>\nhow, how much, how fast, and with what help they want to learn it. To be<br/>\nstill more specific, I want them to have the right to decide if, when,<br/>\nhow much, and by whom they want to be taught and the right to decide<br/>\nwhether they want to learn in a school and if so which one and for how<br/>\nmuch of the time.<br/>\n<br/>\nNo human right, except the right to life itself, is more fundamental than<br/>\nthis. A person&#39;s freedom of learning is part of his freedom of thought,<br/>\neven more basic than his freedom of speech. If we take from someone his<br/>\nright to decide what he will be curious about, we destroy his freedom of<br/>\nthought. We say, in effect, you must think not about what interests and<br/>\nconcerns you, but about what interests and concerns us.<br/>\n<br/>\nWe might call this the right of curiosity, the right to ask whatever<br/>\nquestions are most important to us. As adults, we assume that we have the<br/>\nright to decide what does or does not interest us, what we will look into<br/>\nand what we will leave alone. We take this right largely for granted,<br/>\ncannot imagine that it might be taken away from us. Indeed, as far as I<br/>\nknow, it has never been written into any body of law. even the writers of<br/>\nour Constitution did not mention it. They thought it was enough to<br/>\nguarantee citizens the freedom of speech and the freedom to spread their<br/>\nideas as widely as they wished and could. it did not occur to them that<br/>\neven the most tyrannical government would try to control people&#39;s minds,<br/>\nwhat they thought and knew. That idea would come later, under the<br/>\nbenevolent guise of compulsory universal education.</div>","specialLinks":[]}],"prevTopicId":93500,"nextTopicId":93465}}