{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":0,"authorName":"FreeSchool@aol.com","from":"FreeSchool@...","replyTo":"LIST","senderId":"UxZneDAmqhOVkDo0FtKC5ZWq2e8VmCLHeAVm1Rl9a1v0v1qCwVqXzW2CO324g-gzJjMAmIL8cuCa","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: time to spend?","postDate":"937977022","msgId":3117,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMTUuMzExNy45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":3096,"nextInTopic":0,"prevInTime":3116,"nextInTime":3118,"topicId":3075,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/21/99 11:05:23 AM Central Daylight Time, ECSamHill@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-1126497316\">In a message dated 9/21/99 11:05:23 AM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ECSamHill@...\">ECSamHill@...</a> writes:<br/>\n<br/>\n&lt;&lt; You are right, this really does sound like a substantial personality <br/>\nchange <br/>\n on the part of your husband.  Is he experiencing a lot of stress?  <br/>\nOtherwise, <br/>\n it could be depression.  (It could be both stress and depression.)  <br/>\n Depression doesn&#39;t make everyone apathetic, it makes some people extremely <br/>\n grouchy.  <br/>\n<blockquote><span title=\"ireply\">   &gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Betsy,<br/>\n     You know, this idea has occurred to me and my husband.  We joked about <br/>\nthe idea that if he took one of those tests right now (you know, where they <br/>\nrate all the stressful things that have happened to you in one year, to see <br/>\nhow you would rate on being stressed out?), that he would probably be at the <br/>\ntop of the chart.  <br/>\n     Lets see, he changed jobs (after 17 yrs), we moved to a new home (after <br/>\n9 years), his grandmother died, something very major happened to our minister <br/>\nat church (he had been there 18 years), my dad had a cancerous tumor removed, <br/>\nI started a new in-home business, a close friend (whose husband left her for <br/>\nanother woman over a year ago) had to go back to work so we now have her two <br/>\nchildren for a major part of the time, another close friend left her husband <br/>\nand child for a man she met over the internet, we bought a brand new van (big <br/>\npurchase---also this computer  :)---that could be stressful too) and I could <br/>\ngo on and on.  No wonder he is stressed out!  We all should be!   I think we <br/>\nall need some down time, and he and I could use some alone time!  :)<br/>\nTami</div>","specialLinks":[]},{"userId":0,"authorName":"ECSamHill@aol.com","from":"ECSamHill@...","replyTo":"LIST","senderId":"wFPgorTaBBkJHQCEMh0f8uOmwNNtFWLiwJUMydmxTAnui6W4FiqqUj4brYcwEVpAk7jHoae5yrQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: time to spend?","postDate":"937929898","msgId":3096,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMTUuMzA5Ni45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":3088,"nextInTopic":3117,"prevInTime":3095,"nextInTime":3097,"topicId":3075,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/20/99 8:50:20 PM, FreeSchool@aol.com writes: ","messageBody":"<div id=\"ygrps-yiv-331471013\">In a message dated 9/20/99 8:50:20 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:FreeSchool@...\">FreeSchool@...</a> writes:<br/>\n<br/>\n&lt;&lt;It was always my  husband who would say &quot;Now Tami, they are just being <br/>\nkids.  Calm down and quit being so upset.  That is why I don&#39;t understand the <br/>\nchange that has come over him in the last year.  Now HE is the one yelling <br/>\nall the time.  He yells at me and the kids.  I have tried to find out if <br/>\nsomething is bothering him, and he just says that it is the way we are all <br/>\nliving.  He can&#39;t stand us sleeping late or staying up late.  He is also <br/>\nbothered by the fact that the 17 year old hasn&#39;t made &quot;big plans&quot; for his <br/>\nfuture.  He says that he doesn&#39;t agree with this &quot;attachment parenting&quot; and <br/>\n&quot;gentle discipline&quot; crap, that what these kids need are a good shaking up and <br/>\na spanking.  He says that they don&#39;t mind unless he screams at them.  The <br/>\nthing is that the kids are NOT being bad at all.  They don&#39;t usually smart <br/>\noff (unless he screams and yells and goads them into it).  They are very well <br/>\nbehaved kids, and other people are always complimenting me on their behavior. <br/>\n I just don&#39;t understand the change in him at all.  I am wondering if it is <br/>\nbecause they are all older now? &gt;&gt;<br/>\n<br/>\nYou are right, this really does sound like a substantial personality change <br/>\non the part of your husband.  Is he experiencing a lot of stress?  Otherwise, <br/>\nit could be depression.  (It could be both stress and depression.)  <br/>\nDepression doesn&#39;t make everyone apathetic, it makes some people extremely <br/>\ngrouchy.  <br/>\n<br/>\nI try, but don&#39;t always succeed, to remember that when someone is acting <br/>\nunlovable, it probably means they need *more* love and consideration.  <br/>\nSometimes we parents, DADS as well as moms, sacrifice so much of our energy, <br/>\ntime and peace that we obliterate our own selves.  Now that your children are <br/>\npast the needy baby and toddler age, it might mean a lot to your spouse if <br/>\nhis needs, wishes and preferences were made as important (maybe temporarily <br/>\nmore important) than those of the kids.  I only say this because I think I <br/>\nhave gone too far in this direction.  Our life revolves so much around my son <br/>\nand his illness that my husband&#39;s needs get almost completely ignored.  But, <br/>\nit would help me a lot if my husband would *speak up more* and *have some <br/>\nideas* about what would make him happy.  It certainly stinks when dad is <br/>\nunhappy and thinks fairness means everyone else should be unhappy, too.<br/>\n<br/>\nBest wishes,<br/>\nBetsy</div>","specialLinks":[]},{"userId":0,"authorName":"FreeSchool@aol.com","from":"FreeSchool@...","replyTo":"LIST","senderId":"0514X5xB45dWRLLAqtq5WQFxsnMkQDb_iQN4B9NxY_hJGSTfOSCnv9aFfvlMDObx0sGYvgAqynWj","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: time to spend?","postDate":"937887427","msgId":3088,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMTQuMzA4OC45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":3075,"nextInTopic":3096,"prevInTime":3087,"nextInTime":3089,"topicId":3075,"numMessagesInTopic":0,"msgSnippet":"In a message dated 9/20/99 7:38:01 PM Central Daylight Time, jwwjr@neocomm.net writes: ","messageBody":"<div id=\"ygrps-yiv-1802741853\">In a message dated 9/20/99 7:38:01 PM Central Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jwwjr@...\">jwwjr@...</a> writes:<br/>\n<br/>\n&lt;&lt; We have always known we would homeschool. We believe in attachment <br/>\nparenting<br/>\n and child-led learning (especially for developmental issues like weaning and<br/>\n potty training), so we naturally fell into an unschool philosophy of<br/>\n education.   &gt;&gt;<br/>\n<br/>\n<br/>\nCindy,<br/>\n     Your post was very good, and I really didn&#39;t think it was too long at <br/>\nall.  You brought up alot of very good issues, so it was very interesting.  I <br/>\nam glad that you took the time to write about it all.<br/>\n     My husband has always been very wonderful also.  We have been married <br/>\nfor 19 years, and he has been very supportive in my staying at home, the <br/>\nattachment parenting issues (except that he encouraged them to try to make it <br/>\nthrough the night in their own room after they turned 2.  If they woke up and <br/>\njoined us later, that was ok), and even homeschooling.  He was much more laid <br/>\nback about discipline when they were small (we never even heard of attachment <br/>\nparenting when our children were small.  We had them sleep with us, I nursed <br/>\nand cuddled, we kept them with us almost constantly, and we didn&#39;t use <br/>\nbabysitters----because that is what our instincts had us to do.  We only <br/>\nlearned many years later that there was a term for it, and not only that, but <br/>\nthat there was alot more to it.  By then our youngest was already 5 years <br/>\nold.  I wished I had heard and read some of the books by Sears way back when <br/>\nmy oldest was born!)  Anyway, I was raised by very, very strict parents who <br/>\nbelieved in yelling and spanking.  Unfortunately, I was encouraged by my <br/>\nfamily and friends to do the same thing with my kids.  It was always my <br/>\nhusband who would say &quot;Now Tami, they are just being kids.  Calm down and <br/>\nquit being so upset.  That is why I don&#39;t understand the change that has come <br/>\nover him in the last year.  Now HE is the one yelling all the time.  He yells <br/>\nat me and the kids.  I have tried to find out if something is bothering him, <br/>\nand he just says that it is the way we are all living.  He can&#39;t stand us <br/>\nsleeping late or staying up late.  He is also bothered by the fact that the <br/>\n17 year old hasn&#39;t made &quot;big plans&quot; for his future.  He says that he doesn&#39;t <br/>\nagree with this &quot;attachment parenting&quot; and &quot;gentle discipline&quot; crap, that <br/>\nwhat these kids need are a good shaking up and a spanking.  He says that they <br/>\ndon&#39;t mind unless he screams at them.  The thing is that the kids are NOT <br/>\nbeing bad at all.  They don&#39;t usually smart off (unless he screams and yells <br/>\nand goads them into it).  They are very well behaved kids, and other people <br/>\nare always complimenting me on their behavior.  I just don&#39;t understand the <br/>\nchange in him at all.  I am wondering if it is because they are all older <br/>\nnow?  The youngest will be 8 in just a few weeks, one just turned 11, one <br/>\nwill be 14 in December, and the oldest will turn 18 in February.<br/>\n     We have had struggles over the unschooling.  Our oldest was in public <br/>\nschool until he turned 13.  We started homeschooling in 8th grade, and we <br/>\nstarted off using KONOS.  It didn&#39;t take long, until I realized just How much <br/>\npublic school had damaged him (there had been two cases of verbal and mental <br/>\nabuse by teachers that my son had endured for a year, that I had no idea was <br/>\ngoing on).  Both of us were burned out, and I just happened to stumble across <br/>\nsome books by John Holt and then later Grace Llewellyn.  That was like a door <br/>\nopening and letting sunshine into our lives!!!  I think all four of my kids <br/>\nhave thrived by unschooling, but my husband is very, very worried (and so our <br/>\nmy parents, and I have to admit that at times, they can even get me worried <br/>\nwhen they keep going on and on about it) because my 17 year old doesn&#39;t want <br/>\nto have ANYTHING to do with anything that even resembles school.<br/>\nMy dh thinks it is because I am not &quot;forcing&quot; him to do Algebra, English, <br/>\nBiology etc.<br/>\nI think it is because he got burned out by public school, and that he will do <br/>\nthose subjects if he decides he need them for something.  The only problem <br/>\nis, that my son has no idea what he wants.  In a big way, I understand.  <br/>\nHeck, I had no idea what I wanted to do when I graduated either, and I went <br/>\nto public school!  My son only knows that he loves anything to do with Star <br/>\nWars and Star Trek (or other Science Fiction or Fantasy, but those two are <br/>\nhis favorite) and he loves playing Nintendo 64 and getting on the internet.  <br/>\nMy husband says this is not enough, and he is pushing him for more!  Right <br/>\nnow, my son is working for his Eagle award for Boy Scouts and is very <br/>\ninvolved in our church.  He really says that he would LOVE being a youth <br/>\nminister.  However, I have told him that this involves college, and that he <br/>\nwould probably need to prepare if that is the case, and he ISN&quot;T motivated at <br/>\nall.  As a matter of fact, he still hasn&#39;t studied for the written test to <br/>\nget his drivers permit, and look how long he has had for that!  He wants his <br/>\ndrivers license, he just doesn&#39;t want to have to WORK for it.  So maybe there <br/>\nis some truth in what my husband says?  Maybe I am not pushing enough?  I do <br/>\nget very confused.  I truly believe in unschooling, but it has been over 4 <br/>\nyears since he got out of public school and he is still not motivated to do <br/>\nanything!<br/>\n     Oh well, this all came about, because I am very, very confused about the <br/>\nchange in attitude from my husband.  I have even wondered if he has some type <br/>\nof illness that is causing these changes in him (I know that some types of <br/>\ncancers or debilitating illnesses can also cause mood changes).  I am really <br/>\nat wits end and very worried about our marriage.  I don&#39;t understand this, <br/>\nand I don&#39;t want to give up unschooling my kids, or give up my ideals of how <br/>\nto bring up my children (no spanking or forcing), because all of a sudden my <br/>\nhusband has done a complete turn around!  I am confused, desperate, and <br/>\npraying for answers!<br/>\nTami</div>","specialLinks":[]},{"userId":0,"authorName":"The White&#39;s","from":"&quot;The White&#39;s&quot; &lt;jwwjr@...&gt;","replyTo":"LIST","senderId":"ZMmcic3Vb6Z261zqFJ1pAFMgnXbd2pBGpiqrg88fi04J2Ro_1TbECZTiEFUUbsRKarHz7N29rTQUBELqMu-_Kt9pqctEsH0-","spamInfo":{"isSpam":false,"reason":"0"},"subject":"time to spend?","postDate":"937884836","msgId":3075,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yMTQuMzA3NS45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":3088,"prevInTime":3074,"nextInTime":3076,"topicId":3075,"numMessagesInTopic":0,"msgSnippet":"Hi all, coming out of lurkdom on the issue of late nights & trying to have some time for yourself & your partner/husband.  What a concept! My name is Cindy","messageBody":"<div id=\"ygrps-yiv-814394505\">Hi all, coming out of lurkdom on the issue of late nights & trying to have<br/>\nsome time for yourself & your partner/husband.  What a concept!<br/>\n<br/>\nMy name is Cindy White, we live in a very rural area of SW Virginia.  We&#39;ve<br/>\nonly lived here about 2 1/2 years, having moved here from small town north<br/>\nof Charlotte (grew up in Charlotte, so rural life takes some getting use<br/>\nto!).  We have 2 children, Dillon is 6 and Emma has just turned 3.<br/>\n<br/>\nWe have always known we would homeschool. We believe in attachment parenting<br/>\nand child-led learning (especially for developmental issues like weaning and<br/>\npotty training), so we naturally fell into an unschool philosophy of<br/>\neducation.  The unschool thing has been a big hurdle for me where we<br/>\nlive...I am the only one, and there is only one other family here who does<br/>\nnot homeschool for religious reasons.<br/>\n<br/>\nWhen Dillon was young I was able to do shift work as a customer svc rep for<br/>\nthe power company, working 3 12&#39;s on the weekends while my husband went to<br/>\nschool full time.  That way we were able to keep Dillon out of daycare.  My<br/>\ndh & I were like 2 ships passing in the night.  I only had to work (same<br/>\nshift) after maternity leave with Emma about 3 months before dh gets current<br/>\njob & I am able to stay at home full time.  That was when we moved here.<br/>\n<br/>\nThank God I have a WONDERFUL husband.  When Dillon was small I found out<br/>\nvery quickly how easy it is to lose yourself.  Then you feel VERY guilty<br/>\nbecause you feel you are neglecting your husband & your marriage.  But my<br/>\nhusband always understood & has always encouraged me.<br/>\n<br/>\nSometimes, manytimes, your are just all touched out.  It&#39;s not that you<br/>\ndon&#39;t want to &quot;snuggle&quot;, it&#39;s just that you&#39;ve been snuggling all day with<br/>\nsomeone else (your children) & it&#39;s hard to want more, even a different<br/>\nkind.  This is mostly when they are babies.<br/>\n<br/>\nNow, in our family, we are just SO busy.  You all know what my schedule is<br/>\nlike with swim classes, playgroups, grocery & other errands, housework &<br/>\nlaundry, etc.  I don&#39;t have to paint that picture for you!  Shortly after<br/>\nbeginning his new job & moving here my dh began working towards his MBA at<br/>\nWake Forest.  Well....MBA, married but alone?  Works all day, drives over 1<br/>\nhr (one way) twice a week, usually more often due to group projects for<br/>\nschool.  When he is at home he is studying.<br/>\n<br/>\nWe are all very greedy with our time, if he has any free time, because there<br/>\nis so little of it.  My dh & I have to work extra hard at finding time<br/>\ntogether, weekend mornings sometimes are good as we can find something to<br/>\ndistract the kids for a little while!  We don&#39;t have a babysitter, don&#39;t<br/>\nreally know anyone, but mainly because Dillon is diabetic.  Emma doesn&#39;t<br/>\nlike anyone else, anyway. So........<br/>\n<br/>\nI don&#39;t think there is an answer to this question except to work harder at<br/>\nmaking it work...just like the homeschool thing.  I&#39;m sure some families<br/>\nsuffer more than others during periods like this due to personality issues,<br/>\nbut luckily my family is doing fine.  My dh makes an extra effort to make<br/>\ntime for me to be alone, even if it&#39;s just going to Walmart alone.  I also<br/>\nmake an effort to give him time he needs...sometimes just some daily cave<br/>\ntime, other times he gets to go by himself to bluegrass festivals or<br/>\ncanoeing/camping.<br/>\n<br/>\nI guess the point I&#39;m trying to make in this long post is, don&#39;t give up.<br/>\nThis is what all good marriages go thru, at least the ones with children.<br/>\nAll of us as homeschoolers have already chosen the harder but more rewarding<br/>\npath for our families.  By harder I mean we don&#39;t take the fast & easy<br/>\nway...we don&#39;t look forward to the day we can send our kids to school or to<br/>\nthe kids bedtime, so we will be rid of them for a while.  We all chose to be<br/>\nwith our kids because we like them, we like being with them.  And because of<br/>\nthat we have to occasionally work harder at the other things.  It&#39;ll all be<br/>\nover so soon, the kids will be grown & gone & we&#39;ll have plenty of time to<br/>\nkeep house & snuggle.<br/>\n<br/>\nI do think you need to keep talking about it...mainly because of the<br/>\nfemale/male, venus/mars way of communicating.  My husband needs me to be<br/>\ndirect with him, I need him to be subtle with me....I suspect that&#39;s a<br/>\ngender thing.<br/>\n<br/>\nSorry this is sooooo long....this has been an ongoing thing for us, since<br/>\nchildren, and is just part of marriage.  And thanks, to all of you, who<br/>\nsupport my unschooling choices.<br/>\n<br/>\nCindy<br/>\nWho rationalizes not doing housework by saying:<br/>\n&quot;I&#39;m going to BE dirt one day, why fight it now!&quot;</div>","specialLinks":[]}],"prevTopicId":3102,"nextTopicId":3085}}