{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Valerie","from":"&quot;Valerie&quot; &lt;valfitz@...&gt;","replyTo":"LIST","senderId":"Dv1dlEi-ewCjgkxvkW32lBrkZEDHtReC2haw91wtYevvLJGsYLrP9zqSJQth3YKY08RCcgqfavXMpTLXCQJatYbKD_E","spamInfo":{"isSpam":false,"reason":"0"},"subject":"The Interview with Gatto","postDate":"989023975","msgId":20513,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDljdml0Nys2cjk5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":20512,"nextInTime":20514,"topicId":20513,"numMessagesInTopic":0,"msgSnippet":"The Spirit of Ma at Vol 2 May 2001 John Taylor Gatto :The Most Famous Teacher in the World by Diane M. Cooper If John Taylor Gatto had your ear - especially if","messageBody":"<div id=\"ygrps-yiv-505825319\">The Spirit of Ma&#39;at Vol 2 May 2001 <br/>\n<br/>\nJohn Taylor Gatto :The Most Famous Teacher in the World<br/>\nby Diane M. Cooper<br/>\n<br/>\n<br/>\nIf John Taylor Gatto had your ear - especially if you are a parent - <br/>\nhe<br/>\nmight ask you some pretty strange questions:<br/>\n<br/>\n* What if it could be absolutely proved to you that the American <br/>\neducational<br/>\nsystem was designed by financiers who felt that self-reliant, self-<br/>\neducated<br/>\nAmerican citizens made poor factory workers and rotten consumers?<br/>\n<br/>\n* What if you could become convinced beyond a shadow of a doubt that<br/>\nliteracy in the United States was at its highest point just before<br/>\ncompulsory education was signed into law?<br/>\n<br/>\n* What if there is a really scarey parallel between school bells and <br/>\nbugle<br/>\ncalls, and it&#39;s not accidental?<br/>\n<br/>\n* Could any of this make even a little dent in the beliefs we have <br/>\nbeen<br/>\nspoonfed by our media about &#39;&#39;Why Johnny Can&#39;t Read&#39;&#39;?<br/>\n<br/>\nForty years ago, Gatto was an advertising copywriter who became bored <br/>\nwith<br/>\nthe ad business and needed a place to &#39;&#39;mark time&#39;&#39; while he thought <br/>\nthings<br/>\nthrough. His roommate at that time had a teaching license but wasn&#39;t <br/>\nusing<br/>\nit. &#39;&#39;It was sitting in a drawer,&#39;&#39; Gatto says. &#39;&#39;He taught for one <br/>\nday,<br/>\ntossed his license in a drawer, and said you&#39;d have to be crazy to do <br/>\nthat<br/>\nfor a living.&#39;&#39;<br/>\n<br/>\nSo using his roommate&#39;s license, Gatto started substitute <br/>\nteaching &#39;&#39;just to<br/>\nsee what it was like.&#39;&#39;<br/>\n<br/>\nHe soon became intrigued by the responsibility the job offered. &#39;&#39;If <br/>\nyou<br/>\ndropped dead,&#39;&#39; he told us, &#39;&#39;there aren&#39;t many businesses that would <br/>\nmiss<br/>\nyou, not even if you were the CEO. But teaching school was <br/>\ndifferent.&#39;&#39;<br/>\n<br/>\nHe ended up teaching for 30 years, as what he calls a &#39;&#39;saboteur&#39;&#39; - <br/>\nsomeone<br/>\nwho tries to change the system simply by refusing to follow it. Along <br/>\nthe<br/>\nway, he learned some sobering, basically frightening, facts about the <br/>\ntrue<br/>\nintent of &#39;&#39;government&#39;&#39; education in our public schools.<br/>\n<br/>\nToday, he says, he is &#39;&#39;in constant motion, in every one of the fifty <br/>\nstates<br/>\nand seven or eight foreign countries, bearing witness to what I saw <br/>\nin that<br/>\n30-year period.&#39;&#39;<br/>\n<br/>\nHere, the Spirit of Ma&#39;at interviews this amazing man whose insight <br/>\nand<br/>\nknowledge have brought a new breath of healing air into the closed<br/>\nclassroom. Author of Dumbing Us Down and The Underground History of <br/>\nAmerican<br/>\nEducation, John Taylor Gatto, although he&#39;s no longer operating from <br/>\nwithin<br/>\nthe system, is still &#39;&#39;the most famous teacher in the United States.&#39;&#39;<br/>\n<br/>\nDiane: How did you happen to get so completely sidetracked from the<br/>\nadvertising business?<br/>\n<br/>\nJohn: What I think happened was a series of events which occurred <br/>\nwhen I was<br/>\nsubstitute teaching, where I seemed to run into a densely compacted <br/>\nmass of<br/>\nperversion on the part of nominal authorities. In challenging or <br/>\ntesting<br/>\nmyself against these authorities, I became genuinely intrigued by what<br/>\nappeared to be massive stupidity. It seemed that things that were <br/>\nvery easy<br/>\nto accomplish were being made impossible to accomplish by the very <br/>\nstructure<br/>\nof the system itself, and its guardians.<br/>\n<br/>\nI decided to take a year or two out of the advertising business and <br/>\nteach. I<br/>\nthought I&#39;d go back, eventually, and make a fortune in advertising. <br/>\nBut each<br/>\nweek I stayed in teaching, I became more enthralled by the political<br/>\nchallenges.<br/>\n<br/>\nToday, after 40 years of thinking about this business, I see that the<br/>\nobstacles that are generated structurally have nothing to do with <br/>\nstupidity.<br/>\nAnd that they are virtually insuperable unless somebody&#39;s ready to <br/>\nplay the<br/>\nsaboteur.<br/>\n<br/>\nA couple years ago, Mort Zukerman, the publisher of US News and World <br/>\nReport<br/>\nand the Atlantic Monthly, said that our wonderful economy is<br/>\nself-maintaining because our people are not like any other people in <br/>\nthe<br/>\nworld. They are interested only in their paycheck. They don&#39;t mess <br/>\naround<br/>\nwith management. They define themselves by what they buy, and they <br/>\nthrow<br/>\naway what they buy as soon as they buy it. They mortgage their <br/>\nfutures.<br/>\n<br/>\nAs I read that article, I said to myself, How do people get this way?<br/>\n<br/>\nWell, they get this way by being schooled to be that way.<br/>\n<br/>\nDiane: So how did our schools get to be that way.<br/>\n<br/>\nJohn: Look at our school system as a laboratory, and then you can see <br/>\nthat<br/>\nthe physical habits that are trained into our children quite <br/>\npurposefully<br/>\nlimit and defeat them. You have to ask someone&#39;s permission to go to <br/>\nthe<br/>\ntoilet. You have to sit in a cramped seat from nine to three with <br/>\nvirtually<br/>\nno ability to get up and move around. These things would be deadly <br/>\neven for<br/>\nadults. For children it&#39;s a colossal perversion.<br/>\n<br/>\nNor are there any known intellectual explanations, based on academic<br/>\nresults, for any of this behavior.<br/>\n<br/>\nAnd the people who stand before these children - the teachers - are <br/>\nthe<br/>\nsingle worst-performing group in American colleges. If that&#39;s not <br/>\nradical<br/>\nenough, the people who manage the people who stand before the <br/>\nchildren -<br/>\nthat is, the superintendents - are considerably more ignorant than <br/>\nthe most<br/>\nignorant subgroup among the teachers.<br/>\n<br/>\nNow, I believe you&#39;d have to be terminally innocent to believe that <br/>\nthis<br/>\ninverted pyramid could have occurred by accident. But it is the only <br/>\nway to<br/>\nkeep the system intact. You put the worst people in charge, and the<br/>\nsecond-worst people in charge of the kids. And you do this in second, <br/>\nthird,<br/>\nand fourth grades. Kids either learn to think critically at that age, <br/>\nor 95<br/>\npercent of the time, they never do.<br/>\n<br/>\nAnd, starting out in kindergarten, sitting in our schools makes people<br/>\nrestless - with each other, with themselves, with their families, <br/>\nwith their<br/>\npossessions. When you can make people generally discontented with<br/>\neverything, you have the perfect climate for a successful mass-<br/>\nproduction<br/>\neconomy. And when you have people who don&#39;t understand anything <br/>\nexcept some<br/>\nlittle specialty - like how to drill a tooth, how to argue a case in <br/>\ncourt,<br/>\nsome little thing - you have the perfect climate for running <br/>\neverything<br/>\ncentrally. Specialists don&#39;t see themselves as citizens.<br/>\n<br/>\nDiane: So how did this happen, if it wasn&#39;t an accident?<br/>\n<br/>\nJohn: If you look at the annual reports of the Carnegie Foundation <br/>\nbeginning<br/>\nabout 1906, you&#39;ll find out where schooling and its structure came <br/>\nfrom.<br/>\nYou&#39;ll find out what its goals are. And it is nothing to do with any <br/>\ndebate<br/>\nbeing conducted in any press or any forum in the United States, today <br/>\nor any<br/>\nother year that I&#39;m aware of.<br/>\n<br/>\nIf you take the window of 1890 to 1910, what was traditionally <br/>\nthought of as<br/>\n&#39;&#39;schooling&#39;&#39; began to vanish. It was replaced by a kind of global<br/>\nexperiment in human behavior, in human obedience, tractability, and<br/>\nconditioning. Our schools today are a laboratory of human behavior.<br/>\n<br/>\nA lot of this you can deduce logically. If you&#39;ve got a small-farm,<br/>\nagricultural economy, it&#39;s easy to see the qualities people will <br/>\nneed: the<br/>\nability to be alone with themselves for long periods of time, to be <br/>\nutterly<br/>\nresourceful, to be able to fix anything that broke.<br/>\n<br/>\nSo what if you&#39;ve suddenly got a mass production economy where the <br/>\nmachinery<br/>\nhas to run night and day in order to pay for itself. How could you <br/>\ntrain<br/>\nthese self-sufficient, resourceful kids to support such an economy? <br/>\nThat was<br/>\nthe question.<br/>\n<br/>\nHow it happened was not a secret. Between 1890 and 1910, there were <br/>\nmasses<br/>\nof public statements made by the owners of the new economy, <br/>\nstatements that<br/>\nwere extremely anti-intellectual, extremely demanding of what they <br/>\nwanted<br/>\nschools to produce. And on higher levels, such as the Harvard Ed. <br/>\nJournal,<br/>\nthere were actually bald statements of what these demands were all <br/>\nabout.<br/>\n<br/>\nYou can&#39;t accuse these people of being conspiratorial. They were very <br/>\nopen<br/>\nabout what they were bringing about - which was, in part, the death of<br/>\ncapitalism.<br/>\n<br/>\nDiane: So how did they mean to accomplish this?<br/>\n<br/>\nJohn: Their method was to model our schools after the Prussians. The<br/>\nPrussians had figured out in the early part of the 19th century, long <br/>\nbefore<br/>\nwe had forced schooling ourselves, that if you lock all the kids up <br/>\nand keep<br/>\nthem amused with colors, games, music, and balloons until they&#39;re <br/>\nabout ten<br/>\nor eleven, then all of a sudden you crack down and say, Okay, the fun <br/>\nis<br/>\nover, those children will never recover their volition, their <br/>\nindependence -<br/>\ntheir minds. They will become wonderful soldiers and workers. Even if <br/>\nthey<br/>\ncan conceive of opposition, they won&#39;t be able to sustain it.<br/>\n<br/>\nThis is how Germany produced the most successful armies that have <br/>\never been<br/>\nseen in history. Even in its lost wars, even when outnumbered two to <br/>\none and<br/>\nmore, Germany regularly inflicted thirty to forty percent more <br/>\ncasualties<br/>\nthan those it fought against. The army worked like a well-tuned <br/>\nmachine<br/>\nbecause no one ever argued with orders.<br/>\n<br/>\nDiane: So the developers of our compulsory education system adopted <br/>\nthat<br/>\nsystem?<br/>\n<br/>\nJohn: Yes. People went to Germany in the late 19th and early 20th <br/>\ncentury<br/>\nand came back with these coveted German PhDs - we didn&#39;t have our own <br/>\nPhDs<br/>\nyet - and they took over the presidencies and the heads of key <br/>\ndepartments<br/>\nin every major American university.<br/>\n<br/>\nDiane: I was looking at the word &#39;&#39;kindergarten&#39;&#39; and it dawned on me <br/>\nthat<br/>\nthat, too, is a German phrase.<br/>\n<br/>\nJohn: Yes, and it doesn&#39;t mean &#39;&#39;a garden for children.&#39;&#39; It means a <br/>\ngarden<br/>\nwhere teachers cultivate children like vegetables. Frederick Frobel - <br/>\nthe<br/>\nguy who invented kindergarten - had a life-long dream to be a member <br/>\nof the<br/>\nPrussian Army, but they wouldn&#39;t take him because he was born in <br/>\nAustria.<br/>\n<br/>\nDiane: So the system is about our economy?<br/>\n<br/>\nJohn: People who believe that organized schooling can be about <br/>\nanything else<br/>\nthan serving the existing economy are out of their minds. I feel a <br/>\ngreat<br/>\ndeal of sympathy for these people, the huggy kind, because they don&#39;t<br/>\ndeserve what they get, and they certainly don&#39;t deserve to waste their<br/>\nlife&#39;s energy and their heart&#39;s blood fighting imaginary battles on<br/>\nimaginary battlefields.<br/>\n<br/>\nBut there isn&#39;t any way for a centralized school operation not to be <br/>\nabout<br/>\nthe dominant economy. You can argue till you&#39;re blue in the face. And <br/>\nif<br/>\nyou&#39;re a mother, you&#39;ll be arguing with a school teacher, or a <br/>\nprincipal, or<br/>\na superintendant. And when you do, you&#39;re arguing with someone who <br/>\nhas no<br/>\npower at all. None of those roles has any power at all. The only way <br/>\nthey<br/>\ncan step out of their powerless role is to play the role of saboteur.<br/>\nBecause the system, by definition, has no room for debate. It may <br/>\nfeign<br/>\ndebate as a way to bleed away public discontent, but by definition, <br/>\nthere is<br/>\nno room for real debate. The system is systematic - if it&#39;s not <br/>\nsystematic,<br/>\nit&#39;s not a system anymore. It collapses. There is no wiggle room at <br/>\nall.<br/>\n<br/>\nDiane: A while ago, you said the change to our school system was in <br/>\norder to<br/>\nbring about an end to capitalism. Could you say more about that? I <br/>\nthought<br/>\nwe still had capitalism.<br/>\n<br/>\nJohn: It&#39;s true that we are all racing around screaming at each other <br/>\nabout<br/>\nwho&#39;s the greatest capitalist. But it&#39;s impossible any longer to be a<br/>\ncapitalist - there is no competition left that matters at all.<br/>\n<br/>\nI&#39;ll give you a few pieces of evidence: Lockheed and Boeing should <br/>\nhave gone<br/>\nout of business years ago. They weren&#39;t allowed to go bankrupt <br/>\nbecause your<br/>\ntax dollars were used to buoy them up until they could sustain <br/>\nthemselves<br/>\nagain.<br/>\n<br/>\nChrysler is another corporation that should have gone bankrupt a long <br/>\ntime<br/>\nago. There is no reason for Chrysler to be in business except for <br/>\nmassive<br/>\ninjections of federal tax money.<br/>\n<br/>\nThe government issues bogus contracts, and simply buys things that are<br/>\njunked instantly, all in order to keep these few central corporations <br/>\nin<br/>\nbusiness. Chrysler is just one of the most flagrant examples.<br/>\n<br/>\nIn my later life I&#39;ve been dumbfounded that otherwise intelligent <br/>\npeople -<br/>\ncertainly my intellectual peers - can look at the words and the story <br/>\nand<br/>\nare unable to see the meaning. Some of them could pass a quiz about <br/>\nwhen<br/>\nChrysler went bankrupt, and what year the government bail-out <br/>\noccurred, and<br/>\nwhat size it was - but they have no idea of the significance of this. <br/>\n<br/>\nOur economy is basically centralized in 200 corporations who are <br/>\ntotally<br/>\ndependent on government privilege. These corporations require the <br/>\ngovernment<br/>\nto stamp out any competition that emerges, and they require the <br/>\ngovernment<br/>\nto pick them up when they stumble and fall, and bail them out with <br/>\npublic<br/>\nfunds.<br/>\n<br/>\nThere&#39;s no competition. There hasn&#39;t been since the end of the second <br/>\nWorld<br/>\nWar. And as I implied earlier, the plan to destroy capitalism was <br/>\nannounced<br/>\nby Carnegie and company back in the 1890s. They said that only stupid <br/>\npeople<br/>\nand fools competed. That competition was a huge waste of energy and <br/>\nprofit,<br/>\nand that there was room for anyone who wanted to play ball. They said <br/>\nthat<br/>\nthe democratic populace of the country was getting in the way, so the<br/>\npopulace was going to have to be put out of commission. These <br/>\nstatements<br/>\nwere made quite openly. But no one paid any attention.<br/>\n<br/>\nThen these ideas were written into legislation.<br/>\n<br/>\nIn Silicon Valley, for example, they succeeded in outdistancing their<br/>\ncompetition through government intercession, guaranteed contracts, <br/>\nprotected<br/>\nmarkets, and guaranteed profits. Then, with that giant stream of <br/>\nrevenue<br/>\nfrom the government, they could hire away the creative personnel that <br/>\nhad<br/>\ndeveloped in places you&#39;ve never heard of - like someone&#39;s garage.<br/>\n<br/>\nDiane: You call yourself a saboteur. How did you get &#39;&#39;found out&#39;&#39;?<br/>\n<br/>\nJohn: Saboteurs identify themselves by their radically different <br/>\nnumbers.<br/>\n<br/>\nDiane: What if the numbers are positive?<br/>\n<br/>\nJohn: It doesn&#39;t matter. The public perception that good school-<br/>\nteaching is<br/>\ndesired or rewarded is naive. Teaching is a &#39;&#39;guild&#39;&#39; system, and <br/>\nunlike<br/>\nwhat we were taught in school, guilds were not about ensuring <br/>\nquality. In a<br/>\nguild, the idea was to ensure that nobody used a technology or method <br/>\nunless<br/>\neveryone else was using it. There is no innovation in a guild.<br/>\n<br/>\nDiane: Well, we can see that schoolteachers aren&#39;t necessarily honored<br/>\nguildmembers, either. Not if you gauge it by the pay rate.<br/>\n<br/>\nJohn: I would dispute that. The national average for teachers right <br/>\nnow is<br/>\nabout $41,000 for a nine-month year - comparable to about $55,000. <br/>\nThat&#39;s<br/>\nthe average. The upper end of the scale, in most places, is around <br/>\n$70,000.<br/>\nThat doesn&#39;t match the range of a doctor or a lawyer, of course...<br/>\n<br/>\nDiane: Most of the teachers I&#39;ve heard of are not making that kind of<br/>\nmoney...<br/>\n<br/>\nJohn: You believe that because that&#39;s the stuff that&#39;s pumped out by <br/>\nthe<br/>\nteachers&#39; unions. The reality is quite different.<br/>\n<br/>\nTeachers need only a very indifferent education, and in return, they <br/>\nget a<br/>\nguaranteed pension, medical plan, and income that is certainly <br/>\nadequate, if<br/>\nnot munificent. It seems to me that American teaching as a career is <br/>\none of<br/>\nthe great deals in human history, especially for people who, by and <br/>\nlarge,<br/>\nare not very accomplished themselves. Many teachers&#39; hearts could <br/>\nbear a<br/>\nvery close scrutiny - but not their intellects or their <br/>\naccomplishments, or<br/>\neven their understanding.<br/>\n<br/>\nIt&#39;s funny, you can take five-year-olds off the street, and teach <br/>\nthem in<br/>\nabout two weeks to do all the arithmetic operations mentally - <br/>\nreally, up to<br/>\nmultiplying four or five figures! That&#39;s all it would take, two <br/>\nweeks. Even<br/>\naccomplished mathematicians say that the entire mathematics curriculum<br/>\nthrough calculus and trig takes about 50 contact hours to deliver.<br/>\n<br/>\nThe consensus is that it takes 30 contact hours to bring someone to <br/>\nthe<br/>\npoint where they can be a self-teacher in reading for the rest of <br/>\ntheir<br/>\nlives.<br/>\n<br/>\nWhen we see kids who can&#39;t read, we&#39;re seeing the results of a radical<br/>\ndysfunction that is transmitted by schooling. We&#39;re talking about <br/>\nthings<br/>\nthat are very, very easy to learn.<br/>\n<br/>\nThe funny thing is, it&#39;s very, very easy to put children back on <br/>\ntrack to<br/>\nwhere they can self-teach. But that&#39;s not allowed! That sort of thing <br/>\nreally<br/>\nis severely punished by structured schooling.<br/>\n<br/>\nI&#39;m not suggesting that teachers, principals, or even superintendents<br/>\nunderstand that this is what&#39;s going on. They do what they are <br/>\ninstructed to<br/>\ndo by the orders that are passed down - from where, they don&#39;t know, <br/>\nbut<br/>\nthey do know that if those orders aren&#39;t followed, some people are <br/>\ngoing to<br/>\nget in a lot of trouble.<br/>\n<br/>\nDiane: Do you think the rebellion that we are seeing within our <br/>\nchildren<br/>\ntoday - the murders, the drugs, the high crime, and so on - is the <br/>\nAmerican<br/>\npsyche saying that they&#39;ve had enough?<br/>\n<br/>\nJohn: Yes. Plato said that before you can make a new society you have <br/>\nto<br/>\nwipe the slate clean. One way to do that was to wipe our children&#39;s <br/>\nminds<br/>\nclean of history, philosophy, literature - all the things that used to<br/>\nprovide models of human behavior and the range of human choice.<br/>\n<br/>\nWhat was also required to reach the path we are in now was for four <br/>\nor five<br/>\ngenerations of parents to become progressively weaker, more isolated <br/>\nfrom<br/>\nreality, more specialized, dependent, addicted to purchasing - so <br/>\nthat each<br/>\nsucceeding generation of parents, from somewhere around 1910 on, has <br/>\nhad<br/>\nless to teach its own children. The consequence is that children are<br/>\nlearning very early on to disrespect their parents. They are learning <br/>\nto<br/>\nkeep two sets of books... to lie with an easy heart...<br/>\n<br/>\nSo now, with the existing adult generation providing no models to <br/>\nfollow at<br/>\nall, you see children casting their lot with a basketball player or a <br/>\nsinger<br/>\nor a comedian - or God knows what. Television actors. Commercial <br/>\nmusicians.<br/>\n<br/>\nDiane: So how are we going to change this?<br/>\n<br/>\nJohn: We&#39;re not going to change it. This system will overthrow itself.<br/>\nThere&#39;s not the slightest doubt in my mind that that is happening <br/>\nright now.<br/>\n<br/>\nBut it isn&#39;t going to happen in the halls of Congress. I think it&#39;s <br/>\nuseful<br/>\nto argue in the streets, but that also has limited utility, and it&#39;s <br/>\ntoo<br/>\neasy to cripple the few leaders.<br/>\n<br/>\nThe system will come apart because it has become so anti-life that it <br/>\nnow<br/>\nhas to spend huge amounts of its energy watching out for people like <br/>\nme. The<br/>\nsaboteurs.<br/>\n<br/>\nIf you want to accelerate the procedure, you absolutely have to do it<br/>\nindividually, on a family-by-family basis. And maybe in little <br/>\nneighborhoods<br/>\nor private associations, but not by linking together in a big <br/>\ncountersystem.<br/>\nThat can be self-defeating.<br/>\n<br/>\nDiane: And you say it&#39;s already happening.<br/>\n<br/>\nJohn: Yes. There is already quite a snowball effect happening.<br/>\n<br/>\nFor example, there can&#39;t really be anyone who thinks standardized <br/>\ntests<br/>\nmeasure what they purport to measure. Not the people who make the <br/>\ntests, and<br/>\nnot the people who administer them. Bill Bradley - who&#39;s considered <br/>\nthe<br/>\nintellectual of the Democratic Party and graduated from Princeton - <br/>\nhad a<br/>\n480 on the language SAT. That&#39;s a moron&#39;s score. Senator Paul <br/>\nWellstone had<br/>\na combined total score in math and language of 800, an astonishingly <br/>\nlow<br/>\nscore. I could go on and on with examples like that. Bush had a 550, <br/>\nand he<br/>\ngraduated from Yale! If you can be a Senator, a Governor, or the <br/>\nPresident<br/>\nwith these numbers, why not anything else? Why the atmosphere of <br/>\nthreat and<br/>\nfear schools use as &#39;&#39;motivation&#39;&#39;?<br/>\n<br/>\nAnd there have been regular &#39;&#39;test revolts&#39;&#39; for the past ten years. <br/>\nBut the<br/>\npapers, which are owned by those few corporations we talked about, <br/>\nwere not<br/>\nallowed to report them for fear that it would give other people ideas.<br/>\n<br/>\nThen recently, a hundred mothers in Scarsdale, the richest community <br/>\nin the<br/>\nUnited States, have refused to allow their kids to take standardized <br/>\ntests.<br/>\n<br/>\nDiane: And that&#39;s having an effect?<br/>\n<br/>\nJohn: That&#39;s made the front page. When a hundred mothers in <br/>\nScarsdale -<br/>\nevery one of them in a $2 million home or better - make a stand, then <br/>\nthe<br/>\npapers can no longer refuse to cover it. Because now the decay has <br/>\nreached<br/>\nthe very group that supposedly protects the system.<br/>\n<br/>\nSo a lot has happened. I cast my own lot 40 years ago as a saboteur, <br/>\nand it<br/>\nwould be difficult to quantify the damage I&#39;ve done, but I know that <br/>\nit&#39;s<br/>\nbeen considerable.<br/>\n<br/>\nAnd there&#39;s more to come. As I travel around the country I find <br/>\npeople of<br/>\nevery persuasion who are doing it - they probably don&#39;t think they are<br/>\nsabotaging, but that&#39;s what it is. When you react against a system&#39;s<br/>\ndirectives, you&#39;re sabotaging the system. That system may be a <br/>\nmillion times<br/>\nstronger than you. But it&#39;s not unlimited. It doesn&#39;t have an <br/>\nunlimited<br/>\nability to suppress all these reactions.<br/>\n<br/>\nDiane: So it will be family by family making a stand?<br/>\n<br/>\nJohn: It&#39;s going to be conversations like you and I are having right <br/>\nnow.<br/>\nAnd passing that on.<br/>\n<br/>\n<br/>\n<br/>\nGatto has the following works on the web:<br/>\n<br/>\n* johntaylorgatto.com: Gatto&#39;s web site includes information about his<br/>\nimportant new book, The Underground History of American Education, <br/>\nand about<br/>\nother projects he is working on.<br/>\n* Dumbing Us Down: The Hidden Curriculum of Compulsory Schooling: a<br/>\nselection from the book of this name.<br/>\n* Education and the Western Spiritual Tradition: An address by John <br/>\nTaylor<br/>\nGatto at the &quot;Spirituality In Education&quot; conference, sponsored by the <br/>\nNaropa<br/>\nInstitute, focusing on The Congregational Principle and Original Sin.<br/>\n* Bootie Zimmer&#39;s Choice: Gatto uses the way he learned to read from <br/>\nhis<br/>\nmother, Bootie Zimmer, as an example of the independent learning that <br/>\nis<br/>\ncrushed by compulsory schooling.<br/>\n* The Origins of Compulsory Education: A history of how the system of<br/>\ncompulsory education was invented in Prussia and imported to the <br/>\nUnited<br/>\nStates.<br/>\n* The Six-Lesson Schoolteacher: an essay that shows how schools crush<br/>\nstudents&#39; spirits.<br/>\n* The Nine Assumptions of Modern Schooling: a brief description of <br/>\nthe ways<br/>\nthat modern schools stop children from learning.<br/>\n* The 7-Lesson Schoolteacher: A longer essay on the way that our <br/>\nschools get<br/>\nin the way of learning.<br/>\n* Thoughts on Education: an article reprinted from Homefires - The <br/>\nJournal<br/>\nof Homeschooling.<br/>\n* The Public School Nightmare: Why fix a system designed to destroy<br/>\nindividual thought? An argument against public schooling and in favor <br/>\nof a<br/>\nvoucher system.<br/>\n* The Curriculum of Necessity: The curriculum that is actually needed <br/>\nto<br/>\nsucceed cannot be taught in schools.<br/>\n* Personal Solutions, Family Solutions: Gatto explains why he decided <br/>\nnot to<br/>\nimprove his country land -- following the Buddha&#39;s maxim: &quot;Do <br/>\nnothing. Time<br/>\nis too precious to waste.&quot;<br/>\n* What Really Matters, part 1 and part 2: A two-part essay on why our<br/>\ntechnological society is unsatisfying.<br/>\n* We Need Less School, Not More : Schools are mechanical institutions <br/>\nthat<br/>\ndrain the vitality of families and communities.<br/>\n* Interview: Gatto is interviewed by former California governor Jerry <br/>\nBrown.<br/>\nThere is also a brief synopsis of this interview on this page.<br/>\n* I may be a teacher, but I&#39;m not an educator: In this article from <br/>\nthe Wall<br/>\nStreet Journal, Gatto explains why he cannot continue as a teacher.<br/>\n* Acceptance Speech: The acceptance speech that Gatto gave when he <br/>\nwas given<br/>\nthe New York State Teacher of the Year award in 1990.<br/>\n* Essays by Gatto: A number of essays by John Taylor Gatto.</div>","specialLinks":[]}],"prevTopicId":20494,"nextTopicId":20330}}