{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":73238415,"authorName":"Julie Stauffer","from":"&quot;Julie Stauffer&quot; &lt;jnjstau@...&gt;","profile":"jnjstau","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Digest Number 2022","postDate":"1020273765","msgId":36624,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDgwMWMxZjEzNCRkZTZjMDhhMCQ1YTgwZWU0MEBkZWZhdWx0Pg==","referencesHeader":"PDEwMjAyNTc2MjYuODY1NC40NDI2NC5tOEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":36623,"nextInTime":36625,"topicId":36624,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1191352765\">&lt;&lt;If this is what you people think then why couldn&#39;t a TCS parent always<br/>\nreason with their kid and never coerce?  As we suggest...&gt;&gt;<br/>\n<br/>\nBecause, just like adults, kids are often agreeable to things and then<br/>\nchange their minds.  Because, just like adults, sometimes kids have trouble<br/>\ncontrolling their behavior and emotions.  Because, just like adults,<br/>\nsometimes they require coercion to do what is most appropriate for the group<br/>\n(since none of us live in a vacuum).<br/>\n<br/>\nTrue life example from last night:<br/>\n<br/>\nZach (8) has a Little League Game.  We eat dinner then load up all the kids<br/>\nwith snacks and juiceboxes and head out.  We set up lawn chairs on one side<br/>\nof the field where there are lots of rocks and dirt that the kids like to<br/>\nplay in.  On the other side are swings.  Danny (3) and Michelle (2) ask me<br/>\nto take them to the swings.  I agree to take them but say that I am not<br/>\nwilling to push them because I want to watch Zach&#39;s game.  (Zach is doing<br/>\nreally well this year and quite naturally wants us to watch him).  I can<br/>\nstand by the field and watch the game and the swings but if I go to the<br/>\nswings I can&#39;t see the game.<br/>\n<br/>\nThe youngsters agreed to swing themselves (laying on their stomachs) and off<br/>\nwe went.  After a few minutes, Danny comes running up and wants me to push<br/>\nhim in the swing.  I reminded him that I wanted to watch the game, that I<br/>\nhad told Zach I would watch the game, that Zach would be sad if he looked up<br/>\nand I was gone, that Danny had agreed to swing himself, etc..  Danny began<br/>\nto whine.  I suggested he ask Michelle to take turns pushing each other, or<br/>\ngo ask Adriane (11) or see if Daddy wanted to push.  Danny&#39;s response was<br/>\nlouder whines, flop onto the grass and screams of &quot;But I want<br/>\nY-o-o-u-u-u!!&quot;.  I told him I would hold him, we could sit together, we<br/>\ncould play however he wanted as long I could also watch Zach.  Danny howled<br/>\nthat he wanted me to push him in the swing.  At this point, I got mad and<br/>\nsaid &quot;I am going to watch the game now.  If you want to stay here with me,<br/>\nyou need to cut it out&quot; and I turned to watch the game.  The yelling<br/>\nsimmered into glares and eventually stopped. Within 5 minutes, Danny is<br/>\nrunning around catching various bugs which he brings to me to &quot;ooh&quot; and<br/>\n&quot;aaah&quot; over.<br/>\n<br/>\nThe dilemma was that I have responsibilities to more people than just Danny.<br/>\nI have responsibilities to the older kids to be an attentive parent.  I have<br/>\nresponsibilities to Michelle to stay near her while she plays so she can be<br/>\nsafe (I couldn&#39;t leave the swing area).  Danny is 3.  I have the<br/>\nresponsibility to him to be understanding when he has difficulty seeing that<br/>\nI am more than just HIS MOM, but also mom to the other kids as well.</div>","specialLinks":[]}],"prevTopicId":36594,"nextTopicId":36626}}