{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":77522235,"authorName":"Julie Bogart","from":"Julie Bogart &lt;julie@...&gt;","profile":"juliecinci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"TranslationsJoyce","postDate":"1044037153","msgId":57357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBNUZGRTE2LjIzRUIlanVsaWVAYnJhdmV3cml0ZXIuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":57356,"nextInTime":57358,"topicId":57357,"numMessagesInTopic":0,"msgSnippet":"Your post was so helpful to me. Last night I lay in bed talking with my husband. I was cracking up. I have been on so many lists in the past eight years and","messageBody":"<div id=\"ygrps-yiv-1046057252\">Your post was so helpful to me.<br/>\n<br/>\nLast night I lay in bed talking with my husband. I was cracking up. I have<br/>\nbeen on so many lists in the past eight years and have moderated a bunch of<br/>\nthem. I run a forum and teach in a business and have been hired to speak<br/>\nabout homeschooling all over the place.<br/>\n<br/>\nYet I have never felt so incompetent with expressing how my family lives and<br/>\nwhy as I have on this list!<br/>\n<br/>\nIn the last couple of days, I&#39;ve begun to see why. It&#39;s because I don&#39;t know<br/>\nthe unschooling language. I am learning it as I read. And I&#39;m trying to<br/>\nconvey what I know of how my family runs at the same time as I make paradigm<br/>\nshifts. That means sometimes my stories are off the mark and other times,<br/>\nI&#39;m happily surprised at how much they already fit!<br/>\n<br/>\nYou said:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If conscious parenting and unschooling were rule based, we could easily say<br/>\n&gt; &quot;Kids need help with this, this and this and you can drop helping them with<br/>\n&gt; that, that and that.&quot; But it isn&#39;t rule based. It&#39;s based on the philosophy<br/>\n&gt; of listening to what you&#39;re kids are saying with their words and behavior<br/>\n&gt; and helping them get what they want out of life. And that&#39;s a really hard<br/>\n&gt; idea to convey accurately. Especially since most parents are certain they do<br/>\n&gt; that already. And trying to get them to see how disrespectful standard<br/>\n&gt; parenting practices are without them feeling that they as people are<br/>\n&gt; disrespectful is a challenging task. (&quot;What do you mean I&#39;m not respectful<br/>\n&gt; of my kids!?&quot;) It&#39;s as hard as getting across the concept to a child that<br/>\n&gt; just because I don&#39;t like what you&#39;re doing doesn&#39;t mean I don&#39;t like you.<br/>\n&gt; It&#39;s a challenge to discuss the actions without the person thinking their<br/>\n&gt; character is being discussed.<br/>\n<br/>\n </span></blockquote>I think this is the primary issue for most moms coming to the list. They are<br/>\nalready interested in being respectful, in-touch moms. They already believe<br/>\nthat they are for the most part. So when answers come back that don&#39;t<br/>\nacknowledge that belief, it feels like, &quot;Well, maybe I just didn&#39;t express<br/>\nmyself well enough. I&#39;m going to try again.&quot; But that fuels another round of<br/>\nanswers that shows this mom that she really isn&#39;t considering her kids to<br/>\nthe degree that she thought.<br/>\n<br/>\nI realized in my discussion of routines that that word itself was creating a<br/>\ncompletely different mental picture for the readers than it meant to me in<br/>\nmy circles. I was so happy when Ren pointed it out! So I felt that I finally<br/>\ncommunicated and I also then could see what nuances I needed to address in<br/>\nour home.<br/>\n<br/>\nSandra said that she&#39;s been giving the practical examples while she<br/>\narticulates the whys, but that it&#39;s also it&#39;s up to us to keep reading to<br/>\nfind the whys, too. I agree and that&#39;s just what I&#39;m doing. I assume most of<br/>\nthe women here are. Sandra, your personal examples have been really helpful<br/>\nto me.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Until we figure out some good ways of getting the concepts across -- and<br/>\n&gt; it&#39;s not going to happen any time soon -- it&#39;s helpful to accept that lots<br/>\n&gt; of stuff is going to get mistranslated. It&#39;s like unschoolers are speaking a<br/>\n&gt; foreign language. The problem is the language sounds exactly like English so<br/>\n&gt; it seems like we&#39;re communicating. But the two languages have different<br/>\n&gt; definitions for words that sound and look the same.<br/>\n<br/>\n </span></blockquote>This is the real issue. It&#39;s not just the whys or the whats. It&#39;s the<br/>\ntranslation process.<br/>\n<br/>\nTwo cents from me. One thing that might help the translation process is to<br/>\ncop to it all the time. For instance:<br/>\n<br/>\n&quot;Julie I hear you saying the word &quot;routine&quot;. To an unschooler that means X.<br/>\nWhat do you mean by it?&quot;<br/>\n<br/>\nOr:<br/>\n<br/>\n&quot;Sounds like you feel you have a good relationship with your kids. I thought<br/>\nthat I did too. Then I tried X and discovered that there was a lot of stuff<br/>\nI hadn&#39;t known about until... How would you handle this situation? An<br/>\nunschooler would probably think about it this way.&quot;<br/>\n<br/>\nI think it helps to believe the best about the ones trying to learn this<br/>\nstuff so that they are willing to risk opening their lives up for<br/>\nexamination. It&#39;s not easy to be the one asking questions and finding out<br/>\nthat how you&#39;ve been doing things may actually be damaging.<br/>\n<br/>\nAnyway, I love this list. I have grown through being here. And I&#39;m enjoying<br/>\nnot having to answer questions as an expert. Glad that&#39;s your job this time,<br/>\nnot mine. :)<br/>\n<br/>\nJulie B</div>","specialLinks":[]}],"prevTopicId":56910,"nextTopicId":57211}}