{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":23,"messages":[{"userId":281851436,"authorName":"hbonda","from":"&quot;hbonda&quot; &lt;hbonda@...&gt;","profile":"hbonda","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son says he needs to go to school...","postDate":"1265301325","msgId":50455,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrZXQwZCs0NmtmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg1OTNCRTQ2LUNDREMtNEM3NS1CRjg4LUYyQkFBMzkzMDlFOEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50438,"nextInTopic":0,"prevInTime":50454,"nextInTime":50456,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"Hey Vidyut, i m sure we ll meet or chat soon. To All: My husband s family is still not on board in some ways and yet are sweet enough to voice their dissension","messageBody":"<div id=\"ygrps-yiv-837220282\">Hey Vidyut,<br/>\ni&#39;m sure we&#39;ll meet or chat soon.  <br/>\n<br/>\nTo All:<br/>\nMy husband&#39;s family is still not on board in some ways and yet are sweet enough to voice their dissension in soft ways.  So i am very fortunate in that regard.  But the most important aspect of our unschooling life here is that my husband, Ravi, is of the strong opinion that its nobody&#39;s business how we raise our children.  And that strong stand has been sensed by both our families.  So they rarely interfere.  I am grateful for his strength in this matter as i spent too much energy early on defending and explaining to family members.  I&#39;ve grown calmer, more comfortable in my unschooling-skin and hence don&#39;t defend any more.  I simply state &quot;yes, Raghu plays video games a lot&quot; and smile ;-) &quot;yes, Zoya eats Nutella as she pleases&quot; and smile.<br/>\n<br/>\nHowever i do what i can to alleviate their fears.  When possible i will show them things the kids are working on .  I will tell them of other unschooling/homeschooling families in the world and in India too.  I explain the principles behind the way we approach food etc.  It probably goes over their heads... but its what i can do given that their presence in our lives here in INdia is important to me and Ravi.<br/>\n<br/>\nMy family has an easier time because they expect the unexpected from me.  And i have a sister who is very in tune with the principles of unschooling more so because the principles have helped with various relationships in her life. She helps in giving my parents a perspective.<br/>\n<br/>\nHowever a big aspect of our lives here could have been Mother-in-law moving in with us.  She is alone and could easily have been with us.  However I think our lifestyle made her too uncomfortable.  And I found that Ravi had the foresight to see that a permanent move would have jeopardized the peace in the house.  Having her visit us often is better all around.  I admire Ravi for his ability to draw that line and not succumb to the emotional aspect.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; Laws can be changed.<br/>\n&gt; The opinions of grandmothers are often intractable. &lt;g&gt;<br/>\n&gt; <br/>\n&gt; When Hema Bharadwaj was here last fall we talked about that.  Where I  <br/>\n&gt; live, I could just reassure my mother-in-law that it was legal, and  <br/>\n&gt; then &quot;I won.&quot;  In India, if it&#39;s not a matter of law, then it&#39;s all  <br/>\n&gt; down to social and familial pressure, and much more difficult to  <br/>\n&gt; influence from the younger end.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265261236","msgId":50438,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI2RUNDRjFCLUQxMTctNEQ2MC04RjU4LTRERTdEN0EyMTgxMEBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGhrZGdpMCs0ZjhtQGVHcm91cHMuY29tPg==","referencesHeader":"PGhrZGdpMCs0ZjhtQGVHcm91cHMuY29tPg=="},"prevInTopic":50437,"nextInTopic":50455,"prevInTime":50437,"nextInTime":50439,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"... I asked because there are plenty of video games which use writing and spelling. Does he play any games that need him to type and spell? Like on-line RPG s?","messageBody":"<div id=\"ygrps-yiv-743186578\"><blockquote><span title=\"ireply\">&gt; --&gt; Does he play video games?<br/>\n&gt; All the time.  That is what my parents and in-laws think there is a  <br/>\n&gt; problem. :)<br/>\n&gt;<br/>\n </span></blockquote>I asked because there are plenty of video games which use writing and  <br/>\nspelling. Does he play any games that need him to type and spell? Like  <br/>\non-line RPG&#39;s?<br/>\n<br/>\nMy 14-year-old daughter learned to spell, write, and use correct  <br/>\npunctuation by reading and playing games on her own around the age of  <br/>\n11, plus corresponding and playing with friends on-line from about 12  <br/>\nonward. She&#39;s not much for cursive, but prints legibly. But she types  <br/>\nlike a mad thing - fast and accurate.  That&#39;s a skill that will  <br/>\nprobably be way more important than handwriting down the road.<br/>\n<br/>\nVideo game playing can lead to jobs and careers and perhaps you have  <br/>\ntold him that. And you could probably tell him all sorts of success  <br/>\nstories. But somehow, his grandparents are doing their level best to  <br/>\nmake him feel &quot;not enough&quot; (and at 13, for heaven&#39;s sake). What  <br/>\nteacher-grandparents know about the job market and what it&#39;s going to  <br/>\nbe like for him when he&#39;s ready would probably fit in a thimble (which  <br/>\nnot may people use anymore either!).<br/>\n<br/>\nI reiterate my suggestion to run interference on the relatives.  <br/>\n&quot;Testing&quot; kids is rude and inconsiderate and he should be protected  <br/>\nfrom it.  If you&#39;re not there, you should set some boundaries. Besides  <br/>\nundermining him, it undermines you, because it suggests you don&#39;t know  <br/>\nwhat you&#39;re doing if the poor kid can&#39;t write (and won&#39;t get a diploma  <br/>\nand won&#39;t get a job).<br/>\n<br/>\nRobin B.</div>","specialLinks":[]},{"userId":81228470,"authorName":"Christine H","from":"&quot;Christine H&quot; &lt;Chris@...&gt;","profile":"krissy8444","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son says he needs to go to school...","postDate":"1265255808","msgId":50437,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrZGdpMCs0ZjhtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDRCRjhDMTZCLTExMTMtNDQ1MS05NjU5LTAwQ0VCMzE2RDZFMUBjb21jYXN0Lm5ldD4="},"prevInTopic":50431,"nextInTopic":50438,"prevInTime":50436,"nextInTime":50438,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"-- Does he play video games? All the time.  That is what my parents and in-laws think there is a problem. :)","messageBody":"<div id=\"ygrps-yiv-1970623149\">--&gt; Does he play video games?<br/>\nAll the time.  That is what my parents and in-laws think there is a problem. :)</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265201307","msgId":50431,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1OTNCRTQ2LUNDREMtNEM3NS1CRjg4LUYyQkFBMzkzMDlFOEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5YzFkMWI0MTAwMjAyMjAzMWs3MGRiYjk5Mmg5YTNiYmIzODQ4NWY1YTk5QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhrYWV1MytiZjFvQGVHcm91cHMuY29tPiA8OTQyOURCQ0ItMzdCMi00MkU0LUJCRjUtMjJDMzVBM0JGQjEyQFNhbmRyYWRvZGQuY29tPiA8NzljMWQxYjQxMDAyMDIyMDMxazcwZGJiOTkyaDlhM2JiYjM4NDg1ZjVhOTlAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":50430,"nextInTopic":50437,"prevInTime":50430,"nextInTime":50432,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"-=- While I don t know if I can be arrested for unschooling Nisarga, there will certainly be social criticism and it has more weight because society is quite","messageBody":"<div id=\"ygrps-yiv-105781520\">-=- While I don&#39;t know if I can be arrested for<br/>\nunschooling Nisarga, there will certainly be social criticism and it has<br/>\nmore &#39;weight&#39; because society is quite a large part of life here, while<br/>\nfighting law is a &#39;compartment&#39; of life, even for a self-proclaimed  <br/>\nrecluse<br/>\nlike me. -=-<br/>\n<br/>\nLaws can be changed.<br/>\nThe opinions of grandmothers are often intractable. &lt;g&gt;<br/>\n<br/>\nWhen Hema Bharadwaj was here last fall we talked about that.  Where I  <br/>\nlive, I could just reassure my mother-in-law that it was legal, and  <br/>\nthen &quot;I won.&quot;  In India, if it&#39;s not a matter of law, then it&#39;s all  <br/>\ndown to social and familial pressure, and much more difficult to  <br/>\ninfluence from the younger end.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265171497","msgId":50430,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMjAyMjAzMWs3MGRiYjk5Mmg5YTNiYmIzODQ4NWY1YTk5QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDk0MjlEQkNCLTM3QjItNDJFNC1CQkY1LTIyQzM1QTNCRkIxMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhrYWV1MytiZjFvQGVHcm91cHMuY29tPgkgPDk0MjlEQkNCLTM3QjItNDJFNC1CQkY1LTIyQzM1QTNCRkIxMkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50427,"nextInTopic":50431,"prevInTime":50429,"nextInTime":50431,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"* They are very religious and very conservative, so most of our differences come from that, and I imagine there are plenty of folks, even here on this list,","messageBody":"<div id=\"ygrps-yiv-589410389\">*&quot;They are very religious and very conservative, so most of our differences<br/>\ncome from that, and I imagine there are plenty of folks, even here on this<br/>\nlist, that might have similar differences to me and my family.&quot;*<br/>\n<br/>\nI can so relate with that.<br/>\n<br/>\n*&quot;The apology should be bigger than the original insult, not<br/>\nteensy-smaller.&quot;*<br/>\n<br/>\nI agree that it should be, but I find many a slip between the brochure and<br/>\ntrip... Often, what I think should be becomes irrelevant when faced with<br/>\nwhat all needs to be, right now that I can do something about, like<br/>\nmaintaining peace, like ensuring the child is not surrounded by raised<br/>\nvoices, or suffers for any residual anger against me for being &#39;different&#39;.<br/>\nOf course I am different. I&#39;m here, but it becomes very important that I<br/>\ndon&#39;t give further ammunition for loving conversations like &quot;Oh, sweetheart,<br/>\nyour mom means well, but she doesn&#39;t understand responsibility. She doesn&#39;t<br/>\nunderstand that her choices are making life so difficult for you. If I could<br/>\nhalp it, I would never deprive you of an education&quot; etc. THAT is my<br/>\nproblem.<br/>\n<br/>\nThey aren&#39;t being nasty. They actually believe it. They love me, but the<br/>\nstakes are high - a child&#39;s entire life, and they fear the unknown. They are<br/>\nunable to see anything else than what they believe is right. They don&#39;t see<br/>\nanything they should be apologizing for. They don&#39;t have a clue that  the<br/>\nworld is vastly different from how they imagine, even if Nisarga goes to<br/>\nschool, education is not how they imagine it to be. For example, their idea<br/>\nof discipline, hitting, scolding, is illegal in schools today. They grew up<br/>\nwith it. They can&#39;t imagine a child growing up okay without &quot;strong<br/>\nguidance&quot;. It isn&#39;t that they are knowingly doing wrong by me, but they are<br/>\ngenuinely mourning the deprivation of their grandchild they perceive.<br/>\n<br/>\nNot having actually experienced the reality of their grandchild being<br/>\n&quot;disciplined&quot;, they imagine that it is a good thing. If I know them, my MIL<br/>\nwould be the first to take him out of school if she saw him being hit and<br/>\ncrying. After her initial beliefs about crying being good for him, she has<br/>\nstarted loving being sensitive to him so much, that there are times when he<br/>\nhas a stomach upset and will not stop crying when she will descend on me to<br/>\nsay, &quot;What kind of a mother are you. Make him stop&quot; and I am like, &quot;Hey, you<br/>\nthink I&#39;m holding him in my arms cheering him on? I would love for him not<br/>\nto feel so sad, but I don&#39;t know what&#39;s the matter.&quot;, but I just love it<br/>\nthat she will stand up for him. He needs that - for his grandmom to be tuned<br/>\nin to his happiness being a priority. Unfortunately, the harm of schools has<br/>\ngone far more subtle. No one hits kids in &#39;good&#39; schools any more. They<br/>\nsimply make little kid templates out of them.<br/>\n<br/>\n*&quot;Vidyut is in India. There are some realities there that are long gone in<br/>\nthe U.S. There are many languages in use, and not all the parents are<br/>\nreaders and writers in all the languages around them. It&#39;s a different<br/>\nsituation. School isn&#39;t mandatory, and I don&#39;t think there are free<br/>\ngovernment schools.&quot;*<br/>\n<br/>\nYou know more about the unschooling legalities in India than I do. I didn&#39;t<br/>\nknow that school was not mandatory. With the all encompassing literacy<br/>\ncampaign, it had never occurred to me that it wasn&#39;t. There are free<br/>\ngovernment schools, I think. We call them municipal schools. I think they<br/>\nare totally free. There are various NGOs working to ensure that education<br/>\nreaches all, and other &#39;off-beat&#39; options like &#39;each one teach one&#39; and<br/>\nother adult literacy campaigns, night schools, distance education<br/>\nprogrammes, and more. While I don&#39;t know if I can be arrested for<br/>\nunschooling Nisarga, there will certainly be social criticism and it has<br/>\nmore &#39;weight&#39; because society is quite a large part of life here, while<br/>\nfighting law is a &#39;compartment&#39; of life, even for a self-proclaimed recluse<br/>\nlike me. From what I hear, society is far more tightly knit here than many<br/>\n&#39;developed&#39; places in the world. Not that living in Mumbai I qualify to be<br/>\nliving in an undeveloped place, but there is more freedom. That I completely<br/>\naccept. I am lucky. I don&#39;t see the languages thing as an issue. No one in<br/>\nIndia knows all its languages. 13 languages is just the tip of the iceberg.<br/>\nLanguages have their own writing structures and often scripts too. There are<br/>\nover 53 common dialects that are significantly different, which use letters<br/>\nfrom the standardized language if at all there is a written form.<br/>\n<br/>\nMost people in urban India speak at least three/four languages naturally -<br/>\nthe mother tongue, Hindi, English and the regional language, if you live in<br/>\na place that speaks other than your mother tongue. It doesn&#39;t take<br/>\n&#39;learning&#39;. You just grow up communicating, rather than speaking languages.<br/>\nSchools teach at least two (Hindi-English) and often all three formally.<br/>\nMost people are fairly fluent in languages they end up encountering, because<br/>\nabsorbing them is a part of our social reality and a skill that we never<br/>\nlose. I read and write well in three languages, speak five languages<br/>\nfluently, can communicate enough to get by in another three languages and<br/>\neight dialects and used to know two more that I stopped needing and now<br/>\ndon&#39;t remember well. When I come across a language I don&#39;t know, I can<br/>\nsimply absorb it fast - I learned Swiss-German, German, French and Italian<br/>\nlike that - I can&#39;t read them, but I used to talk enough to communicate with<br/>\ntrekking clients in the Himalaya. I&#39;ve stopped that work, and don&#39;t need<br/>\nthem any more. And I&#39;m not exceptional. It just is. I think once you<br/>\nexperience a certain number of languages, its simply about learning patterns<br/>\nthat fit everywhere, and using them as needed. I don&#39;t see schools being<br/>\nneeded to provide this. Living in this country is enough interactive<br/>\nlearning. Travelling is even better.<br/>\n<br/>\nI think &#39;teaching languages&#39; kills this. In India, learning languages is<br/>\nmostly unschooling style even for people who send their kids to school. It<br/>\n&#39;teaches&#39; communication, which sets you up with all languages for life.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265157247","msgId":50427,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0MjlEQkNCLTM3QjItNDJFNC1CQkY1LTIyQzM1QTNCRkIxMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhrYWV1MytiZjFvQGVHcm91cHMuY29tPg==","referencesHeader":"PGhrYWV1MytiZjFvQGVHcm91cHMuY29tPg=="},"prevInTopic":50426,"nextInTopic":50430,"prevInTime":50426,"nextInTime":50428,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"-=-BUT she is happy, she decided she wanted to go and she loves it. so i am happy for her. yes i would love her to be home, and the days she is ill (or says","messageBody":"<div id=\"ygrps-yiv-1553319441\">-=-BUT she is happy, she decided she wanted to go and she loves it. so  <br/>\ni am happy for her. yes i would love her to be home, and the days she  <br/>\nis ill (or says she ill ;-) ), and the teacher training days and the  <br/>\nholidays and the weekends are great, but i feel the girl i know would  <br/>\nnot have been happy if she had not been able to go with her choice. -=-<br/>\n<br/>\nAnd school for her is nothing like it is for kids who had no choice.<br/>\nSchool for her won&#39;t be like it is for them as long as she has a mom  <br/>\nat home who&#39;s willing for her to come back any time.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":227835915,"authorName":"m_aduhene","from":"&quot;m_aduhene&quot; &lt;m_aduhene@...&gt;","profile":"m_aduhene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son says he needs to go to school...","postDate":"1265155843","msgId":50426,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrYWV1MytiZjFvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFFMUEzRjU5LTQxMjgtNDNFNi05NjkyLUJERjI0N0E0MTVBMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50424,"nextInTopic":50427,"prevInTime":50425,"nextInTime":50427,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"hi all, my dd is 9 and up until last september(2009) she had never been to playgroup, nursery or school..... she decided she wanted to give school a try and i","messageBody":"<div id=\"ygrps-yiv-290974808\">hi all,<br/>\nmy dd is 9 and up until last september(2009) she had never been to playgroup, nursery or school.....<br/>\nshe decided she wanted to give school a try and i was happy for her to go ahead with this..... well i say happy the day she went i cried for 2 days.... :-(<br/>\nBUT she is happy, she decided she wanted to go and she loves it.  so i am happy for her.  yes i would love her to be home, and the days she is ill (or says she ill ;-) ), and the teacher training days and the holidays and the weekends are great, but i feel the girl i know would not have been happy if she had not been able to go with her choice. <br/>\n<br/>\ni have read extensively about unschooling and i believe this is one aspect of giving her freedom of choice and enabling her to do something she wants to do.<br/>\nblessings<br/>\nmichelle</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265151496","msgId":50424,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFFMUEzRjU5LTQxMjgtNDNFNi05NjkyLUJERjI0N0E0MTVBMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDM0MzAyOC44Mjk0Ny5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg==","referencesHeader":"PDM0MzAyOC44Mjk0Ny5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":50423,"nextInTopic":50426,"prevInTime":50423,"nextInTime":50425,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"While I m really glad Jenny and her sister and Pam and her sister get along despite differences, and that s awesome, I do want to say something to anyone who","messageBody":"<div id=\"ygrps-yiv-548948178\">While I&#39;m really glad Jenny and her sister and Pam and her sister get  <br/>\nalong despite differences, and that&#39;s awesome, I do want to say  <br/>\nsomething to anyone who will listen, about this:<br/>\n<br/>\n-=One time my sister wrote a meanish comment on my blog, but then  <br/>\nlater that day sent an apology via email.-=-<br/>\n<br/>\nTell your kids, if it becomes important.  Remember it in other  <br/>\nsituations, in other ways.<br/>\n<br/>\nA public insult should receive a public apology.<br/>\nShaming someone on national TV and sending them a postcard saying  <br/>\n&quot;Sorry&quot; is insufficient and cowardly.  It causes the person you  <br/>\napologized to need to go on national TV and say &quot;I received an  <br/>\napology,&quot; or to just say and do nothing and let that HUGE insult stand.<br/>\n<br/>\nCountless times now in the SCA, around homeschooling, and with friends  <br/>\npeople have badmouthed me in such a way that they hoped they would  <br/>\nlook good in public while I looked worse.  Then most of them (I do  <br/>\nhave a good track record for people feeling bad about being mean to  <br/>\nme) have apologized, but few of them were big or bright enough to  <br/>\napologize in the same forum or at the same level as the harm had been  <br/>\ndone.<br/>\n<br/>\nA private note saying &quot;I&#39;m sorry I disfigured your statue&quot; is wrong.   <br/>\nIt would be better for someone to feel so bad for having written a  <br/>\ntacky personal note that they make a beautiful statue.   The apology  <br/>\nshould be bigger than the original insult, not teensy-smaller.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265148734","msgId":50423,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxNjc1N0EzLTQ2RjgtNEE4Ny05QTg0LUJFREE3N0E3MjBFN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhrOGJlbSs3ODY5QGVHcm91cHMuY29tPg==","referencesHeader":"PGhrOGJlbSs3ODY5QGVHcm91cHMuY29tPg=="},"prevInTopic":50422,"nextInTopic":50424,"prevInTime":50422,"nextInTime":50424,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"-=- The idea that children go to school to get an education because that s what schools are for and if children don t go to school they must necessarily remain","messageBody":"<div id=\"ygrps-yiv-699315740\">-=-<br/>\nThe idea that children go to school to get an education because that&#39;s  <br/>\nwhat schools are for and if children don&#39;t go to school they must  <br/>\nnecessarily remain ignorant might have made some kind of sense in 1910  <br/>\nbut it&#39;s so seriously out of date in 2010 I&#39;m amazed so many people  <br/>\nstill believe it. But they do (maybe some of them don&#39;t really but  <br/>\nthey have to, that&#39;s another story).<br/>\n-=-<br/>\n<br/>\nVidyut is in India.  There are some realities there that are long gone  <br/>\nin the U.S.  There are many languages in use, and not all the parents  <br/>\nare readers and writers in all the languages around them.   It&#39;s a  <br/>\ndifferent situation.  School isn&#39;t mandatory, and I don&#39;t think there  <br/>\nare free government schools.<br/>\n<br/>\n-=-Having watched my son learning immersively at the speed of thought  <br/>\nfor the past seven years - and having the delights of Foxtel, Google,  <br/>\nWikipedia, YouTube, iTunes, Sony, Nintendo and the rest as part of my  <br/>\nown daily lifestyle - even Barack Obama himself (or Kevin Rudd in my  <br/>\ncase) couldn&#39;t sell me on the idea of sending my son off to join a  <br/>\nherd of 20-30 children sitting at desks in a school classroom so he  <br/>\ncan wait to be taught what somebody who isn&#39;t him (or me) decides he  <br/>\nshould know whenever that other person feels like teaching it. Using  <br/>\nan interactive whiteboard if he&#39;s lucky. Big deal.-=-<br/>\n<br/>\nFor a family in India with internet and the means to travel some,  <br/>\nthat&#39;s just as possible as it is here.  Still they face the more-than- <br/>\none-language need.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265145328","msgId":50422,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0MzAyOC44Mjk0Ny5xbUB3ZWIxMTA0MTUubWFpbC5ncTEueWFob28uY29tPg=="},"prevInTopic":50418,"nextInTopic":50423,"prevInTime":50421,"nextInTime":50423,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"***The thing is, my sister would never knowingly hurt my kids feelings. And I wouldn t hurt her kids feelings. So it made sense to just overlook anything","messageBody":"<div id=\"ygrps-yiv-822319001\">***The thing is, my sister would never knowingly hurt my kids&#39; feelings. <br/>\nAnd I wouldn&#39;t hurt her kids&#39; feelings. So it made sense to just <br/>\noverlook anything either of us might have said that could have been <br/>\nconstrued as an insult.***<br/>\n<br/>\nThis so much mirrors my relationship with my sister and her family!  They are very religious and very conservative, so most of our differences come from that, and I imagine there are plenty of folks, even here on this list, that might have similar differences to me and my family.<br/>\n<br/>\nMy sister and I have the same kind of sense of humor, like many of the same books and movies and tv shows.  We&#39;ve on again off again liked the same kind of music.  She&#39;s the one who introduced Chamille to Shaun of the Dead, which is a really great horror movie spoof.<br/>\n<br/>\nOne time my sister wrote a meanish comment on my blog, but then later that day sent an apology via email.<br/>\n<br/>\nI know many people don&#39;t have the same kind of great family relationships.  I figure, what I&#39;m doing by unschooling is giving my kids a great family relationship, so that, if they grow up and do completely different things from one another, that they&#39;ll still be kind and thoughtful towards each other and their parents.  I know a parent doesn&#39;t have to unschool to do that, but the way in which unschooling focuses on relationships, it would be hard to not have that happen as a huge side effect.<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265133625","msgId":50418,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU1ODMxNjkzLURFRTMtNDEzNy1CN0MyLTZFQTZBNjQ2RTQxNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5YzFkMWI0MTAwMjAxMjM1N3M3MDYwMTZjMnBlZTY1ODgxNDIyYTY0ZDQxQG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhrOGJlbSs3ODY5QGVHcm91cHMuY29tPiA8NEI2N0MxOTcuNDA0MDFAbWFjLmNvbT4gPDc5YzFkMWI0MTAwMjAxMjM1N3M3MDYwMTZjMnBlZTY1ODgxNDIyYTY0ZDQxQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50407,"nextInTopic":50422,"prevInTime":50417,"nextInTime":50419,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"-=-I am shaken by the question But - the words you re talking about are very insulting and mean. Why would YOU allow anybody to speak to you that way? and I","messageBody":"<div id=\"ygrps-yiv-1233575541\">-=-I am shaken by the question &quot;But - the words you&#39;re talking about  <br/>\nare very<br/>\ninsulting and mean. Why would YOU allow anybody to speak to you that  <br/>\nway?&quot;<br/>\nand I realize I have no &quot;right&quot; answer. I just let it go because that  <br/>\nis how<br/>\nthey are, and I have enough on my plate without taking on the futile  <br/>\nhead<br/>\nbanging of changing them-=-<br/>\n<br/>\nWhen people are sharing a house, the problem is worse.   If someone  <br/>\nvisits my house (or my list) I can ask them to be nice or go home.  If  <br/>\nsomeone lives with me (my husband, or if I were staying with in-laws)  <br/>\nthen I can&#39;t say &quot;Shush up in my house!&quot;<br/>\n<br/>\nI could say &quot;I don&#39;t think it&#39;s helpful for you to be that way.&quot;<br/>\n<br/>\nI could say &quot;SHUT UP, ignoramus!&quot; but then I&#39;ve probably done worse  <br/>\nthan they did, and have established an acceptable limit for what kinds  <br/>\nof things can be said in response.<br/>\n<br/>\n-=- It doesn&#39;t really hurt me, simply because I know<br/>\nthat is not true and I know that they don&#39;t think its true either, from<br/>\nother things they say, and that these are just their fears striking  <br/>\nback to<br/>\ntry to get me to conform. -=-<br/>\n<br/>\nMaybe you could say that both of you have said things from fear and  <br/>\nfrustration, and that it would probably be good to try to think, and  <br/>\nbreathe, and only say things you&#39;d be willing for the child to hear  <br/>\nand maybe repeat.  That might be a way to have a time of cooling off  <br/>\nand learning new habits before he&#39;s old enough to pick up and copy, or  <br/>\nbe wounded by, the words themselves.  Already the tone and mood must  <br/>\nnot be healthy for him.<br/>\n<br/>\nThat might also be a good exercise in seeing how it feels to put his  <br/>\nneeds first.   Creating an environment that&#39;s gentle and sweet for him  <br/>\nwill also be a gentle, sweet environment for the adults.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265097463","msgId":50407,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMjAxMjM1N3M3MDYwMTZjMnBlZTY1ODgxNDIyYTY0ZDQxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDRCNjdDMTk3LjQwNDAxQG1hYy5jb20+","referencesHeader":"PGhrOGJlbSs3ODY5QGVHcm91cHMuY29tPiA8NEI2N0MxOTcuNDA0MDFAbWFjLmNvbT4="},"prevInTopic":50401,"nextInTopic":50418,"prevInTime":50406,"nextInTime":50408,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"I appreciate all the responses and particularly the ways of dealing with situations that got shared. I am looking at the various responses I have that can keep","messageBody":"<div id=\"ygrps-yiv-199202839\">I appreciate all the responses and particularly the ways of dealing with<br/>\nsituations that got shared. I am looking at the various responses I have<br/>\nthat can keep the space open for my child. Also looking at possibilities<br/>\nwhere my family could meet other unschoolers once my son was of an age to<br/>\nenjoy interaction, so they could see how the space was for him and get a<br/>\ntaste of the reality to help with their imaginary fears.<br/>\n<br/>\nI am shaken by the question &quot;But - the words you&#39;re talking about are very<br/>\ninsulting and mean. Why would YOU allow anybody to speak to you that way?&quot;<br/>\nand I realize I have no &quot;right&quot; answer. I just let it go because that is how<br/>\nthey are, and I have enough on my plate without taking on the futile head<br/>\nbanging of changing them. It doesn&#39;t really hurt me, simply because I know<br/>\nthat is not true and I know that they don&#39;t think its true either, from<br/>\nother things they say, and that these are just their fears striking back to<br/>\ntry to get me to conform. A child may not understand this, and could see<br/>\nfailure to &#39;correct&#39; them as guilt? I just go &quot;hmmm...&quot; and that seems to<br/>\nend the subject fast. I am wondering that if I am looking at the impact of<br/>\nthese labels on my child, what is the impact of my non-confrontation? Would<br/>\nit seem to validate the accusations, or would I be contributing to a sense<br/>\nof inferiority by allowing these mean words that are essentially linked with<br/>\ncreating an image of deprivation that the child is suffering from because of<br/>\nthe mother? I guess, like Sandra says, I am not going to be able to talk<br/>\nabout these &quot;would be&quot; scenarios till I actually get there. But in the<br/>\nmeanwhile, I am going to be alert to how my behaviour influences what is<br/>\nbeing said to and about me.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pam Sorooshian","from":"Pam Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265090967","msgId":50401,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNjdDMTk3LjQwNDAxQG1hYy5jb20+","inReplyToHeader":"PGhrOGJlbSs3ODY5QGVHcm91cHMuY29tPg==","referencesHeader":"PGhrOGJlbSs3ODY5QGVHcm91cHMuY29tPg=="},"prevInTopic":50399,"nextInTopic":50407,"prevInTime":50400,"nextInTime":50402,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"Our family has already started talking about thing like ... I have responded to negative comments by just saying, Thanks for your input. And then left an","messageBody":"<div id=\"ygrps-yiv-730079670\">Our family has already started talking about thing like<br/>\n<blockquote><span title=\"ireply\"> &gt;  uneducated, illiterate, no future, etc about him and irresponsible, selfish,<br/>\n&gt;  stingy, lazy, etc about me. I worry about the impact of such talk on him.<br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>I have responded to negative comments by just saying, &quot;Thanks for your <br/>\ninput.&quot; And then left an awkward silence just hanging. Then moved on <br/>\ncheerfully to something else.<br/>\n<br/>\nI&#39;ve also said, &quot;Well, you might be right.&quot; And, again, just let that <br/>\nhang in the air and then moved on to something else.<br/>\n<br/>\nI&#39;ve also said, &quot;I know, but we&#39;re just taking it one day at a time and <br/>\nif it doesn&#39;t seem to be working, we can always put them in school.&quot;<br/>\n<br/>\nBut - the words you&#39;re talking about are very insulting and mean. Why <br/>\nwould YOU allow anybody to speak to you that way?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;  <br/>\n&gt; &gt;  I am interested in learning how experienced unschooling parents supported<br/>\n&gt; &gt;  their child&#39;s learning, while safeguarding from possible brain washing into<br/>\n&gt; &gt;  schooling as a measure of worth or sending children to school as a measure<br/>\n&gt; &gt;  of love...<br/>\n&gt; &gt;  Vidyut<br/>\n&gt;    <br/>\n </span></blockquote>As far as safeguarding the child - usually I&#39;d just brush off negative <br/>\ncomments and when my kid saw I didn&#39;t take them seriously, the kid <br/>\ndidn&#39;t either. I have a sister whose kids went to a strict Christian <br/>\nprivate school - about as far from our lifestyle as possible. We get <br/>\nalong great. We both thought each other was going off the deep end, but <br/>\nwe didn&#39;t argue about it - just accepted it as a fact of life. There <br/>\nwere some inadvertent comments made, over the years, that I might have <br/>\ngotten up in arms over, but I just smiled and looked at my wonderful <br/>\nkids and later said something like, &quot;Oh, you know how your aunt is - <br/>\njust let it go - not worth fussing over.&quot;<br/>\n<br/>\n<br/>\nThe thing is, my sister would never knowingly hurt my kids&#39; feelings. <br/>\nAnd I wouldn&#39;t hurt her kids&#39; feelings. So it made sense to just <br/>\noverlook anything either of us might have said that could have been <br/>\nconstrued as an insult.<br/>\n<br/>\nBut - if someone was being insulting, knew it, and didn&#39;t care? I would <br/>\nspend very very little time, if any, around that person.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":183568025,"authorName":"Bob Collier","from":"&quot;Bob Collier&quot; &lt;bobcollier@...&gt;","profile":"quaussiebob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son says he needs to go to school...","postDate":"1265086742","msgId":50399,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrOGJlbSs3ODY5QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDc5YzFkMWI0MTAwMjAxMDQyNm43MDY1ZGZjZWxkYjIzMWY5Yjk5ZTdkMzE4QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":50384,"nextInTopic":50401,"prevInTime":50398,"nextInTime":50400,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"... The idea that children go to school to get an education because that s what schools are for and if children don t go to school they must necessarily remain","messageBody":"<div id=\"ygrps-yiv-1487526370\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Vidyut Kale &lt;wide.aware@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; <br/>\n&gt; I am interested in learning how experienced unschooling parents supported<br/>\n&gt; their child&#39;s learning, while safeguarding from possible brain washing into<br/>\n&gt; schooling as a measure of worth or sending children to school as a measure<br/>\n&gt; of love... Our family has already started talking about thing like<br/>\n&gt; uneducated, illiterate, no future, etc about him and irresponsible, selfish,<br/>\n&gt; stingy, lazy, etc about me. I worry about the impact of such talk on him.<br/>\n&gt; <br/>\n&gt; Vidyut<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>The idea that children go to school to get an education because that&#39;s what schools are for and if children don&#39;t go to school they must necessarily remain ignorant might have made some kind of sense in 1910 but it&#39;s so seriously out of date in 2010 I&#39;m amazed so many people still believe it. But they do (maybe some of them don&#39;t really but they have to, that&#39;s another story).<br/>\n<br/>\nHaving watched my son learning immersively at the speed of thought for the past seven years - and having the delights of Foxtel, Google, Wikipedia, YouTube, iTunes, Sony, Nintendo and the rest as part of my own daily lifestyle - even Barack Obama himself (or Kevin Rudd in my case) couldn&#39;t sell me on the idea of sending my son off to join a herd of 20-30 children sitting at desks in a school classroom so he can wait to be taught what somebody who isn&#39;t him (or me) decides he should know whenever that other person feels like teaching it. Using an interactive whiteboard if he&#39;s lucky. Big deal.<br/>\n<br/>\nEven if I was the only person on this planet doing what I&#39;m doing with my son, I would still be, &quot;You want me to do what? Are you crazy? What kind of dumbass way is that to educate a child in 2010?&quot;<br/>\n<br/>\nSeriously.<br/>\n<br/>\nBob</div>","specialLinks":[]},{"userId":276731379,"authorName":"Robin Bentley","from":"Robin Bentley &lt;robin.bentley@...&gt;","profile":"seyyala","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Son says he needs to go to school...","postDate":"1265071247","msgId":50384,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCRjhDMTZCLTExMTMtNDQ1MS05NjU5LTAwQ0VCMzE2RDZFMUBjb21jYXN0Lm5ldD4=","inReplyToHeader":"PGhrN2x0aSt0NXQ1QGVHcm91cHMuY29tPg==","referencesHeader":"PGhrN2x0aSt0NXQ1QGVHcm91cHMuY29tPg=="},"prevInTopic":50382,"nextInTopic":50399,"prevInTime":50383,"nextInTime":50385,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"... Is there any way you can stop or minimize his grandparents testing him? That can have a significant effect on his thought process about school-ish","messageBody":"<div id=\"ygrps-yiv-410035853\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; - Yes, I realize that didn&#39;t make sense.  I meant perhaps he thinks  <br/>\n&gt; he can only improve his problems with writing with help from people  <br/>\n&gt; at school...not sure about this.  I do know his grandparents have  <br/>\n&gt; been telling him he is behind (as per their verbal and written  <br/>\n&gt; testing) of him done in my absence :(  One side is school teachers.   <br/>\n&gt; I&#39;m sure that has something to do with it.<br/>\n<br/>\n </span></blockquote>Is there any way you can stop or minimize his grandparents &quot;testing&quot;  <br/>\nhim? That can have a significant effect on his thought process about  <br/>\nschool-ish &quot;needs.&quot;<br/>\n<br/>\nDoes he play video games?<br/>\n<br/>\nRobin B.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":81228470,"authorName":"Christine H","from":"&quot;Christine H&quot; &lt;Chris@...&gt;","profile":"krissy8444","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Son says he needs to go to school...","postDate":"1265064690","msgId":50382,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrN2x0aSt0NXQ1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZCOTJFRjA0LTc2RTUtNEEwRC1CQ0RBLUVEMEZCN0I1OEJEMUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":50369,"nextInTopic":50384,"prevInTime":50381,"nextInTime":50383,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"How old is he and what grade would it be? - He is 13 and would be in 8th grade. Well.... Definitely I d suggest reading your posts before you send them.  ","messageBody":"<div id=\"ygrps-yiv-1280265000\">How old is he and what grade would it be?<br/>\n<br/>\n - He is 13 and would be in 8th grade.<br/>\n<br/>\nWell....<br/>\nDefinitely I&#39;d suggest reading your posts before you send them. &lt;g&gt;<br/>\n<br/>\nYou told us he is requesting help with writing.<br/>\nThen you said perhaps...<br/>\n<br/>\n - Yes, I realize that didn&#39;t make sense.  I meant perhaps he thinks he can only improve his problems with writing with help from people at school...not sure about this.  I do know his grandparents have been telling him he is behind (as per their verbal and written testing) of him done in my absence :(  One side is school teachers.  I&#39;m sure that has something to do with it.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son says he needs to go to school...","postDate":"1265052536","msgId":50369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGRkI1NEQwLTJGNjItNDFFRC04NEYwLUI3MDQzMEJFNEYxNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENCRjExOUM5LUE4NjQtNDBFMS1CMUVBLTQ4OUM3MEU4NEJFRkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhrNXRscis0ajhrQGVHcm91cHMuY29tPiA8NzljMWQxYjQxMDAyMDEwNDI2bjcwNjVkZmNlbGRiMjMxZjliOTllN2QzMThAbWFpbC5nbWFpbC5jb20+IDxDQkYxMTlDOS1BODY0LTQwRTEtQjFFQS00ODlDNzBFODRCRUZAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":50367,"nextInTopic":50382,"prevInTime":50368,"nextInTime":50370,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"A quote of the week list just sent this: -=- A truly good book teaches me better than to read it. I must soon lay it down, and commence living on its hint.","messageBody":"<div id=\"ygrps-yiv-1747089049\">A quote of the week list just sent this:<br/>\n<br/>\n-=-&quot;A truly good book teaches me better than to read it. I must soon  <br/>\nlay it down, and commence living on its hint. What I began by reading,  <br/>\nI must finish by acting.&quot;<br/>\n� Henry David Thoreau-=-<br/>\n<br/>\nI had written this a while ago:<br/>\n<br/>\n-=-Build trust. Get to know him in ways you can&#39;t yet imagine parents<br/>\ncan know children. Read some of what&#39;s above, be with your child<br/>\nthoughtfully and then read more and be with your child more.-=-<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":58132404,"authorName":"Marcia Simonds","from":"&quot;Marcia Simonds&quot; &lt;MarSi77@...&gt;","profile":"m6hschch","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Son says he needs to go to school...","postDate":"1265051949","msgId":50367,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDI3Q0ZGMTRBQzZEMDQxQTE4Q0U1RTlFQUZCNjBCMUQ4QG1hcmNpYVBDPg==","inReplyToHeader":"PEZCOTJFRjA0LTc2RTUtNEEwRC1CQ0RBLUVEMEZCN0I1OEJEMUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGhrNXRscis0ajhrQGVHcm91cHMuY29tPiA8RkI5MkVGMDQtNzZFNS00QTBELUJDREEtRUQwRkI3QjU4QkQxQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":50361,"nextInTopic":50369,"prevInTime":50366,"nextInTime":50368,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"... unschoolers, DO IT. It could be worth the cost to get your family in the presence of happy, busy unschooling families to give him a view of how life can be","messageBody":"<div id=\"ygrps-yiv-1190092597\"><blockquote><span title=\"ireply\">&gt;&gt;As to wanting to go back to school, if you can get to a gathering of <br/>\n </span></blockquote>unschoolers, DO IT. It could be worth the cost to get your family in <br/>\nthe presence of happy, busy unschooling families to give him a view of <br/>\nhow life can be without school fears.&lt;&lt;<br/>\n<br/>\n*****The Northeast Unschooling Conference in August did it for my son, who was thinking of school, mainly cuz all his close friends go to school.<br/>\n<br/>\nThen he friended some unschoolers from the conference on Facebook and that helped immensely, even some unschooling dads!  We are planning more confernces this year. I would go to many more if we could afford it financially.<br/>\n<br/>\nThen I also tuned into him even more and was able to make things happen for him to meet more people and spend even more time with his passions. He joined a homeschool co-op on HIS terms and he enjoys being with the kids and *expanding his world* with knowledge, but yet doesn&#39;t have to commit to homework, etc <br/>\n<br/>\nAnd he joined a teen geography class at someone&#39;s house, mainly to make more connections. He loves the kids and they do hands-on projects and many social activities have come from that. There are kids in both places that do *schoolwork* but he knows it doesn&#39;t define who they are and whether he can be friendly with them or not. He sees the differences in freedoms and values his life much more.<br/>\n<br/>\nThen we were able to go ahead with guitar lessons for him and he has become more confident and has been teaching himself even more than the lessons. But he still wants to continue.<br/>\n<br/>\nWe have also made a point to go to homeschool bowling and ice skating where he can gather with others, and anything else that comes about that interests him.<br/>\n<br/>\nHe also started playing Xbox live which allows him to connect with all his school friends, homeschool friends, cousins and others. I hear him laughing and talking in the other room at all hours and I smile. It has been a way to still stay in the mix with his school friends cuz they don&#39;t have much time to get together on weekdays &lt;&lt;G&gt;&gt;.<br/>\n<br/>\nAll of this has made him a happy kid. I asked him the other day if he still thinks he might want to go to school, as I was dropping him off at a Jr high play at the school with his friends. He just shrugged.<br/>\n<br/>\nI am ok if he does want to go. He might want to see what it is like.  But until that happens or if it even does,  we are forging ahead with life and making it as joyful as we can.<br/>\n<br/>\n~marcia simonds<br/>\nhttp://livefreeinharmony@...<br/>\nwww.anestinnature.com<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: Sandra Dodd <br/>\n  To: AlwaysLearning@yahoogroups.com <br/>\n  Sent: Monday, February 01, 2010 12:15 PM<br/>\n  Subject: Re: [AlwaysLearning] Son says he needs to go to school...<br/>\n<br/>\n<br/>\n    <br/>\n  -=-So, after pulling my boys from school and unschooling them for the <br/>\n  past 5 years, my youngest told me he wants to go back to school. -=-<br/>\n<br/>\n  How old is he and what grade would it be?<br/>\n<br/>\n  -=-He is also requesting help with writing because he says he can&#39;t <br/>\n  spell and write words... Perhaps he is asking for more help with <br/>\n  writing. Any suggestions?-=-<br/>\n<br/>\n  Well....<br/>\n  Definitely I&#39;d suggest reading your posts before you send them. &lt;g&gt;<br/>\n<br/>\n  You told us he is requesting help with writing.<br/>\n  Then you said perhaps...<br/>\n<br/>\n  I think definitely, he wants ideas for how to practice writing.<br/>\n<br/>\n  Is he on the computer much? That&#39;s where my kids learned to spell <br/>\n  and write, playing games and sending messages and such. Could you <br/>\n  write him notes sometimes to see if he might write back? I&#39;m thinking <br/>\n  of times I had a question and left a note because the kid was asleep <br/>\n  and they left me a note to find when I woke up, though generally as <br/>\n  they got old enough to be gone when I went to sleep, they would e-mail <br/>\n  the details and I&#39;d check e-mail in the morning.<br/>\n<br/>\n  Maybe finding examples of other people&#39;s everyday handwriting would <br/>\n  help him see that not everyone&#39;s writing is really clear and beautiful.<br/>\n<br/>\n  As to wanting to go back to school, if you can get to a gathering of <br/>\n  unschoolers, DO IT. It could be worth the cost to get your family in <br/>\n  the presence of happy, busy unschooling families to give him a view of <br/>\n  how life can be without school fears.<br/>\n<br/>\n  I know it&#39;s not the regular topic of this list, but I need to make a <br/>\n  list for the rebuilding unschooling.info site anyway, of potential <br/>\n  gatherings. If anyone wants to send me any notes on upcoming <br/>\n  happenings, please do.<br/>\n<br/>\n  If you can&#39;t get around other unschoolers, spend a few months <br/>\n  &quot;upgrading&quot; your unschooling activities. Do more.<br/>\n<br/>\n  Someone criticized &quot;do more&quot; here, but I woke up thinking about that <br/>\n  today, and I think it&#39;s the best advice ever. I&#39;ll make another <br/>\n  thread about that.<br/>\n<br/>\n  Sandra<br/>\n<br/>\n  Sandra<br/>\n<br/>\n  [Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son says he needs to go to school...","postDate":"1265049511","msgId":50361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENCRjExOUM5LUE4NjQtNDBFMS1CMUVBLTQ4OUM3MEU4NEJFRkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5YzFkMWI0MTAwMjAxMDQyNm43MDY1ZGZjZWxkYjIzMWY5Yjk5ZTdkMzE4QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGhrNXRscis0ajhrQGVHcm91cHMuY29tPiA8NzljMWQxYjQxMDAyMDEwNDI2bjcwNjVkZmNlbGRiMjMxZjliOTllN2QzMThAbWFpbC5nbWFpbC5jb20+"},"prevInTopic":50354,"nextInTopic":50367,"prevInTime":50360,"nextInTime":50362,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"-=Would it be very bad if school were his unschooling tool? -=- Bad? There s no such thing. If you want an alternative way to deal with school, here are some","messageBody":"<div id=\"ygrps-yiv-1830476356\">-=Would it be very bad if school were his unschooling tool? -=-<br/>\n<br/>\n&quot;Bad?&quot;<br/>\nThere&#39;s no such thing.<br/>\n<br/>\nIf you want an alternative way to deal with school, here are some ideas:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\n<br/>\n-=- Would it then mean that he would have to let go of how he was  <br/>\ncurrently learning?-=-<br/>\n<br/>\nHe&#39;s four months old.  Let&#39;s not set up such comparisons.<br/>\n<br/>\n-=- I fear the influence of the opinions of friends and family<br/>\nleading him to question my choices for him, and wonder where my  <br/>\nboundaries<br/>\nas a caring parent can be.-=-<br/>\n<br/>\nAH!  Don&#39;t make choices for him.  Live with him.  Help him make choice  <br/>\non his own, as he grows, and when he reaches &quot;school age&quot; help him  <br/>\nmake that choice.<br/>\n<br/>\n-=-If I am allowing him freedom of learning, and I<br/>\nam resistant to him challenging the boundaries and choices of where he  <br/>\nis,<br/>\nwhat are the possibilities?-=-<br/>\n<br/>\nThat&#39;s a very muddled question.<br/>\n<br/>\n&quot;Freedom of learning&quot; isn&#39;t a good phrase or thought to have here.    <br/>\nLearning is learning.  People learn by sensing something and thinking  <br/>\nabout it, no matter where they are.<br/>\n<br/>\nThe possibilities of muddled thinking are that the mother will never  <br/>\nunderstand her own questions well enough to settle in a place of  <br/>\nstrength.  The possibilities of resistance are reactions and  <br/>\ndistancing.  The possibilities of boundaries are dishonesty and  <br/>\nrejection and running away.  The possibility of choices is the subject  <br/>\nof this list.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choices\">http://sandradodd.com/choices</a><br/>\n<br/>\n-=-I am interested in learning how experienced unschooling parents  <br/>\nsupported<br/>\ntheir child&#39;s learning, while safeguarding from possible brain washing  <br/>\ninto<br/>\nschooling as a measure of worth or sending children to school as a  <br/>\nmeasure<br/>\nof love... Our family has already started talking about thing like<br/>\nuneducated, illiterate, no future, etc about him and irresponsible,  <br/>\nselfish,<br/>\nstingy, lazy, etc about me. I worry about the impact of such talk on  <br/>\nhim.-=-<br/>\n<br/>\nThen you should read here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschooling\">http://sandradodd.com/unschooling</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://joyfullyrejoycing.com\">http://joyfullyrejoycing.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/AlwaysLearning/messages\">http://groups.yahoo.com/group/AlwaysLearning/messages</a><br/>\n<br/>\nAnd meanwhile, practice being with your child in the moment, paying  <br/>\nattention to what he wants, to giving him more opportunities to see,  <br/>\nhear, touch, taste and smell.  Practice being gentle and patient and  <br/>\nletting him make decisions like when he&#39;s through looking at something  <br/>\nor touching it, instead of moving him or taking it away.<br/>\n<br/>\nBuild trust.  Get to know him in ways you can&#39;t yet imagine parents  <br/>\ncan know children.  Read some of what&#39;s above, be with your child  <br/>\nthoughtfully and then read more and be with your child more.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son says he needs to go to school...","postDate":"1265044523","msgId":50351,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZCOTJFRjA0LTc2RTUtNEEwRC1CQ0RBLUVEMEZCN0I1OEJEMUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhrNXRscis0ajhrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhrNXRscis0ajhrQGVHcm91cHMuY29tPg=="},"prevInTopic":50342,"nextInTopic":50353,"prevInTime":50350,"nextInTime":50352,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"-=-So, after pulling my boys from school and unschooling them for the past 5 years, my youngest told me he wants to go back to school. -=- How old is he and","messageBody":"<div id=\"ygrps-yiv-2027872982\">-=-So, after pulling my boys from school and unschooling them for the  <br/>\npast 5 years, my youngest told me he wants to go back to school. -=-<br/>\n<br/>\nHow old is he and what grade would it be?<br/>\n<br/>\n-=-He is also requesting help with writing because he says he can&#39;t  <br/>\nspell and write words... Perhaps he is asking for more help with  <br/>\nwriting. Any suggestions?-=-<br/>\n<br/>\nWell....<br/>\nDefinitely I&#39;d suggest reading your posts before you send them. &lt;g&gt;<br/>\n<br/>\nYou told us he is requesting help with writing.<br/>\nThen you said perhaps...<br/>\n<br/>\nI think definitely, he wants ideas for how to practice writing.<br/>\n<br/>\nIs he on the computer much?   That&#39;s where my kids learned to spell  <br/>\nand write, playing games and sending messages and such.  Could you  <br/>\nwrite him notes sometimes to see if he might write back?  I&#39;m thinking  <br/>\nof times I had a question and left a note because the kid was asleep  <br/>\nand they left me a note to find when  I woke up, though generally as  <br/>\nthey got old enough to be gone when I went to sleep, they would e-mail  <br/>\nthe details and I&#39;d check e-mail in the morning.<br/>\n<br/>\nMaybe finding examples of other people&#39;s everyday handwriting would  <br/>\nhelp him see that not everyone&#39;s writing is really clear and beautiful.<br/>\n<br/>\nAs to wanting to go back to school, if you can get to a gathering of  <br/>\nunschoolers, DO IT.  It could be worth the cost to get your family in  <br/>\nthe presence of happy, busy unschooling families to give him a view of  <br/>\nhow life can be without school fears.<br/>\n<br/>\nI know it&#39;s not the regular topic of this list, but I need to make a  <br/>\nlist for the rebuilding unschooling.info site anyway, of potential  <br/>\ngatherings.   If anyone wants to send me any notes on upcoming  <br/>\nhappenings, please do.<br/>\n<br/>\nIf you can&#39;t get around other unschoolers, spend a few months  <br/>\n&quot;upgrading&quot; your unschooling activities.  Do more.<br/>\n<br/>\nSomeone criticized &quot;do more&quot; here, but I woke up thinking about that  <br/>\ntoday, and I think it&#39;s the best advice ever.   I&#39;ll make another  <br/>\nthread about that.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":220041937,"authorName":"Heather","from":"Heather &lt;hbmccarty@...&gt;","profile":"heather13068","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son says he needs to go to school...","postDate":"1265031404","msgId":50354,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRCNjZEOEVDLjQwNDAyQHR3Y255LnJyLmNvbT4=","inReplyToHeader":"PGhrNXRscis0ajhrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhrNXRscis0ajhrQGVHcm91cHMuY29tPg=="},"prevInTopic":50353,"nextInTopic":50361,"prevInTime":50353,"nextInTime":50355,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"... My son was interested in school on and off from about age 11 on. He finally went at age 16 - this fall - and was back home in two months. Another learning","messageBody":"<div id=\"ygrps-yiv-1449307789\">Christine H wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;  <br/>\n&gt;<br/>\n&gt; So, after pulling my boys from school and unschooling them for the <br/>\n&gt; past 5 years, my youngest told me he wants to go back to school. He is <br/>\n&gt; also requesting help with writing because he says he can&#39;t spell and <br/>\n&gt; write words. I think he is asking this because my extended family has <br/>\n&gt; been telling him he can&#39;t get a job unless he goes to school and gets <br/>\n&gt; a HS diploma and/or a college degree. I have given him examples of <br/>\n&gt; people who are successful without this. Perhaps he is asking for more <br/>\n&gt; help with writing. Any suggestions?<br/>\n&gt;<br/>\n </span></blockquote>My son was interested in school on and off from about age 11 on. He <br/>\nfinally went at age 16 - this fall - and was back home in two months. <br/>\nAnother learning experience. He knew what I thought about school, and <br/>\nended up agreeing with me, but did need to find out for himself.<br/>\n<br/>\nAt different times when he wanted to go to school - we talked about why- <br/>\nand I did my best to provide what he felt he was missing in other ways. <br/>\nOnce it was a math text book, but mostly LOTS of places to go, things to <br/>\ndo, and people to see. I helped start a home school learning center <br/>\nduring this time- which we still participate in, and planned and sought <br/>\nout many different activities outside the home. His main interest was <br/>\nand is music- so we helped him seek out lessons, apprenticeships, and <br/>\nmany many group playing opportunties. At one point though, he just <br/>\nreally wanted to try school.<br/>\n<br/>\nAnd I did find some examples of people that have done things that he <br/>\ncould see himself doing- going to music school, without high school, <br/>\nmainly - and told him about that, sent him links. There were several  <br/>\nstories I found on college websites about home schooled students and <br/>\ntheir different paths to getting into college.<br/>\n<br/>\nI your son is interested in writing I am sure there are infinite ways to <br/>\nsupport that interest.<br/>\n<br/>\nIt can take an unbelievable amount of energy and time to create a great <br/>\nlife for a kid outside of school. SO worth it!<br/>\n<br/>\nHeather -in NY</div>","specialLinks":[]},{"userId":326782993,"authorName":"Vidyut Kale","from":"Vidyut Kale &lt;wide.aware@...&gt;","profile":"vidyutgore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Son says he needs to go to school...","postDate":"1265027209","msgId":50353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5YzFkMWI0MTAwMjAxMDQyNm43MDY1ZGZjZWxkYjIzMWY5Yjk5ZTdkMzE4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGhrNXRscis0ajhrQGVHcm91cHMuY29tPg==","referencesHeader":"PGhrNXRscis0ajhrQGVHcm91cHMuY29tPg=="},"prevInTopic":50351,"nextInTopic":50354,"prevInTime":50352,"nextInTime":50354,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"Would it be very bad if school were his unschooling tool? Would it be possible for him to use it how he saw fit? If he were free to try it out and see what","messageBody":"<div id=\"ygrps-yiv-214827879\">Would it be very bad if school were his unschooling tool? Would it be<br/>\npossible for him to use it how he saw fit? If he were free to try it out and<br/>\nsee what happened and it didn&#39;t become a learning method commitment to set<br/>\nin stone or even continue using it for whatever reasons of his own? Would it<br/>\nthen mean that he would have to let go of how he was currently learning? I<br/>\nam trying to understand the implications, as I fear this scenario unfolding<br/>\nin my life too. I fear the influence of the opinions of friends and family<br/>\nleading him to question my choices for him, and wonder where my boundaries<br/>\nas a caring parent can be. If I am allowing him freedom of learning, and I<br/>\nam resistant to him challenging the boundaries and choices of where he is,<br/>\nwhat are the possibilities?<br/>\n<br/>\nI am interested in learning how experienced unschooling parents supported<br/>\ntheir child&#39;s learning, while safeguarding from possible brain washing into<br/>\nschooling as a measure of worth or sending children to school as a measure<br/>\nof love... Our family has already started talking about thing like<br/>\nuneducated, illiterate, no future, etc about him and irresponsible, selfish,<br/>\nstingy, lazy, etc about me. I worry about the impact of such talk on him.<br/>\n<br/>\nVidyut<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Feb 1, 2010 at 12:21 PM, Christine H &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Chris@...\">Chris@...</a>&gt; wrote:<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; So, after pulling my boys from school and unschooling them for the past 5<br/>\n&gt; years, my youngest told me he wants to go back to school. He is also<br/>\n&gt; requesting help with writing because he says he can&#39;t spell and write words.<br/>\n&gt; I think he is asking this because my extended family has been telling him he<br/>\n&gt; can&#39;t get a job unless he goes to school and gets a HS diploma and/or a<br/>\n&gt; college degree. I have given him examples of people who are successful<br/>\n&gt; without this. Perhaps he is asking for more help with writing. Any<br/>\n&gt; suggestions?<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":81228470,"authorName":"Christine H","from":"&quot;Christine H&quot; &lt;Chris@...&gt;","profile":"krissy8444","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Son says he needs to go to school...","postDate":"1265007099","msgId":50342,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhrNXRscis0ajhrQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":50351,"prevInTime":50341,"nextInTime":50343,"topicId":50342,"numMessagesInTopic":0,"msgSnippet":"So, after pulling my boys from school and unschooling them for the past 5 years, my youngest told me he wants to go back to school.  He is also requesting help","messageBody":"<div id=\"ygrps-yiv-1313607380\">So, after pulling my boys from school and unschooling them for the past 5 years, my youngest told me he wants to go back to school.  He is also requesting help with writing because he says he can&#39;t spell and write words.  I think he is asking this because my extended family has been telling him he can&#39;t get a job unless he goes to school and gets a HS diploma and/or a college degree.  I have given him examples of people who are successful without this.  Perhaps he is asking for more help with writing.  Any suggestions?</div>","specialLinks":[]}],"prevTopicId":50440,"nextTopicId":50027}}