{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":2300774,"authorName":"Elizabeth Hill","from":"Elizabeth Hill &lt;ecsamhill@...&gt;","profile":"ecsamhill","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why people smoke (was Re: The Gimmes)","postDate":"1092687464","msgId":98151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQxMjExNjY4LjMwMDA3MDhAZWFydGhsaW5rLm5ldD4=","inReplyToHeader":"PDIwLjMwZTNmOWE4LjJlNTI1NzhiQGFvbC5jb20+","referencesHeader":"PDIwLjMwZTNmOWE4LjJlNTI1NzhiQGFvbC5jb20+"},"prevInTopic":98146,"nextInTopic":0,"prevInTime":98150,"nextInTime":98152,"topicId":98133,"numMessagesInTopic":0,"msgSnippet":"** One is 15, has been in and out of homeschooling, has always been desperate to be grown soon, now, since he was nine and we met him (so probably before ","messageBody":"<div id=\"ygrps-yiv-2013383566\">** One is 15, has been in and out of homeschooling, has always been <br/>\ndesperate to<br/>\nbe grown soon, now, since he was nine and we met him (so probably before<br/>\nthen).   Last year he went back to school, was put on Ritalin, and started<br/>\nsmoking.   Not because of advertising, because of trying to impress kids <br/>\nat school.**<br/>\n<br/>\nI was wondering how well does advertising work on homeschooled kids who <br/>\nare subject to waaaay less peer-pressure than schooled kids?  (typically)<br/>\n<br/>\nBetsy<br/>\n<br/>\nPS (different topic)<br/>\n<br/>\n**Like how come sometimes they left the turn signal<br/>\non after they&#39;d already made the turn?**<br/>\n<br/>\nI heard on Car Talk this weekend that in Germany people keep the left <br/>\nturn signal on the whole time they are passing in the passing lane.  The <br/>\ncar hosts were suggesting that this is a good way to communicate with <br/>\nthe car behind us that tailgates and flashes its lights.  (If we adopted <br/>\nthe convention here.)</div>","specialLinks":[]},{"userId":96545052,"authorName":"marji","from":"marji &lt;marji@...&gt;","profile":"gaia10921","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Why people smoke (was Re: The  Gimmes)","postDate":"1092683083","msgId":98146,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYuMC4zLjAuMC4yMDA0MDgxNjE0NDY1My4wMjg5ZGJhMEBtYWlsLmdhaWF3b2xmLm9yZz4=","inReplyToHeader":"PDIwLjMwZTNmOWE4LjJlNTI1NzhiQGFvbC5jb20+","referencesHeader":"PDIwLjMwZTNmOWE4LjJlNTI1NzhiQGFvbC5jb20+"},"prevInTopic":98133,"nextInTopic":98151,"prevInTime":98145,"nextInTime":98147,"topicId":98133,"numMessagesInTopic":0,"msgSnippet":"... I remember walking to school with my best friend at the time, Ellen, when I was in the fourth grade.  I told Ellen that I would definitely be a smoker when","messageBody":"<div id=\"ygrps-yiv-1620800577\">At 14:31 8/16/04, Sandra wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Kids smoke because other people smoke, not because of advertising.<br/>\n<br/>\n </span></blockquote>I remember walking to school with my best friend at the time, Ellen, when I <br/>\nwas in the fourth grade.  I told Ellen that I would definitely be a smoker <br/>\nwhen I got to be old enough because my parents both smoked and they were <br/>\nvery cool.  I was really impressed by my parents, smoking their Pall Mall <br/>\ncigarettes.  I loved the way my mom&#39;s hand looked so graceful holding the <br/>\ncigarette, and when she and my dad would rest their cigarettes in the <br/>\nashtray, the smoke looked so calm and pretty rising up from the burning <br/>\ncigarette.  They were artsy folks, and they made these really cool ashtrays <br/>\nand stuff like that.  I was completely sold!<br/>\n<br/>\nI started smoking when I was 13 years old because everyone else in my <br/>\ncircle at school did and I desperately wanted to be cool and fit in with <br/>\nthese folks, especially since I was convinced I was not all that cool and <br/>\nsmoking cigarettes would definitely help me become more cool.  I loved the <br/>\ncigarette pack holders and the lighters and all that paraphernalia <br/>\nstuff.  That&#39;s another reason why I smoked.<br/>\n<br/>\nThe only reason I quit was because I perceived (don&#39;t know if it was really <br/>\ntrue or not) that my vocal range was a little diminished, and messing up my <br/>\nvoice was one thing I could not and would not tolerate.  So, I quit &quot;cold <br/>\nturkey&quot; and gave a brand-new carton of cigarettes to my friend when I was <br/>\n20 years old.  Although I had tried and failed at quitting many times <br/>\nbefore that, quitting then was the easiest thing for me because I was <br/>\nreally freaked out about my voice.  I never smoked again.<br/>\n<br/>\nEven though I enjoyed the cigarette (the jingles and stuff) advertisements, <br/>\nthey had absolutely nothing to do with me starting to smoke or continuing <br/>\nto smoke (in fact, I really never got that business in the ads about <br/>\n&quot;taste&quot;!).  To start smoking was entirely a decision I made because of the <br/>\npeople I admired.<br/>\n<br/>\n<br/>\nMarji</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Why people smoke (was Re: The Gimmes)","postDate":"1092681099","msgId":98133,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwLjMwZTNmOWE4LjJlNTI1NzhiQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":98146,"prevInTime":98132,"nextInTime":98134,"topicId":98133,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/16/04 9:20:50 AM, litlrooh@earthlink.net writes: ","messageBody":"<div id=\"ygrps-yiv-995532048\">In a message dated 8/16/04 9:20:50 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a> writes:<br/>\n<br/>\n&lt;&lt; I would say this is an accurate description of cigarette companies though. <br/>\n They ARE marketing to the younger crowd and taking advantage of the peer <br/>\npressure that goes on there. &gt;&gt;<br/>\n<br/>\nMy kids have three friends who smoke, each in a totally different social <br/>\ngroup, each the only one in that group (at least to my own kids&#39; interface) who <br/>\nsmokes.<br/>\n<br/>\nOne is 25, tattooed, rough-appearing and very mannerly and interesting.   The <br/>\nothers he knows all razz him.  He started smoking when he was in high school <br/>\nand is an addict, but very considerate, considering.<br/>\n<br/>\nOne is 15, has been in and out of homeschooling, has always been desperate to <br/>\nbe grown soon, now, since he was nine and we met him (so probably before <br/>\nthen).   Last year he went back to school, was put on Ritalin, and started <br/>\nsmoking.   Not because of advertising, because of trying to impress kids at school.<br/>\n<br/>\nThe other is 18, started smoking because friends at school did (she always <br/>\nwent to school, her mom is a teacher), and has been smoking for three years <br/>\nalready.  Not because of advertising.<br/>\n<br/>\nMy mom died last year, of lung and other organ problems blamed officially on <br/>\na lifetime of drinking and smoking.    She started smoking because a marriage <br/>\ncounsellor recommended it.  My parents were married almost four years before I <br/>\nwas born (I&#39;m oldest).    They had gone to a marriage counsellor and when she <br/>\ncomplained that my dad would light a cigarette after dinner even before she <br/>\nwas through eating and the smoke kept her from enjoying the rest of her food.  <br/>\nThis professional they had paid money to told her that if she were to just <br/>\nstart smoking too, that cigarettes wouldn&#39;t bother her anymore, and that she <br/>\nwould have something else in common with her husband.<br/>\n<br/>\nTobacco companies are competing for brand switchers.   Kids smoke because <br/>\nother people smoke, not because of advertising.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":98150,"nextTopicId":98091}}