{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":9,"messages":[{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Confidence","postDate":"1226436334","msgId":40148,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmY3F0Zit0NTBqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdmOW5wMyt0dGltQGVHcm91cHMuY29tPg=="},"prevInTopic":40106,"nextInTopic":0,"prevInTime":40147,"nextInTime":40149,"topicId":38819,"numMessagesInTopic":0,"msgSnippet":"... Margaux has great confindence in her own writing abilities, even when she s wrong about the letters.  Chamille wants it perfect, so when it doesn t come","messageBody":"<div id=\"ygrps-yiv-1086782404\"><blockquote><span title=\"ireply\">&gt; Last night at my 9yo DS soccer party, there was a card set out for<br/>\n&gt; all the boys to sign for the coach. My DS looked a little nervous<br/>\n&gt; and came up to me and very quietly said &quot;I always forget which way<br/>\n&gt; J&#39;s go, this way or that way?&quot; I showed him by *drawing* a J in the<br/>\n&gt; air.<br/>\n&gt;<br/>\n&gt; He is definitely beginning to notice things he cannot do as well as<br/>\n&gt; others can. Writing is the big one right now.<br/>\n<br/>\n </span></blockquote>Margaux has great confindence in her own writing abilities, even when<br/>\nshe&#39;s wrong about the letters.  Chamille wants it perfect, so when it<br/>\ndoesn&#39;t come out perfect, she lacks the confidence to manually write.<br/>\n<br/>\nWhen we were doing the haunted house production, each day, we had to<br/>\nsign in.  The first day, I handed Chamille the pencil and she wavered<br/>\nand questioned herself and lost all confidence to write even her own<br/>\nname.  So after that, I just signed us both in together.<br/>\n<br/>\nShe rarely manually writes.  She types very fast, faster than me.  The<br/>\nletters never come out wrong and she&#39;s able to focus more attention on<br/>\nthe content of her writing and how she spells things.  She surprised<br/>\nherself the other day when she had to manually write out a phone number<br/>\nand half the numbers were reversed.  It truly bothered her, and she<br/>\ncorrected them.  She said something about how if she were typing it,<br/>\nthat never would&#39;ve happened.<br/>\n<br/>\nShe has really cute handwriting too, just no confidence in her<br/>\nhandwriting skills, largely because she&#39;s looking for perfection and<br/>\nthere&#39;s no such thing in handwriting.  In a year, she&#39;s wanting to start<br/>\napplying for jobs, so somewhere between now and then, she&#39;ll need to<br/>\nhave more confidence in her ability to write what she needs to write. <br/>\nSometimes you can take applications home and fill them out, so that will<br/>\nhelp.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Confidence","postDate":"1226365908","msgId":40106,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3OTc1RjlGLTU4M0MtNDNBRi05QTNFLTczODI4ODYwNTYwOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdmOW5wMyt0dGltQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmOW5wMyt0dGltQGVHcm91cHMuY29tPg=="},"prevInTopic":40094,"nextInTopic":40148,"prevInTime":40105,"nextInTime":40107,"topicId":38819,"numMessagesInTopic":0,"msgSnippet":"-=-I m looking for ways to be more confident in this area around other people. I don t want my son to feel embarrassed around other kids. -=- Holly can type","messageBody":"<div id=\"ygrps-yiv-1807278321\">-=-I&#39;m looking for ways to be more confident in this area around other<br/>\npeople. I don&#39;t want my son to feel embarrassed around other kids. -=-<br/>\n<br/>\n<br/>\n<br/>\nHolly can type wonderfully well.  She speaks well.  She reads well.   <br/>\nShe doesn&#39;t have good handwriting.<br/>\n<br/>\nLast night she was at an &quot;interview&quot; for Zumiez.  It was after the  <br/>\nstore closed, and there were 13 applicants, and three employees  <br/>\nconducting the proceedings.  There were group activities, relay  <br/>\nraces, contests, group projects...  And then there was a written  <br/>\nthing, that I&#39;m sure the store didn&#39;t even think about.  They had to  <br/>\nwrite down five questions, leaving room for answers, and then answer  <br/>\nthem in writing.  Holly ended up in tears, and the manager took her  <br/>\noff for a little walk.  Holly said something like &quot;I had been excited  <br/>\nthat it was an interview, in person, and now THIS&quot; and held up the  <br/>\npen and paper.   He talked to her a bit about not worrying so much  <br/>\nwhat people thought, and maybe about other things on the paper (I&#39;m  <br/>\nnot sure), because she had only finished three out of five, and told  <br/>\nher to call him at 10:00 in the morning, and she could go on.  The  <br/>\nother twelve kids were being addressed as a group as she left, still  <br/>\na little teary.<br/>\n<br/>\nMarty, Brett and I were waiting for her at a restaurant nearby,  <br/>\nfollowing a party which will be documented on my blog if and when I  <br/>\never finish the day&#39;s e-mail. &lt;g&gt;<br/>\n<br/>\nAs she told us about the evening, it sounded like she had done really  <br/>\nwell.  They seem to have been trying to see which kids had leadership  <br/>\nand charisma, physical abilities (crab-walking relays) and verbal and  <br/>\npersuasive ability (making advertisements and raps/chants and  <br/>\ninfomercials, in groups).  Holly kind of acted out for us how some of  <br/>\nthe kids couldn&#39;t even say their own names clearly with confidence.<br/>\n<br/>\nShe was very unhappy about the writing.  It&#39;s possible that the   <br/>\nmanager thought that because she didn&#39;t write well she also couldn&#39;t  <br/>\nread well, because when she did call this morning (at 10:05, not  <br/>\n10:00, which is why I was so cranky, though there&#39;s a little more to  <br/>\nit than just that) he told her what all she needed to do to finalize  <br/>\nthe hiring (didn&#39;t surprise me at all that the would offer her a job,  <br/>\nand I don&#39;t know how many from the group they might&#39;ve chosen; she&#39;ll  <br/>\nfind out later, I guess), he said the quiz on the handbook was very  <br/>\nimportant, so she should read it very carefully.  She did.  But the  <br/>\nway she repeated that to me, I think he thought she might be  <br/>\ngenerally slow in &quot;reading and writing.&quot;  Had their questions been  <br/>\ndone with keyboards, Holly would&#39;ve been the first one through and  <br/>\ncould&#39;ve made a moving gif to illustrate it all! &lt;g&gt;<br/>\n<br/>\n<br/>\n<br/>\nI guess he&#39;ll relieved to learn she can read fine, and use a computer  <br/>\nwonderfully well.<br/>\n<br/>\nBut yes, the writing slowed her down.  She&#39;s not fast.  Her letters  <br/>\naren&#39;t always &quot;made right.&quot;  She knows all it would take is  <br/>\npractice.  Kirby got practice when he taught karate and had to fill  <br/>\nin judging forms, and then when he worked phones and drive through at  <br/>\na busy pizza place and others had to read his handwriting.   Marty  <br/>\ndoes miniature block printing that&#39;s  pretty legible.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":346626599,"authorName":"guideforthree","from":"&quot;guideforthree&quot; &lt;tinaboster@...&gt;","profile":"guideforthree","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Confidence","postDate":"1226351100","msgId":40094,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmYTdscytmZzJmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGdmOW5wMyt0dGltQGVHcm91cHMuY29tPg=="},"prevInTopic":40086,"nextInTopic":40106,"prevInTime":40093,"nextInTime":40095,"topicId":38819,"numMessagesInTopic":0,"msgSnippet":"==== I also realize that I see his difficulties as being a reflection of ME.  I m sure people would say, WOW...you homeschool and your kids can t even write!! ","messageBody":"<div id=\"ygrps-yiv-1832682801\">====<br/>\nI also realize that I see his difficulties as being a reflection of <br/>\nME.  I&#39;m sure people would say, WOW...you homeschool and your kids <br/>\ncan&#39;t even write!!  <br/>\n=====<br/>\n<br/>\n<br/>\nMy son went to school from the time he was three until halfway through <br/>\nfourth grade, and he can&#39;t write.  He is 11 now, and when he does <br/>\nattempt to write, his letters are huge, and most of the words are <br/>\nmisspelled.  However, with each attempt, he gets a little better.  <br/>\nInstead of focussing on writing, I focus on the things he does really <br/>\nwell.  When we first started unschooling, some family members were <br/>\nworried that his writing was not improving.  My response was along the <br/>\nlines of &quot;If you are struggling with something, and you find it <br/>\ndifficult, do you want people to keep cajolling you, or would you <br/>\nrather work it out in your own time without being pestered?&quot;<br/>\n<br/>\nI made a big leap when I was able to come to the realization that my <br/>\nkids are not me, and I am not my kids.  My self worth and identity has <br/>\nto come from me, not from someone else.  After I was able to make that <br/>\nmental shift, I was able to understand that my son&#39;s developmental time <br/>\ntable is his, and not mine.  It did take a while for me to arrive at a <br/>\npoint where I was comfortable with that idea.<br/>\n<br/>\n<br/>\n===<br/>\nHow do I gain the confidence and help my son be OK with his current <br/>\nabilities in situations like the one above?  <br/>\n===<br/>\n<br/>\nConfidence is generally something that comes over time through <br/>\nexperience.  Continue to focus your thoughts on the things he does <br/>\nwell, rather than dwelling on what he can&#39;t do, yet.  Continue to help <br/>\nhim when he asks for it.  Although, over time the help you provide in <br/>\npublic may become more discrete, such as using your finger to write a <br/>\nletter in the palm of his hand, rather than up in the air.  <br/>\n<br/>\nAs he has more need of writing, he will use it more, and eventually, he <br/>\nwill stop coming to you for help.  Believe it or not, one day you will <br/>\nmiss all this.  You will try to look back, and you will not be able to <br/>\nremember the last time he asked you how to spell a word.  <br/>\n<br/>\nWe often celebrate and glorify the first time a child does something, <br/>\nbut we somehow miss all the lasts.  Now, I am sad, because I can&#39;t <br/>\nremember the last time Toby held my hand to cross the street; I can&#39;t <br/>\nremember the last time he sat in my lap; and I can&#39;t remember the last <br/>\ntime he asked me to read something for him.<br/>\n<br/>\nTina</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Confidence","postDate":"1226345165","msgId":40086,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEMwOTM1NkRGLTVBRUMtNDBCRS1COEJFLUVEOEQ4MjIwMjQzOUBtYWMuY29tPg==","inReplyToHeader":"PGdmOW5wMyt0dGltQGVHcm91cHMuY29tPg==","referencesHeader":"PGdmOW5wMyt0dGltQGVHcm91cHMuY29tPg=="},"prevInTopic":40076,"nextInTopic":40094,"prevInTime":40085,"nextInTime":40087,"topicId":38819,"numMessagesInTopic":0,"msgSnippet":"... You could turn this around in your own head. What you re doing is protecting your son from the kind of damage that is so OFTEN done, especially to young","messageBody":"<div id=\"ygrps-yiv-1798449644\">On Nov 10, 2008, at 8:33 AM, Sarah wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;  I think just because it<br/>\n&gt; is VERY obvious when someone cannot write or spell simple words<br/>\n&gt; correctly.  I am beginning to DREAD situations where we will be<br/>\n&gt; around non unschooling families and I don&#39;t want to feel like that.<br/>\n&gt; How do I gain the confidence and help my son be OK with his current<br/>\n&gt; abilities in situations like the one above?<br/>\n<br/>\n </span></blockquote>You could turn this around in your own head. What you&#39;re doing is  <br/>\nprotecting your son from the kind of damage that is so OFTEN done,  <br/>\nespecially to young boys, by pushing reading and writing on them when  <br/>\nthey are developmentally not quite ready.<br/>\n<br/>\nWhen it happens that something comes up like the signing of the card,  <br/>\nbe prepared to do what it takes to protect him from being embarrassed.  <br/>\nDo it with confidence that YOU are doing the right thing, because you  <br/>\ntruly are! It might help if you read some of the literature about the  <br/>\neffect of pushing early academics - David Elkind&#39;s &quot;Miseducation&quot; or  <br/>\n&quot;The Hurried Child&quot; might be helpful to you.<br/>\n<br/>\nBe proud of yourself for being the mom who has the insight AND the  <br/>\ngumption to protect her son in spite of societal pressures.<br/>\n<br/>\nAs far as helping your son, changing your own attitude will almost  <br/>\ncertainly rub off on him. Also, be sure that he has an answer for  <br/>\nsituations in which someone actually says out loud to him, &quot;You write  <br/>\nlike a baby,&quot; or something like that, if that is a possibility. He can  <br/>\nsay, &quot;I don&#39;t write well yet, but I can ...... really well.&quot; And, for  <br/>\nhis own sake, if there are comparisons being made with cousins, be  <br/>\nsure he is aware of what he does and knows that his cousins don&#39;t.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":20623128,"authorName":"Sarah","from":"&quot;Sarah&quot; &lt;wee_wah@...&gt;","profile":"bluishbear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Confidence","postDate":"1226334819","msgId":40076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdmOW5wMyt0dGltQGVHcm91cHMuY29tPg=="},"prevInTopic":38895,"nextInTopic":40086,"prevInTime":40075,"nextInTime":40077,"topicId":38819,"numMessagesInTopic":0,"msgSnippet":"Last night at my 9yo DS soccer party, there was a card set out for all the boys to sign for the coach.  My DS looked a little nervous and came up to me and","messageBody":"<div id=\"ygrps-yiv-165693368\">Last night at my 9yo DS soccer party, there was a card set out for <br/>\nall the boys to sign for the coach.  My DS looked a little nervous <br/>\nand came up to me and very quietly  said &quot;I always forget which way <br/>\nJ&#39;s go, this way or that way?&quot;  I showed him by *drawing* a J in the <br/>\nair.  <br/>\n <br/>\nHe is definitely beginning to notice things he cannot do as well as <br/>\nothers can.  Writing is the big one right now.  It is just not <br/>\nsomething that interests him at all so he rarely writes.   While we <br/>\ndo have unschooling friends to play and hangout with, we also have a <br/>\nlot of family (the boys have 12 cousins) nearby that we see fairly <br/>\noften...all of whom are in public school.  <br/>\n <br/>\nI&#39;m looking for ways to be more confident in this area around other <br/>\npeople.  I don&#39;t want my son to feel embarrassed around other kids.  <br/>\nI also realize that I see his difficulties as being a reflection of <br/>\nME.  I&#39;m sure people would say, WOW...you homeschool and your kids <br/>\ncan&#39;t even write!!  I feel fairly confident in all other areas but <br/>\nwriting and spelling are really hard for me.  I think just because it <br/>\nis VERY obvious when someone cannot write or spell simple words <br/>\ncorrectly.  I am beginning to DREAD situations where we will be <br/>\naround non unschooling families and I don&#39;t want to feel like that.  <br/>\nHow do I gain the confidence and help my son be OK with his current <br/>\nabilities in situations like the one above?  <br/>\n<br/>\n <br/>\nThanks!<br/>\nSarah</div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Confidence","postDate":"1222725940","msgId":38895,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDgwOTI5MTUwNWo2NjEwYWE1ZmsyY2I4MmQzMmNjMzNhZTQ4QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEEwN0RBM0JFLUNCNTYtNEUwQy04ODdGLTk1NDZGRkM3NUE1MUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGdibXVibCtra3JxQGVHcm91cHMuY29tPgkgPEEwN0RBM0JFLUNCNTYtNEUwQy04ODdGLTk1NDZGRkM3NUE1MUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":38826,"nextInTopic":40076,"prevInTime":38894,"nextInTime":38896,"topicId":38819,"numMessagesInTopic":0,"msgSnippet":"-=-And rather than be so focused on how I want my kids and husband to change, I can focus on how I would like myself to change. -=- My favorite version of the","messageBody":"<div id=\"ygrps-yiv-2122826393\">-=-And rather than be so focused on how I want my<br/>\nkids and husband to change, I can focus on how I would like myself to<br/>\nchange. -=-<br/>\n<br/>\nMy favorite version of the Serenity Prayer:<br/>\nGod grant me the Serenity to accept those I cannot change,<br/>\nthe Courage to change the one I can,<br/>\nAnd the Wisdom to know it&#39;s ME.<br/>\n<br/>\nSaved me eons of frustration :D<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com __,_._,__<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Confidence","postDate":"1222580217","msgId":38823,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEEwN0RBM0JFLUNCNTYtNEUwQy04ODdGLTk1NDZGRkM3NUE1MUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdibXVibCtra3JxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdibXVibCtra3JxQGVHcm91cHMuY29tPg=="},"prevInTopic":38819,"nextInTopic":38826,"prevInTime":38822,"nextInTime":38824,"topicId":38819,"numMessagesInTopic":0,"msgSnippet":"-=-And rather than be so focused on how I want my kids and husband to change, I can focus on how I would like myself to change. -=- I don t think I ve seen a","messageBody":"<div id=\"ygrps-yiv-1931048995\">-=-And rather than be so focused on how I want my<br/>\nkids and husband to change, I can focus on how I would like myself to<br/>\nchange. -=-<br/>\n<br/>\n  I don&#39;t think I&#39;ve seen a situation yet in which the mom blossomed  <br/>\ninto a calmer, happier more confident person and it didn&#39;t then cause  <br/>\na change in the children or the husband or both.<br/>\n<br/>\nGood for you, and I&#39;m glad this list is helping.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":334153590,"authorName":"H Sand","from":"&quot;H Sand&quot; &lt;hsand06@...&gt;","profile":"dakotastormsand","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Confidence","postDate":"1222578161","msgId":38826,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGYwZWFhZjYzMDgwOTI3MjIwMnUyOTUzZTFmYWhiMDA4YTE0MGJkOWJlNTBiQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGdibXVibCtra3JxQGVHcm91cHMuY29tPg==","referencesHeader":"PGdibXVibCtra3JxQGVHcm91cHMuY29tPg=="},"prevInTopic":38823,"nextInTopic":38895,"prevInTime":38825,"nextInTime":38827,"topicId":38819,"numMessagesInTopic":0,"msgSnippet":"that s awesome! It s a process I m working on too!","messageBody":"<div id=\"ygrps-yiv-1253005782\">that&#39;s awesome! It&#39;s a process I&#39;m working on too!<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sat, Sep 27, 2008 at 10:40 PM, Verna &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:lalow@...\">lalow@...</a>&gt; wrote:<br/>\n&gt; I lack confidence in myself and my actions. Always second guessing,<br/>\n&gt; wondering if I am doing the right thing etc.. At homeschool groups I<br/>\n&gt; go to I hear mothers go on and and on about curriculums and stategies<br/>\n&gt; and what grade level their kids are working in- because they lack<br/>\n&gt; confidence. Even when they say things about how they homeschool so<br/>\n&gt; their kids can learn at their own pace, they really mean as long as<br/>\n&gt; that pace doesnt embarress them and they can still say they are above<br/>\n&gt; grade level. They can not let go of that dillusion of control.<br/>\n&gt; I come here cause I dont hear that in the posts of the more<br/>\n&gt; experienced unschoolers. Confidence that this is the way to a more<br/>\n&gt; peaceful, harmonious, living and learning experience comes out in the<br/>\n&gt; posts. That I have the power to change my attitudes and outlook is<br/>\n&gt; huge for me. I am certainly not there yet, but where as I used to<br/>\n&gt; just be full of guilt that I dont do everything right, now I have a<br/>\n&gt; goal and a mindset. And rather than be so focused on how I want my<br/>\n&gt; kids and husband to change, I can focus on how I would like myself to<br/>\n&gt; change.<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":222835102,"authorName":"Verna","from":"&quot;Verna&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Confidence","postDate":"1222573237","msgId":38819,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdibXVibCtra3JxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":38823,"prevInTime":38818,"nextInTime":38820,"topicId":38819,"numMessagesInTopic":0,"msgSnippet":"I lack confidence in myself and my actions.  Always second guessing, wondering if I am doing the right thing etc.. At homeschool groups I go to I hear mothers","messageBody":"<div id=\"ygrps-yiv-1487513116\">I lack confidence in myself and my actions.  Always second guessing, <br/>\nwondering if I am doing the right thing etc.. At homeschool groups I <br/>\ngo to I hear mothers go on and and on about curriculums and stategies <br/>\nand what grade level their kids are working in- because they lack <br/>\nconfidence.  Even when they say things about how they homeschool so <br/>\ntheir kids can learn at their own pace, they really mean as long as <br/>\nthat pace doesnt embarress them and they can still say they are above <br/>\ngrade level.  They can not let go of that dillusion of control.<br/>\nI come here cause I dont hear that in the posts of the more <br/>\nexperienced unschoolers.   Confidence that this is the way to a more <br/>\npeaceful, harmonious, living and learning experience comes out in the <br/>\nposts.  That I have the power to change  my attitudes and outlook is <br/>\nhuge for me.  I am certainly not there yet, but where as I used to <br/>\njust be full of guilt that I dont do everything right, now I have a <br/>\ngoal and a mindset.  And rather than be so focused on how I want my <br/>\nkids and husband to change, I can focus on how I would like myself to <br/>\nchange.</div>","specialLinks":[]}],"prevTopicId":40038,"nextTopicId":40058}}