{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"dezignarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Need some reassurance","postDate":"1065136473","msgId":81958,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMzODkzYSRmMWE0ZTU1MCQzNDAwYThjMEByb2J5bm1hY2hpbmU+","inReplyToHeader":"PDAwNTMwMWMzODhmYiQwNmZiMzBjMCQ5Mzc2ODQ0NUBjYXJvbGluYS5yci5jb20+"},"prevInTopic":81921,"nextInTopic":0,"prevInTime":81957,"nextInTime":81959,"topicId":81914,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1948888607\">&lt;&lt;My biggest concern is this. We have 3 younger children ages 6, 4 and<br/>\n1. My dd spends most of her days with them building forts, and playing<br/>\nhouse. Sometimes they will make up games about store  or school. But<br/>\nreally she spends most of her days, dancing (which she takes lessons for<br/>\nand absolutely loves), playing house with her sisters or building forts<br/>\nwith her brother.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nI think that building close relationships with her siblings is<br/>\nabsolutely the most marvelous thing she can be doing. There was recently<br/>\na thread about siblings. Many people lamented how not close they are to<br/>\ntheir adult sibs. <br/>\n <br/>\n&lt;&lt;Should I be taking her away from her play to try to see if there is<br/>\nsomething else she wants to learn about. Should I arrange more &quot;field<br/>\ntrips&quot;. It&#39;s very hard to not want to do something. &gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nNo dichotomy between play and learning!!! I feel like that is a theme<br/>\nthat is developing in many posts from different people. I would not drag<br/>\nJayn away from a game for some priority of mine - giving her the<br/>\nimpression that her activities were less important - with the exception<br/>\nof having to get her to her dance or ice-skating classes. Generally I<br/>\nwarn her that starting something would be a bad idea as she will have to<br/>\nleave it shortly to leave the house.<br/>\n<br/>\n&quot;Field Trips&quot; is educationese. For us going somewhere usually has the<br/>\ngoal of purchasing something, or having fun, or visiting (in order to<br/>\nhave fun) friends, or getting some fresh air and exercise. We do not go<br/>\non field trips, except the odd one that someone in our local support<br/>\ngroup organizes. Jayn didn&#39;t want to stay at the Wetlands - it probably<br/>\nwas too unlike play - so we left very early. We went to the Long Beach<br/>\nAquarium last week, because we all enjoy looking at the fish etc.<br/>\n<br/>\n <br/>\n<br/>\n&lt;&lt;I get worried because I think the younger ones obviously still have<br/>\nyears longer than she does to learn and that she is being kept young by<br/>\nthem. Mostly I enjoy watching them play and interact, but that nagging<br/>\npublic school side of me worries.&gt;&gt;<br/>\n<br/>\n <br/>\n<br/>\nThis statements suggests that one of your nagging worries is the very<br/>\nmuch school instilled concept that learning has a schedule, and that<br/>\nthere are milestones to be reached at certain times, and that some kids<br/>\nare advanced and others behind (gasp! Get help at once). Try, and I know<br/>\nit is sometimes hard, not to compare her to her age-mates in school or<br/>\nany other kids. In the broadest sense we all have the same time to learn<br/>\nwhat we need - our whole lifetime. <br/>\n<br/>\nWhen you say &quot;kept young&quot;, I assume you mean kept immature. What<br/>\nalternative would you prefer, and would that actually be better than<br/>\nwhat you have in your happy sounding home?<br/>\n<br/>\nRobyn Coburn<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Need some reassurance","postDate":"1065111843","msgId":81921,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE3YS4yMGM4MWVmZS4yY2FkYWIyM0Bhb2wuY29tPg=="},"prevInTopic":81914,"nextInTopic":81958,"prevInTime":81920,"nextInTime":81922,"topicId":81914,"numMessagesInTopic":0,"msgSnippet":"In a message dated 10/2/03 9:39:46 AM, bstamp@carolina.rr.com writes: ","messageBody":"<div id=\"ygrps-yiv-703864342\">In a message dated 10/2/03 9:39:46 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:bstamp@...\">bstamp@...</a> writes:<br/>\n<br/>\n&lt;&lt; I know that there is some learning going on, and definite maturing but <br/>\nit&#39;s just hard to not see the concrete evidence right now. &gt;&gt;<br/>\n<br/>\nYou said what you didn&#39;t mean to say!  <br/>\nYou slipped up and said what you&#39;ll believe when you look more closely at the <br/>\nlearning she&#39;s doing.<br/>\n<br/>\nYou don&#39;t need &quot;concrete evidence.&quot;  You need to change your own view of <br/>\nlearning so that you see clearly what she&#39;s doing, instead of squinting at her <br/>\nthrough school-colored glasses.<br/>\n<br/>\n&lt;&lt;Should I be taking her away from her play to try to see if there is <br/>\nsomething else she wants to learn about.&gt;&gt;<br/>\n<br/>\nYou should let her do what&#39;s most interesting.  If you have something more <br/>\ninteresting for her to do, propose it.  Take no for an answer, though.   If <br/>\nshe&#39;s willing to stop doing something interesting to do something very boring, <br/>\nyou&#39;re asking for something that will NOT contribute to learning or your future <br/>\njoyous relationship with her.<br/>\n<br/>\n&lt;&lt;Should I arrange more &quot;field trips&quot;. It&#39;s very hard to not want to do <br/>\nsomething. &gt;&gt;<br/>\n<br/>\nWhy can&#39;t you take all your kids to interesting places as often as you can.  <br/>\nDon&#39;t you already?<br/>\n<br/>\n&lt;&lt;I get worried because I think the younger ones obviously still have years <br/>\nlonger than she does to learn and that she is being kept young by them.&gt;&gt;<br/>\n<br/>\nThey all have their whole lives.<br/>\nAre you racing the neighbors?  Bad idea.<br/>\n<br/>\n&quot;Being kept young&quot; is the goal of most adults.  Let her be young.  Let her be <br/>\nthe way she wants to be any moment without labelling behaviors and desires <br/>\n&quot;too young&quot; or &quot;too old&quot; or &quot;just right.&quot;  Let her be HER.<br/>\n<br/>\n&lt;&lt; Mostly I enjoy watching them play and interact, but that nagging public <br/>\nschool side of me worries.&gt;&gt;<br/>\n<br/>\nFor one thing, shush the nagging in your head.<br/>\nStop having a public school side of you.<br/>\n<br/>\nAnd for another, why are you just watching?  Aren&#39;t you interacting with your <br/>\nchildren too?<br/>\n<br/>\nSorry to be harsh, but you&#39;re right on the edge of going from worry to peace, <br/>\nso you might as well shush the worry and embrace the peace and spend the <br/>\nenergy you&#39;re spending worrying on doing something peacefully joyful with and for <br/>\nyour kids.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":63919499,"authorName":"Brian and Kathy Stamp","from":"&quot;Brian and Kathy Stamp&quot; &lt;bstamp@...&gt;","profile":"kathysta","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Need some reassurance","postDate":"1065109022","msgId":81914,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNTMwMWMzODhmYiQwNmZiMzBjMCQ5Mzc2ODQ0NUBjYXJvbGluYS5yci5jb20+"},"prevInTopic":0,"nextInTopic":81921,"prevInTime":81913,"nextInTime":81915,"topicId":81914,"numMessagesInTopic":0,"msgSnippet":"I brought my dd out of school about 3/4 s of the way through 2nd grade when she was 7. She is now 9. My biggest concern is this. We have 3 younger children","messageBody":"<div id=\"ygrps-yiv-187388247\">I brought my dd out of school about 3/4&#39;s of the way through 2nd grade when she was 7. She is now 9.<br/>\n<br/>\nMy biggest concern is this. We have 3 younger children ages 6, 4 and 1. My dd spends most of her days with them building forts, and playing house. Sometimes they will make up games about store  or school. But really she spends most of her days, dancing (which she takes lessons for and absolutely loves), playing house with her sisters or building forts with her brother.<br/>\n<br/>\nI know that there is some learning going on, and definite maturing but it&#39;s just hard to not see the concrete evidence right now.<br/>\n<br/>\nShould I be taking her away from her play to try to see if there is something else she wants to learn about. Should I arrange more &quot;field trips&quot;. It&#39;s very hard to not want to do something.  I get worried because I think the younger ones obviously still have years longer than she does to learn and that she is being kept young by them. Mostly I enjoy watching them play and interact, but that nagging public school side of me worries.<br/>\n<br/>\nKathy<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":81930,"nextTopicId":81835}}