{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":252464818,"authorName":"Christina","from":"&quot;Christina&quot; &lt;daharryrc@...&gt;","profile":"daharryrc","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Food Choices with Toddlers","postDate":"1331899841","msgId":66176,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpqdmFrMStrbXNpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":66175,"nextInTime":66177,"topicId":66176,"numMessagesInTopic":0,"msgSnippet":"Hi Everyone, I ve been reading EVERYTHING everyone has been sharing and it s been fascinating.  I have recently, (the last month), eased up on the food","messageBody":"<div id=\"ygrps-yiv-18761134\">Hi Everyone,<br/>\n<br/>\nI&#39;ve been reading EVERYTHING everyone has been sharing and it&#39;s been fascinating.  I have recently, (the last month), eased up on the food controls I have had on sugar with my older kids.  My older two kids eat such a variety of foods that I don&#39;t feel any stress about it at all.  It&#39;s been fun to watch them have unlimited access to whatever they want and make such varied choices.  :-)<br/>\n<br/>\nHowever, I didn&#39;t ease up with my two year old till 3 days ago.  My thinking has been that she was &quot;too young&quot; to make these choices completely on her own.  She is my &quot;can I have ice cream&quot; for breakfast baby.  When I first gave her her own monkey platter, she didn&#39;t want it.  Even though I had put all her usual favorites on it, including chocolate.  A little while later, she warmed up to it and ate the chocolate...left the rest, lol.  I thought about why she might be have been unhappy with the monkey platter initially and my thought was that since she is always asking for &quot;sweets&quot; and my typical response has been after lunch or something like that and offered her &quot;healthy&quot; foods.  So I think she feels that if momma is giving it to her, it can&#39;t be what she wants.  Don&#39;t know for sure, but it&#39;s my thought.  She&#39;s done better with the monkey platter since the initial day.<br/>\n<br/>\nShe has gotten ice cream for breakfast now and afterwards ate a little cereal, (her choice).  She loves yogurt, cheese, milk, any dairy...  She&#39;ll eat very teeny quantities of other foods.  Last night we had chili and she ate very little and then wanted cookies.  She only likes the cream, but she had two cream filled cookies, cream only.  <br/>\n<br/>\nDoes this all look the same for toddlers as with older kids or is there more restriction with them?  <br/>\n<br/>\nAnother thing...she used to ask me ALL day long, &quot;Can she eat?&quot;.  We could&#39;ve just finished breakfast and she would ask.  Since the monkey platters and this discussion I&#39;ve been more proactive rather than waiting for her to ask, I&#39;ve been offering.  I can only imagine how stressful it must be for her to have to depend on others to have something as basic as food.  She has been the first of my children to have this really big need to graze all day.  She&#39;s not much on meals.  My other two have always been good with meals and would eat a little in between, but not much.  They just wanted to play.  She always needs access to food and a lot of variety, (processed, but variety), so it&#39;s been a shift.  I don&#39;t know if that makes a difference to any responses I may get, but thought it could be significant.<br/>\n<br/>\nThanks!<br/>\nchristina.</div>","specialLinks":[]}],"prevTopicId":66088,"nextTopicId":66178}}