{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] Lisa&#39;s Son","postDate":"1028061110","msgId":8200,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwNzMwMjAzMTUwLjc3Nzc3LnFtYWlsQHdlYjEzNzAyLm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwMjgwMTMzMjEuODMyLjc2MzcubTEyQHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":8199,"nextInTime":8201,"topicId":8200,"numMessagesInTopic":0,"msgSnippet":"... Lisa, I had to respond because you son has a lot of issues in common with my older son, who is 5.5 years.  Thomas has sensory integration issues, many","messageBody":"<div id=\"ygrps-yiv-888347620\"><blockquote><span title=\"ireply\">&gt;I now allow my kids complete access to TV.  The<br/>\n&gt;problem is with my 7 year old son. <br/>\n<br/>\n </span></blockquote>Lisa,<br/>\nI had to respond because you son has a lot of issues<br/>\nin common with my older son, who is 5.5 years.  Thomas<br/>\nhas sensory integration issues, many allergies, very<br/>\nlittle patience, anger management problems, compulsive<br/>\nand obsessive behaviors, is extremely cuddley and<br/>\nneedy.  Most of his bigtime cuddles take place in the<br/>\nmorning, often watching tv with his daddy or I before<br/>\nthe day really starts.  He is an early riser.  He<br/>\ncannot wear many types of clothes, only soft cloth<br/>\npants and shirts, tags cut out, no big seams, no thick<br/>\nor stiff material, no tight cuffs, no collars, no<br/>\nshort pants, no short sleeves, socks inside out, shoes<br/>\nloose.   He is often naked.  He wants his hair cut<br/>\nshort enough not to brush his neck but long enough not<br/>\nto have cowlicks (his hair is one of his obsessive<br/>\nthings.)<br/>\n<br/>\nThomas doesn&#39;t respond well to authority and fights<br/>\ntooth and nail against being thwarted.  He is<br/>\npassionate, impatient, strong willed, stubborn,<br/>\nartistic and creative.<br/>\n<br/>\nHe also experienced a change of personality watching<br/>\ntoo much tv, and was obsessive about the tv.  Too much<br/>\ntv made him very hard to live with, and increased his<br/>\nfrustration and stress level to such a degree that it<br/>\nwas really making him miserable.  He required that no<br/>\none talk above a whisper in the room where he was<br/>\nwatching tv, because he could not properly filter the<br/>\nnoise out.  He was really controlling about what we<br/>\nwatched.  So we stopped getting tv, local channels<br/>\nhave not come in well or many in any place that we<br/>\nhave lived, so not taking cable means no real tv<br/>\naccess.  Instead we watch videos and DVDs or he plays<br/>\ncomputer games or does things online.  The different<br/>\npace of commercial tv, and the commercials themselves,<br/>\nwere just overloading him to the point that he was not<br/>\npleasant to live with and he was not capable of<br/>\nhandling normal daily stress.<br/>\n<br/>\nOne thing I have had many doctors tell me when we have<br/>\nhad him evaluated for his behavioral issues, is that<br/>\nhe is on sensory overload (right before they all tell<br/>\nme he needs drugs.)  His senory integration, for lack<br/>\nof a better way to term his problem, although I<br/>\nrecognize that labels are insufficient, doesn&#39;t enable<br/>\nhim to process too much sensory information at one<br/>\ntime.  His ability to filter different sensory input<br/>\nis limited and the more stimulation he has the worse<br/>\nit gets.  So quiet is good for him, being at home is<br/>\ngood for him, no commercial tv is good for him.  At<br/>\nleast until he is older and better able to filter<br/>\nsensory input without getting overloaded.  I consider<br/>\nthis a parenting decision to protect his well being,<br/>\nsanity, self esteem and family harmony.<br/>\n<br/>\nWe have a Homeopathic family doctor, but Thomas<br/>\ndoesn&#39;t want to take the supplements that she gave us,<br/>\nand it is a lot to expect of him to take all these<br/>\nthings every day.  She believes that early stress<br/>\naffected his nervous system, immune system and<br/>\ndigestive system.  Thus he has so many allergies and<br/>\nis unable to deal well with stress, among other<br/>\nthings.  We are still working on finding a good<br/>\nsolution to these issues.  But we did go all organic,<br/>\nand eliminated a few more allergens from his diet, as<br/>\nwell as greatly reduced his sugar intake.  That has<br/>\nhelped in his ability to deal with daily stress and<br/>\nhis attention span.  With less chemicals for his body<br/>\nto deal with, he is better able to focus his energy<br/>\nwhere he wants and needs it.<br/>\n<br/>\nI don&#39;t know if any of this will help. But I do<br/>\naympathize, and you are not alone in dealing with<br/>\nthese issues with your son.  Good luck in finding the<br/>\nright solutions for your son and your family.<br/>\n<br/>\nNanci K.<br/>\n<br/>\n__________________________________________________<br/>\nDo You Yahoo!?<br/>\nYahoo! Health - Feel better, live better<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://health.yahoo.com\">http://health.yahoo.com</a></div>","specialLinks":[]}],"prevTopicId":8188,"nextTopicId":8199}}