{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Differing Parenting Style Question/Concern but for different children","postDate":"1324248752","msgId":64545,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMjQyNDg3NTIuNzYxLllhaG9vTWFpbE5lb0B3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+","inReplyToHeader":"PGpjbHBlNStzbGxuQGVHcm91cHMuY29tPg==","referencesHeader":"PGpjbDhpOStwYXM1QGVHcm91cHMuY29tPiA8amNscGU1K3NsbG5AZUdyb3Vwcy5jb20+"},"prevInTopic":64544,"nextInTopic":0,"prevInTime":64544,"nextInTime":64546,"topicId":64536,"numMessagesInTopic":0,"msgSnippet":"I think you need to know what your priorities really are.  I have step kids from my first marriage and when I was with their dad I absolutely tried to  ","messageBody":"<div id=\"ygrps-yiv-787176483\">I think you need to know what your priorities really are.<br/>\n I have step kids from my first marriage and when I was with their dad I absolutely tried to <br/>\nstay out of the relationship. I was a great friend to the kids  after they got to know me and when they were over I was very aware to the kids needs to be with their dad and get all the time and attention they needed from dad. That is why I got along so well with them.<br/>\n  <br/>\nNow having kids I see things so much clearer and I am so happy I did what I did while living with their dad.<br/>\nThey were his priority and I absolutely loved him for that. That is the kind of man I  admired.<br/>\n<br/>\nMy husband now is the same way. Our kids come first and we have had talks about that  and our marriage is important because of the kids too.<br/>\nWe want to have a good relationship  and make our kids life safe, peaceful and happy.<br/>\n<br/>\nI think you need to see it clearly what your priorities are.  If  a man cannot understand that my kids comes first then that would had been a red flag for me. Once you have a child it is not longer only about you and your boyfriend  that matters.&#39;<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":331885657,"authorName":"Jennifer Schuelein","from":"&quot;Jennifer Schuelein&quot; &lt;fairiedust66@...&gt;","profile":"jenfromtx6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Differing Parenting Style Question/Concern but for different children","postDate":"1324247301","msgId":64544,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbHBlNStzbGxuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpjbDhpOStwYXM1QGVHcm91cHMuY29tPg=="},"prevInTopic":64543,"nextInTopic":64545,"prevInTime":64543,"nextInTime":64545,"topicId":64536,"numMessagesInTopic":0,"msgSnippet":"Your daughter s needs should be put at the forefront. I would distance myself, spend way more time at your house and nurture your child first. If the","messageBody":"<div id=\"ygrps-yiv-320983355\">Your daughter&#39;s needs should be put at the forefront. I would distance myself, spend way more time at your house and nurture your child first. If the relationship fizzles because of all of the stress and conflict, then maybe it is simply not the right time for it. <br/>\n<br/>\nSupport your child 100% in every way. It is sad that you cannot help more and fix the situation, but it is their situation and it is his child. You cannot change the situation so keep your child safe (emotionally). <br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;angelovfaith&quot; &lt;AngelOvFaith@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; I havnt posted in awhile but also keep up with posts daily as a recent poster just also said. She raised concerns about co-parenting and choices, so this prompted me to reach out for feedback on my current situation.<br/>\n&gt; My boyfriend & I have known each other for 11 years, & have rekindled a relationship, supporting each other through one another&#39;s divorce this September, and everything has felt like a big happy family, and all got along so well and we practically live there. He has full custody of his 5 year old son and i have full custody of my 8 year old daughter. Neither of the other parents see the children. My boyfriend has completely been in support of our unschooling life, and has enjoyed the extra time he&#39;s gotten to know my daughter and grow closer with her. I am grateful for these days.<br/>\n&gt; <br/>\n&gt; He recently & hesitantly started his son in kindergarten after we discussed the options to it- one being that i could watch him days while his father&#39;s at work, but the son wasnt ready to stay alone with me, and he even tried daycare but couldnt afford it any longer.<br/>\n&gt; <br/>\n&gt; Since school began for him, his son has been completely different & full of fear about losing his father, & cries at everything. He was sensitive before and had alot of anxiety, but not to this degree.  Its caused his father to become very stressed out, therefore having an impact on our time spent at their house, which we are usually at during the week, due to his school. His grandmother advised her son & insisted he&#39;s kept to a schedule of eating at 8am, 12pm, & 5pm, then to bed at 8pm. My daughter & i are aghast by this as she used to stay up late with us and hang out but now is asked to &quot;pretend&quot; she&#39;s asleep so the son will go to sleep, and she also is now not allowed to have her usual whenever she feels like it snacks because the boy isnt allowed to eat after dinner. He counts days til his birthday and christmas in &quot;bedtimes&quot; which we found very sad.<br/>\n&gt; <br/>\n&gt; The easy thing I guess may be to remove ourselves from the situation. But for how long? And how badly will this affect my daughter now that she&#39;s gotten close with a positive male role model? Or it could go the other way and he could make things worse for her.<br/>\n&gt; My boyfriend&#39;s brother and sister in law told me that the little boy is suffering from losing his mother, sister and life as he knew it in a year&#39;s time, and i feel badly abandoning them both through such a tough transition when he has stuck by me through so much. the boy looks up to my daughter and really is his only friend.<br/>\n&gt; <br/>\n&gt; My boyfriend now insists his son &quot;needs&quot; school, and that maybe i should consider it for my daughter, as its distracting his son when he has to get up at 7am and his son starts crying that my daughter&#39;s still asleep or doing something fun. I see that he is exasperated but i have a boiling point too. I feel angry lately that my daughter is being limited and want to leave. He no longer even can walk us to the car past the front door without his son crying for him. I dont know what to offer at this point. Theres so much more that happens daily, but its affected our life so much i need some support desparately.<br/>\n&gt; <br/>\n&gt; I love these people, so i dont know what steps, if any to take to help or stand back.<br/>\n&gt; <br/>\n&gt; Thank you, -Lynne<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Differing Parenting Style Question/Concern but for different children","postDate":"1324246932","msgId":64543,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY4QkRCM0RCLUI2QTItNEU4Ny05MzM5LTgwMDM4QjgyNERFMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGpjbDhpOStwYXM1QGVHcm91cHMuY29tPg==","referencesHeader":"PGpjbDhpOStwYXM1QGVHcm91cHMuY29tPg=="},"prevInTopic":64537,"nextInTopic":64544,"prevInTime":64542,"nextInTime":64544,"topicId":64536,"numMessagesInTopic":0,"msgSnippet":"-=-My boyfriend & I have known each other for 11 years, & have rekindled a relationship, supporting each other through one another s divorce this September,","messageBody":"<div id=\"ygrps-yiv-1401409887\">-=-My boyfriend & I have known each other for 11 years, & have rekindled a relationship, supporting each other through one another&#39;s divorce this September, and everything has felt like a big happy family, and all got along so well and we practically live there-=-<br/>\n<br/>\nTHIS September?  You mean the other day, two or three months ago?<br/>\n<br/>\nI would go more slowly, put your daughter first, don&#39;t get involved in the other business, raise your kids &quot;in parallel play&quot; for a bit, and see what comparisons naturally arise.<br/>\n<br/>\n-=-Neither of the other parents see the children.-=-<br/>\n<br/>\nThat could change after a while, when the kids miss them or situations change.  It could happen.<br/>\n<br/>\n-=-Since school began for him, his son has been completely different & full of fear about losing his father, & cries at everything. He was sensitive before and had alot of anxiety, but not to this degree. Its caused his father to become very stressed out, therefore having an impact on our time spent at their house, which we are usually at during the week, due to his school.-=-<br/>\n<br/>\nAlso having an impact on your daughter, whether she&#39;ll admit it or realize it or not.  Your unschooling can&#39;t thrive in the sad shadow of another kid&#39;s sorrow, and it&#39;s not your responsibility to keep the other child happy if it&#39;s at your daughter&#39;s expense.<br/>\n<br/>\nMaybe the best thing you can do for that boy is to step aside a way and show what unschooling can look like.  But even you can&#39;t see what it will look like if you&#39;re embroiled in school-fueled sorrow.<br/>\n<br/>\n-=-My daughter & i are aghast by this as she used to stay up late with us and hang out but now is asked to &quot;pretend&quot; she&#39;s asleep so the son will go to sleep, and she also is now not allowed to have her usual whenever she feels like it snacks because the boy isn&#39;t allowed to eat after dinner. -=-<br/>\n<br/>\nHis grandmother isn&#39;t her grandmother.  I wouldn&#39;t stay there.  Visit, but don&#39;t live there.  If your house is peaceful and his is increasingly not, you will be a lure.  If you stay there, you just keep THEIR house from being peaceful.  No peace for anybody.<br/>\n<br/>\n-=The easy thing I guess may be to remove ourselves from the situation. But for how long? And how badly will this affect my daughter now that she&#39;s gotten close with a positive male role model? -=-<br/>\n<br/>\nThe first part seems right.  The middle part, maybe not even a full school year.  the last part!?  MY ALARM WENT Woop/Woop/Woop.  Don&#39;t justify your romance with it being good for your daughter.  I don&#39;t know (don&#39;t need to know) details, but he might be a relatively positive male role model, but he&#39;s recently divorced and is letting his mother persuade him to do old-timey, sorrow-inducing things to his own child.   Perhaps some distance is in order while you consider how positive it all is.<br/>\n<br/>\n-=- the boy looks up to my daughter and really is his only friend. -=-<br/>\n<br/>\nNot your responsibility.<br/>\nHe can&#39;t look up to her if she&#39;s being a faker about bedtimes, and hiding food.<br/>\n<br/>\n-=-My boyfriend now insists his son &quot;needs&quot; school, and that maybe i should consider it for my daughter,-=-<br/>\n<br/>\nIt would sure make his life easier, for a week or so, if you would put your daughter in school, wouldn&#39;t it?   And honestly, if your daughter DOES really like the guy, and she wouldn&#39;t mind school, and if this could lead to marriage and the guy could support you all, maybe it&#39;s worth considering.  Practicalities are real.<br/>\n<br/>\n-=- I feel angry lately that my daughter is being limited and want to leave. He no longer even can walk us to the car past the front door without his son crying for him. I dont know what to offer at this point. Theres so much more that happens daily, but its affected our life so much i need some support desparately. -=-<br/>\n<br/>\nWe can&#39;t change the situation for you.  I can tell you, though, for sure, that if you allow that negativity to poison your daughter&#39;s happiness, and your relationship with her, you aren&#39;t being a very good partner to your daughter.<br/>\n<br/>\nYou can still love them, just from a little greater distance, maybe.<br/>\nYou could tell him that he seems to be hurting his son, and you&#39;re not interested in expanding that hurt to your daughter.<br/>\n<br/>\nSandra<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Differing Parenting Style Question/Concern but for different children","postDate":"1324231760","msgId":64537,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGpjbGE4ZytmbjhqQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGpjbDhpOStwYXM1QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":64543,"prevInTime":64535,"nextInTime":64538,"topicId":64536,"numMessagesInTopic":0,"msgSnippet":"... ********************** He s a friend. Friends sometimes have big, life changing events which take them out of our lives for awhile. That s not the same as","messageBody":"<div id=\"ygrps-yiv-1838675157\">&quot;angelovfaith&quot; &lt;AngelOvFaith@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; The easy thing I guess may be to remove ourselves from the situation. But for how long? And how badly will this affect my daughter now that she&#39;s gotten close with a positive male role model?<br/>\n </span></blockquote>**********************<br/>\n<br/>\nHe&#39;s a friend. Friends sometimes have big, life changing events which take them out of our lives for awhile. That&#39;s not the same as never seeing them again. You could drop waaaaay back to visiting them sometimes and still be part of their life, still friends. It&#39;s not all or nothing. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My boyfriend&#39;s brother and sister in law told me that the little boy is suffering from losing his mother, sister and life as he knew it in a year&#39;s time, and i feel badly abandoning them both<br/>\n </span></blockquote>*******************<br/>\n<br/>\nYou say you &quot;practically&quot; live there, so I&#39;m assuming you have somewhere else to go. Spend more time in your own space. Make more plans that don&#39;t include them. You can &quot;ease out&quot; rather than suddenly not being there every day and soften the transition so it doesn&#39;t seem like a big deal, just trying something new a little at a time. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]}],"prevTopicId":64570,"nextTopicId":64435}}