{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","profile":"anoydami","replyTo":"LIST","senderId":"9ciQk5ULQPO6AFn8LQkRUXSOdMACRpk53WCM0ZH6EFd_sPcEIvyFtoLvqKAlhp_1OVp5AUn9FQasmmXJz-R7vYPVhQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] the &#39;not so allergic&#39; child....","postDate":"1006364971","msgId":28250,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAxYjQwMWMxNzJiYyRhYzQzNjJjMCRhNjVkZDFkMUBqaWRhMzU+","referencesHeader":"PDMxLjFlMDc1ZTUwLjI5MmM2MjE2QGFvbC5jb20+"},"prevInTopic":28177,"nextInTopic":0,"prevInTime":28249,"nextInTime":28251,"topicId":28177,"numMessagesInTopic":0,"msgSnippet":"Perfect example of the limitations of the English language and why everyone should have to walk a mile before making all encompassing judgements. Sounds like","messageBody":"<div id=\"ygrps-yiv-1744886299\">Perfect example of the limitations of the English language and why everyone<br/>\nshould have to &quot;walk a mile&quot; before making all encompassing judgements.<br/>\n<br/>\nSounds like a loving family, Joy and great kids!<br/>\n<br/>\nLynda<br/>\n<blockquote><span title=\"qreply\"> ----- Original Message -----<br/>\nFrom: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:JMavredakis@...\">JMavredakis@...</a>&gt;<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>&gt;<br/>\nSent: Tuesday, November 20, 2001 5:49 PM<br/>\nSubject: [Unschooling-dotcom] the &#39;not so allergic&#39; child....<br/>\n<br/>\n<br/>\n&gt; OK, i realize i am entering this topic late, but i have to interject. i<br/>\nhave<br/>\n&gt; written this over several times, and i considered not sending it but i<br/>\nfeel<br/>\n&gt; its importance.<br/>\n&gt; i have a wonderful 3 year old son. he is PDD which stands for Pervasive<br/>\n&gt; Developmental Delay. It is a disorder on the autism spectrum if that helps<br/>\n&gt; you visualize.<br/>\n&gt; my Niko is a wonderful, non-verbal, child. he can&#39;t tell you dairy hurts.<br/>\nhe<br/>\n&gt; craves milk and all dairy. he would eat it 24/7 if he was given the<br/>\nchance.<br/>\n&gt; when dairy is removed from his diet, you would never even believe he was<br/>\n&gt; autistic, yet one tiny infraction and anyone can tell immediately! if he<br/>\nhas<br/>\n&gt; any, even that tiny bit that well meaning loved ones give on the sly,  he<br/>\n&gt; will withdraw from society. he becomes a whiny, crying, bloated and gassy,<br/>\n&gt; miserable child. He tantrums (do you blame him, it hurts). this poisoned<br/>\n&gt; child!! (see below for reasoning on that one) who is looked at by others<br/>\nas a<br/>\n&gt; typical *terrible* 3&#39;s child. if you did not know his dietary intervention<br/>\n&gt; you could possibly believe the transformation was willful. he is far from<br/>\n&gt; willful!! he is the most easygoing person i have ever met.<br/>\n&gt;  is  he allergic according to the true definition?<br/>\n&gt;  no.<br/>\n&gt;  do i tell everyone he is allergic?<br/>\n&gt;  yes.<br/>\n&gt;  for the simple reason, that when i sit and explain that dairy causes a<br/>\n&gt; chemical imbalance in him because of a lacking enzyme in his body, and it<br/>\n&gt; will cause him to &quot;trip&quot; as if on LSD and he will be a monster for several<br/>\n&gt; days after that one tiny cookie/chocolate/treat that person will invariabl<br/>\ny<br/>\n&gt; say &quot;so you mean he is allergic&quot; after shaking their head at my verbiage.<br/>\nand<br/>\n&gt; of course they think IM nuts.<br/>\n&gt;<br/>\n&gt; as far as what i expect others to do if taking care of him, it is not the<br/>\n&gt; easiest thing to do to send him out with his own snacks. (you would not<br/>\n&gt; believe how many things have hidden dry milk as an ingredient listed as<br/>\n&gt; something else. casin, lecithin.. etc.) but i do not expect everyone to<br/>\nread<br/>\n&gt; all labels and make as many phone calls to manufacturers as i do. so he<br/>\ngoes<br/>\n&gt; with snacks, and I ask who is in charge to make sure he is not drinking or<br/>\n&gt; eating anything he is not given by me.  sorry for this long winded reply,<br/>\nbut<br/>\n&gt; the statement that you gave a child milk and he had no reaction shows me<br/>\nthat<br/>\n&gt; you were not really listening to this Mom.                     once<br/>\nadmitted<br/>\n&gt; to someone that Niko was not really allergic, tried to explain, but she<br/>\nheard<br/>\n&gt; &quot;not allergic really&quot; and she gave him some ice cream.  he was fine for<br/>\n&gt; several hours, and she may have thought that i was a liar. however, he did<br/>\n&gt; not  sleep for a week and neither did I.<br/>\n&gt; Joy<br/>\n&gt; Mom to<br/>\n&gt; Andrew  11/29/94 too smart for me to keep up with<br/>\n&gt; Anastasia  8/8/96 the princess!!<br/>\n&gt; Nicholas 6/21/98 my PDD child who loves to make me smile!!<br/>\n&gt; Michael 6/21/00 such an imp you ever saw<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Final episode on this topic for me, Sandra is of course wanted to share<br/>\n&gt; &gt; her thoughts as well.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I would like to be respectful, but I am not always that bright. I do<br/>\n&gt; &gt; want her to be herself, and I hope she can see that sometimes<br/>\n&gt; &gt; what seems like an argument, can really be two people who agree on the<br/>\n&gt; &gt; basics, but not always the terminology. We both want<br/>\n&gt; &gt; thoughtful caring adults to raise independent healthy children. We<br/>\n&gt; &gt; don&#39;t like hypocrites, control freaks, or labeling people (yes<br/>\n&gt; &gt; joke). We want our kids to learn to make their own decisions, and for<br/>\n&gt; &gt; them to decide what&#39;s best for themselves.<br/>\n&gt; &gt;<br/>\n&gt; &gt; here goes. I am again the K, and Sandra will be played by the letter S.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; How is &#39;no personal experience&quot; true?  Because I don&#39;t have a<br/>\n&gt; &gt; child with<br/>\n&gt; &gt; &gt; allergies?&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- I think that is the definition I was thinking of. Also that you have<br/>\n&gt; &gt; not mentioned any personal (as in you personally) experience with food<br/>\n&gt; &gt; reactions of your own. I am happy that you don&#39;t have to put up with<br/>\n&gt; &gt; any of it and are free.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Your 2 cents worth of experiences with liars and control freaks then<br/>\n&gt; &gt; falls ito the category of heresay, which seemed to merely echo<br/>\n&gt; &gt; society&#39;s claim that it is all hogwash. You granted the some are real<br/>\n&gt; &gt; and some are not. That is true of anything, yet it makes the people in<br/>\n&gt; &gt; the middle even more suspicious that we just make it all up. Perhaps<br/>\n&gt; &gt; research on the subject would give you more insight into the problem. I<br/>\n&gt; &gt; enjoyed the book &quot;Is This Your Child&quot; by Doris Rapp. There are others,<br/>\n&gt; &gt; but this is a good start.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; -=-Saying something &quot;loudly and with feeling&quot; might be<br/>\n&gt; &gt; &gt; asking for help, information or support, but I don&#39;t think ridicule<br/>\n&gt; &gt; &gt; is a helpful path.-=-<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; I don&#39;t ridicule them,&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Not to their face then, just on a list of 600 strangers. Of course that<br/>\n&gt; &gt; was gratuitous and rude of me. Sorry. Not sorry enough to<br/>\n&gt; &gt; delete it though. My bad.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;k -=-Did you lie to her and say you would follow, or had followed, her<br/>\n&gt; &gt; &gt; instructions? -=-<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; No.  (That could only be asked by someone who doesn&#39;t know me very<br/>\n&gt; &gt; well!)<br/>\n&gt; &gt; &gt; I didn&#39;t say a word.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- That is called lying by omission. Of course I have never lied,<br/>\n&gt; &gt; except just then. My bad, again. (pretending it&#39;s humor is no<br/>\n&gt; &gt; excuse for my rudeness)<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; -=-OK too many maybes for this instance, but I say the<br/>\n&gt; &gt; &gt; decision was not yours to make.-=-<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; What decision?  To take the mom&#39;s word that she was a liar?<br/>\n&gt; &gt; &gt; To keep  her son for free?&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- Your decision to ignore her wishes because you thought she was<br/>\n&gt; &gt; wrong.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; k-=- I would be helpful for others to<br/>\n&gt; &gt; &gt; keep an open mind that it could be real. -=-<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; It&#39;s all real.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Some allergies are more real than others.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Then how is it all real if some of it is not? The confusion may be<br/>\n&gt; &gt; real, the searching for answers. It&#39;s hard to remember that most<br/>\n&gt; &gt; people are just trying their best with what they&#39;ve learned so far.<br/>\n&gt; &gt; Helping is more useful than judgment. I know that people don&#39;t<br/>\n&gt; &gt; always want help, but saying what works for us has given other people<br/>\n&gt; &gt; freedom to consider new possibilities.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; k&quot;-=-Many parents have said that their allergic kids feel deprived and<br/>\n&gt; &gt; &gt; binge, others say their kids understand and feel good about taking<br/>\n&gt; &gt; &gt; care<br/>\n&gt; &gt; &gt; of themselves. The bingeing may have more to do with addiction than<br/>\n&gt; &gt; &gt; with<br/>\n&gt; &gt; &gt; social deprivation. -=-&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; By this logic, any teen or adult who rejects the parental<br/>\n&gt; &gt; restrictions when<br/>\n&gt; &gt; &gt; freedom hits and goes ahead and eats wheat or sugar has proven the<br/>\nparent<br/>\n&gt; &gt; &gt; right!  The child WAS an addict, proving that by not continuing the<br/>\nfood<br/>\n&gt; &gt; ban<br/>\n&gt; &gt; &gt; for life?&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- What if the parent was right? What if the parent was wrong? If they<br/>\n&gt; &gt; were right the child may bee in good physical health and really notice<br/>\n&gt; &gt; that the binge made them ill. If they were wrong the child could learn<br/>\n&gt; &gt; that it was not a problem after all. I guess you&#39;re upset that the<br/>\n&gt; &gt; child lost all those years of making their own decisions. I agree with<br/>\n&gt; &gt; that, yet I feel conflict about health and freedom. I don&#39;t think they<br/>\n&gt; &gt; have to be mutually exclusive, yet I am sure the balance is possible.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Are you disagreeing with the idea of addiction? I don&#39;t really know<br/>\n&gt; &gt; what I think of addiction. I am still asking lots of<br/>\n&gt; &gt; questions. There are so many other issues that come up when anyone<br/>\n&gt; &gt; talks about binge foods- self control, will power, stress,<br/>\n&gt; &gt; social pressure. They are related but how can people stop binges?<br/>\n&gt; &gt; Someone here said that they kept some of the foods in the<br/>\n&gt; &gt; house and that stopped the bingeing at friends&#39; houses. So far for us,<br/>\n&gt; &gt; we just binge here instead if I do buy the foods. I am not<br/>\n&gt; &gt; trying to fight with anyone. I am really asking 600 people if they have<br/>\n&gt; &gt; any other thoughts on the subject besides that it doesn&#39;t<br/>\n&gt; &gt; happen to sensible people. This is not a food disorders list, I know<br/>\n&gt; &gt; that. It is a list of curious people though, who don&#39;t always<br/>\n&gt; &gt; follow society&#39;s line, and do find their own answers.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt; -=-Why are the things that are the worst<br/>\n&gt; &gt; &gt; for us considered treats?-=-<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; I don&#39;t know that that&#39;s true.  There are traditional seasonal or<br/>\n&gt; &gt; holiday<br/>\n&gt; &gt; &gt; foods that are not the worst-for-us foods.  It&#39;s rarity that makes a<br/>\n&gt; &gt; treat,<br/>\n&gt; &gt; &gt; not bodily damage.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I guess I am using the word treat the way I hear it used most often.<br/>\n&gt; &gt; &quot;Treat yourself to dessert (daily), have a treat at the store (candy),<br/>\n&gt; &gt; buy a treat at the movies&quot;, all over the place every day, as if you&#39;re<br/>\n&gt; &gt; not normal if you avoid that stuff. If treat only meant rarity that<br/>\n&gt; &gt; wouldn&#39;t be a problem. It&#39;s the on going bombardment of junk foods at<br/>\n&gt; &gt; every house,<br/>\n&gt; &gt; halloween/easter/christmas/valentine&#39;s candy that is passed out all<br/>\n&gt; &gt; over the place, the high fat/sugar/salt diet that is most people&#39;s<br/>\n&gt; &gt; idea if regular food. The idea that to avoid this kind of food is<br/>\n&gt; &gt; unnatural and bad. I&#39;m trying to keep the kids healthy enough to<br/>\n&gt; &gt; learn the difference. If you&#39;re constantly in a drugged state, you<br/>\n&gt; &gt; won&#39;t notice it, but if you are fine until you have the cake and ice<br/>\n&gt; &gt; cream, you&#39;ll learn the connection.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; Without options, a child cannot learn to &quot;develop their own<br/>\n&gt; &gt; choices.&quot;  If the<br/>\n&gt; &gt; &gt; foods are highly restricted, some children will choose to be sneaky or<br/>\n&gt; &gt; eat<br/>\n&gt; &gt; &gt; elsewhere.  They can&#39;t choose fruit over cake if there was no cake<br/>\n&gt; &gt; available.&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- I guess that I don&#39;t highly restrict foods. I don&#39;t buy things that<br/>\n&gt; &gt; are junk because they&#39;re just not food. They are treats that can<br/>\n&gt; &gt; be had once in awhile, but not every day, every week.<br/>\n&gt; &gt;<br/>\n&gt; &gt; My kids turn down junk sometimes, or just have a little. Not because<br/>\n&gt; &gt; I&#39;m hovering over them with a whip, but because they eat<br/>\n&gt; &gt; whatever they want most of the time. I haven&#39;t made any food evil or<br/>\n&gt; &gt; forbidden, just I try not to buy stuff that makes us sick. Is<br/>\n&gt; &gt; that nuts? I really am still learning about all this food stuff.<br/>\n&gt; &gt;<br/>\n&gt; &gt; If you or your own children have never binged, how do you know what&#39;s<br/>\n&gt; &gt; the right thing to do about it? I don&#39;t know myself.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; A child can&#39;t clean his room by his own choice (as Marty did a few<br/>\n&gt; &gt; weeks<br/>\n&gt; &gt; &gt; back--big reorganization) if room cleaning is mandated.  If it is<br/>\n&gt; &gt; mandated on<br/>\n&gt; &gt; &gt; a schedule, the child can ONLY &quot;choose&quot; by choosing not to cooperate.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; My husband&#39;s family of origin set up that kind of &quot;choice&quot;--the &quot;my<br/>\nway<br/>\n&gt; &gt; or<br/>\n&gt; &gt; &gt; the highway&quot; scenario.   We have in full knowledge of our intent set<br/>\nout<br/>\n&gt; &gt; &gt; never to do that to our kids.&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;K-&quot; -=-I think that the best person to determine what freedoms the<br/>\n&gt; &gt; &gt; child is ready for is the observant responsive guardian at first,<br/>\n&gt; &gt; &gt; then gradually as the kid gets more real experience it shifts to the<br/>\nkid.<br/>\n&gt; &gt; -=-&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; My mother in law still tells adults just what to do and how, and<br/>\n&gt; &gt; chortles<br/>\n&gt; &gt; &gt; derisively at anything except &quot;Okay!  right now! Thanks!.&quot;   A notable<br/>\n&gt; &gt; &gt; quote--Kirby was five days or so old when she came to see him, and I<br/>\n&gt; &gt; asked if<br/>\n&gt; &gt; &gt; she wanted to change his diaper (I thought it was a generous, friendly<br/>\n&gt; &gt; thing<br/>\n&gt; &gt; &gt; to offer; she had been a nurse and the mother of three boys).  She<br/>\ncame<br/>\n&gt; &gt; back<br/>\n&gt; &gt; &gt; and said bruskly with no eye contact &quot;You have to get him<br/>\ncircumcised.&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; (And don&#39;t bother to ask if I lied and said I would.)&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- I agree that some people (nosey relatives) are not moved by<br/>\n&gt; &gt; arguments that you are doing the right thing by your best<br/>\n&gt; &gt; available knowledge. Sometimes I just say that (whatever) is working<br/>\n&gt; &gt; well for us and we&#39;re happy thanks.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;k-&quot; -=-I say the lucky parent who follows the child&#39;s true needs will<br/>\n&gt; &gt; raise a more<br/>\n&gt; &gt; &gt; responsible happier person.-=-&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; She was sure that her children truly needed to do what she said<br/>\n&gt; &gt; without<br/>\n&gt; &gt; &gt; hestitation or question until they were out of her house.  Guess how<br/>\n&gt; &gt; quickly<br/>\n&gt; &gt; &gt; they were all out of her house?  Navy, run-away, college in another<br/>\n&gt; &gt; city.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- You snipped away the part where I said what I thought a few of a<br/>\n&gt; &gt; child&#39;s true needs are. Self control, mutual respect,<br/>\n&gt; &gt; accomplishment.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Actually the Navy sounds like another place for someone to be expected<br/>\n&gt; &gt; to do what they&#39;re told without hesitation or question.<br/>\n&gt; &gt; Ironic. A very challenging career is the military. Many people excel<br/>\n&gt; &gt; and serve with honors, and learn very useful skills.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt;k&quot; -=-Anyone who experiences real problems with certain foods is free<br/>\n&gt; &gt; &gt; to choose to avoid them, and to ask that any caregiver follow that<br/>\n&gt; &gt; &gt; choice also. If you are not comfortable with that, then the honest<br/>\nthing<br/>\n&gt; &gt; to<br/>\n&gt; &gt; &gt; do is to decline to watch the kid.-=-&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; I&#39;ve had kids come to visit who, AFTER the parent has left says<br/>\n&gt; &gt; &quot;I&#39;m not allow<br/>\n&gt; &gt; &gt; ed to watch TV,&quot; or &quot;I&#39;m not allowed to play with weapons&quot; or<br/>\nwhatever.<br/>\n&gt; &gt; &gt; Fine!  They can, themselves, avoid such things.  But other than<br/>\ntelling<br/>\n&gt; &gt; my<br/>\n&gt; &gt; &gt; kids it would be nice if they did something else, I have never said<br/>\n&quot;OKAY<br/>\n&gt; &gt; &gt; THEN!  TV ban for everyone!&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- Why not? Is TV sacred? I don&#39;t think TV is evil. Maybe the parent<br/>\n&gt; &gt; meant no violent power rangers stuff, or that they wanted<br/>\n&gt; &gt; them to play instead of veg.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I guess that you don&#39;t want to deprive anybody, or to make your kids<br/>\n&gt; &gt; dread his visit. It&#39;s hard to know when to respect another<br/>\n&gt; &gt; parent&#39;s wishes or not.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; If parents want to leave their children at my house but they don&#39;t<br/>\n&gt; &gt; like my<br/>\n&gt; &gt; &gt; rules (and I&#39;m not talking about peanuts) they shouldn&#39;t leave them<br/>\n&gt; &gt; there.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- Maybe they aren&#39;t aware of that your rules come before theirs, or<br/>\n&gt; &gt; that there&#39;s any difference.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; If I took money to watch other people&#39;s kids then I&#39;d negotiate.<br/>\n&gt; &gt; But there&#39;s<br/>\n&gt; &gt; &gt; not enough money in the world to get me to lie to kids and say &quot;You<br/>\ncan&#39;t<br/>\n&gt; &gt; &gt; have this because it&#39;s bad for you&quot; if I don&#39;t believe it.  There&#39;s<br/>\nnot<br/>\n&gt; &gt; &gt; enough money to get me to control other people&#39;s kids arbitrarily just<br/>\n&gt; &gt; &gt; because the parents would like to do it but they want to go and do<br/>\n&gt; &gt; something<br/>\n&gt; &gt; &gt; else for a while.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- Then you would not negotiate. Money has nothing to do with it. They<br/>\n&gt; &gt; don&#39;t owe you anything if you agreed to watch the kids<br/>\n&gt; &gt; for free. It doesn&#39;t make you better than them. If you don&#39;t like their<br/>\n&gt; &gt; restrictions on their kids, maybe you can help nurture the<br/>\n&gt; &gt; kids in other ways.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;k-&quot; I think that as curious<br/>\n&gt; &gt; &gt; homeschoolers all topics can be up for discussion as they relate to<br/>\n&gt; &gt; &gt; life, science, health, and personal empowerment through healthy<br/>\n&gt; &gt; &gt; discussion.-=-&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; I&#39;m thinking some people might be suffering a bad reaction to the<br/>\n&gt; &gt; discussion.<br/>\n&gt; &gt; &gt; Who decides if it&#39;s healthy?&quot;&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- I would imagine that if anyone is suffering a bad reaction to this<br/>\n&gt; &gt; discussion they are free to say so. That&#39;s the healthy part.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; It seemed to me that the tone of the suggestion was more that<br/>\n&gt; &gt; those who allow<br/>\n&gt; &gt; &gt; their children freedom (not just of food) are neglectful, but those<br/>\nwho<br/>\n&gt; &gt; are<br/>\n&gt; &gt; &gt; being controlling are being responsible.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- My original post was about parents of children with allergies, not<br/>\n&gt; &gt; all parents. I think that all parents, with or without allergies,<br/>\n&gt; &gt; allow as much freedom as they think is safe. I hope like you do that<br/>\n&gt; &gt; they will base their judgments on their own children&#39;s&#39; needs<br/>\n&gt; &gt; and abilities, not on the fears or failings of the adult.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; S-&quot;&gt; Maybe there should be an unschooling with allergies list.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; I think we are free to make one. I also think it is not necessary to<br/>\n&gt; &gt; push a topic off to a separate list right away. Many things are<br/>\n&gt; &gt; discussed here, even the weather. I will not keep beating this though.<br/>\n&gt; &gt; The question is out there, any replies would be interesting,<br/>\n&gt; &gt; but I will not ask it again.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; k &quot;-=-You are free to say that you feel allergies are just an<br/>\n&gt; &gt; &gt; excuse<br/>\n&gt; &gt; &gt; for poor parenting and restricting freedom, and I am free to suggest<br/>\n&gt; &gt; &gt; that they could be real for some, and for everyone to do their own<br/>\n&gt; &gt; &gt; research.-=-&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S- &quot;&gt; YES but I didn&#39;t say that.  So you&#39;ve paraphrased me wrongly and<br/>\n&gt; &gt; addressed<br/>\n&gt; &gt; &gt; that.  It&#39;s called attacking a straw man.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- I&#39;ve addressed everything else point by point, in exhausting detail<br/>\n&gt; &gt; to both of your posts. Sorry that I chucked all my feelings<br/>\n&gt; &gt; together into the straw man.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; K- &quot;-=-I guess you could live in a remote hut completely free of any<br/>\n&gt; &gt; social<br/>\n&gt; &gt; &gt; ties, or restrictions on your freedom.<br/>\n&gt; &gt; &gt; -=-I would miss you if you lived in a hut.-=-&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S- &quot;&gt; How can you tell who lives in remote huts and who doesn&#39;t by e-<br/>\n&gt; &gt; mail?&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- I can tell by the content that you are not alone in a hut with a<br/>\n&gt; &gt; satellite connection. No one who writes to as many posts as you do has<br/>\n&gt; &gt; any desire to be alone.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; S- &quot;&gt; I&#39;m not free of social ties, and I arrange for my kids to have a<br/>\n&gt; &gt; lot of<br/>\n&gt; &gt; &gt; freedom.  Free to come or go, they stay here and their friends do,<br/>\n&gt; &gt; too.Free<br/>\n&gt; &gt; &gt; to go to school or not, they don&#39;t.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- I am curious, would you send your kids to school if they begged? How<br/>\n&gt; &gt; old are they. What have you told them about school<br/>\n&gt; &gt; that could influence their decision. I have told my kids when they<br/>\n&gt; &gt; asked how I felt about my time at school. That may have<br/>\n&gt; &gt; influenced them some, for better or worse.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; S- &quot;Free to eat what they want, they eat an<br/>\n&gt; &gt; &gt; amazingly balanced diet.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- Do they shop with you and help plan the meals? I think that is<br/>\n&gt; &gt; important to have freedom of choice. Do you cook or do they?<br/>\n&gt; &gt; Do you all sit down for one meal a day? We do sometimes. Do you take<br/>\n&gt; &gt; turns planning the meals, or do you just graze. We graze<br/>\n&gt; &gt; alot.<br/>\n&gt; &gt;<br/>\n&gt; &gt; S- &quot;Free to stay up or sleep, they sleep every single<br/>\n&gt; &gt; &gt; night.&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- Again I think that could depend on the age. Mine are still too<br/>\n&gt; &gt; little to be up without me. We all sleep together though, so<br/>\n&gt; &gt; bedtime is a nice cozy thing.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; -=-S-&quot;&gt; Nobody&#39;s going to scrape peanut butter, or an idea, off their<br/>\n&gt; &gt; &gt; keyboard and die.  (Or if they do, the peanut butter will not have<br/>\n&gt; &gt; arrived by<br/>\n&gt; &gt; &gt; e-mail.)<br/>\n&gt; &gt; &gt; &gt;<br/>\n&gt; &gt; &gt; &gt; Sandra&quot;<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; -=-K- Now that&#39;s just thoughtless. In an earlier post someone said<br/>\nthat<br/>\n&gt; &gt; &gt; they admired that you &quot;wrote from the soul&quot;. I would like to see some<br/>\n&gt; &gt; &gt; of that.-=-<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; S- &quot;&gt; It wasn&#39;t thoughtless in any way.  If you haven&#39;t &quot;seen some of<br/>\n&gt; &gt; that,&quot; you<br/>\n&gt; &gt; &gt; don&#39;t know my writing well enough to decide whether it&#39;s &quot;from the<br/>\nsoul&quot;<br/>\n&gt; &gt; or<br/>\n&gt; &gt; &gt; not.   And you will never know my voice well enough to be the judge of<br/>\n&gt; &gt; &gt; whether I was sincere or thoughtful.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Assume I&#39;m sincere and thoughtful, and if you&#39;re too bothered by the<br/>\n&gt; &gt; writing,<br/>\n&gt; &gt; &gt; don&#39;t read it.  I don&#39;t want to stop writing because it&#39;s disturbing<br/>\ntwo<br/>\n&gt; &gt; or<br/>\n&gt; &gt; &gt; three of several hundred people.<br/>\n&gt; &gt; &gt;<br/>\n&gt; &gt; &gt; Sandra&quot;<br/>\n&gt; &gt;<br/>\n&gt; &gt; K- Agreed. We will both assume that we&#39;re sincere and thoughtful. I<br/>\n&gt; &gt; thought that you could tell by my detailed posts that I thought<br/>\n&gt; &gt; you were already.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Of course you will not stop writing, I&#39;m sure that has not been<br/>\n&gt; &gt; requested.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I did expect that making a joke about people dying from peanut butter<br/>\n&gt; &gt; on the keyboard would be thought of as unfeeling before<br/>\n&gt; &gt; you sent it. That is what I meant about thoughtless. I am being too<br/>\n&gt; &gt; literal for most, but it isn&#39;t a joke really. I suppose I have no<br/>\n&gt; &gt; sense of humor for that kind of humor. It wasn&#39;t a joke about really<br/>\n&gt; &gt; dying of course, but it was an &quot;I don&#39;t care about any whiny<br/>\n&gt; &gt; problems because they exaggerate everything&quot; type of feeling. If that<br/>\n&gt; &gt; was not your intent, then my apologies.<br/>\n&gt; &gt;<br/>\n&gt; &gt; For all my verbosity it may be hard to imagine that I am quite new to<br/>\n&gt; &gt; this list. I have only been on for a couple of weeks I think. I<br/>\n&gt; &gt; admit that I haven&#39;t followed enough of your posts on other topics to<br/>\n&gt; &gt; know your writing well at all. All I know is what I&#39;ve seen<br/>\n&gt; &gt; in your replies to my post.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Every list has its personalities, occasional posters, and lurkers.<br/>\n&gt; &gt;<br/>\n&gt; &gt; I am interested in responses from others as well, but I fear they are<br/>\n&gt; &gt; not interested in this continuing saga, and I have put them<br/>\n&gt; &gt; off.<br/>\n&gt; &gt;<br/>\n&gt; &gt; And so ends the Kathy show. We now return you to your regularly<br/>\n&gt; &gt; scheduled programs, with the occasional weather report.<br/>\n&gt; &gt;<br/>\n&gt; &gt; Kathy B.<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; &gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; &gt;<br/>\n&gt; &gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n&gt; &gt;<br/>\n&gt; &gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; Your use of Yahoo! Groups is subject to<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt; ----------------------- Headers --------------------------------<br/>\n&gt; &gt; Return-Path: &lt;<br/>\n&gt; &gt;<br/>\nsentto-156027-28304-1006194062-JMavredakis=<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aol.com@...\">aol.com@...</a>&gt;<br/>\n&gt; &gt; Received: from  rly-za05.mx.aol.com (rly-za05.mail.aol.com<br/>\n[172.31.36.101])<br/>\n&gt; &gt; by air-za04.mail.aol.com (v82.22) with ESMTP id MAILINZA45-1119132326;<br/>\nMon,<br/>\n&gt; &gt; 19 Nov 2001 13:23:26 -0500<br/>\n&gt; &gt; Received: from  n26.groups.yahoo.com (n26.groups.yahoo.com<br/>\n[216.115.96.76])<br/>\n&gt; &gt; by rly-za05.mx.aol.com (v82.22) with ESMTP id<br/>\nMAILRELAYINZA510-1119132255;<br/>\n&gt; &gt; Mon, 19 Nov 2001 13:22:55 -0500<br/>\n&gt; &gt; X-eGroups-Return:<br/>\n&gt; &gt;<br/>\nsentto-156027-28304-1006194062-JMavredakis=<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aol.com@...\">aol.com@...</a><br/>\n&gt; &gt; Received: from [10.1.4.56] by n26.groups.yahoo.com with NNFMP; 19 Nov<br/>\n2001<br/>\n&gt; &gt; 18:18:38 -0000<br/>\n&gt; &gt; X-Sender: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:laurawilder82@...\">laurawilder82@...</a><br/>\n&gt; &gt; X-Apparently-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt; &gt; Received: (EGP: mail-8_0_0_1); 19 Nov 2001 18:21:02 -0000<br/>\n&gt; &gt; Received: (qmail 72740 invoked from network); 19 Nov 2001 18:21:00 -0000<br/>\n&gt; &gt; Received: from unknown (216.115.97.171)<br/>\n&gt; &gt;   by m12.grp.snv.yahoo.com with QMQP; 19 Nov 2001 18:21:00 -0000<br/>\n&gt; &gt; Received: from unknown (HELO n9.groups.yahoo.com) (216.115.96.59)<br/>\n&gt; &gt;   by mta3.grp.snv.yahoo.com with SMTP; 19 Nov 2001 18:20:58 -0000<br/>\n&gt; &gt; X-eGroups-Return: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:laurawilder82@...\">laurawilder82@...</a><br/>\n&gt; &gt; Received: from [10.1.10.121] by n9.groups.yahoo.com with NNFMP; 19 Nov<br/>\n2001<br/>\n&gt; &gt; 18:20:58 -0000<br/>\n&gt; &gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt; &gt; Message-ID: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:9tbii6+vj90@...\">9tbii6+vj90@...</a>&gt;<br/>\n&gt; &gt; In-Reply-To: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:12f.7c1cbcc.292a79b0@...\">12f.7c1cbcc.292a79b0@...</a>&gt;<br/>\n&gt; &gt; User-Agent: eGroups-EW/0.82<br/>\n&gt; &gt; X-Mailer: eGroups Message Poster<br/>\n&gt; &gt; X-Originating-IP: 209.183.70.71<br/>\n&gt; &gt; From: &quot;Kathy&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:laurawilder82@...\">laurawilder82@...</a>&gt;<br/>\n&gt; &gt; X-Yahoo-Profile: laurawilder82<br/>\n&gt; &gt; MIME-Version: 1.0<br/>\n&gt; &gt; Mailing-List: list <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>; contact<br/>\n&gt; &gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-owner@yahoogroups.com\">Unschooling-dotcom-owner@yahoogroups.com</a><br/>\n&gt; &gt; Delivered-To: mailing list <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt; &gt; Precedence: bulk<br/>\n&gt; &gt; List-Unsubscribe:<br/>\n&lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a>&gt;<br/>\n&gt; &gt; Date: Mon, 19 Nov 2001 18:20:54 -0000<br/>\n&gt; &gt; Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt; &gt; Subject: [Unschooling-dotcom] the Kathy and Sandra Show, episode 3<br/>\n&quot;Mutual<br/>\n&gt; &gt; Respect&quot; (hopefully)<br/>\n&gt; &gt; Content-Type: text/plain; charset=US-ASCII<br/>\n&gt; &gt; Content-Transfer-Encoding: 7bit<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt; &gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt;<br/>\n&gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n&gt;<br/>\n&gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a><br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a><br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"JMavredakis@aol.com","from":"JMavredakis@...","profile":"jdqm","replyTo":"LIST","senderId":"cOnsPJKpfg6BSuVAeDcrRvCEaKjP6z4tgql1rAKIScm7qSBCH5TfjB5pctqeQZJZNp3PUr92-Einhg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"the &#39;not so allergic&#39; child....","postDate":"1006307350","msgId":28177,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMxLjFlMDc1ZTUwLjI5MmM2MjE2QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":28250,"prevInTime":28176,"nextInTime":28178,"topicId":28177,"numMessagesInTopic":0,"msgSnippet":"OK, i realize i am entering this topic late, but i have to interject. i have written this over several times, and i considered not sending it but i feel its","messageBody":"<div id=\"ygrps-yiv-143805555\">OK, i realize i am entering this topic late, but i have to interject. i have <br/>\nwritten this over several times, and i considered not sending it but i feel <br/>\nits importance.<br/>\ni have a wonderful 3 year old son. he is PDD which stands for Pervasive <br/>\nDevelopmental Delay. It is a disorder on the autism spectrum if that helps <br/>\nyou visualize.<br/>\nmy Niko is a wonderful, non-verbal, child. he can&#39;t tell you dairy hurts. he <br/>\ncraves milk and all dairy. he would eat it 24/7 if he was given the chance.  <br/>\nwhen dairy is removed from his diet, you would never even believe he was <br/>\nautistic, yet one tiny infraction and anyone can tell immediately! if he has <br/>\nany, even that tiny bit that well meaning loved ones give on the sly,  he <br/>\nwill withdraw from society. he becomes a whiny, crying, bloated and gassy, <br/>\nmiserable child. He tantrums (do you blame him, it hurts). this poisoned <br/>\nchild!! (see below for reasoning on that one) who is looked at by others as a <br/>\ntypical *terrible* 3&#39;s child. if you did not know his dietary intervention <br/>\nyou could possibly believe the transformation was willful. he is far from <br/>\nwillful!! he is the most easygoing person i have ever met.<br/>\n is  he allergic according to the true definition?<br/>\n no.<br/>\n do i tell everyone he is allergic?<br/>\n yes.<br/>\n for the simple reason, that when i sit and explain that dairy causes a <br/>\nchemical imbalance in him because of a lacking enzyme in his body, and it <br/>\nwill cause him to &quot;trip&quot; as if on LSD and he will be a monster for several <br/>\ndays after that one tiny cookie/chocolate/treat that person will invariably <br/>\nsay &quot;so you mean he is allergic&quot; after shaking their head at my verbiage. and <br/>\nof course they think IM nuts. <br/>\n<br/>\nas far as what i expect others to do if taking care of him, it is not the <br/>\neasiest thing to do to send him out with his own snacks. (you would not <br/>\nbelieve how many things have hidden dry milk as an ingredient listed as <br/>\nsomething else. casin, lecithin.. etc.) but i do not expect everyone to read <br/>\nall labels and make as many phone calls to manufacturers as i do. so he goes <br/>\nwith snacks, and I ask who is in charge to make sure he is not drinking or <br/>\neating anything he is not given by me.  sorry for this long winded reply, but <br/>\nthe statement that you gave a child milk and he had no reaction shows me that <br/>\nyou were not really listening to this Mom.                     once admitted <br/>\nto someone that Niko was not really allergic, tried to explain, but she heard <br/>\n&quot;not allergic really&quot; and she gave him some ice cream.  he was fine for <br/>\nseveral hours, and she may have thought that i was a liar. however, he did <br/>\nnot  sleep for a week and neither did I. <br/>\nJoy <br/>\nMom to <br/>\nAndrew  11/29/94 too smart for me to keep up with<br/>\nAnastasia  8/8/96 the princess!!<br/>\nNicholas 6/21/98 my PDD child who loves to make me smile!!<br/>\nMichael 6/21/00 such an imp you ever saw<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; Final episode on this topic for me, Sandra is of course wanted to share <br/>\n&gt; her thoughts as well. <br/>\n&gt; <br/>\n&gt; I would like to be respectful, but I am not always that bright. I do <br/>\n&gt; want her to be herself, and I hope she can see that sometimes<br/>\n&gt; what seems like an argument, can really be two people who agree on the <br/>\n&gt; basics, but not always the terminology. We both want<br/>\n&gt; thoughtful caring adults to raise independent healthy children. We <br/>\n&gt; don&#39;t like hypocrites, control freaks, or labeling people (yes<br/>\n&gt; joke). We want our kids to learn to make their own decisions, and for <br/>\n&gt; them to decide what&#39;s best for themselves. <br/>\n&gt; <br/>\n&gt; here goes. I am again the K, and Sandra will be played by the letter S. <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; S-&quot;&gt; How is &#39;no personal experience&quot; true?  Because I don&#39;t have a <br/>\n&gt; child with <br/>\n&gt; &gt; allergies?&quot; <br/>\n&gt; <br/>\n&gt; K- I think that is the definition I was thinking of. Also that you have <br/>\n&gt; not mentioned any personal (as in you personally) experience with food <br/>\n&gt; reactions of your own. I am happy that you don&#39;t have to put up with <br/>\n&gt; any of it and are free. <br/>\n&gt; <br/>\n&gt; Your 2 cents worth of experiences with liars and control freaks then <br/>\n&gt; falls ito the category of heresay, which seemed to merely echo <br/>\n&gt; society&#39;s claim that it is all hogwash. You granted the some are real <br/>\n&gt; and some are not. That is true of anything, yet it makes the people in <br/>\n&gt; the middle even more suspicious that we just make it all up. Perhaps <br/>\n&gt; research on the subject would give you more insight into the problem. I <br/>\n&gt; enjoyed the book &quot;Is This Your Child&quot; by Doris Rapp. There are others, <br/>\n&gt; but this is a good start.<br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; &gt; -=-Saying something &quot;loudly and with feeling&quot; might be <br/>\n&gt; &gt; asking for help, information or support, but I don&#39;t think ridicule <br/>\n&gt; &gt; is a helpful path.-=- <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; I don&#39;t ridicule them,&quot; <br/>\n&gt; <br/>\n&gt; Not to their face then, just on a list of 600 strangers. Of course that <br/>\n&gt; was gratuitous and rude of me. Sorry. Not sorry enough to<br/>\n&gt; delete it though. My bad. <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt;k -=-Did you lie to her and say you would follow, or had followed, her <br/>\n&gt; &gt; instructions? -=- <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; No.  (That could only be asked by someone who doesn&#39;t know me very <br/>\n&gt; well!) <br/>\n&gt; &gt; I didn&#39;t say a word.&quot; <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; K- That is called lying by omission. Of course I have never lied, <br/>\n&gt; except just then. My bad, again. (pretending it&#39;s humor is no<br/>\n&gt; excuse for my rudeness) <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; &gt; -=-OK too many maybes for this instance, but I say the <br/>\n&gt; &gt; decision was not yours to make.-=- <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; What decision?  To take the mom&#39;s word that she was a liar? <br/>\n&gt; &gt; To keep  her son for free?&quot; <br/>\n&gt; <br/>\n&gt; K- Your decision to ignore her wishes because you thought she was <br/>\n&gt; wrong. <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; &gt; k-=- I would be helpful for others to <br/>\n&gt; &gt; keep an open mind that it could be real. -=- <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; It&#39;s all real. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Some allergies are more real than others.&quot; <br/>\n&gt; <br/>\n&gt; Then how is it all real if some of it is not? The confusion may be <br/>\n&gt; real, the searching for answers. It&#39;s hard to remember that most<br/>\n&gt; people are just trying their best with what they&#39;ve learned so far. <br/>\n&gt; Helping is more useful than judgment. I know that people don&#39;t<br/>\n&gt; always want help, but saying what works for us has given other people <br/>\n&gt; freedom to consider new possibilities. <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; k&quot;-=-Many parents have said that their allergic kids feel deprived and <br/>\n&gt; &gt; binge, others say their kids understand and feel good about taking <br/>\n&gt; &gt; care <br/>\n&gt; &gt; of themselves. The bingeing may have more to do with addiction than <br/>\n&gt; &gt; with <br/>\n&gt; &gt; social deprivation. -=-&quot; <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; By this logic, any teen or adult who rejects the parental <br/>\n&gt; restrictions when <br/>\n&gt; &gt; freedom hits and goes ahead and eats wheat or sugar has proven the parent <br/>\n&gt; &gt; right!  The child WAS an addict, proving that by not continuing the food <br/>\n&gt; ban <br/>\n&gt; &gt; for life?&quot; <br/>\n&gt; <br/>\n&gt; K- What if the parent was right? What if the parent was wrong? If they <br/>\n&gt; were right the child may bee in good physical health and really notice <br/>\n&gt; that the binge made them ill. If they were wrong the child could learn <br/>\n&gt; that it was not a problem after all. I guess you&#39;re upset that the <br/>\n&gt; child lost all those years of making their own decisions. I agree with <br/>\n&gt; that, yet I feel conflict about health and freedom. I don&#39;t think they <br/>\n&gt; have to be mutually exclusive, yet I am sure the balance is possible.<br/>\n&gt; <br/>\n&gt; Are you disagreeing with the idea of addiction? I don&#39;t really know <br/>\n&gt; what I think of addiction. I am still asking lots of<br/>\n&gt; questions. There are so many other issues that come up when anyone <br/>\n&gt; talks about binge foods- self control, will power, stress,<br/>\n&gt; social pressure. They are related but how can people stop binges? <br/>\n&gt; Someone here said that they kept some of the foods in the<br/>\n&gt; house and that stopped the bingeing at friends&#39; houses. So far for us, <br/>\n&gt; we just binge here instead if I do buy the foods. I am not<br/>\n&gt; trying to fight with anyone. I am really asking 600 people if they have <br/>\n&gt; any other thoughts on the subject besides that it doesn&#39;t<br/>\n&gt; happen to sensible people. This is not a food disorders list, I know <br/>\n&gt; that. It is a list of curious people though, who don&#39;t always<br/>\n&gt; follow society&#39;s line, and do find their own answers. <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; &gt; -=-Why are the things that are the worst <br/>\n&gt; &gt; for us considered treats?-=- <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; I don&#39;t know that that&#39;s true.  There are traditional seasonal or <br/>\n&gt; holiday <br/>\n&gt; &gt; foods that are not the worst-for-us foods.  It&#39;s rarity that makes a <br/>\n&gt; treat, <br/>\n&gt; &gt; not bodily damage.&quot; <br/>\n&gt; <br/>\n&gt; I guess I am using the word treat the way I hear it used most often. <br/>\n&gt; &quot;Treat yourself to dessert (daily), have a treat at the store (candy), <br/>\n&gt; buy a treat at the movies&quot;, all over the place every day, as if you&#39;re <br/>\n&gt; not normal if you avoid that stuff. If treat only meant rarity that <br/>\n&gt; wouldn&#39;t be a problem. It&#39;s the on going bombardment of junk foods at <br/>\n&gt; every house,<br/>\n&gt; halloween/easter/christmas/valentine&#39;s candy that is passed out all <br/>\n&gt; over the place, the high fat/sugar/salt diet that is most people&#39;s<br/>\n&gt; idea if regular food. The idea that to avoid this kind of food is <br/>\n&gt; unnatural and bad. I&#39;m trying to keep the kids healthy enough to<br/>\n&gt; learn the difference. If you&#39;re constantly in a drugged state, you <br/>\n&gt; won&#39;t notice it, but if you are fine until you have the cake and ice<br/>\n&gt; cream, you&#39;ll learn the connection. <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; Without options, a child cannot learn to &quot;develop their own <br/>\n&gt; choices.&quot;  If the <br/>\n&gt; &gt; foods are highly restricted, some children will choose to be sneaky or <br/>\n&gt; eat <br/>\n&gt; &gt; elsewhere.  They can&#39;t choose fruit over cake if there was no cake <br/>\n&gt; available.&quot; <br/>\n&gt; &gt; <br/>\n&gt; <br/>\n&gt; K- I guess that I don&#39;t highly restrict foods. I don&#39;t buy things that <br/>\n&gt; are junk because they&#39;re just not food. They are treats that can<br/>\n&gt; be had once in awhile, but not every day, every week. <br/>\n&gt; <br/>\n&gt; My kids turn down junk sometimes, or just have a little. Not because <br/>\n&gt; I&#39;m hovering over them with a whip, but because they eat<br/>\n&gt; whatever they want most of the time. I haven&#39;t made any food evil or <br/>\n&gt; forbidden, just I try not to buy stuff that makes us sick. Is<br/>\n&gt; that nuts? I really am still learning about all this food stuff. <br/>\n&gt; <br/>\n&gt; If you or your own children have never binged, how do you know what&#39;s <br/>\n&gt; the right thing to do about it? I don&#39;t know myself. <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; S-&quot;&gt; A child can&#39;t clean his room by his own choice (as Marty did a few <br/>\n&gt; weeks <br/>\n&gt; &gt; back--big reorganization) if room cleaning is mandated.  If it is <br/>\n&gt; mandated on <br/>\n&gt; &gt; a schedule, the child can ONLY &quot;choose&quot; by choosing not to cooperate. <br/>\n&gt; &gt; <br/>\n&gt; &gt; My husband&#39;s family of origin set up that kind of &quot;choice&quot;--the &quot;my way <br/>\n&gt; or <br/>\n&gt; &gt; the highway&quot; scenario.   We have in full knowledge of our intent set out <br/>\n&gt; &gt; never to do that to our kids.&quot; <br/>\n&gt; &gt; <br/>\n&gt; &gt;K-&quot; -=-I think that the best person to determine what freedoms the <br/>\n&gt; &gt; child is ready for is the observant responsive guardian at first, <br/>\n&gt; &gt; then gradually as the kid gets more real experience it shifts to the kid. <br/>\n&gt; -=-&quot; <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; My mother in law still tells adults just what to do and how, and <br/>\n&gt; chortles <br/>\n&gt; &gt; derisively at anything except &quot;Okay!  right now! Thanks!.&quot;   A notable <br/>\n&gt; &gt; quote--Kirby was five days or so old when she came to see him, and I <br/>\n&gt; asked if <br/>\n&gt; &gt; she wanted to change his diaper (I thought it was a generous, friendly <br/>\n&gt; thing <br/>\n&gt; &gt; to offer; she had been a nurse and the mother of three boys).  She came <br/>\n&gt; back <br/>\n&gt; &gt; and said bruskly with no eye contact &quot;You have to get him circumcised.&quot; <br/>\n&gt; &gt; <br/>\n&gt; &gt; (And don&#39;t bother to ask if I lied and said I would.)&quot; <br/>\n&gt; <br/>\n&gt; K- I agree that some people (nosey relatives) are not moved by <br/>\n&gt; arguments that you are doing the right thing by your best<br/>\n&gt; available knowledge. Sometimes I just say that (whatever) is working <br/>\n&gt; well for us and we&#39;re happy thanks. <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt;k-&quot; -=-I say the lucky parent who follows the child&#39;s true needs will <br/>\n&gt; raise a more <br/>\n&gt; &gt; responsible happier person.-=-&quot; <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; She was sure that her children truly needed to do what she said <br/>\n&gt; without <br/>\n&gt; &gt; hestitation or question until they were out of her house.  Guess how <br/>\n&gt; quickly <br/>\n&gt; &gt; they were all out of her house?  Navy, run-away, college in another <br/>\n&gt; city.&quot; <br/>\n&gt; <br/>\n&gt; K- You snipped away the part where I said what I thought a few of a <br/>\n&gt; child&#39;s true needs are. Self control, mutual respect,<br/>\n&gt; accomplishment. <br/>\n&gt; <br/>\n&gt; Actually the Navy sounds like another place for someone to be expected <br/>\n&gt; to do what they&#39;re told without hesitation or question.<br/>\n&gt; Ironic. A very challenging career is the military. Many people excel <br/>\n&gt; and serve with honors, and learn very useful skills. <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt;k&quot; -=-Anyone who experiences real problems with certain foods is free <br/>\n&gt; &gt; to choose to avoid them, and to ask that any caregiver follow that <br/>\n&gt; &gt; choice also. If you are not comfortable with that, then the honest thing <br/>\n&gt; to <br/>\n&gt; &gt; do is to decline to watch the kid.-=-&quot; <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; I&#39;ve had kids come to visit who, AFTER the parent has left says <br/>\n&gt; &quot;I&#39;m not allow <br/>\n&gt; &gt; ed to watch TV,&quot; or &quot;I&#39;m not allowed to play with weapons&quot; or whatever. <br/>\n&gt; &gt; Fine!  They can, themselves, avoid such things.  But other than telling <br/>\n&gt; my <br/>\n&gt; &gt; kids it would be nice if they did something else, I have never said &quot;OKAY <br/>\n&gt; &gt; THEN!  TV ban for everyone!&quot; <br/>\n&gt; <br/>\n&gt; K- Why not? Is TV sacred? I don&#39;t think TV is evil. Maybe the parent <br/>\n&gt; meant no violent power rangers stuff, or that they wanted<br/>\n&gt; them to play instead of veg. <br/>\n&gt; <br/>\n&gt; I guess that you don&#39;t want to deprive anybody, or to make your kids <br/>\n&gt; dread his visit. It&#39;s hard to know when to respect another<br/>\n&gt; parent&#39;s wishes or not. <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; S-&quot;&gt; If parents want to leave their children at my house but they don&#39;t <br/>\n&gt; like my <br/>\n&gt; &gt; rules (and I&#39;m not talking about peanuts) they shouldn&#39;t leave them <br/>\n&gt; there.&quot; <br/>\n&gt; <br/>\n&gt; K- Maybe they aren&#39;t aware of that your rules come before theirs, or <br/>\n&gt; that there&#39;s any difference. <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; S-&quot;&gt; If I took money to watch other people&#39;s kids then I&#39;d negotiate.  <br/>\n&gt; But there&#39;s <br/>\n&gt; &gt; not enough money in the world to get me to lie to kids and say &quot;You can&#39;t <br/>\n&gt; &gt; have this because it&#39;s bad for you&quot; if I don&#39;t believe it.  There&#39;s not <br/>\n&gt; &gt; enough money to get me to control other people&#39;s kids arbitrarily just <br/>\n&gt; &gt; because the parents would like to do it but they want to go and do <br/>\n&gt; something <br/>\n&gt; &gt; else for a while.&quot; <br/>\n&gt; <br/>\n&gt; K- Then you would not negotiate. Money has nothing to do with it. They <br/>\n&gt; don&#39;t owe you anything if you agreed to watch the kids<br/>\n&gt; for free. It doesn&#39;t make you better than them. If you don&#39;t like their <br/>\n&gt; restrictions on their kids, maybe you can help nurture the<br/>\n&gt; kids in other ways. <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; &gt;k-&quot; I think that as curious <br/>\n&gt; &gt; homeschoolers all topics can be up for discussion as they relate to <br/>\n&gt; &gt; life, science, health, and personal empowerment through healthy <br/>\n&gt; &gt; discussion.-=-&quot; <br/>\n&gt; &gt; <br/>\n&gt; S-&quot;&gt; I&#39;m thinking some people might be suffering a bad reaction to the <br/>\n&gt; discussion. <br/>\n&gt; &gt; Who decides if it&#39;s healthy?&quot;&quot; <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; K- I would imagine that if anyone is suffering a bad reaction to this <br/>\n&gt; discussion they are free to say so. That&#39;s the healthy part. <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; S-&quot;&gt; It seemed to me that the tone of the suggestion was more that <br/>\n&gt; those who allow <br/>\n&gt; &gt; their children freedom (not just of food) are neglectful, but those who <br/>\n&gt; are <br/>\n&gt; &gt; being controlling are being responsible.&quot; <br/>\n&gt; <br/>\n&gt; K- My original post was about parents of children with allergies, not <br/>\n&gt; all parents. I think that all parents, with or without allergies,<br/>\n&gt; allow as much freedom as they think is safe. I hope like you do that <br/>\n&gt; they will base their judgments on their own children&#39;s&#39; needs<br/>\n&gt; and abilities, not on the fears or failings of the adult. <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt; S-&quot;&gt; Maybe there should be an unschooling with allergies list.&quot; <br/>\n&gt; <br/>\n&gt; I think we are free to make one. I also think it is not necessary to <br/>\n&gt; push a topic off to a separate list right away. Many things are<br/>\n&gt; discussed here, even the weather. I will not keep beating this though. <br/>\n&gt; The question is out there, any replies would be interesting,<br/>\n&gt; but I will not ask it again. <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; k &quot;-=-You are free to say that you feel allergies are just an <br/>\n&gt; &gt; excuse <br/>\n&gt; &gt; for poor parenting and restricting freedom, and I am free to suggest <br/>\n&gt; &gt; that they could be real for some, and for everyone to do their own <br/>\n&gt; &gt; research.-=-&quot; <br/>\n&gt; &gt; <br/>\n&gt; S- &quot;&gt; YES but I didn&#39;t say that.  So you&#39;ve paraphrased me wrongly and <br/>\n&gt; addressed <br/>\n&gt; &gt; that.  It&#39;s called attacking a straw man.&quot; <br/>\n&gt; <br/>\n&gt; K- I&#39;ve addressed everything else point by point, in exhausting detail <br/>\n&gt; to both of your posts. Sorry that I chucked all my feelings<br/>\n&gt; together into the straw man. <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; &gt; <br/>\n&gt; &gt; K- &quot;-=-I guess you could live in a remote hut completely free of any <br/>\n&gt; social <br/>\n&gt; &gt; ties, or restrictions on your freedom. <br/>\n&gt; &gt; -=-I would miss you if you lived in a hut.-=-&quot; <br/>\n&gt; &gt; <br/>\n&gt; S- &quot;&gt; How can you tell who lives in remote huts and who doesn&#39;t by e-<br/>\n&gt; mail?&quot; <br/>\n&gt; <br/>\n&gt; K- I can tell by the content that you are not alone in a hut with a <br/>\n&gt; satellite connection. No one who writes to as many posts as you do has <br/>\n&gt; any desire to be alone.<br/>\n&gt;   <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; S- &quot;&gt; I&#39;m not free of social ties, and I arrange for my kids to have a <br/>\n&gt; lot of <br/>\n&gt; &gt; freedom.  Free to come or go, they stay here and their friends do, <br/>\n&gt; too.Free <br/>\n&gt; &gt; to go to school or not, they don&#39;t.&quot; <br/>\n&gt; <br/>\n&gt; K- I am curious, would you send your kids to school if they begged? How <br/>\n&gt; old are they. What have you told them about school<br/>\n&gt; that could influence their decision. I have told my kids when they <br/>\n&gt; asked how I felt about my time at school. That may have<br/>\n&gt; influenced them some, for better or worse. <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; S- &quot;Free to eat what they want, they eat an <br/>\n&gt; &gt; amazingly balanced diet.&quot; <br/>\n&gt; <br/>\n&gt; K- Do they shop with you and help plan the meals? I think that is <br/>\n&gt; important to have freedom of choice. Do you cook or do they?<br/>\n&gt; Do you all sit down for one meal a day? We do sometimes. Do you take <br/>\n&gt; turns planning the meals, or do you just graze. We graze<br/>\n&gt; alot. <br/>\n&gt; <br/>\n&gt; S- &quot;Free to stay up or sleep, they sleep every single <br/>\n&gt; &gt; night.&quot; <br/>\n&gt; <br/>\n&gt; K- Again I think that could depend on the age. Mine are still too <br/>\n&gt; little to be up without me. We all sleep together though, so<br/>\n&gt; bedtime is a nice cozy thing. <br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; &gt; <br/>\n&gt; &gt; -=-S-&quot;&gt; Nobody&#39;s going to scrape peanut butter, or an idea, off their <br/>\n&gt; &gt; keyboard and die.  (Or if they do, the peanut butter will not have <br/>\n&gt; arrived by <br/>\n&gt; &gt; e-mail.) <br/>\n&gt; &gt; &gt; <br/>\n&gt; &gt; &gt; Sandra&quot; <br/>\n&gt; &gt; <br/>\n&gt; &gt; -=-K- Now that&#39;s just thoughtless. In an earlier post someone said that <br/>\n&gt; &gt; they admired that you &quot;wrote from the soul&quot;. I would like to see some <br/>\n&gt; &gt; of that.-=- <br/>\n&gt; &gt; <br/>\n&gt; S- &quot;&gt; It wasn&#39;t thoughtless in any way.  If you haven&#39;t &quot;seen some of <br/>\n&gt; that,&quot; you <br/>\n&gt; &gt; don&#39;t know my writing well enough to decide whether it&#39;s &quot;from the soul&quot; <br/>\n&gt; or <br/>\n&gt; &gt; not.   And you will never know my voice well enough to be the judge of <br/>\n&gt; &gt; whether I was sincere or thoughtful. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Assume I&#39;m sincere and thoughtful, and if you&#39;re too bothered by the <br/>\n&gt; writing, <br/>\n&gt; &gt; don&#39;t read it.  I don&#39;t want to stop writing because it&#39;s disturbing two <br/>\n&gt; or <br/>\n&gt; &gt; three of several hundred people. <br/>\n&gt; &gt; <br/>\n&gt; &gt; Sandra&quot; <br/>\n&gt; <br/>\n&gt; K- Agreed. We will both assume that we&#39;re sincere and thoughtful. I <br/>\n&gt; thought that you could tell by my detailed posts that I thought<br/>\n&gt; you were already. <br/>\n&gt; <br/>\n&gt; Of course you will not stop writing, I&#39;m sure that has not been <br/>\n&gt; requested. <br/>\n&gt; <br/>\n&gt; I did expect that making a joke about people dying from peanut butter <br/>\n&gt; on the keyboard would be thought of as unfeeling before<br/>\n&gt; you sent it. That is what I meant about thoughtless. I am being too <br/>\n&gt; literal for most, but it isn&#39;t a joke really. I suppose I have no<br/>\n&gt; sense of humor for that kind of humor. It wasn&#39;t a joke about really <br/>\n&gt; dying of course, but it was an &quot;I don&#39;t care about any whiny<br/>\n&gt; problems because they exaggerate everything&quot; type of feeling. If that <br/>\n&gt; was not your intent, then my apologies. <br/>\n&gt; <br/>\n&gt; For all my verbosity it may be hard to imagine that I am quite new to <br/>\n&gt; this list. I have only been on for a couple of weeks I think. I<br/>\n&gt; admit that I haven&#39;t followed enough of your posts on other topics to <br/>\n&gt; know your writing well at all. All I know is what I&#39;ve seen<br/>\n&gt; in your replies to my post. <br/>\n&gt; <br/>\n&gt; Every list has its personalities, occasional posters, and lurkers. <br/>\n&gt; <br/>\n&gt; I am interested in responses from others as well, but I fear they are <br/>\n&gt; not interested in this continuing saga, and I have put them<br/>\n&gt; off. <br/>\n&gt; <br/>\n&gt; And so ends the Kathy show. We now return you to your regularly <br/>\n&gt; scheduled programs, with the occasional weather report. <br/>\n&gt; <br/>\n&gt; Kathy B. <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Message boards, timely articles, a free newsletter and more!<br/>\n&gt; Check it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a><br/>\n&gt; <br/>\n&gt; To unsubscribe, set preferences, or read archives:<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.egroups.com/group/Unschooling-dotcom\">http://www.egroups.com/group/Unschooling-dotcom</a><br/>\n&gt; <br/>\n&gt; Another great list sponsored by Home Education Magazine!<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.home-ed-magazine.com\">http://www.home-ed-magazine.com</a> <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Your use of Yahoo! Groups is subject to <a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a> <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ----------------------- Headers --------------------------------<br/>\n&gt; Return-Path: &lt;<br/>\n&gt; sentto-156027-28304-1006194062-JMavredakis=<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aol.com@...\">aol.com@...</a>&gt;<br/>\n&gt; Received: from  rly-za05.mx.aol.com (rly-za05.mail.aol.com [172.31.36.101]) <br/>\n&gt; by air-za04.mail.aol.com (v82.22) with ESMTP id MAILINZA45-1119132326; Mon, <br/>\n&gt; 19 Nov 2001 13:23:26 -0500<br/>\n&gt; Received: from  n26.groups.yahoo.com (n26.groups.yahoo.com [216.115.96.76]) <br/>\n&gt; by rly-za05.mx.aol.com (v82.22) with ESMTP id MAILRELAYINZA510-1119132255; <br/>\n&gt; Mon, 19 Nov 2001 13:22:55 -0500<br/>\n&gt; X-eGroups-Return: <br/>\n&gt; sentto-156027-28304-1006194062-JMavredakis=<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aol.com@...\">aol.com@...</a><br/>\n&gt; Received: from [10.1.4.56] by n26.groups.yahoo.com with NNFMP; 19 Nov 2001 <br/>\n&gt; 18:18:38 -0000<br/>\n&gt; X-Sender: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:laurawilder82@...\">laurawilder82@...</a><br/>\n&gt; X-Apparently-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt; Received: (EGP: mail-8_0_0_1); 19 Nov 2001 18:21:02 -0000<br/>\n&gt; Received: (qmail 72740 invoked from network); 19 Nov 2001 18:21:00 -0000<br/>\n&gt; Received: from unknown (216.115.97.171)<br/>\n&gt;   by m12.grp.snv.yahoo.com with QMQP; 19 Nov 2001 18:21:00 -0000<br/>\n&gt; Received: from unknown (HELO n9.groups.yahoo.com) (216.115.96.59)<br/>\n&gt;   by mta3.grp.snv.yahoo.com with SMTP; 19 Nov 2001 18:20:58 -0000<br/>\n&gt; X-eGroups-Return: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:laurawilder82@...\">laurawilder82@...</a><br/>\n&gt; Received: from [10.1.10.121] by n9.groups.yahoo.com with NNFMP; 19 Nov 2001 <br/>\n&gt; 18:20:58 -0000<br/>\n&gt; To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt; Message-ID: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:9tbii6+vj90@...\">9tbii6+vj90@...</a>&gt;<br/>\n&gt; In-Reply-To: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:12f.7c1cbcc.292a79b0@...\">12f.7c1cbcc.292a79b0@...</a>&gt;<br/>\n&gt; User-Agent: eGroups-EW/0.82<br/>\n&gt; X-Mailer: eGroups Message Poster<br/>\n&gt; X-Originating-IP: 209.183.70.71<br/>\n&gt; From: &quot;Kathy&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:laurawilder82@...\">laurawilder82@...</a>&gt;<br/>\n&gt; X-Yahoo-Profile: laurawilder82<br/>\n&gt; MIME-Version: 1.0<br/>\n&gt; Mailing-List: list <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>; contact <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-owner@yahoogroups.com\">Unschooling-dotcom-owner@yahoogroups.com</a><br/>\n&gt; Delivered-To: mailing list <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt; Precedence: bulk<br/>\n&gt; List-Unsubscribe: &lt;mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom-unsubscribe@yahoogroups.com\">Unschooling-dotcom-unsubscribe@yahoogroups.com</a>&gt;<br/>\n&gt; Date: Mon, 19 Nov 2001 18:20:54 -0000<br/>\n&gt; Reply-To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a><br/>\n&gt; Subject: [Unschooling-dotcom] the Kathy and Sandra Show, episode 3 &quot;Mutual <br/>\n&gt; Respect&quot; (hopefully)<br/>\n&gt; Content-Type: text/plain; charset=US-ASCII<br/>\n&gt; Content-Transfer-Encoding: 7bit<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":28246,"nextTopicId":28251}}