{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":125056900,"authorName":"princessdee20012001","from":"&quot;princessdee20012001&quot; &lt;ladymagic@...&gt;","profile":"princessdee20012001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"few questions","postDate":"1051038501","msgId":13807,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGI4NDN2NSthdXVyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13806,"nextInTime":13808,"topicId":13807,"numMessagesInTopic":0,"msgSnippet":"have a few questions  . first i want to say thank you. i have  spent the  3 hours  reading from one link to the next on unschooling. I may have just stumbled ","messageBody":"<div id=\"ygrps-yiv-1547241957\">have a few questions  .<br/>\nfirst i want to say thank you. i have  spent the  3 hours  reading  <br/>\nfrom one link to the next on unschooling. I may have just stumbled <br/>\non  what i have been looking for.<br/>\n We have a 12 (13 in two weeks))year old. That we have adopted last <br/>\nyear.(she has lived with us for 3  1/2 years)who had sever pts. and <br/>\nadhd.she was  abused in every way and  under feed and  had been <br/>\ndionosed with reactive attachment disorder at the age of  five (we <br/>\ndid not know this till she was almost 12). She has come a long long <br/>\nway and had grown  a lot as now she gets feed (she was 55 lbs and  <br/>\nwore a  6x in clouthing, when we got her and now wears a womans  6 <br/>\ntall and weighs 120.(giggle she wore a size 4 in childrens shoes then <br/>\nnow a 10 in womans)she trys very very hard  and is  recently wanting <br/>\nto   frow more. she loves to learn and is determined to get past the  <br/>\nRAD (reactive attachment Disorder). her and I have both  desided we <br/>\nneed to work harder on the  bonding as the theropist thinks we need <br/>\nto work  on the adhd part and  use more drug theropy.( we have tryed <br/>\nthis over and overusuly makes it worse) we have agreed to try  time <br/>\nrelised this may however   we have refused the if you want to give <br/>\nanother to counter the first routine we wont do it)and we are both  <br/>\nasking why  is it more important to  do the  grade thing any way<br/>\ni have spent 3 years fighting the school. and trying to make them <br/>\nfallow the iep, They have  insisted that we fix the not turning in <br/>\nhomework problem and fix the behavior also. The behavior is usuly  <br/>\nsocial problems and she is  the kid every one picks on the kids and <br/>\nteacher tell me this. Lisa  has very very poor social skills.so my <br/>\nquestion  this last year to them has beenyou belive i need to keep <br/>\nher in here for social reasons and what i see her learning is how to <br/>\nbe a door mat and  you say she is eager to learn but you dont have <br/>\ntime to teach her because she ask so many questions and  in the <br/>\nclasses she has  only 3 other students  she does great even helps <br/>\nexplain to others once she  has had all her questions answered. and <br/>\nshe is still flunking because she dont turn in her homework and if <br/>\nshe dont do the homework it is usualy because  the teaches have <br/>\nfailed to expline it in small steps so she can understand. And i keep <br/>\nher in  school why? then they point out my spelling and  math  <br/>\nproblem and math is one of her problems.We dont have a lot of money <br/>\nand they know it, know i could not afford to hire a bunch of tutors <br/>\nand they  said i would have to turn my home into a mini school  to <br/>\nmake it work and hire  people to do it and if i didnt have the  <br/>\nmoney  no way i could do this. i have spent 6 mounths  looking. have <br/>\nfound  that maybe they are wrong. there are lots of  places i could <br/>\nopen enroll her and as close as  a 1/2 hour away there are  places <br/>\nthat have  home school resorese rooms. and as for spelling  her and i <br/>\ndecided together that it could be a game and we  write down words we <br/>\nspell wrong and  we keep list short  and  play a game to teach both <br/>\nof us.I stared  with telling her i think it might be a idea for us to <br/>\ndo home  school stuff this summer when   u get out of school end of <br/>\nmay and i expected the  school in summer thing. to my surprise she <br/>\nhad ideas and  is excited about the idea and even said this is a way <br/>\nwe can work on the bonding issue mom, but what about math i told her <br/>\nof the other types of school she said gee then  not every one will <br/>\nknow me and maybe i could make friends?                        <br/>\n  We make  biweekly trips to  junk stores usualy she hits the  <br/>\nclouthing fast last 2 times she has went to learning  area and found <br/>\ncd&#39;s  and books she would like to learn from.<br/>\n  Her counsler  now says she will fall behind  and that there is not <br/>\nenough social interreaction  for her  . Her and I belive that  this <br/>\ncan be handled and I think learning  low self esteem and flunking <br/>\neven though ya know the  materal is silly. The teacher dont fallow <br/>\nthe iep at all  we once had it set up to sigh a paper if she had <br/>\nturned in home work and for every day she   got full day of <br/>\nsignutures she got  computer time . if she didnt get them she  didnt <br/>\nand then if she missed 3 in a day she got a 1/2 hour in her roomthey <br/>\nall sighned  every day for months. then sent home a  your kid is <br/>\nflunking because she didnt turn in homework . The poor girl went into <br/>\ntears. they had told her she was doing fine and  this took us both  <br/>\nby surprise. i marched in to the school  and getting nothing but run <br/>\naround called a  iep meeting they told me they didnt have heart not <br/>\nto sighn the paper and as time went on  they  felt she handt turned  <br/>\nit in because they didnt have time to teach her in small steps and <br/>\nshe was  behind/ I stoped the sighing thing told them what i was <br/>\nthinking about home school and they  told me i lacked the skills and <br/>\nthat i would be doing  her a &quot;grave dis service&quot; if i did that and <br/>\nquoted both her poor social skills and  the time it would take to  do <br/>\nit. I shook my head  social skills? she is made fun of (granted <br/>\nsometimes she causes it) and has no friends (small small towns dont <br/>\nforgive and have long memorys) and as for my skills well i pionted <br/>\nout to them i took a kid they told me would neve bond and couldnt <br/>\nfeel and that would end up in  instatutions the rest of her life and <br/>\nshe not been in a single instution, and  now we are trying to get her <br/>\nto stop crying in school when she is made fun of.I think i keep <br/>\nhesatiting because  so many tell me i am wrong i cant do this one  <br/>\nthat she will be at 7th grade level forever, if i do. except in <br/>\nreading  where she reads at level 12.I think they  dont know my kid <br/>\nand my determation. I think  ok so we both hate math and  have what <br/>\nthey call a math disorder. so what  we are integelent and read well <br/>\nand she has so many questions and willness to find the answers. (oh i <br/>\nprobley forgot to say this child is  related to me by blood and other <br/>\nreason they said with RAd kids bio related not a good idea asked me <br/>\nto give her to system after we found  out  after a year and a 1/2)<br/>\nSo my questions are any one know if  this is bad idea for a teen Rad? <br/>\nand is it to late as she is  almost 13 to start ?if her and i choose  <br/>\nwhat  she does  why is that wrong? I kept saying so what she learns <br/>\nwhat she can or wants in  math and i dont turn my home into a mini <br/>\nschool. we will find things she does want to learn. and she does want <br/>\nto learn . heck  she out and out flunking  sience and those are one <br/>\nthe areas she keep picking up at the stores she wasnts to  do it on <br/>\ncomputer the  woman i  have do my taxes say in Iowa there is a tax <br/>\nbreak  and fed she says  if i keep track  what i spend for learning I <br/>\ncan claim 25 hundred on taxes. I didnt know that. with that break why <br/>\ncant i hire out what she wants to learn?save 2 grand from income tax <br/>\nthis year and use it and keep track?she wants to plant a flower bed <br/>\nthis year want to learn about how the roots  work and wants to  read <br/>\nthe books school wont  give her time to  she  reads there books and <br/>\ndont like them  and  when she dont do there  book it usualy because <br/>\nshe been  reading her books.she is excited about summer school with <br/>\nmom and older sister says she will help her in oreas  and lisa is so <br/>\nexcited . I however dont want a mini school setting have been looking <br/>\nfor alternitives . hands on  lets learn this together ways of <br/>\nteaching.<br/>\nI stumbled on this site  when looking in yahoo groups for attacment <br/>\ndisorders is there a reason it was listed here? are there others with <br/>\na Rad child? Can someone that  has poor  math and grammer and <br/>\nspelling make this work?<br/>\nI have decided not to do spell check just to let you know how poor <br/>\nthe spelling realy is. and  get advise from those that  live it. <br/>\nThank you in advance for your advice and  I am sorry for the lenght <br/>\nof this post.<br/>\nDee</div>","specialLinks":[]}],"prevTopicId":13775,"nextTopicId":13809}}