{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":78282269,"authorName":"soggyboysmom","from":"&quot;soggyboysmom&quot; &lt;debra.rossing@...&gt;","profile":"soggyboysmom","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: A weekend away","postDate":"1116945842","msgId":106143,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGQ2dmVqaSszYmk4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PEJBWTEwMi1GMTEwNjkyNkYxMkREOTJGMzE4NDgwQkMwMEQwQHBoeC5nYmw+"},"prevInTopic":106141,"nextInTopic":0,"prevInTime":106142,"nextInTime":106144,"topicId":106141,"numMessagesInTopic":0,"msgSnippet":"... ","messageBody":"<div id=\"ygrps-yiv-111690825\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Heidi Crane&quot; <br/>\n&lt;bunsofaluminum60@h...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt; Later in the drive we played Alphabet Sentence, and came up with <br/>\n </span></blockquote>&lt;some <br/>\n<blockquote><span title=\"ireply\"> &gt; doozies. &quot;Montana Needs Opal Peaks Quite Robust, Starting To <br/>\n </span></blockquote>&lt;Undulate <br/>\n<blockquote><span title=\"ireply\"> &gt; Violently When eXXcellent Young Zephyrs Attack Bison, Careening <br/>\n </span></blockquote>&lt;Dangerously <br/>\n<blockquote><span title=\"ireply\"> &gt; Everywhere From Gargantuan Hills, Is Just Kinetic Life.&quot; there <br/>\n </span></blockquote>&lt;were others, <br/>\n<blockquote><span title=\"ireply\"> &gt; but...you get the picture.<br/>\n&gt; <br/>\n<br/>\n&gt; <br/>\n&gt; blessings, heidi C<br/>\n </span></blockquote>Speaking of silly car games, DS has picked up on one of the bits <br/>\nfrom Who&#39;s Line is it Anyway - it&#39;s the one where one actor plays <br/>\nthe scene as the &quot;straight man&quot; and the other two (I suppose you <br/>\ncould do more as well) actors only have 2 sentences each - they can <br/>\nuse them over and over but just the same two sentences. We played in <br/>\nthe car while waiting for the movie to start at the drive-in Friday <br/>\nnight (Star Wars Episode III!). We set a scene, then the two silly <br/>\nparties picked their lines - one time I picked &quot;I&#39;m right behind <br/>\nyou&quot; and &quot;Are you sure?&quot; We&#39;d go along until it ran out of steam, <br/>\nstop, pick another &quot;straight man&quot;, another scene, new sentences, and <br/>\ngo on. Two adults and an almost 7 yr old, we spent probably 45 <br/>\nminutes playing this game and giggling.<br/>\n<br/>\n--Deb</div>","specialLinks":[]},{"userId":92084939,"authorName":"Heidi Crane","from":"&quot;Heidi Crane&quot; &lt;bunsofaluminum60@...&gt;","profile":"heidic40","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"A weekend away","postDate":"1116943656","msgId":106141,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBWTEwMi1GMTEwNjkyNkYxMkREOTJGMzE4NDgwQkMwMEQwQHBoeC5nYmw+"},"prevInTopic":0,"nextInTopic":106143,"prevInTime":106139,"nextInTime":106142,"topicId":106141,"numMessagesInTopic":0,"msgSnippet":"Hi folks Just wanted to post about our weekend in Montana, because it was a pretty good weekend, considering. Remember when I posted about my anxiety regarding","messageBody":"<div id=\"ygrps-yiv-1578648000\">Hi folks<br/>\n<br/>\nJust wanted to post about our weekend in Montana, because it was a pretty <br/>\ngood weekend, considering. Remember when I posted about my anxiety regarding <br/>\nthis trip, because my mil is adamantly opposed to school at home, let alone <br/>\nunschooling? Well, we had to go. Brother-in-law memorial services need <br/>\nbrothers, and brothers need their wives for moral support.<br/>\n<br/>\nI won&#39;t bore you with the details of the trip up, except to say, don&#39;t eat <br/>\nrotten onion the day before you go on a 10 hour drive. It is NOT pretty. But <br/>\nwe made it okay, and I went to bed instead of eating dinner, and felt much <br/>\nbetter the next day.<br/>\n<br/>\nMIL was not cranky nor verbose about anything, even the homeschooling. She <br/>\ngot a chance to see my son&#39;s polite interactions with adults he&#39;d never met <br/>\nbefore, heard about Abbie&#39;s theater experiences and job-hunting woes, and <br/>\ntalked to Katie a little bit about reading (completely non-judgmentally, <br/>\ntoo, which completely surprised me). Most of their time was spent outside.<br/>\n<br/>\nWhat we did while in Montana. Petted Aunt Rene&#39;s Greater Pyrennies (sp?) <br/>\npuppies, hung out at The Project (an apartment house that is being <br/>\nrefurbished by my mil and bil&#39;s), watched a sand sculptor begin a figure of <br/>\nLewis & Clark outside the art museum. Katie spent three hours on Saturday <br/>\nwith the artist, making her own sculpture in the sand, of a dog lying on its <br/>\nside. We are now researching where to find some of that kind of sand for our <br/>\nside yard. Inside the art museum, we voted on our favorite pieces from the <br/>\nMiddle School arts class as well as the Montana Water Color society show, <br/>\nand we also looked at displays of glass art and peeked in upstairs where the <br/>\nclasses are held. Shopped a little bit, but didn&#39;t buy anything. Katie&#39;s <br/>\ngoing to start working on a walking stick of her own, rather than fork out <br/>\n$22.00 for one at an art gift shop.<br/>\n<br/>\nWe searched for, but didn&#39;t find, a geocache around the corner from mil&#39;s <br/>\nhouse. It was near the Old Folks&#39; Pond, which is actually a water bird <br/>\nrefuge. That was cool. We saw ducks, red winged black birds, chickadees, and <br/>\nheard the call of some big bird that we never saw. Got our feet muddy. <br/>\nHelped with dinner clean up, visited with old aunts and neighbors and <br/>\ncousins. I caught up with sis-in-laws, while the kids caught up with cousins <br/>\nwe hadn&#39;t seen in years.<br/>\n<br/>\nOn the drive home Sunday morning, we stopped in Livingston for breakfast, <br/>\nand there was a candy store attached to the restaurant, selling all <br/>\nvarieties of candy by the pound. We asked prices; I gave each kid two bucks, <br/>\nand they spent a half hour dipping and weighing and estimating how much <br/>\nthey&#39;d spent. Each of them ended up with lots of jelly bellies and gummy <br/>\ncandies, and one rock candy each. The rock candies featured largely in part <br/>\nof the drive from there.<br/>\n<br/>\nThey became dylithium crystals, and Abbie became Jean Luc Picard/Geordi; <br/>\nRobby became Data/Riker/Wesley and Katie became Dr. Crusher/Counsellor Troy. <br/>\nThe Crystals were useful not only as an energy source, but also for <br/>\ndiagnosing illnesses and beaming them onto enemy ships. The enemy ships were <br/>\nall around us, cloaked to look like Earth Automobiles. And I thought letting <br/>\nthem buy and eat all that sugar would make them restless and cranky! Mind <br/>\nyou, this is a 17 year old big sister, with a 12 year old bro and a 10 year <br/>\nold wiggle-worm sister, who had already spent four hours sitting together <br/>\nback there.<br/>\n<br/>\nLater in the drive we played Alphabet Sentence, and came up with some <br/>\ndoozies. &quot;Montana Needs Opal Peaks Quite Robust, Starting To Undulate <br/>\nViolently When eXXcellent Young Zephyrs Attack Bison, Careening Dangerously <br/>\nEverywhere From Gargantuan Hills, Is Just Kinetic Life.&quot; there were others, <br/>\nbut...you get the picture.<br/>\n<br/>\nThat was a good break.<br/>\n<br/>\nblessings, heidi C</div>","specialLinks":[]}],"prevTopicId":106142,"nextTopicId":106147}}