{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1294635,"authorName":"HEM-Online-Newsletter  by way of Home Ed","from":"HEM-Online-Newsletter &lt;HEM-Editor@...&gt; (by way of Home Education Magazine)","profile":"hemhelen","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"HEM&#39;s Online News -  February 2002","postDate":"1013288029","msgId":31973,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PHAwNTAwMTkzZWI4OGIzY2Q0M2E2YUBbMjA4LjI2LjIyNy4yMDFdPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":31972,"nextInTime":31974,"topicId":31973,"numMessagesInTopic":0,"msgSnippet":"^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ HOME EDUCATION MAGAZINE S ONLINE NEWS February 2002 ^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^ Welcome to HEM S ONLINE NEWS, a","messageBody":"<div id=\"ygrps-yiv-883432086\">^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHOME EDUCATION MAGAZINE&#39;S ONLINE NEWS<br/>\nFebruary 2002<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nWelcome to HEM&#39;S ONLINE NEWS, a free monthly newsletter published by <br/>\nHome Education Magazine and full of the best internet resources, <br/>\nhomeschooling news, announcements and article excerpts. For more <br/>\ninformation on Home Education Magazine, see the end of this <br/>\nnewsletter or visit our web site at http://home-ed-magazine.com. For <br/>\nsubscription information for the newsletter, scroll to the end, <br/>\nreading everything in between. Send your comments and questions to <br/>\neditor Carol Narigon at HEM-Newsletter@....<br/>\n<br/>\nIn the February issue:<br/>\n<br/>\n~ Homeschool Resource Center in a Public Library ~<br/>\n~ Special Offer ~<br/>\n~ Homeschooling Learning Differences ~<br/>\n~ Gilligan&#39;s Isle ~<br/>\n~ Homeschool Website of the Month ~<br/>\n~ Reader Response ~<br/>\n~ HEM Back Issue Sale ~<br/>\n~ Winter 2002 Olympics ~<br/>\n~ Best Black History Month Websites ~<br/>\n~ Best Groundhog Site ~<br/>\n~ Unclassified Ads ~<br/>\n~ The Final Word ~<br/>\n<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\n&quot;If you live in a material universe where acquiring things is very <br/>\nimportant to you, then family is an absolute deterrent to maintaining <br/>\nthat sort of a world, because family involves values like affection, <br/>\nand sympathy, and passion, and types of pleasure that lead nowhere in <br/>\na material sense.&quot; ~~John Taylor Gatto in &quot;Alternatives in Education&quot; <br/>\n~~<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHOMESCHOOL RESOURCE CENTER IN A PUBLIC LIBRARY<br/>\nhttp://www.home-ed-magazine.com/HEM/191.html<br/>\n<br/>\nHave you ever wanted your library to have a wealth of homeschooling <br/>\nsupplies, curriculums and resources like microscopes and telescopes? <br/>\nMost of us have that fantasy, and in one small town in Illinois, it&#39;s <br/>\na dream that has come true.<br/>\n<br/>\nFor many years now I have held a vision of the library of the future. <br/>\nThis library would be a public learning center. It would do more than <br/>\nlend out materials. It would be far more than a school. It would be <br/>\nsimilar to the private Homeschool Resource Centers that are cropping <br/>\nup in areas, but it would not require a paid membership to use. It <br/>\nwould be a community-based learning Mecca!<br/>\n<br/>\nI never really expected to see even a small part of my dream become a <br/>\nreality, but I knew that I wanted my small town library to be as <br/>\nstrong as it could be. I began to volunteer with the Friends of the <br/>\nJohnsburg Public Library almost as soon as we moved into the area. <br/>\nFrom the first, I found volunteering was a win-win situation. I could <br/>\nhelp them raise money for programs and updated technology and <br/>\nmeanwhile get first pick of all the books in the used book sale for <br/>\nmy family. Best of all my children could volunteer along with me and <br/>\nI knew that when they were bored or tired they could wander off and <br/>\nfind a good book for a while.<br/>\n<br/>\nOver a few years, as I volunteered more and more, I slowly began to <br/>\nshare some of my ideas with the staff and the Friends group. Together <br/>\nwe were able to make numerous small changes, such as providing the <br/>\nlibrary with receipt printers so every patron gets a full listing of <br/>\nall the items checked out (great for sticking in a file to look back <br/>\non when you worry that the kids aren&#39;t learning enough!). Library <br/>\nstaff was made increasingly aware that a large number of <br/>\nhomeschoolers lived in the area because we kept pointing ourselves <br/>\nout to them whenever possible.<br/>\n<br/>\nStaff and volunteers together have built, month-by-month, project <br/>\nupon project, a strong foundation of trust. In Stephen Covey&#39;s book, <br/>\nThe 7 Habits of Highly Effective People, he discusses how people need <br/>\nto build relationships (networking), they need to work within their <br/>\nsphere of influence and they need to begin with the end in mind. At <br/>\nmy small town library we were actively doing these things in our own <br/>\nways. Slowly our small library has become technologically advanced, <br/>\nwell equipped and well respected.<br/>\n~~ excerpt from an article by Kathy Wentz in the January/February <br/>\n2002 issue of Home Education Magazine ~~<br/>\n<br/>\nYou can read the rest of this article, as well as more articles and <br/>\ncolumns from the Jan/Feb issue at the address above, but you&#39;ll have <br/>\nto get the magazine--the one you hold in your hands--to read them <br/>\nall! See special subscription information below and at the end of <br/>\nthis newsletter or visit your local bookseller and get your copy <br/>\ntoday!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM&#39;S ONLINE NEWS SPECIAL SUBSCRIPTION OFFER<br/>\nhttp://www.home-ed-magazine.com/sale/_hemonline.html<br/>\n<br/>\nThis is the price you&#39;ve been waiting for! Start your subscription <br/>\nnow and take a 30% discount! For a limited time we are offering <br/>\nreaders of HEM Online News an opportunity to subscribe for a 30% <br/>\ndiscount. A one year, 6-issue subscription is ONLY $22.40. Use our <br/>\nsecure online order form at the address above.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHOMESCHOOLING LEARNING DIFFERENCES<br/>\n<br/>\nFrom Prima Publishing: In &quot;Complete Guide to Successfully<br/>\nHomeschooling the Child with Learning Differences&quot; (Prima, ISBN <br/>\n0-7615-3569-1), author Leonore Colacion Hayes shines a spotlight on <br/>\nthe challenges and joys of homeschooling special-needs children <br/>\n(children with disorders ranging from autism or ADD to those with <br/>\nother learning disabilities or who simply march to the beat of a <br/>\ndifferent drummer). Author Hayes, who has experienced and met this <br/>\nchallenge personally as well as worked professionally with hundreds <br/>\nof homeschooling families, begins with simple starting points and <br/>\nmoves through issues such as how to develop strong family bonds with <br/>\na child who may not want to do this naturally and ends with extensive <br/>\nlists on where to get help from both public and private sources. <br/>\nScattered throughout are experiences from homeschooling families <br/>\nacross the country who emphasize how they were able to successfully <br/>\nhomeschool their special needs children.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nUNSCHOOLING.COM<br/>\nhttp://www.unschooling.com<br/>\n<br/>\n&quot;I&#39;m glad today that Kirby is a tattler. Marty, Caiti (Rhiannon&#39;s <br/>\nCaiti) and Holly were halfway up our LONG street--about five houses <br/>\naway, on the other side, and still truckin&#39;. Holly was absolutely <br/>\nnaked except for wet sand on her feet and up to her elbows. Marty had <br/>\non a pair of torn pants, no shirt, no shoes. At least Caiti was <br/>\nclothed. No one was out there to see them except three humorless <br/>\ngrandparents. I walked down and said, &quot;Whose idea was it to walk up <br/>\nhere?&quot; Marty immediately pointed at Caiti with a sincere look, and <br/>\nCaiti pointed at Marty with a devilish look, and Holly let me carry <br/>\nher home and put clothes on her. Now they&#39;re eating popcorn, turkey <br/>\nsandwiches, watching Tiny Toons, and drinking chocolate milk or juice <br/>\n(some one, some chose the other).<br/>\n<br/>\nWhen I used to watch Gilligan&#39;s Island in 4:00 re-runs after school <br/>\nevery day, I would wonder whose idea it was for the plot, how many <br/>\nwriters there were, how they decided who could come and visit, what <br/>\ndevice they would use to prevent the visitor from rescuing them, how <br/>\nthey must plan in advance not to have too-similar plots near each <br/>\nother, and the re-runs must be kept in that same order too. I <br/>\nwondered about them changing the theme song--at first it had said, <br/>\n&quot;the movie star, and the rest,&quot; but in later seasons it said, &quot;the <br/>\nmovie star, the professor and Mary Ann,&quot; and I wondered whether they <br/>\nhad resung the whole thing or just spliced in that line, because it <br/>\nsounded the same as it had before. And had they done it because the <br/>\nactors complained? Their agents complained? I wondered whether the <br/>\npedal-powered washing machine (or whatever it was) really worked by <br/>\nthe pedals, or whether it was just secretly plugged in, and if so, <br/>\nwhere did the wires run? I wondered if much of it was on indoor sets. <br/>\nHow deep was that water? (As an adult, I saw what&#39;s left of the set <br/>\nat Universal Studios. Cool! Outside! Actual little lake.) When I <br/>\nwould see a show the second time, I&#39;d look around for things I had <br/>\nmissed the first time. I would re-write lines in my mind, things that <br/>\ncould have been funnier, or sounded more in character for that <br/>\nperson. I&#39;d wonder who knew more about hammock making, the captain or <br/>\nthe professor? Maybe Ginger or Mary Ann knew macramé. When there was <br/>\na show which didn&#39;t have one of the actors in, I&#39;d wonder whether he <br/>\nwas sick or on vacation or what? And if an actor misses the filming <br/>\nof a sitcom, does he still get paid? I wondered about them having to <br/>\nkeep their hair the same for years, and which of them were might be <br/>\nwearing wigs. Where were they supposed to be getting nail polish and <br/>\nlipstick? Hair spray? I wondered if the professor was a physics <br/>\nprofessor or engineering, or what, and whether he would lose his job <br/>\nat the university. I wondered about that Mr. Magoo voice on Thurston <br/>\nHowell. I wondered about Amelia Earhart. I wondered about the <br/>\nsoundtrack music. Did they just have little themes they pushed a <br/>\nbutton on during final edit, or was each show done separately? I <br/>\nwondered if the fruit was real or props. I wondered about <br/>\ncameras--where were they? Did they have to sweep the dirt between <br/>\ntakes? I wondered if the guy who played the lost WWII pilot was <br/>\nreally Japanese. I could think more during an episode of Gilligan&#39;s <br/>\nIsland than most other people I knew could think in a whole week. I <br/>\ndidn&#39;t bother to ask my parents any of the questions. They would have <br/>\nthought it was stupid to be thinking them. So to all outside <br/>\nappearances (except to my cousin, Nada, who was my age) I was just <br/>\nzoning out, involved in the plot of another 25 minutes of Gilligan&#39;s <br/>\nIsland. That wasn&#39;t true at all.&quot;<br/>\n~~ Sandra Dodd, message board at unschooling.com ~~<br/>\n<br/>\nUnschooling.com offers message boards, essays, articles, an email <br/>\nlist and more just for unschoolers. Check it out!<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHOMESCHOOL WEBSITE OF THE MONTH<br/>\nhttp://borntoexplore.org/unschool<br/>\n<br/>\nUnschoolers Unlimited is the website for an informal group of <br/>\nConnecticut unschoolers. You&#39;ll find a decent list of resources and a <br/>\nnumber of good articles. If you suffer from doubting family members, <br/>\nshare with them the article about site owners Luz Shosie and Ned <br/>\nVare&#39;s 21- year-old son Cassidy. Other websites sharing the same home <br/>\npage give information on the myths about ADD. Lots to explore here.<br/>\n<br/>\n  &lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nREADER RESPONSE QUESTIONS<br/>\n<br/>\nQuestions for the May/June issue of Home Education Magazine&#39;s <br/>\nQuestions and Answers column:<br/>\n<br/>\n&quot;We are moving to a remote area of Alaska in the next few months. We <br/>\nhomeschool the two children still at home, ages 10 and 14. I don&#39;t <br/>\nknow how we will fill their time without libraries, museums, theaters <br/>\nand other enrichments. Any suggestions?&quot;<br/>\n~~ Emma ~~<br/>\n<br/>\n&quot;There was a time in our home when &#39;Let&#39;s read!&#39; meant I had about <br/>\ntwo seconds before 10+ books landed on the bed in front of me. We <br/>\ncouldn&#39;t get enough of reading. Sometimes the only way I could stop <br/>\nreading was if I fell asleep, at which time the eight year old (now <br/>\n10) would pick up reading where I left off. During a very hectic year <br/>\nand a half of moving three times we lost our insatiable reading times <br/>\ntogether, and now that we are finally settled in a new town and new <br/>\nhome I want them back again. But, alas, those times seem to be gone <br/>\nforever. Our children don&#39;t want to read anymore, nor listen to me <br/>\nread. I don&#39;t and can&#39;t force them to sit and listen to me read but I <br/>\nfeel they are really missing out, especially the younger one, age <br/>\nsix. Will he love books and stories like his brother if he doesn&#39;t <br/>\nget the exposure that his older brother received? How can we get back <br/>\ninto reading together or have I lost my read-aloud job forever?&quot; ~~ <br/>\nKandi ~~<br/>\n<br/>\nTo answer a question, or propose your own question, please write to <br/>\nLaura Weldon via ReaderResponse@... or Questions & <br/>\nAnswers, c/o Home Education Magazine, PO Box 1083, Tonasket, WA <br/>\n98855. Your responses must meet our deadline of the 1st. Please <br/>\nrecognize that your submission may be edited for length or clarity. <br/>\nIndicate how you prefer your question or answer signed.<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nHEM&#39;S ANNUAL BACK ISSUE SALE<br/>\n<br/>\nHome Education Magazine is again offering an opportunity to stock up <br/>\non some great homeschool reading for the winter with our popular <br/>\nAnnual Back Issue Sale. Our office manager has selected our most <br/>\npopular theme packages for this sale. Whether you are interested in <br/>\nGetting Started or Unschooling you will find these packages full of <br/>\nuseful homeschooling insights.<br/>\n<br/>\nDon&#39;t see a package that fits your needs? Then create your own custom <br/>\nset of any 3 issues from the available issues.<br/>\n<br/>\nIssues are available in sets of three for $11.25 per package (postpaid!).<br/>\nhttp://www.home-ed-magazine.com/sale/bi.html<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nWINTER 2002 OLYMPICS<br/>\n<br/>\nThe Winter 2002 Olympics begin February 8 in Salt Lake City, UT. The <br/>\nofficial Olympics website gives you information on news, travel <br/>\ninformation, behind the scenes chitchat, bios of the participants and <br/>\nmuch more. It should be cold enough for winter games. The morning I <br/>\nwrote this, the temperature was -2 degrees in Salt Lake City. Brrrr. <br/>\nhttp://www.saltlake2002.com<br/>\n<br/>\nThe Utah Education Network offers another good website with <br/>\ninformation about the various nations participating in the Olympics, <br/>\nbackground on Utah and a complete educator&#39;s guide with lots of good <br/>\nideas for digging deeper into the Winter 2002 Olympics. <br/>\nhttp://www.uen.org/2002<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBEST BLACK HISTORY MONTH WEBSITES<br/>\n<br/>\nThere are tons of websites for Black History Month. Here are a couple <br/>\nof my favorites, both loaded with further links to follow:<br/>\nhttp://www.kn.pacbell.com/wired/BHM/AfroAm.html<br/>\nhttp://fe.infoplease.com/spot/bhm1.html<br/>\n<br/>\n&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**&lt;&lt;**<br/>\n<br/>\nBEST GROUNDHOG SITE<br/>\nhttp://ourworld.cs.com/DonaldRHalley/ghdsongs.htm<br/>\n<br/>\nGroundhog day is February 2. How about a rousing round of groundhog <br/>\nsongs to celebrate the day? And a one, and a two...<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nHEM ONLINE NEWS UNCLASSIFIED ADVERTISING<br/>\n<br/>\nFor information on purchasing unclassified advertising space in this <br/>\nnewsletter, please contact the editor at <br/>\nHEM-Newsletter@....<br/>\n<br/>\n________<br/>\n<br/>\nUSBORNE<br/>\nUsborneAmerica.com<br/>\n<br/>\nNew titles for fall and winter are here -- including Internet-Linked <br/>\nhistory and science books! Shop online and earn FREE and discounted <br/>\nbooks. Visit our Books from Britain bookstore at: <br/>\nhttp://www.UsborneAmerica.com. Home business opportunity information <br/>\navailable onsite. Email SharonVE@... or call 888-474-8499 toll <br/>\nfree. Sharon Vander Ende, Independent Executive Supervisor.<br/>\n<br/>\n________<br/>\n<br/>\nGNARLY MATH<br/>\nGnarlymath.com<br/>\n<br/>\nWHEN DOES 1+1=1? The current issue of our free hilarious math <br/>\nnewsletter, the Gnarly Gnews, explains this nonsensical addition. And <br/>\nit shows what Clerihews and limericks have to do with mathematics. <br/>\nSubscribe at http://www.gnarlymath.com, where you can also download <br/>\nfree examples of our CD-ROM Solid Gold Gnarly Math. If you&#39;d like a <br/>\nrefresher course in Algebra, Geometry, Trig, or Probability, or if <br/>\nyou want to give your kids an fun and exciting outlook on math, try <br/>\nour money-back-guaranteed CD today.<br/>\n_________<br/>\n<br/>\nTHE RESOURCEFUL HOMESCHOOLER<br/>\nResourcefulhomeschooler.com<br/>\n<br/>\nAttention unschoolers and eclectic homeschoolers! The Resourceful <br/>\nHomeschooler carries great books, science materials and kits, <br/>\nlearning games, and the most interesting software. Gift certificates; <br/>\nsearch service. AND here is your opportunity to clear some shelf <br/>\nspace! List or consign your surplus or used homeschooling materials. <br/>\nStore credit available for consignments. Visit <br/>\nhttp://www.resourcefulhomeschooler.com or call (877) 523-0494. Great <br/>\nmaterials for independent learners of all ages.<br/>\n<br/>\n_________<br/>\n<br/>\nLEARNING SKILLS FOR LIFE<br/>\niKnowthat.com<br/>\n<br/>\nWhat does your child need to succeed? Lifelong learning skills! <br/>\nExperts say that&#39;s what our children will need to keep up in <br/>\ntomorrow&#39;s rapidly changing world. Now there&#39;s a powerful new <br/>\nweb-based community that can help your child develop such <br/>\nmeta-learning skills. Try it risk-free at: <br/>\nhttp://www.iknowthat.com/com?CO=01HEM01<br/>\n_________<br/>\n<br/>\nTEACH YOUR CHILD TO READ! TRY ONLINE LESSONS NOW FOR FREE!<br/>\nHeadsprout.com<br/>\n<br/>\nHeadsprout Reading is the fun, Internet-delivered beginning reading <br/>\nprogram that will give your child a real advantage by systematically <br/>\nteaching essential skills and strategies, ensuring reading success <br/>\nand confidence. Outstanding fast results! After just five 20-minute <br/>\nanimated, interactive episodes, children read their first Headsprout <br/>\nbook. Act quickly! For a limited time you can try out Headsprout <br/>\nReading FOR FREE!<br/>\nhttp://www.headsprout.com . Please enter the promotional code: HENB2<br/>\n_________<br/>\n<br/>\nHOME EDUCATION MAGAZINE<br/>\nhttp://www.home-ed-magazine.com<br/>\n<br/>\nWith the January/February 2002 issue of Home Education Magazine, we <br/>\nwelcome A to Z Home&#39;s Cool Homeschooling&#39;s Ann Zeise <br/>\n(www.gomilpitas.com/homeschooling) as one of our columnists. Ann has <br/>\ngiven generously of her time and Internet expertise over the years, <br/>\nand I know you&#39;ll enjoy her column titled &quot;Do You Yahoo?&quot;<br/>\n<br/>\nThe January/February issue also features articles on Grapes in the <br/>\nFreezer, Chocolate chips and Blue M&Ms, Sub-VERSE-ive Poetry, an <br/>\nultimate field trip, an epiphany and more.  From the columnists: the <br/>\nKaseman&#39;s review &quot;Kingdom of Children: Culture and Controversy in the <br/>\nHomeschooling Movement&quot;; Becky Rupp solves mysteries; David Albert <br/>\nspeculates about Standaristas; Sandra Dodd slays the Math Monster; <br/>\nand Carol Narigon (that&#39;s me) gives advice on the learning to read. <br/>\nOther columnists include Barbara Theisen, Peter Kowalke, Linda <br/>\nDobson, and Laura Weldon.<br/>\n<br/>\n**** With this newsletter Home Education Magazine is offering readers <br/>\nof HEM Online News a Subscription Special - One Year/6 issues $22.40 <br/>\n- that is a 30% savings! Single issue $6.50. Home Education Magazine, <br/>\nPO Box 1083, Tonasket WA 98855; for orders: toll-free 1-800-236-3278; <br/>\nemail orders@... . MC/Visa cards accepted. DON&#39;T <br/>\nMISS IT! ***<br/>\n<br/>\n_________<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nFINAL WORD<br/>\n<br/>\nhttp://www.send4fun.com/presidentdance.htm<br/>\n<br/>\n<br/>\n^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^%^<br/>\n<br/>\nThanks for reading HEM&#39;s Online News! Pass it on to your friends! To <br/>\nsubscribe, visit our web site at <br/>\nhttp://www.home-ed-magazine.com/wlcm_hemnewsltr.html or send an email <br/>\nto majordomo@... with the words subscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. subscribe hem-online-newsletter <br/>\nyouremailaddress). To unsubscribe, send an email to <br/>\nmajordomo@... with the words unsubscribe <br/>\nhem-online-newsletter followed by your name@your address.com in the <br/>\nbody of the email. (e.g. unsubscribe hem-online-newsletter <br/>\nyouremailaddress). To change the address at which you receive the <br/>\nnewsletter, unsubscribe your old address and then subscribe to your <br/>\nnew one.<br/>\n<br/>\nSee you next month!<br/>\n<br/>\nCarol Narigon, Newsletter Editor<br/>\nHEM-Newsletter@...<br/>\nMark and Helen Hegener, Publishers of Home Education Magazine</div>","specialLinks":[]}],"prevTopicId":31963,"nextTopicId":31962}}