{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":48651385,"authorName":"athom &lt;tessimal@yahoo.com&gt;","from":"&quot;athom &lt;tessimal@...&gt;&quot; &lt;tessimal@...&gt;","profile":"tessimal","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Homecomings & Proms v. Homeschool","postDate":"1046350632","msgId":59712,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGIzbDF2OCtqajJpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYyMUdkNHRvMm10WmRhU2ZtQzgwMDAxZGIxYkBob3RtYWlsLmNvbT4="},"prevInTopic":59707,"nextInTopic":0,"prevInTime":59711,"nextInTime":59713,"topicId":59707,"numMessagesInTopic":0,"msgSnippet":"... My daughter will readily admit her first reason for wanting to go to school.  It s for the social stuff. The people, her friends, all the daily","messageBody":"<div id=\"ygrps-yiv-369388384\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Unschooling-dotcom@yahoogroups.com\">Unschooling-dotcom@yahoogroups.com</a>, &quot;Mary Bianco&quot; &gt; <br/>\n&lt;&gt;My daughter will readily admit her first reason for wanting to go <br/>\nto school.  It&#39;s for the social stuff. The people, her friends, all <br/>\nthe daily interaction, the homecomings and proms. Funny thing is of <br/>\nthe latter two, she hasn&#39;t gone to any yet!!!&lt;&gt;<br/>\n<br/>\nMy daughter started out in what appeared to be a good supportive home <br/>\neducation environment with a large homeschool support group that <br/>\ncalled itself inclusive.  The reality was something else we soon <br/>\nlearned, and ultimately she ended up being the only homeschooler in <br/>\nthis large group who was officially banned from the homeschool prom, <br/>\na small rather expensive affair organized by a small group of moms <br/>\nfrom this homeschool support group.  Now, this was not the first time <br/>\nshe had experienced exclusion from members of this group, but this <br/>\nwas the first time we were officially notified of her exclusion.  <br/>\n<br/>\nWhy?  Was she some sort of miscreant?  Did she have a behavior <br/>\nproblem?  Was she known for her wildness and unsocial attitudes?  <br/>\nNope.  She is, in fact, an extremely disciplined competitive figure <br/>\nskater aiming for the U. S. Nationals in the next few years.  She is <br/>\npretty and congenial, and bright, a high achiever involved in lots of <br/>\noutside social and volunteer activities, educational and <br/>\nphilanthropic groups and projects.  <br/>\n<br/>\nSo why was she excluded?  No one felt that they had to give a <br/>\nreason.  But some did spread lies and rumors.  One mother told the <br/>\ngroup of organizing mothers that I had phoned her inquiring about <br/>\nwhether or not my daughter could attend this prom, that I had argued <br/>\nwith her, and that she had told me clearly that my daugther was not <br/>\nwelcome, then I had hung up on her.  None of which is true; never <br/>\nhappened.  I never called anyone to inquire about my daughter <br/>\nattending this prom.  She goes to several proms and formal dances <br/>\nevery year, as a guest of the friends she has made through her other <br/>\norganizational activities outside the home education world.  As a <br/>\nmatter of fact, on the very day this exclusive little homeschool prom <br/>\nwas supposed to take place she had already accepted an invitation to <br/>\nattend another formal dance, a very fancy one at one of the best and <br/>\nbiggest schools in our metropolitan area.  So she had never even <br/>\nthought about going to this homeschool prom.  <br/>\n<br/>\nOn the other hand, I had inquired via my e-list about this prom, so <br/>\nthat I could post the information, all the facts, on my homeschool e-<br/>\nlist for other homeschooled teens who might be interested.  I had no <br/>\nidea about what was going on behind the scenes in this group of moms <br/>\nwho were organizing this event.  I do know that I wasn&#39;t getting <br/>\nresponses to my email queries for information.  But since it wasn&#39;t <br/>\nsomething I was personally concerned about I didn&#39;t really care one <br/>\nway or the other, just tried to get the basic info to post for other <br/>\nhomeschoolers who might be interested, which I do every day for all <br/>\nkinds of activities that I learn about.  <br/>\n<br/>\nFinally I received an email from one of the moms informing me that my <br/>\ndaughter had been banned from this homeschool prom, not giving any <br/>\nreason, of course, just informing me that I should not have made that <br/>\nphone call to one of the moms, should not have hung up on her.  <br/>\nWow!!!  The lengths to which some people will go to justify their <br/>\nbigotry and bad behavior.  I was stunned by this email.  But the <br/>\nsmall-mindedness of some of the local homeschoolers had more than <br/>\ncome home to me in the past, which is why we made every effort to <br/>\nexpand my daughter&#39;s circle of friends and activities way beyond the <br/>\nhome education crowd. <br/>\n<br/>\nToday she attends a number of proms and formals throughout the year, <br/>\nall at area high schools, as a guest of other teens she has met in <br/>\nall her different activities.  What&#39;s more she always designs and <br/>\nmakes her own prom dresses since one of her career interests is <br/>\nfashion design.  This month&#39;s floor length slinky shimmery gown was a <br/>\nbig hit, costing her a grand total of $5.  She went with a date who <br/>\nwas the star of the whole dance since he was the best dancer there, <br/>\nhad circles of other dancers standing around him most of the evening, <br/>\nlines of girls trying to get a dance with him, often dancing with as <br/>\nmany as six girls simultaneously.  He, too, was a guest at this <br/>\nformal dance, as was my daughter, both invited by one of my <br/>\ndaughter&#39;s good friends.  My daughter had to share him for many of <br/>\nthe dances, but she didn&#39;t mind at all.  She had lots of other <br/>\nfriends there that she wanted to dance with so she enjoyed the <br/>\nprivilege of being the only one this handsome and well-liked young <br/>\nman chose to dance with for all the slow dances, which made her very <br/>\nspecial indeed.  <br/>\n<br/>\nWhat did she miss by being banned, shunned, from the homeschool <br/>\nprom?  She missed attending an expensive and very exclusive little <br/>\ndance with a small group of small-minded people.  Instead she has <br/>\nattended, and continues to attend, a string of wonderful proms and <br/>\nformal dances throughout our greater metropolitan area, with lots of <br/>\nfriends she knows at these dances, and the opportunity to make many <br/>\nnew friends, too.  She finds herself very socially comfortable in a <br/>\nwide variety of situations, and has a great sense of social self-<br/>\nconfidence.  And she has never had to attend a single day of public <br/>\nor private school to enjoy all these social benefits from the <br/>\ninstitutionalized teen high school scene.   <br/>\n<br/>\nI guess the moral of my story is for home educators not to limit <br/>\nthemselves to our small home education communities and groups, <br/>\nespecially as our children enter their teen years.  A whole big <br/>\nwonderful world is waiting for their participation, and often the <br/>\nbest things do not come from the immediate circle of home education <br/>\nsupport group activities.  By encouraging my daughter to pursue her <br/>\ninterests, to involve herself in a wide variety of activities, all of <br/>\nwhich have greatly expanded her social circles, she has even more <br/>\nsocial and civic options open to her than the average high schooler.  <br/>\nShe does not see the world in terms of a cheerleading letter sweater, <br/>\nor one high school athletic team, or one pre-determined group of <br/>\nfriends who come from the pool who get shuffled into one specific <br/>\neducational institution.  I think she is way ahead on the social <br/>\nintegration end of things.<br/>\n<br/>\nNorma</div>","specialLinks":[]},{"userId":99826381,"authorName":"Mary Bianco","from":"&quot;Mary Bianco&quot; &lt;mummyone24@...&gt;","profile":"mummyone24","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"unschooling school? was unschool math","postDate":"1046334781","msgId":59707,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYyMUdkNHRvMm10WmRhU2ZtQzgwMDAxZGIxYkBob3RtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":59712,"prevInTime":59706,"nextInTime":59708,"topicId":59707,"numMessagesInTopic":0,"msgSnippet":"... ","messageBody":"<div id=\"ygrps-yiv-1291463710\"><blockquote><span title=\"ireply\">&gt;From: Have a Nice Day! &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:litlrooh@...\">litlrooh@...</a>&gt;<br/>\n<br/>\n </span></blockquote>&lt;&lt;His attitude toward school is that it is stupid but he wants to be with <br/>\nhis friends.  I figure it he feels that way, he&#39;ll come home before he gets <br/>\ninto trouble over it.  I think he just wants to decide if its worth it to be <br/>\nwith his friends and I don&#39;t think it will take long for him to decide.&gt;&gt;<br/>\n<br/>\n<br/>\nMy daughter will readily admit her first reason for wanting to go to school. <br/>\nIt&#39;s for the social stuff. The people, her friends, all the daily <br/>\ninteraction, the homecomings and proms. Funny thing is of the latter two, <br/>\nshe hasn&#39;t gone to any yet!!! She figures it should be special and she&#39;s <br/>\nsaving homecoming and prom for her last year. Go figure. Maybe they aren&#39;t <br/>\nall as important as she thought. Maybe again she just likes the idea of <br/>\nhaving the choice and being able to say no. Tara has always had this power <br/>\nstruggle going on with herself and others. I think that&#39;s half the thing <br/>\nabout school. Pushing the line a little but not being over it. Of course I <br/>\nwas the same way in school. Never really in trouble but always pushing it <br/>\nwith teachers and rules enough to get noticed. I understand Tara. That&#39;s <br/>\ngood for us both!<br/>\n<br/>\nThe second thing that Tara finds interesting is the validation. She likes <br/>\nseeing herself being good at something instead of just knowing it and <br/>\nhearing it from us. The paper and accolades count for her. That&#39;s her and if <br/>\nthat&#39;s what she needs and wants, I&#39;m with her. I can actually see the last <br/>\nyear undoing all the crap the schools did to her previously. It was our <br/>\nwhole attitude change and I have this list to partly thank for stressing <br/>\nthat to me. It has made a difference, even if we are talking school. Again <br/>\nwe&#39;re talking choices. I just really hope none of the other 3 want to go <br/>\nthat way.&lt;bg&gt; Hypocritical I guess but hopeful none the less.<br/>\n<br/>\nMary B<br/>\n<br/>\n<br/>\n_________________________________________________________________<br/>\nSTOP MORE SPAM with the new MSN 8 and get 2 months FREE*  <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://join.msn.com/?page=features/junkmail\">http://join.msn.com/?page=features/junkmail</a></div>","specialLinks":[]}],"prevTopicId":59705,"nextTopicId":59700}}