{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":58541700,"authorName":"Betty Holder","from":"&quot;Betty Holder&quot; &lt;ninnyridge03@...&gt;","profile":"ninnyridge03","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Humbled and enlightened (somewhat)","postDate":"1021339409","msgId":37033,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWUwMWMxZmFlNSRmNzJhOGJlMCQzZDlhZDU0M0BqMXUxdTI+"},"prevInTopic":0,"nextInTopic":37034,"prevInTime":37032,"nextInTime":37034,"topicId":37033,"numMessagesInTopic":0,"msgSnippet":"Ok, I stand before you humbled with head down.  I can easily see your point in watching TV with your kids. (I even do that some ,too) I guess it makes sense if","messageBody":"<div id=\"ygrps-yiv-1102710773\">Ok, I stand before you humbled with head down.  I can easily see your point in watching TV with your kids. (I even do that some ,too) I guess it makes sense if you LIMIT them to certain programs and limit the amount of time with the TV they would become curious about what they&#39;re not allowed to watch.  Mine is no different.  He is limited to a certain amount of time with it tho.  I do not FORBID him to watch it but if I had my way there would not be one in the house.  But I don&#39;t make his life miserable concerning it (at least I don&#39;t think so &lt;g&gt;)<br/>\nLet me try to explain why my views on TV are so tainted.  I was married at a very young age  to a man who could watch TV 24 hours a day.  He *never had time* to do anything around the house.  I have seen him get up on Saturday morning and sack out on the couch until it signed off that night, watching ANYTHING & EVERYTHING that came on.  He only got up to get food and a beer or soft drink that he carried back to the couch.  The only conversation I could have with him was during the commercials.<br/>\nMy self control was enormous, because you don&#39;t know how many times I ALMOST throwed something through the TV.  So when I hear someone talk about watching ALL YOU WANT TO I think back to my situation then.<br/>\nOK, he grew up without TV and I think he was totally in awe of it.  By the time I divorced him  I had come to HATE it.  I still do.  I hate the time that is wasted with it.  I know there are some good things on it but it takes away from family interaction.  <br/>\nBut we each have our way of raising our children, to the best of our abilities. And I respect your choice of how you choose to do that.  This is a wonderful place to voice our opinions and be enlightened from other peoples opinion, too.  I love reading and learning from all of you.<br/>\nThanks for the support.<br/>\nBetty<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1798873,"authorName":"PSoroosh@aol.com","from":"PSoroosh@...","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [Unschooling-dotcom] Humbled and enlightened (somewhat)","postDate":"1021337312","msgId":37034,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIzLjFlMjU0MTdjLjJhMTFiOGUwQGFvbC5jb20+"},"prevInTopic":37033,"nextInTopic":0,"prevInTime":37033,"nextInTime":37035,"topicId":37033,"numMessagesInTopic":0,"msgSnippet":"In a message dated 5/13/2002 3:29:02 PM Pacific Daylight Time, ... I know someone like that and it interferes HORRIBLY with family life. I don t blame you at","messageBody":"<div id=\"ygrps-yiv-416845804\">In a message dated 5/13/2002 3:29:02 PM Pacific Daylight Time, <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ninnyridge03@...\">ninnyridge03@...</a> writes:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My self control was enormous, because you don&#39;t know how many times I ALMOST <br/>\n&gt; throwed something through the TV.  So when I hear someone talk about <br/>\n&gt; watching ALL YOU WANT TO I think back to my situation then.<br/>\n<br/>\n </span></blockquote>I know someone like that and it interferes HORRIBLY with family life. I don&#39;t <br/>\nblame you at all.<br/>\n<br/>\nI wonder if that guy had the kind of life that our unschooled kids had, <br/>\nthough. <br/>\n<br/>\nThere is a difference between not believing that restrictions on tv are <br/>\nefficacious versus seeing our kids watch hour after hour, day after day, of <br/>\ngruesome, scary, violent or too-sexual programming or EVEN hour after hour, <br/>\nday after day, of nothing but cartoons or other stuff (even really good <br/>\nstuff) and not worrying about it - just letting it go on for months or years. <br/>\nI&#39;d worry about my kid even if she watched hour after hour, day after day of <br/>\ndiscovery channel &lt;g&gt;. I&#39;d suspect depression or avoidance of something. On <br/>\nthe other hand, if my kid had just come out of school, I&#39;d chalk it up to <br/>\ndecompression and let it go for a long long time while slowly enticing her <br/>\nand supporting her in other interests.<br/>\n<br/>\nRight now, my 11 yo is watching something on Nicktoons. It isn&#39;t anything <br/>\nI&#39;ve seen before - she&#39;s watching because she just came home from an <br/>\novernighter and she&#39;s exhausted and I suspect she&#39;ll soon fall asleep. If <br/>\nnot, it is just a break from the world for a while - sort of hoping nobody <br/>\nwill bother her since she appears, at least, to be busy. Not a bad strategy <br/>\naround here. I want the dishwasher unloaded &lt;G&gt;, but I won&#39;t bother her - I <br/>\nget the message loud and clear.<br/>\n<br/>\n--pamS<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":37020,"nextTopicId":37036}}