{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":21,"messages":[{"userId":274801552,"authorName":"HA","from":"&quot;HA&quot; &lt;verbiosa@...&gt;","profile":"verbiosa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Decision time","postDate":"1303663372","msgId":60802,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlwMWp1YysxMHR1bkBlR3JvdXBzLmNvbT4=","inReplyToHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+"},"prevInTopic":60799,"nextInTopic":0,"prevInTime":60801,"nextInTime":60803,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"Personally, I think men want to feel like heroes to their families, and that you ll have a much harder time fixing problems if that element is missing. The","messageBody":"<div id=\"ygrps-yiv-2062978120\">Personally, I think men want to feel like heroes to their families, and that you&#39;ll have a much harder time fixing problems if that element is missing. The question is - how can you help your husband feel that way, and how can you request changes in a way that help him feel like he&#39;s adding something wonderful vs. making up for things he&#39;s done wrong?<br/>\n<br/>\nI&#39;m not saying it HAS to be done that way, or that he deserves to feel better before you do, but it&#39;s a much happier experience for everyone.<br/>\n<br/>\nI&#39;m not an expert, but that has been my experience. Two books that have some good insight (though I would read through them both first before trying out any advice) are: Men are From Mars, Women are From Venus and How to Improve Your Marriage Without Talking About It.<br/>\n<br/>\nHilary</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303592979","msgId":60799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIxMTgzNi4xNzk4MS5xbUB3ZWIxMTA0MDEubWFpbC5ncTEueWFob28uY29tPg==","inReplyToHeader":"PDFGMUMyNUYzLURBQUItNDFFRC1CMzlGLTM4MjMyQUVFQjlDM0B5YWhvby5jb20+","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+IDxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPiA8NjY1MkIzMjgtNDlENS00QTAwLTkwQUItMUMyMDJGOUQ0OEYyQFNhbmRyYWRvZGQuY29tPiA8MUYxQzI1RjMtREFBQi00MUVELUIzOUYtMzgyMzJBRUVCOUMzQHlhaG9vLmNvbT4="},"prevInTopic":60792,"nextInTopic":60802,"prevInTime":60798,"nextInTime":60800,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"***It would be unfair of me to say that DH does not support in other ways -- he is doing all the childcare during the week when I m working. But in terms of ","messageBody":"<div id=\"ygrps-yiv-986119760\">***It would be unfair of me to say that DH does not support in other ways -- he <br/>\nis doing all the childcare during the week when I&#39;m working. But in terms of <br/>\nwhat DH feeds me emotionally -- I feel pretty much like I&#39;m running on empty.***<br/>\n<br/>\nIt is a common misconception when a woman feels that a husband isn&#39;t feeding her <br/>\nemotionally.  Very often, the husband feels like he is doing that, but the woman <br/>\ndoesn&#39;t feel it.  It is partly the difference between men and women and partly a <br/>\ndifference in personality in how each person gives and receives emotional care <br/>\nand what that looks like.<br/>\n<br/>\nThis goes a bit outside of the confines of unschooling, but if each person <br/>\nwithin the marriage can figure out how to feed their own emotional health, fill <br/>\nthemselves up to the spilling point, they can give more fully to the other <br/>\npartner and not take from the other partner to fill themselves up.<br/>\n<br/>\nIt helps me enormously if I don&#39;t see it as a give and take, but a filling <br/>\nmyself up and giving more.  It doesn&#39;t mean that each person can&#39;t have moments <br/>\nof feeling less full and relying on their partner to help.  <br/>\n<br/>\n***Did you seasoned Unschoolers have peaceful, joyful marriages before you <br/>\nstarted Unschooling?***<br/>\n<br/>\nA big thing that happened while unschooling, was changing my perspective on how <br/>\nto help others.  If you meet a child where they are at, then you can do that for <br/>\nyour partner too.  Unschooling changed how I expected things of others, mostly <br/>\nmy children, but the idea extended itself to other relationships.  If I don&#39;t <br/>\nexpect my child to read when they aren&#39;t yet able, should I expect my husband to <br/>\nmeet my emotional needs if he is unable, or unaware of them, or emotionally not <br/>\nat his own optimal health?  If a child is doing the best that he or she is able <br/>\nto do and thriving and learning all the time within a happy environment, then it <br/>\nhelps to assume that my partner is too.  So, work to create that happy <br/>\nenvironment in which your family will thrive.<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303532960","msgId":60792,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJBTkxrVGltT0FNcE03dDFtNlk0TUNzTWQ2RHU3dXAwcFV3QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDFGMUMyNUYzLURBQUItNDFFRC1CMzlGLTM4MjMyQUVFQjlDM0B5YWhvby5jb20+","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+CTw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+CTxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPgk8NjY1MkIzMjgtNDlENS00QTAwLTkwQUItMUMyMDJGOUQ0OEYyQFNhbmRyYWRvZGQuY29tPgk8MUYxQzI1RjMtREFBQi00MUVELUIzOUYtMzgyMzJBRUVCOUMzQHlhaG9vLmNvbT4="},"prevInTopic":60789,"nextInTopic":60799,"prevInTime":60791,"nextInTime":60793,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"... I wonder if he feels under-appreciated?  Being the stay at home parent can be exhausting and lonely work.  Maybe he has doubts about his ability to be the","messageBody":"<div id=\"ygrps-yiv-801036446\">On Fri, Apr 22, 2011 at 5:08 AM, catfish_friend &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:catfish_friend@...\">catfish_friend@...</a>&gt;wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; On Apr 21, 2011, at 8:15 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;sometimes I want to be the one who gets supported and soothed by DH.<br/>\n&gt; And it seems I don&#39;t get that support nearly as much as I&#39;d like<br/>\n&gt; to.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n&gt;<br/>\n </span></blockquote>I wonder if he feels under-appreciated?  Being the stay at home parent can<br/>\nbe exhausting and lonely work.  Maybe he has doubts about his ability to be<br/>\nthe caregiver, maybe doubts that you have nurtured because he doesn&#39;t do<br/>\nthings the way that you would.  Never mind that people are different from<br/>\none another and so each person will do things differently, not just because<br/>\nhe is male and you&#39;re female.<br/>\n<br/>\nA friend of mine once complained about how her husband cleaned the<br/>\nbathroom.  My response was that I would be grateful that he cleaned it.  She<br/>\nagreed and stopped re-doing the work that he did and thanked him instead.<br/>\nHe then started doing a better job at cleaning in general.  One day she was<br/>\nreally impressed with how he cleaned something and said as much, he<br/>\nresponded that when he realized that she wasn&#39;t going to re-do his work then<br/>\nhe would have to do a good job.  This is a true story!!<br/>\n<br/>\nIs your husband the person doing the at home work or is he &quot;filling in&quot; for<br/>\nyou?  It seems that you may need to look at the way he does things with a<br/>\ndifferent perspective and with gratitude in your heart.<br/>\n<br/>\nMy husband taught me to value all roles in the family and how each person<br/>\nfills those roles.  We are each fulfilling a vital role in the family.<br/>\nCircumstances dictated who filled which role, I hated my job and he liked<br/>\nhis and quickly reached a point where he was making far more money than I<br/>\never would as a social worker.  We both try to remember to thank each other<br/>\nfor what we do.  Also, we both know where we fall short and so we avoid<br/>\ncriticism.  If we have a need, we state it honestly and with an &quot;I&quot;<br/>\nstatement.  Also, we understand that we are each responsible for our own<br/>\nhappiness.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;I had a conversation with a girlfriend who suggested that it&#39;s<br/>\n&gt; our lot as women to be the caregivers -- not just as mothers to our<br/>\n&gt; children, but to everyone. She and I felt similarly -- it gets frustrating<br/>\n&gt; to give and give when it seems that not much is returned when it comes our<br/>\n&gt; own needs of our partners.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>This is a really old whine.  We are only abused by our own permission.   If<br/>\nyou do not like what is happening, how is your behavior contributing to your<br/>\nunhappiness?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;It would be unfair of me to say that DH does not support in<br/>\n&gt; other ways -- he is doing all the childcare during the week when I&#39;m<br/>\n&gt; working. But in terms of what DH feeds me emotionally -- I feel pretty much<br/>\n&gt; like I&#39;m running on empty.&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Is your husband tired and feeling under &quot;fed&quot; emotionally?  Do you listen to<br/>\nhim?  When you talk, is it to him or at him?  Do you talk with each other at<br/>\nall?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Many times when we are stressed and busy we either don&#39;t have or make the<br/>\n </span></blockquote>time to talk to our spouse, then get resentful that they aren&#39;t listening<br/>\nand that leads to getting angry and putting a lot of negative context into<br/>\nevery exchange between the two of you.  For example seeing the burned toast<br/>\nas an intentional insult.<br/>\nChris<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Decision time","postDate":"1303503798","msgId":60789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvc28zbStsbGk4QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFGMUMyNUYzLURBQUItNDFFRC1CMzlGLTM4MjMyQUVFQjlDM0B5YWhvby5jb20+"},"prevInTopic":60788,"nextInTopic":60792,"prevInTime":60788,"nextInTime":60790,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"... ***************** A lot of social issues play into that, one of which is the expectations that our partners *should* be the ones to fill up our needs on an","messageBody":"<div id=\"ygrps-yiv-31348525\">catfish_friend &lt;catfish_friend@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;I had a conversation with a girlfriend who suggested that it&#39;s our lot as women to be the caregivers -- not just as mothers to our children, but to everyone.  She and I felt similarly -- it gets frustrating to give and give when it seems that not much is returned when it comes our own needs of our partners.<br/>\n </span></blockquote>*****************<br/>\n<br/>\nA lot of social issues play into that, one of which is the expectations that our partners *should* be the ones to fill up our needs on an emotional level, when many men aren&#39;t really able to do that (through socialization and/or nature). So we&#39;re set up to expect something we can&#39;t get. Shifting your expectations and your perceptions can help. What can you do to get your own needs met better and sooner, so you&#39;re not running on empty?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;It would be unfair of me to say that DH does not support in other ways -- he is doing all the childcare during the week when I&#39;m working.  But in terms of what DH feeds me emotionally -- I feel pretty much like I&#39;m running on empty.<br/>\n </span></blockquote>********************<br/>\n<br/>\nShift your perception to see giving labor and time as an act of love in and of itself. It feels like an act of love to many people! Maybe he&#39;s expressing his love and support for you in ways that don&#39;t &quot;read&quot; as lovey and supportive to you, but you can change what you expect to see. A man choosing to step out of role and do childcare is expressing love in a big, big way - its getting more acceptable but its still a little outre to be a stay at home dad. Your husband is fighting against his upbringing and a lot of cultural messages about masculinity every day - that&#39;s big. That&#39;s a Lot of love. <br/>\n<br/>\nAlso keep in mind that we&#39;re giving advice about what You can do because you&#39;re the one writing in. It won&#39;t help you to have a litany of &quot;he shoulds&quot; in your mind. He&#39;s doing the best he can - so what can You do to help his best be better? Most of what you can do is change your own behavior to support him. That doesn&#39;t mean you should never say &quot;it would help me if you could do x&quot; - but you&#39;ll get more milage out of requests like that if you&#39;ve set yourself up as someone who can be counted on to be supportive. Just like with kids, where requests are more likely to be acted on when *they&#39;ve* felt supported, but asking allll the time tends to bring a degree of shutdown. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Decision time","postDate":"1303501245","msgId":60788,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvc2xqdCszZ3N1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDFGMUMyNUYzLURBQUItNDFFRC1CMzlGLTM4MjMyQUVFQjlDM0B5YWhvby5jb20+"},"prevInTopic":60786,"nextInTopic":60789,"prevInTime":60787,"nextInTime":60789,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"===Did you seasoned Unschoolers have peaceful, joyful marriages before you started Unschooling?=== Before is not nearly as important as today, as right now. ","messageBody":"<div id=\"ygrps-yiv-45992866\">===Did you seasoned Unschoolers have peaceful, joyful marriages before you started Unschooling?===<br/>\n<br/>\n&quot;Before&quot; is not nearly as important as today, as right now.<br/>\n<br/>\n<br/>\n===I had a conversation with a girlfriend who suggested that it&#39;s our lot as women to be the caregivers -- not just as mothers to our children, but to everyone.===<br/>\n<br/>\n&quot;Our lot in life&quot; is such a negative viewpoint. <br/>\n<br/>\nWhat&#39;s wrong with being a caregiver to your family, someone who gives care? I don&#39;t mind giving care to my husband or my son or my stepson. Or, for that matter, my parents and stepparents, my nieces and nephews, and my brothers and sisters-in-law. <br/>\n<br/>\nI feel fortunate to have people in my life for whom I care and who care for me. We each express that care for each other in different ways, because we each have different strengths.<br/>\n<br/>\nIf you have the expectation that your husband will express his care for you in &quot;x&quot; way, you&#39;re setting yourself up for disappointment.<br/>\n<br/>\nHow would you feel if your husband and one of his friends had a discussion about how it&#39;s husbands&#39; lot in life to be married to women who don&#39;t appreciate what their husbands do? Wouldn&#39;t that feel disrespectful of you? Sometimes it helps, before joining in on a bitch session about husbands, to think about how you&#39;d feel if it was your husband joining in a similar conversation about wives with his friends. <br/>\n<br/>\n<br/>\n===But in terms of what DH feeds me emotionally -- I feel pretty much like I&#39;m running on empty.===<br/>\n<br/>\nPerhaps your husband is feeling the same way. <br/>\n<br/>\nWhen you give of yourself lovingly, because you want to not because you feel you &quot;should&quot;, when you&#39;re not keeping track of who&#39;s done what for who (whom?) lately, that running-on-empty-emotionally feeling will begin to go away.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303485508","msgId":60786,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDBGNENDODkyLTI1NkQtNDQ4Ri04NEQyLTQwOTAxQjQwMjY0N0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDFGMUMyNUYzLURBQUItNDFFRC1CMzlGLTM4MjMyQUVFQjlDM0B5YWhvby5jb20+","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+IDxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPiA8NjY1MkIzMjgtNDlENS00QTAwLTkwQUItMUMyMDJGOUQ0OEYyQFNhbmRyYWRvZGQuY29tPiA8MUYxQzI1RjMtREFBQi00MUVELUIzOUYtMzgyMzJBRUVCOUMzQHlhaG9vLmNvbT4="},"prevInTopic":60785,"nextInTopic":60788,"prevInTime":60785,"nextInTime":60787,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"-=-I am aware of this. Yet, -=- Yeah, but... -=-I am aware of this. Yet, there are times I feel resentment -=- Your posts are filled with resentment and","messageBody":"<div id=\"ygrps-yiv-1396072433\">-=-I am aware of this. Yet, -=-<br/>\n<br/>\n&quot;Yeah, but...&quot;<br/>\n<br/>\n-=-I am aware of this. Yet, there are times I feel resentment -=-<br/>\n<br/>\nYour posts are filled with resentment and negativity.<br/>\n<br/>\n-=-sometimes I want to be the one who gets supported and soothed by DH. And it seems I don&#39;t get that support nearly as much as I&#39;d like to.-=-<br/>\n<br/>\nIf you keep playing freeze-out, neither of you will get support or soothing.<br/>\nIf you&#39;re not willing to give more than 50% (if you don&#39;t aim for giving all), you won&#39;t get anything back.<br/>\n<br/>\n-=-I had a conversation with a girlfriend who suggested that it&#39;s our lot as women to be the caregivers -- not just as mothers to our children, but to everyone. She and I felt similarly -- it gets frustrating to give and give -=-<br/>\n<br/>\nIt doesn&#39;t sound like you&#39;re giving and giving.  It sounds, from what you&#39;ve written, that you&#39;re resenting and resenting, and counting and measuring.<br/>\n<br/>\n-=-. It would be unfair of me to say that DH does not support in other ways -- he is doing all the childcare during the week when I&#39;m working. But in terms of what DH feeds me emotionally -- I feel pretty much like I&#39;m running on empty.-=-<br/>\n<br/>\n&quot;What DH feeds me emotionally&quot; sounds awful.  It&#39;s a bad way to think of it, that you are hungry and it&#39;s his job to &quot;feed you emotionally.&quot;<br/>\n<br/>\n-=-I feel pretty much like I&#39;m running on empty.-=-<br/>\n<br/>\nYou&#39;re exhaling and not inhaling.  You&#39;re pouring out frustration and negativity.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/breathing\">http://sandradodd.com/breathing</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303480800","msgId":60785,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM0MTg0Ny4zMDk5OC5xbUB3ZWI4NjIwNC5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDcwNjI4LjIzNzcucW1Ad2ViODYyMDgubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+IDxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPiA8NjY1MkIzMjgtNDlENS00QTAwLTkwQUItMUMyMDJGOUQ0OEYyQFNhbmRyYWRvZGQuY29tPiA8MUYxQzI1RjMtREFBQi00MUVELUIzOUYtMzgyMzJBRUVCOUMzQHlhaG9vLmNvbT4gPDcwNjI4LjIzNzcucW1Ad2ViODYyMDgubWFpbC5pcmQueWFob28uY29tPg=="},"prevInTopic":60784,"nextInTopic":60786,"prevInTime":60784,"nextInTime":60786,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"________________________________ I had a conversation with a girlfriend who suggested that it s our lot as women to be the caregivers -- not just as mothers to","messageBody":"<div id=\"ygrps-yiv-1812656900\">________________________________<br/>\nI had a conversation with a <br/>\ngirlfriend who suggested that it&#39;s our lot as women to be the caregivers -- not <br/>\njust as mothers to our children, but to everyone.  She and I felt similarly -- <br/>\nit gets frustrating to give and give when it seems that not much is returned <br/>\nwhen it comes our own needs of our partners.<br/>\n<br/>\n=====================================<br/>\n<br/>\nI think divorce is contagious, to some extent. I think it is easy to feel worse <br/>\nabout your life when you sit around with other people exploring the negatives. <br/>\nThe less I talk to other people about the things that are bad and grim and sad <br/>\nand upsetting, the less I think about those things period. It does cut down on a <br/>\nlot of girlfriend kinds of chat, but it certainly has made my marriage and my <br/>\nparenting happier. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303479207","msgId":60784,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRDOEY3RUUxLTQzNDMtNENBMi1BQzdCLTIwMUYwNTgwQzgwRUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEREQkM1NzFDLUU1RjMtNDUyNS1CMDJFLUQyNjcxQTFDNzc2RkB5YWhvby5jb20+","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+IDxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPiA8NjY1MkIzMjgtNDlENS00QTAwLTkwQUItMUMyMDJGOUQ0OEYyQFNhbmRyYWRvZGQuY29tPiA8RERCQzU3MUMtRTVGMy00NTI1LUIwMkUtRDI2NzFBMUM3NzZGQHlhaG9vLmNvbT4="},"prevInTopic":60783,"nextInTopic":60785,"prevInTime":60783,"nextInTime":60785,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"-=- As much as I read here and on your (Sandra s) and Joyce s websites, I seem to slide right back into schoolish ways... -=-How long does it take to really","messageBody":"<div id=\"ygrps-yiv-2033035054\">-=- As much as I read here and on your (Sandra&#39;s) and Joyce&#39;s websites, I seem to slide right back into schoolish ways...<br/>\n<br/>\n-=-How long does it take to really break that bad habit?-=-<br/>\n<br/>\nForever.<br/>\nIf you think of it in negative terms (&quot;bad&quot; and not just &quot;break&quot; but &quot;really break&quot;), you will just sit in that negativity, frustrated, forever.  You will feel there had to be a winner (you) or a loser (you) and you will be angry with yourself.<br/>\n<br/>\nThe change you need is to live a different way.  Step out of the grumpy dark into the calm decision-making choose-joy light.<br/>\n<br/>\nStop thinking about your own comfort for a while.  If you become successful at attending to other people&#39;s comfort, their comfort will overflow all around you, and you will feel your success and that will be some of YOUR new comfort.<br/>\n<br/>\nStop thinking you know what they need and what you need.  Try a new angle, a different trajectory.  <br/>\n<br/>\nI think you should play Angry Birds.  While you&#39;re playing, think about the huge difference made by a slightly different angle.  Put your desire to control into that for a few days, therapeutically.  While you&#39;re playing, think about what you can control, and why you would want to.   If you want to schedule and control and optimize and perfect, maybe clean out your spice rack, or pack away your winter clothes, or plant some flowers, all the while thinking about how much you love your family, and how beneficial real changes will be.<br/>\n<br/>\nLeave the old habit to wither.  Don&#39;t try to break it.  Move to making better choices so that what you used to do and used to think will be left in the &quot;choices I don&#39;t consider anymore&quot; category.<br/>\n<br/>\nThe links below might help, but reading them isn&#39;t what helps.   You can&#39;t read yourself to a new way of being.  Being has to do with BEing, not READing.  <br/>\n<br/>\n<br/>\nDecision time isn&#39;t about what you will do next year or for the rest of your child&#39;s life.  Decision time is about what you will do in the next five seconds.  I recommend getting up and doing something sweet for another person, wordlessly and gently.   Never send the bill; make it a gift you forget all about.  Do that again later in the day.  Don&#39;t tell us, don&#39;t tell them, just do it.<br/>\n<br/>\nThen maybe come back and read here and follow links.  Maybe not all at once. :-)<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2010/10/choosing-more-peace.html\">http://justaddlightandstir.blogspot.com/2010/10/choosing-more-peace.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2010/11/choosing-to-make-choices.html\">http://justaddlightandstir.blogspot.com/2010/11/choosing-to-make-choices.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2011/04/how-to-be-better-parent.html\">http://justaddlightandstir.blogspot.com/2011/04/how-to-be-better-parent.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2011/03/find-best.html\">http://justaddlightandstir.blogspot.com/2011/03/find-best.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2011/04/consider-your-legacy.html\">http://justaddlightandstir.blogspot.com/2011/04/consider-your-legacy.html</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://justaddlightandstir.blogspot.com/2011/03/peace-is-all-about-choices.html\">http://justaddlightandstir.blogspot.com/2011/03/peace-is-all-about-choices.html</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303473669","msgId":60783,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwNjI4LjIzNzcucW1Ad2ViODYyMDgubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PDFGMUMyNUYzLURBQUItNDFFRC1CMzlGLTM4MjMyQUVFQjlDM0B5YWhvby5jb20+","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+IDxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPiA8NjY1MkIzMjgtNDlENS00QTAwLTkwQUItMUMyMDJGOUQ0OEYyQFNhbmRyYWRvZGQuY29tPiA8MUYxQzI1RjMtREFBQi00MUVELUIzOUYtMzgyMzJBRUVCOUMzQHlhaG9vLmNvbT4="},"prevInTopic":60782,"nextInTopic":60784,"prevInTime":60782,"nextInTime":60784,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"It helps a lot if you look at what he is giving as a gift. Look at what he does do, look at how he expresses love, don t look for what you think love looks ","messageBody":"<div id=\"ygrps-yiv-1714389024\">It helps a lot if you look at what he is giving as a gift. Look at what he does <br/>\ndo, look at how he expresses love, don&#39;t look for what you think love looks <br/>\nlike, look at what he offers in loving ways. David takes care of things, the <br/>\ncars, the mould in the house, the income, creating new and fabulous food, those <br/>\nare his acts of love. He doesn&#39;t compliment me or buy me gifts or leave me <br/>\nlittle love notes. I don&#39;t think in any way that means he isn&#39;t a caregiver, or <br/>\nmy partner, or emotionally supportive. It does mean, though, that if I defined <br/>\nlove as gifts and compliments and love notes that David wouldn&#39;t love me under <br/>\nthose terms. So, I don&#39;t define love that way. Changing that perspective really <br/>\nhelped me to see exactly how much he does love me. <br/>\n<br/>\n<br/>\nThere is a book and a webpage about the languages of love: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.5lovelanguages.com/learn-the-languages/the-five-love-languages/.\">http://www.5lovelanguages.com/learn-the-languages/the-five-love-languages/.</a> I&#39;ve <br/>\nnot read the book, but have a glancing familiarity with the ideas. David is <br/>\ndefinitely an Acts of Service speaker whereas I&#39;m a words of affirmation person. <br/>\nRecognising the language that he is speaking let me see the hugely generous way <br/>\nin which he does care for me. <br/>\n<br/>\n<br/>\nOh, and unschooling definitely made a huge difference to how I am in my <br/>\nrelationship with David, as well as with other people. <br/>\n<br/>\n<br/>\nSchuyler. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: catfish_friend &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:catfish_friend@...\">catfish_friend@...</a>&gt;<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Friday, 22 April, 2011 10:08:38<br/>\nSubject: Re: [AlwaysLearning] Decision time<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Apr 21, 2011, at 8:15 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n&gt; Inside every man is a little boy. It&#39;s likely that his fears have to do with <br/>\n&gt;internal messages he has had in his life. Without supporting and soothing him <br/>\n&gt;and his fears, how will things change?<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI am aware of this.  Yet, there are times I feel resentment because sometimes I <br/>\nwant to be the one who gets supported and soothed by DH.  And it seems I don&#39;t <br/>\nget that support nearly as much as I&#39;d like to.  I had a conversation with a <br/>\ngirlfriend who suggested that it&#39;s our lot as women to be the caregivers -- not <br/>\njust as mothers to our children, but to everyone.  She and I felt similarly -- <br/>\nit gets frustrating to give and give when it seems that not much is returned <br/>\nwhen it comes our own needs of our partners.  It would be unfair of me to say <br/>\nthat DH does not support in other ways -- he is doing all the childcare during <br/>\nthe week when I&#39;m working.  But in terms of what DH feeds me emotionally -- I <br/>\nfeel pretty much like I&#39;m running on empty.<br/>\n<br/>\nDid you seasoned Unschoolers have peaceful, joyful marriages before you started <br/>\nUnschooling?<br/>\n<br/>\nThank you, again, for such an inspiring discussion!<br/>\n<br/>\nBest,<br/>\nCeci<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Decision time","postDate":"1303467076","msgId":60780,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvcms4NCtiZTlwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEREQkM1NzFDLUU1RjMtNDUyNS1CMDJFLUQyNjcxQTFDNzc2RkB5YWhvby5jb20+"},"prevInTopic":60779,"nextInTopic":60781,"prevInTime":60779,"nextInTime":60781,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"===As much as I read here and on your (Sandra s) and Joyce s websites, I seem to slide right back into schoolish ways. How long does it take to really break","messageBody":"<div id=\"ygrps-yiv-1926495310\">===As much as I read here and on your (Sandra&#39;s) and Joyce&#39;s websites, I seem to slide right back into schoolish ways. How long does it take to really break that bad habit?===<br/>\n<br/>\nEven if you read a lot, that&#39;s not the same as making the best choice each and every time you have an opportunity to make a choice.<br/>\n<br/>\nWhen I was new to unschooling, it took A LOT of conscious effort to stop and make the better choice, whereas nowadays it&#39;s generally second nature. But there&#39;s been a lot of years between &quot;new to unschooling&quot; and &quot;nowadays&quot;.<br/>\n<br/>\nWhat I did initially was pick one or two unschooling ideas and focus specifically on those for a period of time. I remember reminding myself *frequently* throughout the day and evening, &quot;say yes or some form of yes&quot; and &quot;why not?&quot; (when my son wanted to do something and my knee-jerk answer was about to be &quot;no&quot;). Those times when I immediately defaulted to &quot;no&quot; or &quot;in a minute&quot;, I would stop myself and say aloud to my son and myself, &quot;oh, you know what, forget that! sure we can do ___ / sure I can come play Pokemon with you right now&quot;. <br/>\n<br/>\nI vividly remember there being a point several years into unschooling when I realized that so many of the things that had taken conscious effort in the beginning, had become second nature for me at some point along the way. <br/>\n<br/>\nSo my answer would be, be conscious of what you&#39;re saying and doing. Be more aware of your thoughts. If you act or react in a knee-jerk way that doesn&#39;t help relationships with your family, apologize to them and make a different, better choice in that moment. <br/>\n<br/>\nI found it pretty easy to make the paradigm shift in my interactions with my son, but it was much harder to make that shift in my interactions with my husband. And that&#39;s still an ongoing change in our relationship, although it does come more naturally now -- but it&#39;s still not as seamless as it is for me in my interactions with my son. <br/>\n<br/>\nWhen I&#39;m tired or hungry or don&#39;t feel well, I have to be more thoughtful about how I talk to my husband and how I think about him, because it&#39;s easy for me to slip into a negative place and to focus on the things he didn&#39;t do that I wish he had or the things he did that annoyed me. <br/>\n<br/>\nOne of the best things I&#39;ve done for our marriage is to be more quiet when I&#39;m tired/hungry/not feeling well. In those instances, I&#39;m more prone to feel like snarking at my husband, or commenting on something he did / didn&#39;t do, or otherwise saying something that would be hurtful to him. <br/>\n<br/>\nWhat goes along with that, for me, is to remind myself of the things he *does* do. And also to remind myself that &quot;it&#39;s not all about ME!!&quot;. If the trash is full and he doesn&#39;t take it out when he heads outside, him not taking it has nothing whatsoever to do with me, in spite of what my tired/hungry/cranky brain may want to think in that moment ;-). <br/>\n<br/>\nWhen you&#39;re feeling competitive with your husband, be aware of what you&#39;re thinking and be aware of how easy it could be, in that moment, to snark at him. Then make the choice to not snark at him. And make the choice to think nice thoughts about him, to think about the nice things he does for you and your daughters. Be the one to make the better choice in that moment, to not say or do something that contributes to the competitiveness.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303463571","msgId":60779,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEREQkM1NzFDLUU1RjMtNDUyNS1CMDJFLUQyNjcxQTFDNzc2RkB5YWhvby5jb20+","inReplyToHeader":"PDY2NTJCMzI4LTQ5RDUtNEEwMC05MEFCLTFDMjAyRjlENDhGMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+IDxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPiA8NjY1MkIzMjgtNDlENS00QTAwLTkwQUItMUMyMDJGOUQ0OEYyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":60777,"nextInTopic":60780,"prevInTime":60778,"nextInTime":60780,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"... @@@@@@@@@@@@@ A much needed paradigm shift.  I feel like I have bad habits in my head that revolve around competition and scarcity.  As much as I read here","messageBody":"<div id=\"ygrps-yiv-1842812068\">On Apr 21, 2011, at 8:15 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think you have a &quot;there will be losers&quot; situation, rather than a teamwork &quot;We will love each other&quot; common goal.<br/>\n </span></blockquote>@@@@@@@@@@@@@<br/>\n<br/>\nA much needed paradigm shift.  I feel like I have bad habits in my head that revolve around competition and scarcity.  As much as I read here and on your (Sandra&#39;s) and Joyce&#39;s websites, I seem to slide right back into schoolish ways...<br/>\n<br/>\nHow long does it take to really break that bad habit?<br/>\n<br/>\nCeci</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303463318","msgId":60782,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFGMUMyNUYzLURBQUItNDFFRC1CMzlGLTM4MjMyQUVFQjlDM0B5YWhvby5jb20+","inReplyToHeader":"PDY2NTJCMzI4LTQ5RDUtNEEwMC05MEFCLTFDMjAyRjlENDhGMkBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+IDxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPiA8NjY1MkIzMjgtNDlENS00QTAwLTkwQUItMUMyMDJGOUQ0OEYyQFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":60781,"nextInTopic":60783,"prevInTime":60781,"nextInTime":60783,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"On Apr 21, 2011, at 8:15 AM, Sandra Dodd  wrote: ... I am aware of this.  Yet, there are times I feel resentment because sometimes I","messageBody":"<div id=\"ygrps-yiv-1314409480\"><blockquote><span title=\"qreply\">On Apr 21, 2011, at 8:15 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;<br/>\n&gt; Inside every man is a little boy. It&#39;s likely that his fears have to do with internal messages he has had in his life. Without supporting and soothing him and his fears, how will things change?<br/>\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\nI am aware of this.  Yet, there are times I feel resentment because sometimes I want to be the one who gets supported and soothed by DH.  And it seems I don&#39;t get that support nearly as much as I&#39;d like to.  I had a conversation with a girlfriend who suggested that it&#39;s our lot as women to be the caregivers -- not just as mothers to our children, but to everyone.  She and I felt similarly -- it gets frustrating to give and give when it seems that not much is returned when it comes our own needs of our partners.  It would be unfair of me to say that DH does not support in other ways -- he is doing all the childcare during the week when I&#39;m working.  But in terms of what DH feeds me emotionally -- I feel pretty much like I&#39;m running on empty.<br/>\n<br/>\nDid you seasoned Unschoolers have peaceful, joyful marriages before you started Unschooling?<br/>\n<br/>\nThank you, again, for such an inspiring discussion!<br/>\n<br/>\nBest,<br/>\nCeci </span></blockquote></div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303462560","msgId":60781,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDZGNDRBODZDLTFDQzYtNEQyQy1BMUQwLTkxQTNEQ0M4QTI1QkB5YWhvby5jb20+","inReplyToHeader":"PDVFRTI5NzBDLTQ5MEQtNDY2Ni05RDFCLUUwQkQ2MzMxOENBMUB2ZXJpem9uLm5ldD4=","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+IDxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPiA8NUVFMjk3MEMtNDkwRC00NjY2LTlEMUItRTBCRDYzMzE4Q0ExQHZlcml6b24ubmV0Pg=="},"prevInTopic":60780,"nextInTopic":60782,"prevInTime":60780,"nextInTime":60782,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"... &&&&&&&&&&&&& Thank you for the reminder that Unschooling is a CHOICE for everyone involved. I think part of my slip comes from the fact that if I did","messageBody":"<div id=\"ygrps-yiv-274409674\">On Apr 21, 2011, at 5:31 AM, Joyce Fetteroll &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jfetteroll@...\">jfetteroll@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; CECI:  And ultimately, I see Unschooling as a meditation towards great, <br/>\n&gt; &gt; loving, peaceful relationships -- better than what we&#39;d get from <br/>\n&gt; &gt; sending our kids to school!<br/>\n&gt; <br/>\n&gt; JOYCE:  If all parties want it. If unschooling is a choice everyone&#39;s making <br/>\n&gt; freely and feeling they can choose something else if it doesn&#39;t work. <br/>\n&gt; Joyfully chosen school is far more likely to work than coerced <br/>\n&gt; unschooling.<br/>\n </span></blockquote>&&&&&&&&&&&&&<br/>\n<br/>\nThank you for the reminder that Unschooling is a CHOICE for everyone involved.<br/>\n<br/>\nI think part of my &quot;slip&quot; comes from the fact that if I did not initiate any movement towards schooling or Unschooling, DH would not have done any research or applications or registration for Kindergarten.  He might have been fine with an extra year of DD1&#39;s unschoolish preschool except for the director suggesting that DD1 was far and away the most ready to &quot;move on&quot; of all her preschool mates.  But an additional conflict DH and I have with the preschool was (is) the presence of bullying behavior from one particular child and the lack of addressing our concerns regarding it.<br/>\n<br/>\nBut I digress.<br/>\n<br/>\nIf I hadn&#39;t researched schools and Unschooling, we would likely have needed to unschool because of lack of options from lack of preparation and foresight.  If I had just gone with my gut, and my own personal preference, I could have just let the deadlines pass and end up Unschooling or at least Homeschooling by default.  Instead, I supported my husband&#39;s concerns and indecision by putting in downwind private school applications, taking time off work to tour prospective schools and then only sending DH to the school tours I thought would suit him regarding DD1&#39;s school.  I spent sleepless nights (literally) getting the accounting and taxes done so that we could apply for financial aid (of which, we got none).<br/>\n<br/>\nIn other words, I&#39;m getting lazy in the department where I&#39;m truly considering DH&#39;s concerns in this last stretch before kindergarten starts.  I&#39;m literally sick and tired and I guess I want the decision-making process to be over now.  But I can see that kind of thinking is rigid and will not ultimately support the kind of mindfulness I&#39;m seeking.<br/>\n<br/>\nYou wise ones are right to suggest I register DD1 anyway in this hybrid and let her and DH wait and see for themselves what school looks like.<br/>\n<br/>\nIn fact, with this thread, I can see that I need to have yet another, different conversation with DH about school for DD1.  There is another charter that we drew a good number for in the lottery and that charter (Waldorf-inspired) was originally DH&#39;s first choice.  I have not done any further research into it because I don&#39;t appreciate many things about a Waldorf education.  There is a good chance DD1 will get in to the Waldorf charter, though, so I will discuss with DH more to see what we can decide upon as a family.<br/>\n<br/>\nThe saddest part of all this in my mind is that DD1 doesn&#39;t get too much of an opportunity to figure out what she would want at this point, though I&#39;m comforted knowing that she will be free to choose for herself when school begins whether she wants school or home on any given day.<br/>\n<br/>\nJoyce is an appropriate moniker for the reminder you gave me -- joyfully chosen school (or anything, it seems!) is better than coerced Unschooling!!!<br/>\n<br/>\nCheers,<br/>\nCeci</div>","specialLinks":[]},{"userId":274801552,"authorName":"HA","from":"&quot;HA&quot; &lt;verbiosa@...&gt;","profile":"verbiosa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Decision time","postDate":"1303414158","msgId":60777,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvcTBpZSsyYjhhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEU0QjM1MEY0LTQ2RDgtNDUyRS1BNjIyLUVCNEU4RkNGNDFCNkB5YWhvby5jb20+"},"prevInTopic":60774,"nextInTopic":60779,"prevInTime":60776,"nextInTime":60778,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"... I think if you register with the attitude of, When I m back home, she can choose whether she unschools or stays in school, it might work very well in","messageBody":"<div id=\"ygrps-yiv-159874261\"><blockquote><span title=\"ireply\">&gt; I didn&#39;t spell it out before, but DH now wants to &quot;try&quot; Unschooling.  He doesn&#39;t want to do it by himself, though. &lt;<br/>\n<br/>\n </span></blockquote>I think if you register with the attitude of, &quot;When I&#39;m back home, she can choose whether she unschools or stays in school,&quot; it might work very well in your favor.<br/>\n<br/>\nOur two older children tried school out. They were getting a lot of pressure from other people about how much fun it was, how weird they were for not going, and the like. We tried mock days, and getting involved in more formal activities, and they still wanted to give it a try. So, we did. Neither of them wanted to keep going after two weeks, but they had the experience and chose for themselves. Both made friends and had fun, but also grew tired of the homework and the busy work and the rules and wasted time.<br/>\n<br/>\nHilary</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303398925","msgId":60774,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY2NTJCMzI4LTQ5RDUtNEEwMC05MEFCLTFDMjAyRjlENDhGMkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEU0QjM1MEY0LTQ2RDgtNDUyRS1BNjIyLUVCNEU4RkNGNDFCNkB5YWhvby5jb20+","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+IDxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPg=="},"prevInTopic":60771,"nextInTopic":60777,"prevInTime":60773,"nextInTime":60775,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"-=-DH can be authoritarian and judgmental with me, too. Unschooling or not, I need tools to help me respond thoughtfully to such behavior, whether supporting","messageBody":"<div id=\"ygrps-yiv-272372062\">-=-DH can be authoritarian and judgmental with me, too. Unschooling or not, I need tools to help me respond thoughtfully to such behavior, whether supporting DD1 or standing up for myself.-=-<br/>\n<br/>\nTools for responding thoughtfully are here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nBut standing up for yourself is a phrase one uses of an antagonist, not of a partner.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/partners\">http://sandradodd.com/partners</a><br/>\n<br/>\n<br/>\n-=-Thinking about this school registration has allowed me to dig deeper into what my anxiety really is -- how can I stand up for myself? How can I support DD1 when her dad is demeaning or disrespectful to her?-=-<br/>\n<br/>\nInside every man is a little boy.  It&#39;s likely that his fears have to do with internal messages he has had in his life.  Without supporting and soothing him and his fears, how will things change?<br/>\n<br/>\nIf your daughter doesn&#39;t choose unschooling, if she wants to go to school, then you will have one of the problems school has.  If she has a choice and chooses school, it won&#39;t be as bad for her there as if she goes against her will.  But if she chooses it and doesn&#39;t like it, and knows she has the choice to go home, then  she can really choose unschooling.<br/>\n<br/>\nIf you&#39;re presenting unschooling as the holy grail, might your husband be having thoughts like you&#39;re being authoritarian and judgmental with him, and wondering whether there&#39;s a way he could stand up for himself?<br/>\n<br/>\nI think you have a &quot;there will be losers&quot; situation, rather than a teamwork &quot;We will love each other&quot; common goal.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303389101","msgId":60771,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVFRTI5NzBDLTQ5MEQtNDY2Ni05RDFCLUUwQkQ2MzMxOENBMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEU0QjM1MEY0LTQ2RDgtNDUyRS1BNjIyLUVCNEU4RkNGNDFCNkB5YWhvby5jb20+","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+IDxFNEIzNTBGNC00NkQ4LTQ1MkUtQTYyMi1FQjRFOEZDRjQxQjZAeWFob28uY29tPg=="},"prevInTopic":60770,"nextInTopic":60774,"prevInTime":60770,"nextInTime":60772,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"... Unschooling should be a choice. If you take away this option from your husband he can feel pressured into unschooling if other school options are very","messageBody":"<div id=\"ygrps-yiv-684851466\">On Apr 21, 2011, at 2:28 AM, catfish_friend wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; What I fear is that enrolling in a school will ultimately prevent us  <br/>\n&gt; from Unschooling. DD1 is extremely extroverted and social. DH tends  <br/>\n&gt; towards being authoritarian and judgmental. In some ways, I can see  <br/>\n&gt; school being great for both DD1 and DH for different reasons, but  <br/>\n&gt; reasons that might help their relationship.<br/>\n<br/>\n </span></blockquote>Unschooling should be a choice. If you take away this option from your  <br/>\nhusband he can feel pressured into unschooling if other school options  <br/>\nare very poor. Closing off a choice because you&#39;re afraid someone will  <br/>\ntake it can make that closed off option a lot more attractive and the  <br/>\noption that&#39;s forced on them less attractive. People are more likely  <br/>\nto focus on the positives of the closed off option and the negatives  <br/>\nof the forced option. Opening up choices is huge for unschooling and  <br/>\nyou want to close them off for your husband.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; On the other hand, I see Unschooling as the Holy Grail of growing  <br/>\n&gt; into one&#39;s own -- for both the parents and the child(ren).<br/>\n<br/>\n </span></blockquote>As an ideal. But it needs put into practice. If your husband can&#39;t  <br/>\nmeet your daughter&#39;s needs, can&#39;t work his own needs around hers,  <br/>\ncan&#39;t find ways to be her partner rather than her boss, then school  <br/>\nmay be a better option.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And I want that for me and for my family.<br/>\n<br/>\n </span></blockquote>Your husband is part of the family. But you want to limit his choices  <br/>\nto get your way.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; And ultimately, I see Unschooling as a meditation towards great,  <br/>\n&gt; loving, peaceful relationships -- better than what we&#39;d get from  <br/>\n&gt; sending our kids to school!<br/>\n<br/>\n </span></blockquote>If all parties want it. If unschooling is a choice everyone&#39;s making  <br/>\nfreely and feeling they can choose something else if it doesn&#39;t work.  <br/>\nJoyfully chosen school is far more likely to work than coerced  <br/>\nunschooling.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303367334","msgId":60770,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU0QjM1MEY0LTQ2RDgtNDUyRS1BNjIyLUVCNEU4RkNGNDFCNkB5YWhvby5jb20+","inReplyToHeader":"PDk5NDUxQjU1LUJGQTAtNDg1Qy1BN0IyLTgxNzc5QjYyM0FFM0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+IDw5OTQ1MUI1NS1CRkEwLTQ4NUMtQTdCMi04MTc3OUI2MjNBRTNAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":60758,"nextInTopic":60771,"prevInTime":60769,"nextInTime":60771,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"... I didn t spell it out before, but DH now wants to try Unschooling.  He doesn t want to do it by himself, though.  I put try in quotes because I think","messageBody":"<div id=\"ygrps-yiv-1292570270\"><blockquote><span title=\"qreply\">On Apr 20, 2011, at 2:44 AM, Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt; wrote:<br/>\n----:::----<br/>\n&gt; <br/>\n&gt; it seems you are consciously and partly subconsciously saying &quot;our choices are to unschool or to unschool.&quot; But your husband doesn&#39;t want to. So you can&#39;t. Shouldn&#39;t. Not.<br/>\n&gt; <br/>\n&gt; IF school is a problem, he will see that. If it&#39;s not, then it&#39;s not. But with divorce, you will get school. So first maintain what&#39;s important--love and marriage and peace at home.<br/>\n----:::----<br/>\n<br/>\nI didn&#39;t spell it out before, but DH now wants to &quot;try&quot; Unschooling.  He doesn&#39;t want to do it by himself, though.  I put &#39;try&#39; in quotes because I think he&#39;s not entirely sure what Unschooling is.  As suggested on this list, I hope to get our family to an Unschooling conference as soon as our schedules allow.  I know that will help fill out the Unschooling picture for both of us.<br/>\n<br/>\nWhat I fear is that enrolling in a school will ultimately prevent us from Unschooling.  DD1 is extremely extroverted and social.  DH tends towards being authoritarian and judgmental.  In some ways, I can see school being great for both DD1 and DH for different reasons, but reasons that might help their relationship.  On the other hand, I see Unschooling as the Holy Grail of growing into one&#39;s own -- for both the parents and the child(ren).  And I want that for me and for my family.  And ultimately, I see Unschooling as a meditation towards great, loving, peaceful relationships -- better than what we&#39;d get from sending our kids to school!<br/>\n<br/>\nThanks again for the reminder to focus on making my marriage harmonious before fully embracing Unschooling.  It is important for me to recognize that if DH is not on board with it, strife in the marriage is no place for Unschooling to thrive.<br/>\n<br/>\nI think one draw to Unschooling for me is that I want more peace in my life.  This includes my interactions with my DH.<br/>\n<br/>\nDH can be authoritarian and judgmental with me, too.  Unschooling or not, I need tools to help me respond thoughtfully to such behavior, whether supporting DD1 or standing up for myself.<br/>\n<br/>\nThinking about this school registration has allowed me to dig deeper into what my anxiety really is -- how can I stand up for myself?  How can I support DD1 when her dad is demeaning or disrespectful to her?<br/>\n<br/>\nThanks again in advance for your thoughts...<br/>\n<br/>\nThis group really inspires me.  Thank you all for being here!<br/>\n<br/>\nCeci </span></blockquote></div>","specialLinks":[]},{"userId":274801552,"authorName":"HA","from":"&quot;HA&quot; &lt;verbiosa@...&gt;","profile":"verbiosa","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Decision time","postDate":"1303319067","msgId":60758,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvbjNtcitjYnNrQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+"},"prevInTopic":60751,"nextInTopic":60770,"prevInTime":60757,"nextInTime":60759,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"... Sounds like a great compromise. I would stop planning for what may or may not happen in regards to unschooling down the road, and look at what will improve","messageBody":"<div id=\"ygrps-yiv-470644484\"><blockquote><span title=\"ireply\">&gt; The hybrid charter has an interesting model and when I wasn&#39;t yet convinced that Unschooling was what I wanted to do, I thought the hybrid would be a great start. &lt;<br/>\n<br/>\n </span></blockquote>Sounds like a great compromise. I would stop planning for what may or may not happen in regards to unschooling down the road, and look at what will improve your family relationships in the hear and now. Respecting your husband&#39;s reservations will go a long way in that.<br/>\n<br/>\nHilary</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Decision time","postDate":"1303292656","msgId":60751,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5NDUxQjU1LUJGQTAtNDg1Qy1BN0IyLTgxNzc5QjYyM0FFM0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+","referencesHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+"},"prevInTopic":60747,"nextInTopic":60758,"prevInTime":60750,"nextInTime":60752,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"-=-Figuring out better is not so easy when it pertains to the future!-=- Everything pertains to the future, but it s better to look at the present moment.","messageBody":"<div id=\"ygrps-yiv-1164839160\">-=-Figuring out &quot;better&quot; is not so easy when it pertains to the future!-=-<br/>\n<br/>\nEverything pertains to the future, but it&#39;s better to look at the present moment.  Your husband isn&#39;t willing to just unschool, so go with two choices that aren&#39;t unschooling.<br/>\n<br/>\n<br/>\n-=-What I&#39;m trying to figure out is whether it&#39;s better to register our daughter for the charter while we are still moving into completely Unschooling as a family unit or if it&#39;s better at this point to shoehorn ourselves into Unschooling.<br/>\n-=-<br/>\n<br/>\nDid you mean school, at the end there?<br/>\n<br/>\nit seems you are consciously and partly subconsciously saying &quot;our choices are to unschool or to unschool.&quot;  But your husband doesn&#39;t want to.  So you can&#39;t.  Shouldn&#39;t.  Not.<br/>\n<br/>\nIF school is a problem, he will see that.  If it&#39;s not, then it&#39;s not.  But with divorce, you will get school.  So first maintain what&#39;s important--love and marriage and peace at home.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\nIn the sound file at the bottom are ideas to help with &quot;figuring out &#39;better&#39;.&quot;<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/spouses\">http://sandradodd.com/spouses</a><br/>\n<br/>\nHappy parents+school is more valuable than unschooling+resistance+unhappy parents.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Decision time","postDate":"1303287172","msgId":60747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlvbTRpNCtkZGpoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+"},"prevInTopic":60746,"nextInTopic":60751,"prevInTime":60746,"nextInTime":60748,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"===My intuition says that DH will likely be ready to unschool after we ve settled into an all-family rhythm when my job is complete.  Unfortunately, I won t be","messageBody":"<div id=\"ygrps-yiv-1868497363\">===My intuition says that DH will likely be ready to unschool after we&#39;ve settled into an all-family rhythm when my job is complete.  Unfortunately, I won&#39;t be done with my job before the school year begins===<br/>\n<br/>\nIf you register her by the deadline, you still have the ability to say &quot;no thanks&quot; to the school when the school year rolls around, should y&#39;all wish to homeschool.<br/>\n<br/>\nIf the school year rolls around and she attends the school, you have the ability to withdraw her at any time during the school year if y&#39;all decide to homeschool.<br/>\n<br/>\nIf she attends school and loves it and doesn&#39;t want to withdraw, it will be a cool thing for her to know that she has the option to withdraw at any time and homeschool. That&#39;s not an option many kids in school have. <br/>\n<br/>\nThe decision you make today doesn&#39;t have to be set in stone.<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":138778570,"authorName":"catfish_friend","from":"catfish_friend &lt;catfish_friend@...&gt;","profile":"catfish_friend","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Decision time","postDate":"1303282036","msgId":60746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEZFNDYxNTVBLUYzOUYtNDlFMy04QUJFLUJEQ0FGMzM0NzMzNEB5YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":60747,"prevInTime":60745,"nextInTime":60747,"topicId":60746,"numMessagesInTopic":0,"msgSnippet":"DH and I have to make a decision on whether or not DD1 will attend a hybrid charter school August 2011 in the next week and a half. Our journey towards","messageBody":"<div id=\"ygrps-yiv-282577398\">DH and I have to make a decision on whether or not DD1 will attend a hybrid charter school August 2011 in the next week and a half.<br/>\n<br/>\nOur journey towards Unschooling began with my interest developing in Fall/Winter 2010 but with DH&#39;s adamant rejection of Unschooling.  To maintain harmony, we applied for admission to schools for DD1.<br/>\n<br/>\nDH is more on board with Unschooling now, and has had some wonderful epiphanies lately as he&#39;s been moving towards Unschooling and seeing the fun and joy.<br/>\n<br/>\nDD1 is in an unschoolish preschool 4 days a week and DH is primary caregiver right now.  I&#39;m financially supporting the family right now but my current job ends after mid-September, when we plan to switch roles, though we&#39;ll both be home together for as long as we can afford it.<br/>\n<br/>\nThe hybrid charter has an interesting model and when I wasn&#39;t yet convinced that Unschooling was what I wanted to do, I thought the hybrid would be a great start.<br/>\n<br/>\nWhat I&#39;m trying to figure out is whether it&#39;s better to register our daughter for the charter while we are still moving into completely Unschooling as a family unit or if it&#39;s better at this point to shoehorn ourselves into Unschooling.<br/>\n<br/>\nI feel that our choice to send DD1 to preschool put us dangerously close to putting her in school for kindergarten  without really thinking about it.  I worry that even a hybrid charter school will move us closer to school rather than unschooling.  I think DH is close to embracing Unschooling whole-heartedly, and I&#39;m trying to figure out what would be the best choice at this time for our family as we are clearly headed in that direction...but we aren&#39;t quite there, yet.<br/>\n<br/>\nSome features of the hybrid charter:<br/>\n<br/>\n- multi-age groupings (5-7yo for DD&#39;s group)<br/>\n- 2 days/week in collaborative setting<br/>\n- add&#39;l half day of electives (optional)<br/>\n- stipend for approved classes off-site<br/>\n- 2 off-site days can be independent study of own design or follow teachers suggestions<br/>\n- school uses nonviolent communication with children<br/>\n- school provides parent support, teaching support if desired<br/>\n- possible to get college credit for Homeschooling parents<br/>\n- mission/vision centered around a quote from Sir Ken Robinson: &quot;The element is where natural ability meets passion.&quot;<br/>\n<br/>\nMy inclination is that it&#39;s still too schoolish, but I think DH may think this is not schoolish enough as it&#39;s only 2/2.5 days a week.  It may be a good compromise for our family.  My intuition says that DH will likely be ready to unschool after we&#39;ve settled into an all-family rhythm when my job is complete.  Unfortunately, I won&#39;t be done with my job before the school year begins...<br/>\n<br/>\nMy thinking on this is muddy.  Figuring out &quot;better&quot; is not so easy when it pertains to the future!<br/>\n<br/>\nAny thoughts or feedback would be greatly appreciated!  Thoughts from reflections on moving from schoolish ways to unschoolish one&#39;s would be particularly helpful.<br/>\n<br/>\nThanks in advance,<br/>\nCeci<br/>\n<br/>\n<br/>\nSent from my iDon&#39;tAlwaysHaveItOnPhone</div>","specialLinks":[]}],"prevTopicId":60741,"nextTopicId":60790}}