{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":85626510,"authorName":"Dawn Falbe","from":"&quot;Dawn Falbe&quot; &lt;astrologerdawn@...&gt;","profile":"astrologerdawn","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Typical Day (was website)... very long","postDate":"1048001889","msgId":13006,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMyZWQ2NCQ2NGRlMDZhMCQxNDhlZGQxOEBkYXduPg==","inReplyToHeader":"PDEwNDc5MzQzOTMuMzAyNC4yOTgubTE1QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":13005,"nextInTime":13007,"topicId":13006,"numMessagesInTopic":0,"msgSnippet":"Penny:  Here s an example of one of our days, which I doubt is that much different from anyone else who unschools. Today the temperature dropped from the 80 of","messageBody":"<div id=\"ygrps-yiv-1202347146\">Penny:  Here&#39;s an example of one of our days, which I doubt is that much<br/>\ndifferent from anyone else who unschools.<br/>\n<br/>\nToday the temperature dropped from the 80 of yesterday into the high 50&#39;s.<br/>\nWhen I opened the blinds in the living room this morning I noticed all my<br/>\nnew flower pots that are going into the new garden (when it&#39;s done) were<br/>\ncompletely full up with mud and had crayons sticking out of them.  I also<br/>\nsaw a pair of pants and some underwear in the mud and decided to leave it<br/>\nthere until later (or until Steve my DH) went and got them.  Max and I built<br/>\na garage for about 15 mins then I made him some breakfast which he ate on a<br/>\ntowel on my bed while he watched the beginning of a Bug&#39;s Life.  Zak woke up<br/>\nabout 7:30am and decided to make gifts for me.  He took some art supplies<br/>\nand wrapped up some of his toy soilders for me and also a pack of tissues.<br/>\nHe very carefully decorated them and then gave them to me.  <br/>\n<br/>\nZak went off to his room to play Where in the World is Carmen San Diego? On<br/>\nhis computer, and also Lego Racers II.  Both boys had breakfast with Steve<br/>\nand helped empty the dishwasher and put the laundry on.  Zak came to talk to<br/>\nme about the Planets and the difference between astronomy and astrology and<br/>\nwhat he thought the Planets should mean.<br/>\n<br/>\nZak spent lots of time waiting by the window for his friend Taylor to come<br/>\nover at 11:45am.  They went to see the Diamond Backs play the Rockies (it&#39;s<br/>\nspring training here).  They went with Taylor&#39;s 2 grandma&#39;s one of which<br/>\nTaylor lives with.  Zak didn&#39;t get home till 5pm.  I worked all morning in<br/>\nmy office while Steve was with the boys.  Steve left to have lunch with a<br/>\nfriend and then came back to the house to work while I and the boys were all<br/>\ngone (peace and quiet for him he said it was wonderful)<br/>\n<br/>\nMax and I got a shower and we went to the park to meet friends for a couple<br/>\nof hours.  Went to Target to buy new underwear for Max (lots of accidents at<br/>\nthe moment) and then to our Pottery Class with other unschoolers.  <br/>\n<br/>\nSteve made a wonderful pot roast and we had dinner together and talked about<br/>\nour day.  Zak told us all about the game and who won and where they say and<br/>\nhow cold it was (for Tucson) and that he&#39;d had a hot dog and a coke and was<br/>\nwith Taylor&#39;s grandmas (both of them went).  He seemed quieter than usual<br/>\nfor Zak and so I probed him a little about what he and Taylor talked about.<br/>\nIt turns out that Taylor had told Zak that Peter (another friend of Zak&#39;s)<br/>\nhated him and so there was about an hour of dealing with the emotions that<br/>\nwent with that and what Zak wanted to do about the situation.  He ended up<br/>\ncalling Peter and talking to him on the phone about their Game Boy Advanced<br/>\ngames and the Power Puff Girls movies.  He also asked Peter for a playdate<br/>\nnext week.  Peter was thrilled.  Zak asked him about hating him and he<br/>\ndidn&#39;t know what Zak was talking about (personally I knew this to not be<br/>\ntrue because of issues Taylor has in his own growing up, but I wanted Zak to<br/>\nhandle it).  Zak&#39;s mood changed after that conversation and Zak seemed to be<br/>\nmore at peace with himself.  <br/>\n<br/>\nAfter dinner both boys helped clean up the kitchen, pick up their toys in<br/>\nthe common areas.  Both boys went into Zak&#39;s room to have popcorn, coke and<br/>\nwatch the Lion King II while Steve and I went and had sex!!!  Got to get it<br/>\nwhen you can!!!!  About half an hour later Max was ready to come into our<br/>\nroom and watch a movie in our bed and fell asleep within about 5 mins, while<br/>\nZak stayed up till 10:30pm talking about how he wanted a sleepover with<br/>\nTaylor, playing with his Lego Racers Board Game, playing 5 Crowns with<br/>\nSteve. He and Steve talked about what having a sleepover means, what might<br/>\nhappen, what he would like to happen.  Steve and he read books until Zak<br/>\ndecided to go back to playing on his computer.<br/>\n<br/>\nAs my back (I&#39;m having lots of problems with my back) was hurting I took a<br/>\nmuscle relaxer (as a last resort for the pain) and lay on the couch to watch<br/>\nLaw and Order (5 shows back to back on TNT).  I fell asleep about 9:30pm.<br/>\nSteve came and guided me to bed at 11:15pm after he&#39;d finished doing some<br/>\nwork for my business.<br/>\n<br/>\nIs this a typical day?  I don&#39;t know that there is one.  As I write this on<br/>\nTuesday morning Max is building with Legos in the living room while Zak is<br/>\nin his bedroom watching the Great Mouse Detective and eating breakfast.  He<br/>\njust told us that staying up till 10:30pm was too late for him as it makes<br/>\nhim very emotional the next day and unable to concentrate and that he&#39;s<br/>\ngoing to go to bed earlier in the future.  He said he needs time away from<br/>\nMax and that&#39;s why he&#39;s in his room.  He&#39;s looking forward to Elliott coming<br/>\nover in a couple of hours (best friend since born).....<br/>\n<br/>\nWhat I do know is that there is no weekend in our house.  Each day is just<br/>\neach day.  We do the next thing whatever that may be.  Sometimes it involves<br/>\ngoing out, staying in, talking, reading, watching videos, having playdates,<br/>\nlibrary, park, me working, Steve working, me with the kids, him with the<br/>\nkids, going to homeschooling events, such as Roots and Shoots or the park<br/>\nmeetings.... Anyway enough of my rambling Penny, I hope this helps.<br/>\n<br/>\nOne last thing.  This biggest change for us has been about letting go of<br/>\ncontrol and just trusting that our kids know what they need and following<br/>\ntheir desires.  Reading about deschooling ourselves was very helpful and<br/>\nalso having a great support system.<br/>\n<br/>\nGood luck with your journey.<br/>\n<br/>\nDawn F.<br/>\nTucson, AZ</div>","specialLinks":[]}],"prevTopicId":13004,"nextTopicId":13007}}