{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1160699,"authorName":"Grace Penno","from":"&quot;Grace Penno&quot; &lt;pennacres@...&gt;","profile":"mtnsky2001","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Pups under the shed","postDate":"1051988772","msgId":67568,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMWMwMWMzMTFhNyQxMTAyOWI2MCQ0MWUwYjVkMEBvZW1jb21wdXRlcj4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":67567,"nextInTime":67569,"topicId":67568,"numMessagesInTopic":0,"msgSnippet":"Hi-always something eh.  Been  there-bought the t-shirt. We have  had them under sheds-decks-porches and under the house. Up comes the floor. or....the","messageBody":"<div id=\"ygrps-yiv-776528283\">Hi-always something eh.  Been  there-bought the t-shirt.<br/>\nWe have  had them under sheds-decks-porches and under the house. Up comes the floor. or....the smallest child gets to crawl under and squirm backwards  one pup at a time-while you holler advice-&quot;no-don&quot;t try to carry two at a time &quot;-stuck on a nail-?well wriggle out of your shirt-yes leave the shirt there-no, it doesnt matter&quot;.<br/>\nand thats even while we have  a great boarding kennel-great  whelping box in  a nice quiet spot-dogs get out....kids let them out..they run past you and its storming out and the word &quot;come&quot; has lost all meaning.<br/>\nBut, yes have seen  a lot of problems. Get them out. lure Mom out and pen her up till you do it.Don&#39;t do it  while  she is under with them. Trust me-sometimes they freak out -sometimes they start carrying  pups all over the place under there.Some latch on to Mom and end up dragged out of the nest  and may be on the other side of a floor joist.<br/>\nYou need to see how many there are-any dead ones-check umbilical  cords -be able to check mom&#39;s milk supply. Get them used to gentle handling by you right off the bat. Keep Mom from getting too paranoid about it all. If this is the first time for the kids  <br/>\nthey get to enjoy it all. Give her her own quiet  whelping box. Kids get to look-supervised.<br/>\nBut...lots of dogs routinely whelp under a shed- They usually  follow the bitch out  when they can walk -5-6 weeks. If Mom is calm and friendly it can be ok-if she is freaky-you might end up with &quot;feral&quot; acting pups.<br/>\nGet ads out right away-large dogs  can be hard to place. You might consider taking all but 3 or 4 to the vet to be put down now.<br/>\nIf your paper is loaded with free pups and your SPCA as well  you might have a problem.<br/>\nHave fun-enjoy-<br/>\ngrace<br/>\n{Miss Frizzle says &quot;Take Chances-Get Messy-Make Mistakes&quot;}<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":67523,"nextTopicId":67575}}