{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: My reply regarding Sandra&#39;s column in HEM","postDate":"1095068900","msgId":20747,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJENkFFNTIzLjJCNzMxJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDQwOTEzMDA1Ni4xYzZMSGc2eEkzTlpGcE4zQG14LWEwNjViMTQucGFzLnNhLmVhcnRobGluay5uZXQ+"},"prevInTopic":20746,"nextInTopic":0,"prevInTime":20746,"nextInTime":20748,"topicId":20686,"numMessagesInTopic":0,"msgSnippet":"... She also has her own list. Which is very brave and nice of her since she doesn t like all that mail! ... Joyce","messageBody":"<div id=\"ygrps-yiv-101625918\">on 9/13/04 3:26 AM, Robyn Coburn at <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dezigna@...\">dezigna@...</a> wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Anne O. has recently joined Basics<br/>\n<br/>\n </span></blockquote>She also has her own list. Which is very brave and nice of her since she<br/>\ndoesn&#39;t like all that mail!<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Hi everyone! As suggested by people at the conference after hearing my *Out of<br/>\n&gt; Sync/Highly Sensitive* talk, I started a list at yahoo called *Unschooling<br/>\n&gt; Non-Typical Children* ~<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/shinewithunschooling/\">http://groups.yahoo.com/group/shinewithunschooling/</a><br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Please forward this link to anyone you think may find value in it...<br/>\n&gt; <br/>\n&gt; Looking forward to connecting with others...<br/>\n&gt; <br/>\n&gt; Be Well ~<br/>\n&gt; Anne<br/>\n<br/>\n </span></blockquote>Joyce</div>","specialLinks":[]},{"userId":152350410,"authorName":"Robyn Coburn","from":"&quot;Robyn Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Re: My reply regarding Sandra&#39;s column in HEM","postDate":"1095060385","msgId":20746,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"inReplyToHeader":"PEJENjlERDMwLjJCNjdBJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":20686,"nextInTopic":20747,"prevInTime":20745,"nextInTime":20747,"topicId":20686,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1270499764\">&lt;&lt;&lt;&lt;I think it&#39;s valuable for unschoolers to see -- even if they<br/>\ndon&#39;t want to do it -- how far it&#39;s possible to let go and still raise great<br/>\nkids. The knowledge that a conventional practice is a choice not a necessity<br/>\ncan be very freeing. :-) Frankly, I think radical unschoolers&#39;s needs are<br/>\nmet by discussing radical unschooling ideas amongst each other on the lists<br/>\nand boards that serve them (and the new magazines that have come out in the<br/>\nlast year).&gt;&gt;&gt;<br/>\n<br/>\nWell this is the crux of why I never responded to the magazine the few times<br/>\nI got hold of a copy. My needs *are* mostly being met by the lists, and my<br/>\nless frequent reading of the boards - where I would mostly lurk for the sake<br/>\nof getting a good dose of the rad stuff especially when the lists were<br/>\nquiet. Also I am enjoying the other mags most of the time.<br/>\n<br/>\n&lt;&lt;&lt;&lt;But it doesn&#39;t help other unschoolers see how far it&#39;s possible<br/>\nto let go since the lists and boards are more oriented towards people who<br/>\nalready know they want radical unschooling or are sure they want to know<br/>\nmore about it, not to people who are causaully curious.&gt;&gt;&gt;&gt;<br/>\n<br/>\nAnd this point is the reason why I think it&#39;s a shame that Sandra&#39;s column<br/>\nhas been removed.<br/>\n<br/>\nSandra has posted that she is OK with that situation and grateful for the<br/>\npast opportunities. However the response to subscribers&#39; assorted<br/>\ndissatisfaction has by no means been as gracious.  <br/>\n<br/>\nWhich brings us back to the boards and what will end up happening to them,<br/>\nand more importantly those wonderful voices (like Lyle) who are (were?)<br/>\nthere but not on the lists. Anne O. has recently joined Basics, for the<br/>\ninformation anyone here who didn&#39;t know, although I believe she has<br/>\npreviously been more active on the boards by preference for the format<br/>\npresumably. There is so much in the archives that it would be a shame to<br/>\nlose also.<br/>\n<br/>\nRobyn L. Coburn<br/>\n<br/>\n<br/>\n---<br/>\nOutgoing mail is certified Virus Free.<br/>\nChecked by AVG anti-virus system (http://www.grisoft.com).<br/>\nVersion: 6.0.752 / Virus Database: 503 - Release Date: 9/3/2004</div>","specialLinks":[]},{"userId":2523747,"authorName":"Fetteroll","from":"Fetteroll &lt;fetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: My reply regarding Sandra&#39;s column in HEM","postDate":"1095001328","msgId":20686,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJENjlERDMwLjJCNjdBJWZldHRlcm9sbEBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":0,"nextInTopic":20746,"prevInTime":20685,"nextInTime":20687,"topicId":20686,"numMessagesInTopic":0,"msgSnippet":"Helen, I think there are some flaws in the logic of your response. And I think the flaws are caused by: 1) the word unschooling being defined differently by","messageBody":"<div id=\"ygrps-yiv-1033850230\">Helen,<br/>\n<br/>\nI think there are some flaws in the logic of your response. And I think the<br/>\nflaws are caused by:<br/>\n<br/>\n1) the word unschooling being defined differently by different people. So<br/>\nwhen people say HEM isn&#39;t about unschooling and you say you are, you aren&#39;t<br/>\nall using the word unschooling to mean the same thing. Some people who write<br/>\nto you are using unschooling to mean radical unschooling. You&#39;re using the<br/>\nterm to cover a much broader range of practices from radical unschooling to<br/>\nwanting to dip their toes into learning by living.<br/>\n<br/>\n2) assuming that since HEM in your view is an unschooling magazine and<br/>\npeople are saying only Sandra&#39;s column was unschooling, that must mean the<br/>\ncomplaints are from Sandra&#39;s supporters and they mean no more than &quot;Sandra&#39;s<br/>\nsupporters&quot; are outraged at a perceived injustice towards Sandra.<br/>\n<br/>\nFirst, I&#39;ll tell you how I define radical unschooling so we&#39;re on the same<br/>\npage about that! ;-) Radical unschooling, too, gets defined differently by<br/>\ndifferent people. *To me* radical unschooling means applying the philosophy<br/>\nof trusting children to learn from living to all aspects of their lives<br/>\nincluding parenting.<br/>\n<br/>\nSecond, I think good things *beyond* reaching the unschooling audience HEM<br/>\nis targeting can come from keeping the definition of unschooling broad and<br/>\npresenting learning by living in the personal story way that HEM does. As a<br/>\nwonderful *side effect*, HEM&#39;s gentle way presents a &quot;user friendly&quot; view of<br/>\nunschooling to those who may even be outside of homeschooling. :-) There&#39;s<br/>\nso much all unschoolers are learning about how children really learn that<br/>\nflies in the face of conventional (school based) knowledge of how children<br/>\n&quot;need&quot; to learn. And it&#39;s great to have a venue where outsiders can see<br/>\ninside unschooling, can see that children don&#39;t need to be taught to learn,<br/>\nwithout being turned off by ideas that are too radical.<br/>\n<br/>\nSo, when people say HEM isn&#39;t about unschooling, I bet many of them mean it<br/>\nisn&#39;t about radical unschooling and that HEM isn&#39;t addressing the needs they<br/>\nhave as radical unschoolers.<br/>\n <br/>\nWhether HEM should try to meet the needs of radical unschoolers (as I&#39;ve<br/>\ndefined them) or not is a separate issue from recognizing how the needs of<br/>\nradical unschoolers differ from unschoolers (using a broader definition).<br/>\n<br/>\nRadical unschoolers aren&#39;t content to take from unschooling only what<br/>\nthey&#39;re comfortable with. They want what they perceive as the whole shebang.<br/>\n:-) They want the effects that radical unschoolers talk of: the relationshp<br/>\nand personal effects that come from completely trusting their kids<br/>\npersonally and academically.<br/>\n<br/>\n*In general*, for unschoolers (using the broader definition) I think the<br/>\ngoal is to do what they feel is best for their children. They&#39;re going to<br/>\ntake what they feel are the best parts of unschooling for them and cobble<br/>\nsomething together that works for their family. What they need and how they<br/>\ngo about making it work it can&#39;t be defined by anyone else.<br/>\n<br/>\nBut radical unschoolers (*in general* and as I described them), on the other<br/>\nhand, do want something specific. They want to get to a specific place. But<br/>\nconventional parenting and schoolish thinking are road blocks for many of<br/>\nthem. The personal stories in HEM aren&#39;t as useful to them because they<br/>\nalready understand the benefits of (radical) unschooling. What they don&#39;t<br/>\nknow is how (and why it&#39;s helpful) to think in new ways, and how they can do<br/>\nsomething that makes them uncomfortable while they work on eliminating<br/>\nconventional thinking roadblocks, so they can make radical unschooling work<br/>\nfor them. And they value the hard questioning that goes on in places like<br/>\nUnschoolingDiscussion and Unschooling.com.<br/>\n<br/>\nUnfortunately that more direct presentation of radical unschooling thought<br/>\nis the antithesis of what many unschoolers (as defined more broadly) need.<br/>\n<br/>\nRadical unschooling *is* an idea that exists separate from Sandra&#39;s writing<br/>\nabout it. Sandra just makes it sound so obvious which is one of the reasons<br/>\nher writing is so popular! But the idea of radical unschooling is doing well<br/>\non the unschoolingbasics list (that Ren Allen started when you changed the<br/>\nname of Unschooling-101) without Sandra. (Over 300 members and very busy.)<br/>\nThe hard questions are being asked, the conventional assumptions are being<br/>\nchallenged. The lists are meeting the needs of radical unschoolers in ways<br/>\nthat HEM isn&#39;t.<br/>\n<br/>\nNot that HEM should necessarily try to meet the needs of radical<br/>\nunschoolers. I don&#39;t think the needs of people who want to the take parts of<br/>\nunschooling they like are compatible with people who want to challenge their<br/>\nown thinking in order to get the whole shebang are compatible. (And why the<br/>\nlists suffered too many blow ups.) But to dismiss people who are complaining<br/>\nabout Sandra&#39;s dropped column as &quot;Sandra supporters&quot; is to dismiss the needs<br/>\nof radical unschoolers who make the UD and unschoolingbasics lists and<br/>\nUnschooling.com boards so busy.<br/>\n<br/>\nI said recently that I wouldn&#39;t mind participating in a &quot;radical<br/>\nunschooling&quot; (and/or &quot;radical unschooling parenting&quot;) corner of a message<br/>\nboard like AOL used to have where the full range of unschooling is<br/>\ndiscussed. I think it&#39;s valuable for unschoolers to see -- even if they<br/>\ndon&#39;t want to do it -- how far it&#39;s possible to let go and still raise great<br/>\nkids. The knowledge that a conventional practice is a choice not a necessity<br/>\ncan be very freeing. :-) Frankly, I think radical unschoolers&#39;s needs are<br/>\nmet by discussing radical unschooling ideas amongst each other on the lists<br/>\nand boards that serve them (and the new magazines that have come out in the<br/>\nlast year). But it doesn&#39;t help other unschoolers see how far it&#39;s possible<br/>\nto let go since the lists and boards are more oriented towards people who<br/>\nalready know they want radical unschooling or are sure they want to know<br/>\nmore about it, not to people who are causaully curious.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; Hello &lt;name withheld&gt;,<br/>\n&gt;<br/>\n&gt; Thanks for taking the time to write and share your concerns with me.<br/>\n&gt; A number of people have written about the same concerns, but I&#39;ve<br/>\n&gt; been very busy with family matters these last few weeks and have not<br/>\n&gt; had a chance to respond to anyone until now. If you have the<br/>\n&gt; opportunity - via discussion lists, message boards or other forums -<br/>\n&gt; perhaps you could share my reply here with others who are concerned<br/>\n&gt; about the changes we&#39;ve made at HEM regarding Sandra Dodd. It&#39;s not<br/>\n&gt; necessary, of course, and I&#39;ll be trying to find those who wrote<br/>\n&gt; earlier and reply to them directly, but their contact information may<br/>\n&gt; be lost to me by now.<br/>\n&gt;<br/>\n&gt; Anyway, I share your disappointment about Sandra&#39;s column no longer<br/>\n&gt; appearing in Home Education Magazine. I&#39;ve always loved the wonderful<br/>\n&gt; way Sandra could put words together to convey a thought or an idea or<br/>\n&gt; a concept - that&#39;s why she was selected to be an HEM columnist in the<br/>\n&gt; first place. Her writing has a special quality, a clarity of purpose<br/>\n&gt; and a way of making the reader feel as though they, too, can do all<br/>\n&gt; the wonderful things she writes about doing, whether it&#39;s making math<br/>\n&gt; simple and easy to understand or sharing music with her kids and<br/>\n&gt; friends and family or just enjoying the simple wonderfulness of<br/>\n&gt; watching her children figure things out for themselves. She could<br/>\n&gt; write it all down in a way that made you feel like you could do all<br/>\n&gt; of that and more with your own kids. Her writing is clean, pure, and<br/>\n&gt; honest, and those qualities do not come through in everyone&#39;s writing<br/>\n&gt; like they come through in hers. If it was ONLY about the writing, I&#39;m<br/>\n&gt; certain that Sandra would still be writing for HEM, but her writing<br/>\n&gt; was only a small part of a much larger situation which led to our<br/>\n&gt; making the decisions we made.<br/>\n&gt;<br/>\n&gt; As I understand it there has always been plenty of Sandra&#39;s writing<br/>\n&gt; available online, not only at her own website but at many other<br/>\n&gt; sites, forums, discussion lists, and in books and magazines. I don&#39;t<br/>\n&gt; think her absence in HEM will be much noticed by those who want to<br/>\n&gt; read her writing, as I believe she wrote far more for other venues<br/>\n&gt; than she ever wrote for our bimonthly magazine. She&#39;s a very prolific<br/>\n&gt; writer and a tireless advocate on the lists and forums. In that<br/>\n&gt; respect, HEM was never much of a source for those who wanted to<br/>\n&gt; benefit from her writing and discussions.<br/>\n&gt;<br/>\n&gt; At the same time, it has struck those of us here at HEM as odd that<br/>\n&gt; people think there has been some significant change in the magazine.<br/>\n&gt; Almost everyone associated with HEM - the publishers, editors,<br/>\n&gt; writers, columnists, office staff and various others - are all<br/>\n&gt; unschoolers at heart, all believe pretty much the same kinds of<br/>\n&gt; things Sandra has written about and promoted, and have always worked<br/>\n&gt; hard to share the unschooling philosophy with our readers. The odd<br/>\n&gt; attitude that Sandra&#39;s column was the only thing worth reading in HEM<br/>\n&gt; and it&#39;s not worth subscribing if she&#39;s not going to be writing for<br/>\n&gt; it is a somewhat bizarre revelation to us - and it tells us all that<br/>\n&gt; this is much more about Sandra&#39;s faithful followers defending some<br/>\n&gt; perceived wrongdoing than about anything truly relating to our<br/>\n&gt; magazine. That also strikes us as bizarre because we&#39;ve always<br/>\n&gt; thought true unschooling was about finding one&#39;s own path and not<br/>\n&gt; simply dogging someone else&#39;s footsteps to learn.<br/>\n&gt;<br/>\n&gt; I&#39;ve always loved what John Holt had to say about that concept: That<br/>\n&gt; true leaders don&#39;t look around to see who&#39;s following them, they<br/>\n&gt; simply move ahead doing what they think is right and good and in<br/>\n&gt; doing so they empower others to do the same for themselves. That&#39;s<br/>\n&gt; what we&#39;ve been doing at HEM for over 20 years, and it&#39;s what we&#39;ll<br/>\n&gt; continue to do for the next 20.<br/>\n&gt;<br/>\n&gt; Thanks again for writing,<br/>\n&gt; Helen<br/>\n&gt; ~~~~<br/>\n&gt; Helen Hegener, publisher<br/>\n&gt; Home Education Magazine<br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.homeedmag.com\">http://www.homeedmag.com</a><br/>\n&gt; </span></blockquote></div>","specialLinks":[]}],"prevTopicId":20731,"nextTopicId":20765}}