{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":139187074,"authorName":"foxymophandlemama32","from":"&quot;foxymophandlemama32&quot; &lt;mjsolich@...&gt;","profile":"foxymophandlemama32","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"haven&#39;t been around for a while and pen pals","postDate":"1083654788","msgId":93435,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM3N2ZxNCtsY3U5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":93434,"nextInTime":93436,"topicId":93435,"numMessagesInTopic":0,"msgSnippet":"Hello to everyone. I haven t been around for awhile. I needed to go away and see if I could unschool and parent peacefully and also to try and answer the many","messageBody":"<div id=\"ygrps-yiv-54979961\">Hello to everyone. I haven&#39;t been around for awhile. I needed to go <br/>\naway and see if I could unschool and parent peacefully and also to <br/>\ntry and answer the many questions that were swirling about in my head <br/>\nabout life, the universe and everything! Okay, so I&#39;m still working <br/>\non the questions but I CAN unschool and since I finished reading How <br/>\nTo Talk So Kids Will Listen and Listen So Kids Will Talk I&#39;m finding <br/>\nthe peaceful parenting much easier. It seems a lifetime since we <br/>\nbegan this journey and walked away from homeschooling and <br/>\ncontrolling/spanking our kids, I can&#39;t believe it hasn&#39;t even been <br/>\ntwo years!<br/>\n<br/>\nLife has been pretty good lately. We are enjoying the autumn weather <br/>\nafter a long, hot, dry summer. (We live in Australia for those who <br/>\ndon&#39;t know me) We have been enjoying great conversations, rereading <br/>\nthe Lemony Snicket series, making chocolate cakes, growing stuff in <br/>\nthe garden and making messes with paint and glue. Today we did some <br/>\ncharcoal drawings of a zebra&#39;s head and they look awesome.<br/>\n<br/>\nMy boys watched Arthur today and it was about penpals. So of course <br/>\nthey both decided they wanted a penpal. We&#39;ve written down some of <br/>\ntheir interests in the hope that someone (or two someones) out there <br/>\nwould be interested in writing to them on a regular basis. You can <br/>\ncontact me offlist if you are. TIA<br/>\n<br/>\nJacob is eight this year and loves Harry Potter and reading the <br/>\nLemony Snicket series. He loves playing with Lego and his Bionicles. <br/>\nHis favourite superheroes are Spiderman, Wolverine and Hulk. His <br/>\nfavourite movie is Spiderman (he&#39;s looking forward to the new movie) <br/>\nand his favourite Tv show at the moment is Corniel and Bernie. <br/>\nHe loves collecting insects and has 3 pet caterpillars. He likes <br/>\nplaying outside and is digging a big pit to play in and fill up with <br/>\nwater. He also likes drawing and cooking.<br/>\n<br/>\nJesse is ten in three weeks. He loves Harry Potter too and can&#39;t wait <br/>\nuntil Pisoner of Azkaban is released. He is hoping to get some LOTR <br/>\nfigurines from the Battle Games in Middle-earth series for his <br/>\nbirthday. His dad is also collecting them and they plan to paint them <br/>\ntogether and build a landscape to battle on. Jess likes playing <br/>\noutside pretending to be characters from movies like the Lord of the <br/>\nRings and Hulk. His favourite movie is Bionicle: Mask of Light. He <br/>\nloves playing with Lego and his Bionicles. His favourite TV show is <br/>\nThe Wild Thornberrys. He loves watching nature documentaries and <br/>\nwants to be the next David Attenborough. <br/>\n<br/>\nI&#39;m going to attempt to start receiving mail again. I need a Time <br/>\nTurner. The days are just not long enough to get everything done.<br/>\n<br/>\nJulie</div>","specialLinks":[]}],"prevTopicId":93409,"nextTopicId":93428}}