{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":11,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Family peace, religious beliefs","postDate":"1508686174","msgId":78291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFENThBODMxLUIyMTAtNDQyRC1BOUQ1LUQ2OEFBMTQ3Q0QyOEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEYwRTMxNUNDLTU1REQtNDU3NS05MzA3LTEyNjBDMjhERERCQ0BzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDM2MTkwMDcxMC4xNjUwNjkwLjE1MDg2MDUwODkyNzQucmVmQG1haWwueWFob28uY29tPiA8MzYxOTAwNzEwLjE2NTA2OTAuMTUwODYwNTA4OTI3NEBtYWlsLnlhaG9vLmNvbT4gPEYwRTMxNUNDLTU1REQtNDU3NS05MzA3LTEyNjBDMjhERERCQ0BzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78290,"nextInTopic":0,"prevInTime":78290,"nextInTime":78292,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"There were typos and the sentences are too long.  This is from my post before, but cleaned up a bit. -=-I think some people come to unschooling discussions and","messageBody":"<div id=\"ygrps-yiv-902818791\">There were typos and the sentences are too long.  This is from my post before, but cleaned up a bit.<br/>\n<br/>\n-=-I think some people come to unschooling discussions and assume somehow that it has rules like a religion. Convert to Catholicism and you must be prepared to die for your faith. It’s not that kind of faith. IF someone believes that learning can happen all kinds of fun ways, then that can be induced and ecouraged even around school, even after school. If ANYone believes that growing up should then lead to the means and ability to lives separate from the parent, and that money can be useful (which is true and sensible) then choosing a vague image of unschooling as a religion in which it would be a cardinal sin to “deny the faith&quot; could be REALLY really expensive. Unschooling shouldn’t need to be THAT expensive. It shouldn’t cost millions of dollars.-=-<br/>\n<br/>\n<br/>\nPeople can be too poor to unschool.<br/>\nI think people can potentially have too much later-life family benefit at stake to unschool.<br/>\n<br/>\nIf the parents have good relations with their parents, and understand unschooling well, it’s possible to be persuasive and impressive.<br/>\nIf the parents’ relationship with their own parents is shot before unschooling starts, persuasion might not be possible.<br/>\n<br/>\nWhat IS possible is for parent to help their children have a relationship with the grandparents.<br/>\n<br/>\nIf I had told my children that what my parents thought didn’t matter, that they were idiots anyway, screw them…. then it’s just a half-step to the side for my kids to easily and totally reject what I think, at some point, when they’re older.<br/>\n<br/>\nIt’s not just about money, but ignoring money completely doesn’t seem like good decision-making behavior, and unschooling should be based on and filled with “make the better choice.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Family peace, religious beliefs","postDate":"1508618436","msgId":78290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYwRTMxNUNDLTU1REQtNDU3NS05MzA3LTEyNjBDMjhERERCQ0BzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDM2MTkwMDcxMC4xNjUwNjkwLjE1MDg2MDUwODkyNzRAbWFpbC55YWhvby5jb20+","referencesHeader":"PDM2MTkwMDcxMC4xNjUwNjkwLjE1MDg2MDUwODkyNzQucmVmQG1haWwueWFob28uY29tPiA8MzYxOTAwNzEwLjE2NTA2OTAuMTUwODYwNTA4OTI3NEBtYWlsLnlhaG9vLmNvbT4="},"prevInTopic":78289,"nextInTopic":78291,"prevInTime":78289,"nextInTime":78291,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"-=- ... It was my statement. I could rephrase, but I’m pretty sure it’s clearly stated. First, it ends with maybe.  That’s important. If grandparents are","messageBody":"<div id=\"ygrps-yiv-1965276007\">-=-<br/>\nPerhaps one could elaborate on this point:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;If the grandparents have so much money that it would be crazy to risk causing your children NOT to inherit any, pay more attention to what those grandparents want, maybe.&lt;&lt;-=-<br/>\n<br/>\n </span></blockquote>It was my statement.<br/>\n<br/>\nI could rephrase, but I’m pretty sure it’s clearly stated.  <br/>\n<br/>\nFirst, it ends with maybe.  That’s important.<br/>\n<br/>\nIf grandparents are abusive alcoholics or incarcerated drug addicts and say “You should send your children to school,” it’s pretty easy to disregard that, or to say something soothing (which would be nicer than reviewing your own past with them).<br/>\n<br/>\nIf grandparents are competent and present and sober and at liberty to visit but they’re not going to make or break your future other than just being nice people and maybe you’d inherit their house full of old stuff you don’t want…. if you want your kids to be unschooled, tell them so in as friendly and sweet a way as possible.<br/>\n<br/>\nIf grandparents are multi-millionaires and your kids’s futures after you-the-parent are gone could be either regret about having no relationship with their grandparents AND the possible loss of inheritance of enough money to buy a house…  then maybe the parents should consider school if that seems a deal breaker—if it seems the only way the inheritance is available.<br/>\n<br/>\nPeople consider that they go to school so they can afford a house, and a car, and maybe some vacations.  Food and clothes.<br/>\nPeople who unschool seem to be doing fine with moving toward such things, too.  I have a kid with a mortgage, and one with a nearly-new car.  (One with a now-aging car that he paid off already.)<br/>\n<br/>\nIf JUST by going to school, even without finding a good job and staying with it for a long time a child could be financially secure and therefor able to pursue interests and hobbies and passions as an adult, it might be more valuable than unschooling as a child and then being cut off from a fortune and the grandparents who had it.<br/>\n<br/>\nPerhaps the request for elaboration came from an idea that there are rules and absolutes about what MUST be and what CANNOT be.  I think people should live life in the best way they know in the moment, not burn their bridges if they don’t need to, and not arrange in advance to blow up strong stone bridges that could have been crossed in the future.<br/>\n<br/>\nSome people despise their parents.  Some of those parents are wealthy.  That’s a personal issue, then.<br/>\nGrandparents are rarely as irritating to grandchildren as they were to their own children, in my experience.  <br/>\n<br/>\nI don’t mind people picking my clarification apart or proposing other ideas.<br/>\n<br/>\nI think some people come to unschooling discussions and assume somehow that it has rules like a religion.  Convert to Catholicism and you must be prepared to die for your faith. It’s not that kind of faith.  IF someone believes that learning can happen all kinds of fun ways, then that can be induced and ecouraged even around school, even after school.  If ANYone believes that growing up should then lead to the means and ability to lives separate from the parent, and that money can be useful, choosing a vague image of unschooling as a religion and denying that religion as a cardinal sin could be REALLY really expensive.  Unschooling shouldn’t need to be THAT expensive.   It shouldn’t cost millions of dollars.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":577736033,"authorName":"D Gardella","from":"D Gardella &lt;go.dario@...&gt;","profile":"go.dario","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Family peace, religious beliefs","postDate":"1508605089","msgId":78289,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM2MTkwMDcxMC4xNjUwNjkwLjE1MDg2MDUwODkyNzRAbWFpbC55YWhvby5jb20+","referencesHeader":"PDM2MTkwMDcxMC4xNjUwNjkwLjE1MDg2MDUwODkyNzQucmVmQG1haWwueWFob28uY29tPg=="},"prevInTopic":78267,"nextInTopic":78290,"prevInTime":78288,"nextInTime":78290,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"Perhaps one could elaborate on this point: If the grandparents have so much money that it would be crazy to risk causing your children NOT to inherit any, pay","messageBody":"<div id=\"ygrps-yiv-182541689\"><html><head></head><div style=\"font-family:Helvetica Neue, Helvetica, Arial, sans-serif;font-size:13px;\"><div>Perhaps one could elaborate on this point:</div><div>&gt;&gt;<span style=\"font-family:Georgia;\">If the grandparents have so much money that it would be crazy to risk causing your children NOT to inherit any, pay more attention to what those grandparents want, maybe.&lt;&lt;</span></div></div></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Rights and Freedom:  was Family peace, religious beliefs","postDate":"1504738868","msgId":78267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwQzEyQkRELTdDNEQtNDRCNy05OTg1LUIwNDQ3QzZFQzJGOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDM1NjRFRDNGLTIwQTQtNDA3OC1CNjBELTM3RkMwRTk5QjNCOEBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEI3QUY3NEM0LUU5MjktNDMzOS1BQkQ4LTJGOTc1NUQzOEIzM0BTYW5kcmFkb2RkLmNvbT4gPDQ2RjBDRDBDLUU0RDAtNDBFQy04MkU3LUVGOTVGNjUxQzg5MkBzYW5kcmFkb2RkLmNvbT4gPDAwYTgwMWQzMjcxMSQ2NTFhYWE1MCQyZjRmZmVmMCRAdGlydGFpcm5naXJlLmNvbT4gPDM1NjRFRDNGLTIwQTQtNDA3OC1CNjBELTM3RkMwRTk5QjNCOEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78263,"nextInTopic":78289,"prevInTime":78266,"nextInTime":78268,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"A response about “Freedom” from the anonymous mom: I was hesitant to use that word in my private email to you. I have stressed our relative comfort many","messageBody":"<div id=\"ygrps-yiv-2046488343\">A response about “Freedom” from the anonymous mom:<br/>\n<br/>\nI was hesitant to use that word in my private email to you. I have stressed our relative comfort many times over in conversations. I also thought that since he had stronger beliefs than I do on this topic, they could give it a shot. I am humbled to be reminded that I probably let it go farther than I should have, as a parent, with the maturity teens might still be lacking in comparison. I realize if it doesn&#39;t apply to us, it might to others and I very much value honesty over winning popularity points. <br/>\n<br/>\nThank you for the space to examine ideas and cracks we might not have noticed developing in our thinking.  I always get the best advice or considerations from reading in your groups. We all talked this afternoon, and had some mixed but overwhelmingly positive results. Mostly, though, I can see that it wouldn&#39;t have been so bad to be more of a proponent of Dad instead of a friend to the kids. That balance was where I was feeling confused and lacking clarity.<br/>\n__________________________________<br/>\n<br/>\nWhen a kid asks one parent whether he/she can do something that’s a big deal one way or another, it’s probably best for that parent to say “I don’t know, I’ll check with [other parent]” or “I don’t think other parent will go along with that.”   Honest and supportive, but coming from “the parents.”<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Rights and Freedom:  was Family peace, religious beliefs","postDate":"1504723109","msgId":78263,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM1NjRFRDNGLTIwQTQtNDA3OC1CNjBELTM3RkMwRTk5QjNCOEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwYTgwMWQzMjcxMSQ2NTFhYWE1MCQyZjRmZmVmMCRAdGlydGFpcm5naXJlLmNvbT4=","referencesHeader":"PEI3QUY3NEM0LUU5MjktNDMzOS1BQkQ4LTJGOTc1NUQzOEIzM0BTYW5kcmFkb2RkLmNvbT4gPDQ2RjBDRDBDLUU0RDAtNDBFQy04MkU3LUVGOTVGNjUxQzg5MkBzYW5kcmFkb2RkLmNvbT4gPDAwYTgwMWQzMjcxMSQ2NTFhYWE1MCQyZjRmZmVmMCRAdGlydGFpcm5naXJlLmNvbT4="},"prevInTopic":78262,"nextInTopic":78267,"prevInTime":78262,"nextInTime":78264,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"Unschooling can be a problem. Unschooling can create strift. It’s good when new unschoolers stick around somewhere like this, or read lots by Joyce, or the","messageBody":"<div id=\"ygrps-yiv-273862129\">Unschooling can be a problem.<br/>\nUnschooling can create strift.<br/>\n<br/>\nIt’s good when new unschoolers stick around somewhere like this, or read lots by Joyce, or the collection on my site, or Pam Sorooshian’s blog.  I’m not even going to recommend much past that, because problems can pile up in the corners, sometimes about:  “FREEDOM.”<br/>\n<br/>\nYears ago, I was invited into a discussion (in AOL days, I think) to say what I thought about the nature of freedom.  The person who invited me was Helen Hegener, then the owner / editor of Home Education Magazine.  She had some friends more her age (older than I was) who had been homeschooling for some years, but they tended toward strident politics and being “out there” over peace in their children’s lives.<br/>\n<br/>\nWhen I went in, I didn’t know who was on which side of the question/argument.  I think that’s the way life should be.  I like it when people state their beliefs without knowing what side of the “trial” they will fall on.  Those who side with friends instead of being honest are worthless in discussions.  They lose points with me.<br/>\n<br/>\nWhat I said was that I thought freedom was NOT naturally-occurring in humans.  I thought it only existed when a group / culture / government granted it and could defend it.<br/>\n<br/>\nTurns out that was “the wrong answer.” I hadn’t said what Helen had wanted me to say.  So some of her friends proceeded to attempt to shame and discount and disassemble my argument, but I was unperturbed.  This is why:  I didn’t care what they thought.  Neither their opinions nor mine could change reality.<br/>\n<br/>\nI also had said, in my argument (it would be nice if I could find a printout of it someday, if I saved it, to transcribe and share) that Americans THOUGHT some things were true because the things were in founding documents, often quoted (with moving background music) but that was rhetoric and mythology, not fact or truth.<br/>\n<br/>\nFrom the earliest band of humanoids you can imagine or envision from what you’ve read or made up, there wasn’t “freedom” in every individual.  There were leaders, prominent members of the group, senior, older, stronger members of the group.  If a baby-human wanted to scream and run while tigers were near, his mom wasn’t going to get far with an argument that he had the same rights as anyone else in the group, and could do what he wanted.  SHE wouldn’t have the “freedom” to give him.<br/>\n<br/>\nFreedom, in children, is given to them by the parents.<br/>\nThe parents only have so much freedom to give in the first place.  The parents might have very, very little of it, if they’re in prison, or refugees, or one way or another indentured or enslaved.<br/>\n<br/>\nDo South Korean peasants have the right to protest? Should they have the freedom to just up and move to South Korea?  <br/>\nNo one in any other country gets to give them those rights and freedoms, and those trying to find ways to do so are risking killing them in the attempt.  <br/>\n<br/>\nDid medieval farm hands have the right to go sleep in that one nice bed he imagined existed up in that castle?  Probably his culture and religion kept him from even thinking about it.  <br/>\n<br/>\nPlease be careful with rhetoric.  Don’t make your children promises you can’t keep.  Don’t tell them the world is one way if that’s a fantasy world, or a distant world, or a theoretical world, and not THEIR world.<br/>\n<br/>\nDon’t tell them they could grow up to be president (or the equivalent where you live) if they can’t.  And even if they theoretically, legally, “can”—lots of factors would matter.  Even Hilary Clinton (I said this the other day in a presentation) who was more qualified than anyone EVER—eight years in the White House as first lady, former senator, former Secretary of State, has lived in more than just one state, had enough money, and support…. even she didn’t become president.<br/>\n<br/>\nAnd then I read this, aloud, and maybe it was recorded, or maybe you could read it with me in mind if you know what I sound like:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/president\">http://sandradodd.com/president</a><br/>\nI wrote it in 1996, so some parts might be amusing to those who know some things that have happened in the 21 years since.  But it’s not about being president, and it’s not written to amuse, but to help parents think.<br/>\n<br/>\nIf you have freedom in one area of your life or another, appreciate it.  Think about other times you could have lived (or might have, if you believe in reincarnation) when you didn’t have as much—or maybe you had more.  <br/>\n<br/>\nFreedom isn’t an element.  It’s not absolute, in anyone, anywhere.  TONS of advantage and privilege still have limitations.<br/>\n<br/>\nDon’t bark up the “rights” tree or the “freedom” tree.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Family peace, religious beliefs","postDate":"1504722053","msgId":78262,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyMzhGMEZDLUI0Q0UtNDRCRC1CQkMyLUM3MDBGMkI1RkFFOUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAwYTgwMWQzMjcxMSQ2NTFhYWE1MCQyZjRmZmVmMCRAdGlydGFpcm5naXJlLmNvbT4=","referencesHeader":"PEI3QUY3NEM0LUU5MjktNDMzOS1BQkQ4LTJGOTc1NUQzOEIzM0BTYW5kcmFkb2RkLmNvbT4gPDQ2RjBDRDBDLUU0RDAtNDBFQy04MkU3LUVGOTVGNjUxQzg5MkBzYW5kcmFkb2RkLmNvbT4gPDAwYTgwMWQzMjcxMSQ2NTFhYWE1MCQyZjRmZmVmMCRAdGlydGFpcm5naXJlLmNvbT4="},"prevInTopic":78261,"nextInTopic":78263,"prevInTime":78261,"nextInTime":78263,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"Rinelle-signed-Tamara wrote this, but it was at the bottom, and I think it’s important enough to repeat, just in case anyone missed it.  It can be useful in","messageBody":"<div id=\"ygrps-yiv-211990460\">Rinelle-signed-Tamara wrote this, but it was at the bottom, and I think it’s important enough to repeat, just in case anyone missed it.  It can be useful in EVERY family:<br/>\n________________<br/>\n<br/>\nI suspect that the mum has made this more difficult by siding with the children. Thus they feel that dad is the one being unfair. It’s too late to go back and take back those words, but maybe mum could say that she made a mistake. <br/>\n<br/>\nIf the kids are very close to adult age, then they will be able to make their own decisions soon. Remind them of that. Remind them of all the things dad does for them.<br/>\n_________________<br/>\n<br/>\nI’m going to start a new post to talk about rights and freedom.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":333388203,"authorName":"Rinelle","from":"&quot;Rinelle&quot; &lt;rinelle@...&gt;","profile":"rinelle2011","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] Family peace, religious beliefs","postDate":"1504703376","msgId":78261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwYTgwMWQzMjcxMSQ2NTFhYWE1MCQyZjRmZmVmMCRAdGlydGFpcm5naXJlLmNvbT4=","inReplyToHeader":"PDQ2RjBDRDBDLUU0RDAtNDBFQy04MkU3LUVGOTVGNjUxQzg5MkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEI3QUY3NEM0LUU5MjktNDMzOS1BQkQ4LTJGOTc1NUQzOEIzM0BTYW5kcmFkb2RkLmNvbT4gPDQ2RjBDRDBDLUU0RDAtNDBFQy04MkU3LUVGOTVGNjUxQzg5MkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78260,"nextInTopic":78262,"prevInTime":78260,"nextInTime":78262,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"... This is the way we’ve handled similar issues. My daughter (13) really wants to dye her hair, but her father is against it, especially as she has very","messageBody":"<div id=\"ygrps-yiv-1967698938\"><html><head><style><!--\n#ygrps-yiv-1967698938  \n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;panose-1:5 0 0 0 0 0 0 0 0 0;}\n _filtered #ygrps-yiv-1967698938 {font-family:\"Cambria Math\";panose-1:2 4 5 3 5 4 6 3 2 4;}\n _filtered #ygrps-yiv-1967698938 {font-family:Calibri;panose-1:2 15 5 2 2 2 4 3 2 4;}\n _filtered #ygrps-yiv-1967698938 {font-family:Verdana;panose-1:2 11 6 4 3 5 4 4 2 4;}\n _filtered #ygrps-yiv-1967698938 {font-family:Consolas;panose-1:2 11 6 9 2 2 4 3 2 4;}\n#ygrps-yiv-1967698938  \n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938MsoNormal, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938MsoNormal, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938MsoNormal\n\t{margin:0cm;margin-bottom:.0001pt;font-size:11.0pt;font-family:\"Calibri\", sans-serif;}\n#ygrps-yiv-1967698938 a:link, #ygrps-yiv-1967698938 span.ygrps-yiv-1967698938MsoHyperlink\n\t{color:blue;text-decoration:underline;}\n#ygrps-yiv-1967698938 a:visited, #ygrps-yiv-1967698938 span.ygrps-yiv-1967698938MsoHyperlinkFollowed\n\t{color:purple;text-decoration:underline;}\n#ygrps-yiv-1967698938 code\n\t{font-family:\"Courier New\";}\n#ygrps-yiv-1967698938 pre\n\t{margin:0cm;margin-bottom:.0001pt;font-size:10.0pt;font-family:\"Courier New\";}\n#ygrps-yiv-1967698938 tt\n\t{font-family:\"Courier New\";}\n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938msonormal0, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938msonormal0, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938msonormal0\n\t{margin-right:0cm;margin-left:0cm;font-size:11.0pt;font-family:\"Calibri\", sans-serif;}\n#ygrps-yiv-1967698938 span.ygrps-yiv-1967698938cat\n\t{}\n#ygrps-yiv-1967698938 span.ygrps-yiv-1967698938ct\n\t{}\n#ygrps-yiv-1967698938 span.ygrps-yiv-1967698938HTMLPreformattedChar\n\t{font-family:Consolas;}\n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938attach, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938attach, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938attach\n\t{margin-right:0cm;margin-left:0cm;font-size:9.0pt;font-family:\"Arial\", sans-serif;}\n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938bold, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938bold, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938bold\n\t{margin-right:0cm;margin-left:0cm;font-size:10.0pt;font-family:\"Arial\", sans-serif;font-weight:bold;}\n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938green, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938green, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938green\n\t{margin-right:0cm;margin-left:0cm;font-size:11.0pt;font-family:\"Calibri\", sans-serif;color:#628C2A;}\n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938replbq, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938replbq, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938replbq\n\t{margin:3.0pt;font-size:11.0pt;font-family:\"Calibri\", sans-serif;}\n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938ad, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938ad, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938ad\n\t{margin-right:0cm;margin-left:0cm;font-size:11.0pt;font-family:\"Calibri\", sans-serif;}\n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938underline, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938underline, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938underline\n\t{margin-right:0cm;margin-left:0cm;font-size:11.0pt;font-family:\"Calibri\", sans-serif;}\n#ygrps-yiv-1967698938 span.ygrps-yiv-1967698938yshortcuts\n\t{}\n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938ad1, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938ad1, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938ad1\n\t{margin-right:0cm;margin-left:0cm;font-size:11.0pt;font-family:\"Calibri\", sans-serif;}\n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938ad2, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938ad2, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938ad2\n\t{margin-right:0cm;margin-bottom:7.5pt;margin-left:0cm;font-size:11.0pt;font-family:\"Calibri\", sans-serif;}\n#ygrps-yiv-1967698938 p.ygrps-yiv-1967698938underline1, #ygrps-yiv-1967698938 li.ygrps-yiv-1967698938underline1, #ygrps-yiv-1967698938 div.ygrps-yiv-1967698938underline1\n\t{margin-right:0cm;margin-left:0cm;font-size:11.0pt;font-family:\"Calibri\", sans-serif;text-decoration:underline;}\n#ygrps-yiv-1967698938 span.ygrps-yiv-1967698938yshortcuts1\n\t{font-family:\"Verdana\", sans-serif;font-weight:bold;}\n#ygrps-yiv-1967698938 span.ygrps-yiv-1967698938yshortcuts2\n\t{font-family:\"Verdana\", sans-serif;font-weight:normal;}\n#ygrps-yiv-1967698938 span.ygrps-yiv-1967698938EmailStyle38\n\t{font-family:\"Calibri\", sans-serif;color:windowtext;}\n#ygrps-yiv-1967698938 .ygrps-yiv-1967698938MsoChpDefault\n\t{font-size:10.0pt;}\n _filtered #ygrps-yiv-1967698938 {margin:72.0pt 72.0pt 72.0pt 72.0pt;}\n#ygrps-yiv-1967698938 div.ygrps-yiv-1967698938WordSection1\n\t{}\n#ygrps-yiv-1967698938  \n _filtered #ygrps-yiv-1967698938 {}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;color:windowtext;}\n _filtered #ygrps-yiv-1967698938 {font-family:\"Courier New\";}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;}\n _filtered #ygrps-yiv-1967698938 {font-family:Symbol;}\n _filtered #ygrps-yiv-1967698938 {font-family:\"Courier New\";}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;}\n _filtered #ygrps-yiv-1967698938 {font-family:Symbol;}\n _filtered #ygrps-yiv-1967698938 {font-family:\"Courier New\";}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;}\n _filtered #ygrps-yiv-1967698938 {}\n _filtered #ygrps-yiv-1967698938 {font-family:Symbol;}\n _filtered #ygrps-yiv-1967698938 {font-family:\"Courier New\";}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;}\n _filtered #ygrps-yiv-1967698938 {font-family:Wingdings;}\n#ygrps-yiv-1967698938 ol\n\t{margin-bottom:0cm;}\n#ygrps-yiv-1967698938 ul\n\t{margin-bottom:0cm;}\n--></style></head><div class=\"ygrps-yiv-1967698938WordSection1\"><p style='margin-bottom:12.0pt;'>&gt; Holly wanted a tattoo and her dad really, deeply does not like tattoos. She needed parental permission. Against what is helpful for the preservation of marriages, New Mexico state law only requires the permission of one parent. I asked her to wait until she was 18, and she did. &lt;</p><p style='margin-bottom:12.0pt;'>This is the way we’ve handled similar issues. My daughter (13) really wants to dye her hair, but her father is against it, especially as she has very dark hair and would have to bleach to get the colour to take. I’ve told her she needs to wait until she’s older. </p><p style='margin-bottom:12.0pt;'>Even though I don’t agree with dad’s reasons for not wanting it done (he’s afraid of the chemicals), I haven’t said this to my daughter. I’ve stuck with dad. My daughter has been sad, but she will have many years of experimenting with hair dye when she’s older. </p><p style='margin-bottom:12.0pt;'>In the meantime, we’ve experimented with different, fun options. Temporary colour (most don’t work, but she felt better to have tried!), spray on colour, hair chalk.</p><p style='margin-bottom:12.0pt;'>I suspect that the mum has made this more difficult by siding with the children. Thus they feel that dad is the one being unfair. It’s too late to go back and take back those words, but maybe mum could say that she made a mistake. </p><p style='margin-bottom:12.0pt;'>If the kids are very close to adult age, then they will be able to make their own decisions soon. Remind them of that. Remind them of all the things dad does for them. </p><p style='margin-bottom:12.0pt;'>Tamara<br><br> <span style='color:white;'></span></p><p style='margin-bottom:12.0pt;'> &nbsp;</p></div></html></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Family peace, religious beliefs","postDate":"1504645658","msgId":78260,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlDMDk2N0I0LTYxNzYtNEQ0Qy05MTlCLTk2OUY5QTk4Q0JEMEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDAzRkE4N0ZGLTU3MkYtNDQ5NS1CRkEzLUI2RDUzNUNDMkJBMEBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEI3QUY3NEM0LUU5MjktNDMzOS1BQkQ4LTJGOTc1NUQzOEIzM0BTYW5kcmFkb2RkLmNvbT4gPDAzRkE4N0ZGLTU3MkYtNDQ5NS1CRkEzLUI2RDUzNUNDMkJBMEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78259,"nextInTopic":78261,"prevInTime":78259,"nextInTime":78261,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"I have some follow-up from the mom with the problem. _______ ... Her: Yes, all of the above. Plus people are inclined to launch into a religious lecture…. ","messageBody":"<div id=\"ygrps-yiv-967421952\">I have some follow-up from the mom with the problem.<br/>\n_______<br/>\nMe, quoted (I don’t know if the colors will stay so I’m marking it):<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=-My children want to do something that is not considered appropriate in our culture or religion.-=-<br/>\n&gt; <br/>\n&gt; There’s the “deadly sin” side, and there’s “the old women give us dirty looks” side.  And more, surely, because the dad’s unhappy.<br/>\n<br/>\n </span></blockquote>Her:<br/>\n<br/>\nYes, all of the above. Plus people are inclined to launch into a religious lecture….<br/>\n<br/>\nMe: <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; -=- I understand and support their position, but doing so is causing severe marital problems. -=-<br/>\n&gt; <br/>\n&gt; Tell the kids that several marital problems are reason enough not to do the thing, in my opinion because the two choices here seem like a false dichotomy AND bad choices:<br/>\n&gt; <br/>\n&gt; -=- I feel like I want to please and support everyone involved, but I am failing. Is it ok to let them work it out alone with their father, friends, relatives and extricate myself from these emotional discussions? Is that letting them down or letting them negotiate what it means to be an adult and make a different or unpopular choice?-=-<br/>\n&gt;  <br/>\n<br/>\n </span></blockquote>Her:<br/>\n<br/>\nThank you!! This is why I posted. Everything is getting muddled and I can&#39;t think of the most peaceful option clearly.  I have said that we need to respect Dad&#39;s religious and cultural beliefs (kids felt I was taking sides, offended when I offered that ruining my relationship w/ Dad was not worth it). I share in his beliefs, but like your in laws, I am not as strict as he is.<br/>\n<br/>\n<br/>\nme:<br/>\n<blockquote><span title=\"ireply\"> &gt; Taking the children’s side against the dad isn’t cool.  <br/>\n&gt; Abandoning the dad OR the children to work it out without you, also seems to me to be creating problems now and in the future both.<br/>\n<br/>\n </span></blockquote>Her:<br/>\n<br/>\nMy thoughts as well...they want to have some &quot;showdown&quot; or intellectual battle to force him to do it their way. I don&#39;t think it&#39;s a good idea, and he is (rightly) feeling tired of months of this topic.<br/>\n<br/>\nHer:<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; YOU take the dad’s side.  Defend his position, I think. <br/>\n&gt; Let it be something from the parents, not a disagreement between parents that the kids are left to negotiate, <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Had the mom taken the kids’ “side” over the dad, their marriage might not have lasted.  Unfortunately, it involved some dishonesty, but it was more a “don’t ask, don’t tell” stasis, to keep the peace.   That might not work in the situation above, but it might help some in the situations of others reading (if there are other situations now, or in the future).<br/>\n<br/>\n </span></blockquote>Me:<br/>\n<br/>\n<br/>\nI was feeling bad about this don&#39;t ask don&#39;t tell policy, too, which I had suggested. Or to do it in a few years, when they are out in their lives and older. They are angry with me for &quot;taking sides”<br/>\n<br/>\nHer:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; If the kids are fully set on wanting something the dad doesn’t want them to do or have or be, the most I think I would do would be to give them a pointer or two on how they might word their request, but also advise them that it might not work, and they might need to wait until they’re out of the house.<br/>\n&gt; <br/>\n&gt; Holly wanted a tattoo and her dad really, deeply does not like tattoos.  She needed parental permission.  Against what is helpful for the preservation of marriages, New Mexico state law only requires the permission of one parent.  I asked her to wait until she was 18, and she did.<br/>\n&gt; <br/>\n&gt; When I discussed that with other unschoolers (maybe in this group, not sure where) some thought I should just sign off on it.  That seemed to me, though, like saying “Screw you, Keith” to my husband, or “It’s none of your business what your kids do.”  I wasn’t interested in that level of insult and disregard.  Neither was Holly, as it turns out, and based just on the conversations with me (I think) she waited.<br/>\n<br/>\n </span></blockquote>Her:<br/>\n<br/>\n Thank you. I have felt (and acted) as you described above, but was feeling like I am somehow letting the kids down because they are unhappy with my decision to support the cohesion of family and respect Dad&#39;s wishes. I was frightened to lose the closeness and candor we have and thought you all might have ideas that hadn&#39;t occurred to me. <br/>\n<br/>\nThey are spending the day together tomorrow to talk, again. So I gather the healthiest thing would be to go ahead and support Dad (as I am inclined to do) and let them get angry with me(?) These are really eloquent, strong-willed kids, and they are quite passionate about this. <br/>\n<br/>\n__________-<br/>\n<br/>\n*****apologies, Sandra, because 1- not sure how to post directly and anonymously to AL and 2- I realize the ball is not mine anymore, in the discussion, so If my follow up is not useful to further the discussion, please just delete it. I am feeling oddly torn and a bit unclear, and my writing to you probably reflects that. Thank you, though, because your thoughts are very much aligned with mine and helped reinforce the idea that family peace comes first. I felt like I was giving the finger to my husband or deserting my kids, which is, of course, a false dichotomy. <br/>\n<br/>\n___________<br/>\n<br/>\n[It’s not a doable deal, &quot;to post directly and anonymously to AL” so this way was fine.]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Family peace, religious beliefs","postDate":"1504620390","msgId":78259,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzRkE4N0ZGLTU3MkYtNDQ5NS1CRkEzLUI2RDUzNUNDMkJBMEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEI3QUY3NEM0LUU5MjktNDMzOS1BQkQ4LTJGOTc1NUQzOEIzM0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEI3QUY3NEM0LUU5MjktNDMzOS1BQkQ4LTJGOTc1NUQzOEIzM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78258,"nextInTopic":78260,"prevInTime":78258,"nextInTime":78260,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"There are some religious “settings” about diet or language maybe, or clothing, or behavior, that parents can’t “allow under their roof” without,","messageBody":"<div id=\"ygrps-yiv-1426761635\">There are some religious “settings” about diet or language maybe, or clothing, or behavior, that parents can’t “allow under their roof” without, then, the parents having sinned.  I can’t recommend that any family put unschooling above religion or above the expectations of grandparents, with these exceptions.  Kind of smart-aleck exceptions, and there is humor and truth, rolled all together here:<br/>\n<br/>\nIf the grandparental expectations are all about school, they went to school 50 years ago or more, so that’s about education and unschooling might be more important than that. <br/>\n<br/>\nIf the grandparents have so much money that it would be crazy to risk causing your children NOT to inherit any, pay more attention to what those grandparents want, maybe.   (Seriously, or now… depends on the family and circumstances, and how confident you are that your unschooling will eventually impress the hell out of the grandparents.)<br/>\n<br/>\nIf your religion doesn’t let you say “hell” and you can only say “heck” (or “Oh my heck” if you’re Mormon)… then don’t quote me, because I’m a reckless heathen.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Family peace, religious beliefs","postDate":"1504620326","msgId":78258,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQ2RjBDRDBDLUU0RDAtNDBFQy04MkU3LUVGOTVGNjUxQzg5MkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEI3QUY3NEM0LUU5MjktNDMzOS1BQkQ4LTJGOTc1NUQzOEIzM0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PEI3QUY3NEM0LUU5MjktNDMzOS1BQkQ4LTJGOTc1NUQzOEIzM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":78257,"nextInTopic":78259,"prevInTime":78257,"nextInTime":78259,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"-=-My children want to do something that is not considered appropriate in our culture or religion.-=- There’s the “deadly sin” side, and there’s “the","messageBody":"<div id=\"ygrps-yiv-599051480\">-=-My children want to do something that is not considered appropriate in our culture or religion.-=-<br/>\n<br/>\nThere’s the “deadly sin” side, and there’s “the old women give us dirty looks” side.  And more, surely, because the dad’s unhappy.<br/>\n<br/>\n-=- I understand and support their position, but doing so is causing severe marital problems. -=-<br/>\n<br/>\nTell the kids that several marital problems are reason enough not to do the thing, in my opinion because the two choices here seem like a false dichotomy AND bad choices:<br/>\n<br/>\n-=- I feel like I want to please and support everyone involved, but I am failing. Is it ok to let them work it out alone with their father, friends, relatives and extricate myself from these emotional discussions? Is that letting them down or letting them negotiate what it means to be an adult and make a different or unpopular choice?-=-<br/>\n<br/>\nTaking the children’s side against the dad isn’t cool.  <br/>\nAbandoning the dad OR the children to work it out without you, also seems to me to be creating problems now and in the future both.<br/>\n<br/>\nYOU take the dad’s side.  Defend his position, I think. <br/>\nLet it be something from the parents, not a disagreement between parents that the kids are left to negotiate, like a chasm on a mountaineering expedition.  Keep the family safer, the kids safer, until they’re grown.  Hike on an easier trail, instead of doing the harder and more dangerous maneuvers, I think.<br/>\n<br/>\nI have a daughter-in-law (pregnant, too) whose dad was very Catholic and the rest of the family was not.  I recently attended his Catholic funeral.  His wife and five children are protestant-to-non-religious, but the dad, always, had Catholic viewpoints and was uncompromising about that, in some ways.  So there were things the daughter didn’t tell him.  There were things the mom asked her not to tell him.  Rather than the mom taking the daughter’s side and saying “do what you want to do,” she would say “that would upset your dad more than it’s worth.”<br/>\n<br/>\nThose quotes aren’t literal exact quotes, and we knew the daughter after she was over 21, and still… she sheltered her dad from the realities of her “sex life.”<br/>\nBut he loved Marty, and supported their relationship as he knew it (or as he chose to pretend to know it), and fully supported their marriage (three years ago this November).  He knew of the pregnancy before he died, in July, and was happy for them.<br/>\n<br/>\nHad the mom taken the kids’ “side” over the dad, their marriage might not have lasted.  Unfortunately, it involved some dishonesty, but it was more a “don’t ask, don’t tell” stasis, to keep the peace.   That might not work in the situation above, but it might help some in the situations of others reading (if there are other situations now, or in the future).<br/>\n<br/>\nThis sounds like a bad idea to me:<br/>\n-=- Is it ok to let them work it out alone with their father, friends, relatives and extricate myself from these emotional discussions? Is that letting them down or letting them negotiate what it means to be an adult and make a different or unpopular choice?-=-<br/>\n<br/>\nIf the kids are fully set on wanting something the dad doesn’t want them to do or have or be, the most I think I would do would be to give them a pointer or two on how they might word their request, but also advise them that it might ot work, and they might need to wait until they’re out of the house.<br/>\n<br/>\nHolly wanted a tattoo and her dad really, deeply does not like tattoos.  She needed parental permission.  Against what is helpful for the preservation of marriages, New Mexico state law only requires the permission of one parent.  I asked her to wait until she was 18, and she did.<br/>\n<br/>\nWhen I discussed that with other unschoolers (maybe in this group, not sure where) some thought I should just sign off on it.  That seemed to me, though, like saying “Screw you, Keith” to my husband, or “It’s none of your business what your kids do.”  I wasn’t interested in that level of insult and disregard.  Neither was Holly, as it turns out, and based just on the conversations with me (I think) she waited.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Family peace, religious beliefs","postDate":"1504618679","msgId":78257,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI3QUY3NEM0LUU5MjktNDMzOS1BQkQ4LTJGOTc1NUQzOEIzM0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":78258,"prevInTime":78256,"nextInTime":78258,"topicId":78257,"numMessagesInTopic":0,"msgSnippet":"Anonymously brought: ______________________ My children want to do something that is not considered appropriate in our culture or religion. I understand and","messageBody":"<div id=\"ygrps-yiv-1883396916\">Anonymously brought:<br/>\n<br/>\n______________________<br/>\n<br/>\nMy children want to do something that is not considered appropriate in our culture or religion. I understand and support their position, but doing so is causing severe marital problems. I feel like I want to please and support everyone involved, but I am failing. Is it ok to let them work it out alone with their father, friends, relatives and extricate myself from these emotional discussions? Is that letting them down or letting them negotiate what it means to be an adult and make a different or unpopular choice?<br/>\n<br/>\nI have made it clear that I love and respect them all, and my personal priority is that we (our family) live in a peaceful, respectful and loving way. I feel exhausted from being everyone&#39;s confidante and in the process, being expected to carry each person&#39;s perspective into the discussion (I personally have no strong feelings attached to the issue at hand). Discussions are very calm but emotionally draining, as all sides have firm beliefs.  <br/>\n________________________________<br/>\n<br/>\nSlight additional information:  Children are female, and not very young.<br/>\nIf we get toward enough information to identify the family, it would be better to drop it, so please be philosophical and general and don’t ask questions. :-)  Phrase suggestions as “perhaps one could…” rather than “Why don’t you…” if you can remember to do that.  That’s probably a good policy for ALL discussions of unschooling. :-)<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":78282,"nextTopicId":78287}}