{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":164396504,"authorName":"Elizabeth Roberts","from":"Elizabeth Roberts &lt;mamabethuscg@...&gt;","profile":"mamabethuscg","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"more shifting","postDate":"1073146347","msgId":87649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwMTAzMTYxMjI3LjY5MTMzLnFtYWlsQHdlYjEyNjA5Lm1haWwueWFob28uY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":87648,"nextInTime":87650,"topicId":87649,"numMessagesInTopic":0,"msgSnippet":"Typically, we sleep in in the mornings and head to bed late, around 2230 to 2300. We started giving Sarah a bedtime when she started school, and we ve kept","messageBody":"<div id=\"ygrps-yiv-719248016\">Typically, we sleep in in the mornings and head to bed late, around 2230 to 2300. We started giving Sarah a &quot;bedtime&quot; when she started school, and we&#39;ve kept that up thinking that if we didn&#39;t, she was more likely to act wild the next day. She doesn&#39;t necessarily have to go to sleep anymore since she&#39;s not getting up for school...but I was really beginning to feel like this was un-necessary to continue. <br/>\n <br/>\nWhile I haven&#39;t said &quot;Sarah you&#39;re not going to have a bedtime anymore&quot; yet because I know Paul will still want to &quot;send her to bed&quot; at 2130, as far as I&#39;m concerned when he isn&#39;t home and I am, then we&#39;ll do things my way. <br/>\n <br/>\nSo last night, Sarah said she wanted to stay up all night. I said &quot;Oh, really? Go right ahead.&quot; Logan wanted to stay up as well. He ended up in his bedroom about 2300, and I went to check on him. He was playing with his cars, so I asked if I could play too. We had a good time for about twenty minutes, making up stories and buzzing our lips to make car sounds. <br/>\n <br/>\nThen he asked to play his Thomas computer game. So I let him. Since Gracie was asleep on my bed, I went and laid down on the twin bed in the Littles&#39; room that nobody actually uses as a bed. I read for awhile, then Sarah came and said Logan was off the computer and had fallen asleep on the couch with Megan. <br/>\n <br/>\nI told Sarah I was headed to bed, and I asked her to keep things quiet. About 0200 I had to ask her to turn off the TV because she kept turning the volume up loud enough for me to hear it, which was disturbing my rest. She said &quot;Ok, I&#39;m kinda tired anyway&quot; and she slept on the recliner with a blanket. Logan and Megan looked pretty darn cute all curled around each other like puppies. <br/>\n <br/>\nGracie woke up about 0830, and then I heard Megan about 10:00 and Logan and Sarah just a couple minutes after. It was nice..I laid in my bed listening and heard Megan saying &quot;Buh-EEEE!!! Way up!!! Sisssssiiiee!! WAY UP!&quot; as she tried to wake them up. <br/>\n <br/>\nEveryone woke up cheerfully, and so far this morning nobody&#39;s acting wild. <br/>\n <br/>\nI think we&#39;ll continue this.<br/>\n <br/>\nMamaBeth<br/>\n<br/>\n<br/>\nEverything I need to know, I learned on my own!<br/>\n<br/>\n---------------------------------<br/>\nDo you Yahoo!?<br/>\nFree Pop-Up Blocker - Get it now<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":87648,"nextTopicId":87251}}