{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lisa Bugg","from":"&quot;Lisa Bugg&quot; &lt;LisaBugg@...","replyTo":"LIST","senderId":"lNrdADORbXswYgpa8pPYCN2kARG62tNSQaLUQll5seMqC51uzz6KJDypCLFRaW8rSkuJT7vgcxiV08-hHUizk-qplhqnODOvZlOTtzs","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: child centered parenting..","postDate":"939216629","msgId":3608,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNDQuMzYwOC45NTkyNjk3NDJAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":3607,"nextInTime":3609,"topicId":3608,"numMessagesInTopic":0,"msgSnippet":"... the ... material ... Faith, I once sat next to a new mom, who was holding a crying 6 month old. She was watching her watch.  That baby needed a drink and","messageBody":"<div id=\"ygrps-yiv-1572471798\"><blockquote><span title=\"ireply\">&gt; I am having a very hard time with the fact that so many people are judging<br/>\n </span></blockquote>the<br/>\n<blockquote><span title=\"ireply\"> &gt; Ezzo&#39;s on what they have heard other people say, instead of reading the<br/>\n </span></blockquote>material<br/>\n<blockquote><span title=\"ireply\"> &gt; and then judging for themselves.<br/>\n<br/>\n </span></blockquote>Faith, I once sat next to a new mom, who was holding a crying 6 month old.<br/>\nShe was watching her watch.  That baby needed a drink and she wouldn&#39;t<br/>\n*give in to his sinful nature* by nursing him 10 minutes early.  You have no<br/>\nidea the self-control I learned on that day.  Not just in keeping my hands<br/>\noff of that miserable baby, I wanted to take him and nurse him myself, but<br/>\nin keeping my tone of voice and body language in check.<br/>\n<br/>\nBaby&#39;s do not *nurse on demand*, babies let you know something is wrong by<br/>\ncrying.  As mom you offer all kinds of things to help. Offering to nurse is<br/>\nnot always about food and hunger schedules.  Sometimes it is about comfort.<br/>\nA baby feels safe and warm and loved while being nursed, so that if for<br/>\nwhatever reason they become scared, nursing is soothing.  If we were out and<br/>\nabout in the wind and weather, sometimes my babies just wanted a drink, not<br/>\na meal.<br/>\n<br/>\nI have worked in a midwifery practice.  We were trained to spot *Ezzo*<br/>\nbabies.  Every local emergency room in VA went through a training class on<br/>\nhow to spot *Ezzo* babies, you see they were seeing hundreds of dehydrated<br/>\nbabies in the ER  (this was in 90-92).<br/>\n<br/>\nSome days I&#39;m very hungry, the first day of fall finds me fixing something<br/>\nfilling like stew. Other days bring other needs. If a baby is moving into a<br/>\ngrowth spurt they will nurse 2-3 times as much as normal so as to increase<br/>\nthe milk supply.  Factor in your own body chemistry and you have too many<br/>\nvariables to be able to nurse on someone else&#39;s schedule.<br/>\n<br/>\nEach nursing relationship is different.  All 4 of my children nursed for<br/>\ndifferent lengths of time and in different ways.  I had one child that<br/>\nnursed for nutrition for his first 18 months.  That child nursed every hour<br/>\nto an hour and half.   The second son would nurse every 4 hours and<br/>\nsometimes I had to ask him to nurse, as I needed him to. Neither baby was<br/>\n&quot;good&quot; or &quot;bad&quot;, they were just my sons with their different needs.<br/>\n<br/>\nI think you are doing the right thing, listening to all kinds of theories<br/>\nthen picking out what works for you.  The most important thing you have been<br/>\ngiven is your *mommy voice*, that little internal voice that tells you this<br/>\nfits this baby, this works for today---or conversely, this isn&#39;t quite<br/>\nright.  You are the mom and you must trust yourself first, no matter what<br/>\nany method, theory or interested friend says.  If and when you feel<br/>\nconflicted about something and your mommy voice is unsure, always, always,<br/>\nalways, choose kindness at your course of action.</div>","specialLinks":[]}],"prevTopicId":3604,"nextTopicId":3592}}