{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Introductions and questions","postDate":"1350345127","msgId":69385,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1aTdqNys4bzl0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs1Z3BlZSsxMWE2QGVHcm91cHMuY29tPg=="},"prevInTopic":69381,"nextInTopic":0,"prevInTime":69384,"nextInTime":69386,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"... ************* Why did you decide to try unschooling? Was your son stressed out and unhappy? If so, that s a place to start talking - that you ve been","messageBody":"<div id=\"ygrps-yiv-1761812092\">&quot;graceoathome&quot; &lt;g.onasanya@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; My question is whether <br/>\n&gt; to say we are no longer following THAT curriculum (without saying they can do whatever they are interested in) so he does not HAVE to read anything he does not want to read<br/>\n&gt; or<br/>\n&gt; to say something like we are doing things differently, recognising the fact that people learn from life, not from following a curriculum or recommended reading.<br/>\n </span></blockquote>*************<br/>\n<br/>\nWhy did you decide to try unschooling? Was your son stressed out and unhappy? If so, that&#39;s a place to start talking - that you&#39;ve been concerned and so you&#39;re researching other ways to homeschool, and right now you thought it would help to take a break for awhile. He&#39;s not responsible for learning anything right now.<br/>\n<br/>\nThen listen to his concerns. He&#39;s 14, and the idea of taking a break from education will probably sound a bit strange to him - he&#39;s already worried about &quot;falling behind&quot; so that&#39;s something to talk about, but maybe not in terms like &quot;learning from life&quot; which can be very intimidating and sound like you&#39;ve made him responsible for figuring it all out. Rather than stories of what unschoolers have achieved, start with reassuring stories about kids who took breaks from school - a year, four years - and still were able to &quot;catch up&quot; and get into college. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":323846007,"authorName":"graceoathome","from":"&quot;graceoathome&quot; &lt;g.onasanya@...&gt;","profile":"graceoathome","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Introductions and questions","postDate":"1350297870","msgId":69381,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1Z3BlZSsxMWE2QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs1ZWo5bCtubjNlQGVHcm91cHMuY29tPg=="},"prevInTopic":69371,"nextInTopic":69385,"prevInTime":69380,"nextInTime":69382,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"Hello again, I appreciate the responses I had to my queries last week, thank you. I have another question(s) As I mentioned before, we had a schedule of","messageBody":"<div id=\"ygrps-yiv-2123724678\">Hello again,<br/>\n<br/>\nI appreciate the responses I had to my queries last week, thank you. I have another question(s)<br/>\n<br/>\nAs I mentioned before, we had a schedule of reading which we had been attempting to follow.  My 14yo has been saying he HAS to do a certain amount of reading to catch up.  I have thought about how to respond to him as I have not announced that we are dropping all arbitrary rules and thought I should run my thoughts past you to benefit from your experience.  <br/>\n<br/>\nMy question is whether <br/>\nto say we are no longer following THAT curriculum (without saying they can do whatever they are interested in) so he does not HAVE to read anything he does not want to read<br/>\nor<br/>\nto say something like we are doing things differently, recognising the fact that people learn from life, not from following a curriculum or recommended reading. Then I would ask him which of the books he would read (or not) if he was not required to and then suggest to him that he only read those and use his spare time to pursue his other interests. <br/>\n<br/>\nAlso, with my 14yo, I would like to show him some of the stories of what children from Unschooling families have achieved.  I am conscious that my &#39;schooling&#39; background means that I highlight the more academic stories and that may be putting undue pressure on him.  So my second question is whether any of you have any thoughts on the benefits or otherwise of showing him such stories. I feel that because he is older, he will have less time to experience this than his brothers and having other stories may help him.<br/>\n<br/>\nThanks again for your time.<br/>\n<br/>\nGrace</div>","specialLinks":[]},{"userId":332901363,"authorName":"keetry","from":"&quot;keetry&quot; &lt;keetry@...&gt;","profile":"keetry","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Introductions and questions","postDate":"1350226037","msgId":69371,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1ZWo5bCtubjNlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDEzOTUwMjVDLUYxNjQtNENBOS05NDUzLTE5RDA2M0FENkI1M0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":69369,"nextInTopic":69381,"prevInTime":69370,"nextInTime":69372,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"== As to taking attendance, that law can t apply to kids who are home.  They want you to assure them that for 180 days (or whatever the school year is there)","messageBody":"<div id=\"ygrps-yiv-1202669557\">== As to &quot;taking attendance,&quot; that law can&#39;t apply to kids who are home.  They want you to assure them that for 180 days (or whatever the school year is there) your kids were with you, doing cool stuff.==<br/>\n<br/>\nHomeschoolers in my state are required to take attendance and keep it on file for a year. We can even get an attendance sheet from the state homeschool website. I laugh when about it because I don&#39;t see how it&#39;s not a given that if the child is home, he was in attendance that day. <br/>\n<br/>\nThe powers that be in my state don&#39;t want to be assured that we were together doing cool stuff. They want to be assured that the child is getting &quot;academic instruction&quot; for 9 consecutive months out of the year. So, we are supposed to keep attendance for every day that the child received said academic instruction. This can be easy or difficult depending on how you think about it, I guess.<br/>\n<br/>\nIt would be very easy for people to look at us and say that we never do any academic instruction and, therefore, aren&#39;t complying with the attendance laws for my state. However, I found it kind of difficult at first to choose which days to not mark for attendance. My kids are always learning. There isn&#39;t a time when they aren&#39;t so when are they not in attendance? I just decided to follow the regular public school schedule to make it easy for everyone. I mark off most weekdays, leave weekends and the occasionally holiday blank.<br/>\n<br/>\nAlysia</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Introductions and questions","postDate":"1350178815","msgId":69369,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYwNTRGMUQ2LTAwREUtNDVBRC1COTRBLTU1MkUzQzA0MDUwNkB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PFNOVDEzMy1kczE3MTdFQkFBRUNCNEQ1ODlFN0RCOURDNDczMEBwaHguZ2JsPg==","referencesHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPiA8U05UMTMzLWRzMTcxN0VCQUFFQ0I0RDU4OUU3REI5REM0NzMwQHBoeC5nYmw+"},"prevInTopic":69366,"nextInTopic":69371,"prevInTime":69368,"nextInTime":69370,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"... So talk about some other things they can say. Like they can mention a current interest. Or something they learned. Or something interesting they did. ","messageBody":"<div id=\"ygrps-yiv-945650022\">On Oct 13, 2012, at 12:59 PM, CASS KOTRBA wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I took the kids aside and told them that we probably shouldn&#39;t tell people we are doing nothing.<br/>\n<br/>\n </span></blockquote>So talk about some other things they can say. Like they can mention a current interest. Or something they learned. Or something interesting they did.<br/>\n<br/>\nThey&#39;re old enough you can say adults have a hard time understanding how kids can learn outside of school. So if they can mention something interesting they&#39;ve learned recently the adults won&#39;t feel so nervous.<br/>\n<br/>\nAnd then they can turn the question around and ask the adult what their current favorite interests are.<br/>\n<br/>\nJoyce<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Introductions and questions","postDate":"1350174363","msgId":69366,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzOTUwMjVDLUYxNjQtNENBOS05NDUzLTE5RDA2M0FENkI1M0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFNOVDEzMy1kczE3MTdFQkFBRUNCNEQ1ODlFN0RCOURDNDczMEBwaHguZ2JsPg==","referencesHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPiA8U05UMTMzLWRzMTcxN0VCQUFFQ0I0RDU4OUU3REI5REM0NzMwQHBoeC5nYmw+"},"prevInTopic":69365,"nextInTopic":69369,"prevInTime":69365,"nextInTime":69367,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"Oh right...  You had questions. -=-t I m very concerned about what my rights are to truly teach my children as I see fit. The law requires me to take","messageBody":"<div id=\"ygrps-yiv-748185676\">Oh right...  You had questions.<br/>\n<br/>\n-=-t I&#39;m very concerned about what my rights are to truly teach my children as I see fit. The law requires me to take attendance and keep records but I&#39;m failing to see how that&#39;s really possible. Any thoughts on this would be appreciated. I don&#39;t want them to feel ashamed or like they need to hide the truth but on the other hand I don&#39;t want the authorities knocking on my door either!-=-<br/>\n<br/>\nFor details on how it really works locally, stay in touch with others in your area.  That&#39;s not something to be discussed on Always Learning, as it&#39;s local.<br/>\n<br/>\nFor those who live in VERY strict places, there are ideas for ways to describe this kind of &quot;facilitation of learning&quot; here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum\">http://sandradodd.com/unschoolingcurriculum</a><br/>\n<br/>\nAs to &quot;taking attendance,&quot; that law can&#39;t apply to kids who are home.  They want you to assure them that for 180 days (or whatever the school year is there) your kids were with you, doing cool stuff.   Keeping records can be beautifully done with a blog and a camera.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Introductions and questions","postDate":"1350174171","msgId":69365,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkwNDc2MzhGLTlFN0MtNEQwRC1CQjE1LTVFMDlDN0Y2OTQ4OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PFNOVDEzMy1kczE3MTdFQkFBRUNCNEQ1ODlFN0RCOURDNDczMEBwaHguZ2JsPg==","referencesHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPiA8U05UMTMzLWRzMTcxN0VCQUFFQ0I0RDU4OUU3REI5REM0NzMwQHBoeC5nYmw+"},"prevInTopic":69364,"nextInTopic":69366,"prevInTime":69364,"nextInTime":69366,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"-=- At some moments I feel excited and comfortable with the change and in the next moment I have the feeling you get when you re dreaming and feel like your","messageBody":"<div id=\"ygrps-yiv-839925262\">-=- At some moments I feel excited and comfortable with the change and in the next moment I have the feeling you get when you&#39;re dreaming and feel like your falling off a cliff and trying to catch yourself! I suppose this is normal with such a big change. This is a whole new (and wonderful) way of looking at the world and my family so I&#39;m trying to be patient with myself and remind myself about 20 times a day to just relax and breathe!-=-<br/>\n<br/>\nI used to wake up in a little panic, occasionally, in the first year and a half or so.  Kind of like &quot;I dreamed we didn&#39;t send Kirby to school...&quot; and then wake up suddenly realizing it wasn&#39;t a dream.<br/>\n<br/>\nI like your description.  I&#39;ll probably use it in a talk I&#39;m giving this week. :-)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":443923164,"authorName":"CASS KOTRBA","from":"&quot;CASS KOTRBA&quot; &lt;caskot@...&gt;","profile":"cass.kotrba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Introductions and questions","postDate":"1350147550","msgId":69364,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PFNOVDEzMy1kczE3MTdFQkFBRUNCNEQ1ODlFN0RCOURDNDczMEBwaHguZ2JsPg==","inReplyToHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPg=="},"prevInTopic":69359,"nextInTopic":69365,"prevInTime":69363,"nextInTime":69365,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"I am also very new to unschooling.  My kids, ages 8 & 10 have been in public school until a few weeks ago.  I apologize to those more experienced people on the","messageBody":"<div id=\"ygrps-yiv-993223277\">I am also very new to unschooling.  My kids, ages 8 & 10 have been in public school until a few weeks ago.  I apologize to those more experienced people on the list for whom this conversation is repetitive and not moving the bar forward but I believe there are a lot of newcomers on this list and for us the conversation is new and relevant.  At some moments I feel excited and comfortable with the change and in the next moment I have the feeling you get when you&#39;re dreaming and feel like your falling off a cliff and trying to catch yourself!  I suppose this is normal with such a big change.  This is a whole new (and wonderful) way of looking at the world and my family so I&#39;m trying to be patient with myself and remind myself about 20 times a day to just relax and breathe!<br/>\n<br/>\nI wanted to share the way that I have gotten my husband on board.  I have been explaining to him what I&#39;ve been learning and he has been open to it as he hated school himself and failed to see the point of most of it.  I sent him the recent article that was posted here - <a rel=\"nofollow\" target=\"_blank\" href=\"http://zenhabits.net/unschool/&lt;about:blank\">http://zenhabits.net/unschool/&lt;about:blank</a>&gt; - along with the link to Sandra&#39;s deschooling page and a forward of the conversation recently stimulated from the post &quot;A letter from a curious family member&quot;.   I asked him if he wouldn&#39;t mind reading over some of it when he had a moment.  Monday he came home for lunch and said &quot;so did you guys do school at all this morning&quot; and I responded with a gentle, nonjudgemental &quot;you didn&#39;t have a chance to read those links yet, huh?&quot;  He said that he had opened my email but it looked like a lot of reading & he just didn&#39;t have time.  In a very friendly way I let him know that this was a big change for our family and that I wanted to make sure we all stayed on the same page about it and that I valued his opinion.  I expressed that I would consider it a personal favor to me if he could find a moment.  He was headed to the bathroom so with a twinkle in my eye I asked if possibly he could read just that first link from his phone while he was in there.  He laughed and agreed.  Evidently he had time to read the description of unschooling as well as the info on deschooling.  When he came down he was all chatty and upbeat about it.  He has instigated a couple of conversations since then and now that he has done a little reading on his own he feels ownership over the idea so that approach has worked for us.<br/>\n<br/>\nSo last night our daughter was at a birthday party for one of her friends from school.  One of the moms asked her how homeschooling was going and she told her it was great.  She said &quot;we aren&#39;t really doing anything!&quot; (giggle giggle).  The other mom got a horrified look on her face as I stood there with a nervous laugh.  She looked at me and then responded with &quot;well yes, I suppose it does seem like doing nothing compared to being in school all day.&quot;  I took the kids aside and told them that we probably shouldn&#39;t tell people we are doing nothing.  I have been telling most people that we are doing very relaxed homeschooling as I think they will be able to understand that.  My concern is that if other parents think we are &quot;doing nothing&quot; they might report us to the school as we live in a pretty small community.   We live in Colorado where the law is pretty relaxed but I&#39;m very concerned about what my rights are to truly teach my children as I see fit.  The law requires me to take attendance and keep records but I&#39;m failing to see how that&#39;s really possible.  Any thoughts on this would be appreciated.  I don&#39;t want them to feel ashamed or like they need to hide the truth but on the other hand I don&#39;t want the authorities knocking on my door either!<br/>\n<br/>\nThanks so much,<br/>\nCass<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Introductions and questions","postDate":"1350020043","msgId":69359,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWR1bVVRNm5MaHI4Tmk0VytWQU9GYWtKa2hYODZSRERZUXpaaU9TdFNGPVdYQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPg=="},"prevInTopic":69358,"nextInTopic":69364,"prevInTime":69358,"nextInTime":69360,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"... I think that one of the things that was a big adjustment for me was that I started listening to myself as I spoke to my children and paid attention to how","messageBody":"<div id=\"ygrps-yiv-2086591353\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;On Thu, Oct 11, 2012 at 6:58 PM, graceon2012 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:g.onasanya@...\">g.onasanya@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt; 1. On one of the sites, I read about not just dropping all rules, but<br/>\n&gt; saying yes more, I am doing that. My question is how to let my children<br/>\n&gt; know that things are going to be be different. Any suggestions on what to<br/>\n&gt; say so they know they no longer &#39;have to try&#39; to read the books we had<br/>\n&gt; scheduled but only those they really want to read for instance.<br/>\n&gt;<br/>\n&gt; Grace&lt;&lt;&lt;&lt;&lt;<br/>\n&gt;<br/>\n </span></blockquote>I think that one of the things that was a big adjustment for me was that I<br/>\nstarted listening to myself as I spoke to my children and paid attention to<br/>\nhow I sounded.  I realized that I was often disrespectful to my children<br/>\nand addressed them in ways that I would have bristled at if someone spoke<br/>\nto me that way.  Even in a simple conversation about the day&#39;s activities,<br/>\nI remember realizing that I sounded as if I were speaking to someone who I<br/>\ndidn&#39;t respect with no room for discussion or disagreement.  I felt a deep<br/>\nsense of disappointment in myself because I had this vision of myself as<br/>\nthis wonderful mom who treated her children like fellow humans in progress,<br/>\nwho only lacked experience but were just as &#39;worthy&#39; and deserving of self<br/>\ndirection as any adult.<br/>\n<br/>\nI had to wake up and be honest with myself.  When I changed my tone of<br/>\nvoice, when I listened more and talked less (not a natural habit to me) and<br/>\nthen when I spoke, I asked questions in a genuine way, with real interest<br/>\nin what my children had to say. As I changed my behavior, my children<br/>\nrelaxed and came to trust me more and so expressed more choices that I<br/>\nwould support and participate with as they led.<br/>\n<br/>\nTo borrow from Flylady--baby steps.<br/>\nchris<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Introductions and questions","postDate":"1350008082","msgId":69358,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxQ0NCREFGLTI1QzktNDQwNC1BNkZCLTJBNDU5RUI1OTYxN0BTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPg=="},"prevInTopic":69357,"nextInTopic":69359,"prevInTime":69357,"nextInTime":69359,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"-=-On one of the sites, I read about not just dropping all rules, but saying yes more, I am doing that. My question is how to let my children know that things","messageBody":"<div id=\"ygrps-yiv-292654904\">-=-On one of the sites, I read about not just dropping all rules, but saying yes more, I am doing that. My question is how to let my children know that things are going to be be different. Any suggestions on what to say so they know they no longer &#39;have to try&#39; to read the books we had scheduled but only those they really want to read for instance.-=-<br/>\n<br/>\nGo gradually.  <br/>\nTell them you want to try a different way.  If they ask if they have to do something, you could say &quot;you can if you want to,&quot; or &quot;It&#39;s okay with me if you don&#39;t.&quot;<br/>\n<br/>\n-=-3. I am so new to this, I do not know how to explain it but I need to find a succinct way to help my husband understand without him needing to read all that I am reading. Any suggestions would be welcome. <br/>\n-=-<br/>\n<br/>\nYou and your husband could share Pam Laricchia&#39;s new series of e-mails.  I think it lasts a month or six weeks.  I&#39;ve seen two, and they&#39;re really great.<br/>\n<br/>\nShe also has a book that&#39;s less than 100 pages, with a clear outline.<br/>\n<br/>\nBoth are linked here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.livingjoyfully.ca\">http://www.livingjoyfully.ca</a>  <br/>\n<br/>\nThere are things by and about dads here:  <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/dads\">http://sandradodd.com/dads</a> but he might not be interested in that yet.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Introductions and questions","postDate":"1350007894","msgId":69357,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEY0MjA3OTQxLUFFRDEtNEYyRC1CMEQ3LTJENkRCMDJDQzFDREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGs1N3NtMys1NzdoQGVHcm91cHMuY29tPg==","referencesHeader":"PGs1N3NtMys1NzdoQGVHcm91cHMuY29tPg=="},"prevInTopic":69356,"nextInTopic":69358,"prevInTime":69356,"nextInTime":69358,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"-=- Another article I read for beginners said to be more available to my children and read in my downtime. How/when do I have downtime if I am being available","messageBody":"<div id=\"ygrps-yiv-1248607056\">-=- Another article I read for beginners said to be more available to my children and read in my downtime. How/when do I have downtime if I am being available more?-=-<br/>\n<br/>\nRead a little.<br/>\nTry a little.<br/>\nWait a while.<br/>\nWatch.<br/>\n<br/>\nWhat possible answer could you hope we would give about time?  Your option is to do better with your children, or not to.<br/>\n<br/>\nIf you decide how you want your home to be, and then make choices that get you nearer to that, things will get gradually better.<br/>\nIf you don&#39;t decide, or if you don&#39;t think of it many times a day when you make small choices, and decide how to act and react, then things won&#39;t get better.<br/>\n<br/>\nNot every step will be forward, but if most of them are, then you&#39;ll make progress.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradod.com/gradualchange\">http://sandradod.com/gradualchange</a> might help.<br/>\nThen read this one for balance. :-)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/doit\">http://sandradodd.com/doit</a><br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":187853867,"authorName":"Andrea Q","from":"&quot;Andrea Q&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Re: Introductions and questions","postDate":"1350006275","msgId":69356,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1N3NtMys1NzdoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPg=="},"prevInTopic":69355,"nextInTopic":69357,"prevInTime":69355,"nextInTime":69357,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"... There will likely be a big adjustment at first where you might not get much time to yourself. After a while, at least in my experience, it evens out. As my","messageBody":"<div id=\"ygrps-yiv-479214992\"><blockquote><span title=\"ireply\">&gt; 2. Another article I read for beginners said to be more available to my children and read in my downtime. How/when do I have downtime if I am being available more?<br/>\n<br/>\n </span></blockquote>---<br/>\n<br/>\nThere will likely be a big adjustment at first where you might not get much time to yourself. After a while, at least in my experience, it evens out. As my kids get involved in different projects/interests, I end up with spurts of time to work on my own things. They know that I will stop what I&#39;m doing to help them. Some days, it get very little time and others it seems like they only need me for food!</div>","specialLinks":[]},{"userId":323846007,"authorName":"graceon2012","from":"&quot;graceon2012&quot; &lt;g.onasanya@...&gt;","profile":"graceon2012","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Introductions and questions","postDate":"1349996305","msgId":69355,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGs1N2l1aCtucDUyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":69356,"prevInTime":69354,"nextInTime":69356,"topicId":69355,"numMessagesInTopic":0,"msgSnippet":"Hello all, Another person new to unschooling.  Have home-educated for almost 8 years, my oldest, almost 15 and 2 younger who have never been to school. I have","messageBody":"<div id=\"ygrps-yiv-805195931\">Hello all,<br/>\n<br/>\nAnother person new to unschooling.  Have home-educated for almost 8 years, my oldest, almost 15 and 2 younger who have never been to school. <br/>\nI have been eagerly reading SandraDodd.com and links from there and only wish I discovered all this sooner.  Thank you for all the information and time you all put into helping newbies like me discover and learn about &#39;living joyfully&#39; .<br/>\n<br/>\nI have a few questions<br/>\n1. On one of the sites, I read about not just dropping all rules, but saying yes more, I am doing that.  My question is how to let my children know that things are going to be be different. Any suggestions on what to say so they know they no longer &#39;have to try&#39; to read the books we had scheduled but only those they really want to read for instance.<br/>\n2. Another article I read for beginners said to be more available to my children and read in my downtime. How/when do I have downtime if I am being available more?<br/>\n3. I am so new to this, I do not know how to explain it but I need to find a succinct way to help my husband understand without him needing to read all that I am reading. Any suggestions would be welcome. <br/>\n<br/>\nThank you once again for any ideas or suggestions<br/>\nGrace<br/>\n<br/>\nPS. I met some of you last night on the chat.  Thanks for all the links which I am still reading through.</div>","specialLinks":[]}],"prevTopicId":69330,"nextTopicId":69386}}