{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":13,"messages":[{"userId":147283564,"authorName":"Jill Parmer","from":"Jill Parmer &lt;jparmer@...&gt;","profile":"jparm02","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] consultation for money","postDate":"1229447688","msgId":41083,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdBOEY1QjkzLTJGMkQtNEQ4Ny04Q0E4LTU5MjEyMDFCNzYwNUBmcmlpLmNvbT4=","inReplyToHeader":"PDdDRjYyNTU3LTM4NTgtNDY1OS04RkE2LUVDMDVCOERBMkY1OUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDdDRjYyNTU3LTM4NTgtNDY1OS04RkE2LUVDMDVCOERBMkY1OUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":41079,"nextInTopic":0,"prevInTime":41082,"nextInTime":41084,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"My thoughts around this are scattered; I see all of Sandra s points about coaching, and experts at something.  But there s something that doesn t sit right","messageBody":"<div id=\"ygrps-yiv-1042117522\">My thoughts around this are scattered; I see all of Sandra&#39;s points  <br/>\nabout coaching, and experts at something.  But there&#39;s something that  <br/>\ndoesn&#39;t sit right with me about this.<br/>\n<br/>\n  When I&#39;m at a stuck and want some ideas right away, I search at  <br/>\nSandradodd.com, joyfullyrejoycing, or this list, and I&#39;ve always come  <br/>\nup with something to ponder or action to take that I can do right  <br/>\naway. I feel capable and smart and powerful in my life when I wrestle  <br/>\nwith problems and come to solutions.  I think I would feel like I&#39;m  <br/>\ngiving away my power and abilities if I paid someone to come up with  <br/>\nthe answers for me, and the same for someone paving the path for me.   <br/>\nI do have friends that will problem solve with me, and we toss around  <br/>\nlots of ideas, so I&#39;m<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Dec 14, 2008, at 7:55 PM, Sandra Dodd wrote:<br/>\n<br/>\n&gt; There are two people flat out saying unschooling expert, who had kids<br/>\n&gt; who went to school. But it&#39;s entirely possible to be an expert on<br/>\n&gt; something without doing it. It&#39;s possible to be an expert on the<br/>\n&gt; history of Judaism without being Jewish, and there are experts on the<br/>\n&gt; geology of the Rocky Mountains who might not even live on the same<br/>\n&gt; continent, let alone in the shadow of the Rockies.<br/>\n<br/>\nTrue.  Although, when I want information from someone, I feel like  <br/>\nI&#39;m getting the real deal from, or give more credence to people that  <br/>\naren&#39;t only book experts but have first hand experience and longevity  <br/>\nand successes that show what they&#39;ve been discussing and saying for  <br/>\nyears.<br/>\n<br/>\nSo far there&#39;s nothing I need from the people I&#39;ve seen charging for  <br/>\nunschooling information. I have a little resentment that there are  <br/>\npeople who&#39;ve written seemingly tirelessly about unschooling for  <br/>\nyears for free, and then some people come along and start charging  <br/>\nfor it.<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Life coaching in general is a growing field, it seems. A coach<br/>\n&gt; doesn&#39;t need to be a gold medalist, and a star athlete might not be a<br/>\n&gt; good teacher/leader/inspiration. Someone can be involved for life in<br/>\n&gt; something and never be the least bit analytical or communicative<br/>\n&gt; about what they&#39;re doing.<br/>\n<br/>\nI&#39;ve not ever been trusting of the idea of life coaches.  I think  <br/>\nlife is for living and playing and trying things out and falling on  <br/>\nmy face and getting up and going again.  I don&#39;t think people need to  <br/>\npay a coach for their own life.  I think it takes away from building  <br/>\nconfidence.<br/>\n<br/>\nThe two people that I&#39;ve known that&#39;ve become coaches are in need of  <br/>\nlots of therapy or coaching themselves.  And I find it rather ironic  <br/>\nthat they get paid for coaching others.<br/>\n<br/>\n<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Structured homeschoolers can make money by creating educational<br/>\n&gt; materials and tests and charts and workbooks.<br/>\n&gt;<br/>\n&gt; I have many scattery thoughts on the whole thing and I welcome chit<br/>\n&gt; chat about it<br/>\n<br/>\nI think some things should be passed on freely quilting, knitting,  <br/>\nand for some reason unschooling information sits in that place in my  <br/>\nbrain.<br/>\n<br/>\nI have a friend that wants hand holding for near everything she  <br/>\ndoes.  She calls friends for every barely important decision she  <br/>\nmakes.  And she pays lots of money for psychotherapy for herself and  <br/>\nkids, for things like, should I get my kid a cell phone.  She&#39;ll  <br/>\nfight with her husband about raking leaves in the fall and spend time  <br/>\nand money at the therapist arguing about that, spending more than she  <br/>\nwould by hiring someone to come clean the yard.<br/>\n<br/>\nOn one pay for unschooling information site there are links to other  <br/>\ncoaches.  I know one of those people personally.  She&#39;s asked me for  <br/>\nadvice on more than several occasions.  What I gave to the  <br/>\nconversation was stuff that I learned on the freely available  <br/>\nunschooling lists.<br/>\n<br/>\nThere&#39;s something about paying money for what I believe should be  <br/>\ndiscussions, and a grappling with ideas to find your way, that I  <br/>\ncan&#39;t put my finger on.  (I&#39;ve written this response without reading  <br/>\nthe others, so maybe I&#39;ll find what that is when I go back and read  <br/>\nthe responses.)<br/>\n<br/>\n~Jill (Addi 14, Luke 10; been reading about and working toward  <br/>\napplying unschooling ideas since April 2002)<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: consultation for money","postDate":"1229394880","msgId":41079,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMjE1MTgzNHE0ODc3OGYxMWw1ODVmZmFiYThlYjUyMzEwQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDNhOTNmZmYxMDgxMjE1MTcwNXIxNjA1M2IyOXBkMDM0YTVkNGZlMjQ0YzE1QG1haWwuZ21haWwuY29tPg==","referencesHeader":"PGdpNjdubytkb2ZpQGVHcm91cHMuY29tPgkgPDgyM0ZBMUFCLTc3QkQtNDA3OS05MzE3LTIzOEVDOEJGMjJCNUBtYWMuY29tPgkgPDNhOTNmZmYxMDgxMjE1MTcwNXIxNjA1M2IyOXBkMDM0YTVkNGZlMjQ0YzE1QG1haWwuZ21haWwuY29tPg=="},"prevInTopic":41078,"nextInTopic":41083,"prevInTime":41078,"nextInTime":41080,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"Something I want to pull out about advice to be careful about (especially if you re being paid).  If I were to give advice based on facts and personal ","messageBody":"<div id=\"ygrps-yiv-1078380047\">Something I want to pull out about advice to be careful about (especially if<br/>\nyou&#39;re being paid).  If I were to give advice based on facts and personal<br/>\nexperience, and not be quite sure if what I&#39;m saying is true, I would feel<br/>\nresponsible (even if I weren&#39;t being paid) were my factoids to mess somebody<br/>\nup even if I didn&#39;t mean it to be relied on quite so heavily.  I think<br/>\nthat&#39;s where litigation would definitely be problematic: when facts aren&#39;t<br/>\nfor sure, and people are for real about what&#39;s being said to such an extent.<br/>\n<br/>\nOpinions are a whole different ball game though.<br/>\n<br/>\nMuch that has to do with advice has to do with questions about the<br/>\ndifference between fact and opinion.<br/>\n<br/>\nAnother thing about charging money not being the same as advice or<br/>\ncounseling---  Often people are not aware their words could be construed as<br/>\nadvice when in their own minds it seems they&#39;re simply sharing their<br/>\nexperiences with others, much the way some might feel that writing a book is<br/>\na way to talk about experiences.  Communicating (for pay or not) can often<br/>\nfeel that way to the one who is talking about their own experiences.<br/>\nWhether it could be viewed as fact or personal perspective may not even be<br/>\nconsidered really.<br/>\n<br/>\nA big reason some people *never* write anything ... for fear it will become<br/>\nsemi-permanent and later be shown as not quite right.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: consultation for money","postDate":"1229389514","msgId":41078,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMjE1MTcwNXIxNjA1M2IyOXBkMDM0YTVkNGZlMjQ0YzE1QG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDgyM0ZBMUFCLTc3QkQtNDA3OS05MzE3LTIzOEVDOEJGMjJCNUBtYWMuY29tPg==","referencesHeader":"PGdpNjdubytkb2ZpQGVHcm91cHMuY29tPgkgPDgyM0ZBMUFCLTc3QkQtNDA3OS05MzE3LTIzOEVDOEJGMjJCNUBtYWMuY29tPg=="},"prevInTopic":41077,"nextInTopic":41079,"prevInTime":41077,"nextInTime":41079,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"... their parents might sue me if their kid still fails their math class. I know what I m offering is worth the money. So I am not sure why I have so much more","messageBody":"<div id=\"ygrps-yiv-1011068366\"><blockquote><span title=\"ireply\">&gt;&gt;&gt;&gt;But, on the other hand, I tutor kids in math and I don&#39;t worry that<br/>\n </span></blockquote>their parents might sue me if their kid still fails their math class.<br/>\nI know what I&#39;m offering is worth the money. So I am not sure why I<br/>\nhave so much more hesitancy about &quot;life coaching&quot; or consulting about<br/>\nunschooling.&lt;&lt;&lt;&lt;<br/>\n<br/>\nFailing math and failing life are two very different things.<br/>\n<br/>\nI personally don&#39;t think responsibility should necessarily be there unless<br/>\nthe person giving advice were asking for some kind of allegiance or<br/>\ndemanding a following from those asking for help.<br/>\n<br/>\nCharging money is not the same thing as counseling.  Some people make take<br/>\nit that way though.  Advice seekers may feel that they can wholehearted rely<br/>\non advice givers without taking into much consideration the importance of<br/>\nthe choices involved in following advice.<br/>\n<br/>\nI&#39;m uncomfortable with the concept of advice in the first place, personally.<br/>\n<br/>\n<br/>\nMuch of that is due to my inability to see expertise as limited to a few in<br/>\nthe profession.  There are doctors, counselors, nurses, lawyers among others<br/>\nwhose expertise I would never rely on in a million years because I disagree<br/>\nstrongly with their expert views.  There are people in the same professions<br/>\nwho opinion I respect though, and my choice to trust their expert opinion is<br/>\nbased on the choices I&#39;ve made about the principles they (seem to) follow<br/>\nthat I agree with.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: consultation for money","postDate":"1229385772","msgId":41077,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdBOUMyQTBDLUEyN0MtNDkzQy1CRTVGLTg0MzJCQUE2QUNDNkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDQwNDk2Ni42Nzg1MS5xbUB3ZWI1MTQwMS5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDQwNDk2Ni42Nzg1MS5xbUB3ZWI1MTQwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":41076,"nextInTopic":41078,"prevInTime":41076,"nextInTime":41078,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"-=-But it seems that some people are not good at reading to learn new information--they d rather talk with someone about it. Or that they have trouble putting","messageBody":"<div id=\"ygrps-yiv-1408596879\">-=-But it seems that some people are not good at reading to learn new  <br/>\ninformation--they&#39;d rather talk with someone about it. Or that they  <br/>\nhave trouble putting a snippet from a book together with something  <br/>\nthey read on a message board and seeing that the two things together  <br/>\nwould address a particular issue. Or they&#39;re missing the forest for  <br/>\nthe trees in their particular situation, and benefit from the fresh  <br/>\nview of an outsider.-=-<br/>\n<br/>\nI think this is true.  The people who deal well with this list are  <br/>\nprobably those who are big on logic and verbal intelligence (one or  <br/>\nboth of those) and who appeciate the subtle tweaking of ideas.  But  <br/>\nlots of people don&#39;t care about those two kinds of thought, or  <br/>\nthey&#39;re just not their favorites.<br/>\n<br/>\n-=-But then I come back to the fact that the information I have to  <br/>\nshare is not MINE, and I know I would feel guilty and dishonest for  <br/>\ncharging money for it!-=-<br/>\n<br/>\nI occasionally go to a cognitive therapist I just love and she&#39;s  <br/>\nsuper helpful to me and I don&#39;t have to start from scratch because  <br/>\nthe first time I went to talk to her Kirby was just nearly a year  <br/>\nold, so she had notes on me and knows my longterm situation even  <br/>\nthough she doesn&#39;t expect or want me to go to counseling &quot;long  <br/>\nterm.&quot;  The ideas she uses are not hers, but they&#39;ve become hers  <br/>\nthrough her experience.  She has learned from other ideas and then  <br/>\ncreated her own tools from that.<br/>\n<br/>\nThere&#39;s very little I know that someone else didn&#39;t know before.   <br/>\nSometimes I discovered it separately and sometimes I took an idea and  <br/>\ntried it out in my real life and saw a new way to describe it.  But  <br/>\nwhat I have that some other people don&#39;t have is years of experience  <br/>\nwith my kids and other people&#39;s families and kids, and I&#39;ve seen what  <br/>\ncan go wrong, and what can go wonderfully well.<br/>\n<br/>\nI appreciate this discussion.  Thanks for the ideas, and I hope it  <br/>\nwill continue.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":6160802,"authorName":"M Walker","from":"M Walker &lt;RansomeNote@...&gt;","profile":"ransomenote","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: consultation for money","postDate":"1229384163","msgId":41076,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDQwNDk2Ni42Nzg1MS5xbUB3ZWI1MTQwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":41075,"nextInTopic":41077,"prevInTime":41075,"nextInTime":41077,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"This is an interesting topic. Here in my little corner of New Jersey, people often tell me that I should start a business and charge money for the advice and","messageBody":"<div id=\"ygrps-yiv-1498823273\">This is an interesting topic. Here in my little corner of New Jersey, people often tell me that I should start a business and charge money for the advice and information and help I give to other homeschoolers. And I sputter back, &quot;But I&#39;m just quoting Sandra or Pam or Joyce or the message boards or the dozens of books I&#39;ve read!&quot;<br/>\n<br/>\nApparently, what I&#39;m quite good at is combing through the information I&#39;ve gleaned over the years and organizing it in a way that helps that particular person at that particular time. Honestly, I give all the credit to others! I insist that the ideas I&#39;m suggesting are NOT my original thoughts. I cite that famous quote about standing on the shoulders of giants.<br/>\n<br/>\nBut it seems that some people are not good at reading to learn new information--they&#39;d rather talk with someone about it. Or that they have trouble putting a snippet from a book together with something they read on a message board and seeing that the two things together would address a particular issue. Or they&#39;re missing the forest for the trees in their particular situation, and benefit from the fresh view of an outsider.<br/>\n<br/>\nMy husband points out to me that doctors have read books and taken classes and followed mentors around hospitals. And then they charge money for helping sick people. So, how is what I do, quite informally, any different?<br/>\n<br/>\nAt times, I have handed someone a list of my favorite books, or even just one book title that I think addresses her concerns. And her face falls and she looks sadly at me, and asks if I can&#39;t just help her. She doesn&#39;t want to read a book at that point--or maybe ever at any point!<br/>\n<br/>\nSo, it does seem to me that there are people who want and would pay for the knowledge that a consultant would have to share. But then I come back to the fact that the information I have to share is not MINE, and I know I would feel guilty and dishonest for charging money for it!<br/>\n<br/>\n- Meg</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: consultation for money","postDate":"1229378890","msgId":41075,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDgyM0ZBMUFCLTc3QkQtNDA3OS05MzE3LTIzOEVDOEJGMjJCNUBtYWMuY29tPg==","inReplyToHeader":"PGdpNjdubytkb2ZpQGVHcm91cHMuY29tPg==","referencesHeader":"PGdpNjdubytkb2ZpQGVHcm91cHMuY29tPg=="},"prevInTopic":41074,"nextInTopic":41076,"prevInTime":41074,"nextInTime":41076,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"... I think this seems reasonable. I have a few long-time friends who call on me for what I d call consulations - they re calling with specific issues and","messageBody":"<div id=\"ygrps-yiv-1439270886\">On Dec 15, 2008, at 10:30 AM, Bea wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Also, one big issue with me is that I am afraid of<br/>\n&gt; &quot;bothering&quot; people, so paying for a consultation works for me because<br/>\n&gt; I don&#39;t feel like I&#39;m imposing on the other person for listening to my<br/>\n&gt; problems.<br/>\n<br/>\n </span></blockquote>I think this seems reasonable. I have a few long-time friends who call  <br/>\non me for what I&#39;d call &quot;consulations&quot; - they&#39;re calling with specific  <br/>\nissues and want my input and want to bounce ideas around and have  <br/>\ntheir own thinking challenged and  they don&#39;t have a lot of support  <br/>\nfor doing things the radical unschooling way and they want a dose of  <br/>\nthat kind of support.<br/>\n<br/>\nI do have concerns for people who are charging money for this kind of  <br/>\nthing. I understand it and have the urge to do it because there are  <br/>\npeople I could help a lot more if I could talk to them individually  <br/>\nfor a while.  I think it is one thing to freely, mom-to-mom, offer  <br/>\nideas or information or different ways to look at a problem in a &quot;take- <br/>\nit-or-leave-it&quot; forum. But isn&#39;t it taking on a certain amount of  <br/>\nresponsibility and even liability to charge money for giving parenting  <br/>\nadvice? Psychiatrists and licensed counselors and others have  <br/>\ninsurance for this reason, don&#39;t they? We&#39;re giving very  <br/>\nunconventional advice - what if their kid turns out to be a serial  <br/>\nkiller or something? If they sue me, I think a judge might conclude I  <br/>\nwas a quack who was giving very risky advice.<br/>\n<br/>\nBut, on the other hand, I tutor kids in math and I don&#39;t worry that  <br/>\ntheir parents might sue me if their kid still fails their math class.  <br/>\nI know what I&#39;m offering is worth the money. So I am not sure why I  <br/>\nhave so much more hesitancy about &quot;life coaching&quot; or consulting about  <br/>\nunschooling.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: consultation for money","postDate":"1229375149","msgId":41074,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcxODI2MTZGLUY0Q0QtNDJBRC05ODRELURERURCOUY3Qjc1NUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGdpNjdubytkb2ZpQGVHcm91cHMuY29tPg==","referencesHeader":"PGdpNjdubytkb2ZpQGVHcm91cHMuY29tPg=="},"prevInTopic":41067,"nextInTopic":41075,"prevInTime":41073,"nextInTime":41075,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"--=-For me, it s important to talk (I also get a lot from reading and occasionally posting on this list and others, but sometimes I need to be listened to and","messageBody":"<div id=\"ygrps-yiv-1003310629\">--=-For me, it&#39;s important to talk (I also get a lot from reading and<br/>\noccasionally posting on this list and others, but sometimes I need to<br/>\nbe listened to and be given empathy, and get constructive but gentle<br/>\nsupport.) Also, one big issue with me is that I am afraid of<br/>\n&quot;bothering&quot; people, so paying for a consultation works for me because<br/>\nI don&#39;t feel like I&#39;m imposing on the other person for listening to my<br/>\nproblems.<br/>\n<br/>\n-=-As for getting advice from not completely radical unschoolers, I feel<br/>\nthat I&#39;m smart enough and discriminating enough (and I&#39;m confident<br/>\nenough of my path) that I can take the advice I want, and leave the<br/>\nrest.-=-<br/>\n<br/>\nThat helps me see it better, thanks.  (Sorry I sent a blank before; I  <br/>\ndeleted it from the archive.)<br/>\n<br/>\nThere are counsellors who are VERY helpful to some people and not so  <br/>\nmuch to others.  That can&#39;t be helped.  There are piano teachers and  <br/>\nguitar teachers, same way.  Some people like or understand one kind  <br/>\nof help and some others don&#39;t.<br/>\n<br/>\nI don&#39;t suppose many people will think someone who charges $50 for a  <br/>\nhalf hour knows twice as much as someone who charges $25, or  <br/>\ninfinitely more than someone who&#39;s not charging anything.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":130027733,"authorName":"Bea","from":"&quot;Bea&quot; &lt;bmantovani@...&gt;","profile":"bmantovani","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: consultation for money","postDate":"1229365816","msgId":41067,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdpNjdubytkb2ZpQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdDRjYyNTU3LTM4NTgtNDY1OS04RkE2LUVDMDVCOERBMkY1OUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":41052,"nextInTopic":41074,"prevInTime":41066,"nextInTime":41068,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"... I have a slightly different opinion than the people who have posted so far, so I ll share my thoughts. I have paid for consultations for money.  From a","messageBody":"<div id=\"ygrps-yiv-1589399070\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Sandra Dodd &lt;Sandra@...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Life coaching in general is a growing field, it seems.  A coach  <br/>\n&gt; doesn&#39;t need to be a gold medalist, and a star athlete might not be a  <br/>\n&gt; good teacher/leader/inspiration.  Someone can be involved for life in  <br/>\n&gt; something and never be the least bit analytical or communicative  <br/>\n&gt; about what they&#39;re doing.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I have a slightly different opinion than the people who have posted so<br/>\nfar, so I&#39;ll share my thoughts.<br/>\n<br/>\nI have paid for consultations for money.  From a person who is a full<br/>\non radical unschooler (as far as I can tell) but whose kids are still<br/>\nyoung-ish, and from another who is an unschooler and whose kids are<br/>\nalso still young-ish, but who is not full on &quot;radical&quot;.  I got a lot<br/>\nfrom both.<br/>\n<br/>\nFor me, it&#39;s important to talk  (I also get a lot from reading and<br/>\noccasionally posting on this list and others, but sometimes I need to<br/>\nbe listened to and be given empathy, and get constructive but gentle<br/>\nsupport.)   Also, one big issue with me is that I am afraid of<br/>\n&quot;bothering&quot; people, so paying for a consultation works for me because<br/>\nI don&#39;t feel like I&#39;m imposing on the other person for listening to my<br/>\nproblems.<br/>\n<br/>\nAs for getting advice from not completely radical unschoolers, I feel<br/>\nthat I&#39;m smart enough and discriminating enough (and I&#39;m confident<br/>\nenough of my path) that I can take the advice I want, and leave the<br/>\nrest.  <br/>\n<br/>\nBea</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] consultation for money","postDate":"1229320397","msgId":41052,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMDgxMjE0MjE1M3A0ZWVlZTI2YngxZjQ1NmEwNDI3MDY1YmQyQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PDdDRjYyNTU3LTM4NTgtNDY1OS04RkE2LUVDMDVCOERBMkY1OUBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDdDRjYyNTU3LTM4NTgtNDY1OS04RkE2LUVDMDVCOERBMkY1OUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":41051,"nextInTopic":41067,"prevInTime":41051,"nextInTime":41053,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"Ok.  Here s my opinion.  And I ll use non-unschooling examples. Other than reading books, the most plentiful sources of information come from enthusiastic","messageBody":"<div id=\"ygrps-yiv-626622885\">Ok.  Here&#39;s my opinion.  And I&#39;ll use non-unschooling examples.<br/>\n<br/>\nOther than reading books, the most plentiful sources of information come<br/>\nfrom enthusiastic volunteers.  I just love a geek or a nerd, and to refer to<br/>\na person with those words is to compliment someone, in my view.  If I had<br/>\nthe mind that hangs onto details, rather than be the global glosser of<br/>\ndetails, I&#39;d probably be one.<br/>\n<br/>\nIf I want to know why one Mac is better for my purposes than another, a geek<br/>\nwho really loves the chance to talk about such things is better than wading<br/>\nthrough a book written or edited by even a whole group of experts.  If I<br/>\nknow more than one such computer enthusiast, all the better.<br/>\n<br/>\nKinda like unschooling forums.  How many unschoolers does it take to get<br/>\nspecific ideas pertinent to specific situations?  I say the more the<br/>\nmerrier.  I&#39;d probably never have the money for all that expertise and<br/>\nvariety of experience.<br/>\n<br/>\nThat doesn&#39;t mean I&#39;d never pay for advice though.  I&#39;ve bought books and<br/>\nother unschooling materials.  I&#39;ve gone to unschooling events and given<br/>\nmoney and bought things.  I can think of some people whose time is very<br/>\nscarce that I&#39;d pay if I felt I needed to.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 12/14/08, Sandra Dodd wrote:<br/>\n&gt;<br/>\n&gt; -=-...and offers<br/>\n&gt; consultation for money. (thanks Sandra, for always putting out the<br/>\n&gt; free stuff, your awesome website and your tireless effort to help<br/>\n&gt; people be informed!)-=-<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; Thanks for helping, Jenny!  And thanks to all of those who keep this<br/>\n&gt; list rich and interesting.<br/>\n&gt;<br/>\n&gt; There are several people offering consultation or coaching for<br/>\n&gt; money.  Some, it seems like a fine idea.  Others, not so much.  Some<br/>\n&gt; people really do want individualized time and attention, though.<br/>\n&gt; They want streamlined information and maybe they want strokes.<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I promised a few weeks ago that I would bring this topic up on the<br/>\n&gt; list, and just got busy and forgot.  Please don&#39;t name names, but<br/>\n&gt; let&#39;s talk about this a little bit, please.<br/>\n&gt;<br/>\n&gt; There are two people flat out saying unschooling expert, who had kids<br/>\n&gt; who went to school.  But it&#39;s entirely possible to be an expert on<br/>\n&gt; something without doing it.  It&#39;s possible to be an expert on the<br/>\n&gt; history of Judaism without being Jewish, and there are experts on the<br/>\n&gt; geology of the Rocky Mountains who might not even live on the same<br/>\n&gt; continent, let alone in the shadow of the Rockies.<br/>\n&gt;<br/>\n&gt; Life coaching in general is a growing field, it seems.  A coach<br/>\n&gt; doesn&#39;t need to be a gold medalist, and a star athlete might not be a<br/>\n&gt; good teacher/leader/inspiration.  Someone can be involved for life in<br/>\n&gt; something and never be the least bit analytical or communicative<br/>\n&gt; about what they&#39;re doing.<br/>\n&gt;<br/>\n&gt; Structured homeschoolers can make money by creating educational<br/>\n&gt; materials and tests and charts and workbooks.<br/>\n&gt;<br/>\n&gt; I have many scattery thoughts on the whole thing and I welcome chit<br/>\n&gt; chat about it, but again, try not to name names or reveal anyone<br/>\n&gt; particular.<br/>\n&gt;<br/>\n&gt; Thanks,<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":77070457,"authorName":"Sanguinegirl83@aol.com","from":"Sanguinegirl83@...","profile":"sanguinegirl83","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] consultation for money","postDate":"1229318175","msgId":41051,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM0OS4yNDhkN2JmZS4zNjc3NDIxZkBhb2wuY29tPg=="},"prevInTopic":41050,"nextInTopic":41052,"prevInTime":41050,"nextInTime":41052,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"Still, after all these years of learning, my first thought is  always kind of a grass is greener kind of thing: someone who s an expert is  charging for","messageBody":"<div id=\"ygrps-yiv-2015747225\">Still, after all these years of learning, my first thought is  always kind of <br/>\na &quot;grass is greener&quot; kind of thing: someone who&#39;s an &quot;expert&quot; is  charging <br/>\nfor something-that must mean I get a better product, a better end  result, <br/>\n*more* than what I&#39;d get for less (or free). And then I think for a bit.  :~) It <br/>\nseems the older I get, the more I learn, the more I &quot;wear in&quot;  unschooling-like <br/>\nyou wear in a new pair of jeans until they&#39;re formed to you,  comfy and soft-, <br/>\nthe quicker I am to see this as either flawed thinking or maybe  old tapes <br/>\nrunning in my head. The more you pay for it, the better the quality. I  think <br/>\nthat anymore, that&#39;s more of a coincidence. Not necessarily true most of  the <br/>\ntime-not even a lot of the time. I think and wonder, but I am not willing  (or <br/>\nable, at the moment) to pay to find out if I do get &quot;more&quot; information or  more <br/>\npersonalized information than I do for free on the few unschooling groups I  <br/>\nam on. Why should I? The free, heartfelt, honest ideas I have gotten at these  <br/>\nplaces have helped bring us to where we are today. I don&#39;t think 100x more  <br/>\ninformation could have gotten us here faster or better. I still keep a couple <br/>\nof  those contacts information tucked away for &quot;just in case&quot;, but I don&#39;t ever <br/>\nsee  me actually using them. I, too, would rather contact unschoolers I know <br/>\n(but who  shall remain unnamed in this discussion :~D ) to hash out specifics <br/>\nor who know  me and my family better than any paid consultant could, to get <br/>\nhelp when I need  it.<br/>\n <br/>\nI know far too many unschoolers who are willing-even  thrilled-to pass along <br/>\ninformation for free. Good experiences, wonderful ideas,  thoughtful advice... <br/>\nIn this case, I think the freely given is the better  quality, really. Gee, I <br/>\nthink I&#39;m ready to toss out that contact information for  &quot;pay consultation&quot; <br/>\nright *now*.<br/>\n<br/>\nPeace,<br/>\nDe<br/>\n**************Make your life easier with all your friends, email, and <br/>\nfavorite sites in one place.  Try it now. <br/>\n(<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.aol.com/?optin=new-dp&icid=aolcom40vanity&ncid=emlcntaolcom00000010)\">http://www.aol.com/?optin=new-dp&icid=aolcom40vanity&ncid=emlcntaolcom00000010)</a><br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: consultation for money","postDate":"1229317150","msgId":41050,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGdpNG82dSs1dGU0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDdDRjYyNTU3LTM4NTgtNDY1OS04RkE2LUVDMDVCOERBMkY1OUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":41049,"nextInTopic":41051,"prevInTime":41049,"nextInTime":41051,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"... Ok, well here s one of my scattered thoughts about it... When I was an undergrad working towards an art degree, I took a ton of art classes.  Art is very","messageBody":"<div id=\"ygrps-yiv-659846767\"><blockquote><span title=\"ireply\">&gt; There are several people offering consultation or coaching for<br/>\n&gt; money.<br/>\n<br/>\n&gt; I have many scattery thoughts on the whole thing and I welcome chit<br/>\n&gt; chat about it, but again, try not to name names or reveal anyone<br/>\n&gt; particular.<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Ok, well here&#39;s one of my scattered thoughts about it...<br/>\n<br/>\nWhen I was an undergrad working towards an art degree, I took a ton of<br/>\nart classes.  Art is very subjective, yet in school it needed to be<br/>\ngraded.  So, part of the grading process was the critiquing process. <br/>\nUltimately this is what caused me to change degrees.  The idea that I<br/>\nneeded to take advice from people I didn&#39;t know, or respect.<br/>\n<br/>\nThe whole coaching thing is a bit like that for me.  Why would I want to<br/>\ntake advice from people I don&#39;t know, or know little to nothing about,<br/>\nexcept what they&#39;ve chosen to show me?  Sure, if I know someone and<br/>\nreally respect what they have to say, I&#39;ll probably listen and take to<br/>\nheart what the person is saying.<br/>\n<br/>\nMuch of the discussions about unschooling is anecdotal, yet it&#39;s real<br/>\nand I feel like a know people that write on forums that I write on, and<br/>\nsome of them I DO know.<br/>\n<br/>\nI like the idea of paying forward happy things and ideas.  If someone is<br/>\ncharging money, they aren&#39;t paying forward, they&#39;re taking, even if they<br/>\nhave wonderful ideas that are worthy of monetary compensation.  If<br/>\nsomeone wants to share their ideas for money, why not write a book?<br/>\n<br/>\n...and...<br/>\n<br/>\nsome other muddled thoughts...<br/>\n<br/>\nguidance counselors are a bit like life coaches, and they&#39;re on a<br/>\npayroll.  Is this where the idea comes from?  Or is it more along the<br/>\nlines of non-religious advice?  If you are a church goer and pay your<br/>\ntithes, in some way you are paying for advice on how to live your life. <br/>\nSo, if you&#39;re not a religious person, you could hire a life coach for<br/>\nmuch less than the cost of tithing (which is supposed to be about 10% of<br/>\nyour income).<br/>\n<br/>\nOkay, that&#39;s all my thoughts for now because all the rest are really<br/>\nunclear.</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] consultation for money","postDate":"1229315647","msgId":41049,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg3MTUwNS40MDM2MC5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":41048,"nextInTopic":41050,"prevInTime":41048,"nextInTime":41050,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"I just wanted to point out that I called my friends Schuyler and Kelly as a friend- no maney involved. I called them because I needed a kick in the butt","messageBody":"<div id=\"ygrps-yiv-393027944\">I just wanted to point out that I called my friends Schuyler and Kelly as a friend- no maney involved.&lt;BWG&gt;<br/>\nI called them because I needed a kick in the butt or an honest opinion.<br/>\nI can sure count on them  for their honesty. My other source of &quot;counseling&quot; is lurking here and there and reading Sandra and Joyce.<br/>\nIt was because of these women and others on the unschooling lists that have inspired me and that I am so thankful that I can read what they have to say.<br/>\nJust readind Sandra&#39;s site is life changing in so many ways.<br/>\nThank you for all the time you freely put into it.<br/>\n<br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n <br/>\n<br/>\n <br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"consultation for money","postDate":"1229309726","msgId":41048,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdDRjYyNTU3LTM4NTgtNDY1OS04RkE2LUVDMDVCOERBMkY1OUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":41049,"prevInTime":41047,"nextInTime":41049,"topicId":41048,"numMessagesInTopic":0,"msgSnippet":"-=-...and offers consultation for money. (thanks Sandra, for always putting out the free stuff, your awesome website and your tireless effort to help people be","messageBody":"<div id=\"ygrps-yiv-1887144099\">-=-...and offers<br/>\nconsultation for money. (thanks Sandra, for always putting out the<br/>\nfree stuff, your awesome website and your tireless effort to help<br/>\npeople be informed!)-=-<br/>\n<br/>\n<br/>\n<br/>\nThanks for helping, Jenny!  And thanks to all of those who keep this  <br/>\nlist rich and interesting.<br/>\n<br/>\nThere are several people offering consultation or coaching for  <br/>\nmoney.  Some, it seems like a fine idea.  Others, not so much.  Some  <br/>\npeople really do want individualized time and attention, though.   <br/>\nThey want streamlined information and maybe they want strokes.<br/>\n<br/>\n<br/>\n<br/>\nI promised a few weeks ago that I would bring this topic up on the  <br/>\nlist, and just got busy and forgot.  Please don&#39;t name names, but  <br/>\nlet&#39;s talk about this a little bit, please.<br/>\n<br/>\nThere are two people flat out saying unschooling expert, who had kids  <br/>\nwho went to school.  But it&#39;s entirely possible to be an expert on  <br/>\nsomething without doing it.  It&#39;s possible to be an expert on the  <br/>\nhistory of Judaism without being Jewish, and there are experts on the  <br/>\ngeology of the Rocky Mountains who might not even live on the same  <br/>\ncontinent, let alone in the shadow of the Rockies.<br/>\n<br/>\nLife coaching in general is a growing field, it seems.  A coach  <br/>\ndoesn&#39;t need to be a gold medalist, and a star athlete might not be a  <br/>\ngood teacher/leader/inspiration.  Someone can be involved for life in  <br/>\nsomething and never be the least bit analytical or communicative  <br/>\nabout what they&#39;re doing.<br/>\n<br/>\nStructured homeschoolers can make money by creating educational  <br/>\nmaterials and tests and charts and workbooks.<br/>\n<br/>\nI have many scattery thoughts on the whole thing and I welcome chit  <br/>\nchat about it, but again, try not to name names or reveal anyone  <br/>\nparticular.<br/>\n<br/>\nThanks,<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":41057,"nextTopicId":41082}}