{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Deadlines (very long)","postDate":"1051115074","msgId":65625,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0ZS4xZTNkNjUyYy4yYmQ4MTg0MkBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":65624,"nextInTime":65626,"topicId":65625,"numMessagesInTopic":0,"msgSnippet":"I don t have a solid answer to this but I thought I would chime in on personal experiences. I was public schooled, I attend all low level classes, I disliked","messageBody":"<div id=\"ygrps-yiv-305561916\">I don&#39;t have a solid answer to this but I thought I would chime in on <br/>\npersonal experiences.<br/>\n<br/>\nI was public schooled, I attend all low level classes, I disliked school to <br/>\nthe point of prob. depression. My last year I took all classes I thought I <br/>\nmay have an interest in. Psych, Contract Law, Drafting etc... I graduated a <br/>\nhalf a year early with High Honors. All this from a student that was told I <br/>\nwas LD and stuffed in a resource room for years.. Only because I disliked the <br/>\nbig classes, I couldn&#39;t think let alone learn any thing from all the antics <br/>\nin class.  Did I continue with any of these subjects in adult hood? NO<br/>\nI didn&#39;t go to college, I joined the Marines still lost from school and a <br/>\nmessy childhood of abuse and divorce.<br/>\nWhat&#39;s my point?<br/>\nWell, after the Military and dead end jobs, I had my children, married and <br/>\nstill felt lost.  Because I was never able to lean what interested me I found <br/>\nmy self not completing tasks. Frustrated with all the control others had over <br/>\nme. Work, rules, what was expected being the biggest.<br/>\n<br/>\nAt 28 I quit my job, pulled my son from school and showed him you can do <br/>\nwhatever you set your mind too.  I asked him ok what do you want to do. He <br/>\nsaid open a business.<br/>\nSo we did for 2 1/2 years we where on top of the world. We both learned how <br/>\nto design a web site, market products, become top sellers in high end <br/>\nchildren&#39;s products and have our name and Logo known in many places. He will <br/>\nmost likely in his adult life not work for anyone but himself and for his <br/>\nfamily. <br/>\nWhat is a deadline? <br/>\nWe all have to be places at a certain time and I think for the most part <br/>\nschooled or unschooled we all do it to some extent or another.<br/>\nPersonally school makes one bitter in the hustle and bustle all day long to <br/>\nmove to cattle (term used by our principal in a conversation I had with him) <br/>\nfrom one room to the next. Why do we need to cover every subject every day? <br/>\nPunishment if your late?  In the adult world it just doesn&#39;t work like that <br/>\nall day long.<br/>\n<br/>\nI have a sister with 4 children in public school who all feel stressed, <br/>\nharassed at times and admit they cant remember what they did or learned last <br/>\nmonth. Her son has an IQ score that only a few have.  He landed in the Alt <br/>\nschool because his teacher said he didn&#39;t turn in his papers. None of his <br/>\ntalents are being used at all. <br/>\nHer oldest Daughter loves stage crew and has run it for a couple years now, <br/>\nhas quit because her teacher changed her grade from an A+ to an F because she <br/>\ndisagreed with a situation. (This wasn&#39;t a disrespect situation nor did it <br/>\nhave anything to do with her work performance)<br/>\n <br/>\nThe third child has a voice and a dream that she has wanted to follow for <br/>\nyears and has never been able to go after that. If she was at home she would <br/>\nprob. have her own record by now. <br/>\nMy sister has politely disagreed for years as to my choices and said I should <br/>\ngo get a job. She works for a well known investment company and is successful <br/>\nbut not happy. She is now opening her own business and plans to leave her <br/>\njob.  She calls weekly with issues about her children&#39;s school and is now <br/>\nconsidering pulling them all from school.<br/>\nAs one medicine is not a cure all for everyone neither is school the only <br/>\nchoice..<br/>\n<br/>\nI am new to this group and posted my intro last week but I don&#39;t think <br/>\neveryone received it as I didn&#39;t.<br/>\n<br/>\nLaura<br/>\nMaine<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Not a homeschooler / unschooler.  Just gathering information at this <br/>\n&gt; point.  I have a three-year-old and my second (and last!) child is <br/>\n&gt; due in July.<br/>\n&gt; <br/>\n&gt; I&#39;ve enjoyed the posts so far and can tell that people care deeply <br/>\n&gt; about their kids are are trying to provide the environment that <br/>\n&gt; allows their fullest potentials as humans (not just students / cogs) <br/>\n&gt; to be realized.  My question is, how do unschooled children learn to <br/>\n&gt; work to deadlines?<br/>\n&gt; <br/>\n&gt; In the workplace, performance is measured partly by honoring <br/>\n&gt; commitments in a timely manner.  External pressure (reviews - like <br/>\n&gt; grades, and disciplinary action) can be severe, but as a parent it <br/>\n&gt; seems like it would be hard to enforce deadlines on unschooled <br/>\n&gt; children.  Often the workplace choice is to do the best job possible <br/>\n&gt; in the time available while constantly facing other deadlines; <br/>\n&gt; prioritizing among alternative ways to achieve the greatest overall <br/>\n&gt; output seems to result in workplace success, although there is no <br/>\n&gt; final say on the one best approach (except the boss&#39;s maybe).<br/>\n&gt; <br/>\n&gt; Maybe my conventional education is clouding my judgement here and <br/>\n&gt; employees should work to their own values, standards and interests <br/>\n&gt; alone, although this could conflict with the reward system of the <br/>\n&gt; employer?  As an outsider, it seems like part of the appeal of <br/>\n&gt; homeschooling / unschooling is allowing the children to direct their <br/>\n&gt; own learning and to take the time needed to really grasp each <br/>\n&gt; subject, but does that create problems in adapting to the workplace <br/>\n&gt; where having an adequate result on time often outweighs having a <br/>\n&gt; better result later?  How do parents help homeschooled / unschooled <br/>\n&gt; children work to deadlines, if indeed it is even a consideration?<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":65597,"nextTopicId":65639}}