{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":779600,"authorName":"KathrynJB@aol.com","from":"KathrynJB@...","profile":"kathrynbeth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Julian Writing (An Unschooling Story)","postDate":"1018642052","msgId":34578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0NS5jYzNlZmY5LjI5ZTg5ODg0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":34577,"nextInTime":34579,"topicId":34578,"numMessagesInTopic":0,"msgSnippet":"First, some background. When Julian (now 12) left school after the third grade, he hated to write. Not too surprising, given his only experience was stupid","messageBody":"<div id=\"ygrps-yiv-1086034837\">First, some background. When Julian (now 12) left school after the third <br/>\ngrade, he hated to write. Not too surprising, given his only experience was <br/>\nstupid sentences from his vocabulary words. He just didn&#39;t do any at all for <br/>\na long time.<br/>\n<br/>\nAfter he&#39;d been out of school for a while, I surprised him by inviting him to <br/>\ngo to a nearby cafe with me to eat goodies and write poetry. (if this sounds <br/>\nmanipulative, it&#39;s more my explanation than what happened. It was clear he <br/>\ncould say no to writing and yes to goodies.) He was so startled he said yes, <br/>\nand we went off. I told him about haiku, and he wrote several poems that he <br/>\nreally liked. (This was his first experience writing something he liked.) <br/>\nAfter that, he occasionally wrote poetry on his own, but mostly didn&#39;t write <br/>\nmuch else.<br/>\n<br/>\nJulian&#39;s next big Writing Event came when my sister noticed an essay contest <br/>\nabout vegetarianism. He was about 10. Like other resources, I mentioned it, <br/>\nbut expected him to say no. He didn&#39;t...he enthusiastically said yes. He <br/>\nended up writing this brilliant essay about Vegetarianism as a Spiritual <br/>\nPractice that not only went to the contest, but that he read as a sermon at <br/>\nour church. <br/>\n<br/>\nRecently Julian decided to start writing more. He&#39;s been often going off to <br/>\nthe computer spontaneously and working on what I knew was a science fiction <br/>\nstory. He invited me to read it, saying he didn&#39;t know if I&#39;d like it. It <br/>\nturned out to be a very space ship/technological piece with little <br/>\ncharacterization or plot. When asked what I though, I said, &quot;This is very <br/>\ndifferent from the stories you usually like to read, or to tell.&quot;<br/>\n<br/>\nHe said he knew that, and I asked him to tell me more about the story and his <br/>\nwriting it. He talked about how writing this made him less scared about <br/>\nwriting, and that he liked the process of doing it. He liked writing often, <br/>\nbut still feels insecure about it.<br/>\n<br/>\nI asked him if it was like practicing chords on the guitar -- very different <br/>\nfor him than  playing a song you intend to share, but more about getting used <br/>\nto the process, in preparation for a future time when he might want to write <br/>\nsomething he wants to share with the world. He said, &quot;That&#39;s exactly it,&quot; and <br/>\nsmiled.<br/>\n<br/>\nWhat&#39;s interesting to me, now, is talking about writing with another writer, <br/>\nmy son, and seeing that his process and his fears are much from mine. <br/>\nHowever, he ends up supporting me in my writing at LEAST as much as I do him <br/>\nin his. How cool is that?<br/>\n<br/>\nKathryn<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":34577,"nextTopicId":34572}}