{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":90964014,"authorName":"Lisa Hardiman","from":"&quot;Lisa Hardiman&quot; &lt;lisa-hardiman@...&gt;","profile":"lisalhardiman","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [AlwaysLearning] broken-leg report (skip it if you already know the story)","postDate":"1034952038","msgId":9870,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWMyNzZiNCQ1NDMyNTIxMCQwMjAxYThjMEBkcmFjb2NvbnN1bHRpbmcuY29tPg==","inReplyToHeader":"PGY4LjIzM2RmYThiLjJhZTAzMjc0QGFvbC5jb20+"},"prevInTopic":9862,"nextInTopic":0,"prevInTime":9869,"nextInTime":9871,"topicId":9862,"numMessagesInTopic":0,"msgSnippet":"Welcome home, Sandra.  I just am finishing reading the Homeschool Book of Answers so I was able to read your thoughts on many subjects and it was very helpful.","messageBody":"<div id=\"ygrps-yiv-2012349128\">Welcome home, Sandra.  I just am finishing reading the Homeschool Book<br/>\nof Answers so I was able to read your thoughts on many subjects and it<br/>\nwas very helpful.  Take care.  Sending you healing energy from MT Lisa<br/>\n <br/>\n-----Original Message-----<br/>\nFrom: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a> [mailto:<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:SandraDodd@...\">SandraDodd@...</a>] <br/>\nSent: Thursday, October 17, 2002 9:34 AM<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:OutlandsLady@...\">OutlandsLady@...</a><br/>\nSubject: [AlwaysLearning] broken-leg report (skip it if you already know<br/>\nthe story)<br/>\n <br/>\nI have broken my leg again.  The last time was in July, 1985, so<br/>\nbreaking it <br/>\nagain October 11th 2002 isn&#39;t TOO frequent, I guess.  <br/>\n<br/>\n<br/>\nWell it is too frequent because it inconveniences a lot of people and<br/>\nputs <br/>\nmuch of our everyday lives at a standstill.  Keith was saintly the first<br/>\ntime <br/>\nand we didn&#39;t have any children yet.  This time the kids will get much<br/>\nof the <br/>\nworkload, with Keith still being saintly.<br/>\n<br/>\n<br/>\nThe big inconvenience this time was I was in South Carolina to speak at<br/>\na <br/>\nhomeschooling conference, and I was on my way to the opening remarks and<br/>\n<br/>\nintro, after which I was doing a keynote speech.  I had a talk and a<br/>\nworkshop <br/>\nscheduled for Saturday, a workshop for Sunday and the farewell address.<br/>\n<br/>\n<br/>\nBetween the second floors of the two buildings in the hotel was a ramp.<br/>\nToo <br/>\nsteep, too slippery, some kind of indoor/outdoor carpet on it, and I<br/>\nwent <br/>\ndown.  This wasn&#39;t the foot I sprained a month ago, but the other one,<br/>\nthe <br/>\nleft one.<br/>\n<br/>\n<br/>\nMarty was not far behind me, several people were on the little patio at<br/>\nthe <br/>\nend of the ramp. Paramedics came.  Nice women, smart, friendly, but they<br/>\nhad <br/>\na gurney that only cranked down to about 18&quot; off the ground.  I was<br/>\nafraid to <br/>\nstand up on the lately-sprained left foot, ON that ramp, still slippery,<br/>\nso <br/>\nthey got firemen to put me on the gurney.<br/>\n<br/>\n<br/>\nMy first ambulance ride!  One of the homeschooling moms, Kathryn, went<br/>\nwith <br/>\nme.  They took me  to a VERY near hospital, a mile or less up the road, <br/>\nPalmetto Baptist.<br/>\n<br/>\n<br/>\nI spent several hours in a little closed room in the emergency area,<br/>\nhoping I <br/>\ncould have surgery that evening.  It seemed possible, but didn&#39;t happen.<br/>\n<br/>\nX-rays showed breaks just above the ankle on both bones.  (Not nearly as<br/>\nbad <br/>\nas the 1985 breaks.)<br/>\n<br/>\n<br/>\nI was not happy thatI was going to miss the first alternative<br/>\nhomeschooling <br/>\nconference in the southeastern U.S., and I felt horrible for letting<br/>\npeople <br/>\ndown.<br/>\n<br/>\n<br/>\nSurgery was noon Saturday and I hoped that I could leave the next<br/>\nafternoon <br/>\nin a wheelchair to at least do the closing speech, or that maybe the<br/>\nhotel <br/>\ncould bring conference people in a bus to some big room at the hospital<br/>\nor <br/>\nSOMETHING, but on Sunday I was sick from post-op this&#39;n&#39;that, and<br/>\nthrowing <br/>\nup.  <br/>\n<br/>\n<br/>\nI had a dozen visitors, all of whom assured me that although I was<br/>\nmissed, <br/>\nthe conference was wonderful and people were meeting others and learning<br/>\na <br/>\nton.  That was good to hear, but also sad because I wasn&#39;t getting to<br/>\nmeet <br/>\neveryone, and the morphine drip was keeping me from being equally alert<br/>\nat <br/>\nall times.  I was zoning out, but it was keeping the pain down.<br/>\n<br/>\n<br/>\nMarty sat in on the panel discussion in my place, and seemed really<br/>\nhappy <br/>\nabout having done so.  He made a good impression on lots of people<br/>\nthere.  I <br/>\nheard reports about how good he was at helping the younger kids with<br/>\ngames, <br/>\nthat he seemed more mature than they expected of a thirteen year old,<br/>\nand <br/>\nthat he was handling the stress very well.  I was grateful to people for<br/>\n<br/>\nbringing him to see me in the hospital, and we talked on the phone some<br/>\ntoo. <br/>\n<br/>\n<br/>\nBecause of this accident , the hotel will make concessions for next<br/>\nyear&#39;s <br/>\nconference, I hope, and the room Marty and I had, he stayed in free for<br/>\nfour <br/>\nnights.   Anne Ohman was right next door to Marty and Joyce Fetteroll<br/>\npast <br/>\nthat.  Mary Gold was down a couple of floors.  They all helped Marty out<br/>\non <br/>\nthe weekend, and Anne and Joyce had video-game-playing kids with them,<br/>\nand so <br/>\nthere was some good interaction about that, some sight-seeing, some<br/>\ntrips to <br/>\ngood kid-food places (since they had a van).    So IF they fix that ramp<br/>\nand <br/>\nare as  helpful to Kelly Lovejoy, our hostess and organizer, as they<br/>\nneed to <br/>\nbe, we&#39;ll try again next year.<br/>\n<br/>\nKelly, thank you for ALL your help, and the ride to the airport.  Even<br/>\nthough <br/>\nit wasn&#39;t &quot;a good weekend&quot; for me, I had a great time being with you and<br/>\nyour <br/>\nfamily.<br/>\n<br/>\n<br/>\nWe flew home as scheduled, with me being carried up the steps in a<br/>\nspecial <br/>\nchair to the Canadair jet, and down (flight to Cincinnatti) and then<br/>\nhelped <br/>\ninto a first class seat on the 737 for the rest of the flight home.  My<br/>\nfoot <br/>\ndidn&#39;t hurt as much as I had been afraid it would, I didn&#39;t get woozy,<br/>\nand I <br/>\ndidn&#39;t need to try to use an airplane bathroom, so my fears were happily<br/>\n<br/>\n<br/>\nunmet.<br/>\n<br/>\n<br/>\nOf the four flat levels of the house, I&#39;ve been stationed in the den so<br/>\nI can <br/>\nget to &quot;the cat bathroom&quot; and the office, but the first night home I was<br/>\nin <br/>\nmy OWN bed, next to Keith, and that was good.  It was dark and quiet and<br/>\nthe <br/>\nmattress and pillow weren&#39;t plastic.<br/>\n<br/>\n<br/>\nI&#39;ll probably end up deleting some of the yahoogroups mail because it&#39;s<br/>\nquite <br/>\npiled up.  It might take me a bit to get through all the personal mail<br/>\ntoo, <br/>\nbut I figured one report on this to everyone would keep me from having<br/>\nto <br/>\nretell it (because it hurts my leg and my feelings every time I tell it)<br/>\nand <br/>\nit will give people a heads up on why I might be flakey or a no-show in<br/>\nthe <br/>\nnext few weeks.  (Kathy, we need to reschedule that lunch; Helena, I<br/>\ncan&#39;t do <br/>\na Jasmine pick-up or delivery as I should have; Jeff and Mike, music<br/>\npractice <br/>\nwill need to be here or not at all for a while, etc.)<br/>\n<br/>\n<br/>\nNo weight on it for six weeks is what they told me in South Carolina.  I<br/>\n<br/>\nguess maybe that means after six weeks I can get a walking cast, but I<br/>\ndon&#39;t <br/>\nknow.  I guess I&#39;ll see a Lovelace ortho-guy next week to see x-rays and<br/>\nget <br/>\na preview of my coming weeks.  They put pins in one bone and a plate and<br/>\npins <br/>\nin the other.<br/>\n<br/>\n<br/>\nSo I&#39;m not happy, but I&#39;m safe at home and will try not to bring down<br/>\nthe <br/>\nhappiness of those around me.  I can only sit up a while at a time now.<br/>\nI <br/>\nhave a wheelchair and a walker.  <br/>\n<br/>\n<br/>\nWhen some of the photos of me are available, I&#39;ll put them on a website<br/>\nso <br/>\nyou can see me downed on the ground, and in the hospital if you want<br/>\nmore of <br/>\nthe full effect.   I&#39;ve been to South Carolina twice now, and been in<br/>\nthe <br/>\nhospital both times (well, the first time my parents were living in<br/>\nAiken and <br/>\nwent across the border to Augusta, Georgia, for my birth, so maybe that <br/>\ndoesn&#39;t count).   <br/>\n<br/>\n<br/>\nI&#39;m really sorry for the inconveniences this will cause in the coming<br/>\nweeks.  <br/>\nI have movies to watch and books to read and kids to hang out with, and<br/>\nI&#39;ll <br/>\nbe able to sit at the computer longer as time goes on, so I&#39;m not lonely<br/>\nin a <br/>\nquiet home alone at all!<br/>\n<br/>\n<br/>\nAll o&#39;ya&#39;ll be careful walking on wet ramps.  (Add that to your list of <br/>\nthings to watch out for.)<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n10/17/02<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nYahoo! Groups Sponsor<br/>\n<br/>\n<br/>\nADVERTISEMENT<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=212804.2460941.3878106.2273195/D=egroupweb/S=1705\">http://rd.yahoo.com/M=212804.2460941.3878106.2273195/D=egroupweb/S=1705</a><br/>\n542111:HM/A=810327/R=0/*http:/geocities.yahoo.com/ps/info?.refer=blrecs&gt;<br/>\n<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://rd.yahoo.com/M=212804.2460941.3878106.2273195/D=egroupweb/S=1705\">http://rd.yahoo.com/M=212804.2460941.3878106.2273195/D=egroupweb/S=1705</a><br/>\n542111:HM/A=810327/R=1/*http:/geocities.yahoo.com/ps/info?.refer=blrecs&gt;<br/>\n<br/>\n<br/>\n <br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://us.adserver.yahoo.com/l?M=212804.2460941.3878106.2273195/D=egrou\">http://us.adserver.yahoo.com/l?M=212804.2460941.3878106.2273195/D=egrou</a><br/>\npmail/S=:HM/A=810327/rand=496084138&gt; <br/>\n<br/>\nTo unsubscribe from this group, send an email to:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning-unsubscribe@yahoogroups.com\">AlwaysLearning-unsubscribe@yahoogroups.com</a><br/>\n<br/>\n<br/>\n<br/>\nYour use of Yahoo! Groups is subject to the Yahoo!<br/>\n&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://docs.yahoo.com/info/terms/\">http://docs.yahoo.com/info/terms/</a>&gt;  Terms of Service. <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"broken-leg report (skip it if you already know the story)","postDate":"1034868852","msgId":9862,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGY4LjIzM2RmYThiLjJhZTAzMjc0QGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":9870,"prevInTime":9861,"nextInTime":9863,"topicId":9862,"numMessagesInTopic":0,"msgSnippet":"I have broken my leg again.  The last time was in July, 1985, so breaking it again October 11th 2002 isn t TOO frequent, I guess. Well it is too frequent","messageBody":"<div id=\"ygrps-yiv-509979858\">I have broken my leg again.  The last time was in July, 1985, so breaking it <br/>\nagain October 11th 2002 isn&#39;t TOO frequent, I guess.  <br/>\n<br/>\n<br/>\nWell it is too frequent because it inconveniences a lot of people and puts <br/>\nmuch of our everyday lives at a standstill.  Keith was saintly the first time <br/>\nand we didn’t have any children yet.  This time the kids will get much of the <br/>\nworkload, with Keith still being saintly.<br/>\n<br/>\n<br/>\nThe big inconvenience this time was I was in South Carolina to speak at a <br/>\nhomeschooling conference, and I was on my way to the opening remarks and <br/>\nintro, after which I was doing a keynote speech.  I had a talk and a workshop <br/>\nscheduled for Saturday, a workshop for Sunday and the farewell address.<br/>\n<br/>\n<br/>\nBetween the second floors of the two buildings in the hotel was a ramp.  Too <br/>\nsteep, too slippery, some kind of indoor/outdoor carpet on it, and I went <br/>\ndown.  This wasn&#39;t the foot I sprained a month ago, but the other one, the <br/>\nleft one.<br/>\n<br/>\n<br/>\nMarty was not far behind me, several people were on the little patio at the <br/>\nend of the ramp. Paramedics came.  Nice women, smart, friendly, but they had <br/>\na gurney that only cranked down to about 18&quot; off the ground.  I was afraid to <br/>\nstand up on the lately-sprained left foot, ON that ramp, still slippery, so <br/>\nthey got firemen to put me on the gurney.<br/>\n<br/>\n<br/>\nMy first ambulance ride!  One of the homeschooling moms, Kathryn, went with <br/>\nme.  They took me  to a VERY near hospital, a mile or less up the road, <br/>\nPalmetto Baptist.<br/>\n<br/>\n<br/>\nI spent several hours in a little closed room in the emergency area, hoping I <br/>\ncould have surgery that evening.  It seemed possible, but didn&#39;t happen.  <br/>\nX-rays showed breaks just above the ankle on both bones.  (Not nearly as bad <br/>\nas the 1985 breaks.)<br/>\n<br/>\n<br/>\nI was not happy thatI was going to miss the first alternative homeschooling <br/>\nconference in the southeastern U.S., and I felt horrible for letting people <br/>\ndown.<br/>\n<br/>\n<br/>\nSurgery was noon Saturday and I hoped that I could leave the next afternoon <br/>\nin a wheelchair to at least do the closing speech, or that maybe the hotel <br/>\ncould bring conference people in a bus to some big room at the hospital or <br/>\nSOMETHING, but on Sunday I was sick from post-op this&#39;n&#39;that, and throwing <br/>\nup.  <br/>\n<br/>\n<br/>\nI had a dozen visitors, all of whom assured me that although I was missed, <br/>\nthe conference was wonderful and people were meeting others and learning a <br/>\nton.  That was good to hear, but also sad because I wasn&#39;t getting to meet <br/>\neveryone, and the morphine drip was keeping me from being equally alert at <br/>\nall times.  I was zoning out, but it was keeping the pain down.<br/>\n<br/>\n<br/>\nMarty sat in on the panel discussion in my place, and seemed really happy <br/>\nabout having done so.  He made a good impression on lots of people there.  I <br/>\nheard reports about how good he was at helping the younger kids with games, <br/>\nthat he seemed more mature than they expected of a thirteen year old, and <br/>\nthat he was handling the stress very well.  I was grateful to people for <br/>\nbringing him to see me in the hospital, and we talked on the phone some too. <br/>\n<br/>\n<br/>\nBecause of this accident , the hotel will make concessions for next year&#39;s <br/>\nconference, I hope, and the room Marty and I had, he stayed in free for four <br/>\nnights.   Anne Ohman was right next door to Marty and Joyce Fetteroll past <br/>\nthat.  Mary Gold was down a couple of floors.  They all helped Marty out on <br/>\nthe weekend, and Anne and Joyce had video-game-playing kids with them, and so <br/>\nthere was some good interaction about that, some sight-seeing, some trips to <br/>\ngood kid-food places (since they had a van).    So IF they fix that ramp and <br/>\nare as  helpful to Kelly Lovejoy, our hostess and organizer, as they need to <br/>\nbe, we&#39;ll try again next year.<br/>\n<br/>\nKelly, thank you for ALL your help, and the ride to the airport.  Even though <br/>\nit wasn&#39;t &quot;a good weekend&quot; for me, I had a great time being with you and your <br/>\nfamily.<br/>\n<br/>\n<br/>\nWe flew home as scheduled, with me being carried up the steps in a special <br/>\nchair to the Canadair jet, and down (flight to Cincinnatti) and then helped <br/>\ninto a first class seat on the 737 for the rest of the flight home.  My foot <br/>\ndidn&#39;t hurt as much as I had been afraid it would, I didn&#39;t get woozy, and I <br/>\ndidn&#39;t need to try to use an airplane bathroom, so my fears were happily <br/>\n<br/>\nunmet.<br/>\n<br/>\n<br/>\nOf the four flat levels of the house, I&#39;ve been stationed in the den so I can <br/>\nget to &quot;the cat bathroom&quot; and the office, but the first night home I was in <br/>\nmy OWN bed, next to Keith, and that was good.  It was dark and quiet and the <br/>\nmattress and pillow weren&#39;t plastic.<br/>\n<br/>\n<br/>\nI&#39;ll probably end up deleting some of the yahoogroups mail because it&#39;s quite <br/>\npiled up.  It might take me a bit to get through all the personal mail too, <br/>\nbut I figured one report on this to everyone would keep me from having to <br/>\nretell it (because it hurts my leg and my feelings every time I tell it) and <br/>\nit will give people a heads up on why I might be flakey or a no-show in the <br/>\nnext few weeks.  (Kathy, we need to reschedule that lunch; Helena, I can&#39;t do <br/>\na Jasmine pick-up or delivery as I should have; Jeff and Mike, music practice <br/>\nwill need to be here or not at all for a while, etc.)<br/>\n<br/>\n<br/>\nNo weight on it for six weeks is what they told me in South Carolina.  I <br/>\nguess maybe that means after six weeks I can get a walking cast, but I don&#39;t <br/>\nknow.  I guess I&#39;ll see a Lovelace ortho-guy next week to see x-rays and get <br/>\na preview of my coming weeks.  They put pins in one bone and a plate and pins <br/>\nin the other.<br/>\n<br/>\n<br/>\nSo I&#39;m not happy, but I&#39;m safe at home and will try not to bring down the <br/>\nhappiness of those around me.  I can only sit up a while at a time now.  I <br/>\nhave a wheelchair and a walker.  <br/>\n<br/>\n<br/>\nWhen some of the photos of me are available, I&#39;ll put them on a website so <br/>\nyou can see me downed on the ground, and in the hospital if you want more of <br/>\nthe full effect.   I&#39;ve been to South Carolina twice now, and been in the <br/>\nhospital both times (well, the first time my parents were living in Aiken and <br/>\nwent across the border to Augusta, Georgia, for my birth, so maybe that <br/>\ndoesn&#39;t count).   <br/>\n<br/>\n<br/>\nI&#39;m really sorry for the inconveniences this will cause in the coming weeks.  <br/>\nI have movies to watch and books to read and kids to hang out with, and I&#39;ll <br/>\nbe able to sit at the computer longer as time goes on, so I&#39;m not lonely in a <br/>\nquiet home alone at all!<br/>\n<br/>\n<br/>\nAll o&#39;ya&#39;ll be careful walking on wet ramps.  (Add that to your list of <br/>\nthings to watch out for.)<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n10/17/02</div>","specialLinks":[]}],"prevTopicId":9869,"nextTopicId":9872}}