{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"John O. Andersen","from":"&quot;John O. Andersen&quot; &lt;andersen@...","replyTo":"LIST","senderId":"qxhZI8G7NGWIa5LtlVFEcHr8yScbqr5Y0_tzhccp_OEad2RWGuvbhIknwNzfT7zibDC5OuO6bYjcMoPIUkS4bV6DP7bN0Ep2FJppezpf_2b4DA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Learn like royalty for next to nothing","postDate":"943109793","msgId":4705,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4zMDcuNDcwNS45NTkyNjk3NDRAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":4704,"nextInTime":4706,"topicId":4705,"numMessagesInTopic":0,"msgSnippet":"During the Middle Ages, the royals and other upper class people frequently hired private tutors to teach them about subjects in which they were interested.","messageBody":"<div id=\"ygrps-yiv-997469220\">During the Middle Ages, the royals and other upper class people frequently<br/>\nhired private tutors to teach them about subjects in which they were<br/>\ninterested.  Those tutors were recognized experts in their fields.  Their<br/>\ninstruction was one-on-one; a splendid arrangement if you could afford it.<br/>\nSadly, only the privileged could.<br/>\n<br/>\nToday, such arrangements are more possible than ever before, yet relatively<br/>\nfew people take advantage of them.   What&#39;s truly amazing is that this<br/>\nsuperior way of learning is often available for next to nothing.<br/>\nFrequently, all it costs is a bit of curiosity and time out from a busy<br/>\nschedule.<br/>\n<br/>\nYesterday, as a family, we went to the Oregon Museum of Science and Industry<br/>\n(OMSI) (http://www.omsi.edu).  This is one of our favorite places, so much<br/>\nso that we have been members since arriving in Oregon two years ago.<br/>\n<br/>\nOne of the special events on yesterday&#39;s program was a demonstration on<br/>\nskulls.  Even though the museum was packed with people, my daughter and I<br/>\nwere the only ones to attend this particular demonstration.  For nearly an<br/>\nhour, we learned all about skulls from an enthusiastic and well-informed<br/>\ngraduate student in physical anthropology.  He led us through an exercise in<br/>\nwhich we examined specific patterns on two skulls to determine which<br/>\nbelonged to a male and which to a female.  We learned how to tell the<br/>\ndifference between skulls of young people and those of the elderly.  We also<br/>\ncompared the human skull to a gorilla skull, noting the differences and why<br/>\nthose differences exist.  Our mentor answered our specific questions and<br/>\ngave us additional information which further illuminated the concepts.<br/>\n<br/>\nIt was complete intellectual stimulation.<br/>\n<br/>\nOMSI is just one example of a community resource which can bring eager<br/>\nlearners and enthusiastic mentors together.  There are zoos, art museums,<br/>\nhistorical houses, history museums, wildlife preserves, special<br/>\nexhibits--the list is endless.  At nearly every one of these, you can<br/>\nusually find knowledgeable people (just like the Medieval tutors in their<br/>\nday) who, more often than not, are hoping that someone stops long enough to<br/>\ntake an interest in their work and ask questions.  If you take advantage of<br/>\nthese opportunities, you may find (as we have) that some of  the best<br/>\nlearning available is either free or very inexpensive--a much better<br/>\narrangement than how it was during the Middle Ages!<br/>\n<br/>\nJohn Andersen<br/>\nhttp://members.xoom.com/joandersen</div>","specialLinks":[]}],"prevTopicId":4701,"nextTopicId":4708}}