{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":255816758,"authorName":"Mel","from":"&quot;Mel&quot; &lt;beensclan@...&gt;","profile":"beensclan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Playgroups and problems","postDate":"1297185723","msgId":59593,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlpcnUzcitkY2ljQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEFBTkxrVGk9TzBhcFZyV01lZjE1cmJrR2FBVU1hNTl4K2VHLXdVUjFfb2ZtQkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":59567,"nextInTopic":0,"prevInTime":59592,"nextInTime":59594,"topicId":59567,"numMessagesInTopic":0,"msgSnippet":"Hi Natalie, I ve been thinking over your situation this morning.  I am really feeling for your your son.  What isn t sitting right for me is that, in this","messageBody":"<div id=\"ygrps-yiv-907091642\">Hi Natalie,<br/>\n<br/>\nI&#39;ve been thinking over your situation this morning.  I am really feeling for your your son.  What isn&#39;t sitting right for me is that, in this case,  I think that the relationships in your own family should trump outside friendships.  From how you are describing this former friend of yours and her older son, I personally wouldn&#39;t want to waste my life and time knowing them.  <br/>\n<br/>\nTo be fair for your daughters and son, I would begin to move forward.  Make the other family less appealing by meeting new people.  Look for unschoolers.  Look for people who don&#39;t approach homeschool clubs and activities in such a schoolish fashion.  Let go of thinking about age groups.  Just set it up so that the kids can form relationships.  Think outside the homeschooling box.  <br/>\n<br/>\nI live in a small town too.... I know that homeschool groups can be stifling.   I saw this happening and made my own group.  As it turned out, there were others out there just like us.  We dropped the group mentality and are now just a bunch of friends. The kids are all different ages, cultures and beliefs and don&#39;t seem to divide up according to anything except personal interests.  <br/>\n<br/>\nI hope this helps.<br/>\n<br/>\nMel<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Natalie Bullock &lt;nasb2pyrs@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Hello all,<br/>\n&gt; <br/>\n&gt; I need some advice, and I feel like this needs to be the group of people I<br/>\n&gt; ask. </span></blockquote></div>","specialLinks":[]},{"userId":393140665,"authorName":"Natalie Bullock","from":"Natalie Bullock &lt;nasb2pyrs@...&gt;","profile":"dubbadubbadub","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Playgroups and problems","postDate":"1297114901","msgId":59567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGk9TzBhcFZyV01lZjE1cmJrR2FBVU1hNTl4K2VHLXdVUjFfb2ZtQkBtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":0,"nextInTopic":59593,"prevInTime":59566,"nextInTime":59568,"topicId":59567,"numMessagesInTopic":0,"msgSnippet":"Hello all, I need some advice, and I feel like this needs to be the group of people I ask. We are still fairly new in our unschooling journey, but I feel like","messageBody":"<div id=\"ygrps-yiv-1555790557\">Hello all,<br/>\n<br/>\nI need some advice, and I feel like this needs to be the group of people I<br/>\nask.<br/>\n<br/>\nWe are still fairly new in our unschooling journey, but I feel like we are<br/>\nmore confidently on our way now that we&#39;ve withdrawn from the public charter<br/>\nto which we belonged, and I have a trust in the process that wasn&#39;t there<br/>\npreviously.   Certainly, there is a sense of peace and assurance about it<br/>\nthat makes it feel right.<br/>\n<br/>\nAnyway, we live in a small town with a reasonably-sized homeschooling<br/>\npopulation, and we belong to our small homeschooling co-op which loosely<br/>\nconsists of about 50 families, though there is a much, much smaller core<br/>\nwith which we&#39;ve been a part of for about 3.5 years.  Until about a year<br/>\nago, things were going very well, and I thought that it was about as<br/>\nwonderful as it gets.  Within the group was one family with three children<br/>\nwhose ages were similar to my own three, and for a while, they were best<br/>\nfriends - the oldests, the middles, and the littles, we called them.  A<br/>\nlittle over a year ago, the oldest two boys had a falling out.  Of sorts.<br/>\nBoth were in gymnastics (lowest level of competition - Level 4) and the<br/>\nother boy shot ahead in ability in one of the events, and seemed to show a<br/>\nfair bit of impatience and dismay that the other boys in his level (there<br/>\nwere only four boys - small town = small gym), including with his own<br/>\nbrother, who was also in that same group.  With my son (who just turned 12),<br/>\nwho had previously been his best friend, he got physical a few times -<br/>\npushing him off the mushroom, and otherwise would &quot;growl&quot; or huff under his<br/>\nbreath when especially my son would try.  From that boy&#39;s point of view, his<br/>\nmom said that her son was getting frustrated with my son because he was<br/>\ngoofing off and acting silly, which was absolutely true at least some of the<br/>\ntime.  Things fell apart completely during one of the season&#39;s competitions<br/>\n(about a year ago) when, during a warm-up, my son wasn&#39;t paying close<br/>\nattention and was walking on his hands, and as he came down, his foot hit<br/>\nthe other boy&#39;s chin.  I won&#39;t defend my son&#39;s carelessness - he&#39;d been<br/>\nreminded more than once to pay attention to that sort of thing - but the<br/>\nother boy shoved and then punched my son in the stomach.  The coach saw this<br/>\nand did nothing except to reprimand my son for not paying close enough<br/>\nattention.  He deserved the reprimand, but I still believe that the other<br/>\nboy was not justified in his response, and eventually, I pulled all three of<br/>\nmy children from that gym.  My son said later that the same thing had<br/>\nhappened in reverse at their home gym during normal practices - the other<br/>\nboy had kicked him 2-3 times by accident, and my son would say, &quot;Hey dude,<br/>\nwatch where you&#39;re going&quot; or something like that, but he did not ever hit<br/>\nhim.<br/>\n<br/>\nOur playgroup has consisted of about 10 families total, although some are<br/>\nless consistent than others.  The oldest group of kids are aged (almost 12)<br/>\nto 13, and my son and the other boy are a part of that group.  Of course,<br/>\nthese kids are entering the age of hormonal changes and sort of becoming<br/>\nmore aware of their interests and such, so I don&#39;t expect the cohesiveness<br/>\nthat used to be there, to remain unchanged.  I&#39;d hoped, however, that they<br/>\nwould retain a basic level of friendship and respect for each other along<br/>\nthe way.<br/>\n<br/>\nYesterday, one of the moms in this group asked me if my son had found a new<br/>\nset of friends...and I&#39;m not sure how to take that.  I&#39;ve asked for some<br/>\nclarification, and maybe it was an innocent remark, but for some reason, it<br/>\nhas made me very sad today.<br/>\n<br/>\nMost of the playgroup days happen at the other boy&#39;s home, and sometimes it<br/>\nseems like my son isn&#39;t really included in the larger group of kids his<br/>\nage.  Other times, that doesn&#39;t seem to be the case at all.  I will say that<br/>\nmy son has mentioned that the other kids want to do more talking, and he<br/>\nstill wants to be outside running around.  Maybe this means he&#39;s a little<br/>\nmore immature than some of the other kids, and maybe it (also?) means he<br/>\njust needs to be more active/physical and craves more outdoor time.  It&#39;s<br/>\nprobably a combination of the two.<br/>\n<br/>\nHere&#39;s the real problem for me right now:  the mom of this other boy used to<br/>\nbe what I&#39;d call my best friend.  Things have changed significantly, not<br/>\nonly because of this but because of some other things, such as disparaging<br/>\ncomments she&#39;d make about girls in general or my girls in particular.  They<br/>\nare a family of yellers, and my older two children have commented that the<br/>\nmom and the dad in that family both get mad a lot - I know this is true,<br/>\ntoo, from things I&#39;ve witnessed and things I&#39;ve been told by the mom.  The<br/>\nmom has made comments that her oldest son has been having some anger issues<br/>\n- I think she described him as being either anxious or angry.  I think the<br/>\nmom is actively working on this for her whole family - finding ways to help<br/>\neach of them deal with big and little stresses and frustrations, which I<br/>\nthink really became important to her as she&#39;s witnessed her son&#39;s anger rise<br/>\nso quickly to the surface.  If it matters, this is the family who first<br/>\nreally introduced me to the notion of unschooling - I&#39;d heard of it before,<br/>\nbut this was the first time I &quot;saw&quot; it.  :)<br/>\n<br/>\nAlthough my son is no longer &quot;best friends&quot; (or even good friends) with the<br/>\nother boy, my two girls are still very, very close with the two younger sons<br/>\nin that family.  For the fourth or fifith time in the last 6 weeks, I&#39;ve<br/>\nreceived a request for just my girls to come over to play.  My son no longer<br/>\nhas a &quot;best friend&quot; or even any real &quot;close&quot; friends, and although he<br/>\nunderstands that his sisters deserve their own friendships, it hurts me to<br/>\nknow that these invitations specifically exclude him and that that knowledge<br/>\nhurts his feelings.  He doesn&#39;t want to be included in these invites (he&#39;d<br/>\nstill be willing to &quot;play&quot; with the other boy, but I suppose it&#39;s a one-way<br/>\nstreet), but they do underscore the situation - that he&#39;s NOT getting any<br/>\ninvites.  Moreover, he doesn&#39;t seem to want to participate in situations<br/>\nwhere he might meet other kids, so we&#39;re in a bit of a rut.  He misses<br/>\nhaving a close friend, and as a fellow introvert - and as someone who misses<br/>\nthe friendship I used to have with the mom mentioned above - I understand<br/>\nand grieve with him.<br/>\n<br/>\nI don&#39;t want my girls or the other two little boys in all of this to suffer<br/>\nbecause of what&#39;s happened with the big boys or the moms, but I&#39;m having a<br/>\nhard time accepting these requests.  I&#39;ve loved this mom and her boys, but I<br/>\ndon&#39;t see things changing.  I bear no enmity toward this mom (or her son),<br/>\nbut in my heart, I know that for my own comfort level, I need to maintain a<br/>\ngreater (emotional) distance between *us* than what we once had.  I don&#39;t<br/>\nmind the children playing, but I do mind watching my son bear the burden of<br/>\na lost friendship while his sisters go off and play in a home where he&#39;s not<br/>\nreally welcome.<br/>\n<br/>\nTo my knowledge, there are no other playgroups for homeschooled kids his age<br/>\n(most seem to return to public school around middle school age).   I&#39;m at a<br/>\nloss as to how to handle this and would welcome the advice of those who<br/>\nmight look at this from perspectives I&#39;ve not considered.<br/>\n<br/>\nThank you in advance,<br/>\nNatalie<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":59589,"nextTopicId":59573}}