{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":65,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] too boring to unschool?","postDate":"1297489253","msgId":59679,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg5RUE5M0E5LTVBQzUtNEY4Qy1CNEY3LTIzRTc3RTI3Mjg0NUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEE5MjYzMzEwLUQ0OUItNDI0NS1BQTM5LUE4RTIwM0FGQzE1OUBiaWdwb25kLmNvbT4=","referencesHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPiA8QTkyNjMzMTAtRDQ5Qi00MjQ1LUFBMzktQThFMjAzQUZDMTU5QGJpZ3BvbmQuY29tPg=="},"prevInTopic":59678,"nextInTopic":59681,"prevInTime":59678,"nextInTime":59680,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"Debbie, I liked your post except for this part: -=-A rich and stimulating environment is great, but only to the extent that it is appreciated by the","messageBody":"<div id=\"ygrps-yiv-749912633\">Debbie, I liked your post except for this part:<br/>\n<br/>\n-=-A rich and stimulating environment is great, but only to the extent that it is appreciated by the learner.-=-<br/>\n<br/>\nIf &quot;a learner&quot; (the child, I think you mean) is damaged or dulled down to the point that &quot;rich and stimulating&quot; is not stimulating, that&#39;s a serious problem requiring many months of unschooling (or years, for the parent).  But parents do not HAVE years to gradually stretch, yawn, scratch, burb and mosey on toward thinking about whether they want to understand unschooling.<br/>\n<br/>\n-=-A rich and stimulating environment is great, but only to the extent that it is appreciated by the learner. Walks in nature may feel stifling to someone with a love of running or racing bikes or to someone who&#39;s not in the mood for it or who feels like swimming etc. Getting to know your children and where they&#39;re at now, will help you to help them learn and flourish. -=-<br/>\n<br/>\nPerhaps what you were thinking was that if a particular activity is something that someone (not &quot;the learner,&quot; but someone) likes, it won&#39;t be &quot;rich&quot; or it won&#39;t be &quot;stimulating.&quot;<br/>\n<br/>\nWithout a rich and stimulating environment of one sort or another, &quot;unschooling&quot; is probably just neglect.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: too boring to unschool?","postDate":"1297481986","msgId":59676,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFBTkxrVGluTFI2QjNDR3otYVhUSlN6SGZBRUFPemljLS1tYWJ6dVlEY2IyREBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGlqMzJsZyttdThsQGVHcm91cHMuY29tPg==","referencesHeader":"PGlqMnFvbytqdjZvQGVHcm91cHMuY29tPgk8aWozMmxnK211OGxAZUdyb3Vwcy5jb20+"},"prevInTopic":59675,"nextInTopic":59677,"prevInTime":59675,"nextInTime":59677,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"===But unschooling IS about being with your kids!! If you want to do other things than be with your kids, that s a darn big hurdle in the ability to","messageBody":"<div id=\"ygrps-yiv-1882360970\">===But unschooling IS about being with your kids!! If you want to do<br/>\nother things than be with your kids, that&#39;s a darn big hurdle in the<br/>\nability to unschool.===<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;so unschooling parents have to be with their kids *ALL* the time and are not &quot;allowed&quot; to *WANT* to do other things??? can parents who MUST be away from their kids in order to earn a living unschool? i&#39;d love to hear more takes on this.... it doesn&#39;t sit right with me&lt;&lt;&lt;<br/>\n<br/>\n </span></blockquote>But NOT being there is the equivalent of making your lap disappear<br/>\nwhen you see the cat wander up on the off chance of curling up to<br/>\ncuddle on you. If you do that too much you miss getting to know the<br/>\ncat as much, how the cat feels about you, what the cat is like, what<br/>\nkind of games you can play together. You just won&#39;t know anywhere near<br/>\nwhat you could know. YOU won&#39;t learn as much.<br/>\n<br/>\nYou won&#39;t know your kids as well. Your kids won&#39;t know you in the same<br/>\nway they would, especially if you don&#39;t want to be with them much.<br/>\n<br/>\nIt sounds like you want unschooling to allow you to want other things<br/>\nthan being with your kids. It will. Unschooling will falter without<br/>\nyou and your spouse though. I bet you&#39;re right if that&#39;s your ideal<br/>\nlife and you&#39;re thinking the kids will think it&#39;s boring. It probably<br/>\nwill bore you *and* the kids.<br/>\n<br/>\nNothing has been harder for me to tame than my tendency to tune my<br/>\nchild out, and I&#39;ve truly not been sorry to want other things than<br/>\nhaving all my time and things to myself. I&#39;ve gotten used to thinking<br/>\nwhat Karl and his dad might like. And your post has reminded me to<br/>\ncheck in with them.<br/>\n<br/>\nIt&#39;s pretty nice. Brian is working on his music. Karl is enthralled<br/>\nwith his Minecraft videos. I&#39;m playing Castle Age and getting things<br/>\nto eat and we&#39;re talking here and there and petting the cat and<br/>\nplaying with her (she loves the rubber bands). Brian&#39;s on the phone,<br/>\ngetting himself some tea, which reminds me-- I want some tea. Karl has<br/>\ndecided on lemonade.<br/>\n<br/>\n~Katherine</div>","specialLinks":[]},{"userId":416377114,"authorName":"rubixscuba","from":"&quot;rubixscuba&quot; &lt;rebecca@...&gt;","profile":"rubixscuba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too boring to unschool?","postDate":"1297481383","msgId":59678,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNHVyNytyMDNxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqNGF0OStmNW43QGVHcm91cHMuY29tPg=="},"prevInTopic":59677,"nextInTopic":59679,"prevInTime":59677,"nextInTime":59679,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"===I take it that the stars, quotation marks, capitals and multiple question marks are intended to make me (or someone) feel embarrassed or intimidated, or","messageBody":"<div id=\"ygrps-yiv-1827569861\">===I take it that the stars, quotation marks, capitals and multiple question marks are intended to make me (or someone) feel embarrassed or intimidated, or wrong.===<br/>\n<br/>\nno, that is not my intention at all. i was (still am a bit, although Glenda&#39;s clarification helped a lot-- thanks!) confused by the 1st reply i got to my post that said something along the lines of me not wanting to be with my kids all the time being a really big obstacle to unschooling. actually here, i&#39;ll quote it: <br/>\n<br/>\n===But unschooling IS about being with your kids!! If you want to do other things than be with your kids, that&#39;s a darn big hurdle in the ability to unschool.===<br/>\n<br/>\ni was asking for clarification or confirmation to whether this is a shared sentiment among seasoned unschoolers. do most successful unschooling parents not want (and i don&#39;t mean that they are unwilling, just that they recognize their desires to do things that involve time away from the kids) to do other things except be with their children 24/7?<br/>\n<br/>\nanyway, since i posted last night about my fears and feeling of inadequacy (ie our life not being &quot;interesting&quot; enough) i realized that the excuse of wanting to do other things and not be with my kids ALL the time was not a good reason to dismiss unschooling. it was me resisting this new concept. i think i will choose to believe you CAN unschool AND also get time away from your kids to fulfill your own interests as an adult. <br/>\n<br/>\nwhy would those things be mutually exclusive? unschooling parents don&#39;t strike me like the kind of self-sacrificing parents who put their own passions and interests on hold for their kids&#39; sake. i am sure there are ways to meet everyone&#39;s needs without sacrificing either the kids&#39; needs or the parents&#39; needs, and also meeting the family&#39;s financial needs as a whole, yes?<br/>\n<br/>\nand finally, this really resonated with me, and this is exactly why i recognize the desire to be away from my kids at time: <br/>\n<br/>\n===it&#39;s extremely challenging to give your child and your job the full attention both deserve when you&#39;re trying to juggle the two of them at the same time. Even if you&#39;re physically with your kids, that&#39;s not the same as being available to them.===<br/>\n<br/>\nyes! being a self-employed mom is challenging for sure. i enjoy the work i do and i want to do a good job at it, but it&#39;s incredibly difficult for example to have important business meetings with 2 kids in tow or interviewing employees while nursing a baby (although i proudly did it!). i also love being a mom and want to be a present, attentive mama when i am with my kids. i could use ideas for how to strike a balance without sending my youngest 2 kids to school. right now i am mainly trading off with my partner on who works and who watches the kids, but i am leaning towards hiring a nanny (who is hip to unschooling?) who can be with my kids while both my partner and i work, so we can have more family time by both getting off work at the same time. i am also considering working with a non-attendance based home schooling academy that can offer us support and ideas for how to make it work in practice given my other commitments and responsibilities.<br/>\n<br/>\nalso, i do not plan on pulling my 13 yo out from school against her will. i am mainly hoping me deschooling will help me let go of some of the coercive and authoritative and &quot;schooly&quot; ways of parenting that are quite ingrained and that have driven some wedges in between us. i want to recover trust and joy in my relationship with her, and i want to hold onto the trust and joy i have in my 5 yo although i can see it&#39;s teetering. with my 15 mo baby i so clearly see ONLY trust and joy. that is what i want to hold onto and recover!<br/>\n<br/>\nanyway, thanks for all the food for thought! i was &quot;warned&quot; that this list picks apart people&#39;s posts, and i am thankful you do!</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: too boring to unschool?","postDate":"1297479256","msgId":59675,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDkxNTFFQzMzRDQ5MzRGNTZCRjdEOTcyNTBCRjBDMjc4QEx5bGFQQz4=","inReplyToHeader":"PGlqNG42Zyt2aGlmQGVHcm91cHMuY29tPg==","referencesHeader":"PGlqNG42Zyt2aGlmQGVHcm91cHMuY29tPg=="},"prevInTopic":59674,"nextInTopic":59676,"prevInTime":59674,"nextInTime":59676,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"++++++++++++++ Will reply point by point in a bit, but wanted to interject that I know two people that have started unschooling at ages 11 and 12 (almost 13).","messageBody":"<div id=\"ygrps-yiv-1222149097\">++++++++++++++ <br/>\nWill reply point by point in a bit, but wanted to interject that I know two people that have started unschooling at ages 11 and 12 (almost 13). They are doing fantastic and the children are just absolutely thriving! The parental/child relationships have been strengthened, also. So, it IS possible to begin the unschooling journey at these ages. ++++++++++++++++++++++++++++++<br/>\n<br/>\n<br/>\n<br/>\nit most definitely is! my daughter (my older child) was 13 when she came home to unschool and it’s been life changing for her in every sense of the word.  and it was NOT an easy transition, and she was already struggling mightily with peer stuff and emotional stuff related to the school experience (and our home experience) – so it was a bumpy road but worth every minute.  she’s nearly 16 now and extremely well spoken and intuitive about unschooling and life learning.  the transition can be easier for some than others.  she definitely spearheaded to change, and that helped.<br/>\n<br/>\nlyla<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":240358028,"authorName":"kristi_beguin","from":"&quot;kristi_beguin&quot; &lt;foehn_jye@...&gt;","profile":"kristi_beguin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: too boring to unschool?","postDate":"1297478074","msgId":59674,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNHJqcStiajloQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEI1RjA2MzRBLTJGODItNDdCRS1CNTJDLTk0NzkyRDJFNjM4MEBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59673,"nextInTopic":59675,"prevInTime":59673,"nextInTime":59675,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"===This graph is worth considering: http://sandradodd.com/howto=== I agree, this graph is something I keep in mind every day.  Very valuable.","messageBody":"<div id=\"ygrps-yiv-201856377\">===This graph is worth considering: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/howto===\">http://sandradodd.com/howto===</a><br/>\n<br/>\nI agree, this graph is something I keep in mind every day.  Very valuable.</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: too boring to unschool?","postDate":"1297475329","msgId":59671,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNG91MStjZWQxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGMwOGNiOSRiZ3JpMHNAcGQ2bW8xbm8tc3Zjcy5wcm9kLnNoYXcuY2E+"},"prevInTopic":59670,"nextInTopic":59672,"prevInTime":59670,"nextInTime":59672,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"... The trouble with big, sweeping statements like that is there s a big it depends in the middle of it all. It depends on having a child who is comfortable","messageBody":"<div id=\"ygrps-yiv-685855016\">Michelle McGuffin &lt;me.mcguffin@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;Ideally, take them with you if you can and share (if they <br/>\n&gt; are interested), but if that isn&#39;t possible (or they aren&#39;t <br/>\n&gt; interested), talk about it and why it is important to you and then do <br/>\n&gt; it.  Teach/show them that they don&#39;t have to give up living their own <br/>\n&gt; life to help someone else live theirs.<br/>\n<br/>\n </span></blockquote>The trouble with big, sweeping statements like that is there&#39;s a big &quot;it depends&quot; in the middle of it all. It depends on having a child who is comfortable being where you want to go but outside the focus of your attention or staying with someone else - and eventually all kids get there (barring biiiig disabilities) but it can take time. Pushing a child away to follow your own needs creates more separation and more neediness and becomes its own vicious cycle. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; <br/>\n&gt; &gt;so unschooling parents have to be with their kids *ALL* the time and <br/>\n&gt; &gt;are not &quot;allowed&quot; to *WANT* to do other things??? can parents who <br/>\n&gt; &gt;MUST be away from their kids in order to earn a living unschool? i&#39;d <br/>\n&gt; &gt;love to hear more takes on this.... it doesn&#39;t sit right with me.<br/>\n&gt; Hi all, I&#39;m new here.  I&#39;m mom to a 2.5 year old and just starting to <br/>\n&gt; get my brain into &quot;school/unschool&quot; mode.  This particular section <br/>\n&gt; above didn&#39;t sit right with me either.<br/>\n&gt; <br/>\n&gt; I&#39;m leaning towards the unschooling frame of mind myself.  I (perhaps <br/>\n&gt; naively) think kids should see/learn that that parents can and should <br/>\n&gt; enjoy doing things other than being a just a parent/teacher all the <br/>\n&gt; time.  Life is so much bigger than just being a mom.  Yes, we want to <br/>\n&gt; make their world as big and stimulating as possible... lead by <br/>\n&gt; example.  Ideally, take them with you if you can and share (if they <br/>\n&gt; are interested), but if that isn&#39;t possible (or they aren&#39;t <br/>\n&gt; interested), talk about it and why it is important to you and then do <br/>\n&gt; it.  Teach/show them that they don&#39;t have to give up living their own <br/>\n&gt; life to help someone else live theirs.  I hear/feel the guilt and <br/>\n&gt; pressure we have to be everything for our kids.  Is that the way you <br/>\n&gt; want her to live her life though?  It is admirable and somewhat <br/>\n&gt; encoded, but is it fun and healthy?  I want my daughter to enjoy HER <br/>\n&gt; life... I want to enjoy MY life.  Luckily, she is a HUGE part of my <br/>\n&gt; life. ;)  I&#39;m not sure that is coming across the way I intend it.  I <br/>\n&gt; want to enjoy every moment of my daughters&#39; growth and learning but <br/>\n&gt; finding a balance that is healthy for everyone is important?<br/>\n&gt; <br/>\n&gt; Anyway, hi everyone!  I&#39;m here listening in...<br/>\n&gt; <br/>\n&gt; Michelle<br/>\n&gt; Calgary, AB<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too boring to unschool?","postDate":"1297474701","msgId":59670,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNG9hZCtkM2JoQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqNG1vZytqdW1jQGVHcm91cHMuY29tPg=="},"prevInTopic":59669,"nextInTopic":59671,"prevInTime":59669,"nextInTime":59671,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"Eek! Sorry for the unfinished post! ... Finding those interests can involve parents stepping back big time from those idealized images of parenting and","messageBody":"<div id=\"ygrps-yiv-797232773\">Eek! Sorry for the unfinished post!<br/>\n<br/>\nI wanted to comment on this bit, in particular:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; - finding other common interests and exploring them together<br/>\n<br/>\n </span></blockquote>&quot;Finding&quot; those interests can involve parents stepping back big time from those idealized images of parenting and touching base in a serious way with what your kids enjoy. Let their interests become important to you. That doesn&#39;t mean you have to love everything they do, but with some kids you&#39;ll find you don&#39;t have much in common &quot;naturally&quot;. Its not automatic that living with someone with half your genes creates common interests. So find ways to take pleasure in your kids&#39; loves. Whenever you can, find ways to love those things, too. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;i keep thinking a &quot;good&quot; curriculum to touch upon everyday could be a good tool to help create an enriched and stimulating environment<br/>\n </span></blockquote>****************<br/>\n<br/>\nLet your kids be Your curriculum, as it were. Immerse yourself in their interests. Touch on that every day. Yes, there are tons of other things to occupy your time! Make immersing yourself in your kids&#39; life a kind of spiritual practice, if that sort of thing works for you, or a steady effort if that&#39;s more your style - but do that joyfully, not as a chore. Get down and interested because that&#39;s what will let you connect with them in ways that are meaningful *to them* as well as to you. It&#39;s not a meaningful connection otherwise. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; &gt; anyone else ever fear that they were too boring (or too limited in resources) to unschool?<br/>\n </span></blockquote>****************<br/>\n<br/>\nResources are important to unschooling - vital! But that doesn&#39;t mean money, necessarily. You have some good ideas - meet people, look at the world, talk to one another, share time and thoughts and company. Those are all good resources. Trust and imagination help too - trust that your kids don&#39;t need an outside agenda to explore and discover and shine and wonder. Imagination will let you find more ways to facilitate all of that - more ways to say Yes to the underlying needs and desires when you can&#39;t buy a pony or fly to the moon. <br/>\n<br/>\nIf your kinds find you&#39;re too boring, there&#39;s always school - but school isn&#39;t That hard an act to beat, as long as you are being sensitive to what lights up your children. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":331885657,"authorName":"Jennifer Schuelein","from":"&quot;Jennifer Schuelein&quot; &lt;fairiedust66@...&gt;","profile":"jenfromtx6","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: too boring to unschool?","postDate":"1297473552","msgId":59669,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNG42Zyt2aGlmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqNGF1cSthdDd0QGVHcm91cHMuY29tPg=="},"prevInTopic":59668,"nextInTopic":59670,"prevInTime":59668,"nextInTime":59670,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"Will reply point by point in a bit, but wanted to interject that I know two people that have started unschooling at ages 11 and 12 (almost 13). They are doing","messageBody":"<div id=\"ygrps-yiv-1251868820\">Will reply point by point in a bit, but wanted to interject that I know two people that have started unschooling at ages 11 and 12 (almost 13). They are doing fantastic and the children are just absolutely thriving! The parental/child relationships have been strengthened, also. So, it IS possible to begin the unschooling journey at these ages. <br/>\n<br/>\nJennifer<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;wtexans&quot; &lt;wtexans@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; ===i get that learning happens all the time everywhere, but i am also assuming it&#39;s up to me to provide opportunities and enriched experiences===<br/>\n&gt; <br/>\n&gt; Maybe it would help to take the word &quot;enriched&quot; out of there if &quot;enriched&quot;, in your mind, is defined as reading the classics, taking nature walks, going to the museum, and the other things you mentioned in your original post, because that can be a hindrance in your ability to find value in the things that interest your kids.<br/>\n&gt; <br/>\n&gt; When my son was 5 and 6, what enriched his life was for me to do things with him that HE enjoyed! We played with Pokemon action figures, we played Animal Crossing on the Wii (it&#39;s a text-heavy game so I read everything that popped up on the screen while he navigated the game character), we met friends at the park, we went to the park just the two of us, we took bread with us to the park and fed the ducks, we went to the kids&#39; museum that used to be here (which was basically a little room with art supplies and another little room with books - nothing fancy!), we&#39;d go poke around Toys R Us or Target or Walmart, we&#39;d play hide-n-seek inside the house, we&#39;d bust out the sidewalk chalk and draw outside, we&#39;d play in the sprinkler or inflatable pool and would go meet friends at the city pool, I&#39;d read through his favorite Pokemon books with him, we&#39;d play store with his stuffed animals, we&#39;d have pillow fights, and so on. <br/>\n&gt; <br/>\n&gt; We didn&#39;t do all those things every day (well, except for the Pokemon-related things [g]). <br/>\n&gt; <br/>\n&gt; By becoming aware of what interested him, that helped me be able to do more to build off those interests. When he became so enamoured of all things Pokemon, I got on the internet and found some &quot;I Spy&quot; type Pokemon books, a Pokemon Sorry! board game, and a huge chart of all the (at that time) Pokemons, and together we&#39;d bid on Pokemon action figures on eBay (that was when he really began to grasp the concept of budgeting his allowance). <br/>\n&gt; <br/>\n&gt; After playing store and restaurant many times, he mentioned that he wanted to have an imaginary café but to serve real-food snacks to me and my hubby in it. He made a sign for the door, I showed him how to create a Word document and he typed up his own menu after we brainstormed about the snacky foods he was comfortable making on his own, and we went to the thrift store and he picked out some inexpensive dishware and glasses specifically for his café which were only used for his café. He ran his café whenever he wanted; I made sure we always had the groceries on-hand to make the items on his menu. <br/>\n&gt; <br/>\n&gt; When he became interested in swordplay, he and my hubby made several wooden swords. Andrew would draw the design he wanted and my hubby would translate that into a template and together they would cut out the sword with the jigsaw, sand it, and paint it (or not). Then they would (sort of) spar with each other (not too hard, because of the swords being wooden and heavy and hard!). I did check into us going to a local SCA event so he could see some folks using real swords, but Andrew wasn&#39;t interested in going to that -- what interested him was he and his dad making wooden swords and playing with those together, period!<br/>\n&gt; <br/>\n&gt; When he became interested in the Halo video games, I was able to find other unschoolers with whom he could online-play the game (especially important since his local gaming friends were in school and, therefore, not available to game during the day or on school nights) -- some long-lasting, great friendships have formed as a result of that. I found out about a local Halo tournament and my hubby and I went with him and his cousin so they could participate in that all-day event (they were only 10 & 11 at the time; the youngest kids there!). <br/>\n&gt; <br/>\n&gt; Sometimes he&#39;ll agree to do things with me that are more my cup of tea than his, and I appreciate when he does. Those things may not be as exciting for him as they are for me, but sometimes they are . . . and other times the most fun is the talking and laughing that is swirled in with whatever we&#39;re doing.  <br/>\n&gt; <br/>\n&gt; Glenda<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: too boring to unschool?","postDate":"1297473104","msgId":59668,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNG1vZytqdW1jQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":59665,"nextInTopic":59669,"prevInTime":59667,"nextInTime":59669,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"... *************** Keeping things fresh and interesting is a steady, sustained effort in some ways, but fresh and interesting doesn t mean circus lights and","messageBody":"<div id=\"ygrps-yiv-1055600038\">&quot;Rebecca, Portland Green Parenting&quot; &lt;rebecca@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; of course we do a little bit of all of this (did i mention i am new here, i.e. we are not an unschooling family), so maybe it&#39;s the &quot;school&quot; in me that is telling me it needs to be a steady sustained effort (like a regular schedule) or else it&#39;s not &quot;good enough,&quot; but this seems really unattainable to me. <br/>\n </span></blockquote>***************<br/>\n<br/>\nKeeping things fresh and interesting is a steady, sustained effort in some ways, but &quot;fresh and interesting&quot; doesn&#39;t mean circus lights and fireworks every day, either. Kids need time to dig in to interests, time to rest and cuddle, time to &quot;just&quot; play, or watch tv, or chit chat with friends. Those are things they won&#39;t get enough of with school. <br/>\n<br/>\nFresh and interesting can involve adding new, little things to their world on a regular basis - new books, new movies, new toys. It doesn&#39;t have to be a new microscope or cross-country adventure - and very often kids can Find things that are new and fresh right at home as long as you keep home full of possibilities. Here, this is the sort of thing I mean:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/museum\">http://sandradodd.com/museum</a><br/>\n<br/>\nI used to have lots of ideas about how my life would be with kids - and at various times have found I needed to say goodbye to those ideas. My kids *aren&#39;t* the people I imagined them to be, not having sprung fully formed from my head like whatever old goddess. They&#39;re their own people, and I&#39;ve adjusted my expectations around them. I&#39;ll give some examples, sort of, from your list:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - making a healthy made from scratch breakfast together in the mornings, eating at the table as a family and talking about the day to come<br/>\n </span></blockquote>***********<br/>\n<br/>\nDo your kids wake up chipper and wanting to cook? Ray does. This morning he was up cooking breakfast at 6 - but he loves to cook and wakes up cheerful. Mo wakes up grumpy. She wants to snuggle in bed with a cup of coco, ideally while I snuggle next to her with a cup of coffee. We don&#39;t talk about the day until much later. <br/>\n<br/>\nAs a family, we also find its better to make &quot;plans for the day&quot; a day or more in advance these days, since we all tend to get busy once we&#39;re fully awake and are off in four different directions pretty quickly. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - going to museums and keeping up with art and scientific discoveries<br/>\n<br/>\n </span></blockquote>Museums didn&#39;t work for my kids for years. Ray didn&#39;t have much patience for them, and Mo liked them... at a full tilt run. Pretty hard on adults, although I&#39;ll never forget the high-speed chases through the zoo - whew! So art and scientific stuff I&#39;ve kept in touch with through magazines, tv, dvd rentals and the internet and some of that has been interesting to my kids. <br/>\n<br/>\nBut art and science are much more than museums and studies. Kids are natural scientists - forget breakfast and let a young child loose on your spice rack and you can have a good old time with science. Make a cake - science. Decorate it - art. Eat it - connection. Mud is science and art. Glue is science and art. Legos are science and art. I&#39;m not saying don&#39;t go to museums, if your kids like them, but don&#39;t limit your own (and your kids&#39;) relationship with wonder. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; - finding other common interests and exploring them together<br/>\n<br/>\n&gt; - going for a hike or nature walk or working in the garden or even just going to the park and slowing down the pace enough to discover interesting bugs, rocks, flowers and other little things we so commonly don&#39;t notice<br/>\n </span></blockquote>*************<br/>\n<br/>\nPare that one down to just the basic principle and  you&#39;ve got something good to work from: slow down and discover. For you - slow down and discover who your kids are and what makes them smile. It may be a bug or a mud puddle or a scrap of plastic right in your own yard - and so nevermind the nature walk you had planned. Stop and be in the moment. If you do that consistently, see what lights up your children, you&#39;ll be able to offer them more of that. Not a gazillion things more at once, but little bits, steady offerings of &quot;more&quot; until they&#39;re &quot;full&quot;. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt; hi, i&#39;m new here!<br/>\n&gt; <br/>\n&gt; i have been immersing myself in sandra dodd&#39;s website (thank you!) and i keep finding myself returning to the idea that children *will* learn (of course they will!) if they are in an enriched and stimulating environment surrounded by interesting and interested people.<br/>\n&gt; <br/>\n&gt; this has brought up a huge fear and feeling of inadequacy. it&#39;s a bit embarrassing to admit, but don&#39;t think our day to day life is very interesting or stimulating or enriched..... and i am not sure how motivated or capable i am to make it that way!<br/>\n&gt; <br/>\n&gt; i am probably totally romanticizing the idea of home or unschooling, but i imagine things like:<br/>\n&gt; - making a healthy made from scratch breakfast together in the mornings, eating at the table as a family and talking about the day to come<br/>\n&gt; - going for a hike or nature walk or working in the garden or even just going to the park and slowing down the pace enough to discover interesting bugs, rocks, flowers and other little things we so commonly don&#39;t notice<br/>\n&gt; - having instruments at home, playing music, going to concerts and performances and being exposed to a range of different styles of music from classical to modern to world music<br/>\n&gt; - going to museums and keeping up with art and scientific discoveries<br/>\n&gt; - reading books, watching movies and discussing ideas! just discussing things together would be so cool!<br/>\n&gt; - cooking dinners together and eating at the table again, together, and talking about things we enjoyed<br/>\n&gt; - finding other common interests and exploring them together, crafting, beading, birding, magic, whatever it may be...<br/>\n&gt; - meeting interesting people, going to lectures, doing workshops, trying things on for size, getting inspired to think in new ways...<br/>\n&gt; <br/>\n&gt; of course we do a little bit of all of this (did i mention i am new here, i.e. we are not an unschooling family), so maybe it&#39;s the &quot;school&quot; in me that is telling me it needs to be a steady sustained effort (like a regular schedule) or else it&#39;s not &quot;good enough,&quot; but this seems really unattainable to me. <br/>\n&gt; <br/>\n&gt; i keep coming up with excuses for why i can&#39;t do these things... there aren&#39;t enough hours in the day, i want to do other things than be with my kids all the time, it&#39;s too hard to get all 3 kids to sit down together for a meal or activity, everyone enjoys different things, i am too tired, it&#39;s too expensive, it&#39;s too far away, i need to work etc etc...<br/>\n&gt; <br/>\n&gt; anyone else ever fear that they were too boring (or too limited in resources) to unschool? i keep thinking a &quot;good&quot; curriculum to touch upon everyday could be a good tool to help create an enriched and stimulating environment, at least to start while we deschool and slowly move away from the need for structure...<br/>\n&gt; <br/>\n&gt; thoughts?<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too boring to unschool?","postDate":"1297461018","msgId":59665,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNGF1cSthdDd0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqNGF0bCtoNW5lQGVHcm91cHMuY29tPg=="},"prevInTopic":59664,"nextInTopic":59668,"prevInTime":59664,"nextInTime":59666,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"===i get that learning happens all the time everywhere, but i am also assuming it s up to me to provide opportunities and enriched experiences=== Maybe it","messageBody":"<div id=\"ygrps-yiv-1169533888\">===i get that learning happens all the time everywhere, but i am also assuming it&#39;s up to me to provide opportunities and enriched experiences===<br/>\n<br/>\nMaybe it would help to take the word &quot;enriched&quot; out of there if &quot;enriched&quot;, in your mind, is defined as reading the classics, taking nature walks, going to the museum, and the other things you mentioned in your original post, because that can be a hindrance in your ability to find value in the things that interest your kids.<br/>\n<br/>\nWhen my son was 5 and 6, what enriched his life was for me to do things with him that HE enjoyed! We played with Pokemon action figures, we played Animal Crossing on the Wii (it&#39;s a text-heavy game so I read everything that popped up on the screen while he navigated the game character), we met friends at the park, we went to the park just the two of us, we took bread with us to the park and fed the ducks, we went to the kids&#39; museum that used to be here (which was basically a little room with art supplies and another little room with books - nothing fancy!), we&#39;d go poke around Toys R Us or Target or Walmart, we&#39;d play hide-n-seek inside the house, we&#39;d bust out the sidewalk chalk and draw outside, we&#39;d play in the sprinkler or inflatable pool and would go meet friends at the city pool, I&#39;d read through his favorite Pokemon books with him, we&#39;d play store with his stuffed animals, we&#39;d have pillow fights, and so on. <br/>\n<br/>\nWe didn&#39;t do all those things every day (well, except for the Pokemon-related things [g]). <br/>\n<br/>\nBy becoming aware of what interested him, that helped me be able to do more to build off those interests. When he became so enamoured of all things Pokemon, I got on the internet and found some &quot;I Spy&quot; type Pokemon books, a Pokemon Sorry! board game, and a huge chart of all the (at that time) Pokemons, and together we&#39;d bid on Pokemon action figures on eBay (that was when he really began to grasp the concept of budgeting his allowance). <br/>\n<br/>\nAfter playing store and restaurant many times, he mentioned that he wanted to have an imaginary café but to serve real-food snacks to me and my hubby in it. He made a sign for the door, I showed him how to create a Word document and he typed up his own menu after we brainstormed about the snacky foods he was comfortable making on his own, and we went to the thrift store and he picked out some inexpensive dishware and glasses specifically for his café which were only used for his café. He ran his café whenever he wanted; I made sure we always had the groceries on-hand to make the items on his menu. <br/>\n<br/>\nWhen he became interested in swordplay, he and my hubby made several wooden swords. Andrew would draw the design he wanted and my hubby would translate that into a template and together they would cut out the sword with the jigsaw, sand it, and paint it (or not). Then they would (sort of) spar with each other (not too hard, because of the swords being wooden and heavy and hard!). I did check into us going to a local SCA event so he could see some folks using real swords, but Andrew wasn&#39;t interested in going to that -- what interested him was he and his dad making wooden swords and playing with those together, period!<br/>\n<br/>\nWhen he became interested in the Halo video games, I was able to find other unschoolers with whom he could online-play the game (especially important since his local gaming friends were in school and, therefore, not available to game during the day or on school nights) -- some long-lasting, great friendships have formed as a result of that. I found out about a local Halo tournament and my hubby and I went with him and his cousin so they could participate in that all-day event (they were only 10 & 11 at the time; the youngest kids there!). <br/>\n<br/>\nSometimes he&#39;ll agree to do things with me that are more my cup of tea than his, and I appreciate when he does. Those things may not be as exciting for him as they are for me, but sometimes they are . . . and other times the most fun is the talking and laughing that is swirled in with whatever we&#39;re doing.  <br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":240358028,"authorName":"kristi_beguin","from":"&quot;kristi_beguin&quot; &lt;foehn_jye@...&gt;","profile":"kristi_beguin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too boring to unschool?","postDate":"1297460981","msgId":59664,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNGF0bCtoNW5lQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqMzJsZyttdThsQGVHcm91cHMuY29tPg=="},"prevInTopic":59663,"nextInTopic":59665,"prevInTime":59663,"nextInTime":59665,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"Rebecca, Portland Green Parenting  wrote: ~~-~so unschooling parents have to be with their kids *ALL* the time and are not allowed to *WANT*","messageBody":"<div id=\"ygrps-yiv-58968185\">&quot;Rebecca, Portland Green Parenting&quot; &lt;rebecca@...&gt; wrote:<br/>\n<br/>\n~~-~so unschooling parents have to be with their kids *ALL* the time and are not &quot;allowed&quot; to *WANT* to do other things??? can parents who MUST be away from their kids in order to earn a living unschool? i&#39;d love to hear more takes on this.... it doesn&#39;t sit right with me.~-~<br/>\n<br/>\nI&#39;m a not quite sure what isn&#39;t sitting right with you...the idea of unschooling and working, or the idea of having to be with your kids all the time? <br/>\n<br/>\nIn my family, I am the breadwinner, and I work 32 hours a week outside the home.  I take Wednesdays off, so our week is broken up and I get to be home with my girls mid week.  I would much rather be home all the time, and my girls would much rather that I was home all the time, but that is not our reality. We are blessed to have helpful and supportive grandparents close by who spend a lot of time with our girls, and my husband works part-time from home.<br/>\n<br/>\nI&#39;m also very active and I&#39;ve learned how to incorporate my own interests into my life without disrupting the life of my kids.  I run with my dog, swim laps, or mountain bike early in the morning before my kids get up.  I teach Tae Kwon Do over the noon hour on Tuesday and Thursday, I do strength training and spinning class during my lunch hours on Mondays and Fridays.  I learned a long time ago, that being at work most of the day, and then expecting to do something in the evening was very hard on my daughters.  It&#39;s been very easy for me to weave my own exercise needs into the day during the time I&#39;m already away, rather than to come home and expect them to understand why I&#39;m going to karate class after work. On the weekends, my husband and I tag-team a lot.  I&#39;ll go out early before the kids get up, and then he often takes the rest of the day to go climbing.<br/>\n<br/>\n~-~well, DD2 (5 yrs old) is adamantly opposed to going to school, at least for now.~-~<br/>\n<br/>\nThis is precisely why we ended up homeschooling.  School did not work for my oldest daughter.  When we realized fully that this was the case, then we did whatever we needed to do to make homeschooling work for us. Once homeschooling became our reality, we knew that unschooling was the form we would follow. I had begun my homeschooling research 3 years prior to this reality, because I knew that it was unlikely that my daughter would tromp happily off to school. <br/>\n<br/>\n~-~and sometimes i do enjoy time away from them too. ...the question is how can you to truly BE with your kids when there are so many other things that need to get done too? <br/>\n<br/>\nThe idea of &quot;needing time away from my kids&quot; is an idea that is over-glorified to modern-day parents.  But it doesn&#39;t have to be an idea that puts a parents&#39; needs first and the kids&#39; needs last. I function better emotionally and physically if I maintain a pretty rigorous workout schedule, but I don&#39;t have to do it at the expense of my kids emotional health.  Being flexible and upbeat when my schedule falls by the wayside helps a lot too.<br/>\n<br/>\nAs far as day-to-day chores and stuff goes, I find that when I&#39;m doing the dishes or cleaning my kids are right there with me.  We talk a lot while I&#39;m cleaning up the kitchen, and they like to help out too. In fact one thing I&#39;ve noticed recently is that we&#39;ve all been very engaged and happy with eachother while doing the most mundane things.  When I&#39;m working on something like taxes, I find that my girls are working on stuff right along-side me, whether it&#39;s drawing, or playing computer games, or playing cars or polly-pockets...my presence is important, even if they know I&#39;m working on something I need to get done.  <br/>\n<br/>\nAre you a single parent?  Do you have outside support other than paid caregivers?</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too boring to unschool?","postDate":"1297460969","msgId":59663,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNGF0OStmNW43QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqMzJsZyttdThsQGVHcm91cHMuY29tPg=="},"prevInTopic":59662,"nextInTopic":59664,"prevInTime":59662,"nextInTime":59664,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"===DD1 is 13 and has always gone to school and actually loves school=== If she d truly rather be in school, pulling her away from that is no different than","messageBody":"<div id=\"ygrps-yiv-2111824386\">===DD1 is 13 and has always gone to school and actually loves school===<br/>\n<br/>\nIf she&#39;d truly rather be in school, pulling her away from that is no different than putting your 5yo daughter in daycare when she didn&#39;t want to be there. If your oldest daughter would rather be in school, you can still apply the peaceful-parenting aspects of radical unschooling to your lives. Maybe at some point she&#39;d choose to unschool, but it&#39;d be better to let her come to it willingly and with interest.<br/>\n<br/>\n<br/>\n===so unschooling parents have to be with their kids *ALL* the time and are not &quot;allowed&quot; to *WANT* to do other things???===<br/>\n<br/>\n*Someone* needs to be with the younger kids. And even teens, who are more capable of doing things for themselves, need access to someone, need someone to be available to them.<br/>\n<br/>\nWhat I discovered with unschooling is that when I let go of the mainstream-parenting idea of &quot;me time&quot; and settled in to enjoying the time I spent with my son, my definition of &quot;wanting to do other things&quot; changed considerably. I still enjoyed working out and doing artsy-craftsy things, and I did find snatches of time to do those things. As my son&#39;s gotten older and more independent, I have even more time for the things I enjoy.<br/>\n<br/>\nParents absolutely should do things they enjoy. Schuyler&#39;s post was a wonderful example of how that looks with unschooling.<br/>\n<br/>\n<br/>\n===can parents who MUST be away from their kids in order to earn a living unschool?===<br/>\n<br/>\nSome families are able to make that work, absolutely.<br/>\n<br/>\n<br/>\n===i AM with my 2 youngest kids A LOT. they come to work with me every day or i stay at home with them (i can work from home on the computer).===<br/>\n<br/>\nAs a mom who&#39;s worked from home when my child was younger, and now that he&#39;s older, I know that it&#39;s extremely challenging to give your child and your job the full attention both deserve when you&#39;re trying to juggle the two of them at the same time. Even if you&#39;re physically with your kids, that&#39;s not the same as being available to them.<br/>\n<br/>\nWhat I tried to do when my son was younger and I was working from home was give him anywhere from 30-60 minutes of my undivided attention. (It helped that I didn&#39;t have to complete paperwork during specific hours, but I did need to be available by phone during specific hours.) Sometimes the work phone interrupted, but I kept those conversations as brief as possible. I ignored the computer completely during that 30-60 minutes. What I found was that when I could give him chunks of undivided attention throughout the day, immediately afterwards he&#39;d be content to do his own thing for 30 minutes or an hour, and I could then focus on whatever my work priority was during that particular chunk of time. It was a juggling act and it was certainly stressful at times.<br/>\n<br/>\nNow that he&#39;s older and I&#39;m working from home again (thankfully, much more part-time now!), I work when he&#39;s online gaming with friends. But before and after he&#39;s online, we spend a good bit of time chatting and connecting / reconnecting. <br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":187853867,"authorName":"aldq75","from":"&quot;aldq75&quot; &lt;aldq75@...&gt;","profile":"aldq75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too boring to unschool?","postDate":"1297460035","msgId":59677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqNGEwMytiaWg1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGMwOGNiOSRiZ3JpMHNAcGQ2bW8xbm8tc3Zjcy5wcm9kLnNoYXcuY2E+"},"prevInTopic":59676,"nextInTopic":59678,"prevInTime":59676,"nextInTime":59678,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"... There are several things in this post that bother me, but I can t figure out a way to graciously express myself at the moment. I ll stew on it for a bit","messageBody":"<div id=\"ygrps-yiv-1961996230\"><blockquote><span title=\"ireply\">&gt; Life is so much bigger than just being a mom.  Yes, we want to <br/>\n&gt; make their world as big and stimulating as possible... lead by <br/>\n&gt; example.  Ideally, take them with you if you can and share (if they <br/>\n&gt; are interested), but if that isn&#39;t possible (or they aren&#39;t <br/>\n&gt; interested), talk about it and why it is important to you and then do <br/>\n&gt; it.  Teach/show them that they don&#39;t have to give up living their own <br/>\n&gt; life to help someone else live theirs.  I hear/feel the guilt and <br/>\n&gt; pressure we have to be everything for our kids.  Is that the way you <br/>\n&gt; want her to live her life though?  It is admirable and somewhat <br/>\n&gt; encoded, but is it fun and healthy?  I want my daughter to enjoy HER <br/>\n&gt; life... I want to enjoy MY life.  Luckily, she is a HUGE part of my <br/>\n&gt; life. ;)  I&#39;m not sure that is coming across the way I intend it.  I <br/>\n&gt; want to enjoy every moment of my daughters&#39; growth and learning but <br/>\n&gt; finding a balance that is healthy for everyone is important?<br/>\n&gt; <br/>\n&gt; Anyway, hi everyone!  I&#39;m here listening in...<br/>\n&gt; <br/>\n&gt; Michelle<br/>\n&gt; Calgary, AB<br/>\n<br/>\n </span></blockquote>There are several things in this post that bother me, but I can&#39;t figure out a way to graciously express myself at the moment. I&#39;ll stew on it for a bit longer.<br/>\n<br/>\nBut, one thing that is important to share...<br/>\n<br/>\nThere&#39;s a great page on Sandra&#39;s site about the word &quot;teach&quot;. Try to remove the word from your vocabulary and replace it with &quot;learn&quot;. <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/teaching/\">http://sandradodd.com/teaching/</a><br/>\n<br/>\n<br/>\nAndrea Q<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Michelle McGuffin &lt;me.mcguffin@...&gt; wrote:<br/>\n<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: too boring to unschool?","postDate":"1297444514","msgId":59673,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEU5RDI3OTE0LTFBMDktNDZGRi04ODJGLTY4MzczNjMwQTFENUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlqMzIzMit1b2FlQGVHcm91cHMuY29tPg==","referencesHeader":"PGlqMzIzMit1b2FlQGVHcm91cHMuY29tPg=="},"prevInTopic":59672,"nextInTopic":59674,"prevInTime":59672,"nextInTime":59674,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"-=- ps. i am working at the moment as a volunteer in a school and although i would not put down all that goes on there, for the most part there is a lurking","messageBody":"<div id=\"ygrps-yiv-875441581\">-=-<br/>\nps. i am working at the moment as a volunteer in a school and although i would not put down all that goes on there, for the most part there is a lurking sense of boredom and frustration. but it is not school i compare myself to it is the other (seemingly) more organised, more intelligent, more in-depth home schoolers...-=-<br/>\n<br/>\nIt might help to compare your children, their moods, their calm, their learning to what they themselves might be experiencing if they were in school.   Not all unschoolers to all schoolkids, nor your kids to other unschoolers, but your kids to the way they might have been pressured in or affected by school.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":459359078,"authorName":"Regan","from":"Regan &lt;oregano3@...&gt;","profile":"persea112","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] too boring to unschool?","postDate":"1297444030","msgId":59661,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE5MjYzMzEwLUQ0OUItNDI0NS1BQTM5LUE4RTIwM0FGQzE1OUBiaWdwb25kLmNvbT4=","inReplyToHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":59660,"nextInTopic":59662,"prevInTime":59660,"nextInTime":59662,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"... Help your children to do what they would like to do.  To do that well, parents need to be lovingly engaged in their children s lives.  Get to know what","messageBody":"<div id=\"ygrps-yiv-426921486\">On 11/02/2011, at 5:56 PM, Rebecca, Portland Green Parenting wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; <br/>\n&gt; i am probably totally romanticizing the idea of home or unschooling, but i imagine things like:<br/>\n&gt; - making a healthy made from scratch breakfast together in the mornings, eating at the table as a family and talking about the day to come<br/>\n&gt; - going for a hike or nature walk or working in the garden or even just going to the park and slowing down the pace enough to discover interesting bugs, rocks, flowers and other little things we so commonly don&#39;t notice<br/>\n&gt; - having instruments at home, playing music, going to concerts and performances and being exposed to a range of different styles of music from classical to modern to world music<br/>\n&gt; - going to museums and keeping up with art and scientific discoveries<br/>\n&gt; - reading books, watching movies and discussing ideas! just discussing things together would be so cool!<br/>\n&gt; - cooking dinners together and eating at the table again, together, and talking about things we enjoyed<br/>\n&gt; - finding other common interests and exploring them together, crafting, beading, birding, magic, whatever it may be...<br/>\n&gt; - meeting interesting people, going to lectures, doing workshops, trying things on for size, getting inspired to think in new ways...<br/>\n&gt; <br/>\n&gt; of course we do a little bit of all of this (did i mention i am new here, i.e. we are not an unschooling family), so maybe it&#39;s the &quot;school&quot; in me that is telling me it needs to be a steady sustained effort (like a regular schedule) or else it&#39;s not &quot;good enough,&quot; but this seems really unattainable to me. <br/>\n<br/>\n </span></blockquote>Help your children to do what they would like to do.  To do that well, parents need to be lovingly engaged in their children&#39;s lives.  Get to know what they love, what they&#39;re drawn to, what their inclinations are, what&#39;s going on in their lives.  Then you can help them to explore the world in ways that are most meaningful to them.  <br/>\n<br/>\nAn analogy which might help, is to think of how you&#39;d like to be treated by your partner or friends.  Would you like to have something that doesn&#39;t much appeal to you, provided for you with an expectation that you partake?  Or would you like to get on with life as it suits you, and have your friends support you in that?  <br/>\n<br/>\nAdults tend to have much easier access to the world than children, so unschooling parents partner their children as they learn about the world in their own unique ways.  There are soooo many ways that parents can support their children&#39;s learning.  Mostly it is in lots of little ways like reminding them when their favourite show is on tv, sharing lots of the moments of their days, helping to find ways around stumbling blocks, helping with logistics, bringing into their lives cool new ideas/ things that you know they&#39;re likely to find exciting, and so on.<br/>\n<br/>\nOffer to take them to the museum if that&#39;s the kind of thing they might like to do or if they&#39;re in a rut and need some fresh ideas tossed around.  But if you know that the museum is not their thing, a parent isn&#39;t helping to create a big swirly learning environment for her children, by living with the idea that her children should go to the museum, or any of the other things on the list above.  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; i keep thinking a &quot;good&quot; curriculum to touch upon everyday could be a good tool to help create an enriched and stimulating environment, at least to start while we deschool and slowly move away from the need for structure...<br/>\n&gt; <br/>\n </span></blockquote>Did you need a &#39;&quot;good&quot; curriculum&#39; or &#39;structure&#39; to help them to acquire facility with language?  Or did you spend lots of moments talking to them and with them, singing, rhyming, playing, visiting, shopping, eating, sleeping, interacting in all sorts of ways that captivated them or interested them?  After a few years of loving parenting, most children can talk and run and know lots of things about how the world works etc.  Would a curriculum or structure have helped?  <br/>\n<br/>\nA rich and stimulating environment is great, but only to the extent that it is appreciated by the learner.  Walks in nature may feel stifling to someone with a love of running or racing bikes or to someone who&#39;s not in the mood for it or who feels like swimming etc.  Getting to know your children and where they&#39;re at now, will help you to help them learn and flourish.<br/>\n<br/>\nDebbie.</div>","specialLinks":[]},{"userId":185586397,"authorName":"lylaw","from":"&quot;lylaw&quot; &lt;lylaw@...&gt;","profile":"lylawolf","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: too boring to unschool?","postDate":"1297443869","msgId":59660,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYxQUMyREJBNEVDNzQyMEY4QTIzQzFEMzQ0NkY1QTEzQEx5bGFQQz4=","inReplyToHeader":"PGlqM2MybCtpNmtjQGVHcm91cHMuY29tPg==","referencesHeader":"PGlqM2MybCtpNmtjQGVHcm91cHMuY29tPg=="},"prevInTopic":59659,"nextInTopic":59661,"prevInTime":59659,"nextInTime":59661,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"=====I wonder if it would be helpful to you to seek out other unschoolers in your area? Watching and interacting with others of a similar mindset might ease","messageBody":"<div id=\"ygrps-yiv-259425687\">=====I wonder if it would be helpful to you to seek out other unschoolers in your area? Watching and interacting with others of a similar mindset might ease some of your worries. &gt;&gt;<br/>\n<br/>\nrebecca, come join pdx-unschoolers    - or have you already? I can’t remember... <br/>\nlyla<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>If you want to touch upon anything everyday, Sandra&#39;s site, along with the writings of Joyce, Pam and experienced others linked to her site just may be very freeing for you and your children.<br/>\n<br/>\nMel<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: too boring to unschool?","postDate":"1297443103","msgId":59672,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1RjA2MzRBLTJGODItNDdCRS1CNTJDLTk0NzkyRDJFNjM4MEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGMwOGNiOSRiZ3JpMHNAcGQ2bW8xbm8tc3Zjcy5wcm9kLnNoYXcuY2E+","referencesHeader":"PGMwOGNiOSRiZ3JpMHNAcGQ2bW8xbm8tc3Zjcy5wcm9kLnNoYXcuY2E+"},"prevInTopic":59671,"nextInTopic":59673,"prevInTime":59671,"nextInTime":59673,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"-=-I m leaning towards the unschooling frame of mind myself. I (perhaps naively) think kids should see/learn that that parents can and should enjoy doing","messageBody":"<div id=\"ygrps-yiv-1056269797\">-=-I&#39;m leaning towards the unschooling frame of mind myself. I (perhaps <br/>\nnaively) think kids should see/learn that that parents can and should <br/>\nenjoy doing things other than being a just a parent/teacher all the <br/>\ntime.-=-<br/>\n<br/>\nUnschooling parents should never be their children&#39;s teacher.  All parents should be parents all the time.  Not &quot;just&quot; a parent.  Fully a parent, aware and present of being a parent.  There is really no time off from being a parent.<br/>\n<br/>\nThat said, I&#39;m in New York State and my kids are in Albuquerque and Austin.  They&#39;re also 19, 22 and 24.<br/>\n<br/>\nThis graph is worth considering:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/howto\">http://sandradodd.com/howto</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: too boring to unschool?","postDate":"1297442267","msgId":59659,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2NzI0QzU2LTc3NDYtNEZEMS04QUIwLUMyRjExRDZBRjk4NEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGMwOGNiOSRiZ3JpMHNAcGQ2bW8xbm8tc3Zjcy5wcm9kLnNoYXcuY2E+","referencesHeader":"PGMwOGNiOSRiZ3JpMHNAcGQ2bW8xbm8tc3Zjcy5wcm9kLnNoYXcuY2E+"},"prevInTopic":59658,"nextInTopic":59660,"prevInTime":59658,"nextInTime":59660,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"-=-so unschooling parents have to be with their kids *ALL* the time and ... I take it that the stars, quotation marks, capitals and multiple question marks are","messageBody":"<div id=\"ygrps-yiv-1760985000\">-=-so unschooling parents have to be with their kids *ALL* the time and <br/>\n<blockquote><span title=\"ireply\"> &gt;are not &quot;allowed&quot; to *WANT* to do other things??? can parents who <br/>\n&gt;MUST be away from their kids in order to earn a living unschool? i&#39;d <br/>\n&gt;love to hear more takes on this.... it doesn&#39;t sit right with me.-=-<br/>\n<br/>\n </span></blockquote>I take it that the stars, quotation marks, capitals and multiple question marks are intended to make me (or someone) feel embarrassed or intimidated, or wrong.<br/>\n<br/>\nMy confidence with unschooling entirely prevents me being embarrassed or intimidated about giving advice that I know (not think) will help people unschool.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/confidence\">http://sandradodd.com/confidence</a><br/>\n<br/>\nThe time and energy I have put into this list, my site, and into learning more about what does and not work with unschooling families prevents me from considering for a moment that it might be a good use of this list to encourage someone to make recommendations that will hamper unschooling in anyone&#39;s family.<br/>\n<br/>\n&quot;Read a little, try a little, wait a while, watch.&quot;<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":112891150,"authorName":"michmag5@earthlink.net","from":"michmag5@...","profile":"michelle_baum","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: too boring to unschool?","postDate":"1297438661","msgId":59662,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc3NTA5MTkuMTI5NzQzODY2MTY3Ny5KYXZhTWFpbC5yb290QHdhbXVpLWp1bmUuYXRsLnNhLmVhcnRobGluay5uZXQ+"},"prevInTopic":59661,"nextInTopic":59663,"prevInTime":59661,"nextInTime":59663,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"... I ve found this to be true with both my children and my marriage.  The key for me was that I found I couldn t wait until I *felt* like spending more time","messageBody":"<div id=\"ygrps-yiv-184303486\">-----Original Message-----<br/>\n<blockquote><span title=\"ireply\"> &gt;From: argwolff &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:argwolff@...\">argwolff@...</a>&gt;<br/>\n<br/>\n&gt;What I found most surprising was that the more time I spent with the kids, the more I enjoyed the time we spent together. And the more time they spent together the more they enjoyed being together, too. &lt;<br/>\n<br/>\n </span></blockquote>I&#39;ve found this to be true with both my children and my marriage.  The key for me was that I found I couldn&#39;t wait until I *felt* like spending more time with my husband, because the longer it went that we didn&#39;t, the less I even cared.<br/>\n<br/>\nBut if I put forth the effort to do things together, soon I found I *wanted* to.  The same&#39;s been true with relaxing into the time with my children instead of thinking of all the other things I &quot;should&quot; be doing (which almost always involves cleaning something!).<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;And I can always pinpoint any particularly contentious times, or times when things didn&#39;t seem to be working well, to my not being fully engaged and present when we were together.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Me, too. Absolutely.<br/>\n<br/>\nMichelle <br/>\n<br/>\nWife to Bob<br/>\nMomma to George (12), Theo (9), Eli (6), and Oliver (18 mo)<br/>\n<br/>\nIf my life wasn&#39;t funny, it would just be true, and that&#39;s unacceptable.<br/>\n                                                            -- Carrie Fisher</div>","specialLinks":[]},{"userId":76589361,"authorName":"argwolff","from":"&quot;argwolff&quot; &lt;argwolff@...&gt;","profile":"argwolff","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too boring to unschool?","postDate":"1297435908","msgId":59657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqM2llNCtsNGllQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEIyQjZGMzY4LUZFODMtNEU2Mi04RkRBLUM2QzEyRjgxMkQyQkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":59656,"nextInTopic":59658,"prevInTime":59656,"nextInTime":59658,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"... I think this is so right-on. What worried me the most when we first decided to homeschool -- and I knew from the beginning that unschooling was the way we","messageBody":"<div id=\"ygrps-yiv-1307815847\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; This is the part that will keep you from success:  &quot;I want to do other things than be with my kids all the time.&quot;<br/>\n&gt; If you&#39;re willing to be with your kids all the time, you will eventually find you don&#39;t have to be.<br/>\n&gt; If you decide you don&#39;t want to be with your kids all the time, their problems and needs will come back to take your time when you least expect it.  You can&#39;t schedule them away.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>I think this is so right-on. What worried me the most when we first decided to homeschool -- and I knew from the beginning that unschooling was the way we needed to go, but I wasn&#39;t sure how it &quot;looked&quot; from the inside, if that make any sense -- was how I would manage the three of them simultaneously and spend so much time with my kids and not want to either scream or kill them. <br/>\n<br/>\nPoint of reference: My oldest had been in preschool since he was 2 1/2 and had been through two years of public school. My middle child was 4 and in preschool and my youngest was 1 1/2 and I didn&#39;t have any friends with thirds or babies her age. The oldest two squabbled quite a bit when they were together and would often fight for my attention ... I was worried it would extend to an all-day-every-day fight.<br/>\n<br/>\nWhat I found most surprising was that the more time I spent with the kids, the more I enjoyed the time we spent together. And the more time they spent together the more they enjoyed being together, too. School had put barriers between us all. (I&#39;m not trying to paint every moment as idyllic, mind; it&#39;s an overall feeling of peace and enjoyment that returned.)<br/>\n<br/>\nAnd I can always pinpoint any particularly contentious times, or times when things didn&#39;t seem to be working well, to my not being fully engaged and present when we were together.<br/>\n<br/>\nWhich is not to say that you can&#39;t ever be away from your children, but it would be better to find a caregiver for your children that understands your lifestyle to be with them while you are working than for you to expect them to engage themselves while you sit at the computer (I&#39;m making presumptions about the kind of work you do, sorry). Same with time to go out with friends, etc. You&#39;ll shortchange both yourself and the kids (and your work) if you expect them to &quot;just give me a minute&quot; over and over again, or to entertain themselves quietly, etc.<br/>\n<br/>\nAnd if you are able to be fully present with yourself from time to time and with work when you need to be, then you&#39;ll be in a much better position (willingness and ability) and mood to be fully present for your kids, too.</div>","specialLinks":[]},{"userId":188884833,"authorName":"Michelle McGuffin","from":"Michelle McGuffin &lt;me.mcguffin@...&gt;","profile":"abhainnshell","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: too boring to unschool?","postDate":"1297433782","msgId":59658,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMwOGNiOSRiZ3JpMHNAcGQ2bW8xbm8tc3Zjcy5wcm9kLnNoYXcuY2E+"},"prevInTopic":59657,"nextInTopic":59659,"prevInTime":59657,"nextInTime":59659,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"... Hi all, I m new here.  I m mom to a 2.5 year old and just starting to get my brain into school/unschool mode.  This particular section above didn t sit","messageBody":"<div id=\"ygrps-yiv-1953148954\"><blockquote><span title=\"ireply\">&gt;so unschooling parents have to be with their kids *ALL* the time and <br/>\n&gt;are not &quot;allowed&quot; to *WANT* to do other things??? can parents who <br/>\n&gt;MUST be away from their kids in order to earn a living unschool? i&#39;d <br/>\n&gt;love to hear more takes on this.... it doesn&#39;t sit right with me.<br/>\n </span></blockquote>Hi all, I&#39;m new here.  I&#39;m mom to a 2.5 year old and just starting to <br/>\nget my brain into &quot;school/unschool&quot; mode.  This particular section <br/>\nabove didn&#39;t sit right with me either.<br/>\n<br/>\nI&#39;m leaning towards the unschooling frame of mind myself.  I (perhaps <br/>\nnaively) think kids should see/learn that that parents can and should <br/>\nenjoy doing things other than being a just a parent/teacher all the <br/>\ntime.  Life is so much bigger than just being a mom.  Yes, we want to <br/>\nmake their world as big and stimulating as possible... lead by <br/>\nexample.  Ideally, take them with you if you can and share (if they <br/>\nare interested), but if that isn&#39;t possible (or they aren&#39;t <br/>\ninterested), talk about it and why it is important to you and then do <br/>\nit.  Teach/show them that they don&#39;t have to give up living their own <br/>\nlife to help someone else live theirs.  I hear/feel the guilt and <br/>\npressure we have to be everything for our kids.  Is that the way you <br/>\nwant her to live her life though?  It is admirable and somewhat <br/>\nencoded, but is it fun and healthy?  I want my daughter to enjoy HER <br/>\nlife... I want to enjoy MY life.  Luckily, she is a HUGE part of my <br/>\nlife. ;)  I&#39;m not sure that is coming across the way I intend it.  I <br/>\nwant to enjoy every moment of my daughters&#39; growth and learning but <br/>\nfinding a balance that is healthy for everyone is important?<br/>\n<br/>\nAnyway, hi everyone!  I&#39;m here listening in...<br/>\n<br/>\nMichelle<br/>\nCalgary, AB<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":255816758,"authorName":"Mel","from":"&quot;Mel&quot; &lt;beensclan@...&gt;","profile":"beensclan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: too boring to unschool?","postDate":"1297429397","msgId":59656,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqM2MybCtpNmtjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":59655,"nextInTopic":59657,"prevInTime":59655,"nextInTime":59657,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"... I wonder if it would be helpful to you to seek out other unschoolers in your area?  Watching and interacting with others of a similar mindset might ease","messageBody":"<div id=\"ygrps-yiv-446156835\"><blockquote><span title=\"ireply\">&gt; <br/>\n&gt; anyone else ever fear that they were too boring (or too limited in resources) to unschool? i keep thinking a &quot;good&quot; curriculum to touch upon everyday could be a good tool to help create an enriched and stimulating environment, at least to start while we deschool and slowly move away from the need for structure...<br/>\n&gt; <br/>\n&gt; thoughts?<br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>I wonder if it would be helpful to you to seek out other unschoolers in your area?  Watching and interacting with others of a similar mindset might ease some of your worries.  <br/>\n<br/>\nIf you want to touch upon anything everyday, Sandra&#39;s site, along with the writings of Joyce, Pam and experienced others linked to her site just may be very freeing for you and your children.<br/>\n<br/>\nMel</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: too boring to unschool?","postDate":"1297426938","msgId":59655,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMyMTUwNS4zNzgwNC5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PDE0Mzc4OS44Nzg3LnFtQHdlYjg2MjA2Lm1haWwuaXJkLnlhaG9vLmNvbT4=","referencesHeader":"PDE0Mzc4OS44Nzg3LnFtQHdlYjg2MjA2Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":59654,"nextInTopic":59656,"prevInTime":59654,"nextInTime":59656,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"This sentence clearly needs editing: Honestly exploring why you want to submit your children to a programme of reading or instruction would be valuable may","messageBody":"<div id=\"ygrps-yiv-1237873337\">This sentence clearly needs editing: <br/>\n<br/>\n<br/>\n<br/>\n Honestly exploring why you want to submit your children to a programme of <br/>\nreading or instruction would be <br/>\n<br/>\nvaluable may help you enormously with your own deschooling process. <br/>\n<br/>\nmakes more sense as:<br/>\n<br/>\nHonestly exploring why you want to submit your children to a programme of <br/>\nreading or instruction may help you enormously with your own deschooling <br/>\nprocess. <br/>\n<br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] too boring to unschool?","postDate":"1297425284","msgId":59654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEIyQjZGMzY4LUZFODMtNEU2Mi04RkRBLUM2QzEyRjgxMkQyQkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":59653,"nextInTopic":59655,"prevInTime":59653,"nextInTime":59655,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"-=-i keep coming up with excuses for why i can t do these things... there aren t enough hours in the day, i want to do other things than be with my kids all","messageBody":"<div id=\"ygrps-yiv-90278402\">-=-i keep coming up with excuses for why i can&#39;t do these things... there aren&#39;t enough hours in the day, i want to do other things than be with my kids all the time, it&#39;s too hard to get all 3 kids to sit down together for a meal or activity, everyone enjoys different things, i am too tired, it&#39;s too expensive, it&#39;s too far away, i need to work etc etc...-=-<br/>\n<br/>\nThis is the part that will keep you from success:  &quot;I want to do other things than be with my kids all the time.&quot;<br/>\nIf you&#39;re willing to be with your kids all the time, you will eventually find you don&#39;t have to be.<br/>\nIf you decide you don&#39;t want to be with your kids all the time, their problems and needs will come back to take your time when you least expect it.  You can&#39;t schedule them away.<br/>\n<br/>\n-=-it&#39;s too hard to get all 3 kids to sit down together for a meal or activity-=-<br/>\n<br/>\nDon&#39;t try to &quot;get them&quot; to.  Make something that smells good, looks good, when they&#39;re hungry, and invite them to eat.  Then don&#39;t count them or be resentful if one of them (or two or even none of them) feel like sitting down right then.  It might take a while.  And it doesn&#39;t have to be every meal, or every morning.  But it should be SOME meals, and making food available a few times a day (rather than expecting young children to find their own food) is just part of parenting--not about unschooling.  <br/>\n<br/>\n<br/>\n-=-anyone else ever fear that they were too boring (or too limited in resources) to unschool?-=-<br/>\n<br/>\nYes.  <br/>\nIt&#39;s not for everyone.  It&#39;s not something people can wind up and let loose.  It has to be learned and lived.  And it has to be learned on the job, as it goes, so you can&#39;t wait until you&#39;re great at it to start.<br/>\n<br/>\n-=- i keep thinking a &quot;good&quot; curriculum to touch upon everyday could be a good tool to help create an enriched and stimulating environment, at least to start while we deschool and slowly move away from the need for structure...-=-<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a> <br/>\nor look at some of these for ideas of a new way to see structure:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/unschoolingcurriculum\">http://sandradodd.com/unschoolingcurriculum</a><br/>\nThose are things people have written to describe unschooling in formal ways.<br/>\n<br/>\nIf people here or anywhere else tell you it&#39;s no problem to be a boring mom or to expect your kids to learn without attention, don&#39;t listen to them.   Women speak those kinds of words (&quot;it&#39;s okay, don&#39;t worry&quot;) without even thinking.  It&#39;s no more real than the conversations strangers have with kids that involve &quot;hi, what&#39;s your name, where do you go to school, what&#39;s your teacher&#39;s name.&quot;  <br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/support\">http://sandradodd.com/support</a><br/>\nI&#39;m glad you asked your question, but please don&#39;t settle for soothing noise, if what you want is to create an unschooling nest that really benefits your children.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: too boring to unschool?","postDate":"1297423927","msgId":59653,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE0Mzc4OS44Nzg3LnFtQHdlYjg2MjA2Lm1haWwuaXJkLnlhaG9vLmNvbT4="},"prevInTopic":59652,"nextInTopic":59654,"prevInTime":59652,"nextInTime":59654,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"... The i like is the bit that will hinder more than help. If your kids like the idea of listening to the classics (and what are the classics that are great","messageBody":"<div id=\"ygrps-yiv-2076323709\"><blockquote><span title=\"ireply\">&gt;&gt;i like the idea of reading the classics to my kids. is that something that will <br/>\n&gt;&gt;hinder *my* deschooling process?&lt;&lt;<br/>\n<br/>\n </span></blockquote>The &quot;i like&quot; is the bit that will hinder more than help. If your kids like the <br/>\nidea of listening to the classics (and what are the classics that are great for <br/>\na 13 year old, 5 year old and a 15 month old?) than that&#39;s cool and bravo and <br/>\nfantastic. But if it&#39;s you that likes the idea and they that submit to it, well, <br/>\nit doesn&#39;t really work. <br/>\n<br/>\n<br/>\nIt may help you to think about why you like the idea of reading the classics to <br/>\nyour kids. How are the classics any different from other books? What classics <br/>\nare classic? Who decides what is a classic versus a more mundane book? Is it the <br/>\nCharlotte Mason homeschooling approach that leans on classics as the only books <br/>\nto be read? Books like the Indian in the Cupboard spring to mind as ones that <br/>\nhave been stamped with that curriculum&#39;s approval. Honestly exploring why you <br/>\nwant to submit your children to a programme of reading or instruction would be <br/>\nvaluable may help you enormously with your own deschooling process. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":416377114,"authorName":"Rebecca, Portland Green Parenting","from":"&quot;Rebecca, Portland Green Parenting&quot; &lt;rebecca@...&gt;","profile":"rubixscuba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too boring to unschool?","postDate":"1297419760","msgId":59652,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMzJsZyttdThsQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqMnFvbytqdjZvQGVHcm91cHMuY29tPg=="},"prevInTopic":59651,"nextInTopic":59653,"prevInTime":59651,"nextInTime":59653,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"===But unschooling IS about being with your kids!! If you want to do other things than be with your kids, that s a darn big hurdle in the ability to","messageBody":"<div id=\"ygrps-yiv-1771176979\">===But unschooling IS about being with your kids!! If you want to do other things than be with your kids, that&#39;s a darn big hurdle in the ability to unschool.===<br/>\n<br/>\nso unschooling parents have to be with their kids *ALL* the time and are not &quot;allowed&quot; to *WANT* to do other things??? can parents who MUST be away from their kids in order to earn a living unschool? i&#39;d love to hear more takes on this.... it doesn&#39;t sit right with me.<br/>\n<br/>\n===Unschooling should be more interesting than being in school.===<br/>\n<br/>\ni like how simply you put this. this seems doable. easy, even. it made me realize my (admittedly romanticized) ideas about an idyllic unschooling life were too prescriptive and that the fear that i lacked motivation/capabilities came from thinking i had to fit myself into a different box, an &quot;unschooling box&quot; of sorts where everything you do has to be &quot;fabulous all the time.&quot; so thanks for helping me see that.<br/>\n<br/>\n===If you&#39;re not motivated to make that happen, and if you&#39;re not interested in being with your kids a lot, then school might be a better choice for your family. Unschooling&#39;s not for every family.===<br/>\n<br/>\nwell, DD2 (5 yrs old) is adamantly opposed to going to school, at least for now. perhaps she will be ready for it when she is older, but we have tried 2 different preschool situations (very part time, play based, non academic settings) for appx a month at a time (when she was 3 and when she was 4) and ended up pulling her out because she hated it and cried, and i could not bare to pry her clawing fingers off my body. she is not ready to separate from me yet, so this is the reason i am here on this list trying to figure tings out.<br/>\n<br/>\n===Deschooling and using a curriculum don&#39;t go hand in hand. You can&#39;t deschool if you&#39;re holding onto schooly ways of thinking and living.===<br/>\n<br/>\nby &quot;good&quot; curriculum i was thinking some ideas or recommendations for things to do with very young children. things that are &quot;interesting,&quot; or &quot;more interesting than school&quot; i guess. i get that learning happens all the time everywhere, but i am also assuming it&#39;s up to me to provide opportunities and enriched experiences. for example, i like the idea of reading the classics to my kids. is that something that will hinder *my* deschooling process? <br/>\n<br/>\n===Just BE with your kids.===<br/>\n<br/>\nyes! this is what i need help wrapping my mind around. i AM with my 2 youngest kids A LOT. they come to work with me every day or i stay at home with them (i can work from home on the computer). i am trying very hard to create an environment where i do NOT have to send them to child care situations with other people. but while they are with me i do want to get my work done as well. and sometimes i do enjoy time away from them too. i feel like my biggest challenges are child care and time management. my kids are with me, but i am not always truly WITH THEM, if that makes sense. sometimes i am busy or preoccupied by wories or tired... the question is how can you to truly BE with your kids when there are so many other things that need to get done too? is there some kind of mindfulness practice you guys recommend for parent that helps being in the present moment?<br/>\n<br/>\n===Let go of the many (and there are a lot!!) expectations you have about how life &quot;should&quot; be, because if you don&#39;t you will be disappointed and frustrated and angry when what your kids want to do doesn&#39;t jive with the expectations you have of what constitutes an &quot;interesting, stimulating, and interesting&quot; life.===<br/>\n<br/>\nOK! that sounds very freeing! i can let go of my ideas about this, but then what? it brings me right back to my fear that i am too boring to unschool. our life is just kinda ordinary.<br/>\n<br/>\n===How old are your kids, by the way?===<br/>\n<br/>\nDD1 is 13 and has always gone to school and actually loves school. i&#39;d like to unschool as a way to recover our relationship, to build more trust, to stay connected to her as she grows into an adult. i hope i have at least been a more accepting and trusting parent to her than what my parents were to me and that she won&#39;t rebel the way i did when i was 15-16.... but i can see i have done damage nonetheless. i know she doesn&#39;t feel trusted because sadly i know i do not have 100% trust in her. i am realizing i have been a very fearful parent in raising her (mainly while being a single mom, full time student and working part time-- i did what i thought i had to do to survive). i am hoping to change my mind set, so she doesn&#39;t pull away from me like i did to my parents.<br/>\n<br/>\nDD2 is 5 yrs old and like i mentioned above, she is not ready for separation from me. i don&#39;t want to force her to go to school.<br/>\n<br/>\nDS is almost 15 mo old. he is an amazing happy little guy. we breastfeed on demand, cosleep, and he is leading the way with solid foods. we don&#39;t spoon feed him ever, and he loves feeding himself. he knows just what his body needs and i have full trust in him! i want this trust to extend past the baby yrs!</div>","specialLinks":[]},{"userId":227835915,"authorName":"m_aduhene","from":"&quot;m_aduhene&quot; &lt;m_aduhene@...&gt;","profile":"m_aduhene","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: too boring to unschool?","postDate":"1297419170","msgId":59651,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMzIzMit1b2FlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDM4OTEwMC40NDAyMS5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":59650,"nextInTopic":59652,"prevInTime":59650,"nextInTime":59652,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"thankyou to the original poster for putting this out here. i woke up this morning with exactly the same thought and i have been unschooling for 10 years.  it","messageBody":"<div id=\"ygrps-yiv-812137699\">thankyou to the original poster for putting this out here. i woke up this morning with exactly the same thought and i have been unschooling for 10 years.  it was triggered by 2 friends discussing what they had done that day....one had read about the Stamford Bridge being blown up and the other was talking about how her child had started reading Three Men in a Boat.  this opened up a whole chasm of fear (which happens occasionally) that there are areas and books which my children will never know or experience because they have other interests.  but to me when i hear other (more structured friends) say things about the more &quot;weighter&quot; tomes and experiences their children are experiencing i think my children&#39;s interests and experiences trivial.  i then think it is because my interests do not expand to the &quot;weightier&quot; experiences of life, so they are not exposed to them.  i then feel a bit boring.  but i know we made jambalaya and millionaire&#39;s shortbread with love and sparkle and my dd (4) who loves cooking, chatted and laughed and we had a lovely memory made.  my son (6) has been able to conquer lego star wars wii game by his own effort and the pleasure for him (and me) is high.  it&#39;s my oldest daughter who i fret about most because her interests are fashion and justin bieber and a lot of talk about boyfriends (she&#39;s 10).  i never trivailise them to her but i do compare her sometimes in my head with the &quot;weightier&quot; tome children.  do i need to guide her towards these things?<br/>\nschulyer&#39;s post is reassuring in it&#39;s &quot;normality&quot; and a great snapshot of daily life.  it sounds a lot like what goes on here and we are home bodies.  conversations flow on any and every subject.  we chill, we laugh, we flow.  i like my life but soemtimes there is the lurking sense that my children could do with a more interesting mother, but i am always interested in what they are doing.<br/>\nblessings<br/>\nmichelle<br/>\nps.  i am working at the moment as a volunteer in a school and although i would not put down all that goes on there, for the most part there is a lurking sense of boredom and frustration.  but it is not school i compare myself to it is the other (seemingly) more organised, more intelligent, more in-depth home schoolers...<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, Schuyler &lt;s.waynforth@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; My life and my children&#39;s lives and my husband&#39;s life are each filled with <br/>\n&gt; engagements and interests and activities that we enjoy or attempt to enjoy. But <br/>\n&gt; they aren&#39;t necessarily huge and mostly they don&#39;t look much like your list of <br/>\n&gt; activities. Last night at Morris dancing practice a friend and I were making <br/>\n&gt; mouth music. Linnaea thought it was funny and perhaps a bit irreverent, but it <br/>\n&gt; was a slow moment and we were finding engagement with what we had. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; I find your day&#39;s plan fascinating. It seems to be so very much a Steiner image <br/>\n&gt; of the world of engagement and education. It is so at odds with my day to day. I <br/>\n&gt; am assuming that you have younger children, maybe because what you picture seems <br/>\n&gt; like a still life with small children and not a life with older children. Not <br/>\n&gt; that at 13 and 10 Simon or Linnaea don&#39;t like walking in the woods or finding <br/>\n&gt; hedgehogs to fatten to get through the winter, but that it feels more like a <br/>\n&gt; moulded childhood. It also feels very, very scheduled. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; It&#39;s 8:52 am here, now. I am sitting on the couch with the dog and Simon and <br/>\n&gt; Linnaea are sleeping. They probably won&#39;t be up &#39;til 10:30 or 11 or so. There <br/>\n&gt; won&#39;t be a shared and healthy breakfast. I&#39;ll have something soon and then I&#39;ll <br/>\n&gt; fix them things as they require them, or a bit before. Simon will probably watch <br/>\n&gt; videos on youtube for a bit, or work on his Minecraft world. Linnaea may play a <br/>\n&gt; game with me, like cribbage or bananagrams, or she may check in on her wiki <br/>\n&gt; group about Warrior Cats. David will get home from work today around noon and he <br/>\n&gt; and I or he and I and Linnaea or he and I and Linnaea and Simon will go into <br/>\n&gt; town to get wine ingredients and a few sewing notions I need and other little <br/>\n&gt; odds and ends. When we get back home it will be time to go to the nearby fen to <br/>\n&gt; walk the dog. Linnaea likes to come along, although she&#39;s been down with a <br/>\n&gt; lingering flu so may or may not. A stop at the butcher&#39;s for pet food and home <br/>\n&gt; again. And then we&#39;ll be in for the rest of the day. Food will happen at varying <br/>\n&gt; points during the day according to need. Oh and dinner. We tend to all eat <br/>\n&gt; dinner at the same time, even if it isn&#39;t the same food. Tonight&#39;s pizza, so I <br/>\n&gt; need to start the dough as soon as I&#39;m done with this e-mail. But that&#39;s <br/>\n&gt; probably a pretty average day for us. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; However there are a fair number of things that disappear in the list that can&#39;t <br/>\n&gt; be predicted reliably. There will be conversations all through the day. Jokes <br/>\n&gt; and ideas and information and discussions. We&#39;ll watch the IT crowd and maybe an <br/>\n&gt; episode of Xena in the evening. I&#39;ll practice ukulele and maybe sew up a pair of <br/>\n&gt; trousers and a shirt. There is a felting project I need to get around to doing <br/>\n&gt; to replace a scarf I mailed that never arrived. Both Simon and Linnaea played a <br/>\n&gt; part in the original creation so I&#39;m hoping they&#39;ll be willing to do so with the <br/>\n&gt; remake. I don&#39;t know if I&#39;ll get around to that today. There will be <br/>\n&gt; conversations about the cats about the dog about the fish about whatever. There <br/>\n&gt; will be a chase around the house at some point in the day. There will be cuddles <br/>\n&gt; and play and connection. And tea. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; As I write it out it feels of halcyon moments. Of learning all the time. When <br/>\n&gt; they were younger it was different, but still of the same connection and <br/>\n&gt; enjoyment. There was much more movement out and about and in and around. But we, <br/>\n&gt; each of us, tend to be more homebody than intrepid explorer. There are moments <br/>\n&gt; of stumbling across amazing things, like the day at the skate park where we saw <br/>\n&gt; ichneumon wasps mating who we&#39;d seen in different incarnations as their larval <br/>\n&gt; form parasitized the ladybirds that Linnaea had collected from the front of the <br/>\n&gt; garden and put in our window box of cilantro. There was the time at a pond where <br/>\n&gt; we saw wolf spiders carrying their babies on their backs and I dropped the phone <br/>\n&gt; in the water. Fortunately there was a kind stranger with a net who helped me <br/>\n&gt; retrieve it and a few days drying seemed to bring it back. Or the glorious still <br/>\n&gt; told story of keeping a pond full of overly amorous mallards at bay with a <br/>\n&gt; couple of potato guns while the female duck with the bloodied back of her head <br/>\n&gt; found a place to hide. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Those moments are like comparing modern art with the art from previous <br/>\n&gt; generations; only the bigger and bolder pieces are writ large on your memory. <br/>\n&gt; The real stuff, the day to day stuff is the smaller moments. The sitting still <br/>\n&gt; and playing with Barbies, the learning how to play on a gameboy advance and <br/>\n&gt; reading every word on pokemon gold or silver, the face painting, the baths with <br/>\n&gt; all the toys, the hours and hours at Toys R&#39; Us just wandering and looking and <br/>\n&gt; discovering what it is to enjoy patience. B&#39;damen battles with blocks and action <br/>\n&gt; figures, game after game of Pokemon the board game. Lots of food, lots of drink, <br/>\n&gt; lots of care and comfort and love. Those moments make the bigger feeling moments <br/>\n&gt; more likely to happen with everybody enjoying them. Simon has never been <br/>\n&gt; terribly keen to go for walks. But by having his desire to stay home respected <br/>\n&gt; when he does decide to come along for a walk he really enjoys them. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt;&gt;i keep thinking a &quot;good&quot; curriculum to touch upon everyday could be a  good tool <br/>\n&gt; &gt;&gt;to help create an enriched and stimulating environment, at  least to start while <br/>\n&gt; &gt;&gt;we deschool and slowly move away from the need for  structure...<br/>\n&gt; &lt;&lt;<br/>\n&gt; <br/>\n&gt; Deschooling doesn&#39;t work until you let go of structure. Early days unschooling <br/>\n&gt; is about learning how to see learning in all things and if you are still looking <br/>\n&gt; to the structure of curricula it will be very, very difficult to grasp the <br/>\n&gt; fundamentals of unschooling. Having go to ideas of things to do of engagements <br/>\n&gt; to offer is a good thing, but having those things be about education or a <br/>\n&gt; passing on of pieces of specific knowledge it won&#39;t help you to see the glorious <br/>\n&gt; world of unschooling. Those things are best if they are just kind of a fun thing <br/>\n&gt; to do in a moment of nothing much going on. Learning will happen. <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Schuyler<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ________________________________<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] too boring to unschool?","postDate":"1297417211","msgId":59650,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM4OTEwMC40NDAyMS5xbUB3ZWI4NjIwNS5tYWlsLmlyZC55YWhvby5jb20+","inReplyToHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPg==","referencesHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":59649,"nextInTopic":59651,"prevInTime":59649,"nextInTime":59651,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"My life and my children s lives and my husband s life are each filled with engagements and interests and activities that we enjoy or attempt to enjoy. But they","messageBody":"<div id=\"ygrps-yiv-1012775567\">My life and my children&#39;s lives and my husband&#39;s life are each filled with <br/>\nengagements and interests and activities that we enjoy or attempt to enjoy. But <br/>\nthey aren&#39;t necessarily huge and mostly they don&#39;t look much like your list of <br/>\nactivities. Last night at Morris dancing practice a friend and I were making <br/>\nmouth music. Linnaea thought it was funny and perhaps a bit irreverent, but it <br/>\nwas a slow moment and we were finding engagement with what we had. <br/>\n<br/>\n<br/>\n<br/>\nI find your day&#39;s plan fascinating. It seems to be so very much a Steiner image <br/>\nof the world of engagement and education. It is so at odds with my day to day. I <br/>\nam assuming that you have younger children, maybe because what you picture seems <br/>\nlike a still life with small children and not a life with older children. Not <br/>\nthat at 13 and 10 Simon or Linnaea don&#39;t like walking in the woods or finding <br/>\nhedgehogs to fatten to get through the winter, but that it feels more like a <br/>\nmoulded childhood. It also feels very, very scheduled. <br/>\n<br/>\n<br/>\nIt&#39;s 8:52 am here, now. I am sitting on the couch with the dog and Simon and <br/>\nLinnaea are sleeping. They probably won&#39;t be up &#39;til 10:30 or 11 or so. There <br/>\nwon&#39;t be a shared and healthy breakfast. I&#39;ll have something soon and then I&#39;ll <br/>\nfix them things as they require them, or a bit before. Simon will probably watch <br/>\nvideos on youtube for a bit, or work on his Minecraft world. Linnaea may play a <br/>\ngame with me, like cribbage or bananagrams, or she may check in on her wiki <br/>\ngroup about Warrior Cats. David will get home from work today around noon and he <br/>\nand I or he and I and Linnaea or he and I and Linnaea and Simon will go into <br/>\ntown to get wine ingredients and a few sewing notions I need and other little <br/>\nodds and ends. When we get back home it will be time to go to the nearby fen to <br/>\nwalk the dog. Linnaea likes to come along, although she&#39;s been down with a <br/>\nlingering flu so may or may not. A stop at the butcher&#39;s for pet food and home <br/>\nagain. And then we&#39;ll be in for the rest of the day. Food will happen at varying <br/>\npoints during the day according to need. Oh and dinner. We tend to all eat <br/>\ndinner at the same time, even if it isn&#39;t the same food. Tonight&#39;s pizza, so I <br/>\nneed to start the dough as soon as I&#39;m done with this e-mail. But that&#39;s <br/>\nprobably a pretty average day for us. <br/>\n<br/>\n<br/>\nHowever there are a fair number of things that disappear in the list that can&#39;t <br/>\nbe predicted reliably. There will be conversations all through the day. Jokes <br/>\nand ideas and information and discussions. We&#39;ll watch the IT crowd and maybe an <br/>\nepisode of Xena in the evening. I&#39;ll practice ukulele and maybe sew up a pair of <br/>\ntrousers and a shirt. There is a felting project I need to get around to doing <br/>\nto replace a scarf I mailed that never arrived. Both Simon and Linnaea played a <br/>\npart in the original creation so I&#39;m hoping they&#39;ll be willing to do so with the <br/>\nremake. I don&#39;t know if I&#39;ll get around to that today. There will be <br/>\nconversations about the cats about the dog about the fish about whatever. There <br/>\nwill be a chase around the house at some point in the day. There will be cuddles <br/>\nand play and connection. And tea. <br/>\n<br/>\n<br/>\nAs I write it out it feels of halcyon moments. Of learning all the time. When <br/>\nthey were younger it was different, but still of the same connection and <br/>\nenjoyment. There was much more movement out and about and in and around. But we, <br/>\neach of us, tend to be more homebody than intrepid explorer. There are moments <br/>\nof stumbling across amazing things, like the day at the skate park where we saw <br/>\nichneumon wasps mating who we&#39;d seen in different incarnations as their larval <br/>\nform parasitized the ladybirds that Linnaea had collected from the front of the <br/>\ngarden and put in our window box of cilantro. There was the time at a pond where <br/>\nwe saw wolf spiders carrying their babies on their backs and I dropped the phone <br/>\nin the water. Fortunately there was a kind stranger with a net who helped me <br/>\nretrieve it and a few days drying seemed to bring it back. Or the glorious still <br/>\ntold story of keeping a pond full of overly amorous mallards at bay with a <br/>\ncouple of potato guns while the female duck with the bloodied back of her head <br/>\nfound a place to hide. <br/>\n<br/>\n<br/>\nThose moments are like comparing modern art with the art from previous <br/>\ngenerations; only the bigger and bolder pieces are writ large on your memory. <br/>\nThe real stuff, the day to day stuff is the smaller moments. The sitting still <br/>\nand playing with Barbies, the learning how to play on a gameboy advance and <br/>\nreading every word on pokemon gold or silver, the face painting, the baths with <br/>\nall the toys, the hours and hours at Toys R&#39; Us just wandering and looking and <br/>\ndiscovering what it is to enjoy patience. B&#39;damen battles with blocks and action <br/>\nfigures, game after game of Pokemon the board game. Lots of food, lots of drink, <br/>\nlots of care and comfort and love. Those moments make the bigger feeling moments <br/>\nmore likely to happen with everybody enjoying them. Simon has never been <br/>\nterribly keen to go for walks. But by having his desire to stay home respected <br/>\nwhen he does decide to come along for a walk he really enjoys them. <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;i keep thinking a &quot;good&quot; curriculum to touch upon everyday could be a  good tool <br/>\n&gt;&gt;to help create an enriched and stimulating environment, at  least to start while <br/>\n&gt;&gt;we deschool and slowly move away from the need for  structure...<br/>\n </span></blockquote>&lt;&lt;<br/>\n<br/>\nDeschooling doesn&#39;t work until you let go of structure. Early days unschooling <br/>\nis about learning how to see learning in all things and if you are still looking <br/>\nto the structure of curricula it will be very, very difficult to grasp the <br/>\nfundamentals of unschooling. Having go to ideas of things to do of engagements <br/>\nto offer is a good thing, but having those things be about education or a <br/>\npassing on of pieces of specific knowledge it won&#39;t help you to see the glorious <br/>\nworld of unschooling. Those things are best if they are just kind of a fun thing <br/>\nto do in a moment of nothing much going on. Learning will happen. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":67727291,"authorName":"wtexans","from":"&quot;wtexans&quot; &lt;wtexans@...&gt;","profile":"wtexans","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: too boring to unschool?","postDate":"1297411672","msgId":59649,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMnFvbytqdjZvQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":59648,"nextInTopic":59650,"prevInTime":59648,"nextInTime":59650,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"===i want to do other things than be with my kids all the time=== But unschooling IS about being with your kids!! If you want to do other things than be with","messageBody":"<div id=\"ygrps-yiv-575506279\">===i want to do other things than be with my kids all the time===<br/>\n<br/>\nBut unschooling IS about being with your kids!! If you want to do other things than be with your kids, that&#39;s a darn big hurdle in the ability to unschool.<br/>\n<br/>\n<br/>\n===don&#39;t think our day to day life is very interesting or stimulating or enriched..... and i am not sure how motivated or capable i am to make it that way===<br/>\n<br/>\nYou&#39;re not sure how motivated you are to make life interesting and stimulating for your kids???<br/>\n<br/>\nUnschooling should be more interesting than being in school. If you&#39;re not motivated to make that happen, and if you&#39;re not interested in being with your kids a lot, then school might be a better choice for your family. Unschooling&#39;s not for every family.<br/>\n<br/>\n<br/>\n===i keep thinking a &quot;good&quot; curriculum to touch upon everyday could be a good tool to help create an enriched and stimulating environment, at least to start while we deschool and slowly move away from the need for structure===<br/>\n<br/>\nDeschooling and using a curriculum don&#39;t go hand in hand. You can&#39;t deschool if you&#39;re holding onto schooly ways of thinking and living.<br/>\n<br/>\nI like this quote from Sandra&#39;s deschooling page (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/deschooling)\">http://sandradodd.com/deschooling)</a>: &quot;Just stop. Stop thinking schoolishly. Stop acting teacherishly. Stop talking about learning as though it&#39;s separate from life.&quot;<br/>\n<br/>\nJust BE with your kids. Let go of the many (and there are a lot!!) expectations you have about how life &quot;should&quot; be, because if you don&#39;t you will be disappointed and frustrated and angry when what your kids want to do doesn&#39;t jive with the expectations you have of what constitutes an &quot;interesting, stimulating, and interesting&quot; life.<br/>\n<br/>\nI like this quote by Robyn Coburn on the Expectations page on Sandra&#39;s site (<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/expectations)\">http://sandradodd.com/expectations)</a>: &quot;Expectations can get in the way of seeing what is really happening.&quot; If you&#39;re focused on the list of expectations you have, of what you think an interesting life should be, you won&#39;t notice what interests your kids and you won&#39;t be able to build on those interests.<br/>\n<br/>\nHow old are your kids, by the way?<br/>\n<br/>\nGlenda</div>","specialLinks":[]},{"userId":416377114,"authorName":"Rebecca, Portland Green Parenting","from":"&quot;Rebecca, Portland Green Parenting&quot; &lt;rebecca@...&gt;","profile":"rubixscuba","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"too boring to unschool?","postDate":"1297407408","msgId":59648,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGlqMm1qZytrZXB0QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":59649,"prevInTime":59647,"nextInTime":59649,"topicId":59648,"numMessagesInTopic":0,"msgSnippet":"hi, i m new here! i have been immersing myself in sandra dodd s website (thank you!) and i keep finding myself returning to the idea that children *will* learn","messageBody":"<div id=\"ygrps-yiv-953363723\">hi, i&#39;m new here!<br/>\n<br/>\ni have been immersing myself in sandra dodd&#39;s website (thank you!) and i keep finding myself returning to the idea that children *will* learn (of course they will!) if they are in an enriched and stimulating environment surrounded by interesting and interested people.<br/>\n<br/>\nthis has brought up a huge fear and feeling of inadequacy. it&#39;s a bit embarrassing to admit, but don&#39;t think our day to day life is very interesting or stimulating or enriched..... and i am not sure how motivated or capable i am to make it that way!<br/>\n<br/>\ni am probably totally romanticizing the idea of home or unschooling, but i imagine things like:<br/>\n- making a healthy made from scratch breakfast together in the mornings, eating at the table as a family and talking about the day to come<br/>\n- going for a hike or nature walk or working in the garden or even just going to the park and slowing down the pace enough to discover interesting bugs, rocks, flowers and other little things we so commonly don&#39;t notice<br/>\n- having instruments at home, playing music, going to concerts and performances and being exposed to a range of different styles of music from classical to modern to world music<br/>\n- going to museums and keeping up with art and scientific discoveries<br/>\n- reading books, watching movies and discussing ideas! just discussing things together would be so cool!<br/>\n- cooking dinners together and eating at the table again, together, and talking about things we enjoyed<br/>\n- finding other common interests and exploring them together, crafting, beading, birding, magic, whatever it may be...<br/>\n- meeting interesting people, going to lectures, doing workshops, trying things on for size, getting inspired to think in new ways...<br/>\n<br/>\nof course we do a little bit of all of this (did i mention i am new here, i.e. we are not an unschooling family), so maybe it&#39;s the &quot;school&quot; in me that is telling me it needs to be a steady sustained effort (like a regular schedule) or else it&#39;s not &quot;good enough,&quot; but this seems really unattainable to me. <br/>\n<br/>\ni keep coming up with excuses for why i can&#39;t do these things... there aren&#39;t enough hours in the day, i want to do other things than be with my kids all the time, it&#39;s too hard to get all 3 kids to sit down together for a meal or activity, everyone enjoys different things, i am too tired, it&#39;s too expensive, it&#39;s too far away, i need to work etc etc...<br/>\n<br/>\nanyone else ever fear that they were too boring (or too limited in resources) to unschool? i keep thinking a &quot;good&quot; curriculum to touch upon everyday could be a good tool to help create an enriched and stimulating environment, at least to start while we deschool and slowly move away from the need for structure...<br/>\n<br/>\nthoughts?</div>","specialLinks":[]}],"prevTopicId":59129,"nextTopicId":59753}}