{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Trusting Our Children and Trusting Other People With Our Children","postDate":"1363060244","msgId":70917,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtobThtaytqdWE3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PENBRWhNejVMVTdGUFVBZEF2S1JYbnREODctNEdjeFZCNE1Lem5WM25qMzJ1SE9vQW9oZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":70853,"nextInTopic":0,"prevInTime":70916,"nextInTime":70918,"topicId":70839,"numMessagesInTopic":0,"msgSnippet":"I ve been thinking about this for the last few days and I think it just comes down to letting go at this point.  Your responses reassured me, because we have","messageBody":"<div id=\"ygrps-yiv-1711135867\">I&#39;ve been thinking about this for the last few days and I think it just comes down to letting go at this point.  Your responses reassured me, because we have prepared her well.  She knows about screaming as loud as she can, and that there&#39;s no need to be polite to anyone she&#39;s uncomfortable around.  It was good to be reminded that it&#39;s not usually strangers that kids are in danger from, but friends and family.  She does take the cell phone when she walks to the mailbox, so she can take it to the store.  <br/>\n<br/>\nShe hasn&#39;t actually walked to the mailbox much (at all? Can&#39;t remember.) in the last few months because it&#39;s been so cold.  She went today and even though I was ok with it a few months ago, I was even more comfortable with it today.  It&#39;s amazing what a few months can do for their growth and maturity!  <br/>\n<br/>\nThe walk today prompted her to ask me again about walking further.  I&#39;ll have to talk to my husband, since he is usually more concerned about these things than I am.  I will share the wisdom in this thread with him!<br/>\n<br/>\nEmily</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trusting Our Children and Trusting Other People With Our Children","postDate":"1362773290","msgId":70853,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEE1QzY3NkYwLUIzNTctNDRCMS1BRkFFLUQ2Mjc3MDc1NUQ2NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzNjI3Njg4ODEuOTgzMTQuWWFob29NYWlsTmVvQHdlYjE2MTgwMi5tYWlsLmJmMS55YWhvby5jb20+","referencesHeader":"PGtoYzF0bit0dHVnQGVHcm91cHMuY29tPiA8MTM2Mjc2ODg4MS45ODMxNC5ZYWhvb01haWxOZW9Ad2ViMTYxODAyLm1haWwuYmYxLnlhaG9vLmNvbT4="},"prevInTopic":70852,"nextInTopic":70917,"prevInTime":70852,"nextInTime":70854,"topicId":70839,"numMessagesInTopic":0,"msgSnippet":"-=-But I would definitely make sure she was prepared and had Tools--i.e. scenarios (like the one Sandra suggested), knowledge of what to do if she does get in","messageBody":"<div id=\"ygrps-yiv-1507688380\">-=-But I would definitely make sure she was prepared and had Tools--i.e. scenarios (like the one Sandra suggested), knowledge of what to do if she does get in a situation, a cell phone (or even walkie-talkies?), etc.-=-<br/>\n<br/>\nOne thing I did avoid was describing what evils could befall a child who was taken by a criminal adult.  Some parents describe molestation or rape to little children, and I think that&#39;s a horrible thing for them to do.<br/>\n<br/>\nMy mom warned us about public toilets, such as the outhouses in national parks.  When camping, sometimes it can be a walk to the toilet. So she would make us go in pairs (there were four of us--my sister and two cousins, all within four years of age), and she did tell us that once a man grabbed a little boy in a public outhouse and cut his penis off.  As none of us had a penis, we didn&#39;t know how that translated, but it was like a boogey-man story to scare us.     <br/>\n<br/>\nI don&#39;t ever remembering her getting up and going to the outhouse with any of us.  I don&#39;t have very fond memories of my mother and her too-much-rude-noise, too-little-actual-attention.  <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":383312070,"authorName":"Cara Barlow","from":"Cara Barlow &lt;carabarlow@...&gt;","profile":"crbrlw","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trusting Our Children and Trusting Other People With Our Children","postDate":"1362771907","msgId":70852,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRWhNejVMVTdGUFVBZEF2S1JYbnREODctNEdjeFZCNE1Lem5WM25qMzJ1SE9vQW9oZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGtoYzF0bit0dHVnQGVHcm91cHMuY29tPg==","referencesHeader":"PGtoYzF0bit0dHVnQGVHcm91cHMuY29tPg=="},"prevInTopic":70851,"nextInTopic":70853,"prevInTime":70851,"nextInTime":70853,"topicId":70839,"numMessagesInTopic":0,"msgSnippet":"I live in a small New England town, my neighborhood has sidewalks, and we re about two blocks from the town center, where there s an ice cream stand, the","messageBody":"<div id=\"ygrps-yiv-508813688\">I live in a small New England town, my neighborhood has sidewalks, and<br/>\nwe&#39;re about two blocks from the town center, where there&#39;s an ice cream<br/>\nstand, the library, a candy store, parks and more.<br/>\n<br/>\nStarting when my daughters were about 7 or 8 I let them ride their bikes<br/>\naround our neighborhood without me. They had ridden around our streets<br/>\n*many* times with me, so knew their way and how to be safe.<br/>\n<br/>\nI wasn&#39;t completely comfortable with them being out on their own, so I<br/>\nbought an inexpensive sets of walkie-talkies. When they went out on their<br/>\nbikes, I asked that they each take a walkie talkie with them and I kept one<br/>\ntoo.<br/>\n<br/>\nPrior to leaving the house we&#39;d confirm that we were all had working<br/>\nbatteries and that we were on the same channel. If I started feeling<br/>\nworried, I checked in with them through the walkie talkies. If they needed<br/>\nme, they let me know. Sometimes we&#39;d just say silly things over the walkie<br/>\ntalkie to make each other laugh.<br/>\n<br/>\nStarting when my oldest was around 10 years old I&#39;d give her money and she<br/>\nand her friends would walk down to the ice cream stand  or the park by<br/>\nthemselves, again with the walkie talkies.<br/>\n<br/>\nMy husband got each of our daughters a cell phone for their 13th birthday,<br/>\nand gradually the walkie talkies were forgotten.<br/>\n<br/>\nWe used those walkie talkies for years. They were a lot of fun! They&#39;re<br/>\nstill knocking around the house somewhere.<br/>\n<br/>\nBest wishes, Cara<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":154304522,"authorName":"Meredith","from":"&quot;Meredith&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: Trusting Our Children and Trusting Other People With Our Children","postDate":"1362769062","msgId":70849,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtoZGNiNis3dWpuQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGtoYzF0bit0dHVnQGVHcm91cHMuY29tPg=="},"prevInTopic":70844,"nextInTopic":70851,"prevInTime":70848,"nextInTime":70850,"topicId":70839,"numMessagesInTopic":0,"msgSnippet":"... ************** You don t know he was 7 - he might have been small for his age. And you don t know how well he knows the area. It may be that his mom or dad","messageBody":"<div id=\"ygrps-yiv-177905377\">&quot;emstrength3&quot; &lt;emstrength@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; A few days ago, my whole family was in the car and my kids noticed a boy about my oldest daughter&#39;s age (7) riding his bike down the main street of our town by himself.  We all agreed that we thought he was too young to be doing that<br/>\n </span></blockquote>**************<br/>\n<br/>\nYou don&#39;t know he was 7 - he might have been small for his age. And you don&#39;t know how well he knows the area. It may be that his mom or dad Has watched him do it half a dozen times, that some of the local shopkeepers know to keep an eye out for him. Or he might be off without permission - I did a lot of that as a kid, snuck off with my bike or ran off into the woods without telling anyone. When Ray was 7 he would sometimes walk to a neighbor&#39;s house - country neighbors a mile through the woods, or ride his bike down to the end of our road and back - about a mile and a quarter. He was older before we&#39;d let him walk by himself visiting relatives in Providence, but he hadn&#39;t been growing up there and didn&#39;t know the neighborhoods. It bothered George, who had grown up there, that his son couldn&#39;t walk a few blocks without getting confused but he could navigate his way through the woods without any trouble. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; That got my husband and I talking about how we trust our kids, we just don&#39;t trust other people.<br/>\n </span></blockquote>***************<br/>\n<br/>\nDo your kids want you to trust other people in the way you mean? If they want that trust, can you help them learn the skills they need to be safe? That might mean finding other people to help out. When my kids want to explore towns and cities I&#39;m not familiar with, I look for someone around their age or a little older to help. With Mo that has meant hanging out with a group of kids in a local town who all more-or-less know the territory and can advise her kid-style (don&#39;t do that, it&#39;s dumb!) and hanging out with families who have very different lifestyles than ours. With Ray it has meant turning him loose in a big city with a buddy, some cash, cell phones, and skateboards so he could get a tour and advice from another teen: dude, you do that again and I&#39;m ditching you. In a sense I&#39;ve trusted other people to help my kids in situations where I don&#39;t have enough information to give competent advice and support. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I think about the motel that is right there and how easy it would be for someone from out of town to grab her. <br/>\n </span></blockquote>*************<br/>\n<br/>\nStatistically, she&#39;s in more danger from a family member or close friend. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I think about the teenagers that go to that store that might harass her.  Or a million other possible scenarios that involved other people. <br/>\n </span></blockquote>**************<br/>\n<br/>\nWhat do other kids in the area do? Is there a kid who&#39;s a year or two older than yours who can walk with her a few times, show her the ropes, as it were? If not, walk with her a few times and &quot;think out loud&quot; a bit - how do you change your behavior when you&#39;re in a hostile environment? Do you know how to adjust your posture etc to minimize negative attention? If not, that&#39;s probably a big part of why you&#39;re worried - you want your kids to learn something you don&#39;t know! So what are steps you could take to learn those things together so you can All be safer?<br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":357463950,"authorName":"Trista Teeter","from":"Trista Teeter &lt;tristaleann@...&gt;","profile":"tristaleann@ymail.com","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trusting Our Children and Trusting Other People With Our Children","postDate":"1362768881","msgId":70851,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzNjI3Njg4ODEuOTgzMTQuWWFob29NYWlsTmVvQHdlYjE2MTgwMi5tYWlsLmJmMS55YWhvby5jb20+","inReplyToHeader":"PGtoYzF0bit0dHVnQGVHcm91cHMuY29tPg==","referencesHeader":"PGtoYzF0bit0dHVnQGVHcm91cHMuY29tPg=="},"prevInTopic":70849,"nextInTopic":70852,"prevInTime":70850,"nextInTime":70852,"topicId":70839,"numMessagesInTopic":0,"msgSnippet":"I follow the blog Free Range Kids (ironically, addressed in another topic), and while I don t agree with a lot of the author s views and opinions, I do think","messageBody":"<div id=\"ygrps-yiv-691952782\">I follow the blog Free Range Kids (ironically, addressed in another topic), and while I don&#39;t agree with a lot of the author&#39;s views and opinions, I do think she has some interesting thoughts on this type of thing--how fear-based our society has become (much of which has been created by media), and has a page with all sorts of statistics showing that across the board crime is down (<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.freerangekids.com/crime-statistics/)\">http://www.freerangekids.com/crime-statistics/)</a>.  It seems like kidnappings, etc. happen all the time, but a lot of that is because we have access to that information as it comes right to us from all over the state/country/world in the blink of an eye with the technology we have.  <br/>\n<br/>\nThat being said, I too have a 7 year old daughter and you describing what your daughter wants to do brings ME anxiety!  But that&#39;s what it is, mine.  No need to put that on her.  But I would definitely make sure she was prepared and had Tools--i.e. scenarios (like the one Sandra suggested), knowledge of what to do if she does get in a situation, a cell phone (or even walkie-talkies?), etc.<br/>\n<br/>\nGood luck!<br/>\nTrista<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\n From: emstrength3 &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:emstrength@...\">emstrength@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a> <br/>\nSent: Thursday, March 7, 2013 11:53 PM<br/>\nSubject: [AlwaysLearning] Trusting Our Children and Trusting Other People With Our Children<br/>\n <br/>\n<br/>\n  <br/>\nA few days ago, my whole family was in the car and my kids noticed a boy about my oldest daughter&#39;s age (7) riding his bike down the main street of our town by himself.  We all agreed that we thought he was too young to be doing that (unless maybe mom was parked right up the street or some other circumstance we couldn&#39;t see).<br/>\n<br/>\nThat got my husband and I talking about how we trust our kids, we just don&#39;t trust other people.  For example, all the choices we make about unschooling, food, tv, bed times and even little things like letting them jump off the porch railing are all because we trust them and we are there to help them if they need it.<br/>\n<br/>\nHowever, when other people are involved whether it&#39;s directly (letting someone babysit them) or indirectly (letting them walk down the street alone) we are FAR more protective. <br/>\n<br/>\nOur 7 year old is starting to want to do more things alone though.  Last year, we started letting her walk to the mailbox of our mobile home park by herself.  This means her being gone for about 10 minutes, crossing a (dead end, residential) street, and being completely out of sight of our house. <br/>\n<br/>\nAbout another block away is a store that she&#39;s expressed interest in walking to by herself.  I trust HER to be careful going across the street, to come straight home, to be polite to the cashier, to be responsible in the store, etc.  But then I think about the motel that is right there and how easy it would be for someone from out of town to grab her.  I think about the teenagers that go to that store that might harass her.  Or a million other possible scenarios that involved other people. <br/>\n<br/>\nI&#39;ve always enjoyed letting my kids be as independent as they want to be, but now that my oldest is old enough that independent is starting to mean out of my sight/hearing and protection, I&#39;m having a harder time with it. <br/>\n<br/>\nI&#39;d love to hear how other unschoolers have thought through this as their kids reached this point. <br/>\n<br/>\nEmily <br/>\n<br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Trusting Our Children and Trusting Other People With Our Children","postDate":"1362758431","msgId":70844,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI5QzcwM0MxLTk4NjctNDVDMC05OUM5LTI5OTQ2QTU3RjY5MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGtoYzF0bit0dHVnQGVHcm91cHMuY29tPg==","referencesHeader":"PGtoYzF0bit0dHVnQGVHcm91cHMuY29tPg=="},"prevInTopic":70839,"nextInTopic":70849,"prevInTime":70843,"nextInTime":70845,"topicId":70839,"numMessagesInTopic":0,"msgSnippet":"-=-I ve always enjoyed letting my kids be as independent as they want to be, but now that my oldest is old enough that independent is starting to mean out of","messageBody":"<div id=\"ygrps-yiv-867444652\">-=-I&#39;ve always enjoyed letting my kids be as independent as they want to be, but now that my oldest is old enough that independent is starting to mean out of my sight/hearing and protection, I&#39;m having a harder time with it. <br/>\n<br/>\n-=-I&#39;d love to hear how other unschoolers have thought through this as their kids reached this point. -=-<br/>\n<br/>\nI reminded myself of kids who walk to school alone, or with just another child or two.  <br/>\nI reminded myself of times I was left alone or chose to do something alone when I was young.<br/>\n<br/>\nWhen Holly was young she was a little small for her age, and when she wanted to walk to a neighbor&#39;s house, when she was seven or eight or nine, or go with the dog to the park, I would tell her jokingly (light tone of voice, but serious intent) that if anyone bothered her or scared her, to scream her loudest scream, and they would let her go.  She did have a scream on her.  <br/>\n<br/>\nLetting them know they don&#39;t need to be polite if someone scares time might be helpful.  <br/>\n<br/>\nMy mom told me, when I was young, that if someone was ever following me or intimidating me when I was out in public I should just walk up to the nearest house with confidence, as though I lived there, and he would go away.  And if someone came to the door I could say I was afraid and ask them to let me in and call the police.  That will work better in some towns than others.  <br/>\n<br/>\nCellphones make life different.  Even though kids are grown, there can be dangerous or scary situations (seeming scary to parents, anyway).  <br/>\n<br/>\nBoth Marty and Holly are taking classes at the community college.  They each have a sweetie who went to school and is used to school vacations.  To my kids, they&#39;re new.  So spring break is here.  Each is going on a road trip with the girlfriend/boyfriend.  Holly and Will are going to visit friends near Los Angeles, near San Francisco, and to see Will&#39;s brother who&#39;s going to college in far northern California.    <br/>\n<br/>\nMarty and Ashlee are going to drive through Nevada and Utah, doing touristy things.  Yesterday they talked about taking all state highways and backroads when they could, and not interstates.  My first thought was &quot;that&#39;s dangerous&quot; and &quot;what if you break down?&quot;  But they have cellphones and I relaxed before I said anything.  <br/>\n<br/>\nOne thing that&#39;s a possibility with a cellphone and a seven year old is to keep the line open and talk to her while she goes.  <br/>\nAnd kind of like walking up to a house as though you live there, maybe talking to a cellphone as though your mom is in there, even if she&#39;s not, would be a kind of safety move, in some cases.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":457058835,"authorName":"emstrength3","from":"&quot;emstrength3&quot; &lt;emstrength@...&gt;","profile":"emstrength3","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"3"},"subject":"Trusting Our Children and Trusting Other People With Our Children","postDate":"1362725623","msgId":70839,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGtoYzF0bit0dHVnQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":70844,"prevInTime":70838,"nextInTime":70840,"topicId":70839,"numMessagesInTopic":0,"msgSnippet":"A few days ago, my whole family was in the car and my kids noticed a boy about my oldest daughter s age (7) riding his bike down the main street of our town by","messageBody":"<div id=\"ygrps-yiv-704790155\">A few days ago, my whole family was in the car and my kids noticed a boy about my oldest daughter&#39;s age (7) riding his bike down the main street of our town by himself.  We all agreed that we thought he was too young to be doing that (unless maybe mom was parked right up the street or some other circumstance we couldn&#39;t see).<br/>\n<br/>\nThat got my husband and I talking about how we trust our kids, we just don&#39;t trust other people.  For example, all the choices we make about unschooling, food, tv, bed times and even little things like letting them jump off the porch railing are all because we trust them and we are there to help them if they need it.<br/>\n<br/>\nHowever, when other people are involved whether it&#39;s directly (letting someone babysit them) or indirectly (letting them walk down the street alone) we are FAR more protective.  <br/>\n<br/>\nOur 7 year old is starting to want to do more things alone though.  Last year, we started letting her walk to the mailbox of our mobile home park by herself.  This means her being gone for about 10 minutes, crossing a (dead end, residential) street, and being completely out of sight of our house.  <br/>\n<br/>\nAbout another block away is a store that she&#39;s expressed interest in walking to by herself.  I trust HER to be careful going across the street, to come straight home, to be polite to the cashier, to be responsible in the store, etc.  But then I think about the motel that is right there and how easy it would be for someone from out of town to grab her.  I think about the teenagers that go to that store that might harass her.  Or a million other possible scenarios that involved other people.    <br/>\n<br/>\nI&#39;ve always enjoyed letting my kids be as independent as they want to be, but now that my oldest is old enough that independent is starting to mean out of my sight/hearing and protection, I&#39;m having a harder time with it. <br/>\n<br/>\nI&#39;d love to hear how other unschoolers have thought through this as their kids reached this point. <br/>\n<br/>\nEmily</div>","specialLinks":[]}],"prevTopicId":70903,"nextTopicId":70926}}