{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":0,"authorName":"David Albert","from":"David Albert &lt;shantinik@...","replyTo":"LIST","senderId":"Qt8VBrbVovMBbvkE0yQ_wBS7xRCWyPt8e3HebF3lgSE8gPahit7eUoDDMJPr1vHWPS2_LJpGC_Dv5HdpZWpzYfOe_y3v4b2dxlq5blg","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Adventures in India - needs explained","postDate":"940561237","msgId":3989,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNjQuMzk4OS45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":3985,"nextInTopic":0,"prevInTime":3988,"nextInTime":3990,"topicId":3985,"numMessagesInTopic":0,"msgSnippet":"Dear Jacli/Sessuale -- Sounds like a great adventure you re off on!  Tell me more about the business. Also, when are you going and where?  (India s a BIG","messageBody":"<div id=\"ygrps-yiv-750834573\">Dear Jacli/Sessuale --<br/>\n<br/>\nSounds like a great adventure you&#39;re off on!  Tell me more about the<br/>\nbusiness.<br/>\n<br/>\nAlso, when are you going and where?  (India&#39;s a BIG country, with major<br/>\nclimatic differences from one end to the other).  Bangalore is the<br/>\nSilicon Valley of India -- very, very modern (except for the train<br/>\nstation!) -- almost unrecognizable from what it is was 20 years ago.<br/>\nThe best Bharatnatyam people are in Chennai (Madras), and I can probably<br/>\npoint you in the right direction.<br/>\n<br/>\nBut give me some more information, and I&#39;ll be happy to do the needful!<br/>\n(most of my homeschooling friends are in rural Gujarat, about 10 hours<br/>\nor so north of Gujarat).  I also know of some folks who have formed kind<br/>\nof a homeschooling environmental education center about 4 1/2 hours from<br/>\nBombay -- I haven&#39;t been there, but could probably hook you up with<br/>\nfolks in India who could come up with the address.)<br/>\n<br/>\nHow long will you be there?  I could send you to meet my mother in the<br/>\nfar south, if you really want an adventure (she also cares for about 108<br/>\nfoster kids, 46 at my house.)<br/>\n<br/>\nDavid<br/>\n<br/>\n<br/>\nAnony wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; From: &quot;Anony&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:primo@...\">primo@...</a>&gt;<br/>\n&gt;<br/>\n&gt; Hi David!  Jacli/Sessuale here :)<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n </span></blockquote>--<br/>\nJoseph Chilton Pearce calls &quot;And the Skylark Sings with Me: Adventures<br/>\nin Homeschooling and Community-Based Education&quot; &quot;the definitive work on<br/>\nhomeschooling.&quot; To read a sample chapter, reviewers&#39; comments, or the<br/>\nforeword, and for ordering info., visit my website at<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.skylarksings.com\">http://www.skylarksings.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"Anony","from":"&quot;Anony&quot; &lt;primo@...","replyTo":"LIST","senderId":"_VkldMiHTGDpY4JBxj7YnUy4TnXIjmQaa5ZYzcLy9AxC_LVEdm4-PJQhukFS2Zx8r7TXJz3yx_CQ0YNuoOKUKk5gCA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Adventures in India - needs explained","postDate":"940553007","msgId":3985,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy4yNjQuMzk4NS45NTkyNjk3NDNAZUdyb3Vwcy5jb20+"},"prevInTopic":0,"nextInTopic":3989,"prevInTime":3984,"nextInTime":3986,"topicId":3985,"numMessagesInTopic":0,"msgSnippet":"Hi David!  Jacli/Sessuale here :) How wonderful! I m interested in any and all information:  climate tips (for Bombay), other homeschooling folks to meet and","messageBody":"<div id=\"ygrps-yiv-1042355808\">Hi David!  Jacli/Sessuale here :)<br/>\n<br/>\nHow wonderful! I&#39;m interested in any and all information:  climate tips (for Bombay), other homeschooling folks to meet and network with  and since my daughter is a student of Chandralaka (Bharat Natyam) anything that you think might be of interest.  My company has just fnished negotiations with the Indian government to open in India.  We actually have several warehouses and three distribution centers.  Our goal is to bring good nutrition to India, to make it accessible to each and every individual in the entire country!  Our first grand opening will be November 10, in Bangalore, unfortunately I don&#39;t think I&#39;ll make it there in time.  But we have two other grand openings coming up, one in Mumbai/ Bombay so that&#39;s the one I&#39;m hoping to make.  <br/>\n<br/>\nWith my business I really could go at any time, but my husband is a computer programming consultant so his schedule is not quite so easily intercepted.  So our actual date of departure is still in the air.  But I&#39;m so excited!  I just can&#39;t wait! I&#39;ve never been to India before and  we plan to make it a family business/holiday.  We want to meet the people who will actually be working with our products and see the places we have read about and talked about for so long.  Our agreement with the Indian government stipulates that only resident or non-resident people of Indian descent will be allowed to actually advertise for our incredible nutritional products or work in our warehouses, etc, so we are looking forward to meeting the men and women who will help us carry out our mission!<br/>\n<br/>\n<br/>\nAlso, as you can imagine whenever you are speaking about opening up a business in a country the size of India you draw a lot of people who see only the dollar signs.  I am looking for people who have a genuine care about the country and it&#39;s people.  These are the people I want to work with.  So if you know anybody who lives in India or is of Indian descent, is a good and decent person who would like to earn a few extra thousand dollars a month doing something they can be proud of maybe you could send them my way? They can call me at home 603-537-0825<br/>\n<br/>\nWell, looking forward to talking to you!<br/>\n<br/>\nTake care, Jacli<br/>\n<br/>\n*********** REPLY SEPARATOR  ***********<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 10/20/99 at 10:15 PM David Albert wrote:<br/>\n<br/>\n&gt;From: David Albert &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:shantinik@...\">shantinik@...</a>&gt;<br/>\n&gt;<br/>\n&gt;I can help with that one!  I have a second home in the far south of<br/>\n&gt;India, north of Madurai, an adopted daughter from Bombay, and friends<br/>\n&gt;all over the place (and my adopted parents too -- I adopted them.)  I<br/>\n&gt;also spoke to an incipient homeschooling group in Gujarat, India, last<br/>\n&gt;September.  So if you e-mail me what you want to know (privately?  will<br/>\n&gt;the list want to hear all of this?), I&#39;ll do what I can.<br/>\n&gt;<br/>\n&gt;David Albert<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;Anony wrote:<br/>\n&gt;<br/>\n&gt;&gt;  Hi all, Sessuale here :)I am planning to go to India soon and was<br/>\n&gt;&gt; wondering if anyone else has been there and if so would you mind maybe<br/>\n&gt;&gt; giving me a heads up, tell me what your experience was like so I can<br/>\n&gt;&gt; prepare myself and our little one. Thanks, Sessualej<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;--<br/>\n&gt;My book &quot;And the Skylark Sings with Me: Adventures in Homeschooling and<br/>\n&gt;Community-Based Education&quot; is NOW OFF THE PRESS.  To read a sample<br/>\n&gt;chapter, reviewers&#39; comments, or the foreword, and for ordering info.,<br/>\n&gt;visit my website at <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.skylarksings.com\">http://www.skylarksings.com</a><br/>\n&gt;<br/>\n&gt;&gt;Check it out!<br/>\n&gt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> </span></blockquote></div>","specialLinks":[]}],"prevTopicId":3988,"nextTopicId":2457}}