{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"the myth of equality","postDate":"1091373822","msgId":97151,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFkNC4yNmZhOGQ5ZS4yZTNlNjRmZUBhb2wuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":97150,"nextInTime":97152,"topicId":97151,"numMessagesInTopic":0,"msgSnippet":"In a message dated 8/1/04 6:49:47 AM, danielle.conger@comcast.net writes: ","messageBody":"<div id=\"ygrps-yiv-1801984186\">In a message dated 8/1/04 6:49:47 AM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:danielle.conger@...\">danielle.conger@...</a> writes:<br/>\n<br/>\n&lt;&lt; All men weren&#39;t, in fact, created equal.  &gt;&gt;<br/>\n<br/>\nStill aren&#39;t, never could be.<br/>\n<br/>\nThe best they can hope for is equality under the law. But even then, when <br/>\nKirby went to court he was dismissed to go home by a clerk, without even having <br/>\nto stand up in front of the judge.   Why?  Because he was anglo, some would <br/>\nsay, without hesitation, I bet.   There were only two other anglos in that batch <br/>\nof 30 some people at traffic court that day, the rest were hispanic.   But <br/>\nKirby was dismissed because his offense was small (forgot to turn his headlights <br/>\non, crossing a street going three blocks from home), and...  He wore dress <br/>\npants, a shirt and a tie.  Nobody else came close.  They dressed like they were <br/>\ndressing to work in the yard or stand on a street corner and see and be seen <br/>\n(the young girls, short sleeveless tops over low hiphugger jeans as though the <br/>\nsummons had said &quot;Please, dress in crop tops and hiphuggers&quot; instead of <br/>\n&quot;appropriate dress is required&quot; or whatever it said.<br/>\n<br/>\nSo...<br/>\nJust a little respect goes a long way in legal situations.<br/>\n<br/>\nBut even before that, some are born smart, rich and good looking.  Some are <br/>\nborn base and mean, in the Shakespearean-era sense.  Poor, angry, bad genetics. <br/>\n   Those things aren&#39;t equal.<br/>\n<br/>\nA 5&#39;4&quot; man will have to have more charisma, skills, and desire to succeed <br/>\nthan a 6&#39;, broad-shouldered, pleasant-faced man of lesser intelligence and <br/>\nability.  Does that make the other humans around them horribly ignorant and <br/>\nprejudiced?<br/>\n<br/>\nThere are instincts beyond reason.   There are biological impulses, and if we <br/>\ndeny them entirely (as some people pressed others to do for a long LONG time <br/>\nin this culture, claiming humans possessed no instincts) we pretend to live <br/>\ninstead of living our own real lives from our own real selves.<br/>\n<br/>\n-=- For me rights and respect need to be<br/>\n<br/>\nmutual. I don&#39;t feel my kids gain anything by learning that they can coerce<br/>\n<br/>\nthose around them because no one will step in to coerce them out of it. I&#39;m<br/>\n<br/>\nmuch more of a &quot;your right to extend your fist stops at my face&quot; kind of<br/>\n<br/>\nperson.<br/>\n<br/>\n-=-<br/>\n<br/>\nMe too.  But I want their fist quite out of my personal space, so that I <br/>\ndon&#39;t even flinch.<br/>\n<br/>\nIf we think we shouldn&#39;t be coercive or bullying, how can we condone bullying <br/>\nin, of or among our children?  The principle that coercion isn&#39;t right would <br/>\n(for me, in the logic that has worked for me)  mean that as a parent I should <br/>\ntry to rid my home of coercive elements, and if one of my children were become <br/>\na really excellent spin-doctor/politician/leader/dictator, I would (and this <br/>\nis not theoretical in our family) counsel him/her on benevolence and <br/>\ngenerosity and not hogging the air.<br/>\n<br/>\nI wouldn&#39;t try to extinguish the behaviors, just refine them.  Those might be <br/>\nwhat takes that child far in life, when they&#39;re in an appropriate venue and <br/>\nchannelled for good.<br/>\n<br/>\nMost people are followers, not leaders.  They want to think for themselves <br/>\nonly insofar as they can choose their own leader to follow blindly.<br/>\n<br/>\nNot all are born leaders, and so not all are created equal.<br/>\n<br/>\nBut mythology (and the U.S. is steeped in eagle/flag/frontier/cowboy <br/>\nmythology) has its uses and its own realities, and destroying it completely is as bad <br/>\nas believing it all to be objective reality.<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":97053,"nextTopicId":97096}}