{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Lynda","from":"&quot;Lynda&quot; &lt;lurine@...&gt;","replyTo":"LIST","senderId":"TJgmf1l4zTknICZ0G2s_lMNjZggTQuvyShVgrzULDY2hwEyJO2Q9Jjq_paeUnPAy3aLF2sIx65WD0MMqA5K7cQpNgw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"America&#39;s New &quot;Moses&quot;","postDate":"977293452","msgId":14677,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNmIwMWMwNmE1MCQ2Y2UxMzNjMCQ3MTVkZDFkMUBsZGlvbm5vPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":14676,"nextInTime":14678,"topicId":14677,"numMessagesInTopic":0,"msgSnippet":"Guess the following makes me a prophet of some nature  since many months ago I said this was what he would do the minute he got into office if he won the","messageBody":"<div id=\"ygrps-yiv-1251830886\">Guess the following makes me a prophet of some nature &lt;g&gt; since many months<br/>\nago I said this was what he would do the minute he got into office if he won<br/>\nthe election.<br/>\n<br/>\nLynda<br/>\nIf Ignorance Is Bliss Why Aren&#39;t More People Happy?<br/>\n<br/>\nAMERICANS UNITED CRITICIZES BUSH MEETING WITH BLACK CLERGY TO DISCUSS<br/>\nTAXPAYER SUPPORT FOR RELIGIOUS MINISTRIES<br/>\n<br/>\nEffort Has The Trappings Of Political Bribery, Watchdog Group Asserts<br/>\n<br/>\nAmericans United for Separation of Church and State has criticized<br/>\nPresident-elect George W. Bush&#39;s upcoming meeting with black clergy to<br/>\ndiscuss taxpayer funding of &quot;faith-based&quot; social service programs, saying<br/>\nthe meeting looks like an effort to bribe church leaders.<br/>\n<br/>\n&quot;Bush apparently believes he can buy support in the religious community by<br/>\noffering to eviscerate the First Amendment through tax funding of religion,&quot;<br/>\nnoted Barry W. Lynn, executive director of Americans United.  &quot;This has all<br/>\nthe trappings of political bribery. The president-elect is going to learn<br/>\nthat America&#39;s religious community is not for sale.&quot;<br/>\n<br/>\nBush staffers have announced that the meeting with black clergy will take<br/>\nplace in Austin tomorrow. The move was widely interpreted as an effort by<br/>\nBush to shore up support among a constituency that voted heavily against him<br/>\non Election Day.<br/>\n<br/>\nLynn said Bush&#39;s efforts come at the expense of the First Amendment. He<br/>\nasserted that Bush&#39;s much-touted &quot;compassionate conservatism&quot; is merely a<br/>\ncode phrase for forcing taxpayers to support religious ministries that offer<br/>\nsocial services. Bush has stated repeatedly that he believes churches should<br/>\nbe able to get tax funding for these programs without watering down the<br/>\nsectarian nature of their projects.<br/>\n<br/>\nBush&#39;s gambit, Lynn asserted, is of dubious constitutionality. &quot;Bush is<br/>\nproposing an unprecedented program of government funding of religion,<br/>\ninvolving literally billions in taxpayer dollars,&quot; he said. &quot;His plan for<br/>\nthe social services would essentially merge church and state into a single<br/>\nbureaucracy that would dispense religion alongside government aid.&quot;<br/>\n<br/>\nLynn noted that Bush plans to establish an &quot;office of faith-based action,&quot; a<br/>\nbranch of his administration equivalent to a cabinet-level post, which will<br/>\ncoordinate the effort to distribute tax money to churches and other houses<br/>\nof  worship.<br/>\n<br/>\nContinued Lynn. &quot;Under this scheme, church soup kitchens would be free to<br/>\ncoerce needy people to pray before helping them. Fundamentalist groups could<br/>\nrefuse to hire Jews, Roman Catholics and atheists and still get a windfall<br/>\nin taxpayer money. There is simply no way to reconcile taxpayer-supported<br/>\nreligion with the First Amendment. One or the other must give.&quot;<br/>\n<br/>\nLynn also noted that the Bush proposal is politically unwise. A key<br/>\ncomponent of Bush&#39;s &quot;compassionate conservatism&quot; calls for government-funded<br/>\nreligious school vouchers, yet African American voters in Michigan and<br/>\nCalifornia joined all voters in those states in rejecting vouchers by wide<br/>\nmargins in  ballot referenda last month.<br/>\n<br/>\nFurthermore, exit polls conducted during the election show that Americans of<br/>\nall races and income levels favor fixing troubled public schools over<br/>\nvouchers by a margin of nearly 5 to 1.<br/>\n<br/>\nConcluded Lynn, &quot;It is alarming to me that one of the president-elect&#39;s<br/>\nfirst  official actions is an assault on the First Amendment. This is a<br/>\nclear sign  that the wall of separation between church and state is due to<br/>\nundergo sustained attack from the White House over the next four years</div>","specialLinks":[]}],"prevTopicId":14640,"nextTopicId":14681}}