{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":12,"messages":[{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: &quot;open-ended&quot; was Lego Educator sets","postDate":"1269216895","msgId":52226,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvNmNwditudDJhQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEUwRDc5OEIzLUVDRUEtNDNGOC05OTE0LTMwNUZFNTZGNEY0QkBzdXBlbm4uY29tPg=="},"prevInTopic":52223,"nextInTopic":0,"prevInTime":52225,"nextInTime":52227,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"when we first got legos for the kids, my husband and I bought the blocks that we remembered growing up. we had both played with legos alot growing up, I had","messageBody":"<div id=\"ygrps-yiv-311291322\">when we first got legos for the kids, my husband and I bought the blocks that we remembered growing up. we had both played with legos alot growing up, I had built houses for the little fisher price people I played with constantly and my husband had built rocket and planes that he found in pictures in their set of encyclopias.  so we both had our little preconceived idea of how to best play with them and we were resistent to the sets.  the boys had different ideas though and they really enjoy playing with them in all different ways.  they love the sets but put them together once,play with them awhile then all the pieces join the collective.  I see pieces i recognize in all kinds of new creations.  they use the movable pieces to put doors, guns etc on new creations that wouldnt have the option of if they had never had the sets.  i have also been looking at the motors,  but my kids do seem to do better with ones that have projects and then they go from there on their own.  i have trouble finding which ones include motors.<br/>\none thing my kids have really enjoyed lately is finding the little videos on youtube about how to build mario, bowser, link etc... We have all these little guys all over the house right now.  They then change them to fit their taste.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;open-ended&quot; was Lego Educator sets","postDate":"1269213120","msgId":52223,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk5REFDMTRFLTk3OUItNDMyMC1BRkNGLUM1MEFGNkM1NzQ1RUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEUwRDc5OEIzLUVDRUEtNDNGOC05OTE0LTMwNUZFNTZGNEY0QkBzdXBlbm4uY29tPg==","referencesHeader":"PGhvNjBwcittMHI0QGVHcm91cHMuY29tPiA8RTBENzk4QjMtRUNFQS00M0Y4LTk5MTQtMzA1RkU1NkY0RjRCQHN1cGVubi5jb20+"},"prevInTopic":52222,"nextInTopic":52226,"prevInTime":52222,"nextInTime":52224,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"-=-I suppose it s _possible_ that there are some kids whose creativity are so weak that giving them a pre-designed Lego set kills it. -=- I can t imagine that.","messageBody":"<div id=\"ygrps-yiv-1101162286\">-=-I suppose it&#39;s _possible_ that there are some kids whose creativity  <br/>\nare so weak that giving them a pre-designed Lego set kills it. -=-<br/>\n<br/>\nI can&#39;t imagine that.  If they&#39;re lacking in creativity, then a pre- <br/>\ndesigned kit will at least enable them to play with Lego!<br/>\n<br/>\nI have sewn following a pattern exactly, and changing patterns, and  <br/>\nwithout patterns.  There&#39;s a usefulness in all those things, but if I  <br/>\nwasn&#39;t able to do all of them, it wouldn&#39;t be &quot;creativity&quot; or lack of  <br/>\ncreativity, I don&#39;t think.  It might be fear, or lack of interest.   <br/>\nNot crimes.<br/>\n<br/>\nKids who are creative can hardly be stopped!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":265299176,"authorName":"k","from":"k &lt;katherand@...&gt;","profile":"katherand2003","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;open-ended&quot; was Lego Educator sets","postDate":"1269212328","msgId":52221,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDNhOTNmZmYxMTAwMzIxMTU1OHE2ZmQyYzQ4Y2tlMTU2N2M1OWVlMzhiZDBiQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PEUwRDc5OEIzLUVDRUEtNDNGOC05OTE0LTMwNUZFNTZGNEY0QkBzdXBlbm4uY29tPg==","referencesHeader":"PGhvNjBwcittMHI0QGVHcm91cHMuY29tPgkgPEUwRDc5OEIzLUVDRUEtNDNGOC05OTE0LTMwNUZFNTZGNEY0QkBzdXBlbm4uY29tPg=="},"prevInTopic":52219,"nextInTopic":52222,"prevInTime":52220,"nextInTime":52222,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"So Eric was using the directions for building Lego sets as instructions to get him started and then he reworked from there. That makes so much sense. I ve","messageBody":"<div id=\"ygrps-yiv-263260635\">So Eric was using the directions for building Lego sets as<br/>\ninstructions to get him started and then he reworked from there. That<br/>\nmakes so much sense. I&#39;ve built things and taken a piece off to put<br/>\nelsewhere to see what would happen, and Karl does that too, but I<br/>\nhaven&#39;t taken the whole thing apart and remade the whole thing. That<br/>\nshows how pre-fabs can be &quot;open-ended!&quot;<br/>\n<br/>\nI&#39;ve definitely seen people do the same thing with Barbies and other<br/>\ndolls-- take them apart and remake them in ways they weren&#39;t<br/>\n&quot;pre-fabbed&quot; for. It&#39;s what I would think of as creative for sure.<br/>\nFound art making is the same way. People mix and match machine parts<br/>\nand rebuilt them in ways that work but that they weren&#39;t originally<br/>\ndesigned for.  Fun stuff.<br/>\n<br/>\n~Katherine<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 3/21/10, Su Penn &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:su@...\">su@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt; On Mar 21, 2010, at 4:50 PM, Rebecca McClure wrote:<br/>\n&gt;<br/>\n&gt;&gt; My son (9 years) also really enjoys the motorized pre-fab projects. He has<br/>\n&gt;&gt; learned so much about Lego construction principles from doing sets like<br/>\n&gt;&gt; this, it&#39;s amazing! I used to be a bit of a snob about this stuff,<br/>\n&gt;&gt; thinking that &quot;open-ended&quot; was best, but I&#39;ve changed my mind based on<br/>\n&gt;&gt; watching my son apply what he&#39;s learned via the project-based sets to his<br/>\n&gt;&gt; own projects.<br/>\n&gt;<br/>\n&gt; I got some Lego Educator sets on gears, pulleys, and so on. We like them a<br/>\n&gt; lot, but when we messed around with the gears projects Eric had already<br/>\n&gt; figured it all out from doing Lego Star Wars sets that used gears.<br/>\n&gt;<br/>\n&gt; I was just mentally ranting about the &quot;open-ended&quot; thing the other day,<br/>\n&gt; having been with some moms who were sort of parroting the idea; it&#39;s a<br/>\n&gt; really easy thing to say that I&#39;m not sure every writer or person talking<br/>\n&gt; about it has really thought through. I used to kind of vaguely agree with<br/>\n&gt; it, that all these &quot;build this very model!&quot; Lego sets were somehow bad<br/>\n&gt; compared to the enormous boxes of rectangles that were all you could get<br/>\n&gt; when I was a kid. But watching Eric really changed my mind.<br/>\n&gt;<br/>\n&gt; For one thing, he didn&#39;t used to keep most sets made the way they were. He<br/>\n&gt; would build them according to the instructions, then almost immediately<br/>\n&gt; start taking them apart and re-configuring them. He never took the<br/>\n&gt; instruction booklet as gospel. (Now, he has some sets he keeps built--his<br/>\n&gt; &quot;collection&quot;--and some he is willing to play with. Sometimes we have ended<br/>\n&gt; up with two of the same set if he has both wanted to keep the model AND use<br/>\n&gt; some of its specific cool pieces in another project.)<br/>\n&gt;<br/>\n&gt; He has actually in the past built a couple of very small models and then<br/>\n&gt; made instruction booklets for them. Eric takes ownership of everything he<br/>\n&gt; does-- he doesn&#39;t see Lego instructions as something made by these experts<br/>\n&gt; off somewhere that he can never be one of, or whose rules he has to follow.<br/>\n&gt; He can invent a set, make a booklet of instructions, package it all in a<br/>\n&gt; box, and give it to his brother as a gift. Likewise, he really likes<br/>\n&gt; computer and video games that include &quot;build your own level&quot; features, and<br/>\n&gt; he will spend a lot of time with those. And I always tend to brag on this<br/>\n&gt; board game he made year before last that was actually playable! Not a great<br/>\n&gt; game (too easy to win) but it had coherent rules and you could actually play<br/>\n&gt; it.<br/>\n&gt;<br/>\n&gt; I suppose it&#39;s _possible_ that there are some kids whose creativity are so<br/>\n&gt; weak that giving them a pre-designed Lego set kills it. On the other hand,<br/>\n&gt; there may be lots of kids who are like me--I do not have the kind of mind<br/>\n&gt; Eric does, that can imagine something in three dimensions and then create<br/>\n&gt; it. But working with him and Carl, I have really enjoyed building complex<br/>\n&gt; models from Lego kits. For me, doing kits has made Legos fun and satisfying<br/>\n&gt; in a way they never were before (I could never do more with those<br/>\n&gt; rectangular bricks than make a wall, as a kid). Maybe some kids who like the<br/>\n&gt; models but don&#39;t do their own &quot;creative&quot; Lego building are like me--it&#39;s not<br/>\n&gt; that they&#39;re not creative, but that doing that kind of building was _never_<br/>\n&gt; going to be the direction their creativity took them. But maybe people look<br/>\n&gt; at them and say, &quot;Oh, look how doing the pre-designed kits has destroyed<br/>\n&gt; that kid&#39;s creativity,&quot; and they let that reinforce their belief.<br/>\n&gt;<br/>\n&gt; Su, mom to Eric 8; Carl, almost 6; Yehva, 2.5<br/>\n&gt; tapeflags.blogspot.com<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; ------------------------------------<br/>\n&gt;<br/>\n&gt; Yahoo! Groups Links<br/>\n&gt;<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca McClure","from":"&quot;Rebecca McClure&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Slightly OT: Lego Educator sets","postDate":"1269208862","msgId":52222,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvNjR1dStwYTVnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg1OTcyOC42NjYxMi5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":52221,"nextInTopic":52223,"prevInTime":52221,"nextInTime":52223,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"... Mea Culpa! I m sorry - yes, they do have projects that can be made. I was thinking about the simple and powered machines set we have, which is an older","messageBody":"<div id=\"ygrps-yiv-390883995\"><blockquote><span title=\"ireply\">&gt; I am surprised to hear they are open ended.  I thought they came with some guidance and instruction. &lt;<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Mea Culpa! I&#39;m sorry - yes, they do have projects that can be made. I was thinking about the simple and powered machines set we have, which is an older version. However, we also have the eLab set for renewable energy and it does have projects. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;I would be interested in buying a ready made set, but at the moment I don&#39;t think Lego is selling any that include Power Functions, or even help on how you could include them.&lt;<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Then you may be most happy with the first set you mentioned.<br/>\n<br/>\nDid you find this page? <a rel=\"nofollow\" target=\"_blank\" href=\"http://powerfunctions.lego.com/en-us/Products/powerfunctions/8869.aspx\">http://powerfunctions.lego.com/en-us/Products/powerfunctions/8869.aspx</a><br/>\n<br/>\n:) Rebecca</div>","specialLinks":[]},{"userId":223803785,"authorName":"Su Penn","from":"Su Penn &lt;su@...&gt;","profile":"marie101365","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] &quot;open-ended&quot; was Lego Educator sets","postDate":"1269208557","msgId":52219,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEUwRDc5OEIzLUVDRUEtNDNGOC05OTE0LTMwNUZFNTZGNEY0QkBzdXBlbm4uY29tPg==","inReplyToHeader":"PGhvNjBwcittMHI0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhvNjBwcittMHI0QGVHcm91cHMuY29tPg=="},"prevInTopic":52218,"nextInTopic":52221,"prevInTime":52218,"nextInTime":52220,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"... I got some Lego Educator sets on gears, pulleys, and so on. We like them a lot, but when we messed around with the gears projects Eric had already figured","messageBody":"<div id=\"ygrps-yiv-1677801478\">On Mar 21, 2010, at 4:50 PM, Rebecca McClure wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; My son (9 years) also really enjoys the motorized pre-fab projects. He has learned so much about Lego construction principles from doing sets like this, it&#39;s amazing! I used to be a bit of a snob about this stuff, thinking that &quot;open-ended&quot; was best, but I&#39;ve changed my mind based on watching my son apply what he&#39;s learned via the project-based sets to his own projects.<br/>\n<br/>\n </span></blockquote>I got some Lego Educator sets on gears, pulleys, and so on. We like them a lot, but when we messed around with the gears projects Eric had already figured it all out from doing Lego Star Wars sets that used gears.<br/>\n<br/>\nI was just mentally ranting about the &quot;open-ended&quot; thing the other day, having been with some moms who were sort of parroting the idea; it&#39;s a really easy thing to say that I&#39;m not sure every writer or person talking about it has really thought through. I used to kind of vaguely agree with it, that all these &quot;build this very model!&quot; Lego sets were somehow bad compared to the enormous boxes of rectangles that were all you could get when I was a kid. But watching Eric really changed my mind.<br/>\n<br/>\nFor one thing, he didn&#39;t used to keep most sets made the way they were. He would build them according to the instructions, then almost immediately start taking them apart and re-configuring them. He never took the instruction booklet as gospel. (Now, he has some sets he keeps built--his &quot;collection&quot;--and some he is willing to play with. Sometimes we have ended up with two of the same set if he has both wanted to keep the model AND use some of its specific cool pieces in another project.)<br/>\n<br/>\nHe has actually in the past built a couple of very small models and then made instruction booklets for them. Eric takes ownership of everything he does-- he doesn&#39;t see Lego instructions as something made by these experts off somewhere that he can never be one of, or whose rules he has to follow. He can invent a set, make a booklet of instructions, package it all in a box, and give it to his brother as a gift. Likewise, he really likes computer and video games that include &quot;build your own level&quot; features, and he will spend a lot of time with those. And I always tend to brag on this board game he made year before last that was actually playable! Not a great game (too easy to win) but it had coherent rules and you could actually play it.<br/>\n<br/>\nI suppose it&#39;s _possible_ that there are some kids whose creativity are so weak that giving them a pre-designed Lego set kills it. On the other hand, there may be lots of kids who are like me--I do not have the kind of mind Eric does, that can imagine something in three dimensions and then create it. But working with him and Carl, I have really enjoyed building complex models from Lego kits. For me, doing kits has made Legos fun and satisfying in a way they never were before (I could never do more with those rectangular bricks than make a wall, as a kid). Maybe some kids who like the models but don&#39;t do their own &quot;creative&quot; Lego building are like me--it&#39;s not that they&#39;re not creative, but that doing that kind of building was _never_ going to be the direction their creativity took them. But maybe people look at them and say, &quot;Oh, look how doing the pre-designed kits has destroyed that kid&#39;s creativity,&quot; and they let that reinforce their belief.<br/>\n<br/>\nSu, mom to Eric 8; Carl, almost 6; Yehva, 2.5<br/>\ntapeflags.blogspot.com</div>","specialLinks":[]},{"userId":222835102,"authorName":"lalow66","from":"&quot;lalow66&quot; &lt;lalow@...&gt;","profile":"lalow66","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Slightly OT: Lego Educator sets","postDate":"1269208445","msgId":52218,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvNjRodCszODViQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDg1OTcyOC42NjYxMi5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":52216,"nextInTopic":52219,"prevInTime":52217,"nextInTime":52219,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"","messageBody":"<div id=\"ygrps-yiv-1142839247\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, John and Amanda Slater &lt;fourslaterz@...&gt; wrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; ________________________________<br/>\n&gt; From: Rebecca McClure &lt;ackirebecci@...&gt;<br/>\n&gt; <br/>\n&gt;   <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; &gt; I was wondering if anyone had ever bought a Lego Educator set.  I was looking at the Simple and Motorized Mechanism Set.&lt;<br/>\n&gt; <br/>\n&gt; Yes, we have a few of them kicking around. And we have Mindstorms, too. Mindstorms is a sizable step up as it does require some object-oriented programming to get the robots to do what they are supposed to do, which your kids may or may not enjoy at this stage of their Lego-ing.<br/>\n&gt; <br/>\n&gt; If your kids like motorized things and you think that they would enjoy something open-ended to expand their Lego adventures, then one of the motorized educational sets (like the one you are suggesting) might be a great fit. <br/>\n&gt; <br/>\n&gt; *****<br/>\n&gt; I am surprised to hear they are open ended.  I thought they came with some guidance and instruction.  That was really what we were looking for.  We own tons of legos and I thought this would introduce new elements and help them figure out what to do with them.  They hate the pictures of cool ideas without instructions.  They like either a pile of legos with no goal, or detailed instructions.<br/>\n&gt; ******<br/>\n&gt; <br/>\n&gt; The Klutz kit that Sandra mentioned isn&#39;t motorized but it has lots of gears and the activities are great, if your kids like following the instructions. And if you add on the Power Functions kit, they can likely figure out some interesting ways to put the two together!<br/>\n&gt; ****<br/>\n&gt; I saw that in my searching.  I was going to save it for a trip.  I thought it would be perfect for someplace we needed a compact project.<br/>\n&gt; <br/>\n&gt; *****<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; <br/>\n&gt; My son (9 years) also really enjoys the motorized pre-fab projects. He has learned so much about Lego construction principles from doing sets like this, it&#39;s amazing! I used to be a bit of a snob about this stuff, thinking that &quot;open-ended&quot; was best, but I&#39;ve changed my mind based on watching my son apply what he&#39;s learned via the project-based sets to his own projects.<br/>\n&gt; ****<br/>\n&gt; <br/>\n&gt; This is exactly what my boys do.  They build with the instructions the first time and then the pieces get added to our collection.  They take ideas from things they have seen or made and incorporate them into their own creations.  I would be interested in buying a ready made set, but at the moment I don&#39;t think Lego is selling any that include Power Functions, or even help on how you could include them.  I might check e-bay to see what I can find used.  I also can&#39;t find a set that uses gears in the way Eli wants.  For example, using one gear to transfer power to another gear.<br/>\n&gt; <br/>\n&gt; *****<br/>\n&gt; <br/>\n&gt; Good luck with your decision. I suspect it&#39;s very hard to ever go wrong with Lego.<br/>\n&gt; ****<br/>\n&gt; Lego are everyone&#39;s favorite toy at our house!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Thanks for all your information Rebecca!<br/>\n&gt; <br/>\n&gt; <br/>\n&gt; Amanda<br/>\n&gt; Eli 8, Samuel 7<br/>\n&gt; <br/>\n&gt;  <br/>\n&gt; <br/>\n&gt; <br/>\n&gt;       <br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Slightly OT: Lego Educator sets","postDate":"1269207465","msgId":52216,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg1OTcyOC42NjYxMi5xbUB3ZWI1MzkwMS5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PGhvNjBwcittMHI0QGVHcm91cHMuY29tPg==","referencesHeader":"PGhvNjBwcittMHI0QGVHcm91cHMuY29tPg=="},"prevInTopic":52212,"nextInTopic":52218,"prevInTime":52215,"nextInTime":52217,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"________________________________ From: Rebecca McClure  ... Yes, we have a few of them kicking around. And we have Mindstorms, too.","messageBody":"<div id=\"ygrps-yiv-1682222752\">________________________________<br/>\nFrom: Rebecca McClure &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ackirebecci@...\">ackirebecci@...</a>&gt;<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was wondering if anyone had ever bought a Lego Educator set.  I was looking at the Simple and Motorized Mechanism Set.&lt;<br/>\n<br/>\n </span></blockquote>Yes, we have a few of them kicking around. And we have Mindstorms, too. Mindstorms is a sizable step up as it does require some object-oriented programming to get the robots to do what they are supposed to do, which your kids may or may not enjoy at this stage of their Lego-ing.<br/>\n<br/>\nIf your kids like motorized things and you think that they would enjoy something open-ended to expand their Lego adventures, then one of the motorized educational sets (like the one you are suggesting) might be a great fit. <br/>\n<br/>\n*****<br/>\nI am surprised to hear they are open ended.  I thought they came with some guidance and instruction.  That was really what we were looking for.  We own tons of legos and I thought this would introduce new elements and help them figure out what to do with them.  They hate the pictures of cool ideas without instructions.  They like either a pile of legos with no goal, or detailed instructions.<br/>\n******<br/>\n<br/>\nThe Klutz kit that Sandra mentioned isn&#39;t motorized but it has lots of gears and the activities are great, if your kids like following the instructions. And if you add on the Power Functions kit, they can likely figure out some interesting ways to put the two together!<br/>\n****<br/>\nI saw that in my searching.  I was going to save it for a trip.  I thought it would be perfect for someplace we needed a compact project.<br/>\n<br/>\n*****<br/>\n<br/>\n<br/>\n<br/>\nMy son (9 years) also really enjoys the motorized pre-fab projects. He has learned so much about Lego construction principles from doing sets like this, it&#39;s amazing! I used to be a bit of a snob about this stuff, thinking that &quot;open-ended&quot; was best, but I&#39;ve changed my mind based on watching my son apply what he&#39;s learned via the project-based sets to his own projects.<br/>\n****<br/>\n<br/>\nThis is exactly what my boys do.  They build with the instructions the first time and then the pieces get added to our collection.  They take ideas from things they have seen or made and incorporate them into their own creations.  I would be interested in buying a ready made set, but at the moment I don&#39;t think Lego is selling any that include Power Functions, or even help on how you could include them.  I might check e-bay to see what I can find used.  I also can&#39;t find a set that uses gears in the way Eli wants.  For example, using one gear to transfer power to another gear.<br/>\n<br/>\n*****<br/>\n<br/>\nGood luck with your decision. I suspect it&#39;s very hard to ever go wrong with Lego.<br/>\n****<br/>\nLego are everyone&#39;s favorite toy at our house!<br/>\n<br/>\n<br/>\nThanks for all your information Rebecca!<br/>\n<br/>\n<br/>\nAmanda<br/>\nEli 8, Samuel 7<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":151979431,"authorName":"Rebecca McClure","from":"&quot;Rebecca McClure&quot; &lt;ackirebecci@...&gt;","profile":"ackirebecci","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Slightly OT: Lego Educator sets","postDate":"1269204603","msgId":52212,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhvNjBwcittMHI0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDcwMDEzNy4yNDc3OC5xbUB3ZWI1MzkwNC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":52205,"nextInTopic":52216,"prevInTime":52211,"nextInTime":52213,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"... Yes, we have a few of them kicking around. And we have Mindstorms, too. Mindstorms is a sizable step up as it does require some object-oriented programming","messageBody":"<div id=\"ygrps-yiv-1581208964\"><blockquote><span title=\"ireply\">&gt; I was wondering if anyone had ever bought a Lego Educator set.  I was looking at the Simple and Motorized Mechanism Set.&lt;<br/>\n<br/>\n </span></blockquote>Yes, we have a few of them kicking around. And we have Mindstorms, too. Mindstorms is a sizable step up as it does require some object-oriented programming to get the robots to do what they are supposed to do, which your kids may or may not enjoy at this stage of their Lego-ing.<br/>\n<br/>\nIf your kids like motorized things and you think that they would enjoy something open-ended to expand their Lego adventures, then one of the motorized educational sets (like the one you are suggesting) might be a great fit. The Klutz kit that Sandra mentioned isn&#39;t motorized but it has lots of gears and the activities are great, if your kids like following the instructions. And if you add on the Power Functions kit, they can likely figure out some interesting ways to put the two together!<br/>\n<br/>\nMy son (9 years) also really enjoys the motorized pre-fab projects. He has learned so much about Lego construction principles from doing sets like this, it&#39;s amazing! I used to be a bit of a snob about this stuff, thinking that &quot;open-ended&quot; was best, but I&#39;ve changed my mind based on watching my son apply what he&#39;s learned via the project-based sets to his own projects.<br/>\n<br/>\nGood luck with your decision. I suspect it&#39;s very hard to ever go wrong with Lego.<br/>\n<br/>\n:) Rebecca</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Slightly OT: Lego Educator sets","postDate":"1269193716","msgId":52205,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ4QzUwOTI3LTY5MkItNERCQy05MzJDLUZBMkU4RUE5MUE0OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDYzNDIwOS40NDM3My5xbUB3ZWI1MzkwMi5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDcwMDEzNy4yNDc3OC5xbUB3ZWI1MzkwNC5tYWlsLnJlMi55YWhvby5jb20+IDxFQTQ2MzY0RjJGQjE0REU0OTYyMUIyOTM5QkU0MjE5RkBFZFBDPiA8NjM0MjA5LjQ0MzczLnFtQHdlYjUzOTAyLm1haWwucmUyLnlhaG9vLmNvbT4="},"prevInTopic":52204,"nextInTopic":52212,"prevInTime":52204,"nextInTime":52206,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"There is (or used to be) a Klutz Press Lego add-on kit, if you wanted to get something quickly for this week and keep researching the larger purchase. ","messageBody":"<div id=\"ygrps-yiv-1545043788\">There is (or used to be) a Klutz Press Lego add-on kit, if you wanted  <br/>\nto get something quickly for this week and keep researching the larger  <br/>\npurchase.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.klutz.com/book/Lego-Crazy-Action-Contraptions\">http://www.klutz.com/book/Lego-Crazy-Action-Contraptions</a></div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Slightly OT: Lego Educator sets","postDate":"1269192969","msgId":52204,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzNDIwOS40NDM3My5xbUB3ZWI1MzkwMi5tYWlsLnJlMi55YWhvby5jb20+","inReplyToHeader":"PEVBNDYzNjRGMkZCMTRERTQ5NjIxQjI5MzlCRTQyMTlGQEVkUEM+","referencesHeader":"PDcwMDEzNy4yNDc3OC5xbUB3ZWI1MzkwNC5tYWlsLnJlMi55YWhvby5jb20+IDxFQTQ2MzY0RjJGQjE0REU0OTYyMUIyOTM5QkU0MjE5RkBFZFBDPg=="},"prevInTopic":52203,"nextInTopic":52205,"prevInTime":52203,"nextInTime":52205,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"From: Lisa Wendell  Do you know if your boys are interested in motorized Lego s?  Our son tried them out at various times and was never","messageBody":"<div id=\"ygrps-yiv-638552912\">From: Lisa Wendell &lt;ewendell@...&gt;<br/>\n<br/>\n  <br/>\nDo you know if your boys are interested in motorized Lego&#39;s?  Our son tried them out at various times and was never interested in owning them.   He used / uses the non-motorized Lego&#39;s.  He just wanted more basic Lego&#39;s - at one point he wanted more of the rectangular & square bricks to make bigger and more complex creations.  We ended up on eBay to buy the exact pieces he wanted.  He will be 16 in June and used Lego&#39;s a lot up until age 15 and now it has tapered off a bit.<br/>\n<br/>\n*****<br/>\nSamuel is very interested in the motors in theory (they have never had access to them), but Eli is not sure.  That was <br/>\npart of why I was looking at this set with motors and gears and sails <br/>\netc.  Eli wants to build with gears of various sizes which this set includes and we can also buy extras separately on the site.  We had looked at just buying some power functions elements http://http://powerfunctions.lego.com/en-US/default.aspx, but Lego offers very little support on how to incorporate them into what you are building.  I&#39;m worried that without a bit of basic instruction, the parts won&#39;t get a lot of use.  <br/>\n<br/>\n<br/>\nEli likes to build very small, intricate creations and Samuel prefers things that are sized for lego men.   They both enjoy playing with the radio controlled tank, helicopter and airplane we have. (None of those are made out of Legos.)<br/>\n<br/>\nAmanda<br/>\nEli 8, Samuel 7<br/>\n<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":143043046,"authorName":"Ed Wendell","from":"&quot;Ed Wendell&quot; &lt;ewendell@...&gt;","profile":"zelco123","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Slightly OT: Lego Educator sets","postDate":"1269191732","msgId":52203,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVBNDYzNjRGMkZCMTRERTQ5NjIxQjI5MzlCRTQyMTlGQEVkUEM+","inReplyToHeader":"PDcwMDEzNy4yNDc3OC5xbUB3ZWI1MzkwNC5tYWlsLnJlMi55YWhvby5jb20+","referencesHeader":"PDcwMDEzNy4yNDc3OC5xbUB3ZWI1MzkwNC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":52202,"nextInTopic":52204,"prevInTime":52202,"nextInTime":52204,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"Do you know if your boys are interested in motorized Lego s?  Our son tried them out at various times and was never interested in owning them.   He used / uses","messageBody":"<div id=\"ygrps-yiv-337440651\">Do you know if your boys are interested in motorized Lego&#39;s?  Our son tried them out at various times and was never interested in owning them.   He used / uses the non-motorized Lego&#39;s.  He just wanted more basic Lego&#39;s - at one point he wanted more of the rectangular & square bricks to make bigger and more complex creations.  We ended up on eBay to buy the exact pieces he wanted.  He will be 16 in June and used Lego&#39;s a lot up until age 15 and now it has tapered off a bit.<br/>\n<br/>\nLisa W.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":129999023,"authorName":"John and Amanda Slater","from":"John and Amanda Slater &lt;fourslaterz@...&gt;","profile":"fourslaterz","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Slightly OT: Lego Educator sets","postDate":"1269189756","msgId":52202,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDcwMDEzNy4yNDc3OC5xbUB3ZWI1MzkwNC5tYWlsLnJlMi55YWhvby5jb20+"},"prevInTopic":0,"nextInTopic":52203,"prevInTime":52201,"nextInTime":52203,"topicId":52202,"numMessagesInTopic":0,"msgSnippet":"I was wondering if anyone had ever bought a Lego Educator set.  I was looking at the Simple and Motorized Mechanism Set.","messageBody":"<div id=\"ygrps-yiv-930253718\">I was wondering if anyone had ever bought a Lego Educator set.  I was looking at the Simple and Motorized Mechanism Set.  http://http://www.legoeducation.us/store/detail.aspx?ID=1667&c=0&t=0&l=0<br/>\n<br/>\nI have talked to two guys from Tech support, one was great and the other was not very helpful.  <br/>\n<br/>\nThe first guy really pointed me towards Mindstorms, although not the one on the educator&#39;s site.  He felt the one marketed to schools was much simpler with a focus on not losing parts and completing activities in under 40 minutes.  The set marketed to the general public was more complex and more versatile.  http://http://mindstorms.lego.com/eng/default.aspx  However, I&#39;m not sure if my boys are ready for it.  Eli will be 9 on Friday and Samuel is 7 1/2.  They are both experienced Lego builders, but Eli gets a bit panic-y if he feels something looks too hard.<br/>\n<br/>\nThe second person I talked to had no idea how a homeschooler&#39;s needs might be different than a school teacher and was not much help.  He felt that the mechanisms set was the way to go, but I am having a hard time trusting him.  <br/>\n<br/>\nI started looking for something interesting because Eli&#39;s birthday is at the end of the week.  The boys are ready to move up to the next step with their Legos (they are almost the only toy they play with), but I&#39;m not sure what that would be.  I want something that they can take ideas from and incorporate them into what they are already doing.  I have found that adding a new piece to something they already have always sends them in new and exciting directions.<br/>\n<br/>\nThanks for any information,<br/>\nAmanda<br/>\nEli (9 on Friday), Samuel 7 1/2<br/>\n<br/>\n<br/>\n<br/>\n      <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":52176,"nextTopicId":51391}}