{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":74604204,"authorName":"ddzimlew@juno.com","from":"ddzimlew@...","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning]  Fun Ideas for Pat","postDate":"1013695866","msgId":4799,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMjE0LjA3MTEyMS4tMzExNjcuMi5kZHppbWxld0BqdW5vLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":4798,"nextInTime":4800,"topicId":4799,"numMessagesInTopic":0,"msgSnippet":"At least around here the martial arts clubs will let you come and participate a few times for free.  That could be fun.   Also gymnastics clubs.  We went for a","messageBody":"<div id=\"ygrps-yiv-395943306\">At least around here the martial arts clubs will let you come and<br/>\nparticipate a few times for free.  That could be fun.   Also gymnastics<br/>\nclubs.  We went for a month, free, and there&#39;s usually lots of kids.<br/>\n<br/>\nWhen my nieces were here they liked theater and costumes so we spent lots<br/>\nof time in costume shops, which lead to vintage clothing stores and then<br/>\nsecond hand shops.   My niece, (12)  found an old crushed velvet jacket<br/>\nfrom the forties, maybe, and bought it.  She sold it to her teacher for<br/>\n$75. bucks!  So it could be profitable too. <br/>\nWe also found a place that teaches belly dancing, which was perfect for<br/>\nthe girls who were into costumes.  They got to participate in the class<br/>\nand could have gone to a restaurant to dance one night, but were too shy.<br/>\n Lots of movement and music and flowing fabric.  They had a great time.<br/>\n<br/>\nRock hounding clubs and bird watching clubs go on regular field trips to<br/>\ninteresting places.  They might make you join, for insurance purposes,<br/>\nbut they might just let you tag along too, as a kind of trial thing.  You<br/>\nget a loosely organized field trip with lots of knowledgeable people to<br/>\nask questions of.  <br/>\n<br/>\nSky watching clubs hold regular meetings, once a month or so, at night<br/>\nfor viewing the stars. They usually invite the public at no charge and<br/>\nyou get to look through lots of different telescopes.  That&#39;s really fun<br/>\nbecause it&#39;s at night and you can take hot chocolate and the kids get to<br/>\nrace around, everybody&#39;s happy. <br/>\n<br/>\nWe hike a lot.  But we live where we can be in the woods in a few<br/>\nminutes.  <br/>\nWe swim.  The public pool is free, but usually pretty crowded.  We go<br/>\nsometimes to the big hot springs resort and swim all day and play on the<br/>\nwater slide.  It costs but if you go with the idea of being there awhile,<br/>\nit feels like it&#39;s worth it. <br/>\nIn the winter we skate and snowshoe.  I can&#39;t tell you how fun this is. <br/>\nWe usually go skating at night, I don&#39;t know why but somehow this makes<br/>\nit more of an adventure.  Maybe it&#39;s just Dylan&#39;s age. (9)<br/>\nPanning for gold is fun.  Digging for crystals and sapphires is fun if<br/>\nyou don&#39;t have environmental objections.  <br/>\n<br/>\nWe bought a canoe at a garage sale a few years ago and take it out in the<br/>\nsummer.  That&#39;s fun, and hard work and when you get home it feels like<br/>\nyou really did something!  Dylan hangs over the side and tries to catch<br/>\nwater snakes.  Let your kids paddle.  You might not get very far very<br/>\nfast but you&#39;ll laugh a lot. <br/>\n<br/>\nWe clean up the little creek that runs through the city park.  This<br/>\nsounds stinky but we always have fun.  Mostly I pick up junk and Dylan<br/>\ncatches frogs and water bugs.&lt;g&gt;<br/>\n <br/>\nI know a lot of people are afraid of trampolines but,  WOW!  These are so<br/>\nfun.  Better than drugs.  And if you put a water sprinkler under it...<br/>\nperfect summer day.<br/>\n<br/>\nWe just discovered a place with racing carts.  They&#39;re little cars you<br/>\nzoom around on a track.  This was hilariously fun.  If your kids are<br/>\nlittle though I&#39;d try to find a slow time, so big kids aren&#39;t crashing<br/>\ninto them.  They can bump pretty hard.   The one we found is open in the<br/>\nwinter, too, and not too expensive.<br/>\n<br/>\nWe&#39;ve never been but have thought about those paint ball places.  If your<br/>\nnot against guns that really looks like fun.  Maybe they&#39;re expensive, I<br/>\ndon&#39;t know. <br/>\n<br/>\nNice music stores will let your kids fiddle around on the instruments. <br/>\nIt&#39;s best to go when they&#39;re not too busy, because most places that will<br/>\nlet your kid plug in a six hundred dollar guitar will want to be pretty<br/>\nclose by. And it can be really fun to make those duck fart noises on a<br/>\nclarinet.<br/>\n<br/>\nOnce when we were in Denver we went into this fabulous game store.  There<br/>\nwere fun things everywhere and masks and doo dads. We spent hours playing<br/>\nthere and had a wonderful time   Dylan loved it and still talks about it.<br/>\n No such store around here, though. <br/>\n<br/>\nSporting goods places sometimes have indoor basket ball hoops or a rock<br/>\nclimbing wall.  There&#39;s one about forty miles from us but when were in<br/>\nthat town we stop in and if they&#39;re not busy they let Dylan climb the<br/>\nwall.  Usually they charge and give lessons, but if you just wander in,<br/>\nthey might let you play.  <br/>\n<br/>\nArt gallery&#39;s and museums often have special programs for kids.  These<br/>\nare sometimes pretty structured, but you could ask.  The one near us (55<br/>\nmiles away)  does basket weaving, sculpting, painting,  puppet making<br/>\netc.  There&#39;s usually a program you can get if you call that will tell<br/>\nyou the schedules.  <br/>\n<br/>\nHorseback riding.  I don&#39;t know if you live near a stables but in<br/>\naddition to giving riding lessons they usually just rent out horses to<br/>\nride.  This is nice if you have a horse lover.  My nieces did this here<br/>\nand then started lessons when they got home.  They love it, and even work<br/>\nnow at the stables for a little extra money on the days they take their<br/>\nlessons.  <br/>\n<br/>\nPlaces like Home Depot ( if you live near one ) have woodworking shops<br/>\nfor kids once a month or so. <br/>\n <br/>\nHome improvement places will give away their broken ceramic tiles if you<br/>\nwant to try a mosaic.   We mosaic stepping stones for the garden. <br/>\nThey&#39;re pretty but they&#39;re slick!   Dylan calls them step around stones.<br/>\n<br/>\nWeaving shops often have demonstrations.  This is very cool because even<br/>\nif you don&#39;t have a passion for textiles the looms are amazing to watch. <br/>\n<br/>\nThere are alternative energy fairs with all kinds of cool stuff to look<br/>\nat and tinker with.  Once we got to work on a straw bale house.   <br/>\n<br/>\nBook stores have story hours or talks or readings by different authors.<br/>\n<br/>\nDinner theater is very fun if you get the right show.  That&#39;s more<br/>\nexpensive but for a treat...<br/>\n<br/>\nOh, this got long, sorry.<br/>\nDeb L</div>","specialLinks":[]}],"prevTopicId":4798,"nextTopicId":4800}}