{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":7,"messages":[{"userId":142002410,"authorName":"Kristi Hayes","from":"&quot;Kristi Hayes&quot; &lt;hayes@...&gt;","profile":"morgainesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [UnschoolingDiscussion] Re: Violent toys","postDate":"1082312778","msgId":92824,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM0MjU3MiRhNDhhOGYyMCRhOGQ4MDVjZkBkYW4+","inReplyToHeader":"PGM1dDA5bytuam9hQGVHcm91cHMuY29tPg=="},"prevInTopic":92816,"nextInTopic":0,"prevInTime":92823,"nextInTime":92825,"topicId":92654,"numMessagesInTopic":0,"msgSnippet":"... your kids making the toys as opposed to store bought ones? ... want the child to have... by not stopping them from making them you are respecting their","messageBody":"<div id=\"ygrps-yiv-889171340\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Kristi Hayes&quot; <br/>\n&lt;hayes@m...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;As I&#39;ve said before, if they want these<br/>\n&gt; toys, they will make them.  <br/>\n<br/>\n&gt;Katherine: what is the difference between <br/>\n </span></blockquote>your kids making the toys as opposed to store bought ones? <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt;Sue: by not buying them you are not endorsing them as something you<br/>\n </span></blockquote>want the child to have... by not stopping them from making them you are<br/>\nrespecting their rights to their own thoughts. <br/>\n <br/>\nSue hit on my own answer pretty well.  The other piece is the &quot;if they<br/>\nwant them&quot; piece.  Gunplay is not something I want to suggest to them.<br/>\nIt is not play I want to initiate.  When I buy, or others buy, them<br/>\ntoys, those toys are frequently a springboard for their play.  Other<br/>\ntimes they ignore the toys.  However, by having the toy it is akin to a<br/>\nsuggestion.  I hope that makes sense the way I&#39;m saying it.  <br/>\nIf they decide they would like to play &quot;guns,&quot; or a game involving guns,<br/>\nor &quot;swords&quot; or other games, and they wish to create these tools, I won&#39;t<br/>\ntell them, &quot;No; you can&#39;t play that game.&quot;  I wouldn&#39;t trash their<br/>\ncreations or demand they be taken apart.  I probably wouldn&#39;t jump in<br/>\nand say, &quot;Wow, I love what you&#39;re making,&quot; but if they wanted my opinion<br/>\nI&#39;d comment on something like the innovation or some specific idea that<br/>\nwent into the toy&#39;s creation.  Ie &quot;I like the idea you had to . &quot; If<br/>\nthey asked me to play with them, I&#39;d likely decline.  If they asked me<br/>\nto help, I&#39;d ask what they wanted help with and help them.  <br/>\nI&#39;d originally written a lot more, but decided to erase it since it&#39;s<br/>\nmostly repeating other things I&#39;ve already written.  Let me know if you<br/>\nwant more clarification. <br/>\nKristi <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":131271049,"authorName":"Susan Gallien","from":"&quot;Susan Gallien&quot; &lt;susan@...&gt;","profile":"susanmarguerite","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Re: Violent toys","postDate":"1082298153","msgId":92816,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAzYjUwMWM0MjU1MCQ5ODFmODM3MCQ1MmU4YjI0MUBTVUU+","referencesHeader":"PGM1dDA5bytuam9hQGVHcm91cHMuY29tPg=="},"prevInTopic":92805,"nextInTopic":92824,"prevInTime":92815,"nextInTime":92817,"topicId":92654,"numMessagesInTopic":0,"msgSnippet":"Stepping in here... by not buying them you are not endorsing them as something you want the child to have... by not stopping them from making them you are","messageBody":"<div id=\"ygrps-yiv-2144040552\">Stepping in here... by not buying them you are not endorsing them as something you want the child to have... by not stopping them from making them you are respecting their rights to their own thoughts.  I never bought toy guns for my boys, and they all made them, from Lego, wood or just a pointed finger.  <br/>\n<br/>\nMy three youngest are girls and they have bb guns to shoot targets.  Guns aren&#39;t always about killing.  If children live with guns around they need to know the safety aspects of them, using a bb gun with supervision is the perfect starting point, teaching first that a gun is always to be treated as though it was loaded.<br/>\n<br/>\nWe live on a farm and guns are used for killing for different reasons... swiftly dispatching an injured animal, frightening off or even killing predators and to kill an animal to be butchered.  We sell from the farm and some of our customers butcher the animals here, to my way of thinking that is the least stressful end... head in a feed bucket happily eating then a well placed bullet kills instantly.  I don&#39;t pretend for a minute that I like it, in fact I don&#39;t... some farmers wont allow animals to be butchered on the farm, it&#39;s cleaner to send off the animals in the truck... that I don&#39;t like either, maybe even less than killing them on the farm.  I sometime think I wasn&#39;t cut out to be a farmer, but I do love our cows and without the calves as an income we could never have them here.<br/>\n<br/>\n<br/>\nSue Gallien<br/>\nThe Winona Farm, Minnesota<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://thewinonafarm.com\">http://thewinonafarm.com</a><br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\">   ----- Original Message ----- <br/>\n  From: queenjane555 <br/>\n  To: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a> <br/>\n  Sent: Saturday, April 17, 2004 11:30 PM<br/>\n  Subject: [UnschoolingDiscussion] Re: Violent toys<br/>\n<br/>\n<br/>\n  --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Kristi Hayes&quot; <br/>\n  &lt;hayes@m...&gt; wrote:<br/>\n<br/>\n  &gt;As I&#39;ve said before, if they want these<br/>\n  &gt; toys, they will make them.  <br/>\n<br/>\n  I meant to ask you this before, but what is the difference between <br/>\n  your kids making the toys as opposed to store bought ones? I don&#39;t <br/>\n  think i&#39;ve heard that position before, so i wonder if there is a <br/>\n  philosophy behind it? Just curious!:o)<br/>\n<br/>\n  Katherine<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  &quot;List Posting Policies&quot; are provided in the files area of this group. <br/>\n<br/>\n  Visit the Unschooling website and message boards: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a> <br/>\n  Yahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n   <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":59925222,"authorName":"queenjane555","from":"&quot;queenjane555&quot; &lt;queenjane555@...&gt;","profile":"queenjane555","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Violent toys","postDate":"1082262648","msgId":92805,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM1dDA5bytuam9hQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDAwMDAwMWM0MjRkMCRkZjljYThjMCRhOGQ4MDVjZkBkYW4+"},"prevInTopic":92789,"nextInTopic":92816,"prevInTime":92804,"nextInTime":92806,"topicId":92654,"numMessagesInTopic":0,"msgSnippet":"... I meant to ask you this before, but what is the difference between your kids making the toys as opposed to store bought ones? I don t think i ve heard that","messageBody":"<div id=\"ygrps-yiv-902315089\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:UnschoolingDiscussion@yahoogroups.com\">UnschoolingDiscussion@yahoogroups.com</a>, &quot;Kristi Hayes&quot; <br/>\n&lt;hayes@m...&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;As I&#39;ve said before, if they want these<br/>\n&gt; toys, they will make them.  <br/>\n<br/>\n </span></blockquote>I meant to ask you this before, but what is the difference between <br/>\nyour kids making the toys as opposed to store bought ones? I don&#39;t <br/>\nthink i&#39;ve heard that position before, so i wonder if there is a <br/>\nphilosophy behind it? Just curious!:o)<br/>\n<br/>\nKatherine</div>","specialLinks":[]},{"userId":142002410,"authorName":"Kristi Hayes","from":"&quot;Kristi Hayes&quot; &lt;hayes@...&gt;","profile":"morgainesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Violent toys","postDate":"1082243294","msgId":92789,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM0MjRkMCRkZjljYThjMCRhOGQ4MDVjZkBkYW4+"},"prevInTopic":92699,"nextInTopic":92805,"prevInTime":92788,"nextInTime":92790,"topicId":92654,"numMessagesInTopic":0,"msgSnippet":"From Joyce: You and Leo are theorizing that preventing violent play will yeild peaceful children. Let me first clarify tone and intent: this post is a","messageBody":"<div id=\"ygrps-yiv-149992286\">From Joyce:<br/>\nYou and Leo are theorizing that preventing violent play will yeild<br/>\npeaceful<br/>\nchildren.<br/>\n <br/>\n <br/>\nLet me first clarify tone and intent: this post is a clarification with<br/>\nthe intent of making myself understood.  I am standing at the brink of<br/>\nwhat I hope to be the long journey of unschooling with a preschooler<br/>\n(and her baby brothers).  Therefore, it is important to me that I make<br/>\nmyself clear as to those on this list because I would like to be part of<br/>\nthis  online community - as with any relationship, I need to clarify<br/>\nmyself.  Though you are all strangers now I expect to get to know at<br/>\nleast some of you over the next several years.  So here is the<br/>\nclarification: <br/>\n <br/>\nI said clearly in a previous post (and this has been a long thread, I<br/>\nknow; it was likely easy to overlook) that I am not postulating that<br/>\nviolent toys and games make for violent children, nor that a<br/>\nviolence-free home will keep my children (or any children) from being<br/>\nviolent.  My son is pulling hair; he carries dolls around by their hair.<br/>\nIt would be ridiculous to link the two.  As I have said, this is simply<br/>\na matter of values, specifically, my spiritual values.  I don&#39;t wish to<br/>\ncontrol my children or their play.  My issue is not with violent TV<br/>\nshows or video games, though at this young age I do place limits on<br/>\nthings that can be disturbing to my daughter (I know what is disturbing<br/>\nto her by watching her daily actions and listening to her words).  I<br/>\ndon&#39;t like them (the games and shows), but I understand they will be a<br/>\nfact of our lives, esp. with a husband who is interested in them.  I&#39;m<br/>\nnot limiting violent play, but have a real problem with toys whose sole<br/>\nintent is to emulate violence.  Also, these are objects I can keep out<br/>\nof the home without limiting my children&#39;s play.  I could say much more<br/>\nabout this, but it&#39;s more than I&#39;m willing to type 1-handed.  (With<br/>\ninfant) Narrow minded?  Perhaps.  The discussion here has been<br/>\ninteresting.  This may be one of those areas that grow with my children.<br/>\nBut as I&#39;ve said, they have not expressed a want for them.  Right now it<br/>\nis an issue for me, not my kids.  And if I change my mind about having<br/>\nthese toys in my home, I&#39;d like it to be a choice *I* make with my kids;<br/>\nnot an issue I&#39;d like to have created by a gift.  Possibly controlling,<br/>\nbut certainly not impeding.  As I&#39;ve said before, if they want these<br/>\ntoys, they will make them.  My son&#39;s friend was &quot;shooting&quot; with the<br/>\nspray nozzle from our hose today.  He didn&#39;t seem bothered that it<br/>\nwasn&#39;t a toy gun.  <br/>\n <br/>\nAnyway, I&#39;m going to withdraw from the discussion at this point.  Since<br/>\nmy post began it I&#39;ve felt compelled to participate but I&#39;ve said (I<br/>\nthink) all that I have to say; I&#39;ll keep reading the thread though; some<br/>\ninteresting ideas in it. <br/>\n <br/>\nKristi<br/>\nMama to Isaac 6 wks, Orion 2, and Morgaine 4<br/>\n <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":74604204,"authorName":"Deb Lewis","from":"Deb Lewis &lt;ddzimlew@...&gt;","profile":"deborahkmlewis","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Violent toys","postDate":"1082165275","msgId":92699,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDQwNDE2LjE5Mjc1NS4yOTM2LjcuZGR6aW1sZXdAanVuby5jb20+"},"prevInTopic":92657,"nextInTopic":92789,"prevInTime":92698,"nextInTime":92700,"topicId":92654,"numMessagesInTopic":0,"msgSnippet":"***If he wants to kill bad monsters say, I would engage in a conversation Why are the monsters bad? Are they hurting you? Are they killing babies? *** To a","messageBody":"<div id=\"ygrps-yiv-1663163471\">***If he wants to kill bad monsters say, I would engage<br/>\nin a conversation &quot;Why are the monsters bad? Are they<br/>\nhurting you? Are they killing babies?&quot;***<br/>\n<br/>\nTo a child a &quot;monster&quot; can be the embodiment of all things scary and bad.<br/>\n But all things scary and bad in a childs world, not in an adults world. <br/>\n  The darkness is a little scary, they must not leave the yard(very<br/>\nmysterious), never touch the stove, etc.   There are scary things when<br/>\nyour little but they&#39;re not always the same things parents are scared of.<br/>\n  If we can give a name and shape to our fears we can control them.  <br/>\nMaking a monster responsible for all bad and scary things lets us feel we<br/>\ncan in some way control those things, if we can control the monster.  <br/>\n<br/>\nI think a dialog like the one in your example is *more* disturbing than<br/>\nthe childs desire to kill a bad monster.   To a child getting rid of a<br/>\nbad monster is a solution to a problem.   Before the dialog the monster<br/>\nmight just be the bad thing making noise in the basement or making you<br/>\nfeel a little insecure at night.  After the dialog, the monster has<br/>\nbecome something that&#39;s actively looking to harm you and maybe even kill<br/>\nyou. <br/>\n<br/>\nTelling a kid their very thoughts are wrong or freaky is such an assault.<br/>\n Mind control is not what unschooling is about and shouldn&#39;t be what<br/>\nparenting is about.   A kid can&#39;t hear that their fantasy play is wrong<br/>\nor bad or freaky and not end up with shame and guilt.  <br/>\n<br/>\nOur kids don&#39;t deserve to be the receptacle of all our fears and terrors.<br/>\n <br/>\nThey have no responsibility to make us feel better about the world we<br/>\nbrought them into.  <br/>\n<br/>\nThey have a responsibility to themselves, to learn and grow and find<br/>\nsolutions to their problems.   <br/>\nFilling them with shame and guilt and uncertainty is more damaging than<br/>\nthe kinds of play that have been described here.   To be able to explore<br/>\nthe world, even the scary things,  to be able to find out what scary or<br/>\ntroubling or fascinating things mean on a personal level in the safety of<br/>\nthe child&#39;s own home is the way children make sense of the world and get<br/>\ncontrol over their fears.  <br/>\n<br/>\nDeb L</div>","specialLinks":[]},{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"duckfordu","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Violent toys","postDate":"1082141862","msgId":92657,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGMuMjZiMTI2OTMuMmRiMTg2YTZAYW9sLmNvbT4="},"prevInTopic":92654,"nextInTopic":92699,"prevInTime":92656,"nextInTime":92658,"topicId":92654,"numMessagesInTopic":0,"msgSnippet":"In a message dated 4/16/04 12:32:52 PM, hayes@metrocast.net writes: ","messageBody":"<div id=\"ygrps-yiv-376290524\">In a message dated 4/16/04 12:32:52 PM, <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:hayes@...\">hayes@...</a> writes:<br/>\n<br/>\n&lt;&lt; Each family has its own values to<br/>\nimpart on children.  One of mine is the use of force only when<br/>\nnecessary, and that weapons are not toys.  Would I let my kids play with<br/>\npretend cars?  Sure.  They&#39;re unlikely to confuse their hotwheels or<br/>\neven a power jeep with a real vehicle.  &gt;&gt;<br/>\n<br/>\n<br/>\n-=-If I see them killing people<br/>\nwith the cars, such as Morgaine running over her Barbies, I step in.-=-<br/>\n<br/>\nI doubt your children could kill people with toy cars even if they tried.<br/>\n<br/>\nPlease try to keep &quot;killing people&quot; and &quot;playing with dolls&quot; separate when <br/>\nyou write, and maybe when you think.<br/>\n<br/>\nKids are able to do it really easily.  What is the difficulty some moms seem <br/>\nto have?<br/>\n<br/>\nHolly just told me another family she knows used to prevent all gunplay.  <br/>\n(BTW, one of those kids has hit Holly and thrown things at her, though our kids <br/>\nhave done nothing of the sort to theirs or others; AND... the mom used to <br/>\nspank.  And threaten to spank, in front of other people.)<br/>\n<br/>\nOne day, Holly says, years ago she was at their house and the boy was playing <br/>\nwith a gun.  She didn&#39;t know where it came from.  Maybe his dad got it for <br/>\nhim or maybe he found it in the park.  (Holly&#39;s speculations.)  The gun was <br/>\nbright blue or orange, probably a water gun, Holly reports.  She said they weren&#39;t <br/>\nrunning around and being loud, just staying in one room.   The mom had <br/>\ncompany.  (That seemed important enough for Holly to add to the account.)  The mom <br/>\ncame in and said &quot;You KNOW you&#39;re not supposed to be playing with guns&quot; and <br/>\ntook it away from him, saying &quot;How do you know that&#39;s not real?&quot;<br/>\n<br/>\nAll the kids were clear that it wasn&#39;t real.  All they could think was the <br/>\nmom wasn&#39;t very bright and didn&#39;t have much faith in them if she wondered how <br/>\nthey could know it wasn&#39;t a real gun.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":142002410,"authorName":"Kristi Hayes","from":"&quot;Kristi Hayes&quot; &lt;hayes@...&gt;","profile":"morgainesmama","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Violent toys","postDate":"1082138598","msgId":92654,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwMDAwMWM0MjNkZCQxOTI1MGU2MCRhOGQ4MDVjZkBkYW4+"},"prevInTopic":0,"nextInTopic":92657,"prevInTime":92653,"nextInTime":92655,"topicId":92654,"numMessagesInTopic":0,"msgSnippet":"Leo s point was a good one.  Our children *are* learning all the time, from everything around them.  My kids are little.  My oldest is 4.  We have discussed","messageBody":"<div id=\"ygrps-yiv-1516457155\">Leo&#39;s point was a good one.  Our children *are* learning all the time,<br/>\nfrom everything around them.  My kids are little.  My oldest is 4.  We<br/>\nhave discussed guns and violence at length.  We have discussed the war<br/>\nin Iraq.  We have discussed multiple perspectives of these things.  I<br/>\nhave a card-carrying-NRA FIL, a husband who supported going to war, my<br/>\nown perspectives (yes, I took my kids to candlelight vigils with me) to<br/>\nconsider.  <br/>\n <br/>\nThe fact is, unschooling doesn&#39;t mean we don&#39;t *teach* our kids, because<br/>\nwe are teaching them all the time.  Each family has its own values to<br/>\nimpart on children.  One of mine is the use of force only when<br/>\nnecessary, and that weapons are not toys.  Would I let my kids play with<br/>\npretend cars?  Sure.  They&#39;re unlikely to confuse their hotwheels or<br/>\neven a power jeep with a real vehicle.  If I see them killing people<br/>\nwith the cars, such as Morgaine running over her Barbies, I step in.<br/>\nHer best friend&#39;s grandmother was killed in a car accident last<br/>\nChristmas eve.  This affected her deeply, and we discuss it.  I don&#39;t<br/>\nobject to cars.  Neither do I object to hunting rifles and bows, though<br/>\nI am a vegetarian.  (My husband is not.)  However, when I say I don&#39;t<br/>\nwant my children mistaking a toy gun for a real gun, I *do* mean just<br/>\nthat.  My two year old son, my 4 year old daughter, will not necessarily<br/>\nconsider weight when playing with a gun.  And furthermore, not all<br/>\nweapons look like weapons.  It is not common, but there are many<br/>\n&quot;fashion handguns&quot; and other weapons out there.  Here is one site for an<br/>\nexample; there are many others.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://web.tiscali.it/ladiesweapons/weapons.html\">http://web.tiscali.it/ladiesweapons/weapons.html</a>  By the time my<br/>\nchildren are old enough to easily discern the difference I doubt they<br/>\nwill still want cap-guns.  Incidentally, they have done many studies<br/>\nabout children and guns.  The most notable to me, and unfortunately I<br/>\ndon&#39;t have a reference any more, was one in which they put children in a<br/>\nroom with a real gun, then observed them.  They interviewed parents, and<br/>\nthose who had taught their children a lot about guns and were certain<br/>\nthey wouldn&#39;t play with it were sadly surprised when their children did,<br/>\nindeed, handle the gun.  My instructions no more guarantee that my kids<br/>\nwill be safe when they see a gun than that they won&#39;t panic in a fire,<br/>\neven though Morgaine&#39;s been instructed in both.  <br/>\n <br/>\nOTOH, I can do the best I can to live a life which reflects my values.<br/>\nI&#39;m sure many folks on this list are Christian, and teach their children<br/>\nthat Christ died on the cross as their savior, or likewise people from<br/>\nother faiths.  My feelings about violence, and consequently violent<br/>\ntoys, are likewise to me.  I cannot and will not raise my kids in a<br/>\nvacuum; they will be exposed to many ideas.  My husband plays violent<br/>\nvideo games.  My daughter asks about them.  She may eventually ask to<br/>\nplay.  We&#39;ll discuss it then.  If she asks for a toy gun or rifle, we&#39;ll<br/>\ndiscuss that, too.  The answer will be that she can make one.  I&#39;ll help<br/>\nher.  I&#39;ll point out the fact she knows it&#39;s a toy, because she made it.<br/>\n<br/>\n <br/>\nIn the meantime, I do make choices for my kids.  I choose the beds they<br/>\nsleep in and make sure they are age-appropriate and safe, including<br/>\naccommodating them in my own bed as infants and occasionally as they<br/>\ngrow.  I choose the foods I bring into this house.  I choose not to let<br/>\nthem watch &quot;grownup shows&quot; like CSI and Kingdom Hospital even though<br/>\nthey want to.  There are lots of other things I choose that they learn<br/>\nfrom; values of kindness when I let my friend and her three kids stay<br/>\nhere in our little trailer for a while, even though Morgaine really<br/>\ndidn&#39;t want to have them living here (and quite frankly, I really wasn&#39;t<br/>\nsure I did either as I was expecting a baby any day), but we talked<br/>\nabout the fact that they had nowhere else to go because their daddy had<br/>\nhurt them, and they had to move away from their house.  In our little<br/>\ntrailer, this meant the three kids moved into Morgaine and Orion&#39;s room,<br/>\nand my friend slept on the couch.  <br/>\n <br/>\nMy choice to not allow violent toys into the home is basic to me.  It<br/>\ndoesn&#39;t mean they can&#39;t use the &quot;boffers&quot; my husband keeps at my MIL&#39;s,<br/>\nif they want.  Both our parents have squirt-guns, and we do, too, but<br/>\nhonestly, I only keep the see-through ones here.  I&#39;ve been looking for<br/>\nalternative summer water toys that function the same way without the<br/>\nshape of guns.  I choose my battles, both with my kids and my husband.<br/>\nThis is a worthy battle to me.  Not because I think violent toys make<br/>\nviolent people, but for the reasons discussed above and more.  <br/>\n <br/>\nI do, however, appreciate much of the discussion that&#39;s gone on.  It&#39;s<br/>\nalways good to get another perspective or three. <br/>\n <br/>\nKristi<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":92822,"nextTopicId":92823}}