{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"susan wilson","from":"susan wilson &lt;fxfireob@...&gt;","replyTo":"LIST","senderId":"O3mW3FoKF8RKy6jRxHU1aIVZ4xlHPp_2gmayYm5lWpdxN0LEGFjW3P3PghcZAHoWk6zchV1IuhEesN21uDkeI7RUb8LtwonU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"4th of July","postDate":"962396539","msgId":10353,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDAwNjMwMjAxOS5QQUEwNTU3M0BvZ29wb2dvLmZsYXNoLm5ldD4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":10352,"nextInTime":10354,"topicId":10353,"numMessagesInTopic":0,"msgSnippet":"hi, this was forwarded to me and i thought other might find this worth the read, the remembering and the graditude -susan, austin, tx unity through diversity","messageBody":"<div id=\"ygrps-yiv-1142372288\">hi,<br/>\n<br/>\nthis was forwarded to me and i thought other might find this worth the <br/>\nread, the remembering and the graditude<br/>\n<br/>\n-susan,<br/>\naustin, tx<br/>\n&#39;unity through diversity&#39;<br/>\n<br/>\n <br/>\n4th of July message<br/>\n<br/>\nHave you ever wondered what happened to the 56 men who signed the <br/>\nDeclaration of Independence?Five signers were captured by the British <br/>\nas traitors, and tortured before they died. Twelve had their homes <br/>\nransacked and burned.  Two lost their sons serving in the <br/>\nRevolutionary Army; another had two sons captured.Nine of the 56 <br/>\nfought and died from wounds or hardships of the Revolutionary War. <br/>\nThey signed and they pledged their lives, their fortunes, and their <br/>\nsacred honor. What kind of men were they? Twenty-four were lawyers and <br/>\njurists. Eleven were merchants, nine were farmers and large plantation <br/>\nowners; men of means, well educated.  But they signed the Declaration <br/>\nof Independence knowing full well that the penalty would be death if <br/>\nthey were captured.<br/>\n<br/>\n Carter Braxton of Virginia, a wealthy planter and trader, saw his <br/>\nships swept from the seas by the British Navy.  He sold his home and <br/>\nproperties to pay his debts, and died in rags. Thomas McKean was so <br/>\nhounded by the British that he was forced to move his family almost <br/>\nconstantly.  He served in the Congress without pay, and his family was <br/>\nkept in hiding.  His possessions were taken from him, and poverty was <br/>\nhis reward. Vandals or soldiers looted the properties of Dillery, <br/>\nHall, Clymer,Walton, Gwinnett, Heyward, Ruttledge, and Middleton.<br/>\n<br/>\nAt the battle of Yorktown, Thomas Nelson Jr, noted that the British <br/>\nGeneral Cornwallis had taken over the Nelson home for his <br/>\nheadquarters.He quietly urged General George Washington to open fire.  <br/>\nThe home was destroyed, and Nelson died bankrupt. Francis Lewis had <br/>\nhis home and properties destroyed.  The enemy jailedhis wife, and she <br/>\ndied within a few months. John Hart was driven from his wife&#39;s bedside <br/>\nas she was dying.  Their 13 children fled for their lives.  His fields <br/>\nand his gristmill were laid to waste.  For more than a year he lived <br/>\nin forests and caves, returning  home to find his wife dead and his <br/>\nchildren vanished.  A few weeks later he died from exhaustion and a <br/>\nbroken heart.Norris and Livingston suffered similar fates.  <br/>\n<br/>\nSuch were the stories and sacrifices of the American Revolution.  <br/>\nThese were not wild-eyed, rabble-rousing ruffians.  They were <br/>\nsoft-spoken men of means and education.  They had security, but they <br/>\nvalued liberty more.  Standing tall, straight, and unwavering, they <br/>\npledged:  &quot;For the support of this declaration, with firm reliance on <br/>\nthe protection of divine providence, we mutually pledge to each other, <br/>\nour lives, our fortunes, and our sacred honor.&quot; They gave you and me a <br/>\nfree and independent America.  The history books  never told you a lot <br/>\nabout what happened in the Revolutionary War.  We didn&#39;t fight just <br/>\nthe British.  We were British subjects at that time and we fought our <br/>\nown government!<br/>\n<br/>\n87 Years later, equally principled men met at a crossroads town in <br/>\nPennsylvania and sanctified that ground forever with blood shed in <br/>\ndefense of their principles.  Whatever your geographic or political <br/>\npoint of view, you cannot help but admire the courage and fortitude of <br/>\nmen like Joshua Chamberlain and Lew Armistead.  Gettysburg in 1863, <br/>\nlike Philadelphia in 1776, San Juan Hill in 1899, Midway Island in <br/>\n1942, and Normandy in 1944, were all turning points in the course of <br/>\nAmerican history at which everyday Americans risked everything and <br/>\nstood up to be counted.<br/>\n<br/>\nSome of us take our liberties so much for granted, but we shouldn&#39;t. <br/>\nSo, take a few minutes this year while enjoying your 4th of July <br/>\nholiday and silently thank the patriots of the past.  It&#39;s not much to <br/>\nask for the price they paid.  Remember: freedom is never free!</div>","specialLinks":[]}],"prevTopicId":9924,"nextTopicId":10335}}