{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":4043487,"authorName":"Halo5964@aol.com","from":"Halo5964@...","profile":"halo5964","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Syndi","postDate":"1068903692","msgId":84812,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3LjI0ZTdiMzJhLjJjZTc4NzBjQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":84811,"nextInTime":84813,"topicId":84812,"numMessagesInTopic":0,"msgSnippet":"Syndi- I certainly feel your pain.  If you were near by I d want to give you a hug, but since I can t, mentally give yourself one. One thing I ve noticed, not","messageBody":"<div id=\"ygrps-yiv-937782255\">Syndi-<br/>\n<br/>\nI certainly feel your pain.  If you were near by I&#39;d want to give you a hug, <br/>\nbut since I can&#39;t, mentally give yourself one.  <br/>\n<br/>\nOne thing I&#39;ve noticed, not just with unschoolers but with homeschoolers as <br/>\nwell, when we are new to this environment, quite a few of us find out about <br/>\nboundaries that have never been set with our families.  This uncle should never <br/>\nhave the feeling that he can approach a subject like this with your children.  <br/>\nI welcome any inquiries my family has, as long as they ask ME, in a respectful <br/>\nway.  Casual questions they would ask my chidren anyway, like how&#39;s school <br/>\ngoing, etc., I don&#39;t address because that is &quot;normal&quot; and respectful.  My <br/>\ngrandparents (my children&#39;s great-grandparents) started out from day one encouraging <br/>\nme and my son in our homeschooling quest.  Unfortunately, my grandmother died <br/>\nbefore I started unschooling, but their tone set the tone for the whole <br/>\nfamily.  Maybe there is one person in the family this uncle respects that can give <br/>\nyou encouragement and support when he is around, and maybe you can set some <br/>\nboundaries and let him know it is NOT alright to address such an issue with your <br/>\nchildren.  That is a passive aggressive way of trying to undermine your <br/>\nchildren&#39;s confidence in decisions you make regarding them, and really, in my <br/>\nopinion, should not be tolerated.  I am constantly suprised at the gall family <br/>\nmembers have in their approaching the subject of homeschooling and unschooling.  <br/>\nWhile I understand the concept that was recently addressed, I think by Sandra, <br/>\nabout how these family members are scared because they don&#39;t know what to <br/>\nexpect, have you gone out and joined some cult, etc., the information is readily <br/>\navailable on the internet, the library, and whatever happened to lovingly <br/>\nquestioning with the pretense of supporting and encouraging your adult child in <br/>\nwhatever they want to pursue?  We aren&#39;t talking about radical religion or abuse. <br/>\n Syndi, you are doing what you as the parent have decided is the best choice <br/>\nfor your children.  You have said how wonderful you already feel.  Trust your <br/>\nfeelings.  The only times I&#39;ve made mistakes I&#39;ve regretted is when I did not <br/>\ntrust my own gut feelings about my children.  Only you in your heart know <br/>\nwhether this is the right decision for you and your children.  From what you&#39;ve <br/>\nindicated, you are following your heart.  How blessed your children are!  Does <br/>\nuncle have any children?  It makes me wonder what kind of parent he is or might <br/>\nbe.  My sister thinks homeschooling is something I&#39;ve &quot;done&quot; to my son, yet <br/>\nshe and her husband both work and have shipped their kids off to day care and <br/>\nschool since day one.  Bullies beat my nephew up on an almost daily basis, and <br/>\nshe does nothing.  And I&#39;m going to let HER opinion of <br/>\nhomeschooling/unschooling influence ME?  I don&#39;t think so.  I know this is long, and I&#39;m sorry.  To <br/>\nsum it up, be at peace with yourself and your decisions, and establish some <br/>\nboundaries.  If family members want to discuss in a respectful way, by all means, <br/>\neducate them.  If not, they need to shut up.  Hang in there, we are all here <br/>\nwith you.<br/>\n<br/>\nCarol<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":84757,"nextTopicId":84813}}