{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Priss1000@xxx.xxx","from":"Priss1000@...","replyTo":"LIST","senderId":"Tib6luGp2j_iDD6p99Bcl9TCbe9rrQwTFsV7gtC5WlvM-7l00m3YAx508v4itZaeGSOwDhrlabU","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Introducing Myself (long)","postDate":"928502487","msgId":408,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDE1NjAyNy40OC40MDguOTU5MjY5NzM5QGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":407,"nextInTime":409,"topicId":408,"numMessagesInTopic":0,"msgSnippet":"... I haven t been able to catch up entirely on all the digests of the last day, but I wanted to do a quick intro and tell Ann in NC that I m near Greenville, ","messageBody":"<div id=\"ygrps-yiv-1940960897\"><blockquote><span title=\"ireply\">&gt;&gt;  I know live about 4 hours from you, near Tryon, NC&lt;&lt;<br/>\n<br/>\n </span></blockquote>I haven&#39;t been able to catch up entirely on all the digests of the last day, <br/>\nbut I wanted to do a quick intro and tell Ann in NC that I&#39;m near Greenville, <br/>\nSC, not far away. Also we&#39;re looking hard and heavy into moving up your way. <br/>\nWe want to move to Saluda which is right down the road from you. We have real <br/>\nestate guides from up there coming out of our ears right now! It&#39;s probably a <br/>\npipe dream until our 18 year old gets out of college though :( Maybe we can <br/>\nmeet sometime? <br/>\n<br/>\nI&#39;ve been homeschooling my 8 year old son for a year now. I&#39;m didn&#39;t unschool <br/>\nthis year but I&#39;m so intrigued by it. My husband is supportive of <br/>\nhomeschooling but not of unschooling. He is an engineer so he insists that we <br/>\ncover math every day. I love math myself and want my son to enjoy it so I <br/>\nlike working with him on it. Other than that we were pretty loose, but I <br/>\ncannot claim the unschooling tag. We are taking a little summer break from <br/>\neven the math right now and my son has delighted us by immediately wanting to <br/>\nlearn about Native Americans and ancient Egypt. If the summer continues like <br/>\nthis, perhaps my husband will look more favorably upon unschooling. <br/>\n<br/>\nI also have two older children, daughters 18 and nearly 22. They weren&#39;t <br/>\nhomeschooled but now that they see how much fun their brother has, they wish <br/>\nthey had been. I never considered it when they were young since I thought <br/>\nhomeschooling could only be very structured and very religious, neither of <br/>\nwhich we were. There are many many homeschoolers in Greenville but they are <br/>\nnearly all fit that profile. (Greenville is the home of Bob Jones University, <br/>\nknown for very structured homeschooling materials) Since we don&#39;t want to <br/>\njoin a statement of faith homeschool group, we don&#39;t have too many homeschool <br/>\nfamilies to hang out with. I have met a few though and I&#39;d love to meet more.<br/>\n<br/>\nThat&#39;s about it for us. I&#39;m enjoying this list but I don&#39;t know when I&#39;ll <br/>\never catch up with all the mail!!<br/>\n<br/>\nPriss in SC</div>","specialLinks":[]}],"prevTopicId":268,"nextTopicId":269}}