{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"READ"},{"name":"UPDATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":67247159,"authorName":"Nanci Kuykendall","from":"Nanci Kuykendall &lt;aisliin@...&gt;","profile":"aisliin","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"[AlwaysLearning] What to Do","postDate":"1065642229","msgId":16578,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDMxMDA4MTk0MzQ5LjYyODIxLnFtYWlsQHdlYjEzNzA0Lm1haWwueWFob28uY29tPg==","inReplyToHeader":"PDEwNjU1OTA2MTkuMjM2Ni43NDgzOS5tMTFAeWFob29ncm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":16577,"nextInTime":16579,"topicId":16578,"numMessagesInTopic":0,"msgSnippet":"Well, I had a nice big long, and I hope helpful, response typed out yesterday.  But my computer ate it. I was too frustrated to redo it. At any rate, I have","messageBody":"<div id=\"ygrps-yiv-28901204\">Well, I had a nice big long, and I hope helpful,<br/>\nresponse typed out yesterday.  But my computer ate it.<br/>\n I was too frustrated to redo it.<br/>\n<br/>\nAt any rate, I have boys, and one (Thomas, almost 7)<br/>\nwho has issues with explosive temperment, anger<br/>\nmanagement, appropriate behaviors, etc.  I concur with<br/>\nthose who said that the parents can feel worn down,<br/>\nexhausted, at a loss as to what to do or how to react<br/>\nto their child&#39;s behavior.  It&#39;s hard to have the kid<br/>\nthat everyone thinks is a &quot;brat&quot; or a &quot;bad seed.&quot; <br/>\nIt&#39;s hard to know how to respond when people seem to<br/>\nact like we train them at home to be as bad as<br/>\npossible in public.<br/>\n<br/>\nThomas has learned from lots of modeling,<br/>\nintervention, posistive reinforcement, and gentle<br/>\ncorrection.  Older children and adults are often<br/>\nbetter playmtes for kids like this, as they are better<br/>\nable to handle outbursts, keep the kids under control<br/>\n(by physical constraint if necessary) and not take<br/>\nthings personally. I also agree that this child should<br/>\nbe watched more closely by someone willing to<br/>\nintervene before or during explosions and willing to<br/>\ntalk to him honestly, but not judgementally, about his<br/>\nbehavior.  They are often more scared by their strong<br/>\nand overpowering emotions than those around them. <br/>\nAnger becomes an alternative expression for their fear<br/>\nand anxiety (much accepted and encouraged in western<br/>\nmales unfortunately.)<br/>\n<br/>\nThomas does better in reduced stress situations.  When<br/>\nhe was littler, I didn&#39;t take him to the park if there<br/>\nwere a lot of people there, or we went to a less<br/>\ncrowded park.  Too many people means too much input,<br/>\nand invariably a meltdown.  He&#39;s been described by<br/>\nsome of the various drug touting &quot;letter people&quot; we<br/>\ngave up seeing (Dr.s, counselors etc) as &quot;a kid on<br/>\nconstant overload&quot; because of his difficulties<br/>\nfiltering his sensory information.  It just all pours<br/>\ninto him at once.  While that means he is precocious,<br/>\ndoesn&#39;t miss a trick, is quick witted and intelligent,<br/>\nit also means he is easily stressed out and thrown by<br/>\ntoo much to take in, can&#39;t tune things out, is<br/>\nbothered by noises, sensations, smells, etc that most<br/>\nof us would not notice.  <br/>\n<br/>\nWe have to take parties, carnivals, and other public<br/>\nactivities in small doses and be mindful of his<br/>\ncurrent level of overall life stress when planning<br/>\nwhether or not to attend things.  We stay home more<br/>\nwhen there are things happening that cause stress in<br/>\nthe family or for him.  He is hyper sensative to<br/>\nothers&#39; feelings and will cry when someone else is<br/>\nhurt, but in a public situations when he is distracted<br/>\nby intense activity levels he can be stunningly<br/>\nthoughtless of others and have great remorse over it<br/>\nwhen it is called to his attention.<br/>\n<br/>\nNow I don&#39;t know if this other kid is anything like<br/>\nThomas, but it&#39;s quite possible that if you only see<br/>\nhim in an active setting like the park days, that<br/>\nyou&#39;re only seeing him at his worst and most stressed<br/>\nout.  Thomas talks fast, moves fast (we always say he<br/>\nnever learned to walk, he learned to run) and seems<br/>\nreally hyperactive, because that is the speed at which<br/>\nthe world moves for him.  We try to slow things down<br/>\nfor him as much as possible, keep noise to a minimum<br/>\nof sources at home, play board games, read stories,<br/>\nplay computer strategy and mystery games, watch movies<br/>\nthat are more calm and musical and less violent. <br/>\nThomas is passionate about movies and loves high<br/>\nfantasy (knights, dragons, etc) but we try to keep<br/>\nthat to only one movie like that a day, so he can<br/>\ndigest it better.  We don&#39;t have commercial tv at all,<br/>\nwhich helps a lot.  He is like a mirror and reflects<br/>\nback what is around him.  When we take time to create<br/>\na calmer home environment, he is more calm and more<br/>\nfocused and centered himself, and more content.<br/>\n<br/>\nAnyway, this is from the perspective of someone who<br/>\nhas a child with these issues.  Thomas gets better and<br/>\nbetter every year at self control and appropriate<br/>\nbehaviors, cause and effect and not modeling<br/>\neverything he sees or hears.  He&#39;s a good lesson to us<br/>\nthough, to keep out tempers and watch what we say to<br/>\nand about others or ourselves, because we&#39;ll get it<br/>\nback WHAM right in our faces from him if we don&#39;t.  At<br/>\nnearly 7 he is almost always perfectly polite in<br/>\npublic and when things start to disentigrate it means<br/>\nhe has had enough and it&#39;s time to go.  Occassionally<br/>\nwe still get screaming fits and he has to be carried<br/>\nto the car or another quiet place until he is calm,<br/>\nbut he doesn&#39;t hit or lash out physically to other<br/>\nkids anymore.  OK well, except for his brother on<br/>\noccassion, but I&#39;m sure they&#39;ll be engaging in that<br/>\nsport of brotherly love until they are well taller<br/>\nthan me.<br/>\n<br/>\nTalk to the child directly, like you would your own<br/>\nchild or a friends child (as someone suggested) with<br/>\nbrief, matter of fact statements about what IS and<br/>\nwhat IS NOT acceptable behavior.  Try to say positive<br/>\nthings to them too, when you notice them behaving,<br/>\ncompliments about things &quot;Wow great jumping!&quot; or &quot;I<br/>\nreally like you when you smile.&quot;  That sort of thing. <br/>\nPositive reinforcement goes a long way, plus it will<br/>\nhelp to build a bridge of trust between you so that he<br/>\nwill out more weight behind what you say.  I hope this<br/>\nhelps.<br/>\n<br/>\nNanci K.</div>","specialLinks":[]}],"prevTopicId":16576,"nextTopicId":16560}}