{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":126884268,"authorName":"HMSL2@aol.com","from":"HMSL2@...","profile":"dobsiedoe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"I can do guns, it&#39;s the gore..LONG.","postDate":"1070719181","msgId":85737,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGE3LjM5OTU0ZjM1LjJkMDMzYWNkQGFvbC5jb20+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":85736,"nextInTime":85738,"topicId":85737,"numMessagesInTopic":0,"msgSnippet":"Our son has a BB gun, paintball gun, a compound bow and a shot gun. We live in Maine The Way Life Should Be , many kids here have them/their parents have","messageBody":"<div id=\"ygrps-yiv-671388546\">Our son has a BB gun, paintball gun, a compound bow and a shot gun.<br/>\n<br/>\nWe live in Maine &quot;The Way Life Should Be&quot; , many kids here have them/their <br/>\nparents have them for them. Maybe we are behind in the times I dont know? Maybe <br/>\nwe are preserving old traditions? Whatever it is from this side of the street <br/>\nit looks and feels like old times/holsome family traditions.<br/>\nThey dont kill people or hurt them. They have been taught what they are for <br/>\nand how to use them.<br/>\n<br/>\nDustin and my husband have been hunting for several years now.  Every year <br/>\nfor two months each weekend day they hunt. So far the last two years they have <br/>\nnot found a deer that was suitable.  Roughly that&#39;s 16 days a season and 128 <br/>\nhrs of sitting in the woods and talking about the woods, life, animals, guns, <br/>\npeople, history and so on...  My husband has taught our son what to look for in <br/>\na deer, tree scrapings, branch signs, sounds and what bedding areas look like. <br/>\n I am not fond of deer meat but they like it. Luckily for me they have only <br/>\nshot 2 in 6yrs. Personally sitting in the woods freezing doesn&#39;t interest me at <br/>\nall but they dont seem to mind it!<br/>\n<br/>\nAs a family we used to go to 3D shoots.  That is using a recurve or compound <br/>\nbow walking a trails with 30 targets, standing at the stake knowing the <br/>\nyardage and hitting the target with an arrow in the score zone.  We have a fake deer <br/>\nin our yard that we shoot at some times. We dont go that ofetn anymore due to <br/>\nthe little ones.<br/>\n<br/>\nOur son shoots his BB and sling shot in the yard with his friends. They aim <br/>\nat cans or a box. They know what I consider safe. They wear protective lenses <br/>\nand shot one at a time or on a line.  So far it kinda reminds me of something <br/>\nout of the Stand By Me movie or Sandlot. It&#39;s old-time childhood fun without <br/>\nthe &quot;you&#39;ll shot your eye out&quot; comments (Christmas Story).<br/>\n<br/>\nWe dont live in an area where people get shot hardly ever or go nuts with <br/>\nguns. For us the gun criminals are mostly formers from another state.  <br/>\nI know my son I know what we contribute to his life. I know his experience <br/>\nwith guns has been a positive one. He knows how to clean them, load um, make the <br/>\nshells and will have his own man-ly weekend trips im sure. My husbands dad <br/>\nstill hunts with them so I suspect they will do the same when he has children.<br/>\n<br/>\nHe has been to Maine Conservation Camp and loves to woods. He takes walks <br/>\nleaving a trails to see if he can find his way. He uses his compass and skills. I <br/>\nam confident that he could find his way out if he was ever lost.<br/>\nHe plans to be a fish and game officer or join the military.  Whatever he <br/>\nchooses be it those or not he has found interest in something and I think its <br/>\ngreat. <br/>\nLaura<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":85697,"nextTopicId":85738}}