{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nice phrase about homeschoolers, from the outside","postDate":"1326172300","msgId":64874,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVFNDAyQjZDLUE0N0YtNDgwMi05QTU1LTJGREU3MDkwQTBDNkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRzB1VzhuRlVjTkxKTThRZTVpeUVvVkpoTzRiM2g2eUJBYl9qQWFUbXV5c01rQXRFZ0BtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PDMzODlCQ0EwLTg1ODctNERGNy05MURBLUMzQjgyQzVGRTQyN0BTYW5kcmFkb2RkLmNvbT4gPENBRzB1VzhuRlVjTkxKTThRZTVpeUVvVkpoTzRiM2g2eUJBYl9qQWFUbXV5c01rQXRFZ0BtYWlsLmdtYWlsLmNvbT4="},"prevInTopic":64872,"nextInTopic":0,"prevInTime":64873,"nextInTime":64875,"topicId":64842,"numMessagesInTopic":0,"msgSnippet":"Fundie is a sometimes friendly, sometimes not, abbreviation for fundamentalist Christian. Feral is feral--like a cat that was born domesticated, and went","messageBody":"<div id=\"ygrps-yiv-1525195442\">&quot;Fundie&quot; is a sometimes friendly, sometimes not, abbreviation for &quot;fundamentalist Christian.&quot;<br/>\n<br/>\n&quot;Feral&quot; is feral--like a cat that was born domesticated, and went wild later.  Or a human child raised in the wilderness, somehow.<br/>\n<br/>\nSome of the most famous feral children were in France and India.<br/>\n<br/>\nThere&#39;s a pretty cool movie about this kid:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Victor_of_Aveyron\">http://en.wikipedia.org/wiki/Victor_of_Aveyron</a><br/>\nFrançois Truffaut&#39;s 1970 film L&#39;Enfant sauvage (marketed in the UK as The Wild Boy and in the US as The Wild Child).<br/>\n<br/>\nAnother 18th Century French child:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mysteriouspeople.com/feral_child.htm\">http://www.mysteriouspeople.com/feral_child.htm</a><br/>\n<br/>\nUnschoolers shouldn&#39;t leave their children that much &quot;in charge of their own education.&quot;<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":261223738,"authorName":"Claire Darbaud","from":"Claire Darbaud &lt;cdarbaud@...&gt;","profile":"cdarbaud","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Nice phrase about homeschoolers, from the outside","postDate":"1326164928","msgId":64872,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRzB1VzhuRlVjTkxKTThRZTVpeUVvVkpoTzRiM2g2eUJBYl9qQWFUbXV5c01rQXRFZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PDMzODlCQ0EwLTg1ODctNERGNy05MURBLUMzQjgyQzVGRTQyN0BTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PDMzODlCQ0EwLTg1ODctNERGNy05MURBLUMzQjgyQzVGRTQyN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":64842,"nextInTopic":64874,"prevInTime":64871,"nextInTime":64873,"topicId":64842,"numMessagesInTopic":0,"msgSnippet":"Can you explain what the words fundie and feral mean? 2012/1/9 Sandra Dodd  ... [Non-text portions of this message have been","messageBody":"<div id=\"ygrps-yiv-693811752\">Can you explain what the words &quot;fundie&quot; and &quot;feral&quot; mean?<br/>\n<br/>\n2012/1/9 Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I was corresponding online with someone I know at a distance, and from<br/>\n&gt; another entire &quot;line of life.&quot; He works doing historical interpretation<br/>\n&gt; (like a history farm, but not exactly) on another continent, so I don&#39;t<br/>\n&gt; know anything about the place at all. We both spent lots of our adult lives<br/>\n&gt; in the Society for Creative Anachronism (medieval history co-op, basically)<br/>\n&gt; and have been involved in administration, the arts, and the philosophical<br/>\n&gt; end (virtues/chivalry).<br/>\n&gt;<br/>\n&gt; He wrote, of dealing with homeschoolers in his work:<br/>\n&gt;<br/>\n&gt; &quot;I know of groups that do it for the right reasons, and have done work for<br/>\n&gt; them... but they tend to get drowned out by the freak shows at either end<br/>\n&gt; of the social spectrum, the fundies and the ferals.&quot;<br/>\n&gt;<br/>\n&gt; I Hooooted. He couldn&#39;t hear me. I told him I wanted to quote this and he<br/>\n&gt; said fine.<br/>\n&gt;<br/>\n&gt; And so I can add to my growing store of unschooling advice, I guess,<br/>\n&gt; &quot;Neither a fundie nor a feral be.&quot;<br/>\n&gt;<br/>\n&gt; THAT is the vaguely discussed problem that has nosed in here from time to<br/>\n&gt; time, but didn&#39;t have a good name. Feral.<br/>\n&gt;<br/>\n&gt; When parents collect up a bunch of slogans about &quot;freedom&quot; and &quot;in control<br/>\n&gt; of their own learning&quot; and &quot;responsible for his own education&quot; and<br/>\n&gt; &quot;non-coercion&quot; (to the point that they don&#39;t want to ask a kid to wipe his<br/>\n&gt; butt for fear of being coercive), they sometimes have no room left for<br/>\n&gt; figuring out how to be a good, responsible parent who is aware of what the<br/>\n&gt; child needs to know to get along in the world and behave in sensible ways<br/>\n&gt; for actual, logical reasons, and they end up with children who seem to have<br/>\n&gt; been raised by coyotes.<br/>\n&gt;<br/>\n&gt; I would say &quot;just sayin&#39;,&quot; but it&#39;s much more than that.<br/>\n&gt;<br/>\n&gt; It&#39;s why I will say &quot;Learning should be first&quot; everytime anyone goes on<br/>\n&gt; about how it&#39;s nothing but a lifestyle, it&#39;s all about relationships,<br/>\n&gt; families should avoid &quot;learning situations&quot; and anything that could be<br/>\n&gt; construed as &quot;educational.&quot;<br/>\n&gt;<br/>\n&gt; If a family looks at learning (that of the children, that of the parents),<br/>\n&gt; seeing the world as a rich and wonderful place, and helping their children<br/>\n&gt; learn to live gracefully within it, they will have ALL those good<br/>\n&gt; things--learning, relationships, non-coercion. But if a family starts<br/>\n&gt; anywhere except with learning, they can easily cut themselves off from how<br/>\n&gt; to see and use and live the learning part of life, and they can be stuck in<br/>\n&gt; stagnant little eddy, having created the dam with their own enthusiasm to<br/>\n&gt; be different, to &quot;be radical,&quot; to live in reaction-mode.<br/>\n&gt;<br/>\n&gt; Sandra<br/>\n&gt;<br/>\n&gt; P.S. No, I&#39;m not apologizing; not for my friend&#39;s terminology nor at<br/>\n&gt; having laughed happily at the vision of it. Don&#39;t ask for any apologies.<br/>\n&gt; Any rude e-mail on the side will be brought to the list and nailed up in<br/>\n&gt; public.<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Nice phrase about homeschoolers, from the outside","postDate":"1326139325","msgId":64842,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDMzODlCQ0EwLTg1ODctNERGNy05MURBLUMzQjgyQzVGRTQyN0BTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":64872,"prevInTime":64841,"nextInTime":64843,"topicId":64842,"numMessagesInTopic":0,"msgSnippet":"I was corresponding online with someone I know at a distance, and from another entire line of life.   He works doing historical interpretation (like a","messageBody":"<div id=\"ygrps-yiv-1234694057\">I was corresponding online with someone I know at a distance, and from another entire &quot;line of life.&quot;   He works doing historical interpretation (like a history farm, but not exactly) on another continent, so I don&#39;t know anything about the place at all.  We both spent lots of our adult lives in the Society for Creative Anachronism (medieval history co-op, basically) and have been involved in administration, the arts, and the philosophical end (virtues/chivalry).<br/>\n<br/>\nHe wrote, of dealing with homeschoolers in his work:<br/>\n<br/>\n&quot;I know of groups that do it for the right reasons, and have done work for them... but they tend to get drowned out by the freak shows at either end of the social spectrum, the fundies and the ferals.&quot;<br/>\n<br/>\nI Hooooted.  He couldn&#39;t hear me.  I told him I wanted to quote this and he said fine.<br/>\n<br/>\nAnd so I can add to my growing store of unschooling advice, I guess, &quot;Neither a fundie nor a feral be.&quot;<br/>\n<br/>\nTHAT is the vaguely discussed problem that has nosed in here from time to time, but didn&#39;t have a good name.  Feral.  <br/>\n<br/>\nWhen parents collect up a bunch of slogans about &quot;freedom&quot; and &quot;in control of their own learning&quot; and &quot;responsible for his own education&quot; and &quot;non-coercion&quot; (to the point that they don&#39;t want to ask a kid to wipe his butt for fear of being coercive), they sometimes have no room left for figuring out how to be a good, responsible parent who is aware of what the child needs to know to get along in the world and behave in sensible ways for actual, logical reasons, and they end up with children who seem to have been raised by coyotes.  <br/>\n<br/>\nI would say &quot;just sayin&#39;,&quot; but it&#39;s much more than that.<br/>\n<br/>\nIt&#39;s why I will say &quot;Learning should be first&quot; everytime anyone goes on about how it&#39;s nothing but a lifestyle, it&#39;s all about relationships, families should avoid &quot;learning situations&quot; and anything that could be construed as &quot;educational.&quot;<br/>\n<br/>\nIf a family looks at learning (that of the children, that of the parents), seeing the world as a rich and wonderful place, and helping their children learn to live gracefully within it, they will have ALL those good things--learning, relationships, non-coercion.  But if a family starts anywhere except with learning, they can easily cut themselves off from how to see and use and live the learning part of life, and they can be stuck in stagnant little eddy, having created the dam with their own enthusiasm to be different, to &quot;be radical,&quot; to live in reaction-mode.<br/>\n<br/>\nSandra<br/>\n<br/>\nP.S.  No, I&#39;m not apologizing; not for my friend&#39;s terminology nor at having laughed happily at the vision of it.  Don&#39;t ask for any apologies.  Any rude e-mail on the side will be brought to the list and nailed up in public.</div>","specialLinks":[]}],"prevTopicId":64808,"nextTopicId":64723}}