{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"UPDATE"},{"name":"DELETE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":133758281,"authorName":"Flo Gascon","from":"&quot;Flo Gascon&quot; &lt;flogascon@...&gt;","profile":"flo_gascon","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"REGISTRATION CLOSES IN 4 WEEKS- Good Vibrations Conference","postDate":"1246486521","msgId":46184,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGgyZ241cCtlcGkyQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":0,"prevInTime":46183,"nextInTime":46185,"topicId":46184,"numMessagesInTopic":0,"msgSnippet":"Good Vibrations Unschooling Conference REGISTRATION IS ENDING in only 4 WEEKS- Aug 1st !! Register NOW and spread the word. You know the vitality of feeling","messageBody":"<div id=\"ygrps-yiv-155523461\">Good Vibrations Unschooling Conference REGISTRATION IS ENDING in only 4 WEEKS- Aug 1st !! Register NOW and spread the word.<br/>\n<br/>\nYou know the vitality of feeling supported, understood, encouraged and alive? Radical unschooling represents a life lived from the inside out. Live freely, explore passions, and make deep connections. Immerse yourself in unschooling at the inaugural Good Vibrations Unschooling Conference in San Diego, CA. Whether you are curious about unschooling or were among the first, this gathering is for<br/>\nyou.<br/>\n<br/>\nFor FOUR full days, we&#39;ll inspire, discuss, play and spread lots of bubbly energy as only unschoolers can. Children are happily welcomed, so bring the whole family- there&#39;s something for everyone! Come ask questions, offer your sage advice, relax, renew and recharge with unschoolers from all over. Leave invigorated and whole and maybe a little sandy!<br/>\n<br/>\nOur base camp for Good Vibrations is the Doubletree Hotel San Diego/Del Mar, a beautiful and conveniently located hotel less than two miles from the world-renowned Torrey Pines State Reserve and Beach. Between sessions, swim in their gorgeous heated pool beneath palm trees, go for a hike at the reserve, or take a nap in the luxurious Sweet Dreams beds. Feel pampered while on this<br/>\nspecial family vacation.<br/>\n<br/>\nThings will get rolling Thursday with registration from Noon-2:00. Once you&#39;ve registered at the hotel, head over to the beach for the Welcoming Party! Get to know fellow unschoolers with games, laughter and digging your toes in the sand.<br/>\n<br/>\nFriday through Sunday afternoon a variety of activities are planned. Hear presentations from some of the most inspiring voices from the unschooling community. Play in a funshop or just kick back by the pool. Get your game on in a room devoted to video gaming fans. Stretch your mind at a roundtable discussion; get new ideas and practical solutions to enhance your unschooling life. Men are invited to throw caution to the wind at the meeting of SSUDs (Secret Society of Unschooling Dads). Find new friends in the lobby and head<br/>\nout for lunch in a nearby beach-town café.<br/>\n<br/>\nYou may already know our presenters:<br/>\n<br/>\nMiranda Demarest, unschooling mama, writer and thinker extraordinaire, will be sharing Radical Thoughts for Radical Unschoolers.<br/>\n<br/>\nSandra Dodd, long-time unschooling and peaceful parenting advocate, writer and speaker, will be sharing her extensive understanding of unschooling with two informative, inspiring presentations. Having always unschooled her three grown and very nearly-grown children, Sandra has inspired countless families with her ruminations and experience of choosing happiness to create an environment in<br/>\nwhich learning thrives.<br/>\n<br/>\nRain Fordyce is a popular life coach who is blazing her trail to live<br/>\nauthentically. She will be hosting an interactive session on how to live your best life and enhance your unschooling experience by ending resistance.<br/>\n<br/>\nBeth Fuller, co-moderator of the Peaceful Partnerships yahoo group and<br/>\nall-around joyous spirit, will discuss how unschooling has affected the relationships in her life, from her child to her husband to her mother. Come hear a first-hand account of an unschooling life with How We Roll.<br/>\n<br/>\nErika B. Perkins is a native San Diegan with an enthusiasm and zest for life that is unrivaled. She looks a bit differently at the world as an author, businesswoman, organic gardener and Mom. Join her as she shares details of her Mission: Have Fun, Prime Directive: Harm None.<br/>\n<br/>\nJeff Sabo is an unschooling dad who works in Human Resources during the day and laughs and plays with his family upon returning home in the evening. He will talk about the benefits of a passion and integrating them into our unschooling lives during his presentation In Pursuit of a Passionate Life.<br/>\n<br/>\nPam Sorooshian has shared advice and help for unschooling for many, many years through several avenues, mainly writing and speaking. Her two presentations will offer advice for relaxing into unschooling, yes, even math, and share the wealth of knowledge she has gained from raising three unschooled daughters to young adulthood.<br/>\n<br/>\nRoya Sorooshian, grown, happy, productive 4th grade dropout and radical unschooler will be answering the burning question on everyone&#39;s lips: Will unschoolers raise their children the same way? Come find out as you hear Roya Repeating Herself.<br/>\n<br/>\nSpecial events are planned!<br/>\n<br/>\nFriday evening, the talented and energetic Amy Steinberg will be performing a concert guaranteed to have everyone on their feet dancing and singing along.  Stay after the concert to celebrate in a Family Fair atmosphere and participate in the Silent Auction and Artisan Bazaar.<br/>\n<br/>\nSaturday night, enjoy an all ages talent show where everyone is welcoming with warm applause and celebrated with loud cheering.<br/>\n<br/>\nSunday night we&#39;ll bid adieu with one last party at the Farewell Dance. Kick off your shoes and jump around with your friends, old and new, get in all those last hugs and gather up lots of the buzzing energy to sustain you for months to come.<br/>\n<br/>\nIf you just can&#39;t get enough, you are invited to stay through Monday and join us for a picnic in beautiful Balboa Park, the jewel of San Diego. Home to the Zoo and several fascinating museums, this is your last chance to bask in the warm combination of unschoolers and Southern California.<br/>\n<br/>\n<br/>\nWhether you are curious about unschooling or were among the first, the Good Vibrations Unschooling Conference is for you. Join with families from around the country who prioritize the symbiotic relationship between happy, peaceful relationships and a lifelong love of connection and learning. We invite you to join us in the sand and sun to pick up some long-lasting good vibrations!<br/>\n<br/>\nTo learn more and to register, please visit <a rel=\"nofollow\" target=\"_blank\" href=\"http://goodvibrationsconference.com\">http://goodvibrationsconference.com</a><br/>\n<br/>\nREMEMBER: Registration CLOSES August 1!! REGISTER NOW<br/>\n<br/>\nEmail me anytime at flogascon@... and please join the conference yahoo<br/>\ngroup to get updates and share the excitement:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/GoodVibrationsConference/\">http://groups.yahoo.com/group/GoodVibrationsConference/</a><br/>\n<br/>\n<br/>\nFlo Gascon<br/>\nConference Coordinator<br/>\nGood Vibrations Unschooling Conference<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://goodvibrationsconference.com\">http://goodvibrationsconference.com</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/GoodVibrationsConference/\">http://groups.yahoo.com/group/GoodVibrationsConference/</a></div>","specialLinks":[]}],"prevTopicId":46176,"nextTopicId":46182}}