{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":3,"messages":[{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] a beginner&#39;s question and my response","postDate":"1249686155","msgId":46632,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg0RkM5MDhDLTExRTAtNEFGMy05RTBFLTg1Q0YxODY1Qzg4OUBjb3gubmV0Pg==","inReplyToHeader":"PERCQkJCNjU2LTJBQ0QtNDREMS04RUIzLTRFQjE1QjgxQjZDNkBzYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PERCQkJCNjU2LTJBQ0QtNDREMS04RUIzLTRFQjE1QjgxQjZDNkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46631,"nextInTopic":0,"prevInTime":46631,"nextInTime":46633,"topicId":46621,"numMessagesInTopic":0,"msgSnippet":"... I know a 10 y.o. isn t a baby, but I was reminded of this poem, anyway.  And it s as old as me :-) ","messageBody":"<div id=\"ygrps-yiv-844127647\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt;<br/>\n&gt; Is  unschooling  all  about  making  time  to  play  with  child .<br/>\n&gt; Mine  is  10  and  still  doesnt  want  to  go  to  school  and She<br/>\n&gt; sometimes  wants  to    but   She  wants  to  play  all  the  time.<br/>\n&gt; So  I  ALLOW  HER  TO  DO  so  and  I  cant  all  the  time  because<br/>\n&gt; if  shes  not  going  to  do  chores  then  they  all  fall  on  me<br/>\n&gt; I  HAVE  TO  GET  THEM  DONE  and  I  cant  play  with  her<br/>\n<br/>\n </span></blockquote>I know a 10 y.o. isn&#39;t a baby, but I was reminded of this poem,  <br/>\nanyway.  And it&#39;s as old as me :-)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.mycharmingkids.net/2009/03/babies-dont-keep.html\">http://www.mycharmingkids.net/2009/03/babies-dont-keep.html</a><br/>\n(I had to Google it, and found it at this blog)<br/>\n<br/>\n<br/>\n  Ruth Hulburt Hamilton, Song for a Fifth Child, written in 1958 and  <br/>\nfirst published in the Ladies Home Journal<br/>\n<br/>\nSong for a Fifth Child.<br/>\n<br/>\nMother, O Mother, come shake out your cloth,<br/>\nEmpty the dustpan, poison the moth,<br/>\nHang out the washing, make up the bed,<br/>\nSew on a button and butter the bread.<br/>\n<br/>\nWhere is the mother whose house is so shocking?<br/>\nShe&#39;s up in the nursery, blissfully rocking.<br/>\n<br/>\nOh, I&#39;ve grown as shiftless as Little Boy Blue,<br/>\nLullabye, rockabye, lullabye loo.<br/>\nDishes are waiting and bills are past due<br/>\nPat-a-cake, darling, and peek, peekaboo<br/>\n<br/>\nThe shopping&#39;s not done and there&#39;s nothing for stew<br/>\nAnd out in the yard there&#39;s a hullabaloo<br/>\nBut I&#39;m playing Kanga and this is my Roo<br/>\nLook! Aren&#39;t his eyes the most wonderful hue?<br/>\nLullabye, rockaby lullabye loo.<br/>\n<br/>\nThe cleaning and scrubbing can wait till tomorrow<br/>\nBut children grow up as I&#39;ve learned to my sorrow.<br/>\nSo quiet down cobwebs; Dust go to sleep!<br/>\nI&#39;m rocking my baby and babies don&#39;t keep.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny C","from":"&quot;Jenny C&quot; &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: a beginner&#39;s question and my response","postDate":"1249682922","msgId":46631,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGg1aThsYStuaTZiQGVHcm91cHMuY29tPg==","inReplyToHeader":"PERCQkJCNjU2LTJBQ0QtNDREMS04RUIzLTRFQjE1QjgxQjZDNkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":46621,"nextInTopic":46632,"prevInTime":46630,"nextInTime":46632,"topicId":46621,"numMessagesInTopic":0,"msgSnippet":"... Then she should play.  Find play in everything you do. ... I have a kitchen full of dirty dishes because I spent the day at the park yesterday and did","messageBody":"<div id=\"ygrps-yiv-1965878533\"><blockquote><span title=\"ireply\">&gt;<br/>\n&gt; Is unschooling all about making time to play with child .<br/>\n&gt; Mine is 10 and still doesnt want to go to school and She<br/>\n&gt; sometimes wants to but She wants to play all the time.<br/>\n<br/>\n </span></blockquote>Then she should play.  Find play in everything you do.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; So I ALLOW HER TO DO so and I cant all the time because<br/>\n&gt; if shes not going to do chores then they all fall on me<br/>\n&gt; I HAVE TO GET THEM DONE and I cant play with her . shes<br/>\n&gt; an only child and I am a single mom unschooling . It is<br/>\n&gt; really difficult to get her to do things when I want her<br/>\n&gt; to get them done. I am talking about chores mostly .<br/>\n<br/>\n </span></blockquote>I have a kitchen full of dirty dishes because I spent the day at the<br/>\npark yesterday and did other things with and for my kids.  My floors<br/>\ndesperately need to be vacuumed.  I will get some of it done today, but<br/>\nI&#39;m not stressing over it, other than the discomfort it causes me, which<br/>\nI&#39;m letting go.  I still haven&#39;t cleaned the bathroom after cleaning the<br/>\ndog, but we do have 2 bathrooms, that was 2 days ago.<br/>\n<br/>\nI&#39;m not a single mom, but I have 2 times the amount of people in my<br/>\nhouse, so double the messes, and I&#39;m still the main household cleaner<br/>\nand comfort maker.  Some people have really high standards for<br/>\ncleanliness and try to raise kids with that standard, but neglect the<br/>\nrest of what children need.  Kids, as well as adults like some level of<br/>\ncreature comforts, but they also need to feel like they can be mentally<br/>\ncomfortable in their environment.<br/>\n<br/>\nIf a parent constantly trumps mental comfort for physical comfort, in<br/>\nthe form of a neat and tidy house, the children will look elsewhere for<br/>\nmental comfort.  Sure there&#39;s a balance there.  A parent shouldn&#39;t be<br/>\ntrying to get a kid to do whatever it is the parent wants when the<br/>\nparent wants.  Asking for help is great, working with a child&#39;s time<br/>\nframe is great, doing things together is great.  If it&#39;s not going to be<br/>\npeacable and pleasant doing it together or having a child do it, then do<br/>\nit differently.  Do it for her kindly because you want a certain level<br/>\nof comfort for yourself and her.<br/>\n<br/>\nI know my child will fail<br/>\n<blockquote><span title=\"ireply\"> &gt; the testings because she is behind way behind like shes a<br/>\n&gt; first grade level in math and not even that mentally I<br/>\n&gt; mean she can not do math mentally so we dont do it at<br/>\n&gt; all except for baking cookies. but when the testings come<br/>\n&gt; she wont pass .<br/>\n<br/>\n </span></blockquote>How do you know she won&#39;t pass?  What is passing?  Where I live you need<br/>\nto be in the 15th percentile to be considered passing, and even if you<br/>\ndon&#39;t make even that very low minimum, you have a year to make progress<br/>\nand get a better score, and if you still don&#39;t make a better score, you<br/>\nstill have options other than special ed or school.  I know it&#39;s<br/>\ndifferent in every area, but the way you describe it, has been described<br/>\nin my area by newer homeschoolers who are afraid, even though there are<br/>\ngood reasons not to be.  It really does help to know the laws where you<br/>\nlive.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"a beginner&#39;s question and my response","postDate":"1249653358","msgId":46621,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCQkJCNjU2LTJBQ0QtNDREMS04RUIzLTRFQjE1QjgxQjZDNkBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":46631,"prevInTime":46620,"nextInTime":46622,"topicId":46621,"numMessagesInTopic":0,"msgSnippet":"This came by e-mail.  I m deleting just a few bits to make it more generic.  My responses are routine.  I ve brought it here because there might be new list","messageBody":"<div id=\"ygrps-yiv-1850254772\">This came by e-mail.  I&#39;m deleting just a few bits to make it more  <br/>\ngeneric.  My responses are routine.  I&#39;ve brought it here because  <br/>\nthere might be new list members with some of the same questions, and  <br/>\nsomething in here might help.  For those who&#39;ve been reading a longer  <br/>\ntime and are more confident, it might not be worth reading.<br/>\n<br/>\nThe gist of it has to do with clarity of concept and language, I think.<br/>\n<br/>\n------------------------------------------------------------------------------------------------------------<br/>\nFrom: &quot;DW&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dandgwh@...\">dandgwh@...</a>&gt;<br/>\nDate: March 18, 2008 11:12:30 PM MDT<br/>\nTo: &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nSubject: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:dandgwh@...\">dandgwh@...</a><br/>\n<br/>\nIs  unschooling  all  about  making  time  to  play  with  child .   <br/>\nMine  is  10  and  still  doesnt  want  to  go  to  school  and She  <br/>\nsometimes  wants  to    but   She  wants  to  play  all  the  time.   <br/>\nSo  I  ALLOW  HER  TO  DO  so  and  I  cant  all  the  time  because   <br/>\nif  shes  not  going  to  do  chores  then  they  all  fall  on  me   <br/>\nI  HAVE  TO  GET  THEM  DONE  and  I  cant  play  with  her  .  shes   <br/>\nan  only  child  and  I  am  a  single  mom  unschooling  .  It  is   <br/>\nreally  difficult  to  get  her  to  do  things  when  I  want  her   <br/>\nto  get  them  done.  I am  talking  about  chores  mostly  .  so   <br/>\nthen  I have  to  do  them  all  and  dont  have  time  with  her  .   <br/>\ntime  with  her  gives  me  joy  and  her  too.  Can  I  ask  what   <br/>\ndo  other  unschoolers  do   when  the  public  school  and  state   <br/>\nlaw  forces  them  to  take  the  standarized  testings  they  are   <br/>\nmandatory    here  in  this  state.  I  know  my  child  will  fail   <br/>\nthe testings  because  she  is  behind  way  behind  like  shes   a   <br/>\nfirst  grade  level  in  math  and  not  even  that  mentally  I   <br/>\nmean  she  can  not  do  math  mentally  so  we  dont  do  it  at   <br/>\nall  except  for  baking  cookies.  but  when   the  testings  come   <br/>\nshe  wont  pass  .  I  worry  because  then  they  will  make  her   <br/>\ntake  more  tests  that  will  proove  she  has  learning  problems   <br/>\nand  then  they  will  force  learning  specialists  because  the   <br/>\nstate  says  we  have  to  have  a  team  .  I  dont  want  a  team   <br/>\nof  teachers  with  me  .  I  am  the  parent  and  I  dont  teach   <br/>\nand  I  want  to  continue  unschooling  with  out  the  schools   <br/>\ninterference  but   THIS  IS  GOING  TO  BE  VERY  DIFFICULT  UNLESS   <br/>\nI  LYE  ABOUT  WAHT  GRADE  SHES  IN  SO  SHE  DOESNT  HAVE  TO  TAKE   <br/>\nTHE  TESTS  AT  ALL  AND  SKIP  TO  5TH GRADE SO  SHE  WONT  HAVE  TO   <br/>\nTAKE  THE  4TH  GRADE  TEST.  THEN  WHAT  DO  I  DO  AFTER  THE  6TH   <br/>\nGRADE  AND  8TH  GRADES  WHEN  SHE  NEEDS  A  TEST  AGAIN  .    AND   <br/>\n10TH  .  It  is  the  law  they  have  to  know  where  shes  at  .   <br/>\nIf  I  say  shes  in  [whatever]  grade  and  she  still  doesnt   <br/>\nknow  here  multiplication  tables  they  will  force  me  to   <br/>\nmeetings  I  WILL  ignore  but  I  might  get  introuble  with   <br/>\nsocial  services   if  I  dont  comply  with  their  meetings   and   <br/>\ngrading  my  daughter  and  testing  her.  I  DONT  TEST  HER  NOW   <br/>\nAND  DONT  BELIEVE  IN  TESTING  I  really  want  to  know  if  any   <br/>\none  has  ever  avoided  the  testings  and  how  have  they  done    <br/>\nthat  .    or  do  they  just  take  the  tests  and  not  even   <br/>\nworry  what  the  childs  score  is  and  if  they  want  to  file   <br/>\nit  away  let  them  if  its  law  and  I  can  throw  it  in  the   <br/>\ntrash  .  because  it  means  nothing  to  us  except  competition   <br/>\nwithin  th  nation  nationally  amongst   children    thank  you  for   <br/>\nlistening  and  plaese  give  me  some  names  and  email     <br/>\naddresses  to  talk  to  or  suggestions<br/>\n<br/>\n------------------------------------------------------------------------------------------------------------<br/>\nMy response:<br/>\n<br/>\n<br/>\n<br/>\n-=-  I  DONT  TEST  HER  NOW  AND  DONT  BELIEVE  IN  TESTING  I   <br/>\nreally  want  to  know  if  any  one  has  ever  avoided  the   <br/>\ntestings and  how  have  they  done   that  .    or  do  they  just   <br/>\ntake  the  tests  and  not  even  worry  what  the  childs  score  is   <br/>\nand  if  they  want  to  file it  away  let  them  if  its  law  and   <br/>\nI  can  throw  it  in  the  trash  .-=-<br/>\n<br/>\n  Whatever state it is, please look here and join a local list and ask  <br/>\nthem what they actually do, or if they&#39;ve found workarounds.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/world\">http://sandradodd.com/world</a><br/>\n<br/>\n-=if  shes  not  going  to  do  chores  then  they  all  fall  on  me   <br/>\nI  HAVE  TO  GET  THEM  DONE-=-<br/>\n<br/>\nOr what?  What if you don&#39;t &quot;GET THEM DONE&quot;?<br/>\n<br/>\nBe very careful with &quot;have to.&quot;<br/>\nIt might make you feel better to read here:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/haveto\">http://sandradodd.com/haveto</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/choices\">http://sandradodd.com/choices</a><br/>\n<br/>\nIt&#39;s really important.<br/>\n<br/>\n-=- It  is  really  difficult  to  get  her  to  do  things  when  I   <br/>\nwant  her  to  get  them  done. -=-<br/>\n<br/>\nIt takes more time to do really difficult or impossible things than it  <br/>\ndoes to play with a child.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/chores/gift\">http://sandradodd.com/chores/gift</a><br/>\n<br/>\n-=- state  law  forces  them  to  take  the  standarized  testings   <br/>\nthey  are  mandatory    here  in  this  state.-=-<br/>\n<br/>\n&quot;Force&quot; is not the same as &quot;requirement.&quot;  &quot;Force&quot; has to do with  <br/>\nphysical threat and manhandling and shoving and pushing.<br/>\n<br/>\nYour writing seemed full of fear of threat and fear of fear.<br/>\n<br/>\nFind out what others in your state do.  Be peaceful and sweet with  <br/>\nyour daughter, above all.  Make her life interesting.  And sometimes  <br/>\nplay with her.  More than you want to, and a little more than you  <br/>\nthink you can.  It will work out better that way.  Before long it  <br/>\nwon&#39;t be more than you want to.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/parentingpeacefully\">http://sandradodd.com/parentingpeacefully</a><br/>\n<br/>\nIf you&#39;re not a member of a disussion list, unschooling basics might  <br/>\nbe a good one to join.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingbasics/\">http://groups.yahoo.com/group/unschoolingbasics/</a><br/>\n<br/>\n<br/>\nSandra</div>","specialLinks":[]}],"prevTopicId":46608,"nextTopicId":46635}}