{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":4,"messages":[{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;tracy.oldfield@...&gt;","replyTo":"LIST","senderId":"o_mMYmi53Xw9ZOPtt4kbTkgRyC7eA8hSrrYK10jLDhoWpLmD6oL-7yoG7Pl35unUIG6HVnwkR5wwVrRJQs0QWstLx_6p5URXEgEWyu43s1ROklBtGA","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] fed-up...","postDate":"963956206","msgId":11317,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NzREQkZFLjI4NTQ5LjIwRUNBNEBsb2NhbGhvc3Q+","inReplyToHeader":"PExQQkJJTURNUEdKQU9MS0JKSUlFR0VPRENBQUEuc2VhbXVzQHBvcnR1cC5jb20+","referencesHeader":"PDM5NzQ0NDVELjU3NDAuM0U5QUZEQGxvY2FsaG9zdD4="},"prevInTopic":11311,"nextInTopic":0,"prevInTime":11316,"nextInTime":11318,"topicId":11278,"numMessagesInTopic":0,"msgSnippet":"Thanks, Lee.  I don t want to start on the reward-system thing, cos afaics, it just lends to bigger and bigger rewards, and more and more reliance on external","messageBody":"<div id=\"ygrps-yiv-885310324\">Thanks, Lee.  I don&#39;t want to start on the reward-system thing, <br/>\ncos afaics, it just lends to bigger and bigger rewards, and more <br/>\nand more reliance on external motivation, but since the kids have <br/>\nno internal motivation to sort their stuff out, I don&#39;t know where to <br/>\nstart.  I think most of us were brought up with some coersion or <br/>\nother (either reward or punishment or combination of both) and <br/>\nthe lucky ones who weren&#39;t are probably secure in themselves <br/>\nenough to not need the suport of a list like this &lt;g&gt;  it&#39;s something <br/>\nto add to the mix, though...<br/>\n<br/>\nTracy<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 18 Jul 2000, at 11:12, M & J Welch wrote:<br/>\n<br/>\n\u000f<br/>\n\u000f<br/>\nWe also use the reward system, based on an idea I saw <br/>\nlisted on another\u000f<br/>\nhomeschooling board.\u000e When he performs each daily duty <br/>\nwithout being forced\u000f<br/>\nto do it, he gets a star on his learning calendar.\u000e <br/>\nWhen he gets 10 stars he\u000f<br/>\ngets a ticket which he can use towards special <br/>\nprivileges.\u000e Right now he&#39;s\u000f<br/>\nworking towards getting Nickelodeon magazine-we&#39;ve <br/>\nplaced a ticket value on\u000f<br/>\nit based on the subscription price.\u000f<br/>\n\u000f<br/>\nI don&#39;t think this is true blue non-coercive parenting, <br/>\nbut it&#39;s a\u000f<br/>\ncompromise that seems to be mutually beneficial.\u000e Our <br/>\nson is learning that\u000f<br/>\nthere are expectations that need to be followed when <br/>\nyou share your home\u000f<br/>\nwith others, and my husband is learning that children <br/>\ndon&#39;t have to be\u000f<br/>\nthreatened with ultimatums in order to get them to <br/>\nclean up after\u000f<br/>\nthemselves. Most importantly, we&#39;ve learned how to talk <br/>\nwith one another\u000f<br/>\nabout doing household chores without getting frustrated <br/>\nor angry. And our\u000f<br/>\nhome is staying clean without buildup for the first <br/>\ntime since we&#39;ve had\u000f<br/>\nkids.\u000e It&#39;s amazing! I guess some people (like me!) are <br/>\njust slow. ;-)\u000f<br/>\n\u000f<br/>\nAnyway-that&#39;s an idea-something to chew on.\u000f<br/>\n\u000f<br/>\nBest, Lee (Jennifer Lee Welch)\u000f<br/>\n\u000f<br/>\nCheck it all out at: http://www.unschooling.com </span></blockquote></div>","specialLinks":[]},{"userId":0,"authorName":"metta","from":"metta &lt;metta@...&gt;","replyTo":"LIST","senderId":"2lvy74da-eVnFFAVJILi39PVO8a2BtBZRZzmcfuziPAtTtR5QkbCgQQKt1E1ox-uUGxCAARObkPW8HBjaKb8P9f77Q","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: fed-up...","postDate":"963945757","msgId":11311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1OTlGMzJDLjE4MzExJW1ldHRhQHBhY2lmaWNuZXQubmV0Pg==","inReplyToHeader":"PDk2MzkzODc4Ni4xMjIyNEBlZ3JvdXBzLmNvbT4="},"prevInTopic":11296,"nextInTopic":11317,"prevInTime":11310,"nextInTime":11312,"topicId":11278,"numMessagesInTopic":0,"msgSnippet":"... When mine were small, I found it worked best to pick up with them, modelling the behavior I wanted them to learn. A mess can seem so overwhelming to a ","messageBody":"<div id=\"ygrps-yiv-1603362258\">on 7/18/00 9:46 AM, &quot;aworthen&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:aworthen@...\">aworthen@...</a>&gt; wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; But,<br/>\n&gt; alas we are who we are and we value our kids more than our housework. How do<br/>\n&gt; we get beyond this? :-)<br/>\n<br/>\n </span></blockquote>When mine were small, I found it worked best to pick up with them, modelling<br/>\nthe behavior I wanted them to learn. A mess can seem so overwhelming to a<br/>\nyoung person and most kids are not born knowing how to organize. Also, I<br/>\nfound that setting the timer for 10 minutes and making a game out of picking<br/>\nup as much as we could in that amount of time was successful. After 10<br/>\nminutes, we quit. We could always have another 10 minute session later in<br/>\nthe day. Another thing that worked for me was asking them to pick up a<br/>\nspecific number of things...   like 5 or 10 or whatever. Getting it done in<br/>\nlittle chunks like that is doable and it really does make a difference.<br/>\n<br/>\nBelieve me, they grow up faster than you could ever think possible. Then you<br/>\nwill think back nostalgically to all those messes. ;-)<br/>\n<br/>\nI read somewhere that when living with kids, a day can seem like a year, but<br/>\nthe years seem like days.<br/>\n<br/>\nEnjoy your toddlers. ;-)<br/>\n<br/>\nOh! I just remembered a wonderful book about housekeeping written by a<br/>\nhomeschooling mom. It&#39;s &quot;Shelter for the Spirit: create your own haven in a<br/>\nhectic world,&quot; by Victoria Moran. I found it very inspiring and it made me<br/>\nactually want to clean and cook and create a haven for myself and my family.<br/>\n-- <br/>\nThea<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:metta@...\">metta@...</a></div>","specialLinks":[]},{"userId":0,"authorName":"M & J Welch","from":"&quot;M & J Welch&quot; &lt;seamus@...&gt;","replyTo":"LIST","senderId":"jDjhuOSKv2KUSM7x0lHJMXBUAReV--1zX3gsVAOVI8uFuzDLg2dV7Zr8SsqJAKsc7a_1aKW_vFPkyrJ6Br8Fany2593S5JFOiSRYBus","spamInfo":{"isSpam":false,"reason":"0"},"subject":"RE: [Unschooling-dotcom] fed-up...","postDate":"963933176","msgId":11296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PExQQkJJTURNUEdKQU9MS0JKSUlFR0VPRENBQUEuc2VhbXVzQHBvcnR1cC5jb20+","inReplyToHeader":"PDM5NzQ0NDVELjU3NDAuM0U5QUZEQGxvY2FsaG9zdD4="},"prevInTopic":11278,"nextInTopic":11311,"prevInTime":11295,"nextInTime":11297,"topicId":11278,"numMessagesInTopic":0,"msgSnippet":"Hi, I m new to this list-so this is kind of a response/self-intro (although I recognize a few names here from the huuh list, hem page and unschooling page,","messageBody":"<div id=\"ygrps-yiv-2021857260\">Hi, I&#39;m new to this list-so this is kind of a response/self-intro (although<br/>\nI recognize a few names here from the huuh list, hem page and unschooling<br/>\npage, which I frequent).  I&#39;m a homeschooler/unschooler (or learning to be<br/>\none), have 3 boys 7, 3, and 3 months, and live in Escanaba MI. We&#39;ve been<br/>\nhomeschooling for about 2 years, and my son has been gradually leading me<br/>\ninto unschooling, which is the best method for him to learn.<br/>\n<br/>\nI&#39;m addressing your question, Tracy, because I just went through this with<br/>\nmy husband, Mike.  He&#39;s naturally a coercive parent. He does his best to<br/>\ncontrol it, but his childhood upbringing was based on authority and fear,<br/>\nand he regresses.  We&#39;ve done a good job treating our kids like people and<br/>\nnot pets, so they are personality plus-especially our eldest boy. As a<br/>\nresult, Mike butts heads with our son, Seamus, rather often.  He&#39;s proud of<br/>\nSeamus&#39; spirit, but frustrated that Seamus hasn&#39;t yet figured out how to<br/>\npick his battles. I admit, I get frustrated too, but I&#39;m more patient than<br/>\nmy husband.<br/>\n<br/>\nWe&#39;ve had the same problems over house upkeep. We all live in this house and<br/>\navail of the advantages of living here, so I feel we all need to work<br/>\ntogether in order to &quot;pay&quot; for the &quot;privilege&quot; of living in our home. I<br/>\nexplained it to my son by using the Little Red Hen story. It seemed to click<br/>\nwell in his brain, but his lack of helping didn&#39;t change-and I ended up<br/>\nwitnessing my husband coercing my son again to clean the house.<br/>\n<br/>\nIn order to keep peace in the house, we had to create non-coercive, or at<br/>\nleast minimally coercive, consequences for my son.  Since we consider living<br/>\nin our home a privilege, we decided to make a list of Seamus&#39; favorite<br/>\nprivileges.  We wrote them out on tickets and tacked them to our bulletin<br/>\nboard. When we find ourselves repeatedly requesting that he perform a<br/>\nhousehold duty and he fails to do it he loses a daily privilege-like<br/>\nwatching t.v., playing with his sega, using the computer, staying up until<br/>\n9:30pm, getting dessert after dinner, and the absolute worst one we pull<br/>\nlast, playing outside. (This last one is the biggie-he knows he&#39;ll really<br/>\nhave screwed up if we have to pull that one as it&#39;s his favorite thing to<br/>\ndo.  The good thing is-we haven&#39;t had to pull it yet). I can usually tell<br/>\nwhen it&#39;s time to take a ticket because I can feel my frustration level<br/>\nincrease-I have no set number of requests since every situation is slightly<br/>\ndifferent<br/>\n<br/>\nWe also use the reward system, based on an idea I saw listed on another<br/>\nhomeschooling board.  When he performs each daily duty without being forced<br/>\nto do it, he gets a star on his learning calendar.  When he gets 10 stars he<br/>\ngets a ticket which he can use towards special privileges.  Right now he&#39;s<br/>\nworking towards getting Nickelodeon magazine-we&#39;ve placed a ticket value on<br/>\nit based on the subscription price.<br/>\n<br/>\nI don&#39;t think this is true blue non-coercive parenting, but it&#39;s a<br/>\ncompromise that seems to be mutually beneficial.  Our son is learning that<br/>\nthere are expectations that need to be followed when you share your home<br/>\nwith others, and my husband is learning that children don&#39;t have to be<br/>\nthreatened with ultimatums in order to get them to clean up after<br/>\nthemselves. Most importantly, we&#39;ve learned how to talk with one another<br/>\nabout doing household chores without getting frustrated or angry. And our<br/>\nhome is staying clean without buildup for the first time since we&#39;ve had<br/>\nkids.  It&#39;s amazing! I guess some people (like me!) are just slow. ;-)<br/>\n<br/>\nAnyway-that&#39;s an idea-something to chew on.<br/>\n<br/>\nBest, Lee (Jennifer Lee Welch)<br/>\n<br/>\nCheck it all out at: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.unschooling.com\">http://www.unschooling.com</a></div>","specialLinks":[]},{"userId":0,"authorName":"Tracy Oldfield","from":"&quot;Tracy Oldfield&quot; &lt;tracy.oldfield@...&gt;","replyTo":"LIST","senderId":"YxEVBYzFZsJYcX8XKzBVbwQodIS-zyeYiMbONI8JTo2-akA5YtOQBEBp210EMP-VUGPeVYnQlhVTQn6Wy7ybj9nlmX0k7g_J-J-j1pvIINibeJKxjw","spamInfo":{"isSpam":false,"reason":"0"},"subject":"fed-up...","postDate":"963917389","msgId":11278,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDM5NzQ0NDVELjU3NDAuM0U5QUZEQGxvY2FsaG9zdD4="},"prevInTopic":0,"nextInTopic":11296,"prevInTime":11277,"nextInTime":11279,"topicId":11278,"numMessagesInTopic":0,"msgSnippet":"Right, this is one of those off-topic things about kids which someone saw fit to be so dismissive of.  I m asking here because i really need some feedback on","messageBody":"<div id=\"ygrps-yiv-1734251515\">Right, this is one of those &#39;off-topic&#39; things about kids which <br/>\nsomeone saw fit to be so dismissive of.  I&#39;m asking here because i <br/>\nreally need some feedback on the whole emotional/empathetic/ <br/>\nbehavioural thing (basically I&#39;m looking for words of wisdom from <br/>\nSusan &lt;g&gt;)<br/>\n<br/>\nIt&#39;s Tuesday morning and once again I&#39;m mega-fed-up with the <br/>\nwhole tidying-up thing.  I don&#39;t know, what do you all think?  I need <br/>\nto have one day a week when I get the whole house done.  If this <br/>\ndoesn&#39;t happen, it gets overwhelming and it doesn&#39;t get done for <br/>\nweeks and weeks.  This includes the kids&#39; room.  So is tidying <br/>\ntheir room their problem, since it&#39;s their room, or mine, since I&#39;m <br/>\nthe one who wants to vac the floor?  It doesn&#39;t help that I got fed-up <br/>\nof them faffing about on a Tuesday morning so now they do it on <br/>\nMonday night, and then my Tai Chi class moves from Thurs to Mon <br/>\nso dh has the kids, and at the moment there seems a lot of <br/>\nnegativity from that corner.  Last night he told them that the tidying <br/>\nup would be done before they played out, (in ultimatum format...) <br/>\nso Heather said &#39;I&#39;ve changed my mind, I don&#39;t want to play out...&#39;  I <br/>\ncan&#39;t change how he is with them, but I can change how I am, and <br/>\nsomething needs to give...<br/>\n<br/>\nAm I expecting too much of a 4&1/2 and 3&1/2yo, ther are capable <br/>\nof doing the tidying up, apart from the books, which either me or dh <br/>\ndo?  The other problem is that when dh has the kids, he usually <br/>\nhas work to do (like last night,) so they do their thing while he does <br/>\nhis, or he wants peace and quiet to watch tv...  Can you tell it&#39;s not <br/>\nthe kids I&#39;m annoyed with???<br/>\n<br/>\nI don&#39;t think this is off-topic, cause I don&#39;t see how we can all live <br/>\ntogether (which is surely what home-ed is about) unless we can <br/>\nmanage these situations well.<br/>\n<br/>\nWell, I need to go finish that hoovering...<br/>\n<br/>\nTracy</div>","specialLinks":[]}],"prevTopicId":11315,"nextTopicId":11298}}