{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":1051378,"authorName":"SandraDodd@aol.com","from":"SandraDodd@...","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [UnschoolingDiscussion] Back from South Dakota","postDate":"1105378042","msgId":102467,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU1LmE0ZmVhZWYuMmYxNDE0ZmFAYW9sLmNvbT4="},"prevInTopic":102465,"nextInTopic":0,"prevInTime":102466,"nextInTime":102468,"topicId":102465,"numMessagesInTopic":0,"msgSnippet":"How great that you gave the boys a choice whether to be with or away at all those stages of their grandfather s death.   You did a really good thing, it seems.","messageBody":"<div id=\"ygrps-yiv-669147291\">How great that you gave the boys a choice whether to be with or away at all <br/>\nthose stages of their grandfather&#39;s death.   You did a really good thing, it <br/>\nseems.   Thanks for the details about the healing things done by your husband <br/>\nand his brother, too.  Sounds way better than it could have been with just a few <br/>\nchanges.  They did good things too.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":78134331,"authorName":"Genant2@aol.com","from":"Genant2@...","profile":"genant04","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Back from South Dakota","postDate":"1105372469","msgId":102465,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGUxLmE3YTNiMDEuMmYxM2ZmMzVAYW9sLmNvbT4="},"prevInTopic":0,"nextInTopic":102467,"prevInTime":102464,"nextInTime":102466,"topicId":102465,"numMessagesInTopic":0,"msgSnippet":"Well, we are back.  Jackson s father died while we were in South  Dakota.  We arrived on Wednesday night and spent 2 days with him.  He  was talkative and ","messageBody":"<div id=\"ygrps-yiv-398746687\">Well, we are back.  Jackson&#39;s father died while we were in South  Dakota.  We <br/>\narrived on Wednesday night and spent 2 days with him.  He  was talkative and <br/>\nalert for those 2 days and we spent that time talking with  him, having meals <br/>\nwith him and even stayed up and celebrated the new year with  him.<br/>\n <br/>\nThen we got a call on Saturday morning from Jody, Jackson&#39;s brother, saying  <br/>\nthat his dad was failing fast.  We went out to the house, Jackson&#39;s dad had  <br/>\nbeen staying with Jody for about 2 weeks, and Jody was shaving his dad with  <br/>\ntears running down his face.  It was very touching when you think about the  <br/>\nfamily dynamics.  They were never a touchy-feely family.  Never hugged  or said <br/>\n&quot;I love you&quot; etc.  Their parents were not openly  loving to them when they were <br/>\nchildren, locking them in the basement and  closet as punishment, spanking <br/>\netc.<br/>\n <br/>\nJackson helped his brother finish shaving and changing his dad then they  sat <br/>\nthere with him one on each side holding his hands until he died.  He  <br/>\nacknowledged their presence with nods and seemed to understand what they were  saying <br/>\nup until about 30 minutes before he died.  Jackson got the chance to  tell <br/>\nhis dad that he loved him, something very emotional for Jackson.  <br/>\n <br/>\nThe boys did well.  I let them be as involved or not involved as they  liked. <br/>\n Dallen (10) wanted to see Grampa George before he died so he  sat on <br/>\nJackson&#39;s lap for a few minutes before he died and Jackson  and Dallen cried <br/>\ntogether.  He said Good-bye to Grampa George and  wanted to sit with me for a while, <br/>\nso we went into the livingroom and just sat  there for a few minutes crying.  <br/>\nAt that point Phillip (7) joined us on the  couch and cried too.  Then their <br/>\ncousin Wesley came and said that sometimes  when he is feeling sad he plays on <br/>\nthe PS2 and that helps him feel a little  better so they all went to the family <br/>\nroom to play PS2.  After Jackson&#39;s  father died I asked each of them if they <br/>\nwanted to see him one more time and  Dallen did.  He went up to Grampa George <br/>\n(reclined in his recliner still)  and touched his hand and said Good-bye <br/>\nagain.  Phillip did not want to go  so he didn&#39;t, he continued to play on the PS2.  <br/>\n <br/>\nWe spent the day with family and making phone calls to extend out  stay.  <br/>\nWhen we went home that night I let the boys know that if they needed  to talk <br/>\nabout anything they could.  Dallen cried during the prayer service  and funeral.  <br/>\nBut is doing well.  There were extra hugs all week,  extra &quot;I love you&quot;s  <br/>\nmore touching, and the boys took it upon  themselves to draw pictures of our <br/>\nimmediate family, giving them to Jackson  and I as presents.  Very nice and <br/>\nheartfelt.  They have seemed to need  to do more together as a family since then.  <br/>\nAnd that is OK too.  <br/>\n <br/>\nIt was all very nice and sweet.  <br/>\n <br/>\nPam G<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]}],"prevTopicId":102466,"nextTopicId":102426}}