{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"CREATE"},{"name":"UPDATE"},{"name":"READ"},{"name":"DELETE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":31,"messages":[{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Change in financial circumstances","postDate":"1313075747","msgId":62312,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyMHJuMytqYjRwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoyMDE5MittNXRlQGVHcm91cHMuY29tPg=="},"prevInTopic":62311,"nextInTopic":62316,"prevInTime":62311,"nextInTime":62313,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"... *************** It can take some trial and error to find a system that works for specific circumstances, though - its not a simple matter of adopting one","messageBody":"<div id=\"ygrps-yiv-184496811\">&quot;Alex&quot; &lt;missalexmissalex@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; It makes me nervous to hear the earlier OP talk about financial advice in terms of &quot;healing.&quot; There were were good points there, and I&#39;m all for healing. Adopting a system that is proven to work, and having it work for you, is healing.<br/>\n </span></blockquote>***************<br/>\n<br/>\nIt can take some trial and error to find a system that works for specific circumstances, though - its not a simple matter of &quot;adopting&quot; one set of rules but seeing what makes them work. The kind of strategies that work with a regular income, for instance, don&#39;t work so well if you&#39;re self-employed and have an irregular income. Big income and little income matter, too, and number of kids, and distance from the workplace. Broader ecconomic issues come into play too - I work in an offshoot of the construction industry, so I&#39;m dealing with those issues on a very personal level at the moment.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;Dealing primarily with feelings regarding finances instead of numbers is what gets people into financial holes. <br/>\n </span></blockquote>*********************<br/>\n<br/>\nDealing primarily with numbers can get people into different kinds of holes - holes that can break down relationships. Some balance is important! And for some people healing from past baggage around finances can be a big part of finding balance.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt;I&#39;m doing Flylady too, 90-95%, because the mess and stress of nagging unfinished tasks on me is a bigger burden on my family than the 5 minutes here and there that my routine takes.<br/>\n </span></blockquote>***************<br/>\n<br/>\nThat&#39;s a good example of how emotional concerns and baggage can play a role in choosing what &quot;works&quot;. The Flylady system drives me nuts - it leaves me More stressed, leaves me feeling like I&#39;m &quot;always&quot; cleaning rather than ignoring the mess and sweeping through the house once a week in a grand mania of tidying up. Cleaning every day doesn&#39;t seem efficient or effective to me when I can spend less time overall doing it all in one fell swoop on - but to a large extent, that Is an emotional decision. I don&#39;t mind the clutter in the meantime, unless I try to clean a little here and there. If the clutter bothers you, then it may make better sense to do a little here and there, perhaps on a schedule. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1313072231","msgId":62311,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTMwNzIyMzEuMzcwNTIuWWFob29NYWlsTmVvQHdlYjgxNTAxLm1haWwubXVkLnlhaG9vLmNvbT4=","inReplyToHeader":"PGoyMDE5MittNXRlQGVHcm91cHMuY29tPg==","referencesHeader":"PDY5NkFFMzVELUVDQkEtNENGNy04RTlFLTQ1RUZFRTZEM0E4MUBTYW5kcmFkb2RkLmNvbT4gPGoyMDE5MittNXRlQGVHcm91cHMuY29tPg=="},"prevInTopic":62310,"nextInTopic":62312,"prevInTime":62310,"nextInTime":62312,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":" This is a huge assumption. While it may","messageBody":"<div id=\"ygrps-yiv-786481966\">&lt;&lt;&lt;&quot;Dealing primarily with feelings regarding finances instead of numbers is what gets people into financial holes.&quot;&gt;&gt;&gt;<br/>\n<br/>\n<br/>\nThis is a huge assumption. While it may be the case in many situations it is not in all. Many are in financial holes because  of hospital bills, or lost a job with this economy. Others can loose everything they own in a natural disaster where they are not insured for.<br/>\nIf you assume that every person that is having financial difficulties is so because they are poor managers or that they are compulsive consumers  you are living with a lot of fear that if you decide to do something a little extravagant you will be in the same situation.<br/>\nMany very success people  have gone bankrupt several times while believing in their ideas until it worked out for them and are now very wealthy.<br/>\nUp until the economy was so bad most bankruptcies were caused by unforeseen hospital bills. <br/>\n<br/>\nMaybe your daughter will be someone like my best friend who would buy something she really wanted and tell me: &quot; I will find a way to get money to pay for that, maybe I will sell something!&quot; and you know what? She found a way every time and has never gone bankrupt. She did make some messes here and there but learned from them and its very savvy with her money.<br/>\nBeing flexible is pretty great and my kids, specially my oldest, is very flexible and he can save lots of money for long periods of time.That is just how he is. Me and his dad are not like that. He is the child that had pretty much everything we could afford when he was younger.<br/>\n<br/>\n<br/>\nAlex Polikowsky<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1313071538","msgId":62310,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlDRTFDMTA2LTJFRUYtNEZFNi1BMzhGLTI4RUIxRjJCNzg2NkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoyMDE5MittNXRlQGVHcm91cHMuY29tPg==","referencesHeader":"PGoyMDE5MittNXRlQGVHcm91cHMuY29tPg=="},"prevInTopic":62308,"nextInTopic":62311,"prevInTime":62309,"nextInTime":62311,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"-=-. What concerns me is that I ve seen a lot of rejection lately of systems that work, in favor of...a vague hope for personal growth.-=- Millions of people","messageBody":"<div id=\"ygrps-yiv-1558187958\">-=-. What concerns me is that I&#39;ve seen a lot of rejection lately of systems that work, in favor of...a vague hope for personal growth.-=-<br/>\n<br/>\nMillions of people are sure that spanking works, and that public school works.<br/>\n<br/>\nIf your budgeting methods work for you, then that&#39;s really, truly great.   If they don&#39;t work for your daughter, it might be genetic.  She might be more like her other relatives.  My kids are genetically cautious with money, which is a pretty wonderful thing to inherit randomly that way.  My dad died and left a couple of houses to his newish wife (my age; my sister and I agreed to it); my mom died broke.   Keith&#39;s dad is about to die flush with savings.   The commonality is the death.<br/>\n<br/>\nSome people live stressfully no matter how much money they have.<br/>\nMany people say they can&#39;t unschool because they can&#39;t afford to, though it seems from the outside they could.<br/>\n<br/>\n-=-It makes me nervous to hear the earlier OP talk about financial advice in terms of &quot;healing.&quot; There were were good points there, and I&#39;m all for healing. Adopting a system that is proven to work, and having it work for you, is healing. -=-<br/>\n<br/>\nI always think that unschooling well and fully can be healing for people, so I think I know what you&#39;re saying about efficiency and sucess (&quot;proven to work and having it work&quot;) is healing, but it depends to some degree what one is healing from.  If a child was given an allowance but then told 1/10 (or more) had to go into the offering plate at church, and 30% (or more, but an arbitrary number imposed by the parents) had to go into savings, that child might grow up and NOT be healed at all by a budget that looked like that.  Or the child might never have minded someone else telling him what to do with the money, and just slide on to the grave with the 10 and 30 % rules (budget line items, envelopes).<br/>\n<br/>\n-=- We&#39;re all adult enough to ignore the parts that are incompatible with our parenting philosophies.-=-<br/>\n<br/>\nApparently you don&#39;t really believe everyone&#39;s adult enough not to be vague and emotional.  That&#39;s okay, but be honest with your writing.    This would have been just fine, and much more powerful, without the false statement in the middle:<br/>\n<br/>\n-=-. You can always just use the forms and not revist parts you didn&#39;t like. I don&#39;t say this defensively. What concerns me is that I&#39;ve seen a lot of rejection lately of systems that work, in favor of...a vague hope for personal growth-=-<br/>\n<br/>\nIt&#39;s okay to be defensive about something you believe strongly about.  <br/>\nIt&#39;s less okay to say &quot;I&#39;m not being defensive&quot; in the middle of the reasonable defense.<br/>\n<br/>\nUnschooling is much more than a vague hope for personal growth, if people actually are going to do it and do it well.<br/>\n<br/>\nI&#39;ve spent an hour this morning dealing with paperwork in and around Keith&#39;s desk--insurance payments and cards and car registrations, charge card bills, the landline/internet phone bill, his checkbook.  That&#39;s an hour more than I usually spend in a month.  If Keith weren&#39;t here, I would trust Marty or Holly to help me with all that.  I&#39;m grateful to Keith for taking care of those things for us all.  He&#39;s been helping me with my finances since six years before we were married, and when I get money I just give it to him.   It&#39;s one way of dealing with it, and I&#39;m fortunate to have that situation, I know.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":321996436,"authorName":"Alex","from":"&quot;Alex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Change in financial circumstances","postDate":"1313048674","msgId":62308,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoyMDE5MittNXRlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDY5NkFFMzVELUVDQkEtNENGNy04RTlFLTQ1RUZFRTZEM0E4MUBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62305,"nextInTopic":62310,"prevInTime":62307,"nextInTime":62309,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"... I hope he s as happy with that arrangement as you are! I know for a fact that you two are calmer people than my husband and I but in our house that","messageBody":"<div id=\"ygrps-yiv-1711451171\"><blockquote><span title=\"ireply\">&gt;Our &quot;balance&quot; is he tries to squirrel it all away, and I try to keep some available.<br/>\n&gt; <br/>\n&gt; Sandra<br/>\n<br/>\n </span></blockquote>I hope he&#39;s as happy with that arrangement as you are! I know for a fact that you two are calmer people than my husband and I but in our house that translated to the same abstract tense arguments that never solved anything over and over. When the shit hit the fan, several times, and we took some financial hits, it took a huge toll on our marriage. Not good for our kid. <br/>\n<br/>\nI appreciate this list because I want to truly live my values. Our budget is all about putting our money where our mouth is. It&#39;s about addressing questions that come up here all the time: How do I balance everyone&#39;s needs? How do I know I&#39;m doing enough? How can I better use the resources that we have at our disposal? Now that I *know* I&#39;m putting money away/aside for everyone&#39;s needs (dog/vet bills, husband retirement, grandparent visits, kid clothes, etc) every month, I&#39;m much less stressed about individual choices and purchases, and there are way fewer tense interactions about them. I consider &quot;unschooling&quot; costs much more freely because I have a dedicated envelope for that. I couldn&#39;t guarantee that until we set a budget that limited our spending in some areas (dog grooming, car washing, eating out etc) and we were forced to find the solutions we had been casually considering for a while.Plus, before my feeling was that we had to put as much as we could into house repairs or be stuck in fixer hell forever. Now I have a set budget for that and then let it be. There isn&#39;t all this tension over whether someone orders a beverage and a dessert or whatever. We know after we grocery shop how much food money envelope is left, and then there&#39;s money for beer or Starbucks or whatever else needs it, whether it be marshmallows or toys or other expenses. I&#39;ve read a number of times on the list about people shifting money around to make things happen for their kids, but until we had it all allocated in a &quot;Plan A&quot; sort of way, and knew how much was already spoken for, I wasn&#39;t capable of really doing that.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I dont know about Dave Ramsey, but I think having envelope systems and strict budgets puts focus on money and the lack of money more than might be healthy for people.  <br/>\n<br/>\n </span></blockquote>Most people I know are in some sort of financial trouble--bankruptsy, debt consolidation, on the verge of losing houses, etc, from vaguely trusting that if there is money in the account everything is OK and/or using emotional reasoning to manage finances. &quot;But this is important so we have to get it no matter what.&quot; Not focussing at all on building and maintaining an emergency fund. Some of them have had marriages fail. Some of them have had to stop or give up on their plans to homeschool. I don&#39;t think not knowing where all your money is and not having it working towards your life goals is healthy.<br/>\n<br/>\nIt makes me nervous to hear the earlier OP talk about financial advice in terms of &quot;healing.&quot; There were were good points there, and I&#39;m all for healing. Adopting a system that is proven to work, and having it work for you, is healing. Dealing primarily with feelings regarding finances instead of numbers is what gets people into financial holes. You can always just use the forms and not revist parts you didn&#39;t like. I don&#39;t say this defensively. What concerns me is that I&#39;ve seen a lot of rejection lately of systems that work, in favor of...a vague hope for personal growth. I&#39;v egot a house full house full of in-laws who have used that strategy and failed. I want my daughter to hit adulthood knowing how to manage her money so she can&#39;t get stuck like them. <br/>\n<br/>\nI&#39;m done with my own issues with authority keeping me from adopting systems that are efficient and effective, and can free up time and energy for my kid. I&#39;m doing Flylady too, 90-95%, because the mess and stress of nagging unfinished tasks on me is a bigger burden on my family than the 5 minutes here and there that my routine takes. We&#39;re all adult enough to ignore the parts that are incompatible with our parenting philosophies.<br/>\n<br/>\nBest wishes, <br/>\nAlex N.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1312985024","msgId":62305,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5NkFFMzVELUVDQkEtNENGNy04RTlFLTQ1RUZFRTZEM0E4MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoxdTFyNytrZ2lmQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxdTFyNytrZ2lmQGVHcm91cHMuY29tPg=="},"prevInTopic":62304,"nextInTopic":62308,"prevInTime":62304,"nextInTime":62306,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"-=-I still have some healing to do around money. I ve read Dave Ramsey and he comes off (to me) as a judgmental bully. -=-Thinking about recent conversations","messageBody":"<div id=\"ygrps-yiv-1362461349\">-=-I still have some healing to do around money. I&#39;ve read Dave Ramsey and he comes off (to me) as a judgmental bully. <br/>\n<br/>\n-=-Thinking about recent conversations here, I&#39;m recognizing that&#39;s a sign that there are things I can do to change my thinking about that- i.e., for some people, Sandra comes off as mean, but I can read her words without being triggered... unless it touches on an unexamined issue I have! But I know it&#39;s my issue, I don&#39;t think she&#39;s mean at all. So maybe Dave Ramsey isn&#39;t mean either. But phrases like &quot;stupid tax&quot; aren&#39;t helpful to me right now.-=-<br/>\n<br/>\nI think using the word &quot;stupid&quot; about ANYthing is on the mean side of life.  <br/>\n<br/>\nIn our family, it&#39;s really good that Keith and all the kids are really conservative with money, because I&#39;m not, so much.  So they take care of me, and I buy some things none of them would ever buy (and which they appreciate, or needed).<br/>\n<br/>\nI dont know about Dave Ramsey, but I think having envelope systems and strict budgets puts focus on money and the lack of money more than might be healthy for people.  Paying the important bills (mortgage/rent, car insurance, electricity, phone) and then deciding how to balance food / entertainment / clothes depending on the season and the needs of individuals seems like enough management to me, but I&#39;m not a good person to go by because I&#39;m admitting Keith does it.  But he does it without a budget.  Our &quot;balance&quot; is he tries to squirrel it all away, and I try to keep some available.<br/>\n<br/>\nSandra<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1312984965","msgId":62304,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTI5ODQ5NjUuODY2NjIuWWFob29NYWlsUkNAd2ViODczMTkubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PEFGQ0UzOTUwLTNBNTAtNEM0RC1BQkIxLTJDRDI5MjlCOThENEBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGoxc245dCs5a3VxQGVHcm91cHMuY29tPiA8NUI1QjkzNTMtNUJFOC00MERELThCNUUtMDkxQkE5MjUxOTY5QFNhbmRyYWRvZGQuY29tPiA8MTMxMjk2NzAyNC40NDUxMy5ZYWhvb01haWxSQ0B3ZWI4NzMwOS5tYWlsLmlyZC55YWhvby5jb20+IDxBRkNFMzk1MC0zQTUwLTRDNEQtQUJCMS0yQ0QyOTI5Qjk4RDRAU2FuZHJhZG9kZC5jb20+"},"prevInTopic":62303,"nextInTopic":62305,"prevInTime":62303,"nextInTime":62305,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"Yes, bramble is blackberries. Year round it s great for bramble, blackberries are ripening now. Schuyler ________________________________ From: Sandra Dodd","messageBody":"<div id=\"ygrps-yiv-403931312\">Yes, bramble is blackberries. Year round it&#39;s great for bramble, blackberries <br/>\nare ripening now. <br/>\n<br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Wednesday, 10 August, 2011 13:22:45<br/>\nSubject: Re: [AlwaysLearning] Re: Change in financial circumstances<br/>\n<br/>\n-=-And we are coming into the period of amazing free hedge food. Walking paths <br/>\nare <br/>\n<br/>\nbrilliant for bramble and plums are everywhere right now.-=-<br/>\n<br/>\nIs &quot;bramble&quot; blackberries?  <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Change in financial circumstances","postDate":"1312983719","msgId":62302,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxdTFyNytrZ2lmQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxdDFwZisxZXVtQGVHcm91cHMuY29tPg=="},"prevInTopic":62301,"nextInTopic":62303,"prevInTime":62301,"nextInTime":62303,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"~~Lastly, reading a bunch of Dave Ramsey stuff & setting up a cash envelope system has been huge for us.~~ I still have some healing to do around money. I ve","messageBody":"<div id=\"ygrps-yiv-923507347\">~~Lastly, reading a bunch of Dave Ramsey stuff & setting up a cash envelope system has been huge for us.~~<br/>\n<br/>\nI still have some healing to do around money. I&#39;ve read Dave Ramsey and he comes off (to me) as a judgmental bully. <br/>\n<br/>\nThinking about recent conversations here, I&#39;m recognizing that&#39;s a sign that there are things I can do to change my thinking about that- i.e., for some people, Sandra comes off as mean, but I can read her words without being triggered... unless it touches on an unexamined issue I have! But I know it&#39;s my issue, I don&#39;t think she&#39;s mean at all. So maybe Dave Ramsey isn&#39;t mean either. But phrases like &quot;stupid tax&quot; aren&#39;t helpful to me right now.<br/>\n<br/>\nI found a great resource in the book(s) Tightwad Gazette by Amy Dacyczyn; she has tons and tons of ideas for saving money, and her attitude about it is very positive.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Complete-Tightwad-Gazette-Amy-Dacyczyn/dp/0375752250\">http://www.amazon.com/Complete-Tightwad-Gazette-Amy-Dacyczyn/dp/0375752250</a><br/>\n<br/>\nFor me, the book was valuable not because of the tips (some pretty extreme), but because it got me thinking outside the box, and looking at my situation in positive terms.<br/>\n<br/>\nCaren</div>","specialLinks":[]},{"userId":458624268,"authorName":"dola dasgupta-banerji","from":"dola dasgupta-banerji &lt;doladg@...&gt;","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1312982338","msgId":62303,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRTA1UktPK25KYWM9Mk55U2FVRnlYUlUxK3RjeENoenl2QWk1MnA9dmdvNFR1OFhuQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGoxdG51ait2bnI1QGVHcm91cHMuY29tPg==","referencesHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPgk8ajF0bnVqK3ZucjVAZUdyb3Vwcy5jb20+"},"prevInTopic":62302,"nextInTopic":62304,"prevInTime":62302,"nextInTime":62304,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"That is interesting. In India some of the people I know have started offering services on the basis of gift culture. Which means pay in kind or cash at will. A","messageBody":"<div id=\"ygrps-yiv-1988050154\">That is interesting. In India some of the people I know have started<br/>\noffering services on the basis of gift culture. Which means pay in kind or<br/>\ncash at will. A friend just started a space where he is offering various<br/>\nhealthy food and drinks and also healing workshops and asks the participants<br/>\nand guests to pay as they think fit for the services provided.<br/>\n<br/>\nHe is a man of limited needs and is doing well enough to run that place with<br/>\nhis girlfriend. I myself am not very convinced about this, but that could be<br/>\nbecause I have a family!<br/>\n<br/>\nDola<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Wed, Aug 10, 2011 at 4:23 PM, Rippy Dusseldorp &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:ripgray@...\">ripgray@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; You might be interested in joining your LETS (Local Exchange Trading<br/>\n&gt; System) community. LETS is a community based network in which people<br/>\n&gt; exchange goods and services with one another, without money . If your area<br/>\n&gt; doesn&#39;t have one, perhaps you could start one. Here is a website for the UK:<br/>\n&gt;<br/>\n&gt; www.letslinkuk.net<br/>\n&gt;<br/>\n&gt; Rippy<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1312978965","msgId":62300,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEFGQ0UzOTUwLTNBNTAtNEM0RC1BQkIxLTJDRDI5MjlCOThENEBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDEzMTI5NjcwMjQuNDQ1MTMuWWFob29NYWlsUkNAd2ViODczMDkubWFpbC5pcmQueWFob28uY29tPg==","referencesHeader":"PGoxc245dCs5a3VxQGVHcm91cHMuY29tPiA8NUI1QjkzNTMtNUJFOC00MERELThCNUUtMDkxQkE5MjUxOTY5QFNhbmRyYWRvZGQuY29tPiA8MTMxMjk2NzAyNC40NDUxMy5ZYWhvb01haWxSQ0B3ZWI4NzMwOS5tYWlsLmlyZC55YWhvby5jb20+"},"prevInTopic":62298,"nextInTopic":62301,"prevInTime":62299,"nextInTime":62301,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"-=-And we are coming into the period of amazing free hedge food. Walking paths are brilliant for bramble and plums are everywhere right now.-=- Is bramble","messageBody":"<div id=\"ygrps-yiv-912672952\">-=-And we are coming into the period of amazing free hedge food. Walking paths are <br/>\nbrilliant for bramble and plums are everywhere right now.-=-<br/>\n<br/>\nIs &quot;bramble&quot; blackberries?  <br/>\n<br/>\nThis is an odd thought, but a possibility.  When Keith and I were young and not yet married, he worked in the kitchen at a bar for a while (pub equivalent, but not as much variety of food).  Every night, they threw away the leftovers of a limited menu, and he would bring home (variously) steak or steak scraps, cheesecake, grated cheese and chopped lettuce.  Our dog ate well then, and there were things we could do with the lettuce and cheese that kept them from being same-old.  Maybe a late-night clean-up job somewhere where there&#39;s food would get some more food into the house (if it could be figured out legally and practically).<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":332164648,"authorName":"Rippy Dusseldorp","from":"&quot;Rippy Dusseldorp&quot; &lt;ripgray@...&gt;","profile":"rdusseldorp","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Change in financial circumstances","postDate":"1312973587","msgId":62301,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxdG51ait2bnI1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg=="},"prevInTopic":62300,"nextInTopic":62302,"prevInTime":62300,"nextInTime":62302,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"You might be interested in joining your LETS (Local Exchange Trading System) community. LETS is a community based network in which people exchange goods and","messageBody":"<div id=\"ygrps-yiv-484019823\">You might be interested in joining your LETS (Local Exchange Trading System) community. LETS is a community based network in which people exchange goods and services with one another, without money . If your area doesn&#39;t have one, perhaps you could start one. Here is a website for the UK:<br/>\n<br/>\nwww.letslinkuk.net<br/>\n<br/>\nRippy</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1312967024","msgId":62297,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTI5NjcwMjQuNDQ1MTMuWWFob29NYWlsUkNAd2ViODczMDkubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PDVCNUI5MzUzLTVCRTgtNDBERC04QjVFLTA5MUJBOTI1MTk2OUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGoxc245dCs5a3VxQGVHcm91cHMuY29tPiA8NUI1QjkzNTMtNUJFOC00MERELThCNUUtMDkxQkE5MjUxOTY5QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":62296,"nextInTopic":62298,"prevInTime":62296,"nextInTime":62298,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"And we are coming into the period of amazing free hedge food. Walking paths are brilliant for bramble and plums are everywhere right now. You ve got syrups a ","messageBody":"<div id=\"ygrps-yiv-984298809\">And we are coming into the period of amazing free hedge food. Walking paths are <br/>\nbrilliant for bramble and plums are everywhere right now. You&#39;ve got syrups a <br/>\nplenty that way. Elderberries are just ripening, haw berries are on the way, <br/>\nthere&#39;s rose hips and apples are coming on,  You can look on-line and see if <br/>\nthere is a wild food map in your area. There isn&#39;t one near us, but I know folks <br/>\nhave mapped lots of areas in the UK. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.incredible-edible-wakefield.co.uk/index.cgi?page=10&div=7\">http://www.incredible-edible-wakefield.co.uk/index.cgi?page=10&div=7</a> is <br/>\nWakefield&#39;s fabulous example. Sweet chestnuts are coming soon, oh, yummm. You <br/>\ncan probably find folks in your area who do wild food walks. There are fungus <br/>\nforays coming up in our area soon. At HESFES we briefly went around a scrubfield <br/>\nwith someone who found so much food, so quickly, it was really impressive. She <br/>\nmentioned that while it was legal to harvest the tops of plants on common land, <br/>\ndigging up the roots was illegal. <br/>\n<br/>\n<br/>\nSimon and Linnaea always enjoyed foraging. When they were little we used to go <br/>\nget ramsons in the spring, we we would reek of garlic. Found food is fun. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Sandra Dodd &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:Sandra@...\">Sandra@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Wednesday, 10 August, 2011 5:14:11<br/>\nSubject: Re: [AlwaysLearning] Re: Change in financial circumstances<br/>\n<br/>\n-=-We&#39;re in the UK so might have to look for &#39;English alternatives&#39; to some of <br/>\nthe suggestions but you&#39;ve jogged my memory to some things I&#39;d forgotten to look <br/>\ninto.-=-<br/>\n<br/>\nCharity shops as museums (and resources). :-)<br/>\n<br/>\nMaybe ask older friends who have allotments whether they need help watering, <br/>\nweeding, harvesting or cleaning up.  I bet they would give you some vegetables.  <br/>\nIf you&#39;re at the allotments working (helping older friends, maybe) others might <br/>\noffer you some of theirs if they have too much of something, too.<br/>\n<br/>\nMaybe next year you could get an allotment.<br/>\n<br/>\nWalking paths, if you&#39;re near any, could be fun outings.   Ask local home ed <br/>\nfamilies for free and inexpensive things to do near you.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n------------------------------------<br/>\n<br/>\nYahoo! Groups Links<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":136871563,"authorName":"Schuyler","from":"Schuyler &lt;s.waynforth@...&gt;","profile":"schuyliz2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1312965243","msgId":62296,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTI5NjUyNDMuODIwMDcuWWFob29NYWlsUkNAd2ViODczMTIubWFpbC5pcmQueWFob28uY29tPg==","inReplyToHeader":"PGoxc245dCs5a3VxQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxc245dCs5a3VxQGVHcm91cHMuY29tPg=="},"prevInTopic":62294,"nextInTopic":62297,"prevInTime":62295,"nextInTime":62297,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"Even now, in the UK, you can plant. http://www.telegraph.co.uk/gardening/gardeningadvice/rhs-diary/8689348/RHS-Diary-Top-tips-for-August.html talks about what","messageBody":"<div id=\"ygrps-yiv-814631552\">Even now, in the UK, you can plant. <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.telegraph.co.uk/gardening/gardeningadvice/rhs-diary/8689348/RHS-Diary-Top-tips-for-August.html\">http://www.telegraph.co.uk/gardening/gardeningadvice/rhs-diary/8689348/RHS-Diary-Top-tips-for-August.html</a><br/>\n talks about what you can plant outdoors in August. I know Hugh Fearnley <br/>\nWhittingstall had something on about growing salads and things in the house <br/>\nduring winter, but I can&#39;t find it: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.instructables.com/id/Grow-vegetables-indoors-over-winter/\">http://www.instructables.com/id/Grow-vegetables-indoors-over-winter/</a> is a <br/>\nsimilar idea to what was presented on the show. Ooh, I found this: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.windowfarms.org/faq.\">http://www.windowfarms.org/faq.</a> That looks not to hard to make without ordering <br/>\nit from the company. You&#39;d need a pump of some sort, but that wouldn&#39;t need to <br/>\nbe powerful. I found that through this webpage filled with folks ideas for <br/>\ngrowing indoors over winter: <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.motherearthnews.com/Grow-It/Growing-Food-Indoors-Inside-Winter-Cold-Months.aspx.\">http://www.motherearthnews.com/Grow-It/Growing-Food-Indoors-Inside-Winter-Cold-Months.aspx.</a><br/>\n<br/>\n<br/>\nThere is more than one way to skin a cat. It helps me a lot, when I&#39;m stuck, to <br/>\nlook for ideas to unstick me. Google is amazing for that, but so is looking to <br/>\nwhatever has me stuck. It&#39;s like playing with pattern blocks, if I keep looking <br/>\nto the same patterns to solve the problem I&#39;m going to be stuck for a long time. <br/>\nBetter to step back and look for other solutions then to keep grinding away at <br/>\nthe problem. <br/>\n<br/>\n<br/>\nSchuyler<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n________________________________<br/>\nFrom: Lou Davis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:louloukitty81@...\">louloukitty81@...</a>&gt;<br/>\nTo: <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a><br/>\nSent: Wednesday, 10 August, 2011 2:35:57<br/>\nSubject: [AlwaysLearning] Re: Change in financial circumstances<br/>\n<br/>\nThank you, everyone, for all your advice and help. I&#39;m really, really grateful.<br/>\nWe&#39;re in the UK so might have to look for &#39;English alternatives&#39; to some of the <br/>\nsuggestions but you&#39;ve jogged my memory to some things I&#39;d forgotten to look <br/>\ninto.<br/>\nI&#39;ve signed up to Freecycle.<br/>\nI usually do plenty of veg growing but haven&#39;t done much this year as my girls <br/>\nhave lost interest and I haven&#39;t had time to go by myself  (when my husband was <br/>\nworking long hours). Too late to plant anymore this year but I&#39;m grateful for <br/>\nthe few things I did manage to plant.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":324649492,"authorName":"oh2fresh","from":"&quot;oh2fresh&quot; &lt;oh2fresh@...&gt;","profile":"oh2fresh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Change in financial circumstances","postDate":"1312964039","msgId":62298,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxdGVrNys1c3NjQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxc245dCs5a3VxQGVHcm91cHMuY29tPg=="},"prevInTopic":62297,"nextInTopic":62300,"prevInTime":62297,"nextInTime":62299,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"We had a simliar situation where our income dropped and there was no way of getting it back. Luckily my son had a reasonable stash of things to see him","messageBody":"<div id=\"ygrps-yiv-1401056059\">We had a simliar situation where our income dropped and there was no way of getting it back. <br/>\n<br/>\nLuckily my son had a reasonable stash of things to see him through. Once he outgrew them and his clothes we began listing them on ebay and he took the money to buy more. It was his money, he earnt it. Perhaps your eldest would understand this. mine certainly has a better understanding of money and no longer thinks it grows on trees.<br/>\n<br/>\nWe also have an annual kids market which is great fun. We make cookies and sell old toys, selling not gifting took a while to get used to, but its essential to our living.   <br/>\n<br/>\nPlus we&#39;ve now started handmaking all our gifts, made with love. Christmas we made everyone a salt dough ordament for the tree, wrapped in paintings. <br/>\n<br/>\nWe use the library and any other free service too. <br/>\n<br/>\nI think some of the frugal living websites might be helpful (there&#39;s a whole movement out there of people living like our grandparents. There&#39;s something to be said for living with whats available. <br/>\n<br/>\nGood luck with your change in direction, I wonder what fab experiences it will give you all? <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> --- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Lou Davis&quot; &lt;louloukitty81@...&gt; wrote:<br/>\n&gt;<br/>\n&gt; Thank you, everyone, for all your advice and help. I&#39;m really, really grateful.<br/>\n&gt; We&#39;re in the UK so might have to look for &#39;English alternatives&#39; to some of the suggestions but you&#39;ve jogged my memory to some things I&#39;d forgotten to look into.<br/>\n&gt; I&#39;ve signed up to Freecycle.<br/>\n&gt; I usually do plenty of veg growing but haven&#39;t done much this year as my girls have lost interest and I haven&#39;t had time to go by myself  (when my husband was working long hours). Too late to plant anymore this year but I&#39;m grateful for the few things I did manage to plant.<br/>\n&gt; I used to make most of our food from scratch, plus cleaning products etc, so with a bit of planning I can do that again.<br/>\n&gt; Pocket money would be a good idea too.<br/>\n&gt; <br/>\n&gt; I also see I&#39;ve been looking at this wrong, as something to endure rather than embrace. I feel very emotional about it all. And I&#39;m still not sure how to react when the children ask for things we can&#39;t afford that we could a month ago.<br/>\n&gt; I feel I want to be sympathetic. I want to rock them and say &#39;I&#39;m sorry we can&#39;t buy that for you&#39;. But that this will just make them sad. I also know I need to be more positive. And that the children won&#39;t feel any loss if I can still create abundance, albeit in a different way.<br/>\n&gt; <br/>\n&gt; I&#39;m going to go away and re-read the replies.<br/>\n&gt; <br/>\n&gt; Lou xx<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":321996436,"authorName":"Alex","from":"&quot;Alex&quot; &lt;missalexmissalex@...&gt;","profile":"missalexmissalex","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Change in financial circumstances","postDate":"1312950895","msgId":62294,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxdDFwZisxZXVtQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxc245dCs5a3VxQGVHcm91cHMuY29tPg=="},"prevInTopic":62293,"nextInTopic":62296,"prevInTime":62293,"nextInTime":62295,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"So glad to hear that the other replies were helpful. Your post has been on my mind as we have reduced our spending pretty significantly lately. I just wanted","messageBody":"<div id=\"ygrps-yiv-1126533423\">So glad to hear that the other replies were helpful. Your post has been on my mind as we have reduced our spending pretty significantly lately.<br/>\n<br/>\nI just wanted to chip in that this site: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.thecraftycrow.net/\">http://www.thecraftycrow.net/</a><br/>\nis a great collection of children&#39;s art& crafts projects from all over the web. Whenever you have some kind of recyclable or such you can search to see what other have done with it. I love the &quot;what can we make with this&quot; challenges: Iron Chef Toilet Paper Rolls! ;) I&#39;ve also gotten quite a few free ideas by just being subscribed. I love thinking about people did/do to make art who can&#39;t buy paint. Cave people! Pioneers! We play with kitchen stuff a lot like smearing around strawberry tops and ketchup packets. Salt, sometimes dyed with food color, as glitter. My mom used to make a salt dough recipe we&#39;d bake & paint. I love flower pounding. Leaf crowns! Nature faces! We&#39;ve had fun using onion skins etc to color hard boiled eggs. You can paint outside with water. We love painting on the windows with really cheap sale shaving cream. <br/>\n<br/>\nI&#39;m sort of shameless when it comes to scavenging. For paper I use quite a bit of brightly colored junk mail/flyers left on the door/garage sale signs left up in the neighborhood. When there&#39;s a gift-giving holiday, I ask folks to save any tissue paper or ribbon they don&#39;t want for us, and now we&#39;ve got a few of these: <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.filthwizardry.com/2010/06/tissue-paper-and-glue-window-collage.html\">http://www.filthwizardry.com/2010/06/tissue-paper-and-glue-window-collage.html</a> She has some nice posts about reused milk jugs and ironing pictures from plastic bags onto clothes. <br/>\n<br/>\nIt sounds like you lean in that direction anyway, but I think a lot of cheap food can have that cool pioneer/experiment angle too: popcorn made the old fashioned way and/or with various spices, sprouting beans/seeds, replanting the base of your celery, etc. <br/>\n<br/>\nLastly, reading a bunch of Dave Ramsey stuff & setting up a cash envelope system has been huge for us. <br/>\n<br/>\nBest of luck, <br/>\nAlex<br/>\n(Katya&#39;s mom)</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1312949651","msgId":62293,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVCNUI5MzUzLTVCRTgtNDBERC04QjVFLTA5MUJBOTI1MTk2OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoxc245dCs5a3VxQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxc245dCs5a3VxQGVHcm91cHMuY29tPg=="},"prevInTopic":62290,"nextInTopic":62294,"prevInTime":62292,"nextInTime":62294,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"-=-We re in the UK so might have to look for English alternatives to some of the suggestions but you ve jogged my memory to some things I d forgotten to look","messageBody":"<div id=\"ygrps-yiv-2131386811\">-=-We&#39;re in the UK so might have to look for &#39;English alternatives&#39; to some of the suggestions but you&#39;ve jogged my memory to some things I&#39;d forgotten to look into.-=-<br/>\n<br/>\nCharity shops as museums (and resources). :-)<br/>\n<br/>\nMaybe ask older friends who have allotments whether they need help watering, weeding, harvesting or cleaning up.  I bet they would give you some vegetables.  If you&#39;re at the allotments working (helping older friends, maybe) others might offer you some of theirs if they have too much of something, too.<br/>\n<br/>\nMaybe next year you could get an allotment.<br/>\n<br/>\nWalking paths, if you&#39;re near any, could be fun outings.   Ask local home ed families for free and inexpensive things to do near you.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":469090539,"authorName":"Lou Davis","from":"&quot;Lou Davis&quot; &lt;louloukitty81@...&gt;","profile":"louloukitty81","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Change in financial circumstances","postDate":"1312940157","msgId":62290,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxc245dCs5a3VxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PDk2MTk1RkI2LUJGMDgtNDU2OS04OEMyLUU1QjhDRkEzQTQ2MkBTYW5kcmFkb2RkLmNvbT4="},"prevInTopic":62279,"nextInTopic":62293,"prevInTime":62289,"nextInTime":62291,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"Thank you, everyone, for all your advice and help. I m really, really grateful. We re in the UK so might have to look for English alternatives to some of the","messageBody":"<div id=\"ygrps-yiv-118741615\">Thank you, everyone, for all your advice and help. I&#39;m really, really grateful.<br/>\nWe&#39;re in the UK so might have to look for &#39;English alternatives&#39; to some of the suggestions but you&#39;ve jogged my memory to some things I&#39;d forgotten to look into.<br/>\nI&#39;ve signed up to Freecycle.<br/>\nI usually do plenty of veg growing but haven&#39;t done much this year as my girls have lost interest and I haven&#39;t had time to go by myself  (when my husband was working long hours). Too late to plant anymore this year but I&#39;m grateful for the few things I did manage to plant.<br/>\nI used to make most of our food from scratch, plus cleaning products etc, so with a bit of planning I can do that again.<br/>\nPocket money would be a good idea too.<br/>\n<br/>\nI also see I&#39;ve been looking at this wrong, as something to endure rather than embrace. I feel very emotional about it all. And I&#39;m still not sure how to react when the children ask for things we can&#39;t afford that we could a month ago.<br/>\nI feel I want to be sympathetic. I want to rock them and say &#39;I&#39;m sorry we can&#39;t buy that for you&#39;. But that this will just make them sad. I also know I need to be more positive. And that the children won&#39;t feel any loss if I can still create abundance, albeit in a different way.<br/>\n<br/>\nI&#39;m going to go away and re-read the replies.<br/>\n<br/>\nLou xx</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Change in financial circumstances","postDate":"1312922912","msgId":62279,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYxQkY4MzMzLTg3Q0QtNDY2RC05ODhBLTc5QTZDNjk4NUU5MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PEJMVTAtU01UUDEwNEZEQUEyOTQ5RERFMTI1NzM1Nzk3QzEyMDBAcGh4LmdibD4=","referencesHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPiA8Q0FNdWptZHUyRlcxWEJiVytkU0xuTlNtLUQ1VUpzdk1Yb0MxRk03Vi1MRllpUFpVYnNBQG1haWwuZ21haWwuY29tPiA8MTMxMjkxNzc5Mi41Mjk0Ni5ZYWhvb01haWxOZW9Ad2ViMTEwNDAxLm1haWwuZ3ExLnlhaG9vLmNvbT4gPEJMVTAtU01UUDEwNEZEQUEyOTQ5RERFMTI1NzM1Nzk3QzEyMDBAcGh4LmdibD4="},"prevInTopic":62277,"nextInTopic":62290,"prevInTime":62278,"nextInTime":62280,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"-=-We are a family of 7 too. I don t know how you do $700 a month. I need more help. We are vegetarians and eat pretty simply but spend way more than this. Is","messageBody":"<div id=\"ygrps-yiv-1530270494\">-=-We are a family of 7 too. I don&#39;t know how you do $700 a month. I need more help. We are vegetarians and eat pretty simply but spend way more than this. Is this strictly food. Do you eat fruits? What about snacks like tortilla chips, pretzels?-=-<br/>\n<br/>\nAdvice on all kinds of money-saving methods is skirting the topic.  Particulars about whether a particular family eats pretzels is way past the edge of on-topic.  <br/>\n<br/>\nPlease keep posts philosophical and useful to large numbers of people, per the posting guidelines.  (At the bottom of this e-mail at &quot;go to your group&quot; you can get to those links; if you&#39;re online reading, click the group page, upper left.)<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1312919879","msgId":62275,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk2MTk1RkI2LUJGMDgtNDU2OS04OEMyLUU1QjhDRkEzQTQ2MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoxcmY4bytibWtnQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxcmY4bytibWtnQGVHcm91cHMuY29tPg=="},"prevInTopic":62274,"nextInTopic":62277,"prevInTime":62274,"nextInTime":62276,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"-=-Every yes after being controlling is healing. -=- Every yes after having been controlled is healing, too.  Long before Kirby knew what was going on or","messageBody":"<div id=\"ygrps-yiv-703768207\">-=-Every &#39;yes&#39; after being controlling is healing. -=-<br/>\n<br/>\nEvery &#39;yes&#39; after having been controlled is healing, too.  Long before Kirby knew what was going on or could compare his life to anyone else&#39;s, my own childhood hurts were being healed by my being as sweet to my new baby, and then to my toddler, as I could figure out how to be.  La Leche League helped me.  Adult Children of Alcoholics helped me.  Reading books on parenting and on clarity helped me.   A few years later, Growing Without Schooling magazine helped me.  Because of all that, and because those things weren&#39;t easy to find, or were doled out in one-hour sessions weekly, I was really VERY interested in providing better, quicker help for other parents to find those truths and tools in easier ways.  <br/>\n<br/>\nAlong the way I&#39;ve found other moms (mostly; occasionally a dad) who are helping other parents freely too, and it&#39;s heartwarming.  I appreciate every single thoughtful post that says anything like -=-Every &#39;yes&#39; after being controlling is healing. -=-    Those statements change lives in good ways every single day.<br/>\n<br/>\nSomeone on facebook this morning wrote  &quot;I do not agree that bad advice is not good advice.&quot;<br/>\n<br/>\nWhen people can&#39;t tell bad from good, there&#39;s no direction to go but down.<br/>\n<br/>\nSandra</div>","specialLinks":[]},{"userId":63955105,"authorName":"luvkadcl@hotmail.com","from":"&quot;luvkadcl@...&quot; &lt;luvkadcl@...&gt;","profile":"luvkadcl","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Change in financial circumstances","postDate":"1312919045","msgId":62277,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEJMVTAtU01UUDEwNEZEQUEyOTQ5RERFMTI1NzM1Nzk3QzEyMDBAcGh4LmdibD4=","inReplyToHeader":"PDEzMTI5MTc3OTIuNTI5NDYuWWFob29NYWlsTmVvQHdlYjExMDQwMS5tYWlsLmdxMS55YWhvby5jb20+","referencesHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPiA8Q0FNdWptZHUyRlcxWEJiVytkU0xuTlNtLUQ1VUpzdk1Yb0MxRk03Vi1MRllpUFpVYnNBQG1haWwuZ21haWwuY29tPiA8MTMxMjkxNzc5Mi41Mjk0Ni5ZYWhvb01haWxOZW9Ad2ViMTEwNDAxLm1haWwuZ3ExLnlhaG9vLmNvbT4="},"prevInTopic":62275,"nextInTopic":62279,"prevInTime":62276,"nextInTime":62278,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"We are a family of 7 too. I don t know how you do $700 a month. I need more help. We are vegetarians and eat pretty simply but spend way more than this. Is","messageBody":"<div id=\"ygrps-yiv-1650577910\">We are a family of 7 too. I don&#39;t know how you do $700 a month. I need more help. We are vegetarians and eat pretty simply but spend way more than this. Is this strictly food. Do you eat fruits? What about snacks like tortilla chips, pretzels?<br/>\nThanks for any help :)<br/>\nCindy<br/>\n<br/>\nSent via DROID on Verizon Wireless<br/>\n<br/>\n-----Original message-----<br/>\nFrom: Jenny Cyphers &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:jenstarc4@...\">jenstarc4@...</a>&gt;<br/>\nTo: &quot;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&quot; &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>&gt;<br/>\nSent: Tue, Aug 9, 2011 19:23:12 GMT+00:00<br/>\nSubject: Re: [AlwaysLearning] Change in financial circumstances<br/>\n<br/>\n***Your local co-op extension can<br/>\nhelp. There might even be free classes or info.***<br/>\n<br/>\n<br/>\nYou reminded me that Seventh Day Adventist&#39;s almost always offer free cooking classes.  They are really big on vegetarian meals and like to provide people with the knowledge of how to cook good vegetarian food.<br/>\n<br/>\nAlso, others have mentioned food pantries.  They can be great resources if you are ever low on food and money.  Sometimes you can volunteer at them, so it doesn&#39;t feel so much like taking without giving, if you are a person who has a  hard time with that.  Sometimes you get stuff you might never have tried to begin with.  Higher end grocery stores often donate things to food pantries.<br/>\n<br/>\nI learned how to make lots of things myself.  Laundry soap is super easy to make yourself and super super cheap, as in 2 gallons for about $2 and it lasts for a couple of months.  A lot of people use Naptha soap, but I like the Trader Joe&#39;s oatmeal soap that comes in a 2 pack.  If you have the ingredients for laundry soap making, you can also use that washing soda for dish washer detergent and use vinegar for the rinse cycle.  That eliminates two relatively pricey items that are used daily.  Use baking soda, or even the washing soda for other cleaning, they both really work.<br/>\n<br/>\nIf you are truly looking to cut corners on spending, it helps to look at pennies as well as dollars.  Combine all trips and outings with necessary errands to lower gas expenses.<br/>\n<br/>\nLike other people have said, use thrift stores!  I&#39;m fortunate in that the thrift store I like is across the street from the craft and fabric store I use.  So I can compliment what I find at the thrift store if I need to.  <br/>\n<br/>\nWe invested in a Costco membership.  That&#39;s made a big difference on the things we use a lot of, like canned goods and bulk items like rice and sugar.  Letting my fridge become empty before I go grocery shopping has also helped by forcing us not to waste food that would otherwise be hidden in the back by new things.  I&#39;ve found that doing one big shopping trip a month helps and only buying specific items when needed, like milk or produce for the rest of the month.  Our family feeds 7 people with about $700 a month.  It is doable.  We are even able to take special requests within that budget.  The thing that makes it work is making things from scratch.  I don&#39;t buy canned beans, I buy bulk and make bulk and freeze it.  I don&#39;t buy broth, I save all veggie scraps and put them in a freezer bag and when it&#39;s full I make a huge pot of broth and freeze it in meal sized storage containers.  We go to u-pick places and pick and freeze and/or make jam.<br/>\n  I make pizza from scratch and bread sometimes.  I make huge pots of soups and freeze leftovers to be used months later.<br/>\n<br/>\nIf you have pets, make your own food.  I make huge batches of dog food and freeze it.  I used to do that for the cats, but one of them refuses it, so I stopped.  <br/>\n<br/>\nInvest in a cheap freezer if you don&#39;t have one!  That single thing made a significant difference!  I bought mine from a neighbor for $20 and it&#39;s bigger than my fridge!<br/>\n<br/>\nThe best advice I can give, other than the little details, is to feel abundant with less.  If you can feel abundant, you will see abundance and your kids won&#39;t feel that lack so harshly.  All the details can happen as a matter of necessity as you learn to live with less money.  If you can do that and feel abundant, when you get more, it feels overwhelmingly abundant.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":62434209,"authorName":"Jenny Cyphers","from":"Jenny Cyphers &lt;jenstarc4@...&gt;","profile":"jenstarc4","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Change in financial circumstances","postDate":"1312917792","msgId":62274,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDEzMTI5MTc3OTIuNTI5NDYuWWFob29NYWlsTmVvQHdlYjExMDQwMS5tYWlsLmdxMS55YWhvby5jb20+","inReplyToHeader":"PENBTXVqbWR1MkZXMVhCYlcrZFNMbk5TbS1ENVVKc3ZNWG9DMUZNN1YtTEZZaVBaVWJzQUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPiA8Q0FNdWptZHUyRlcxWEJiVytkU0xuTlNtLUQ1VUpzdk1Yb0MxRk03Vi1MRllpUFpVYnNBQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":62273,"nextInTopic":62275,"prevInTime":62273,"nextInTime":62275,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"***Your local co-op extension can help. There might even be free classes or info.*** You reminded me that Seventh Day Adventist s almost always offer free","messageBody":"<div id=\"ygrps-yiv-1414119975\">***Your local co-op extension can<br/>\nhelp. There might even be free classes or info.***<br/>\n<br/>\n<br/>\nYou reminded me that Seventh Day Adventist&#39;s almost always offer free cooking classes.  They are really big on vegetarian meals and like to provide people with the knowledge of how to cook good vegetarian food.<br/>\n<br/>\nAlso, others have mentioned food pantries.  They can be great resources if you are ever low on food and money.  Sometimes you can volunteer at them, so it doesn&#39;t feel so much like taking without giving, if you are a person who has a  hard time with that.  Sometimes you get stuff you might never have tried to begin with.  Higher end grocery stores often donate things to food pantries.<br/>\n<br/>\nI learned how to make lots of things myself.  Laundry soap is super easy to make yourself and super super cheap, as in 2 gallons for about $2 and it lasts for a couple of months.  A lot of people use Naptha soap, but I like the Trader Joe&#39;s oatmeal soap that comes in a 2 pack.  If you have the ingredients for laundry soap making, you can also use that washing soda for dish washer detergent and use vinegar for the rinse cycle.  That eliminates two relatively pricey items that are used daily.  Use baking soda, or even the washing soda for other cleaning, they both really work.<br/>\n<br/>\nIf you are truly looking to cut corners on spending, it helps to look at pennies as well as dollars.  Combine all trips and outings with necessary errands to lower gas expenses.<br/>\n<br/>\nLike other people have said, use thrift stores!  I&#39;m fortunate in that the thrift store I like is across the street from the craft and fabric store I use.  So I can compliment what I find at the thrift store if I need to.  <br/>\n<br/>\nWe invested in a Costco membership.  That&#39;s made a big difference on the things we use a lot of, like canned goods and bulk items like rice and sugar.  Letting my fridge become empty before I go grocery shopping has also helped by forcing us not to waste food that would otherwise be hidden in the back by new things.  I&#39;ve found that doing one big shopping trip a month helps and only buying specific items when needed, like milk or produce for the rest of the month.  Our family feeds 7 people with about $700 a month.  It is doable.  We are even able to take special requests within that budget.  The thing that makes it work is making things from scratch.  I don&#39;t buy canned beans, I buy bulk and make bulk and freeze it.  I don&#39;t buy broth, I save all veggie scraps and put them in a freezer bag and when it&#39;s full I make a huge pot of broth and freeze it in meal sized storage containers.  We go to u-pick places and pick and freeze and/or make jam.<br/>\n  I make pizza from scratch and bread sometimes.  I make huge pots of soups and freeze leftovers to be used months later.<br/>\n<br/>\nIf you have pets, make your own food.  I make huge batches of dog food and freeze it.  I used to do that for the cats, but one of them refuses it, so I stopped.  <br/>\n<br/>\nInvest in a cheap freezer if you don&#39;t have one!  That single thing made a significant difference!  I bought mine from a neighbor for $20 and it&#39;s bigger than my fridge!<br/>\n<br/>\nThe best advice I can give, other than the little details, is to feel abundant with less.  If you can feel abundant, you will see abundance and your kids won&#39;t feel that lack so harshly.  All the details can happen as a matter of necessity as you learn to live with less money.  If you can do that and feel abundant, when you get more, it feels overwhelmingly abundant.<br/>\n<br/>\n<br/>\n <br/>\n<br/>\n <br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":336246301,"authorName":"NCMama","from":"&quot;NCMama&quot; &lt;dharmamama1@...&gt;","profile":"carenkh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Change in financial circumstances","postDate":"1312899160","msgId":62273,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxcmY4bytibWtnQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxcjhqcSs0djQwQGVHcm91cHMuY29tPg=="},"prevInTopic":62272,"nextInTopic":62274,"prevInTime":62272,"nextInTime":62274,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"~~My kids learned a LOT about the consumer world by our trips to the dollar store.  I will say my husband was in part against it because of the cheap plastic","messageBody":"<div id=\"ygrps-yiv-465125136\">~~My kids learned a LOT about the consumer world by our trips to the dollar store.  I will say my husband was in part against it because of the &quot;cheap plastic crap from China.&quot;  But that gave us an opportunity to talk a little bit about it - a LITTLE bit.  I was not about to tell my small girls what I understand life to be like working in a factory in China.~~<br/>\n<br/>\n<br/>\n<br/>\nWhen my oldest was around 3, we went to a dollar store for paper and markers. He found these tie-dye colored stuffed animals - a giraffe and dog. They had VERY long legs, and he was intrigued with them. He wanted to buy a couple, but I looked at them, and saw the cheaply sewn seams and how thin the cloth was. I knew they wouldn&#39;t last very long at all, so I pointed those things out to him and told him I didn&#39;t think it would be a good purchase. This was before radical unschooling, when what I said was how it was. I was very sweet about it, and understanding of his hurt feelings. (Yuck. I don&#39;t like remembering that. Causing hurt feelings, then empathizing... yeah, that&#39;s real sweet!)<br/>\n<br/>\nAs we stood in line, I reconsidered the animals. He loved to play with animals, stuffed or plastic. He&#39;d line them up by size, or by color. He asked me to sew clothes for them, because he thought they might be cold. I realized that the few dollars I would spend would be well worth it, even if the animals fell apart as soon as we got home. I apologized for saying no, and we went back over to the box, and he picked out 4 of them... and 15 years later, they&#39;re still here! He got years and years out of playing with them, as did his younger brother. They used to make Animal Town out of boxes and furniture, and all of their stuffed animals lived there. We had a star-shaped box, which of course, became the coffee shop, Starbox.<br/>\n<br/>\nHe also had a Happy Meal toy, a character held by a magnet on a little skateboard. For a long time, probably close to a year, that little guy went everywhere we did. And he was part of play at our home for a long time after that. Again, years of playing with him.<br/>\n<br/>\nOur not buying those things would not change the situation for the people that made them. The toys already existed. But my willingness to get them enriched the boys&#39; lives, and made their lives a little sweeter and more fun.<br/>\n<br/>\nEvery &#39;yes&#39; after being controlling is healing. We&#39;ve gone through tight times, and made lists of things, trolled Freecycle, asked friends, etc. There is almost always a YES, even if the yes isn&#39;t going to the store right then to get whatever it is. It is yes to the possibility, yes to finding ways to get things or do things, even if it takes some time.<br/>\n<br/>\npeace,<br/>\nCaren</div>","specialLinks":[]},{"userId":172951189,"authorName":"lizarosegottlieb","from":"&quot;lizarosegottlieb&quot; &lt;lizarosegottlieb@...&gt;","profile":"lizarosegottlieb","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: Change in financial circumstances","postDate":"1312892346","msgId":62272,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxcjhqcSs0djQwQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg=="},"prevInTopic":62271,"nextInTopic":62273,"prevInTime":62271,"nextInTime":62273,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"... have gone from being reasonably comfortable to having to count pennies, (if you see what I mean) and would like some ideas on how to lessen the impact on","messageBody":"<div id=\"ygrps-yiv-395730833\">--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Lou Davis&quot; &lt;louloukitty81@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; We&#39;ve recently had a big change in our financial circumstances and<br/>\n </span></blockquote>have gone from being reasonably comfortable to having to count pennies,<br/>\n(if you see what I mean) and would like some ideas on how to lessen the<br/>\nimpact on my 2 daughters (aged 4 and 6).<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n<br/>\n </span></blockquote>We hardly ever have a swishy feeling about our bank account.  On paper,<br/>\nwe are poor.  My girls, 8 and 10, notice that our family doesn&#39;t have as<br/>\nmuch nice/fun stuff as our friends.  When they were the age of your<br/>\ngirls, it was harder for them to understand the whole financial thing. <br/>\nWe live with my husband&#39;s parents (well, his Dad passed away this<br/>\nwinter), he works two days a week, I work 3-4.  I make half what he<br/>\nmakes.  He used to work 4 days a week, but it was hurting his body too<br/>\nmuch (a professional gardener).  Plus he&#39;s spending loads more time with<br/>\nthe girls.  He&#39;s also there for his mom, and that&#39;s good for now. <br/>\nLiving here, we do not have to pay rent or make housepayments.  We have<br/>\nhigh-speed internet (whew), a rabbit, chickens, are raising rare-breed<br/>\npigs, cats, a dog, goldfish, a big yard and woods, and a lovely swimming<br/>\nhole in a beautiful river.<br/>\n<br/>\nBut all of that doesn&#39;t really matter to little girls when they want<br/>\nsomething.  Here are a few ideas I&#39;ve used:<br/>\n-  let them pick out the groceries with you<br/>\n-  give them an allowance; it&#39;s all theirs<br/>\n-  go to the dollar store with that allowance; sure it&#39;s cheap and much<br/>\nof it will break, but they get to exercise control.  My kids learned a<br/>\nLOT about the consumer world by our trips to the dollar store.  I will<br/>\nsay my husband was in part against it because of the &quot;cheap plastic crap<br/>\nfrom China.&quot;  But that gave us an opportunity to talk a little bit about<br/>\nit - a LITTLE bit.  I was not about to tell my small girls what I<br/>\nunderstand life to be like working in a factory in China.  Someday, yes.<br/>\n-  window shopping.  We go to Target, KMart, toy stores, wherever, and I<br/>\nlet the girls take as long as they want.  I get bored, but after a while<br/>\nyou begin to notice (my girls certainly do) that there really isn&#39;t that<br/>\nmuch out there.<br/>\n- here&#39;s my favorite, a game I learned from The Daily Groove, by Scott<br/>\nNoelle:  Do you know how I know we&#39;re rich?<br/>\n  <a rel=\"nofollow\" target=\"_blank\" href=\"http://www.enjoyparenting.com/daily-groove/how-i-know\">http://www.enjoyparenting.com/daily-groove/how-i-know</a><br/>\nOne day we were driving in the car and they were whining about how they<br/>\ncouldn&#39;t have anything they wanted, and I remembered this game I&#39;d read<br/>\nabout.  It felt a little silly at first, but my girls transformed and<br/>\njoined it.  It was beautiful.<br/>\n<br/>\nLiza</div>","specialLinks":[]},{"userId":231415297,"authorName":"chris ester","from":"chris ester &lt;chris.homeschool@...&gt;","profile":"chris_e_bear","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Change in financial circumstances","postDate":"1312884179","msgId":62271,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBTXVqbWR1MkZXMVhCYlcrZFNMbk5TbS1ENVVKc3ZNWG9DMUZNN1YtTEZZaVBaVWJzQUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg=="},"prevInTopic":62269,"nextInTopic":62272,"prevInTime":62270,"nextInTime":62272,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"Hi, I am not a church person, but the Angel Food Ministries is a really good program and they do not insist on any religious affiliation or activity (at least","messageBody":"<div id=\"ygrps-yiv-1723601847\">Hi,<br/>\nI am not a church person, but the Angel Food Ministries is a really good<br/>\nprogram and they do not insist on any religious affiliation or activity (at<br/>\nleast here in Maryland).<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.angelfoodministries.com/\">http://www.angelfoodministries.com/</a><br/>\n<br/>\nAs for arts and crafts supplies.  There is a lot that you can make.  There<br/>\nis a PBS show called Donna&#39;s Day that provides a lot of DIY crafts and<br/>\nsupplies.<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.donnasday.com/act/\">http://www.donnasday.com/act/</a><br/>\n<br/>\nAlso, for paints, you can buy powdered pigment in yellow, blue and red and<br/>\nmix up your own tempura paints.  The powders are probably available at<br/>\nAmazon or a local craft store.  Barring that, there are recipes for paint<br/>\nthat use flour, milk food dye and water to be found on the internet.  You<br/>\ncan revive crayons by melting broken ones and pouring into a small mold.<br/>\nJust put together similar colors to make some interesting new crayons.<br/>\n<br/>\nI love to make bread and found a copy of the Healthy Bread in minutes a day<br/>\nat the library cheap. If you can&#39;t find a copy of the book, then you can<br/>\nlook it up on the Mother Earth News website, an excellent site for info<br/>\nabout saving money and living frugally.<br/>\n<br/>\nI have found a lot of cheap books for all ages at the library and thrift<br/>\nstores.  The thrift store used to be a field trip to my kids.  We also found<br/>\na lot of good, cheap stuff for arts and crafts at dollar stores and<br/>\ninventory surplus stores like Big Lots and Ollies.  Tuesday Morning is<br/>\nanother closeout store that sells household items.  I am sure that you can<br/>\nfind places that are local either with a google search or with the phone<br/>\nbook.<br/>\n<br/>\nAldi&#39;s grocery store is very cheap, albeit with a limited selection.  But it<br/>\nis good food and much of it is basic.  They have amazing chocolate at really<br/>\ngood prices.  Walmart Superstores or warehouse stores (as bad as they are)<br/>\nwill often have basics, like flour and sugar at significant savings.  The<br/>\ndownside of ordering through amazon is that you may have to buy a case.<br/>\n<br/>\nIf you use the products that they are for, coupons are also useful.<br/>\n<br/>\nAlso, I became vegetarian in college because I could not afford meat.  My<br/>\nhusband and I never went back and our children have never eaten meat and<br/>\nthey are both big strapping teenagers now.  Just don&#39;t fall into the trap of<br/>\npaying for the fake meat stuff that is more expensive than the real thing.<br/>\n<br/>\nOr you can be what a friend of mine calls virtual veg, use meat as an<br/>\nenhancer and supplement to hardy vegetable dishes.  Find out if your store&#39;s<br/>\nproduce department sells &quot;seconds&quot; on certain days, usually mornings.  I<br/>\nhave gotten amazing produce at 90% savings because it was ripe and would not<br/>\nsit on a shelf for more than another 2 days.<br/>\n<br/>\nFind ways to use past prime fruit or veggies.  Overripe bananas make a yummy<br/>\nand healthy treat in banana bread.  Slightly wilted veggies can be delicious<br/>\nin a soup or stew that is flavored with leftover meat or cheap cuts.<br/>\nInstead of boxed cereal, oatmeal with some brown sugar (or honey,or syrup or<br/>\nwhite sugar), ground almonds (or any other nut or nut butter to boost the<br/>\nprotein content and make it more filling), some fruit or dried fruit, and<br/>\ncinnamon with a little milk can be wonderful and filling and when bought in<br/>\nbulk, oats are really cheap.<br/>\n<br/>\nI don&#39;t know where you live but there is a chance that you can still plant<br/>\nsome veggies, if even if containers, like lettuces and hardier greens like<br/>\ncurly kale or spinach, or you can even sprout some seeds or beans for a<br/>\nhealthy, vitamin packed veggie.  There may also be some buyer&#39;s co-ops in<br/>\nyour area.  I would google &quot;cheap food&quot; and my zip code to see what is out<br/>\nthere.<br/>\n<br/>\nRead some urban homesteading stuff for ideas of what is simple and cheap<br/>\nthat you can produce some of your own food.  Your local co-op extension can<br/>\nhelp.  There might even be free classes or info.  Look to any local<br/>\ngardening groups too.<br/>\n<br/>\nThis can be a time of opportunity to learn more self-sufficiency and have<br/>\ngrand creative adventures while trying new things instead of a time of fear<br/>\nand worry and deprivation.  Frugality is a wonderful gift, just take a deep<br/>\nbreath and remember what you have.<br/>\nChris<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Aug 8, 2011 at 7:14 AM, Lou Davis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:louloukitty81@...\">louloukitty81@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; We&#39;ve recently had a big change in our financial circumstances and have<br/>\n&gt; gone from being reasonably comfortable to having to count pennies, (if you<br/>\n&gt; see what I mean) and would like some ideas on how to lessen the impact on my<br/>\n&gt; 2 daughters (aged 4 and 6).<br/>\n&gt;<br/>\n&gt; My husband has gone from working outside the house from 8am-9pm to working<br/>\n&gt; mostly from home 9am-5pm. This has had a very positive effect on the<br/>\n&gt; children, and myself, and we&#39;re all a lot happier because of it.<br/>\n&gt; However, my husband is self-employed and we don&#39;t know how much money he&#39;s<br/>\n&gt; going to be earning from one month to the next.<br/>\n&gt;<br/>\n&gt; We need to cut our expenses down as much as we can for an unknown period of<br/>\n&gt; time.<br/>\n&gt; We&#39;ve cut down as much as we can on household bills and things for<br/>\n&gt; ourselves (the adults).<br/>\n&gt;<br/>\n&gt; We&#39;ve explained to our 6 year old as much as she can understand about<br/>\n&gt; having less money, but our 4 year old can&#39;t grasp it at all (being too<br/>\n&gt; young).<br/>\n&gt;<br/>\n&gt; The children generally like to stay home or go to my parents house a 5<br/>\n&gt; minute walk away, but have wanted to stay home even more so since this<br/>\n&gt; happened a month ago (a useful thing given the current situation).<br/>\n&gt;<br/>\n&gt; We&#39;re trying to stick to going to the couple of places we&#39;d agreed already<br/>\n&gt; to go (a day trip out next week to a maze) but one of those is a week long<br/>\n&gt; unschooling camping trip which I just don&#39;t think we&#39;re going to be able to<br/>\n&gt; do. I feel bad about making them excited about this then saying we can&#39;t go.<br/>\n&gt; My husband and I have discussed going for a shorter time, maybe just a<br/>\n&gt; couple of nights instead.<br/>\n&gt;<br/>\n&gt; Our biggest expense is food. We buy a huge variety of things so we have a<br/>\n&gt; variety of choices. For example - Different breads, rice cakes, crackers, 6<br/>\n&gt; different types of honey/syrup sauces, lots of snacks and chocolates, a big<br/>\n&gt; variety of fruits, 8 different types of cereal.... you get what I mean.<br/>\n&gt; We&#39;ve been eating through our stock of food but now we&#39;re running low. The<br/>\n&gt; children are asking for foods we don&#39;t have and can&#39;t afford to replace and<br/>\n&gt; are asking us to get some when we next go shopping.<br/>\n&gt; They&#39;re disappointed when I explain we might not be able buy it.<br/>\n&gt; I&#39;ve explained to them that we can&#39;t buy everything we&#39;re used to buying so<br/>\n&gt; we write down all of their requests. When i&#39;m due to go shopping we go<br/>\n&gt; through the lists and they chose the 2-3 things they want the most and i&#39;ve<br/>\n&gt; tried to get them if we can afford them.<br/>\n&gt; I can see the same thing is going to start happening with their craft<br/>\n&gt; supplies as some of them are running low, and I&#39;ve usually re-stocked them<br/>\n&gt; before now. And probably there&#39;s other things I can&#39;t think of right now<br/>\n&gt; that we&#39;ll run out of/will break that we can&#39;t replace as quickly or at all.<br/>\n&gt;<br/>\n&gt; I&#39;m looking into places to get cheaper food, cheaper craft supplies etc<br/>\n&gt; which I hope will help.<br/>\n&gt;<br/>\n&gt; I&#39;m just wondering if there&#39;s any other suggestions on dealing with having<br/>\n&gt; a lot less money than we used to.<br/>\n&gt;<br/>\n&gt; Thanks<br/>\n&gt; Lou<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":223034209,"authorName":"Genevieve Raymond","from":"Genevieve Raymond &lt;genevieve.raymond@...&gt;","profile":"genevieveraymond","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1312830947","msgId":62269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDVEQ0FDMTVGLThFNzktNDQwQi05NkRFLUY3QkNDMzE5RDNEQkBnbWFpbC5jb20+","inReplyToHeader":"PDdCOEM2OTQwLUZCRTktNDY0RS1CQzk5LTA4MzIwM0JDNjk0OUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGoxcDhnMCtsMm1mQGVHcm91cHMuY29tPiA8N0I4QzY5NDAtRkJFOS00NjRFLUJDOTktMDgzMjAzQkM2OTQ5QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":62268,"nextInTopic":62271,"prevInTime":62268,"nextInTime":62270,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"Not sure about your thrift store, but ours sells all sorts of discarded but still usable art supplies--markers, crayons, paper, paints, yarn, fabric scraps,","messageBody":"<div id=\"ygrps-yiv-433305940\">Not sure about your thrift store, but ours sells all sorts of discarded but still usable art supplies--markers, crayons, paper, paints, yarn, fabric scraps, etc.<br/>\n<br/>\n-Genevieve<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Aug 8, 2011, at 12:06 PM, Sandra Dodd wrote:<br/>\n<br/>\n&gt; Play dough is easy and relatively inexpensive too. Sandra has recipes on her site under &quot;Toddlers.&quot;<br/>\n&gt; <br/>\n&gt; <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/playdough\">http://sandradodd.com/playdough</a><br/>\n&gt; <br/>\n&gt; there&#39;s a little glitch in format; I&#39;m going to fix it now.<br/>\n&gt; <br/>\n&gt; [Non-text portions of this message have been removed]<br/>\n&gt; <br/>\n&gt; <br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: Change in financial circumstances","postDate":"1312830383","msgId":62268,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDdCOEM2OTQwLUZCRTktNDY0RS1CQzk5LTA4MzIwM0JDNjk0OUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoxcDhnMCtsMm1mQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxcDhnMCtsMm1mQGVHcm91cHMuY29tPg=="},"prevInTopic":62267,"nextInTopic":62269,"prevInTime":62267,"nextInTime":62269,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"Play dough is easy and relatively inexpensive too. Sandra has recipes on her site under Toddlers. http://sandradodd.com/playdough there s a little glitch in","messageBody":"<div id=\"ygrps-yiv-991184829\">Play dough is easy and relatively inexpensive too. Sandra has recipes on her site under &quot;Toddlers.&quot;<br/>\n<br/>\n <a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/playdough\">http://sandradodd.com/playdough</a><br/>\n<br/>\nthere&#39;s a little glitch in format; I&#39;m going to fix it now.<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":472480490,"authorName":"sheeboo2","from":"&quot;sheeboo2&quot; &lt;brmino@...&gt;","profile":"sheeboo2","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Change in financial circumstances","postDate":"1312826688","msgId":62267,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxcDhnMCtsMm1mQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg=="},"prevInTopic":62266,"nextInTopic":62268,"prevInTime":62266,"nextInTime":62268,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"... Recyclables make fantastic art supplies.  Empty food containers, everything from cereal boxes to yogurt containers, plastic lids and caps, toilet paper and","messageBody":"<div id=\"ygrps-yiv-1928711013\">----- I&#39;m looking into places to get cheaper food, cheaper craft supplies etc -----<br/>\n<br/>\nRecyclables make fantastic art supplies.  Empty food containers, everything from cereal boxes to yogurt containers, plastic lids and caps, toilet paper and paper towel tubes.....save them!<br/>\n<br/>\nYou can make glue, very inexpensively with flour and water: <a rel=\"nofollow\" target=\"_blank\" href=\"http://sustainableecho.com/homemade-natural-glue/\">http://sustainableecho.com/homemade-natural-glue/</a><br/>\n<br/>\nPlay dough is easy and relatively inexpensive too. Sandra has recipes on her site under &quot;Toddlers.&quot;<br/>\n<br/>\nGoogle &quot;DIY craft supplies&quot; and you&#39;ll find a lot of other fixes.<br/>\n<br/>\nYou may also want to look into making your own household cleaning products, as that can save a lot of money too.  Vinegar and baking soda are cheap! (and mixed together, they make great volcanoes!)<br/>\n<br/>\nAnd, Sandra is right, I can&#39;t believe the amount of free stuff on our local Free-cycle list every day!<br/>\n<br/>\nBrie</div>","specialLinks":[]},{"userId":154304522,"authorName":"plaidpanties666","from":"&quot;plaidpanties666&quot; &lt;plaidpanties666@...&gt;","profile":"plaidpanties666","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: Change in financial circumstances","postDate":"1312824739","msgId":62266,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxcDZqMytzczM1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg=="},"prevInTopic":62265,"nextInTopic":62267,"prevInTime":62265,"nextInTime":62267,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"... ************* Do you know any of the other families? Can you share expenses with someone by sharing a site/cabin or carpooling? Can you ask the group for","messageBody":"<div id=\"ygrps-yiv-1225113785\">&quot;Lou Davis&quot; &lt;louloukitty81@...&gt; wrote:<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; We&#39;re trying to stick to going to the couple of places we&#39;d agreed already to go (a day trip out next week to a maze) but one of those is a week long unschooling camping trip which I just don&#39;t think we&#39;re going to be able to do.<br/>\n </span></blockquote>*************<br/>\n<br/>\nDo you know any of the other families? Can you share expenses with someone by sharing a site/cabin or carpooling? Can you ask the group for help with gas? Seriously, its not uncommon at the unschooling gathering I go to twice a year to have a family ask for financial help, especially if they&#39;ve already paid the reservation fee. It doesn&#39;t hurt to ask - and honestly, people like to help when they can. When we were utterly broke, right after my partner hurt his shoulder and I was looking for a job, it helped me to think about how much I like to give and that I was offering people an opportunity to give and feel good. <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Our biggest expense is food.<br/>\n<br/>\n </span></blockquote>Make more from scratch. That helps extend your finances and lets you do fun things so the kids don&#39;t see the situation as sad and lacking but a fun new adventure. Splurge on things like food coloring and sprinkles to make things fun, or some new cookie-cutters. Go nuts with baking.<br/>\n<br/>\nSee if your area churches have &quot;free bread&quot; days. That&#39;s a big thing in my neck of the woods, but I don&#39;t know how wide-spread it is. Local churches hand out breads that are at the edge of their shelf life. If you don&#39;t like the breads, you can always re-cook them into bread puddings or use them as bread-crumbs and croutons. And sometimes you get fun discontinued stuff, too. <br/>\n<br/>\nIt helps to see being broke as a chance to use your creativity more. <br/>\n<br/>\n---Meredith</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Change in financial circumstances","postDate":"1312823727","msgId":62265,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEQ0ODhBNkIzLUNERkMtNDg0Ny05NjAxLTM3MzcxNzlDQ0E1MkBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg=="},"prevInTopic":62264,"nextInTopic":62266,"prevInTime":62264,"nextInTime":62266,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"-=-t one of those is a week long unschooling camping trip which I just don t think we re going to be able to do. I feel bad about making them excited about","messageBody":"<div id=\"ygrps-yiv-109153021\">-=-t one of those is a week long unschooling camping trip which I just don&#39;t think we&#39;re going to be able to do. I feel bad about making them excited about this then saying we can&#39;t go.-=-<br/>\n<br/>\nMaybe you could invite another family to visit you and camp in the yard, or have a slumber party in the house.  <br/>\n<br/>\nGoing for part of it and leaving might seem more cruel than avoiding the weeklong campout.<br/>\n<br/>\n-=-We&#39;ve explained to our 6 year old as much as she can understand about having less money, but our 4 year old can&#39;t grasp it at all (being too young).-=-<br/>\n<br/>\nDon&#39;t explain it to a four year old.  Just maintain an environment of joy and smiles and say &quot;someday, maybe&quot; when you need to, and smile.  Don&#39;t hug and rock and say &quot;I&#39;m so sorry we can&#39;t,&quot;  but say &quot;Wouldn&#39;t that be cool?  Let&#39;s put it on the list of things we might do somewhere.&quot;<br/>\n<br/>\n-=-I&#39;m looking into places to get cheaper food, cheaper craft supplies etc which I hope will help.-=-<br/>\n<br/>\nVariations on rice and beans could help for food (and there are lots of variations).<br/>\n<br/>\nCraft supplies could probably be gotten by asking on freecycle!<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":367855290,"authorName":"Liz Schultz","from":"Liz Schultz &lt;e.spencer.schultz@...&gt;","profile":"lizspencer10478","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: [AlwaysLearning] Change in financial circumstances","postDate":"1312818332","msgId":62264,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBT3BmWD03U2s2VVNDNXZkU0syLTBWcjVGSzZrUW9uUmVOUVdPaV90UStFdE13eUNjZ0BtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg==","referencesHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg=="},"prevInTopic":62261,"nextInTopic":62265,"prevInTime":62263,"nextInTime":62265,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"We have to watch our food costs closely also. I have found that lots of times I can find things on amazon.com by the case for much less than our local grocery","messageBody":"<div id=\"ygrps-yiv-1022432313\">We have to watch our food costs closely also. I have found that lots of<br/>\ntimes I can find things on amazon.com by the case for much less than our<br/>\nlocal grocery store. There are things that they offer a subscription program<br/>\non and then discount further, I use it for staples like coconut oil and nut<br/>\nbutter and get huge savings.<br/>\n<br/>\nThis book: Healthy Bread in Five Minutes a<br/>\nDay&lt;<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com/Healthy-Bread-Five-Minutes-Day/dp/0312545525\">http://www.amazon.com/Healthy-Bread-Five-Minutes-Day/dp/0312545525</a>&gt;<br/>\nhas<br/>\nmany really great breads that can be made with little work for a great deal<br/>\nless than buying artisan type loaves of bread. And, there are actually a lot<br/>\nof recipes on the internet for crackers that are quite good and surprisingly<br/>\neasy to make.<br/>\n<br/>\nI find that if I save by making things like bread, muffins, granola bars,<br/>\ncrackers, pizza, etc. I have more wiggle room in the food budget for special<br/>\nrequests.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Mon, Aug 8, 2011 at 6:14 AM, Lou Davis &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:louloukitty81@...\">louloukitty81@...</a>&gt; wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; We&#39;ve recently had a big change in our financial circumstances and have<br/>\n&gt; gone from being reasonably comfortable to having to count pennies, (if you<br/>\n&gt; see what I mean) and would like some ideas on how to lessen the impact on my<br/>\n&gt; 2 daughters (aged 4 and 6).<br/>\n&gt;<br/>\n&gt; My husband has gone from working outside the house from 8am-9pm to working<br/>\n&gt; mostly from home 9am-5pm. This has had a very positive effect on the<br/>\n&gt; children, and myself, and we&#39;re all a lot happier because of it.<br/>\n&gt; However, my husband is self-employed and we don&#39;t know how much money he&#39;s<br/>\n&gt; going to be earning from one month to the next.<br/>\n&gt;<br/>\n&gt; We need to cut our expenses down as much as we can for an unknown period of<br/>\n&gt; time.<br/>\n&gt; We&#39;ve cut down as much as we can on household bills and things for<br/>\n&gt; ourselves (the adults).<br/>\n&gt;<br/>\n&gt; We&#39;ve explained to our 6 year old as much as she can understand about<br/>\n&gt; having less money, but our 4 year old can&#39;t grasp it at all (being too<br/>\n&gt; young).<br/>\n&gt;<br/>\n&gt; The children generally like to stay home or go to my parents house a 5<br/>\n&gt; minute walk away, but have wanted to stay home even more so since this<br/>\n&gt; happened a month ago (a useful thing given the current situation).<br/>\n&gt;<br/>\n&gt; We&#39;re trying to stick to going to the couple of places we&#39;d agreed already<br/>\n&gt; to go (a day trip out next week to a maze) but one of those is a week long<br/>\n&gt; unschooling camping trip which I just don&#39;t think we&#39;re going to be able to<br/>\n&gt; do. I feel bad about making them excited about this then saying we can&#39;t go.<br/>\n&gt; My husband and I have discussed going for a shorter time, maybe just a<br/>\n&gt; couple of nights instead.<br/>\n&gt;<br/>\n&gt; Our biggest expense is food. We buy a huge variety of things so we have a<br/>\n&gt; variety of choices. For example - Different breads, rice cakes, crackers, 6<br/>\n&gt; different types of honey/syrup sauces, lots of snacks and chocolates, a big<br/>\n&gt; variety of fruits, 8 different types of cereal.... you get what I mean.<br/>\n&gt; We&#39;ve been eating through our stock of food but now we&#39;re running low. The<br/>\n&gt; children are asking for foods we don&#39;t have and can&#39;t afford to replace and<br/>\n&gt; are asking us to get some when we next go shopping.<br/>\n&gt; They&#39;re disappointed when I explain we might not be able buy it.<br/>\n&gt; I&#39;ve explained to them that we can&#39;t buy everything we&#39;re used to buying so<br/>\n&gt; we write down all of their requests. When i&#39;m due to go shopping we go<br/>\n&gt; through the lists and they chose the 2-3 things they want the most and i&#39;ve<br/>\n&gt; tried to get them if we can afford them.<br/>\n&gt; I can see the same thing is going to start happening with their craft<br/>\n&gt; supplies as some of them are running low, and I&#39;ve usually re-stocked them<br/>\n&gt; before now. And probably there&#39;s other things I can&#39;t think of right now<br/>\n&gt; that we&#39;ll run out of/will break that we can&#39;t replace as quickly or at all.<br/>\n&gt;<br/>\n&gt; I&#39;m looking into places to get cheaper food, cheaper craft supplies etc<br/>\n&gt; which I hope will help.<br/>\n&gt;<br/>\n&gt; I&#39;m just wondering if there&#39;s any other suggestions on dealing with having<br/>\n&gt; a lot less money than we used to.<br/>\n&gt;<br/>\n&gt; Thanks<br/>\n&gt; Lou<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":469090539,"authorName":"Lou Davis","from":"&quot;Lou Davis&quot; &lt;louloukitty81@...&gt;","profile":"louloukitty81","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Change in financial circumstances","postDate":"1312802077","msgId":62261,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGoxb2dldCtzdHVxQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":62264,"prevInTime":62260,"nextInTime":62262,"topicId":62261,"numMessagesInTopic":0,"msgSnippet":"We ve recently had a big change in our financial circumstances and have gone from being reasonably comfortable to having to count pennies, (if you see what I","messageBody":"<div id=\"ygrps-yiv-1678376899\">We&#39;ve recently had a big change in our financial circumstances and have gone from being reasonably comfortable to having to count pennies, (if you see what I mean) and would like some ideas on how to lessen the impact on my 2 daughters (aged 4 and 6). <br/>\n<br/>\nMy husband has gone from working outside the house from 8am-9pm to working mostly from home 9am-5pm. This has had a very positive effect on the children, and myself, and we&#39;re all a lot happier because of it. <br/>\nHowever, my husband is self-employed and we don&#39;t know how much money he&#39;s going to be earning from one month to the next. <br/>\n<br/>\nWe need to cut our expenses down as much as we can for an unknown period of time.<br/>\nWe&#39;ve cut down as much as we can on household bills and things for ourselves (the adults).<br/>\n<br/>\nWe&#39;ve explained to our 6 year old as much as she can understand about having less money, but our 4 year old can&#39;t grasp it at all (being too young).<br/>\n<br/>\nThe children generally like to stay home or go to my parents house a 5 minute walk away, but have wanted to stay home even more so since this happened a month ago (a useful thing given the current situation).<br/>\n<br/>\nWe&#39;re trying to stick to going to the couple of places we&#39;d agreed already to go (a day trip out next week to a maze) but one of those is a week long unschooling camping trip which I just don&#39;t think we&#39;re going to be able to do. I feel bad about making them excited about this then saying we can&#39;t go. My husband and I have discussed going for a shorter time, maybe just a couple of nights instead.<br/>\n<br/>\nOur biggest expense is food. We buy a huge variety of things so we have a variety of choices. For example -  Different breads, rice cakes, crackers, 6 different types of honey/syrup sauces, lots of snacks and chocolates, a big variety of fruits, 8 different types of cereal.... you get what I mean.<br/>\nWe&#39;ve been eating through our stock of food but now we&#39;re running low. The children are asking for foods we don&#39;t have and can&#39;t afford to replace and are asking us to get some when we next go shopping. <br/>\nThey&#39;re disappointed when I explain we might not be able buy it.<br/>\nI&#39;ve explained to them that we can&#39;t buy everything we&#39;re used to buying so we write down all of their requests. When i&#39;m due to go shopping we go through the lists and they chose the 2-3 things they want the most and i&#39;ve tried to get them if we can afford them.<br/>\nI can see the same thing is going to start happening with their craft supplies as some of them are running low, and I&#39;ve usually re-stocked them before now. And probably there&#39;s other things I can&#39;t think of right now that we&#39;ll run out of/will break that we can&#39;t replace as quickly or at all.<br/>\n<br/>\nI&#39;m looking into places to get cheaper food, cheaper craft supplies etc which I hope will help.<br/>\n<br/>\nI&#39;m just wondering if there&#39;s any other suggestions on dealing with having a lot less money than we used to.<br/>\n<br/>\nThanks<br/>\nLou</div>","specialLinks":[]}],"prevTopicId":62309,"nextTopicId":62320}}