{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":2,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Putting down the school ruler","postDate":"1257197265","msgId":48291,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFNjc4M0Y3LUYxQTItNEE0RC1CNENGLUU3MjY2MTZGMjk3MUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGhjbXJhMCt2dGVmQGVHcm91cHMuY29tPg==","referencesHeader":"PGhjbXJhMCt2dGVmQGVHcm91cHMuY29tPg=="},"prevInTopic":48269,"nextInTopic":0,"prevInTime":48290,"nextInTime":48292,"topicId":48269,"numMessagesInTopic":0,"msgSnippet":"-=- So I m feeling a bit stumped. Anyone gone through this sort of crisis of confidence with their kids? How can I help her put down the school ruler and start","messageBody":"<div id=\"ygrps-yiv-478656684\">-=-<br/>\nSo I&#39;m feeling a bit stumped. Anyone gone through this sort of crisis  <br/>\nof confidence with their kids? How can I help her put down the school  <br/>\nruler and start measuring her accomplishments more accurately? I&#39;m not  <br/>\neven sure if she wants to learn the things at issue - how can I help  <br/>\nher clarify her goals and feel good about what she&#39;s choosing to  <br/>\npursue and learn?=<br/>\n<br/>\nI&#39;m pretty sure she&#39;s right in the middle of the most difficult age  <br/>\nfor unschoolers.  It will pass.  In the meantime, talk to her about  <br/>\nthe cool things she does know and has seen and done.  And tell her  <br/>\nvery few people really know the multiplication &quot;facts&quot; and so what?   <br/>\nGet her a solar calculator for $5 or less or show her where a  <br/>\ncalculator is on the computer.<br/>\n<br/>\nMy kids liked math patterns, so I would make the empty table, put  <br/>\nnumbers along the top and side, like a graph, and they would add or  <br/>\nmultiply into the inside for fun.  One time I drew a big one on the  <br/>\nconcrete on the patio with chalk and they and their friends filled it  <br/>\nin, by doing the easy things first (2&#39;s, 5&#39;s) and then figuring out  <br/>\nthe few that were left.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":51256565,"authorName":"mshapiro_75","from":"&quot;mshapiro_75&quot; &lt;mshapiro_75@...&gt;","profile":"mshapiro_75","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Putting down the school ruler","postDate":"1257173120","msgId":48269,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGhjbXJhMCt2dGVmQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":48291,"prevInTime":48268,"nextInTime":48270,"topicId":48269,"numMessagesInTopic":0,"msgSnippet":"Hi All- I m new to this group, but have been learning at home with my kids for the last 5 years or so.  They re 11 and 5 and we ve recently run into a bit of a","messageBody":"<div id=\"ygrps-yiv-893068726\">Hi All-<br/>\n<br/>\nI&#39;m new to this group, but have been learning at home with my kids for the last 5 years or so.  They&#39;re 11 and 5 and we&#39;ve recently run into a bit of a rough patch with out 11 year old.<br/>\n<br/>\nWe&#39;ve just moved back to the US after a year in India, and settled (for my husband&#39;s job) in a very small, conservative and homogeneous town.  Prior to India we lived in a different part of the country in a big diverse liberal (WONDERFUL!) town, with a supportive home schooling community and close to old friends and family.  Our 11 year old seems to be struggling with the new environment and social circles.<br/>\n<br/>\nLately she&#39;s been measuring herself against the &quot;school ruler&quot; - comparing her knowledge to that of her friends and acquaintances who go to public school - and coming up short.  The topics seem silly to me - things like who can multiply in her head faster or who knows which obscure southern  American history factoid - but these are big deals to her.  Sounds like her &#39;friends&#39; are giving her a hard time about not knowing what they do and telling her she&#39;s &#39;behind&#39;.  And so she&#39;s having a lot of heartache and self-doubt.<br/>\n<br/>\nWe&#39;ve had a number of conversations about how she is learning different things and in a different fashion that children who go to school, and we&#39;ve worked hard on highlighting her strengths and accomplishments, but she always returns to the darn multiplication facts!  I think this is made particularly difficult by the fact that there are not outlets and showcases for her talents and interests here, and hardly even any other like minded homeschoolers.  <br/>\n<br/>\nShe&#39;s worked off and on over the years through math books, at her own pace and according to her own interest level.  I&#39;ve pointed out to her recently that if she&#39;d like to know the math facts (or whatever else) that her peers here know that we have the resources to help her learn them, but she resists mightily.  <br/>\n<br/>\nI&#39;ve even pointed out that she could return to school, but she&#39;s dead-set against that too. <br/>\n<br/>\nSo I&#39;m feeling a bit stumped.  Anyone gone through this sort of crisis of confidence with their kids?  How can I help her put down the school ruler and start measuring her accomplishments more accurately?  I&#39;m not even sure if she wants to learn the things at issue - how can I help her clarify her goals and feel good about what she&#39;s choosing to pursue and learn?<br/>\n<br/>\nThanks in advance for your thoughts and ideas!<br/>\n<br/>\n-Maggie Shapiro Haskett</div>","specialLinks":[]}],"prevTopicId":48273,"nextTopicId":48295}}