{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"DiamondAir","from":"&quot;DiamondAir&quot; &lt;diamondair@...&gt;","replyTo":"LIST","senderId":"cHCkokSCuUmULWzYJD6bfxDKdOoQ8hWf0fK9tdRnaXm51Etpz9F4HJqqVJ81SrLUYM9HAYbfZg0W4wkKrlS17FRgzOcgm1yyAkYqi_77","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Politically opposite spouse","postDate":"987567801","msgId":18981,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAwNDEwMWMwYzdiZiQ0ZTE0MmQ0MCQxN2QzMGUzZkA4MzhmMzAxPg==","referencesHeader":"PDk4NzUzMzgzNy4xNjM1Ljg5ODgwLmw3QHlhaG9vZ3JvdXBzLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":18980,"nextInTime":18982,"topicId":18981,"numMessagesInTopic":0,"msgSnippet":"... Hmmmm, this might get hard to explain but I ll try. First of all, we agree completely on a million things that are fundamental to our lives. Like how to","messageBody":"<div id=\"ygrps-yiv-1293691814\"><blockquote><span title=\"ireply\">&gt;    From: Juli &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:yuliwomie@...\">yuliwomie@...</a>&gt;<br/>\n&gt; My really liberal sister had a Republican fiance for a<br/>\n&gt; while. How does that work? Seriously, how do you talk<br/>\n&gt; about things without getting upset with each other? I<br/>\n&gt; can&#39;t imagine the closest person in my life, the one I<br/>\n&gt; sleep next to every night, having such different ideas<br/>\n&gt; about life and the world. Juli<br/>\n<br/>\n<br/>\n </span></blockquote>Hmmmm, this might get hard to explain but I&#39;ll try. First of all, we agree<br/>\ncompletely on a million things that are fundamental to our lives. Like how<br/>\nto raise children (family bed, child-led weaning, all that kind of stuff)<br/>\nlife-long self-directed learning (aka unschooling), finances, how to keep<br/>\nour house, exercise, meditation, food to eat, etc. We probably agree on more<br/>\nin those realms than most spouses do, and we also have almost identical<br/>\ninterests as we are both pilots, skydivers, scuba divers, travelers,<br/>\nadventurers, etc. and so our passions are largely shared. So we have a big<br/>\nbase of shared interests and ideals outside of the political realm. Even on<br/>\nthe topic of politics, we often agree on things - for instance we are both<br/>\nfinancial conservatives (though he is much more so than I) and we are both<br/>\nenvironmentalists (though I am much more so than him). But when it comes<br/>\ntime to vote, my husband&#39;s priority is finances and mine is the environment.<br/>\nHence when it comes to candidates, he votes Republican and I vote Democrat<br/>\nor Green Party. On ballot measures, we vote much closer to each other and we<br/>\nalso each have ideals that are outside of our standard &quot;party line&quot; as well.<br/>\nFor instance, we have many gay friends and both have voted to quash the<br/>\nconservative anti-gay ballot measures. This year has been the hardest for us<br/>\nand politics with the close election and all. We basically have to just<br/>\nagree not to talk about it if we can&#39;t talk about it civilly. Sometimes we<br/>\ncan, but if we are tired and/or frustrated already, starting on the topic of<br/>\npolitics can be a bad idea :-). He knows, for instance, never ever to bring<br/>\nup anything he&#39;s heard on one of those talk radio shows. To me they are just<br/>\nhate-mongering and even if Rush Limbaugh or whomever does bring up some<br/>\nvalid points, I just can&#39;t invite that kind of negativity into my life by<br/>\nlistening to it.<br/>\n<br/>\nI guess for me, I just thank heavens that I (by sheer luck, because I was<br/>\n*not* contemplating kids when I met my DH) ended up marrying someone who<br/>\nshares my parenting and educational goals. I have so many good friends who<br/>\nhave had to battle with their spouse over not circumcising, not vaccinating,<br/>\nhaving a home birth, breastfeeding, being a SAHM, or over unschooling or a<br/>\nmillion other important-to-the-whole-family issues and I&#39;ve never had to go<br/>\nthrough that. I also am thankful that my husband and I respect each other&#39;s<br/>\ndifferences enough to put them aside when necessary. Sometimes it IS hard to<br/>\nbe opposite politically, but on a day to day basis we see eye to eye much<br/>\nmore often than not. As we run our own business and spend a whole lot of<br/>\ntime in each other&#39;s company, I guess that&#39;s a good thing!<br/>\n<br/>\n Blue Skies!<br/>\n   -Robin-<br/>\nMom to Mackenzie (8/28/96) &quot;Asa is running her voice out&quot;<br/>\nand Asa (10/5/99) Who sings &quot;the alien song&quot;<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.geocities.com/the_clevengers\">http://www.geocities.com/the_clevengers</a>   Flying Clevenger Family</div>","specialLinks":[]}],"prevTopicId":18736,"nextTopicId":18829}}