{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":0,"authorName":"Nicoletta Manns","from":"&quot;Nicoletta Manns&quot; &lt;snmanns@...&gt;","replyTo":"LIST","senderId":"btGwyoEwzas7Wf5XirhrtIBV7empjEaIVf0q0B2pxRreZFrA8j0cCZVrKEyEc41Hv99SdgIaxuACfL9AzeX0eaI0Jq-qZZV6UFjLf-WSFQ","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Jesus and Emotions and the stuff of life and Rules and the stuff of life - (long)","postDate":"980408838","msgId":15361,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PE1BQkJMUERKSUpQS0RERUxFSkZOS0VDQkNCQUEuc25tYW5uc0BhdHRjYW5hZGEuY2E+"},"prevInTopic":0,"nextInTopic":0,"prevInTime":15360,"nextInTime":15362,"topicId":15361,"numMessagesInTopic":0,"msgSnippet":"... Who is asking for agreement? I just shared something I heard and choose to believe and someone disagreed/reacted. I wasn t asking for anyone to agree with","messageBody":"<div id=\"ygrps-yiv-1281856222\"><blockquote><span title=\"ireply\">&gt; I don&#39;t<br/>\n&gt; generally like restrictions but I think we should probably drop this<br/>\n&gt; subject,<br/>\n&gt; particularly the part about Jesus. I doubt we&#39;ll ever agree.<br/>\n&gt;                                            with respect for all, Amalia &gt;&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>Who is asking for agreement? I just shared something I heard and choose to<br/>\nbelieve and someone disagreed/reacted. I wasn&#39;t asking for anyone to agree<br/>\nwith me.<br/>\n<br/>\nI am wondering why some people seem so afraid of disagreements. At least<br/>\nthat is my projection here.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt; Wise idea.<br/>\n&gt;<br/>\n&gt; candice<br/>\n&gt;<br/>\n<br/>\n<br/>\n&gt; Ditto for me.  This isnt a place we need to go on this list.  Let&#39;s<br/>\n </span></blockquote>celebrate<br/>\n<blockquote><span title=\"ireply\"> &gt;our sameness - homeschooling/unschooling.<br/>\n<br/>\n&gt; I like to celebrate everyone&#39;s differences as well, for that is what makes<br/>\n </span></blockquote>us<br/>\n<blockquote><span title=\"ireply\"> &gt; human, however, as mentioned, this list isn&#39;t for this type of debate.<br/>\n </span></blockquote>Dawn<br/>\n<br/>\n<br/>\nWhy isn&#39;t this list for this type of debate? What debate? One person says<br/>\nsomething another disagrees, the first person has no intention of arguing<br/>\nher first point and yet it seems some people get all flustered and have to<br/>\nmake sure things stay calm and smooth and homogenized. And this is not meant<br/>\nas a personal attack or anything like that - I see it happen all the time<br/>\nand I am just really wondering about this kind of dynamic, because I see it<br/>\nhappen in families and what goes on in families is merely a reflection of<br/>\nwhat goes on in society as a whole (or vice versa).<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;...........I think we can all learn so much more by not agreeing than<br/>\n </span></blockquote>agreeing. I<br/>\n<blockquote><span title=\"ireply\"> &gt;wanted to thank everyone for their informative answers. They really helped<br/>\n&gt;me understand where your coming from. I feel that only by exploring all<br/>\n&gt;things can we find the truth. Isn&#39;t that what unschooling is all<br/>\n </span></blockquote>about?...........<br/>\n<br/>\n<br/>\nWell said (whoever said that last quote above). I like that. And along those<br/>\nlines I want to share something from another list I belong to: it refers to<br/>\nschool in some way but I found it very worthwhile reading anyway:<br/>\n<br/>\nSubject: Emotions and the stuff of life.<br/>\n<br/>\nAs is, we equate shame with emotional drive. Incorporation of emotions into<br/>\ndaily life is considered the opposite of intelligence, and so, emotions are<br/>\nrarely mentioned. We hide them under a facade. Emotions lead us to being out<br/>\nof control. Does this seem like what nature would intend for its highest<br/>\nachievement? Were we accidentally genetically programmed over millions of<br/>\nyears to eventuate as a conflicted self, unable even to organize its own<br/>\nstate of being?<br/>\n<br/>\nAn organism survives by being organized. Its organization is integration of<br/>\nits systems. Integration of mental-emotional aspects creates the assemblage<br/>\nof intelligence. The organism survives. Humans are different than many<br/>\norganisms. Their integration occurs more gradually taking about fifteen<br/>\nyears to become concrete. This integration process may be perceived as two<br/>\nimportant transitions.<br/>\n<br/>\nThere are transitions children move through. First, their consciousness<br/>\nknows nothing but being the interaction they are engaged in. After the first<br/>\ntransition children are also aware that they can think of interactions apart<br/>\nfrom what is occurring. A second transition around age eleven allows<br/>\ncreative thought about interactions that they have not experienced.<br/>\n<br/>\nEach transition can occur with maximum benefit if the previous stage has<br/>\nbeen worked over like a fresh slab of concrete. This means that the<br/>\nsubstance of life is poured into the framework that mom provides. Then the<br/>\nsubstance is &quot;textured&quot;, worked over experientially again and again that<br/>\nparticles settle and harden in place, and the suspension, the confusion, is<br/>\nwicked away.<br/>\n<br/>\nNow imagine an upbringing where many rules are set in concrete. The child<br/>\nlearns to perform socially. The child learns to perform for school. The<br/>\nchild performs as a child according to rules imposed on childhood. The rules<br/>\nare hard set. Only generally cemented in place is how the basic life<br/>\ninteractions work. Thus, a child usually learns to crawl, walk, talk, count<br/>\nand have manners, but these are developed as rules, not as the nearly<br/>\ninfinite interrelationships that actually comprise life&#39;s foundation. Doing<br/>\nin Rome as the Romans do is ruled out of a child&#39;s experience. The parents<br/>\nconsider broad exposure dangerous. How else could a child learn The Rules<br/>\nbut by limitation. In this limitation the rules are set in concrete while<br/>\nthe stuff of life wicks away.<br/>\n<br/>\nWhat is the stuff of life? For one, it is the imprinting in the brain of the<br/>\nmagnificent range of interactions that comprise life. For another, it is the<br/>\nemotional/intuitive qualities associated with the range of interactions.<br/>\nThese things together, emotions and interactions, create a working<br/>\nfoundation from which can spring a working ego, an easy and practical way of<br/>\nsurvival, and a practical creativity that has all kinds of fun expanding on<br/>\nthe given world, the stuff of life.<br/>\n<br/>\nBut what happened to fun intelligent creativity? What happened to<br/>\nintelligent ease of survival? These things got swept away as suspension<br/>\n(actually dissolved at eleven years old) while the concrete rules settled as<br/>\nthe way of life. Intelligence cannot function as intended without<br/>\nemotional/intuitive associations. Emotions and intuition are integral parts<br/>\nof our being. The imposition of rules cannot bypass these to recreate<br/>\nintelligence in some pagan image of humanity. Our genetic programming is far<br/>\ntoo complex to manage as such a simplistic idealism. The brain fails. And<br/>\nwith it goes the sophisticated intelligence that easily, intuitively,<br/>\nunderstands getting by in life, and understands how to expend energy<br/>\njoyfully enhancing the quality of life.<br/>\n<br/>\nWhat needs cementing in the child is not a limited set of rules. What the<br/>\nchild needs is the full set of interrelationships that are the stuff of<br/>\nlife. And what glues this stuff with intelligent consciousness is emotions.<br/>\nIf emotions are ruled out when we absurdly try to recreate life, then the<br/>\nstuff of life cannot become a solid foundation for intelligence to erect<br/>\nupon. Instead, intelligence becomes an abstract with the purpose of<br/>\nrecreating life as a bunch of unfounded rules.<br/>\n<br/>\nThe point is this: Emotions cement the integration of intelligence. For<br/>\nemotions to be a part of the concrete stuff of life they have to be freely<br/>\nexperienced by children while being freely modeled by adults. Then they can<br/>\nbegin to move through the transitions mentioned in the third paragraph. From<br/>\nexperiencing self as only the experience of emotion the child can transit to<br/>\nseeing a relationship of self to emotions. From here the child transits to<br/>\nimagining varied possibilities of using emotions as tools for recreating<br/>\nrelationships in the stuff of life. Here is true control.<br/>\n<br/>\nThis intelligently functional child will have the ability to relate<br/>\nhappiness to the work of quickly changing society into what works better and<br/>\nwith more happiness. This focused attention is so different than our<br/>\nassociating happiness with laziness, with addictions, with breaking rules,<br/>\nwith distractions. This intelligence I am speaking of is far different than<br/>\ntoday&#39;s &quot;smart&quot; person who can outwit others, avoid being caught, escape<br/>\npaying taxes, and get the most for the least amount of time spent away from<br/>\nhis personal distractions and addictions.<br/>\n<br/>\nWhere do emotions and the stuff of life come together? In play.<br/>\nRules/rigidity and play/emotions are antithetical. We can have one or the<br/>\nother. In order to choose intelligence and success we must also choose play<br/>\nand emotions. Choosing these means using a vocabulary of emotions freely.<br/>\nThis will enable transitions as the time comes for them. Choosing these also<br/>\nmeans adults have to play with children. Children are to take adults into<br/>\ntheir realm of child-play, and, adults are to take children into their world<br/>\nof adult-play. To the child there will be no dividing line. Emotions will<br/>\nglue in place first experiences, and then emotions will glue in place<br/>\nadditional experiences. All of it will be play. There will be no transition<br/>\ninto abstract rules because the rules will be obvious as being the way life<br/>\nworks. Finally, doing what does _not_ work in life will simply be an act of<br/>\nstupidity. And we won&#39;t have many stupid people when people are doing what<br/>\ncomes natural with the concrete stuff of life.<br/>\n<br/>\n<br/>\n<br/>\nSubject: Rules and the stuff of life.<br/>\n<br/>\nLife does need rules, but these are meant as measuring sticks, not as<br/>\nidealisms abstracting life as some fairy tale. Fairy tales and superstitions<br/>\ndon&#39;t work well in real life. What does work is to measure what is occurring<br/>\nand then do things that measure up even better.<br/>\n<br/>\nThe best measures are simple guideposts that everyone understands. Once we<br/>\nbecome fluent in these, more complex measures may be gradually implemented.<br/>\nLikewise, results will become more refined and the benefits will define<br/>\nhigher &quot;values&quot;. These values still won&#39;t be The Rules. They will simply be<br/>\nwhat works.<br/>\n<br/>\nSimple guideposts are nicely provided for in &quot;Living Joyfully With Children&quot;<br/>\nby Win & Bill Sweet. Their down-home experience with their own children is<br/>\neasily translated to other daily situations.<br/>\n<br/>\nMy own idea of applying material in this book is to simply post one of the<br/>\nlists of behaviors and then schedule some sort of interaction measuring<br/>\nactual behavior against the experimental wish list. To understand this,<br/>\nlet&#39;s make up a scenario.<br/>\n<br/>\nHere is a list to post:<br/>\n(pg. 18) Honoring Play<br/>\n* Encourage solitary play.<br/>\n* Provide opportunities for authentic free play with other children.<br/>\n* Play with your children on their terms.<br/>\n<br/>\nAt a weekly school meeting the children are asked to comment on these and<br/>\nreach some sort of consensus. The children reply that there has been lots of<br/>\ntime for free play with each other, but not enough space at school to play<br/>\nalone, and, as to adults playing &quot;correctly&quot;, the children did not<br/>\nunderstand the question. The adult&#39;s response to this measuring of behavior<br/>\nwas to divide up a room so that individuals could have their own space. The<br/>\nadults also set aside alternating days one week to deliberately play<br/>\ncorrectly one day and incorrectly the next. This had the result that<br/>\nchildren vehemently requested correct play. Not only did they think correct<br/>\nplay was better than incorrect, but it added so much to the school<br/>\nexperience that children were requesting adult attendance in a third of<br/>\ntheir activities. The adults thought the experimental list such a success<br/>\nthat they created a suggested schedule for similar experiments using five<br/>\nmore lists. They thought that after doing that much they could decide on<br/>\nhiring a psychology professor to help with more technical experiments of<br/>\n&quot;higher&quot; value.<br/>\n<br/>\nThese are some of the other lists available in the book:<br/>\n* Kinds of play that pass the play test. (pg.17)<br/>\n* Degrading themes to avoid in the milieu. (pg.4)<br/>\n* Appropriate responses to crying. (pg.26)<br/>\n* Traits of a strong emotional core. (pg.33)<br/>\n* Responsive/not imposing actions of adults. (pg.36)<br/>\n* Principles vs. rules. (chapter 9)<br/>\n<br/>\nThere are more lists in this book of 186 pages. But in reading it you will<br/>\ndevelop ideas for your own lists applicable to your situation. I promise,<br/>\ndoing these experiments will make a profound difference in the sense of<br/>\neffectiveness and satisfaction.<br/>\n<br/>\n<br/>\nTo get the book...<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://www.amazon.com:80/exec/obidos/ASIN/1889051179/qid=979501620/102-43236\">http://www.amazon.com:80/exec/obidos/ASIN/1889051179/qid=979501620/102-43236</a><br/>\n05-2367305<br/>\nAmazon.com: buying info: Living Joyfully With Children<br/>\n <br/>\nLiving Joyfully With Children<br/>\nby Win Sweet, Bill Sweet<br/>\n<br/>\nList Price: $13.95<br/>\nOur Price: $11.16<br/>\nYou Save: $2.79 (20%)<br/>\n<br/>\n<br/>\n<br/>\n~Nicoletta<br/>\n*********************************************************<br/>\n&quot;It is paradoxical, yet true: Children are the most in<br/>\nneed of loving attention when they act the least<br/>\ndeserving of it!&quot;<br/>\n                     by Aletha Solter, 1998<br/>\n    from the article &quot;Why Children Misbehave&quot;<br/>\n                  www.awareparenting.com<br/>\n*********************************************************</div>","specialLinks":[]}],"prevTopicId":15349,"nextTopicId":15364}}