{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":6,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How much I have changed","postDate":"1326474296","msgId":65013,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhGNzVEOEJELTQ1REYtNDE1Qy05NEU0LTY0QzFCQTNENDQxNUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDc5MUQ2QTE4LTg4NDctNEZEMi05MzhDLUZDOUQ5ODI5QzE1Q0B2ZXJpem9uLm5ldD4=","referencesHeader":"PGplb2VkcythZHNpQGVHcm91cHMuY29tPiA8QTFCNjY5NTUtRTE3NC00NjM1LUJEOTUtNjY5NTk3Q0NEOEY5QFNhbmRyYWRvZGQuY29tPiA8NzkxRDZBMTgtODg0Ny00RkQyLTkzOEMtRkM5RDk4MjlDMTVDQHZlcml6b24ubmV0Pg=="},"prevInTopic":65008,"nextInTopic":0,"prevInTime":65012,"nextInTime":65014,"topicId":64991,"numMessagesInTopic":0,"msgSnippet":"-=-No definitely after. I remember it. Even remember who said it ;-) -=- Oh yikes!  I hope either she s reformed herself or isn t around.  Don t tell me who it","messageBody":"<div id=\"ygrps-yiv-1859830762\">-=-No definitely after. I remember it. Even remember who said it ;-) -=-<br/>\n<br/>\nOh yikes!  I hope either she&#39;s reformed herself or isn&#39;t around.  Don&#39;t tell me who it is.  (Not that I&#39;d remember...)<br/>\n<br/>\n-=-The whole time the unschooling folder was for social sharing of &quot;what works for us&quot; as well as discussion of the philosophy. (Which created days long wars of words!) That was definitely a &quot;here&#39;s what works for us&quot; one -- without us all sharing the same definition of &quot;works&quot;, e.g., the goal we were trying to reach. For many parents the goal is to stop the behavior but it doesn&#39;t work so well if someone&#39;s goal is honesty and peace and support.-=-<br/>\n<br/>\nYes, and there was team-choosing, and forum-wrestling, and people insisting that unschoolers MUST support all forms of homeschooling equally (by the same people who were belittling unschooling).<br/>\n<br/>\nWhat a mess all that was, but it was the best opportunity that existed in those days. so we took it.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How much I have changed","postDate":"1326471316","msgId":65008,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEI1RUREOTg4LTdGMEItNEExNi1BMzcwLUJEMjk4MDE2NTBFREBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PENBRFJoMGU4cDNnVnZRaUN2WTUxZm1YQnBwNWFrby10ajVwcHFRdFNGV0xhdTVLMWE9QUBtYWlsLmdtYWlsLmNvbT4=","referencesHeader":"PGplb2VkcythZHNpQGVHcm91cHMuY29tPiA8Q0FEUmgwZThwM2dWdlFpQ3ZZNTFmbVhCcHA1YWtvLXRqNXBwcVF0U0ZXTGF1NUsxYT1BQG1haWwuZ21haWwuY29tPg=="},"prevInTopic":65002,"nextInTopic":65013,"prevInTime":65007,"nextInTime":65009,"topicId":64991,"numMessagesInTopic":0,"msgSnippet":"-= You soon learn to recognize every little moment that can be turned to a learning moment, and you also learn to let go so not to over bombard your kids with","messageBody":"<div id=\"ygrps-yiv-55646497\">-= You soon learn to recognize every little moment that can be<br/>\nturned to a learning moment, and you also learn to let go so not to over<br/>\nbombard your kids with lessons.-=-<br/>\n<br/>\nAnd another stage past that is NOT to see &quot;learning moments,&quot; because you thoroughly know they are learning.<br/>\n<br/>\n-=-He does lots of<br/>\nlittle strange things like running to show me how a cell phone reflects<br/>\nlight onto the wall, or while baking a cake, he asked me why we put salt in<br/>\nsomething sweet.-=-<br/>\n<br/>\nWhen you see those as glorious rather than &quot;strange,&quot; you&#39;ll be yet another step forward. :-)<br/>\n<br/>\nMy mom (and she wasn&#39;t the only such parent) would have said not to ask her those questions, or put that up before you break it.  There&#39;s a vast bank of put-down message and habit waiting for children with eager questions, but unschooling doesn&#39;t need to be a part of that. :-)<br/>\n<br/>\n-=-&quot;When you were in school, what do you remember mostly? Was it the little<br/>\nmoments spent doing math drills or the field trips and the true learning<br/>\nmoments?&quot;-=-<br/>\n<br/>\nI remember the moments I learned something I liked, or that I figured I could use.  Sometimes it was while reading, or during a regular lesson, or at recess, or in a conversation with friends at lunch.   <br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How much I have changed","postDate":"1326464521","msgId":65002,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDc5MUQ2QTE4LTg4NDctNEZEMi05MzhDLUZDOUQ5ODI5QzE1Q0B2ZXJpem9uLm5ldD4=","inReplyToHeader":"PEExQjY2OTU1LUUxNzQtNDYzNS1CRDk1LTY2OTU5N0NDRDhGOUBTYW5kcmFkb2RkLmNvbT4=","referencesHeader":"PGplb2VkcythZHNpQGVHcm91cHMuY29tPiA8QTFCNjY5NTUtRTE3NC00NjM1LUJEOTUtNjY5NTk3Q0NEOEY5QFNhbmRyYWRvZGQuY29tPg=="},"prevInTopic":65000,"nextInTopic":65008,"prevInTime":65001,"nextInTime":65003,"topicId":64991,"numMessagesInTopic":0,"msgSnippet":"... No definitely after. I remember it. Even remember who said it ;-) When I joined the different homeschooling choices were already clearly divided up. It may","messageBody":"<div id=\"ygrps-yiv-1937436307\">On Jan 13, 2012, at 9:06 AM, Sandra Dodd wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; It&#39;s also before there was a separate unschooling forum on AOL,<br/>\n&gt; I&#39;m pretty sure, when we might have separate topics, but were<br/>\n&gt; all on the same message board.<br/>\n<br/>\n </span></blockquote>No definitely after. I remember it. Even remember who said it ;-) When I joined the different homeschooling choices were already clearly divided up. It may have been before the &quot;radical unschooling&quot; philosophy split but I think even after that we all co-existed in the unschooling folder. (Until the AOL forums all took off in hand baskets for the netherworld.)<br/>\n<br/>\nThe whole time the unschooling folder was for social sharing of &quot;what works for us&quot; as well as discussion of the philosophy. (Which created days long wars of words!) That was definitely a &quot;here&#39;s what works for us&quot; one -- without us all sharing the same definition of &quot;works&quot;, e.g., the goal we were trying to reach. For many parents the goal is to stop the behavior but it doesn&#39;t work so well if someone&#39;s goal is honesty and peace and support.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How much I have changed","postDate":"1326463586","msgId":65000,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEExQjY2OTU1LUUxNzQtNDYzNS1CRDk1LTY2OTU5N0NDRDhGOUBTYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGplb2VkcythZHNpQGVHcm91cHMuY29tPg==","referencesHeader":"PGplb2VkcythZHNpQGVHcm91cHMuY29tPg=="},"prevInTopic":64994,"nextInTopic":65002,"prevInTime":64999,"nextInTime":65001,"topicId":64991,"numMessagesInTopic":0,"msgSnippet":"-=- It made me sad - people hoodwinking their children by telling them lies about various things from computers and tv to fast food, people restricting their","messageBody":"<div id=\"ygrps-yiv-1376722526\">-=- It made me sad - people hoodwinking their children by telling them lies about various things from computers and tv to fast food, people restricting their children&#39;s media use because of unexamined fears and using words like &#39;addicted&#39;, &#39;plugged in&#39; and &#39;screen time&#39;. And it happened at the same time as a thread here about children learning by using ipods and ipads! The two conversations couldn&#39;t have been more opposite.-=-<br/>\n<br/>\nMany years ago when the discussions were all on AOL forums and there wasn&#39;t really anywhere else to discuss homeschooling online, before anything like yahoogroups existed, there was a single incident that divided people in a good way.<br/>\n<br/>\nIt&#39;s also before there was a separate unschooling forum on AOL, I&#39;m pretty sure, when we might have separate topics, but were all on the same message board.<br/>\n<br/>\nA mom had a toddler and her best advice, her best idea, about TV was something like this:<br/>\n<br/>\n%%When I don&#39;t want him to watch TV, I unplug it and tell him it&#39;s broken.  I go over and try to turn it on, and then say &#39;oh, I&#39;m sorry.  it&#39;s not working.&#39;%%   <br/>\n<br/>\nSomething like that.  <br/>\n<br/>\nAnd people whose thinking might have been mushy and nebulous before that took sides.  And in taking sides, some justified their intent to bullshit their own children, and some decided (perhaps for the first time) that lying to children that way was evil and destructive to trust and relationships and integrity. <br/>\n<br/>\nJust last Saturday I was on a mixed-methods discussion, ranging from  full curriculum to unschooling, where people were making those politically correct, placating, soothing statements that make people feel good for a few seconds but don&#39;t help them think.  It wasn&#39;t even like &quot;give a man a fish and you feed him for a day, teach him to fish and he&#39;ll eat for a lifetime.&quot;  It was more like &quot;let a man smell a fish, but assure him that fish aren&#39;t anything special, and that anything else he catches, eats, or pictures in his mind is just as good as fish, and anyone who gives you a fish or tries to teach you to fish is to be shunned and banished.&quot;   The idea (oft stated in discussions involving all women) that whatever any mother decides to do (or does without any conscious decision) is to be equally &quot;supported&quot; is common, but I have no interest in supporting all things equally.  The principle there seems to be &quot;pretend to have friends&quot; or something, and isn&#39;t about learning or improving.<br/>\n<br/>\nCasual chit-chat is discouraged here because it&#39;s available so many other places.  But serious unschooling discussion isn&#39;t available many other places.  I believe this is the best of those places. Luckily for those who think they&#39;ve found better ones, other places to exist.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":266230379,"authorName":"Aisha Alkhani","from":"Aisha Alkhani &lt;alwaysaisha@...&gt;","profile":"alkhani_tribe","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] How much I have changed","postDate":"1326434137","msgId":64994,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PENBRFJoMGU4cDNnVnZRaUN2WTUxZm1YQnBwNWFrby10ajVwcHFRdFNGV0xhdTVLMWE9QUBtYWlsLmdtYWlsLmNvbT4=","inReplyToHeader":"PGplb2VkcythZHNpQGVHcm91cHMuY29tPg==","referencesHeader":"PGplb2VkcythZHNpQGVHcm91cHMuY29tPg=="},"prevInTopic":64991,"nextInTopic":65000,"prevInTime":64993,"nextInTime":64995,"topicId":64991,"numMessagesInTopic":0,"msgSnippet":"New to this list and so happy to be here!  This subject is quite dear to my heart.  I cant say that I am officially an un-schooler yet, but I am very far from","messageBody":"<div id=\"ygrps-yiv-417721051\">New to this list and so happy to be here!  This subject is quite dear to my<br/>\nheart.  I cant say that I am officially an un-schooler yet, but I am very<br/>\nfar from where I used to be which was very anti unschool!<br/>\n<br/>\nWhat I have learned in the past year and a half has taught me that I am not<br/>\na homeschooler, that reality speaks to how much of an unschooler I am.<br/>\n Reality also tells me that my children have learned more this past year<br/>\nthan any other year they were in school having stuff literally crammed down<br/>\ntheir throats.<br/>\n<br/>\nSo how does this relate?  I am in your shoes, just a few feet further down<br/>\nthe road, I am sure so many others here are much much further down the<br/>\nroad, but I still carry those what if fears and the little nagging voices.<br/>\n I may not be able to offer much advice, but I can tell you what I am<br/>\nhearing here is true.  Eventually the little voices go away, and are<br/>\nreplaced with amazement and applause at just how much more your children<br/>\nare learning.  You soon learn to recognize every little moment that can be<br/>\nturned to a learning moment, and you also learn to let go so not to over<br/>\nbombard your kids with lessons.<br/>\n<br/>\nSomehow my 14 year old through playing games that I absolutely hated has<br/>\nturned into history and geography lessons in addition to critical thinking.<br/>\n I never even had to create a lesson plan or sit down with him.  My<br/>\n&quot;learning delayed&quot; son turns out to really just need more time to think and<br/>\nstew about things. But the reality is he is very bright, just not the<br/>\ntypical child.  My now 6 year old who cant read is in reality really doing<br/>\neverything perfectly in his own time, but just hasnt an interest in the<br/>\nworld to read right now.  The letters he has learned are in fact the<br/>\nletters he needs to get to the various websites he uses.  He does lots of<br/>\nlittle strange things like running to show me how a cell phone reflects<br/>\nlight onto the wall, or while baking a cake, he asked me why we put salt in<br/>\nsomething sweet.<br/>\n<br/>\n It is these moments that tell me unschooling is absolutely right, and<br/>\nabsolutely the path we need to be on!<br/>\n<br/>\nLastly, I wanted to ask a quick question I hope you can reflect on.  It is<br/>\nwhat I ask my self every day to give me the confidence to go further in<br/>\nthis new journey.  Maybe you have another one, but this is what has been<br/>\nthe magic words for me.<br/>\n<br/>\n&quot;When you were in school, what do you remember mostly?  Was it the little<br/>\nmoments spent doing math drills or the field trips and the true learning<br/>\nmoments?&quot;<br/>\n<br/>\nI dont know about you, but it was always the hands on learning that I<br/>\nremember most fondly and took the most learning from.<br/>\n<br/>\nI hope at least some of my rambling has made some sense :)<br/>\n<br/>\nAisha<br/>\nmom to five beautiful sons<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Thu, Jan 12, 2012 at 9:11 PM, Ann-Marie &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:annmariehorsley1@...\">annmariehorsley1@...</a>&gt;wrote:<br/>\n<br/>\n&gt; **<br/>\n&gt;<br/>\n&gt;<br/>\n&gt; I have been on this list for about two years. Don&#39;t do much posting. Lots<br/>\n&gt; of reading, thinking and trying. It&#39;s obviously the start of a long work in<br/>\n&gt; progress (lots of deschooling to do as I was a teacher for about 7 years!).<br/>\n&gt; I want to share another response I posted on a parenting group list that I<br/>\n&gt; have been on for about three years (soon to no longer be a member of). The<br/>\n&gt; topic was about ipod use (and other media use) and restrictions. It made me<br/>\n&gt; sad - people hoodwinking their children by telling them lies about various<br/>\n&gt; things from computers and tv to fast food, people restricting their<br/>\n&gt; children&#39;s media use because of unexamined fears and using words like<br/>\n&gt; &#39;addicted&#39;, &#39;plugged in&#39; and &#39;screen time&#39;. And it happened at the same<br/>\n&gt; time as a thread here about children learning by using ipods and ipads! The<br/>\n&gt; two conversations couldn&#39;t have been more opposite.<br/>\n&gt;<br/>\n&gt; And it made me realise how much my thinking has changed because of this<br/>\n&gt; list. I wanted to say thank you to everyone on this list who shares their<br/>\n&gt; ideas and has helped me to see my son more clearly, live more joyously and<br/>\n&gt; without as many fears. Because I know that two years ago, maybe even one<br/>\n&gt; year ago, I would have been agreeing with all the people on the other list.<br/>\n&gt;<br/>\n&gt; I hope this might help someone else who is also new to unschooling. And of<br/>\n&gt; course, if there&#39;s anything else I need to examine in this area, I&#39;ll look<br/>\n&gt; forward to any suggestions!<br/>\n&gt;<br/>\n&gt; Ann-Marie<br/>\n&gt;<br/>\n&gt; My post on the other list:<br/>\n&gt; ----------------------------------------------------------<br/>\n&gt;<br/>\n&gt; Hi everyone,<br/>\n&gt;<br/>\n&gt; I know I&#39;m a bit late on this topic but haven&#39;t had much of a chance to<br/>\n&gt; respond<br/>\n&gt; lately.<br/>\n&gt;<br/>\n&gt; Our approach is pretty different from what everyone else has described.<br/>\n&gt; Noah has<br/>\n&gt; unlimited access to the television, computer and mostly my iphone.<br/>\n&gt;<br/>\n&gt; What I have noticed is that because he has access to these whenever he<br/>\n&gt; wants<br/>\n&gt; then they are not made more desirable by being off-limits or doled out in<br/>\n&gt; discrete amounts of time. So he chooses to engage in them when it is<br/>\n&gt; something<br/>\n&gt; he genuinely wants to do. This ranges from quite a bit to not at all.<br/>\n&gt;<br/>\n&gt; Personally I find it helpful not to think about his media use in terms of<br/>\n&gt; &#39;screen time&#39; or being &#39;plugged in&#39; as for me those words don&#39;t help to me<br/>\n&gt; to<br/>\n&gt; properly see or connect with my child. Instead I think are they emotive<br/>\n&gt; words<br/>\n&gt; which can conjure up fears about socially maladjusted children whose<br/>\n&gt; brains have<br/>\n&gt; somehow been polluted. I honestly believe that if children have access to<br/>\n&gt; a wide<br/>\n&gt; range of activities and interests and if their lives are full of joy, love,<br/>\n&gt; security and their cups are full, then we needn&#39;t worry about how much<br/>\n&gt; time they<br/>\n&gt; choose to spend engaged in activities which involve media such as<br/>\n&gt; computers or<br/>\n&gt; televisions.<br/>\n&gt;<br/>\n&gt; Noah is an active kid with an extensive vocabulary for a three year old,<br/>\n&gt; the<br/>\n&gt; most amazing vivid imagination and fabulous social skills. He will role<br/>\n&gt; play all<br/>\n&gt; day sometimes. Just like he can play lego all day or trains. Sometimes his<br/>\n&gt; games<br/>\n&gt; are an extension of something he has watched, sometimes from something he<br/>\n&gt; has<br/>\n&gt; read, sometimes just completely from his imagination. When he watches tv or<br/>\n&gt; plays on the computer he does it with the same intent, curiosity and<br/>\n&gt; wonder as<br/>\n&gt; anything else he does. He is engaged, joyful and learning. The skills and<br/>\n&gt; knowledge he has learned from playing computer games and watching tv is<br/>\n&gt; astounding sometimes. So I don&#39;t worry about him. I try as much as<br/>\n&gt; possible to<br/>\n&gt; engage with him when he does these things - we love playing computer games<br/>\n&gt; together as much as any of the other games we play.<br/>\n&gt;<br/>\n&gt; We live in an adult world where children&#39;s passions and interests are not<br/>\n&gt; often<br/>\n&gt; respected. How often through history have we tried to ban such pursuits or<br/>\n&gt; have<br/>\n&gt; they caused moral outrage and discussions about the end of social order?<br/>\n&gt; How<br/>\n&gt; often have adults deemed them unworthy somehow? Thought such things would<br/>\n&gt; pollute our minds? I&#39;m thinking various types of music and dance (hip hop,<br/>\n&gt; heavy<br/>\n&gt; metal, rock and roll, the viennese waltz, elvis&#39; hip shaking), books which<br/>\n&gt; have<br/>\n&gt; been banned (Leaves of Grass by Walt Whitman, Ulysses by James Joyce,<br/>\n&gt; Huckelberry Finn by Mark Twain), reading novels in general was deemed an<br/>\n&gt; unworthy pursuit at various times, board games, masturbation, sex outside<br/>\n&gt; of<br/>\n&gt; wedlock, the list goes on... I think today&#39;s version of that is television<br/>\n&gt; and<br/>\n&gt; computer games.<br/>\n&gt;<br/>\n&gt; I think that when kids are not whole and happy, when they&#39;re using media or<br/>\n&gt; anything else for that matter to escape or fill a void then there will be<br/>\n&gt; problems. But I don&#39;t believe that media use on it&#39;s does the damage.<br/>\n&gt;<br/>\n&gt; Ann-Marie<br/>\n&gt;<br/>\n&gt;  <br/>\n&gt;<br/>\n<br/>\n<br/>\n<br/>\n-- <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"https://deals.mamapedia.com/seattle?ref_id=283100\">https://deals.mamapedia.com/seattle?ref_id=283100</a><br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\nThere is no flag large enough to cover the shame of killing innocent people.<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n&quot;Learning can only happen when a child is interested. If he&#39;s not<br/>\ninterested it&#39;s like throwing marshmallows at his head and calling it<br/>\neating.&quot; - Anonymous<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":351240414,"authorName":"Ann-Marie","from":"&quot;Ann-Marie&quot; &lt;annmariehorsley1@...&gt;","profile":"annmariehorsley","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"How much I have changed","postDate":"1326431484","msgId":64991,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGplb2VkcythZHNpQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":64994,"prevInTime":64990,"nextInTime":64992,"topicId":64991,"numMessagesInTopic":0,"msgSnippet":"I have been on this list for about two years. Don t do much posting. Lots of reading, thinking and trying. It s obviously the start of a long work in progress","messageBody":"<div id=\"ygrps-yiv-1290459168\">I have been on this list for about two years. Don&#39;t do much posting. Lots of reading, thinking and trying. It&#39;s obviously the start of a long work in progress (lots of deschooling to do as I was a teacher for about 7 years!). I want to share another response I posted on a parenting group list that I have been on for about three years (soon to no longer be a member of). The topic was about ipod use (and other media use) and restrictions. It made me sad - people hoodwinking their children by telling them lies about various things from computers and tv to fast food, people restricting their children&#39;s media use because of unexamined fears and using words like &#39;addicted&#39;, &#39;plugged in&#39; and &#39;screen time&#39;. And it happened at the same time as a thread here about children learning by using ipods and ipads! The two conversations couldn&#39;t have been more opposite.<br/>\n<br/>\nAnd it made me realise how much my thinking has changed because of this list. I wanted to say thank you to everyone on this list who shares their ideas and has helped me to see my son more clearly, live more joyously and without as many fears. Because I know that two years ago, maybe even one year ago, I would have been agreeing with all the people on the other list.<br/>\n<br/>\nI hope this might help someone else who is also new to unschooling. And of course, if there&#39;s anything else I need to examine in this area, I&#39;ll look forward to any suggestions!<br/>\n<br/>\nAnn-Marie<br/>\n<br/>\nMy post on the other list:<br/>\n----------------------------------------------------------<br/>\n<br/>\nHi everyone,<br/>\n<br/>\nI know I&#39;m a bit late on this topic but haven&#39;t had much of a chance to respond<br/>\nlately.<br/>\n<br/>\nOur approach is pretty different from what everyone else has described. Noah has<br/>\nunlimited access to the television, computer and mostly my iphone.<br/>\n<br/>\nWhat I have noticed is that because he has access to these whenever he wants<br/>\nthen they are not made more desirable by being off-limits or doled out in<br/>\ndiscrete amounts of time. So he chooses to engage in them when it is something<br/>\nhe genuinely wants to do. This ranges from quite a bit to not at all.<br/>\n<br/>\nPersonally I find it helpful not to think about his media use in terms of<br/>\n&#39;screen time&#39; or being &#39;plugged in&#39; as for me those words don&#39;t help to me to<br/>\nproperly see or connect with my child. Instead I think are they emotive words<br/>\nwhich can conjure up fears about socially maladjusted children whose brains have<br/>\nsomehow been polluted. I honestly believe that if children have access to a wide<br/>\nrange of activities and interests and if their lives are full of joy, love,<br/>\nsecurity and their cups are full, then we needn&#39;t worry about how much time they<br/>\nchoose to spend engaged in activities which involve media such as computers or<br/>\ntelevisions.<br/>\n<br/>\nNoah is an active kid with an extensive vocabulary for a three year old, the<br/>\nmost amazing vivid imagination and fabulous social skills. He will role play all<br/>\nday sometimes. Just like he can play lego all day or trains. Sometimes his games<br/>\nare an extension of something he has watched, sometimes from something he has<br/>\nread, sometimes just completely from his imagination. When he watches tv or<br/>\nplays on the computer he does it with the same intent, curiosity and wonder as<br/>\nanything else he does. He is engaged, joyful and learning. The skills and<br/>\nknowledge he has learned from playing computer games and watching tv is<br/>\nastounding sometimes. So I don&#39;t worry about him. I try as much as possible to<br/>\nengage with him when he does these things - we love playing computer games<br/>\ntogether as much as any of the other games we play.<br/>\n<br/>\nWe live in an adult world where children&#39;s passions and interests are not often<br/>\nrespected. How often through history have we tried to ban such pursuits or have<br/>\nthey caused moral outrage and discussions about the end of social order? How<br/>\noften have adults deemed them unworthy somehow? Thought such things would<br/>\npollute our minds? I&#39;m thinking various types of music and dance (hip hop, heavy<br/>\nmetal, rock and roll, the viennese waltz, elvis&#39; hip shaking), books which have<br/>\nbeen banned (Leaves of Grass by Walt Whitman, Ulysses by James Joyce,<br/>\nHuckelberry Finn by Mark Twain), reading novels in general was deemed an<br/>\nunworthy pursuit at various times, board games, masturbation, sex outside of<br/>\nwedlock, the list goes on... I think today&#39;s version of that is television and<br/>\ncomputer games.<br/>\n<br/>\nI think that when kids are not whole and happy, when they&#39;re using media or<br/>\nanything else for that matter to escape or fill a void then there will be<br/>\nproblems. But I don&#39;t believe that media use on it&#39;s does the damage.<br/>\n<br/>\nAnn-Marie</div>","specialLinks":[]}],"prevTopicId":64987,"nextTopicId":65014}}