{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"JOIN"}]},{"resourceType":"PHOTO","capabilities":[]},{"resourceType":"FILE","capabilities":[]},{"resourceType":"MEMBER","capabilities":[]},{"resourceType":"LINK","capabilities":[]},{"resourceType":"CALENDAR","capabilities":[]},{"resourceType":"DATABASE","capabilities":[]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[]},{"resourceType":"POST","capabilities":[{"name":"READ"}]},{"resourceType":"PIN","capabilities":[]}],"groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":77610158,"authorName":"Bonni Sollars","from":"Bonni Sollars &lt;BSOLLARS@...&gt;","profile":"truuluvv","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"a typical day/structure","postDate":"1016053676","msgId":32398,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDIwMzEzLjE2MDg1MC4tMTU3MDMuNC5ic29sbGFyc0BqdW5vLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":32397,"nextInTime":32399,"topicId":32398,"numMessagesInTopic":0,"msgSnippet":"On a typical day of learning, I am pursuing my interests as much as my children are.  Structure comes when we get up, eat, straighten, and talk about what each","messageBody":"<div id=\"ygrps-yiv-559061344\">On a typical day of learning, I am pursuing my interests as much as my<br/>\nchildren are.  Structure comes when we get up, eat, straighten, and talk<br/>\nabout what each of us wants to do today.  Then we write it down to see<br/>\nhow everyone&#39;s plans coincide chronologically.  This works really well<br/>\nfor us.  Although this has less to do with school in terms of, &quot;Oh, I<br/>\nwant to learn about this subject and that subject today&quot;, and more to do<br/>\nwith it in terms of, (in my 14y.o.d.s.&#39;s ongoing quest for more<br/>\ninformation or experience in the area of architectural engineering),&quot; I<br/>\nwant to go to the library&quot; (to read about ancient architectural styles),<br/>\n&quot;then to the building supply store&quot; (to buy some wood for the dog house<br/>\nhe designed and is building), &quot;then I want to be home when dad gets home&quot;<br/>\n(to work on remodeling his bedroom according to his design).  We do have<br/>\ntraditional learning materials, but they are not required, just available<br/>\nfor when they want to use them.  For now the oldest three want to use<br/>\ntheir math books, but I have showed them how to not be enslaved to them<br/>\nby not feeling forced to go from chapter to chapter.  I showed them how<br/>\nto look through the table of contents or index, or to just read the<br/>\nlesson-explanation and do a few problems.   After p.s., this is hard for<br/>\nthem to accept.  They seem to feel a need to do it like at school, even<br/>\nthough they are starting to understand why it isn&#39;t really necessary and<br/>\nsort of a waste of time.  For the first time in his life, my oldest is<br/>\nrealizing that math is something he can understand, although he always<br/>\nwants to know what it has to do with geometry, since that is his biggest<br/>\ninterest math-wise.  They really like the jokes we find on natural math<br/>\nand gnarly math.  My 7 y.o.d.d. hates traditional math, but somehow is<br/>\nlearning all about it without any workbook and even without games, (which<br/>\nwe were playing, but she&#39;s decided not to).  She comes up with the most<br/>\namazing math facts, just from thinking and playing by herself.  And she<br/>\ncan count without going one, two, three, four.  She just glances at<br/>\nsomething and can tell me how many of whatever are on it.  She plays a<br/>\nlot with the calculator, too.  She&#39;s also teaching herself cursive, and<br/>\nshe loves to write letters, make cards and create books.  We&#39;ve only been<br/>\nunschooling this year.  The kids also participate in wrestling,<br/>\nbasketball, skateboarding and youth group.  Usually one day a week we<br/>\nwatch a movie,go to the mall or swim.  Sundays we go to church and visit<br/>\nthe cousins.  They spend the night at friends a lot.  It is really a<br/>\ngreat life!  Sometimes I have to pinch myself to believe that I have<br/>\nstumbled on this great way of living.  A lot of the financial problems we<br/>\nhave are working out with time and ingenuity, too, which helps my<br/>\ndream-like state.<br/>\nBonni</div>","specialLinks":[]}],"prevTopicId":32397,"nextTopicId":32399}}