{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ_DATA"},{"name":"READ"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PIN","capabilities":[{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"},{"name":"READ"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":1,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Philosophies (are they really important?)","postDate":"1314625043","msgId":62567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4QjcxNEVBLTAwNEUtNDc5MC1CRkI1LTYwOUY3RDRCMTRBRUBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":0,"nextInTopic":0,"prevInTime":62566,"nextInTime":62568,"topicId":62567,"numMessagesInTopic":0,"msgSnippet":"People who are young or busy or don t have much time to think should skip this one. I have a baby book my mom passed on to me.  Not a baby book, but it s","messageBody":"<div id=\"ygrps-yiv-502462653\">People who are young or busy or don&#39;t have much time to think should skip this one.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI have a baby book my mom passed on to me.  Not a baby book, but it&#39;s called the Log of Life, and I thought i would keep it up.  I have written some things in there, but there were pages for &quot;Philosophy of Life,&quot; and I didn&#39;t know what that was at all, when I was 20 and 30.  Each decade i was supposed to write something.<br/>\n<br/>\nThis morning I put a new obituary entry on a webpage I keep for members of the Society for Creative Anachronism who have died.  I don&#39;t know the new entry person, but she had very pretty heraldry, so I spent a little extra time on it.  I had requested something visual to put with that, and was sent the form she used to submit the device for approval.  It was clearly done with markers, and there were marks on the edges to show center lines, and there were directions and initials.  So I photoshopped it prettier, and remembered friends I had met in the SCA many years ago, before I had children, who were embalmers and make-up artists for the dead.  I thought of them, as I touched up some art that will never be used again.  <br/>\n<br/>\nYesterday in one of those discussions on facebook, I wrote this.  The last part is the important bit, but I&#39;ve kept the paragraph whole for a little more context.<br/>\n<br/>\n***************<br/>\nIf someone on your team is behaving badly, that reflects on your team/family/dyad. You share in their behavior. If you&#39;re just saying &quot;You&#39;re behaving disrespectfully,&quot; that&#39;s not very informational. If you&#39;re helping them see what, why, how and where AND if you&#39;re setting a good example, then peachy. IF ANY PARENT second guesses herself with this: &quot;But would an unschooler do that?&quot; then that could be evidence of a depth of shallowness. :-) Decisions should be made based on belief, on principles, not on vague ideas about what an unschooler would do. That&#39;s a what, not a why. It&#39;s looking for a new set of rules, or &quot;can do&quot; and &quot;can&#39;t do,&quot; instead of moving step by step toward making decisions based on what&#39;s kind, helpful, new, peaceful, rich and good.<br/>\n***************<br/>\n<br/>\nAnd on my SCA blog, I noticed the random quote generator had something similar, so I&#39;ve pulled the quotes from that to bring here.<br/>\n<br/>\nAfter several years of helping other people unschool, I find the distillation of it to be the same as after several years of helping people in the SCA.  Most of these could be changed from &quot;SCA&quot; to &quot;Unschooling.&quot;   And &quot;teacher&quot; could be changed to &quot;example&quot; or &quot;mentor.&quot;  In an SCA context, &quot;teacher&quot;k isn&#39;t like school teacher, it&#39;s like a personal guide to an art or science or self-improvement (hard to describe in ten words).<br/>\n<br/>\nquotes[0] = &quot;Saying you have compassion isn&#39;t the same as acting compassionately.&quot;;<br/>\nquotes[1] = &quot;I think every decision anyone makes reflects their beliefs and principles.&quot;;<br/>\nquotes[2] = &quot;Words aren&#39;t belief.&quot;;<br/>\nquotes[3] = &quot;Virtues and morality apply in real life as well as the SCA.&quot;;<br/>\nquotes[4] = &quot;Make the better choice.&quot;;<br/>\nquotes[5] = &quot;Just as cynicism is contagious, so is optimism.&quot;;<br/>\nquotes[6] = &quot;Learning is everywhere.&quot;;<br/>\nquotes[7] = &quot;Don&#39;t forget to breathe!&quot;;<br/>\nquotes[8] = &quot;Flexibility of expectation will help.&quot;;<br/>\nquotes[9] = &quot;We owe it to the Society to return the favor that was done for us.&quot;;<br/>\nquotes[10] = &quot;The beginning is now, the day you&#39;re reading this.&quot;;<br/>\nquotes[11] = &quot;You will find yourself being a teacher, to a greater or lesser degree, even if you have only been in the Society a few months.&quot;;<br/>\nquotes[12] = &quot;It is a strength in a teacher to give sources, to qualify statements, and to be open enough to consider other evidence.&quot;;<br/>\nquotes[13] = &quot;&#39;Plan for the worst and hope for the best&#39; works in many situations.&quot;;<br/>\nquotes[14] = &quot;Try to do for [newer members] the things that were done for you, and a few more you wish had been done.&quot;;<br/>\nquotes[15] = &quot;If you think you want more power, what you probably are wanting is to be more influential.&quot;;<br/>\nquotes[16] = &quot;The power to do good begins with goodness.&quot;;<br/>\nquotes[17] = &quot;You should all develop trustworthy relationships with people for now and for the future.&quot;;<br/>\nquotes[18] = &quot;My integrity is more important than any friendship.&quot;;<br/>\nquotes[19] = &quot;Courage in the face of physical danger usually just lasts a few moments, a big burst of adrenaline and it&#39;s passed.   Courage in the face of social pressure lasts day after week after month after year.  That there is REAL courage.&quot;;<br/>\nquotes[20]=&quot;When one person is brave enough to say something, offenders tend to say &#39;You&#39;re the only one who&#39;s objected.&#39;&quot;;<br/>\nquotes[21]=&quot; Err on the side of too much deference, and too much consideration.&quot;;<br/>\nquotes[22]=&quot;Without making conscious decisions about how and why to address people, we&#39;re just repeating phrases as from a script.&quot;;<br/>\nquotes[23]=&quot;Real respect has to do with trust and admiration.  Can you make decisions toward being trustworthy and admirable?&quot;;<br/>\n<br/>\nSo now I know more about philosophy.  Eventually people get old enough for their beliefs to solidify, if they&#39;re lucky.<br/>\n<br/>\nSandar</div>","specialLinks":[]}],"prevTopicId":62509,"nextTopicId":62512}}