{"ygPerms":{"resourceCapabilityList":[{"resourceType":"GROUP","capabilities":[{"name":"READ"},{"name":"WELCOME_MSG"}]},{"resourceType":"PHOTO","capabilities":[{"name":"READ"},{"name":"UPLOAD"},{"name":"UPLOADTEMP"}]},{"resourceType":"FILE","capabilities":[{"name":"READ"}]},{"resourceType":"MEMBER","capabilities":[{"name":"READ"}]},{"resourceType":"LINK","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"CALENDAR","capabilities":[{"name":"READ"}]},{"resourceType":"DATABASE","capabilities":[{"name":"READ"},{"name":"READ_DATA"}]},{"resourceType":"POLL","capabilities":[]},{"resourceType":"MESSAGE","capabilities":[{"name":"CREATE"},{"name":"READ"}]},{"resourceType":"PENDING_MESSAGE","capabilities":[]},{"resourceType":"ATTACHMENTS","capabilities":[]},{"resourceType":"PHOTOMATIC_ALBUMS","capabilities":[{"name":"UPLOAD"}]},{"resourceType":"MEMBERSHIP_TYPE","capabilities":[{"name":"READ"}]},{"resourceType":"POST","capabilities":[{"name":"READ"},{"name":"CREATE"}]},{"resourceType":"PIN","capabilities":[{"name":"READ"},{"name":"DELETE"},{"name":"UPDATE"},{"name":"CREATE"}]}],"subStatus":"NORMAL","groupUrl":"groups.yahoo.com","intlCode":"us"},"comscore":"pageview_candidate","ygData":{"totalMsgInTopic":35,"messages":[{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220536036","msgId":37904,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDRBOEFCRjExLUUwODAtNERDNS04QTg3LTA0M0EyQzkxMjBEMUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDhDRUI3QTI0LUJBNzgtNDYwMS04RTZFLTM2NkYwNDk0OTVCMUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGc5bnI3dit0OWw1QGVHcm91cHMuY29tPiA8OENFQjdBMjQtQkE3OC00NjAxLThFNkUtMzY2RjA0OTQ5NUIxQHZlcml6b24ubmV0Pg=="},"prevInTopic":37902,"nextInTopic":37911,"prevInTime":37903,"nextInTime":37905,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"-=-I think the biggest factor missing is the people. It s not that she s less engaged when watching alone. It s that there aren t people to watch it with. ","messageBody":"<div id=\"ygrps-yiv-1372973311\">-=-I think the biggest factor missing is the people. It&#39;s not that she&#39;s<br/>\nless engaged when watching alone. It&#39;s that there aren&#39;t people to<br/>\nwatch it with.<br/>\n<br/>\n-=-If you watch a TV show by yourself, especially one that no one else<br/>\nin the house particularly likes, do you behave exactly the same while<br/>\nyou watch it and afterwards as you do with a movie the whole family<br/>\nenjoyed together?-=-<br/>\n<br/>\n<br/>\n<br/>\nI went to England when I was in my mid-20&#39;s, and though I had people  <br/>\nto stay with, I went to museums alone.  A few years later, I ended up  <br/>\nstuck in DC when a friend&#39;s van broke down, and I went to the  <br/>\nSmithsonian several days, alone.<br/>\n<br/>\nTERRIBLE.  And I probably looked &quot;vegged out&quot; or bored.   I *love*  <br/>\nmuseums, but there I was just reading and looking by myself, with the  <br/>\nsame expression on my face when something was fantastic as when it  <br/>\nwas just a little lame, or the display wasn&#39;t even there.  I would  <br/>\nwonder where it was and wonder what I was missing, but there was no  <br/>\nexpression of joy or sorrow or excitement or curiosity, because I had  <br/>\nno one to share it with.<br/>\n<br/>\n<br/>\n<br/>\n-=-One problem was, later during her prepuberty years when she watched a<br/>\n<br/>\nlot of TV, is that she felt disempowered by the programmers. It felt<br/>\nlike she needed to watch what was on in case a new episode happened<br/>\nto show up. What helped that was TiVo. She could set it to record her<br/>\nfavorites and watch them whenever. It helped her be in control and<br/>\nthe amount of time she watched TV went down.-=-<br/>\n<br/>\nWhen my kids were little there were shows they didn&#39;t want to miss,  <br/>\nbut they were willing to leave if we set the VCR to tape them.  Most  <br/>\nof those tapes went unwatched, but they were freeing because the kids  <br/>\nfelt they could do two things at once.<br/>\n<br/>\nNow they much prefer DVD and watching things online, because it&#39;s  <br/>\nthere when they want it.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220524372","msgId":37902,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDRUI3QTI0LUJBNzgtNDYwMS04RTZFLTM2NkYwNDk0OTVCMUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGc5bnI3dit0OWw1QGVHcm91cHMuY29tPg==","referencesHeader":"PGc5bnI3dit0OWw1QGVHcm91cHMuY29tPg=="},"prevInTopic":37900,"nextInTopic":37904,"prevInTime":37901,"nextInTime":37903,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"... What if your husband judged what you could and couldn t read based on what you looked like when you read? You re probably showing the most engagement when","messageBody":"<div id=\"ygrps-yiv-1710653730\">On Sep 4, 2008, at 1:21 AM, nikkole_abbas wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess we<br/>\n&gt; don&#39;t want her to just &#39;veg out&#39; in front of the TV, and that often<br/>\n&gt; seems to be how she watches it. Blank look, doesn&#39;t seem to be getting<br/>\n&gt; much out of it.<br/>\n<br/>\n<br/>\n </span></blockquote>What if your husband judged what you could and couldn&#39;t read based on  <br/>\nwhat you looked like when you read? You&#39;re probably showing the most  <br/>\nengagement when you&#39;re reading aloud to the children. So you&#39;re  <br/>\napparent lack of engagement based on your expression when you read a  <br/>\nmainstream novel would justify him limiting you to children&#39;s books?<br/>\n<br/>\nPeople who are stressed or bored veg out. People who are happy and  <br/>\nwhole don&#39;t need to.<br/>\n<br/>\nIf she&#39;s choosing TV it&#39;s because she wants to watch TV. But she may  <br/>\nbe choosing TV because it&#39;s the least boring thing available. Just  <br/>\nbecause the pretend play looks more engaging, doesn&#39;t mean that it  <br/>\nis. If you weren&#39;t stressed or tired, would *you* choose something  <br/>\ndull on TV over a good book? You feel like a good mom when you make  <br/>\nher do what *looks* engaging.<br/>\n<br/>\nThat said, it could be she&#39;s not playing when she chooses TV because  <br/>\nshe prefers to have someone to play with. It could be the TV feels  <br/>\nlike friends and people interacting (to a limited extent) with her.  <br/>\nBy cutting off the &quot;people&quot; you don&#39;t make the need for people go  <br/>\naway but you can make it look *to you* like it&#39;s gone away and make  <br/>\nyourself feel better.<br/>\n<br/>\nUnschooled kids shouldn&#39;t be watching TV alone. That doesn&#39;t mean we  <br/>\nneed to park ourselves next to them but we should watch enough  <br/>\nepisodes so we can have intelligent conversations, watch them  <br/>\nwatching so we can get an idea of what it is they love about the  <br/>\nshows. We should be nearby to answer questions and talk about it.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We do watch movies together fairly regularly on the<br/>\n&gt; &quot;big screen&quot; (projector on the wall) and she enjoys that and doesn&#39;t<br/>\n&gt; get that same look, and we talk about them as we are getting ready for<br/>\n&gt; bed afterward<br/>\n<br/>\n<br/>\n </span></blockquote>I think the biggest factor missing is the people. It&#39;s not that she&#39;s  <br/>\nless engaged when watching alone. It&#39;s that there aren&#39;t people to  <br/>\nwatch it with.<br/>\n<br/>\nIf you watch a TV show by yourself, especially one that no one else  <br/>\nin the house particularly likes, do you behave exactly the same while  <br/>\nyou watch it and afterwards as you do with a movie the whole family  <br/>\nenjoyed together?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Instead, when the TV is on less, she engages more, &quot;loses herself&quot; in<br/>\n&gt; activity for long periods of time, either reading to herself or<br/>\n&gt; imaginative play with her stuffed animals, coloring, writing letters<br/>\n&gt; to her friends or grandma, etc. This is something we have noticed for<br/>\n&gt; her.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Do you want your husband watching what you do and judging the quality  <br/>\nof how you spend your time, then making decisions on what you can and  <br/>\ncan&#39;t do based on his observations? Wouldn&#39;t if feel yucky for him to  <br/>\nbe watching and controlling you like that?<br/>\n<br/>\nWe should absolutely be observant of our kids to be aware of what&#39;s  <br/>\ngoing on in their lives and to help them get more of what they&#39;re  <br/>\nenjoying and expand their worlds. But it&#39;s better for unschooling to  <br/>\nadd to their world rather than subtract from it. If a child is  <br/>\nwatching a lot of TV and doesn&#39;t seem happy, rather than taking  <br/>\ncontrol of the TV, we need to add more to their lives so they have  <br/>\nmore options. Rather than pulling them away from something, draw them  <br/>\naway with something even better. And if they do choose TV it&#39;s  <br/>\nbecause they really want to watch something.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Her 2yo sister, on the other hand, will watch for a few minutes<br/>\n&gt; and walk away while the TV is still on to do something else.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Because she&#39;s 2.<br/>\n<br/>\nI don&#39;t think my daughter deliberately sought out TV shows until she  <br/>\nwas 6 or 7. Before that she would watch TV with someone.<br/>\n<br/>\nOne problem was, later during her prepuberty years when she watched a  <br/>\nlot of TV, is that she felt disempowered by the programmers. It felt  <br/>\nlike she needed to watch what was on in case a new episode happened  <br/>\nto show up. What helped that was TiVo. She could set it to record her  <br/>\nfavorites and watch them whenever. It helped her be in control and  <br/>\nthe amount of time she watched TV went down.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We won&#39;t<br/>\n&gt; have to &quot;limit&quot; her time, it seems (at least at this point).<br/>\n<br/>\n </span></blockquote>By limiting it, you&#39;re creating a rare and desired object. If she  <br/>\nhasn&#39;t already, and depending on how much she likes TV, if you limit  <br/>\nher to say an hour a day, she&#39;ll make sure she gets that hour  <br/>\neveryday even if she doesn&#39;t love what she&#39;s watching. She&#39;ll try to  <br/>\nsneak in more until you notice just because she needs to grab it when  <br/>\nit&#39;s available because it&#39;s rare.<br/>\n<br/>\nIt&#39;s human nature. Adults act the same way. If something&#39;s limited  <br/>\nthat they want, people will grab as much as they can when it&#39;s  <br/>\navailable.<br/>\n<br/>\nPam wrote a good article on the economics of limiting TV:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://SandraDodd.com/t/economics\">http://SandraDodd.com/t/economics</a><br/>\n<br/>\nJoyce</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220506848","msgId":37900,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDYzRjA0OTBELTE3NzItNEQxNy05QzI1LTkzMzcyNEMzM0UwRUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGc5bnI3dit0OWw1QGVHcm91cHMuY29tPg==","referencesHeader":"PGc5bnI3dit0OWw1QGVHcm91cHMuY29tPg=="},"prevInTopic":37899,"nextInTopic":37902,"prevInTime":37899,"nextInTime":37901,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"-=-Instead, when the TV is on less, she engages more, loses herself in activity for long periods of time, either reading to herself or imaginative play with","messageBody":"<div id=\"ygrps-yiv-719219993\">-=-Instead, when the TV is on less, she engages more, &quot;loses herself&quot; in<br/>\nactivity for long periods of time, either reading to herself or<br/>\nimaginative play with her stuffed animals, coloring, writing letters<br/>\nto her friends or grandma, etc. -=-<br/>\n<br/>\nBut when she loses herself in a story or music on TV, you call it  <br/>\nvegging out.<br/>\n<br/>\nPlease consider some of the things here:<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/tv\">http://sandradodd.com/tv</a><br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":199360242,"authorName":"graberamy","from":"&quot;graberamy&quot; &lt;graber@...&gt;","profile":"graberamy","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: DD wants to try school","postDate":"1220506270","msgId":37898,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc5bnJxdSsybnJlQGVHcm91cHMuY29tPg==","inReplyToHeader":"PEYzNzU5OUJBLUY2NzgtNDQ4OS1CREUxLUQzOEJCMUZEMEMxNEBzYW5kcmFkb2RkLmNvbT4="},"prevInTopic":37893,"nextInTopic":37899,"prevInTime":37897,"nextInTime":37899,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"Lydia is 11 and had often asked about school.  She s a really social girl and I kept her very busy with our local homeschool group (4-H, girl scouts, art club,","messageBody":"<div id=\"ygrps-yiv-1285418752\">Lydia is 11 and had often asked about school.  She&#39;s a really social<br/>\ngirl and I kept her very busy with our local homeschool group (4-H, girl<br/>\nscouts, art club, parties, play dates, field trips, park days, etc.). <br/>\nShe was still curious so we would visit friends at school and went on a<br/>\ntour of the school.  She always decided not to go, until this year.<br/>\n<br/>\nAround here many homeschoolers start going to school about this age. <br/>\nHer friends that haven&#39;t gone the school route are a little more<br/>\nintroverted than she is and well, Lydia wants to be around kids every<br/>\nday.<br/>\n<br/>\nI also think that Lydia was worried how she would match up and I really<br/>\nthink she needed to find out on her own just how normal or abnormal (<br/>\n[:O] ) she/we are.  So, this year she has decided to give school a try. <br/>\nAbout a month before school started she was really pushing me, her dad<br/>\nand her brother away.  It was hard on everyone.<br/>\n<br/>\nThe night of her orientation (meet the teacher night, 2 days before<br/>\nschool started) we were walking up to the school.  This attitude<br/>\novertook her and I could tell she wanted to separate herself from me.  I<br/>\nleaned over and said (if you knew me, I&#39;m pretty sarcastic and we play-<br/>\ntease fairly often in our home) &quot;hey!  Look around at all the rest of<br/>\nthese dorky parents...I&#39;m not THAT bad!!&quot;  She looked around, smiled and<br/>\nher attitude change for the better.  We went through orientation<br/>\ntogether and it was good.<br/>\n<br/>\nWell, we&#39;re almost 2 weeks into school.  She is really enjoying meeting<br/>\nall the kids and is making a lot of friends.  But, for the last three<br/>\nnights she&#39;s had 2-3 hours of homework and it is mindless, worthless,<br/>\nrote memorization type stuff (to be honest, this school is just proving<br/>\nto her what I&#39;ve said all along!).  She&#39;s exhausted from it.  It is<br/>\ntotally interfering with all the things she does enjoy doing.<br/>\n<br/>\nAs we were laying in her bed tonight she said &quot;can I skip school<br/>\ntomorrow&quot; and I told her it was her choice.  She says she really doesn&#39;t<br/>\nlike a lot of the stuff at school (except the friends part).  She then<br/>\nasked me what I would do.  In Iowa we do have an option of dual<br/>\nenrollment so she could take some classes and do some activities.  I<br/>\njust told her the options and told her it&#39;s her decision.<br/>\n<br/>\nI suggested she keep going until she really knows what she wants.  I<br/>\ntold her not to give up on meeting homeschool friends, and I told her<br/>\nthat most of her friendships will come from things she has in common<br/>\nwith people.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I think if a mother has any fear that school is more fun than home,<br/>\n&gt; home is not nearly fun enough.&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Man this quote hits home.  I&#39;ve wondered if there is more I could be<br/>\ndoing.  And, of course there is.  And if she gives home another try,<br/>\nI&#39;ll try even harder to meet her needs.<br/>\n<br/>\nBut I can say that I have NO regrets in giving her the freedom to chose<br/>\nher own path.  If anything, it has made our relationship stronger.  She<br/>\nhas found out that she&#39;s not behind, she&#39;s great at making friends, many<br/>\nkids wish they didn&#39;t have to go to school, that we&#39;re not abnormal and<br/>\nthat she&#39;ll be able to make an informed decision!<br/>\n<br/>\nYou may dislike the thought of your child going to school but really it<br/>\nwill be a completely different experience for her since it&#39;s not<br/>\ncompulsory!  I think at such a young age (pre-K) you&#39;ll be able to meet<br/>\nher needs at home.  But you&#39;ve got to put in the work.  Maybe you&#39;re not<br/>\nas social as she is, and if that&#39;s the case step out of your comfort<br/>\nzone.<br/>\n<br/>\namy g<br/>\niowa<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":263403964,"authorName":"nikkole_abbas","from":"&quot;nikkole_abbas&quot; &lt;nikkole_abbas@...&gt;","profile":"nikkole_abbas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"0"},"subject":"Re: DD wants to try school","postDate":"1220505663","msgId":37899,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc5bnI3dit0OWw1QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDU3NDQ2OC41MTQyNy5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37898,"nextInTopic":37900,"prevInTime":37898,"nextInTime":37900,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"Thanks, EVERYONE for the great suggestions and reassurances! No one in my local HS group seemed to have experienced their kids desire to go to school, so glad","messageBody":"<div id=\"ygrps-yiv-1539910627\">Thanks, EVERYONE for the great suggestions and reassurances! No one in<br/>\nmy local HS group seemed to have experienced their kids&#39; desire to go<br/>\nto school, so glad to know I&#39;m not alone. It was great to get all of<br/>\nthese responses in just a single day!<br/>\n<br/>\nJoyce wrote:<br/>\n   &lt;&lt;What if she announced she wanted to go to Paris? Probably you<br/>\nwouldn&#39;t hop on a plane to Paris, but would you panic and find ways<br/>\nto ignore Paris and make the US seem more fun? Or might you explore<br/>\nFrench food and turn on the French language on movies?&gt;&gt;<br/>\n<br/>\nFantastic comparison! I hadn&#39;t thought of it that way. I will look at<br/>\nways to go headlong into this, rather than just trying to avoid it.<br/>\nI&#39;ll probably start this process with your suggestion:<br/>\n<br/>\n&lt;&lt;Maybe ask her to visualize what a day at school would be like. Have<br/>\nher walk you through her day and pay attention to what it is she&#39;s<br/>\nthinking would be fun. Don&#39;t down play it. If there&#39;s any negative<br/>\nvibes coming from you, any fear, she&#39;s likely to clam up and not want<br/>\nto play. Use it as a stream of information to help you help her find<br/>\nnew things to explore.&gt;&gt;<br/>\n<br/>\nThis sounds like a great way to get more information from her since<br/>\nshe doesn&#39;t seem to know why she wants to go to school. Then I can<br/>\nfind ways to meet that unmet need, whatever it may be. I also really<br/>\nliked Diana&#39;s suggestion:<br/>\n<br/>\n&lt;&lt;we set up a corner of the dining room as<br/>\nher &quot;classroom&quot; -- we got a desk and I decorated with posters&gt;&gt;<br/>\n<br/>\nBoth Sandra and Joyce asked about why we limit TV time. I guess we<br/>\ndon&#39;t want her to just &#39;veg out&#39; in front of the TV, and that often<br/>\nseems to be how she watches it. Blank look, doesn&#39;t seem to be getting<br/>\nmuch out of it. We do watch movies together fairly regularly on the<br/>\n&quot;big screen&quot; (projector on the wall) and she enjoys that and doesn&#39;t<br/>\nget that same look, and we talk about them as we are getting ready for<br/>\nbed afterward. <br/>\n<br/>\nInstead, when the TV is on less, she engages more, &quot;loses herself&quot; in<br/>\nactivity for long periods of time, either reading to herself or<br/>\nimaginative play with her stuffed animals, coloring, writing letters<br/>\nto her friends or grandma, etc. This is something we have noticed for<br/>\nher. Her 2yo sister, on the other hand, will watch for a few minutes<br/>\nand walk away while the TV is still on to do something else. We won&#39;t<br/>\nhave to &quot;limit&quot; her time, it seems (at least at this point). <br/>\n<br/>\nSandra wrote:<br/>\n&lt;&lt;Why limit her to shows about school or about not-school?&gt;&gt;<br/>\n<br/>\nThe shows are not limited to shows about school or not-school, but we<br/>\nprefer to use the TV as an enrichment tool rather than a way to tune<br/>\nout. We are also adamantly opposed to much of consumer culture in the<br/>\nUS and do NOT want our daughters exposed to all of the blatant and<br/>\nirresponsible marketing to children. (Fortunately, the 4yo does mute<br/>\nout commercials and understands what advertisers are trying to do.)<br/>\nBecause of these important values to us, we choose PBS. Then in many<br/>\nof these shows they *happen* to mention school, rather than shows<br/>\n*about* school. <br/>\n<br/>\nIn response to my request: &gt; I guess<br/>\n<blockquote><span title=\"ireply\"> &gt; what I might be looking for (besides advice and ideas) are any<br/>\n&gt; books/videos/cartoons that depict characters that are homeschooled as<br/>\n&gt;<br/>\n </span></blockquote>Joyce wrote:<br/>\n&lt;&lt;Sounds like propaganda to me.&gt;&gt;<br/>\n<br/>\nMaybe so. I guess I hadn&#39;t thought of it that way. I had considered<br/>\nthe PBS shows propaganda and just wanted a way to counter that. I<br/>\nhadn&#39;t considered shows portraying HS as an option propaganda, and not<br/>\nsure I meant the type of show that could be considered so (at least I<br/>\nthink not...**sheepish grin**). I guess it&#39;s just not even seen<br/>\nanywhere in the media. I wouldn&#39;t mind if Caillou was excited to go to<br/>\nschool (as in an episode where he went to his friend&#39;s school for a<br/>\nday) if he also had a HS friend he visited as well.<br/>\n<br/>\nSandra wrote: <br/>\n&lt;&lt;So you&#39;re worried that if she goes to school she&#39;ll be bored?&gt;&gt;<br/>\n<br/>\nYes, I am, or perhaps that she won&#39;t be challenged or will not have as<br/>\nmuch opportunity to learn. <br/>\n<br/>\nJoyce wrote: <br/>\n&lt;&lt;You&#39;re fearing that it&#39;s more<br/>\nfun than you are and that if you let her go she&#39;ll realize that and<br/>\nnot want to come home. (If you weren&#39;t fearing that, then it wouldn&#39;t<br/>\nfrighten you that she wanted to go. That said, it is a very common<br/>\nfear! Don&#39;t think you&#39;re alone in that.)&gt;&gt;<br/>\n<br/>\nInterestingly, despite the apparent contradiction, my immediate<br/>\nresponse to this was also Yes. I do think I am afraid she&#39;ll want to<br/>\nstay in school (for whatever she enjoys/misses) and end up missing out<br/>\non the learning (about who she is, what she enjoys, who she wants to<br/>\nbecome as much as the more &quot;academic&quot; or &quot;traditional&quot; learning she<br/>\ncould do while her peers are learning what she already knows--i.e.<br/>\nreading, writing and basic math).<br/>\n<br/>\nOur local HS playgroup seems about to disband due to a lack of ability<br/>\nfor any family to be able to commit to being their *every* week, in<br/>\ncase of a new family arriving, or whatever. Given the discussion here,<br/>\nI&#39;m thinking of committing our family to this despite the fact that I<br/>\nwork 40 hr/wk. I can flex that time and work those few hrs another<br/>\ntime to make this a priority for my girls. <br/>\n<br/>\nThanks again for all of your ideas!<br/>\n-Nikkole<br/>\nUnschooling mom to Mehrezat (almost 5) and Akilah (2)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://7gens.blogspot.com\">http://7gens.blogspot.com</a></div>","specialLinks":[]},{"userId":288405080,"authorName":"diana jenner","from":"&quot;diana jenner&quot; &lt;hahamommy@...&gt;","profile":"dianajenner","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220468479","msgId":37893,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY1MThhOTM2MDgwOTAzMTIwMWw1ZThjOGJjdTVjNjdkYmUzNWFiMzc1MmJAbWFpbC5nbWFpbC5jb20+","inReplyToHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPg==","referencesHeader":"PGZjaHYxMituaDFkQGVHcm91cHMuY29tPiA8ZzlsMGxrKzhpNmRAZUdyb3Vwcy5jb20+"},"prevInTopic":37889,"nextInTopic":37898,"prevInTime":37892,"nextInTime":37894,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"When Hannah caught the Kindy Bug, we set up a corner of the dining room as her classroom -- we got a desk and I decorated with posters from the teacher s","messageBody":"<div id=\"ygrps-yiv-699170741\">When Hannah caught the Kindy Bug, we set up a corner of the dining room as<br/>\nher &quot;classroom&quot; -- we got a desk and I decorated with posters from the<br/>\nteacher&#39;s store. I had a fishtank on the nearby bookshelf (she picked the<br/>\nbooks she wanted for &quot;school&quot;). Mostly we played. Just like they played<br/>\ngrocery store or bank or hospital (hayden gave birth until he was about 4<br/>\nand figgered out it was anatomically impossible :::vbg:::), we played<br/>\nschool. We even took a trip on the city bus, while she wore her pack-pack,<br/>\nand went to the library.<br/>\nBy denying it&#39;s existence and appeal, there&#39;s the risk of creating forbidden<br/>\nfruit where none should be!<br/>\n~diana :)<br/>\nxoxoxoxo<br/>\nhannahbearski.blogspot.com<br/>\nhannahsashes.blogspot.com<br/>\ndianas365.blogspot.com<br/>\n<blockquote><span title=\"ireply\"> &gt;<br/>\n&gt;<br/>\n&gt; <br/>\n&gt;<br/>\n<br/>\n<br/>\n </span></blockquote>[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":137349367,"authorName":"cathyandgarth","from":"&quot;cathyandgarth&quot; &lt;familialewis@...&gt;","profile":"cathyandgarth","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: DD wants to try school","postDate":"1220465323","msgId":37889,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc5bWpyYitxaGY3QGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPg=="},"prevInTopic":37887,"nextInTopic":37893,"prevInTime":37888,"nextInTime":37890,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"I won t rehash all the great advice you ve already received, but thought I d throw out what occured with my DD. When she was about a year out from Kindergarten","messageBody":"<div id=\"ygrps-yiv-1257009571\">I won&#39;t rehash all the great advice you&#39;ve already received, but <br/>\nthought I&#39;d throw out what occured with my DD.<br/>\n<br/>\nWhen she was about a year out from Kindergarten she started talking <br/>\nabout going to school, pretty intensly.  I posted to the AU list for <br/>\nthe same reasons you posted here, I thought getting some good advice <br/>\nand clearing my own issues up would be a good move on my part.  It <br/>\nwas good, but my conversations with my DD still didn&#39;t reveal her <br/>\nmotivation to go to school.<br/>\n<br/>\nThen, we were driving somewhere and something came up about a <br/>\nhomeschooled friend of my son&#39;s who had been hit by a golf cart as <br/>\nhe was crossing the street in front of a local lodge.  He had to get <br/>\nstitches and it freaked him and his mom out, but otherwise it turned <br/>\nout fine.  She suddenly blurted out: &quot;WE WILL NEVER KNOW ABOUT THOSE <br/>\nTHINGS BECAUSE WE DON&#39;T GO TO SCHOOL!!!&quot;  And then I got it, she was <br/>\nworried that by not going to school she was going to miss out on <br/>\nsome vitally important knowledge that would keep her from getting <br/>\nhit by a golf cart (it sounds trivial but in her mind it was a major <br/>\nbig deal).  So we talked about what you learn in school and what you <br/>\nlearn from experience, and how she could learn about the golf cart <br/>\nfrom our friend and that she didn&#39;t have to go to school to learn <br/>\nthat and in fact wouldn&#39;t learn that if she went to school.  She was <br/>\ntotally fine with that and school has never come up again, except to <br/>\ntell me how glad she is that she doesn&#39;t have to go to school so she <br/>\ncan do art all day.<br/>\n<br/>\nFor the social piece I try to really respond to every interest my <br/>\nkids have, as possible in our small town.  So they are in soccer, <br/>\ndance, karate, art classes, climbing -- they get to spend lots of <br/>\ntime with other kids, homeschooled and schooled, in those <br/>\nsituations.  And we have lots of sleepovers and playdates, usually I <br/>\nhost, but not always.  For my 3, 2 times a month would not be enough <br/>\nsocial for them, but every child is different.  <br/>\n<br/>\nCathy</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220464518","msgId":37887,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDJFOUY2OEM5LTRGRTMtNEYzRC1CMDI4LTM4RTk1Q0Q0QUQzMkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDFCQkFFNTg2LTJDMTUtNDAzNy05QTE4LUU2MDkxM0U2MDVFM0Bjb3gubmV0Pg==","referencesHeader":"PGc5bTM0NStvZDMxQGVHcm91cHMuY29tPiA8MUJCQUU1ODYtMkMxNS00MDM3LTlBMTgtRTYwOTEzRTYwNUUzQGNveC5uZXQ+"},"prevInTopic":37883,"nextInTopic":37889,"prevInTime":37886,"nextInTime":37888,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"-=-When my ds was about six, he expressed his concern about being homeschooled, surprising the heck out of me; he said, in a sad voice, Mommy, I think I m","messageBody":"<div id=\"ygrps-yiv-405502625\">-=-When my ds was about six, he expressed his concern about being<br/>\nhomeschooled, surprising the heck out of me; he said, in a sad voice,<br/>\n&quot;Mommy, I think I&#39;m smart enough to go to school...&quot; He thought he<br/>\nwas being homeschooled because there was something wrong with him, or<br/>\nhe was dumb.-=-<br/>\n<br/>\nMarty asked me quietly one day if he wasn&#39;t in school because he  <br/>\nwasn&#39;t smart.<br/>\n<br/>\nHe got the idea from a mean neighbor boy who wasn&#39;t himself nearly as  <br/>\nbright as Marty,  but I didn&#39;t want to disturb the happy balance at  <br/>\nhome any more than Nick already had, so rather than tell Marty he was  <br/>\nsmarter than Nick (my first thought) I talked about school a little  <br/>\nbit, and that no, I was SURE if Marty went to school he could do  <br/>\ntheir stuff very easily, and if he wanted to go to school he could  <br/>\n(we used to make that offer every year to all the kids, when they  <br/>\nwere little), but I&#39;d rather let him do what he wanted to do instead  <br/>\nof sit all day with kids like Nick.  Something like that.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":269399205,"authorName":"BRIAN POLIKOWSKY","from":"BRIAN POLIKOWSKY &lt;polykowholsteins@...&gt;","profile":"polykowholsteins","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220452163","msgId":37883,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU3NDQ2OC41MTQyNy5xbUB3ZWI4MTUwOC5tYWlsLm11ZC55YWhvby5jb20+"},"prevInTopic":37882,"nextInTopic":37887,"prevInTime":37882,"nextInTime":37884,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"My son turned six this summer and he loves to be around friends. All the time. So we do everything we can to get together with other kids as much as possible","messageBody":"<div id=\"ygrps-yiv-1839648104\">My son turned six this summer and he loves to be around friends. All the time.<br/>\nSo we do everything we can to get together with other kids as much as possible .<br/>\nWe have one homeschool group that does activities (at Nature Center, State Park classes and activities, Children&#39;s Theater, etc) once a week.<br/>\nWe are trying to join a co-op once a week that has Chess, Lego and Theater classes.<br/>\nWe just started Tae-kwon Do and theatre classes start next week.<br/>\nIt seems like a busy schedule but he wanted those and he has a need to be around other kids.<br/>\nI could do some of those activities without the group but for him it is important to be with other.<br/>\nWe still do plenty without the groups but I can see he enjoys so much being with his friends.<br/>\nThis is a kid that was making friends in the park at 2 years old. <br/>\nI know that if I don&#39;t feel his need to be around other kids he will want to go to school.<br/>\n <br/>\n<br/>\n <br/>\nAlex Polikowsky<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://polykow.blogspot.com/\">http://polykow.blogspot.com/</a><br/>\n <br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://groups.yahoo.com/group/unschoolingmn/\">http://groups.yahoo.com/group/unschoolingmn/</a><br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220451864","msgId":37882,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFCQkFFNTg2LTJDMTUtNDAzNy05QTE4LUU2MDkxM0U2MDVFM0Bjb3gubmV0Pg==","inReplyToHeader":"PGc5bTM0NStvZDMxQGVHcm91cHMuY29tPg==","referencesHeader":"PGc5bTM0NStvZDMxQGVHcm91cHMuY29tPg=="},"prevInTopic":37880,"nextInTopic":37883,"prevInTime":37881,"nextInTime":37883,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"... When my ds was about six, he expressed his concern about being homeschooled, surprising the heck out of me; he said, in a sad voice, Mommy, I think I m","messageBody":"<div id=\"ygrps-yiv-24714345\">On Sep 3, 2008, at 6:23 AM, carnationsgalore wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt;&gt; I have talked to HS moms in our local group and got the &quot;find out<br/>\n&gt; why<br/>\n&gt;&gt; she wants to go to school&quot; advice. I tried this and she just said &quot;I<br/>\n&gt;&gt; don&#39;t know.&quot; I don&#39;t know what she expects to get from school or why<br/>\n&gt;&gt; it appeals so much to her.<br/>\n&gt;<br/>\n&gt; Tell her that different families live different ways.  Some families<br/>\n&gt; have only one parent.  Some families have lots of kids.  Some<br/>\n&gt; families have a grandparent living with them.  Some families send<br/>\n&gt; their kids to private or public schools.  Some families homeschool.<br/>\n<br/>\n<br/>\n </span></blockquote>When my ds was about six, he expressed his concern about being  <br/>\nhomeschooled, surprising the heck out of me; he said, in a sad voice,  <br/>\n&quot;Mommy, I think I&#39;m smart enough to go to school...&quot;  He thought he  <br/>\nwas being homeschooled because there was something wrong with him, or  <br/>\nhe was dumb.  He might have gotten that idea from one of his Little  <br/>\nLeague teammates, who often quizzed him on stuff *they* didn&#39;t know.<br/>\n<br/>\nI asked him what he thought he would learn in school as a first  <br/>\ngrader.  He didn&#39;t know what they really did, so I told him mostly  <br/>\nthey learned to read.  As he&#39;d been reading for two years by then, I  <br/>\nfollowed by asking him what he thought he would do all day while the  <br/>\nother kids learned to read.  That satisfied him &lt;g&gt;<br/>\n<br/>\nHe has since chosen to go to school -- he started college last week.   <br/>\nIt&#39;s a bit of a shock when your first day at school is a college  <br/>\nAstronomy class and you&#39;ve never had any formal math, but he&#39;s doing  <br/>\nfine so far.  (The other class is Drawing; he dropped the 5 unit  <br/>\nJapanese class for now.)<br/>\n<br/>\nIt&#39;s interesting how some things are taken for granted in the school  <br/>\nuniverse.  His Astronomy teacher&#39;s syllabus included an explanation of  <br/>\nthe grading system, including his policy that the lowest scoring quiz  <br/>\nwould be dropped.  Alex, completely unfamiliar with all of it, thought  <br/>\nthis meant that the person who scored the lowest would be kicked out  <br/>\nof the class (and also feared that would be him!).  His sister (also  <br/>\nattending this semester) and I straightened him out ;-)<br/>\n<br/>\nNancy</div>","specialLinks":[]},{"userId":337544642,"authorName":"carnationsgalore","from":"&quot;carnationsgalore&quot; &lt;addled.homemaker@...&gt;","profile":"carnationsgalore","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: DD wants to try school","postDate":"1220448197","msgId":37880,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc5bTM0NStvZDMxQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPg=="},"prevInTopic":37879,"nextInTopic":37882,"prevInTime":37879,"nextInTime":37881,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"... why ... Tell her that different families live different ways.  Some families have only one parent.  Some families have lots of kids.  Some families have a","messageBody":"<div id=\"ygrps-yiv-1512862835\"><blockquote><span title=\"ireply\">&gt; I have talked to HS moms in our local group and got the &quot;find out <br/>\n </span></blockquote>why<br/>\n<blockquote><span title=\"ireply\"> &gt; she wants to go to school&quot; advice. I tried this and she just said &quot;I<br/>\n&gt; don&#39;t know.&quot; I don&#39;t know what she expects to get from school or why<br/>\n&gt; it appeals so much to her. <br/>\n<br/>\n </span></blockquote>Tell her that different families live different ways.  Some families <br/>\nhave only one parent.  Some families have lots of kids.  Some <br/>\nfamilies have a grandparent living with them.  Some families send <br/>\ntheir kids to private or public schools.  Some families homeschool.<br/>\n<br/>\nAre you active in your homeschool group, so that your daughter has <br/>\ntime to play with other kids?  If she is busy with people and stuff <br/>\nto do, she probably won&#39;t even miss that she isn&#39;t in school.<br/>\n<br/>\nMaybe she wants the excitement of getting new school stuff.  Let her <br/>\npick out a school bookbag or box.  We used file boxes when my kids <br/>\nwere younger that they decorated with stickers.  Buy some school <br/>\nsupplies like pencils, colored pencils, crayons, markers, and glue.  <br/>\nYou can also buy some fun coloring books, sketch pad, activity books <br/>\n(word finds, dot to dot, mazes, painting books), construction paper, <br/>\nand a lined notebook.  You could include some playing cards, small <br/>\npuzzles and games.  She can keep all her stuff in her school box that <br/>\nshe can carry around with her.  My kids loved their activity boxes <br/>\nand used them for several years.<br/>\n<br/>\nBeth M.</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220444058","msgId":37879,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEYzNzU5OUJBLUY2NzgtNDQ4OS1CREUxLUQzOEJCMUZEMEMxNEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDg4MDk3MTIzLUJBQ0UtNEZFNS1BQzQyLUNGMjA3RkExOUM2QUB2ZXJpem9uLm5ldD4=","referencesHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPiA8ODgwOTcxMjMtQkFDRS00RkU1LUFDNDItQ0YyMDdGQTE5QzZBQHZlcml6b24ubmV0Pg=="},"prevInTopic":37878,"nextInTopic":37880,"prevInTime":37878,"nextInTime":37880,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"-=-I think you re fearing school too much. You re fearing that it s more fun than you are and that if you let her go she ll realize that and not want to come","messageBody":"<div id=\"ygrps-yiv-1788341070\">-=-I think you&#39;re fearing school too much. You&#39;re fearing that it&#39;s more<br/>\nfun than you are and that if you let her go she&#39;ll realize that and<br/>\nnot want to come home. (If you weren&#39;t fearing that, then it wouldn&#39;t<br/>\nfrighten you that she wanted to go. That said, it is a very common<br/>\nfear! Don&#39;t think you&#39;re alone in that.)-=-<br/>\n<br/>\n<br/>\n<br/>\nI think if a mother has any fear that school is more fun than home,  <br/>\nhome is not nearly fun enough.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":322244815,"authorName":"Joyce Fetteroll","from":"Joyce Fetteroll &lt;jfetteroll@...&gt;","profile":"jfetteroll","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220440775","msgId":37878,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDg4MDk3MTIzLUJBQ0UtNEZFNS1BQzQyLUNGMjA3RkExOUM2QUB2ZXJpem9uLm5ldD4=","inReplyToHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPg==","referencesHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPg=="},"prevInTopic":37877,"nextInTopic":37879,"prevInTime":37877,"nextInTime":37879,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"... I think the more you focus on school, even internally as a reason to make home more fun, the more attractive school will be and the more intrigued she ll","messageBody":"<div id=\"ygrps-yiv-476529080\">On Sep 2, 2008, at 11:35 PM, nikkole_abbas wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I was searching for some<br/>\n&gt; tips on helping get my (almost) 5 yo daughter to &quot;want&quot; to stay home.<br/>\n<br/>\n<br/>\n </span></blockquote>I think the more you focus on school, even internally as a reason to  <br/>\nmake home more fun, the more attractive school will be and the more  <br/>\nintrigued she&#39;ll be. Even if you think you&#39;re hiding it, you really  <br/>\ncan&#39;t.<br/>\n<br/>\nI would use her interest as an indication that there are things she  <br/>\nwants to explore that are missing from home. Yes, she&#39;s making it  <br/>\nhard because she doesn&#39;t know! But that doesn&#39;t mean there&#39;s nothing  <br/>\nyou can do.<br/>\n<br/>\nWhat if she announced she wanted to go to Paris? Probably you  <br/>\nwouldn&#39;t hop on a plane to Paris, but would you panic and find ways  <br/>\nto ignore Paris and make the US seem more fun? Or might you explore  <br/>\nFrench food and turn on the French language on movies?<br/>\n<br/>\nMaybe ask her to visualize what a day at school would be like. Have  <br/>\nher walk you through her day and pay attention to what it is she&#39;s  <br/>\nthinking would be fun. Don&#39;t down play it. If there&#39;s any negative  <br/>\nvibes coming from you, any fear, she&#39;s likely to clam up and not want  <br/>\nto play. Use it as a stream of information to help you help her find  <br/>\nnew things to explore. (Obviously you&#39;ve got it easier since she&#39;s  <br/>\ntoo young to go. This can all be pure information, not leading to  <br/>\n&quot;Can I go tomorrow?&quot; You can honestly say &quot;The school won&#39;t let her,&quot;  <br/>\nbut that you&#39;d like to find ways for her to do the same fun things.)  <br/>\nBe respectful if she says she doesn&#39;t know why something sounds fun.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We do<br/>\n&gt; make an effort to go to the HS playgroup perhaps 2X/month.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>If she sees kids on TV playing together at school every day (or so it  <br/>\nseems to her) this isn&#39;t enough. Classes, brownies, creating your own  <br/>\nunschoolers get together, inviting kids over.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I guess<br/>\n&gt; what I might be looking for (besides advice and ideas) are any<br/>\n&gt; books/videos/cartoons that depict characters that are homeschooled as<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>Sounds like propaganda to me.<br/>\n<br/>\nDon&#39;t try to sell her on homeschooling. Live it. Let *her* decide she  <br/>\nlikes it (or not.)<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; an alternative for the small amount of TV time she does get.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>One of the great things about being out in the world rather than  <br/>\nlocked in a room is freedom. The more restrictions at home, then  <br/>\nschool isn&#39;t as big of a contrast. Why is her TV time being limited?  <br/>\nDo you limit her to a book a day? Do you limit her to 1 cookie per day?<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I couldn&#39;t<br/>\n&gt; tell whether it had much of an effect on her or not. She still seems<br/>\n&gt; to really want to go to school.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>That limitation might be worth it to her to get access to lots of  <br/>\nkids or whatever she thinks she&#39;ll find in school.<br/>\n<br/>\nMy daughter went to school for 2 months of 2nd grade. At first  <br/>\neverything was &quot;Great!&quot; After a while the newness of the good parts  <br/>\nwore off and the stuff she was putting up with to get the new stuff  <br/>\nstarted feeling more and more annoying until she felt she&#39;d sucked  <br/>\nthe experience dry and was done. The good parts were no longer worth  <br/>\nthe irritation of the bad parts. Same with just about anything new  <br/>\npeople want to try. There&#39;s always good parts and bad parts. If  <br/>\nsomeone finds the good parts are worth the bad parts, they put up  <br/>\nwith them. If not, it&#39;s hugely empowering to know you can drop  <br/>\nsomething at any time.<br/>\n<br/>\nI think you&#39;re fearing school too much. You&#39;re fearing that it&#39;s more  <br/>\nfun than you are and that if you let her go she&#39;ll realize that and  <br/>\nnot want to come home. (If you weren&#39;t fearing that, then it wouldn&#39;t  <br/>\nfrighten you that she wanted to go. That said, it is a very common  <br/>\nfear! Don&#39;t think you&#39;re alone in that.)<br/>\n<br/>\nI think one of the strengths that we unschooling parents have is that  <br/>\nwe know school and unschooling. We&#39;ve experienced both. It increases  <br/>\nour credibility when we discuss the benefits of unschooling :-) But a  <br/>\nlot of our kids will only know unschooling. My daughter Kat knows  <br/>\nfrom experience why she wouldn&#39;t want to attend school. ;-)<br/>\n<br/>\nI&#39;m not advocating putting kids in school, but I think the less we  <br/>\nfear what they want to try, the better.<br/>\n<br/>\nJoyce<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220435092","msgId":37877,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDAyMTZBQ0YwLTI2NUUtNDA1Ni1BMTQxLThBNDNFNzEzODAxMkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDY5NjE5NjI0LTk0RTEtNDM2RC05MUY2LUVFQjhDQjExNUE1QUBtYWMuY29tPg==","referencesHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPiA8Njk2MTk2MjQtOTRFMS00MzZELTkxRjYtRUVCOENCMTE1QTVBQG1hYy5jb20+"},"prevInTopic":37875,"nextInTopic":37878,"prevInTime":37876,"nextInTime":37878,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"-=-Rosie wanted to have a teacher. She wanted to be able to say things like, MY teacher says..... . So we signed her up for a week, one hour per day, for a","messageBody":"<div id=\"ygrps-yiv-2000795825\">-=-Rosie wanted to have a teacher. She wanted to be able to say things<br/>\nlike, &quot;MY teacher says.....&quot;. So we signed her up for a week, one hour<br/>\nper day, for a science class at the local nature center. That was<br/>\nenough to make her happy.-=-<br/>\n<br/>\n<br/>\n<br/>\nHolly took a dance/theater class and she liked the teacher and one  <br/>\nsummer did a &quot;camp&quot; (all day there every day and had to take her  <br/>\nlunch, which thrilled her).<br/>\n<br/>\nKirby wanted a lunchbox and some school supplies.  Easy.<br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220434853","msgId":37875,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDU2RkU3MTYwLTVFQTUtNEY0RC1COUMzLTA5QUNBNzNDRUVEMEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPg==","referencesHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPg=="},"prevInTopic":37873,"nextInTopic":37877,"prevInTime":37874,"nextInTime":37876,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"-=-She watches PBS semi-regularly, so it may be from the Arthur/Caillou/Etc. crowd. The shows are all about trying to jazz up the idea of school to the","messageBody":"<div id=\"ygrps-yiv-42542497\">-=-She watches PBS semi-regularly, so it may be from the<br/>\nArthur/Caillou/Etc. crowd. The shows are all about trying to jazz up<br/>\nthe idea of school to the majority of kids who will attend. I guess<br/>\nwhat I might be looking for (besides advice and ideas) are any<br/>\nbooks/videos/cartoons that depict characters that are homeschooled as<br/>\nan alternative for the small amount of TV time she does get. -=-<br/>\n<br/>\nWhy is her TV time limited?<br/>\n<br/>\nWhy limit her to shows about school or about not-school?  Look for  <br/>\nmovies with quality aspects that depict happy children doing fun things.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/movies\">http://sandradodd.com/movies</a><br/>\n<br/>\n-=-Because of this we<br/>\n<br/>\nboth have flexibility to make time for her during the day and try to<br/>\ndo so as much as possible (though not always able). She (and her 2 yo<br/>\nsister) gets much more of our time and attention than most kids who<br/>\nhave to go to daycare, but not as much time with other kids. We do<br/>\nmake an effort to go to the HS playgroup perhaps 2X/month. -=-<br/>\n<br/>\nMaybe you could hire an older kid as a mother&#39;s helper to come to  <br/>\nyour house and just play with them.  Unschooling needs to be rich and  <br/>\nbusy and fun, not just spare moments.  But with two parents home and  <br/>\n80 hours worked, there are still LOTS of hours in the week when  <br/>\nyou&#39;re not sleeping.  If school sounds more fun than home, home isn&#39;t  <br/>\nenough fun.<br/>\n<br/>\n<br/>\n<br/>\n-=-Another concern of mine is that she is very advanced. -=-<br/>\n<br/>\nSo you&#39;re worried that if she goes to school she&#39;ll be bored?<br/>\n<br/>\n-=-I&#39;m resurrecting a &quot;dead&quot; topic here because I was searching for  <br/>\nsome tips on helping get my (almost) 5 yo daughter to &quot;want&quot; to stay  <br/>\nhome.-=-<br/>\n<br/>\nIt&#39;s not a dead topic at all, but she should truly want to stay  <br/>\nhome,  not &quot;want&quot; (kind of, or as they say) to stay home.  One of the  <br/>\nworst things about school is kids not having a choice.  It&#39;s the  <br/>\nworst thing about homeschooling, too, when the kids are home against  <br/>\ntheir wishes.  Create a home she WANTS to be in.  Create a world she  <br/>\ndoesn&#39;t want to miss.<br/>\n<br/>\n<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<br/>\n<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1220414226","msgId":37873,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDY5NjE5NjI0LTk0RTEtNDM2RC05MUY2LUVFQjhDQjExNUE1QUBtYWMuY29tPg==","inReplyToHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPg==","referencesHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPg=="},"prevInTopic":37871,"nextInTopic":37875,"prevInTime":37872,"nextInTime":37874,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"Two things --- Rosie wanted to have a teacher. She wanted to be able to say things like, MY teacher says..... . So we signed her up for a week, one hour per","messageBody":"<div id=\"ygrps-yiv-658529662\">Two things ---<br/>\n<br/>\nRosie wanted to have a teacher. She wanted to be able to say things  <br/>\nlike, &quot;MY teacher says.....&quot;. So we signed her up for a week, one hour  <br/>\nper day, for a science class at the local nature center. That was  <br/>\nenough to make her happy.<br/>\n<br/>\nSo - you might find that she wants just a little &quot;school&quot; type of  <br/>\nexperience - a teacher, some lessons. Find a recreation department  <br/>\nclass or &quot;kids college&quot; - which our local community colleges offer.<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We do<br/>\n&gt; make an effort to go to the HS playgroup perhaps 2X/month.<br/>\n<br/>\n </span></blockquote>That is not much. I&#39;d go every week and go early, leave late. Make a  <br/>\nplay date for another day during the week with someone from the HS  <br/>\ngroup.<br/>\n<br/>\nMy daughters hardly even considered going to school because they&#39;d  <br/>\nhave had to give up their very active social life with their  <br/>\nhomeschool friends. So - if you&#39;re willing to work a little harder,  <br/>\nyou could kind of get her more connected and locked in.<br/>\n<br/>\n-pam</div>","specialLinks":[]},{"userId":263403964,"authorName":"nikkole_abbas","from":"&quot;nikkole_abbas&quot; &lt;nikkole_abbas@...&gt;","profile":"nikkole_abbas","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: DD wants to try school","postDate":"1220412916","msgId":37871,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGc5bDBsays4aTZkQGVHcm91cHMuY29tPg==","inReplyToHeader":"PGZjaHYxMituaDFkQGVHcm91cHMuY29tPg=="},"prevInTopic":30604,"nextInTopic":37873,"prevInTime":37870,"nextInTime":37872,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"Hi, all. I m resurrecting a dead topic here because I was searching for some tips on helping get my (almost) 5 yo daughter to want to stay home. She turns","messageBody":"<div id=\"ygrps-yiv-724348483\">Hi, all.<br/>\nI&#39;m resurrecting a &quot;dead&quot; topic here because I was searching for some<br/>\ntips on helping get my (almost) 5 yo daughter to &quot;want&quot; to stay home.<br/>\nShe turns 5 too late (end Oct) to go to K this year in our Dist, so we<br/>\ndon&#39;t have to decide yet, but I want to work on this now and not have<br/>\nit be an issue.<br/>\n<br/>\nI have talked to HS moms in our local group and got the &quot;find out why<br/>\nshe wants to go to school&quot; advice. I tried this and she just said &quot;I<br/>\ndon&#39;t know.&quot; I don&#39;t know what she expects to get from school or why<br/>\nit appeals so much to her. <br/>\n<br/>\nI am at home (as is her dad) but work full-time at home (he has own PT<br/>\nto FT business--depending on projects at the time). Because of this we<br/>\nboth have flexibility to make time for her during the day and try to<br/>\ndo so as much as possible (though not always able). She (and her 2 yo<br/>\nsister) gets much more of our time and attention than most kids who<br/>\nhave to go to daycare, but not as much time with other kids. We do<br/>\nmake an effort to go to the HS playgroup perhaps 2X/month. <br/>\n<br/>\nShe watches PBS semi-regularly, so it may be from the<br/>\nArthur/Caillou/Etc. crowd. The shows are all about trying to jazz up<br/>\nthe idea of school to the majority of kids who will attend. I guess<br/>\nwhat I might be looking for (besides advice and ideas) are any<br/>\nbooks/videos/cartoons that depict characters that are homeschooled as<br/>\nan alternative for the small amount of TV time she does get. <br/>\n<br/>\nAnother concern of mine is that she is very advanced. She began<br/>\nreading very naturally and progressively on her own guidance (with our<br/>\nsupport and encouragement). I wasn&#39;t sure what her &quot;reading level&quot; was<br/>\n(didn&#39;t really care to know), but recently one of the books we checked<br/>\nout from the library was a &quot;Read on Your Own, Level Three: Grades Two<br/>\nto Four&quot; book and she read it to us without difficulty. <br/>\n<br/>\nI have tried the angle of &quot;you like learning, right? You want to keep<br/>\nlearning, right? Well, your teacher will be teaching all of the other<br/>\nkids the basics, like letters and then reading very basic words and<br/>\nshe (he) won&#39;t have time with all of those kids to teach you anything<br/>\nmore than what they are learning (that you already know).&quot; I couldn&#39;t<br/>\ntell whether it had much of an effect on her or not. She still seems<br/>\nto really want to go to school. <br/>\n<br/>\nAny suggestions would be GREATLY appreciated!<br/>\n-Nikkole<br/>\nUnschooling mom to Mehrezat (almost 5) and Akilah (2)<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://7gens.blogspot.com\">http://7gens.blogspot.com</a><br/>\n<br/>\n--- In <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:AlwaysLearning@yahoogroups.com\">AlwaysLearning@yahoogroups.com</a>, &quot;Nicole LoBue&quot; &lt;mamalobue@...&gt;<br/>\nwrote:<br/>\n<blockquote><span title=\"qreply\"> &gt;<br/>\n&gt; Hi there,<br/>\n&gt; <br/>\n&gt; I think I&#39;ve been a member of this group for years but forgot about <br/>\n&gt; it and haven&#39;t posted in a very long time.<br/>\n&gt; <br/>\n&gt; I&#39;ve been unschooling my 8yo daughter since she was two and my 4yo <br/>\n&gt; since birth.  Last night they both decided that they wanted to go to <br/>\n&gt; school.  I&#39;m tempted to let Lauren (8yo) go for a day or a week so <br/>\n&gt; she could see how it is, but here are my concerns:<br/>\n&gt; <br/>\n&gt; She barely reads at a first grade level and her math skills are the <br/>\n&gt; same.  Though she can read and do simple math, she walks around <br/>\n&gt; telling everyone that she doesn&#39;t know how.  I&#39;m concerned that one <br/>\n&gt; day with a school teacher will have CPS at my door.  I like to stay <br/>\n&gt; under the radar.<br/>\n&gt; <br/>\n&gt; My other concern is, what if she likes it?  I&#39;m vehemently opposed to <br/>\n&gt; how children are taught in school and the mind control that goes on.  <br/>\n&gt; It would not be okay with me to have her in school.<br/>\n&gt; <br/>\n&gt; Thoughts anyone?<br/>\n&gt; <br/>\n&gt; Nicole<br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":210979776,"authorName":"Jacqueline Parks","from":"&quot;Jacqueline Parks&quot; &lt;ivorygrace7@...&gt;","profile":"ivorygrace7","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1190145745","msgId":30604,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDFjMDA1NzU5MDcwOTE4MTMwMm81OWVhNjBkNmw2Y2QxMDM1NGZhMTAwODIxQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGU0YjVhYTRmNTQ4YTQ3YzRjZGFjNjQyMjJlZmRhYjIyQGNveC5uZXQ+","referencesHeader":"PDExODk5NDY2MDkuMTEyMC41MjI1Lm00MEB5YWhvb2dyb3Vwcy5jb20+CSA8MjAwNzA5MTYxMTAwMDQuZWIyY2QzNDIucGF0Y2h3b3JrZ2lybEB3ZWF2aW5ncmFpbmJvdy5jb20+CSA8ZTRiNWFhNGY1NDhhNDdjNGNkYWM2NDIyMmVmZGFiMjJAY294Lm5ldD4="},"prevInTopic":30574,"nextInTopic":37871,"prevInTime":30603,"nextInTime":30605,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"... ***** I have to agree with this.  I have known kids who wanted to go to school because they served chocolate milk (which their parents never bought) and ","messageBody":"<div id=\"ygrps-yiv-267674055\">On 9/16/07, Nancy Wooton &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:nancywooton@...\">nancywooton@...</a>&gt; wrote:<br/>\n<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You might want to clarify why your son wants to go.<br/>\n&gt;<br/>\n<br/>\n </span></blockquote>*****<br/>\n<br/>\nI have to agree with this.  I have known kids who wanted to go to school<br/>\nbecause they served chocolate milk (which their parents never bought) and<br/>\nbecause they wanted to ride on a bus.  If you find out the reason, there is<br/>\na good chance that you will be able to find another way to meet his needs.<br/>\n<br/>\nMy oldest daughter, who is now 19 and living on her own, attended school for<br/>\none year, seventh grade.  Although she didn&#39;t have any particularly horrible<br/>\nexperiences,  she regrets it now and thinks both that her time could have<br/>\nbeen better spent and that some of the peer interaction had long term<br/>\nnegative consequences.  I wish I would have worked harder to find another<br/>\noption for her.  We talk about it though, and we both agree that it did meet<br/>\nsome needs.  Our whole family learned what it is like to have someone<br/>\nattending school which actually makes the other children less likely to want<br/>\nto try it.  By seeing how well she compared to the other  students, she<br/>\ndeveloped a lot of confidence in unschooling and now definitely wants to<br/>\nunschool her own children.  It also was an escape for her during a difficult<br/>\ntime when my ex-husband and I were separating.<br/>\n<br/>\nMy thirteen year old daughter sometimes talks about wanting to go to school<br/>\nand see what it is like.  Then we talk about the realities of what it would<br/>\nbe like, and so far she has always decided on a different path (like taking<br/>\nhorseback riding lessons and starting an internet forum) to meet her needs.<br/>\n<br/>\n~Jacqueline<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1189998246","msgId":30574,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PEVFNDMyMDM0LUNDQkQtNEEyRS05REY0LTcwNEMxQTZEQTFFQkBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PGZja3EwbytxNDQ0QGVHcm91cHMuY29tPg==","referencesHeader":"PGZja3EwbytxNDQ0QGVHcm91cHMuY29tPg=="},"prevInTopic":30572,"nextInTopic":30604,"prevInTime":30573,"nextInTime":30575,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"Hey - even my 16 year old is somewhat sad after the LIve and Learn Conference, misses that intense contact with other unschooled kids - and she has unschooled","messageBody":"<div id=\"ygrps-yiv-1532096108\">Hey - even my 16 year old is somewhat sad after the LIve and Learn  <br/>\nConference, misses that intense contact with other unschooled kids -  <br/>\nand she has unschooled friends here.<br/>\n<br/>\nShe knows better than to think school might be at all like an  <br/>\nunschooling conference, but a younger kid might not be so clear about  <br/>\nthat!<br/>\n<br/>\n-pam<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On Sep 16, 2007, at 7:50 PM, patchworkgirl57 wrote:<br/>\n<br/>\n&gt; I figure he&#39;s missing the rethinking education conference that we went<br/>\n&gt; to: TONS of unschoolers all over the place! &lt;grin&gt; I&#39;ll look around<br/>\n&gt; for a class for him to go to as well as going to get-togethers..<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":210117180,"authorName":"patchworkgirl57","from":"&quot;patchworkgirl57&quot; &lt;patchworkgirl@...&gt;","profile":"patchworkgirl57","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"Re: DD wants to try school","postDate":"1189997400","msgId":30572,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZja3EwbytxNDQ0QGVHcm91cHMuY29tPg==","inReplyToHeader":"PDExNkNBMjcwLTgzREQtNDhBNS1CMjE0LUE5MzgxMzQyRTI4RUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":30567,"nextInTopic":30574,"prevInTime":30571,"nextInTime":30573,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"Well, the district is SUPPOSED to leave us alone according to TX law, but I ve heard of various districts giving families a hard time... each child out means","messageBody":"<div id=\"ygrps-yiv-175651067\">Well, the district is SUPPOSED to leave us alone according to TX law,<br/>\nbut I&#39;ve heard of various districts giving families a hard time...<br/>\neach child out means they don&#39;t get funds.. fortunately we have a<br/>\ngreat advocacy group (tx homeschool coalition: http://thsc.org)<br/>\nthat&#39;ll back parents who have problems with their district... <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; You don&#39;t have to worry about being under the radar in TX - even if  <br/>\n&gt; he goes to school, all you have to do is give them a letter saying  <br/>\n&gt; you&#39;re withdrawing him and there isn&#39;t any further reporting or  <br/>\n&gt; follow-up.<br/>\n<br/>\n </span></blockquote>I figure he&#39;s missing the rethinking education conference that we went<br/>\nto: TONS of unschoolers all over the place! &lt;grin&gt; I&#39;ll look around<br/>\nfor a class for him to go to as well as going to get-togethers..<br/>\n<br/>\nI know he loved homeschool day and would ask often &quot;is tomorrow<br/>\nhomeschool day?&quot; As far as neighborhood kids, there don&#39;t seem to be<br/>\nvery many... <br/>\n <br/>\n<blockquote><span title=\"ireply\"> &gt; Maybe you can find a class of some kind just for him. My youngest  <br/>\n&gt; daughter went to a nature center class - every weekday for 2 hours  <br/>\n&gt; for three weeks. From then on she would talk about, &quot;My Teacher,&quot;  <br/>\n&gt; with great pride, especially to her siblings and to neighborhood kids.<br/>\n&gt; <br/>\n<br/>\n </span></blockquote>Cheers,<br/>\nJessica<br/>\n<br/>\nPS Sandra: you&#39;re right, he&#39;s *learning* how to read, not teaching<br/>\nhimself! :-) It&#39;s a fascinating process for sure...</div>","specialLinks":[]},{"userId":166322738,"authorName":"Nancy Wooton","from":"Nancy Wooton &lt;nancywooton@...&gt;","profile":"ikonstitcher","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1189991671","msgId":30567,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGU0YjVhYTRmNTQ4YTQ3YzRjZGFjNjQyMjJlZmRhYjIyQGNveC5uZXQ+","inReplyToHeader":"PDIwMDcwOTE2MTEwMDA0LmViMmNkMzQyLnBhdGNod29ya2dpcmxAd2VhdmluZ3JhaW5ib3cuY29tPg==","referencesHeader":"PDExODk5NDY2MDkuMTEyMC41MjI1Lm00MEB5YWhvb2dyb3Vwcy5jb20+IDwyMDA3MDkxNjExMDAwNC5lYjJjZDM0Mi5wYXRjaHdvcmtnaXJsQHdlYXZpbmdyYWluYm93LmNvbT4="},"prevInTopic":30564,"nextInTopic":30572,"prevInTime":30566,"nextInTime":30568,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"... When my son was about 6, he started asking about school.  He d been in Little League t-ball, and I m sure he had lots of questions about why he was","messageBody":"<div id=\"ygrps-yiv-1379015743\">On Sep 16, 2007, at 9:00 AM, Jessica wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; Of my 4 boys, he&#39;s the only one who has been always unschooled...<br/>\n<br/>\n </span></blockquote>When my son was about 6, he started asking about school.  He&#39;d been in <br/>\nLittle League t-ball, and I&#39;m sure he had lots of questions about why <br/>\nhe was homeschooled.  When he brought it up, it was with the plaintive <br/>\n&quot;Mommy, I think I&#39;m smart enough to go to school...&quot;  He thought he was <br/>\nbeing homeschooled because he was too dumb for school.  I asked him <br/>\nwhat he thought he would learn in school; he didn&#39;t know.  I told him <br/>\nthat he&#39;d be in first grade, and in first grade they mostly learned to <br/>\nread.  He&#39;d been reading since he was 4, virtually self-taught.  I <br/>\nsaid, &quot;You know how to read, right?  What would you do all day in <br/>\nschool while the other kids learn to read?&quot;  :-)  That satisfied him.<br/>\n<br/>\nYou might want to clarify why your son wants to go.<br/>\n<br/>\nNancy  (my little boy is 17 now, btw, and always unschooled)</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1189974786","msgId":30564,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDk0MTMwNEU1LTU5QjEtNEM5Ny05QkIzLUZBRTI1QzRENjVCMEBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDExNkNBMjcwLTgzREQtNDhBNS1CMjE0LUE5MzgxMzQyRTI4RUBlYXJ0aGxpbmsubmV0Pg==","referencesHeader":"PDExODk5NDY2MDkuMTEyMC41MjI1Lm00MEB5YWhvb2dyb3Vwcy5jb20+IDwyMDA3MDkxNjExMDAwNC5lYjJjZDM0Mi5wYXRjaHdvcmtnaXJsQHdlYXZpbmdyYWluYm93LmNvbT4gPDExNkNBMjcwLTgzREQtNDhBNS1CMjE0LUE5MzgxMzQyRTI4RUBlYXJ0aGxpbmsubmV0Pg=="},"prevInTopic":30562,"nextInTopic":30567,"prevInTime":30563,"nextInTime":30565,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"-=-Maybe you can find a class of some kind just for him. My youngest daughter went to a nature center class - every weekday for 2 hours for three weeks. From","messageBody":"<div id=\"ygrps-yiv-438330483\">-=-Maybe you can find a class of some kind just for him. My youngest<br/>\ndaughter went to a nature center class - every weekday for 2 hours<br/>\nfor three weeks. From then on she would talk about, &quot;My Teacher,&quot;<br/>\nwith great pride, especially to her siblings and to neighborhood  <br/>\nkids.-=-<br/>\n<br/>\nHolly had a dance class and then she could talk about her teacher.   <br/>\nIt helped.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":141316284,"authorName":"Pamela Sorooshian","from":"Pamela Sorooshian &lt;pamsoroosh@...&gt;","profile":"psoroosh","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1189967858","msgId":30562,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDExNkNBMjcwLTgzREQtNDhBNS1CMjE0LUE5MzgxMzQyRTI4RUBlYXJ0aGxpbmsubmV0Pg==","inReplyToHeader":"PDIwMDcwOTE2MTEwMDA0LmViMmNkMzQyLnBhdGNod29ya2dpcmxAd2VhdmluZ3JhaW5ib3cuY29tPg==","referencesHeader":"PDExODk5NDY2MDkuMTEyMC41MjI1Lm00MEB5YWhvb2dyb3Vwcy5jb20+IDwyMDA3MDkxNjExMDAwNC5lYjJjZDM0Mi5wYXRjaHdvcmtnaXJsQHdlYXZpbmdyYWluYm93LmNvbT4="},"prevInTopic":30560,"nextInTopic":30564,"prevInTime":30561,"nextInTime":30563,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"... You don t have to worry about being under the radar in TX - even if he goes to school, all you have to do is give them a letter saying you re withdrawing","messageBody":"<div id=\"ygrps-yiv-313725113\">On Sep 16, 2007, at 9:00 AM, Jessica wrote:<br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; We had a request of our youngest 6yo DS last night & I was trying  <br/>\n&gt; to find out why he wants to try going to school... I&#39;d just rather  <br/>\n&gt; stay out of the district&#39;s radar since we live in TX where we don&#39;t  <br/>\n&gt; have to let the school district know if we&#39;re homeschooling unless  <br/>\n&gt; we&#39;re pulling our child(ren) from school...<br/>\n<br/>\n </span></blockquote>You don&#39;t have to worry about being under the radar in TX - even if  <br/>\nhe goes to school, all you have to do is give them a letter saying  <br/>\nyou&#39;re withdrawing him and there isn&#39;t any further reporting or  <br/>\nfollow-up.<br/>\n<br/>\nMaybe he wants to be special? With 3 older siblings, maybe he&#39;s  <br/>\nfeeling a little left out or lost in the shuffle of all the stuff  <br/>\nthey do?<br/>\n<br/>\nMaybe you can find a class of some kind just for him. My youngest  <br/>\ndaughter went to a nature center class - every weekday for 2 hours  <br/>\nfor three weeks. From then on she would talk about, &quot;My Teacher,&quot;  <br/>\nwith great pride, especially to her siblings and to neighborhood kids.<br/>\n<br/>\n-pam<br/>\n<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] Re: DD wants to try school","postDate":"1189960025","msgId":30560,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDlFNjQxQTIyLTU5ODQtNDQ1Ni05MTExLUU1RTRDQkE2NjU1NkBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PDIwMDcwOTE2MTEwMDA0LmViMmNkMzQyLnBhdGNod29ya2dpcmxAd2VhdmluZ3JhaW5ib3cuY29tPg==","referencesHeader":"PDExODk5NDY2MDkuMTEyMC41MjI1Lm00MEB5YWhvb2dyb3Vwcy5jb20+IDwyMDA3MDkxNjExMDAwNC5lYjJjZDM0Mi5wYXRjaHdvcmtnaXJsQHdlYXZpbmdyYWluYm93LmNvbT4="},"prevInTopic":30559,"nextInTopic":30562,"prevInTime":30559,"nextInTime":30561,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"-=He s been teaching himself how to read from stuff he does on the computer-=- This will undoubtedly seem picky to those who are new to unschooling, but big an","messageBody":"<div id=\"ygrps-yiv-1963669411\">-=He&#39;s been teaching himself how to read from stuff he does on the  <br/>\ncomputer-=-<br/>\n<br/>\nThis will undoubtedly seem picky to those who are new to unschooling,  <br/>\nbut big an obvious to others who have been doing it for a while.<br/>\n<br/>\nIf you think of that (and word it) as &quot;He&#39;s been learning to read  <br/>\nsome from stuff he does on the computer&quot; instead of &quot;teaching  <br/>\nhimself,&quot; it will create a small shift in your point of view and  <br/>\nsmall changes of direction early in the journey result in completely  <br/>\ndifferent destinations.<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/wordswords\">http://sandradodd.com/wordswords</a><br/>\nThe more we think of &quot;teaching&quot; the harder it is to see natural  <br/>\nlearning.<br/>\nThe more we think of &quot;learning,&quot; the more we see it.<br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":210117180,"authorName":"Jessica","from":"Jessica &lt;patchworkgirl@...&gt;","profile":"patchworkgirl57","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"4"},"subject":"Re: DD wants to try school","postDate":"1189958404","msgId":30559,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwOTE2MTEwMDA0LmViMmNkMzQyLnBhdGNod29ya2dpcmxAd2VhdmluZ3JhaW5ib3cuY29tPg==","inReplyToHeader":"PDExODk5NDY2MDkuMTEyMC41MjI1Lm00MEB5YWhvb2dyb3Vwcy5jb20+","referencesHeader":"PDExODk5NDY2MDkuMTEyMC41MjI1Lm00MEB5YWhvb2dyb3Vwcy5jb20+"},"prevInTopic":30553,"nextInTopic":30560,"prevInTime":30558,"nextInTime":30560,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"We had a request of our youngest 6yo DS last night & I was trying to find out why he wants to try going to school... I d just rather stay out of the district s","messageBody":"<div id=\"ygrps-yiv-1357650603\">We had a request of our youngest 6yo DS last night & I was trying to find out why he wants to try going to school... I&#39;d just rather stay out of the district&#39;s radar since we live in TX where we don&#39;t have to let the school district know if we&#39;re homeschooling unless we&#39;re pulling our child(ren) from school...<br/>\n<br/>\nI&#39;m trying to find out why R wants to go to school... is it friends? We can try to make some... There aren&#39;t very many kids in our neighborhood, but we&#39;re going to start going to the unschooling get togethers... perhaps he&#39;d like a backpack? Does he want homework or a little more formal school-at-home stuff? (when I mentioned this, he made a face, LOL!!) <br/>\n<br/>\nHe&#39;s been teaching himself how to read from stuff he does on the computer (dragonfable is one, he&#39;s been on starfall, neopets is another, maybe pardus, I can&#39;t think offhand what other sites he & his brothers have been to)... and occasionally goes through the little Bob Books we have and another learn to read book I found at a used bookstore and countless other books we have around the house & library books... <br/>\nHe picks them up or asks for them when the mood hits and tries to read from harry potter book 1... no pushing here... <br/>\n<br/>\nHis 3 older brothers attended school in another district from k-4 (twins now 12) and k-1 (now almost 10) and they&#39;ve been out of school for 2 years now... they can give him an idea what school was like for them...<br/>\n<br/>\nI told him that if he&#39;d like to, we can go take a walk around the school so he can see what it is like. I don&#39;t want to just plain say no, but to just explore what school is/means, etc... <br/>\n<br/>\nI suspect that he may miss homeschool co-op: we&#39;re not going this year because the co-op dissolved.  We do plan to start going to hang with the unschoolers (which is almost an hour away) so maybe that will help. <br/>\n<br/>\nOf my 4 boys, he&#39;s the only one who has been always unschooled... <br/>\n<br/>\n<blockquote><span title=\"ireply\"> &gt; I&#39;ve been unschooling my 8yo daughter since she was two and my 4yo <br/>\n&gt; since birth.  Last night they both decided that they wanted to go to <br/>\n&gt; school.  I&#39;m tempted to let Lauren (8yo) go for a day or a week so <br/>\n&gt; she could see how it is, but here are my concerns:<br/>\n<br/>\n </span></blockquote>Hope that helps? I&#39;m thinking we just need to make sure we hang out with other kids... things changed since last year (with the coop dissolving: he looked forward to that) so we need to see what to do this year, blah blah blah...<br/>\n<br/>\nCheers,<br/>\nJessica<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://weavingrainbow.com/blog\">http://weavingrainbow.com/blog</a></div>","specialLinks":[]},{"userId":247566989,"authorName":"Sandra Dodd","from":"Sandra Dodd &lt;Sandra@...&gt;","profile":"sandralynndodd","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] DD wants to try school","postDate":"1189957454","msgId":30553,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDhDM0ZDRjlFLTRFNUItNDc3MC04QjA0LTlDQTI3NTk5MEMxRUBzYW5kcmFkb2RkLmNvbT4=","inReplyToHeader":"PGZjaHYxMituaDFkQGVHcm91cHMuY29tPg==","referencesHeader":"PGZjaHYxMituaDFkQGVHcm91cHMuY29tPg=="},"prevInTopic":30550,"nextInTopic":30559,"prevInTime":30552,"nextInTime":30554,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"It seems you re looking more at school and at what they can t do than at them and what you all could be doing. -=-I ve been unschooling my 8yo daughter since","messageBody":"<div id=\"ygrps-yiv-290950320\">It seems you&#39;re looking more at school and at what they can&#39;t do than  <br/>\nat them and what you all could be doing.<br/>\n<br/>\n-=-I&#39;ve been unschooling my 8yo daughter since she was two and my 4yo<br/>\nsince birth. Last night they both decided that they wanted to go to<br/>\nschool-=-<br/>\n<br/>\nMy first temptation is to ask what you were doing with your older  <br/>\ndaughter before she was two.   Surely not &quot;Schooling&quot; her...  (unless  <br/>\nyou took her out of a structured daycare or something)...<br/>\n<br/>\nBut that&#39;s not important now.  It&#39;s important for you to think about,  <br/>\nI think, because maybe your definition and view of unschooling could  <br/>\nbe looked at and clarified.<br/>\n<br/>\nYou probably wouldn&#39;t be able to let her go to school for one day.<br/>\nIf you do decide to let them go to school, reading this might help:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/schoolchoice\">http://sandradodd.com/schoolchoice</a><br/>\n<br/>\n-=-Though she can read and do simple math, she walks around<br/>\ntelling everyone that she doesn&#39;t know how. I&#39;m concerned that one<br/>\nday with a school teacher will have CPS at my door.-=-<br/>\n<br/>\nIt won&#39;t take school enrollment to get attention, if she&#39;s walking  <br/>\naround telling people what she doesn&#39;t know.<br/>\n<br/>\n<br/>\nI think you might want to look at making your homelife way more  <br/>\ninteresting and busy so they won&#39;t want to go to school.  We can help  <br/>\nyou think of ways to do that.<br/>\n<br/>\nHere are other ideas:<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/nest\">http://sandradodd.com/nest</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/checklists\">http://sandradodd.com/checklists</a><br/>\n<br/>\nMaybe some of these pages will give you ideas, and if you&#39;re not  <br/>\ngetting out of the house at least two or three times a week to do  <br/>\ncool stuff, maybe schedule up some outings, quickly, and make your  <br/>\nunschooling life rich and exciting (which will, at the same time,  <br/>\nmake it work better).<br/>\n<br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/strewing\">http://sandradodd.com/strewing</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/arts\">http://sandradodd.com/arts</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/history\">http://sandradodd.com/history</a><br/>\n<a rel=\"nofollow\" target=\"_blank\" href=\"http://sandradodd.com/connections\">http://sandradodd.com/connections</a><br/>\n<br/>\nSandra<br/>\n<br/>\n[Non-text portions of this message have been removed]</div>","specialLinks":[]},{"userId":128961575,"authorName":"Vicki Dennis","from":"&quot;Vicki Dennis&quot; &lt;vicki@...&gt;","profile":"vickitexan2002","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] DD wants to try school","postDate":"1189926845","msgId":30550,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGM5Y2ExYmJhMDcwOTE2MDAxNHQ2YzQ2NTViM2oyZmFmMGVjNzE4YTE5MDYzQG1haWwuZ21haWwuY29tPg==","inReplyToHeader":"PGZjaHYxMituaDFkQGVHcm91cHMuY29tPg==","referencesHeader":"PGZjaHYxMituaDFkQGVHcm91cHMuY29tPg=="},"prevInTopic":30548,"nextInTopic":30553,"prevInTime":30549,"nextInTime":30551,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"On another list (or perhaps this one) more than one parent has stated in similar words  I am of the I don t let my children play in the street and I don t let","messageBody":"<div id=\"ygrps-yiv-15739568\">On another list (or perhaps this one) more than one parent has stated in<br/>\nsimilar words  &quot;I am of the I don&#39;t let my children play in the street and I<br/>\ndon&#39;t let them go to school opinion&quot;.<br/>\n<br/>\nMy opinion is that if she were older it would be appropriate to involve her<br/>\nmuch more in making the decision.  But 8 is barely past babyhood (says the<br/>\ngrandmother).     Frankly I would be more likely to let an 8 year old play<br/>\nin the street than attend a traditional &quot;school&quot;.     For me, the better<br/>\nline would be &quot;I don&#39;t send them to play in a toxic dump,  why would I allow<br/>\nthem to attend school?&quot;.<br/>\n<br/>\nvicki<br/>\n<br/>\nP.S.: By the way,  it is also my opinion (based on experience) that  barely<br/>\nreading at a first grade level  (whatever that is, blech) at age 8  makes<br/>\nit  more likely  that eventually she will be an extremely competent<br/>\nreader.............PROVIDED she is not pushed to &quot;improve&quot; before she is<br/>\nready.<br/>\n<br/>\n<blockquote><span title=\"qreply\"> On 9/15/07, Nicole LoBue &lt; <a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamalobue@...\">mamalobue@...</a>&gt; wrote:<br/>\n&gt;<br/>\n&gt;   My other concern is, what if she likes it? I&#39;m vehemently opposed to<br/>\n&gt; how children are taught in school and the mind control that goes on.<br/>\n&gt; It would not be okay with me to have her in school.<br/>\n&gt;<br/>\n&gt; Thoughts anyone?<br/>\n&gt;<br/>\n&gt; Nicole<br/>\n&gt;<br/>\n&gt;  _<br/>\n&gt;<br/>\n<br/>\n<br/>\n[Non-text portions of this message have been removed] </span></blockquote></div>","specialLinks":[]},{"userId":285625854,"authorName":"harmony","from":"&quot;=?iso-8859-1?Q?harmony?=&quot; &lt;harmony@...&gt;","profile":"harmonyhogan","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] DD wants to try school","postDate":"1189911762","msgId":30548,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PDIwMDcwOTE2MDMwMjQyLjEwNDE2LnFtYWlsQHNlcnZlcjMxNi5jb20+"},"prevInTopic":30547,"nextInTopic":30550,"prevInTime":30547,"nextInTime":30549,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"I agree with the last answer that you should find out why she wants to go to school.  My kids wanted to go also when they were younger because I worked in a","messageBody":"<div id=\"ygrps-yiv-809704572\">I agree with the last answer that you should find out why she wants to go to school.  My kids wanted to go also when they were younger because I worked in a daycare and all their friends went to school and talked about how fun it was.<br/>\n<br/>\nI have heard of homeschool groups playing school.  Either making if boring and controlling so the kids see that it isn&#39;t fun or the kids might really like the structure and think it&#39;s fun.  If they like it, you could have a group of other interested kids and &quot;do school&quot; once a week or whenever.  <br/>\n<br/>\nThe bus is always exciting to lots of kids too.  You can go for a ride on the public transportation if you have any in your town so they can ride a bus.<br/>\n<br/>\nIt would really depend on your dd&#39;s reason for wanting to go.<br/>\n<br/>\n<br/>\n<blockquote><span title=\"qreply\"> &gt;  -------Original Message-------<br/>\n&gt;  From: Nicole LoBue &lt;<a rel=\"nofollow\" target=\"_blank\" href=\"mailto:mamalobue@...\">mamalobue@...</a>&gt;<br/>\n&gt;  Subject: [AlwaysLearning] DD wants to try school<br/>\n&gt;  Sent: Sep 15 &#39;07 6:57pm<br/>\n&gt;  <br/>\n&gt;  Hi there,<br/>\n&gt;  <br/>\n&gt;  I think I&#39;ve been a member of this group for years but forgot about<br/>\n&gt;  it and haven&#39;t posted in a very long time.<br/>\n&gt;  <br/>\n&gt;  I&#39;ve been unschooling my 8yo daughter since she was two and my 4yo<br/>\n&gt;  since birth. Last night they both decided that they wanted to go to<br/>\n&gt;  school. I&#39;m tempted to let Lauren (8yo) go for a day or a week so<br/>\n&gt;  she could see how it is, but here are my concerns:<br/>\n&gt;  <br/>\n&gt;  She barely reads at a first grade level and her math skills are the<br/>\n&gt;  same. Though she can read and do simple math, she walks around<br/>\n&gt;  telling everyone that she doesn&#39;t know how. I&#39;m concerned that one<br/>\n&gt;  day with a school teacher will have CPS at my door. I like to stay<br/>\n&gt;  under the radar.<br/>\n&gt;  <br/>\n&gt;  My other concern is, what if she likes it? I&#39;m vehemently opposed to<br/>\n&gt;  how children are taught in school and the mind control that goes on.<br/>\n&gt;  It would not be okay with me to have her in school.<br/>\n&gt;  <br/>\n&gt;  Thoughts anyone?<br/>\n&gt;  <br/>\n&gt;  Nicole<br/>\n&gt;  <br/>\n&gt; </span></blockquote></div>","specialLinks":[]},{"userId":287815876,"authorName":"Robyn L. Coburn","from":"&quot;Robyn L. Coburn&quot; &lt;dezigna@...&gt;","profile":"designarob","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"12"},"subject":"Re: [AlwaysLearning] DD wants to try school","postDate":"1189907566","msgId":30547,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PERCQTdDODYwRjU4OTQ0NTM5REEyODREREQyNTExQzAwQFJvYnluUEM+","inReplyToHeader":"PGZjaHYxMituaDFkQGVHcm91cHMuY29tPg==","referencesHeader":"PGZjaHYxMituaDFkQGVHcm91cHMuY29tPg=="},"prevInTopic":30546,"nextInTopic":30548,"prevInTime":30546,"nextInTime":30548,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"... Before anything else, why does Lauren want to try school? What does she feel she will get from school that she is not getting now? I m guessing, perhaps","messageBody":"<div id=\"ygrps-yiv-1448924032\">&lt;&lt;&lt;&lt;&gt; I&#39;ve been unschooling my 8yo daughter since she was two and my 4yo<br/>\n<blockquote><span title=\"ireply\"> &gt; since birth.  Last night they both decided that they wanted to go to<br/>\n&gt; school.  I&#39;m tempted to let Lauren (8yo) go for a day or a week so<br/>\n&gt; she could see how it is, &gt;&gt;&gt;<br/>\n<br/>\n </span></blockquote>Before anything else, why does Lauren want to try school? What does she feel <br/>\nshe will get from school that she is not getting now?<br/>\n<br/>\nI&#39;m guessing, perhaps incorrectly, that the younger is asking for school to <br/>\nbe like big sister, so I guess focussing on Lauren&#39;s reasons would be my <br/>\nfirst concern.<br/>\n<br/>\nRobyn L. Coburn</div>","specialLinks":[]},{"userId":131147286,"authorName":"Nicole LoBue","from":"&quot;Nicole LoBue&quot; &lt;mamalobue@...&gt;","profile":"mamalobue","replyTo":"LIST","spamInfo":{"isSpam":false,"reason":"6"},"subject":"DD wants to try school","postDate":"1189904226","msgId":30546,"canDelete":false,"contentTrasformed":false,"systemMessage":false,"headers":{"messageIdInHeader":"PGZjaHYxMituaDFkQGVHcm91cHMuY29tPg=="},"prevInTopic":0,"nextInTopic":30547,"prevInTime":30545,"nextInTime":30547,"topicId":30546,"numMessagesInTopic":0,"msgSnippet":"Hi there, I think I ve been a member of this group for years but forgot about it and haven t posted in a very long time. I ve been unschooling my 8yo daughter","messageBody":"<div id=\"ygrps-yiv-1083355603\">Hi there,<br/>\n<br/>\nI think I&#39;ve been a member of this group for years but forgot about <br/>\nit and haven&#39;t posted in a very long time.<br/>\n<br/>\nI&#39;ve been unschooling my 8yo daughter since she was two and my 4yo <br/>\nsince birth.  Last night they both decided that they wanted to go to <br/>\nschool.  I&#39;m tempted to let Lauren (8yo) go for a day or a week so <br/>\nshe could see how it is, but here are my concerns:<br/>\n<br/>\nShe barely reads at a first grade level and her math skills are the <br/>\nsame.  Though she can read and do simple math, she walks around <br/>\ntelling everyone that she doesn&#39;t know how.  I&#39;m concerned that one <br/>\nday with a school teacher will have CPS at my door.  I like to stay <br/>\nunder the radar.<br/>\n<br/>\nMy other concern is, what if she likes it?  I&#39;m vehemently opposed to <br/>\nhow children are taught in school and the mind control that goes on.  <br/>\nIt would not be okay with me to have her in school.<br/>\n<br/>\nThoughts anyone?<br/>\n<br/>\nNicole</div>","specialLinks":[]}],"prevTopicId":41306,"nextTopicId":41372}}